{
    "id": "75857510-dfba-48c7-a3e6-53fda5ab5bf8",
    "created_at": "2023-01-12T15:04:59.360039Z",
    "updated_at": "2025-03-27T02:16:53.002413Z",
    "deleted_at": null,
    "sha1_hash": "a644f65e54aac4438dce3e8d08fd881ea9d3d2ec",
    "title": "2022-11-21 - Black Friday Alert- 4 Emerging Skimming Attacks to Watch for This Holiday Season",
    "authors": "",
    "file_creation_date": "2022-11-28T19:09:54Z",
    "file_modification_date": "2022-11-28T19:09:54Z",
    "file_size": 3277228,
    "plain_text": "# Black Friday Alert: 4 Emerging Skimming Attacks to Watch for This Holiday Season\n\n**[zscaler.com/blogs/security-research/black-friday-scams-4-emerging-skimming-attacks-watch-holiday-season](https://www.zscaler.com/blogs/security-research/black-friday-scams-4-emerging-skimming-attacks-watch-holiday-season)**\n\n## Summary\n\nAt Zscaler ThreatLabz, we have been closely monitoring web threats such as payment card\nskimming attacks against e-commerce stores. Starting in July 2022, we have observed an\nincrease in such activity targeted against Magento and Presta Shop e-commerce stores.\n\nWith Black Friday and the holiday season approaching, it is expected that there will be an\nincrease in online shopping activity among users as they rush to take advantage of various\ndiscount offers. These holiday shopping trends make skimming attacks even more lucrative\nfor threat actors as they can increase their success rate of stealing payment card details of\nvictims.\n\nIn this blog, we will share details of 4 groups of skimming attacks that have very little to no\ndocumentation in the public domain. Most of the indicators related to these attacks have no\ndetection by security vendors. We have shared the complete list of IOCs.\n\nBased on our observation, e-commerce stores in the US, UK, Australia, and Canada were\nprimarily targeted by these threat actors. Most of the attacks we observed have a shelf life\nof more than 1 month.\n\n## Key points\n\n\n-----\n\nPayment card skimming attacks continue to pose a prevalent threat to e-commerce\nstores.\n\nMagento and Presta-based e-commerce stores in US, UK, Australia and Canada\nwere primarily targeted since July 2022\n\nThese skimming campaigns have a long shelf life and manage to keep their malicious\nactivities under the radar for several months.\n\nNew variants of skimming attacks rely on heavy use of JavaScript obfuscation which\nmakes detection more difficult.\n\nAn increase in web-based threats such as CC skimming around the holiday season\ncan be expected since threat actors prey on unsuspecting shoppers' increased activity\nduring this time.\n\n## Technical analysis\n\n**Group 1**\n\nIn August and September 2022, we observed a new CC skimmer in-the-wild in low-volume\nattacks against Magento e-commerce websites. The JavaScript skimmer code was hosted\non attacker-registered domains and the link to these skimmers was injected in the\ncompromised e-commerce sites.\n\nWe identified 2 unique domains used in this attack by the threat actor. Interestingly, both\nthese domains would redirect the user to the legit nodeJS website when accessed directly.\nIt is worth noting that both these domains have very little to no detection on VirusTotal which\nindicates that the threat actor was able to stay under the radar.\n\n_Figure 1: Very low detection of skimmer-related malicious domains_\n\n\n-----\n\nDuring the course of tracking this threat actor, we noticed two variants of skimmer code\nused. One of them was obfuscated and included some additional functionalities. We'll\ndiscuss both variants here.\n\n**Variant 1**\n\nThis CC Skimmer is hosted at the URL: hxxps://modersecure[.]com/sources.200x/googleanalytics.js\n\nBelow are the main functionalities of this skimmer:\n\n1. Uses the setInterval() function to check every 1.5 seconds whether the current URL\ncontains the string \"/checkout/#payment\". This string corresponds to the checkout page of\nthe compromised e-commerce store and indicates that the user is ready to purchase the\nitems added to the cart.\n\n2. Calls the findBtnAddAction() function which uses HTML DOM to locate the payment\nbutton on the page. It then adds an event listener for this button which activates as soon as\nthe user clicks it.\n\n3. Event Listener calls the sendCardData() function which further calls the getCardData()\nfunction to retrieve the payment card data information. This information will be base64encoded and sent to the attacker's data exfiltration URL. In this case it is:\nmodersecure[.]com/sources.200x/analytic.php. The info is exfiltrated using\nnavigator.sendBeacon() function which sends an HTTP POST request\n\n**Collection of payment card information**\n\nInformation about the payment card will be collected and stored in the following key-value\npair structure.\n\n{\n'number_key': cardNumber,\n\n'exp_key': cartExp,\n\n'cvc_key': cvv\n\n}\n\nThe method used to collect the payment card information is customized according to the\ntargeted e-commerce store.\n\nBelow are a few examples.\n\n**Stripe payment**\n\nCode searches for the following elementIDs in the web page to locate the card number,\nexpiry date, and cvv code if Stripe payment processor is being used.\n\n\n-----\n\nstripe-payments-card-numbers\nstripe-payments-card-expirys\n\nstripe-payments-card-cvcs\n\n**Moneris payment**\n\nIn cases where e-commerce stores in Canada were compromised, the skimmer code\nsearched for Moneris payment information. Moneris is a popular Canada-based payment\nprocessing company and often used as a payment gateway on Canada-based Magento ecommerce stores.\n\nFigure 2 shows the relevant skimmer code searching for Moneris payment info\n\n_Figure 2: Group 1 skimmer code_\n\n**Variant 2**\n\nThis second variant of the CC skimmer code was obfuscated and hosted at the URL:\nartmodecssdev[.]art/js/av/analytics-google-c82qllg46bw1g23ed2775c5fr9fa.js\n\nMost of the functionality is similar to the first variant with some enhancements included.\n\n**Key functionalities**\n\n1. Searches for the string: \"/checkout/\" in the URL to ensure the user is at the checkout\npage\n\n2. Searches for the string: \"f04bf6162ed8779acc1205ac37f8fc4a\" in the cookie. If it is not\nfound, then it indicates the user is a new victim.\n\n\n-----\n\n3. Once both the above conditions are satisfied, the skimmer is activated.\n4. Navigates the HTML DOM to locate the shipping and item related information about the\norder.\n\n5. Uses the HTML DOM to locate the payment card information related to Moneris\n\n6. Exfiltrates the information using the pixtar() function which creates an image tag and sets\nthe source to the exfiltration URL: artmodecssdev[.]art/secure/av/secure.php. After\nexfiltration, it sets the cookie \"f04bf6162ed8779acc1205ac37f8fc4a\" to the uuid. This uuid\nis generated by the script client-side.\n\nFigure 3 shows the data exfiltration function.\n\n_Figure 3: Group 1 skimmer code exfiltrating stolen information_\n\n**Group 2**\n\nIn May 2022, a new domain - payment-analytics[.]info was registered and used in a\nskimming attack against several Magento and PrestaShop-based e-commerce stores.\nInterestingly, this domain was hosted on the IP address: 45.61.136[.]218 which is in the\nsame subnet as 45.61.136.204 (an IP address previously used by Lazarus APT group). We\ndo not have sufficient information at this point to do any attribution for this campaign.\n\nFigure 4 shows the JavaScript skimming code for Magento e-commerce store.\n\n\n-----\n\n_Figure 4: Group 2 CC skimmer_\n\nThe skimming code itself is straightforward. It captures the credit card information by\nsearching for HTML fields corresponding to the payment processor used by the targeted\nstore (in this case - Authorize.Net). The collected information is exfiltrated by sending an\nHTTP POST request to payment-analytics[.]info/validate/<random_id>\n\n**Key functionalities**\n\n1. Adds an event listener for the click event on \"place order\" button by locating the HTML\nbutton element with id and class: \"#co-payment-form button.action.checkout.primary\".\nFigure 5 shows the corresponding elements on the checkout page.\n\n\n-----\n\n_Figure 5: Relevant elements tracked by the skimmer on the checkout page_\n\n2. Fetches the payment card information using document.querySelector() depending on the\npayment processor used by the targeted store\n\n3. Sends a GET request to the REST API endpoint: \"/rest/default/V1/guest-carts/\" to\nretrieve value of \"billing_address\" member which corresponds to shipping information\nentered by the victim\n\n4. Extracts key info from billing_address, appends it to the payment card information and\nsends it to the attacker's server using an HTTP POST request.\n\n**Group 3**\n\nIn July 2022, we observed a threat actor actively compromising Magento-based ecommerce stores and injecting script tags pointing to the skimmer code hosted on attackerregistered domains. Each skimmer code snippet was customized with the name of the\ntargeted store and the type of payment processor used.\n\n[There is very limited information available about it in the public domain here.](https://twitter.com/sansecio/status/1545159974254362626)\n\nBased on Zscaler cloud telemetry, we were able to identify several previously\nundocumented domains used in this skimming campaign and the associated infrastructure.\n\nFigure 6 shows that most of the domains used in this campaign are still undetected on\nVirusTotal which explains the long shelf life of this campaign.\n\n\n-----\n\n_Figure 6: Group 3 related skimmer domains undetected on VirusTotal_\n\nIn this campaign, we observed two variants. The first variant was straightforward and not\nobfuscated. At a later stage of the campaign in October 2022, we observed an obfuscated\nversion of the skimmer hosted on a domain controlled by the same threat actor.\n\n**Key functionalities**\n\nWe will briefly describe each of these skimmers' functionalities.\n\n**Variant 1**\n\nUnlike the other skimmers discussed in this blog so far, this specific variant did not check\nwhether the user is on the payment checkout page.\n\nIt used the HTML DOM to locate the HTML fields corresponding to payment card\ninformation. The specific values it searches to locate the information would depend on the\ntype of payment processor used by the targeted store. This information was concatenated\nalong with the user's details, base64-encoded and exfiltrated to the attacker's server. The\nexfiltration URI path remained consistent across all the skimmers in this campaign.\n\nURI path: \"redirect-non-site.php?datasend=\"\n\nFigure 7 shows the skimmer code.\n\n\n-----\n\n_Figure 7: Group 3 skimmer code_\n\n**Variant 2**\n\nThe only difference between this variant and variant 1 is obfuscation. We saw new activity\nfrom this threat actor in October 2022 when they started using an obfuscated version of the\nskimmer.\n\n**Group 4**\n\nIn November 2022, we observed a threat actor injecting highly obfuscated variants of\nJavaScript skimmer in existing legitimate jQuery libraries on various Magento-based ecommerce stores.\n\nWe noticed 2 unique domains used for exfiltration of the payment card information. Both of\nthese domains still have 0 detections on VirusTotal and the e-commerce stores are still\ninfected at the time of publishing this blog as well.\n\n\n-----\n\n_Figure 8: Group 4 related skimmer domains undetected on VirusTotal_\n\nAs is evident from the domain names, they impersonate as content delivery networks\n(CDNs) in order to blend in with legitimate traffic and this makes them even more difficult to\ndetect at network layer.\n\nFor the purpose of technical analysis, we will take an example of an obfuscated JS skimmer\nwhich was injected in the path:\n/skin/frontend/alobencher/default/js/lib/elevatezoom/jquery.elevateZoom-3.0.8.min.js on a\ncompromised store as shown in Figure 9.\n\n_Figure 9: Skimmer code injected in a legitimate jQuery library on the e-commerce store_\nWhen the user navigates to the checkout page on the compromised e-commerce store to\npurchase the goods, the malicious JavaScript skimmer function - _0x54d008() is invoked as\nsoon as the user enters and submits the payment card information. Figure 10 illustrates\nthis.\n\n\n-----\n\n_Figure 10: Event listener in injected skimmer code corresponding to payment submission_\n_form_\n\nKey functionalities of the skimmer are described below.\n\n1. The skimmer locates the payment button using the pattern \"*\n\n[onclick*=\\\"payment.save()\\\"]\" and adds an event listener for the click event.\n\n2. The exfiltration function is invoked as soon as the above button is clicked.\n\n3. Unlike the skimmers discussed earlier, in this case, it extracts all the input fields using:\njQuery(\"body input, body select, body option\"). This way the skimmer can access all the\ninput, select and option fields on the web page.\n\n4. All this collected information is base64-encoded and stored in the variable payment[string] to send to the exfiltration URL using an HTTP POST request.\n\n5. The exfiltration URL in this case is: cdn-common[.]com/default/loading.gif\n\nFigure 11 shows the state of key variables in the _0x54d008() function at the time of\nexfiltration.\n\n\n-----\n\n_Figure 11: CC skimmer in action_\n\n## Zscaler detection status\n\nZscaler’s multilayered cloud security platform detects indicators at various levels, as seen\nhere:\n\n[JS.POS.Magecart](https://threatlibrary.zscaler.com/?keyword=JS.POS.Magecart)\n\n## Conclusion\n\nUsers are advised to exercise caution while shopping online during this holiday season as\nthreat actors are actively targeting e-commerce stores for financial data theft.\n\nWe advise the users to pay close attention to any unauthorised payments made using their\npayment card and get in touch immediately with their respective payment card or banking\nauthorities in case they notice unrecognized transactions.\n\nIf you are an e-commerce store owner, we advise you to ensure that you are running the\nlatest version of e-commerce software (Magento, Presta Shop, etc.). Also, to confirm\nwhether your store has already been infected or not, e-commerce store owners are advised\nto scan their server for any unrecognised new files or modifications to existing files.\n\nThe Zscaler ThreatLabz team will continue to monitor such skimming attacks proactively, to\nhelp keep our customers safe.\n\n\n-----\n\n## Indicators of Compromise\n\n**Group 1**\n\n**Domains**\n\nmodersecure[.]com\n\nartmodecssdev[.]art\n\n**Injected JS URLs**\n\nmodersecure[.]com/sources.200x/google-analytics.js\n\nmodersecure[.]com/sources.155x/analytics.js\n\nartmodecssdev[.]art/js/av/analytics-google-c82qllg46bw1g23ed2775c5fr9fa.js\n\n**Exfil URLs**\n\nmodersecure[.]com/sources.200x/analytic.php\n\nartmodecssdev[.]art/secure/av/secure.php\n\n**Group 2**\n\n**Domains**\n\npayment-analytics[.]info\n\n**Injected JS URL**\n\npayment-analytics[.]info/assets/domains/62ae9da17edb100b96c9df7b/analytics.js\n\n**Exfil URL**\n\npayment-analytics[.]info/validate/62b3bb447edb100b96c9e6c5\n\n**Group 3**\n\nmozillajs[.]biz\n\ndevjs[.]biz\n\nhtml5decode[.]com\n\nmagento-cloud[.]net\n\nmozillajs[.]net\n\njava-cloud[.]net\n\nmagento-cloud[.]com\n\njava-cloud[.]org\n\n\n-----\n\nmagento-cloud[.]org\nhtml5decode[.]biz\n\njava-cloud[.]biz\n\nmagento-cloud[.]biz\n\nstirepoint.com\n\nhtml5decode[.]net\n\nmozillajs[.]org\n\nhtml5decode[.]org\n\n**Group 4**\n\n**Domains**\n\ncdn-webcloud[.]com\n\ncdn-common[.]com\n\ncdn-webhub[.]com\n\ncdn-fonts[.]com\n\ncdn-mediacloud[.]com\n\n**Exfil URLs**\n\ncdn-webcloud[.]com/default/loading.gif\n\ncdn-common[.]com/default/loading.gif\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-21 - Black Friday Alert- 4 Emerging Skimming Attacks to Watch for This Holiday Season.pdf"
    ],
    "report_names": [
        "2022-11-21 - Black Friday Alert- 4 Emerging Skimming Attacks to Watch for This Holiday Season.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535899,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1669662594,
    "ts_modification_date": 1669662594,
    "files": {
        "pdf": "https://archive.orkl.eu/a644f65e54aac4438dce3e8d08fd881ea9d3d2ec.pdf",
        "text": "https://archive.orkl.eu/a644f65e54aac4438dce3e8d08fd881ea9d3d2ec.txt",
        "img": "https://archive.orkl.eu/a644f65e54aac4438dce3e8d08fd881ea9d3d2ec.jpg"
    }
}