{
    "id": "75b3b34c-cf35-42b7-8426-18fec370bd2d",
    "created_at": "2023-01-12T15:02:20.992638Z",
    "updated_at": "2025-03-27T02:09:18.782439Z",
    "deleted_at": null,
    "sha1_hash": "df46226e631e9a784d92ca7231b3d5a6bcd67435",
    "title": "2022-03-30 - Phishing campaign targets Russian govt dissidents with Cobalt Strike",
    "authors": "",
    "file_creation_date": "2022-05-28T23:46:51Z",
    "file_modification_date": "2022-05-28T23:46:51Z",
    "file_size": 714903,
    "plain_text": "# Phishing campaign targets Russian govt dissidents with Cobalt Strike\n\n**[bleepingcomputer.com/news/security/phishing-campaign-targets-russian-govt-dissidents-with-cobalt-strike/](https://www.bleepingcomputer.com/news/security/phishing-campaign-targets-russian-govt-dissidents-with-cobalt-strike/)**\n\nBill Toulas\n\nBy\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nMarch 30, 2022\n09:05 AM\n0\n\n\n-----\n\nA new spear phishing campaign is taking place in Russia targeting dissenters with opposing\nviews to those promoted by the state and national media about the war against Ukraine.\n\nThe campaign targets government employees and public servants with emails warning of the\nsoftware tools and online platforms that are forbidden in the country.\n\nThe messages come with a malicious attachment or link embedded in the body that is\ndropping a Cobalt Strike beacon to the recipient's system, enabling remote operators to\nconduct espionage on the target.\n\nThe campaign's discovery and subsequent reporting come from threat analysts at\n[Malwarebytes Labs, who have managed to sample several of the bait emails.](https://blog.malwarebytes.com/threat-intelligence/2022/03/new-spear-phishing-campaign-targets-russian-dissidents/)\n\n## Multiple phishing pathways\n\nThe phishing emails pretend to be from a Russian state entity, a ministry, or a federal\nservice, to entice recipients to open the attachment.\n\nThe \"Ministry of Information Technologies and Communications of the Russian Federation\"\nand the \"Ministry of Digital Development, Communications, and mass communications\" are\nthe primary two spoofed entities.\n\nThe threat actors use three different file types to infect their targets with Cobalt Strike,\nnamely RTF (rich text format) files, archive attachments of documents laced with malicious\ndocuments, and download links embedded in the email body.\n\nThe case of the RTFs is the most interesting due to involving the exploitation of CVE-202140444, a remote code execution flaw in the rendering engine used by Microsoft Office\ndocuments\n\n\n-----\n\n**RTF file triggering the rendering engine exploit** _(Malwarebytes)_\nAs is to be expected, all of the phishing emails are written in Russian, and they seem to have\nbeen crafted by native speakers of the language and not machine translated, suggesting that\nthe campaign is endeavor from a Russian-speaking actor.\n\nApart from Cobalt Strike, Malwarebytes also noticed parallel attempts to deploy a heavily\nobfuscated PowerShell-based remote access trojan (RAT) with next-stage payload fetching\ncapabilities.\n\n## Crackdown on dissidents\n\nThe targets of this campaign work mainly in the Russian government and public agencies,\nincluding the following entities:\n\nPortal of authorities of the Chuvash Republic Official Internet portal\nRussian Ministry of Internal Affairs\nministry of education and science of the Republic of Altai\nMinistry of Education of the Stavropol Territory\nMinister of Education and Science of the Republic of North Ossetia-Alania\nGovernment of Astrakhan region\nMinistry of Education of the Irkutsk region\nPortal of the state and municipal service Moscow region\nMinistry of science and higher education of the Russian Federation\n\nThe above organizations indicate that the phishing actors target individuals who hold key\npositions and could cause problems to the central government by instigating war-opposing\nmovements.\n\n\n-----\n\nThe so-called special operation in Ukraine hasn t unfolded the way Kremlin had envisioned,\nand western sanctions manifested on a scale way beyond what was accounted for, so this\ncampaign may be the result of the higher government ramping up its alertness\nagainst [potential coups.](https://www.washingtonpost.com/outlook/2022/03/10/putin-coup-russia-siloviki/)\n\nThis is a very likely explanation of why Russia-based hackers are interested in conducting\nespionage against semi-high ranking government officials and ministry employees, but at this\ntime, it's just an assumption.\n\nMalwarebytes has mapped the infrastructure used by the threat actor(s) behind the latest\ncampaign and will continue to monitor the associated activity.\n\n### Related Articles:\n\n[Russian hackers perform reconnaissance against Austria, Estonia](https://www.bleepingcomputer.com/news/security/russian-hackers-perform-reconnaissance-against-austria-estonia/)\n\n[Ukraine warns of “chemical attack” phishing pushing stealer malware](https://www.bleepingcomputer.com/news/security/ukraine-warns-of-chemical-attack-phishing-pushing-stealer-malware/)\n\n[New Bumblebee malware replaces Conti's BazarLoader in cyberattacks](https://www.bleepingcomputer.com/news/security/new-bumblebee-malware-replaces-contis-bazarloader-in-cyberattacks/)\n\n[Russian hackers compromise embassy emails to target governments](https://www.bleepingcomputer.com/news/security/russian-hackers-compromise-embassy-emails-to-target-governments/)\n\n[Russian govt impersonators target telcos in phishing attacks](https://www.bleepingcomputer.com/news/security/russian-govt-impersonators-target-telcos-in-phishing-attacks/)\n\n[Bill Toulas](https://www.bleepingcomputer.com/author/bill-toulas/)\n\nBill Toulas is a technology writer and infosec news reporter with over a decade of experience\nworking on various online publications. An open source advocate and Linux enthusiast, is\ncurrently finding pleasure in following hacks, malware campaigns, and data breach incidents,\nas well as by exploring the intricate ways through which tech is swiftly transforming our lives.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-30 - Phishing campaign targets Russian govt dissidents with Cobalt Strike.pdf"
    ],
    "report_names": [
        "2022-03-30 - Phishing campaign targets Russian govt dissidents with Cobalt Strike.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535740,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653781611,
    "ts_modification_date": 1653781611,
    "files": {
        "pdf": "https://archive.orkl.eu/df46226e631e9a784d92ca7231b3d5a6bcd67435.pdf",
        "text": "https://archive.orkl.eu/df46226e631e9a784d92ca7231b3d5a6bcd67435.txt",
        "img": "https://archive.orkl.eu/df46226e631e9a784d92ca7231b3d5a6bcd67435.jpg"
    }
}