{
    "id": "75b3b1a6-cc3d-4fc2-bf1e-8c493342cfb0",
    "created_at": "2023-01-12T15:09:15.227113Z",
    "updated_at": "2025-03-27T02:05:24.484389Z",
    "deleted_at": null,
    "sha1_hash": "d36a867c97be13c5014ea193439d35f5454a48d7",
    "title": "2019-12-04 - How to Respond to Emotet Infection (FAQ)",
    "authors": "",
    "file_creation_date": "2022-05-28T19:01:32Z",
    "file_modification_date": "2022-05-28T19:01:32Z",
    "file_size": 1727330,
    "plain_text": "# JPCERT Coordination Center official Blog\n\n**blogs.jpcert.or.jp/en/2019/12/emotetfaq.html**\n\n佐條 [研(Ken Sajo)](https://blogs.jpcert.or.jp/en/sajo/)\n\nDecember 4, 2019\n\n## How to Respond to Emotet Infection (FAQ)\n\n[Emotet](https://blogs.jpcert.or.jp/en/tags/emotet/)\n\n[Email](http://10.10.0.46/mailto:?subject=How%20to%20Respond%20to%20Emotet%20Infection%20%28FAQ%29&body=https%3A%2F%2Fblogs.jpcert.or.jp%2Fen%2F2019%2F12%2Femotetfaq.html)\n\nSince October 2019, there has been a growing number of Emotet infection cases in Japan.\nJPCERT/CC issued a security alert as follows:\n\nAlert Regarding Emotet Malware Infection\n\n[https://www.jpcert.or.jp/english/at/2019/at190044.html](https://www.jpcert.or.jp/english/at/2019/at190044.html)\n\nThe purpose of this entry is to provide instructions on how to check if you are infected with\nEmotet and what you can do in case of infection (based on the information available as of\nDecember 2019). If you are not familiar with the detailed investigation methods described\nhere, it is recommended that you consult with security vendors who can assist you.\n\n### We have been informed of emails impersonating someone. What can we do?\n\nWhen suspicious email impersonating someone with an attachment is received, it is possible\nthat either of the following events has occurred:\n\nA) The device that uses the sender’s account is infected with Emotet, and information about\nemails and contact list have been stolen.\n\nB) Partners and users (with whom you have exchanged emails) have been infected with\nEmotet, and their contact list has been stolen. (The recipients of the malicious email have not\nbeen infected with Emotet, but the email address has been added to the lists of recipients.)\n\nIf the email referring to an actual message body (Figure 1) is received, the device that uses\nthe sender’s email account is likely to be infected (case A).\n\n\n-----\n\nFigure 1：Example of Emotet email in reply to an existing thread (A)\n\n\n-----\n\nIn case of an email as in Figure 2, it is assumed that the email is auto-generated to disguise\nitself as a reply to a thread. Both A) and B) can apply to this case, and it is unclear whether\nthe device that uses the email account is infected or not.\n\nFigure 2：Example of email disguising as a reply (B)\n\n### What can we do to check whether we are infected with Emotet or not?\n\n(Updated on 6 February, 2020)\n\n\n-----\n\nJPCERT/CC released a tool EmoCheck to check whether a device is infected with Emotet.\nSee below for instruction.\n\n1. Check Emotet infection with EmoCheck\n\n1-1.Download EmoCheck\n\nPlease download EmoCheck from the following website and copy it to the device that is\nsuspected of being infected. Please choose emocheck_x86.exe or emocheck_x64.exe\ndepending on the device. (If you are not sure which to use, choose emocheck_x86.exe.)\n\nJPCERTCC/EmoCheck - GitHub\n[https://github.com/JPCERTCC/EmoCheck/releases](https://github.com/JPCERTCC/EmoCheck/releases)\n\n1-2.Execute EmoCheck\n\nExecute the tool using the Command Prompt or PowerShell.\n(Note: If you execute the program by double-clicking, it will be blocked by Windows Defender\nSmart Screen as it does not have a Code Signing Certificate. We are now working to rectify\nthe issue in the next release.)\nIf you see the message “[!!] Detected” as follows, your device is infected with Emotet.\n\nFigure 5: Emotet infection detected by EmoCheck\n\nThe result is also exported in .txt file in the folder where EmoCheck was executed.\n\n\n-----\n\nFigure 6: Emotet result output\n\nIf you see the message “No detection.”, your device is not infected with Emotet.\n\n\n-----\n\nFigure 7: Emotet infection not detected\n\n1-3. How to deal with the infection\n\nIf an infection has been found in your environment, you can deactivate the malware by either\nof the following ways:\n\nOn Explorer, open the “image path” folder which is shown in the EmoCheck result and delete\nthe executable file in the folder.\n\n\n-----\n\nFigure 8: Image path that stores Emotet (example)\n\nLaunch Task Manager, and in the “details” tab, choose the process ID which corresponds to\nthe process shown in the EmoCheck result. Click “End Process”.\n\nFigure 9: Choose Process ID\n\nIf you are not able to confirm Emotet infection with EmoCheck, please follow the below\ninstruction to confirm.\n\n1 Confirm with the impersonated person\n\n\n-----\n\nCheck whether the person opened the suspicious attachment and saw the messages in the\nsample screenshots (See Reference “The screenshots of the attached Word file”). If they\nhave seen one of the messages, check whether the macro is enabled on their device. If the\nmacro is enabled, it is possible that the device is infected with malware.\n\n2. Perform the scan with anti-virus software\n\nPerform device scan with the latest anti-virus signatures.\n*Emotet has many variants, and even the latest signatures may not be able to detect\ninfection for a few days. No detection does not necessarily mean no infection. It is\nrecommended to update the signatures and conduct the scan regularly.\n\n3. Check auto-start settings\n\nEmotet has several methods for maintaining persistence such as setting auto-start registry\nkeys, save the payload into Startup folder, etc.\nCheck the following settings and confirm that suspicious file or setting does not exist.\n\n[Typical Windows OS auto-start settings]\n\nAuto-start registry [*1]\nTask Scheduler\nService\nStartup folder\n\n(*1) HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\n[Folders that Emotet is likely to be located]\n\nFolders under C:\\Users(username)\\AppData\\Local\\\nC:\\ProgramData\\\nC:\\Windows\\system32\\\nC:\\\nC:\\Windows\nC:\\Windows\\Syswow64\n\n*If there is a suspicious executable file under C:\\ProgramData\\ that is registered in the Task\nScheduler, it is likely that the device is also infected with Trickbot.\n\n\n-----\n\nFigure 3: Example of Emotet registered in the Auto-start Registry [*1]\n\n(*Folder names and executable file names are randomly created for each device.)\n\n4. Check email server log\n\nCheck the following points in your email server logs:\n\nHigh volume of impersonating emails whose HeaderFrom and EnvelopFrom do not\nmatch\nUnusual increase in the volume of outbound emails\nHigh volume of emails with a Word file attachment\n\n5. Check network traffic log\n\nIf you record/monitor outbound communication, check proxy and firewall logs for any\nsuspicious access to multiple ports (C&C server) from a single device.\n\n[Example of ports that Emotet uses]\n\n\n-----\n\n20/TCP, 22/TCP, 80/TCP, 443/TCP, 446/TCP, 447/TCP, 449/TCP,465/TCP, 7080/TCP,\n8080/TCP, 8090/TCP etc.\n\nFigure 4：C&C communication by Emotet (*Destination IP differs by sample)\n\n### What can we do when we find Emotet infection?\n\n1. Isolate the infected device, preserve evidence and investigate affected area\n\nPreserve evidence of the infected device\nCheck the emails stored in the device and email addresses in the contact list (These\nmay have been leaked)\n\n2. Change password of email accounts etc. used in the infected device\n\nEmail accounts used in Outlook and Thunderbird\nCredentials stored in Web browsers\n\n3. Investigate all devices in the network to which the infected device was connected\n\nCheck other devices in the network as the malware is capable of spreading infection by\nlateral movement\n\nThe following TTPs have been confirmed for lateral movement:\n\nLeverage SMB vulnerability (EternalBlue)\nLog on to Windows network\nUse Administrative share\nRegister services\n\n4. Monitor network traffic log\n\n\n-----\n\nMake sure that the infected device is isolated and check whether there is any other\ninfected device\n\n5. Check other malware infection\n\nCheck whether the infected device is also infected with other types of malware as\nEmotet is capable of infecting the device with other types of malware. If this happens,\nfurther investigation and response is required.\n\nSome victims in Japan have also been infected with banking trojans such as\nUrsnif and Trickbot\nVictims overseas were also found infected with targeted ransomware\n\n6. Alert stakeholders who may also be affected (whose email addresses have been stolen by the attacker)\n\nEmails and email addresses in the contact list in the case A\n\nIssue a press release if a wide range of stakeholders may be affected.\n\n7. Initialise the infected device\n\n### How can we stop emails being sent from stolen accounts?\n\nIf emails and email addresses are stolen as a result of Emotet infection, impersonating\nemails with a malicious attachment will be sent continuously. Information of the stolen email\naddresses (message body and contact lists) are collected in the attack infrastructure, and\nthis is used to distribute malware-attached emails. There is no way to stop emails from being\nsent.\n\nIt is likely that the recipients will continue to receive malware-attached emails repeatedly or\nimpersonating emails will be sent to the stolen contacts. Please beware not to open\nsuspicious email attachments. It is also recommended to perform the scan with the latest\nanti-virus signatures and make sure that your OS and software are running with the latest\nsecurity updates.\n\n### What impact is expected if a device is infected with Emotet?\n\nEmotet infection leads to exfiltration of emails and email addresses. Credentials stored in\nWeb browsers can be harvested. It is also possible that the infection spreads to other\ndevices in the network and that devices are at the risk of being infected with other types of\nmalware such as banking trojans and ransomware.\n\n### What can we do to prevent Emotet infection?\n\nPlease refer to JPCERT/CC’s security alert for details.\n\nAlert Regarding Emotet Malware Infection\n\n[https://www.jpcert.or.jp/english/at/2019/at190044.html](https://www.jpcert.or.jp/english/at/2019/at190044.html)\n\n\n-----\n\n### (Reference) The screenshots of the attached Word file\n\nSince October 2019, the following 6 types of Word files leading to Emotet infection have\nbeen observed.\n\nFigure 5： Attached file example 1 (since 2019/11/26)\n\n\n-----\n\nFigure 6： Attached file example 2 (since 2019/10/30)\n\n\n-----\n\nFigure 7： Attached file example 3\n\n\n-----\n\nFigure 8： Attached file example 4\n\nFigure 9： Attached file example 5\n\n\n-----\n\nFigure 10： Attached file example 6\n\n- Ken Sajo\n\n_(Translated by Yukako Uchida)_\n\n[Email](http://10.10.0.46/mailto:?subject=How%20to%20Respond%20to%20Emotet%20Infection%20%28FAQ%29&body=https%3A%2F%2Fblogs.jpcert.or.jp%2Fen%2F2019%2F12%2Femotetfaq.html)\n\nAuthor\n\n佐條 [研(Ken Sajo)](https://blogs.jpcert.or.jp/en/sajo/)\n\nJoined JPCERT/CC in January 2019 after being engaged in security monitoring operation at\na financial institution. Currently in charge of threat analysis and incident response for email\nscam and APT.\n\nWas this page helpful?\n\n0 people found this content helpful.\n\nIf you wish to make comments or ask questions, please use this form.\n\nThis form is for comments and inquiries. For any questions regarding specific commercial\nproducts, please contact the vendor.\n\n\n-----\n\nplease change the setting of your browser to set JavaScript valid. Thank you!\n\n## Related articles\n\nTrends of Reported Phishing Sites and Compromised Domains in 2021\n\nAttack Exploiting XSS Vulnerability in E-commerce Websites\n\nPHP Malware Used in Lucky Visitor Scam\n\n\n-----\n\nAttacks Embedding XMRig on Compromised Servers\n\nLazarus Attack Activities Targeting Japan (VSingle/ValeforBeta)\n\n\n[Back](https://blogs.jpcert.or.jp/en/2019/11/2019-first-regional-symposium-in-nadi-fiji.html)\n[Top](https://blogs.jpcert.or.jp/en/)\n[Next](https://blogs.jpcert.or.jp/en/2020/02/welcome-to-jpcertcc-office.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-04 - How to Respond to Emotet Infection (FAQ).pdf"
    ],
    "report_names": [
        "2019-12-04 - How to Respond to Emotet Infection (FAQ).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536155,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653764492,
    "ts_modification_date": 1653764492,
    "files": {
        "pdf": "https://archive.orkl.eu/d36a867c97be13c5014ea193439d35f5454a48d7.pdf",
        "text": "https://archive.orkl.eu/d36a867c97be13c5014ea193439d35f5454a48d7.txt",
        "img": "https://archive.orkl.eu/d36a867c97be13c5014ea193439d35f5454a48d7.jpg"
    }
}