{
    "id": "75c2b447-24b2-45ea-8251-f59b064ca5c8",
    "created_at": "2023-01-12T15:07:23.732522Z",
    "updated_at": "2025-03-27T02:06:08.80512Z",
    "deleted_at": null,
    "sha1_hash": "3a3198a5bc5f06c8f816e62ddbda525a63be2f13",
    "title": "2016-10-17 - New-looking Sundown EK drops Smoke Loader, Kronos banker",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 793943,
    "plain_text": "## 28 February 2011\n\n**(U) Warning: This document is UNCLASSIFIED//FOR OFFICIAL USE ONLY (U//FOUO). It contains information that may be exempt from public**\nrelease under the Freedom of Information Act (5 U.S.C. 552). It is to be controlled, stored, handled, transmitted, distributed, and disposed of in\naccordance with DHS policy relating to FOUO information and is not to be released to the public, the media, or other personnel who do not have a\nvalid “need-to-know” without prior approval of an authorized TSA official. No portion of this report should be furnished to the media, either in written\nor verbal form. This product contains U.S. Person (USPER) information that has been deemed necessary for the intended recipient to understand,\nassess, or act on the information provided. It has been highlighted in this document and should be handled in accordance with the recipient’s\nintelligence oversight and information handling procedures.\n\n\n-----\n\n# (U) Executive Summary\n\n### (U) Scope\n\n\n(U//FOUO) The Transportation Security Administration’s Office of Intelligence (TSA-OI) unclassified annual\nFreight Rail Threat Assessment addresses the overall threat to the U.S. freight rail industry and presents\nconclusions regarding likely targets and actors based upon a review of successful attacks against rail\nsystems overseas.\n\n(U//FOUO) The U.S. freight railroad sector incorporates 565 railroads operating on 139,679 miles of track\nthroughout North America, including the United States, Canada, and Mexico. According to the Association of\nAmerican Railroads (AAR), seven large freight, or Class I, railroad companies own and operate the majority\nof railroad track and rail property in the\ncountry. The AAR defines Class I railroads in\nthe United States as those with the highest (U) Source Summary Statement\nrevenue. These seven Class I companies\nshare trackage rights among themselves (U//FOUO) Much of the information presented below\nwith shortline freight, and with commuter has been derived from information found in the National\nand passenger railroads. Freight railroads Counterterrorism Center’s Worldwide Incidents Tracking\nemploy 168,891 people, maintain more than System (WITS). TSA-OI reviewed rail-related attacks in\n1.5 million rail cars in North America, and WITS between 1 April 2009 and 31 March 2010. Other\ntransport approximately 43 percent of U.S. information found in this assessment is derived from\ndomestic freight and valuable commodities— intelligence and open source reporting. No single source\nincluding petroleum, chemicals, farm dominated or had a particularly catalyzing effect on the\nproducts, automobiles, food, lumber, and analysis.\ncoal. Freight and passenger rail operations\nare often interdependent and use the same\ninfrastructure, including track, signals, and in 1 (U) WITS is an unclassified, publicly\nsome cases control centers. accessible, Web-based system.\n\n\n(U) Source Summary Statement\n\n(U//FOUO) Much of the information presented below\nhas been derived from information found in the National\nCounterterrorism Center’s Worldwide Incidents Tracking\nSystem (WITS). TSA-OI reviewed rail-related attacks in\nWITS between 1 April 2009 and 31 March 2010. Other\ninformation found in this assessment is derived from\nintelligence and open source reporting. No single source\ndominated or had a particularly catalyzing effect on the\nanalysis.\n\n1 (U) WITS is an unclassified, publicly\naccessible, Web-based system.\nUsers can browse records and\nderive statistics for enumerating\nacts of terrorism around the\nworld. Records are based on\npublished methodology and the\nstatutory definition of terrorism:\n“premeditated, politically motivated\nviolence perpetrated against non-\ncombatants by subnational groups\nor clandestine agents.” (United\nStates Code 22 USC 2656f(d)(2))\n\n\n-----\n\n# (U) Executive Summary (cont’d)\n\n(U//FOUO) TSA-OI has no specific, credible intelligence to suggest violent transnational or\ndomestic extremist groups are planning to attack the U.S. freight rail system, or use the system\nto facilitate an attack against another target. TSA-OI assesses with moderate confidence[i] that the\nrisk of an attack to the U.S. freight rail industry is low.\n\n\n\n- (U//FOUO) TSA-OI assesses with high confidence that passenger trains or stations are more likely\nto be targeted than freight trains. The interdependency of the freight and passenger rail infrastructure\nin the United States increases the likelihood that any threats or attacks against passenger rail could\nimpact freight rail as well.\n\n- (U//FOUO) TSA-OI judges that al-Qa’ida (AQ), its affiliates, and other terrorists motivated by violent\nextremist views would be the most likely actors to target the U.S. freight rail system. This judgment is\nbased on recent attacks against freight rail and passenger trains overseas and the recent stated goals\nof al-Qa’ida’s senior leadership to attack U.S. transportation.\n\n\n\n- (U//FOUO) Based upon a review of worldwide attacks on freight rail targets, TSA-OI assesses that\nimprovised explosive devices (IEDs) would be the most likely means of attack against the U.S. freight\nrail system.\n\n\n\n - (U//FOUO) There is little evidence of a specific terrorist threat to freight rail Supervisory Control\nand Data Acquisition (SCADA) or other Industrial Control Systems (ICS), but al-Qa’ida and other violent\nextremist groups have a sustained interest in acquiring the skills to conduct cyber attacks.\n\ni TSA-OI uses a three-point scale in which “High Confidence” generally indicates TSA-OI judgments are based on high-quality information and/or the nature of the issue makes it\npossible to render a solid judgment. “Moderate Confidence” generally means the information is interpreted in various ways, TSA-OI has alternative views, or the information is\ncredible and plausible but not corroborated sufficiently to warrant a higher level of confidence. A “Low Confidence” judgment generally means the information is scant,\nquestionable, or very fragmented and it is difficult to make solid analytical inferences, or TSA-OI has significant concerns or problems with the sources.\n\n\n-----\n\n# TSA-OI Freight Rail\n Modal Threat Assessment\n\n(U//FOUO) TSA-OI assesses the terrorism threat to the U.S. freight rail industry is low. There\nhas never been a confirmed attack on freight rail in the Homeland by a terrorist group, and\nthe Intelligence Community lacks current or specific intelligence that terrorists intend to target\ndomestic freight rail. Terrorist success in attacking rail systems overseas could inspire them to use similar\ntactics, techniques, and procedures against freight rail in the United States.\n\n\n### (U) Actors\n\n(U//FOUO) Although no terrorist organization has displayed an interest in attacking U.S. freight rail, TSAOI judges AQ or affiliates would be most likely to do so because they have stated their intent to attack\ntransportation modes and have successfully targeted rail in the past overseas.\n\n(U//FOUO) Past intelligence reporting indicates terrorist groups have sought to use individuals with insider\nknowledge of transportation sectors to help facilitate an attack against the United States. Industry insiders\nin the freight rail business can include former and current railroad employees with extensive information\nabout the railroad industry and railroad operations. TSA-OI is not aware of any known instance of insiders in\nthe freight rail industry assisting terrorists to commit acts of terrorism; however, in September 2007, Adem\nYilmaz, reportedly a member of the Islamic Jihad Union cell targeting Germany, was arrested while employed\nat the railway station of Frankfurt Airport. Yilmaz was employed in the security division of rail operator\nDeutsche Bahn from 1997 until 2002. During that time, Frankfurt Airport was one of several targets that his\ncell considered as a potential target.[1] TSA-OI has no information that proves Yilmaz used insider knowledge\nto target the airport. This group also discussed targeting other airports in Germany of which Yilmaz had no\nknowledge.\n\n\n### (U) Targets\n\n(U//FOUO) A review of WITS data from April 2009 through March 2010 reveals 94 attacks on rail targets\nworldwide. Of those 94 attacks, only 16 appeared to specifically target freight trains; 23 attacks were\nmade against passenger trains; and the remaining 55 attacks were committed against other rail targets\nand infrastructure—e.g., tracks, bridges, signaling equipment—that could have affected either freight or\npassenger rail. The targets and motivation for these attacks remain unknown.[2]\n\n\n-----\n\n(U//FOUO) Recent statements from al-Qa’ida’s\nsenior leadership regarding striking U.S. interests\nincluding transportation could inspire attacks against\nrail targets in the Homeland.[3] Although al-Qa’ida\nlikely considers passenger trains a higher priority\ntarget than freight trains, the interdependency of\nthe freight and passenger rail infrastructure in the\nUnited States—bridges, tunnels, dispatch and control\ncenters, tracks, signals and switches—increases the\nlikelihood that threats or attacks against passenger\nrail could impact freight rail as well.\n\n\n**(U) Train System Attacks Totals, April 2009 - March 2010**\n\n**Source: WITS** Figure 1\n\n#### 94\n**16** **Total Attacks**\n\n**freight**\n**trains**\n\n**55**\n\n**other rail targets**\n**and infrastructure(tracks, bridges,** **23**\n\n**passenger**\n\n**signaling**\n\n**trains**\n\n**equipment, etc.)**\n\n**30011-02** **(U)**\n\n\n(U) Toxic Inhalation Hazards (TIH)\n\n(U//FOUO) According to the Association of American Railroads Bureau of Explosives, each year, more than\n76,000 bulk rail shipments of materials poisonous by inhalation, commonly referred to as toxic inhalation\nhazard (TIH), traverse nearly all major American cities and metropolitan regions. Because of its pervasiveness\n(more than 30,000 shipments per year) and toxic effects (500 parts-per-million can cause health problems),\nchlorine is of particular concern to the freight rail industry.\n\n\n(U//FOUO) No terrorist group has ever attacked a rail car transporting TIH commodities. Additionally, TSA-OI\nhas no current intelligence to indicate that al-Qa’ida or any other terrorist organization is planning to conduct\nan attack on a TIH car. Nevertheless, a successful attack on a freight rail car transporting TIH through a\ndensely populated urban area could meet al-Qa’ida’s strategic goals of attacking targets that would generate\nmass casualties, economic damage, and fear.[4]\n\n\n### (U) Tactics\n\n(U) Improvised Explosive Devices (IEDs)\n\n\n(U//FOUO) Worldwide, IEDs were the most common\nweapon used for attacking all components of the\nrail system (passenger and freight). IEDs were\nused in 71 of 94 attacks, or 76 percent, of attacks\non all rail targets, including tracks, bridges, and\nother components of railroad infrastructure. Of the\n16 attacks on freight rail, seven were conducted\nwith IEDs, eight with small-arms fire, and one was\ndetermined to be an act of sabotage. As a result\nof the success of IED attacks against all railroads\noverseas,[5] TSA-OI assesses that terrorists would use\nIEDs in similar attacks on freight rail in the Homeland.\n\n - (U) March 2010: Terrorists in the Republic of Dagestan in Russia blew up a freight train using a\nhomemade, pressure-activated device containing approximately 2 kilograms of trinitrotoluene (TNT)\nthat detonated as the train passed. The explosion set fire to the locomotive, derailed it and 14 empty\ncars, and damaged 250 meters of track. There were no casualties.[6]\n\n - (U) February 2010: An IED detonated between two trains near a city rail station in southern Russia.\nOne of the trains was carrying 28 tanks of aviation fuel.[7]\n\n\nFigure 2\n\n\n-----\n\n - (U) November 2009: Sixteen fuel-laden tanker cars were\ndestroyed when suspected insurgents triggered an IED in\nAssam, India. Three hundred meters of track were also\ndestroyed. The blast, resulting fire, and the damaged track\ndisrupted the movement of trains throughout the region.[8]\n\n(U) Vehicle-Borne Improvised Explosive Devices (VBIEDs)\n\n\n(U//FOUO) Although terrorists worldwide have substantial\nexperience in using vehicle-borne VBIEDs, TSA-OI has no evidence\nof a VBIED ever being used against either a freight or passenger\ntrain.[9]\n\n\n(U)\n\n\n(U) Assam Train Attack\n\n\n### (U) Cyber Attacks\n\n(U//FOUO) Although there is little evidence of a specific terrorist threat to freight rail Supervisory Control\nand Data Acquisition (SCADA) or other Industrial Control Systems (ICS), intelligence reporting indicates alQa’ida and other violent extremist groups have a sustained interest in acquiring the skills to conduct cyber\nattacks.[10 ]Independent hackers, as well as foreign governments, have also been linked to repeated intrusions\ninto U.S. business and control system computer networks.[11]\n\n\n\n   - (U//FOUO) In 2003, a U.S. freight rail company’s business systems became infected with a nondirected computer worm. Much of the consequent degradation of rail operations stemmed from\nmitigation efforts to contain the intrusion, highlighting how computer system performance can be\ndirectly affected in unexpected or unanticipated ways (whether intentionally or otherwise).[12]\n\n### (U) Suspicious Incidents\n\n\n(U//FOUO) While numerous suspicious incidents connected to the U.S. freight and passenger rail systems\nhave been reported each year in the United States, none has been linked to terrorism. Most involved\nvandalism or tampering with rail tracks, and it was unclear whether freight or passenger rail was the actual\ntarget. Two of the more serious incidents follow:\n\n - (U//FOUO) May 2009: A near collision occurred in Minot, North Dakota, when a train came upon\ntwo empty locomotives that had been moved and left standing on the single main line. The train\ncrew initiated an emergency brake application and managed not to hit the locomotives. Local law\nenforcement reported that two youths were observed jumping off and running away from the two\nlocomotives. The two locomotives were identified as switch engines that had been parked and left\nunmanned on a nearby siding.[13]\n\n\n\n   - (U//FOUO) March 2009: Track switches were surreptitiously reversed in separate incidents near\nTewksbury, Massachusetts, and Nashua, New Hampshire, changing the direction of rail traffic.\nAdditionally, at both locations, the perpetrator(s) replaced the railroad locks on the track switches with\nlocks for which the railroad personnel lacked keys. The perpetrators may have been attempting to\ncause a collision or derailment of trains.[14]\n\n### (U) Outlook\n\n\n(U//FOUO) TSA-OI has no specific intelligence indicating a credible or imminent threat to the U.S.\nfreight rail system and assesses that the overall threat to the freight rail industry from terrorism\nis low. TSA-OI concludes, however, that terrorists would most likely use IEDs if they conducted attacks on\nrail in the Homeland. TSA-OI assesses that reporting and resolving suspicious activity is critical in aiding law\nenforcement and security officials with identifying unusual behavior, trends, patterns, and criminal acts that\ncould precede terrorist operations.\n\n\n-----\n\n(U//FOUO) Prepared by the TSA Office of Intelligence, Transportation Analysis Branch. For dissemination questions, contact TSA-OI_\nProduction@tsa.dhs.gov.\n\nTracked by: HSEC-02-03003-ST-2009 Rail\n\n\n-----\n\n# (U) Endnotes\n\n1 (U) Spiegel Online; 17 September 2007; “(U) Terror Suspect Worked at Frankfurt Airport;” (U)\n2 (U) Worldwide Incidents Tracking System; http://wits.nctc.gov; 31 March 2010; (U)\n3 (U) DHS IA-0291-10, “(U) Evolution of the Terrorist Threat to the United States,” 21 May 2010; (U//FOUO)\n4 (U) CIA; CTC 2003-30053; 7 July 2005; (U//FOUO)\n5 (U) Worldwide Incidents Tracking System; http://wits.nctc.gov; 31 March 2010; (U)\n6 (U) OSC; CEP20100315004003; 11 MAR 10; “(U) RUSSIA: Militants Carry Out Further ‘Acts of Sabotage’\nIn Dagestan, Ingushetia;” (U)\n7 (U) OSC; CEP20100315004003; 11 MAR 10; “(U) RUSSIA: Militants Carry Out Further ‘Acts of Sabotage’\nIn Dagestan, Ingushetia;” (U)\n8 (U) OSC; SAP20091118428004, 18 Nov 09; “(U) India: Suspected ULFA Militants Blow Up Fuel Train in Assam;” (U)\n9 (U) Worldwide Incidents Tracking System; http://wits.nctc.gov; 31 March 2010; (U)\n10 (U) Classified document: DHS Special Assessment; 12 December 2005; “(U//FOUO)\n11 (U) Statement of TSA Office of Information Technology; 25 August 2010; (U//FOUO).\n12 (U) cbsnews.com; “Virus Disrupts Train Signals,” 21August 2003; (U)\n13 (U) TSOC E-mail Report; Incident Trend of Note; 16 May 2009; (U//FOUO)\n14 (U) MBTA Transit Police Department Informational Advisory; 16 March 2009; (U)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/DHS-TSA - Freight Rail Threat Assessment - 2011.pdf"
    ],
    "report_names": [
        "DHS-TSA - Freight Rail Threat Assessment - 2011.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536043,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/3a3198a5bc5f06c8f816e62ddbda525a63be2f13.pdf",
        "text": "https://archive.orkl.eu/3a3198a5bc5f06c8f816e62ddbda525a63be2f13.txt",
        "img": "https://archive.orkl.eu/3a3198a5bc5f06c8f816e62ddbda525a63be2f13.jpg"
    }
}