{
    "id": "75d23e4c-c0a3-4c8d-bfae-f02fe319be6e",
    "created_at": "2023-01-12T15:00:35.256557Z",
    "updated_at": "2025-03-27T02:15:59.947801Z",
    "deleted_at": null,
    "sha1_hash": "5f4f31eb0b37b138a19beb86e3cdf0959bc50f63",
    "title": "2022-03-28 - PlugX- A Talisman to Behold",
    "authors": "",
    "file_creation_date": "2022-05-28T03:51:26Z",
    "file_modification_date": "2022-05-28T03:51:26Z",
    "file_size": 468664,
    "plain_text": "# PlugX: A Talisman to Behold\n\n**[trellix.com/en-us/about/newsroom/stories/threat-labs/plugx-a-talisman-to-behold.html](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/plugx-a-talisman-to-behold.html)**\n\nBy [Max Kersten,](https://www.trellix.com/en-us/about/newsroom/stories/contributors/max-kersten.html) [Marc Elias, Leandro Velasco, and Alexandre Mundo Alguacil · March 28,](https://www.trellix.com/en-us/about/newsroom/stories/contributors/marc-elias.html)\n2022\n\nFor over a decade, the PlugX malware has been observed internationally with different\nvariants found around the world. This blog covers a PlugX variant that we have named\nTalisman, a name we based on comparisons with other PlugX variants, and its rather long\nlife since it first emerged in 2008. First, the malware’s technical details will be discussed,\nafter which the infrastructure, attribution, and victimology will be covered.\n\n## Executive Summary\n\nTalisman is a newly discovered PlugX variant which follows the usual execution process by\nabusing a signed and benign binary which loads a modified DLL to execute shellcode. The\nshellcode is used to decrypt the PlugX malware which then serves as a backdoor with plugin capabilities. Unlike other versions, the malware’s internal configuration’s signature is\ndifferent, as well as other minor changes within the code.\n\nWe want to mention that a change within the PlugX malware alone does not mean a new\nthreat actor has emerged. The PlugX source code has allegedly circulated online already.\nThis also means that not all PlugX samples are necessarily tied to Chinese actors, although\nit a prevalent tool in their kit. In the case of Talisman, there is more evidence which points\ntowards a Chinese state-backed actor than a simple change in the malware’s codebase,\n\n\n-----\n\nsuch as the overlaps in the used infrastructure, which is also present in Recorded Future s\n[research. Based on this, Trellix attributes this campaign with medium confidence to the](https://go.recordedfuture.com/hubfs/reports/cta-2021-0616.pdf)\nChinese state-backed RedFoxtrot group.\n\nThe victims were in South Asia in the Telecommunication and Defense sectors, and align\nwith China’s geopolitical interests. One such initiative is the Belt and Road Initiative, via\nwhich China aims to establish strong social economical relationships across Europe, Asia,\nand Africa via trade.\n\n## Technical details\n\nWithin the analysis of the PlugX Talisman variant, we will reference the THOR variant of\n[PlugX, which was discovered by Unit42, as well as an earlier version of PlugX documented](https://unit42.paloaltonetworks.com/thor-plugx-variant/)\nby DrWeb. These articles describe other versions of PlugX and were of help to us during the\nanalysis of this variant to both understand and compare the different iterations of the\nmalware. Talisman has some differences with other PlugX versions. In the coming sections,\nwe will highlight interesting segments of the malware. Below, a visual overview of the\nmalware’s stages is given.\n\n**Figure 1. Talisman PlugX execution flow**\nStage 1 – The signed and benign executable\n\nFilename SNAC.EXE\n\nSHA-1 dc40970a3c8f03866e0b700460d3b1f7afa6a433\n\nSHA-256 c09ff32519f112674bd5f4b1687feadf18844c5423e6f28df8be50eb9503e606\n\nMD-5 8e886df3cb6160188f9748f14f249063\n\nThe first stage of the malware is a benign executable which is used to evade the prying eyes\nof security products as valid signatures often help to indicate the trustworthiness of a binary.\nThe signed executables in this campaign have been created by security companies. The\nsole purpose of the first stage is to load a DLL which has been modified by the attacker.\n\n\n-----\n\nSideloading a DLL is a commonly seen technique in various PlugX variants, as is also\n[described on the respective MITRE ATT&CK page. Lastly, a third binary file, containing the](https://attack.mitre.org/techniques/T1574/002/)\nencrypted Talisman payload, is decrypted by the DLL to complete the full chain of execution.\n\nIn the sample we are analyzing, the legitimate executable has the name SNAC.exe, the\nTalisman DLL Loader is named WGXMAN.DLL, and the encrypted and compressed\nTalisman payload is named SNAC.LOG.\n\n**Figure 2.**\n\n**Talisman execution files**\nMost Talisman PlugX samples we analyzed consist of three-file long execution chains\nabusing the DLL sideloading technique, which is consistent with the tactics, techniques, and\nprocedures of Chinese state-sponsored threat actors that use this type of execution to\nlaunch their malware to evade detection by security solutions.\n\nThe table below lists the different observed filenames for the legitimate executables, the\nTalisman DLL loader and the encrypted Talisman in the analyzed samples.\n\nLegitimate executable Talisman DLL Loader Encrypted Talisman\n\nSNAC.EXE WGXMAN.DLL SNAC.LOG\n\nRasTls.exe RasTls.dll RasTls.dll.res\n\nmsvsct.exe TmDbgLog.dll TmDbgLog.dll.obj\n\nmsrers.exe TmDbgLog.dll TmDbgLog.dll.tsc\n\nIn addition to the filenames, we detected another type of execution chain consisting of a selfextracting SFX RAR file with the name “sys.exe” that drops the three related RasTls files to\ndisk and executes them.\n\nStage 2 – The modified DLL\n\nFilename WGXMAN.DLL\n\nSHA-1 ef3e558ecb313a74eeafca3f99b7d4e038e11516\n\nSHA-256 1c0cf69bce6fb6ec59be3044d35d3a130acddbbf9288d7bc58b7bb87c0a4fb97\n\n\n-----\n\nMD-5 b4f12a7be68d71f9645b789ccdc20561\n\nThe DLL is loaded by the benign executable, as it normally would. In this case, the DLL has\nonly a single purpose: execute shellcode to decrypt a fake log file. The shellcode is called in\nthe “DllMain” function the moment the DLL is attached to the executable. Once decrypted, a\nnew PE file is uncovered, which is PlugX’ main component, to which the execution is then\ntransferred.\n\nThe configuration decryption routine that is used within PlugX’ modified DLL to decrypt\nTalisman differs from both aforementioned samples. The decryption routine is a piece of\nshellcode which can be launched as-is, as it resolves all the required functions before using\nthem. The decryption logic differs as the used decryption constants have been altered, which\ncan be seen in the screenshot below.\n\n**Figure 3. The decryption routine to decrypt Talisman**\n\nContrary to the other samples, the shellcode’s decryption loop contains 5 sleep calls, which\nslows the decryption down, albeit barely noticeably. The decrypted buffer is then\ndecompressed using “RtlDecompressBuffer”, after which the PE module is accessible in\n\n-----\n\nmemory.\n\nFilename SNAC.LOG\n\nSHA-1 2294ecbbb065c517bd0e01f3f01aabd0a0402f5a\n\nSHA-256 6dc98a3c771f9f20d099e2d64995564dd083be9ac6ed9586a6e57c20ebd4176c\n\nMD-5 60cb70545fbe3c96a0f82eeb54940553\n\nFilename - (decrypted and decompressed SNAC.LOG)\n\nSHA-1 80e5fd86127de526be75ef42ebc390fb0d559791\n\nSHA-256 344fc6c3211e169593ab1345a5cfa9bcb46a4604fe61ab212c9316c0d72b0865\n\nMD-5 c6c6162cca729c4da879879b126d27c0\n\nThis section will deep dive into the used obfuscation techniques, briefly cover the execution\nflow, and provide insight into the used decryption routines, as well as the internally used\nstructures within the malware.\n\n### Obfuscation techniques\n\nThe used obfuscation techniques attempt to make the analysis harder, but one can quite\neasily deobfuscate the sample. The used Windows API functions are loaded dynamically,\nbased on the CRC32 hash of the function name. Note that the name’s terminating null byte\nmust be included when hashing the function name.\n\nThe image below shows a wrapper function for WSAIoctl, which is resolved based on the\ngiven hash, as can be seen in the third function argument. Additionally, the second argument\nis a handle to the module which contains the given function. It returns a pointer to the\nrequested function, which can then be invoked as a function.\n\n**Figure 4. Dynamic function resolving based on API hashing, as seen within Talisman**\n\n\n-----\n\nSecondly, some of the internally used strings are encrypted, but not all. The string encryption\nis based on simple XOR cipher, where the encrypted string is first created on the stack. The\ncharacters of the encrypted string are then decrypted and stored at the location of the\nencrypted character. Once the decryption loop has finished, the decrypted string will be\nstored on the stack. The image below shows the decryption of a string. Note that both ascii\nand wide strings are used within the program, which can cause some confusion when\ndecrypting the strings with the wrong encoding.\n\n**Figure 5. Stack strings, as seen within Talisman**\nThe qmemcpy function is an assumption that is made by IDA, since the assembly view\ncontains mov instructions for the complete encrypted string. The loop that follows uses\naddition, bitwise exclusive or, and subtraction operators to decrypt the string, one byte at a\ntime. The string decryption keys are the same for all encrypted strings within the binary. Note\nthat not all strings within the sample are encrypted.\n\n### PlugX execution flow\n\nUpon executing, the main function will resolve some functions, as these are used later.\nAdditionally, the malware adjusts the SeDebugPrivilege and SeTcbPrivilege tokens of its own\nprocess. These two tokens ensure that the malware can, respectively, debug processes\nwhich aren’t owned by the current process’ owner, and the malware can create access\ntokens as if they are made by any user. Both instances allow the malware to act as the\nSYSTEM user, allowing free roam around the machine. The malware then creates its main\nthread, which is named “bootProc”.\n\nThe screenshot below shows the pseudo code of the token adjustment, and the creation of\nthe main thread. Note the plaintext “bootProc” string, as well as the token names, are prime\nexamples to show that not all strings within the sample are encrypted.\n\n\n-----\n\n**Figure 6. Set-up prior to the main thread creation within Talisman**\nThe first noteworthy action the main thread performs, is the unloading of the modified DLL\nfrom memory, minimising the amount of malicious artefacts in-memory. The rest of the\nmalware’s execution is in-line with other PlugX variants’ behaviour, one example being the\nnumber of command-line arguments which decide the persistence method, as well as the\npersistence methods themselves: varying from the creation of a key in the register’s start-up\nfolder, the creation of a scheduled task, or the creation of a service.\n\nAdditionally, the malware connects with the command-and-control server, as is stored in the\ninternal configuration structure. The usage of plug-ins is possible, much like other PlugX\nvariants, if the correct signature is present in the plug-in. The following sections will highlight\ninteresting segments of the sample.\n\n### Internal structures\n\nA piece of shellcode is used to decrypt Talisman, a pointer to which is stored within a custom\nstructure within the binary. The shellcode resolves all functions it requires and handles the\ndecryption and the decompression of the given data blob. Additionally, the MZ-header and\nPE-header are verified using the offsets of 0 and 0x4550 respectively, which correspond to\nfields named e_magic and e_lfanew. The entry point of the newly decrypted PE file is stored\nin the custom structure as well. The image below shows the checks and structure field\nassignments in the pseudocode overview.\n\n\n-----\n\n**Figure 7. Internal configuration allocation**\nOur findings regarding the custom structure differ when comparing them to the analysis of\nDrWeb. Since the sample where DrWeb refers to is unavailable, we could not compare the\ntwo samples. In 2014, [Takahiro Haruyama and](https://twitter.com/cci_forensics) [Hiroshi Suzuki presented “I Know You Want](https://twitter.com/herosi_t)\n[Me - Unplugging PlugX” at Black Hat Asia. On slide 10, one can see the shellarg structure](https://www.blackhat.com/docs/asia-14/materials/Haruyama/Asia-14-Haruyama-I-Know-You-Want-Me-Unplugging-PlugX.pdf)\nmatches our findings. The image below shows DrWeb’s version of the structure, as well as\nthe version that is found within Talisman.\n\n**Figure 8. Two versions of the internal structure which**\n\n**is used when loading Talisman**\n\n\n-----\n\nWithin the custom structure, the signature field often corresponds to PLUG. In other variants,\n[a different value is used, such as the THOR version that Unit42 wrote about. The Talisman](https://unit42.paloaltonetworks.com/thor-plugx-variant/)\nvariant uses the constant value 0xCF455089 as a signature, which decodes to the Chinese\ncharacters “䗏襐” using the UTF16-LE encoding and translates to “crotch” in English. Other\nversions are named based on their signature but given Talisman’s rude signature word we\nopted for a different name.\n\n### Config decryption\n\nBefore decrypting the configuration, the malware will check for the presence of the Talisman\nsignature and ensure that the configuration length matches. In the observed Talisman\nvariants, the configuration size equals 0x1924 bytes, as passed by the “shellarg_talisman”\nstructure, which is located at the start of the binary.\n\n**Figure 9. The length**\n\n**and signature check of the config**\nIf those checks are met, Talisman will call the decryption routine to decrypt the configuration\nwith the well-known PlugX algorithm, as is shown in the image below.\n\n**Figure 10. The decryption routine**\n\nThe encrypted configuration is fetched from “SNAC.LOG”, which is decrypted by the second\nstage DLL, rather than the Talisman PlugX binary. This is to ensure that the full execution\nchain (the benign executable, the modified DLL, and the encrypted SNAC.LOG file) are\nexecuted. If this is not the case, the malware will crash.\n\n\n-----\n\nThe Talisman PlugX configuration has a size of 0x1924 bytes and contains all the necessary\nvalues and information to properly run the executable. The following fields are contained in\nthe Talisman configuration: a list of control panels (i.e., freewula.strangled.net), the target\nprocess that will inject (i.e., %SystemRoot%\\system32\\nslookup.exe), the malware home\ndirectory (i.e., %ALLUSERSPROFILE%\\SymantecSNAC), the persist name (i.e.,\nSymantecSNAC), the service display name (i.e., SymantecSNAC), the campaign id (i.e.,\nTEST) and the mutex name (i.e., Global\\Restart0).\n\n**Figure 11. Talisman configuration**\nThe aforementioned config fields are very similar as the ones reported in the analysis\nperformed by [DrWeb. Analyzing some of the different Talisman recovered configurations, we](https://vms.drweb-av.es/virus/?i=21512304)\nobserved the following embedded campaign ids:\n\nTEST\nRT\naop-1\n\nWe don’t exactly know how the “campaign_id” field is used by the actors, but we presume it\nmay be used to identify the victims, or the malware version in their operations.\n\n### Persistence\n\n\n-----\n\nTalisman has, much like the original PlugX version, several ways of persisting itself.\nDepending on the number of command-line arguments, and the internal configuration, the\nsample may opt to not persist using one of the following methods:\n\nNo persistence\nA scheduled task\nAn auto-starting service\n\nNote that the service is only created if administrative permissions are available to the\nsample. If this is not the case, the auto-run registry key is created instead.\n\n### Plug-ins\n\nTalisman has, much like other PlugX variants, the ability to use plug-ins. Some of these are\n[embedded by default, as also described by the United States’ CISA: Disk, Nethood, Netstat,](https://www.cisa.gov/uscert/ncas/alerts/TA17-117A)\n_Option, PortMap, RegEdit, Service, Shell, SQL, and Telnet. The plug-in names are relatively_\nself-explanatory, as their name indicates the type of activities that can be performed with\nthem. The screenshot below shows the first seven of the embedded plug-ins, as listed\nabove.\n\n**Figure 12. A list of embedded plug-ins**\n\n\n-----\n\nOften, the third argument of the plug-in s function (named FunctionN in the screenshot\nabove, where “N” is a number) indicates the date of the plugin’s creation when viewed as a\nhexadecimal value. This holds true in Talisman’s case as well, albeit with a minor change:\nthe digits of the year are inverted per byte. As an example, the “Service” plug-in’s date\nequals “0x81020315”. The first two bytes are “81 02”, which equal “20 18” when inverted per\nbyte, marking 2018 as a year. The specific date for this plugin would be 3 March 2018. The\ntable below provides the dates for all embedded plug-ins.\n\n**Plug-in** **Date (dd-mm-yyyy)**\n\nDisk 25-03-2018\n\nNethood 13-02-2018\n\nNetstat 15-02-2018\n\nOption 28-01-2018\n\nPortMap 25-03-2018\n\nRegEdit 15-03-2018\n\nService 17-01-2018\n\nShell 05-03-2018\n\nSQL 23-03-2018\n\nTelnet 25-02-2018\n\nA small change like this can indicate that the actor has access to the source code of the\nmalware, rather than a builder with an executable stub, as these generally do not provide the\noption for such granular changes.\n\n## Infrastructure\n\nDuring our research we analysed three different Talisman PlugX samples, from which we\nextracted the command-and-control servers. This allowed us to cluster the actors’\ninfrastructure. We found that one of the samples (SHA-256:\n6dc98a3c771f9f20d099e2d64995564dd083be9ac6ed9586a6e57c20ebd4176c) connects to\n“dhsg123[.]jkub[.]com” as the command-and-control domain. This overlaps with the\n[RedFoxtrot group, on which Recorded Future already reported.](https://www.recordedfuture.com/chinese-apt-groups-target-afghan-telecommunications-firm/)\n\nMoreover, in the sample identified by the SHA256 hash\nfdada5ba799bd9f5270b218cfad543d99fde3eb7898fd9e3ee79603b643b3c48, the commandand-control domain is “final[.]staticd[.]dynamic-dns[.]net”, which resolved to\n158[.]247[.]204[.]191. Pivoting on that IP, we identified two PCShare samples communicating\n\n\n-----\n\nto that IP, both of which use the same injection method into the Remote Desktop shared\nclipboard (RDPclip.exe). PCShare is an open-source backdoor, which has been leveraged\n[by Chinese actors, as documented by BlackBerry. Additionally, the same mutex (being](https://blogs.blackberry.com/en/2019/09/pcshare-backdoor-attacks-targeting-windows-users-with-fakenarrator-malware)\n[“78de65b0701f3c9238a37”) is used as the ones reported by Recorded Future.](https://go.recordedfuture.com/hubfs/reports/cta-2021-0616.pdf)\n\n**Figure 13. Talisman PlugX and PCShare connection to RedFoxtrot infrastructure**\nOne interesting note on the TTPs employed by the actors is that unused, parked, or\ndecommissioned domains are set to resolve to localhost (127.0.0.1), or public services such\nas Google (8.8.8.8) or Cloudflare (1.1.1.11, note that the “11” at the end is not a typo).\n\n**Figure 14. Historical resolutions of Talisman command and control domain**\nAll the domains we’ve detected are using Dynamic DNS providers. The main reason to use a\ndynamic DNS provider is to quickly and easily change the IP address where the domain\nresolves. An additional advantage for the actor is the lack of WHOIS contact data regarding\ndynamic DNS subdomains, thus providing operational security. The main providers that the\nactors used to register the domains are Afraid FreeDNS, ChangeIP, and Dynu.\n\n\n-----\n\nInterestingly, the vast majority of the threat actors infrastructure was hosted on virtual private\nservers of Choopa/Vultr company (AS 20473 - AS-CHOOPA) although we’ve seen some\ncommand-and-control servers hosted on Digital Ocean’s infrastructure (AS 14061 DIGITALOCEAN-ASN).\n\nWe are sharing the full list of indicators of compromise regarding the Talisman PlugX\ncommand and control servers and the infrastructure of the actor in Appendix A of this blog.\n\n## Attribution & Victimology\n\nWe have observed the Talisman malware in a campaign which targets the\ntelecommunication and defense sectors in South Asia. Moreover, the targets line up with the\nChinese efforts to protect the [Belt and Road Initiative, a program that aims to establish](http://english.www.gov.cn/archive/publications/2015/03/30/content_281475080249035.htm)\nstrong socioeconomically relationships across Europe, Asia, and Africa.\n\nThe South Asian region is of strategic interest for China for various reasons. Firstly, the\nstability in South Asia is a global concern, making it a logical focus area for all superpowers,\nincluding China. Secondly, companies in the telecommunication and defense sectors provide\nunique insights for attackers and are often targeted. Thirdly, given the military presence of\nmultiple superpowers in the region, and the geographic location in relation to China, this area\ncan be considered a priority for Chinese sponsored groups.\n\nPlugX has been associated with various Chinese actors in recent years. This fact raises the\nquestion if the malware’s code base is shared among different Chinese state-backed groups.\nOn the other hand, the alleged leak of the PlugX v1 builder, as [reported by Airbus in 2015,](https://airbus-cyber-security.com/latest-changes-plugx/)\nindicates that not all occurrences of PlugX are necessarily tied to Chinese actors.\n\nHowever, based on our analysis of the infrastructure overlaps with Recorded Future’s related\n[research, we assess with medium confidence that the Talisman PlugX variant discussed in](https://go.recordedfuture.com/hubfs/reports/cta-2021-0616.pdf)\nthis blog is used by RedFoxtrot/Nomad Panda, a Chinese state sponsored actor. The\nvictimology is in-line with the targets of this group as well. We have no evidence that this\nvariant is exclusively used by this threat actor, instead we believe that Talisman could be\nshared among different Chinese groups to carry out their operations.\n\n## Conclusion\n\nIn this blog we have analysed the different steps the infamous PlugX RAT follows to start\nexecution and avoid detection. Moreover, we highlighted several interesting characteristics of\na new variant that we dubbed Talisman. During the technical analysis, we extracted various\nnetwork artifacts that allowed us to not only find new samples, but also analyse the\ninfrastructure overlap with a known Chinese state-backed group. This information, together\nwith the analysis of the victims where we observed this PlugX variant, allowed us to attribute\nthis campaign with medium confidence to the RedFoxtrot APT group, which is otherwise\nknown as Nomad Panda.\n\n\n-----\n\n## Appendix A – Indicators of compromise\n\n### Talisman PlugX All execution files\n\ne71d355dec64cbf8f02a754bf0585437ce48f7b68108cb642fb202393cd1ef90\n\n0a00204517283c9a8d1e2d1a8743249c14de0edcec4a8292500083437735663c\n\n45c944889a482ae2e0e0a8e260c3be737cb612c8804164badef61e8a8713b92f\n\nf6b939dcc97c1c43f1c616174f936b6ef19c5ccc872a1a0ef14f2989cf11b02b\n\n### Talisman PlugX Loader\n\n1c0cf69bce6fb6ec59be3044d35d3a130acddbbf9288d7bc58b7bb87c0a4fb97\n\nad48650c6ab73e2f94b706e28a1b17b2ff1af1864380edc79642df3a47e579bb\n\n6cd5079a69d9a68029e37f2680f44b7ba71c2b1eecf4894c2a8b293d5f768f10\n\n0468005682c814e7a5f07f3554e9fadbb2d2ba7527dcaee9a1a456f244c49ddb\n\n### Talisman PlugX Encrypted Payloads\n\na072133a68891a37076cd1eaf1abb1b0bf9443488d4c6b9530e490f246008dba\n\n6dc98a3c771f9f20d099e2d64995564dd083be9ac6ed9586a6e57c20ebd4176c\n\nfdada5ba799bd9f5270b218cfad543d99fde3eb7898fd9e3ee79603b643b3c48\n\n37b3fb9aa12277f355bbb334c82b41e4155836cf3a1b83e543ce53da9d429e2f\n\nfe18adaec076ffce63da6a2a024ce99b8a55bc40a1f06ed556e0997ba6b6d716\n\n3c5d08f20a7bd04b1e6866344af59bec2152ec3542f2eae0c7925555e670676e\n\n### Talisman PlugX Encrypted Configuration\n\nf44ede464f752ea3aa3595f8137945a4dee7298c8155c39f366aad05b125ac8b\n\n### PCShare\n\n3f6102bd9add588b4df9b1523e40bb124af36a729037b8c3f2261563e4fa4be9\n\n785ac72b10fd9cf98b5e2a40dc607e1ff735fcd8192bf71747755c963c764e2d\n\n### Mutex\n\n\n-----\n\nGlobal\\ReStart0\n\nGlobal\\DelSelf(00000000) (where the zeros are the process ID in hexadecimal format,\nprepended with zeros to ensure 8 digits are used)\n\n### PDB\n\nc:\\bld_area\\SESAgent70\\snac_build\\bin.ira\\WGXMAN.pdb\n\n### Domains\n\nfreewula.strangled[.]net\n\nszuunet.strangled[.]net\n\ndhsg123.jkub[.]com\n\nfinal.staticd.dynamic-dns[.]net\n\noprblemoyo.kozow[.]com\n\nasd.powergame.0077.x24hr[.]com\n\nw.asd3.as.amazon-corp.wikaba[.]com\n\nrandomanalyze.freetcp[.]com\n\ndarkpapa.chickenkiller[.]com\n\nmiche.justdied[.]com\n\n### Domains\n\n209[.]97[.]166[.]143\n\n149[.]28[.]139[.]86\n\n159[.]65[.]152[.]7\n\n143[.]110[.]242[.]139\n\n158[.]247[.]204[.]191\n\n143[.]110[.]250[.]149\n\n202[.]182[.]111[.]249\n\n207[.]148[.]119[.]147\n\n\n-----\n\n149[.]28[.]128[.]117\n\n159[.]65[.]147[.]83\n\n143[.]110[.]241[.]54\n\n157[.]245[.]111[.]30\n\n207[.]148[.]64[.]239\n\n45[.]76[.]188[.]118\n\n45[.]77[.]16[.]91\n\n## Appendix B – MITRE ATT&CK Techniques\n\nWithin this campaign, we have observed the following MITRE ATT&CK techniques.\n\n\nT1071 Application Layer\nProtocol\n\nT1059 Command and\nScripting Interpreter\n\nT1543 Create or Modify\nSystem Process\n\nT1140 Deobfuscate/Decode\nFiles or Information\n\nT1574 Hijack Execution\nFlow\n\n\nHTTP/DNS requests are used in the C&C traffic\n\nA reverse shell can be made by PlugX\n\nOne persistence option is a system service\n\nThe API hashing and encrypted stack strings are\nobfuscation types. The decrypted Talisman payload is\ndecompressed before it is used\n\nThe sideloading of the described DLL\n\n\nT1056 Input Capture Keylogging capabilities\n\nT1036 Masquerading The registered task/service pretends to be benign by\nname\n\nT1106 Modify Registry The runkey which is made when persisting via the registry\n\nT1106 Native API Windows API functions are called directly\n\n\nT1095 Non-Application\nLayer Protocol\n\n\nPlugX can work directly with TCP/UDP packets\n\n\nT1057 Process Discovery Iterates over all processes\n\nT1012 Query Registry Queries the registry to check for values\n\n\n-----\n\nT1113 Screen Capture Can capture the screen of the victim\n\n\nT1049 System Network\nConnections\nDiscovery\n\n\nPossible via the embedded “netstat” module\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-28 - PlugX- A Talisman to Behold.pdf"
    ],
    "report_names": [
        "2022-03-28 - PlugX- A Talisman to Behold.pdf"
    ],
    "threat_actors": [
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c09dd7ba-3b6c-4a02-9ae6-949b0afc0b16",
            "created_at": "2023-01-06T13:46:38.907191Z",
            "updated_at": "2025-03-27T02:00:02.947836Z",
            "deleted_at": null,
            "main_name": "NOMAD PANDA",
            "aliases": [],
            "source_name": "MISPGALAXY:NOMAD PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbb1ee4e-bbe9-44de-8f46-8e7fec09f695",
            "created_at": "2022-10-25T16:07:24.120424Z",
            "updated_at": "2025-03-27T02:02:10.112981Z",
            "deleted_at": null,
            "main_name": "RedFoxtrot",
            "aliases": [
                "Moshen Dragon",
                "Nomad Panda",
                "TEMP.Trident"
            ],
            "source_name": "ETDA:RedFoxtrot",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Fucobha",
                "GUNTERS",
                "Gen:Trojan.Heur.PT",
                "Icefog",
                "Impacket",
                "Kaba",
                "Korplug",
                "PCShare",
                "POISONPLUG.SHADOW",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "XShellGhost",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535635,
    "ts_updated_at": 1743041759,
    "ts_creation_date": 1653709886,
    "ts_modification_date": 1653709886,
    "files": {
        "pdf": "https://archive.orkl.eu/5f4f31eb0b37b138a19beb86e3cdf0959bc50f63.pdf",
        "text": "https://archive.orkl.eu/5f4f31eb0b37b138a19beb86e3cdf0959bc50f63.txt",
        "img": "https://archive.orkl.eu/5f4f31eb0b37b138a19beb86e3cdf0959bc50f63.jpg"
    }
}