{
    "id": "75dcd7a4-b353-4aed-808a-b96678a77484",
    "created_at": "2022-10-25T16:48:16.591423Z",
    "updated_at": "2025-03-27T02:16:21.016731Z",
    "deleted_at": null,
    "sha1_hash": "94d04c5da4ed33cd78d033ad371aa8472e53d701",
    "title": "Suspected Russian Spyware Turla Targets Europe, United States",
    "authors": "Reuters",
    "file_creation_date": "2014-03-07T21:20:09Z",
    "file_modification_date": "2014-03-07T21:20:09Z",
    "file_size": 268095,
    "plain_text": "**» Print**\n\nThis copy is for your personal, non-­commercial use only. To order presentation-­ready copies for distribution to colleagues,\nclients or customers, use the Reprints tool at the top of any article or visit: www.reutersreprints.com.\n\n# Suspected Russian spyware Turla targets Europe, United States\n\n2:45pm EST\n\nBy Peter Apps and Jim Finkle\n\nLONDON/BOSTON (Reuters) -­ A sophisticated piece of spyware has been\nquietly infecting hundreds of government computers across Europe and\nthe United States in one of the most complex cyber espionage programs\nuncovered to date.\n\nSeveral security researchers and Western intelligence officers say they\nbelieve the malware, widely known as Turla, is the work of the Russian\ngovernment and linked to the same software used to launch a massive\nbreach on the U.S. military uncovered in 2008.\n\nIt was also linked to a previously known, massive global cyber spying\noperation dubbed Red October targeting diplomatic, military and nuclear\nresearch networks.\n\nThose assessments were based on analysis of tactics employed by hackers, along with technical indicators and the victims\nthey targeted.\n\n\"It is sophisticated malware that's linked to other Russian exploits, uses encryption and targets western governments. It has\nRussian paw prints all over it,\" said Jim Lewis, a former U.S. foreign service officer, now senior fellow at the Center for\nStrategic and International Studies in Washington.\n\nHowever, security experts caution that while the case for saying Turla looks Russian may be strong, it is impossible to confirm\nthose suspicions unless Moscow claims responsibility. Developers often use techniques to cloud their identity.\n\nThe threat surfaced this week after a little known German anti-­virus firm, G Data, published a report on the virus, which it\ncalled Uroburos, the name text in the code that may be a reference to the Greek symbol of a serpent eating its own tail.\n\nExperts in state-­sponsored cyber attacks say that Russian government-­backed hackers are known for being highly\ndisciplined, adept at hiding their tracks, extremely effective at maintaining control of infected networks and more selective in\nchoosing targets than their Chinese counterparts.\n\n\"They know that most people don't have either the technical knowledge or the fortitude to win a battle with them. When they\nrecognize that someone is onto them, they just go dormant,\" said one expert who helps victims of state-­sponsored hacking.\n\nA former Western intelligence official commented: \"They can draw on some very high grade programmers and engineers,\nincluding the many who work for organized criminal groups, but also function as privateers.\"\n\nRussia's Federal Security Bureau declined comment as did Pentagon and U.S. Department of Homeland Security officials.\n\nOn Friday, Britain's BAE Systems Applied Intelligence -­ the cyber arm of Britain's premier defense contractor -­ published its\nown research on the spyware, which it called \"snake.\"\n\nThe sheer sophistication of the software, it said, went well beyond that previously encountered -­ although it did not attribute\nblame for the attack.\n\n\"The threat... really does raise the bar in terms of what potential targets, and the security community in general, have to do to\nkeep ahead of cyber attacks,\" said Martin Sutherland, managing director of BAE Systems Applied Intelligence.\n\nNATO NATIONS TARGETED\n\nSecurity firms have been monitoring Turla for several years.\n\nSymantec Corp estimates up to 1,000 networks have been infected by Turla and a related virus, Agent.BTZ. It named no\nvictims, saying only that most were government computers.\n\nBAE said it has collected over 100 unique samples of Turla since 2010, including 32 from Ukraine, 11 from Lithuania and 4\nfrom Great Britain. It obtained smaller numbers from other countries.\n\nHackers use Turla to establish a hidden foothold in infected networks from which they can search other computers, store\nstolen information, then transmit data back to their servers.\n\n\"While it seems to be Russian, there is no way to know for sure,\" said Mikko Hypponen, chief research officer with Helsinki-­\n\n\n-----\n\nEuropean governments have long welcomed U.S. help against Kremlin spying, but were infuriated last year to discover the\nscale of surveillance by America's National Security Agency that stretched also to their own territory.\n\nAGENT.BTZ, RED OCTOBER\n\nSecurity experts say stealthy Turla belongs to the same family as one of the most notorious pieces of spyware uncovered to\ndate: Agent.BTZ. It was used in a massive cyber espionage operation on U.S. Central Command that surfaced in 2008 and is\none of the most serious U.S. breaches to date. While Washington never formally attributed blame, several U.S. officials have\ntold Reuters they believed it was the work of Russia.\n\nHypponen said Agent.BTZ was initially found in a military network of a European NATO state in 2008, but gave no details. F-­\nSecure is credited with naming that piece of malware in 2008, though researchers believe it was created already in 2006.\n\nKaspersky Lab researcher Kurt Baumgartner said he believes Turla and Agent.BTZ are related to Red October, which\nsuddenly shut down after his firm reported on it in January 2013.\n\n\"Unusually unique artifacts link Red October, Agent.BTZ and Turla,\" he said, referring to strings of text contained in the code\nand functionality of the malware.\n\nEric Chien, technical director with Symantec Security Response, described Turla as \"the evolution\" of Agent.BTZ. \"They are a\nvery active development group,\" Chien said.\n\nFinland said its Foreign Ministry computer systems had been penetrated by an attack last year but would not elaborate.\n\nSweden's National Defence Radio Establishment said cyber espionage was \"more common than people think\", adding that it\nhad discovered multiple attacks against authorities, governments and universities, some only detected after several years.\n\nGovernment sources in the Czech Republic, Estonia, Poland and Romania said Turla had not affected them directly. Other\nEuropean governments contacted by Reuters declined comment.\n\nCHASING TURLA\n\nAlthough computer security researchers have been quietly studying Turla for more than two years, public discussions of the\nthreat only began after G Data published its report.\n\nG Data spokesman Eddy Willems declined to name any victims or identify the author of the report, saying the firm was\nconcerned the group behind Turla might attempt to harm him.\n\nJaime Blasco, director of AlienVault Labs, said that Turla was more of a \"framework\" for espionage than simply malware.\n\nThe malware is a \"root kit\" that hides the presence of the spying operation and also creates a hidden, encrypted file system to\nstore stolen data and tools used by the attackers, he said. Those tools include password stealers, tiny programs for gathering\ninformation about the system and document stealers.\n\nThe operators can download specialized tools onto an infected system, adding any functionality they want by including it in\nthe encrypted file system, Blasco said.\n\nThey have used dozens of different \"command and control\" servers located in countries around the world to control infected\nsystems, according to Symantec, whose researchers have helped identify and shut down some of those systems.\n\nResearchers say Turla's code is regularly updated, including changes to avoid detection as anti-­virus companies detect new\nstrains. BAE said it had two samples created in January 2014.\n\nChien said that in some cases when a command and control server was taken offline, Turla's operators have quickly pushed\nout new versions of the malware that directed infected computers to new command and control servers.\n\n\"They have a super active development team,\" he said.\n\n(Additional reporting by Jan Strouhal in Prague, Marcin Goeetig in Warsaw, Guy Faulconbridge in London, Zoran\nRadosavljevic in Zagreb, Gwladys Fouche in Oslo, Matthias Williams in Bucharest, Gabriela Baczynska in Moscow,\nAlexandra Hudson in Berlin, Johan Sennero in Stockholm, Phil Stewart in Washington;; Editing by Richard Valdmanis and\nRalph Boulton)\n\n© Thomson Reuters 2014. All rights reserved. Users may download and print extracts of content from this website for their\nown personal and non-­commercial use only. Republication or redistribution of Thomson Reuters content, including by\nframing or similar means, is expressly prohibited without the prior written consent of Thomson Reuters. Thomson Reuters\nand its logo are registered trademarks or trademarks of the Thomson Reuters group of companies around the world.\n\nThomson Reuters journalists are subject to an Editorial Handbook which requires fair presentation and disclosure of relevant\ninterests.\n\nThis copy is for your personal, non-­commercial use only. To order presentation-­ready copies for distribution to colleagues,\nclients or customers, use the Reprints tool at the top of any article or visit: www.reutersreprints.com.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/n9zt53c246ltmhhjkcfay9xq8mee09yo",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.03.08.Russian_spyware_Turla/Reuters_Turla.pdf"
    ],
    "report_names": [
        "Reuters_Turla"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041781,
    "ts_creation_date": 1394227209,
    "ts_modification_date": 1394227209,
    "files": {
        "pdf": "https://archive.orkl.eu/94d04c5da4ed33cd78d033ad371aa8472e53d701.pdf",
        "text": "https://archive.orkl.eu/94d04c5da4ed33cd78d033ad371aa8472e53d701.txt",
        "img": "https://archive.orkl.eu/94d04c5da4ed33cd78d033ad371aa8472e53d701.jpg"
    }
}