{
    "id": "76a850fa-43dc-4ac7-a4b8-6692594844c5",
    "created_at": "2023-01-12T15:07:43.592736Z",
    "updated_at": "2025-03-27T02:06:05.129395Z",
    "deleted_at": null,
    "sha1_hash": "4362f97f25793e70c58f5bd591d08777134f7ee4",
    "title": "2015-04-09 - The Banking Trojan Emotet- Detailed Analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T19:31:27Z",
    "file_modification_date": "2022-05-28T19:31:27Z",
    "file_size": 946216,
    "plain_text": "# The Banking Trojan Emotet: Detailed Analysis\n\n**[securelist.com/analysis/publications/69560/the-banking-trojan-emotet-detailed-analysis/](https://securelist.com/analysis/publications/69560/the-banking-trojan-emotet-detailed-analysis/)**\n\nAuthors\n\n[Alexey Shulmin](https://securelist.com/author/alexeyshulmin/)\n\n## Introduction\n\n[In the summer of 2014, the company Trend Micro announced the detection of a new threat –](https://blog.trendmicro.com/trendlabs-security-intelligence/new-banking-malware-uses-network-sniffing-for-data-theft/)\nthe banking Trojan Emotet. The description indicated that the malware could steal bank\naccount details by intercepting traffic. We call this modification version 1.\n\nIn the autumn of that year a new version of Emotet was found. It caught our attention for the\nfollowing reasons:\n\nThe developers of this Trojan had begun to use technology that stole money\nautomatically from victims’ bank accounts – so called “Automatic Transfer System\n(ATS)”.\nThe Trojan had a modular structure: it contained its own installation module, a banking\nmodule, a spam bot module, a module for stealing address books from MS Outlook\nand a module for organizing DDoS attacks (Nitol DDoS bot).\nThe creators made a significant effort to remain unnoticed: they didn’t attack users in\nthe RU zone but targeted the clients of a small number of German and Austrian banks\n(other well-known banking Trojans are less discerning in their choice of target),and the\ndomain name of the ATS server changed frequently (once or several times a day).\n\n\n-----\n\nWe are going to refer to this modification as Emotet version 2. The bot contains and transfers\nthe numbers one and seven to the command and control center (C&C), which suggests that\nthe Trojan’s authors considers this variant to be version 1.7.\n\nBoth versions of the Trojan attacked clients of German and Austrian banks.\n\n#Trojan #Emotet targeted the clients of a small number of German, Austrian and Swiss\nbanks\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fthe-banking-trojan-emotet-detailed-analysis%2F69560%2F&text=%23Trojan+%23Emotet+targeted+the+clients+of+a+small+number+of+German%2C+Austrian+and+Swiss+banks)\n\nWe closely monitored Emotet version 2. In December 2014 it ceased activity and the\ncommand servers stopped responding to infected computers. We recorded the last\ncommand sent from the command centers on 10/12/2014, at 11:33:43 Moscow time.\n\nHowever, the thoroughness with which the authors had approached the development of this\nTrojan and the high level of automation in its operation, left little doubt that this was not the\nend of the story. And so it turned out – after a short break in January 2015, Emotet\n[reappeared! We are calling this modification version 3 (the bot contains and transfers the](https://www.securityweek.com/new-emotet-variant-targets-banking-credentials-german-speakers)\nnumbers one and 16 to the C&C, which we assume means that the authors consider this\nvariant to be version 1.16).\n\nIn essence, Emotet version 3 is not that different to version 2 – the main differences are\ndesigned to make the Trojan less visible. Of the changes we noted, we would like to highlight\nthe following:\n\nThe Trojan has a new built-in public RSA key and, although the communication\nprotocols with the command center are identical for Emotet versions 2 and 3, if the old\nkey is used the bot does not receive the correct answer from the command center.\nThe ATS scripts are partially cleaned of debugging information and comments.\n**New targets! Emotet is now also targeting clients of Swiss banks.**\nThere has been a slight change in the technology used to inject code into the address\nspace of explorer.exe. Version 2 used a classic model for code injection:\nOpenProcess+WriteProcessMemeory+CreateRemoteThread. Version 3 uses only two\nstages of the previous model:OpenProcess+WriteProcessMemory; and the injected\ncode is initiated with the help of modified code of the ZwClose function in the address\nspace of the explorer.exe process, which is also achieved using WriteProcessMemory.\nEmotet version 3 resists investigation: if the Trojan detects that it has been started in a\nvirtual machine it functions as usual but uses a different address list for the command\ncenters. However, all these addresses are false and are used only to mislead\ninvestigators.\nThe Trojan contains very few lines of text: all lines that could warn investigators are\nencrypted using RC4 and are decrypted in allocated memory directly before use and\ndeleted after use.\n\n\n-----\n\nOn the whole, we formed the impression that the main techniques used in version 3 of the\nbanking Trojan were developed “in the field” using version 2 as a basis, and with the addition\nof improved stealth techniques.\n\nKaspersky Lab products detect all versions of this Trojan as Trojan-Banker.Win32.Emotet.\nWe also detect the following modulesof Emotet:\n\nModule for modifying HTTP(S) traffic – Trojan-Banker.Win32.Emotet.\nSpam module – Trojan.Win32.Emospam.\nModule for the collection of email addresses – Trojan.Win32.Emograbber.\nModule for stealing email account data – Trojan-PSW.Win32.Emostealer.\nModule designed for organising DDoS attacks — Trojan.Win32.ServStart.\n\nWe have seen the last module used with other malware and assume that it was added to\nEmotet by a cryptor. It is quite possible that Emotet’s authors are totally unaware of the\npresence of this module in their malware. Whatever the case may be, the command centers\nof this module do not respond and the module has not been updated (its compilation date is\n19 October 2014).\n\n## Infection\n\nWe currently know of only one method of distribution for the Emotet banking Trojan:\ndistribution of spam mailings that include malicious attachments or links.\n\nThe attached files are usually ZIP archives containing the Emotet loader. The files in the\narchives have long names, e.g.\nrechnung_november_2014_11_0029302375471_03_44_0039938289.exe. This is done on\npurpose: a user opening the archive in a standard Windows panel might not see the\nextension .exe, as the end of the file name might not be displayed. Sometimes there is no\nattachment and the text in the main body of the email contains a link to a malicious\nexecutable file or archive.\n\n#Emotet banking #Trojan is distributed of spam mailings that include malicious\nattachments or links\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fthe-banking-trojan-emotet-detailed-analysis%2F69560%2F&text=%23Emotet+banking+%23Trojan+is+distributed+of+spam++mailings+that+include+malicious+attachments+or+links)\n\nExamples of emails used to spread Emotet are given below.\n\nVersion 2 (link to malware):\n\n\n-----\n\nVersion 2 (attached archive):\n\nVersion 3 (link to malware):\n\n\n-----\n\nThe emails we found are almost identical to ones from well-known companies – for example\nDeutsche Telekom AG and DHL International GmbH. Even the images contained in the\nmessages are loaded from the official servers telekom.de and dhl.com, respectively.\n\nWhen the email contains a link to malware, it downloads it from the addresses of\ncompromised legitimate sites:\n\nhxxp://*******/82nBRaLiv (for version 2)\nor from the addresses\nhxxp://*******/dhl_paket_de_DE and hxxp://*******/dhl_paket_de_DE (for version 3).\n\nIn Emotet version 3, when addresses are contacted with the form hxxp://*/dhl_paket_de_DE,\nthe user receives a ZIP archive of the following form\nhxxp://*/dhl_paket_de_DE_26401756290104624513.zip.\n\nThe archive contains an exe-file with a long name (to hide the extension) and a PDF\ndocument icon.\n\n## Loading the Trojan\n\n\n-----\n\nThe Trojan file is packed by a cryptor, the main purpose of which is to avoid detection by\nanti-virus programs. After being started and processed by the cryptor, control is passed to\nthe main Emotet module – the loader. This has to embed itself in the system, link with the\ncommand server, download additional modules and then run them.\n\nConsolidation in the system is fairly standard — Emotet version 2 saves itself in\n%APPDATA%\\Identities with a random name of eight characters (for example —\nwlyqvago.exe); adds itself to the autoloader\n(HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run) and then\ndeletes its source file with the help of a launched bat-file that is created in %APPDATA% with\nthe name “ms[7_random_numbers].bat.\n\nEmotet version 3 saves itself in %APPDATA%\\Microsoft\\ with a name in the format\nmsdb%x.exe” (for example – C:\\Documents and Settings\\Administrator\\Application\nData\\Microsoft\\msdbfe1b033.exe); adds itself to the autoloader\n(HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run) and then\ndeletes itself with the help of a launched bat-file (which is created in\n%APPDATA%\\del%x.bat).\n\nAfter consolidating itself in the system, Emotet obtains a list of the names of all processes\nrunning and calculates a hash from the name of every function, comparing the resulting\nvalue with the hardcoded 0xB316A779 (this hash corresponds to the process explorer.exe).\nIn this way, Emotet locates the process into which to inject itself. Further, the Trojan unpacks\nits main code and injects it into the process explorer.exe.\n\n## Communication with the command center\n\nThe main module of the Trojan, the loader, communicates with the C&C using RC4\nencryption.\n\nThe port used by the loader is hardcoded into it – 8080.\n\n### Command center addresses\n\nThe IP addresses of Emotet’s command-and-control servers are hardcoded into the bot.\nThere are several of these – one of the version 2 samples that we analyzed included 30\n(note that 3 addresses on the list below belong to well-known legitimate resources):\n\nhxxp://109.123.78.10\n\nhxxp://66.54.51.172\n\nhxxp://108.161.128.103\n\nhxxp://195.210.29.237\nhxxp://5.35.249.46\n\nhxxp://5.159.57.195\n\n\n-----\n\nhxxp://206.210.70.175\nhxxp://88.80.187.139\nhxxp://188.93.174.136\nhxxp://130.133.3.7\nhxxp://162.144.79.192\nhxxp://79.110.90.207\nhxxp://72.18.204.17\nhxxp://212.129.13.110\nhxxp://66.228.61.248\nhxxp://193.171.152.53\nhxxp://129.187.254.237\nhxxp://178.248.200.118\nhxxp://133.242.19.182\nhxxp://195.154.243.237\nhxxp://80.237.133.77\nhxxp://158.255.238.163\nhxxp://91.198.174.192\nhxxp://46.105.236.18\nhxxp://205.186.139.105\nhxxp://72.10.49.117\nhxxp://133.242.54.221\nhxxp://198.1.66.98\nhxxp://148.251.11.107\nhxxp://213.208.154.110\n\nIn the sample of version 3 we investigated there were 19 command centers:\n\nhxxp://192.163.245.236\nhxxp://88.80.189.50\nhxxp://185.46.55.88\nhxxp://173.255.248.34\nhxxp://104.219.55.50\nhxxp://200.159.128.19\nhxxp://198.23.78.98\nhxxp://70.32.92.133\nhxxp://192.163.253.154\nhxxp://192.138.21.214\nhxxp://106.187.103.213\nhxxp://162.144.80.214\nhxxp://128.199.214.100\nhxxp://69.167.152.111\nhxxp://46.214.107.142\nhxxp://195.154.176.172\n\n\n-----\n\nhxxp://106.186.17.24\nhxxp://74.207.247.144\nhxxp://209.250.6.60\n\n### Communication with the C&C when run in a virtual machine\n\nEmotet version 3 contains another list of “command center” addresses, as given below:\n\nhxxp://142.34.138.90\n\nhxxp://74.217.254.29\n\nhxxp://212.48.85.224\n\nhxxp://167.216.129.13\nhxxp://91.194.151.38\n\nhxxp://162.42.207.58\n\nhxxp://104.28.17.67\n\nhxxp://8.247.6.134\n\nhxxp://5.9.189.24\n\nhxxp://78.129.213.41\n\nhxxp://184.86.225.91\n\nhxxp://107.189.160.196\n\nhxxp://88.208.193.123\nhxxp://50.56.135.44\n\nhxxp://184.106.3.194\n\nhxxp://185.31.17.144\n\nhxxp://67.19.105.107\n\nhxxp://218.185.224.231\n\nThe Trojan tries to contact these addresses if it detects that it is being run in a virtual\nmachine. But none of the addresses correspond to the bot’s command centers, and the bot\nis therefore unsuccessful in trying to establish contact with them. This is probably done to\nconfuse any investigators and give them the impression that the Trojan command centers\nare dead. A similar approach was used previously in the high-profile banking Trojan, Citadel.\n\n#Trojan #Emotet tries to contact the wrong addresses of the C&C if it is being run in a\nvirtual machine\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fthe-banking-trojan-emotet-detailed-analysis%2F69560%2F&text=%23Trojan+%23Emotet+tries+to+contact+the+wrong+addresses+of+the+C%26amp%3BC+if+it+is+being+run+in+a+virtual+machine)\n\nThe detection of a virtual machine is organized quite simply — by the names of processes\nthat are usual for various virtual machines. The following algorithm is used to calculate a\nhash value from the name of every process in the system:\n\n\n-----\n\n_Algorithm for calculation of a hash value from a process name_\n\nThe resulting hash value is then compared with a list of values hardcoded into the Trojan:\n\n_Hashes from the names of processes used for the detection of virtual machines_\n\nWe derived the names of the processes for several hashes. For example, hash 0xBCF398B5\ncorresponds to the process vboxservice.exe, hash 0x2C967737 to the process\nvmacthlp.exe, hash 0xE3EBFE44 to the process vmtoolsd.exe, and 0x61F15513 to the\nprocess vboxtray.exe.\n\n### Data transferred\n\nA request to the command center appears in the traffic as follows (the example given is from\nversion 2, but a version 3 request looks the same):\n\n\n-----\n\n_Dialogue between the Emotet bot and its command center_\n\nThe URL-path that the bot communicates with appears as follows: /722ffc5e/355c7a0a/,\nwhere 722ffc5e is a number calculated on the basis of information from the access marker of\nthe user, and 0x355c7a0a = 0x722ffc5e xor 0x47738654 (the value 0x47738654 is\nhardcoded into the bot).\n\nThe data sent by the bot and the command center are encrypted using RC4 and the answers\nreceived from the command center are signed with a digital signature. Probably this is done\nto make it difficult to seize control over the botnet: in order for the bot to accept a packet it\nmust be signed and for that it is necessary to know the secret key.\n\nThere is a public RSA key in the body of the bot. In PEM format for version 2 it appears as\nfollows:\n\n\n-----\n\n_PEM representation of the open RSA key coded into the bot in version 2_\n\nAs noted above, in version 3 the key changed. In PEM format it looks like this:\n\n_PEM representation of the open RSA key coded into the bot in version 3_\n\nA packet sent to the server is made up as follows:\n\nA request is generated containing the identifier of the infected computer, a value\npresumably indicating the version of the bot; information about the system (OS version,\nservice pack version, product type); a hardcoded dword (value in the investigated\nsample — seven); control sums for the banker module; and information about the webinjects. Information about the web-injects contains: a page address (with jokers), into\nwhich the injection is needed; data coming before the injected data; data coming after\ninjected data; and injected data.\nAn SHA1 hash is calculated from the generated request.\nThe request is encrypted with a randomly generated 128 bit RC4 key.\nThe generated RC4 key is encrypted using the public RSA key.\nThe total packet is the concatenation of the results obtained at steps 4, 2 and 3.\n\nThe request packet can be represented by the following diagram:\n\n_Structure of a request from the bot to the server_\n\n\n-----\n\nIn response the server sends a packet with the following structure:\n\n_Structure of the server’s answer to the bot_\n\nThe answer can contain information about the Emotet web-injects, Emotet modules and links\nfor loading external modules (for example a spam bot or an updated loader).\n\n## Modules\n\nLike most modern banking Trojans, Emotet has a modular structure. To date we have\ndetected the following modules:\n\n**Name** **Description** **Method of delivery to**\n**infected system**\n\n**loader** loader In spam emails or by\ndownloading via a link\nfrom a compromised\nsite (for updates).\n\n**nitol-like-ddos-module** DDoS-bot\n\n**mss** Spam module Downloaded from\ncompromised sites by\nthe loader module.\n\n\n**email_accounts_grabber** Email account grabber, uses Mail\nPassView – a legitimate program\ndesigned for recovering forgotten\npasswords and mail accounts\n\n**banker** Module for modifying HTTP(S)traffic\n\n\nReceived by the\nloader module in the\nanswer packet from\nthe command center.\n\nReceived by the\nloader module in the\nanswer packet from\nthe command center.\n\n\n**outlook_grabber** Outlook address book grabber Received by the\nloader module in the\nanswer packet from\nthe command center.\n\nSeveral modules can work independently of the loader module, as they don’t need to import\nanything from it.\n\n\n-----\n\nThe whole arrangement of the bot is evidence of a high level of automation: new email\naddresses are collected automatically from the victims’ address books, spam with the Emotet\nloader is sent automatically, and money is transferred automatically from the user. Operator\nparticipation is kept to a minimum.\n\nAs an example, here is the report of the outlook_grabber module sent to the attacker (from\nEmotet version 2) with a stolen Outlook address book:\n\n_A stolen Outlook address book, transferred to the criminals’ server_\n\nOne positive note is that when trying to contact one of the attackers’ servers an answer is\nobtained containing “X-Sinkhole: Malware sinkhole”, meaning that the stolen data will not\nreach the criminals — this domain, which is used by Emotet version 2, is no longer controlled\nby the authors of the Trojan.\n\nHowever, for version 3 things are different. This is how the report of the\nemail_accounts_grabber module appears for Emotet version 3:\n\n\n-----\n\n_Report containing data about the user’s email accounts_\n\nIt is clear that the server answers “200 OK”. This means that the criminals have successfully\nreceived the data.\n\n## Stand and Deliver!\n\nInformation about the data for injection into the page that is received by Emotet after\nunpacking appears as follows:\n\n\n-----\n\n_Decrypted data on the web-injects of Emotet version 2_\n\n_Decrypted data in the web-injects of Emotet version 3_\n\n**The significant difference in data on injects between the two versions is as follows:**\n**Emotet version 3 is aimed at the clients of Swiss credit organizations. To date we have**\nnot seen scripts for the automatic stealing of money from clients’ accounts in these credit\norganizations but we are certain that such scripts will be written soon.\n\nAlthough individual fragments of HTML code in the decrypted packet can be read easily,\nunderstanding the rules for use of the web-injects from the deciphered data is difficult.\nBelow, in JSON format, several web-inject rules are given for one target — the site of a\nGerman bank (Emotet version 2).\n\n\n-----\n\n_The web-inject rules for the site of a German bank (Emotet version 2)_\n\nThe use of this web-inject leads to the creation of a new element of type ‘div’, which will have\nthe size of the whole visible page, and to the addition of a new script in the HTML document.\nIn the example given the script is loaded from the address hxxps://*******.eu/birten/luck.php?\nlnk=js&id=44.\n\nAnd an analogous view of several inject rules for a new target — the site of a large Austrian\nbank (Emotet version 3).\n\n_The web-inject rules for the site of an Austrian bank (Emotet version 3)_\n\nIt is clear that the configuration file with the web-injects has a classic structure, using fields\nconventionally called data_before, data_after and data_inject.\n\nIt should be noted that the address of the host on which the file luck.php (for version 2) and\na_00.php (for version 3) is located is changed frequently. The rest of the address of the\nscript is constant.\n\nIf the investigator tries the script directly, only an error message is received. However, in a\nreal attack when the line\n\n\n-----\n\nis added to the real bank page, the script loads successfully.\n\nThis happens because the criminals’ server checks the “Referer” field of the header of the\nHTTP request and sends the script only if the request came from a page of one of the banks\nattacked by Emotet.\n\nHaving supplied the necessary Referrer one can easily obtain the script code.\n\nAt Kaspersky Lab we obtained scripts designed for injection into the pages of the attacked\nbanks.\n\nTable 1. Targets of Emotet version 2, types of attacks and the identification numbers of\nscripts loaded for carrying out these attacks.\n\nTable 2. Targets of Emotet version 3, types of attacks and the identification numbers of\nscripts loaded for carrying out these attacks.\n\n\n-----\n\nIn one of the scripts of Emotet version 2 that was used to attack a German bank the\ncomments contain the following line:\n\n_Artifact from the script for an attack on a German bank (Emotet version 2)_\n\nClearly the script developers speak Russian.\n\n## Getting round two-factor authentication\n\nThe main purpose of the scripts looked at above is to carry out the illicit transfer of money\nfrom the user’s account. However the bot cannot independently get round the system of\ntwo-factor authentication (Chip TAN or SMS TAN), it needs the user’s help. To mislead the\npotential victim, social engineering techniques are used: the message injected into the\nwebpage using the script informs the user that the site is introducing a new security system\nand normal operations cannot be continued until the user has tested it in the demo-regime.\n\n\n-----\n\n_False message about new security system_\n\nThis is followed by a request to enter real data from the Chip TAN or SMS TAN to carry out\na “test transfer”:\n\nAnd finally – congratulations that the task has been completed successfully:\n\n\n-----\n\nIn fact, instead of a test transfer the malicious script carries out a real transfer of money from\nthe victim’s account to the account of a nominated person — the so-called “drop”, and the\nuser themselves confirms this transfer using the Chip TAN or SMS TAN.\n\nDetails of the accounts for the transfer of the stolen money are not initially indicated in the\nscript, but are received from the command server of the criminals using a special request. In\nreply the command server returns a line with information about the “drop” for each specific\ntransaction. In the comments in one script we found the following line:\n\nClearly the criminals tested this script with a transfer of 1500.9 EUR to a test account.\n\nIn addition, this script contained the following information about the drop:\n\nIn the corresponding script in Emotet version 3, designed to attack the same bank, we also\nfound information on the drop, but this time another one:\n\n\n-----\n\nLet s compare the fields JSON __DropParam and the fields in the legitimate form from a\ndemo-access to the online system of the attacked bank.\n\n_Online banking form for transfer of money within Germany or in the SEPA zone_\n\nTable 3. Relationship between the drop data and the fields in the form for transfer of money\nand explanations of these fields\n\n\n**Name of**\n**fields in the**\n**__DropParam**\n**JSON**\n\n\n**Name of**\n**corresponding**\n**field in the form**\n\n\n**Translation** **Field contents**\n\n\nname Empfängername Name of\nrecipient\n\n\nReal name of drop who will\nreceive the stolen money\n\n\n-----\n\nibanorkonto IBAN/Konto-Nr. International\nbank account\nnumber/\naccount\nnumber\n\nbicorblz BIC/BLZ BIC or BLZ\ncode\n\n\nAccount number, international or\nlocal, to which money will be\ntransferred\n\nInternational bank identification\ncode or identification code used\nby German and Austrian banks\n(Bankleitzahl)\n\n\ndescription Verwendungszweck Purpose Purpose of payment\n\namount Betrag Amount Transferred amount\n\nThe JSON __DropParam fields correspond to the fields in the form.\n\nIn this way the bot receives all the necessary information about the drop from its server and\ndraws up a transfer to it, and the misled user confirms the transfer using the Chip TAN or\nSMS TAN and waves goodbye to their money.\n\n## Conclusion\n\nThe Emotet Trojan is a highly automated and developing, territorially-targeted bank threat. Its\nsmall size, the dispersal methods used and the modular architecture, all make Emotet a very\neffective weapon for the cyber-criminal.\n\nThe #Emotet #Trojan is a highly automated and developing, territorially-targeted bank\nthreat\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fthe-banking-trojan-emotet-detailed-analysis%2F69560%2F&text=The+%23Emotet+%23Trojan+is+a+highly++automated+and+developing%2C+territorially-targeted+bank+threat)\n\nHowever this banking Trojan doesn’t incorporate conceptually new technology and so the\nuse of a modern anti-virus program can provide an effective defense against the threat.\n\nFurthermore, the Trojan cannot function effectively without the participation of the user — the\nEmotet creators have actively used social engineering techniques to achieve their criminal\nends.\n\nAnd so the alertness and technical awareness of the user, together with the use of a modern\nanti-virus program can provide reliable protection against not only Emotet but other` new\nbanking threats working in a similar way.\n\n## Some MD5 hashes\n\n\n-----\n\nEmotet version 2:\n7c401bde8cafc5b745b9f65effbd588f\n34c10ae0b87e3202fea252e25746c32d\n9ab7b38da6eee714680adda3fdb08eb6\nae5fa7fa02e7a29e1b54f407b33108e7\n1d4d5a1a66572955ad9e01bee0203c99\ncdb4be5d62e049b6314058a8a27e975d\n642a9becd99538738d6e0a7ebfbf2ef6\naca8bdbd8e79201892f8b46a3005744b\n9b011c8f47d228d12160ca7cd6ca9c1f\n6358fae78681a21dd26f63e8ac6148cc\nac49e85de3fced88e3e4ef78af173b37\nc0f8b2e3f1989b93f749d8486ce6f609\n1561359c46a2df408f9860b162e7e13b\na8ca1089d442543933456931240e6d45\n\nEmotet version 3:\n177ae9a7fc02130009762858ad182678\n1a6fe1312339e26eb5f7444b89275ebf\n257e82d6c0991d8bd2d6c8eee4c672c7\n3855724146ff9cf8b9bbda26b828ff05\n3bac5797afd28ac715605fa9e7306333\n3d28b10bcf3999a1b317102109644bf1\n4e2eb67aa36bd3da832e802cd5bdf8bc\n4f81a713114c4180aeac8a6b082cee4d\n52f05ee28bcfec95577d154c62d40100\n772559c590cff62587c08a4a766744a7\n806489b327e0f016fb1d509ae984f760\n876a6a5252e0fc5c81cc852d5b167f2b\n94fa5551d26c60a3ce9a10310c765a89\nA5a86d5275fa2ccf8a55233959bc0274\nb43afd499eb90cee778c22969f656cd2\nb93a6ee991a9097dd8992efcacb3b2f7\nddd7cdbc60bd0cdf4c6d41329b43b4ce\ne01954ac6d0009790c66b943e911063e\ne49c549b95dbd8ebc0930ad3f147a4b9\nea804a986c02d734ad38ed0cb4d157a7\n\nThe author would like to express his thanks to Vladimir Kuskov, Oleg Kupreev and Yury\nNamestnikov for their assistance in the preparation of this article.\n\n[Cybercrime](https://securelist.com/tag/cybercrime/)\n[Emotet](https://securelist.com/tag/emotet/)\n\n\n-----\n\n[Trojan Banker](https://securelist.com/tag/trojan-banker/)\n\nAuthors\n\n[Alexey Shulmin](https://securelist.com/author/alexeyshulmin/)\n\nThe Banking Trojan Emotet: Detailed Analysis\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-04-09 - The Banking Trojan Emotet- Detailed Analysis.pdf"
    ],
    "report_names": [
        "2015-04-09 - The Banking Trojan Emotet- Detailed Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536063,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1653766287,
    "ts_modification_date": 1653766287,
    "files": {
        "pdf": "https://archive.orkl.eu/4362f97f25793e70c58f5bd591d08777134f7ee4.pdf",
        "text": "https://archive.orkl.eu/4362f97f25793e70c58f5bd591d08777134f7ee4.txt",
        "img": "https://archive.orkl.eu/4362f97f25793e70c58f5bd591d08777134f7ee4.jpg"
    }
}