{
    "id": "7700cb5f-01ef-4a87-b42c-cf82259685a9",
    "created_at": "2023-01-12T15:10:13.112302Z",
    "updated_at": "2025-03-27T02:13:33.745337Z",
    "deleted_at": null,
    "sha1_hash": "7d655727d9e5f37fe4c483e2a78351ef28e8e03d",
    "title": "2021-05-20 - Phorpiex morphs- How a longstanding botnet persists and thrives in the current threat environment",
    "authors": "",
    "file_creation_date": "2022-05-28T23:12:03Z",
    "file_modification_date": "2022-05-28T23:12:03Z",
    "file_size": 549745,
    "plain_text": "# Phorpiex morphs: How a longstanding botnet persists and thrives in the current threat environment\n\n**[microsoft.com/security/blog/2021/05/20/phorpiex-morphs-how-a-longstanding-botnet-persists-and-thrives-in-the-current-threat-environment/](https://www.microsoft.com/security/blog/2021/05/20/phorpiex-morphs-how-a-longstanding-botnet-persists-and-thrives-in-the-current-threat-environment/)**\n\nMay 20, 2021\n\nPhorpiex, an enduring botnet known for extortion campaigns and for using old-fashioned worms that spread via removable\nUSB drives and instant messaging apps, began diversifying its infrastructure in recent years to become more resilient and to\ndeliver more dangerous payloads. Today, the Phorphiex botnet continues to maintain a large network of bots and generates\nwide-ranging malicious activities.\n\nThese activities, which traditionally included extortion and spamming activities, have expanded to include cryptocurrency\nmining. From 2018, we also observed an increase in data exfiltration activities and ransomware delivery, with the bot installer\nobserved to be distributing Avaddon, Knot, BitRansomware (DSoftCrypt/ReadMe), Nemty, GandCrab, and Pony ransomware,\namong other malware.\n\nThe botnet’s geographic targeting for bot distribution and installation expanded, too. Previous campaigns focused on targets\nin Japan, but more recent activity showed a shift to a more global distribution.\n\n\n-----\n\n_Figure 1. Global distribution of Phorpiex botnet activity_\n\nThe Phorpiex botnet has a reputation for being simplistic and lacking robustness, and it has been hijacked by security\nresearchers in the past. Its tactics, techniques, and procedures (TTPs) have remained largely static, with common commands,\nfilenames, and execution patterns nearly unchanged from early 2020 to 2021. To support its expansion, however, Phorpiex\nhas shifted some of its previous command-and-control (C2) architecture away from its traditional hosting, favoring domain\ngeneration algorithm (DGA) domains over branded and static domains.\n\nThis evolution characterizes the role of botnets in the threat landscape and the motivation of attackers to persist and remain\neffective. The threat ecosystem relies on older botnets with large and diverse network of compromised machines to deliver\npayloads at low costs. And while many of the older botnet architectures have been primarily classified as spam delivery\nmechanisms, these infrastructures are critical for newer, modular delivery mechanisms.\n\nPhorpiex also demonstrates that bots, which are some of oldest types of threats, continue to affect consumer users but\nnotably brings increasingly more serious threats to enterprise networks. Despite being traditionally associated with lower-risk\nactivity like extortion and spamming, Phorpiex operators’ decision to move to more impactful malware and actions is entirely\nat the whim of the attackers.\n\nUnderstanding botnets and associated infrastructure, botnet malware, their activities and payloads, and how they evolve\nprovides insight into attacker motivation and helps ensure durable protection against some of the most prevalent threats\ntoday. At Microsoft, we continue to conduct in-depth research into these threats. These expert investigations add to the\nmassive threat intelligence that inform Microsoft 365 Defender services and the protections they provide. Microsoft 365\nDefender delivers coordinated cross-domain defense against the various malware, emails, network connections, and\nmalicious activity associated with Phorpiex and other botnets.\n\n## Distribution, expansion, and operation\n\nPhorpiex’s sprawling botnet operation can be divided into three main portions:\n\n1. Distribution of the bot loader: The bot loader has been propagated through a variety of means over the years, including\n\nbeing loaded by other malware, freeware, and unwanted programs, or delivered by phishing emails from alreadyinfected bots. Phorpiex has also spread via productivity platforms, as well as via instant messaging and USB drives.\n2. Mailing botnet: In addition to spreading the bot loader via email, the botnet is used to generate currency. It does so via\n\nextortion and spam campaigns as well as through a variety of other types of financially motivated malware.\n3. Malware delivery botnet: In recent years, the botnet has been observed installing ransomware, cryptocurrency miner,\n\nand other malware types, indicating the expansion of the botnet’s activities by the Phorpiex operators or as part of\nmalware-as-a-service scheme.\n\n\n-----\n\nFrom December 2020 to February 2021, the Phorpiex bot loader was encountered in 160 countries, with Mexico, Kazakhstan,\nand Uzbekistan registering the most encounters.\n\n_Figure 2. Countries with the most encounters of the Phorpiex bot loader_\n\nIn December 2020 and January 2021, we observed non-weaponized staging of Knot ransomware on Phorpiex servers. In\n[February, we also detected commodity malware such as Mondfoxia (also known as DiamondFox) in these servers. These](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/Mondfoxia!MTB&threatId=-2147201063)\nrecent developments indicate new loader and monetization strategies under active development.\n\nThe combination of the wide variety of infection vectors and outcomes makes the Phorpiex botnet appear chaotic at first\nglance. However, for many years Phorpiex has maintained a consistent internal infrastructure using similar domains,\ncommand-and-control (C2) mechanisms, and source code.\n\nThe wide range of infection vectors used by Phorpiex requires a unified security approach that ensures protection is delivered\n[on the endpoint, network, email, and applications. Microsoft 365 Defender’s advanced threat protection technologies detect](https://aka.ms/m365d)\nmalicious activity in each of these domains. Moreover, the correlation of these cross-domain threat data surfaces additional\nmalicious activity, allowing Microsoft 365 Defender to provide coordinated and comprehensive protection against Phorpiex.\n\n### Bot distribution and installation\n\nPhorpiex maintains and expands its network of bot-infected computers by distributing the Phorpiex bot loader. In 2020 and\n2021 we observed the bot loader being spread through Phorpiex bot-delivered emails with .zip or other archive file\nattachments, downloaded from fake download sites for software (such as photo editing software, screensaver, or media\nplayers), or downloaded by other malware also delivered through email. These multiple entry points demonstrate the modular\nnature of the malware economy.\n\nRegardless of distribution mechanism, however, the bot loader operates in a fairly uniform fashion. It uses three distinct types\nof C2 to fulfil different goals during and after installation:\n\nDownloading the Phorpiex malware implant\nDownloading updates to the Phorpiex implant and new exploit modules\nChecking in with C2 infrastructure to deliver cryptocurrency or return data\n\nThe malware implant is initially downloaded from sites such as trik[.]ws (historically) or, more recently, a malware hosting\nrepository, worm[.]ws. We are also noticing a shift to using more dedicated IP-based C2 and delivery sites, such as\n_185[.]215[.]113[.]10 and 185[.]215[.]113[.]8. A notable Phorpiex behavior is the downloading of numbered modules, typically_\nnumbered 1-10, with URL paths such as <domain>.com/1, <domain>.com/2, <domain>.com/3, continuing this pattern for as\n\n\n-----\n\nmany additional components as needed. As these downloads do not happen through standard web traffic, network level\nprotection is necessary to prevent malicious downloads. In a very recent development, we observed that most Phorpiex bot\nloader malware have abandoned branded C2 domains and have completely moved to using IPs or DGA domains. However,\nas in the past, the operators neglected to register all the potential sites that the DGA domains resolve to.\n\nWhen downloaded and run, the implant attempts to connect to legitimate external sites like WIPMANIA.com to get IP\ninformation. It does this repeatedly during subsequent check-ins, and then begins connecting to hardcoded C2 servers.\nDuring these check-ins, the implant checks the device’s regional settings and exits if it’s operating in a non-desired region,\nsuch as Ukraine. Favored regions include countries in East Asia as well as English-speaking countries.\n\nThe loader modules and updates are pulled from a variety of attacker-owned domains. These domain-names typically begin\nwith a second-level domain (2LD) of TLDR, TSRV, or THAUS and end with an assortment of unorthodox TLD such as .WS,\n.TOP, .RU, .CO, .TO, .SU., .CC, and .IO. As has been pointed out by other researchers, the TSRV and TLDR are likely\nreferences to “Trik Server” or “Trik Loader”, as many of the internals of the malware use Trik as proprietary name.\n\nRegular connections to these attacker-owned domains continue during infection, such that devices that have been infected for\nmonths receive new loader versions and capabilities. Modules downloaded from C2 can include additional malware,\nransomware, cryptocurrency mining functionality, worming functionality, and the Phorpiex mailing botnet functionality. It is\nmost common for a bot to be participating in mailing and crypto mining, as these seem to be driving revenue generation for\nthe operators during non-ransomware initiatives.\n\nThe bot also establishes persistence and attempts to disable security controls. This includes modifying registry keys to disable\nfirewall and antivirus popups or functionality, overriding proxy and browser settings, setting the loader and executables to run\nat startup, and adding these executables to the authorized application lists. A sample of the keys changed is below, with minor\nchanges from version to version of the loader:\n\n_\\FirewallPolicy\\StandardProfile\\AuthorizedApplications\\List_\n_\\Microsoft\\Windows\\CurrentVersion\\Run\\Host Process for Windows Services_\n_\\Microsoft\\Security Center\\AntiVirusOverride_\n_\\Microsoft\\Security Center\\AntiVirusDisableNotify_\n_\\Microsoft\\Security Center\\FirewallOverride_\n_\\Microsoft\\Security Center\\FirewallDisableNotify_\n_\\Microsoft\\Windows\\CurrentVersion\\Internet Settings\\Connections\\SavedLegacySettings_\n_\\Microsoft\\Security Center\\UpdatesOverride_\n_\\Microsoft\\Security Center\\UpdatesDisableNotify_\n_\\Microsoft\\Windows NT\\CurrentVersion\\SystemRestore_\n_\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableBehaviorMonitoring_\n_\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableOnAccessProtection_\n_\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableScanOnRealtimeEnable_\n\n[Enabling tamper protection in Microsoft Defender for Endpoint prevents the bot from making modifications related to Microsoft](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/prevent-changes-to-security-settings-with-tamper-protection?view=o365-worldwide)\nDefender services. Microsoft Defender for Endpoint automatically cleans up changes made by the bot (if any) during threat\n[cleanup and remediation. Security operations teams can use advanced hunting capabilities to locate these and similar](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/advanced-hunting-overview?view=o365-worldwide)\nmodifications. Administrators can also disable “Local Policy Merge” to prevent local firewall policies from getting in effect over\ngroup policies.\n\nAs the bot loader updates, the key values change to reflect new files, randomized file paths, and masqueraded system files.\nThe example below illustrates a change from SVCHOST to LSASS:\n\n_KEY NAME: HKEY_CURRENT_USER\\[ID]\\Software\\Microsoft\\Windows\\CurrentVersion\\Run_\n_OLD VALUE: C:\\1446621146296\\svchost.exe_\n_NEW VALUE: C:\\19197205241657\\lsass.exe_\n\nAt varying intervals, the bot implant collects lists of files and exfiltrates that data to external IP addresses leased by the\nattacker, many of which also serve as C2. When additional malware is installed, the pull is initiated from the implant itself. The\nmalware is staged on the Phorpiex operators’ servers prior to new campaigns or on the shared sites such as worm[.]ws.\n\nThe bot checks in routinely, often weekly and sometimes even daily. It does this to upload any outcomes from the various\nmodules that the bot installs, such as coin mining deposits or spam activity.\n\n\n-----\n\nIn addition to detecting and blocking the bot malware through its endpoint protection platform (EPP) and endpoint detection\nand response (EDR) capabilities, Microsoft Defender for Endpoint’s network protection defends against botnet activities like\nconnecting to attacker-controlled servers, mimicking system files, and downloading implants and additional payloads.\n\n### Self-spreading via remote drives\n\nOne of the more unique and easily identifiable Phorpiex behavior when it spread primarily via USB involves a check that\noccurs routinely for all connected remote drives. The bot then creates a series of hidden folders on those drives with\nunderscores (e.g., “__”) and then changes the registry attributes to make these appear invisible to the user. The bot then\ncopies all its file configurations and include a malicious DriveMgr.exeI, a copy of the loader, as well as a .lnk file that runs the\nmalware when opened. This activity has been largely consistent since 2019. This functionality offers a self-spreading\nmechanism that offers a backup way to expand the bot implant base. Commands consistent with this Phorpiex worming\nactivity are:\n\n_ShEllExECutE=__\\\\DriveMgr.exe_\n_“cmd.exe” /c start __ & __\\DriveMgr.exe & exit_\n\nMicrosoft Defender for Endpoint offers multiple layers of protection against USB threats. This includes real-time scanning of\nremovable drives and attack surface reduction rule to block untrusted and unsigned processes that run from USB. Microsoft\n[Defender for Endpoint also enables organizations to monitor and control removable drives, for example allow or block USB](https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/control-usb-devices-using-intune?view=o365-worldwide)\nbased on granular configurations, and monitor USB activities.\n\n## Phorpiex as a mailing botnet\n\nFor several years, Phorpiex used infected machines to deliver extortion, malware, phishing, and other content through largescale email campaigns. These emails span a large set of lures, subject lines, languages, and recipients, but there are key sets\nof characteristics that can identify emails sent from the Phorpiex botnet:\n\nSpoofed sender domain, sender username, and sender display name\nSender domain of 4 random digits\nSender username using a generic name with a variety of numbers\nSubjects or lures referencing singular names, heights and weights, surveillance\nBody of the message often referencing dating services or extortion material for ransom\nPresence of Bitcoin, DASH, Etherium, or other cryptocurrency wallets\nZIP files or other file types purporting to be images such as JPG files or photo types\n\nThese patterns include language more commonly used in consumer extortion emails, which reference having illicit photos or\nvideos of the recipient. These are also the same lures that are used to distribute the bot installer as well as ransomware or\nother malware. The messages often include old passwords of individuals gathered from publicly available lists, a method that\nattackers use to add credibility whether the mail is received in a corporate environment or at home.\n\nMicrosoft Defender for Office 365 detects malicious emails sent by the Phorpiex botnet. These include the extortion and\nphishing emails, as well as messages carrying malware, whether the Phorpiex loader itself or other malware. Microsoft\nDefender for Office 365 users AI and machine learning to detect user and domain impersonation, informed by its\ncomprehensive visibility into email threats as well as through in-depth research like this.\n\n### Spam and extortion campaigns\n\nPhorpiex is well known for illicit image or video-based extortion phish and spam campaigns, also known as “sextortion”. These\ncampaigns target a large variety of regions and languages, which is a different set of targets from bot distribution activities.\nThese generally do not deliver malware directly. They are meant to collect revenue for the operator by asserting that they\nhave already compromised a device and have access to damaging material regarding the recipient.\n\nSextortion campaigns have been quite popular in recent years and generally require payment from the victim in\ncryptocurrency. We observed Phorpiex operators requiring payment primarily through Bitcoin and Dash. Examples of one\nsuch cryptocurrency profit volume from a campaign in late February 2021 targeting English speaking users is below, with the\nsubject “Payment from your account”.\n\n\n-----\n\nThere are several public monitors of extortion wallets operated by Phorpiex, which have seen the operators of the botnet\nrunning numerous wallets during any given week. We observed the below example in which an operator requested $950 from\nusers and accumulated over $13,000 in 10 days.\n\n_Figure 3. Cryptocurrency profit volume from a single wallet used in spam extortion campaign in late February 2021. Data from_\n_[BitInfoCharts.](https://bitinfocharts.com/)_\n\nIn late 2020 and early 2021 we also observed this extortion scheme exploiting fears about security vulnerabilities in\nteleconferencing applications such as Zoom. The messages claimed that a vulnerability is what allowed the operators to\ncapture their extortion material.\n\n_Figure 4. Example of an extortion email lure from late 2020_\n\n\n-----\n\n_Figure 5. Example of a Korean language extortion email lure from early 2021_\n\nIn addition to the examples above, Phorpiex is often distributed via business email compromise and contain no links or URLs.\nThis hampers many automatic detection capabilities an organization might have in place.\n\n### Phishing, malware, and ransomware campaigns\n\nPhorpiex-powered phishing campaigns as well as bot implant installations deliver secondary malware as well as standard\nextortion and spam. The tactics involving the spread of emails are the same, with the only differences being in the\nattachments or links. Malware involving malicious Office documents is interspersed with deliveries of the bot implant or direct\nransomware deliveries, which are often contained within .ZIP attachments.\n\nSince 2019, many of the malware-carrying emails from Phorpiex use the same lures, subject lines, and attachment file names.\nThe emails use a randomly generated feminine name in the subject or reference an embarrassing or improperly obtained\nphoto, and either contain extortion or deliver ransomware. As part of the social engineering lure, he malware attachments\nmasquerade as .jpg files or other file types, while appearing as .zip or .js files.\n\n_Figure 6. Example of an email lure including malicious ZIP attachment masquerading as an image of an actress_\n\nIn Summer and Fall 2020 many new Phorpiex infections began to spread using archive files to deliver BitRansomware and\nAvaddon. Avaddon only began spreading in mid to late 2020 and its distribution seems to have been tightly coupled with\nPhorpiex since its inception.\n\nIn the month of August 2020, there was also an increase in the number of bot implants installed on devices, corresponding\nwith the ransomware increase. At this time, most instances of ransomware perpetrated by Phorpiex were carried through the\nbot implant itself.\n\n## Phorpiex as malware delivery botnet\n\nIn addition to operating as a mailing botnet, Phorpiex has evolved to deliver other malware as well, most notably\ncryptocurrency mining malware and ransomware.\n\n### Cryptocurrency mining malware\n\n\n-----\n\nIn 2019 Phorpiex started utilizing an XMRIG miner to monetize the hosts with Monero. This module is included in almost all\nbot installations at the time of infection and communicates primarily over port 5555. This behavior might be coupled with other\nmalware, but in this instance, it is associated with the masqueraded system process used by the rest of the Phorpiex implant\n(i.e., SVCHOST.exe or LSASS.exe).\n\nThe miner is downloaded as a module masquerading as WINSYSDRV.exe It stores its configuration locally and checks it\nperiodically. The miner does this from additional masqueraded system processes injected into legitimate processes to read its\nconfiguration and to mine.\n\nThe WINSYSDRV.exe file routinely kicks off a series of heavily nested processes preceded by a PING with a long wait, which\nis intended to avoid sandboxes. This command is shown below:\n\ncmd.exe /C ping [INTERNAL IP] -n 8 -w 3000 > Nul & Del /f /q “C:\\ProgramData\\PnQssBdbSh\\winsysdrv.exe” & “C:\\Users\\\n\n[USER]\\AppData\\Local\\Temp\\winsysdrv.exe”\n\nIn prior versions, this command utilized the legitimate but hijacked WUAPP.exe process. Recently we have seen\n_NOTEPAD.exe used to read the path, which is a variant of C:\\ProgramData\\[RandomString]cfg:_\n\n“C:\\Windows\\System32\\wuapp.exe” -c “C:\\ProgramData\\ADwXcSSGvY\\cfgi” (2019-2020)\n“C:\\Windows\\System32\\wuapp.exe” -c “C:\\ProgramData\\PnQssBdbSh\\cfgi” (2020)\n“notepad.exe” -c “C:\\ProgramData\\PnQssBdbSh\\cfgi” (2020-2021)\n“notepad.exe” -c “C:\\ProgramData\\PnQssBdbSh\\cfg” (2020-2021)\n\nIn addition to mining Monero, versions of the bot loader also upload to Bitcoin wallets. We were able to scrape those\naddresses via downstream executables dropped by the Phorpiex loader masquerading as SVCHOST.exe or LSASS.exe.\nBelow is an example of the balance in one such wallet address that was active from September to November 2020,\nembedded in a specific sample.\n\n_Figure 7. Cryptocurrency profit from a single wallet used in a miner dropped on an infected machine from September to_\n_[November 2020. Data from BitInfoCharts.](https://bitinfocharts.com/)_\n\nIn February of 2021, infected implants also downloaded additional Etherium miners. These miners create scheduled tasks are\nlabeled “WindowsUpdate” but run the miner every minute. The miners search for graphics cards as well as other resources to\nuse for mining with an ethermine.org mining pool. Here’s an example task creation:\n\n_schtasks /create /sc minute /mo 1 /tn WindowsUpdate /tr %TEMP%\\System.exe_\n\nMicrosoft has also observed Phorpiex variants with cryptocurrency-clipping functionality accompanying the installation of the\nloader. In these instances, the malware checks clipboard values for a valid cryptocurrency wallet ID. If it finds one, it sets its\nown hardcoded value. This method allows attackers to profit from existing mining installations or prior malware without having\nto bring in new software or remove old instances.\n\nMicrosoft Defender for Endpoint detects and blocks cryptocurrency mining malware and coin mining activity in general. To\ncontinue enhancing this detection capability, Microsoft recently integrated Intel Threat Detection Technology (TDT) into\nMicrosoft Defender for Endpoint, allowing our endpoint detection and response capabilities to use silicon-based threat\ndetection to better protect against coin mining malware.\n\n### Ransomware\n\n\n-----\n\nPhorpiex has been associated with multiple ransomware families through the years. Phorpiex either delivers ransomware on\nbehalf of other groups using those operators’ infrastructure or host the ransomware themselves. The latter is more common in\nthe case of commodity kits like Avaddon and Knot.\n\nAs recently as February 2021, Avaddon was under active development. Like the Phorpiex loader itself, Avaddon performs\nlanguage and regional checks for Russia or Ukraine before running to ensure only favored regions are targeted.\n\nThe initial Avaddon executable is located in the TEMP folder, and it generally uses a series of random characters as file\nextension for encrypted files. Before deleting backups and encrypting the drive, it validates that UAC is disabled by checking if\ncertain registry keys are set to “0”, modifying the value if not:\n\n\\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLUA = “0”\n\\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\ConsentPromptBehaviorAdmin\n= “0”\n\\REGISTRY\\MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLinkedConnections =\n“1”\n\nAfter achieving the privilege level needed, encryption usually occurs on the individual machine without lateral movement,\nthough that is subject to change based on the operator’s monetization strategy. The procedure for deleting backups, like most\nransomware, is performed with the following commands:\n\n_cmd /c wmic.exe SHADOWCOPY /nointeractive_\n_cmd /c wbadmin DELETE SYSTEMSTATEBACKUP_\n_cmd /c wbadmin DELETE SYSTEMSTATEBACKUP -deleteOldest_\n_cmd /c bcdedit.exe /set {default} recoveryenabled No_\n_cmd /c bcdedit.exe /set {default} bootstatuspolicy ignoreallfailures_\n_cmd /c vssadmin.exe Delete Shadows /All /Quiet_\n\nMicrosoft Defender for Endpoint detects and blocks the ransomware. It also detects and raises the following alerts for the\nencryption and backup deletion behaviors, enabling security operations teams to be notified and immediately respond to\nransomware activity on their environment:\n\nRansomware behavior detected in the file system\nFile backups were deleted\n\nWe have observed that the external commands and behaviors of the Avaddon ransomware have largely remained the same\nsince its introduction in June-July 2020. This includes the tendency to masquerade as the system file Taskhost.exe. Avaddon,\nwhich demands a ransom in Bitcoin equivalent to $700, is still active today and being actively distributed by Phorpiex using\nnew bot loaders that are not substantially different in behavior. Microsoft Defender for Endpoint continues to provide durable\nprotection against these new campaigns.\n\nOther ransomware is slightly less common lately, but in December 2020, a non-weaponized version of Knot ransomware was\nstaged on Phorpiex-operated servers. It did not seem to have had any infections yet as this may have been a test version.\nThis ransomware shares a high degree of similarity to the Phorpiex loader itself and improved versions have not yet been\nseen. Like Avaddon, Knot typically demands relatively smaller sums of money in Bitcoin, equivalent to $350. The ransom\nnotes generally require Bitcoin payment to a wallet, though no payments seem to have been made that month.\n\n_Figure 8. Cryptocurrency profit volume from a single wallet attached to a Knot ransomware sample in early 2021, showing no_\n_[payments of the asking price. Data from BitInfoCharts.](https://bitinfocharts.com/)_\n\n\n-----\n\n## Defending against botnets and associated activity\n\nBotnets drive a huge portion of the malware economy, and as the resilience of Phorpiex shows, they evolve to adapt to the\never-changing threat environment. Our many years of experience analyzing, monitoring, and even working with law\nenforcement and other partners to take down botnets tell us that alternative infrastructures rise as attackers try to fill in the\nvoid left by disrupted botnets. Typically, new infrastructures are born as a result of these movements, but in the case of\nPhorpiex, an established botnet adapts and takes over.\n\nThe wide range of malicious activities associated with botnets, as we detailed in this in-depth research into Phorpiex,\nrepresent the spectrum of threats that organizations face today: various attack vectors, multiple spreading mechanisms, and\na diverse set of payloads that attackers can change at will. To combat these threats, organizations need security solutions that\ndeliver cross-domain visibility and coordinated defense.\n\n[Microsoft 365 Defender leverages the capabilities and signals from the Microsoft 365 security portfolio to correlate threat data](https://www.microsoft.com/en-us/microsoft-365/security/microsoft-365-defender)\nfrom endpoints, email and data, identities, and cloud apps to provide comprehensive protection against threats. Microsoft\nDefender for Endpoint detects and blocks malware, other malicious artifacts, and malicious behavior associated with botnet\nactivity, as well as the deployment of secondary payloads like cryptocurrency miners and ransomware. Features like attack\nsurface reduction, tamper protection, and security controls for removable media further help prevent these attacks and harden\n[networks against threats in general. Microsoft Defender for Office 365 detects the malicious attachments and URLs in emails](https://www.microsoft.com/en-us/microsoft-365/security/office-365-defender)\ngenerated by the mailing operations of the Phorpiex botnet.\n\nOur industry-leading visibility informs AI and machine learning technologies that power the automatic prevention, detection,\nand remediation of threats, as well as the rich set of investigation tools available to defenders for hunting, analyzing, and\n[resolving attacks. The recently generally available unified Microsoft 365 Defender security center integrates capabilities so](https://techcommunity.microsoft.com/t5/microsoft-365-defender/unified-experiences-across-endpoint-and-email-are-now-generally/ba-p/2278132)\ndefenders can manage all endpoint, email, and cross-product investigations, configuration, and remediation with a single\nportal.\n\nOur understanding of how botnets operate and evolve, through in-depth research like this, further enriches our ability to\ncontinue delivering defenses against the threats of today and the future. Learn how Microsoft 365 Defender stops attacks with\nautomated, cross-domain security and built-in AI.\n\n_Microsoft 365 Defender Threat Intelligence Team_\n\n## Advanced hunting\n\nThe Phorpiex botnet used highly varied payloads and delivery methods after email distribution. You can use the provided\nadvanced hunting queries to surface activities associated with Phorpiex and similar threats.\n\n**Phorpiex variable command-and-control connections**\n\nLooks for a series of registered and unregistered delivery and installation domains that have been used by Phorpiex upon\ninstallation of the bot implant and at regular intervals for updates of the bot implant. These network connections are often\ninitiated by the DriveMgr process or one of the later faked system processes. Regex was included to limit scope and for use in\nother queries based on all of the currently known URL paths associated with Phorpiex component downloads such as cc11,\ncc22 and, others. Regex and RemoteUrl statements can be removed if query is slow in a particular environment or to gather\n[more results from broad DriveMgr.exe network connections. Run query.](https://security.microsoft.com/hunting?query=H4sIAAAAAAAEAG2QT0vDQBDF31nwO4ScEmhj9eCt9NIWeqhIwZN6CCWkS7ubkKQq_vnu_nZAEVuGt7vzZubNzM5V6UVOW-47MOhVjTrttYCvFGB6XepCn0qI7eA6kGhFzBF1Ku0MqnVPrDGtHlvCHky3lLeaKZYo1Zw8Z_prqjoVvN5AerbThtOjO3A_wB3gdmj23Bk1pVrUCmocL48fbKqCSRr8VDmZcavE9M_pedtia12jbuxc21Rx3ifsil6ZHskb613P-tCNvvAn-Le_fs702Qn7v-o061qjP5GWzi37BLwBeNCBHrQg7hXwKjuPoEA9xzKb9ec_c82Y_ht3N7dD5AEAAA&runQuery=true&timeRangeId=week)\n```\nDeviceNetworkEvents\n| where InitiatingProcessFileName == \"DriveMgr.exe\"\n| where RemoteUrl has (\"api.wipmania.com\") or\nRemoteUrl matches regex \"\\\\/(([a-z]{2}[0-6]{2})|([0-6]{2}[a-z]{2})|([0-6]{1,2})|\n(pepwn|t|m|r|s|p|consensus.z))(\\\\.exe)?\"\n\n```\n**Phorpiex bot Implant DriveMgr strings**\n\nLooks for a series of persistent strings used in the Phorpiex bot implant for self-replication via removable drives. This implant\nwill often search for any removable drives and create hidden empty folders to copy the loader to. This offers Phorpiex a way of\nself-propagation via the removable drives or attached storage and appears invisible to the user of the drive. This has\noccasionally been reused in other named worms but is most common in Phorpiex, especially if accompanied by C2\nactivity. [Run query.](https://security.microsoft.com/hunting?query=H4sIAAAAAAAEAJ2PSwrCQBBE31rwDkMWohtv4MooCCoeQJBgghkwCon4AQ_vyyxcuJSiZmqqu7qZnIo7kaP3jpZrUp1Y6FdcuKmHDHgTeFDrtTKwshatRop0Xjj9TFjqntVbO5qUmYlAZkdDyVTvKbM_58_VjSislaxTT5-sdToOyX_5HrthL3LTMf1q46z2uz8wkr3u92VM-ACrkw-QFgEAAA&runQuery=true&timeRangeId=week)\n\n\n-----\n\n```\n| where InitiatingProcessFileName == \"cmd.exe\"\n| where InitiatingProcessCommandLine has \"\\\\DriveMgr.exe & exit\"\n\n```\n**Phorpiex masqueraded system process network activity**\n\nLooks for a pattern of a system process executable name that is not legitimate and running from a folder that is created via a\nrandom algorithm 13-15 numbers long. This pattern has changed slightly over time, but this is the current iteration as of May\n2021. The portions that are most likely to change are the service names and the length of the random pattern and the explicit\n[faked process name. Run query.](https://security.microsoft.com/hunting?query=H4sIAAAAAAAEAJ2ST0vDQBDF31nwO4ScLIhQxJN404IX6V1FlmxIS5NUsjFR1O_ubyceGmMQZJnNZua9-V8qV6tEKznteK_VaK-MV-DEO9EVcqwjPYPJQD3xbThObzpRqhKUM_wZjFck1SkS1IHf4C8QY2xzepHXFptX8cPWo69N8glvsFXwa6RA30yiVr_mkhNpyOjQEutK0QX8TFl_R_NUX87U6EFviZjjoZgwB9-BHgZDdjP2zrIb22ritfzFifgD20KXVtE1fx38OMc762IPo2F2N5ZPjSYY8oPZ9uQfK8t531rnW8TZXZP5eCdWaEvz66grciIqYRPmd2jx71h7YnljrA21gVfZKzNPcT-jt8J6kNCDh-9zb7fXo9611Dl9W-pCnyC-AIs5S330AgAA&runQuery=true&timeRangeId=week)\n```\nlet FakeProcesses =\npack_array(\"lsass.exe\",\"svchost.exe\",\"audiodg.exe\",\"wininet.exe\",\"winmanager.exe\",\"smss.exe\",\"sedsvc.exe\",\n\"csrss.exe\",\"winmanager.exe\",\"dllhost.exe\",\"drivemgr.exe\",\"winsysdrv.exe\",\"winsvcs.exe\",\"notepad.exe\");\nDeviceNetworkEvents\n| where InitiatingProcessFileName in (FakeProcesses)\n| where InitiatingProcessFolderPath matches regex \"\\\\\\\\[\\\\d]{13,15}\"\n\n## Indicators\n\n```\n**Non-DGA domains**\n\ntsrv1[.]com tsrv1[.]ws tsrv2[.]top\n\ntsrv3[.]ru tsrv4[.]ws tsrv5[.]top\n\ntldrbox[.]com tldrbox[.]top tldrbox[.]ws\n\ntldrhaus[.]top tldrnet[.]top tldrzone[.]com\n\ntldrzone[.]top tsrv2[.]ws tsrv3[.]ws\n\nthaus[.]ws worm[.]ws thaus[.]to\n\ngotsomefile[.]top feedmefile[.]top gotsomefile[.]top\n\nxmrupdtemall[.]top vitamind[.]top w4tw4tw4tw4t4[.]jo\n\n**DGA domain samples**\n\naiiaiafrzrueuedur[.]ru afeifieuuufufufuf[.]su ssofhoseuegsgrfnj[.]su\n\nuoaeogauhduadhug[.]su aeiziaezieidiebg[.]su osheoufhusheoghuesd[.]ru\n\nplpanaifheaighai[.]su rzhsudhugugfugugsh[.]co ndrxbezrsdgsergdfs[.]co\n\nbfagzzezgaegzgfaih[.]co aegohaohuoruitiieh[.]co gaoehuoaoefhuhfugh[.]co\n\ngaghpaheiafhjefijh[.]co gaohrhurhuhruhfsdh[.]co eaeuafhuaegfugeudh[.]co\n\nbefaheaiudeuhughgh[.]co aefofhhfouahugr[.]ws urusurofhsorhfuuhd[.]io\n\nafaeigaifgsgrhhafd[.]io eaougheofhuaez[.]top seuufhehfueughem[.]top\n\nseuufhehfueughek[.]ws feauhueudughuurk[.]ws eafueudzefverrgk[.]ws\n\neafuebdbedbedggk[.]ws efeuafubeubaefur[.]ws eafuebdbedbedggr[.]ws\n\ngaueudbuwdbuguur[.]ws okdoekeoehghaoer[.]ws eafueudzefverrgr[.]ws\n\ngeaohgoehagugeh[.]su zrziqezrizrizzf[.]su efaejfojegohgut[.]su\n\nzzruuoooshfrohu[.]su osheoufhusheoghuesd[.]ru ouhfuosuoosrhfzr[.]su\n\nrubbfibididhiei[.]ru koekfoaejfoefok[.]ru aeguaheoufuhfhu[.]ru\n\n\n-----\n\ngaehaejehgaefgz[.]ru ploeuahfueugeug[.]ru efniaenfinefing[.]ru\n\nmokaeduegfuaehh[.]ru geafneiefiefnin[.]ru loeofaihefihfhg[.]ru\n\nawwararuhuedhhf[.]ru aefiaefidjidghh[.]ru lpiauefhuheufhg[.]ru\n\naeaagegaegeahrh[.]ru mnenneaihfihegi[.]ru avdbawudhafiehf[.]ru\n\nefaejfojegohgut[.]ru geaohgoehagugeh[.]ru zrziqezrizrizzf[.]ru\n\naoekfoaefoahfoh[.]ru ebufaehfahefheh[.]ru rohgoruhgsorhugih[.]ru\n\nunokaoeojoejfghr[.]ru aeifaeifhutuhuhusr[.]su urusurofhsorhfuuhr[.]su\n\nrzhsudhugugfugugsr[.]su bfagzzezgaegzgfair[.]su eaeuafhuaegfugeudr[.]su\n\naeufuaehfiuehfuhfr[.]su daedagheauehfuuhfr[.]su aeoughaoheguaoehdr[.]su\n\neguaheoghouughahsr[.]su huaeokaefoaeguaehr[.]su afaeigaifgsgrhhafr[.]su\n\nafaigaeigieufuifir[.]su geauhouefheuutiiir[.]su gaoheeuofhefefhutr[.]su\n\ngaouehaehfoaeajrsr[.]su gaohrhurhuhruhfsdr[.]su gaghpaheiafhjefijr[.]su\n\ngaoehuoaoefhuhfugr[.]su aegohaohuoruitiier[.]su befaheaiudeuhughgr[.]su\n\nurusurofhsorhfuuhz[.]io aeifaeifhutuhuhusz[.]io rzhsudhugugfugugsz[.]io\n\nbfagzzezgaegzgfaiz[.]io eaeuafhuaegfugeudz[.]io aeufuaehfiuehfuhfz[.]io\n\ndaedagheauehfuuhfz[.]io aeoughaoheguaoehdz[.]io eguaheoghouughahsz[.]io\n\nhuaeokaefoaeguaehz[.]io afaeigaifgsgrhhafz[.]io afaigaeigieufuifiz[.]io\n\ngeauhouefheuutiiiz[.]io gaoheeuofhefefhutz[.]io gaouehaehfoaeajrsz[.]io\n\ngaohrhurhuhruhfsdz[.]io gaghpaheiafhjefijz[.]io gaoehuoaoefhuhfugz[.]io\n\naegohaohuoruitiiez[.]io befaheaiudeuhughgz[.]io urusurofhsorhfuuhu[.]cc\n\naeifaeifhutuhuhusu[.]cc rzhsudhugugfugugsu[.]cc bfagzzezgaegzgfaiu[.]cc\n\neaeuafhuaegfugeudu[.]cc aeufuaehfiuehfuhfu[.]cc daedagheauehfuuhfu[.]cc\n\naeoughaoheguaoehdu[.]cc eguaheoghouughahsu[.]cc huaeokaefoaeguaehu[.]cc\n\nafaeigaifgsgrhhafu[.]cc afaigaeigieufuifiu[.]cc geauhouefheuutiiiu[.]cc\n\ngaoheeuofhefefhutu[.]cc gaouehaehfoaeajrsu[.]cc gaohrhurhuhruhfsdu[.]cc\n\ngaghpaheiafhjefiju[.]cc gaoehuoaoefhuhfugu[.]cc aegohaohuoruitiieu[.]cc\n\nbefaheaiudeuhughgu[.]cc urusurofhsorhfuuhl[.]co aeifaeifhutuhuhusl[.]co\n\nrzhsudhugugfugugsl[.]co bfagzzezgaegzgfail[.]co eaeuafhuaegfugeudl[.]co\n\naeufuaehfiuehfuhfl[.]co daedagheauehfuuhfl[.]co aeoughaoheguaoehdl[.]co\n\neguaheoghouughahsl[.]co huaeokaefoaeguaehl[.]co afaeigaifgsgrhhafl[.]co\n\nafaigaeigieufuifil[.]co geauhouefheuutiiil[.]co gaoheeuofhefefhutl[.]co\n\ngaouehaehfoaeajrsl[.]co gaohrhurhuhruhfsdl[.]co gaghpaheiafhjefijl[.]co\n\ngaoehuoaoefhuhfugl[.]co aegohaohuoruitiiel[.]co befaheaiudeuhughgl[.]co\n\nurusurofhsorhfuuhm[.]to aeifaeifhutuhuhusm[.]to rzhsudhugugfugugsm[.]to\n\nbfagzzezgaegzgfaim[.]to eaeuafhuaegfugeudm[.]to aeufuaehfiuehfuhfm[.]to\n\n\n-----\n\ndaedagheauehfuuhfm[.]to aeoughaoheguaoehdm[.]to eguaheoghouughahsm[.]to\n\nhuaeokaefoaeguaehm[.]to afaeigaifgsgrhhafm[.]to afaigaeigieufuifim[.]to\n\ngeauhouefheuutiiim[.]to gaoheeuofhefefhutm[.]to gaouehaehfoaeajrsm[.]to\n\ngaohrhurhuhruhfsdm[.]to gaghpaheiafhjefijm[.]to gaoehuoaoefhuhfugm[.]to\n\naegohaohuoruitiiem[.]to befaheaiudeuhughgm[.]to sefuhsuifhishffo[.]ru\n\nsefuhsuifhishfy[.]in seiiamefiaigaefo[.]ru seuufhehfueugheg[.]to\n\nseuufhehfueugheh[.]ws seuufhehfueughek[.]ws seuufhehfueughem[.]top\n\nseuufhehfueughet[.]to sisfiusnrsruisfo[.]ru sisfiusnrsruisy[.]in\n\nsndiuenidniueifo[.]ru soijodneoiauoefo[.]ru wduufbaueeubffgh[.]ws\n\n**IP addresses**\n\n185[.]215[.]113[.]10 185[.]215[.]113[.]8 45[.]182[.]189[.]251\n\n185[.]215[.]113[.]93 45[.]66[.]156[.]175 45[.]66[.]156[.]176\n\n154[.]35[.]175[.]225 62[.]210[.]177[.]189 130[.]185[.]250[.]214\n\n213[.]32[.]71[.]116 51[.]15[.]42[.]19\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-20 - Phorpiex morphs- How a longstanding botnet persists and thrives in the current threat environment.pdf"
    ],
    "report_names": [
        "2021-05-20 - Phorpiex morphs- How a longstanding botnet persists and thrives in the current threat environment.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536213,
    "ts_updated_at": 1743041613,
    "ts_creation_date": 1653779523,
    "ts_modification_date": 1653779523,
    "files": {
        "pdf": "https://archive.orkl.eu/7d655727d9e5f37fe4c483e2a78351ef28e8e03d.pdf",
        "text": "https://archive.orkl.eu/7d655727d9e5f37fe4c483e2a78351ef28e8e03d.txt",
        "img": "https://archive.orkl.eu/7d655727d9e5f37fe4c483e2a78351ef28e8e03d.jpg"
    }
}