{
    "id": "77900246-7ffb-4407-81ca-5b18d85236b8",
    "created_at": "2023-01-12T15:09:16.541463Z",
    "updated_at": "2025-03-27T02:05:58.51739Z",
    "deleted_at": null,
    "sha1_hash": "9e3b260fba7300864070179140337cf26358d69c",
    "title": "2018-07-19 - Killswitch File Now Available for GandCrab v4.1.2 Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:06:50Z",
    "file_modification_date": "2022-05-28T04:06:50Z",
    "file_size": 1371391,
    "plain_text": "# Killswitch File Now Available for GandCrab v4.1.2 Ransomware\n\n**[sensorstechforum.com/killswitch-file-now-available-gandcrab-v4-1-2-ransomware/](https://sensorstechforum.com/killswitch-file-now-available-gandcrab-v4-1-2-ransomware/)**\n\nVentsislav Krastev July 19, 2018\n\n[The South Korean company Ahnlab has developed a Killswitch for the latest version of the](https://asec.ahnlab.com/1145)\nvirus, calling itself v4.1.2, causing the ransomware to stop functioning.\n\nAhnlab has reportedly analyzed the internal version 4.1.2 of GandCrab ransomware, which is\npart of the **[4.1 version, using the .KRAB file extension after file encryption. Researchers](https://sensorstechforum.com/krab-files-virus-gandcrab-v4-1-remove-restore-data/)**\nhave then designed an app, that works as a defensive measure and can be dropped on\nusers’ computers before they become infected with GandCrab 4.1.2. For the defense tactic\nto work, you will need to get the file, which has a string in it’s name and has the .lock file\nextension. Such .lock files are essential to GandCrab’s way of operation and here are the\nsteps in which they are created:\n\n\n-----\n\n**Step 1: GandCrab 4.1.2 infects your computer and encrypts your files.**\n**Step 2: The virus creates a .lock file with a mutex, for which the virus scans for comparing**\nthe file to the .lock files of other infected computers.\n**Step 3: If the .lock file already belongs to GandCrab’s infected computers’ list, the virus**\nshuts down and doesn’t encrypt anything to prevent double encryption and infection to take\nplace.\n\nResearchers have cleverly devised such a .lock file, which acts as a killswitch and the whole\napp can be downloaded from the following link (also available on asec.ahnlab.com/1145):\n\nDownload\nGandCrab Killswitch\n\n_IMPORTANT NOTICE! Your antivirus may detect the killswitch as a virus, but it is also_\n_available on Anhlab’s research site above and we believe that the file can be trusted,_\n_because it is not an actual GandCrab but merely a method used to prevent the actual threat_\n_so be advised to disable your antivirus and anti-malware software before downloading the_\n_file._\n\nAfter downloading the file, victims should save it either in the %Application Data%\n**directory for older Windows Versions or in the %ProgramData% directory for Windows**\n**7 and newer versions of the operating system. This prevents your computer from certain**\nfile encryption, even if GandCrab v4.1.2 has already infected the machine.\n\n## New Updates in GandCrab v4.1.2<\n\nGandCrab is the type of ransomware that has been spreading and infecting computers since\n[January, 2018. The virus has undergone major changes since then, using fake Dental](https://sensorstechforum.com/gandcrab-ransomware-removal-restore-gdcb-files/)\nRecords and other fake .exe files to infect user PC’s. The malware which prayed on users\nwho had SMBv1 enabled on their machine has been updated in a 4.1 version, which has\nevolved in it’s current 4.1.2 internal variant. The latest version of GandCrab is using more\nand more methods to spread, like the newer EternalBlue exploits used in the WannaCry\noutbreak, that happened back in 2017. But in the same time, this newer version of the virus\nhas also stopped using some older exploits like SMB to infect computers suggesting newer\n\n\n-----\n\noperating systems to be targeted. One thing has remained certain – GandCrab still uses the\nsame methods to spread and they are not likely to be automatic, since the virus uses spam\ne-mails with malicious attachments of all types and may also upload the infection files on\nsuspicious and low reputation sites. It is strongly advisable to apply proper anti-malware\nprotection and also make sure to learn how to safely store your important files in order to\nprotect yourself from malware infections, like GandCrab (see related articles below):\n\nRelated: [Protect Yourself from Getting Infected by Malicious E-mails](https://sensorstechforum.com/protect-getting-infected-malicious-e-mails/)\n\nRelated: [Safely Store Your Important Files and Protect Them from Malware](https://sensorstechforum.com/safely-store-your-important-files-and-protect-them-from-malware/)\n\n### Ventsislav Krastev\n\nVentsislav is a cybersecurity expert at SensorsTechForum since 2015. He has been\nresearching, covering, helping victims with the latest malware infections plus testing and\nreviewing software and the newest tech developments. Having graduated Marketing as well,\nVentsislav also has passion for learning new shifts and innovations in cybersecurity that\nbecome game changers. After studying Value Chain Management, Network Administration\nand Computer Administration of System Applications, he found his true calling within the\ncybersecrurity industry and is a strong believer in the education of every user towards online\nsafety and security.\n\n[More Posts -](https://sensorstechforum.com/author/vencislav-krustev/) [Website](https://www.sensorstechforum.com/)\n\nFollow Me:\n\n[Previous post](https://sensorstechforum.com/remove-gosearchresults-com-redirect/)\n\n[Next post](https://sensorstechforum.com/cve-2018-0374-vulnerabilities-cisco-policy-suite/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-19 - Killswitch File Now Available for GandCrab v4.1.2 Ransomware.pdf"
    ],
    "report_names": [
        "2018-07-19 - Killswitch File Now Available for GandCrab v4.1.2 Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536156,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653710810,
    "ts_modification_date": 1653710810,
    "files": {
        "pdf": "https://archive.orkl.eu/9e3b260fba7300864070179140337cf26358d69c.pdf",
        "text": "https://archive.orkl.eu/9e3b260fba7300864070179140337cf26358d69c.txt",
        "img": "https://archive.orkl.eu/9e3b260fba7300864070179140337cf26358d69c.jpg"
    }
}