{
    "id": "77bac458-010f-4519-b59d-821a1e029657",
    "created_at": "2023-01-12T15:01:00.348641Z",
    "updated_at": "2025-03-27T02:05:43.161437Z",
    "deleted_at": null,
    "sha1_hash": "61031ed7e09f842c924a2a66c79d6ab71bf96adb",
    "title": "2018-12-14 - Cybercriminals Use Malicious Memes that Communicate with Malware",
    "authors": "",
    "file_creation_date": "2022-05-29T10:36:38Z",
    "file_modification_date": "2022-05-29T10:36:38Z",
    "file_size": 252339,
    "plain_text": "# Malicious Memes that Communicate with Malware\n\n**blog.trendmicro.com/trendlabs-security-intelligence/cybercriminals-use-malicious-memes-that-communicate-with-**\nmalware/\n\nDecember 14, 2018\n\nSteganography, or the method used to conceal a malicious payload inside an image to\nevade security solutions, has long been used by cybercriminals to spread malware and\nperform other malicious operations. We recently discovered malicious actors using this\ntechnique on memes. The malware authors have posted two tweets featuring malicious\nmemes on October 25 and 26 via a Twitter account created in 2017. The memes contain an\nembedded command that is parsed by the malware after it's downloaded from the malicious\nTwitter account onto the victim’s machine, acting as a C&C service for the already- placed\nmalware. It should be noted that the malware was not downloaded from Twitter and that we\ndid not observe what specific mechanism was used to deliver the malware to its victims. The\nmalware connected to this malicious meme has been proactively blocked by Trend Micro\nmachine learning and behavioral detection technology at the time of discovery.\n\nThis new threat (detected as TROJAN.MSIL.BERBOMTHUM.AA) is notable because the\nmalware’s commands are received via a legitimate service (which is also a popular social\nnetworking platform), employs the use of benign-looking yet malicious memes, and it cannot\nbe taken down unless the malicious Twitter account is disabled. Twitter has already taken the\naccount offline as of December 13, 2018.\n\n\n-----\n\nHidden inside the memes mentioned above is the /print command, which enables the\nmalware to take screenshots of the infected machine. The screenshots are sent to a C&C\nserver whose address is obtained through a hard-coded URL on pastebin.com.\n\n**Analyzing the Malware**\n\nWe found that once the malware has been executed on an infected machine, it will be able to\ndownload the malicious memes from the Twitter account to the victim’s machine. It will then\nextract the given command. In the case of the “print” command hidden in the memes, the\nmalware takes a screenshot of the infected machine. It then obtains the control server\ninformation from Pastebin. Afterwards, the malware sends out the collected information or\nthe command output to the attacker by uploading it to a specific URL address.\n\nA screen capture of the malware’s code showing the Pastebin URL Figure 1. A screen\ncapture of the malware’s code showing the Pastebin URL\nDuring analysis, we saw that the Pastebin URL points to an internal or private IP address,\nwhich is possibly a temporary placeholder used by the attackers.\n\nPrivate IP address that a Pastebin URL points to Figure 2. Private IP address that a\nPastebin URL points to\nThe malware then parses the content of the malicious Twitter account and begins looking for\nan image file using the pattern: “<img src=\\(.*?):thumb\\\" width=\\\".*?\\\" height=\\\".*?\\\"/>” on the\naccount.\n\nA screen capture of the malicious Twitter account Figure 3. A screen capture of the\nmalicious Twitter account\n\nA screen capture of one of the malicious memes posted on the Twitter account Figure 4. A\nscreen capture of one of the malicious memes posted on the Twitter account\nAt the time of analysis, the two memes (DqVe1PxWoAIQ44B.jpg and\nDqfU9sZWoAAlnFh.jpg) contained the command “print”. The embedded commands instruct\nthe malware to perform various operations on the infected machine, such as capture\nscreenshots, collect system information, among others, as described below.\n\nOnce the malware downloads the image, it attempts to extract the command that starts with\nthe ‘/’ character.\n\nA screen capture of code snippet to locate a command string Figure 5. A screen capture of\ncode snippet to locate a command string\nThe following is the list of commands supported by this malware:\n\n**Commands** **Description**\n\n/print Screen capture\n\n/processos Retrieve list of running processes\n\n\n-----\n\n/clip Capture clipboard content\n\n/username Retrieve username from infected machine\n\n/docs Retrieve filenames from a predefined path such as (desktop, %AppData%\netc.)\n\nA screen capture of code featuring the commands supported by the malware Figure 6. A\nscreen capture of code featuring the commands supported by the malware\n\nA screen capture of code showing the details of the“/print” command Figure 7. A screen\ncapture of code showing the details of the“/print” command\n**Trend Micro Solutions**\n\nUsers and businesses can consider adopting security solutions that can protect systems\nfrom various threats, such as malware that communicate with benign-looking images,\nthrough a cross-generational blend of threat defense techniques. Trend Micro endpoint\n[solutions such as the Smart Protection Suites and](https://blog.trendmicro.com/en_us/business/products/user-protection/sps.html) **Worry-Free Business**\n**Security solutions can protect users and businesses from threats by detecting malicious files**\nand messages as well as blocking all related malicious URLs. Trend Micro™ Deep\n**Discovery™ has an email inspection layer that can protect enterprises by detecting**\nmalicious attachments and URLs.\n\nThese solutions are powered by Trend MicroTM XGenTM security, which provides high-fidelity\nmachine learning that secures the gateway and endpoint, and protects physical, virtual, and\ncloud workloads. With technologies that employ web/URL filtering, behavioral analysis, and\ncustom sandboxing, XGen security offers protection against ever-changing threats that\nbypass traditional controls and exploit known and unknown vulnerabilities.\n\n**Indicators of Compromise**\n\nRelated Hashes (SHA-256)\n\n003673cf045faf0141b0bd00eff13542a3a62125937ac27b80c9ffd27bb5c722\n3579d609cf4d0c8b469682eb7ff6c65ec634942fa56d47b666db7aa99a2ee3ef\n88b06e005ecfab28cfdbcab98381821d7cc82bb140894b7fdc5445a125ce1a8c\n8cdb574ba6fcaea32717c36b47fec0309fcd5c6d7b0f9a58fc546b74fc42cacd\n\nMalware\n\nWe recently discovered malicious actors using steganography on memes. It should be noted\nthat the malware was not downloaded from Twitter and that we did not observe what specific\nmechanism was used to deliver the malware to its victims.\n\nBy: Aliakbar Zahravi December 14, 2018 Read time: ( words)\n\n\n-----\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-14 - Cybercriminals Use Malicious Memes that Communicate with Malware.pdf"
    ],
    "report_names": [
        "2018-12-14 - Cybercriminals Use Malicious Memes that Communicate with Malware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535660,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653820598,
    "ts_modification_date": 1653820598,
    "files": {
        "pdf": "https://archive.orkl.eu/61031ed7e09f842c924a2a66c79d6ab71bf96adb.pdf",
        "text": "https://archive.orkl.eu/61031ed7e09f842c924a2a66c79d6ab71bf96adb.txt",
        "img": "https://archive.orkl.eu/61031ed7e09f842c924a2a66c79d6ab71bf96adb.jpg"
    }
}