{
    "id": "78096a4d-5732-4919-ba3a-1caa41ad077d",
    "created_at": "2023-01-12T15:04:35.283661Z",
    "updated_at": "2025-03-27T02:16:34.814301Z",
    "deleted_at": null,
    "sha1_hash": "399e88e0b1d4b492b280558899a6f855b842f278",
    "title": "2022-03-31 - Conti Leaks- Examining the Panama Papers of Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T00:45:14Z",
    "file_modification_date": "2022-05-28T00:45:14Z",
    "file_size": 2798149,
    "plain_text": "# Conti Leaks: Examining the Panama Papers of Ransomware\n\n**[trellix.com/en-us/about/newsroom/stories/threat-labs/conti-leaks-examining-the-panama-papers-of-ransomware.html](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/conti-leaks-examining-the-panama-papers-of-ransomware.html)**\n\nBy [John Fokker,](https://www.trellix.com/en-us/about/newsroom/stories/contributors/john-fokker.html) [Jambul Tologonov · March 31, 2022](http://10.10.0.46/en-us/about/newsroom/stories/contributors/%0D%0Ajambul-tologonov.html)\n\n## Introduction\n\nIt isn’t often the whole world gets an inside look of the business operations of a top tier\ncybercriminal group. Very early on in the Russian-Ukrainian Crisis the predominantly\nRussian based ransomware group Conti made a public statement where they expressed\ntheir loyalty to the Russian Administration.\n\n\n-----\n\n**Figure 1. Conti expressing their support to the Russian Administration. Source:**\n**BleepingComputer**\nAs a reaction to this statement and the current conflict, a Ukrainian security researcher,\noperating by the twitter handle @contileaks decided to publish years of Conti’s internal\nJabber conversations online. The chats that were dumped span across several years\nconsisted of thousands of messages making this the “Panama Papers of Ransomware”.\n\nThis wasn’t the first time the Conti gang got hit, last summer a [disgruntled affiliate posted](https://www.bleepingcomputer.com/news/security/angry-conti-ransomware-affiliate-leaks-gangs-attack-playbook/)\ntheir attack playbook online, which was full of very useful intelligence for our customers.\n\nSince it was public, the whole security community jumped to review the chats and within\nhours the first findings appeared on Twitter. Trellix was also quick to obtain the dataset and\nrealized that this might be one of the largest “crowd-sourced cyber investigations” ever seen.\nWhat this means is that as a research team you must devise a flexible dissemination\nstrategy because findings by the crowd will appear online. So, it is constant balance between\nverification of the published findings by others, investing in your own research goals and\nadjusting some of these goals based on new information.\n\nEven though it was very tempting to dive down the rabbit hole immediately we did make sure\nwe attacked the dataset with a certain plan.\n\n## Dissemination strategy; How to avoid the rabbit hole\n\n**Attack infrastructure**\n\nThe first batch of leaked chats were only a couple of days old and ranging back quite some\ntime. From the start we realized that the criminals might have left valuable data on their\nattack infrastructure in the chats. We wrote a quick extraction script and compared the\nmentioned network artifacts to our current dataset and saw a lot of overlap. Not only did we\nsee overlap with infrastructure we attributed to TrickBot and Cobalt Strike in the past, but a\ngood portion of the systems we filtered out were still alive and kicking. To prevent any\nretaliation by the Conti group directed at our customers, blocking this infrastructure was top\npriority.\n\nSome of these live systems were actually located in the countries where we have a good\nrelationship with Law Enforcement, so naturally we reached out and made sure they got a\nheads-up to take appropriate measures quickly.\n\n\n-----\n\nThe intelligence gathered from this was very actionable, but with a short shelf life, the next\nstop for us was tradecraft.\n\n**TTPs and tradecraft**\n\nDue to the severity of the leaks, there was a good chance that the Conti gang would rebrand\nor disperse it members across other ransomware families. In the prior leak where Conti’s\nplaybook got dumped online there were excellent descriptions of the different tools and\nscripts they would use to attack their victims. So, looking at around 200 thousand leaked\nmessages (Conti & TrickBot leaks combined) span over the period 2020-2022, it was likely\nmembers would share custom TTP’s or tradecraft amongst each other.\n\nBy filtering tool names and command line structures we found several examples where\nmembers discussed tool usage. Given the crowd sourced nature of this dump we would also\n[like to thank The DFIR Report for their excellent findings which they published via their](https://thedfirreport.com/)\nTwitter account.\n\nAffiliates might leave Conti and their network, but wherever they go they will take along their\ntradecraft. Without an external intervention, like an arrest, we should anticipate that\ncybercriminals won’t stop their line of business, and thus we can expect to see their TTPs\npop up in the future. However, through proper dissemination of the data we were able to\nempower many of our XDR product teams to improve the product efficacy against this\ntradecraft and incorporate our findings in MVISION Insights for customer visibility.\n\nDid we ignore the juicy conversations completely? Not at all, fortunately we have a native\nRussian speaking research capability that made a huge difference while going down the\nrabbit hole. In the following section we will highlight some of the findings we found interesting\nto share.\n\n## Interesting chats\n\nFor transparency purposes we have included both the original Cyrillic and our human\ntranslated text to allow readers to delve into the intricacies of some of the Conti’s\ndiscussions. For readability purposes we have put the original leaked messages into 1-2-1\nconversations to make it easier to understand/follow the context.\n\n**Conti as an enterprise**\n\nIt is fascinating how much Conti resembles an ordinary firm with an office building, HR and\nother departments (testers, reversers, OSINT, coders, training team, etc.) with their regular\nsalaries on the 15th and 30th of each month. Working hours are 10.00-18.00 Moscow time,\nfive days a week. Stern is the boss who oversees everything and has 100 people on the\npayroll. “The weekend are the weekends. And nobody cancelled the vacations and sick\n_days. All the other holidays - with the management's agreement” says Salmon (recruiter) to_\nnew hire-coder Core According to Bentley (manager) he worked there for a year but the\n\n\n-----\n\ncompany has existed for more than 10 years. Below are excerpts from various chats which\nprovide a good glimpse into Conti’s organization and the presence of a physical office(s) in\nRussia:\n\n**Figure 2. Target's messages to Stern about office expenses**\n\n**Figure 3. Mango to Stern about teams’ monthly salary**\n\n**Figure 4. Mango to Qwerty about team composition**\n\nIt is particularly interesting that in the Conti-TrickBot enterprise they are very careful about\nmalware code overlapping. They have external experts who scrutinize developed illegal\nsoftware code and ensure the code fingerprints are unique to each team of coders. Avoiding\noverlap seems to be important to segregate activities of different sub-teams and make it\ndifficult for security researchers to piece various Russian speaking threat actors’ campaigns\ntogether.\n\n\n-----\n\n**Figure 5. Salmon to Core about company’s policy on intellectual property**\n\n**Possible government connections**\n\nAccording to Angelo (tester/coder), Stern is closely affiliated with FSB or other structures\nand works for ‘Pu’. If Stern was not as almighty as God, they all would have ended up as\nREvil:\n\n**Figure 6. Angelo saying to Hammer that Stern is close to FSB**\n\n**Figure 7. Elroy and Angelo discussing how almighty their boss Stern is**\nThe Conti leadership was concerned over the situation surrounding the REvil ransomware\ngroup. However, Conti believed Russian authorities arrested only the lowest ranked\nmembers of REvil who were involved in the cash out.\n\nIt is worth mentioning that Basil (tester/coder) was asked if he is from FSB, he subsequently\nreplied he had serious intelligence related to Ukrainian border activity. This statement was\nmade seven days prior to Russia’s incursion into Ukraine:\n\n\n-----\n\n**Figure 8. Basil and Elroy on REvil arrest**\n\nIn another conversation involving Target (manager) he stated if they indeed encrypted Credit\nOne Bank Troy (tester/crypter) would get a reward in the Kremlin:\n\n**Figure 9. Target to Troy saying he gets a reward in the Kremlin**\nOccasionally Conti seems to be asked to do so-called ‘pioneering’ (volunteering) work on a\nspecial request from one of two ‘offices’. As Soviet Pioneers (aka scouts) they do their fair\nshare of work similarly to what Cozy Bear does:\n\n\n-----\n\n-----\n\n**Figure 10. Stern and Professor discussing what they need from Academi hack**\n\nIt is probable that one of the two offices is a so-called ‘Bolshoy Dom’ (Big House), an office\nbuilding located at 4 Liteyny Avenue which serves as the headquarters of Saint Peterburg’s\nlocal branch of FSB:\n\n**Figure 11. Target to Professor mentioning FSB’s HQ address**\n\nIn line with geo-political interests of Russia, Conti seems to have a ‘stop’ on China and get\nterrified every time they see a Russian company or ‘OOO’ abbreviation (equivalent of ‘LLC’\nin CIS countries) in the list of their victims:\n\n\n-----\n\n**Figure 12. Target and Troy discovered a RU entity in their list of potential victims**\n\n**Figure 13. Troy confirms to Target they have a stop on China**\nAll these messages corraborate the fact that Conti-TrickBot enterprise has a close\nrelationship with Russian government and/or act in its interests.\n\n**Collaboration with other Malware families**\n\n**Conti-Ryuk**\n\nCollaboration with Ryuk seemed to have started around August 2020 when Stern said,\n“Ryuk is going start as of Monday.” Target seemed to responsible for updating Stern on how\nthe Conti-Ryuk collaboration was going and if Ryuk team is able to work together and\nsmoothly with his team:\n\n\n-----\n\n**Figure 14. Conti-Ryuk initial plans on collaboration**\n\nAs per the chat between Stern, Target and Troy, it is evident that from September 2020 to\nOctober 2020 Conti-Ryuk successfully executed attacks on Sopra Steria, Steelcase, Merieux\nNutriSciences and Northern Trust and received 1.5 million (currency is unknown) in ransom\npayments:\n\n**Figure 15. Potential victims of Conti-Ryuk collaboration**\n**Conti-Maze**\n\nThe first mention of Conti-Maze potential connection dates back July 2020, when Kevin\n(coder/crypter) says to Stern “Prof took a different locker as far as I understood. Appears to\n_be Maze. Said he has rolled it at night”. Then Kevin suggests to Prof (team lead/manager)_\nthat Conti-Maze negotiation should be handled by Stern himself as he is more experienced.\nHe then says Maze will take 25-30%. It seems that Prof contacted developers of Maze and\nmanaged to get the ransomware build which was later given to Conti reversers to figure out\nhow it works and build a locker “not worse than Maze, and even better”:\n\n\n-----\n\n**Figure 16. Reshaev to Stern advising a new Maze-based locker will be better than**\n**Maze**\nWhen it comes to Conti-Maze victims, it seems that both were involved in hacking Academi\n(former Blackwater), a U.S. private military company who provides services to CIA. “We\n\n_[expletive] Academi for almost a year” says Target to Dandis (tester). Academi and the_\naffiliated Triple Canopy, Olive Group Capital Ltd, Strategic Social LLC and Constellis Group\nwere all infected/hacked around mid-July 2020 and Maze had negotiations in one of the\nvictim’s networks. Stern informed his subordinates that they are primarily looking for chats,\ncontracts, PII, emails and accounting and that the request seems to be originating from one\nof the two ‘offices’ (see above, the chat where they mentioned Cozy Bear). Target reports to\n**Stern they infected 30+ military companies along with some agencies, one of which is The**\nUS Environmental Protection Agency:\n\n\n-----\n\n**Figure 17. Stern and Revers’s discussion around Academi hack**\n\n**Figure 18. Target to Stern about 30+ military companies they infected**\n**Conti-Netwalker**\n\nMid-April 2021 Stern asked Bentley and Professor to add Netwalker’s jabber account to\n[their contact list. In mid-2020, Trellix wrote an in-depth blog on Netwalker explaining not only](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/take-a-netwalk-on-the-wild-side.html)\ntheir malware but how we uncovered a large portion of their funds. In January 2021, Law\nEnforcement managed to takedown the Netwalker’s dark web site and arrested an affiliate\nbased in Canada. After these interventions, it got really quiet arround Netwalker. Given the\nappearance date of the Netwalker moniker within the Conti jabber server, it is possible that\nNetwalker affiliates found a new home within the Conti group.\n\nAccording to Stern, Netwalker will use the TrickBot botnet to distribute their malware.\n**Bentley was in charge of onboarding Netwalker to their admin panel, VNC, etc. and**\nproviding them with tested LNK/XLS files with payload to use in their campaigns. It looks like\nthere was friction in the beginning of the collaboration and Netwalker did not get the\npromised bonus from Stern, and Stern did not like that Netwalker was passing the Citrix’es\ngiven to him to other parties:\n\n\n-----\n\n**Figure 19. Initial friction between Netwalker and Stern**\n\nLater in May 2021 Netwalker provided Stern the details of their two potential victims,\nBlackbaud, Inc. and Ellsworth Adhesives, and asked him to pay to his team as they worked\nhard:\n\n**Figure 20. Potential Conti-Netwalker victims**\n\nBlackbaud, Inc. disclosed that they indeed paid ransom to the perpetrators but never\nmentioned who they actually were nor the amount of ransom they paid.\n\n**Conti-Lockbit**\n\nThere is a hint of Conti-TrickBot potentially collaborating with LockBit group. At the beginning\nof November 2021, Defender (manager) said to Stern that the account Brom was\n(re)created in Group 6 for LockbitSupp (an alias strongly associated with LockBit\nransomware group):\n\n\n-----\n\n**Figure 21. Defender advising to Stern he added LockBitSupp to their Jabber**\nTwo weeks after, Mango (team lead/manager) told Stern that there was misunderstanding\nwith LockBit and asked him about the percentage of networks and revenue they will take\nfrom LockBit in case of successful collaboration:\n\n**Figure 22. Stern to Mango on percentage of revenue they take from Conti-LockBit**\n**collaboration**\n**TrickBot, Buer, Amadey and IcedID**\n\nOn June 26, 2020, Taker (tester) who just began the conversation with Stern asked\nquestions around what TrickBot was and how it got started. “It started as a banking bot,\n_gathering logs, logins, and passwords. It was a financial matter” replied Stern. Later in_\nOctober 2020, Target said to Troy, “They managed to connect Cobalt, Bazar and TrickBot\n_together. They figured that TrickBot is us.” On the August 19, 2021, Professor got furious_\nwhen somebody mistakenly included the TrickBot module designed to not infect CIS\ncountries into Diavol ransomware (aka Conti) build, which allowed security researchers to\nattribute TrickBot and Conti teams to the same threat actor:\n\n**Figure 23. Professor advising Stern TrickBot module was added into Conti**\n**ransomware build**\nAmadey and Buer were also mentioned multiple time in Conti chats as alternative loaders. In\nJune 2020, Price (coder) said to Target, “Hof referred me to a hacker forum, I got access to\n_it (for money) and copied Buer’s entire ins and outs from there.” As for Amadey loader, it_\n\n\n-----\n\nlooks that Conti team bought it and every time Amadey required a re-crypt they would pay\nfor that.\n\nFurthermore, Leo (coder) from Conti gang appears to be the creator of IcedID loader which\nin May 2021 was ‘on the first place among infections’:\n\n**Figure 24. Leo is the creator of IcedID malware**\n**Conti’s victims: NGO, Medical institutions among others**\n\nWe went through the Conti leaked messages and compiled a list of their potential victims\nwhich mainly includes EU and U.S. entities across various sectors. Most of the 103 potential\nvictims we have identified were located via a Zoominfo URL Conti used to check a\ncompany’s size and revenue to determine a ransom amount to ask. “Found a way of buying\n_a Zoominfo account, 2 managers for Buza, for his pricing research, the price is 2k” advised_\n**Mango to Stern. Later Stern said to Mavelek (coder/tester), “@ali has a script to check**\n_domains on Zoominfo to get data on number of employees and the revenue of the company.”_\n\nBetween 2020-2022 Conti and its affiliates targeted and potentially attacked twelve\nhealthcare organizations (clinics, hospitals, care houses including UHS, Prodemica, Geo\nGroup), five educational institutions (schools, colleges, universities, etc.), a charitable\norganization, a governmental agency, and numerous companies in financial, retail, business\nservices, manufacturing, and other industries:\n\n\n-----\n\n**Figure 25. The chart gives an overview of the Conti’s potential victims by sector**\n**Call center services**\n\nAmong other departments, Conti has a team of callers. A caller is required to have a good\nknowledge of spoken English (level B2-C1) and between age 18 and 25. They are recruited\nby Conti’s HR team to work remotely for ‘an online store’ abroad. The callers earn $450-500\na month (salary increases by $100 - $200 - $300, depending on the success of the callcentre), working hours are 18:00-2:00 Moscow time (correspond to usual working hours in\nWestern hemisphere), and they receive paid holidays but get no official contract as per the\nLabour Code.\n\nBelow are Mango’s messages to Stern where he suggests some improvements around\nblackmailing/call-center and explains a concept which is ‘more or less’ working for them:\n\n**Figure 26. Mango’s vision on how their call center should operate**\n\nHere is a call sample from Conti’s caller to one of their victims, curtesy of Northwave\nSecurity:\n\n\n-----\n\nConti call sample.mp3\n\nYour browser does not support the `audio element.`\n\n**Cybercriminal entrepreneurship (crypto and Forum)**\n\nBy end of May 2021 Stern instructed Mango to get in touch with the administrators of exploit\nforums to see if they were willing to sell to Conti. “Also get a list of forums which can be\n_considered for sale. XSS - find out a list of active users, per day, week, month. The same for_\n_Antichat and WWH,” continued Stern. Later Mango replied that WWH had laughed out loud_\nat their offer and that hxxp://korovka32xc3t5cg[.]onion and hxxp://crdclub4wraumez4[.]onion\nwere available for sale. However, he advised those forums are rubbish, a hotbed of grifters,\nand instead of trying to buy a forum they should create one on their own. The following is\n**Mango’s suggestion to which he got a ‘go-ahead’ from Stern:**\n\n**Figure 27. Mango to Stern on their new hacker forum and it’s functionalities**\nIn July 2021, Mango sent two design suggestions for the social network (aka forum) to Stern\n– one in dark-green and another in dark-blue color schemes. Stern approved the dark-green\nvariant for the forum and suggested it was ready to make it available with a minimum\nfunctionality:\n\n**Figure 28. Two design suggestions for the hacker forum**\nBelow are the conversation extracts between Stern and Mango, full of entrepreneurial spirit,\nwhere they brainstorm what functionalities the forum should have and what might potentially\nwork for it and what might not:\n\n\n-----\n\n**Figure 29. Mango and Stern discussing their new hacker forum**\nLater Mango suggested a potential domain for the forum and a logo for it:\n“matryoshka[.]space (already with the domain:)) and as a logo matryoshka but angry, in our\n_color scheme, dark-green, and may be draw a laptop next to it. In principle matches the_\n_theme. We are one big system amongst the multiple other sub-systems in one place. And it_\n_is clear that it is a Russian theme. It is going to be cool, and easy to remember, I think it will_\n_resonate with everyone”._\n\n**Purchase of Carbon Black and SonicWall**\n\nIn March 2021 Stern said to Defender that he needs Carbon Black AV. In April 2021 Mango\nasked Professor if 60k (currency is unknown) is a lot for Carbon, 30k for the firm who buys\nand 30k for the Carbon itself for 250 PCs. A week later it seems that Mango managed to\npurchase Carbon Black via a firm in France for 14.8k euros (plus 20% for BTC conversion\nand 30k for the firm as promised). However, Stern did not take Carbon Black AV and in July\n2021 Mango asked him why they aren’t doing anything with Carbon Black to which Stern\nreplied that originally Ryuk needed it and now for some reason they no longer do:\n\n**Figure 30. Stern advising to Mango Carbon Black AV was bought for Ryuk team**\n\n\n-----\n\nIn February 2021 Stern said to Swift (tester/coder) that he also needs SonicWall solution.\nHe broadcast to all the contacts in Jabber “Who can figure out the vulnerability in SonicWall\nand make a working scanner for it?” to which Ghost (tester/coder) replied “This one, CVE_2020-5135: Critical SonicWall VPN Portal Stack-based Buffer Overflow Vulnerability, right?”._\nThe CVE-2020-5135 is a CVSSv3 9.4/10 critical vulnerability which was fixed around\nNovember 2020 and according to SonicWall PSIRT there was no exploitation observed in the\nwild. Mid-April 2021 Mango advised Stern there are several ways to buy SonicWall (even a\nnew model SMA 410) and later that they manage to buy new as well as refurbished ones:\n\n**Figure 31. Mango to Stern on the purchase of SonicWall**\nThere is not much further information regarding SonicWall, except that in June 2021\n**Subzero (tester/coder) advised to Stern that he “figured out the SonicWall”.**\n\n## Conclusion\n\nFinancially motivated cyber criminals have a history of collaboration across borders and\noften stay away from politics. However, the current Russia-Ukraine conflict isn’t one to\nignore, not even for cybercriminals, as they are forced to choose sides.\n\nThe ContiLeaks and TrickBotLeaks were a direct result of this conflict. The leaks are of an\nunprecedented level and show the world how a government backed, multimillion-dollar\nransomware gang operates. In some fashion it was almost like a normal business; wages\nneeded to be paid, software licenses obtained, customer service initiated, and strategic\nalliances had to be formed. However, make no mistake, this business is dealing in top level\ncybercrime, with a strategic alliance to an intelligence apparatus responsible for several\nnation-state attacks.\n\nIn our line of work, we are often aware of technical innerworkings, partnerships between\nmalware families and suspected nation state relationships but reading the internal\nconversations and having our suspicions confirmed was very insightful.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-31 - Conti Leaks- Examining the Panama Papers of Ransomware.pdf"
    ],
    "report_names": [
        "2022-03-31 - Conti Leaks- Examining the Panama Papers of Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535875,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653698714,
    "ts_modification_date": 1653698714,
    "files": {
        "pdf": "https://archive.orkl.eu/399e88e0b1d4b492b280558899a6f855b842f278.pdf",
        "text": "https://archive.orkl.eu/399e88e0b1d4b492b280558899a6f855b842f278.txt",
        "img": "https://archive.orkl.eu/399e88e0b1d4b492b280558899a6f855b842f278.jpg"
    }
}