{
    "id": "782309df-5be7-4a91-ac64-6ad7f90cf491",
    "created_at": "2023-01-12T15:10:23.518361Z",
    "updated_at": "2025-03-27T02:05:31.034506Z",
    "deleted_at": null,
    "sha1_hash": "7e93f817b0bb0cd9e6f10a97442c7e27f747cf68",
    "title": "2021-12-22 - Alert (AA21-356A) Mitigating Log4Shell and Other Log4j-Related Vulnerabilities",
    "authors": "",
    "file_creation_date": "2022-05-27T22:51:02Z",
    "file_modification_date": "2022-05-27T22:51:02Z",
    "file_size": 136727,
    "plain_text": "# Mitigating Log4Shell and Other Log4j-Related Vulnerabilities\n\n**cisa.gov/uscert/ncas/alerts/aa21-356a**\n\n## Summary\n\nThe Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of\nInvestigation (FBI), National Security Agency (NSA), Australian Cyber Security Centre\n(ACSC), Canadian Centre for Cyber Security (CCCS), the Computer Emergency Response\nTeam New Zealand (CERT NZ), the New Zealand National Cyber Security Centre (NZ\nNCSC), and the United Kingdom’s National Cyber Security Centre (NCSC-UK) are releasing\nthis joint Cybersecurity Advisory (CSA) to provide mitigation guidance on addressing\n[vulnerabilities in Apache’s Log4j software library: CVE-2021-44228 (known as “Log4Shell”),](https://nvd.nist.gov/vuln/detail/CVE-2021-44228)\n[CVE-2021-45046, and](https://nvd.nist.gov/vuln/detail/CVE-2021-45046) [CVE-2021-45105. Sophisticated cyber threat actors are actively](https://nvd.nist.gov/vuln/detail/CVE-2021-45105)\nscanning networks to potentially exploit Log4Shell, CVE-2021-45046, and CVE-2021-45105\nin vulnerable systems. According to public reporting, Log4Shell and CVE-2021-45046 are\nbeing actively exploited.\n\nCISA, in collaboration with industry members of CISA’s Joint Cyber Defense Collaborative\n[(JCDC), previously published guidance on Log4Shell for vendors and affected organizations](https://www.cisa.gov/uscert/apache-log4j-vulnerability-guidance)\nin which CISA recommended that affected organizations immediately apply appropriate\npatches (or apply workarounds if unable to upgrade), conduct a security review, and report\ncompromises to [CISA or the](https://us-cert.cisa.gov/report) [FBI. CISA also issued an](https://www.fbi.gov/log4j) [Emergency Directive directing U.S.](https://www.cisa.gov/emergency-directive-22-02)\nfederal civilian executive branch (FCEB) agencies to immediately mitigate Log4j\nvulnerabilities in solution stacks that accept data from the internet. This joint CSA expands\non the previously published guidance by detailing steps that vendors and organizations with\nIT and/or cloud assets should take to reduce the risk posed by these vulnerabilities.\n\nThese steps include:\n\nIdentifying assets affected by Log4Shell and other Log4j-related vulnerabilities,\nUpgrading Log4j assets and affected products to the latest version as soon as patches\nare available and remaining alert to vendor software updates, and\nInitiating hunt and incident response procedures to detect possible Log4Shell\nexploitation.\n\nThis CSA also provides guidance for affected organizations with operational technology\n(OT)/industrial control systems (ICS) assets.\n\nLog4j is a Java-based logging library used in a variety of consumer and enterprise services,\nwebsites, applications, and OT products. These vulnerabilities, especially Log4Shell, are\nsevere—Apache has rated Log4Shell and CVE-2021-45046 as critical and CVE-2021-45105\n\n\n-----\n\nas high on the Common Vulnerability Scoring System (CVSS). These vulnerabilities are likely\nto be exploited over an extended period. CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ\nNCSC, and NCSC-UK strongly urge all organizations to apply the recommendations in the\nMitigations section.\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK encourage leaders\nof organizations to review NCSC-UK’s blog post, Log4j vulnerability: what should boards be\nasking?, for information on Log4Shell’s possible impact on their organization as well as\nresponse recommendations.\n\n**Note: this is an evolving situation, and new vulnerabilities are being discovered. CISA, the**\nFBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK will update this CSA as we\nlearn more about this exploitation and have further guidance to impart.\n\n[Click here for a PDF version of this report.](https://www.cisa.gov/sites/default/files/publications/AA21-356A_Joint_CSA_Mitigating_Log4Shell_and_Other_Log4j-Related_Vulnerabilities.pdf)\n\n## Disclaimer\n\nThe information in this report is being provided “as is” for informational purposes only. CISA,\nthe FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK do not endorse any\ncommercial product or service, including any subjects of analysis. Any reference to specific\ncommercial products, processes, or services by service mark, trademark, manufacturer, or\notherwise, does not constitute or imply endorsement, recommendation, or favoring by CISA,\nthe FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, or NCSC-UK.\n\n## Technical Details\n\n**Log4Shell**\n\n[Log4Shell, disclosed on December 10, 2021, is a remote code execution (RCE) vulnerability](https://nvd.nist.gov/vuln/detail/CVE-2021-44228)\naffecting Apache’s Log4j library, versions 2.0-beta9 to 2.14.1. The vulnerability exists in the\naction the Java Naming and Directory Interface (JNDI) takes to resolve variables. Affected\nversions of Log4j contain JNDI features—such as message lookup substitution—that do not\nprotect against adversary-controlled Lightweight Directory Access Protocol (LDAP), Domain\nName System (DNS), and other JNDI-related endpoints.\n\nAn adversary can exploit Log4Shell by submitting a specially crafted request to a vulnerable\nsystem that causes that system to execute arbitrary code. The request allows the adversary\nto take full control over the system. The adversary can then steal information, launch\nransomware, or conduct other malicious activity.\n\n**CVE-2021-45046**\n\n\n-----\n\n[CVE-2021-45046, disclosed on December 13, 2021, enables a remote attacker to cause](https://nvd.nist.gov/vuln/detail/CVE-2021-45046)\nRCE, a denial-of-service (DoS) condition, or other effects in certain non-default\nconfigurations. This vulnerability affects all versions of Log4j from 2.0-beta9 through 2.12.1\nand 2.13.0 through 2.15.0. In response, Apache released Log4j version 2.16.0 (Java 8).\n\n**CVE-2021- 45105**\n\n[CVE-2021-45105, disclosed on December 16, 2021, enables a remote attacker to cause a](https://nvd.nist.gov/vuln/detail/CVE-2021-45105)\nDoS condition or other effects in certain non-default configurations. According to Apache,\nwhen the logging configuration uses a non-default Pattern Layout with a Context Lookup (for\nexample, `$${ctx:loginId} ), attackers with control over Thread Context Map (MDC) input`\ndata can craft malicious input data that contains a recursive lookup, resulting in a\n```\nStackOverflowError that will terminate the process. In response, Apache released Log4j\n\n```\nversion 2.17.0 (Java 8).\n\n**Impact**\n\nLog4Shell and CVE-2021-45046—rated as critical vulnerabilities by Apache—are severe\nbecause Java is used extensively across IT and OT platforms, they are easy to exploit, and\napplying mitigations is resource intensive. Log4Shell is especially critical because it allows\nmalicious actors to remotely run code on vulnerable networks and take full control of\nsystems.\n\nAccording to public reporting, exploitation of Log4Shell began on or around December 1,\n2021, and a proof-of-concept exploit is publicly available for this vulnerability. The FBI has\nobserved attempted exploitation and widespread scanning of the Log4j vulnerability to gain\naccess to networks to deploy cryptomining and botnet malware. The FBI assesses this\nvulnerability may be exploited by sophisticated cyber threat actors and incorporated into\nexisting cyber criminal schemes that are looking to adopt increasingly sophisticated\n[obfuscation techniques. According to public reporting, CVE-2021-45046 is being actively](https://blog.cloudflare.com/protection-against-cve-2021-45046-the-additional-log4j-rce-vulnerability/)\nexploited as well.\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK assess that\nexploitation of these vulnerabilities, especially Log4Shell, is likely to increase and continue\nover an extended period. Given the severity of the vulnerabilities and likely increased\nexploitation, CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK\nstrongly urge all organizations to apply the recommendations in the Mitigations section to\nidentify, mitigate, and update affected assets.\n\n[For more information on these vulnerabilities, see the Apache Log4j Security Vulnerabilities](https://logging.apache.org/log4j/2.x/security.html)\nwebpage.\n\n## Mitigations\n\n**Vendors**\n\n\n-----\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK encourage\nvendors to:\n\n1. Immediately identify, mitigate, and update affected products that use Log4j to the\n\nlatest patched version.\n\n1. For environments using Java 8 or later, upgrade to Log4j version 2.17.0 (released\n\nDecember 17, 2021) or newer.\n2. For environments using Java 7, upgrade to Log4j version 2.12.3 (released\n\nDecember 21, 2021). Note: Java 7 is currently end of life and organizations\nshould upgrade to Java 8.\n2. Inform your end users of products that contain these vulnerabilities and strongly\n\nurge them to prioritize software updates. CISA, the FBI, NSA, ACSC, CCCS, CERT\nNZ, NZ NCSC, and NCSC-UK strongly recommend vendors take steps to ensure\nmessaging on software updates reaches the widest possible audience (for example,\navoid placing relevant information behind paywalls). Note: CISA is actively maintaining\na [GitHub page and repository with patch information for products known to be affected](https://github.com/cisagov/log4j-affected-db)\nby Log4Shell. CISA has also notified ICS vendors that may be affected and has asked\nthem to confirm any assets affected by Log4Shell and to apply available mitigations.\n\n**Affected Organizations with IT and Cloud Assets**\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK recommend that\naffected organizations take the following steps to patch these vulnerabilities in their IT and\ncloud assets and initiate threat hunting to detect possible compromise. Organizations with\nOT/ICS environments should review the Organizations with OT/ICS Assets section for\nadditional guidance. Note: this guidance includes resources that may or may not be possible\nfor all organizations. CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSCUK recommend that organizations apply the mitigations listed in this advisory to the extent\nallowed by their environments.\n\n**1. Identify vulnerable assets in your environment.**\n\nKnowing where Log4j and other affected products exist in your environment is key for\nprotecting your networks.\n\n\n-----\n\n1. Inventory all assets that make use of the Log4j Java library. According to public\n\nreporting, adversaries are patching and mitigating assets they compromise to retain\ncontrol of assets. To avoid missing such defense evasion, organizations should\ncarefully track assets under investigation.\n\n1. Assume all versions of Java and Log4j are vulnerable and include them in the\n\ninventory.\n2. Ensure the inventory includes all assets, including cloud assets, regardless of\n\nfunction, operating system, or make. Ensure the inventory includes the following\ninformation about each asset\n\n1. Software versions\n2. Timestamps of when last updated and by whom\n3. User accounts on the asset with their privilege level\n4. Location of asset in your enterprise topology\n2. Identify the inventoried assets that are likely vulnerable.\n\n1. Use CISA's [GitHub repository and](https://github.com/cisagov/log4j-affected-db) [CERT/CC's CVE-2021-44228_scanner to](https://github.com/CERTCC/CVE-2021-44228_scanner)\n\nidentify assets vulnerable to Log4Shell.\n\nAdditional resources for detecting vulnerable instances of Log4j are identified below. CISA,\nthe FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK will update the sources\nfor detection rules as we obtain them. Note: due to the urgency to share this information,\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK have not yet\nvalidated this content.\n\nTo identify server applications that may be affected by Log4Shell and CVE-2021[45046, see TrendMicro: Log4J Vulnerability Tester.](https://log4j-tester.trendmicro.com/)\nFor a list of hashes to help determine if a Java application is running a vulnerable\nversion of Log4j, see:\n\n[Rob Fuller's GitHub page: CVE-2021-44228-Log4Shell-Hashes, and](https://github.com/mubix/CVE-2021-44228-Log4Shell-Hashes)\n[The NCC Group’s GitHub page: Cyber-Defence/Intelligence/CVE-2021-44228/.](https://github.com/nccgroup/Cyber-Defence/tree/master/Intelligence/CVE-2021-44228)\nFor PowerShell to detect vulnerable instances, see:\n\n[Nathan Kula’s GitHub page: PowerShellSnippets/Invoke-Log4ShellScan.ps1, and](https://github.com/omrsafetyo/PowerShellSnippets/blob/master/Invoke-Log4ShellScan.ps1)\n[Will Dormann’s GitHub page: checkjndi.ps1.](https://gist.github.com/wdormann/c609ae63a6ec8b58302b8cf377e0ef15)\nFor guidance on using Canary Token to test for callback, see Thinkst Canary’s Twitter\nthread on using Canary Tokens.\nFor guidance on using Burpsuite Pro to scan, see:\n\nSilent Signal’s GitHub page: [burp-log4shell, and](https://github.com/silentsignal/burp-log4shell)\nPortSwigger’s GitHub page: [active-scan-plus-plus.](https://github.com/PortSwigger/active-scan-plus-plus/blob/master/activeScan++.py)\nFor guidance on using NetMap’s Nmap Scripting Engine (NSE), see Divertor’s GitHub\n[page: nse-log4shell.](https://github.com/Diverto/nse-log4shell)\n[See Florian Roth's GitHub page, Fenrir 0.9.0 - Log4Shell Release, for guidance on](https://github.com/Neo23x0/Fenrir/releases/tag/v0.9.0)\nusing Roth’s Fenrir tool to detect vulnerable instances.\n\n**2. Mitigate known and suspected vulnerable assets in your environment.**\n\n\n-----\n\nA. Treat known and suspected vulnerable assets as compromised. These assets should\nbe isolated until they are mitigated and verified (step 2.D). The method of isolation that you\nshould use depends on the criticality of the asset. Possible isolation methods include:\n\nPhysically removing the asset from the network (e.g., unplug the network cable);\nMoving the asset to a “jail VLAN” with heightened monitoring and security;\nBlocking at the network layer (a switch or some other device);\nImplementing a firewall (including web application firewall) with strict port control and\nlogging; or\nRestricting the asset’s communication, especially to the internet and the rest of the\nenterprise network.\n\nB. Patch Log4j and other affected products to the latest version.\n\nSee the [Apache Log4j Security Vulnerabilities webpage (as of December 22, 2021, the](https://logging.apache.org/log4j/2.x/security.html)\nlatest Log4j version is 2.17.0 for Java 8 and 2.12.3 for Java 7). Note: patching or\nupdating Java is not enough, you must upgrade the Log4j library itself.\nFor other affected products, see CISA’s [GitHub page.](https://github.com/cisagov/log4j-affected-db)\n\n**Note: if your organization is unable to immediately identify and patch vulnerable instances of**\nLog4j, apply appropriate workarounds. CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ\nNCSC, and NCSC-UK recommend using vendor-provided mitigations when available. Due to\nthe rapidly evolving situation, these workarounds should not be considered permanent fixes\nand organizations should apply the appropriate patch as soon as it is made\navailable. Additional mitigations are identified below; however, organizations should use\nthese mitigations at their own risk as they may be incomplete, temporary, or cause harmful\neffects, such as application instability, a DoS condition, or log evasion.\n\nRemove the `Jndilookup.class from the class path. [1]`\nDelete or rename `Jndilookup.class . Note: removal of the` `JndiManager will`\ncause the `JndiContextSelector and` `JMSAppender to no longer function). [2]`\nApply a hot patch.\n\n[NCC Group: log4j-jndi-be-gone: A simple mitigation for CVE-2021-44228](https://research.nccgroup.com/2021/12/12/log4j-jndi-be-gone-a-simple-mitigation-for-cve-2021-44228/)\nAmazon AWS:\n\nGitHub page: [hotpatch-for-apache-log4j2](https://github.com/corretto/hotpatch-for-apache-log4j2)\nBlog: [Hotpatch for Apache Log4j](https://aws.amazon.com/blogs/opensource/hotpatch-for-apache-log4j/)\n\nC.Keep an inventory of known and suspected vulnerable assets and what is done\n**with them throughout this process. It is important to track patching because malicious**\ncyber actors may compromise an asset and then patch it to protect their operations.\nOrganizations should keep a meticulous record of vulnerable assets they have patched to\nidentify whether a threat actor may have patched an asset.\n\nD. Verify the mitigation has worked, if possible.\n\n\n-----\n\n1. Scan the patched/mitigated asset with the tools and methods listed in step 1.B. Use\n\nmore than one method to verify the mitigation was successfully applied.\n2. Monitor the asset closely.\n3. Remain alert to changes from vendors for the software on the asset. Additionally, see\n\nCISA's [GitHub page for known affected products and patch information. CISA will](https://github.com/cisagov/log4j-affected-db)\ncontinually update the repository as vendors release patches.\n\n**3. Initiate hunt and incident response procedures. Given the widespread exploitation of**\nthis vulnerability, CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK\nencourage all organizations to assume their assets that use Log4j may have been\ncompromised and initiate hunt procedures.\n\nA. Hunt for signs of exploitation and compromise.\n\n1. Treat assets that use Log4j as suspect and conduct vigorous forensic investigation of\n\nthose assets.\n2. Inspect and monitor accounts across your enterprise that exist on or connect to assets\n\nthat use Log4j.\n3. Inspect changes to configurations made since December 1, 2021, and verify they were\n\nintended, especially on assets that use Log4j.\n4. Use CISA’s [GitHub page to detect possible exploitation or compromise.](https://github.com/cisagov/log4j-affected-db)\n\nAdditional resources to detect possible exploitation or compromise are identified below.\n**Note: due to the urgency to share this information, CISA, the FBI, NSA, ACSC, CCCS,**\nCERT NZ, NZ NCSC, and NCSC-UK have not yet validated this content.\n\nCisco Talos blog: Threat Advisory: Critical Apache Log4j vulnerability being exploited in\nthe wild\n[Curated Intelligence GitHub page: Log4Shell-IOCs (Note: Curated Intelligence notes](https://github.com/curated-intel/Log4Shell-IOCs)\nthat the “IOCs shared by these feeds are low-to-medium confidence we [Curated\nIntelligence] strongly recommend not adding them to a blocklist.”)\n[EmergingThreat.net: signatures to assist with detection of CVE-2021-44228 activity](https://lists.emergingthreats.net/pipermail/emerging-sigs/2021-December/030523.html)\nFlorian Roth’s GitHub pages:\n\n[Log4j RCE Exploitation Detection](https://gist.github.com/Neo23x0/e4c8b03ff8cdf1fa63b7d15db6e3860b)\n[signature-base/yara/expl_log4j_cve_2021_44228.yar](https://github.com/Neo23x0/signature-base/blob/master/yara/expl_log4j_cve_2021_44228.yar)\n[log4shell-detector](https://github.com/Neo23x0/log4shell-detector)\n[Huntress blog: Critical RCE Vulnerability: log4j - CVE-2021-44228](https://www.huntress.com/blog/rapid-response-critical-rce-vulnerability-is-affecting-java)\nMandiant blog: Now You Serial, Now You Don’t – Systematically Hunting for\nDeserialization Exploits\nMicrosoft Security Response Center: Microsoft’s Response to CVE-2021-44228\nApache Log4j 2\n[NCC Group: Log4Shell: Reconnaissance and post exploitation network detection](https://research.nccgroup.com/2021/12/12/log4shell-reconnaissance-and-post-exploitation-network-detection/)\n\n\n-----\n\nSigma GitHub pages:\n\n[sigma/rules/web/web_cve_2021_44228_log4j.yml](https://github.com/SigmaHQ/sigma/blob/master/rules/web/web_cve_2021_44228_log4j.yml)\n[sigma/rules/web/web_cve_2021_44228_log4j_fields.yml](https://github.com/SigmaHQ/sigma/blob/master/rules/web/web_cve_2021_44228_log4j_fields.yml)\n\nB. If compromise is detected, organizations should:\n\n1. Initiate incident response procedures. See the joint advisory from ACSC, CCCS, NZ\n\nNCSC, CERT NZ, NCSC-UK, and CISA on Technical Approaches to Uncovering and\nRemediating Malicious Activity for guidance on hunting or investigating a network, and\nfor common mistakes in incident handling. CISA, the FBI, NSA, ACSC, CCCS, CERT\nNZ, NZ NCSC, and NCSC-UK encourage organizations to see CISA’s Federal\nGovernment Cybersecurity Incident and Vulnerability Response Playbooks. Although\ntailored to U.S. FCEB agencies, these playbooks provide operational procedures for\nplanning and conducting cybersecurity incident and vulnerability response activities\nand detail each step for both incident and vulnerability response.\n2. Consider reporting compromises immediately to applicable cybersecurity authorities.\n\nOrganizations are encouraged to be as thorough as possible by including information\nsuch as IP addresses/domains used to exploit your infrastructure, exploited\napplications/servers, administrators contact information, and the start and end dates of\nthe attack.\n\n[U.S. organizations should report compromises to CISA and the](https://us-cert.cisa.gov/report) [FBI.](http://www.fbi.gov/log4j)\n[Australian organizations can visit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to](https://www.cyber.gov.au/)\nreport cybersecurity incidents.\nCanadian organizations can report incidents by emailing CCCS at\n[contact@cyber.gc.ca.](http://10.10.0.46/mailto:contact@cyber.gc.ca)\n[New Zealand organizations can visit NCSC.govt.nz to report incidents.](https://www.ncsc.govt.nz/incidents/)\nUK organizations can report a significant cyber security incident at ncsc.gov.uk/reportan-incident (monitored 24 hrs) or, for urgent assistance, call 03000 200 973.\n\n**4. Evaluate and apply other mitigations.**\n\nA. Remain alert to changes from vendors for the software on the asset, and\n**immediately apply updates to assets when notified by a vendor that their product has a**\npatch for this vulnerability. Additionally, see CISA's [GitHub repository for known affected](https://github.com/cisagov/log4j-affected-db)\nproducts and patch information. CISA will continually update the repository as vendors\nrelease patches.\n\nB. Continue to monitor Log4J assets closely. Continually use signatures and indicators\nof compromise that may indicate exploitation.\n\n1. See the exploitation and detection resources listed in step 3.A.(4).\n2. Be aware that there are many ways to obfuscate the exploit string. Do not depend on\n\none detection method to work all the time.\n\n\n-----\n\nC. Continue to monitor the **[Apache Log4j Security Vulnerabilities webpage for new](https://logging.apache.org/log4j/2.x/security.html)**\n**updates. Note: as this is an evolving situation and new vulnerabilities in Log4J are being**\ndiscovered, organizations should ensure their Apache Log4j is up to date. Identify the\nsoftware your enterprise uses and stay on top of updates as these may be superseded by\nother updates and fixes.\n\nD. Block specific outbound Transmission Control Protocol (TCP) and User\n**Datagram Protocol (UDP) network traffic.**\n\n1. Outbound LDAP: for most networks, LDAP is used internally, but it is rare for LDAP\n\nrequests to be routed outside a network. Organizations should block outbound LDAP or\nuse an allowlist for outbound LDAP to known good destinations. Note: this may be\ndifficult to detect on certain ports without a firewall that does application layer filtering.\n2. Remote Method Invocation (RMI): for most networks, RMI is either unused or used\n\nfor internal sources. Organizations should block outbound RMI or use an allowlist for\noutbound RMI to known good destinations.\n3. Outbound DNS: organizations using enterprise DNS resolution can block outbound\n\nDNS from sources other than identified DNS resolvers. At a minimum, blocking direct\noutbound DNS from web application servers configured to use enterprise DNS\nresolution will mitigate the risks to those systems.\n\n**Note: blocking attacker internet IP addresses during this event is difficult due to the high**\nvolume of scanning from non-malicious researchers and vendors. The false positives on IP\naddresses are high. Organizations should focus on looking for signs of successful\nexploitation and not scans.\n\n**Affected Organizations with OT/ICS Assets**\n\nDue to the pervasiveness of the Apache Log4j software library—and the integration of the\nlibrary in operational products—CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC,\nand NCSC-UK strongly recommend that OT asset owners and operators review their\noperational architecture and enumerate the vulnerability status against current product alerts\nand advisories. If a product does not have a security advisory specifically addressing the\nstatus of the vulnerability, treat it with additional protections. CISA, the FBI, NSA, ACSC,\nCCCS, CERT NZ, NZ NCSC, and NCSC-UK urge patching or deployment of mitigations to\nreduce the risk of the threat of these vulnerabilities.\n\n**Note: CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK recommend**\nprioritizing patching IT devices, especially those with internet connectivity. Affected internetfacing devices as well as laptops, desktops, and tablets are especially susceptible to\nexploitation of these vulnerabilities. OT/ICS devices—if segmented appropriately from the IT\nenvironment—do not face the internet and, as such, have a smaller attack surface to this\nvulnerability. Exploitation of IT devices may affect OT/ICS devices if there is insufficient\nnetwork segmentation that prevents lateral movement.\n\n\n-----\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK recommend that\nOT/ICS asset owner/operators take the following guidance into consideration:\n\n1. Review operational architecture and enumerate the vulnerability against current\n\n**product alerts and advisories. If products do not have a security advisory specifically**\naddressing their status of the vulnerability, it is recommended to treat these devices\nwith additional protections.\n2. Implement the steps listed in the previous section to identify and isolate\n\n**vulnerable assets in the OT/ICS environment. Understand what type of products in**\nthe OT environment would be affected. Many OT/ICS-specific products incorporate\nvulnerable versions of the Log4j library.\n3. Use a risk-informed decision-making process to apply the latest version of\n\n**hotfixes or patches to affected devices as soon as is operationally feasible. If patches**\ncannot be applied, mitigations provided by the product’s manufacturer or reseller\nshould be deployed. Note: CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC,\nand NCSC-UK recommend, as quality assurance, that users test the update in a test\ndevelopment environment that reflects their production environment prior to\ninstallation.\n4. Minimize network exposure for all control system devices and/or systems, and\n\n[ensure they are not accessible from the internet.](https://www.cisa.gov/uscert/ics/alerts/ICS-ALERT-10-301-01)\n5. Locate control system networks and remote devices behind firewalls and isolate\n\n**them from the business network.**\n\nWhen remote access is required, use secure methods such as virtual private networks\n(VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most\ncurrent version available. Also recognize that a VPN is only as secure as its connected\ndevices.\n\nCISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK also remind\norganizations to perform proper impact analysis and risk assessment prior to deploying\ndefensive measures.\n\n[CISA also provides a section for control systems security recommended practices on](https://www.cisa.gov/uscert/ics/Recommended-Practices) the ICS\nwebpage on cisa.gov. Several recommended practices are available for reading and\ndownload, including Improving Industrial Control Systems Cybersecurity with Defense-inDepth Strategies.\n\nAdditional mitigation guidance and recommended practices are publicly available on the ICS\nwebpage on cisa.gov in the Technical Information Paper, ICS-TIP-12-146-01B--Targeted\nCyber Intrusion Detection and Mitigation Strategies.\n\nOrganizations observing any suspected malicious activity should follow their established\ninternal procedures and consider reporting compromises immediately.\n\n\n-----\n\n[U.S. organizations should report compromises to CISA and the](https://us-cert.cisa.gov/report) [FBI.](http://www.fbi.gov/log4j)\n[Australian organizations can visit cyber.gov.au or call 1300 292 371 (1300 CYBER 1) to](https://www.cyber.gov.au/)\nreport cybersecurity incidents.\nCanadian organizations can report incidents by emailing CCCS at\n[contact@cyber.gc.ca.](http://10.10.0.46/mailto:contact@cyber.gc.ca)\n[New Zealand organizations can visit NCSC.govt.nz to report incidents.](https://www.ncsc.govt.nz/incidents/)\nUK organizations can report a significant cyber security incident at ncsc.gov.uk/reportan-incident (monitored 24 hrs) or, for urgent assistance, call 03000 200 973.\n\n## Resources\n\nFor more information, resources, and general guidance, including resources and mitigation\nguidance from industry members of JCDC, see CISA’s webpage Apache Log4j Vulnerability\nGuidance. Note: due to the prominent and ever evolving nature of this vulnerability, there are\nmultiple unverified published guidance documents that are geared towards Log4j\nvulnerabilities. CISA, the FBI, NSA, ACSC, CCCS, CERT NZ, NZ NCSC, and NCSC-UK\nencourage all organizations to verify information with trusted sources, such CISA, the FBI,\nNSA, ACSC, CCCS, CERT NZ, NZ NCSC, NCSC-UK vendors.\n\n## References\n\n Revisions\n\nDecember 22, 2021: Initial Version\n\nDecember 23, 2021: Updated Resource URL\n\n[This product is provided subject to this Notification and this](https://www.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa21-356a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-22 - Alert (AA21-356A) Mitigating Log4Shell and Other Log4j-Related Vulnerabilities.pdf"
    ],
    "report_names": [
        "2021-12-22 - Alert (AA21-356A) Mitigating Log4Shell and Other Log4j-Related Vulnerabilities.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536223,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653691862,
    "ts_modification_date": 1653691862,
    "files": {
        "pdf": "https://archive.orkl.eu/7e93f817b0bb0cd9e6f10a97442c7e27f747cf68.pdf",
        "text": "https://archive.orkl.eu/7e93f817b0bb0cd9e6f10a97442c7e27f747cf68.txt",
        "img": "https://archive.orkl.eu/7e93f817b0bb0cd9e6f10a97442c7e27f747cf68.jpg"
    }
}