{
    "id": "7829cb3c-f19a-41ce-a5a6-661b9a79d581",
    "created_at": "2023-01-12T15:03:36.071484Z",
    "updated_at": "2025-03-27T02:13:12.165902Z",
    "deleted_at": null,
    "sha1_hash": "3ea0559ebe78426624320a28bf28edc18755ad0d",
    "title": "2021-04-07 - Wireshark Tutorial- Examining Traffic from Hancitor Infections",
    "authors": "",
    "file_creation_date": "2022-05-28T00:22:25Z",
    "file_modification_date": "2022-05-28T00:22:25Z",
    "file_size": 68754583,
    "plain_text": "# Wireshark Tutorial: Examining Traffic from Hancitor Infections\n\n**[unit42.paloaltonetworks.com/wireshark-tutorial-hancitor-followup-malware/](https://unit42.paloaltonetworks.com/wireshark-tutorial-hancitor-followup-malware/)**\n\nBrad Duncan April 7, 2021\n\nBy [Brad Duncan](https://unit42.paloaltonetworks.com/author/bduncan/)\n\nApril 7, 2021 at 6:00 AM\n\n[Category: Tutorial,](https://unit42.paloaltonetworks.com/category/tutorial/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Cobalt Strike,](https://unit42.paloaltonetworks.com/tag/cobalt-strike/) [Ficker Stealer,](https://unit42.paloaltonetworks.com/tag/ficker-stealer/) [hancitor,](https://unit42.paloaltonetworks.com/tag/hancitor/) [NetSupportManager,](https://unit42.paloaltonetworks.com/tag/netsupportmanager/) [pcap,](https://unit42.paloaltonetworks.com/tag/pcap/) [Send-Safe,](https://unit42.paloaltonetworks.com/tag/send-safe/)\n[Wireshark,](https://unit42.paloaltonetworks.com/tag/wireshark/) [Wireshark Tutorial](https://unit42.paloaltonetworks.com/tag/wireshark-tutorial/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/wireshark-tutorial-hancitor-followup-malware/)\n\n## Executive Summary\n\nAlso known as Chanitor, [Hancitor is malware used by a threat actor designated as MAN1,](https://malpedia.caad.fkie.fraunhofer.de/details/win.hancitor)\nMoskalvzapoe or TA511. Hancitor establishes initial access on a vulnerable Windows host\nand sends additional malware. This Wireshark tutorial reviews activity from recent Hancitor\n\n\n-----\n\ninfections. It provides tips on identifying Hancitor and its followup malware. In this tutorial, we\n[cover examples of Hancitor with Cobalt Strike,](https://attack.mitre.org/software/S0154/) [Ficker Stealer,](https://twitter.com/3xp0rtblog/status/1321209656774135810) [NetSupport Manager RAT, a](https://www.bleepingcomputer.com/news/security/microsoft-warns-of-massive-phishing-attack-pushing-legit-rat/)\n[network ping tool and](https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/) [Send-Safe spambot malware.](http://web.archive.org/web/20190918103313/www.send-safe.com/send-safe.html)\n\nThis tutorial is designed for security professionals who investigate suspicious network activity\n[and review packet captures (pcaps). Familiarity with Wireshark is necessary to understand](https://www.wireshark.org/)\nthis tutorial, which focuses on Wireshark version 3.x.\n\nNote: These instructions assume you have customized Wireshark as described in our\nprevious Wireshark tutorial about customizing the column display.\n\nYou will need to access a GitHub repository with ZIP archives containing the pcaps used for\nthis tutorial.\n\n**Warning: The pcaps for this tutorial contain Windows-based malware. There is a risk of**\ninfection if using a Windows computer. If possible, we recommend you review these pcaps in\na non-Windows environment such as BSD, Linux or macOS.\n\n## Chain of Events for a Hancitor Infection\n\nHancitor is distributed through email. These emails each contain an HTTPS link for a Google\nDrive URL through docs.google.com. These Google Drive pages link to a different domain\nthat returns a malicious Word document. Enabling macros on the Word document starts the\ninfection by dropping a DLL.\n\nThe infected host first generates Hancitor command and control (C2) traffic. Then we see\nURLs for followup malware such as Ficker Stealer. If the infected host is part of an Active\nDirectory (AD) environment, Hancitor will also send Cobalt Strike. Cobalt Strike provides\nanother access channel for further malicious files such as a network ping tool or NetSupport\nManager RAT-based malware. In some cases, we also see Send-Safe spambot malware,\nwhich turns the infected Windows host into a spambot pushing more Hancitor emails.\n\n\n-----\n\nFigure 1. Chain of events for recent Hancitor infections.\nKnowing this chain of events will better help you understand traffic generated during a\n[Hancitor infection. More details can be found in our blog about recent Hancitor infections.](https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/)\n\n## Pcaps of Hancitor Infection Activity\n\nFour password-protected ZIP archives containing five pcaps of recent Hancitor activity are\n[available at this GitHub repository. From the GitHub page, click on each of the ZIP archive](https://github.com/pan-unit42/wireshark-tutorial-Hancitor-traffic)\nentries and download them, as shown in Figures 2 and 3.\n\n\n-----\n\nFigure 2. GitHub repository with links to ZIP archives used for this tutorial.\n\nFigure 3. Downloading the first ZIP archive for this tutorial.\nUse infected as the password to extract pcaps from these four ZIP archives. This should\ngive you the following five pcap files:\n\nExample-1-2021-02-17-Hancitor-infection.pcap\nExample-2-2021-02-10-Hancitor-infection-part-1-of-2.pcap\nExample-2-2021-02-10-Hancitor-infection-part-2-of-2.pcap\nExample-3-2021-01-25-Hancitor-infection.pcap\n\n\n-----\n\nExample-4-2021-02-02-Hancitor-infection.pcap\n\n## Example 1: Hancitor with Ficker Stealer and Cobalt Strike\n\nOpen Example-1-2021-02-17-Hancitor-infection.pcap in Wireshark and use a basic web\n[filter as described in our previous tutorial about Wireshark filters. The basic filter for](https://unit42.paloaltonetworks.com/using-wireshark-display-filter-expressions/)\nWireshark 3.x is:\n\n(http.request or tls.handshake.type eq 1) and !(ssdp)\n\nIf you’ve set up Wireshark according to our initial tutorial about customizing Wireshark\ndisplays, your display should look similar to Figure 4.\n\nFigure 4. Our first pcap in this tutorial filtered in Wireshark.\nThe pcap comes from an AD environment with the following characteristics:\n\nLAN segment range: 10.2.17.0/24\nDomain: bean-genie.com\nDomain controller: 10.2.17.2 - Bean-Genie-DC\nLAN segment gateway: 10.2.17.1\nLAN segment broadcast address: 10.2.17.255\nIP address of the infected Windows host: 10.2.17.101\nHost name of the infected Windows host: DESKTOP-GBW8K4N\n\n\n-----\n\nUser account name on the infected Windows host: frankie.muntz\n\nEmails pushing Hancitor use HTTPS links to docs.google.com. In our first pcap, the 13th\nframe listed in the column display uses this domain name. Below, Figure 5 highlights\ndocs.google.com in our Wireshark column display.\n\nFigure 5. HTTPS traffic to docs.google.com from our first pcap.\nOf note, docs.google.com is a legitimate domain, and it is not inherently malicious. However,\nGoogle Drive is frequently abused by the criminals behind Hancitor. Below, Figure 6 shows a\nweb page from one of these URLs created by MAN1/Moskalvzapoe/TA511 for Hancitor.\n\n\n-----\n\nFigure 6. Example of Google Drive URL hosting a page for Hancitor.\nAbove in Figure 6, the link in \"Click here to download the document\" leads to a page that\nprovides the malicious Word document. URLs for these pages end with .php. In many cases,\nthese URLs also use HTTPS. Fortunately, in this tutorial, all four examples have unencrypted\nHTTP as the URL for the Word document. That makes them easy to find in our pcaps.\n\nStill using your basic web filter, scroll down until you see two HTTP GET requests to the\nsame domain that end with .php. Below, Figure 7 shows these two HTTP GET requests in\nthe Wireshark column display. They are both for:\n\nsomdeeppalace[.]com - GET /slickness.php\n\n\n-----\n\nFigure 7. Two URLs ending in .php that deliver a malicious Word document for Hancitor.\nYou could also use the following Wireshark filter to more quickly find these two URLs:\n\nhttp.request.method eq GET and http.request.uri contains .php\n\nBelow, Figure 8 shows the results of this filter.\n\nFigure 8. Filtering specifically for the two URLs.\nRight-click on either HTTP GET request for slickness.php in your column display and follow\nthe HTTP stream, as shown below in Figure 9.\n\n\n-----\n\nFigure 9. Following HTTP stream for traffic to somdeeppalace[.]com.In the HTTP stream\nwindow, scroll down past the second set of HTTP request and response headers, then\nexamine the HTML script after the initial <body> tag. You should find a large amount of\nbase64 text shortly after a script function for saveAs. The beginning of this text is shown\nbelow in Figure 10.\n\n\n-----\n\nFigure 10. HTTP stream showing saveAs function followed by base64 text.\nScroll down to the end of the HTTP stream. You should find a script that offers to save a file\nnamed 0217_2857682888090.doc created from the base64 text. This is the malicious Word\ndocument. After the closing </body> tag, additional script refreshes the web page to a\ndifferent URL. See Figure 11 below for details.\n\n\n-----\n\nFigure 11. Script showing file name for the malicious Word document and refreshing the\nbrowser to a different URL.\nWe can obtain a copy of this malicious Word document by exporting the web page from the\npcap and opening it in a web browser. Since this is malware, we recommend you do this in a\nnon-Windows environment or a controlled lab setting.\n\nFirst, export the web page by using the following menu path, as shown below in Figure 12:\n\nFile --> Export Objects --> HTTP\n\n\n-----\n\nFigure 12. Using Wireshark to export HTTP objects from the pcap.\nFind the second entry for slickness.php from somdeeppalace[.]com that is 534 kB, as shown\nbelow in Figure 13. Then save it as a web page using a file name ending with .htm or .html.\n\nFigure 13. Saving the second entry for sickness.php from the HTTP object list.\nOpen your saved HTML page in a web browser. You should see a pop-up menu including the\noption to save the malicious Word document. You should also see that your web browser has\nbeen refreshed to a URL ending with the string cashplus. See Figure 14 below for details.\n\n\n-----\n\nFigure 14. Viewing your saved HTML page in a web browser.\nThis malicious Word document caused Hancitor C2 traffic that starts less than two minutes\nlater in the pcap.\n\n**What does Hancitor C2 traffic look like?**\n\nHancitor first causes an IP address check to api.ipify.org by the infected Windows host. Then\nit causes the C2 traffic. Hancitor C2 traffic consists of HTTP POST URLs that end with\n/8/forum.php.\n\nOf note, traffic to api.ipify.org is an indicator, but it’s not inherently malicious by itself.\n\nUsing your basic web filter, scroll down to find an IP address check to api.ipify.org followed\nby the first HTTP POST request for Hancitor C2 traffic to thavelede[.]ru. Below, Figure 15\nshows where you can find these two items.\n\n\n-----\n\nFigure 15. IP address check followed by Hancitor C2 noted in the Wireshark column display.\nSince November 2020, URLs for Hancitor C2 traffic have always ended with /8/forum.php.\nThe easiest way to check for Hancitor-specific traffic in Wireshark is using the following filter:\n\nhttp.request.uri contains \"/8/forum.php\" or http.host contains api.ipify.org\n\nThe above Wireshark filter should show you Hancitor’s IP address check followed by HTTP\nPOST requests for Hancitor C2 traffic, as shown below in Figure 16.\n\nFigure 16. Filtering for Hancitor-specific traffic in Wireshark.\n\napi.ipify.org - GET /\nthavelde[.]ru - POST /8/forum.php\nzinsubtal[.]ru - POST /8/forum.php\n\n\n-----\n\nThe results also include the following HTTP GET request generated by Ficker Stealer\nmalware:\n\napi.ipify.org - GET /?format=xml\n\nWe will cover Ficker Stealer traffic later. First, let us examine how Hancitor sends its followup\nmalware.\n\nHancitor uses a specific domain to send Ficker Stealer and Cobalt Strike as followup\nmalware. This domain changes each day Hancitor is active, but you should see three HTTP\nGET requests to the same domain for followup malware. One of the URLs ends with .exe,\nwhich is for Ficker Stealer. Two of the URLs end with .bin, which are for Cobalt Strike.\n\nUse the following Wireshark filter to find URLs for Ficker Stealer and Cobalt Strike:\n\nhttp.request.uri contains .exe or http.request.uri contains .bin\n\nThe results are shown below in Figure 17.\n\nFigure 17. Filtering for Hancitor sending Cobalt Strike and Ficker Stealer.\nAs shown above in Figure 17, filtering for followup malware from Hancitor should reveal the\nfollowing traffic in our first pcap:\n\nbelcineloweek[.]ru - GET /6sufiuerfdvc.exe\nbelcineloweek[.]ru - GET /1602s.bin\nbelcineloweek[.]ru - GET /1602s.bin\n\nThe first HTTP GET request returned an EXE file for Ficker Stealer. The next two HTTP GET\nrequests returned encoded data used to infect the victim with Cobalt Strike.\n\n**What does Ficker Stealer infection traffic look like?**\n\nFicker Stealer is the same EXE file for several weeks at a time. Since 2021-01-20 until as\nrecently as 2021-03-04, the SHA256 hash for Ficker Stealer has been:\n\n94e60de577c84625da69f785ffe7e24c889bfa6923dc7b017c21e8a313e4e8e1\n\n\n-----\n\nThe above EXE for Ficker Stealer causes an IP address check to api.ipifiy.org/?format=xml,\nwhich is not inherently malicious on its own. Ficker Stealer then generates a DNS query for\nsweyblidian[.]com and sends non-HTTP traffic over TCP port 80 to that domain. This traffic\nconsists of data stolen from the infected Windows host.\n\nTo find the IP address used for sweyblidian[.]com, search for the associated DNS query\nusing the following Wireshark filter:\n\ndns.qry.name contains sweyblidian\n\nThe answer to this query is the IPv4 address 185.100.65[.]29, as shown below in Figure 18.\n\nFigure 18. Finding the IP address used for sweyblidian[.]com.Find any TCP streams to that\nIP address using the following Wireshark filter:\nip.addr eq 185.100.65.29 and tcp.flags eq 0x0002\n\nThe results should reveal three TCP SYN segments for two TCP streams (one of the TCP\nSYN segments is a retransmission), as shown below in Figure 19.\n\n\n-----\n\nFigure 19. TCP SYN segments for two TCP streams to the IP address for\nsweyblidian[.]com.Follow the TCP stream with port 49807 as the TCP source port. This\nshould show approximately 1.16 MB of data. The majority of it appears encoded or otherwise\nobfuscated, as shown below in Figure 20.\n\nFigure 20. TCP stream showing the start of data exfiltrated by Ficker Stealer.\nAfter exfiltrating its data, Ficker Stealer goes quiet and we don’t see anything more from it. At\nthis point, if the infected computer is a standalone Windows host, we will only see Hancitor\nC2 traffic. But if the infected computer is part of an AD environment, we should also see\nCobalt Strike.\n\n\n-----\n\nLet s look at the initial requests for Cobalt Strike by Hancitor using the following Wireshark\nfilter:\n\nhttp.request.uri contains .bin\n\nThis should return the following lines:\n\nbelcineloweek[.]ru - GET /1602s.bin\nbelcineloweek[.]ru - GET /1602s.bin\n\nFollow the TCP stream for either of those HTTP GET requests. This TCP stream contains all\nthree HTTP GET requests and responses to and from belcineloweek[.]ru, so you must scroll\npast a large amount of data representing the Ficker Stealer EXE. Near the end of the TCP\nstream, you should find two identical HTTP GET requests for 1602s.bin. Both requests return\nthe same 682 bytes of data as shown below in Figure 21. This data is used to infect the\nvictim with Cobalt Strike.\n\nFigure 21. TCP stream showing 682 bytes of data returned from belcineloweek[.]ru for\nCobalt Strike.\n\n**What does Cobalt Strike traffic look like?**\n\n\n-----\n\nIt can be HTTP or HTTPS. In this pcap, HTTP GET requests by Hancitor for Cobalt Strike\nuse the letter s in the URLs. The request for 1602s.bin indicates Cobalt Strike for this\ninfection uses HTTPS traffic.\n\nThat is indeed what happened. Use your basic web traffic filter, then scroll down, and you\nshould see several frames in the column display to 192.99.250[.]2 over TCP port 443 as\nshown below in Figure 22. This is Cobalt Strike traffic. Cobalt Strike traffic to this IP address\ndoes not have an associated domain, so the host name is blank in the column display.\n\nFigure 22. Traffic from the infected Windows host caused by Cobalt Strike.\nCertificate issuer data for HTTPS traffic caused by Cobalt Strike HTTPS is unusual. Why?\nBecause all of the identification fields for items like country, locality and organization are\nblank. We can filter for certificate data in Cobalt Strike’s HTTPS traffic and expand the frame\ndetails to see this.\n\nFirst, find certificate data from the IP address for Cobalt Strike traffic by using the following\nWireshark filter:\n\ntls.handshake.type eq 11 and ip.addr eq 192.99.250.2\n\nThis should reveal two frames in your column display. Expand frame details for either of\nthese frames until you find fields for certificate issuer data. These fields should be blank.\nBelow, Figure 23 shows an example.\n\n\n-----\n\nFigure 23. Certificate issuer data for Cobalt Strike traffic.\nFor the rest of this pcap, we see HTTP GET requests for Hancitor C2 and HTTPS traffic for\nCobalt Strike. Hancitor C2 traffic happens approximately every 2 minutes. HTTPS traffic for\nCobalt Strike happens nearly every second.\n\n## Example 2, Part 1: Hancitor with Ficker Stealer and Cobalt Strike\n\nOpen Example-2-2021-02-10-Hancitor-infection-part-1-of-2.pcap in Wireshark and use a\nbasic web filter, as shown in Figure 24.\n\n\n-----\n\nFigure 24. Traffic from part one of our second example filtered in Wireshark using a basic\nweb filter.\nThe pcap comes from an AD environment with the following characteristics:\n\nLAN segment range: 10.2.10.0/24\nDomain: pizzawithapples.food\nDomain controller: 10.2.10.10 - Apples-DC\nLAN segment gateway: 10.2.10.1\nLAN segment broadcast address: 10.2.10.255\nIP address of the infected Windows host: 10.2.10.101\nHost name of the infected Windows host: DESKTOP-TRH50EJ\nUser account name on the infected Windows host: dave.thomas\n\nAbove in Figure 24, we see a link to docs.google.com followed by HTTP GET requests to\nb2b.ebike-your-life[.]com/commemorative.php. As we did in our first example, we can export\nthe HTML page from b2b.ebike-your-life[.]com from our second example and open it in a\nweb browser to get the malicious Word document.\n\nThe SHA256 hash for your Word document should be\n793d134cdb4bcba47e1f678d052c4d7747b93ea4199714efb8b614321b58dca7, and its name\nshould be 0210_1723194332604.doc.\n\nAlso as we did for our first example, find Hancitor C2 activity using the following Wireshark\nfilter:\n\n\n-----\n\nhttp.request.uri contains /8/forum.php or http.host contains api.ipify.org\n\nThis returns IP address checks by Hancitor and Ficker Stealer, along with Hancitor C2 traffic,\nas listed below and shown in Figure 25.\n\napi.ipify.org - GET /\nanumessensan[.]ru - POST /8/forum.php\napi.ipify.org - GET /?format=xml\n\nFigure 25. IP address checks and Hancitor C2 traffic.\nFilter for followup malware sent by Hancitor using the following Wireshark filter:\n\nhttp.request.uri contains .exe or http.request.uri contains .bin\n\nThis should reveal Hancitor sending followup malware for Cobalt Strike and Ficker Stealer,\nas listed below and shown in Figure 26:\n\nbackupez[.]com - GET /0902.bin\nbackupez[.]com - GET /0902s.bin\nbackupez[.]com - GET /6yudfgh.exe\n\nFigure 26. Hancitor sends follow-up malware for Cobalt Strike and Ficker Stealer.\nIn this case, one of the GET requests for Cobalt Strike has an s in the URL, but the other\ndoes not, so we should see both HTTP and HTTPS traffic caused by the Cobalt Strike.\n\nReturn to your basic web filter, then scroll down to see what type of HTTP requests happen\nafter the traffic to backupez[.]com. The results should show HTTP traffic over TCP port 1080\nand HTTPS traffic over TCP port 4443.\n\n\n-----\n\nYour Wireshark setup might not display any HTTP traffic over TCP port 1080, so you might\nhave to set up Wireshark to show it. First, use the menu path Analyze --> Decode As shown\nbelow in Figure 27 to bring up the Decode As window.\n\nFigure 27. Menu path for the Decode As window.\nOnce you have the Decode As window, create a new entry to decode TCP port 1080 as\nHTTP, as shown below in Figure 28.\n\nFigure 28. Creating a new entry in the Decode As window to decode TCP port 1080 as\nHTTP.\n\n\n-----\n\nWhen you ve created the new entry, either click the OK button or click the Save button. The\nSave button literally saves the entry, so it will work after you close and open Wireshark again.\nThe OK button applies the decoding only as long as your current Wireshark session stays\nopen.\n\nIn this case, we should click the Save button.\n\nAfter saving the entry, go back to your Wireshark column display and use the basic web filter.\nScroll down, and you should see both HTTP and HTTPS traffic for Cobalt Strike, as\nhighlighted below in Figure 29.\n\nFigure 29. Traffic caused by Cobalt Strike in our second example.\nShown above in Figure 29, traffic caused by Cobalt Strike is:\n\n104.160.190[.]114:8080 - GET /WWFh\n104.160.190[.]114:8080 - GET /fwlink\n104.160.190[.]114 port 4443 - HTTPS traffic\n\nThe first HTTP GET request, ending with WWFh, returned 208,473 bytes of an encoded\nbinary that most likely decodes to a Windows binary used for Cobalt Strike. Follow the TCP\nstream for this HTTP request, and you should see information shown below in Figure 30.\n\n\n-----\n\nFigure 30. TCP stream of the initial HTTP GET request to 104.160.190[.]114:8080.Further\nHTTP traffic to 104.160.190[.]114:8080 for fwlink is Cobalt Strike C2 traffic. This traffic also\nreturns encoded data, if it returns any data at all. In most cases, zero bytes of content are\nreturned. The first HTTP request to 104.160.190[.]114:8080 for fwlink returned 48 bytes of\nencoded data, as shown below in Figure 31.\n\n\n-----\n\nFigure 31. First HTTP request for Cobalt Strike C2 traffic returned 48 bytes of data.These\nHTTP requests for Cobalt Strike C2 happen approximately once every second. HTTPS traffic\nfor Cobalt Strike C2 is similarly busy, with traffic to 104.160.190[.]114 over TCP port 4443\nappearing approximately once every second.\nOur next pcap for our second example is from later during the same infection, when we see\nindicators of Send-Safe spambot malware.\n\n## Example 2, Part 2: Hancitor C2, Cobalt Strike C2 and Send-Safe Spambot Malware\n\nOpen Example-2-2021-02-10-Hancitor-infection-part-2-of-2.pcap in Wireshark and use a\nbasic web filter, as shown in Figure 32.\n\n\n-----\n\nFigure 32. Traffic from part two of our second example filtered in Wireshark using a basic\nweb filter.\nThis pcap happens later during the same infection as our previous pcap. At times, we see up\nto three or four HTTP GET requests for Cobalt Strike C2 traffic during the same second.\n\nHowever, this pcap reveals that Hancitor sent another Windows executable file, and that\nexecutable is Send-Safe-based spambot malware.\n\nTo find this Windows executable file, use the following Wireshark filter:\n\nhttp.request.uri contains .exe\n\nThe result is another HTTP GET request to backupez[.]com, which is the domain used by\nHancitor to push followup malware in part one of this example. The URL ends with 47.exe.\nSee the result below in Figure 33.\n\nFigure 33. Hancitor retrieves Windows executable for Send-Safe spambot malware.\n\n\n-----\n\nYou can export this file from the pcap using the menu path File --> Export Objects -->\n**_HTTP. Select the entry for 47.exe from backupez[.]com, as shown below in Figure 34._**\n\nFigure 34. Exporting the Send-Safe spambot EXE from the pcap.\nThe SHA256 hash of 47.exe is:\n\n51ca66a8ac7f4e072b39ef886d7d414d6c6868d0d67a46150835297e65493dc6\n\nSend-Safe was a commercially available program sold through a now-defunct website\nnamed send-safe[.]com. It was advertised as \"...a bulk-emailing program that allows you to\n[send email from your own computer, or a remote computer with or without the use of](http://web.archive.org/web/20190918103313/www.send-safe.com/send-safe.html)\nproxies.\"\n\nThis program has been used by various threat actors as malware to turn infected Windows\ncomputers into spambot hosts.\n\nWhat does Send-Safe spambot traffic look like? Our infected Windows host generated the\nfollowing traffic:\n\nHTTPS traffic to 31.44.184[.]47 over TCP port 50025\nTraffic to 31.44.184[.]47 over UDP port 50026\nSMTP traffic sending out malicious spam pushing Hancitor.\n\nTo find Send-Safe UDP traffic, use udp.port eq 50026 for your Wireshark filter. The results\nshould look like Figure 35 below.\n\n\n-----\n\nFigure 35. UDP traffic caused by Send-Safe-based spambot malware.\nTo view Send-Safe SMTP traffic and HTTPS traffic, use the following Wireshark filter:\n\n(tcp.port eq 50025 and tls.handshake.type eq 1) or smtp.data.fragment\n\nYour results should look similar to Figure 36.\n\n\n-----\n\nFigure 36. HTTPS and spambot traffic caused by Send-Safe-based malware.\nHTTPS traffic over TCP port 50025 caused by Send-Safe has certificate issuer data that\nuses Send-Safe as the organizationName and commonName, as shown below in Figure 37.\n\n\n-----\n\nFigure 37. Send-Safe-specific certificate issuer data in HTTPS traffic caused by Send-Safe\nmalware.\nSince the SMTP traffic in this pcap is unencrypted, you can extract the emails using\nWireshark. The menu path is File --> Export Objects --> IMF as shown below in Figure 38.\n\n\n-----\n\nFigure 38. Exporting emails caused by the Send-Safe spambot malware.\nThis pcap contains 167 emails you can export. On average, several messages were pushed\nout each second from this Send-Safe-infected Windows host.\n\nBelow, Figure 39 shows what one of the exported items of Hancitor spam looks like in a\nThunderbird email client. The template for this specific wave of Hancitor spam spoofed a\nwell-known bank.\n\n\n-----\n\nFigure 39. An example of a Hancitor email exported from the pcap.\n\n## Example 3: Hancitor with Ficker Stealer, Cobalt Strike and a Network Ping Tool\n\nOpen Example-3-2021-01-25-Hancitor-infection.pcap in Wireshark and use a basic web\nfilter, as shown in Figure 40.\n\n\n-----\n\nFigure 40. Traffic from the fourth pcap filtered in Wireshark using our basic web filter.\nThe pcap comes from an AD environment with the following characteristics:\n\nLAN segment range: 10.1.25.0/24\nDomain: permafrostie.com\nDomain controller: 10.1.25.2 - Permafrostie-DC\nLAN segment gateway: 10.1.25.1\nLAN segment broadcast address: 10.1.25.255\nIP address of the infected Windows host: 10.1.25.101\nHost name of the infected Windows host: DESKTOP-GAL3OV5\nUser account name on the infected Windows host: barry.paulsen\n\nThe page that delivered the initial Word document was www.nuicala.inspia[.]net/mars.php.\nAs we did in our two previous examples, we can export the web page, open it in a browser\nand get the malicious Word document used to kick off this Hancitor infection.\n\nThe SHA256 hash and name for the extracted malicious Word document is:\n\n8922dbb1e7f157c62fe64d03278757d78d136eb94d00ac2df101789d602f1224\n0125_206410993.doc\n\nBased on techniques from our first two examples, you can find the following information from\nthis Hancitor infection:\n\nHancitor traffic:\n\nport 80 - api.ipify.org - GET /\n\n\n-----\n\n83.220.169[.]45 port 80 - wasintodese[.]ru - POST /8/forum.php\n\nFollowup malware for Cobalt Strike:\n\n8.209.78[.]68 port 80 - drivewaysnowservice[.]com - GET /2101.bin\n8.209.78[.]68 port 80 - drivewaysnowservice[.]com - GET /2101s.bin\n\nFollowup malware for Ficker Stealer\n\n8.209.78[.]68 port 80 - drivewaysnowservice[.]com - GET /6gfbd5ws.exe\n\nCobalt Strike traffic:\n\n23.106.80[.]14 port 1080 - 23.106.80[.]14:1080 - GET /JdHf\n23.106.80[.]14 port 1080 - 23.106.80[.]14:1080 - GET /match\n23.106.80[.]14 port 1080 - 23.106.80[.]14:1080 - POST /submit.php?id=2612103345\n23.106.80[.]14 port 4443 - HTTPS traffic\n\nFicker Stealer traffic:\n\nport 80 - api.ipify.org - GET /?format=xml\n185.100.65[.]29 port 80 - sweyblidian[.]com - TCP traffic\n\nOf note, Ficker Stealer is the same binary for all examples in this tutorial, so we should see\nthe same post-infection traffic by this malware. For Cobalt Strike, any HTTP POST request\ncontaining /submit.php?id= has an identification number that’s unique for each infected\nWindows host.\n\nIf you see these HTTP POST requests with /submit.php?id= from Cobalt Strike, be alert for\nindicators of additional malware.\n\nMalware sent through Cobalt Strike appears as an encoded binary that is decoded on the\nvictim host. Because of this, we will not find the actual malware binary in the pcap. Instead,\nfollowup malware sent through Cobalt Strike is identified by its post-infection traffic.\n\n[In this case, we see ICMP scanning that indicates a network ping tool was sent through](https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/)\nCobalt Strike. Use the Wireshark filter icmp in the pcap, and your column display should look\nsimilar to Figure 41 below.\n\n\n-----\n\nFigure 41. ICMP traffic from a network ping tool sent through Cobalt Strike.\n[As described in our recent blog about Hancitor, samples of the network ping tool recovered](https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/)\nfrom infected Windows hosts generate approximately 1.5 GB of ICMP traffic, as they ping\nmore than 17 million IP addresses targeting internal, non-routable IPv4 address space.\n\nBased on our tests, these network ping tools hit the following address space:\n\n192.168.0.0 through 192.168.254.254\n172.16.0.0 through 172.31.254.254\n10.0.0.0 through 10.254.254.254\n\nThis much ping traffic is prohibitively slow to display in Wireshark. The pcap for our third\nexample of Hancitor has ping traffic to 192.168.0.0/16 and some of the ping traffic hitting the\n172.16.0.0/12 address space before the recording was stopped.\n\n## Example 4: Hancitor with Ficker Stealer, Cobalt Strike and NetSupport Manager RAT\n\nOpen Example-4-2021-02-02-Hancitor-infection.pcap in Wireshark and use a basic web\nfilter, as shown in Figure 42.\n\n\n-----\n\nFigure 42. Traffic from the fifth pcap filtered in Wireshark using our basic web filter.\nThe pcap comes from an AD environment with the following characteristics:\n\nLAN segment range: 10.2.2.0/24\nDomain: sillybobcat.com\nDomain controller: 10.2.2.2 - Cats-DC\nLAN segment gateway: 10.2.2.1\nLAN segment broadcast address: 10.2.2.255\nIP address of the infected Windows host: 10.2.2.101\nHost name of the infected Windows host: DESKTOP-NDGEE4D\nUser account name on the infected Windows host: baxter.murdoch\n\nThe page that delivered the initial Word document was premierpt.co[.]uk/footage.php. As we\ndid for our previous examples, we can export the web page, open it in a browser and get the\nmalicious Word document used to kick off this Hancitor infection.\n\nThe SHA256 hash and name for the extracted malicious Word document is:\n\nb60431e0fe5bf2b5c7cd5e01add62d24cd6ad2c99eb6a23fb5a2967d812cbf08\n0202_10846666250132.doc\n\nBased on techniques from our previous examples, you can find the following information\nfrom this Hancitor infection:\n\n\n-----\n\nHancitor traffic:\n\nport 80 - api.ipify.org - GET /\n45.9.191[.]107 port 80 - knorshand[.]ru - POST /8/forum.php\n\nFollowup malware for Cobalt Strike:\n\n8.209.78[.]68 port 80 - bobcatofredding[.]com - GET /0102.bin\n8.209.78[.]68 port 80 - bobcatofredding[.]com - GET /0102s.bin\n\nFollowup malware for Ficker Stealer\n\n8.209.78[.]68 port 80 - bobcatofredding[.]com - GET /6lavfdk.exe\n\nCobalt Strike traffic:\n\n192.254.79[.]71 port 8080 - 23.106.80[.]14:1080 - GET /EbHm\n192.254.79[.]71 port 8080 - 23.106.80[.]14:1080 - GET /ptj\n192.254.79[.]71 port 8080 - 23.106.80[.]14:1080 - POST /submit.php?id=242569267\n192.254.79[.]71 port 443 - HTTPS traffic\n\nFicker Stealer traffic:\n\nport 80 - api.ipify.org - GET /?format=xml\n185.100.65[.]29 port 80 - sweyblidian[.]com - TCP traffic\n\nAs we discussed in our previous example, if you see HTTP POST requests with\n/submit.php?id= from Cobalt Strike, be alert for indicators of additional malware. Also like our\nprevious example, we cannot find the malware binary in the pcap, so we must identify\nfollowup malware by its post-infection traffic.\n\nIn this case, we find indicators for NetSupport Manager RAT malware.\n\nThis RAT first does an IP address check to the domain geo.netsupportsoftware[.]com . Then\nit generates traffic with NetSupport Manager as part of the User-Agent string in its HTTP\nrequest headers.\n\nSearch for this traffic by using the following Wireshark display filter:\n\nhttp.user_agent contains \"NetSupport Manager\" or http.host contains netsupport\n\nThe results should look similar to Figure 43 below:\n\n\n-----\n\nFigure 43. Traffic generated by NetSupport Manager RAT.\nTraffic seen above in Figure 43 is:\n\n62.172.138[.]35 port 80 - geo.netsupportsoftware[.]com - GET /location/loca.asp\n46.17.106[.]230 port 3543 - 46.17.106[.]230 - POST hxxp://46.17.106[.]230/fakeurl.htm\n\nFollow the TCP stream for any of the HTTP POST requests to see what NetSupport\nManager C2 traffic looks like. The results should look similar to Figure 44 below.\n\n\n-----\n\nFigure 44. TCP stream of NetSupport Manager RAT C2 traffic.\nOf note, this tutorial only contains two examples of followup traffic from Cobalt Strike after a\nHancitor infection. Cobalt Strike can be used to send other types of malware, not just a\nnetwork ping tool or NetSupport Manager RAT.\n\nSo if you examine activity from a Hancitor infection with Cobalt Strike, we recommend you\nsearch for indicators from any other type of malware.\n\n## Conclusion\n\nThis tutorial reviewed how to identify Hancitor activity and its followup malware from pcaps of\ninfection traffic. We reviewed five pcaps from four recent examples and found consistent\npatterns from the network traffic. These patterns are fairly unique and can be used to identify\nHancitor activity and its associated malware within your network.\n\n\n-----\n\nThis knowledge can help security professionals better detect and catch Hancitor when\nreviewing suspicious network activity.\n\nFor more help with Wireshark, see our previous tutorials:\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-07 - Wireshark Tutorial- Examining Traffic from Hancitor Infections.pdf"
    ],
    "report_names": [
        "2021-04-07 - Wireshark Tutorial- Examining Traffic from Hancitor Infections.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1f6ae238-765f-4495-9d54-6a7883d7a319",
            "created_at": "2022-10-25T16:07:24.573456Z",
            "updated_at": "2025-03-27T02:02:10.284644Z",
            "deleted_at": null,
            "main_name": "TA511",
            "aliases": [
                "MAN1",
                "Moskalvzapoe"
            ],
            "source_name": "ETDA:TA511",
            "tools": [
                "Agentemis",
                "Chanitor",
                "Cobalt Strike",
                "CobaltStrike",
                "Ficker Stealer",
                "Hancitor",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "542cf9d0-9c68-428c-aff8-81b6f59dc985",
            "created_at": "2023-02-15T02:01:49.554105Z",
            "updated_at": "2025-03-27T02:00:03.110991Z",
            "deleted_at": null,
            "main_name": "Moskalvzapoe",
            "aliases": [
                "MAN1",
                "TA511"
            ],
            "source_name": "MISPGALAXY:Moskalvzapoe",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535816,
    "ts_updated_at": 1743041592,
    "ts_creation_date": 1653697345,
    "ts_modification_date": 1653697345,
    "files": {
        "pdf": "https://archive.orkl.eu/3ea0559ebe78426624320a28bf28edc18755ad0d.pdf",
        "text": "https://archive.orkl.eu/3ea0559ebe78426624320a28bf28edc18755ad0d.txt",
        "img": "https://archive.orkl.eu/3ea0559ebe78426624320a28bf28edc18755ad0d.jpg"
    }
}