{
    "id": "7834a8e0-123e-4a34-9bec-3fdd11eab3c8",
    "created_at": "2022-10-25T16:48:12.420998Z",
    "updated_at": "2025-03-27T02:15:51.263684Z",
    "deleted_at": null,
    "sha1_hash": "e5395ae3b48658a35c56df32d378ee4afab3ced6",
    "title": "Operation Bugdrop: Cyberx Discovers Large-Scale Cyber-Reconnaissance Operation Targeting Ukrainian Organizations",
    "authors": "CyberX",
    "file_creation_date": "2017-03-07T02:40:17Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 421690,
    "plain_text": "# Reconnaissance Operation Targeting Ukrainian Organizations\n\n**cyberx-labs.com/en/blog/operation-bugdrop-cyberx-discovers-large-scale-cyber-reconnaissance-operation/**\n\nBy Phil Neray 2/15/2017\n\nCyberX has discovered a new, large-scale cyber-reconnaissance\noperation targeting a broad range of targets in the Ukraine.\nBecause it eavesdrops on sensitive conversations by remotely\ncontrolling PC microphones – in order to surreptitiously “bug” its\ntargets – and uses Dropbox to store exfiltrated data, CyberX has\nnamed it “Operation BugDrop.”\n\n## Operation BugDrop: Targets\n\nCyberX has confirmed at least 70 victims successfully targeted by\nthe operation in a range of sectors including critical infrastructure,\nmedia, and scientific research. The operation seeks to capture a\nrange of sensitive information from its targets including audio\nrecordings of conversations, screen shots, documents and\npasswords. Unlike video recordings, which are often blocked by\nusers simply placing tape over the camera lens, it is virtually\nimpossible to block your computer’s microphone without physically\naccessing and disabling the PC hardware.\n\nMost of the targets are located in the Ukraine, but there are also targets in Russia and a smaller number of targets\nin Saudi Arabia and Austria. Many targets are located in the self-declared separatist states of Donetsk and Luhansk,\nwhich have been classified as terrorist organizations by the Ukrainian government.\n\n**Examples of Operation BugDrop targets identified by CyberX so far include:**\n\nA company that designs remote monitoring systems for oil & gas pipeline infrastructures.\n\nAn international organization that monitors human rights, counter-terrorism and cyberattacks on critical\ninfrastructure in the Ukraine.\n\nAn engineering company that designs electrical substations, gas distribution pipelines, and water supply\nplants.\n\nA scientific research institute.\n\nEditors of Ukrainian newspapers.\n\nOperation BugDrop is a well-organized operation that employs sophisticated malware and appears to be backed by\nan organization with substantial resources. In particular, the operation requires a massive back-end infrastructure to\nstore, decrypt and analyze several GB per day of unstructured data that is being captured from its targets. A large\nteam of human analysts is also required to manually sort through captured data and process it manually and/or with\nBig Data-like analytics.\n\nInitially, CyberX saw similarities between Operation BugDrop and a previous cyber-surveillance operation\n[discovered by ESET in May 2016 called Operation Groundbait. However, despite some similarities in the Tactics,](http://www.welivesecurity.com/2016/05/18/groundbait/)\n\n\n-----\n\nDropbox for data exfiltration, a clever approach because Dropbox traffic is typically not blocked or monitored\nby corporate firewalls.\n\n[Reflective DLL Injection, an advanced technique for injecting malware that was also used by BlackEnergy in](https://attack.mitre.org/wiki/Technique/T1055)\nthe Ukrainian grid attacks and by Duqu in the Stuxnet attacks on Iranian nuclear facilities. Reflective DLL\nInjection loads malicious code without calling the normal Windows API calls, thereby bypassing security\nverification of the code before its gets loaded into memory.\n\nEncrypted DLLs, thereby avoiding detection by common anti-virus and sandboxing systems because they’re\nunable to analyze encrypted files.\n\nLegitimate free web hosting sites for its command-and-control infrastructure. C&C servers are a potential\npitfall for attackers as investigators can often identify attackers using registration details for the C&C server\n[obtained via freely-available tools such as whois and PassiveTotal. Free web hosting sites, on the other](https://www.whois.net/)\nhand, require little or no registration information. Operation BugDrop uses a free web hosting site to store the\ncore malware module that gets downloaded to infected victims. In comparison, the Groundbait attackers\nregistered and paid for their own malicious domains and IP addressees.\n\nOperation BugDrop infects its victims using targeted email phishing attacks and malicious macros embedded in\nMicrosoft Office attachments. It also uses clever social engineering to trick users into enabling macros if they aren’t\nalready enabled.\n\n## How CyberX Investigated Operation BugDrop\n\nCyberX’s Threat Intelligence Research team initially discovered Operation BugDrop malware in the wild. The team\nthen reverse-engineered the code to analyze its various components (decoy documents used in phishing attacks,\ndroppers, main module, microphone module, etc.) and how the malware communicates with its C&C servers. The\nteam also needed to reverse-engineer exactly how the malware generates its encryption keys.\n\n## Distribution of Targets by Geography\n\n\n-----\n\n## Compilation Dates\n\nThe modules were compiled about a month after ESET announced the existence of Operation Groundbait. If the\ntwo operations are indeed related, this might indicate the group decided it needed to change its TTPs to avoid\ndetection.\n\n\n-----\n\n_High-level view of malware architecture_\n\n**1. Infection Method**\n\nUsers are targeted via specially crafted phishing emails and prompted to open a Microsoft Word decoy\ndocument containing malicious macros.\n\nIf macros are disabled, users are presented with a dialog box (below) prompting them to enable macros. The\ndialog box is well designed and appears to be an authentic Microsoft Office message.\n\n\n-----\n\nRussian text in dialog box: “внимание! Файл создан в более новой версии программы Микрософт\nOffice. Необходимо включить Макросы для корректного отображения содержимого документа”\n\nThis is translated as: “Attention! The file was created in a newer version of Microsoft Office programs.\nYou must enable macros to correctly display the contents of a document.”\n\nBased on the document metadata, the language in which the list is written is Ukrainian, but the original\nlanguage of the document is Russian.\n\nThe creator of the decoy document creator is named “Siada.”\n\nLast modified date is 2016-12-22 10:37:00\n\n\n-----\n\naddress:\n\n_Decoy document with personal information about military personnel_\n\n**2. Main Downloader**\n\nThe main downloader is extracted from the decoy document via a malicious VB script that runs it from the\ntemp folder.\n\nThe downloader has low detection rates (detected by only 4 out of 54 AV products).\n\n**3. Dropper — Stage 0**\n\nThe icon for the downloader EXE was copied from a Russian social media site\n(http://sevastopol.su/world.php?id=90195).\n\nThe icon itself is a meme that jokes about Ukrainians (http://s017.radikal.ru/i424/1609/83/0c3a23de7967.jpg).\n\n_Dropper icon_\n\n\n-----\n\n_Russian social media site from where icon for dropper EXE was obtained_\n\nThe dropper has 2 DLLs stored in its resources; they are XOR’ed in such way that the current byte is XOR’ed\nwith the previous byte.\n\nThis technique is much better than just plain XOR because it results in a byte distribution that doesn’t look\nlike a normal Portable Executable (PE) file loader. This helps obfuscate the file so that it will not be detected\nby anti-virus systems.\n\nThe DLLs are extracted into the app data folder:\n\n%USERPROFILE%\\AppData\\Roaming\\Microsoft\\VSA\\.nlp – Stage 1\n\n%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Protect\\.nlp.hist – Stage 2\n\nThe first stage is executed and the DLL is loaded using [Reflective DLL Injection.](https://attack.mitre.org/wiki/Technique/T1055)\n\n**4. Dropper – Stage 1 – Achieving Persistency**\n\nInternal name: loadCryptRunner.dll\n\nCompiled: Mon Dec 12 10:09:15 2016\n\n\n-----\n\nregistry under the key:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\drvpath\n\nRUNDLL32 “%USERPROFILE%\\AppData\\Roaming\\Microsoft\\VSA\\klnihw22.nlp”, RUNNER\n\nThe communication DLL is also loaded using Reflective DLL Injection.\n\n**5. Dropper – Stage 2 – Downloader for Main Module**\n\nInternal name: esmina.dll\n\nCompiled: Mon Oct 10 14:47:28 2016\n\nThe main purpose of this DLL is to download the main module\n\nThe main module is hosted on a free web hosting site with the following URL:\n\nwindows-problem-reporting.site88.net [Note: Do not visit this malicious site.]\n\nWe were unable to find any information about this URL in public data sources.\n\nAttempting to directly access the URL leads to an “HTTP/1.1 404 Not Found” message.\n\nIt appear as if downloading the module requires manual approval, indicating the need for a human analyst or\nhandler in the loop.\n\nThe main module is then downloaded and loaded into memory using Reflective DLL Injection.\n\n**6. Main Module**\n\nThe main module downloads the various data-stealing plugins assigned to each victim, and executes them.\n\nIt also collects locally-stored stolen data and uploads it to Dropbox.\n\nThe main module incorporates a number of anti-Reverse Engineering (RE) techniques:\n\nChecks if a debugger is present.\n\nChecks if process is running in a virtualized environment.\n\n[Checks if ProcessExplorer is running. ProcessExplorer is used to identify malware hiding inside a](https://www.microsoft.com/security/sir/strategy/default.aspx#!malwarecleaning_explorer)\nlegitimate process as\n\na DLL, which occurs as a result of DLL injection.\n\nChecks to see if [WireShark is running. WireShark can be used to identify malicious traffic originating](https://www.quora.com/How-can-I-use-Wireshark-to-detect-malicious-connections-on-my-computer)\non your computer.\n\nIt registers itself in the registry under the key:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\hlpAsist\n\nRUNDLL32 “%USERPROFILE%\\AppData\\Roaming\\Microsoft\\MSDN\\iodonk18.dll”, IDLE\n\n**7. Dropbox Mechanisms**\n\n\n-----\n\nobx – Contains modules used by the main module\n\nibx – Contains exfiltrated output uploaded by the plugins\n\nrbx- Contains basic information about the connected client\n\nAfter the stored data is retrieved by the attackers, it is deleted from the Dropbox account.\n\nThe Dropbox user that registered the account has the following details:\n\nName: P*****\n\nEmail: P********@mail.ru\n\n**8. Encryption Mechanisms**\n\nThe data-stealing plugins store all their output in: %USERPROFILE%\\AppData\\Roaming\\Media\n\n[Before being sent to Dropbox by the main module, the files are encrypted with Blowfish.](https://en.wikipedia.org/wiki/Blowfish_(cipher))\n\nThe Blowfish encryption key is the client ID.\n\n**9. Data-Stealing Plugins**\n\nFile Collector: Searches for variety of file types that are stored locally or on shared drives (including doc,\ndocx, xls, xlsx, ppt, pptx, pdf, zip, rar, db, txt) . Files are uploaded on-demand.\n\nUSB File Collector: Searches for variety of file types on USB drives (including doc, docx, xls, xlsx, ppt, pptx,\npdf, zip, rar, db, txt).\n\nBrowser Data Collector: Used to steal passwords and other sensitive information stored in browsers.\n\nMicrophone: Captures audio conversations.\n\nComputer Info Collector: Collects data about the client such as Windows OS version, computer name, user\nname, IP address, MAC address, antivirus software, etc.\n\nNot all of the plugins are downloaded to every target. Each module has a unique extension which is the client ID.\nThis is how the main module knows which modules should be downloaded to a particular target.\n\n## Conclusions\n\n**1) Operation BugDrop was a cyber-reconnaissance mission; its goal was to gather intelligence about targets in**\nvarious domains including critical infrastructure, media, and scientific research. We have no evidence that any\ndamage or harm has occurred from this operation, however identifying, locating and performing reconnaissance on\ntargets is usually the first phase of operations with broader objectives.\n\n**2) Skilled hackers with substantial financial resources carried out Operation BugDrop. Given the amount of data**\nanalysis that needed to be done on daily basis, we believe BugDrop was heavily staffed. Given the sophistication of\nthe code and how well the operation was executed, we have concluded that those carrying it out have previous field\nexperience. While we are comfortable assigning nation-state level capabilities to this operation, we have no forensic\nevidence that links BugDrop to a specific nation-state or group. “Attribution” is notoriously difficult, with the added\ndifficulty that skilled hackers can easily fake clues or evidence to throw people off their tail.\n\n**3) Private and public sector organizations need to continuously monitor their IT and OT networks for anomalous**\nactivities indicating they’ve been compromised. Fortunately, new algorithmic technologies like behavioral analytics\n\n\n-----\n\nimpact of a breach, as well as an enterprise-wide incident response plan that can be carried out quickly and at scale.\n\n## Appendix Hashes (SHA-256)\n\nDecoy Document:\n997841515222dbfa65d1aea79e9e6a89a0142819eaeec3467c31fa169e57076a\n\nDropper:\nf778ca5942d3b762367be1fd85cf7add557d26794fad187c4511b3318aff5cfd\n\n**Plugins**\n\nScreenshot Collector:\n7d97008b00756905195e9fc008bee7c1b398a940e00b0bd4c56920c875f28bfe\ndc21527bd925a7dc95b84167c162747069feb2f4e2c1645661a27e63dff8c326\n7e4b2edf01e577599d3a2022866512d7dd9d2da7846b8d3eb8cea7507fb6c92a\n\nKeylogger:\nfc391f843b265e60de2f44f108b34e64c358f8362507a8c6e2e4c8c689fcdf67\n943daa88fe4b5930cc627f14bf422def6bab6d738a4cafd3196f71f1b7c72539\nbbe8394eb3b752741df0b30e1d1487eeda7e94e0223055771311939d27d52f78\n6c479da2e2cc296c18f21ddecc787562f600088bd37cc2154c467b0af2621937\n01aab8341e1ef1a8305cf458db714a0392016432c192332e1cd9f7479507027f\n\nFile Collector\n06dcf3dc4eab45c7bd5794aafe4d3f72bb75bcfb36bdbf2ba010a5d108b096dc\ndaf7d349b1b12d9cf2014384a70d5826ca3be6d05df13f7cb1af5b5f5db68d54\n24f56ba4d779b913fefed80127e9243303307728ebec85bdb5a61adc50df9eb6\na65e79bdf971631d2097b18e43af9c25f007ae9c5baaa9bda1c470af20e1347c\n\nUSB File Collector:\na47e6fab82ac654332f4e56efcc514cb2b45c5a126b9ffcd2c84a842fb0283a2\n07c25eebdbd16f176d0907e656224d6a4091eb000419823f989b387b407bfd29\n3c0f18157f30414bcfed7a138066bc25ef44a24c5f1e56abb0e2ab5617a91000\n\nBrowser Data Collector:\nfb836d9897f3e8b1a59ebc00f59486f4c7aec526a9e83b171fd3e8657aadd1a1\n966804ac9bc376bede3e1432e5800dd2188decd22c358e6f913fbaaaa5a6114d\n296c738805040b5b02eae3cc2b114c27b4fb73fa58bc877b12927492c038e27c\n61244d5f47bb442a32c99c9370b53ff9fc2ecb200494c144e8b55069bc2fa166\ncae95953c7c4c8219325074addc9432dee640023d18fa08341bf209a42352d7d\na0400125d98f63feecac6cb4c47ed2e0027bd89c111981ea702f767a6ce2ef75\n\nMicrophone:\n1f5e663882fa6c96eb6aa952b6fa45542c2151d6a9191c1d5d1deb9e814e5a50\n912d54589b28ee822c0442b664b2a9f05055ea445c0ec28f3352b227dc6aa2db\n691afe0547bd0ab6c955a8ec93febecc298e78342f78b3dd1c8242948c051de6\n\nComputer Info Collector:\n\n\n-----\n\nd96e5a74da7f9b204f3dfad6d33d2ab29f860f77f5348487f4ef5276f4262311\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/uyl8gatur9prvuv4z0ghjakdcvv5zkrf"
    ],
    "report_names": [
        "Cyberx_Operation-BugDrop(02-15-2017)"
    ],
    "threat_actors": [
        {
            "id": "59abc77c-5d6f-4042-b465-95d2f0857f57",
            "created_at": "2022-10-25T16:07:23.937297Z",
            "updated_at": "2025-03-27T02:02:10.037235Z",
            "deleted_at": null,
            "main_name": "Operation BugDrop",
            "aliases": [],
            "source_name": "ETDA:Operation BugDrop",
            "tools": [
                "Dropbox"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4989a6be-779c-49fa-9732-51f44b269ee2",
            "created_at": "2023-01-06T13:46:38.573168Z",
            "updated_at": "2025-03-27T02:00:02.864209Z",
            "deleted_at": null,
            "main_name": "Groundbait",
            "aliases": [],
            "source_name": "MISPGALAXY:Groundbait",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "0be8b203-93b1-4d58-bcc1-1a33e15b06c0",
            "created_at": "2023-01-06T13:46:38.808048Z",
            "updated_at": "2025-03-27T02:00:02.924465Z",
            "deleted_at": null,
            "main_name": "Operation BugDrop",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation BugDrop",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "73446bf0-6d25-4f73-ab37-78c41d19ade9",
            "created_at": "2022-10-25T16:07:23.961856Z",
            "updated_at": "2025-03-27T02:02:10.05042Z",
            "deleted_at": null,
            "main_name": "Operation Groundbait",
            "aliases": [],
            "source_name": "ETDA:Operation Groundbait",
            "tools": [
                "Prikormka"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041751,
    "ts_creation_date": 1488854417,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/e5395ae3b48658a35c56df32d378ee4afab3ced6.pdf",
        "text": "https://archive.orkl.eu/e5395ae3b48658a35c56df32d378ee4afab3ced6.txt",
        "img": "https://archive.orkl.eu/e5395ae3b48658a35c56df32d378ee4afab3ced6.jpg"
    }
}