{
    "id": "78500696-04e6-49b5-abff-81d6f112b083",
    "created_at": "2023-01-12T15:10:04.281961Z",
    "updated_at": "2025-03-27T02:15:35.582409Z",
    "deleted_at": null,
    "sha1_hash": "889a8fb1702e9a832c4a73c4d7d148987b5cb2c2",
    "title": "2022-08-29 - Check Point Research detects Crypto Miner malware disguised as Google translate desktop and other legitimate applications",
    "authors": "",
    "file_creation_date": "2022-09-01T10:30:55Z",
    "file_modification_date": "2022-09-01T10:30:55Z",
    "file_size": 1360467,
    "plain_text": "# Check Point Research detects Crypto Miner malware disguised as Google translate desktop and other legitimate applications\n\n**research.checkpoint.com/2022/check-point-research-detects-crypto-miner-malware-disguised-as-google-translate-**\ndesktop-and-other-legitimate-applications\n\nAugust 29, 2022\n\nAugust 29, 2022\n\n**_Research by: Moshe Marelus_**\n\n## Highlights:\n\n**_Check Point Research (CPR) detected a Turkish based crypto miner malware_**\n**_campaign, dubbed ‘Nitrokod’, which infected machines across 11 countries_**\n**_The malware is dropped from popular software available on dozens of free_**\n**_software websites_**\n**_The malware distributers separate malicious activity from the downloaded fake_**\n**_software to avoid detection_**\n**_Attack was initially found by Check Point XDR, which overcomes the attack’s_**\n**_evasion mechanism_**\n\n**Introduction**\n\n\n-----\n\nAt the end of July 2022, Check Point Research (CPR) detected a previously undisclosed\ncryptomining campaign, called Nitrokod, which potentially infected thousands of machines\nworldwide.\n\nAt the campaign’s core there are several useful utilities. Created by a Turkish speaking entity,\nthe campaign dropped malware from free software available on popular websites such as\nSoftpedia and uptodown. The software can also be easily found through Google when users\nsearch “Google Translate Desktop download”.\n\nWhile the applications boast a “100 CLEAN” banners on some site, the applications are in\nfact Trojanized, and contain a delayed mechanism to unleash a long multi-stage infection\nthat ends with a cryptomining malware.\n\nAfter the initial software installation, the attackers delayed the infection process for weeks\nand deleted traces from the original installation. This allowed the campaign to successfully\noperate under the radar for years.\n\n_Figure 1: Top results for “Google Translate Desktop download”_\n\n**Nitrokod**\n\nActive since 2019, Nitrokod is a Turkish speaking software developer that claims to offer free\nand safe software.\n\nMost of the programs Nitrokod offers are popular software that do not have an official\ndesktop version. For example, the most popular Nitrokod program is the Google Translate\ndesktop application. Google has not released an official desktop version, making the\nattackers’ version very appealing.\n\n\n-----\n\nFigure 2: Nitrokod[.]com\n\nMost of their developed programs are easily built from the official web pages using a\nChromium based framework. For example, the Google translate desktop application is\n[converted from the Google Translate web page (https://translate.google.com) using the CEF](https://translate.google.com/)\nproject. This gives the attackers the ability to spread functional programs without having to\ndevelop them.\n\nTo avoid detection, the Nitrokod authors separate malicious activity from the initially\ndownloaded Nitrokod program:\n\nThe malware is first executed almost a month after the Nitrokod program was installed.\nThe malware is delivered after 6 earlier stages of infected programs.\nThe infection chain continued after a long delay using a scheduled task mechanism,\ngiving the attackers time to clear the evidence.\n\n## Infection Chain\n\n\n-----\n\n_Figure 3: infection chain_\n\nInfection chains are similar in most Nitrokod campaigns, starting with the installation of an\ninfected program downloaded from the Web.\n\nOnce the user launches the new software, an actual Google Translate application is\ninstalled. In addition, an updated file is dropped which starts a series of four droppers until\nthe actual malware is dropped.\n\nAfter the malware is executed, the malware connects to its C&C server to get a configuration\nfor the XMRig crypto miner and starts the mining activity.\n\n### Stage 1 – Web Installer\n\nThe initial stage of the campaign begins with downloading one of the Nitrokod infected\nprograms. The “Google Translate Desktop” program is used in this demonstration, but the\nbehaviors are similar in all other infected programs.\n\n\n-----\n\n_Figure 4: hundreds of thousands according to popular software web sites_\n\nGoogleTranslateDesktop.exe is a Windows installer built with Inno setup, a free tool for\npackaging and building setup files. The installer starts by downloading an encrypted RAR file\nfrom hxxp://nitrokod[.]com/download/GoogleTranslateDesktop.rar. As a means of protection\nagainst random scans and downloads, the file is only downloaded from the attacker’s server\nif the user-agent is set to “InnoDownloadPlugin/1.5” (Inno setup deflate user agent). Then\nGoogleTranslateDesktop2.50.exe is extracted from the RAR file using “asx” as the password.\n\n### Stage 2 – Installer\n\nThe GoogleTranslateDesktop2.50.exe installer starts by installing the Google Translate\napplication on the following path: “C:\\Program Files (x86)\\Nitrokod\\Google Translate\nDesktop\\GoogleTranslateDesktop.exe”\n\n\n-----\n\nAfter installation, the installer checks if an update.exe file exists on the following path\n“C:\\ProgramData\\Nitrokod”. If the file does not exist or the file version is not 1.0.7.0, the 3rd\nstage dropper update.exe is dropped. To maintain persistence, a schedule task is set to start\nthe update at every system startup.\n\nFinally, the installer sends a Post Install message to the Nitrokod domain with some\ninformation on the infected machine. All the details are sent as arguments on a HTTP GET\nrequests, as shown below:\n\n_Figure 5: Post install message_\n\n### Stage 3 – Delayed Dropper\n\nThe stage 3 dropper (update.exe) is programed to run at least five days after the installation\ntime. It does so by maintaining two registry keys.\n\n“HKCU\\Software\\Update\\D” – stores the last run time date.\n“HKCU\\Software\\Update\\S” – acts as a counter.\n\nEach time the updater is executed (on every system startup) it checks if the last execution\ndata is equal to the current date. If not, the counter is incremented by one. Once the counter\nhits the value 4, the 4th stage dropper chainlink1.07.exe is extracted from another encrypted\nRAR file. In reality, this operation requires at least four restarts on four different days, which\n\n\n-----\n\nwould often translate into at least several weeks of normal user s usage. This mechanism is\nalso a great way to avoid Sandbox detection, which does not run over several days and\nmultiple restarts.\n\n### Stage 4 –Scheduled Tasks and Log clearing\n\nThe 4th stage dropper is in charge of creating four different schedule tasks.\n\nTask Name: Description: Runs every\n\nInstallService\\1 Drop an encrypted RAR file via Wget 15d\n\nInstallService\\2 Extract Dropper 5 from RAR file 2d\n\nInstallService\\3 Run Dropper 5 1d\n\nInstallService\\4 Clear system logs 3d\n\nAfter creating all the tasks listed above, stage 4 clears all system logs using the PowerShell\ncommand Clear-EventLog. Then stage 3 and 4 are self-deleted.\n\nAt this point, all related files and evidence are deleted and the next stage of the infection\nchain will continue after 15 days by the windows utility schtasks.exe. This way, the first\nstages of the campaign are separated from the ones that follow, making it very hard to trace\nthe source of the infection chain and block the initial infected applications.\n\nAfter 15 days, an encrypted RAR file is downloaded from intelserviceupdate[.]com via the\nfirst schedule task. The next day, the file is decompressed via the second schedule task and\nthe stage 5 file is extracted. One day later, the stage 5 file is executed by the third task.\n\n### Stage 5 – VM tests with Firewall and Defender Exclusions\n\nThe stage 5 dropper starts by checking if certain programs are installed on the infected\nmachine. First, it checks against a list of known virtual machine processes and then against\na list of mainly security products. If one of the programs are found, the program exits.\n\n\n-----\n\n_Figure 6: ISINSTALL function_\n\nThen a firewall rule is added to allow incoming network connections for a program that will be\ndropped in the following stage, named nniawsoykfo.exe.\n\n_Figure 7: Firewall added rule_\n\nNext, the Windows Defender activity is excluded on the following path:\n\nTemp folder\nC:\\system32\\nniawsoykfo.exe – the file is dropped in the next stage.\nC:\\system32\\powermanager.exe – the file is dropped in the next stage.\n\nFinally, the program drops the last dropper (stage 6) nniawsoykfo1.8.exe from an encryption\nRAR file and executes it.\n\n### Stage 6 – Miner dropper\n\nThe stage 6 dropper is in charge of dropping the following three files:\n\nPowermanager.exe – The malware controlling the miner.\nnniawsoykfo.exe – XMRig crypto miner.\nWinRing0.sys – that is part of the XMRig.\n\nTo maintain persistence, a schedule task is set to start the malware (powermanager.exe)\nevery day.\n\n### Stage 7 – Cryptomining Malware – powermanager.exe:\n\nOn the next day, the malware is executed by the above schedule task. The malware\nenumerates all the security products installed on the infected machine. Next, it determines if\nthe infected machine platform is a desktop or a laptop. For desktop detection, the malware\nmakes the following three checks:\n\nNo battery status.\nThe RAM type is not SODIMM (enum 12), that is used in laptops.\nThe system type is 1 (Desktop).\n\n\n-----\n\n_Figure 8: identify platform_\n\nAfter that, the bot connects to its C&C server nvidiacenter[.]com and sends the following data\nin a JSON format over a HTTP POST requests:\n\nKey Value\n\nidle_minute Last user event in minutes.\n\npc_time Time on the infected machine.\n\nAntivirus List of all security products on the infected machine.\n\nup_minute Minutes passed since last startup.\n\nversion The version of the “Powermanager.exe” malware.\n\n\n-----\n\nxmrig_version The version of the XMRig\n\nGuid The infected machine GUID.\n\ncore Number of processor cores.\n\nmachine_id A generated identifier of the infected machine.\n\nreference The value of “SOFTWARE\\Microsoft\\Update\\reference” the registry key\n\nThe data is then encoded by the following steps:\n\n1. Convert the JSON to a string.\n2. Reverse the string.\n3. Encode the string with base64.\n4. Reverse the encoded string\n5. Encode the string again with base64.\n\nThe C&C response is decoded the same way it was encoded, but in reverse. The response\ncontains instructions for controlling the malware and the XMRig miner as shown below:\n\nabort Should the malware continue to run or abort.\n\nrules A set of conditions when to run the miner, on what platform and how\nmuch CPU to use.\n\nserver_time The server time.\n\ncommand_line The command line argument passed to the XMRig crypto miner.\n\nrefresh_minute The next time to connect to the C&C in minutes.\n\nexcluding_process A list of program names. If one of them is running, the malware\nshould exit.\n\n## Check Point’s XDR (Extended Detection and Response)\n\nCPR detected this new crypto miner malware campaign using Check Point’s [Infinity XDR](https://www.checkpoint.com/solutions/mdr-services/)\n(Extended Detection and Response) platform, a prevention-focused XDR Solution. This tool\nallows SOC teams to quickly detect, investigate, and respond to attacks across their entire IT\ninfrastructure. It identifies threats inside the organization and prevents their expansion by\nleveraging data correlated from all products, including Endpoint, Network, Web security, and\nso on.\n\nXDR has multiple behavioral detections that can find the stealthiest threats. In this case, the\nmalware was using multiple evasion techniques like masquerading as known applications,\nusing scheduled tasks instead of direct actions and spacing its activities over a long period\n\n\n-----\n\nof time.\n\nXDR was able to detect and respond to every individual malware action, follow up over time\nand correlate between all the singular detections from endpoints and network to one single\nattack, raise the confidence to a point that allows automatic response from all relevant\ndevices, and prevent it from happening to other machines in the network.\n\nXDR prevention capabilities extend to all Check Point devices and products, allowing it to\ntake actions like removing malicious files from the endpoints, and add indicators of\ncompromise of all files, URLs, domain addresses and IPs to be blocked by endpoints,\ngateways and mobiles.\n\nXDR’s unique Prevention-first approach significantly improves customers’ overall security\nposture while detecting unknown zero-day threats. It detects and stops attacks by combining\nadvanced threat prevention powered by AI-based analytics, big-data threat intelligence,\nmulti-layered incident analysis, machine learning, and enterprise-wide visibility into\ncustomer’s network, cloud, email, endpoint, all from a single pane of glass.\n\n***Check Point’s XDR is at early availability stage and will become generally available in**\n**coming months**\n\n_Timeline of attack and Check Point’s XDR detection_\n\n\n-----\n\n_Screenshot from Check Point’s Infinity XDR_\n\n### Check Point protections:\n\n**[Check Point Harmony Endpoint:](https://www.checkpoint.com/harmony/advanced-endpoint-protection/)**\n\n_Win.Nitrokod.A._\n_Win.Nitrokod.B._\n_Win.Nitrokod.C._\n\n### Remediation:\n\nTo clean an infected machine, follow these steps.\n\n1. Remove the following files on system32:\n\nAny file starting with chainlink.\nnniawsoykfo.exe\npowermanager.exe\n2. Remove the updater.\n\nRemove the folder C:\\ProgramData\\Nitrokod.\n\n\n-----\n\n3. Remove malicious schedule tasks.\n\nInstallService\\1\nInstallService\\2\nInstallService\\3\nInstallService\\4\n\n### IOC\n\n**Domain:**\n\nNitrokod[.]com\n\nIntelserviceupdate[.]com\n\nnvidiacenter[.]com\n\n**MD5**\n\nabe0fb9cd0a6c72b280d15f62e09c776\n\na3d1702ada15ef384d1c8b2994b0cf2e\n\n668f228c2b2ff54b4f960f7d23cb4737\n\n017781535bdbe116740b6e569657eedf\n\n0cabd67c69355be4b17b0b8a57a9a53c\n\n27d32f245aaae58c1caa52b349bed6fb\n\n**Summary:**\n\nIn this article, Check Point Research analyzed a new Turkish crypto miner campaign, called\nNitrokod, which has attacked thousands of victims globally. The malware is easily dropped\nfrom software found on top Google search results for legitimate applications.\n\nThe malware is dropped from applications that are popular, but don’t have an actual desktop\nversion such as Google Translate, keeping the malware versions in demand and exclusive.\n\nThe malware drops almost a month after the infection, and following other stages to drop\nfiles, making it very hard to analyze back to the initial stage.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-29 - Check Point Research detects Crypto Miner malware disguised as Google translate desktop and other legitimate applications.pdf"
    ],
    "report_names": [
        "2022-08-29 - Check Point Research detects Crypto Miner malware disguised as Google translate desktop and other legitimate applications.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536204,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1662028255,
    "ts_modification_date": 1662028255,
    "files": {
        "pdf": "https://archive.orkl.eu/889a8fb1702e9a832c4a73c4d7d148987b5cb2c2.pdf",
        "text": "https://archive.orkl.eu/889a8fb1702e9a832c4a73c4d7d148987b5cb2c2.txt",
        "img": "https://archive.orkl.eu/889a8fb1702e9a832c4a73c4d7d148987b5cb2c2.jpg"
    }
}