{
    "id": "78661a59-9507-4de1-8a75-8ee4e1609f47",
    "created_at": "2023-01-12T15:02:57.868177Z",
    "updated_at": "2025-03-27T02:16:26.531293Z",
    "deleted_at": null,
    "sha1_hash": "3da6137fccd1a2d0c58cb609187ee80726523109",
    "title": "2022-09-16 - Deception in Depth - Building Deceptions from Breaches",
    "authors": "",
    "file_creation_date": "2022-10-02T12:13:18Z",
    "file_modification_date": "2022-10-02T12:13:18Z",
    "file_size": 1648681,
    "plain_text": "# Deception in Depth - Building Deceptions from Breaches\n\n**blog.spookysec.net/DnD-building-from-breaches/**\n\n16 Sep 2022\n\nSo, here we are… Another day, another company hacked. Marketing and Sales teams are\nswarming like flies trying to pick up new clients claiming that the Uber hack could have\nprevented if they had just bought their SaaS platform or Dark Web monitoring service. sigh\nWell, this may be true, some of it may just be sales teams trying to make a quick buck, here’s\nsomething you can do to detect adversarial presence faster. Adversary Deception\n\nYou know your environment far better than any adversary does (hopefully), so leverage this.\n\nWe know that when most adversaries breach a network, they don’t just want to stop there.\nThey want to collect data, learn more about their victim, move deeper into the network and\nultimately gain Domain Admin/Enterprise Admin access so they can move freely throughout\ntheir environment. This is where the theory of deception starts coming into play, we know\ntheir goals, we know what they’re after, so let’s paint a picture of a tunnel at the end of a\ndead end road.\n\n\n-----\n\n## Disrupting Their Processes\n\nAs stated before, we know roughly what their goals are, so what do their processes look\nlike? Thats a great question. There’s this age old saying “Don’t ever let a breach go to\nwaste”. This is particuarly important with breaches like Uber where adversaries are way too\n**cocky and they disclose their TTPs. Fortunately this helps us develop better deceptions so**\nwe can detect adversary presence faster.\n\nSo, let’s take a look at the information they provided from the Uber breach.\n\n\n-----\n\n_[Image Credit: @hacker_](https://twitter.com/hacker_)_\n\nThis screenshot was proivded by Corben Leo @(hacker_). In here, we can see three key\npieces of information:\n\n1. Initial Access Vector\n2. Reconissance Information\n3. Privilege Escalation\n\nI’m going to make some inferences here; some of this is going to be backed by screenshots\ntaken by the threat actor, some of it is influenced by my personal knowlege of Red Team &\nPentest operations, some of it may be accurate or inaccurate; Ultimately, I wasn’t there, but it\nwill still be applicable regardless of accuracy, so let’s get down to it.\n\n### Initial Access\n\n\n-----\n\nThis was claimed to be done via Social Engineering an employee (This could have been via\nphishing, vishing, smsishing, or any of the other ishings) to give up some piece of information\nleveraged by the attacker. This could have been a password or OTP/push authentication\nmethod. There is generally not much we can do in this front other than educate the end\n**users. This isn’t the main focus of this post, so we’ll move on.**\n\nAdditional information was disclosed; its accuracy is questionable, I don’t know the original\nsource, but here it is:\n\n_Image Credit: Please contact me if you know the original source!_\n\nThis could be the aspect of social engineering we’re looking for. Dangerous. Once again,\neducate the end users. Ensure they know how to contact the Security Operations\nCenter/Security Department to report these kinds of things. If you have a 24/7 SOC, great.\nMake them know this, if you don’t again, make them know this.\n\n### Reconnissance Information\n\nFrom the screenshots we’ve seen so far, we know that they simply accessed a “Network”\nshare (most likely SMB, possibly NFS?). But, how did they discover this Network share?\nWhat tools did they use? These are all really important questions. Making an educated\nguess, SMB shares can be enumerated using tools from PowerView like InvokeShareFinder/Invoke-FileFinder and other tool suites like PowerSploit with FindDomainShare. These are all tools you should be using to detect and enumerate on your\nnetwork as well. There’s also generic PowerShell scripting one can do with GetDomainComputer and Get-SmbShare, so don’t always assume a tool is in use.\n\nAnyways - This provides a great base for a Deceptive Object. We could add a decoy SMB\nshare with full read access onto any device of your choosing. I personally recommend this\nbe a dedicated device only for this purpose. If you do so, make this device a wolf among\nsheep. Ensure it’s in the same OU as other devices (i.e. file server lives in the Servers OU)\nand make sure your naming scheme is consistent.\n\n\n-----\n\nThe next (and arguably most important step) is to monitor for SMB connection attempts. You\ncould use a tool or service like Corelight or Bro, or utilize Windows Event logs (MicrosoftWindows-SMBServer/Connectivity and Microsoft-Windows-SMBServer/Security). How you\ndo it doesn’t exactly matter as you’ve verified logging is working in full expected capacity.\n\nThis next screenshot provides some context that may be helpful if you read into it enough:\n\n_[Image Credit: @praise_terryd](https://twitter.com/praise_terryd/status/1570583105123258369/photo/3)_\n\nThis screenshot shows some valuable information, if you look in the Task bar PowerShell is a\nrunning process. As I previously mentioned, PowerShell is a very popular tool to use for\nsearching for SMB Shares. We can also see some other tools like Advanced Port Scanner\n(lol noobs, use nmap ffs [sorry, I had to]) and ADExplorer from SysInternals, it is essentially\nthe “Active Directory Users and Computers” commandlet but portable. All of these tools can\nbe used to easily (and effectively) identify key assets within the domain. If your OU structure\nis anything like my preferred structure, there will be an OU for Devices, then a sub-ou for\nDomain Controllers, one for Servers, and one for Workstations with plenty of sub-sub-ous\ndividing workstations, servers, and paw workstations. Anyways - AD nerd out aside; Make\nsure the honey devices look and feel like they’re in the right place. Always leverage existing\ninfrastructure if you can.\n\nOh boy, that was a lot.\n\n### Privilege Escalation Information\n\nSo, this one is probably going to be the shortest section. It’s short, it’s sweet, they gave us\nthe most information.\n\n\n-----\n\nThe adversary found an open SMB share\nThey located credentials to their Privileged Access Management System within a\nPowerShell Script\nThey signed into the PAM system and they got Domain Admin access\nFinally, they pivoted throughout enterprise management and security infrastructure\n\nSlack, vSphere, G-Suite, AWS, HackerOne, SentinelOne, Thycotic, etc.\n\nNow that we’ve completed our analysis on how they got to Domain Admin, we can then start\ndeveloping Deceptions around this.\n\n### Developing Deceptions\n\nPutting everything together, you could do a number of things to develop deceptions for\ndetection purposes. Let’s start:\n\nOn a open portion of the network, you could deploy Domain Joined windows hosts\nwith Firewalls disabled and SMB shares where Everyone has Read/Write privileges.\n\nYou could take this a step further and customize this and develop a story. Is this\nan IT Infrastructure SMB Share? Is there IT Service manuals? Documentation?\nSpreadsheets? Network Maps? Scripts? The world is yours. Invent a story\nUse real usernames with fake credentials. Track login failures and correlate\nthem with file reads to determine if you have a problem vs a serious problem.\nMonitoring could then be deployed on the host; when a user connects with\ncredentials via SMB, send an alert to your Security Operations Center.\nYou could build out deceptive PAM solutions; use Single File (a Chrome/FireFox\naddon) to create a ““phishing”” pages for the attacker. Tie this into your scripts from the\nprevious idea. Build out a HoneyNet. Make them think they hit the jackpot and found\nreal valid credentials to your PAM system.\n\nOnce a user authenticates with your planted credentials, generate an alert. Send\nit off to the Security Operations Center\nPiggy back off of existing File Servers.\n\nThis takes the element of building a real looking host away. It’ll often just be a\nquick chat with your Identity Team (Domain Admins) and they’ll be happy to help\nout as long as it provides no new risk.\nCreate Deceptive Service Accounts\n\nKerberoasting is still relevant! Throw an easy-to-crack password out there. You\nnever know.\n\nUser accounts are free to make. It literally costs nothing and can improve\nyour deception footprint massively!\nDevelop intelligent alerting on Domain Enumeration; Plant real Domain Admin\naccounts that are designed to look like a very inticing target and monitor for probing of\nthose account(s).\n\n\n-----\n\nDevelop detection for SharpHound via planting real deceptive user sessions (see my\n[blog post on Spoofing privileged users via Remote Registry )](https://blog.spookysec.net/DnD-Deceiving-BH/)\nSprinkle HoneyDocuments in there.\n\nThinkst [Canary Tokens is an awesome free service that will notify you when a](https://canarytokens.org/generate)\nHoneyDoc is opened. They support a whole bunch of different types of tokens.\nYou never know who might be poking and probing.\n\nLastly, be creative. Theres a ton of things you can do for little to no cost to develop\ndetections.\n\n### Closing Remarks\n\nAnyways - I hope you all enjoyed this entry in the Deception in Depth series. I have\nabsolutely no idea when the next post will come out. I don’t have anything hidden up my\nsleeve, but that doesn’t mean I’ll stop being passionate about deception. If you’d like to chat\n[with me about Deception, feel free to reach out to me on Twitter or](https://twitter.com/NaisuBanana) [LinkedIn. I’d love to](https://www.linkedin.com/in/rbartwitz/)\ndiscuss new ideas, help develop and flesh out new methods, or even give some advice or\nshare some experiences if Deception is something you’re interested in bringing to your\norganization. As always - Thank you for all for the love and support <3\n\n~ Ronnie\n\n### Comments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-16 - Deception in Depth - Building Deceptions from Breaches.pdf"
    ],
    "report_names": [
        "2022-09-16 - Deception in Depth - Building Deceptions from Breaches.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535777,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1664712798,
    "ts_modification_date": 1664712798,
    "files": {
        "pdf": "https://archive.orkl.eu/3da6137fccd1a2d0c58cb609187ee80726523109.pdf",
        "text": "https://archive.orkl.eu/3da6137fccd1a2d0c58cb609187ee80726523109.txt",
        "img": "https://archive.orkl.eu/3da6137fccd1a2d0c58cb609187ee80726523109.jpg"
    }
}