{
    "id": "78cc6538-dfd5-43fe-aef3-d616b88a0ed6",
    "created_at": "2023-01-12T15:10:30.038633Z",
    "updated_at": "2025-03-27T02:05:19.917302Z",
    "deleted_at": null,
    "sha1_hash": "b3aeb74dcb46848bef28cc73d03d1e85fffbc6e6",
    "title": "2019-07-19 - Who is Mr Wang-",
    "authors": "",
    "file_creation_date": "2022-05-28T03:23:28Z",
    "file_modification_date": "2022-05-28T03:23:28Z",
    "file_size": 630213,
    "plain_text": "# Who is Mr Wang?\n\n**[intrusiontruth.wordpress.com/2019/07/19/who-is-mr-wang/](https://intrusiontruth.wordpress.com/2019/07/19/who-is-mr-wang/)**\n\nintrusiontruth July 19, 2019\n\nIn our last article we identified Jinan Quanxin Technology Co. Ltd. (济南全欣方沅科技有限公\n司) and the Jinan Anchuang Information Technology Co. Ltd. (济南安创信息科技有限公司) as\ncompanies associated with Guo Lin (郭林), a likely MSS Officer in Jinan.\n\n**Jinan Fanglang Information Technology Company**\n\nAs disclosed previously by this blog, the antorsoft[.]com domain name listed the main\naddress for Jinan Quanxin Fangyuan as 238, Jing Shi Dong Lu, Jinan, China.\n\nHistorical WHOIS data for Antorsoft\nBut Jinan Quanxin Fangyuan wasn’t the only IT company registered at this address. We\nknow that 238, Jing Shi Dong Lu, Jinan was also the registered address of the Jinan\nFanglang Information Technology Co. Ltd. (济南方朗信息科技有限公司). Let’s take a look at\nhow we can prove it…\n\n**iamjx aka phoenix**\n\nFirstly, can we identify any staff who might work for Jinan Fanglang and tie them to hacking\n[activity? The trail starts with a job that was advertised for Jinan Fanglang on pediy[.]com by](https://bbs.pediy.com/thread-197599.htm)\nan individual using the handles iamjx and phoenix.\n\n\n-----\n\niamjx advertising a job for Jinan Fanglang\nAlthough iamjx is a handle that is difficult to identify elsewhere in open source, our analysts\nwere able to find a second job advert using the same QQ number, 8401900931. This second\nadvert was on binvul[.]com. Unfortunately we can’t connect to binvul, but one of our analysts\npassed us a printout obtained from a location with better access.\n\n\n-----\n\nPrintout of job advert for Jinan Security company\nThe precise name of the company isn’t clear – it says 济南安全公司招聘 (Jinan Security\nCompany Recruitment) – and the poster doesn’t give their name. But their link to the hacking\nworld is obvious from another posting in 2012 using the same w4ngqw account on binvul,\nthis time commenting on the impressive nature of CVE-2012-1848.\n\nw4ngqw discussing CVE-2012-1848\n**Wang Qingwei (王庆卫)**\n\nAnalysing the handle w4ngqw, it seems clear that the family name is Wang. The given name\nuses the pinyin characters ‘qw’, restricting the number of candidate names in Chinese.\nSearching on these candidate names, analysts working with this blog have identified that the\nowner of w4ngqw is Jinan resident and Cyber security expert Wang Qingwei (王庆卫).\n\n[Company tax registration information obtained by this blog from the official website of](http://www.sd-n-tax.gov.cn/module/download/downfile.jsp?classid=0&filename=160804090553232.xls)\nShandong Province lists the company 济南方朗信息科技有限公司 (Jinan Fanglang\nInformation Technology Co. Ltd.) with a registration address of 238 Jing Shi Dong Lu, Jinan.\nWho was named as the company representative? 王庆卫…\n\n\n-----\n\nTax registration information for Jinan Fanglang\n**Let’s challenge the hypothesis**\n\nIt could be argued that Wang Qingwei – the representative of a company that merely shared\nan office with a second company whose domain name was registered by Guo Lin – had\nnothing to do with Mr Guo or the MSS. How strange then that a source with access to such\ninformation informed us that Guo Lin and Wang Qingwei flew together on a multi-stop trip in\n2016. But they weren’t just on the same plane, they sat next to each other on every leg of the\nflight…\n\nWe admit to not being data scientists here at Intrusion Truth, but if the population of China is\n1.4 billion, the chances of sitting next to the same Chinese person on at least three journeys\nmust be 1/(1,400,000,000)^3, which is to say 1 in 2,744,000,000,000,000,000,000,000,000.\n\nOr 2.7 octillion to 1.\n\nWhich is quite low.\n\n**In summary, Wang Qingwei, an IT security expert, advertised jobs at Jinan Fanglang**\n**using two online profiles and was also listed as the company’s official representative.**\n**He is directly linked to likely MSS Officer Guo Lin, travelling with him on multiple**\n**occasions.**\n\n#theyknowwherethisleads\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-07-19 - Who is Mr Wang-.pdf"
    ],
    "report_names": [
        "2019-07-19 - Who is Mr Wang-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536230,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653708208,
    "ts_modification_date": 1653708208,
    "files": {
        "pdf": "https://archive.orkl.eu/b3aeb74dcb46848bef28cc73d03d1e85fffbc6e6.pdf",
        "text": "https://archive.orkl.eu/b3aeb74dcb46848bef28cc73d03d1e85fffbc6e6.txt",
        "img": "https://archive.orkl.eu/b3aeb74dcb46848bef28cc73d03d1e85fffbc6e6.jpg"
    }
}