{
    "id": "78f0849c-9283-4c56-8469-bad19c5b2b93",
    "created_at": "2023-01-12T15:07:08.567898Z",
    "updated_at": "2025-03-27T02:05:59.207432Z",
    "deleted_at": null,
    "sha1_hash": "570ccad46cec88c3db38f2f7fc56669ac55db06b",
    "title": "2020-10-12 - KELA’s 100 Over 100- September 2020 in Network Access Sales",
    "authors": "",
    "file_creation_date": "2022-05-28T05:03:36Z",
    "file_modification_date": "2022-05-28T05:03:36Z",
    "file_size": 3788217,
    "plain_text": "# KELA’s 100 Over 100: September 2020 in Network Access Sales\n\n**[ke-la.com/kelas-100-over-100-september2020-in-network-access-sales/](https://ke-la.com/kelas-100-over-100-september2020-in-network-access-sales/)**\n\nOctober 12, 2020\n\nWhile ransomware attacks are on the rise, more and more initial network accesses are being\nsold in underground forums every day, partially becoming an initial entry point for\nransomware operators. Following KELA’s [research about initial access brokers, we’ve](https://ke-la.com/the-secret-life-of-an-initial-access-broker/)\ndecided to analyze some of the accesses sold over September 2020 to build a\ncomprehensive picture of the activities in this field.\n\nMajor takeaways are:\n\n**Initial network access is a general term that refers to remote access to a**\n**computer in a compromised organization. Threat actors selling it – initial access**\nbrokers – are linking opportunistic campaigns with targeted attackers, namely\nransomware operators.\n**KELA traced over 100 initial network accesses put on sale by threat actors for**\n**one month – three times more than in August 2020. The cumulative price requested**\nfor all accesses surpasses $500,000.\nOf these network access listings, KELA found that at least 23% were reported as\n**sold by the actors for cumulative revenue of nearly $90,000.**\nWhile establishing a list of the top 5 most expensive accesses and the TTPs of their\nsellers, KELA examined a hypothesis that the price depends on the victim’s revenue\nand the level of privileges gained through access. Domain admin access can be 25100% more expensive than user access.\n**Initial access brokers’ public activity on cybercrime communities provides rare**\n**visibility into the inner workings of threat actors; this visibility should be leveraged**\nby network defenders in order to understand the threat landscape and prioritize\ndefense mechanisms accordingly. Moreover, passing network access from one the\ninitial access broker to a ransomware affiliate effectively splits the exploitation process\ninto two distinct phases – a TTP that may be invaluable during threat hunting and\nadversary simulation.\n\n\n-----\n\n## What Is Initial Network Access?\n\nAs [we mentioned earlier, “network access” is a term that is used in a very loose manner by](https://ke-la.com/the-initial-access-brokers-toolbox-remote-monitoring-and-management/)\nthreat actors operating in cybercrime communities. It is used to describe multiple different\nvectors, permission levels, and entry points – from SQL injection to RDP access and from\nuser to admin privileges. The actors who are selling such network accesses can be called\ninitial access brokers – meaning that they provide an initial entry point to a compromised\nnetwork that will be further attacked by other cybercriminals. Considering the latest trends, in\nmost cases, it means a ransomware attack. Therefore, initial access brokers act as a link\n**between opportunistic attacks and targeted attacks.**\n\nUnfolding this supply chain further, we see that initial access brokers get their ready-to-sale\nentry point through three steps:\n\n**1. Finding an initial infection vector**\n\n\n-----\n\nMultiple possible ways exist to find an initial infection vector. Intuitively, this can be seen in\nchatter on cybercrime forums – outlying a few of the possible vectors that can be leveraged\ninto ransomware:\n\n_Listing made by a Russian-speaking actor on a cybercrime community – seeking leverage initial access_\n_into ransomware_\n\nStraight from the horse’s mouth, we can glean several initial access vectors – botnet\ninfection, remote access protocols like RDP and VNC, and remote access software\ncolloquially referred to as “VPNs” (in this case, Citrix).\n\nWith the abundance of possible vectors in mind, let’s examine a few of them a bit more in\ndepth.\n\n**Direct RDP** **Access (T1078.003 – Valid Accounts: Local Accounts). An actor can go**\nhunting for Microsoft machines with weak Remote Desktop Protocol credentials – or\njust visit one of multiple underground markets and buy these credentials from a vendor.\nThese credentials are collected through botnets or brute forcing and then sold on\ncybercrime markets and forums.\n**VPN-Based Access** _(T1133 – External Remote Services, T1190 – Exploit Public-_\n_Facing Application). An initial access broker can use vulnerabilities or compromised_\ncredentials to gain access to VPN solutions providing in-browser RDP access, such as\nPulse Secure, Fortinet, Citrix, and other products. Some of these solutions have known\n[vulnerabilities that are popular among malicious actors (for example, CVE-2019-19781](https://us-cert.cisa.gov/ncas/alerts/aa20-133a)\nin Citrix VPN appliances and CVE-2019-11510 in Pulse Secure VPN servers).\n**RMM** _(T1078.004 – Valid Accounts: Cloud Accounts). An actor can compromise an_\norganization or its managed service provider to obtain access to remote management\nand monitoring software, such as ManageEngine and TeamViewer solutions.\n[Alternatively, this makes managed service providers (MSPs) a lucrative ransomware](https://www.google.com/url?q=https://www.zdnet.com/article/at-least-13-managed-service-providers-were-used-to-push-ransomware-this-year/&sa=D&ust=1602490563885000&usg=AFQjCNE7cgH-UT6xzGfmNLhrzi4-oA87mQ)\ntarget.\n\n\n-----\n\n**Cloud storage solutions** _(T1078.004 – Valid Accounts: Cloud Accounts). Another type_\nof software that can be compromised using stolen credentials. Such solutions include\nAmazon Web services, Microsoft Azure, and more. While may not easily provide actual\nnetwork access, web-based compromises are popular among other threat actors – like\nthose seeking to spread malware via exploit kits or to sniff credit card data.\n**Vulnerabilities (ATT&CK techniques used: T1190 – Exploit Public-Facing Application).**\nAn initial access broker can use a public or custom script to discover software\ncontaining vulnerabilities. All that is left – to exploit this flaw to access an organization\nusing the vulnerable software. This type of initial access is usually limited to the ability\nto run code using a specific vulnerability, which allows actors to pivot further within the\ntargeted environment.\n\nIt should be noted that some access vectors can be accessed via multiple means. VPN\nsolutions, as mentioned above, for example, come in handy since they can allow easy\nremote access into a machine within the network. Most common research lately focused on\n[utilizing software vulnerabilities like CVE-2019-11510 impacting Pulse Secure in order to](https://www.zdnet.com/article/hacker-leaks-passwords-for-900-enterprise-vpn-servers/)\nobtain credentials. However, sometimes initial access brokers needn’t even fire up the good\nol’ Github-hosted exploits in order harvest these credentials – as thousands upon\n**thousands of sensitive credentials, targeting multiple SSL VPN solutions and other**\n**enterprise products perfect for initial access, are available for sale on botnet markets**\n**like** **[Genesis and others.](https://ke-la.com/exploring-the-genesis-supply-chain-for-fun-and-profit/)**\n\n\n-----\n\n_Credentials to sensitive enterprise systems offered for sale on Genesis, based on KELA collections – all_\n_may allow threat actors initial access to a system or network_\n\nResearching the compromised organizations, an initial access broker defines how valuable\nthey are mostly based on employee headcount, revenue as reflected in OSINT and most\nimportantly – the level of permissions available to the attacker. That’s where lateral\nmovement (albeit sometimes limited) comes into play.\n\n**2. Transforming the initial infection vector into a wider compromise.**\n\nBased on the initial vector as detailed above, threat actors may end up with different kinds of\ninitial access; the task at hand now is to broaden the scope of access, as well as privileges,\nto an extent that would be attractive to a potential buyer. This attractiveness is derived from\nthe buyer’s operational objective, as different actors may have different demands from a\npotential network access.\n\nWith most buyers assumed to be ransomware operators or affiliates, it’s important to keep in\nmind that the network access scope doesn’t have to be ideal: it just needs to be good\n_enough. A successful ransomware operation doesn’t necessarily have to lock thousands of_\nendpoints in perfect unison – sometimes, locking a few key servers and extracting data from\nseveral others may be enough to monetize the access.\n\n\n-----\n\nFor example, access to a compromised RDP server as the initial intrusion vector may grant\nthe broker access to a computer in Microsoft’s Active Directory (AD); as any red teamer\nknows, however, one computer inside a domain isn’t enough to cause serious harm… It’s the\nbroker’s job to escalate privileges to receive domain admin access moving laterally inside the\nnetwork. TTPs here vary based on the scenario, but most reporting points toward actors\n[utilizing standard tools for privilege escalation and lateral movement – some “were copied](https://info.varonis.com/en-us/webinar/maze-ransomware-attack-simulation-2020-09-09)\ndirectly from Github repositories”. Some cybercrime markets selling RDP access also allow\ntheir users to skip the lateral movement – selling credentials directly to Domain Admins.\n\n_RDP access to a Domain Admin offered for sale on a cybercrime market_\n\nAs noted in the “Initial Access Brokers’ Price Formation and Business Model” segment of this\npost, the more level of privilege a network access has – the more it costs, making this\nprocess a crucial point of the initial access brokers’ business model.\n\n**3. Deciding how access is supplied to a buyer**\n\nInitial access brokers have to establish a sustainable entry channel for other cybercriminals –\nfor example, by establishing a rogue RDP connection allowing accessing the compromised\nhost from the public internet; authentication to the internet-facing persistence\n**mechanism is then shared with the access buyer. While this part may be thought of as**\ntrivial, KELA would claim it actually holds value for defenders: using these outbound\nmechanisms is what allows initial access brokers pass the access to the actors who will\nactually cause harm.\n\n\n-----\n\nWith RDP and VPN being the most traditional access offered on underground forums,\nsome offers include credentials to other tools – illustrating how network access can mean\ndifferent things. One actor, for example, posted access to a hotel chain’s cloud storage\nplatform on an auction with a start price of $50,000 (or $100,000 for an immediate purchase).\nWhile it’s not known what kind of solution it is and with what capabilities it provides malicious\nactors, the high price shows that it’s considered as a serious threat; therefore, such offers\nalso put organizations at risk.\n\n_Access to a cloud storage solution put on an auction_\n\nIn some cases, network access does not enable an attacker to access an actual computer\nwithin the Windows Domain, though it’s still considered as a foothold by cybercriminals since\nit provides the same capabilities. Dialing back to the objective in question: why would direct\naccess to a Domain Admin be needed, if a compromised RMM platform already allows the\nattacker to deploy their payloads through the cloud?\n\nAs in usual business relations, some sellers are flexible and proceed from the needs of their\ncustomers: they can provide them the access suitable for their goals. That’s why some\nsellers tend to ask how a buyer will use access and accept only “experienced” customers.\n\n\n-----\n\n_A discussion between an initial access broker and a potential buyer_\n\n**The main point is that in the hands of network access buyers, it can turn into an entry**\n**point to the compromised network, enabling the attackers to execute commands and**\n**deliver malware. Ransomware affiliates use this compromise to deploy their**\n**ransomware and demand a ransom. Thus, initial access sometimes gained for free or for**\nas little as tens of dollars transforms into a ransom demand of millions of dollars. The price\nbreakdown for network accesses reflects how much money initial access brokers can receive\nfor such offers and gives an understanding of what is valued by buyers, a solid portion of\nwho can be ransomware affiliates.\n\n## Supply and Demand - September 2020\n\nOver September 2020, KELA observed more than 100 network accesses put on sale by\nthreat actors on underground forums. For comparison, it’s three times more than in August\n2020 when we’ve seen only around 33 such offerings. The majority of the analyzed accesses\nwere offered on two Russian-speaking platforms: Xss and Exploit. Despite the fact that KELA\ncould analyze only public sales of the data, it enables us to understand prices, top actors,\nand infection vectors.\n\n**Combined, 108 network accesses offered for sale in September cost at least $509,180.**\n**That’s just a minimal revenue that access brokers could gain in a month since, in part**\nof the offers, the sellers ask to suggest the price. In addition, some prices were indicated in\nBTC, so KELA calculated them in USD according to the exchange rate on the day of sale.\n\n**The average price for access over the analyzed period was around $4990, while the**\n**median price was $2000. This difference can be explained by the fact that certain offers are**\nrelatively expensive: while some prices started at $25, others reached $102,000.\n\n\n-----\n\nAs some sellers update their offers when they sell the access, we can estimate the number\nof sales. Out of 108 accesses, 25 accesses were deemed sold, which means that we can\n**confirm at least 25% of initial network accesses were noted as sold by the actor –**\n**amounting to a sum of $87,580.**\n\nMoreover, selling accesses on forums is just a tip of the iceberg: we can assume that\n**successful initial access brokers sometimes trade accesses directly with ransomware**\n**affiliates, which means they make deals via private conversations that cannot be**\n**tracked. Research has well established that some ransomware operators buy access to**\ncompromised networks directly from operators of the botnets: for example, Ruyk\nransomware is known to be delivered by the TrickBot infection, while Avaddon ransomware\nhas been recently seen delivered by Phorpiex botnet. These sales are carried out in private\nback channels, never reaching the same communities in which initial access brokers openly\noperate.\n\n## Initial Access Brokers’ Price Formation and Business Model\n\nWhen the access is ready to be handed over to other cybercriminals, initial access brokers\nhave to establish prices. They usually rely on two factors when setting up a price: company\nvalue and level of privileges.\n\nThe company value can be understood based on its revenue, country, sector and market\npositions. Usually, initial access brokers collect this information through open sources. In\naddition, they can check the number of users and computers on the domain to gain a better\nunderstanding of the company size.\n\nThe level of privileges refers to domain admin or user rights on a compromised network. This\nmetric can change the price significantly. For example, a threat actor has recently offered\n**a domain user access and asked $1,500. However, after a few days, he gained domain**\n**admin privileges and requested $3,000.**\n\n\n-----\n\nAnother threat actor managed to gain domain admin access to three of his victims and raised\nprices in diapason of 25-115%. Anecdotally, the privilege escalation occurred during two\nweeks following the disclosure of the Zerologon vulnerability (CVE-2020-1472) – which may\n\n\n-----\n\nallow, [in some scenarios, quick escalation from Domain User to Domain Admin. We have not](https://www.secura.com/blog/zero-logon)\nseen any direct reference to Zerologon exploitation while examining network access sales.\n\n\n-----\n\nSome actors do not even sell the accesses at a fixed price. Instead, they receive a share of\nthe ransoms paid by victims if the access buyers manage to compromise the network. In\nsuch cases, initial access brokers can be involved in a ransomware attack – at least for\nmarketing purposes, as it’s in their interests to make the victim pay the ransom.\n\n\n-----\n\n## Some Notable (and Pricy) Examples\n\nLet’s take a look at the most expensive accesses and suggest what made them valuable.\n\n**1. A shipbuilding company.**\n\n[The maritime industry is actively targeted by ransomware operators, with two big victims](https://www.zdnet.com/article/all-four-of-the-worlds-largest-shipping-companies-have-now-been-hit-by-cyber-attacks/)\nattacked in 2020. This access is another compromise that can be used for such attacks. It\ncosts 9 BTC (around $102,000), which can be explained by the size of the company and its\nplace on the market. To prove the value, the seller stated revenue ($12,5 Billion) and a\nnumber of employees, which are common metrics included in such offers.\n\n_The actor initially offered the access for 15 BTC but then lowered the price_\n\nRegarding the level of privileges, we don’t know what the type of access is (RDP, VPN, or\nother solution), but we see that it’s domain admin access granting high privileges, which\ncertainly influences the price.\n\nIn addition, the seller offers not only access to the shipbuilding company’s network but also\n50,000 credentials to corporate domain accounts and 20,000 corporate email accounts. The\naccess has been on sale during the last month but so far it seems that no potential buyers\nhave shown enough interest to pay the high price.\n\n**2. A Russian Bank**\n\nIn this case, an actor is selling not credentials but a remote code execution vulnerability. It’s\nnot direct access like in other offers, but a vulnerability that can be possibly exploited to\nfacilitate access. A victim, identified by KELA, is a Russian bank in the top 100 banks in the\ncountry by the number of assets. However, it’s hard to speculate why the price is $20,000\n\n\n-----\n\nsince the actor doesn t state any details. We assume that the expensive price is likely due to\nthe fact that the access can be used to access a company that directly manages funds,\ntherefore the buyer can manipulate the money.\n\nAnyhow, the sale was deleted from a Russian-speaking forum where it was posted. There\nare a few possible reasons: the seller could remove it because of the attention from media\nand researchers, or it was deleted by the administrator of the forum due to the policy of not\ntargeting organizations from CIS countries.\n\n**3. A Turkish Aviation-Related Firm**\n\nIt’s not such common access (compared to RDP- and VPN-based access), though providing\nall opportunities to deploy ransomware. Here, the affected software is an RMM tool designed\n[to help IT professionals manage networks. Identified by KELA in a recent blog post, the](https://ke-la.com/the-initial-access-brokers-toolbox-remote-monitoring-and-management/)\nsoftware is ManageEngine Desktop Central solution developed by Zoho Corporation.\n\n\n-----\n\nIdentified by KELA, the victim has a revenue of 760 Million Euro that can be a reason for a\nhigh price – 1.5 BTC (almost $16,000) – along with the capabilities provided by the access.\nThe RMM access enables the buyers to transfer, deploy, and run files, uninstall antivirus\nsolutions, change wallpapers – basically, all the steps needed to perform a ransomware\nattack. The access was sold in two weeks.\n\nFollowing KELA’s research, Zoho conducted further investigations and concluded that the\nidentified victims seem to have utilized weak credentials to their ManageEngine products,\nwhich seems to be the root cause for the compromise. Zoho deployed live-changes that\naddressed the problem by preventing any future logins with the weak credentials and issued\na security guidance advisory to their customers.\n\n**4.A Canadian Franchise Company**\n\nAnother one of pshmm’s victim is a Canadian corporation with a revenue of $338 Million,\nwhose RMM access has been sold in a few hours. It cost 1 BTC (around $10,600), most\nlikely based on the size of the company. The firm was also identified by KELA in the course\nof the investigation with Zoho Corporation.\n\n\n-----\n\n**5. A US Manufacturing Company**\n\n1 BTC was asked for a US manufacturing company with a revenue of $908 Million. The\nseller doesn’t provide any details that might help to indicate the type of access except for the\nword “Citrix,” which can mean that it’s some compromised Citrix solution enabling a user to\naccess the compromised network remotely. One of such solutions, popular among initial\naccess brokers, is Citrix Virtual Apps (former XenApp). Another product that could be\ncompromised using a known vulnerability is Citrix ADC (former Netscaler ADC). The access\nwas sold in a couple of days.\n\n**Looking at the most expensive accesses, we can assume that initial access brokers**\n**are evolving and offering various ways to access the compromised networks besides**\n**the popular RDP method. It means that more and more software falls under attacks that**\nultimately lead to massive compromises and ransom demands, while actors selling the\naccesses are becoming an essential part of the Ransomware-as-a-Service ecosystem.\n\n\n-----\n\n## Top Initial Access Brokers\n\nWhen monitoring activities of initial access brokers, it’s crucial to identify the most prominent\nplayers to better understand their TTPs and hence being able to proactively defend\norganizations. KELA shares the top 5 most active initial access brokers in September with\nour notes:\n\n**1. pshmm. The actor is responsible for selling already mentioned accesses to a Canadian**\nfranchise company and Turkish holding. In September 2020 alone, he offered 36 RMM\naccesses, while KELA observed 55 such accesses offered by him in total on a cumulative\nprice of $150,900.\n\n**1. drumrlu / 3lv4n. The actor offered 11 accesses for sale, from which can be seen that he**\nfrequently manages to gain domain admin access. He mentioned that he bought and uses\nthe Thanos ransomware, showcasing that initial access brokers earn in many ways. He\nstates to be a “Turkish Hacker”.\n\n**2. petervodz / johnakamai. The actor posted 10 accesses for sale, with all of them except**\none being Canadian institutions. The type of the accesses is unknown.\n\n**3. NetNet. Another actor that managed to offer 10 accesses for sale, mostly related to VPN**\nsolutions. He offers relatively cheap accesses ranging from $200 to $1000, meaning that the\ntargets seem to be small companies. Only one access to a Canadian corporation cost\n$6500.\n\n\n-----\n\n**4. Ferb. The actor offered six RCE vulnerabilities in financial and government institutions**\nfrom Europe, Latin America and Asia.\n\nInitial access brokers’ public activity on cybercrime communities provides rare visibility into\nthe inner workings of threat actors; this visibility should be leveraged by network defenders in\norder to understand the threat landscape and prioritize defense mechanisms accordingly.\nProactively monitoring activities of such actors in darknet communities, patching the\nsoftware, and educating employees is an approach that should be taken into service by all\norganizations that want to avoid the post-factum negotiations with the ransomware\noperators.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-12 - KELA’s 100 Over 100- September 2020 in Network Access Sales.pdf"
    ],
    "report_names": [
        "2020-10-12 - KELA’s 100 Over 100- September 2020 in Network Access Sales.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536028,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653714216,
    "ts_modification_date": 1653714216,
    "files": {
        "pdf": "https://archive.orkl.eu/570ccad46cec88c3db38f2f7fc56669ac55db06b.pdf",
        "text": "https://archive.orkl.eu/570ccad46cec88c3db38f2f7fc56669ac55db06b.txt",
        "img": "https://archive.orkl.eu/570ccad46cec88c3db38f2f7fc56669ac55db06b.jpg"
    }
}