{
    "id": "79188c57-8276-490b-9a32-48b1795ad083",
    "created_at": "2023-01-12T15:08:53.443691Z",
    "updated_at": "2025-03-27T02:06:04.503374Z",
    "deleted_at": null,
    "sha1_hash": "a9f351d32132ad88124b30e2119d647ff8d80319",
    "title": "2022-05-17 - Chaos Ransomware Variant Sides with Russia",
    "authors": "",
    "file_creation_date": "2022-05-25T20:33:24Z",
    "file_modification_date": "2022-05-25T20:33:24Z",
    "file_size": 1841492,
    "plain_text": "# Chaos Ransomware Variant Sides with Russia\n\n**[fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia](https://www.fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia)**\n\nMay 17, 2022\n\nSince the beginning of the ongoing Russia-Ukraine War, some ransomware and hacking\ngroups have publicly declared which side they are on. Such actions have created tension\ninternally within the threat actor groups as it has caused dissension, and externally, as\norganizations fear being targeted due to the political nature of the war.\n\nOne notable example is the Conti RaaS (Ransomware-as-a-Service) that officially announced\nin February 2022 that they are backing Russia and would use their arsenal against critical\ninfrastructures that belong to the West. Fear spread quickly as many organizations around\nthe globe had been victimized by the Conti group in the past, with stolen data exposed and\ncritical files being encrypted. However, the Conti group was bitten back soon after the\nannouncement was made. An allegedly unhappy Conti insider took the matter in their hands\nand leaked Conti’s internal chat logs to the public.\n\nOn the other side of the debate, the LockBit ransomware group made it clear that they will\nnot involve themselves in the political war because of the multinational nature of its\ndevelopers and affiliates.\n\nIn this vein, FortiGuard Labs recently came across a variant of the Chaos ransomware that\nappears to side with Russia. This blog explains the vicious consequences that the Chaos\nvariant delivers to a compromised machine.\n\n**Affected Platforms: Windows**\n\n**Impacted Parties: Windows users**\n\n**Impact: Potential loss of files**\n\n**Severity Level: Medium**\n\n## Technical Details\n\nA GUI-based Chaos ransomware builder is known to be available that can easily customize\nthe malware according to a set of options. FortiGuard Labs recently discovered a sample of\nmalware that seems to have been created using this builder. Unfortunately, how the malware\narrives on a victim’s machine is unknown. However, given the political stance of the malware\n(the blog will cover this later), the malware likely arrives either via forum posts or emails\nfocused on the current Russia-Ukraine war.\n\nOnce the malware runs, it enumerates the files on all drives. For files smaller than 2,117,152\nbytes, it generates a random 20-character long password for each file and then encrypts it\nwith AES-256 (CBC-SALTED). Each encrypted file contains an RSA encrypted password with\n\n\n-----\n\na hardcoded public key + base64 encoded AES encrypted file content. The malware also adds\na ‘fuckazov’ file extension to the affected files. Figure 1 shows the content of an encrypted file.\n“azov” may be a reference to the Azov Battalion who put up a fierce fight against Russian\nmilitary forces in the Azovstal steel plant in Mariupol, Ukraine.\n\nFigure 1. Content of an encrypted file\nFor files larger than 2,117,152 bytes, the malware fills them with random bytes, making file\nrecovery impossible without backup. The affected files also have 'fuckazov’ as a file extension.\n\nFor the C: drive, the malware searches for files in the following directories and either\nencrypts or fills them with random data depending on the file size and adds a ‘fuckazov’ file\nextension.\n\n\"\\\\Desktop\"; \"\\\\Links\"; \"\\\\Contacts\"; \"\\\\Desktop\"; \"\\\\Documents\"; \"\\\\Downloads\";\n\"\\\\Pictures\"; \"\\\\Music\"; \"\\\\OneDrive\"; \"\\\\Saved Games\"; \"\\\\Favorites\"; \"\\\\Searches\";\n\\\\Videos.\n\nIts malware activities are typical of recent Chaos ransomware variants. Like most\nransomware, it displays a message in “stop_propaganda.txt”. However, things get a bit\ninteresting from here as it displays the following message:\n\n\n-----\n\n_Stop Ukraine War! F_ _k Zelensky! Dont go die for f_ _king clown!_\n_You can see the truth here:_\n_t.me/[removed]_\n\n_[removed].ru_\n\nFigure 2. Message displayed by the malware\nAs seen in Figure 2, there is no ransom demand nor any information on how the victim can\nreach out to the attacker. The links on the message leads to a Russian Web page, created in\nApril 2022, with what appears to be political messages and information:\n\n\n-----\n\nFigure 3. Screenshot of the Web page linked in the message displayed by the malware\nThe message reads in English:\n\n_“- Victory will be ours!_\n\n_Information and Coordination Center”_\n\n\n-----\n\nFigure 4. Description of the Web site\nMachine translation into English is as follows:\n\n_Who we are_\n\n_Our priorities are:_\n\n_In connection with the full-scale information and economic war unfolding against the_\n_Russian Federation, the Information Coordination Center ikts was created - a group of like-_\n_minded people whose main goal is to combat the spread of false information about the_\n_activities of the Russian Federation and the Russian Armed Forces._\n\n_1. Blocking channels on Telegram, VK 2. Blocking propaganda sites,_\n\n_2. Blocking propaganda sites that disseminate false information_\n\n_3. Investigating violations of rights and civil rights and freedoms_\n\n_Current Targeting Guidelines_\n\n_In order to participate and contribute to the information confrontation, please see the_\n_Toolkit section, where you can learn how to work most effectively in each area._\n\n\n-----\n\n_If you know of a fake news channel or website which is spreading false information,_\n_defaming Russia, or violating human rights and it is not on our list, please contact us._\n\n_At the moment the following resources are being coordinated:_\n\nThe Web site also appears to include a list of Ukrainian soldiers who were either killed in\ncombat or who are considered war criminals in the eyes of the Russian Armed Forces.\n\nWhile typical Chaos ransomware variants provide at least some hope to the victim that files\nsmaller than 2,117,152 bytes that were encrypted might be recovered upon ransom payment,\nthis particular variant provides no such avenue as the attacker has no intent on providing a\ndecryption tool. Combining that with the deletion of shadow copies from the compromised\nmachine, which inhibits file recovery, makes it awfully difficult for non-tech savvy victims to\nrecover their affected files.\n\nThe malware appears to be fresh as it was likely compiled on May 16, 2022, for this attack.th\n\n## Conclusion\n\nThe Chaos ransomware variant that this blog covers is unique in the sense that the attacker\nhas no intention of providing a decryption tool or file recovery instructions for its victims to\nrecover their affected files. Finding them is a tall order for non-technical victims, which\npretty much makes the malware a file destroyer. Clearly, the motive behind this malware is\n“destruction.” The politically inclined messages also indicate that the attacker is pro-Russian\nand frustrated with the current situation. And with the Chaos ransomware builder now\nreadily available, its options allow anyone to create destructive malware. And with no end to\nthe war in sight, FortiGuard Labs expects more malware like this to emerge.\n\nVictims of ransomware are cautioned against paying ransoms by such organizations as CISA,\n[NCSC, the FBI, and HHS. Payment does not guarantee files will be recovered. It may also](https://www.fbi.gov/scams-and-safety/common-scams-and-crimes/ransomware)\nembolden adversaries to target additional organizations, encourage other criminal actors to\nengage in the distribution of ransomware, and/or fund illicit activities which could\npotentially be illegal according to a U.S. Department of Treasury’s Office of Foreign Assets\nControl (OFAC) advisory.\n\n## Past Chaos Ransomware Analysis\n\nYou can read more about the Chaos ransomware in the following FortiGuard Labs\npublications:\n\n## Fortinet Protections\n\nFortiGuard Labs has AV coverage in place for the malicious file sample in this report as:\n\nMSIL/Filecoder.AGP!tr.ransom\n\n\n-----\n\n[Fortinet customers are also protected from this malware through FortiGuard s Web Filtering,](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering)\n[FortiMail,](https://www.fortinet.com/products/email-security/fortimail.html?utm_source=blog&utm_campaign=fortimail-main-page) [FortiClient,](https://www.fortinet.com/products/endpoint-security/forticlient.html?utm_source=blog&utm_campaign=endpoint-web-page) [FortiEDR, and CDR (content disarm and reconstruction) services.](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n\nDue to the ease of disruption, damage to daily operations, potential impact to the reputation\nof an organization, and the unwanted destruction or release of personally identifiable\ninformation (PII), etc., it is important to keep all AV and IPS signatures up to date.\n\nIn addition to these protections, Fortinet has multiple solutions designed to help train users\nto understand and detect phishing threats:\n\nThe [FortiPhish Phishing Simulation Service uses real-world simulations to help](https://www.fortinet.com/products/phishing-simulation)\norganizations test user awareness and vigilance to phishing threats and to train and reinforce\nproper practices when users encounter targeted phishing attacks.\n\nWe also suggest that organizations have their end users go through our FREE NSE\ntraining: [NSE 1 – Information Security Awareness. It includes a module on Internet threats](https://www.fortinet.com/products/phishing-simulation)\nthat is designed to help end users learn how to identify and protect themselves from various\ntypes of phishing attacks.\n\n## MITRE TTPs\n\n|Collection|Col2|\n|---|---|\n|Data from Local System|T1005|\n|Credential Access||\n|Credential in Files|T1552.001|\n|Defense Evasion||\n|File Deletion|T1070.004|\n|Discovery||\n|System Information Discovery|T1082|\n|Execution||\n\n\n-----\n\nCommand-Line Interface T1059\n\n**Impact**\n\nInhibit System Recovery T1490\n\n## IOCs\n\n### File IOCs\n\n954d8fcd6b74d76999f9ec033ca855ffdab6595be23039f03bc4c6017fa3932c\n\n_[Learn more about Fortinet’s FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n|Impact|Col2|\n|---|---|\n|Inhibit System Recovery|T1490|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-17 - Chaos Ransomware Variant Sides with Russia.pdf"
    ],
    "report_names": [
        "2022-05-17 - Chaos Ransomware Variant Sides with Russia.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536133,
    "ts_updated_at": 1743041164,
    "ts_creation_date": 1653510804,
    "ts_modification_date": 1653510804,
    "files": {
        "pdf": "https://archive.orkl.eu/a9f351d32132ad88124b30e2119d647ff8d80319.pdf",
        "text": "https://archive.orkl.eu/a9f351d32132ad88124b30e2119d647ff8d80319.txt",
        "img": "https://archive.orkl.eu/a9f351d32132ad88124b30e2119d647ff8d80319.jpg"
    }
}