{
    "id": "7928f18a-52e0-41a4-94c4-360217736135",
    "created_at": "2023-01-12T14:58:57.907009Z",
    "updated_at": "2025-03-27T02:15:11.420574Z",
    "deleted_at": null,
    "sha1_hash": "7a0f12f7cb5c174d0400b6543c691b0da914d329",
    "title": "2022-10-11 - POLONIUM targets Israel with Creepy malware",
    "authors": "",
    "file_creation_date": "2022-10-23T13:15:52Z",
    "file_modification_date": "2022-10-23T13:15:52Z",
    "file_size": 1059728,
    "plain_text": "# POLONIUM targets Israel with Creepy malware\n\n**welivesecurity.com/2022/10/11/polonium-targets-israel-creepy-malware/**\n\nOctober 11, 2022\n\nESET researchers analyzed previously undocumented custom backdoors and cyberespionage tools deployed in Israel by the\nPOLONIUM APT group\n\n[Matías Porolli](https://www.welivesecurity.com/author/mporolli/)\n11 Oct 2022 - 11:30AM\n\nESET researchers analyzed previously undocumented custom backdoors and cyberespionage tools deployed in Israel by the\nPOLONIUM APT group\n\nESET researchers reveal their findings about POLONIUM, an advanced persistent threat (APT) group about which little\ninformation is publicly available and its initial compromise vector is unknown. POLONIUM is a cyberespionage group first\ndocumented by Microsoft Threat Intelligence Center (MSTIC) in June 2022. MSTIC’s assessment is that POLONIUM is an\noperational group based in Lebanon, coordinating its activities with other actors affiliated with Iran’s Ministry of Intelligence and\nSecurity (MOIS).\n\nAccording to ESET telemetry, POLONIUM has targeted more than a dozen organizations in Israel since at least September\n2021, with the group’s most recent actions being observed in September 2022. Verticals targeted by this group include\nengineering, information technology, law, communications, branding and marketing, media, insurance, and social services. Our\nfindings describing the tactics of this group, including details about a number of previously undocumented backdoors, were\n[presented in late September at the Virus Bulletin 2022 conference.](https://www.virusbulletin.com/conference/vb2022/abstracts/creepy-things-glow-dark-deep-look-poloniums-undocumented-tools/)\n\n**Key points of this blogpost:**\n\nFocused only on Israeli targets, POLONIUM attacked more than a dozen organizations in various verticals such as\nengineering, information technology, law, communications, branding and marketing, media, insurance, and social services.\n\n\n-----\n\n[ESET Research s POLONIUM findings were revealed at the Virus Bulletin 2022 conference in late September.](https://www.virusbulletin.com/conference/vb2022/abstracts/creepy-things-glow-dark-deep-look-poloniums-undocumented-tools/)\nAccording to ESET telemetry, the group has used at least seven different custom backdoors since September 2021, and it\nis currently active at the time of writing.\nThe group has developed custom tools for taking screenshots, logging keystrokes, spying via the webcam, opening\nreverse shells, exfiltrating files, and more.\nFor C&C communication, POLONIUM abuses common cloud services such as Dropbox, OneDrive, and Mega.\n\nThe numerous versions and changes POLONIUM introduced into its custom tools show a continuous and long-term effort to spy\non the group’s targets. While we haven’t observed what commands were executed by operators on compromised machines, we\ncan infer from their toolset that they are interested in collecting confidential data from their targets. The group doesn’t seem to\nengage in any sabotage or ransomware actions.\n\nAs shown in Figure 1, POLONIUM’s toolset consists of seven custom backdoors: CreepyDrive, which abuses OneDrive and\nDropbox cloud services for C&C; CreepySnail, which executes commands received from the attackers’ own infrastructure;\nDeepCreep and MegaCreep, which make use of Dropbox and Mega file storage services respectively; and FlipCreep,\nTechnoCreep, and PapaCreep, which receive commands from attacker’s servers. The group has also used several custom\nmodules to spy on its targets.\n\n_Figure 1. Timeline of observed backdoors deployed by POLONIUM_\n\n## Initial access\n\nWhile we don’t know how the group gained initial access to the targeted systems, some of the victims’ Fortinet VPN account\ncredentials were leaked in September 2021 and were made available online. As such, it is possible that the attackers gained\naccess to the victims’ internal networks by abusing those leaked VPN credentials.\n\n## Toolset\n\nPOLONIUM is an active group that constantly introduces modifications to its custom tools. We have seen more than 10 different\nmalicious modules since we started tracking the group, most of them with various versions or with minor changes for a given\nversion. Some of the most interesting characteristics of the group’s toolset are:\n\n**Abundance of tools: We have seen seven different custom backdoors used by the group since September 2021, and**\nalso saw many other malicious modules for logging keystrokes, taking screenshots, executing commands, taking photos\nwith the webcam, or exfiltrating files.\n**Custom tools: In various attacks carried out by this group over a short period of time, we detected the same component**\ncontaining minor changes. In some other cases, we have seen a module, coded from scratch, that followed the same logic\nas some previous components. Only in a few cases have we seen the group use publicly available tools or code. All of this\nindicates to us that POLONIUM builds and maintains its own tools.\n**Cloud services: The group abuses common cloud services such as Dropbox, OneDrive, and Mega for C&C**\ncommunications (receive commands and exfiltrate data).\n\n\n-----\n\n**Small components: Most of the group s malicious modules are small, with limited functionality. In one case the attackers**\nused one module for taking screenshots and another for uploading them to the C&C server. On a similar note, they like to\ndivide the code in their backdoors, distributing malicious functionality into various small DLLs, perhaps expecting that\ndefenders or researchers will not observe the complete attack chain.\n\n### CreepyDrive\n\nCreepyDrive is a PowerShell backdoor that reads and executes commands from a text file stored on OneDrive or Dropbox. It\ncan upload or download files from attacker-controlled accounts in these cloud services, and execute supplied PowerShell code.\nFigure 2 shows part of the code that downloads files and executes commands. Note that this backdoor was documented in\n[Microsoft’s report in June 2022.](https://www.microsoft.com/security/blog/2022/06/02/exposing-polonium-activity-and-infrastructure-targeting-israeli-organizations/)\n\n_Figure 2. Code used by CreepyDrive to download files or execute commands_\n\n[CreepyDrive uses the OneDrive HTTP API (and the](https://docs.microsoft.com/en-us/graph/api/resources/onedrive?view=graph-rest-1.0&preserve-view=true) [Dropbox HTTP API) to access the cloud storage. In both cases it uses a](https://www.dropbox.com/developers/documentation/http/documentation)\nrefresh token, client ID, and client secret (all hardcoded) to generate an access token that authenticates the user and grants\naccess to the accounts.\n\nWhile we didn’t observe commands being executed by the attackers on compromised systems, we spotted a log file\ndocumenting the execution of a command on a victimized computer. The contents of the log file (decoded) are shown in Figure\n3.\n\n_Figure 3. Execution log of a command and its output_\n\n### CreepySnail\n\n\n-----\n\nCreepySnail is another PowerShell backdoor that sends HTTP requests to a C&C server and receives and executes PowerShell\ncommands. We saw various versions of this backdoor in the wild, though the differences between them were minimal. Figure 4\nshows one version that can run any executable specified by the C&C server (as long as it’s in the malware folder). We won’t go\ninto more details about this backdoor as it has already been described by Microsoft in their report.\n\n_Figure 4. Code used by CreepySnail to execute commands_\n\n### DeepCreep\n\nDeepCreep is a previously undocumented backdoor written in C# that reads commands from a text file stored in Dropbox\naccounts and can upload or download files to and from those accounts. Some versions of DeepCreep have obfuscated strings,\nsome separate the code into DLLs, and some have more or less commands. We will focus on the most prevalent version for this\nanalysis, although interesting features of other versions will be mentioned.\n\nA command to be executed by the backdoor is read from the file cd.txt on the server-side root folder of the victim; once read, the\nfile is deleted from the cloud. DeepCreep runs this process in an infinite loop, which means that a new cd.txt file has to be\nplaced in the cloud storage for every command to execute. If the file is not found, the backdoor sleeps then tries again. A list of\nthe commands that DeepCreep can process is shown in Table 1.\n\n_Table 1. List of commands supported by DeepCreep_\n\n**Command** **Description**\n\nGetNoThing Deletes cd.txt.\n\n\nupload \"<local_file_path>\"\n\"\n<file_name_on_dropbox>\"\n\ndownload\n\n\"\n<file_name_on_dropbox>\"\n\"<local_file_path>\"\n\n<bool_abs_p>\n\n\nUploads a file on the victim’s computer to a subfolder 2 in Dropbox. Multiple upload lines can be\nincluded in cd.txt to execute more than one upload at once.\n\nDownloads a file from the root folder in Dropbox to the victim’s computer. If <bool_abs_p> is 0,\nthe file is downloaded into %TEMP%\\<local_file_path> (relative path). If it’s 1, the file is\ndownloaded into <local_file_path> (absolute path).\n\n\n-----\n\n**Command** **Description**\n\ndelay <value> Sets the delay for all sleep operations, where 1000 is 1 minute.\n\n\nzip\n\n\"<local_file_folder_path>\"\n\"⁠<output_path>\" \"\n<size_mb>\"\n\n\nCreates a ZIP file with the specified file or folder and saves it in the specified path on the victim’s\ncomputer. The archive is split in chunks of the specified size, in megabytes.\n\n\n**Execute with cmd.exe** When none of the previous commands are found in the first line of cd.txt, then all of the lines are\ntaken as commands to be executed with cmd.exe. The output produced by the commands is\nuploaded to a text file in Dropbox. The output encoding for the console is set to Windows-1255,\nwhich handles Hebrew characters.\n\nDeepCreep persists by creating a LNK file in %APPDATA%\\Microsoft\\Windows\\Start Menu\\Programs\\Startup and by creating a\nscheduled task. A PowerShell command is used to create the LNK file, as shown in Figure 5.\n\n_Figure 5. Part of the code that DeepCreep uses to establish persistence_\n\n[Authentication with the cloud is done by using OAuth 2.0 tokens, which are hardcoded in the binaries. DeepCreep needs a](https://developers.dropbox.com/oauth-guide)\n[legitimate DLL with Dropbox SDK to be able to communicate with the cloud.](https://github.com/dropbox/dropbox-sdk-dotnet)\n\nWe saw some cases where a separate loader – WindowsTool.exe – was used to implement persistence and execute\n[DeepCreep with InstallUtil, a legitimate tool from the .NET Framework. This version of the backdoor has its malicious code](https://docs.microsoft.com/en-us/dotnet/framework/tools/installutil-exe-installer-tool)\nprovided in an uninstallation routine and is executed with the /u (uninstall) option of InstallUtil.exe, perhaps to mislead defenders.\nFigure 6 shows part of the code of the loader.\n\n_Figure 6. Part of the code of the loader that executes DeepCreep_\n\n[In terms of string obfuscation, we have seen two variations: ROT13 and](https://en.wikipedia.org/wiki/ROT13) [AsStrongAsFuck obfuscator. The latest version of](https://github.com/Charterino/AsStrongAsFuck)\nDeepCreep that we have seen uses AES encryption and has the same key commands as the MegaCreep backdoor, which we\nwill describe in the next section.\n\n### MegaCreep\n\n\n-----\n\nMegaCreep is a previously undocumented backdoor based on DeepCreep, with added functionalities. It reads and executes\ncommands from a text file stored in [Mega cloud storage. While MegaCreep is arguably just a newer version of DeepCreep, and](https://mega.io/)\nin fact reuses code from DeepCreep, it seems the attackers consider both backdoors as separate projects.\n\nMegaCreep processes the same commands that we described for DeepCreep, but they are stored in AES-encrypted form in the\nfile cd.txt. It has additional commands, both related to the key used for decryption, which are described in Table 2.\n\n_Table 2. List of new commands added to MegaCreep_\n\n**Command** **Description**\n\n\nNewASKey\n<key>\n\nUPKY\n<old_key>\n<new_key>\n\n\nReceives the decryption key <key> that is stored locally in Cert.dll (only if the file doesn’t already exist).\n\nUpdates the decryption key from <old_key> to <new_key>. The process is successful only if <old_key> is the\nsame as the key that the backdoor is currently using. In this case, <new_key> is stored locally in Cert.dll.\n\n\nMegaCreep checks for these commands first, which are stored unencrypted in cd.txt. If none of these commands are found,\nthen the contents of cd.txt are decrypted using the key that is in Cert.dll. After decryption, all the same commands that we\ndescribed for DeepCreep can be executed by MegaCreep.\n\n[MegaCreep uses the MegaApiClient C# library to communicate with Mega cloud storage. Authentication is done with a](https://github.com/gpailler/MegaApiClient)\nusername and password, which are stored encrypted in a local file, Sess.dll. Figure 7 shows the code that loads the username\nand password from Sess.dll.\n\n_Figure 7. Code used in MegaCreep to load username and password_\n\nThis backdoor is a good example of the preference that POLONIUM has for using separate DLLs with specific functionality, as\nshown in Figure 8. In the example, two methods from PRLib.dll are called: CHP, which kills running processes with the same\nname as the backdoor’s executable (i.e., previous executions of the backdoor that are still running), and XVDFv, which\nimplements persistence (in the same way we described for DeepCreep).\n\n\n-----\n\n_Figure 8. Example of MegaCreep calling methods from separate DLLs_\n\nAnother feature that was added to MegaCreep is that the output from commands executed by cmd.exe is encrypted before it is\nuploaded to the cloud. The key used for encryption is the same as the one used to decrypt commands.\n\nWe saw one case where MegaCreep was deployed using a loader, WLAN-AutoConfig.exe. The main code for the backdoor was\nplaced in a DLL file, MainZero.dll, and other routines that communicate with Mega were placed in another DLL, MagLibrary.dll.\nFigure 9 shows the code in the loader that calls MainZero.\n\n\n-----\n\n_Figure 9. Code for MegaCreep’s loader_\n\n### FlipCreep\n\nFlipCreep is another previously undocumented backdoor written in C# that has a very similar flow of execution as the other\nbackdoors that we have described: it reads commands from orders.txt – a text file stored on an FTP server operated by\nPOLONIUM – and can upload or download files from the server. The commands that FlipCreep can process are the same as the\nother backdoors, with the following considerations:\n\nThe commands upload and download do the opposite of what’s expected. We don’t know if this was a mistake, but upload\nactually downloads files from the FTP server to the victim, and download uploads files. Both take two arguments, as was\nthe case in MegaCreep. Figure 10 shows part of the code that uploads files; we can see that it looks for the string\ndownload.\nThere is a command ftpversion that uploads the version of the backdoor (hardcoded) to a file ver.txt on the FTP server, in\nthe root folder for the target.\n\n\n-----\n\n_Figure 10. Part of the FlipCreep code to upload files_\n\nFlipCreep creates a folder with the username of the target on the FTP server, along with these subfolders:\n\nFiles: stores files uploaded from the victims\norders: stores output from commands executed with cmd.exe\n\nPersistence is achieved in the same way as was described for DeepCreep. As for string obfuscation, we’ve seen one sample\nwith ROT13 obfuscation.\n\n### TechnoCreep\n\nTechnoCreep is a previously undocumented C# backdoor that communicates with a C&C server via TCP sockets. In this case,\ncommands are not read from a file, but received in an exchange of messages. The first message is sent by the backdoor and\ncontains initial information about the victim, in the format <PC_NAME>#<USERNAME>#<LIST_IP>#<LIST_OTHER>#<OS>\n\n<LIST_IP> is a list of IP addresses that are resolved for the hostname of the victim, separated by /. The list is obtained by calling\n[Dns.GetHostByName and applying a regular expression for IP addresses. All the other elements that don’t match the regular](https://docs.microsoft.com/en-us/dotnet/api/system.net.dns.gethostbyname?view=net-6.0)\nexpression are sent as <LIST_OTHER> to the C&C server; note that in the most common scenario this list will be empty.\n\nTechnoCreep receives commands in an infinite loop. The list of commands is shown in Table 3.\n\n_Table 3. List of commands supported by TechnoCreep_\n\n**Command** **Description**\n\nupload Uploads a file on the victim’s computer to the C&C server. The path of the file to upload is received\nin a separate message. If the file exists, the backdoor sends Exist, to which the server replies start\nor stop. If start is received, the size of the file is sent. Finally, the file is sent to the server as raw\nbytes. If the message is stop, nothing is done. If the specified file doesn’t exist, NotE is sent to the\nserver.\n\n\n-----\n\n**Command** **Description**\n\ndownload download Downloads a file from the C&C server. The path where the file will be saved on the\nvictim’s computer is received in a separate message. If NotE is received instead, the process stops.\nIf the path is an absolute path, and the parent folder doesn’t exist, then the backdoor sends NOT.\nOtherwise, it sends Exists, to which the server replies by sending the size of the file. Then the\nbackdoor sends ok, sleeps for 1 second, and then receives the file as raw bytes.\n\n**Execute with cmd.exe** When neither of the previous commands are received, the message is taken as a command to be\nexecuted with cmd.exe. The output is sent to the server.\n\nTechnoCreep persists by copying its executable to the Startup folder, as shown in Figure 11. Identical code can also be found in\nsome versions of DeepCreep. Note that no LNK files are used in this method.\n\n_Figure 11. TechnoCreep code establishing persistence_\n\n### PapaCreep\n\nPapaCreep is a previously undocumented custom backdoor written in C++ that can receive and execute commands from a\nremote server via TCP sockets. First seen in September 2022, this is the first backdoor used by POLONIUM that was not written\nin C# or PowerShell.\n\nPapaCreep is a modular backdoor; its code has been divided in various components, some of them with minimal functionalities.\nWe can summarize the main components as:\n\nExecutive: looks for a file with commands and executes them with cmd.exe. The output is saved to a file.\nMailman: communicates with a C&C server to receive commands and writes them to a file. It also sends the file with output\nfrom commands to the C&C server.\nCreepyUp: uploads any file to the C&C server.\nCreepyDown: downloads any file from the C&C server.\n\nThe Executive and Mailman components run independently from each other and are even persisted with separate scheduled\ntasks in a compromised system. Communication with the remote server uses raw TCP sockets, but the information that is sent\nand received by the backdoor is contained in HTML code (with a fake HTTP header). Figure 12 shows that the header is\nhardcoded in the backdoor, and Content-length is always 1024. Note that Content-Type is text/-html, which is not a normal\nvalue.\n\n\n-----\n\n_Figure 12. Hardcoded HTTP header used by the PapaCreep backdoor_\n\nThe Mailman component initiates communication with the C&C server by sending <PC_NAME>-<USERNAME> (base64\nencoded). It then starts two threads: one of them receives commands from the server and the other one sends any available\noutput from the execution of commands. Delimiters are used for both sending and receiving: code#s and code#f are used to\nmark the start and end of the data. An example of a message sent to the server with the output of a dir command is shown in\nFigure 13.\n\n_Figure 13. Example of a message sent to the C&C server, and the decoded content_\n\nIf the content is bigger than 1024 bytes, more than one message will be transmitted. In that case, the first message will have the\nstart delimiter and the final message will have the end delimiter. The IP address and port of the C&C server is read from a text\nfile, yetty.dll, with the format <IP_address>::<port> (base64 encoded).\n\nThe CreepyUp and CreepyDown modules are not part of the main flow of execution of the backdoor and can be executed on\ndemand. They are standalone command line tools that take two arguments, a local and a remote file. Curiously, CreepyDown’s\nfilename in compromised computers is UCLN.exe and CreepyUp is DCLN.exe. This is similar as the commands upload and\ndownload in the FlipCreep backdoor that do the opposite of what is expected. Both CreepyUp and CreepyDown read the server\ninformation from the yetty.dll text file.\n\n### Other modules\n\n\n-----\n\nTo spy on their victims, POLONIUM uses several other modules on top of their backdoors, including reverse shell modules and a\nmodule for creating a tunnel. ESET researchers have observed many variants of the modules that the group uses for taking\nscreenshots. As for keyloggers, POLONIUM has used both custom and open-source ones. The group’s custom keylogger\nmonitors keystrokes and clipboard contents and supports both Hebrew and Arabic keyboards. POLONIUM has also used a\n[simple module that uses AForge.NET to take a snapshot from the webcam and save it in the TEMP folder.](https://github.com/cureos/aforge)\n\n## Network infrastructure\n\nPOLONIUM didn’t use domain names in any of the samples that we analyzed, only IP addresses. Most of the servers are\ndedicated VPS, likely purchased rather than compromised, hosted at HostGW. There is one special case: IP address\n45.80.149[.]154 hosts erichmocanu.tv, which seems to be a legitimate website. It is likely that POLONIUM used this server\nbefore it was assigned to its current owner.\n\n## Conclusion\n\nPOLONIUM is a very active threat actor with a vast arsenal of malware tools and is constantly modifying them and developing\nnew ones. A common characteristic of several of the group’s tools is the abuse of cloud services such as Dropbox, Mega and\nOneDrive for C&C communications.\n\nIntelligence and public reports about POLONIUM are very scarce and limited, likely because the group’s attacks are highly\ntargeted, and the initial compromise vector is not known. ESET Research will continue to track its activities and document its\nattacks.\n\n_For any inquiries about our research published on WeLiveSecurity, please contact us at_ _[threatintel@eset.com.](mailto:threatintel@eset.com)_\n_ESET Research also offers private APT intelligence reports and data feeds. For any inquiries about this service, visit the ESET_\n_Threat Intelligence page._\n\n## IoCs\n\n[A comprehensive list of Indicators of Compromise and samples can be found in our GitHub repository.](https://github.com/eset/malware-ioc/tree/master/polonium)\n\n**SHA-1** **Filename** **ESET detection name** **Description**\n\n3F4E3C5301752D39DAF97384CCA47564DA1C3314 dnw.exe PowerShell/Agent.GJ CreepyDrive\n\nCC820ED9A23084104807941B76A2679243BA357C Request.exe PowerShell/Agent.HF CreepySnail\n\n03A35A0167684E6CCCA641296969972E49B88D60 DropBox.exe MSIL/Agent.DPT DeepCreep\n\n4E7DBFF20995E97190536B284D7E5CC65922FD55 Mega.exe MSIL/Agent.DPT MegaCreep\n\n994EAD7666A67E33C57A51EF98076D41AABB7FB7 Regestries.exe MSIL/Tiny.DG FlipCreep\n\n79DE0AF2F10F8D39A93EED911D4048D87E3C8A1C WinUpdate.dll MSIL/Agent.DYU TechnoCreep\n\n2B9444B0E1747EB4F482D29C9DE27D07CCE55A76 WindowsSartup22.exe Win64/HackTool.NetHacker.G PapaCreep\n\nF26F43AD2E2980B96497242A3F30CA003E5CF54C WinSc.exe MSIL/Tiny.DG Screenshots\nmodule\n\nF41E27C4C863821DE6CAD91CA7E77CD6CA6CE5D3 4kyro3fs.dll MSIL/Spy.Keylogger.FGC Keylogger\nmodule\n\n94E75BA7C4476AFDACF4B39E403379C5ECD1BED6 Device.exe MSIL/Spy.Tiny.CZ Webcam\nmodule\n\nB87CC5269A5DF5CF093F8D28DF78952F662162B6 OnDrive.exe MSIL/Agent.DTP Reverse\nshell module\n\n809048A40274350BD0C453E49D8C1F7D32397164 Rehost.exe MSIL/Spy.Tiny.DA Exfiltration\nmodule\n\n\n43E3C3752A15D0BDE7135E1B52F1DE397B5314B5 Microsoft Malware\nProtection.exe\n\n\nMSIL/Agent.DYV Tunnels\nmodule\n\n\n-----\n\n### Network\n\n**IP** **First seen** **Details**\n\n37.120.233[.]89 2022-09-12 PapaCreep C&C\n\n45.80.148[.]119:8080 2022-05-21 Reverse shell server\n\n\n45.80.148[.]167:21\n\n45.80.148[.]167:5055\n\n\n2021-11-27 Exfiltration\n\n\n45.80.148[.]186:8080 2022-01-08 Reverse shell server\n\n45.80.149[.]22:8080 2022-05-13 CreepySnail C&C\n\n45.80.149[.]108:8080 2022-02-11 CreepySnail C&C\n\n45.80.149[.]68:63047 2022-03-01 CreepySnail C&C\n\n45.80.149[.]71:80 2022-03-11 CreepySnail C&C\n\n185.244.129[.]79:63047 2022-03-01 CreepySnail C&C\n\n\n45.80.149[.]154:1302\n\n45.80.149[.]154:21\n\n\n2021-09-23 TechnoCreep C&C\n\nExfiltration\n\n\n185.244.129[.]216:5055 2021-11-24 Exfiltration\n\n146.70.86[.]6:1433 2022-05-26 Exfiltration\n\n195.166.100[.]23:5055 2022-01-05 Exfiltration\n\n45.137.148[.]7:2121 2021-10-29 FlipCreep C&C\n\n185.203.119[.]99:8080 2022-02-12 Reverse Shell\n\n212.73.150[.]174 2022-02-24 Tunneling\n\n94.156.189[.]103 2022-04-20 Tunneling\n\n51.83.246[.]73 2022-03-12 Tunneling\n\n## MITRE ATT&CK techniques\n\n[This table was built using version 11 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)\n\n**Tactic** **ID** **Name** **Description**\n\n\nResource\nDevelopment\n\n\n[T1583.003](https://attack.mitre.org/versions/v11/techniques/T1583/003/) Acquire Infrastructure: Virtual Private Server POLONIUM has acquired various\nservers for C&C and also for storing\nexfiltrated files.\n\n\n[T1587.001](https://attack.mitre.org/versions/v11/techniques/T1587/001/) Develop\nCapabilities:\nMalware\n\n[T1588.001](https://attack.mitre.org/versions/v11/techniques/T1588/001/) Obtain\nCapabilities:\nMalware\n\n\nPOLONIUM has developed at least six backdoors\nand several other malicious modules.\n\nPOLONIUM has used a publicly available\nkeylogger.\n\n\nExecution [T1059.001](https://attack.mitre.org/versions/v11/techniques/T1059/001/) Command and Scripting Interpreter: PowerShell POLONIUM has used the CreepySnail\nand CreepyDrive PowerShell\nbackdoors in their attacks.\n\n\n[T1059.003](https://attack.mitre.org/versions/v11/techniques/T1059/003/) Command and\nScripting\nInterpreter:\nWindows\nCommand Shell\n\n\nDeepCreep, MegaCreep, FlipCreep and\nTechnoCreep use cmd.exei to execute commands\nin a compromised computer.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1129](https://attack.mitre.org/versions/v11/techniques/T1129/) Shared\nModules\n\n\nDeepCreep and MegaCreep have their code\ndivided into small DLLs, which are loaded both\nstatically and dynamically.\n\n\nPersistence [T1547.009](https://attack.mitre.org/versions/v11/techniques/T1547/009/) Boot or Logon Autostart Execution: Shortcut\nModification\n\n\nPOLONIUM’s backdoors persist by\nwriting shortcuts to the Windows\nStartup folder.\n\n\n[T1053.005](https://attack.mitre.org/versions/v11/techniques/T1053/005/) Scheduled\nTask/Job:\nScheduled Task\n\n\nDeepCreep, MegaCreep and FlipCreep create\nscheduled tasks for persistence.\n\n\nDefense\nEvasion\n\n\n[T1140](https://attack.mitre.org/versions/v11/techniques/T1140/) Deobfuscate/Decode Files or Information DeepCreep and MegaDeep use AES\nencryption to obfuscate commands\nand login credentials stored in local\nfiles on the victim’s computer.\n\n\n[T1070.004](https://attack.mitre.org/versions/v11/techniques/T1070/004/) Indicator\nRemoval on\nHost: File\nDeletion\n\n[T1036.005](https://attack.mitre.org/versions/v11/techniques/T1036/005/) Masquerading:\nMatch\nLegitimate\nName or\nLocation\n\n[T1218.004](https://attack.mitre.org/versions/v11/techniques/T1218/004/) System Binary\nProxy\nExecution:\nInstallUtil\n\n[T1083](https://attack.mitre.org/versions/v11/techniques/T1083/) File and\nDirectory\nDiscovery\n\n[T1057](https://attack.mitre.org/versions/v11/techniques/T1057/) Process\nDiscovery\n\n[T1082](https://attack.mitre.org/versions/v11/techniques/T1082/) System\nInformation\nDiscovery\n\n[T1016](https://attack.mitre.org/versions/v11/techniques/T1016/) System\nNetwork\nConfiguration\nDiscovery\n\n[T1033](https://attack.mitre.org/versions/v11/techniques/T1033/) System\nOwner/User\nDiscovery\n\n\nPOLONIUM’s exfiltration modules delete\nscreenshot files or keystroke logs from a\ncompromised host after they are exfiltrated.\n\nPOLONIUM has used filenames such as\nMega.exei or DropBox.exei for its backdoors, to\nmake them look like legitimate binaries.\n\nPOLONIUM has used InstallUtil.exei to execute\nDeepCreep.\n\nPOLONIUM’s custom exfiltrator module builds a\nlisting of files for any given folder.\n\nDeepCreep, MegaCreep and FlipCreep look for\nrunning processes and kill other instances of\nthemselves.\n\nTechnoCreep and POLONIUM’s reverse shell\nmodule send information such as computer name,\nusername, and operating system to a remote\nserver, in order to identify their victims.\n\nTechnoCreep sends a list of IP addresses\nassociated with a victim’s computer.\n\nPOLONIUM has executed whoami.exei to identify\nthe logged-on user.\n\n\nCollection [T1560.002](https://attack.mitre.org/versions/v11/techniques/T1560/002/) Archive Collected Data: Archive via Library DeepCreep, MegaCreep and\nFlipCreep use .NET’s ZipFile class to\narchive collected data.\n\n[T1115](https://attack.mitre.org/versions/v11/techniques/T1115/) Clipboard Data POLONIUM’s custom keylogger retrieves\nclipboard data from compromised computers.\n\n\n[T1005](https://attack.mitre.org/versions/v11/techniques/T1005/) Data from Local\nSystem\n\n[T1056.001](https://attack.mitre.org/versions/v11/techniques/T1056/001/) Input Capture:\nKeylogging\n\n\nPOLONIUM’s exfiltrator module collects files from\na compromised system.\n\nPOLONIUM has used custom and publicly\navailable keyloggers.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n[T1113](https://attack.mitre.org/versions/v11/techniques/T1113/) Screen Capture POLONIUM has used custom modules for taking\nscreenshots.\n\n[T1125](https://attack.mitre.org/versions/v11/techniques/T1125/) Video Capture POLONIUM has used a custom module to capture\nimages using the compromised computer’s\nwebcam.\n\n\nCommand\nand Control\n\n\n[T1071.001](https://attack.mitre.org/versions/v11/techniques/T1071/001/) Application Layer Protocol: Web Protocols CreepySnail and POLONIUM’s file\nexfiltrator modules use HTTP\ncommunication with the C&C server.\n\n\n[T1071.002](https://attack.mitre.org/versions/v11/techniques/T1071/002/) Application\nLayer Protocol:\nFile Transfer\nProtocols\n\n[T1132.001](https://attack.mitre.org/versions/v11/techniques/T1132/001/) Data Encoding:\nStandard\nEncoding\n\n[T1573.001](https://attack.mitre.org/versions/v11/techniques/T1573/001/) Encrypted\nChannel:\nSymmetric\nCryptography\n\n[T1095](https://attack.mitre.org/versions/v11/techniques/T1095/) Non-Application\nLayer Protocol\n\n[T1571](https://attack.mitre.org/versions/v11/techniques/T1571/) Non-Standard\nPort\n\n[T1572](https://attack.mitre.org/versions/v11/techniques/T1572/) Protocol\nTunneling\n\n[T1102.002](https://attack.mitre.org/versions/v11/techniques/T1102/002/) Web Service:\nBidirectional\nCommunication\n\n\nFlipCreep and POLONIUM’s file exfiltrator\nmodules use FTP communication with the C&C\nserver.\n\nCreepySnail, CreepyDrive and some of\nPOLONIUM’s reverse shell modules use base64encoded commands to communicate with the C&C\nserver.\n\nDeepCreep and MegaCreep AES encrypt\ncommands and their output.\n\nTechnoCreep and POLONIUM’s reverse shell\nmodule use TCP.\n\nPOLONIUM has used non-standard ports, such as\n5055 or 63047, for HTTP.\n\nPOLONIUM’s tunnels module uses the Plink utility\nto create SSH tunnels.\n\nPOLONIUM has used cloud platforms such as\nOneDrive, Dropbox, and Mega to send commands\nand store the output.\n\n\nExfiltration [T1041](https://attack.mitre.org/versions/v11/techniques/T1041/) Exfiltration Over C2 Channel DeepCreep, MegaCreep, FlipCreep\nand TechnoCreep exfiltrate files over\nthe C&C channel via uploadi\ncommands.\n\n\n[T1567.002](https://attack.mitre.org/versions/v11/techniques/T1567/002/) Exfiltration Over\nWeb Service:\nExfiltration to\nCloud Storage\n\n11 Oct 2022 - 11:30AM\n\n\nPOLONIUM has used OneDrive, Dropbox, and\nMega cloud storage to store stolen information.\n\n\n-----\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-11 - POLONIUM targets Israel with Creepy malware.pdf"
    ],
    "report_names": [
        "2022-10-11 - POLONIUM targets Israel with Creepy malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "6cfeba14-c84e-4606-88b9-c7a7689c450f",
            "created_at": "2022-10-25T16:07:24.06766Z",
            "updated_at": "2025-03-27T02:02:10.097459Z",
            "deleted_at": null,
            "main_name": "Polonium",
            "aliases": [
                "Plaid Rain"
            ],
            "source_name": "ETDA:Polonium",
            "tools": [
                "CreepyDrive",
                "CreepySnail",
                "DeepCreep",
                "FlipCreep",
                "MegaCreep",
                "PapaCreep",
                "TechnoCreep"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d866a181-c427-43df-9948-a8010a8fdad6",
            "created_at": "2022-10-27T08:27:13.080609Z",
            "updated_at": "2025-03-27T02:00:55.468138Z",
            "deleted_at": null,
            "main_name": "POLONIUM",
            "aliases": [
                "POLONIUM",
                "Plaid Rain"
            ],
            "source_name": "MITRE:POLONIUM",
            "tools": [
                "CreepyDrive",
                "CreepySnail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b7823339-891d-4ded-b01d-1f142a88bc64",
            "created_at": "2023-01-06T13:46:39.381591Z",
            "updated_at": "2025-03-27T02:00:03.069535Z",
            "deleted_at": null,
            "main_name": "POLONIUM",
            "aliases": [
                "Plaid Rain",
                "UNC4453",
                "GREATRIFT"
            ],
            "source_name": "MISPGALAXY:POLONIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535537,
    "ts_updated_at": 1743041711,
    "ts_creation_date": 1666530952,
    "ts_modification_date": 1666530952,
    "files": {
        "pdf": "https://archive.orkl.eu/7a0f12f7cb5c174d0400b6543c691b0da914d329.pdf",
        "text": "https://archive.orkl.eu/7a0f12f7cb5c174d0400b6543c691b0da914d329.txt",
        "img": "https://archive.orkl.eu/7a0f12f7cb5c174d0400b6543c691b0da914d329.jpg"
    }
}