{
    "id": "7944d79d-d19d-49a3-a06b-68e1765c580f",
    "created_at": "2024-01-17T02:04:26.655068Z",
    "updated_at": "2025-03-27T02:06:01.502516Z",
    "deleted_at": null,
    "sha1_hash": "95f848ff414c5e2288448815427b9f0019449ab9",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T03:53:53Z",
    "file_modification_date": "2024-01-16T03:53:53Z",
    "file_size": 1304700,
    "plain_text": "# Intellexa and Cytrox: From fixer-upper to Intel Agency- grade spyware\n\n**[blog.talosintelligence.com/intellexa-and-cytrox-intel-agency-grade-spyware](https://blog.talosintelligence.com/intellexa-and-cytrox-intel-agency-grade-spyware/)**\n\nVitor Ventura December 21, 2023\n\n[By Vitor Ventura](https://blog.talosintelligence.com/author/vitor-ventura/)\n\nThursday, December 21, 2023 11:00\n\n[Threat Spotlight](https://blog.talosintelligence.com/category/threat-spotlight/)\n\n_By Mike Gentile,_ _[Asheer Malhotra and Vitor Ventura.](https://twitter.com/asheermalhotra)_\n\n**[Editor’s note: This blog post is a public version of a talk presented at LabsCon 2023 on](https://events.sentinelone.com/event/1bdc4a79-98f4-4913-a8d6-efb9a6796cce/websitePage:9107aab7-3c7b-47d0-bad4-4f85cf7fcecd)**\n[Sept. 22, 2023. You can watch a recording of the talk here. Some of the intelligence](https://events.sentinelone.com/event/1bdc4a79-98f4-4913-a8d6-efb9a6796cce/websitePage:9107aab7-3c7b-47d0-bad4-4f85cf7fcecd)\npresented at LabsCon was later confirmed by an Amnesty International blog post\nreleased on Oct. 6, 2023.\n\nCisco Talos has a new, in-depth analysis of timelines, operating paradigms and\nprocedures adopted by spyware vendor Intellexa (previously known as Cytrox).\nTalos’ analysis revealed that rebooting an iOS or Android device may not always\n[remove the Predator spyware produced by Intellexa. Persistence is an add-on](https://blog.talosintelligence.com/mercenary-intellexa-predator/)\nfeature provided by Intellexa for their implants and primarily depends on the\nlicensing options chosen by a customer.\n\n\n-----\n\nIntellexa knows if their customers intend to perform surveillance operations on\nforeign soil.\nTwo years after its first public exposure, Intellexa’s Predator/Nova spyware\nsolution continues to be undetected by anti-virus solutions. Public reporting on\nIntellexa’s operations has had little to no impact on their ability to conduct and\ngrow their business across the world.\nAlmost all publications on malicious operations conducted using Intellexa’s\nspyware consist primarily of malicious domains as indicators of compromise\n(IOCs). Talos assesses that the disclosure of such domains, managed by the\ncustomers, has little to no effect on Intellexa’s operations and enables them to\npreserve their malware implants due to a lack of technical disclosures.\nAfter many users patched against the exploit chains used by Intellexa as of\nDecember 2021, the spyware vendor started shipping a new exploit chain to at\nleast one new customer in early 2022 that covered the same and more recent\nversions of the Android operating system.\n\n[In May 2023, Cisco Talos published the first ever in-depth technical report on Intellexa’s](https://blog.talosintelligence.com/mercenary-intellexa-predator/)\nspyware solution named Alien and Predator, showing its inner workings and\ndemonstrating the highly complex software architecture decisions required to make such\nspyware work properly on the Android operating system. This research also sheds light\non several other aspects of the commercial spyware space, like plausible deniability, the\nimpacts of widespread media exposure and recruitment issues.\n\n[During the LabsCon 2023 cyber threat intelligence conference, Talos presented the](https://www.labscon.io/)\noperational risks inherent to the commercial spyware landscape, using Intellexa as a use\ncase.\n\nThis research delves into the history of the Alien/Predator line of implants, illustrating\nhow a run-down spyware seller, Cytrox, was bought and transformed into an intelligence\nagency-grade spyware vendor: Intellexa.\n\n## Implants’ persistence is an add-on in Intellexa’s offering\n\nLeaked commercial proposals from the Intellexa Alliance have shown that prices per\ninfection are increasing every year, along with the capabilities of the company's\ntechnological solution. Rebooting the device is no longer a means to remove the\nimplants from an infected device.\n\nIn 2021, Predator spyware couldn’t survive a reboot on the infected Android system (it\nhad it on iOS). However, by April 2022, that capability was being offered to their\ncustomers. Since then, no reports have been published detailing such a mechanism, as\nthere is no reason to believe it has become obsolete. It still doesn’t survive a factory\nreset, but it is fair to assume that this specific capability will become available, literally\nbreaking all trust in the device beyond recovery.\n\n\n-----\n\n## Intellexa’s product development journey\n\nCytrox was first created in North Macedonia in 2017, and at the time, built Androidbased malware. In 2018, Cytrox was acquired by WiSpear and then in 2019 Nexa\nTechnologies, WiSpear (and Cytrox) and Senpai Technologies teamed up to create the\nIntellexa Alliance, a commercial spyware company that, according to public reports, sells\ncommercial spyware to multiple customers without regard for their potential targets and\nthe spyware’s misuse.\n\nSenpai Technologies is a company specializing in OSINT and persona creation based\nout of Israel, while WiSpear, also based in Israel, specializes in Wi-Fi interception. Nexa\nTechnologies (now called RB 42) is a French-based company whose main focus is\nremote surveillance and security services.\n\nImmediately after the consolidation of all these firms under Intellexa in May 2019, the\nrevamping of Predator began, which at the time, was their flagship spyware for Android.\nThis can be confirmed on the artifacts left on the malware binary due to the use of static\nlibrary compilation at build time.\n\nBy April 2020, the revamp was finished and the malware was ready to be deployed on\nAndroid. In May 2020, the developers began working on an iOS “solution” which we\nassess with medium confidence was a port of Alien/Predator from Android to iOS. Our\nassessment is based on the fact that the engine that drives the high-level components of\nthe Predator system is similar, if not identical, to the point where some Android artifacts,\ndetailed in the following sections, can be found on the iOS sample.\n\n\n-----\n\nEvolution timeline\n\n## Pricing model\n\nBuilding commercial spyware is a sophisticated and research-driven process. It involves\nmeticulously circumventing, bypassing and exploiting security controls put in place by\nmobile applications/packages and Operating Systems such as Android and iOS.\nCombining such potent software into a package with zero or one-click zero-day exploits\n\n\n-----\n\nmakes it a highly reliable offensive “solution” – and that is exactly what makes it\nexpensive. As early as 2016, [The New York Times reported that the NSO Group charged](https://www.nytimes.com/2016/09/03/technology/nso-group-how-spy-tech-firms-let-governments-see-everything-on-a-smartphone.html)\n$650,000 for every 10 infections, with an additional $500,000 for initial setup. Multi-year\ndeals between the NSO Group and Mexico were estimated to be around $15 million –\nand this was back in 2013.\n\nFast forward five years to 2021, and another disclosure from [The New York Times](https://int.nyt.com/data/documenttools/intellexa-commercial-proposal/309b14108229142a/full.pdf)\ndetails the proposal brochure for Intellexa’s Predator framework offering their solution for\na whopping 13.6 million Euros for:\n\n20 concurrent infections.\nOne-click exploit for initial access.\nPredator C2 and administrative hardware and software.\nProject plans, documentation, etc.\n12 months of warranty support.\n\n\n-----\n\nProposal (snipped) defining price and items\n\n[Leaked documents from 2022 show that the Nova platform, which is Intellexa’s data-](https://www.europarl.europa.eu/RegData/etudes/STUD/2022/738330/IPOL_STU(2022)738330_EN.pdf)\n[gathering module, was priced at 8 million Euros in 2022. Price tags of 13.6 million or](https://twitter.com/vxunderground/status/1562550443712352256/photo/3)\neven 8 million Euros is a hefty sum. However, this reinforces the fact that commercial\nspyware such as those from Intellexa is neither for the common man nor for petty\ncrimeware operators. These solutions are meant for customers with deep pockets and\nsuch expenses can only be incurred by state-sponsored agencies.\n\nThe pricing model also shows the technological evolution of the product. Based on the\nleaked proposal dates in July 2022, Intellexa had already incorporated boot survivability\ninto the Android solution. It also increased the support for Android to 18 months. At this\n\n\n-----\n\npoint, it is unclear if this is the direct result of Intellexa’s development and research\ncapabilities, or if these are based on exploits acquired that ultimately would result in\nhaving such capabilities.\n\nThe original persistence mechanism on iOS was the exploitation of the original\nvulnerability during the boot process by loading the malicious HTML page stored locally.\nAs such, the newly introduced Android persistence mechanism can simply be based on\na similar method.\n\n## Plausible deniability\n\nIntellexa’s commercial proposals are designed to create plausible deniability. These\nclauses extend from the infrastructure responsibilities to the delivery methods. This is a\nkey aspect of Intellexa’s business model, the goal is to avoid a bad reputation and to\nclaim they are not responsible for what their customers do with their “product” — they\nclaim that they don’t even know who the victims are.\n\nProposal (snipped) defining responsibilities\n\nThe leaked proposals show that the infrastructure and anonymization are the\nresponsibility of the customer. From a deniability point of view, this enables the claim\nthat Intellexa doesn’t know how victims are being targeted. From the operational risk\nperspective, such clauses also shield Intellexa from any responsibility in the event of a\npublic exposure connecting malicious operations back to the vendor.\n\nDelivery method method\n\n\n-----\n\nThe delivery of Intellexa’s supporting hardware is done at a terminal or airport. This\ndelivery method is known as Cost Insurance and Freight (CIF), which is part of the\nshipping industry’s jargon (“Incoterms”). This mechanism allows Intellexa to claim that\nthey have no visibility of where the systems are deployed and eventually located. This\nexact scenario was seen being put into practice when, according to a LighthouseReports\n[investigation, Intellexa sold their solution to the Sudanese government.](https://www.lighthousereports.com/investigation/flight-of-the-predator/)\n\nSource: https://www.lighthousereports.com/investigation/flight-of-the-predator/\n\nEven if we take into consideration the proposal’s terms such as, “Installation and\nconfiguration at customer designated facility…” and the “Standard training course ……,”\nit still does not mean that Intellexa might know where the hardware is located since\neverything can be done remotely or even without their personnel knowing where the\ncustomer’s “solution” is physically located.\n\nIntellexa does have first-hand knowledge of if their software is being used to conduct\nsurveillance operations targeting phone number prefixes other than their customers'\ncountry of origin and possibly their jurisdiction. This knowledge is a consequence of the\nlicensing model. Any sale is limited to a single phone country code prefix, but for an\nadditional fee, the customer can license the usage of the solution in additional countries\nwithout geographic limitations.\n\n\n-----\n\n## Business risks\n\n Human resources\n\nCommercial spyware companies don’t seem to have any kind of problem recruiting\nhighly specialized human resources to develop their solutions. This was evidenced by\nthe LinkedIn profiles of several highly specialized engineers. In one example, the NSO\nGroup in June had just recruited new, highly specialized engineers from an intelligence\nmilitary unit.\n\nDuring the development of the iOS implant, Intellexa hired an iOS expert vulnerability\nresearcher who had previously worked for the NSO Group. The timing of the hire\nindicates that the firm needed to integrate the implant with the exploit chain to deploy it\nreliably on iOS devices.\n\nSnippet of the iOS security expert Curriculum Vitae\n\nSuch “experts” can be found working for and actively hunting for jobs regularly at other\ncommercial spyware vendors too. For example, a quick search by Talos showed that\njust in September 2023, the NSO group had hired another security researcher with the\nsame research background:\n\n\n-----\n\nExample of employment history\n\nAnd there are several examples like that. The highly skilled researchers will move from\none company to another in the same line of business supplying a constant flow of\nhuman resources as needed.\n\n## Target operating system support\n\nNew operating system releases don’t seem to make a considerable impact on the\nPredator solution. Intellexa now supports OS versions going back 18 months on Android\nand 12 months on iOS from their last supported version, which may not be the latest.\nGoogle releases approximately one new version per year just like Apple. But, the\nAndroid OS may consist of beta versions months before general availability. This gives\nplenty of lead time to Intellexa and their exploit suppliers to develop new exploit chains\nto use as initial attack vectors.\n\nIt is important to understand that the Alien/Predator implants themselves don’t need to\nchange much between operating system releases. They are written to be as generic and\nmodular as possible, and the modules that need to be specific to an OS version and/or\ncapability are written in Python, which can easily be updated and deployed on the fly via\na customer’s infrastructure.\n\nThe components that are more sensitive to operating system updates are the initial\naccess vectors and the persistence mechanisms. These capabilities often rely on\nexploits that can be patched or new mitigation techniques may render them useless.\n\n## Vulnerability exploits chain patching\n\nThis is the most sensitive and least controlled part of any commercial spyware solution.\nStill, one may think that there is a high impact on the operational capability of a\ncommercial spyware vendor, but the reality seems to prove the impact is low, or medium\nat most.\n\n\n-----\n\nExploit brokers and exploit research companies, sell full or partial exploit chains as a\nsubscription model where the customers are entitled to workable replacements if the\npurchased chain is patched.\n\nThe timeline of events shows that it took Intellexa, at most, six months (probably less) to\nobtain and integrate a new fully operational exploit chain into their solution, after their\nAndroid previous one was patched in Nov 2021. This is confirmed by the fact that, in\nMay 2022, their platform was being shipped to a new customer in Sudan, according to\nthe Lighthouse report.\n\nOverall, this demonstrates that exposing the vulnerabilities used by commercial spyware\nvendors, although extremely important, does not impose much of a risk on them. In fact,\nthat risk is transferred onto the exploit brokers and vendors.\n\nThis has caught the attention of the Biden-Harris administration, to the point that the\n[Intellexa Alliance was added to the Entity List for “...determination that the companies](https://www.state.gov/the-united-states-adds-foreign-companies-to-entity-list-for-malicious-cyber-activities-2/)\n_engaged in trafficking in cyber exploits used to gain access to information systems…” In_\npractical terms, U.S.-based companies that deal in exploits cannot do business with the\nIntellexa galaxy of companies. This means that Intellexa will have to procure its exploits\nfrom companies in other regions, which for the time being, doesn’t seem to be a\nproblem. However, if the United Kingdom and the European Union take similar actions,\nthe market will become smaller, making it much harder for these companies to acquire\ntheir initial attack vector.\n\n## The lack of impact from public exposure\n\nThe public exposure of commercial spyware companies creates awareness and has\ngained the attention of governments and regulating bodies. Such disclosures have also\nbeen successful at attributing malicious operations conducted by regimes against\nhuman rights activists, journalists and civilian dissidents, indicating the lack of a moral\ncompass of many of Intellexa’s “customers.”\n\nHowever, exposing regimes conducting these operations seems to have little effect on\nthese companies’ abilities to make money. It may increase the costs by making them\nbuy or create new exploit chains but these vendors appear to have seamlessly acquired\nnew exploit chains, enabling them to remain in business by jumping from one set of\nexploits to another as a means of initial access. A majority of public disclosures in the\ncommercial spyware space focus on the political aspects of the operations along with\nlisting malicious domains and infrastructure but fail to tear open the inner workings of the\nmalware themselves. The domains and infrastructure exposed in a disclosure are owned\nand operated by spyware customers themselves, often in silos, meaning that exposing\none operation typically may have no impact on all the other customers. However, the risk\nof exposure will always be primarily based on the efforts put by the customer into their\nanonymization chain.\n\n\n-----\n\nSuch disclosures may have a substantial impact on the regimes (“customer”), but they\nfail to impose costs on the spyware vendor themselves. What is needed is the public\ndisclosure of technical analyses of the mobile spyware and tangible samples enabling\npublic scrutiny of the malware. Such public disclosures will not only enable greater\nanalyses and drive detection efforts but also impose development costs on vendors to\nconstantly evolve their implants.\n\n[© 2024 Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our Privacy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n[Policy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.12.21.Intellexa_Cytrox/Intellexa%20and%20Cytrox_%20From%20fixer-upper%20to%20Intel%20Agency-grade%20spyware.pdf"
    ],
    "report_names": [
        "Intellexa and Cytrox_ From fixer-upper to Intel Agency-grade spyware"
    ],
    "threat_actors": [],
    "ts_created_at": 1705457066,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1705377233,
    "ts_modification_date": 1705377233,
    "files": {
        "pdf": "https://archive.orkl.eu/95f848ff414c5e2288448815427b9f0019449ab9.pdf",
        "text": "https://archive.orkl.eu/95f848ff414c5e2288448815427b9f0019449ab9.txt",
        "img": "https://archive.orkl.eu/95f848ff414c5e2288448815427b9f0019449ab9.jpg"
    }
}