{
    "id": "796b0699-19ed-4d51-8dce-924daea6d508",
    "created_at": "2024-02-10T02:07:25.749061Z",
    "updated_at": "2025-03-27T02:05:25.813018Z",
    "deleted_at": null,
    "sha1_hash": "9aa551bb04e3ab66f34b87c5e479bdf0efd7df09",
    "title": "",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 440043,
    "plain_text": "##### 9 February 2024\n\n\n# Ministry of Defence of the Netherlands uncovers  COATHANGER, a stealthy Chinese FortiGate RAT\n\n##### This advisory is a joint publication of the MIVD and AIVD, the intelligence and\n\n security services of the Netherlands. An accompanying press release was\n\n published on the website of the Ministry of Defence of the Netherlands.\n\n\n### Overview\n\n− The Ministry of Defence (MOD) of the Netherlands\nwas impacted in 2023 by an intrusion into one of its\nnetworks. The effects were limited because of prior\nnetwork segmentation.\n− Incident response uncovered previously unpublished\nmalware, a remote access trojan (RAT) designed\nspecifically for Fortigate appliances. It is used as\nsecond-stage malware, and does _not_ exploit a new\nvulnerability. Intelligence services MIVD & AIVD refer\nto the malware as COATHANGER based on a string\npresent in the code.\n− The COATHANGER malware is stealthy and\npersistent. It hides itself by hooking system calls that\ncould reveal its presence. It survives reboots and\nfirmware upgrades.\n− MIVD & AIVD assess with high confidence that the\nmalicious activity was conducted by a statesponsored actor from the People’s Republic of China.\nThis is part of a wider trend of Chinese political\nespionage against the Netherlands and its allies.\n− MIVD & AIVD assess that use of COATHANGER may\nbe relatively targeted. The Chinese threat actor(s)\nscan for vulnerable edge devices at scale and gain\naccess opportunistically, and likely introduce\nCOATHANGER as a communication channel for select\nvictims.\n− Organizations that use FortiGate devices can check if\nthey are affected using the detection methods\ndescribed in section 4 of this report. Refer to section\n5 for advice for incident response.\n− Action that organizations can take to prevent future\nmalicious activity: for all internet-facing (edge)\ndevices, install security patches from the vendor as\nsoon as they become available. More preventive\nsteps are described in section 5 of this report.\n\n### Incident at the Ministry of Defence of the Kingdom of the Netherlands\n\nThe Ministry of Defence (MOD) of the Kingdom of the\nNetherlands was impacted in 2023 by an intrusion into\none of its networks. The effects of the intrusion were\n\n\nlimited because the victim network was segmented from\nthe wider MOD networks.\n\nThe victim network had fewer than 50 users. Its purpose\nwas research and development (R&D) of unclassified\nprojects and collaboration with two third-party research\ninstitutes. These organizations have been notified of the\nincident.\n\n**2.1** **Attribution**\n\nMIVD & AIVD assess with high confidence that the\nintrusion at the MOD, as well as the development of the\nmalware described in this report, was conducted by a\nstate-sponsored actor from the People’s Republic of\nChina.\n\nMIVD & AIVD emphasize that this incident does not stand\non its own, but is part of a wider trend of Chinese political\nespionage against the Netherlands and its allies.\n\n**2.2** **Actor activity**\n\nChinese threat actors are known to perform wide and\nopportunistic scanning campaigns for both published (nday) as well as unpublished (0-day) software\nvulnerabilities on internet-facing (edge) devices. They do\nso with a high operational tempo, sometimes abusing\nvulnerabilities on the day they are published.\n\nFor this incident, initial access occurred through\nexploitation of the [CVE-2022-42475 vulnerability for](https://www.fortiguard.com/psirt/FG-IR-22-398)\nFortiGate devices. The threat actor fired an exploit for this\nCVE using an obfuscated connection. The second-stage\nCOATHANGER malware described below was then\ndownloaded from another host, possibly a staging server.\n\nAlthough this incident started with abuse of CVE-202242475, the COATHANGER malware could conceivably be\nused in combination with any present or future software\nvulnerability in FortiGate devices. Post compromise, the\nactor conducted reconnaissance of the R&D network and\nexfiltrated a list of user accounts from the Active\nDirectory server. The impact of the intrusion was limited\nbecause the victim network was segmented from the\nwider MOD networks.\n\n\n-----\n\n##### 9 February 2024\n\n\n### The COATHANGER malware for FortiGate devices\n\nDuring an incident response case, the Netherlands’ MIVD\nfound a Remote Access Trojan (RAT) present on the\nFortiGate device that had been used for initial access.\n\nMIVD & AIVD refer to this RAT as COATHANGER. The\nname is derived from the peculiar phrase that the\nmalware uses to encrypt the configuration on disk: ‘She\n```\ntook his coat and hung it up’.\n\n```\nMIVD notified Fortinet PSIRT of the existence of the\nmalware and cooperated on publication of its [blogpost](https://www.fortinet.com/blog/psirt-blogs)\ndiscussing COATHANGER and three other implants.\n\nPlease note that second-stage malware like\nCOATHANGER are used in tandem with a vulnerability:\nthe malware is used for persistence to a victim network\nafter the actor gained access. Any published or\nunpublished vulnerability in a device can be used for\ninitial access to the network, after which COATHANGER is\nused as a backdoor into the network.\n\n**3.1** **Characteristics**\n\nThe COATHANGER malware provides access to\ncompromised FortiGate devices after installation. The\nimplant connects back periodically to a Command &\nControl server over SSL, providing a BusyBox reverse\nshell.\n\nNotably, the COATHANGER implant is persistent,\nrecovering after every reboot by injecting a backup of\nitself in the process responsible for rebooting the system.\nMoreover, the infection survives firmware upgrades. Even\nfully patched FortiGate devices may therefore be infected,\nif they were compromised\nbefore the latest patch was\napplied.\n\nFurthermore, COATHANGER\nis stealthy: it is hard to detect\nusing default FortiGate CLI\ncommands, because it hides\nitself by hooking most system\ncalls that could reveal its\npresence, such as `stat and`\n`opendir.` It does so by\nreplacing them for any\nprocess that is forced to load\n```\npreload.so.\n\n```\nNote that COATHANGER is\ndistinct from [BOLDMOVE,](https://www.darkreading.com/threat-intelligence/china-based-attacker-crafted-custom-malware-for-fortinet-zero-day)\n\n\nanother RAT targeting FortiGate devices.\n\nMIVD & AIVD assess that use of COATHANGER may be\nrelatively targeted. The Chinese threat actor(s) scan for\nvulnerable edge devices at scale and gain access\nopportunistically, but likely introduce COATHANGER as a\ncommunication channel for select victims.\n\nEarlier, the Dutch services found the COATHANGER\nimplant present on a network of a Western international\nmission, as well as a handful of other victims.\n\n**3.2** **Behavior**\n\nThis section describes components of the COATHANGER\nmalware and how they interact.\n\n_3.2.1_ **libpe.so**\n```\nlibpe.so is a linux shared object that extracts\n\n```\nCOATHANGER from a packed file located at\n```\n/tmp/packfile. As far as we are aware, this is the first\n\n```\nstage of COATHANGER.\n\nFirst `libpe.so` will check if the contents of\n```\n/proc/[pid]/cmdline starts with “ls” for its own\n\n```\nprocess. If this is the case it will continue with writing its\nPID to `/tmp/pepid` and `/sbin/init and create the`\n```\n/dev/null character file. Then it will create the install\n\n```\ndirectory /data2/.bd.key/.\n\nFrom the file `/tmp/packfile then extracts the files`\n```\nnewcli, httpsd, preload.so, authd, sh and writes\n\n```\nthem to /data2/.bd.key/. It extracts liblog.so and\nwrites it to the /lib/ directory. It extracts smartctl and\nwrites it to the /bin/ directory. Note that the name of\n**the hidden folder (.bd.key) varies over different**\n**samples!**\n\n\n-----\n\n##### 9 February 2024\n\n\n##### libpe.so writes “/lib/liblog.so” to\n```\n/etc/ld.so.preload. It then kills any /bin/miglogd\n\n```\nprocesses and waits for four seconds. Presumably\n```\nmiglogd will restart and be forced to use liblog.so. \n\n```\nIt then writes “/data2/.bd.key/preload.so” to\n##### /etc/ld.so.preload. This will result in\n```\n/data2/.bd.key/preload.so being used by any new\n\n```\nprocess.\n\n_3.2.2_ **/bin/smartctl**\n```\nsmartctl is a wrapper of /bin/sh.\n\n```\n_3.2.3_ **/data2/.bd.key/authd**\n```\nauthd is a binary that can inject a library into a running\n\n```\nprocess and then hook an existing function within that\nprocess with a new function from that library. It is used\nby newcli to hook the reboot function in the process with\nPID 1 with the newreboot function of preload.so.\n\nWithout arguments, it returns the following with its\nprocess name replacing %s:\n```\n usage: %s library-to-inject oldfunname newfunname\n pid\\n\n\n```\n_3.2.4_ **/data2/.bd.key/httpsd**\n```\nhttpsd is the main executable of the malware. It can\n\n```\nreceive and store a config, contact the C2 server and then\nprovide a shell to the actor. It is started by newcli.\n\n_3.2.5_ **Parameter r**\nIf httpsd is started with the parameter ‘r’, 56 bytes are\nread from the end of `/data2/.bd.key/preload.so`\nwhere the malware config is stored after initialization.\n\nIf a config is present, the ip, port and st value of the\nconfig are printed:\n\n```\nunlink(). If the filename is indeed httpsd, it will\n\n```\ndaemonize, set its GID to 90 (in order to be hidden by\n```\npreload.so) and fork itself.\n\n```\nThe child process of the fork will, after three minutes, try\nand decrypt a config from\n```\n/data2/.bd.key/preload.so. If successful, it will\n\n```\nconnect to the C2. Afterwards it will sleep for 4-7 times\nthe st value in seconds before decrypting and connecting\nagain. A default `st value of 0 is interpreted as 86400`\nseconds (24 hours).\n\n_3.2.8_ **C2 communication**\n\nCommunication to the C2 server is done over a TLS\ntunnel. COATHANGER first sends the following request to\nthe HTTP GET request to the C2 server:\n\n```\nGET / HTTP/2\\nHost: www.google.com\\n\\n\n\n```\n```\nip\\t %s\\nport\\t %d\\nst\\t %d\\n\n\n```\n\n_3.2.6_ **Parameter w**\nIf `httpsd is started with the parameters ‘w <ip>`\n```\n<port> <st>’, it will create a new config. If there already\n\n```\nis a config present in the last 56 bytes of\n```\n/data2/.bd.key/preload.so it will be replaced,\n\n```\notherwise it will be appended to the end of this file.\n\n_3.2.7_ **No parameters**\nIf httpsd is started without parameters, it will check if\nits filename is `httpsd, otherwise it will copy itself to`\n```\n/data2/httpsd and execute that file as /bin/httpsd.\n\n```\nAt the same time /data2/httpsd is set for removal with\n\n\nAfterwards a pseudo-terminal is opened with `openpty.`\nThe director side reads and writes to the C2 server, while\nthe performer side starts `/data2/.bd.key/sh as`\n```\n/bin/sh. This file is in fact busybox, a tool combining a\n\n```\nlot of unix functionality in a single file.\n\nThis provides an interface to `busybox running on the`\nvictims server to the C2 server.\n\n_3.2.9_ **/data2/.bd.key/newcli**\n```\nnewcli will use authd to ensure reboot persistence and\n\n```\nstarts httpsd. It is started by preload.so.\n\nFirst it will copy `/data2/.bd.key/preload.so to`\n```\n/lib/preload.so. It then forks. The child process will\n\n```\nexecute `/data2/.bd.key/authd as` `/bin/authd with`\nthe arguments “/lib/preload.so reboot newreboot\n```\n1”. This will inject /lib/preload.so into the process\n\n```\nwith PID 1 and replace its reboot function with the\n```\nnewreboot function of /lib/preload.so. It then exits.\n\n```\nThe parent process will wait for the child to exit. It then\nremoves `/lib/preload.so, daemonizes itself and`\ncopies /data2/.bd.key/httpsd to /data2/httpsd. It\nwill then start /data2/httpsd as /bin/httpsd and set\n```\n/data2/httpsd up for removal.\n\n```\n_3.2.10_ **/data2/.bd.key/preload.so**\n```\npreload.so is a linux shared object that handles much\n\n```\nof the persistence of COATHANGER, as well as hiding it\nfor any user of the system. It is loaded by libpe.so.\n\nFirst it will check if its process starts with “/bin/miglogd\n```\n1” or “ls /tmp/login1”. If this is the case it will write\n\n```\nits PID to `/tmp/pid` and start\n\n\n-----\n\n##### 9 February 2024\n\n\n##### /data2/.bd.key/newcli, effectively starting the\nmalware.\n\nThen it will check if the string “/init” is part of the\nprocess name. This is the case if preload.so is injected\ninto the process with PID 1 (see newcli), which starts\nwith “/sbin/init”. In that case preload.so will run a\nfunction called backup. This will read the contents of the\nfiles newcli, httpsd, preload.so, authd and sh from\nthe /data2/.bd.key/ folder and store them in memory.\n\nThe function `newreboot (replacing reboot for the`\nprocess with PID 1) calls a function called recover. This\nfunction writes the string\n“/data2/.bd.key/preload.so” into\n```\n/etc/ld.so.preload and restores all the files read into\n\n```\nmemory with the backup function back into the\n```\n/data2/.bd.key directory.\n\n```\nThis ensures persistence whenever the process with PID\n1 will call the function reboot (which happens on a\nreboot).\n```\npreload.so will also provide alternatives for a lot of\n\n```\nsystem calls in order to hide the COATHANGER files and\nrunning process. It will return with 0 or -1 if the GID of\nthe target is 90 (see httpsd) and also when the target\ncontains the string “ld.so.preload” or “.bd.key”.\nOtherwise the function is called as normal. The following\ntable gives an overview of the replaced functions.\n\n**System call** **Hides gid** **Hides “ld.so.preload”**\n**90** **and “.bd.key”**\n\n**__fxstat** X\n**__fxstat64** X\n**__lxstat** X X\n**__lxstat64** X X\n**__xstat** X X\n**__xstat64** X X\n**fdopendir** X\n**fstat** X\n**fstat64** X\n**lstat** X X\n**lstat64** X X\n**open** X X\n**opendir** X X\n**readdir** X X\n**readdir64** X X\n**rmdir** X X\n**stat** X X\n**stat64** X X\n**unlink** X X\n**unlinkat** X X\n\n\nSystem functions that are unaffected and used by the\nmalware itself are `access,` `fopen,` `fseek,` `fread and`\n```\nfclose.\n\n```\n_3.2.11_ **/data2/.bd.key/sh**\n```\nsh is a busybox binary. It is used by httpsd to provide\n\n```\nits functionality to the C2 server, see Section 3.3.2.\n\n_3.2.12_ **/lib/liblog.so**\n```\nliblog.so is a linux shared object that replaces the\nread(2) function. It will call the regular read(2)\n\n```\nfunction, but if the target of the read action is\n```\n/dev/fgtlog it will not return any data, effectively\n\n```\ndisabling reading from `/dev/fgtlog through` `read(2)`\nby processes that have this library loaded. It is used by\n```\nlibpe.so.\n\n```\n_3.2.13_ **/tmp/packfile**\n```\npackfile is a simple container file with the format\n[size:4][data:size] for multiple files. libpe.so\n\n```\nunpacks all COATHANGER files from this file. It contains\nthe files `newcli,` `httpsd,` `preload.so,` `authd,` `sh,`\n```\nliblog.so and smartctl.\n\n```\n**3.3** **Artifacts**\n\nThe COATHANGER malware drops the following files.\n```\n /bin/smartctl or /data/bin/smartctl\n /data2/.bd.key/authd\n /data2/.bd.key/httpsd\n /data2/.bd.key/newcli\n /data2/.bd.key/preload.so\n /data2/.bd.key/sh\n /lib/liblog.so\n\n```\nIt will in its operation copy some of those files to other\nlocations, but those are removed after use.\nNote that the name of the hidden folder (.bd.key) varies\nover different samples!\n\n|System call Hides gid Hides “ld.so.preload” 90 and “.bd.key”|Col2|Col3|\n|---|---|---|\n|__fxstat|X||\n|__fxstat64|X||\n|__lxstat|X|X|\n|__lxstat64|X|X|\n|__xstat|X|X|\n|__xstat64|X|X|\n|fdopendir|X||\n|fstat|X||\n|fstat64|X||\n|lstat|X|X|\n|lstat64|X|X|\n|open|X|X|\n|opendir|X|X|\n|readdir|X|X|\n|readdir64|X|X|\n|rmdir|X|X|\n|stat|X|X|\n|stat64|X|X|\n|unlink|X|X|\n|unlinkat|X|X|\n\n\n-----\n\n##### 9 February 2024\n\n\n### Detection methods\n\nSeveral methods have been identified to detect\nCOATHANGER implants. These include a YARA-rule, a\nJA3-hash, different CLI commands, file checksums and a\nnetwork traffic heuristic.\n\n**Note: The described detection methods should be seen**\nas independent methods which differ in approach and\nreliability. Some methods focus on general indicators of\ncompromise, whereas other methods are tailormade for\ndetecting COATHANGER.\n\n[IOCs and additional resources have been made available](https://github.com/JSCU-NL/COATHANGER)\n[on Github. Readers can use these tools to check for the](https://github.com/JSCU-NL/COATHANGER)\npresence of COATHANGER, in addition to the below\nmethods.\n\n**4.1** **YARA**\n\nAppendix 1 provides two YARA rules for detection on the\nCOATHANGER samples.\n\n**4.2** **JA3**\n\nThe COATHANGER implant communicates to the C2\nserver using TLS. This TLS connection is fingerprintable\nusing the following JA3-hash:\n\n\n_4.3.1_ **Deviating modification time**\nCheck if the files `/bin/smartctl` or\n##### /data/bin/smartctl exist using the following\ncommand:\n```\n fnsysctl ls -la /bin\n fnsysctl ls -la /data/bin\n\n```\nInspect the timestamps of `smartctl and other files in`\nthe same directory. Disregard timestamps of symlinks,\nbecause these are updated more frequently.\n\nIf smartctl was modified later than other non-symlink\nfiles, it is likely that the smartctl binary was tampered\nwith. This serves as a **first indication that the device**\nmay be infected by COATHANGER or other malware.\n\nNote: An earlier version of this report incorrectly stated\nthat it would be an indicator if smartctl is not a symlink.\n\n_4.3.2_ **TCP Sockets**\n\nThe following command shows a list of active TCP sockets\n(similar to netstat):\n\n```\ndiagnose sys tcpsock\n\n```\n```\n339f6adf54e6076d069dcaac54fddc25\n\n```\n\nThis JA3-hash is a fingerprint for connections originating\nfrom FortiGate devices that support all encryption and\nhashing algorithms for doing TLS.\n\nWhereas the far majority of TLS-connections use different\nparameters, the built-in logging functionality of FortiGate\ndevices seems to make use of identical TLS-parameters,\nleading to potential **false positive results from this JA3**\nhash.\n\nTherefore, traffic should be judged as legitimate (i.e., as\nfalse positive indicator of COATHANGER) if it originates\nfrom a FortiGate device and has:\n− port 541 or 514 as destination port and\n− an IP address belonging to Fortinet Inc. or a Fortinet\ndevice, such as a FortiManager as destination.\n\n**4.3** **CLI**\n\nWith access to the CLI of a FortiGate device, the presence\nof COATHANGER can be detected in three ways.\n\n**Tip: It is recommended to access the CLI using the web**\ninterface, instead of using the serial console port.\n\n\nWhenever the FortiGate device has internet access and\nthe malware is active (this may take some time after\nsystem startup), the outgoing connection will appear in\nthe results. This also displays the process number and\nname of one of the processes related to the infection, as\nwell as the IP address and listening port of the C2 server.\n\n**Note: Whenever the malware has not been able to**\nconnect with the C2 server, the TCP socket is not listed\nin the results. Therefore, the absence of a suspicious\nentry in the TCP socket list does not indicate that the\ndevice has not been infected!\n\nThe specific version of COATHANGER that this report\ndescribes uses the process name `httpsd to obfuscate`\nitself. Therefore, any suspicious outgoing connections to\nexternal IP addresses from a process called httpsd is a\n**strong indicator of the presence of COATHANGER:**\n```\n <device_IP>:<device_port>-><c2_IP>:<c2_port> >state=established err=0 socktype=1 rma=0 wma=0\n fma=0 tma=0 inode=<inode> process=<PID>/httpsd\n\n```\nNote that the process name (httpsd) may vary over\ndifferent samples of the malware!\n\n\n-----\n\n##### 9 February 2024\n\n\n_4.3.3_ **Unusual location in process maps of httpsd**\n\nThe specific version of COATHANGER that this report\ndescribes uses the process name `httpsd to obfuscate`\nitself.\n\nAll active processes can be listed using the following\ncommand:\n\n\nwhere COATHANGER is located is discovered. In this case,\nCOATHANGER is located in /data2/.bd.key.\n\n##### Note that this location is hidden from tools like fnsysctl. Therefore, running fnsysctl ls -la /data2/.bd.key will result in an error message stating ‘No such file or directory’.\n FortiGate devices support computing MD5 hashes of files using the following command:\n\n```\nfnsysctl ps\n\n```\n\n##### Running the following command returns all PIDs that are named httpsd:\n\n```\ndiagnose sys csum /data2/.bd.key/httpsd\n\n```\n```\ndiagnose sys process pidof httpsd\n\n```\n\nRunning the following command using the retrieved\nprocess IDs, yields process information for the processes\nnamed httpsd.\n\n**Tip: The PIDs of process that have suspicious outgoing**\nconnections (see Section 4.3.2) can be used as a starting\npoint for conducting this check.\n\n```\ndiagnose sys process dump <PID>\n\n```\n\nWhen the process has a GID set to 90, **the device is**\n**infected with COATHANGER.**\n\n\nSuch checksums can be used to uniquely identify files and\nverify whether they match the checksums of known\nmalicious COATHANGER binaries (see Section 4.4).\n\nNote however that multiple unique versions of\nCOATHANGER exist. Therefore, the absence of a\nchecksum in lists of known malicious files **does not**\n**indicate that the file is legitimate. Whenever patterns as**\ndescribed above are encountered, one should assume\nthat the device has been compromised.\n\n_4.3.4_ **Deleted /lib/preload.so in process maps of**\n##### PID1\nAs described in Section 3.2.3, preload.so is injected in\nPID 1 (initXXXXXXXXXXX) to gain persistence. This can\nbe detected by dumping the memory map of process 1\nusing the following command:\n\n```\nGid:  90   90   90   90\n\n```\n```\ndiagnose sys process dump 1\n\n```\n\nNote that the name of the hidden folder (.bd.key) varies\nover different samples. The process name (httpsd) may\nalso vary!\n\nWhen the process map includes deleted entries linked to\n##### /data2/httpsd or any entries to /data2/.bd.key/preload.so, the device is\n**infected with COATHANGER.**\n```\n Maps:\n 0040.....-0040..... .... 0000.... b3:.. .....    \n /data2/httpsd (deleted)\n [...]\n 7f90.....-7f90..... .... 0000.... b3:.. .....    \n /data2/.bd.key/preload.so\n [...]\n\n```\nWhen entries like the ones displayed above are found in\nthe process map, the full path of the hidden directory\n\n\nIf the memory map contains deleted entries linked to\n##### /lib/preload.so, this is a strong indicator of the\npresence of COATHANGER.\n```\n Maps:\n [...]\n 7f7ff.....-7f7ff..... .... 0000.... 00:.. .....    \n /lib/preload.so (deleted)\n [...]\n\n```\n**4.4** **Checksums**\n\nAppendix 2 lists checksums of files related to\nCOATHANGER. Please note that other versions of\nCOATHANGER with different checksums might exist.\nTherefore fuzzy hashes are provided for the file httpsd.\nThese allow for analysis of code similarity with potential\n(future) variants of COATHANGER.\n\n\n-----\n\n##### 9 February 2024\n\n\n**4.5** **Outgoing Connections**\n\nIt is not expected behavior of an isolated FortiGate device\nto connect to other domains than those related to Fortinet\nor domains/IPs listed in the configuration of the device.\n\nTherefore, spontaneous TCP SYN packets initiated by the\nFortiGate device are a **strong indicator that a**\n**FortiGate device has been compromised. Note that,**\nas described in 3.2.7, it might take several minutes,\nhours or even days for the beaconing to start.\n\nYou can investigate this by isolating a FortiGate device.\nAttach a second device to the WAN port of the FortiGate\ndevice and capture its traffic. Make sure that the second\ndevice is assigned the IP address of the configured (WAN)\ngateway, which causes the FortiGate device to ‘believe’ it\nhas network access.\n\n### Advice for mitigation and protection\n\n**5.1** **Incident response recommendations**\n\nIf you believe you have been affected by the\nCOATHANGER malware, assume the following:\n− The actor may have compromised other hosts\nreachable via the FortiGate appliance, as well as any\ndevices beyond these.\n− There is an increased likelihood of more targeted,\nhands-on-keyboard activity, i.e., the incident goes\nbeyond opportunistic targeting, especially for longer\ndwell times.\nWe recommend you take the following steps:\n1. Isolate the affected FortiGate devices immediately.\n2. Collect and review relevant logs, data and artifacts\nfrom the compromised devices. Extract a forensic\nimage from the device for further detailed analysis of\nthe attack.\n3. Consider contacting a third-party specialized in\nincident response. Assistance in following up on the\nincident helps ensure that the malicious actor is\neradicated from the network. This could avoid a new\ncompromise of the network from the same actor.\n4. [Report the incident to the NCSC of the Netherlands.](https://english.ncsc.nl/contact)\n\n**5.2** **Removing infections**\n\n_5.2.1_ **Wiping**\n\nThe only currently identified way of removing\nCOATHANGER from an infected FortiGate device involves\nformatting the device and reinstalling and reconfiguring\nthe device. This method should wipe all traces of\n\n\nCOATHANGER. Confirm afterwards that this was\nsuccessful using the detection methods.\n\n_5.2.2_ **Upgrades don’t resolve existing infections**\n\nThe malware survives a firmware upgrade, meaning that\n**upgrading firmware is not a solution for removing**\n**COATHANGER from a FortiGate device.**\n\n**5.3** **Preventive measures**\n\nTo limit risks from adversaries that make use of known\nvulnerabilities to gain initial access to a victim, it is\nimportant to have a robust level of basic information\nsecurity within your organization. Measures include the\nhardening, monitoring and response on internet-facing\ndevices.\n\nSpecific steps your organization can take to defend\nagainst threats similar to COATHANGER:\n− Install the most recent security patches from the\nvendor on internet-facing (edge) devices as soon as\nthey become available. Security patches from the\nvendor contain fixes for known vulnerabilities. In\nsome cases, an update for a vulnerability is not yet\navailable. Take mitigating measures to lower the risk\nof such vulnerabilities. Replace software and\nhardware that are no longer supported by the\nvendor.\n− Implement security best practices from the\nmanufacturer of the device.\n− Before adding or enabling features on internet-facing\ndevices, execute a risk analysis for the mandatory\nand/or needed features before enabling these\nfeatures on the device. Unnecessary features should\nbe disabled.\n− Restrict access to the internet from the internetfacing devices by disabling unnecessary services and\nports and disable access to the management\ninterface from the internet.\n− Monitor event logs for abnormal activity, such as\nlogons outside of working hours, unusual or\nunexpected external connections and unauthorized\nconfiguration changes on the device. Forward log files\nand store them in a separate secure network\nsegment to prevent tampering with the log files by a\nmalicious actor. Investigate unusual IP addresses,\nports and movement of data.\n\nFor more information, read the publication of the NCSC\nof the Netherlands about [the eight steps that every](https://english.ncsc.nl/publications/publications/2021/august/4/guide-to-cyber-security-measures)\n[organization should take to prevent incidents.](https://english.ncsc.nl/publications/publications/2021/august/4/guide-to-cyber-security-measures)\n\n\n-----\n\n##### 9 February 2024\n\n\n### Appendix 1: YARA rules\n```\nrule COATHANGER_beacon\n{\n  meta:\n    description = \"Detects COATHANGER beaconing code (GET / HTTP/2\\nHost: www.google.com\\n\\n)\"\n    malware = \"COATHANGER\"\n    author = \"NLD MIVD - JSCU\"\n    date = \"20240206\"\n  strings:\n    $chunk_1 = {\n      48 B8 47 45 54 20 2F 20 48 54\n      48 89 45 B0\n      48 B8 54 50 2F 32 0A 48 6F 73\n      48 89 45 B8\n      48 B8 74 3A 20 77 77 77 2E 67\n      48 89 45 C0\n      48 B8 6F 6F 67 6C 65 2E 63 6F\n    }\n  condition:\n    uint32(0) == 0x464c457f and filesize < 5MB and\n    any of them\n}\nrule COATHANGER_files \n{\n  meta:\n    description = \"Detects COATHANGER files by used filenames\"\n    malware = \"COATHANGER\"\n    author = \"NLD MIVD - JSCU\"\n    date = \"20240206\"\n  strings:\n    $1 = \"/data2/\"\n    $2 = \"/httpsd\"\n    $3 = \"/preload.so\"\n    $4 = \"/authd\"\n    $5 = \"/tmp/packfile\"\n    $6 = \"/smartctl\"\n    $7 = \"/etc/ld.so.preload\"\n    $8 = \"/newcli\"\n    $9 = \"/bin/busybox\"\n  condition:\n    (uint32(0) == 0x464c457f or uint32(4) == 0x464c457f)\n    and filesize < 5MB and 4 of them\n}\n\n```\n\n-----\n\n##### 9 February 2024\n\n\n### Appendix 2: Checksums\n\nNote: fuzzy hashes provided only for file httpsd, as it is deemed most likely to be unique.\n\n##### Filename Hash\n```\n libpe.so MD5 6c0adca790235445d07be98cd0f820b5\n           SHA1 cd6944926169f56ba78cdf15df6eea44b267bb51\n          SHA256 50451bb5b6d68115695a6cb277839a6dd2bad8f70bdb8b79670b18dcde188965\n smartctl MD5 205a8c6049061930490b2482855babcd\n           SHA1 77698f3f915e61852b6a79bbd85744d845b112c4\n          SHA256 4519baebba73827e2b33f36f835d6cb704755abf1312d8d197be635f4d9ffade\n authd MD5 9124ce75319514561156d2013fc9d3be\n           SHA1 b59d6ec835329ea8982fbbe87bb6b6132514c491\n          SHA256 f40c04fb9e2d4157a0bc753925dbc5f757feb77cdd22f90fedf3cc5e095143bc\n httpsd MD5 218a3525ab8e46f7afe252d050a86907\n           SHA1 44ed7bf2187c5f7442d8167ef009598dbbed60cb\n          SHA256 3ed99aad5922744b6a75ea90ea6ece81ba0d8eb9935aec38b897e44ac3b36c35\n           TLSH T1C7829327B751CA79C099F7B05CAF8AB07836B0F4E722621F2241A6797C647844F0F766\n          SSDEEP 192:GTHZecX8f8fUlxblVKmu6Wt9ygq1OtHCj31DM8MC3RUJET+mFG7vSif:kZe18fUl17Wl\n               qUtiL1h36iTnYj\n newcli MD5 ab89139e3d47fbaba2da33040da95200\n           SHA1 302743eaaa12018647b67b390a270ed98d3219d6\n          SHA256 2acc6a2a931db63fe3a875780f00192a60955c9794df68fe0ace0012d309b04f\n preload.so MD5 a62377c01935f366761846b5ceed5a49\n           SHA1 c259f0efa8ff0ea798a6a3dda22b8df62627405b\n          SHA256 1c437dc9e929669e5a65a1c70afb3107fba471afb9ad35e3848334c9332f2b59\n sh MD5 991461b86aebecfd096dc11ff2a04b4b\n           SHA1 dc5074340d4631bbf89adc122e8f1a3ca8d87564\n          SHA256 dcd9a5af1c6297ed1a66c851efa305000335d8ade068ba515125a6612f1d5300\n liblog.so / MD5 e24d14d3e6c6de0ed3db050dd5c935f0\n ld.so.preload SHA1 4226726bbdc05cc72e4fbb9bcef4a3b625e8a53b\n          SHA256 a79f80158ebbf9e34f6a7ec86b564de2fbee783fe6c1e20eefe2832226e2f827\n packfile MD5 201ee76e996846d5ea3fc03bac3273dd\n           SHA1 95c69c5a0751c0c2fc30e9ab5de0af5623b28da3\n          SHA256 4591b4fb1c93c27203b36c773597fd3f885338ad7641dcebf8ed2395acdf4a5f\n ld.so.preload MD5 9e333e7b57e5773a68df065477af33ae\n           SHA1 97621c409295341808d3697f54dc7b59ee5c42af\n          SHA256 80baadc163ab14128a8d3f65de093a400f5ae8e27ec979918cf065cea38af7f8\n unpack.so MD5 fb8bc202b1a6e1661fc6fb72a5b186d6\n           SHA1 dbd4726251d710cbaabbd3c345c72df431d7454b\n          SHA256 cb284b2e846181a6148059d592c9e6687567433810d1376a8e6f83cb5347c93b\n preload.so MD5 1bc945d6aa5d1b2ad7ccfd3fac82422d\n           SHA1 4e365312a06c3da747c7425612ef3fe360b52c05\n          SHA256 45fc722b9959384fa46be673c246c9fc94491898a9b1aef6b4a408d81e6fed0f\n newcli MD5 4d0d41064cb24d690226577fe2e52248\n           SHA1 ad60b32dce36f45e742db69d3f432c2456abf942\n          SHA256 47501cebf0b4ffbf5171d811c1517ea4fce178d925fcc4a3b3057be211add88b\n httpsd MD5 6a1e036b7b7fea19a68b9d05b54dbda6\n           SHA1 bd5911d32ddb7893b076ba2dc80b48b3875584df\n          SHA256 2a5ea4b166163bf028c4f3c8d4dc1cd6788e991b7300b5ea948e38ec4f6ac8fd\n packfile MD5 dba4fd981120faa360ac5df67d3566aa\n           SHA1 cfcae79765e169267445257417cbe06df7d336f4\n          SHA256 d2ba18a8b851b87163e42807a3541d17b272b679045d2de00364a718973cb5d4\n ld.so.preload MD5 98a4f08e6617e30ca8f8bd8e5b9177a5\n           SHA1 70581b5075d88223cfb830b28e823d2eecd92134\n          SHA256 bdf838ca2268c6a33718c3682a03118213652903568d66fba362d3ce18b4b4cf\n\n```\n|Filename Hash|Col2|Col3|\n|---|---|---|\n|libpe.so|MD5 SHA1 SHA256|6c0adca790235445d07be98cd0f820b5 cd6944926169f56ba78cdf15df6eea44b267bb51 50451bb5b6d68115695a6cb277839a6dd2bad8f70bdb8b79670b18dcde188965|\n|smartctl|MD5 SHA1 SHA256|205a8c6049061930490b2482855babcd 77698f3f915e61852b6a79bbd85744d845b112c4 4519baebba73827e2b33f36f835d6cb704755abf1312d8d197be635f4d9ffade|\n|authd|MD5 SHA1 SHA256|9124ce75319514561156d2013fc9d3be b59d6ec835329ea8982fbbe87bb6b6132514c491 f40c04fb9e2d4157a0bc753925dbc5f757feb77cdd22f90fedf3cc5e095143bc|\n|httpsd|MD5 SHA1 SHA256 TLSH SSDEEP|218a3525ab8e46f7afe252d050a86907 44ed7bf2187c5f7442d8167ef009598dbbed60cb 3ed99aad5922744b6a75ea90ea6ece81ba0d8eb9935aec38b897e44ac3b36c35 T1C7829327B751CA79C099F7B05CAF8AB07836B0F4E722621F2241A6797C647844F0F766 192:GTHZecX8f8fUlxblVKmu6Wt9ygq1OtHCj31DM8MC3RUJET+mFG7vSif:kZe18fUl17Wl qUtiL1h36iTnYj|\n|newcli|MD5 SHA1 SHA256|ab89139e3d47fbaba2da33040da95200 302743eaaa12018647b67b390a270ed98d3219d6 2acc6a2a931db63fe3a875780f00192a60955c9794df68fe0ace0012d309b04f|\n|preload.so|MD5 SHA1 SHA256|a62377c01935f366761846b5ceed5a49 c259f0efa8ff0ea798a6a3dda22b8df62627405b 1c437dc9e929669e5a65a1c70afb3107fba471afb9ad35e3848334c9332f2b59|\n|sh|MD5 SHA1 SHA256|991461b86aebecfd096dc11ff2a04b4b dc5074340d4631bbf89adc122e8f1a3ca8d87564 dcd9a5af1c6297ed1a66c851efa305000335d8ade068ba515125a6612f1d5300|\n|liblog.so / ld.so.preload|MD5 SHA1 SHA256|e24d14d3e6c6de0ed3db050dd5c935f0 4226726bbdc05cc72e4fbb9bcef4a3b625e8a53b a79f80158ebbf9e34f6a7ec86b564de2fbee783fe6c1e20eefe2832226e2f827|\n|packfile|MD5 SHA1 SHA256|201ee76e996846d5ea3fc03bac3273dd 95c69c5a0751c0c2fc30e9ab5de0af5623b28da3 4591b4fb1c93c27203b36c773597fd3f885338ad7641dcebf8ed2395acdf4a5f|\n|ld.so.preload|MD5 SHA1 SHA256|9e333e7b57e5773a68df065477af33ae 97621c409295341808d3697f54dc7b59ee5c42af 80baadc163ab14128a8d3f65de093a400f5ae8e27ec979918cf065cea38af7f8|\n|unpack.so|MD5 SHA1 SHA256|fb8bc202b1a6e1661fc6fb72a5b186d6 dbd4726251d710cbaabbd3c345c72df431d7454b cb284b2e846181a6148059d592c9e6687567433810d1376a8e6f83cb5347c93b|\n|preload.so|MD5 SHA1 SHA256|1bc945d6aa5d1b2ad7ccfd3fac82422d 4e365312a06c3da747c7425612ef3fe360b52c05 45fc722b9959384fa46be673c246c9fc94491898a9b1aef6b4a408d81e6fed0f|\n|newcli|MD5 SHA1 SHA256|4d0d41064cb24d690226577fe2e52248 ad60b32dce36f45e742db69d3f432c2456abf942 47501cebf0b4ffbf5171d811c1517ea4fce178d925fcc4a3b3057be211add88b|\n|httpsd|MD5 SHA1 SHA256|6a1e036b7b7fea19a68b9d05b54dbda6 bd5911d32ddb7893b076ba2dc80b48b3875584df 2a5ea4b166163bf028c4f3c8d4dc1cd6788e991b7300b5ea948e38ec4f6ac8fd|\n|packfile|MD5 SHA1 SHA256|dba4fd981120faa360ac5df67d3566aa cfcae79765e169267445257417cbe06df7d336f4 d2ba18a8b851b87163e42807a3541d17b272b679045d2de00364a718973cb5d4|\n|ld.so.preload|MD5 SHA1 SHA256|98a4f08e6617e30ca8f8bd8e5b9177a5 70581b5075d88223cfb830b28e823d2eecd92134 bdf838ca2268c6a33718c3682a03118213652903568d66fba362d3ce18b4b4cf|\n\n\n-----\n\n##### 9 February 2024\n\n```\n92cf72c7e85cc8657644b1e6ca9f8b1e\n9211b7cd8d4e8c2416e11a7794a37c31683c2be0\n01942a2b1b64446f8bf332004f8f875e66924a8405ac049fd0bb8d03c992fba6\n\n```\n|Filename Hash|Col2|Col3|\n|---|---|---|\n|sh|MD5 SHA1 SHA256|8d0fffd6b8b127e0972e281c85fbf11c ddd53cb70798ed530e6e5880bf0182607ca1eecd 218a64bc50f4f82d07c459868b321ec0ef5cf315b012255a129e0bde5cc80320|\n|preload.so|MD5 SHA1 SHA256|b37756edc2b756223acacf491be06d48 5edb7c6aa9cc3e441523a32e99e01f83e174949c 7b0709ec1f6e0eda3205a4ebdafbd2484f0590bbfe6ddd7c82d979f0f471e664|\n|newcli|MD5 SHA1 SHA256|c6eca7f3a99bff43be8ed5e2a2cd689f dda35b053f2072fdb30fe21ad3c136b5054817be 7fba5ab17972daa6250f3097c5254c4cf0e5e19889e10c02307f73c7481b4d5e|\n|httpsd|MD5 SHA1 SHA256|b9f2ae5082184fdc88b914ab136e54bd 0b209c3b1fd247c56dd003888214bf4ee9a872fc ce2d55a794bd7f41218796ef4a2cfab9707e8a5e8e971aa02ac8ff908b5f02f6|\n|authd|MD5 SHA1 SHA256|92cf72c7e85cc8657644b1e6ca9f8b1e 9211b7cd8d4e8c2416e11a7794a37c31683c2be0 01942a2b1b64446f8bf332004f8f875e66924a8405ac049fd0bb8d03c992fba6|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.ncsc.nl/binaries/ncsc/documenten/publicaties/2024/februari/6/mivd-aivd-advisory-coathanger-tlp-clear/TLP-CLEAR+MIVD+AIVD+Advisory+COATHANGER.pdf"
    ],
    "report_names": [
        "TLP-CLEAR+MIVD+AIVD+Advisory+COATHANGER.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1707530845,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/9aa551bb04e3ab66f34b87c5e479bdf0efd7df09.pdf",
        "text": "https://archive.orkl.eu/9aa551bb04e3ab66f34b87c5e479bdf0efd7df09.txt",
        "img": "https://archive.orkl.eu/9aa551bb04e3ab66f34b87c5e479bdf0efd7df09.jpg"
    }
}