{
    "id": "7991c0f3-6822-44d4-91ea-31b01a209e80",
    "created_at": "2022-10-25T16:48:21.524613Z",
    "updated_at": "2025-03-27T02:17:23.128724Z",
    "deleted_at": null,
    "sha1_hash": "99973488f071190f68c62602b55da4c1e6f5c339",
    "title": "North Korea's Lazarus APT leverages Windows Update client, GitHub in latest campaign",
    "authors": "MalwareBytes",
    "file_creation_date": "2022-02-21T05:04:30Z",
    "file_modification_date": "2022-02-21T05:04:30Z",
    "file_size": 2825010,
    "plain_text": "# North Korea’s Lazarus APT leverages Windows Update client, GitHub in latest campaign\n\n**blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-**\ncampaign\n\nThreat Intelligence Team January 27, 2022\n\n_This blog was authored by Ankur Saini and Hossein Jazi_\n\nLazarus Group is one of the most sophisticated North Korean APTs that has been active since 2009. The\ngroup is responsible for many high profile attacks in the past and has gained worldwide attention. The\nMalwarebytes Threat Intelligence team is actively monitoring its activities and was able to spot a new\ncampaign on Jan 18th 2022.\n\nIn this campaign, Lazarus conducted spear phishing attacks weaponized with malicious documents that\n[use their known job opportunities theme. We identified two decoy documents masquerading as American](https://www.clearskysec.com/wp-content/uploads/2020/08/Dream-Job-Campaign.pdf)\nglobal security and aerospace giant Lockheed Martin.\n\nIn this blog post, we provide technical analysis of this latest attack including a clever use of Windows\nUpdate to execute the malicious payload and GitHub as a command and control server. We have reported\nthe rogue GitHub account for harmful content.\n\n## Analysis\n\nThe two macro-embedded documents seem to be luring the targets about new job opportunities at\nLockheed Martin:\n\nLockheed_Martin_JobOpportunities.docx\nSalary_Lockheed_Martin_job_opportunities_confidential.doc\n\n\n-----\n\nThe compilation time for both of these documents is 2020-04-24, but we have enough indicators that\nconfirm that they have been used in a campaign around late December 2021 and early 2022. Some of the\nindicators that shows this attack operated recently are the domains used by the threat actor.\n\nBoth of the documents use the same attack theme and have some common things like embedded macros\nbut the full attack chain seems to be totally different. The analysis provided in the blog is mainly based on\nthe “Lockheed_Martin_JobOpportunities.docx” document but we also provide brief analysis for the\nsecond document (Salary_Lockheed_Martin_job_opportunities_confidential.doc) at the end of this blog.\n\nFigure 1: Document Preview\n\n### Attack Process\n\nThe below image shows the full attack process which we will discuss in detail in this article. The attack\nstarts by executing the malicious macros that are embedded in the Word document. The malware\nperforms a series of injections and achieves startup persistence in the target system. In the next section\nwe will provide technical details about various stages of this attack and its payload capabilities.\n\n\n-----\n\nFigure 2: Attack Process\n\n### Macros: Control flow hijacking through KernelCallbackTable\n\nFigure 3: Macros Snippet\n\n\n-----\n\nThe above code uses a very unusual and lesser known technique to hijack the control flow and execute\nmalicious code. The malware retrieves the address of the “WMIsAvailableOffline” function from\n_“wmvcore.dll”, then it changes the memory protection permissions for code in “WMIsAvailableOffline”_\nand proceeds to overwrite the code in memory with the malicious base64 decoded shell-code.\n\nAnother interesting thing happening in the above code is the control flow hijacking through the\n_KernelCallbackTable member of the PEB. A call to NtQueryInformationProcess is made with_\n_ProcessBasicInformation class as the parameter which helps the malware to retrieve the address of PEB_\nand thus retrieving the KernelCallbackTable pointer.\n\nFigure 4: KernelCallbackTable in memory\n\n_KernelCallbackTable is initialized to an array of callback functions when user32.dll is loaded into_\nmemory, which are used whenever a graphical call (GDI) is made by the process. To hijack the control\nflow, malware replaces the USER32!_fnDWORD callback in the table with the malicious\n_WMIsAvailableOffline function. Once the flow is hijacked and malicious code is executed the rest of the_\ncode takes care of restoring the KernelCallbackTable to its original state.\n\n### Shellcode Analysis\n\nThe shellcode loaded by the macro contains an encrypted DLL which is decrypted at runtime and then\nmanually mapped into memory by the shellcode. After mapping the DLL, the shellcode jumps to the entry\npoint of that DLL. The shellcode uses some kind of custom hashing method to resolve the APIs. We used\n[hollows_hunter to dump the DLL and reconstruct the IAT once it is fully mapped into memory.](https://github.com/hasherezade/hollows_hunter)\n\n\n-----\n\nFigure 5: API resolving\n\nThe hashing function accepts two parameters: the hash of the DLL and the hash of the function we are\nlooking for in that DLL. A very simple algorithm is used for hashing APIs. The following code block shows\nthis algorithm:\n```\ndef string_hashing(name):\n  hash = 0\n  for i in range(0, len(name)):\n    hash = 2 * (hash + (ord(name[i]) | 0x60))\n  return hash\n\n```\nThe shellcode and all the subsequent inter-process Code/DLL injections in the attack chain use the same\ninjection method as described below.\n\n### Code Injection\n\nThe injection function is responsible for resolving all the required API calls. It then opens a handle to the\ntarget process by using the OpenProcess API. It uses the SizeOfImage field in the NT header of the DLL to\nbe injected into allocated space into the target process along with a separate space for the init_dll\nfunction. The purpose of the init_dll function is to initialize the injected DLL and then pass the control\nflow to the entry point of the DLL. One thing to note here is a simple CreateRemoteThread method is used\nto start a thread inside the target process unlike the KernelCallbackTable technique used in our macro.\n\n\n-----\n\nFigure 6: Target Process Injection through CreateRemoteThread\n\n### Malware Components\n\n_stage1_winword.dll – This is the DLL which is mapped inside the Word process. This DLL is_\nresponsible for restoring the original state of KernelCallbackTable and then injecting\n_stage2_explorer.dll into the explorer.exe process._\n\nFigure 7: Restoring KernelCallbackTable to original state\n\n_stage2_explorer.dll – The winword.exe process injects this DLL into the explorer.exe process. With_\nbrief analysis we find out that the .data section contains two additional DLLs. We refer to them as\n_drops_lnk.dll and stage3_runtimebroker.dll. By analyzing stage2_explorer.dll a bit further we can_\neasily understand the purpose of this DLL.\n\n\n-----\n\nFigure 8: stage2_explorer main routine\n\nThe above code snippet shows the main routine of stage2_explorer.dll. As you can see it checks for the\nexistence of “C:\\Wíndows\\system32\\wuaueng.dll” and then if it doesn’t exist it takes its path to drop\nadditional files. It executes the drops_lnk.dll in the current process and then tries to create the\nRuntimeBroker process and if successful in creating RuntimeBroker, it injects stage3_runtimebroker.dll\ninto the newly created process. If for some reason process creation fails, it just executes\n_stage3_runtimebroker.dll in the current explorer.exe process._\n\n\n-----\n\n_drops_lnk.dll – This DLL is loaded and executed inside the explorer.exe process, it mainly drops the_\nlnk file (WindowsUpdateConf.lnk) into the startup folder and then it checks for the existence of\n_wuaueng.dll in the malicious directory and manually loads and executes it from the disk if it exists._\nThe lnk file (WindowsUpdateConf.lnk) executes “C:\\Windows\\system32\\wuauclt.exe”\n_/UpdateDeploymentProvider C:\\Wíndows\\system32\\wuaueng.dll /RunHandlerComServer. This_\nis an interesting technique used by Lazarus to run its malicious DLL using the Windows Update\nClient to bypass security detection mechanisms. With this method, the threat actor can execute its\nmalicious code through the Microsoft Windows Update client by passing the following arguments:\n/UpdateDeploymentProvider, Path to malicious dll and /RunHandlerComServer argument after the\ndll.\n\nFigure 9: Startup folder path\n\nFigure 10: WindowsUpdateConf lnk\n\n_stage3_runtimebroker.dll – This DLL is responsible for creating the malicious directory_\n(“C:\\Wíndows\\system32\\”) and then drops the wuaueng.dll in that directory, furthermore it sets\nthe attributes of the directory to make it hidden.\n\nFigure 11: stage3_runtimebroker main routine\n\n_wuaueng.dll – This is one of the most important DLLs in the attack chain. This malicious DLL is_\nsigned with a certificate which seems to belong to “SAMOYAJ LIMITED”, Till 20 January 2022, the\nDLL had (0/65) AV detections and presently only 5/65 detect it as malicious. This DLL has\nembedded inside another DLL which contains the core module (core_module.dll) of this malware\nresponsible for communicating with the Command and Control (C2) server. This DLL can be loaded\ninto memory in two ways:\n\n– If drops_lnk.dll loads this DLL into explorer.exe then it loads the core_module.dll and then\nexecutes it\n\n– If it is being executed from wuauclt.exe, then it retrieves the PID of explorer.exe and injects the\n_core_module.dll into that process._\n\n\n-----\n\nFigure 12: wuaueng.dll main routine\n\n### The Core module and GitHub as a C2\n\nRarely do we see malware using GitHub as C2 and this is the first time we’ve observed Lazarus leveraging\nit. Using Github as a C2 has its own drawbacks but it is a clever choice for targeted and short term attacks\nas it makes it harder for security products to differentiate between legitimate and malicious connections.\nWhile analyzing the core module we were able to get the required details to access the C2 but\nunfortunately it was already cleaned and we were not able to get much except one of the additional\n[modules loaded by the core_module.dll remotely (thanks to @jaydinbas who shared the module with us).](https://twitter.com/jaydinbas)\n\n\n-----\n\nFigure 13: core_module.dll C2 communication loop\n\nThere seems to be no type of string encoding used so we can clearly see the strings which makes the\nanalysis easy. get_module_from_repo uses the hardcoded username, repo_name, directory, token to\nmake a http request to GitHub and retrieves the files present in the “images” directory of the repository.\n\n\n-----\n\nFigure 14: get_module_from_repo function\n\nThe HTTP request retrieves contents of the files present in the repository with an interesting validation\nwhich checks that the retrieved file is a PNG. The file that was earlier retrieved was named “readme.png”;\nthis PNG file has one of the malicious modules embedded in it. The strings in the module reveal that the\nmodule’s original name is “GetBaseInfo.dll”. Once the malware retrieves the module it uses the\n_map_module function to map the DLL and then looks for an exported function named_\n_“GetNumberOfMethods” in the malicious module. It then executes GetNumberOfMethods and saves the_\nresult obtained by the module. This result is committed to the remote repo under the metafiles directory\nwith a filename denoting the time at which the module was executed. This file committed to the repo\ncontains the result of the commands executed by the module on the target system. To commit the file the\nmalware makes a PUT HTTP request to Github.\n\n### Additional Modules (GetBaseInfo.dll)\n\nThis was the only module which we were able to get our hands on. Only a single module does limit us in\nfinding all the capabilities this malware has. Also its a bit difficult to hunt for these modules as they never\nreally touch the disk which makes them harder to detect by AVs. The only way to get the modules would\nbe to access the C2 and download the modules while they are live. Coming back to this module, it has very\nlimited capabilities. It retrieves the Username, ComputerName and a list of all the running processes on\nthe system and then returns the result so it can be committed to the C2.\n\n\n-----\n\nFigure 15: GetBaseInfo module retrieving the information\n\n### GitHub Account\n\nThe account with the username “DanielManwarningRep” is used to operate the malware. The account\nwas created on January 17th, 2022 and other than this we were not able to find any information related to\nthe account.\n\nFigure 16: Account details from the token used\n\n\n-----\n\n## Second Malicious Document used in the campaign\n\n**Malicious Document – Salary_Lockheed_Martin_job_opportunities_confidential.doc**\n(0160375e19e606d06f672be6e43f70fa70093d2a30031affd2929a5c446d07c1)\n\nThe initial attack vector used in this document is similar to the first document but the malware dropped\nby the macro is totally different. Sadly, the C2 for this malware was down by the time we started analyzing\nit.\n\nThis document uses KernelCallbackTable as well to hijack the control flow just like our first module, the\ninjection technique used by the shellcode also resembles the first document. The major difference in this\ndocument is that it tries to retrieve a remote HTML page and then executes it using mshta.exe. The\nremote HTML page is located at https[:]//markettrendingcenter[.]com/member.htm and throws a 404\nNot Found which makes it difficult for us to analyze this document any further.\n\nFigure 17: Shellcode\n\n## Attribution\n\nThere are multiple indicators that suggest that this campaign has been operated by the Lazarus threat\nactor. In this section we provide some of the indicators that confirm the actor behind this attack is\nLazarus:\n\nUsing job opportunities as template is the known method used by Lazarus to target its victims. The\ndocuments created by this actor are well designed and contain a large icon for a known company\nsuch as LockHeed Martin, BAE Systems, Boeing and Northrop Grumman in the template.\nIn this campaign the actor has targeted people that are looking for job opportunities at Lockheed\nMartin. Targeting the defense industry and specifically Lockheed Martin is a known target for this\nactor.\nThe document’s metadata used in this campaign links them to several other documents used by this\nactor in the past.\n\n\n-----\n\nFigure 18: Attribution based on metadata\n\nUsing Frame1_Layout for macro execution and using lesser known API calls for shellcode execution\n[is known to be used by Lazarus.](https://research.nccgroup.com/2021/01/23/rift-analysing-a-lazarus-shellcode-execution-method/)\nWe also were able to find infrastructure overlap between this campaign and past campaigns of\nLazarus (Figure 19).\n\nFigure 19: Connection with past campaigns\n\n## Conclusion\n\nLazarus APT is one of the advanced APT groups that is known to target the defense industry. The group\nkeeps updating its toolset to evade security mechanisms. In this blog post we provided a detailed analysis\nabout the new campaign operated by this actor. Even though they have used their old job theme method,\nthey employed several new techniques to bypass detections:\n\nUse of KernelCallbackTable to hijack the control flow and shellcode execution\nUse of the Windows Update client for malicious code execution\nUse of GitHub for C2 communication\n\n\n-----\n\n## IOCs:\n\n**Maldocs:**\n0d01b24f7666f9bccf0f16ea97e41e0bc26f4c49cdfb7a4dabcc0a494b44ec9b\nLockheed_Martin_JobOpportunities.docx\n\n0160375e19e606d06f672be6e43f70fa70093d2a30031affd2929a5c446d07c1\nSalary_Lockheed_Martin_job_opportunities_confidential.doc\n\n**Domains:**\nmarkettrendingcenter.com\nlm-career.com\n\n**Payloads:**\n\nName Sha256\n\nreadme.png 4216f63870e2cdfe499d09fce9caa301f9546f60a69c4032cb5fb6d5ceb9af32\n\nwuaueng.dll 829eceee720b0a3e505efbd3262c387b92abdf46183d51a50489e2b157dac3b1\n\nstage1_winword.dll f14b1a91ed1ecd365088ba6de5846788f86689c6c2f2182855d5e0954d62af3b\n\nstage2_explorer.dll 660e60cc1fd3e155017848a1f6befc4a335825a6ae04f3416b9b148ff156d143\n\ndrops_lnk.dll 11b5944715da95e4a57ea54968439d955114088222fd2032d4e0282d12a58abb\n\nstage3_runtimebroker.dll 9d18defe7390c59a1473f79a2407d072a3f365de9834b8d8be25f7e35a76d818\n\ncore_module.dll c677a79b853d3858f8c8b86ccd8c76ebbd1508cc9550f1da2d30be491625b744\n\nGetBaseInfo.dll 5098ec21c88e14d9039d232106560b3c87487b51b40d6fef28254c37e4865182\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/iv0aw805g6rsqt0fqk4rm7wbujl90oev"
    ],
    "report_names": [
        "MalwareBytes_NorthKoreas-Lazarus-APT-Windows-Update-GitHub(01-27-2022)"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716501,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1645419870,
    "ts_modification_date": 1645419870,
    "files": {
        "pdf": "https://archive.orkl.eu/99973488f071190f68c62602b55da4c1e6f5c339.pdf",
        "text": "https://archive.orkl.eu/99973488f071190f68c62602b55da4c1e6f5c339.txt",
        "img": "https://archive.orkl.eu/99973488f071190f68c62602b55da4c1e6f5c339.jpg"
    }
}