{
    "id": "79b20407-cacb-46ca-a9e2-13cac3d3b592",
    "created_at": "2023-01-12T15:03:43.280873Z",
    "updated_at": "2025-03-27T02:15:46.098514Z",
    "deleted_at": null,
    "sha1_hash": "368f093da27e2b96c83756e4a0a23db418c24260",
    "title": "2016-09-07 - The Missing Piece – Sophisticated OS X Backdoor Discovered",
    "authors": "",
    "file_creation_date": "2022-05-02T17:08:06Z",
    "file_modification_date": "2022-05-02T17:08:06Z",
    "file_size": 1683134,
    "plain_text": "# A Fanny Equation: “I am your father, Stuxnet”\n\n**[securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787](https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/)**\n\nAt the Virus Bulletin conference in 2010, researchers from Kaspersky Lab partnered with\n[Microsoft to present findings related to Stuxnet. The joint presentation included slides dealing](https://www.virusbtn.com/conference/vb2010/abstracts/LastMinute8.xml)\nwith various parts of Stuxnet, such as the zero-days used in the attack.\n\nPerhaps the most interesting zero-day exploit from Stuxnet was the LNK exploit (CVE-20102568). This allowed Stuxnet to propagate through USB drives and infect even machines that had\nAutorun disabled.\n\nIt was discovered during the 2010 research into Stuxnet that the LNK exploit has earlier been\nused in another malware, supposedly a Zlob PE, that pointed to “fanny.bmp“.\n\nBack in 2010, very few people paid much attention to a piece of malware that used the LNK\nexploit prior to Stuxnet. Zlob is a large malware family and these kinds of crimeware-grade\nsamples are rarely of interest to researchers digging into zero-days and nation-state sponsored\noperations.\n\n[However, during our 2014 research into the Equation group, we created a special detection for the](https://securelist.com/equation-the-death-star-of-malware-galaxy/68750/)\ngroup’s exploitation library, codenamed “PrivLib”. To our surprise, this detection triggered a\nworm from 2008 that used the Stuxnet LNK exploit to replicate, codenamed Fanny.\n\n## What’s so Fanny?\n\n\n-----\n\nThis PrivLib-boosted Worm, which spreads using the Stuxnet LNK exploit and the filename\n“fanny.bmp” was compiled on Mon Jul 28 11:11:35 2008, if we are to trust the compilation\ntimestamp. It arrived in our December 2008 collection from the wild, so the compilation might\nvery well be correct.\n\n_“Fanny my name” could be an introductory message from the authors_\n\nThe 2008 “Fanny.bmp” Worm is detected by Kaspersky Lab products as Trojan**Downloader.Win32.Agent.bjqt. The malware includes the LNK exploit, which means that it**\nis a piece of malicious software that used the Stuxnet LNK exploit before Stuxnet!\n\n## The second Stuxnet exploit (MS09-025)\n\nIf one piece of malicious software that used an exploit from Stuxnet before Stuxnet is a good\ncatch, a second Stuxnet exploit makes it even more interesting.\n\nThe second exploit used to be a zero-day when Fanny was operational. This means that Fanny\nused two zero-days to replicate, both of which were later used by Stuxnet. The specific\nvulnerability used for privilege escalation was patched with MS09-025:\n\n_“The security update addresses these vulnerabilities by correcting the methods used for_\n_validating a change in specific kernel objects, for validating the input passed from user mode to_\n_the kernel, and for validating the argument passed to the system call. The security update also_\n_addresses a vulnerability by ensuring that the Windows kernel cleans up pointers under error_\n_conditions.”_\n\nThe same exploit was later used in an early Stuxnet module from 2009, which was embedded into\na large binary built using the Flame platform. That Stuxnet module, also known as\n“atmpsvcn.ocx” or Resource 207 was the technical link between Stuxnet and Flame. This story\n[has previously been covered in our post.](https://securelist.com/back-to-stuxnet-the-missing-link/33174/)\n\n#Fanny used two zero-days to replicate, both of which were later used by #Stuxnet #EquationAPT\n#TheSAS2015\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fa-fanny-equation-i-am-your-father-stuxnet%2F68787%2F&text=%23Fanny+used+two+zero-days+to+replicate%2C+both+of+which+were+later+used+by+%23Stuxnet+%23EquationAPT+%23TheSAS2015)\n\n\n-----\n\nWhile the vulnerability exploited by both the Stuxnet/Flame module and Fanny is the same, the\nimplementation of the exploit is different. The exploit in Stuxnet targets a specific OS version,\nwhile Fanny is designed to be universal and is capable of running on multiple platforms. It has a\nunique shellcode and exploit-triggering procedures for:\n\nWindows NT 4.0\nWindows 2000\nWindows XP\nWindows 2003\nWindows Vista, 2008 and possibly others from NT6.x family\n\nThe implementation of the exploit in Fanny is more complex than in Stuxnet: instead of running\njust one payload the authors created a framework to run as many payloads as they want by\nreplacing a system service call dispatcher nt!NtShutdownSystem with their own custom\npointer from theuser-space as shown in the next figure.\n\n_Fanny injected its own system service call dispatcher_\n\nThis enables a persistent trampoline from user-mode to kernel-mode. This feature was not\npresent in the Stuxnet module but there are other similarities. For instance, it seems that both the\ndevelopers of Stuxnet and of Fanny follow certain coding guidelines such as the usage of unique\nmagic numbers from each function call. Most of the returned results are simply disposed but they\nare still part of the code. This could be the remains of a debug version of the code which could\npotentially log every step in the code to ease the tracking down of an error while testing. In\ncomplex systems where kernel and user-space code is running with no interaction this seems a\nlogical and even essential method. Again, it’s implemented both in the Stuxnet code and in Fanny.\nSee next figure.\n\n\n-----\n\n_Stuxnet (on the left) and Fanny (on the right) using magic return values_\n\n## The Fanny Malware\n\nSo, what is Fanny essentially? It is a USB Worm with a sophisticated backdoor that uses the socalled “Stuxnet LNK vulnerability” to automatically execute from the USB drive even if Autorun\nhas been disabled. It can elevate privileges to the local System using kernel exploit and drops and\nregisters additional modules. It attempts to connect to a C&C server and deploys additional\ncomponents if connection is available. If not, it uses the USB drive as a carrier to\n**send/receive requests to and from the operator via a hidden storage area created in**\nraw FAT structure.\n\n\n-----\n\nTypically a victim plugs in a new USB drive and opens it with Windows Explorer. You can visually\nobserve the two stages of infection from the USB which take seconds to execute.\n\n\n-----\n\n## Fanny modules\n\n\n-----\n\nMD5 0a209ac0de4ac033f31d6ba9191a8f7a\n\nSize 184320\n\nType Win32 DLL\n\nInternal name dll_installer.dll\n\nCompiled 2008.07.28 08:11:35 (GMT)\n\nThis file is a DLL with two exports (to install and uninstall the malware). It contains a xorencrypted config in binary resource with number 101. The config determines malware behavior:\nthere is a command to deploy malware on the current system, URLs for the C&C server and local\nfilenames and paths used to install embedded malware components.\n\n_Fanny components inside the main executable_\n\nUpon starting it checks the following mutexes:\n\nGlobal\\RPCMutex\nGlobal\\RPCMutex\n\n\n-----\n\nWhere is a 1-byte long integer taken from the config. If any of these mutexes exist, the code\ndoesn’t run. It means that another instance of the same code is running. InstanceNum most likely\nidentifies a variant or generation of Fanny preventing the same version from reinfecting the\nsystem but allowing for different versions to run (possibly to enable enforced update of\ncomponents).\n\nThe module also checks another important byte in its configuration. This byte is a counter that is\ndecreased during successful system infection. When the counter reaches a minimal value of one\nthe module cleans up the USB drive and stops spreading the worm. In this way the attackers limit\nthe maximum length of the Worm’s killchain.\n\nIf the module is named “fanny.bmp” (the file name that Fanny uses to spread via USB drives)\nthe module self-installs from the USB drive.\n\nAs part of the initial infection process Fanny attempts to elevate current privileges if the user has\nno administrative rights on the current system. It uses a vulnerability patched by MS09-025 for\nthat purpose. Only if the elevation succeeds does the malware attempt to connect to the C&C\nserver using a URL which is stored in the config:\n\n**http://webuysupplystore[.]mooo[.]com/ads/QueryRecord200586_f2ahx.html**\n\nBelow is a sample request issued by the malware:\n\nGET /ads/QueryRecord200586_f2ahx.html HTTP/1.1\nUser-Agent: Mozilla/4.0 (compatible;)\nHost: webuysupplystore.mooo.com\n\nThe malware expects the C&C server to reply with an HTTP 200 response and append a 0x7fxored string that has a second stage URL. The second stage response may contain an executable\nfile body which is saved on disk and executed.\n\nThe C&C server is currently sinkholed by Kaspersky Lab, but according to our pDNS records it\npreviously pointed to the following IP address:\n\n**210.81.22.239**\n\n## IP information\n\n\n-----\n\nThe following describes the stages that were identified during the analysis of the initial and\nembedded components of Fanny.\n\n## Infection\n\nThe module searches for fanny.bmp in the root of disk drives starting from drive D: and copies\nit to the following locations:\n\n**%WINDIR%\\system32\\comhost.dll**\n**%WINDIR%\\system32\\mscorwin.dll**\n\nWhy does Fanny make two copies of itself? Actually, there is a minor difference between these two\nfiles. Fanny patches its config in the resource section of one of the files (comhost.dll). The patched\ndata is the value of remained maximum length of the Fanny killchain. “mscorwin.dll” is the\noriginal file copied as-is from the removable drive. So far, one copy is used for infecting other USB\ndrives, the other is loaded on the system boot.\n\nIt also copies all *.lnk files from the USB drive to “%WINDIR%\\system32\\” in order to reuse\nthem when infecting other attached USB drives. Note that there may be more than one LNK file,\nbecause each LNK contains a distinct path to the DLL which gets loaded. As far as the letter of a\nnew drive on the target system is unknown, Fanny uses several LNKs for the most common drive\nletters. This method was improved later in Stuxnet, which used a relative DeviceID-dependent\npath to the USB drive. However, even that method required several LNK files (up to four) because\nof different relative paths on different versions of Windows, but that’s far fewer than an almost\nfull set of letters from the Latin alphabet.\n\n## Persistence\n\nFanny creates the following registry value to achieve persistence:\n**HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\Driver.**\n\nThis is not a common way to make code start automatically on a system boot and it’s extremely\ninvasive, but it guarantees that the module is loaded in the address space of each process in the\nsystem, including some critical processes such as lsass.exe and services.exe running as SYSTEM\nuser.\n\n\n-----\n\nWhen the module is loaded it checks other values that start from “filter” in the same registry key,\ni.e.:\n\n**HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\filter2**\n**HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\filter3**\n**HKLM\\System\\CurrentControlSet\\Control\\MediaResources\\acm\\ECELP4\\filter8**\n\nThe values contain a hosting process name and a path to a DLL or EXE file. If the current process\nname contains the value set as hosting process, then the module loads a DLL or starts a new\nprocess (in case of EXE file) depending on target file extension.\n\nThis is a map of the processes and modules that are used in Fanny:\n\n**Process** **Fanny module** **Short Description**\n\nwinlogon c:\\windows\\MSAgent\\AGENTCPD.DLL USB backdoor\n\nexplorer c:\\windows\\system32\\shelldoc.dll Windows Explorer rootkit\n\nlsass c:\\windows\\system32\\mscorwin.dll USB worm\n\n## USB Worm\n\nThe code of the actual Worm is part of %WINDIR%\\system32\\comhost.dll export with\nordinal 4 (name of export is “dll_installer_4“). The DLL is a modified next-generation Worm\nwhich is copied to every attached USB drive with all related LNK files stored in\nWindows\\System32 directory. This module is distributed by mscorwin.dll which is part of the\nlsass system process.\n\n\n-----\n\n## Windows Explorer Rootkit\n\nThe rootkit functionality is provided by a shelldoc.dll file loaded in the Windows Explorer\nprocess. It hides some Fanny-related files (LNK-files and fanny.bmp) in Windows Explorer by\nremoving them from the list of items in the foreground window that uses SysListView32 control\n(normally Windows Explorer window).\n\nSome screenshots with disappearing files were demonstrated previously, however sometimes this\napproach may raise suspicions. Here is what it looks like if the user opens a system32 directory\nwith Explorer:\n\n_Seven Fanny-related file icons disappeared in Windows Explorer_\n\nApparently, it looks as if some of the file icons were cut off. In addition some of standard\ndirectories seem to be missing due to a bug in the rootkit code. It appears as if this component\nwas not tested properly by the authors.\n\n## Masquerade Mode On\n\nThere is an interesting part of the code in USB Backdoor DLL which at first glance doesn’t make\nmuch sense. It takes some hardcoded constants and generates a random value which is saved to a\nregistry key.\n\n\n-----\n\n_Fanny generates random values that are saved to the registry_\n\nThen it moves the current executable which is hosting the DLL to\n**c:\\windows\\system32\\msdtc32.exe. After that the executable path is appended to**\n**HKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell registry**\nvalue which makes this executable run on system boot.\n\nThe trick to mimic the behavior of traditional malware was used to avoid revealing further secret\nactivities #Fanny\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fa-fanny-equation-i-am-your-father-stuxnet%2F68787%2F&text=The+trick+to+mimic+the+behavior+of+traditional+malware+was+used+to+avoid+revealing+further+secret+activities+%23Fanny)\n\nThis may look like a traditional way for malware to add itself to autostart, but don’t be fooled by\nthat. The purpose of this move is to make certain automated systems and software, such as those\nbased on sandboxes and emulators, believe that they have caught some known malware and not\nto let it run further. It seems that the component is so unique that the authors decided to avoid\nthe risk of looking even more suspect. It might seem a paradox, but the authors prefer this code to\nbe detected as malware if someone is checking it. The trick is to mimic the behavior of some\ntraditional cybercriminal malware, a bot, and get detected as soon as possible, thereby not\nrevealing any further secret activities. Considering that this component was spreading via USB\ndrives and could pop up on many systems, discovering it as a traditional bot would put it in lower\nrisk zone and as a result the malware would probably end up being deleted without proper\nanalysis.\n\nThis might explain why this code was detected as a variant of Zlob malware in the past and no one\npaid proper attention to it.\n\n## USB Backdoor\n\n\n-----\n\nOne of the modules, agentcpd.dll, is a backdoor that was designed to work as an advanced\nreconnaissance tool for air-gapped computers that are normally used in highly secure facilities.\nThe backdoor waits for a USB drive to be plugged in and if that’s a new disk, it instantly allocates\nsome space for a hidden container using its own FAT16/FAT32 filesystem driver.\n\nThis is what the FAT root directory looks like before and after plugging a USB drive into an\ninfected machine:\n\n_Hexdump of raw disk partition before and after plugging into an infected machine_\n\nOn top of this hexdump the drive label “MYDRIVE” can be found (corresponding hex bytes are\nunderlined with green). It is followed by a single byte flag value (0x08 in hex) which, according\nto Microsoft, means ATTR_VOLUME_ID. Each entry in this root directory table is 32-bytes\nlong.\n\nSubdirectory entries such as Pictures, Music, Documents and Work occupy 63 bytes, because of\nthe long filename FAT feature. There are two variants of subdirectory names – short and long. A\nsubdirectory entry uses a flag 0x10 following the short directory name, which, according to\nMicrosoft, means ATTR_DIRECTORY.\n\nThe last record inserted by Fanny (highlighted in red) uses an invalid directory name and a flag\n**0x18, which combines ATTR_VOLUME_ID and ATTR_DIRECTORY. This combination of**\nflags is not documented according to current FAT specifications and the whole entry is therefore\nignored by filesystem drivers as if it were a data corruption or a bad block. As a result this entry is\nnot visible in Windows, Mac OS and Linux and probably all other implementations of FAT driver.\n\nIt’s possible that #Fanny was used to map some of the future targets of #Stuxnet #EquationAPT\n#TheSAS2015\n\n[Tweet](https://twitter.com/share?url=https%3A%2F%2Fsecurelist.com%2Fa-fanny-equation-i-am-your-father-stuxnet%2F68787%2F&text=It%26%238217%3Bs+possible+that+%23Fanny+was+used+to+map+some+of+the+future+targets+of+%23Stuxnet+%23EquationAPT+%23TheSAS2015)\n\nWhile Fanny doesn’t rigorously protect data in hidden storage (it doesn’t mark the allocated space\nas bad blocks, probably to avoid attention), it changes the filesystem driver hint value indicating\nwhere to look for the next free cluster. In this way it reserves disk space of approximately 1Mb in\nsize to use for a hidden storage.\n\n\n-----\n\nWhen Fanny detects a new USB drive, with the help of its own FAT driver it looks into the root\ndirectory and locates the entry which starts with magic value 51 50 40 98 (see above). It then\nuses the offset which follows the flag value of 0x18. On the figure above it is set to 0x001e9c00.\nThis offset on the same USB disk will have another magic value D0 CF CE CD serving as a\nmarker for the beginning of the hidden storage:\n\n_Hexdump of Fanny hidden storage with list of running processes_\n\nOnce Fanny has allocated space for hidden storage it populates the storage with basic information\nabout the current system: i.e. OS Version, Service Pack number, computer name, user name,\ncompany name, list of running processes, etc.\n\nThis secret storage is also used to pass commands to computers that are not connected to the\nInternet. According to Fanny code, the container may carry additional components and internal\ncommands: such as to copy certain file from the local filesystem to the USB drive (locations are\ndefined as parameters, the file is set hidden and system file attributes), or to update the\nconfiguration block. It uses RC4 with the following hard-coded key to protect critical information:\n\n**18 05 39 44 AB 19 78 88 C4 13 33 27 D5 10 6C 25**\n\nWhen the USB drive travels to another infected computer connected to the Internet it can be used\nto carry important files and provide a way to interact with the operator. This simple and\nextremely slow method of communication is not used by traditional cybercriminals, that is why\nthe whole code looks like a toolkit for professional cyberespionage. This component is one of the\nrare malware samples from a new class of malware called USB-Backdoors.\n\n\n-----\n\nIf you find this or a similar code of USB-Backdoor on some of your systems this is an indicator of\na professional cyberattack.\n\n## Sinkholing and victim statistics\n\nWe sinkholed the Fanny C&C server and collected victim statistics, shown below. In total, we\nobserved over 11,200 unique IPs connecting to the sinkhole server over a period of five months:\n\nAt the moment, the vast majority of victims are located in Pakistan (a whopping 59.36%).\nIndonesia and Vietnam follow at great distance, with 15.99% and 14.17% respectively. The\ninfection numbers in other countries are probably too small to be relevant.\n\nOf course, this could raise the question: was Pakistan the true target of Fanny? To be honest, we\ndo not know. The current infection situation might be different from what it was in 2008-2010.\nConsidering that there are still over ten thousand victims worldwide, the number back in 2009\nmight have been much, much higher – perhaps even as high as 50,000 infections. It may be\nrelevant that Pakistan is a top target for the Equation group’s other malware, along with Russia\nand Iran.\n\n## Conclusion\n\nWith Fanny, we begin yet another chapter in the story of Stuxnet, the Equation Group and Flame.\nCreated in 2008, Fanny used two zero-day exploits. These two were added to Stuxnet in June\n2009 and March 2010. Effectively, it means that the Equation group had access to these zero-days\n(and others) years before the Stuxnet group did.\n\nWhile the true target of Fanny remains unknown, its unique capability to map air-gapped\nnetworks and communicate via USB sticks indicate a lot of work went into gaining the ability to\naccess these air-gapped networks. As a precursor for the versions of Stuxnet that could replicate\n\n\n-----\n\nthrough the network, it s possible that Fanny was used to map some of the future targets of\nStuxnet.\n\nAnother unusual fact is the very high number of infections coming from Pakistan. Since Fanny\nspreads only through USB sticks, which is rather slow, this indicates that the infection began in\nPakistan, possibly before many other countries.\n\nWas Fanny used to map some highly sensitive networks in Pakistan, for an unknown purpose, or\nwas it used in preparation for Stuxnet? Perhaps time will tell.\n\nA Fanny Equation: “I am your father, Stuxnet”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Stuxnet/A Fanny Equation - I am your father Stuxnet.pdf"
    ],
    "report_names": [
        "A Fanny Equation - I am your father Stuxnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535823,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1651511286,
    "ts_modification_date": 1651511286,
    "files": {
        "pdf": "https://archive.orkl.eu/368f093da27e2b96c83756e4a0a23db418c24260.pdf",
        "text": "https://archive.orkl.eu/368f093da27e2b96c83756e4a0a23db418c24260.txt",
        "img": "https://archive.orkl.eu/368f093da27e2b96c83756e4a0a23db418c24260.jpg"
    }
}