{
    "id": "79c010a9-f8cb-452f-99d4-0c2e85bec3d5",
    "created_at": "2023-01-12T15:00:59.171429Z",
    "updated_at": "2025-03-27T02:09:18.11395Z",
    "deleted_at": null,
    "sha1_hash": "5bfda427f09ae971d67ee30b9eb70738ab1afa0a",
    "title": "2021-10-11 - Moving Left of the Ransomware Boom",
    "authors": "",
    "file_creation_date": "2022-05-28T03:19:48Z",
    "file_modification_date": "2022-05-28T03:19:48Z",
    "file_size": 981735,
    "plain_text": "# Moving Left of the Ransomware Boom\n\n**[accenture.com/us-en/blogs/cyber-defense/moving-left-ransomware-boom](https://www.accenture.com/us-en/blogs/cyber-defense/moving-left-ransomware-boom)**\n\n_To foster better collaboration and cyber ground truth, VMware and Accenture’s Cyber_\n_Defense group teamed up to deliver relevant security research. Our goal is to expose_\n_criminals’ tactics, techniques, and procedures (TTPs) and thereby help security teams better_\n_focus their prevention, detection and response programs._\n\nRansomware isn’t new—in fact, it’s over 30 years old. Attacks date back as far as 1989 and\nhave been the most pervasive cyber threat since 2005, with a dramatic spike in recent years\nthat continues to increase. In fact, Cybersecurity Ventures predicts that the damage caused\n[by ransomware could cost up to $265 billion by 2031, making it ever more important for](https://cybersecurityventures.com/global-ransomware-damage-costs-predicted-to-reach-250-billion-usd-by-2031/)\ncompanies to prepare their defenses and understand ways to stop the attackers prior to\nransomware deployment.\n\n<<< Start >>>\n\n## Time-to-Ransom (TTR)\n\nTime-to-Ransom refers to the amount of time from when the threat actor gains initial access\ninto a network to the time the threat actor deploys the ransomware. This time can range from\nhours to days, or even months.\n\n<<< End >>>\n\n\n-----\n\nThe old quote defenders have to be right 100% of the time proves to be untrue. The reality\nis that in most cases there are several opportunities for teams to disrupt the criminal's\nbehavior prior to the ransomware executing. This blog will examine the common tactics that\ncybercriminals use to infiltrate and move around a company network prior to ransomware\ndeployment, paying close attention to the time-to-ransom (TTR). Each stage of the attacker\nlifecycle offers unique opportunities to detect and remove them from the network prior to\nsignificant and costly damage. It only takes one mitigation to break the criminals’ kill chain.\n\n**Cyber Extortion at scale is big business and business is good for criminals**\n\nAs ransomware-as-a-service (RaaS) explodes in popularity on the crimeware forums,\ncybercriminals are finding new and unique ways to deploy ransomware across organizations.\nRansomware groups may be recruiting insiders or affiliates specializing in a specific part of\nthe attack chain to increase the stealth of their attack while employing multiple extortion\ntactics by first stealing company data before locking it up. According to Accenture incident\nresponders, data extortion was confirmed in about 30% of 10 cases they analyzed between\nJune 2020 and June 2021.\n\nAs ransomware groups become increasingly capable, TTR can decrease. In contrast,\nhowever, if the actor combines data extortion with data destruction, the on-network\nrequirements to steal sensitive data require greater TTR and additional on-host activities,\nproviding opportunities for detection. According to Accenture incident response investigators,\nin analyzed cases over the past year, the TTR has been as low as 2.5 hours and as high as\nsix months, with Carbon Black estimating that the TTR is on average between two and four\ndays. The longer the TTR, the more opportunity there is for an organization to detect and\nrespond to an attack prior to data destruction.\n\n**Methodology**\n\nAccenture Cyber Defense utilized data from over 10 recent cyber investigations, forensics\nand response (CIFR) ransomware incident response investigations, combined with\nAccenture’s Cyber Threat Intelligence’s (ACTI) dark web monitoring to identify popular preransomware deployment network activities. Additionally, VMware Carbon Black leveraged\ndata from the Carbon Black Cloud where the product suite can successfully prevent the\nexecution of ransomware, as well as the pre-execution TTPs that were observed prior to\nransomware payload execution.\n\nOur threat research uses MITRE ATT&CK® – a comprehensive framework to document\nadversary TTPs - to focus on TTPs relevant to the initial stages of infection that precede a\nransomware attack. We will also be focused on the TTR to help teams better create\nplaybooks and responses when an infection occurs.\n\n**MITRE ATT&CK Stages**\n\n\n-----\n\n**Initial Access**\nAccenture and Carbon Black have identified remote desktop protocol (RDP) vulnerabilities\nas a primary initial access method for ransomware actors. RDP is exploited in roughly half of\nthe documented attacks that are escalated to VMware’s Threat Analysis Unit (TAU). In many\nof these attacks there is a 48-to-92-hour period between the initial observed RDP access\nand the ransomware portion of the attack. Similarly, Accenture has found RDP vulnerabilities\nto be a preferred method for several ransomware groups. For example, the ransomware\ngroup Avaddon appears to prefer exploiting RDP vulnerabilities as a breach methodology.\nThis group has advertised specific interest in acquiring specialists who can develop network\naccess through compromised RDP sessions or virtual private network (VPN) connections.\n\nThe second-greatest portion of the remaining cases studied by TAU initially start with a social\nengineering element like phishing emails. These emails will typically contain an initial\ndropper which is either an office document or an executable concealed in an archive format,\n[like a zip file. The initial dropper will either download a first-stage payload like IcedID, SdBot,](https://blogs.vmware.com/security/2021/07/icedid-analysis-and-detection.html)\nTrickbot, or Emotet or leverage PowerShell to execute a Cobalt Strike cradle. These tools\nhelp the threat actor gain unauthorized access to the remote systems and can perform a\nvariety of functions including, downloading and executing additional files, credential\nharvesting, and lateral movement operations.\n\nThe remainder are known vulnerabilities being exploited combined with lateral movement.\n\n**Execution**\nAccenture Security and VMware TAU continue to observe ransomware actors leverage\nliving-off-the-land techniques in conjunction with off-the-shelf tools like Cobalt Strike, Koadic,\nPowerShell Empire, and Metasploit. Because of the effectiveness of tools like Cobalt Strike,\nas well as the anonymity that their popularity provides, many actors have adopted them into\ntheir overall attacker portfolios.\n\nPrior to bans on ransomware advertisements by many forums, dark web findings indicated\nthat at least Ragnar Locker and REvil operators had actively recruited hackers experienced\nwith commodity tools including the Cobalt Strike platform; additionally, actors regularly sell or\nrelease cracked versions of Cobalt Strike, lowering the barrier to entry for this versatile tool.\nCobalt Strike Beacon, a penetration testing product, provides vast functionality against the\nhost, including privilege escalation, file transfer, command execution, port scanning and\nlateral movement, which is why it is an increasingly popular tool for ransomware operations.\n\n**Persistence**\nVMware TAU and the Carbon Black Cloud identified attackers using PowerShell to modify\nwindows registry and startup files as the predominate method of gaining persistence on\nendpoints observed in the bar graph below. This finding is consistent with observations by\nAccenture’s CIFR team. For easiest viewing, the graph below represents a two-week period,\nhowever, the trends have been consistent over time. Based on Windows Antimalware Scan\n\n\n-----\n\nInterface (AMSI) data that Carbon Black monitors, the two largest spikes are specifically from\nPowerShell modifying the startup folders, in purple, and PowerShell modifying different\nregistry run keys, in green.\n\n<<< Start >>>\n\nSource: Carbon Black AMSI data\n\n<<< End >>>\n\nWhen looking at non-AMSI data, the single largest persistence method is scheduled tasks; in\nblue in the graph below.\n\n<<< Start >>>\n\n\n-----\n\nSource: Carbon Black AMSI data\n\n<<< End >>>\n\nThe commodity trojans prevalent in ransomware operations, like Trickbot, IcedID, and\nEmotet, have the capability to create scheduled tasks for persistence.\n\n**Privilege Escalation / Credential Access**\n\nPrivilege Escalation / Credential AccessPrivilege escalation and credential access are\npriorities for ransomware operators, as these tactics often enable additional actions against\nthe network, such as lateral movement or disabling endpoint monitoring software. Credential\nharvesting is one of the tactics used to ensure secondary extortion methods have higher\nefficacy. This allows attackers to gain access to business communication channels like email,\nSlack and Microsoft teams, which can make real-time response communications a challenge\nduring an outbreak.\n\nAttackers are using Mimikatz predominately to harvest credentials. The execution of signed\nMimikatz binaries remains the highest detection related to credential harvesting that VMWare\nhas historically observed. This is followed by PowerShell running Mimikatz and credential\ntheft using NTDSutil. Commodity tools, such as Meterpreter, have built-in techniques to try to\nobtain system-level administration privileges.\n\n<<< Start >>>\n\n\n-----\n\nSource: Carbon Black AMSI data\n\n<<< End >>>\n\n**Lateral Movement**\n\nLateral movement is a key component of an effective attack and ransomware groups can\nuse port scans and the lateral movement capabilities embedded in commodity malware and\ntools. As the use of Cobalt Strike increases among ransomware operators, Accenture\nSecurity and Carbon Black have, in turn, observed attackers use Cobalt Strike Beacon\ncapabilities, such as named pipes over Server Message Block (SMB) and WinRM to move\nlaterally in targeted networks.\n\n<<< Start >>>\n\n\n-----\n\nSource: Carbon Black AMSI data\n\n<<< End >>>\n\n**Defense Evasion**\n\nRansomware threat actors are keenly aware of being exposed through antivirus or other\nendpoint defense detections and would proactively try to nullify these tools with antivirus\nblocking tools or by uninstalling antivirus from a privileged account.\n\n<<< Start >>>\n\nExample of an Actor using PowerShell to try and uninstall Windows Defender\n\n<<< End >>>\n\n\n-----\n\nCarbon Black monitors numerous techniques that fall into the defense evasion category. The\ngraph below is data solely from AMSI-based detections; historically attempting to unload\nAMSI via reflection is the most popular PowerShell defense evasion technique observed.\n\n<<< Start >>>\n\nSource: Carbon Black AMSI data\n\n<<< End >>>\n\nIn other cases, ransomware operators will try to work around endpoint defenses. For\nexample, in one ransomware attack at a health and public services company, the threat\nactors executed a Cobalt Strike payload. However, the execution sequence was detected by\nWindows Defender and quarantined accordingly. After about two days of triggering Windows\nDefender detections, the threat actor pivoted to the use of another open-source tool called\n[Koadic. This tool is also a Windows Post-Exploitation rootkit that utilizes Windows Script](https://github.com/zerosum0x0/koadic)\nHost; however, it creates small payloads executed in memory which can be less noisegenerating. Throughout the engagement, the threat actor continued to monitor the endpoint\ndetections and would pivot to new tools or tactics in an attempt to avoid them.\n\n\n-----\n\n**Command and control**\nOften ransomware actors achieve command and control in one of two ways. First, the actor\nwill leverage compromised credentials in combination with exposed RDP. Second, the\nattackers once again leverage the capabilities within Cobalt Strike to communicate externally.\nIn one CIFR investigation, the ransomware actors used domain fronting to disguise the\ndestination of their command and control.\n\n**Exfiltration**\nRansomware groups have widely adopted double extortion as a core tactic to ensure\nprofitability. In fact, [nearly 40% of security professionals said double-extortion ransomware](https://www.carbonblack.com/blog/2021-cybersecurity-outlook-attackers-vs-defenders/)\nwas the most observed new ransomware attack technique in 2020. By taking time to quietly\nexfiltrate sensitive information from the organization, cybercriminals gain incrementally\nsignificant leverage on their victim organizations, forcing organizations to not only pay to\ndecrypt their content but also prevent potentially harmful data from being sold or otherwise\npublicly disclosed.\n\nRansomware groups will use a variety of methods to exfiltrate data, and this additional\nprocess will likely mean more TTR, leaving artifacts that can trigger detection and\nremediation efforts.\n\nIn one investigation, Accenture identified a ransomware gang use RClone to exfiltrate 2TB of\ndata prior to executing Maze and Mountlocker ransomware. RClone is an open-source\ncommand line tool that allows the actors to sync files from the local disk to a cloud storage\nprovider. During another investigation the ransomware actors downloaded and utilized\ncurl.exe to maximize download capabilities and exfiltrate .bat files and a tmp.vbs file used to\ncalculate disk space on the staging server.\n\n**Opportunities for Defenders**\n\nThe above pre-ransomware tactics leave evidence that provides organizations with possible\ndetection opportunities prior to exfiltration of data and deployment of destructive malware.\nVMware and ACTI recommend implementing a managed detection and response (MDR)\nservice like Accenture’s, which is a true multi-tenant, cloud-based service that provides\nextended threat detection and response via network monitoring, endpoint management and\nremediation; security incident analysis; and escalation via a dedicated team of security\nexperts. The Accenture MDR service helps secure the client’s endpoints, while leveraging\ntheir existing investments, with a managed endpoint detection and response service that\nprovides additional investigation of identified suspicious endpoint-based activities, and\nenhanced context, threat hunting and proactive responses.\n\n<<< Start >>>\n\n## Accenture MDR Key Features:\n\n\n-----\n\n**Data Analysis: processing and analysis of log data from security controls, network**\ninfrastructure, and endpoints to identify events of interest.\n**24/7 Alert Monitoring: 24x7 alert monitoring, analysis, identification, and escalation of**\nincidents through industry specific threat intelligence.\n**Highly Qualified Analyst Teams: client aligned specialists, including GIAC-certified**\nSecurity Analysts, Service Delivery Leads, On-Boarding Engineers, and Senior\nAnalysts\n**Customizable Service: customizable set of processes, including client specific**\nsecurity incident escalation and individualized incident severity tuning.\n**Anomaly Detection: anomalous traffic detection, data mining, and statistical analysis**\nto identify known and previously unknown malicious activity.\n**Single Pane-of-Glass Customer Portal: a comprehensive view of all security**\nincidents, devices, assets, and reporting through a self-service portal.\n**Threat Intelligence: visibility into threats impacting client specific industries and**\ngeographies, including specific attacker tools, tactics and procedures.\n**Rapid Proactive Response: active remediation based on pre-authorized actions for**\nrapid response with access to incident response.\n\n<<< End >>>\n\nAdditionally, Accenture and VMware advise optimizing for the detection opportunities below:\n\nAdditionally, Accenture and VMware advise optimizing for the detection opportunities below:\n\n\nMITRE\nATT&CK\nTactic\n\nInitial\nAccess\n\n\nMITRE ATT&CK\nTechnique\n\nT1189: Drive-by\nCompromise\n\nT1566: Phishing\n\nT1133: External\nRemote Services\n\nT1078: Valid\nAccounts\n\n\nDetection Opportunity\n\nMonitor antivirus and Intrusion Detection/Prevention\ndetections.\n\nScrutinize PowerShell logs for obfuscated\ncommands and command-line arguments.\n\nPrevent installation of legacy PowerShell versions as\nwell as the execution of Base64-encoded\ncommands.\n\nMonitor for anomalous log-in activity such as multiple\nlog-in attempts, log-in outside of business hours, etc.\n\n\n-----\n\nExecution T1059: Command\nand Scripting\nInterpreter\n\nT1569.002:\nService\nExecution\n\nT1047: Windows\nManagement\nInstrumentation\n\nT1559: Inter-Process\nCommunication\n\n\nMonitor for potentially suspicious command-line\nactivity including parameters for security tool service\nmodifications, anomalous process executions, or\nencoded commands.\n\nMonitor Windows event logs for service creation and\nmodification, registry changes, and command-line\nparameters of files and processes.\n\nMonitor for host browser process anomalies\nincluding suspicious file writes and process\ninjections.\n\nReview PowerShell logs to search for loading or\nexecution of artifacts.\n\nMonitor network traffic for Windows Management\nInstrumentation (WMI) connections and investigate\nany suspicious connections.\n\nReview command-line arguments for use of “wmic”\nor other indicators of remote behavior.\n\nTrack any unauthorized or unusual loading of DLL\nfiles.\n\n\n-----\n\nPersistence T1078: Valid\nAccounts\n\nT1543: Create or\nModify System\nProcess\n\nT1543.003:\nWindows\nServices\n\nT1053: Scheduled\nTask\n\nT1547: Boot or\nLogon Autostart\nExecution\n\nT1547.001:\nRegistry Run\nKeys / Startup\nFolders\n\nT1133: External\nRemote Services\n\nT1037: Boot or\nLogon Initialization\nScripts\n\nT1037.003:\nNetwork Logon\nScript\nT1037.005:\nStartup Items\n\n\nInvestigate parental processes to determine the\nprocess tree and identify binaries for subsequent\nanalysis.\n\nAudit system settings for potential unknown autostart\nexecution configurations.\n\nMonitor systems for abnormal process behavior and\nprocesses loading malicious DLLs.\n\nMonitor logon scripts for unusual access to accounts\noutside of regular or expected time periods.\n\nMonitor for unexpected new system processes or\nchanges that are unrelated to scheduled activity\nsuch as patches and software updates.\n\nMonitor for suspicious activity relating to user\naccounts, such as the sharing of accounts or access\noutside of usual business hours.\n\n\n-----\n\nPrivilege\nEscalation\n\n\nT1055: Process\nInjection\n\nT1055.001:\nDynamic-link\nLibrary\nInjection\nT1055.012:\nProcess\nHollowing\n\nT1548: Abuse\nElevation Control\nMechanism\n\nT1548.002:\nBypass UAC\n\nT1078: Valid\nAccounts\n\nT1543: Create or\nModify System\nProcess\n\nT1543.003:\nWindows\nService\n\n\nMonitor events of files commonly used in process\ninjection, such as DLLs and PEs, that are not\nrecognized or normally loaded into processes.\n\nMonitor for malicious PowerShell modules like\nPowerSploit (Invoke-Mimikatz).\n\nMonitor Active Directory for unusual changes or\nrequests.\n\nRegularly check for system process modification\nusing commands or executables in service file\nnames, anomalous service creations, and unsigned\nbinaries in image paths.\n\nMonitor for use of unsigned applications or those not\nfrom trusted repositories.\n\nMonitor for suspicious activity relating to user\naccounts, such as the sharing of accounts or access\noutside of usual business hours.\n\n\n-----\n\nDefense\nEvasion\n\n\nT1562: Impair\nDefenses\n\nT1562.001:\nDisable or\nModify Tools\n\nT1550: Use\nAlternate\nAuthentication\nMaterial\n\nT1550.002:\nPass the Hash\n\nT1036:\nMasquerading\n\nT1112: Modify\nRegistry\n\nT1553: Subvert Trust\nControls\n\nT1553.002:\nCode Signing\n\nT1027: Obfuscated\nFiles or Information\n\nT1027.003:\nSteganography\nT1027.005:\nIndicator\nRemoval from\nTools\n\nT1140:\nDeobfuscate/Decode\nFiles or Information\n\nT1218: Signed\nBinary Proxy\nExecution\n\nT1218.011:\nRundll32\nT1218.005:\nMshta\nT1218.010:\nRegsvr32\n\n\nMonitor activity of processes and command-line\narguments that may relate to disabling or terminating\nsecurity tools and logging services, scripts, and\nsystem utilities used to deobfuscate/decode files and\ninformation, or activity indicating proxy execution of\nmalicious files.\n\nRegularly audit and monitor account activity that may\nindicate unauthorized access or account sharing\n\nMonitor files by their hashes to identify any\nsuspicious changes to filenames that may indicate.\nmasquerading.\n\nMonitor the registry for unfamiliar changes such as\nnewly added startup processes and modified binary\npaths.\n\nAnalyze signing certificates of software to identify\nunusual certificates that may indicate malicious\nactivity.\n\nUse and configure antivirus and antimalware\nsolutions to identify and analyze commands that may\nrelate to obfuscating files or information.\n\nInvestigate and analyze security events relating to\nfile obfuscation for any malicious activity that may\nhave gone undetected.\n\nImplement host and network rules to detect\ncommonly used deobfuscation/decoding techniques.\n\n\n-----\n\nCredential\nAccess\n\n\nT1558: Steal or\nForge Kerberos\nTickets\n\nT1558.001:\nGolden Ticket\nT1558.002:\nSilver Ticket\nT1558.003:\nKerberoasting\n\nT1003: OS\nCredential Dumping\n\nT1003.001:\nLSASS\nMemory\nT1003.002:\nSecurity\nAccount\nManager\nT1003.003:\nNTDS\nT1003.006:\nDCSync\n\nT1552: Unsecured\nCredentials\n\nT1552.001:\nCredentials in\nFiles\n\n\nMonitor for suspicious activity on networks that may\nindicate the stealing or forging of Kerberos tickets.\n\nMonitor for suspicious LSASS.exe executions or\nunusual processes interacting with LSASS, SAM.\n\nMonitor for malicious PowerShell modules like\nPowerSploit (Invoke-Mimikatz).\n\nMonitor command line activity for indications of\npassword searches (for example, searching for\nkeywords “password, pwd, login, credentials”).\n\n\n-----\n\nLateral\nMovement\n\n\nT1550: Use\nAlternate\nAuthentication\nMaterial\n\nT1550.002:\nPass the Hash\nT1550.003:\nPass the Ticket\n\nT1570: Lateral Tool\nTransfer\n\nT1072: Software\nDeployment Tools\n\nT1210: Exploitation\nof Remote Services\n\nT1021: Remote\nServices\n\nT1021.001:\nRemote\nDesktop\nProtocol\nT1021.002:\nSMB/Windows\nAdmin Shares\nT1021.006:\nWindows\nRemote\nManagement\n\n\nLook for anomalous activity from non-privileged\naccounts, particularly monitoring for the use of\nLoLbins.\n\nMonitor remote logins, access patterns, and activity.\n\nInvestigate “impossible logins” – user logins from\ngeographically dispersed IP addresses (although\nVPN use could cause false positives).\n\nScrutinize command-line arguments associated with\nnetwork share mounting and remote access tools.\n\n\n-----\n\nCommand\nand Control\n\n\nT1102: Web\nServices\n\nT1573: Encrypted\nChannel\n\nT1132: Data\nEncoding\n\nT1090: Proxy\n\nT1090.004:\nDomain\nFronting\n\nT1219: Remote\nAccess Software\n\nT1105: Ingress Tool\nTransfer\n\nT1071: Application\nLayer Protocol\n\nT1071.001:\nWeb Protocols\nT1072.004:\nDNS\n\n\nMonitor for uncommon data flows.\n\nWatch for processes that do not normally have\nnetwork access.\n\nMonitor the SNI field of TLS headers and the host\nfield in HTTP headers, check domains against a\nblock/allow list, and identify beaconing activity.\n\nUse network intrusion detection and prevention\nsystems that use network signatures to identify\ntraffic.\n\nMonitor the use and activity of utilities such as FTP\nthat are not typical in the network environment.\n\nFilter network traffic to prevent the accessing of\nanonymity networks and inspect traffic for indications\nof potential domain fronting.\n\nIdentify anomalies in network activity associated with\nknown binaries, analyze uncommon data flows and\npacket inspection for misuse of protocol to port\nbehaviors.\n\nMonitor environment and network activity for\nsuspicious or unknown processes and scripts that\nappear to be traversing file systems or sending\nnetwork traffic.\n\nMonitor for unusual network activity and analyze\npacket contents that do not use standard ports or\nexpected protocol behavior.\n\nAnalyze unknown network connections to the same\ndestination that occur regularly at the same time of\nday.\n\n\nExfiltration T1029: Scheduled\nTransfer\n\nT1048: Exfiltration\nOver Alternate\nProtocol\n\nT1041: Exfiltration\nOver C2 Channel\n\nT1567: Exfiltration\nOver Web Service\n\nT1567.002\nExfiltration to\nCloud Storage\n\n\n**Accenture Security is a leading provider of end-to-end cybersecurity services, including**\nadvanced cyber defense, applied cybersecurity solutions and managed security operations.\nWe bring security innovation, coupled with global scale and a worldwide delivery capability\n\n\n-----\n\nthrough our network of Advanced Technology and Intelligent Operations centers. Helped by\nour team of highly skilled professionals, we enable clients to innovate safely, build cyber\nresilience and grow with confidence. Follow us @AccentureSecure on Twitter or visit us at\n[www.accenture.com/security.](http://www.accenture.com/security)\n\nAccenture, the Accenture logo, and other trademarks, service marks, and designs are\nregistered or unregistered trademarks of Accenture and its subsidiaries in the United States\nand in foreign countries. All trademarks are properties of their respective owners. All\nmaterials are intended for the original recipient only. The reproduction and distribution of this\nmaterial is forbidden without express written permission from Accenture. The opinions,\nstatements, and assessments in this report are solely those of the individual author(s) and do\nnot constitute legal advice, nor do they necessarily reflect the views of Accenture, its\nsubsidiaries, or affiliates. Given the inherent nature of threat intelligence, the content\ncontained in this article is based on information gathered and understood at the time of its\ncreation. It is subject to change. Accenture provides the information on an “as-is” basis\nwithout representation or warranty and accepts no liability for any action or failure to act\ntaken in response to the information contained or referenced in this report.\n\nCopyright © 2021 Accenture. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-11 - Moving Left of the Ransomware Boom.pdf"
    ],
    "report_names": [
        "2021-10-11 - Moving Left of the Ransomware Boom.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535659,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653707988,
    "ts_modification_date": 1653707988,
    "files": {
        "pdf": "https://archive.orkl.eu/5bfda427f09ae971d67ee30b9eb70738ab1afa0a.pdf",
        "text": "https://archive.orkl.eu/5bfda427f09ae971d67ee30b9eb70738ab1afa0a.txt",
        "img": "https://archive.orkl.eu/5bfda427f09ae971d67ee30b9eb70738ab1afa0a.jpg"
    }
}