{
    "id": "7a4aff73-df22-4666-9237-09d60b6eeb5a",
    "created_at": "2023-01-12T15:09:22.110445Z",
    "updated_at": "2025-03-27T02:11:48.863174Z",
    "deleted_at": null,
    "sha1_hash": "71b49b6c595ee16da25fac8bc0b809a8e617c226",
    "title": "2021-10-25 - Conti Ransom Gang Starts Selling Access to Victims",
    "authors": "",
    "file_creation_date": "2022-05-28T04:11:31Z",
    "file_modification_date": "2022-05-28T04:11:31Z",
    "file_size": 138891,
    "plain_text": "# Conti Ransom Gang Starts Selling Access to Victims\n\n**[krebsonsecurity.com/2021/10/conti-ransom-gang-starts-selling-access-to-victims/](https://krebsonsecurity.com/2021/10/conti-ransom-gang-starts-selling-access-to-victims/)**\n\nThe Conti ransomware affiliate program appears to have altered its business plan recently.\nOrganizations infected with Conti’s malware who refuse to negotiate a ransom payment are\nadded to Conti’s victim shaming blog, where confidential files stolen from victims may be\npublished or sold. But sometime over the past 48 hours, the cybercriminal syndicate updated\nits victim shaming blog to indicate that it is now selling access to many of the organizations it\nhas hacked.\n\nA redacted screenshot of the Conti News victim shaming blog.\n\n“We are looking for a buyer to access the network of this organization and sell data from their\nnetwork,” reads the confusingly worded message inserted into multiple recent victim listings\non Conti’s shaming blog.\n\nIt’s unclear what prompted the changes, or what Conti hopes to gain from the move. It’s also\nnot obvious why they would advertise having hacked into companies if they plan on selling\nthat access to extract sensitive data going forward. Conti did not respond to requests for\ncomment.\n\n“I wonder if they are about to close down their operation and want to sell data or access from\nan in-progress breach before they do,” said Fabian Wosar, chief technology officer at\ncomputer security firm Emsisoft. “But it’s somewhat stupid to do it that way as you will alert\nthe companies that they have a breach going on.”\n\n\n-----\n\nThe unexplained shift comes as policymakers in the United States and Europe are moving\nforward on efforts to disrupt some of the top ransomware gangs. Reuters recently [reported](https://www.reuters.com/technology/exclusive-governments-turn-tables-ransomware-gang-revil-by-pushing-it-offline-2021-10-21/)\nthat the U.S. government was behind an ongoing hacking operation that penetrated the\ncomputer systems of [REvil, a ransomware affiliate group that experts say is about as](https://krebsonsecurity.com/?s=REvil)\naggressive and ruthless as Conti in dealing with victims. What’s more, REvil was among the\nfirst ransomware groups to start selling its victims’ data.\n\nREvil’s darknet victim shaming site remains offline. In response, a representative for the\nConti gang posted a long screed on Oct. 22 to a Russian language hacking forum\ndenouncing the attack on REvil as the “unilateral, extraterritorial, and bandit-mugging\nbehavior of the United States in world affairs.”\n\n“Is there a law, even an American one, even a local one in any county of any of the 50\nstates, that legitimize such indiscriminate offensive action?” reads the Conti diatribe. “Is\nserver hacking suddenly legal in the United States or in any of the US jurisdictions? Suppose\nthere is such an outrageous law that allows you to hack servers in a foreign country. How\nlegal is this from the point of view of the country whose servers were attacked? Infrastructure\nis not flying there in space or floating in neutral waters. It is a part of someone’s sovereignty.”\n\nConti’s apparent new direction may be little more than another ploy to bring victim companies\nto the negotiating table, as in “pay up or someone will pay for your data or long-term misery if\nyou don’t.”\n\nOr maybe something just got lost in the translation from Russian (Conti’s blog is published in\nEnglish). But by shifting from the deployment of ransomware malware toward the sale of\nstolen data and network access, Conti could be aligning its operations with many competing\nransomware affiliate programs that have recently focused on extorting companies in\nexchange for a promise not to publish or sell stolen data.\n\n[However, as Digital Shadows points out in a recent ransomware roundup, many](https://www.digitalshadows.com/blog-and-research/ransomware-q3-2021-roll-up/)\nransomware groups are finding it difficult to manage data-leak sites, or hosting stolen data\non the dark web for download.\n\nAfter all, when it takes weeks to download one victim’s data via Tor — if indeed the download\nsucceeds at all — the threat of leaking sensitive data as a negotiation tactic loses some of its\nmenace. It’s also a crappy user experience. This has resulted in some ransomware groups\nexposing data using public file-sharing websites, which are faster and more reliable but can\nbe taken down through legal means quite quickly.\n\nData leak sites also can offer investigators a potential way to infiltrate ransomware gangs, as\nevidenced by the recent reported compromise of the REvil gang by U.S. authorities.\n\n“On 17 Oct 2021, a representative of the REvil ransomware gang took it to a Russianspeaking criminal forum to reveal that their data-leak sites had been ‘hijacked’,” Digital\nShadows’ Ivan Righi wrote “The REvil member explained that an unknown individual\n\n\n-----\n\naccessed the hidden services of REvil s website s landing page and blog using the same key\nowned by the developers. The user believed that the ransomware gang’s servers had been\ncompromised and the individual responsible for the compromise was ‘looking for’ him.”\n\n[A recent report by Mandiant revealed that FIN12 — the group believed to be responsible for](https://www.mandiant.com/resources/fin12-ransomware-intrusion-actor-pursuing-healthcare-targets)\n[both Conti and the Ryuk ransomware operation — has managed to conduct ransomware](https://krebsonsecurity.com/?s=ryuk)\nattacks in less than 3 days, compared to more than 12 days for attacks involving data\nexfiltration.\n\nSeen through those figures, perhaps Conti is merely seeking to outsource more of the data\nexfiltration side of the business (for a fee, of course) so that it can focus on the less timeintensive but equally profitable racket of deploying ransomware.\n\n“As Q4 comes near, it will be interesting to see if issues relating to managing data leak sites\nwill discourage new ransomware groups [from pursuing] the path of data-leak sites, or what\ncreative solutions they will create to work around these issues,” Righi concluded. “The Ryuk\nransomware group has proven itself to remain effective and a top player in the ransomware\nthreat landscape without the need for a data-leak site. In fact, Ryuk has thrived by not\nneeding a data leak site and data exfiltration.”\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-25 - Conti Ransom Gang Starts Selling Access to Victims.pdf"
    ],
    "report_names": [
        "2021-10-25 - Conti Ransom Gang Starts Selling Access to Victims.pdf"
    ],
    "threat_actors": [
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536162,
    "ts_updated_at": 1743041508,
    "ts_creation_date": 1653711091,
    "ts_modification_date": 1653711091,
    "files": {
        "pdf": "https://archive.orkl.eu/71b49b6c595ee16da25fac8bc0b809a8e617c226.pdf",
        "text": "https://archive.orkl.eu/71b49b6c595ee16da25fac8bc0b809a8e617c226.txt",
        "img": "https://archive.orkl.eu/71b49b6c595ee16da25fac8bc0b809a8e617c226.jpg"
    }
}