{
    "id": "7a88c57a-c37d-4cf4-838a-49884423b312",
    "created_at": "2023-01-12T15:06:40.954122Z",
    "updated_at": "2025-03-27T02:05:58.996558Z",
    "deleted_at": null,
    "sha1_hash": "e5cf811a066f16f39ecfc2b9a1c9bdf911023688",
    "title": "2017-12-14 - Zeus Panda Banking Trojan Targets Online Holiday Shoppers",
    "authors": "",
    "file_creation_date": "2022-05-28T19:50:39Z",
    "file_modification_date": "2022-05-28T19:50:39Z",
    "file_size": 3481830,
    "plain_text": "# Zeus Panda Banking Trojan Targets Online Holiday Shoppers\n\n**[proofpoint.com/us/threat-insight/post/zeus-panda-banking-trojan-targets-online-holiday-shoppers](https://www.proofpoint.com/us/threat-insight/post/zeus-panda-banking-trojan-targets-online-holiday-shoppers)**\n\nDecember 14, 2017\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nZeus Panda Banking Trojan Targets Online Holiday Shoppers\n\n\n-----\n\nDecember 14, 2017 Proofpoint Staff\n\n**Overview**\n\nBanking Trojans work by injecting code into web pages as they are viewed on infected machines, allowing the\nmalware to harvest banking credentials and credit card information as victims interact with legitimate sites. Most\noften, the injects -- the code that actually performs the man-in-the-browser attacks -- are configured for regionspecific banking sites. More recently, we have seen injects for online payment sites, casinos, retailers, and more\nappearing in banking Trojan campaigns.\n\nSince November -- a period of time that includes Thanksgiving, Black Friday, Cyber Monday and now leading up\nto Christmas -- we have observed Zeus Panda banking Trojan campaigns that have an increasing focus on nonbanking targets with an extensive list of injects clearly designed to capitalize on holiday shopping and activities.\n\nMore specifically, these Zeus Panda (aka Panda Banker) campaigns expanded their injects to a variety of online\nshopping sites for brick and mortar retailers like Zara, specialty online retailers, travel sites, and video streaming\nsites, among others. The vast majority of these new targets will potentially see higher-than-normal numbers of\ncredit card transactions for the holidays. While Zeus Panda can be configured to steal a variety of information,\nthese injects collected the credit card number, address, phone number, DOB, SSN, and security question-related\ninformation such as mother’s maiden name.\n\n**Analysis**\n\nOn December 11, a campaign targeted UK business users with a fake resume attachment named “resume.doc”\n(Figure 1) delivered via email. The subject line “Application submitted from Gumtree Jobs by [First Last Names]\nfor Field Sales Consultant - Status: Emailed” referenced a job application via “Gumtree Jobs”, a legitimate jobs\nand classified advertising platform with users in the UK, Australia, New Zealand, and South Africa. The actor\nabused the Gumtree brand to lend legitimacy to the campaign but the site itself was not directly abused to send\nthe fraudulent applications.\n\n\n-----\n\n_Figure 1: Fake resume document attachment contains macros that, if enabled, launch PowerShell code to_\n_download Zeus Panda_\n\nHowever, we first observed this instance of Zeus Panda targeting Canadian companies in November, before the\nThanksgiving holiday. For example, on November 13, we observed malicious emails with the subject “Your\npackage is ready to be picked up” containing URLs linking to Microsoft Word documents such as “receiptpackage-5a0a062cae04a.doc”. The documents used macros to download Zeus Panda.\n\n\n-----\n\n_Figure 2: The malicious URLs redirect to another landing page (hxxps://canadapost-packagecenter[.]com/), which_\n_in turns starts the document download_\n\n\n-----\n\n_Figure 3: The malicious document receipt-package-5a0a062cae04a.doc contains macros that, if enabled,_\n_launched PowerShell code to download Zeus Panda_\n\nThese instances of Zeus Panda include injects that feature wildcards for increased flexibility and, as noted, target\na disproportionate number of non-bank organizations. This campaign provides an example of the ongoing\nevolution of banking Trojans and their uses, as well as the tendency for threat actors to built campaigns around\nmajor events and seasonal trends.\n\n**Conclusion**\n\nUsers infected with banking Trojans like Zeus Panda often do not know they are infected as the malware\nconducts man-in-the-middle/browser attacks, quietly harvesting credit card numbers or banking credentials as\n[users visit legitimate banking and online shopping sites. While we have reported on previous examples of](https://www.proofpoint.com/us/threat-insight/post/Dyreza-Campaigners-Sights-On-Fulfillment-Warehousing-Industry)\nbanking Trojans targeting non-banking services, the timing and specific injects of these recent attacks are clearly\nfocused on online holiday shoppers, travelers, and holiday activities, with far more retail-related and other nonbanking injects than we normally associate with a banking Trojan attack. For consumers, keeping endpoint\nprotection up to date is the best defense, although few endpoint antivirus systems can currently detect the\nmalicious nature of this particular document. Organizations can protect users at many levels - the email gateway,\nthe network gateway, and the endpoint. During the holidays, when many users will be traveling or using corporate\ndevices from home, requiring the use of a VPN can ensure that computers are protected and banking Trojanrelated traffic can be detected and blocked whether or not a user is physically in the office.\n\n**Indicators of Compromise (IOCs)**\n\n_December 11 campaign_\n\n\n-----\n\nIOC IOC Type Description\n\nhxxp://80.82.67[.]217/moo[.]jpg URL Document payload\n\n5f7a1b02d5b2904554e65bd01a12f1fa5ff2121eef53f3942c4e9e29c46bdce3 SHA256 Panda\n\ngromnes[.]top Domain Panda C&C\n\naklexim[.]top Domain Panda C&C\n\nkichamyn[.]top Domain Panda C&C\n\ne13594d83f2a573627e742baf33298b9eeec1ebb8c7955304b8c35559e5f23dc SHA256 Attachment\n\n_November 13 campaign_\n\n\nIOC IOC\nType\n\n\nDescription\n\n\nhxxp://www.nfktrading[.]com/analyticsmmrxbctq/redirect/0849e22e843170e1600c1910df8cf9daid-qblozsmn-to-package-awaiting\n\n\nURL Malicious URL in\nemail\n\n\nhxxps://canadapost-packagecenter[.]com/ URL Landing page\nredirection\n\n2514dbf1549b517692e415af85baa6e5eca926cdedb526d2e255b5943501d98b SHA256 receipt-package5a0a062cae04a.doc\n\nhxxp://89.248.169[.]136/bigmac.jpg URL Document payload\n\nae92a4a5bc64db6af23219d7fa2d8bce98a5d7eb2eff7193e4f49698e3e5650d SHA256 Bigmac.jpg (Panda\nexecutable)\n\ngromnes[.]top Domain Panda C&C\n\n**ET and ETPRO Suricata/Snort Signatures**\n\n2825353 | ETPRO TROJAN Zeus Panda Banker Malicious SSL Certificate Detected\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-14 - Zeus Panda Banking Trojan Targets Online Holiday Shoppers.pdf"
    ],
    "report_names": [
        "2017-12-14 - Zeus Panda Banking Trojan Targets Online Holiday Shoppers.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536000,
    "ts_updated_at": 1743041158,
    "ts_creation_date": 1653767439,
    "ts_modification_date": 1653767439,
    "files": {
        "pdf": "https://archive.orkl.eu/e5cf811a066f16f39ecfc2b9a1c9bdf911023688.pdf",
        "text": "https://archive.orkl.eu/e5cf811a066f16f39ecfc2b9a1c9bdf911023688.txt",
        "img": "https://archive.orkl.eu/e5cf811a066f16f39ecfc2b9a1c9bdf911023688.jpg"
    }
}