{
    "id": "7ab99363-305b-4926-968b-93804d96d6cb",
    "created_at": "2023-01-12T15:00:57.987856Z",
    "updated_at": "2025-03-27T02:05:29.185Z",
    "deleted_at": null,
    "sha1_hash": "454dec70afd5d7fd74bc8c2c784ba7ff76ce36b7",
    "title": "2022-05-20 - Mirai Malware Variants for Linux Double Down on Stronger Chips in Q1 2022",
    "authors": "",
    "file_creation_date": "2022-05-29T16:22:02Z",
    "file_modification_date": "2022-05-29T16:22:02Z",
    "file_size": 2234274,
    "plain_text": "# Mirai Malware for Linux Double Down on Stronger Chips\n\n**crowdstrike.com/blog/linux-mirai-malware-double-on-stronger-chips/**\n\nVlad Ciuleanu May 20, 2022\n\nAccording to CrowdStrike research, Mirai malware variants compiled for Intel-powered Linux systems double\n(101%) in Q1 2022 compared to Q1 2021\nMirai malware variants that targeted 32-bit x86 processors increased the most (120% in Q1 2022 vs. Q1\n2021)\nMirai malware is used to compromise internet-connected devices, amass them into botnets and use their\ncollective power to conduct denial of service attacks\n[Mirai variants continuously evolve to exploit unpatched vulnerabilities to expand their attack surface](https://www.crowdstrike.com/cybersecurity-101/attack-surface/)\n\n[Popular for compromising internet-connected devices and conducting distributed denial of service (DDoS) attacks,](https://www.crowdstrike.com/cybersecurity-101/distributed-denial-of-service-ddos-attacks/)\n[Mirai malware variants have been known to compromise devices that run on Linux builds ranging from mobile and](https://www.crowdstrike.com/blog/linux-targeted-malware-increased-by-35-percent-in-2021/)\nInternet of Things (IoT) devices to cloud infrastructures.\n\nAccording to internal and open-source data analyzed by the CrowdStrike malware research team, while the ARM\n[CPU architecture (used in most mobile and IoT devices) remains the most prevalent among Mirai variants, the](https://www.crowdstrike.com/cybersecurity-101/internet-of-things-iot-security/)\nnumber of 32-bit x86 Mirai variants (used on Linux servers and networking equipment) increased by 120% in Q1\n2022 compared to Q1 2021. ARM-compiled variants increased by only 10% during the same timespan, according\nto internal and open-source data analyzed by CrowdStrike researchers. On average, the number of Mirai variants\ncompiled for both 32- and 64-bit x86 CPU architectures has increased by 101% during the same timespan.\n\nFrom a [malware developer perspective, focusing on compiling variants for the x86 monoculture rather than all of](https://www.crowdstrike.com/cybersecurity-101/malware/)\nthe CPU architectures used by Linux-running IoT devices likely involves less effort from a code maintenance\nstandpoint, while expanding the attack surface to include Linux-running devices with more computing power.\n\n\n-----\n\nFigure 1. Mirai variants distribution based on builds compiled for specific CPU architectures (Q1 2021 vs Q1 2022)\n\n## Why Linux Botnets?\n\nThe Linux operating system powers most of the world’s data centers, web servers and cloud services, and also a\nwide range of network, mobile and IoT devices. Regardless of the CPU architecture powering these devices, their\nsheer volume creates a very large attack surface for threats and cybercriminals to amass these devices into\nmassive botnets and use them for launching denial of service attacks.\n\nBotnets are the result of malware that automatically replicates and spreads to vulnerable devices, enabling\nbotmasters to seize remote control over all compromised devices. The most common use for botnets, apart from\nperforming DDoS, involves using them as proxy servers or for cryptocurrency mining; each activity is bad in its own\nway.\n\nFor more information on botnets and how they work and how to protect against botnets, check out this CrowdStrike\nCybersecurity 101 page.\n\n\n-----\n\nFigure 2. Example of Centralized Client-Server botnet infrastructure\n\n## Mirai Is Constantly Evolving\n\nWhat’s special about Mirai is that its source code and instructions on how to set the botnet were made public in\nlate 2016 by its developer, and traces of that original code can now be found in multiple recent Mirai variants.\n\n[While brute-force attacks to log in to internet-connected devices remain a preferred method for spreading various](https://www.crowdstrike.com/cybersecurity-101/brute-force-attacks/)\nMirai variants, going for devices with high-bandwidth, low-latency internet connections and higher computing\npower requires new methods for compromise, moving away from smart devices to more powerful Linux-running\ndevices.\n\nMany of the original Mirai features have made their way to existing variants, such as setting up signal-based\ncontrol flow to make dynamic analysis harder; self-deleting the executable; changing the process name and the\ncommand line to avoid detection; preventing system reboot; stopping processes associated with remote\nadministration tools like SSH and Telnet; stopping “competing” malware processes; and searching for new targets\nto infect. But, newer variants have slightly different implementations or add new exploit capabilities to increase the\nattack surface.\n\n[For example, whenever a new exploit becomes public, such as the recent Log4j vulnerability, it’s quickly integrated](https://www.crowdstrike.com/blog/how-crowdstrike-protects-customers-from-log4shell-threats/)\nby malware developers into various Mirai variants. The Log4j logging library is used by countless applications and\nis not limited to applications running on a specific operating system or CPU architecture.\n\n\n-----\n\nFigure 3. Mirai variant exploiting the Log4Shell vulnerability\n(8d80490b35ebb3f75f568ed4a9e8a7de28254c2f7a6458b4c61888572a64197e)\n\nAs seen in Figure 3, the vulnerable application (in this case, a networking device) will load and instantiate a Java\nclass found at the attacker’s IP address and execute whatever code the attacker put in it.\n\n## CrowdStrike Falcon Protection for Linux\n\nMinimum recommendations for preventing Mirai infection on IoT devices involve using custom passwords, updated\nsoftware and recent hardware, if possible.\n\nSince Linux is one of the primary operating systems for business critical applications and infrastructures —\nregardless of if on-premises or in private and public clouds — it’s critical to protect these systems with a solution\nthat provides protection and visibility across all Linux workloads, regardless of location.\n\nThe CrowdStrike Falcon platform protects Linux workloads, including containers, whether they run in public and®\nprivate clouds, on-premises or in hybrid data centers. To effectively detect and protect against Mirai variants,\nCrowdStrike researchers continuously analyze and understand how they operate and how they continue to evolve\nto build better automated detection capabilities.\n\n\n-----\n\nFigure 4. CrowdStrike Falcon detects Mirai x86 upx-packed Linux sample using on-sensor machine learning\n\n(3d9487191dd4e712cbfb8f4dcf916a707f60c3fb23807d4c02fb941e216f951d) (Click to enlarge)\n\n[Machine learning (on sensor and in the cloud), behavior-based indicators of attack (IOAs) and custom hash](https://www.crowdstrike.com/cybersecurity-101/indicators-of-compromise/ioa-vs-ioc/)\nblocking — all built into the Falcon platform — can help defend Linux workloads against malware and sophisticated\nthreats, offering complete visibility and context into any attack on Linux workloads.\n\n## Indicators of Compromise (IOCs)\n\nVariant Platform Hash Notable\nfeatures\n\nOriginal x86 `0a38acadeb41536f65ed89f84cc1620fb79c9b916e0d83f2db543e12fbfd0d8c` Debug\nsymbols\n\n\nGreek\nHelios\n\n\nx86 `bc5f1b69b6edfd58a56b104568cb73fe74ccefea6651b1a1bcf7613331b56597` Modified\nproc killer,\nends\n“competing”\nMirai\nvariants\n\n\nOriginal x86 upx `3d9487191dd4e712cbfb8f4dcf916a707f60c3fb23807d4c02fb941e216f951d` Upx\n\nMiori x86-64 `58d2db0bc8d93a30101eb87ef28c7dbf1af61ae2ebc355f6a236ab594a236f4b` Larger\nencrypted\nstring table\n\n\n-----\n\nModified\nSatori\n\n2022\nlog4j\n\nCross\nbreed\n\nMirai +\nMozi\n\nCrossbreed\n\n\narm `e666e0c720387db27e23c65d6a252f79587ca1b9d1c38e96d6db13b05d5b73fa` Debug\nsymbols,\nexploit for\nHuawei,\nGPON\nrouters +\njaws web\nserver.\n\narm `3d604ebe8e0f3e65734cd41bb1469cea3727062cffc8705c634558afa1997a7a` Multiple\nrouter\nexploits +\nthinkPHP,\njaws, log4j\nexploit\n\narm upx `ac13002f74249e0eab2dacb596a60323130664b8c19d938af726508fdc7500a2` Mirai’s\nencrypted\nstring table,\ndebug\nsymbols\n\nMIPS `2067f740253b010d7a7b01dedee9ee897fb4255b9fc10f76f5ea9f6fd165bde6` Upx with\nbroken\nmagic,\np_info and\npadding at\nthe end to\nprevent\nunpacking.\nContains\nexploits for\na variety of\nrouters and\nweb\nservers.\n\n\nx86-64\nupx\n\n\n`d1a71eed917cc23729f04fb6fb630209878419aef404ebe940dea8eccaac68de` Minimalist\nmain, uses\nMirai’s\nkiller,\ngafgyt’s\ntables,\nfunctions\nbroken into\npieces,\nheavily\nmodified\ncontrol flow\n\n\n**Additional Resources**\n\n_Read more about the increase in malware targeting Linux-based operating systems in this blog: Linux-_\n_Targeted Malware Increases by 35% in 2021: XorDDoS, Mirai and Mozi Most Prevalent._\n_Read_ _[this press release about CrowdStrike Falcon’s enhanced Linux protection.](https://www.crowdstrike.com/press-releases/crowdstrike-falcon-expands-linux-protection-with-enhanced-prevention-capabilities/)_\n_[Find out how the powerful CrowdStrike Falcon platform provides comprehensive protection across your](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_organization, workers, data and identities._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-gen AV performs](https://www.crowdstrike.com/resources/free-trials/try-falcon-prevent/)_\n_against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-20 - Mirai Malware Variants for Linux Double Down on Stronger Chips in Q1 2022.pdf"
    ],
    "report_names": [
        "2022-05-20 - Mirai Malware Variants for Linux Double Down on Stronger Chips in Q1 2022.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535657,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653841322,
    "ts_modification_date": 1653841322,
    "files": {
        "pdf": "https://archive.orkl.eu/454dec70afd5d7fd74bc8c2c784ba7ff76ce36b7.pdf",
        "text": "https://archive.orkl.eu/454dec70afd5d7fd74bc8c2c784ba7ff76ce36b7.txt",
        "img": "https://archive.orkl.eu/454dec70afd5d7fd74bc8c2c784ba7ff76ce36b7.jpg"
    }
}