{
    "id": "7aee5261-68ad-49ca-9d32-efda67c047aa",
    "created_at": "2023-01-12T15:03:35.235275Z",
    "updated_at": "2025-03-27T02:16:14.29172Z",
    "deleted_at": null,
    "sha1_hash": "ab05d5cb8cac99931a45a5281d4dd4c2a352134a",
    "title": "2021-06-16 - The First Step- Initial Access Leads to Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T05:10:44Z",
    "file_modification_date": "2022-05-28T05:10:44Z",
    "file_size": 450483,
    "plain_text": "# The First Step: Initial Access Leads to Ransomware\n\n**[proofpoint.com/us/blog/threat-insight/first-step-initial-access-leads-ransomware](https://www.proofpoint.com/us/blog/threat-insight/first-step-initial-access-leads-ransomware)**\n\nJune 14, 2021\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nThe First Step: Initial Access Leads to Ransomware\n\n\n-----\n\nJune 16, 2021 Selena Larson, Daniel Blackford, and Garrett G\n\n## Key Findings\n\n[Preventing ransomware today largely has shifted from a direct email threat to an](https://www.proofpoint.com/us/threat-reference/ransomware)\nindirect threat where email is only part of the attack chain.\nRansomware threat actors leverage cybercriminal enterprises – largely banking trojan\ndistributors – for malware deployment. These access facilitators distribute their\nbackdoors via malicious links and attachments sent via email.\nBanking trojans were the most popular malware distributed via email, representing\nalmost 20% of malware seen in Proofpoint data the first half of 2021.\nProofpoint currently tracks at least 10 threat actors acting as initial access facilitators or\nlikely ransomware affiliates.\nRansomware is rarely distributed directly via email. Just one ransomware strain\naccounts for 95% of ransomware as a first-stage email payload between 2020 and\n2021.\n[There is not a 1:1 relationship between malware loaders and ransomware attacks.](https://www.proofpoint.com/us/threat-reference/malware)\nMultiple threat actors use the same malware payloads for ransomware distribution.\n\n## Overview\n\nRansomware attacks still use email -- but not in the way you might think. Ransomware\noperators often buy access from independent cybercriminal groups who infiltrate major\ntargets and then sell access to the ransomware actors for a slice of the ill-gotten\ngains. Cybercriminal threat groups already distributing banking malware or other trojans may\nalso become part of a ransomware affiliate network. The result is a robust and\nlucrative criminal ecosystem in which different individuals and organizations increasingly\nspecialize to the tune of greater profits for all—except, of course, the victims.\n\nPreventing ransomware via email is straightforward: block the loader, and you block the\nransomware.\n\n\n-----\n\nTypically, initial access brokers are understood to be opportunistic threat actors\nsupplying affiliates and other cybercrime threat actors after the fact, for example by\nadvertising access for sale on forums. But for the purposes of this report, we consider initial\naccess brokers to be the groups who obtain initial access via first-stage malware\npayloads and may or may not work directly with the ransomware threat actors.\n\nThese criminal threat actors compromise victim organizations with first-stage malware\nlike The Trick, [Dridex, or](https://www.proofpoint.com/us/threat-insight/post/high-volume-dridex-campaigns-return) [Buer Loader and will then sell their access to ransomware](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\noperators to deploy data theft and encryption operations. According to Proofpoint data,\nbanking trojans – often used as ransomware loaders – represented almost 20% of malware\nobserved in identified campaigns in the first half of 2021 and is the most popular malware\ntype Proofpoint sees in the landscape. Proofpoint has also observed evidence of\n[ransomware deployed via SocGholishwhich uses fake updates and website redirects to](https://www.proofpoint.com/us/learn-more/attack-spotlight-fake-browser-updates)\ninfect users, and via [Keitaro traffic distribution system (TDS) and follow-on exploit kits which](https://www.proofpoint.com/us/threat-insight/post/proofpoint-q3-2019-threat-report-emotets-return-rats-reign-supreme-and-more)\noperators use to evade detection.\n\nProofpoint has unique visibility into initial access payloads – and threat actors that deliver\nthem – often used by ransomware threat actors. It is important to note ransomware is not the\nonly second-stage payload associated with the identified malware. In addition to email threat\nvectors, ransomware threat actors leverage vulnerabilities in software running on network\ndevices exposed to the internet or insecure remote access services for initial access.\n\n## Map of the Ransomware Ecosystem\n\nProofpoint currently tracks around a dozen threat actors likely operating as initial access\nbrokers, and many of the email threat campaigns distributing malware loaders observed by\nProofpoint have led to ransomware infections. Confirmation of actor collaboration between\naccess brokers and ransomware threat actors is difficult due to threat actors working hard to\nconceal their identity and evade detection. It is possible that initial access brokers and\nmalware backdoor developers directly collaborate with – or operate as – ransomwarespecific threat actors.\n\n**Initial Access Facilitators**\n\nThe versatile and disruptive malware Emotet previously served as one of the most prolific\ndistributors of malware enabling costly ransomware infections between 2018 and 2020.\n[However, international law enforcement disrupted the malware in January 2021, wiping out](https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nits infrastructure and preventing further infections.\n\nSince the Emotet takedown, Proofpoint observed consistent, ongoing activity from The\nTrick, Dridex, Qbot, IcedID, ZLoader, Ursnif, and many others in our data serving as firststage malware payloads in attempts to enable further infections, including ransomware\n\n\n-----\n\nattacks. Proofpoint tracks these malware families under the banking family. Over the last six\nmonths, banking trojans were associated with more than 16 million messages, representing\nthe most common malware type observed in our data.\n\nAdditionally, Proofpoint tracks downloaders such as Buer Loader and BazaLoader that are\noften used as an initial access vector for ransomware attacks. In the last six\nmonths, Proofpoint identified almost 300 downloader campaigns distributing\nalmost six million malicious messages.\n\nProofpoint researchers track backdoor access advertised on hacking forums from various\nthreat actors. Depending on the compromised organization and its profit margins, access can\nbe sold anywhere from a few hundred to thousands of dollars. Access can be purchased with\ncryptocurrency, most commonly bitcoin.\n\nProofpoint observes overlap between various threat actors, malware, and ransomware\ndeployments. Our data and third-party reporting indicate for example, Conti ransomware has\nbeen associated with multiple first-stage loaders including Buer, the Trick, Zloader,\nand IcedID. IcedID has also been associated with Sodinokibi, Maze, and Egregor\nransomware events.\n\nTA800\n\nTA800 is a large cybercrime actor Proofpoint has tracked since mid-2019. This threat actor\nattempts to deliver and install banking malware or malware loaders including The\nTrick, BazaLoader, Buer Loader, and Ostap. Its payloads have been observed distributing\nransomware. Proofpoint assesses with high confidence TA800 is related to third-party\n[reporting detailing BazaLoader implants that threat actors leveraged to distribute Ryuk](https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html)\nransomware.\n\nTA577\n\nTA577 is a prolific cybercrime threat actor tracked by Proofpoint since mid-2020. This actor\nconducts broad targeting across various industries and geographies, and Proofpoint has\nobserved TA577 deliver payloads including Qbot, IcedID, SystemBC, SmokeLoader, Ursnif,\nand Cobalt Strike.\n\nProofpoint assesses with high confidence TA577 is associated with a March 2021 Sodinokibi\nransomware infection. TA577 initially compromised the victim via emails containing malicious\nMicrosoft Office attachments, which, when macros are enabled, download and\nrun IcedID. Activity observed by this actor increased 225% in the last six months.\n\nTA569\n\n\n-----\n\nTA569 is a traffic and load seller known for compromising content management servers and\ninjecting and redirecting web traffic to a social engineering kit. The threat actor leverages\nfake updates to prompt users to update their browser and download a malicious script.\nProofpoint has tracked TA569 since 2018, but the actor has existed since at least the end of\n2016.\n\nProofpoint assesses with high confidence TA569 is associated with\nWastedLocker ransomware campaigns that appeared in 2020 that leveraged\nthe SocGholish fake update framework for ransomware distribution. Third-party entities\nassociate this ransomware with a Russian cybercrime group known as Evil\nCorp. However, Proofpoint does not assess TA569 is Evil Corp.\n\nTA551\n\nTA551 is a threat actor tracked by Proofpoint since 2016. This actor frequently leverages\nthread hijacking to distribute malicious Office documents via email and demonstrates broad\ngeographic and industry targeting. Proofpoint has observed TA551\ndistribute Ursnif, IcedED, Qbot, and Emotet.\n\nProofpoint assesses with high confidence TA551 IcedID implants were associated with Maze\n[and Egregor ransomware events in 2020.](https://www.fireeye.com/blog/threat-research/2021/02/melting-unc2198-icedid-to-ransomware-operations.html)\n\nTA570\n\nOne of the most active Qbot malware affiliates, Proofpoint has tracked the large cybercrime\n[threat actor TA570 since 2018. Qbot has been observed delivering ransomware](https://redcanary.com/threat-detection-report/threats/qbot/)\n[including ProLock and Egregor. TA570 may use compromised WordPress sites or file hosting](https://www.hornetsecurity.com/en/security-information/qakbot-malspam-leading-to-prolock/)\nsites to host their payloads. TA570 has been observed conducting thread hijacking that\ndistributes malicious attachments or URLs. In the last six months, TA570 activity is up almost\n12%.\n\n\n-----\n\n_Figure 1: A sampling of observed threat actors, initial access payloads they_\n_delivered, and the associated ransomware deployed because of the initial access. Sourcing_\n_for these items is linked in the above descriptions for each actor._\n\nTA547\n\nTA547 is a prolific cybercriminal threat group primarily distributing banking trojans to various\ngeographic regions including ZLoader, The Trick, and Ursnif. This actor often\nuses geofencing, so payloads may not be accessible to users in all regions. Attempts to\naccess payloads from VPNs are also often unsuccessful since the actor blacklists VPN exit\nIP addresses. Over the last six months, the number of identified campaigns from this actor\nspiked almost 30%.\n\nTA544\n\nThis high-volume cybercriminal threat actor regularly installs banking malware and other\nmalware payloads, various geographic targeting including Italy and Japan. This threat actor\nis likely a malware affiliate working with different developers. TA544 has been observed\ndistributing Ursnif and Dridex trojans and has sent over eight million malicious messages in\nthe last six months according to Proofpoint campaign data.\n\nTA571\n\n\n-----\n\nSince 2019, Proofpoint has tracked TA571 and its attempts to distribute and install banking\nmalware. This actor distributes Ursnif, ZLoader, and Danabot and often uses legitimate file\nhosting services or compromised or spoofed infrastructure for payload\nhosting. Typically, TA571 distributes more than 2,000 messages per campaign.\n\nTA574\n\nProofpoint researchers observed TA574 distribute over one million messages in the last six\nmonths according to campaign data. This high-volume cybercrime threat actor conducts\nbroad industry targeting and attempts to deliver and install malware\nincluding ZLoader. Typically, this group distributes malicious Office attachments and\nleverages some techniques including geotargeting and detecting User Agents before\nmalware is deployed. Proofpoint researchers have tracked TA574 since June 2020.\n\nTA575\n\nTA575 is a Dridex affiliate tracked by Proofpoint since late 2020. This group distributes\nmalware via malicious URLs, Office attachments, and password-protected files. On average,\nTA575 distributes almost 4,000 messages per campaign impacting hundreds of\norganizations.\n\n**First-Stage Ransomware**\n\nProofpoint still sees ransomware distributed via email directly, as attachments or links in\nemail, at considerably lower volumes. For example, in 2020 and\n2021 Proofpoint identified 54 ransomware campaigns distributing just over one\nmillion messages.\n\nOf these, Proofpoint identified four Avaddon campaigns containing about a\nmillion messages in 2020, representing 95% of the total. In May 2021, the U.S. Federal\n[Bureau of Investigation released details on an increase in Avaddon activity, noting](https://therecord.media/wave-of-avaddon-ransomware-attacks-triggers-acsc-fbi-warning/)\nthe ransomware operators obtained initial access via remote access portals such as RDP\nand VPN, a pivot away from direct email access. This operational shift is consistent with\nAvaddon campaigns observed in Proofpoint data.\n\nOther ransomware leveraging email directly as an access vector and have appeared in\nProofpoint data this year include Hentai OniChan, BigLock, Thanos, Demonware,\nand Xorist.\n\n## Diversification of the Criminal Enterprise\n\nProofpoint’s Threat Research team analyzed data from 2013 to present to better understand\nobserved trends associated with ransomware and email as an initial access vector.\nProofpoint observed that ransomware campaigns distributed directly via email as\nattachments or links occurred at relatively low, consistent volumes before 2015, at which\n\n\n-----\n\npoint threat actors began distributing ransomware via email at considerably higher volumes.\nThreat actors would send large numbers of messages to individual email addresses\ncontaining the malicious files or URLs that would infect the victim when clicked on or\n[downloaded. Locky, for example, was sent in as many as one million messages per day in](https://www.proofpoint.com/us/threat-insight/post/dridex-actors-get-in-ransomware-with-locky)\n2017 before its operations abruptly stopped.\n\n_Figure 2: Ransomware volumes as a first-stage malware_\n\nProofpoint data shows a significant drop in first-stage ransomware campaigns in 2018.\nMultiple factors contributed to the pivot away from ransomware as a first-stage payload,\nincluding improved threat detection, individual encryption activities resulting in limited\npayouts, and the introduction of wormable and human-operated threats that had\nexponentially more disruptive capabilities.\n\n## How Hackers Hunt\n\nRansomware threat actors currently carry out “big game hunting,” conducting open-source\nsurveillance to identify high-value organizations, susceptible targets, and companies’ likely\nwillingness to pay a ransom. Working with initial access brokers, ransomware threat actors\ncan leverage existing malware backdoors to enable lateral movement and full domain\ncompromise before successful encryption.\n\nAn attack chain leveraging initial access brokers could look like this:\n\n1. A threat actor sends emails containing a malicious Office document\n\n1. A user downloads the document and enables macros which drops a malware payload\n\n1. The actor leverages the backdoor access to exfiltrate system information\n\n1. At this point, the initial access broker can sell access to another threat actor\n\n\n-----\n\n1. The actor deploys Cobalt Strike via the malware backdoor access which enables lateral\n\nmovement within the network\n\n1. The actor obtains full domain compromise via Active Directory\n\n1. The actor deploys ransomware to all domain-joined workstations\n\n_Figure 3: Sample attack chain via initial access broker_\n\n## Outlook\n\nSo far in 2021, Proofpoint continuously observes email-based threats including\ndownloaders and bankers with multi-stage payloads that often lead to ransomware\ninfections. The threat actors are conducting extensive reconnaissance, privilege\nescalation, and lateral movement within the environment before manually deploying the\nransomware payload. One key metric to watch is dwell time. Over the last two years, multiple\npublic reports from incident response companies point to a decrease in the amount of time\nthreat actors spend within an environment before encryption activities. Some incidents are\n[reporting two-day infection timelines between initial access and ransomware](https://thedfirreport.com/2021/05/12/conti-ransomware/)\n[deployment compared to reported averages of 40 days in 2019.](https://www.infocyte.com/resources/mid-market-threat-and-incident-response-report/)\n\nShort dwell times, high payouts, and collaboration across cybercriminal ecosystems have led\nto a perfect storm of cybercrime that the world’s governments are taking seriously. In\nresponse to recent high-profile ransomware attacks, the United\nStates government [proposed new efforts to combat ransomware, and it was a hot topic at](https://www.cybersecuritydive.com/news/Neuberger-cybersecurity-biden-administration-RSA/600437/)\n\n\n-----\n\nthe 2021 G7 conference. It is possible with new disruptive efforts focused on the\nthreat and growing investments in cyber defense across supply chains, ransomware\nattacks will decrease in frequency and efficacy.\n\n_[Learn more about ransomware attacks and prevention.](https://www.proofpoint.com/us/threat-reference/ransomware)_\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-16 - The First Step- Initial Access Leads to Ransomware.pdf"
    ],
    "report_names": [
        "2021-06-16 - The First Step- Initial Access Leads to Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cf32661e-7543-4b57-8665-7f8101a000e9",
            "created_at": "2023-01-06T13:46:39.322379Z",
            "updated_at": "2025-03-27T02:00:03.050728Z",
            "deleted_at": null,
            "main_name": "TA800",
            "aliases": [],
            "source_name": "MISPGALAXY:TA800",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "72bc3519-a265-4136-b85a-d5e331f085b1",
            "created_at": "2023-01-06T13:46:39.313045Z",
            "updated_at": "2025-03-27T02:00:03.048368Z",
            "deleted_at": null,
            "main_name": "TA547",
            "aliases": [],
            "source_name": "MISPGALAXY:TA547",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "02e5c3b8-54b4-4170-b200-7f1fd361b5a9",
            "created_at": "2022-10-25T16:07:24.557505Z",
            "updated_at": "2025-03-27T02:02:10.280375Z",
            "deleted_at": null,
            "main_name": "Scully Spider",
            "aliases": [
                "Scully Spider",
                "TA547"
            ],
            "source_name": "ETDA:Scully Spider",
            "tools": [
                "DanaBot",
                "Lumma Stealer",
                "LummaC2",
                "NetSupport",
                "NetSupport Manager",
                "NetSupport Manager RAT",
                "NetSupport RAT",
                "NetSupportManager RAT",
                "Rhadamanthys",
                "Rhadamanthys Stealer",
                "Stealc"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c91f7778-69aa-45fa-be0e-4ee33daf8fbd",
            "created_at": "2023-01-06T13:46:39.110148Z",
            "updated_at": "2025-03-27T02:00:02.998873Z",
            "deleted_at": null,
            "main_name": "NARWHAL SPIDER",
            "aliases": [
                "GOLD ESSEX",
                "TA544"
            ],
            "source_name": "MISPGALAXY:NARWHAL SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7583fbd4-2bc9-458d-81da-50b27b84e136",
            "created_at": "2023-02-15T02:01:49.565258Z",
            "updated_at": "2025-03-27T02:00:03.113558Z",
            "deleted_at": null,
            "main_name": "TA575",
            "aliases": [],
            "source_name": "MISPGALAXY:TA575",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4f83fef-38ee-4228-9d27-dde8afece1cb",
            "created_at": "2023-02-15T02:01:49.569611Z",
            "updated_at": "2025-03-27T02:00:03.114739Z",
            "deleted_at": null,
            "main_name": "TA577",
            "aliases": [
                "Hive0118"
            ],
            "source_name": "MISPGALAXY:TA577",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "544cac23-af15-4100-8f20-46c07962cbfa",
            "created_at": "2023-01-06T13:46:39.484133Z",
            "updated_at": "2025-03-27T02:00:03.106334Z",
            "deleted_at": null,
            "main_name": "GOLD PRELUDE",
            "aliases": [
                "TA569",
                "UNC1543"
            ],
            "source_name": "MISPGALAXY:GOLD PRELUDE",
            "tools": [
                "FakeUpdates",
                "FakeUpdate",
                "SocGholish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1f679d2e-c5c9-49e9-b854-2eca06a870e4",
            "created_at": "2022-10-25T16:07:24.453427Z",
            "updated_at": "2025-03-27T02:02:10.237233Z",
            "deleted_at": null,
            "main_name": "Bamboo Spider",
            "aliases": [
                "Bamboo Spider",
                "TA544"
            ],
            "source_name": "ETDA:Bamboo Spider",
            "tools": [
                "AndroKINS",
                "Bebloh",
                "Chthonic",
                "DELoader",
                "Dofoil",
                "GozNym",
                "Gozi ISFB",
                "ISFB",
                "Nymaim",
                "PandaBanker",
                "Pandemyia",
                "Sharik",
                "Shiotob",
                "Smoke Loader",
                "SmokeLoader",
                "Terdot",
                "URLZone",
                "XSphinx",
                "ZLoader",
                "Zeus OpenSSL",
                "Zeus Panda",
                "Zeus Sphinx",
                "ZeusPanda",
                "nymain"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ebc139d2-7450-46f5-a9e4-e7d561133fa5",
            "created_at": "2024-04-24T02:00:49.453475Z",
            "updated_at": "2025-03-27T02:00:55.41974Z",
            "deleted_at": null,
            "main_name": "Mustard Tempest",
            "aliases": [
                "Mustard Tempest",
                "DEV-0206",
                "TA569",
                "GOLD PRELUDE",
                "UNC1543"
            ],
            "source_name": "MITRE:Mustard Tempest",
            "tools": [
                "SocGholish",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "96d5b301-0872-444c-ba32-eecf7a9241c0",
            "created_at": "2023-02-15T02:01:49.560566Z",
            "updated_at": "2025-03-27T02:00:03.112349Z",
            "deleted_at": null,
            "main_name": "TA570",
            "aliases": [
                "DEV-0450"
            ],
            "source_name": "MISPGALAXY:TA570",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7183913d-9a43-4362-96e1-9af522b6ab84",
            "created_at": "2024-06-19T02:00:04.377344Z",
            "updated_at": "2025-03-27T02:00:03.383619Z",
            "deleted_at": null,
            "main_name": "TA571",
            "aliases": [],
            "source_name": "MISPGALAXY:TA571",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3bf456e4-84ee-48fd-b3ab-c10d54a48a34",
            "created_at": "2024-06-19T02:03:08.096988Z",
            "updated_at": "2025-03-27T02:05:17.389635Z",
            "deleted_at": null,
            "main_name": "GOLD PRELUDE",
            "aliases": [
                "TA569 ",
                "UNC1543 ",
                "Mustard Tempest "
            ],
            "source_name": "Secureworks:GOLD PRELUDE",
            "tools": [
                "SocGholish"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "22d450bb-fc7a-42af-9430-08887f0abf9f",
            "created_at": "2024-11-01T02:00:52.560354Z",
            "updated_at": "2025-03-27T02:00:55.425961Z",
            "deleted_at": null,
            "main_name": "TA577",
            "aliases": [
                "TA577"
            ],
            "source_name": "MITRE:TA577",
            "tools": [
                "Pikabot",
                "QakBot",
                "Latrodectus"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535815,
    "ts_updated_at": 1743041774,
    "ts_creation_date": 1653714644,
    "ts_modification_date": 1653714644,
    "files": {
        "pdf": "https://archive.orkl.eu/ab05d5cb8cac99931a45a5281d4dd4c2a352134a.pdf",
        "text": "https://archive.orkl.eu/ab05d5cb8cac99931a45a5281d4dd4c2a352134a.txt",
        "img": "https://archive.orkl.eu/ab05d5cb8cac99931a45a5281d4dd4c2a352134a.jpg"
    }
}