{
    "id": "7af2a52b-7ec9-46fa-9b52-05ec3fbaf2bf",
    "created_at": "2023-01-12T15:09:05.004501Z",
    "updated_at": "2025-03-27T02:14:11.94046Z",
    "deleted_at": null,
    "sha1_hash": "558e123a976f75ff439fd1633aec9266b6646f75",
    "title": "2022-08-10 - Cisco Talos shares insights related to recent cyber attack on Cisco",
    "authors": "",
    "file_creation_date": "2022-08-18T03:58:52Z",
    "file_modification_date": "2022-08-18T03:58:52Z",
    "file_size": 295647,
    "plain_text": "# Cisco Talos shares insights related to recent cyber attack on Cisco\n\n**[blog.talosintelligence.com/2022/08/recent-cyber-attack.html](https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html)**\n\n## Update History\n\n**Date** **Description of Updates**\n\n\nAug. 10th\n2022\n\nAug. 10th\n2022\n\n\nAdding clarifying details on activity involving active directory.\n\nUpdate made to the Cisco Response and Recommendations section\nrelated to MFA.\n\n\n## Executive summary\n\nOn May 24, 2022, Cisco became aware of a potential compromise. Since that point,\nCisco Security Incident Response (CSIRT) and Cisco Talos have been working to\nremediate.\nDuring the investigation, it was determined that a Cisco employee’s credentials were\ncompromised after an attacker gained control of a personal Google account where\ncredentials saved in the victim’s browser were being synchronized.\nThe attacker conducted a series of sophisticated voice phishing attacks under the\nguise of various trusted organizations attempting to convince the victim to accept multifactor authentication (MFA) push notifications initiated by the attacker. The attacker\nultimately succeeded in achieving an MFA push acceptance, granting them access to\nVPN in the context of the targeted user.\nCSIRT and Talos are responding to the event and we have not identified any evidence\nsuggesting that the attacker gained access to critical internal systems, such as those\nrelated to product development, code signing, etc.\nAfter obtaining initial access, the threat actor conducted a variety of activities to\nmaintain access, minimize forensic artifacts, and increase their level of access to\nsystems within the environment.\nThe threat actor was successfully removed from the environment and displayed\npersistence, repeatedly attempting to regain access in the weeks following the attack;\nhowever, these attempts were unsuccessful.\n\n\n-----\n\nWe assess with moderate to high confidence that this attack was conducted by an\nadversary that has been previously identified as an initial access broker (IAB) with ties\nto the UNC2447 cybercrime gang, Lapsus$ threat actor group, and Yanluowang\nransomware operators.\n[For further information see the Cisco Response page here.](https://tools.cisco.com/security/center/resources/corp_network_security_incident)\n\n## Initial vector\n\nInitial access to the Cisco VPN was achieved via the successful compromise of a Cisco\nemployee’s personal Google account. The user had enabled password syncing via Google\nChrome and had stored their Cisco credentials in their browser, enabling that information to\nsynchronize to their Google account. After obtaining the user’s credentials, the attacker\nattempted to bypass multifactor authentication (MFA) using a variety of techniques, including\nvoice phishing (aka \"vishing\") and MFA fatigue, the process of sending a high volume of\npush requests to the target’s mobile device until the user accepts, either accidentally or\nsimply to attempt to silence the repeated push notifications they are receiving. Vishing is an\nincreasingly common social engineering technique whereby attackers try to trick employees\ninto divulging sensitive information over the phone. In this instance, an employee reported\nthat they received multiple calls over several days in which the callers – who spoke in\nEnglish with various international accents and dialects – purported to be associated with\nsupport organizations trusted by the user.\n\nOnce the attacker had obtained initial access, they enrolled a series of new devices for MFA\nand authenticated successfully to the Cisco VPN. The attacker then escalated to\nadministrative privileges, allowing them to login to multiple systems, which alerted our Cisco\nSecurity Incident Response Team (CSIRT), who subsequently responded to the incident.\nThe actor in question dropped a variety of tools, including remote access tools like LogMeIn\nand TeamViewer, offensive security tools such as Cobalt Strike, PowerSploit, Mimikatz, and\nImpacket, and added their own backdoor accounts and persistence mechanisms.\n\n## Post-compromise TTPs\n\nFollowing initial access to the environment, the threat actor conducted a variety of activities\nfor the purposes of maintaining access, minimizing forensic artifacts, and increasing their\nlevel of access to systems within the environment.\n\nOnce on a system, the threat actor began to enumerate the environment, using common\nbuilt-in Windows utilities to identify the user and group membership configuration of the\nsystem, hostname, and identify the context of the user account under which they were\n\n\n-----\n\noperating. We periodically observed the attacker issuing commands containing typographical\nerrors, indicating manual operator interaction was occurring within the environment.\n\nAfter establishing access to the VPN, the attacker then began to use the compromised user\naccount to logon to a large number of systems before beginning to pivot further into the\nenvironment. They moved into the Citrix environment, compromising a series of Citrix\nservers and eventually obtained privileged access to domain controllers.\n\nAfter obtaining access to the domain controllers, the attacker began attempting to dump\nNTDS from them using “ntdsutil.exe” consistent with the following syntax:\n```\npowershell ntdsutil.exe 'ac i ntds' 'ifm' 'create full c:\\users\\public' q q\n\n```\nThey then worked to exfiltrate the dumped NTDS over SMB (TCP/445) from the domain\ncontroller to the VPN system under their control.\n\nAfter obtaining access to credential databases, the attacker was observed leveraging\nmachine accounts for privileged authentication and lateral movement across the\nenvironment.\n\nConsistent with activity we previously observed in other separate but similar attacks, the\nadversary created an administrative user called “z” on the system using the built-in Windows\n“net.exe” commands. This account was then added to the local Administrators group. We\nalso observed instances where the threat actor changed the password of existing local user\naccounts to the same value shown below. Notably, we have observed the creation of the “z”\naccount by this actor in previous engagements prior to the Russian invasion of Ukraine.\n```\nC:\\Windows\\system32\\net user z Lh199211* /add\nC:\\Windows\\system32\\net localgroup administrators z /add\n\n```\nThis account was then used in some cases to execute additional utilities, such as adfind or\nsecretsdump, to attempt to enumerate the directory services environment and obtain\nadditional credentials. Additionally, the threat actor was observed attempting to extract\nregistry information, including the SAM database on compromised windows hosts.\n```\nreg save hklm\\system system\nreg save hklm\\sam sam\nreg save HKLM\\security sec\n\n```\nOn some systems, the attacker was observed employing MiniDump from Mimikatz to dump\nLSASS.\n```\ntasklist | findstr lsass\n\n```\n\n-----\n\n```\nrundll32.exe C:\\windows\\System32\\comsvcs.dll, MiniDump [LSASS_PID]\nC:\\windows\\temp\\lsass.dmp full\n\n```\nThe attacker also took steps to remove evidence of activities performed on compromised\nsystems by deleting the previously created local Administrator account. They also used the\n“wevtutil.exe” utility to identify and clear event logs generated on the system.\n```\nwevtutil.exe el\nwevtutil.exe cl [LOGNAME]\n\n```\nIn many cases, we observed the attacker removing the previously created local administrator\naccount.\n```\nnet user z /delete\n\n```\nTo move files between systems within the environment, the threat actor often leveraged\nRemote Desktop Protocol (RDP) and Citrix. We observed them modifying the host-based\nfirewall configurations to enable RDP access to systems.\n```\nnetsh advfirewall firewall set rule group=remote desktop new enable=Yes\n\n```\nWe also observed the installation of additional remote access tools, such as TeamViewer\nand LogMeIn.\n```\nC:\\Windows\\System32\\msiexec.exe /i C:\\Users\\[USERNAME]\\Pictures\\LogMeIn.msi\n\n```\nThe attacker frequently leveraged Windows logon bypass techniques to maintain the ability\nto access systems in the environment with elevated privileges. They frequently relied upon\nPSEXESVC.exe to remotely add the following Registry key values:\n```\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution\nOptions\\narrator.exe /v Debugger /t REG_SZ /d C:\\windows\\system32\\cmd.exe /f\nHKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Image File Execution\nOptions\\sethc.exe /v Debugger /t REG_SZ /d C:\\windows\\system32\\cmd.exe /f\n\n```\nThis enabled the attacker to leverage the accessibility features present on the Windows\nlogon screen to spawn a SYSTEM level command prompt, granting them complete control of\nthe systems. In several cases, we observed the attacker adding these keys but not further\ninteracting with the system, possibly as a persistence mechanism to be used later as their\nprimary privileged access is revoked.\n\nThroughout the attack, we observed attempts to exfiltrate information from the environment.\nWe confirmed that the only successful data exfiltration that occurred during the attack\nincluded the contents of a Box folder that was associated with a compromised employee’s\naccount and employee authentication data from active directory. The Box data obtained by\nthe adversary in this case was not sensitive\n\n\n-----\n\nIn the weeks following the eviction of the attacker from the environment, we observed\ncontinuous attempts to re-establish access. In most cases, the attacker was observed\ntargeting weak password rotation hygiene following mandated employee password resets.\nThey primarily targeted users who they believed would have made single character changes\nto their previous passwords, attempting to leverage these credentials to authenticate and\nregain access to the Cisco VPN. The attacker was initially leveraging traffic anonymization\nservices like Tor; however, after experiencing limited success, they switched to attempting to\nestablish new VPN sessions from residential IP space using accounts previously\ncompromised during the initial stages of the attack. We also observed the registration of\nseveral additional domains referencing the organization while responding to the attack and\ntook action on them before they could be used for malicious purposes.\n\nAfter being successfully removed from the environment, the adversary also repeatedly\nattempted to establish email communications with executive members of the organization but\ndid not make any specific threats or extortion demands. In one email, they included a\nscreenshot showing the directory listing of the Box data that was previously exfiltrated as\ndescribed earlier. Below is a screenshot of one of the received emails. The adversary\nredacted the directory listing screenshot prior to sending the email.\n\n## Backdoor analysis\n\n\n-----\n\nThe actor dropped a series of payloads onto systems, which we continue to analyze. The\nfirst payload is a simple backdoor that takes commands from a command and control (C2)\nserver and executes them on the end system via the Windows Command Processor. The\ncommands are sent in JSON blobs and are standard for a backdoor. There is a\n“DELETE_SELF” command that removes the backdoor from the system completely. Another,\nmore interesting, command, “WIPE”, instructs the backdoor to remove the last executed\ncommand from memory, likely with the intent of negatively impacting forensic analysis on any\nimpacted hosts.\n\nCommands are retrieved by making HTTP GET requests to the C2 server using the following\nstructure:\n```\n/bot/cmd.php?botid=%.8x\n\n```\nThe malware also communicates with the C2 server via HTTP GET requests that feature the\nfollowing structure:\n```\n/bot/gate.php?botid=%.8x\n\n```\nFollowing the initial request from the infected system, the C2 server responds with a SHA256\nhash. We observed additional requests made every 10 seconds.\n\nThe aforementioned HTTP requests are sent using the following user-agent string:\n```\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko)\nChrome/99.0.4844.51 Safari/537.36 Edg/99.0.1150.36 Trailer/95.3.1132.33\n\n```\nThe malware also creates a file called “bdata.ini” in the malware’s current working directory\nthat contains a value derived from the volume serial number present on the infected system.\nIn instances where this backdoor was executed, the malware was observed running from the\nfollowing directory location:\n```\nC:\\users\\public\\win\\cmd.exe\n\n```\nThe attacker was frequently observed staging tooling in directory locations under the Public\nuser profile on systems from which they were operating.\n\nBased upon analysis of C2 infrastructure associated with this backdoor, we assess that the\nC2 server was set up specifically for this attack.\n\n## Attack attribution\n\n\n-----\n\nBased upon artifacts obtained, tactics, techniques, and procedures (TTPs) identified,\ninfrastructure used, and a thorough analysis of the backdoor utilized in this attack, we assess\nwith moderate to high confidence that this attack was conducted by an adversary that has\nbeen previously identified as an initial access broker (IAB) with ties to both UNC2447 and\nLapsus$. IABs typically attempt to obtain privileged access to corporate network\nenvironments and then monetize that access by selling it to other threat actors who can then\nleverage it for a variety of purposes. We have also observed previous activity linking this\nthreat actor to the Yanluowang ransomware gang, including the use of the Yanluowang data\nleak site for posting data stolen from compromised organizations.\n\nUNC2447 is a financially-motivated threat actor with a nexus to Russia that has been\npreviously observed conducting ransomware attacks and leveraging a technique known as\n“double extortion,” in which data is exfiltrated prior to ransomware deployment in an attempt\nto coerce victims into paying ransom demands. Prior reporting indicates that UNC2447 has\nbeen observed operating a variety of ransomware, including FIVEHANDS, HELLOKITTY,\nand more.\n\nApart from UNC2447, some of the TTPs discovered during the course of our investigation\nmatch those of the Lapsus$. Lapsus$ is a threat actor group that is reported to have been\nresponsible for several previous notable breaches of corporate environments. Several\n[arrests of Lapsus$ members were reported earlier this year. Lapsus$ has been observed](https://www.theverge.com/2022/3/24/22994563/lapsus-hacking-group-london-police-arrest-microsoft-nvidia)\ncompromising corporate environments and attempting to exfiltrate sensitive information.\n\nWhile we did not observe ransomware deployment in this attack, the TTPs used were\nconsistent with “pre-ransomware activity,” activity commonly observed leading up to the\ndeployment of ransomware in victim environments. Many of the TTPs observed are\nconsistent with activity observed by CTIR during previous engagements. Our analysis also\nsuggests reuse of server-side infrastructure associated with these previous engagements as\nwell. In previous engagements, we also did not observe deployment of ransomware in the\nvictim environments.\n\n## Cisco response and recommendations\n\nCisco implemented a company-wide password reset immediately upon learning of the\nincident. CTIR previously observed similar TTPs in numerous investigations since 2021. Our\nfindings and subsequent security protections resulting from those customer engagements\nhelped us slow and contain the attacker’s progression. We created two ClamAV signatures,\nwhich are listed below.\n\nWin.Exploit.Kolobko-9950675-0\nWin.Backdoor.Kolobko-9950676-0\n\n\n-----\n\nThreat actors commonly use social engineering techniques to compromise targets, and\ndespite the frequency of such attacks, organizations continue to face challenges mitigating\nthose threats. User education is paramount in thwarting such attacks, including making sure\nemployees know the legitimate ways that support personnel will contact users so that\nemployees can identify fraudulent attempts to obtain sensitive information.\n\nGiven the actor’s demonstrated proficiency in using a wide array of techniques to obtain\ninitial access, user education is also a key part of countering MFA bypass techniques.\nEqually important to implementing MFA is ensuring that employees are educated on what to\ndo and how to respond if they get errant push requests on their respective phones. It is also\nessential to educate employees about who to contact if such incidents do arise to help\ndetermine if the event was a technical issue or malicious.\n\nFor Duo it is beneficial to implement strong device verification by enforcing stricter controls\naround device status to limit or block enrollment and access from unmanaged or unknown\ndevices. Additionally, leveraging risk detection to highlight events like a brand-new device\nbeing used from unrealistic location or attack patterns like logins brute force can help detect\nunauthorized access.\n\nPrior to allowing VPN connections from remote endpoints, ensure that posture checking is\nconfigured to enforce a baseline set of security controls. This ensures that the connecting\ndevices match the security requirements present in the environment. This can also prevent\nrogue devices that have not been previously approved from connecting to the corporate\nnetwork environment.\n\nNetwork segmentation is another important security control that organizations should employ,\nas it provides enhanced protection for high-value assets and also enables more effective\ndetection and response capabilities in situations where an adversary is able to gain initial\naccess into the environment.\n\nCentralized log collection can help minimize the lack of visibility that results when an attacker\ntake active steps to remove logs from systems. Ensuring that the log data generated by\nendpoints is centrally collected and analyzed for anomalous or overtly malicious behavior\ncan provide early indication when an attack is underway.\n\nIn many cases, threat actors have been observed targeting the backup infrastructure in an\nattempt to further remove an organization’s ability to recover following an attack. Ensuring\nthat backups are offline and periodically tested can help mitigate this risk and ensure an\norganization’s ability to effectively recover following an attack.\n\n\n-----\n\nAuditing of command line execution on endpoints can also provide increased visibility into\nactions being performed on systems in the environment and can be used to detect\nsuspicious execution of built-in Windows utilities, which is commonly observed during\nintrusions where threat actors rely on benign applications or utilities already present in the\nenvironment for enumeration, privilege escalation, and lateral movement activities.\n\n## Mitre ATT&CK mapping\n\nAll of the previously described TTPs that were observed in this attack are listed below based\non the phase of the attack in which they occurred.\n\n### Initial Access\n\n[ATT&CK Technique : Phishing (T1566)](https://attack.mitre.org/techniques/T1566/)\n[ATT&CK Technique : Valid Accounts (T1078)](https://attack.mitre.org/techniques/T1078/)\n\n### Execution\n\n[ATT&CK Technique : System Services: Service Execution (T1569.002)](https://attack.mitre.org/techniques/T1569/002/)\n\n### Persistence\n\n[ATT&CK Technique : Create Account: Local Account (T1136.001)](https://attack.mitre.org/techniques/T1136/001/)\n[ATT&CK Technique : Account Manipulation: Device Registration (T1098.005)](https://attack.mitre.org/techniques/T1098/005/)\n\n### Privilege Escalation\n\nATT&CK Technique : Event Triggered Execution: Image File Execution Options Injection\n(T1546.012)\n\n### Defense Evasion\n\n[ATT&CK Technique : Indicator Removal on Host (T1070)](https://attack.mitre.org/techniques/T1070/)\n[ATT&CK Technique : Indicator Removal on Host: Clear Windows Event Logs (T1070.001)](https://attack.mitre.org/techniques/T1070/001/)\n[ATT&CK Technique : Masquerading: Match Legitimate Name or Location (T1036.005)](https://attack.mitre.org/techniques/T1036/005/)\n[ATT&CK Technique : Impair Defenses: Disable or Modify System Firewall (T1562.004)](https://attack.mitre.org/techniques/T1562/004/)\n[ATT&CK Technique : Modify Registry (T1112)](https://attack.mitre.org/techniques/T1112/)\n\n\n-----\n\n### Credential Access\n\n[ATT&CK Technique : OS Credential Dumping: LSASS Memory (T1003.001)](https://attack.mitre.org/techniques/T1003/001/)\n[ATT&CK Technique : OS Credential Dumping: Security Account Manager (T1003.002)](https://attack.mitre.org/techniques/T1003/002/)\n[ATT&CK Technique : OS Credential Dumping: NTDS (T1003.003)](https://attack.mitre.org/techniques/T1003/003/)\n[ATT&CK Technique : Multi-Factor Authentication Request Generation (T1621)](https://attack.mitre.org/techniques/T1621/)\n\n### Lateral Movement\n\n[ATT&CK Technique : Remote Services (T1021)](https://attack.mitre.org/techniques/T1021/)\n\n### Discovery\n\n[ATT&CK Technique : Query Registry (T1012)](https://attack.mitre.org/techniques/T1012/)\n\n### Command and Control\n\n[ATT&CK Technique : Application Layer Protocol: Web Protocols (T1071.001)](https://attack.mitre.org/techniques/T1071/001/)\n[ATT&CK Technique : Remote Access Software (T1219)](https://attack.mitre.org/techniques/T1219/)\n[ATT&CK Technique: Encrypted Channel: Asymmetric Cryptography (T1573.002)](https://attack.mitre.org/techniques/T1573/002/)\n[ATT&CK Technique : Proxy: Multi-hop Proxy (T1090.003)](https://attack.mitre.org/techniques/T1090/003/)\n\n### Exfiltration\n\n[ATT&CK Technique : Exfiltration Over Alternative Protocol (T1048)](https://attack.mitre.org/techniques/T1048/)\n\n## Indicators of compromise\n\nThe following indicators of compromise were observed associated with this attack.\n\n### Hashes (SHA256)\n\n184a2570d71eedc3c77b63fd9d2a066cd025d20ceef0f75d428c6f7e5c6965f3\n2fc5bf9edcfa19d48e235315e8f571638c99a1220be867e24f3965328fe94a03\n542c9da985633d027317e9a226ee70b4f0742dcbc59dfd2d4e59977bb870058d\n61176a5756c7b953bc31e5a53580d640629980a344aa5ff147a20fb7d770b610\n753952aed395ea845c52e3037f19738cfc9a415070515de277e1a1baeff20647\n8df89eef51cdf43b2a992ade6ad998b267ebb5e61305aeb765e4232e66eaf79a\n8e5733484982d0833abbd9c73a05a667ec2d9d005bbf517b1c8cd4b1daf57190\n\n\n-----\n\n99be6e7e31f0a1d7eebd1e45ac3b9398384c1f0fa594565137abb14dc28c8a7f\nbb62138d173de997b36e9b07c20b2ca13ea15e9e6cd75ea0e8162e0d3ded83b7\neb3452c64970f805f1448b78cd3c05d851d758421896edd5dfbe68e08e783d18\n\n### IP Addresses\n\n104.131.30[.]201\n108.191.224[.]47\n131.150.216[.]118\n134.209.88[.]140\n138.68.227[.]71\n139.177.192[.]145\n139.60.160[.]20\n139.60.161[.]99\n143.198.110[.]248\n143.198.131[.]210\n159.65.246[.]188\n161.35.137[.]163\n162.33.177[.]27\n162.33.178[.]244\n162.33.179[.]17\n165.227.219[.]211\n165.227.23[.]218\n165.232.154[.]73\n166.205.190[.]23\n167.99.160[.]91\n172.56.42[.]39\n172.58.220[.]52\n172.58.239[.]34\n174.205.239[.]164\n176.59.109[.]115\n178.128.171[.]206\n185.220.100[.]244\n185.220.101[.]10\n185.220.101[.]13\n185.220.101[.]15\n185.220.101[.]16\n185.220.101[.]2\n185.220.101[.]20\n185.220.101[.]34\n185.220.101[.]45\n\n\n-----\n\n185.220.101[.]6\n185.220.101[.]65\n185.220.101[.]73\n185.220.101[.]79\n185.220.102[.]242\n185.220.102[.]250\n192.241.133[.]130\n194.165.16[.]98\n195.149.87[.]136\n24.6.144[.]43\n45.145.67[.]170\n45.227.255[.]215\n45.32.141[.]138\n45.32.228[.]189\n45.32.228[.]190\n45.55.36[.]143\n45.61.136[.]207\n45.61.136[.]5\n45.61.136[.]83\n46.161.27[.]117\n5.165.200[.]7\n52.154.0[.]241\n64.227.0[.]177\n64.4.238[.]56\n65.188.102[.]43\n66.42.97[.]210\n67.171.114[.]251\n68.183.200[.]63\n68.46.232[.]60\n73.153.192[.]98\n74.119.194[.]203\n74.119.194[.]4\n76.22.236[.]142\n82.116.32[.]77\n87.251.67[.]41\n94.142.241[.]194\n\n### Domains\n\ncisco-help[.]cf\ncisco-helpdesk[.]cf\n\n\n-----\n\nciscovpn1[.]com\nciscovpn2[.]com\nciscovpn3[.]com\ndevcisco[.]com\ndevciscoprograms[.]com\nhelpzonecisco[.]com\nkazaboldu[.]net\nmycisco[.]cf\nmycisco[.]gq\nmycisco-helpdesk[.]ml\nprimecisco[.]com\npwresetcisco[.]com\n\n### Email Addresses\n\ncostacancordia[@]protonmail[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-10 - Cisco Talos shares insights related to recent cyber attack on Cisco.pdf"
    ],
    "report_names": [
        "2022-08-10 - Cisco Talos shares insights related to recent cyber attack on Cisco.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf1c7efe-4464-4347-95d3-c86fb4d7db51",
            "created_at": "2022-10-25T16:07:24.35977Z",
            "updated_at": "2025-03-27T02:02:10.189727Z",
            "deleted_at": null,
            "main_name": "UNC2447",
            "aliases": [],
            "source_name": "ETDA:UNC2447",
            "tools": [
                "7-Zip",
                "AdFind",
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "DEATHRANSOM",
                "DeathRansom",
                "FIVEHANDS",
                "FOXGRABBER",
                "HELLOKITTY",
                "HelloKitty",
                "KittyCrypt",
                "Mimikatz",
                "PCHUNTER",
                "RCLONE",
                "ROUTERSCAN",
                "Ragnar Locker",
                "RagnarLocker",
                "Rclone",
                "S3BROWSER",
                "SombRAT",
                "Thieflock",
                "WARPRISM",
                "cobeacon",
                "deathransom",
                "wacatac"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "065b7ea2-5920-4270-824e-94ea8a79d197",
            "created_at": "2023-12-08T02:00:05.747632Z",
            "updated_at": "2025-03-27T02:00:03.265128Z",
            "deleted_at": null,
            "main_name": "UNC2447",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2447",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536145,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1660795132,
    "ts_modification_date": 1660795132,
    "files": {
        "pdf": "https://archive.orkl.eu/558e123a976f75ff439fd1633aec9266b6646f75.pdf",
        "text": "https://archive.orkl.eu/558e123a976f75ff439fd1633aec9266b6646f75.txt",
        "img": "https://archive.orkl.eu/558e123a976f75ff439fd1633aec9266b6646f75.jpg"
    }
}