{
    "id": "7b5ce61b-7231-4672-b7fc-302e1cbd54ed",
    "created_at": "2023-01-12T15:08:11.504158Z",
    "updated_at": "2025-03-27T02:05:43.150613Z",
    "deleted_at": null,
    "sha1_hash": "c3ef6bad8fe5e5895ca491ba14dd8eb26d20b4e9",
    "title": "2016-03-30 - Ransomware Deployed by Adversary with Established Foothold",
    "authors": "",
    "file_creation_date": "2022-05-28T18:16:12Z",
    "file_modification_date": "2022-05-28T18:16:12Z",
    "file_size": 88673,
    "plain_text": "# Ransomware Deployed by Adversary with Established Foothold\n\n**[secureworks.com/blog/ransomware-deployed-by-adversary](https://www.secureworks.com/blog/ransomware-deployed-by-adversary)**\n\nCounter Threat Unit Research Team\n\n## A threat actor deployed ransomware weeks to months after compromising the system.\n\nDuring February and March of 2016, SecureWorks analysts responded to several\nransomware incidents that appear to have been initiated by the same threat group or threat\nactor. The analysts determined that the infections did not occur from victims clicking a link or\nopening an email attachment, but rather from a threat actor accessing the infrastructure\nthrough an under-managed, Java-based enterprise application platform, performing\nreconnaissance of the infrastructure, and then purposefully deploying ransomware to a\nnumber of systems (typically servers) within the infrastructure.\n\nThe adversary initially accessed the infrastructure through the JBoss enterprise application\nplatform. Log analysis revealed use of various versions of the JBoss exploitation tool known\nas [JexBoss. Figure 1 shows one of the first indicators of compromise discovered in the](https://github.com/joaomatosf/jexboss/)\nJBoss application logs (in this case, JBoss version 6.1.0). At a later stage of the incident, the\n[threat actor deployed the REGeorg SOCKS proxy.](https://github.com/sensepost/reGeorg)\n\n_Figure 1. JBoss log excerpt showing indicator of compromise. (Source: SecureWorks)_\n\n[After gaining system access in one of the incidents, the adversary used the mimikatz tool to](http://blog.gentilkiwi.com/mimikatz)\ncollect credentials and then used the compromised credentials to log into user accounts and\nperform additional actions within the infrastructure. The analysts also observed the threat\nactor creating a user account named “jboss,” which in most cases was a local administrator\naccount on the compromised JBoss system.\n\n\n-----\n\nIn several of the analyzed incidents, the adversary then performed reconnaissance of the\n[infrastructure by downloading, installing, and executing the SystemTools Hyena network](http://www.systemtools.com/hyena/)\nscanning tool. Using appropriate credentials, the threat actor could collect information (e.g.,\ninstalled software, configuration settings, users, groups) from networked systems. The\nadversary also used Visual Basic scripts (*.vbs files) to download additional tools, as well as\nbatch files to automate a number of rudimentary tasks. For example, one batch file was used\nto parse a list of system names and ping each with a single packet, creating separate lists for\navailable and unavailable systems.\n\n[Once a list of systems is finalized, the adversary uses several tactics to deploy the Samas](https://www.microsoft.com/security/portal/threat/encyclopedia/Entry.aspx?Name=Ransom:MSIL/Samas)\n[ransomware. SecureWorks analysts located this ransomware in files named samsam.exe](http://www.intelsecurity.com/advanced-threat-research/content/Analysis_SamSa_Ransomware.pdf)\nand sqlsrvtmg1.exe. The analysts also found the batch files used to deploy and execute the\nransomware, indications that the threat actor used the PsExec remote process execution\ntool, and artifacts that indicate that the adversary used the Remote Desktop Client to connect\nto additional systems within the infrastructure.\n\nThe victims engaged SecureWorks shortly after files were encrypted because employees\ncould not access data required for their daily work and operations. In all cases, the adversary\nhad initially compromised the JBoss server several weeks or several months before\n[deploying the ransomware. Endpoint security and detection mechanisms such as the](https://www.secureworks.com/404?item=web%3a%7b74EA957A-E2EC-410B-8532-73C744ABCAFC%7d%40en)\n[SecureWorks Advanced Endpoint Threat Detection (AETD) service might have detected the](https://www.secureworks.com/404?item=web%3a%7b74EA957A-E2EC-410B-8532-73C744ABCAFC%7d%40en)\nmalicious activity before the threat actors encrypted the files.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-03-30 - Ransomware Deployed by Adversary with Established Foothold.pdf"
    ],
    "report_names": [
        "2016-03-30 - Ransomware Deployed by Adversary with Established Foothold.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536091,
    "ts_updated_at": 1743041143,
    "ts_creation_date": 1653761772,
    "ts_modification_date": 1653761772,
    "files": {
        "pdf": "https://archive.orkl.eu/c3ef6bad8fe5e5895ca491ba14dd8eb26d20b4e9.pdf",
        "text": "https://archive.orkl.eu/c3ef6bad8fe5e5895ca491ba14dd8eb26d20b4e9.txt",
        "img": "https://archive.orkl.eu/c3ef6bad8fe5e5895ca491ba14dd8eb26d20b4e9.jpg"
    }
}