{
    "id": "7b6a5f5c-5800-444d-bae4-8e124326a7b2",
    "created_at": "2023-01-12T15:02:43.09756Z",
    "updated_at": "2025-03-27T02:14:22.266127Z",
    "deleted_at": null,
    "sha1_hash": "b3934f3300aba548841499a5c16d110a137b58f2",
    "title": "2021-06-29 - HADES ransomware operators continue attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T19:19:40Z",
    "file_modification_date": "2022-05-28T19:19:40Z",
    "file_size": 1110739,
    "plain_text": "# HADES ransomware operators continue attacks\n\n**accenture.com/us-en/blogs/security/ransomware-hades**\n\nShare\n\n**RISE FROM THE ASHES! HADES RANSOMWARE OPERATORS CONTINUE TO**\n**PROLIFERATE ATTACKS, DEPLOYING NEW VARIANTS ALONG THE WAY.**\n\nAccenture Security – Cyber Investigations, Forensic & Response (CIFR), Accenture Cyber\nThreat Intelligence (ACTI)\n\n**Executive Summary**\n\nIn March 2021, Accenture Security identified a previously unknown financially\nmotivated threat group using the self-proclaimed Hades ransomware variant in\ncybercrime operations that impacted multiple victims.\nSince the March reporting, additional victims have been targeted in the consumer\ngoods & services, insurance, and manufacturing & distribution industry verticals.\nAccenture security assesses with a moderate-to-high level of confidence that in\naddition to the Hades variant, the threat group has added at least one new\nransomware variant to their arsenal, Phoenix Cryptolocker, possibly to deter\nattribution claims or campaign links.\n\n\n-----\n\nTactics, Techniques and Procedures (TTPs) employed by the threat group have\nremained relatively consistent over time, including significant overlap in intrusion sets\nacross known victims.\nHowever, some unique and destructive actions were observed across intrusions, such\nas targeted enumeration of cloud environments and destruction of cloud-native\nbackups or snapshots.\nAccenture Security assesses with moderate confidence that the threat group does not\noperate under an affiliate-based model or ransomware as a service (RaaS) operation.\n[While previous industry reporting by Crowdstrike and](https://www.crowdstrike.com/blog/hades-ransomware-successor-to-indrik-spiders-wastedlocker/) [SecureWorks attribute the](https://www.secureworks.com/blog/hades-ransomware-operators-use-distinctive-tactics-and-infrastructure)\noperations to Evil Corp and Gold Winter respectively, Accenture Security is not yet\nable to confidently make attribution claims based on observed intrusion clusters.\n\nThe information outlined in this blog is based on collection from CIFR incident response\nengagements, threat intelligence insights, Open-Source Intelligence (OSINT), and various\nmedia and industry reports.\n\nThis is a developing story; additional technical analysis of the intrusion clusters, attacker\nTTPs and Indicators of Compromise (IOCs) will be released to the community in a separate\nblog post.\n\n<<< Start >>>\n\n[Ransomware response and recovery](https://www.accenture.com/us-en/insights/security/ransomware-response-recovery)\n\n[READ MORE](https://www.accenture.com/us-en/insights/security/ransomware-response-recovery)\n\n<<< End >>>\n\n**Summary & timeline update**\n\nAccenture Security assesses with a moderate-to-high level of confidence that a previously\nreported unknown threat group is now using multiple ransomware variants in cybercrime\noperations that have impacted at least seven (7) victims. Based on collection sources, the\n[threat group has been in operations since at least December 2020 and has continued to](https://www.bleepingcomputer.com/news/security/trucking-giant-forward-air-hit-by-new-hades-ransomware-gang/)\ntarget victims through May 2021. Accenture Security also analyzed the group's activities in\nthe context of attribution, victimology, and TTPs employed based on collection from industry\n\n\n-----\n\npublications, OSINT and incident response data. Accenture Security assesses the group s\noperations are well underway, and their activity will likely continue to proliferate into the\nforeseeable future, impacting additional carefully selected victims.\n\n**Victimology update**\n\nBased on our collection sources, we are currently aware of at least seven (7) victims\nspanning multiple industry verticals. Consistent with previous reporting, all known victims\nare large multi-national organizations with annual revenues exceeding $1 billion USD. The\nprofiles of the known victims continue to be a consistent indicator of Big Game Hunting, with\ntarget selection and deployment methods aimed toward high-value payouts.\n\n<<< Start >>>\n\n<<< End >>>\n\n**Commonalities across intrusions**\n\nDespite the numerous similarities in the potentially linked intrusion sets described herein,\nthere are very few similarities between the victims themselves beyond geography. This\nincludes few overlaps in industry vertical, political ideology, or public status.\n\nAs previously noted, the most significant commonality between victims is that they all fall\ninto the category of “big game ransomware targets”12, large companies with the perceived\nability to pay larger ransoms demanded by the threat actors.\n\nIn all cases, the threat actors used a relatively standard toolkit with only minor variations,\nincluding but not limited to the following:\n\nCredential access via VPN and SocGholish malware delivered via a malicious Google\nChrome update were found to be the primary infection vectors across victims.\nAdvanced IP scanner was utilized for reconnaissance.\n\n\n-----\n\nPSexec was used for lateral movement and deployment of the ransomware.\nThe threat actors also made heavy use of Remote Desktop Protocol (RDP) for lateral\nmovement.\nMimikatz was used for credential access.\nSimilar batch files used to disable Microsoft Windows Defender and other antivirus\nsoftware, stop services and clear even logs.\nThreat actors often operated out of the root of C:ProgramData where several\nexecutables tied to the intrusion set were found.\nConsistent use of Cobalt Strike.\nCommonalities in C2 domains were found across intrusions.\nIn at least two (2) intrusions, targeted destruction of backups prior to encryption.\n7zip utility was used to archive data that was then staged and exfiltrated to an\nattacker-controlled server hosted in Mega[.]nz cloud infrastructure, leveraging the\nMEGAsync utility.\n\n**Hades ransomware operations**\n\nAccenture Security assesses that careful target selection and a unique approach to victim\ncommunication, combined with a “lone wolf” approach, also may explain the relatively low\n[number of known victims since Hades was first identified publicly in December 2020. Lone](https://www.bleepingcomputer.com/news/security/trucking-giant-forward-air-hit-by-new-hades-ransomware-gang/)\nwolf ransomware groups typically operate outside of the affiliate-based model and don’t\nconsistently participate in RaaS operations. However, this doesn’t necessarily mean they\nare not a well-resourced group in and of themselves. In addition, consistent with analysis\n[published by SecureWorks, the ACTI team did not identify related activity on underground](https://www.secureworks.com/blog/hades-ransomware-operators-use-distinctive-tactics-and-infrastructure)\nforums and criminal marketplaces, further supporting our assessment.\n\nBased on updated intrusion data from incident response engagements, the operators tailor\ntheir tactics and tooling to carefully selected targets and run a more “hands on keyboard”\noperation to inflict maximum damage and higher payouts. This includes multi-million-dollar\n(USD) ransom demands, and in at least two (2) instances, successful payment. However,\nwhile portions of each intrusion chain may seem “novel” in nature, their approach suggests\na moderate level of operational and technical sophistication, as the operators leverage a\nmostly standard toolkit and often use “noisy” approaches for reconnaissance. In at least one\ninstance, the targeted organization successfully deterred the attack before impact, so the\nintended action on objectives are unknown.\n\n**Compromise Activity & Detection Opportunities**\n\n_Initial Access_\n\nThe primary methods for initial access into the victim’s network includes internet-facing\nsystems via Remote Desktop Protocol (RDP) or Virtual Private Network (VPN) using\nlegitimate credentials, as well as SocGholish malware delivered via fake Chrome browser\nupdates.\n\n\n-----\n\n_Persistence_\nThe use of legitimate credentials, service creation, and distribution of Command and\n[Control (C2) beacons across victim environments through the use of Cobalt Strike and](https://attack.mitre.org/software/S0154/)\n[Empire, seem to be the predominant approach used by the threat group to further their](https://attack.mitre.org/software/S0363/)\nfoothold and maintain persistence.\nIn addition, consistent with previous reporting, the threat actors operated out of the root of\nC:ProgramData where several executables tied to the intrusion set were found.\n\n_Privilege Escalation_\nCredential harvesting and subsequent privilege escalation achieved through the use of\ntooling to include mimikatz and manual enumeration of credentials found within files.\n\n_Defense Evasion_\nImpeding defenses was achieved through use of domain administrator credentials and\nincludes the following:\n\nBatch script that leverages wevtutil.exe to clear event logs on impacted hosts\nDisabling Anti-Virus (AV) products on endpoints\nModification of GPO to disable windows audit logging\nManually disabling Endpoint Detection & Response (EDR) tools and prevention\npolicies through the user interface\n\n_Discovery_\nObserved multiple methods for internal network reconnaissance, including various\nreconnaissance scripts and tools such as Advanced Port Scanner used to collect network,\nhost, and domain information.\n\n_Lateral Movement_\nLateral movement accomplished via compromised accounts obtained during internal\nreconnaissance activities. Remote Desktop Protocol (RDP) and PSexec were also\nleveraged for host-to-host lateral movement.\n\nIn one incident, the threat actor installed a custom build of Chrome.exe and leveraged the\nnative browser capabilities to manually target the victim’s cloud environments. This activity\nincluded enumeration of high-value accounts and targeted destruction of data and backups\nthrough the cloud management console.\n\nIn addition, the attempted use of KeeThief for lateral movement was observed. This tool is\noften used by threat actors to abuse credentials stored in KeePass databases. Specifically,\nthreat actors deployed an instance of KeeThief.ps1—an open-source PowerShell package\nwritten in 2016 designed to compromise credentials stored in memory on a system with an\nopen KeePass database.\n\n\n-----\n\n_Command and Control_\nIn most of the recent incidents, the threat actors utilized the ubiquitous Cobalt Strike postexploitation framework for command and control within the impacted environments with at\nleast two (2) external beacons per environment. Command and control was also\nestablished using remote manipulator system (RMS).3\n\n_Exfiltration & Impact_\nPrior to deploying ransomware, the unknown threat group has employed the 7zip utility to\narchive data that was then staged and exfiltrated to an attacker-controlled server hosted in\nMega[.]nz cloud infrastructure, leveraging the MEGAsync utility. In addition to data theft,\nactors deploy ransomware with PSexec to encrypt files identified on the victim network. The\noperators leverage this approach for \"double-extortion\" tactics.\n\n**Mitigation recommendations**\n\nEnsure a robust crisis management and incident response plan are in place in the\nevent of a data breach or ransomware incident.\nConsider developing continuity of operations plans (COOP) that account for\nransomware or wiper attacks that can spread across the business.\n[Employ a resilient backup strategy and architecture using a “no-silo” approach.](https://www.accenture.com/us-en/blogs/cyber-defense/ransomware-resilience-rebuild-in-hours)\nAvoid opening or downloading suspicious links from external sources until confirming\nlegitimacy.\nMaintain best practices against ransomware, such as patching, updating anti-virus\nsoftware, implementing strict network egress policies, and using application\nwhitelisting where feasible.\nInstall and update anti-virus software to proactively identify and protect against\nmalware.\nDeploy Endpoint Detection and Response (EDR) across the environment, targeting at\nleast 90% workload visibility.\nEmploy a strong corporate password policy.\nUse MFA where possible for authenticating corporate accounts to include remote\naccess mechanisms and security tools. Admin accounts should be cross-platform\nMFA enforced.\nSecure Remote Desktop Protocol (RDP) connections with complex passwords, virtual\nprivate networks (VPNs) and Network Level Authentication (NLA), if RDP connections\nmust be used.\nPatch infrastructure to the highest available level, as threat actors are often better\nable to exploit older systems with existing vulnerabilities.\nEncrypt data-at-rest where possible and protect related keys and technology.\nDo not store credentials in files and scripts on shared locations.\nClose password management applications after use.\nWhere possible, deny caching of credentials in memory (e.g., Credential Guard).\n\n\n-----\n\nHunt for attacker TTPs to proactively detect and respond to a ransomware attack in\norder to mitigate impact.\n\n**[MITRE ATT&CK techniques observed](https://attack.mitre.org/)**\n\n**Tactic** **Technique**\n\nInitial access T1133: External Remote Services\n\nT1078: Valid Accounts\n\nT1189: Drive-by Compromise\n\nExecution T1059: Command and Scripting Interpreter\n\nT1086: PowerShell\n\nT1035: Service Execution\n\nPersistence T1078: Valid Accounts\nT1050: New Service\n\nPrivilege escalation T1055: Process Injection\n\nT1078: Valid Accounts\n\nDefense Evasion T1078: Valid Accounts\nT1036: Masquerading\n\nT1027: Obfuscated Files or Information\n\nT1070: Indicator Removal on a Host\n\nT1562: Impair Defenses\n\nCredential Access T1110: Brute Force\n\nT1003: Credential Dumping\n\nDiscovery T1083: File and Directory Discovery\n\nT1082: System Information Discovery\n\nT1087: Account Discovery\n\nT1482: Domain Trust Discovery\n\nT1135: Network Share Discovery\n\nT1069: Permission Groups Discovery\n\nT1018: Remote System Discovery\n\nT1016: System Network Configuration Discovery\n\nLateral Movement T1076: Remote Desktop Protocol\n\nT1028: Windows Remote Management\n\nCollection T1005: Data from Local System\n\nT1039: Data from Network Shared Drive\n\nCommand & Control T1043: Commonly Used Port\n\nT1105: Remote File Copy\n\nT1071: Standard Application Layer Protocol\n\nExfiltration T1002: Data Compressed\n\nT1048: Exfiltration Over Alternative Protocol\n\n\n-----\n\nImpact T1486: Data Encrypted for Impact\n\nT1489: Service Stop\n\nIf you have an incident or need additional information on ways to detect and respond to\ncyberthreats, contact a member of our CIFR team 24/7/365 by phone 888-RISK-411 or\nemail [CIFR.hotline@accenture.com](http://10.10.0.46/mailto:CIFR.hotline@accenture.com)\n\n1https://arstechnica.com/information-technology/2019/10/fbi-warns-of-major-ransomware\n[attacks-as-criminals-go-big-game-hunting/ https://www.ic3.gov/Media/Y2019/PSA191002 2](https://www.ic3.gov/Media/Y2019/PSA191002)\n\n\n[3https://malpedia.caad.fkie.fraunhofer.de/details/win.rms](https://malpedia.caad.fkie.fraunhofer.de/details/win.rms)\n\n**Accenture Security**\n\nAccenture Security is a leading provider of end-to-end cybersecurity services, including\nadvanced cyber defense, applied cybersecurity solutions and managed security operations.\nWe bring security innovation, coupled with global scale and a worldwide delivery capability\nthrough our network of Advanced Technology and Intelligent Operations centers. Helped by\nour team of highly skilled professionals, we enable clients to innovate safely, build cyber\nresilience and grow with confidence. Follow us @AccentureSecure on Twitter or visit us at\n[www.accenture.com/security](http://www.accenture.com/security)\n\nAccenture, the Accenture logo, and other trademarks, service marks, and designs are\nregistered or unregistered trademarks of Accenture and its subsidiaries in the United States\nand in foreign countries. All trademarks are properties of their respective owners. All\nmaterials are intended for the original recipient only. The reproduction and distribution of\nthis material is forbidden without express written permission from Accenture. The opinions,\nstatements, and assessments in this report are solely those of the individual author(s) and\ndo not constitute legal advice, nor do they necessarily reflect the views of Accenture, its\nsubsidiaries, or affiliates. Given the inherent nature of threat intelligence, the content\ncontained in this report is based on information gathered and understood at the time of its\ncreation. It is subject to change. Accenture provides the information on an “as-is” basis\nwithout representation or warranty and accepts no liability for any action or failure to act\ntaken in response to the information contained or referenced in this report.\n\nCopyright © 2021 Accenture. All rights reserved.\n\n\n-----\n\nAccenture Cyber Threat Intelligence\n\nCyber Investigations, Forensics and Response (CIFR)\n\nThe CIFR team helps Accenture’s global clients prepare for, respond to and recover from\ncyber intrusions and minimize business impact.\n\nSubscription Center\n\nSubscribe to Security Blog Subscribe to Security Blog\n\nSubscribe\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-29 - HADES ransomware operators continue attacks.pdf"
    ],
    "report_names": [
        "2021-06-29 - HADES ransomware operators continue attacks.pdf"
    ],
    "threat_actors": [
        {
            "id": "8670f370-1865-4264-9a1b-0dfe7617c329",
            "created_at": "2022-10-25T16:07:23.69953Z",
            "updated_at": "2025-03-27T02:02:09.929725Z",
            "deleted_at": null,
            "main_name": "Hades",
            "aliases": [
                "Operation TrickyMouse"
            ],
            "source_name": "ETDA:Hades",
            "tools": [
                "Brave Prince",
                "Gold Dragon",
                "GoldDragon",
                "Lovexxx",
                "Olympic Destroyer",
                "Running RAT",
                "RunningRAT",
                "SOURGRAPE",
                "running_rat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d0338f31-ace4-4fec-972b-d1ba9815d1de",
            "created_at": "2023-01-06T13:46:39.283728Z",
            "updated_at": "2025-03-27T02:00:03.040061Z",
            "deleted_at": null,
            "main_name": "GOLD WINTER",
            "aliases": [],
            "source_name": "MISPGALAXY:GOLD WINTER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "80300c2f-309a-43c2-9d01-0357a174ad20",
            "created_at": "2024-06-19T02:03:08.140588Z",
            "updated_at": "2025-03-27T02:05:17.405076Z",
            "deleted_at": null,
            "main_name": "GOLD WINTER",
            "aliases": [
                ""
            ],
            "source_name": "Secureworks:GOLD WINTER",
            "tools": [
                " Cobalt Strike",
                " Hades",
                " MEGAsync",
                " MSBuild",
                " Metasploit",
                " Mimikatz",
                " PSexec",
                " SocGholish",
                "Advanced Port Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535763,
    "ts_updated_at": 1743041662,
    "ts_creation_date": 1653765580,
    "ts_modification_date": 1653765580,
    "files": {
        "pdf": "https://archive.orkl.eu/b3934f3300aba548841499a5c16d110a137b58f2.pdf",
        "text": "https://archive.orkl.eu/b3934f3300aba548841499a5c16d110a137b58f2.txt",
        "img": "https://archive.orkl.eu/b3934f3300aba548841499a5c16d110a137b58f2.jpg"
    }
}