{
    "id": "7b85d9dd-442e-4d5e-b1e6-9a208be295ac",
    "created_at": "2023-01-12T15:05:15.223785Z",
    "updated_at": "2025-03-27T02:17:14.426938Z",
    "deleted_at": null,
    "sha1_hash": "2b16f83e927f6e9985c1055cd85c5c50718e315c",
    "title": "2022-06-13 - GALLIUM Expands Targeting Across Telecommunications, Government and Finance Sectors With New PingPull Tool",
    "authors": "",
    "file_creation_date": "2022-06-18T23:17:17Z",
    "file_modification_date": "2022-06-18T23:17:17Z",
    "file_size": 1907467,
    "plain_text": "# GALLIUM Expands Targeting Across Telecommunications, Government and Finance Sectors With New PingPull Tool\n\n**unit42.paloaltonetworks.com/pingpull-gallium/**\n\nUnit 42 June 13, 2022\n\nBy [Unit 42](https://unit42.paloaltonetworks.com/author/unit42/)\n\nJune 13, 2022 at 3:00 AM\n\n[Category: Malware](https://unit42.paloaltonetworks.com/category/malware-2/)\n\nTags: [APT,](https://unit42.paloaltonetworks.com/tag/apt/) [backdoor,](https://unit42.paloaltonetworks.com/tag/backdoor/) [GALLIUM,](https://unit42.paloaltonetworks.com/tag/gallium/) [operation soft cell,](https://unit42.paloaltonetworks.com/tag/operation-soft-cell/) [PingPull,](https://unit42.paloaltonetworks.com/tag/pingpull/) [Remote Access Trojan](https://unit42.paloaltonetworks.com/tag/remote-access-trojan/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/pingpull-gallium/)\n\n## Executive Summary\n\nUnit 42 recently identified a new, difficult-to-detect remote access trojan named PingPull\nbeing used by GALLIUM, an advanced persistent threat (APT) group.\n\nUnit 42 actively monitors infrastructure associated with several APT groups. One group in\nparticular, [GALLIUM (also known as Softcell), established its reputation by targeting](https://attack.mitre.org/groups/G0093/)\ntelecommunications companies operating in Southeast Asia, Europe and Africa. The group’s\n\n\n-----\n\ngeographic targeting, sector-specific focus and technical proficiency, combined with their use\nof known Chinese threat actor malware and tactics, techniques and procedures (TTPs), has\n[resulted in industry assessments that GALLIUM is likely a Chinese state-sponsored group.](https://www.cybereason.com/blog/research/operation-soft-cell-a-worldwide-campaign-against-telecommunications-providers)\n\nOver the past year, this group has extended its targeting beyond telecommunication\ncompanies to also include financial institutions and government entities. During this period,\nwe have identified several connections between GALLIUM infrastructure and targeted\nentities across Afghanistan, Australia, Belgium, Cambodia, Malaysia, Mozambique, the\nPhilippines, Russia and Vietnam. Most importantly, we have also identified the group’s use of\na new remote access trojan named PingPull.\n\nPingPull has the capability to leverage three protocols (ICMP, HTTP(S) and raw TCP) for\ncommand and control (C2). While the use of ICMP tunneling is not a new technique, PingPull\nuses ICMP to make it more difficult to detect its C2 communications, as few organizations\nimplement inspection of ICMP traffic on their networks. This blog provides a detailed\nbreakdown of this new tool as well as the GALLIUM group's recent infrastructure.\n\nPalo Alto Networks customers receive protections from the threats described in this blog\nthrough [Threat Prevention,](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention) [Advanced URL Filtering,](https://www.paloaltonetworks.com/network-security/advanced-url-filtering) [DNS Security,](https://www.paloaltonetworks.com/network-security/dns-security) [Cortex XDR and](https://www.paloaltonetworks.com/cortex/cortex-xdr) [WildFire](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nmalware analysis.\n\nFull visualization of the techniques observed, relevant courses of action and indicators of\n[compromise (IoCs) related to this report can be found in the Unit 42 ATOM viewer.](https://unit42.paloaltonetworks.com/atoms/gallium/)\n\nRelated Unit 42 Topics [Advanced persistent threats](https://unit42.paloaltonetworks.com/tag/apt/)\n\n## Table of Contents\n\nPingPull Malware\n\nICMP Variant\n\nHTTPS Variant\n\nTCP Variant\n\nInfrastructure\n\nProtections and Mitigations\n\nConclusion\n\nAdditional Resources\n\nIndicators of Compromise\n\n## PingPull Malware\n\nPingPull was written in Visual C++ and provides a threat actor the ability to run commands\nand access a reverse shell on a compromised host. There are three variants of PingPull that\nare all functionally the same but use different protocols for communications with their C2:\n\n\n-----\n\nICMP, HTTP(S) and raw TCP. In each of the variants, PingPull will create a custom string\nwith the following structure that it will send to the C2 in all interactions, which we believe the\nC2 server will use to uniquely identify the compromised system:\n\nPROJECT_[uppercase executable name]_[uppercase computer name]_[uppercase\nhexadecimal IP address]\n\nRegardless of the variant, PingPull is capable of installing itself as a service with the\nfollowing description:\n\nProvides tunnel connectivity using IPv6 transition technologies (6to4, ISATAP, Port Proxy,\nand Teredo), and IP-HTTPS. If this service is stopped, the computer will not have the\nenhanced connectivity benefits that these technologies offer.\n\nThe description is the exact same as the legitimate iphlpsvc service, which PingPull\npurposefully attempts to mimic using Iph1psvc for the service name and IP He1per instead of\nIP Helper for the display name. We have also seen a PingPull sample use this same service\ndescription but with a service name of Onedrive.\n\nThe three variants of PingPull have the same commands available within their command\nhandlers. The commands seen in Table 1 show that PingPull has the ability to perform a\nvariety of activities on the file system, as well as the ability to run commands on cmd.exe that\nacts as a reverse shell for the actor.\n\n**Command** **Description**\n\nA Enumerate storage volumes (A: through Z:)\n\nB List folder contents\n\nC Read File\n\nD Write File\n\nE Delete File\n\nF Read file, convert to hexadecimal form\n\nG Write file, convert from hexadecimal form\n\nH Copy file, sets the creation, write, and access times to match original files\n\nI Move file, sets the creation, write, and access times to match original files\n\nJ Create directory\n\nK Timestomp file\n\n\n-----\n\nM Run command via cmd.exe\n\n_Table 1. Commands available in PingPull’s command handler._\n\nTo run a command listed in Table 1, the actor would have the C2 server respond to a\nPingPull beacon with the command and arguments that it encrypts using AES in cipher block\nchaining (CBC) mode and encodes with base64. We have seen two unique AES keys\nbetween the known PingPull samples, specifically P29456789A1234sS and\ndC@133321Ikd!D^i.\n\nPingPull would decrypt the received data and would parse the cleartext for the command and\nadditional arguments in the following structure:\n\n&[AES Key]=[command]&z0=[unknown]&z1=[argument 1]&z2=[argument 2]\n\nWe are not sure of the purpose of the z0 parameter in the command string, as we observed\nPingPull parsing for this parameter but do not see the value being used. To confirm the\nstructure of the command string, we used the following string when issuing commands in our\nanalysis environment, which would instruct PingPull to read the contents of a file at\nC:\\test.txt:\n\n&P29456789A1234sS=C&z0=2&z1=c:\\\\test.txt&z2=none\n\nDuring our analysis, PingPull would respond to the command string above with\nya1JF03nUKLg9TkhDgwvx5MSFIoMPllw1zLMC0h4IwM=, which decodes to and decrypts\n(AES key P29456789A1234sS) to some text in a test file.\\x07\\x07\\x07\\x07\\x07\\x07\\x07,\nwhich is the content (PKCS5_PADDING-padded) of the file C:\\test.txt on our analysis\nsystem.\n\n## ICMP Variant\n\nPingPull samples that use ICMP for C2 communications issue ICMP Echo Request (ping)\npackets to the C2 server. The C2 server will reply to these Echo requests with an Echo Reply\npacket to issue commands to the system. Both the Echo Request and Echo Reply packets\nused by PingPull and its C2 server will have the same structure as follows:\n\n[8-byte value]R[sequence number].[unique identifier string beginning with\n“PROJECT”]\\r\\ntotal=[length of total message]\\r\\ncurrent=[length of current\nmessage]\\r\\n[base64 encoded and AES encrypted data]\n\nWhen issuing a beacon to its C2, PingPull will send an Echo Request packet to the C2\nserver with total and current set to 0 and will include no encoded and encrypted data, as\nseen in Figure 1.\n\n\n-----\n\nFigure 1. PingPull ICMP beacon example with hardcoded 8-byte value.\nThe data section in the ICMP packet in Figure 1 begins with an 8-byte value of\n0x702437047E404103 (\\x03\\x41\\x40\\x7E\\x04\\x37\\x24\\x70) that PingPull has hardcoded in\nits code, which is immediately followed by a hardcoded R. However, another PingPull sample\nthat used ICMP for its C2 communications omitted this 8-byte value, as seen in Figure 2.\n\nFigure 2. PingPull ICMP beacon example without hardcoded 8-byte value.\nAfter the R is a sequence number that increments when sending or receiving data that\nexceeds the maximum size of the ICMP data section. The sequence number is immediately\nfollowed by a period “.” and then the unique identifier string generated by PingPull that\nbegins with PROJECT. The ICMP data section then includes total=[integer] and current=\n\n[integer], which are used by both PingPull and its C2 to determine the total length of the data\ntransmitted and the length of the chunk of data transmitted in the current packet. The data\ntransmitted in each ICMP packet comes in the form of a base64-encoded string of ciphertext\ngenerated using AES and the key specific to the sample. This encoded and encrypted data\ncomes after the new line that immediately follows the “current” value. For instance, when\nresponding to our test command, PingPull sent the ICMP Echo Request packet seen in\nFigure 3 to the C2 server, which has the expected base64-encoded string of\nya1JF03nUKLg9TkhDgwvx5MSFIoMPllw1zLMC0h4IwM= for the results of the command.\n\nFigure 3. PingPull responding to command over ICMP.\n\n## HTTPS Variant\n\n\n-----\n\nAnother variant of PingPull uses HTTPS requests to communicate with its C2 server instead\nof ICMP. The initial beacon uses a POST request over this HTTPS channel, using the unique\nidentifier string generated by PingPull as the URL. Figure 4 is an example POST request\nsent by PingPull as a beacon, where samp.exe was the filename, DESKTOP-U9SM1U2 was\nthe hostname of the analysis system and 172.16.189[.]130 (0xAC10BD82) was the system's\nIP address.\n\nFigure 4. PingPull HTTPS beacon example.The initial beacon is a POST request that did not\nhave any data, which resulted in the Content-Length of 0 within the HTTP headers. When\nresponding with the results to commands, PingPull will issue a second POST request using\nthe same URL structure with the results in the data section in base64-encoded and\nencrypted form using the AES key. Figure 5 shows PingPull responding to our test command\nto read the contents of C:\\test.txt with\nya1JF03nUKLg9TkhDgwvx5MSFIoMPllw1zLMC0h4IwM= in the data section of the POST\nrequest, which decodes and decrypts to some text in a test\nfile.\\x07\\x07\\x07\\x07\\x07\\x07\\x07.\n\nFigure 5. PingPull responding with results of a command over HTTPS.\n\n## TCP Variant\n\nThis variant of PingPull does not use ICMP or HTTPS for C2 communication, rather it uses\nraw TCP for its C2 communication. Much like the other C2 channels, the data sent in this\nbeacon includes the unique identifier string generated by PingPull that begins with\nPROJECT. However, the TCP C2 channel begins with a 4-byte value for the length of data\nthat follows, as seen in the following beacon structure:\n\n[DWORD length of data that follows]PROJECT_[uppercase executable name]_[uppercase\ncomputer name] [uppercase hexadecimal IP address]\n\n\n-----\n\nFigure 6 shows an example of the entire TCP communications channel:\n\nThe beacon sent by PingPull in the first red text.\nThe C2 issuing a command in the blue text.\nPingPull responding to the command in the second red text at the bottom of the image.\n\nFigure 6. PingPull TCP beacon, C2 issuing command and PingPull sending result.\nThe beacon seen in Figure 6 begins with a data length of 44-bytes (0x2c), with the unique\nidentifier string generated where samp_f86ebe.exe was the filename, DESKTOP-U9SM1U2\nwas the hostname of the analysis system and 172.16.189[.]130 (0xAC10BD82) was the\nsystem's IP address. The C2 response to the beacon begins with the data length of 64 bytes\n(0x40) followed by the base64-encoded string that represents the ciphertext of the\ncommand. PingPull ran the command supplied by the C2 and sent the results in a packet\nthat begins with a data length of 44 bytes (0x2c), followed by the expected base64-encoded\nstring of ya1JF03nUKLg9TkhDgwvx5MSFIoMPllw1zLMC0h4IwM= for the results of the\ncommand.\n\n## Infrastructure\n\nOn Sept. 9, 2021, a sample of PingPull named ServerMannger.exe (SHA256:\nde14f22c88e552b61c62ab28d27a617fb8c0737350ca7c631de5680850282761) was shared\nwith the cybersecurity community by an organization in Vietnam. Analysis of this sample\nrevealed that it was configured to call home to t1.hinitial[.]com. Pivoting on the C2, we\nidentified several subdomains hosted under the hinitial[.]com domain that exhibited a similar\nnaming pattern:\n\nt1.hinitial[.]com\n\nv2.hinitial[.]com\n\nv3.hinitial[.]com\n\nv4.hinitial[.]com\n\nv5.hinitial[.]com\n\n\n-----\n\nDigging deeper into these domains, we began to identify overlaps in certificate use between\nthe various IP infrastructure associated with each of the subdomains. One certificate that\nstood out in particular was an oddly configured certificate with a SHA1 of\n76efd8ef3f64059820d937fa87acf9369775ecd5. This certificate was created with a 10-year\nexpiration window, a common name of bbb, and no other details, which immediately raised\nthe question of legitimacy.\n\n\n-----\n\nFigure 7. X.509 certificate associated with hinitial[.]com infrastructure.First seen in\n\n\n-----\n\nSeptember 2020, this certificate was linked to six different IP addresses all hosting a variant\nof the hinitial[.]com subdomains as well as an additional pivot to a dynamic DNS host\n(goodjob36.publicvm[.]com). Continuing this method of pivoting across all of the PingPull\nsamples and their associated C2 domains has resulted in the identification of over 170 IP\naddresses associated with this group dating back to late 2020. The most recent IP\ninfrastructure is provided below for defensive purposes.\n\n## Protections and Mitigations\n\nWe recommend that telecommunications, finance and government organizations located\nacross Southeast Asia, Europe and Africa leverage the indicators of compromise (IoCs)\nbelow to identify any impacts to your organizations.\n\nFor Palo Alto Networks customers, our products and services provide the following coverage\nassociated with this group:\n\n[Cortex XDR detects and protects endpoints from the PingPull malware.](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\n[WildFire cloud-based threat analysis service accurately identifies PingPull malware as](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nmalicious.\n\n[Threat Prevention provides protection against PingPull malware. The “Pingpull Command](https://www.paloaltonetworks.com/products/secure-the-network/subscriptions/threat-prevention)\nand Control Traffic Detection” signature (threat IDs 86625, 86626 and 86627) provides\ncoverage for the ICMP, HTTP(S) and raw TCP C2 traffic.\n\n[Advanced URL Filtering and](https://www.paloaltonetworks.com/network-security/advanced-url-filtering) [DNS Security identify domains associated with this group as](https://www.paloaltonetworks.com/network-security/dns-security)\nmalicious.\n\nUsers of the [AutoFocus contextual threat intelligence service can view malware associated](https://www.paloaltonetworks.com/cortex/autofocus)\nwith these attacks using the PingPull tag.\n\nIf you think you may have been impacted or have an urgent matter, get in touch with the Unit\n42 Incident Response team or call:\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\n## Conclusion\n\nGALLIUM remains an active threat to telecommunications, finance and government\norganizations across Southeast Asia, Europe and Africa. Over the past year, we have\nidentified targeted attacks impacting nine nations. This group has deployed a new capability\n\n\n-----\n\ncalled PingPull in support of its espionage activities, and we encourage all organizations to\nleverage our findings to inform the deployment of protective measures to defend against this\nthreat group.\n\nSpecial thanks to the NSA Cybersecurity Collaboration Center, the Australian Cyber Security\nCentre and other government partners for their collaboration and insights offered in support\nof this research.\n\nPalo Alto Networks has shared these findings, including file samples and indicators of\ncompromise, with our fellow Cyber Threat Alliance members. CTA members use this\nintelligence to rapidly deploy protections to their customers and to systematically disrupt\n[malicious cyber actors. Learn more about the Cyber Threat Alliance.](https://www.cyberthreatalliance.org/)\n\n## Additional Resources\n\n[Mitre - GALLIUM group](https://attack.mitre.org/groups/G0093/)\n\n[Microsoft - GALLIUM: Targeting Global Telecom](https://www.microsoft.com/security/blog/2019/12/12/gallium-targeting-global-telecom/)\n\nCyberReason - Operation Soft Cell: A Worldwide Campaign Against Telecommunications\nProviders\n\n## Indicators of Compromise\n\n### Samples\n\nde14f22c88e552b61c62ab28d27a617fb8c0737350ca7c631de5680850282761\n\nb4aabfb8f0327370ce80970c357b84782eaf0aabfc70f5e7340746f25252d541\n\nfc2147ddd8613f08dd833b6966891de9e5309587a61e4b35408d56f43e72697e\n\nc55ab8fdd060fb532c599ee6647d1d7b52a013e4d8d3223b361db86c1f43e845\n\nf86ebeb6b3c7f12ae98fe278df707d9ebdc17b19be0c773309f9af599243d0a3\n\n8b664300fff1238d6c741ac17294d714098c5653c3ef992907fc498655ff7c20\n\n1ce1eb64679689860a1eacb76def7c3e193504be53ebb0588cddcbde9d2b9fe6\n\n### PingPull C2 Locations\n\ndf.micfkbeljacob[.]com\n\nt1.hinitial[.]com\n\n5.181.25[.]55\n\n92.38.135[.]62\n\n5.8.71[.]97\n\n### Domains\n\n\n-----\n\nmicfkbeljacob[.]com\ndf.micfkbeljacob[.]com\njack.micfkbeljacob[.]com\nhinitial[.]com\nt1.hinitial[.]com\nv2.hinitial[.]com\nv3.hinitial[.]com\nv4.hinitial[.]com\nv5.hinitial[.]com\ngoodjob36.publicvm[.]com\ngoodluck23.jp[.]us\nhelpinfo.publicvm[.]com\nMailedc.publicvm[.]com\n\n### IP Addresses\n\n(Active in last 30 days)\n\n92.38.135[.].62\n\n5.181.25[.]55\n\n5.8.71[.]97\n\n101.36.102[.]34\n\n101.36.102[.]93\n\n101.36.114[.]167\n\n101.36.123[.]191\n\n103.116.47[.]65\n\n103.179.188[.]93\n\n103.22.183[.]131\n\n103.22.183[.]138\n\n103.22.183[.]141\n\n103.22.183[.]146\n\n103.51.145[.]143\n\n103.61.139[.]71\n\n103.61.139[.]72\n\n103.61.139[.]75\n\n103.61.139[.]78\n\n103.61.139[.]79\n\n103.78.242[.]62\n\n118.193.56[.]130\n\n118.193.62[.]232\n\n123.58.196[.]208\n\n123.58.198[.]205\n\n123.58.203[.]19\n\n\n-----\n\n128.14.232[.]56\n152.32.165[.]70\n152.32.203[.]199\n152.32.221[.]222\n152.32.245[.]157\n154.222.238[.]50\n154.222.238[.]51\n165.154.52[.]41\n165.154.70[.]51\n167.88.182[.]166\n176.113.71[.]62\n2.58.242[.]230\n2.58.242[.]231\n2.58.242[.]235\n202.87.223[.]27\n212.115.54[.]54\n37.61.229[.]104\n45.116.13[.]153\n45.128.221[.]61\n45.128.221[.]66\n45.136.187[.]98\n45.14.66[.]230\n45.154.14[.]132\n45.154.14[.]164\n45.154.14[.]188\n45.154.14[.]254\n45.251.241[.]74\n45.251.241[.]82\n45.76.113[.]163\n47.254.192[.]79\n92.223.30[.]232\n92.223.30[.]52\n92.223.90[.]174\n92.223.93[.]148\n92.223.93[.]222\n92.38.139[.]170\n92.38.149[.]101\n92.38.149[.]241\n92.38.171[.]127\n92.38.176[.]47\n107.150.127[.]124\n118.193.56[.]131\n\n\n-----\n\n176.113.71[.]168\n185.239.227[.]12\n194.29.100[.]173\n2.58.242[.]236\n45.128.221[.]182\n45.154.14[.]191\n47.254.250[.]117\n79.133.124[.]88\n103.137.185[.]249\n103.61.139[.]74\n107.150.112[.]211\n107.150.127[.]140\n146.185.218[.]65\n152.32.221[.]242\n165.154.70[.]62\n176.113.68[.]12\n185.101.139[.]176\n188.241.250[.]152\n188.241.250[.]153\n193.187.117[.]144\n196.46.190[.]27\n2.58.242[.]229\n2.58.242[.]232\n37.61.229[.]106\n45.128.221[.]172\n45.128.221[.]186\n45.128.221[.]229\n45.134.169[.]147\n103.170.132[.]199\n107.150.110[.]233\n152.32.255[.]145\n167.88.182[.]107\n185.239.226[.]203\n185.239.227[.]34\n45.128.221[.]169\n45.136.187[.]41\n137.220.55[.]38\n45.133.238[.]234\n103.192.226[.]43\n92.38.149[.]88\n5.188.33[.]237\n146.185.218[.]176\n\n\n-----\n\n43.254.218[.]104\n43.254.218[.]57\n43.254.218[.]98\n92.223.59[.]84\n43.254.218[.]43\n81.28.13[.]48\n89.43.107[.]191\n103.123.134[.]145\n103.123.134[.]161\n103.123.134[.]165\n103.85.24[.]81\n212.115.54[.]241\n43.254.218[.]114\n89.43.107[.]190\n103.123.134[.]139\n103.123.134[.]240\n103.85.24[.]121\n103.169.91[.]93\n103.169.91[.]94\n45.121.50[.]230\n\n_Updated June 13, 2022, at 4:45 a.m. PT_\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-13 - GALLIUM Expands Targeting Across Telecommunications, Government and Finance Sectors With New PingPull Tool.pdf"
    ],
    "report_names": [
        "2022-06-13 - GALLIUM Expands Targeting Across Telecommunications, Government and Finance Sectors With New PingPull Tool.pdf"
    ],
    "threat_actors": [
        {
            "id": "3b8b4ed7-e8cc-4a3a-b14d-c8ebf87c0f9c",
            "created_at": "2023-01-06T13:46:39.062729Z",
            "updated_at": "2025-03-27T02:00:02.988182Z",
            "deleted_at": null,
            "main_name": "Operation Soft Cell",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Soft Cell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9faf32b7-0221-46ac-a716-c330c1f10c95",
            "created_at": "2022-10-25T16:07:23.652281Z",
            "updated_at": "2025-03-27T02:02:09.908624Z",
            "deleted_at": null,
            "main_name": "Gallium",
            "aliases": [
                "Alloy Taurus",
                "Granite Typhoon",
                "Phantom Panda"
            ],
            "source_name": "ETDA:Gallium",
            "tools": [
                "Agentemis",
                "BlackMould",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "Gh0stCringe RAT",
                "HTran",
                "HUC Packet Transmit Tool",
                "LaZagne",
                "Mimikatz",
                "NBTscan",
                "PingPull",
                "Plink",
                "Poison Ivy",
                "PsExec",
                "PuTTY Link",
                "QuarkBandit",
                "Quasar RAT",
                "QuasarRAT",
                "Reshell",
                "SPIVY",
                "SinoChopper",
                "SoftEther VPN",
                "Sword2033",
                "WCE",
                "WinRAR",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Yggdrasil",
                "cobeacon",
                "nbtscan",
                "netcat",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bf3ffe5-09ba-4378-8ea4-a6d748a494fd",
            "created_at": "2022-10-25T15:50:23.264584Z",
            "updated_at": "2025-03-27T02:00:55.414817Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "GALLIUM",
                "Granite Typhoon"
            ],
            "source_name": "MITRE:GALLIUM",
            "tools": [
                "ipconfig",
                "cmd",
                "China Chopper",
                "PoisonIvy",
                "at",
                "PlugX",
                "PingPull",
                "BlackMould",
                "Mimikatz",
                "PsExec",
                "HTRAN",
                "NBTscan",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c87ee2df-e528-4fa0-bed6-6ed29e390688",
            "created_at": "2023-01-06T13:46:39.150432Z",
            "updated_at": "2025-03-27T02:00:03.008665Z",
            "deleted_at": null,
            "main_name": "GALLIUM",
            "aliases": [
                "Red Dev 4",
                "Alloy Taurus",
                "Granite Typhoon"
            ],
            "source_name": "MISPGALAXY:GALLIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "04b07437-41bb-4126-bcbb-def16f19d7c6",
            "created_at": "2022-10-25T16:07:24.232628Z",
            "updated_at": "2025-03-27T02:02:10.146043Z",
            "deleted_at": null,
            "main_name": "Stone Panda",
            "aliases": [
                "APT 10",
                "ATK 41",
                "Bronze Riverside",
                "CTG-5938",
                "CVNX",
                "Cuckoo Spear",
                "Earth Kasha",
                "Granite Taurus",
                "Happyyongzi",
                "Hogfish",
                "ITG01",
                "Operation A41APT",
                "Operation Cache Panda",
                "Operation ChessMaster",
                "Operation Cloud Hopper",
                "Operation Cuckoo Spear",
                "Operation New Battle",
                "Operation Soft Cell",
                "Operation TradeSecret",
                "Potassium",
                "Red Apollo",
                "Stone Panda",
                "TA429",
                "menuPass",
                "menuPass Team"
            ],
            "source_name": "ETDA:Stone Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Anel",
                "AngryRebel",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "BUGJUICE",
                "CHINACHOPPER",
                "ChChes",
                "China Chopper",
                "Chymine",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "DARKTOWN",
                "DESLoader",
                "DILLJUICE",
                "DILLWEED",
                "Darkmoon",
                "DelfsCake",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Ecipekac",
                "Emdivi",
                "EvilGrab",
                "EvilGrab RAT",
                "FYAnti",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "GreetCake",
                "HAYMAKER",
                "HEAVYHAND",
                "HEAVYPOT",
                "HTran",
                "HUC Packet Transmit Tool",
                "Ham Backdoor",
                "HiddenFace",
                "Impacket",
                "Invoke the Hash",
                "KABOB",
                "Kaba",
                "Korplug",
                "LODEINFO",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MiS-Type",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "NBTscan",
                "NOOPDOOR",
                "Newsripper",
                "P8RAT",
                "PCRat",
                "PlugX",
                "Poison Ivy",
                "Poldat",
                "PowerSploit",
                "PowerView",
                "PsExec",
                "PsList",
                "Quarks PwDump",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "RedLeaves",
                "Rubeus",
                "SNUGRIDE",
                "SPIVY",
                "SharpSploit",
                "SigLoader",
                "SinoChopper",
                "SodaMaster",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "UpperCut",
                "Vidgrab",
                "WinRAR",
                "WmiExec",
                "Wmonder",
                "Xamtrav",
                "Yggdrasil",
                "Zlib",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "dfls",
                "lena",
                "nbtscan",
                "pivy",
                "poisonivy",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535915,
    "ts_updated_at": 1743041834,
    "ts_creation_date": 1655594237,
    "ts_modification_date": 1655594237,
    "files": {
        "pdf": "https://archive.orkl.eu/2b16f83e927f6e9985c1055cd85c5c50718e315c.pdf",
        "text": "https://archive.orkl.eu/2b16f83e927f6e9985c1055cd85c5c50718e315c.txt",
        "img": "https://archive.orkl.eu/2b16f83e927f6e9985c1055cd85c5c50718e315c.jpg"
    }
}