{
    "id": "7c0732ed-46c2-4db5-b32c-c7a8489fe0fa",
    "created_at": "2023-01-12T15:07:55.610964Z",
    "updated_at": "2025-03-27T02:16:57.875785Z",
    "deleted_at": null,
    "sha1_hash": "b92b8343e8db6ce8482586f71dc322354502e6d8",
    "title": "2021-06-18 - Ransomware Actors Evolved Their Operations in 2020",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:47Z",
    "file_modification_date": "2022-05-27T23:11:47Z",
    "file_size": 1098084,
    "plain_text": "# Ransomware Actors Evolved Operations in 2020\n\n**[crowdstrike.com/blog/ransomware-actors-evolved-operations-in-2020/](https://www.crowdstrike.com/blog/ransomware-actors-evolved-operations-in-2020/)**\n\nJosh Dalman - Heather Smith June 18, 2021\n\nIn 2020, CrowdStrike Services observed the continued evolution and proliferation of eCrime\n[adversaries engaging in big game hunting (BGH) ransomware techniques. This trend is](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-examples/)\ncontinuing into 2021 — a recent high-profile example is the CARBON SPIDER/DarkSide\nattack on a U.S. fuel pipeline.\n\nBGH was first observed by CrowdStrike in 2016 with the introduction of BOSS SPIDER’s\nSamas (aka SamSam) ransomware. Since then, BGH ransomware variants have multiplied,\nevolved and become more sophisticated, with their proliferation going virtually unimpeded by\nlegacy endpoint security tools.\n\nThe year 2020 was marked by the trend continuing at an accelerated rate. The\nadvancements by eCrime actors include refinement and application of high-pressure\nextortion tactics on victim organizations and the sharing or copying of new techniques among\ndifferent ransomware groups, in addition to a marked increase in the number of ransomware\nvariants. These advancements all but ensure that ransomware will remain a popular method\nfor eCrime actors to monetize breaches in the foreseeable future.\n\n\n-----\n\n## Ransomware Actors Increase Pressure\n\n[CrowdStrike Services observed eCrime adversaries utilizing various techniques to increase](https://www.crowdstrike.com/services/)\npressure on victim organizations to pay their extortion. While in previous years ransomware\n[eCrime adversaries were rarely observed exfiltrating data, 2020 witnessed a widespread](https://adversary.crowdstrike.com/ecrime-index-ecx/)\nadoption of ransomware with data-leak extortion tactics among multiple eCrime groups. This\nmethod involves both encrypting a victim organization’s environment and also exfiltrating\ndata with the threat to leak it if the extortion demand is not paid. This tactic was initially\nobserved by CrowdStrike Intelligence with OUTLAW SPIDER in May 2019. However, it was\nnot until November 2019, when TWISTED SPIDER adopted this technique, that it became a\ncatalyst for multiple other eCrime actors, many of which have created dedicated leak sites to\nthreaten exfiltration and distribute data. CrowdStrike Intelligence performed research on\nknown dedicated leak sites for 2020. The results of this analysis depict growth throughout\nthe year in terms of the number of leak sites and the number of victim entities with data\npublished on the leak sites.\n\nFigure 1. Most Active BGH Adversaries with DLSs in 2020\n\n[In engagements involving eCrime adversaries that use ransomware with data-leak extortion,](https://adversary.crowdstrike.com/)\nCrowdStrike Services is regularly asked to perform incident response investigations to assist\nstakeholders by identifying data that was accessed and exfiltrated by threat actors.\n\n\n-----\n\nFrequently, CrowdStrike Services is able to identify the data exfiltrated prior to publication by\nthe eCrime adversary, thereby giving stakeholders an opportunity to prepare.\n\nNot only has the number of eCrime dedicated leak sites grown, threat actors have also\nbecome more sophisticated in their methods of leaking the data. In general, eCrime\nadversaries will leak exfiltrated data slowly, saving what they perceive to be the most\nsensitive data for last in an effort to increase pressure on the victim organization to pay the\nextortion, rather than posting all of the exfiltrated data at once. PINCHY SPIDER’s dedicated\nleak site frequently holds auctions to sell exfiltrated data. Others, such as DOPPEL\nSPIDER’s leak site, utilize a countdown timer that triggers an increase in the ransom demand\nupon each expiration. CARBON SPIDER’s leak site automatically releases data on a pre-set\ntimer, with the least sensitive data leaked first and the most sensitive leaked last. There are\nalso significant differences in the amount of data exfiltrated by threat actors. CrowdStrike\nServices has observed DOPPEL SPIDER frequently exfiltrating only tens of gigabytes, while\nothers — such as TRAVELING SPIDER and affiliates associated with Nemty X ransomware\n— exfiltrate hundreds of gigabytes of data or more from victim organizations.\n\nIn addition to ransomware with data-leak extortion, CrowdStrike Services has identified\nadditional tactics by eCrime adversaries to increase pressure on the victim to pay the\nransom. During several recent incidents, the eCrime adversaries, after deploying\nransomware to the victim organization’s environment, have utilized stolen credentials to gain\naccess to the victim organization’s email instance to send extortion-related emails to users\ndemanding payment to prevent exfiltrated data from being leaked. In other instances, the\neCrime adversaries have called and harassed employees of a victim organization following\nransomware deployment. Finally, CrowdStrike also observed threat actors increase pressure\nfor payment with credible threats of distributed denial-of-service (DDoS) attacks if ransom\npayment is not received.\n\n## Ecrime Adversaries Collaborate\n\nCrowdStrike has observed formal collaboration among eCrime adversaries as well as shared\ntactics. In June 2020, the self-named “Maze Cartel” was created when TWISTED SPIDER,\nVIKING SPIDER and the operators of LockBit ransomware entered into an apparent\ncollaborative business arrangement. After this occurred, leaks associated with VIKING\nSPIDER’s Ragnar Locker began appearing on TWISTED SPIDER’s dedicated leak site and\nMaze ransomware began deploying ransomware using common virtualization software, a\ntactic originally pioneered by VIKING SPIDER.\n\nIn addition to formal collaboration, CrowdStrike Services has observed new tactics used and\nspread among eCrime actors. One such tactic is the development and deployment of an ELF\nransomware binary that can be deployed to ESXi hosts for the purpose of encrypting virtual\nsystems. This tactic was initially observed being used by SPRITE SPIDER’s Defray777\nransomware in August 2020 and was quickly adopted by CARBON SPIDER, which utilized a\n\n\n-----\n\nsimilar tactic weeks later. In addition, multiple eCrime adversaries share common exfiltration\ntechniques. CrowdStrike has observed multiple eCrime adversaries exfiltrating data through\nMegaSync as well as Rclone, an open-source computer program.\n\nFigure 2. Mapping of observed relationships between eCrime adversaries by CrowdStrike Intelligence\n\n## What To Expect Next\n\nOver the last several years, eCrime adversaries that engage in BGH ransomware have\nadvanced rapidly in terms of their capabilities and sophistication. It is reasonable to expect\nthat this trend will continue at an accelerated rate with the same goal in mind — to apply as\nmuch pressure as possible to organizations to pay ever-larger extortion demands.\nCrowdStrike expects that eCrime adversaries will continue to refine their data-leak extortion\nransomware tactics, develop increasingly sophisticated exfiltration tooling that can be\ndeployed widely, and automate data exfiltration by searching for, identifying and exfiltrating\nsensitive data by keyword.\n\nLastly, CrowdStrike expects eCrime adversaries to continue pursuing targets of opportunity.\nFrequently, these are SMBs that rely heavily on legacy antivirus to protect them, but many\nlarge organizations are being hit frequently, as threat actors see a higher return on\n\n\n-----\n\ninvestment when targeting an organization that may have stronger defenses but is also likely\nto pay a higher ransom demand.\n\n## What Can Be Done?\n\nWhy is ransomware so prevalent? In short, ransomware with data extortion remains a\nlucrative tactic for eCrime adversaries to monetize their presence in a victim organization’s\nnetwork. Fueled by increasingly larger ransom demands, eCrime adversaries continue to\ndevelop tactics and tools that allow them to slip past legacy antivirus virtually unnoticed.\nFollowing a ransomware incident, many organizations may find that they do not have\nadequate backups, or that their backups became encrypted, and they have few options but\nto pay the ransom. In addition, some cyber insurance companies, during cost-benefit\nanalysis, may find that paying the ransom is a less costly option than rebuilding systems and\nincurring credit monitoring and legal fees due to the disclosure of regulated data by an\neCrime adversary.\n\n### CrowdStrike recommends the following practices:\n\n**Build a bulletproof backup strategy. When it comes to ransomware, how you’ve**\nconfigured your backups is critical. Attackers often delete backups before deploying\nransomware so you are more inclined to pay. Some steps to consider include\npurchasing an immutable backup solution, using separate non-domain accounts with\nmulti-factor authentication to administer your backup solution, retaining multiple copies\nof data on different media with one of them being off-site, keeping at least one copy of\nyour backups offline or on an otherwise air-gapped network, and closely monitoring\nyour backup solution for evidence of data exfiltration, whether it’s on-premises or in the\ncloud. eCrime adversaries have publicly boasted about utilizing cloud backups for data\nexfiltration, and CrowdStrike recommends taking steps to prevent threat actors from\naccessing cloud backup infrastructure in the event of a compromise. This can involve\nusing non-domain accounts for cloud management and multi-factor authentication.\n**Use multi-factor authentication. Organizations can improve their security posture by**\nenabling multi-factor authentication on all public-facing employee services and portals\nas well as restricting internet-facing protocols such as RDP and Server Message Block.\nThis will inhibit unauthorized access to the organization’s environment.\n**Implement next-generation endpoint protection. Organizations can improve their**\nsecurity posture by utilizing advanced endpoint protection across their environment.\nThe agent should leverage machine learning to identify anomalies and perform\nheuristic analysis, in addition to conducting antivirus and anti-malware activities in real\ntime. The agent should be capable of detection and prevention, allow for remote\nnetwork containment of assets pending investigation and/or remediation, and detect\nunmanaged assets within the corporate environment.\n\n\n-----\n\n**Know when to ask for help. In some instances, organizations become aware of threat**\nactor activity within their environment but may lack the visibility to address the problem\nor the right intelligence to understand the nature of the threat. Getting educated about\nthe latest threats and knowing when to ask for help by activating an incident response\nteam or retainer, such as those offered by CrowdStrike Services, may allow for\ndetection and remediation before the threat actor is able to deploy ransomware or\nexfiltrate data from the environment.\n\n**Additional Resources**\n\n_Download CrowdStrike Services Cyber Front Lines Report: Observations From the_\n_[Front Lines of Incident Response and Proactive Services in 2020 and Insights That](https://www.crowdstrike.com/services/cyber-front-lines/)_\n_Matter for 2021._\n_[Watch the on-demand webcast: CrowdStrike Services Cyber Front Lines Report.](https://www.crowdstrike.com/resources/crowdcasts/cyber-front-lines-report-key-insights/)_\n_Find out how CrowdStrike Services can help your organization answer its most_\n_[important security questions: Visit the CrowdStrike Services webpage.](https://www.crowdstrike.com/services/)_\n_Learn about CrowdStrike’s comprehensive next-gen endpoint protection platform by_\n_visiting_ _[the Falcon products webpage.](https://www.crowdstrike.com/endpoint-security-products/)_\n_Visit the_ _[CrowdStrike Resource Center for Securing Your Remote Workforce.](https://www.crowdstrike.com/remote-work/)_\n_Test CrowdStrike next-gen AV for yourself:_ _[Start your free trial of Falcon Prevent™.](https://go.crowdstrike.com/try-falcon-prevent.html)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-18 - Ransomware Actors Evolved Their Operations in 2020.pdf"
    ],
    "report_names": [
        "2021-06-18 - Ransomware Actors Evolved Their Operations in 2020.pdf"
    ],
    "threat_actors": [
        {
            "id": "c240435e-8863-4e5b-9f47-20c6f5c52131",
            "created_at": "2022-10-25T16:07:23.253019Z",
            "updated_at": "2025-03-27T02:02:09.704259Z",
            "deleted_at": null,
            "main_name": "Outlaw Spider",
            "aliases": [],
            "source_name": "ETDA:Outlaw Spider",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb8697fd-882a-4323-9eb8-8e20222cfd91",
            "created_at": "2022-10-25T16:07:23.416834Z",
            "updated_at": "2025-03-27T02:02:09.788953Z",
            "deleted_at": null,
            "main_name": "Boss Spider",
            "aliases": [
                "Boss Spider",
                "CTG-0007",
                "Gold Lowell"
            ],
            "source_name": "ETDA:Boss Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "SDelete",
                "SamSam",
                "Samas"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d555c5da-abe4-42aa-a8cf-77b68905891a",
            "created_at": "2022-10-25T16:07:23.548385Z",
            "updated_at": "2025-03-27T02:02:09.857957Z",
            "deleted_at": null,
            "main_name": "Doppel Spider",
            "aliases": [
                "Gold Heron",
                "Grief Group"
            ],
            "source_name": "ETDA:Doppel Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "DoppelPaymer",
                "Pay OR Grief",
                "Pay or Grief",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8b7faa58-947b-4530-ab1f-250a0370aabf",
            "created_at": "2022-10-25T16:07:24.34248Z",
            "updated_at": "2025-03-27T02:02:10.180543Z",
            "deleted_at": null,
            "main_name": "Traveling Spider",
            "aliases": [
                "Gold Mansard"
            ],
            "source_name": "ETDA:Traveling Spider",
            "tools": [
                "7-Zip",
                "AdFind",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Nefilim",
                "Nemty",
                "Nephilim",
                "Network Password Recovery",
                "PsExec",
                "smbtool"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6f37e16f-64b2-4b9c-b5b4-08d0884660eb",
            "created_at": "2022-10-25T16:07:24.380872Z",
            "updated_at": "2025-03-27T02:02:10.201203Z",
            "deleted_at": null,
            "main_name": "Viking Spider",
            "aliases": [],
            "source_name": "ETDA:Viking Spider",
            "tools": [
                "Ragnar Locker",
                "RagnarLocker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1c76f1b6-a05b-4dba-82ea-07011b47c6cd",
            "created_at": "2023-01-06T13:46:39.201507Z",
            "updated_at": "2025-03-27T02:00:03.020126Z",
            "deleted_at": null,
            "main_name": "TRAVELING SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:TRAVELING SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "25758a84-d695-44e7-9cd5-3c6e999ce6c0",
            "created_at": "2023-01-06T13:46:39.237624Z",
            "updated_at": "2025-03-27T02:00:03.028272Z",
            "deleted_at": null,
            "main_name": "OUTLAW SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:OUTLAW SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4116df25-aff6-46ee-a5dd-926254a78e89",
            "created_at": "2023-01-06T13:46:38.894033Z",
            "updated_at": "2025-03-27T02:00:02.94496Z",
            "deleted_at": null,
            "main_name": "BOSS SPIDER",
            "aliases": [
                "GOLD LOWELL"
            ],
            "source_name": "MISPGALAXY:BOSS SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7268a08d-d4d0-4ebc-bffe-3d35b3ead368",
            "created_at": "2022-10-25T16:07:24.225216Z",
            "updated_at": "2025-03-27T02:02:10.144446Z",
            "deleted_at": null,
            "main_name": "Sprite Spider",
            "aliases": [
                "Gold Dupont",
                "Sprite Spider"
            ],
            "source_name": "ETDA:Sprite Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Coroxy",
                "Defray 2018",
                "Defray777",
                "DroxiDat",
                "Glushkov",
                "LaZagne",
                "Metasploit",
                "PyXie",
                "PyXie RAT",
                "Ransom X",
                "RansomExx",
                "SharpHound",
                "Shifu",
                "SystemBC",
                "Target777",
                "Vatet",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "27e51b73-410e-4a33-93a1-49cf8a743cf7",
            "created_at": "2023-01-06T13:46:39.210675Z",
            "updated_at": "2025-03-27T02:00:03.022315Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "SPRITE SPIDER"
            ],
            "source_name": "MISPGALAXY:GOLD DUPONT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4ec06e5-60c9-4796-9f85-129c77d1652b",
            "created_at": "2023-01-06T13:46:39.21956Z",
            "updated_at": "2025-03-27T02:00:03.023828Z",
            "deleted_at": null,
            "main_name": "VIKING SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:VIKING SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a0d0e1ef-3562-40a8-a021-321db92644d9",
            "created_at": "2023-01-06T13:46:39.104046Z",
            "updated_at": "2025-03-27T02:00:02.997473Z",
            "deleted_at": null,
            "main_name": "DOPPEL SPIDER",
            "aliases": [
                "GOLD HERON"
            ],
            "source_name": "MISPGALAXY:DOPPEL SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "07775b09-acd9-498e-895f-f10063115629",
            "created_at": "2024-06-04T02:03:07.817613Z",
            "updated_at": "2025-03-27T02:05:17.351811Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "Sprite Spider "
            ],
            "source_name": "Secureworks:GOLD DUPONT",
            "tools": [
                " ArtifactExx",
                " Cobalt Strike",
                " Defray",
                " Metasploit",
                " PyXie",
                " Shifu",
                " SystemBC",
                " Vatet",
                "777"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1b20199b-07ae-42f1-ad22-bbe2dd471df8",
            "created_at": "2024-06-04T02:03:07.872554Z",
            "updated_at": "2025-03-27T02:05:17.383011Z",
            "deleted_at": null,
            "main_name": "GOLD LOWELL",
            "aliases": [
                "CTG-0007 ",
                "Boss Spider "
            ],
            "source_name": "Secureworks:GOLD LOWELL",
            "tools": [
                "Samas"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "ccd0f6b5-6d20-4d28-9796-88ab6deb4087",
            "created_at": "2024-06-19T02:03:08.067518Z",
            "updated_at": "2025-03-27T02:05:17.375595Z",
            "deleted_at": null,
            "main_name": "GOLD HERON",
            "aliases": [
                "Doppel Spider "
            ],
            "source_name": "Secureworks:GOLD HERON",
            "tools": [
                " DoppelPaymer",
                " Dridex",
                " Grief",
                " Powershell Empire",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536075,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653693107,
    "ts_modification_date": 1653693107,
    "files": {
        "pdf": "https://archive.orkl.eu/b92b8343e8db6ce8482586f71dc322354502e6d8.pdf",
        "text": "https://archive.orkl.eu/b92b8343e8db6ce8482586f71dc322354502e6d8.txt",
        "img": "https://archive.orkl.eu/b92b8343e8db6ce8482586f71dc322354502e6d8.jpg"
    }
}