{
    "id": "7c0e9d83-768d-4500-80f4-84d6ba93c9c1",
    "created_at": "2022-10-25T16:48:24.690641Z",
    "updated_at": "2025-03-27T02:16:28.724741Z",
    "deleted_at": null,
    "sha1_hash": "aad302df572c61e3f31f09ceac912cc6b4cf2e9f",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-02-28T23:16:13Z",
    "file_modification_date": "2021-02-28T23:16:13Z",
    "file_size": 232768,
    "plain_text": "# Click and Bait: Vietnamese Human Rights Defenders Targeted with Spyware Attacks\n\n**amnesty.org/en/latest/research/2021/02/click-and-bait-vietnamese-human-rights-defenders-targeted-with-spyware-**\nattacks\n\n24 February 2021, 01:00 UTC\n\nA new Amnesty International investigation has identified a campaign of spyware attacks\ntargeting Vietnamese human rights defenders (HRDs) from February 2018 to November\n2020. Amnesty International’s Security Lab attributes these attacks to an\nattack group known as Ocean Lotus. The group has been active since at least\n2014, targeting the private sector and HRDs.\n\nThe spyware attacks investigated and identified by the Security\nLab are the latest evidence of a crackdown on freedom of expression in Viet Nam and\nagainst Vietnamese activists outside the country.\n\n## Viet Nam’s History of Online Repression\n\nHuman rights are increasingly under attack both offline and online in Viet Nam. Over the\npast 15 years, repression linked to online activity has intensified, leading to a wave\nof harassment, intimidation, physical assault, and prosecution.\n\nAmnesty International has documented multiple cases of the arrest and prosecution\nof HRDs in Viet Nam in retaliation for their online expression since 2006. That\n[year, former prisoner of conscience Truong Quoc Huy was arrested at an internet café in](https://www.amnesty.org/en/documents/ASA41/012/2006/en/)\nHo Chi Minh City. Many activists and bloggers have been convicted for “conducting\n[propaganda against the state.” Human rights blogger Nguyen Ngoc Nhu Quynh (Mother](https://www.amnesty.org/en/documents/asa41/4979/2016/en/)\nMushroom) was sentenced to 10 years in prison in June 2017 on such charges.\n\n\n-----\n\nActivists and bloggers also face frequent physical assaults by officials or government[connected thugs. Police place activists under house arrest or briefly detain them to](http://www.asianews.it/news-en/Hanoi:-Buddhist-leader-detained,-placed-under-house-arrest-29954.html%22%20/)\n[prevent them from participating in public events. The government also uses travel bans to](https://www.facebook.com/thao.gao/posts/3996329593718485)\nprevent activists and HRDs from going abroad and engaging with the international\ncommunity.\n\n[In December 2020, Amnesty International published “Let Us Breathe”, a](https://www.amnesty.org/en/latest/research/2020/12/vietnam-let-us-breathe/)\nreport documenting the widespread criminalization, online harassment and physical\nattacks faced by activists and bloggers and the rising numbers of individuals detained for\npeacefully expressing themselves online. Amnesty International also revealed the\nincreasing complicity of tech giants Facebook and Google in the Vietnamese authorities’\nharsh censorship regime, whereby any expression of peaceful dissent is liable to be\nblocked or otherwise restricted.\n\nActivists and HRDs are jailed, harassed, attacked, and censored into silence on the basis\nof vague and sweeping laws that do not comply with international human rights\n[standards. In January 2019, a controversial Law on Cybersecurity came into effect in Viet](https://www.amnesty.org/en/latest/news/2018/06/viet-nam-proposed-cybersecurity-law-threatens-to-stamp-out-online-freedom/%22%20/)\nNam, granting the government broad powers to limit online freedom, to compel\ntechnology companies to hand over vast amounts of data and to censor users’ content.\n\n## What is Ocean Lotus?\n\nThe cyber-security industry, comprised of individual and company-based\nresearchers, routinely researches and publishes information about attack groups targeting\ncompanies and governments. The industry often gives informal names to\ngroups they continuously track based on each group’s unique tactics and tools. Ocean\nLotus (also commonly called APT32 or APT-C-00) is one of these groups.\n\n[The first known Ocean Lotus attack happened in 2014. It targeted US-based NGO](https://www.eff.org/deeplinks/2014/01/vietnamese-malware-gets-personal)\nElectronic Frontier Foundation (EFF), the Associated Press international news\norganization and two Vietnamese activists. This group was named Ocean Lotus in a report\nfrom the Chinese company Qihoo 360 in May 2015. In 2017, the American cyber-security\n[company FireEye published a report linking the 2014 EFF and other attacks to this same](https://www.fireeye.com/blog/threat-research/2017/05/cyber-espionage-apt32.html)\nOcean Lotus.\n\nOver the years, Ocean Lotus has developed a sophisticated spyware toolkit comprised of\n[several variants of Mac OS spyware, Android spyware and Windows spyware. They also](https://www.trendmicro.com/en_us/research/18/d/new-macos-backdoor-linked-to-oceanlotus-found.html)\n[strategically compromise websites in order to identify visitors and conduct further](https://www.volexity.com/blog/2020/11/06/oceanlotus-extending-cyber-espionage-operations-through-fake-websites/)\n[targeting. More recently, Ocean Lotus was found creating fake media websites based on](https://www.volexity.com/blog/2020/11/06/oceanlotus-extending-cyber-espionage-operations-through-fake-websites/)\ncontent automatically gathered online.\n\nA significant part of the group’s activities is the targeting of HRDs and civil society. In\n2017, the cyber-security company Volexity revealed that over 100 websites were\ncompromised, including many belonging to human rights organizations from Viet\nNam, in an attack campaign that they attributed to Ocean Lotus. Numerous other spyware\n\n\n-----\n\nattacks linked to Ocean Lotus against human rights organizations have also been\nreported, such as the targeting of the Cambodian human rights organization,\nLICADHO in 2018.\n\nThe cyber-security company FireEye describes Ocean Lotus’ operations as “aligned with\nVietnamese state interests” based on the list of targeted companies and civil society\n[groups they identified. In December 2020, Facebook published a threat report linking](https://about.fb.com/news/2020/12/taking-action-against-hackers-in-bangladesh-and-vietnam/amp/)\nOcean Lotus’ activities with a Vietnamese company named CyberOne Group. Although\nAmnesty International was unable to independently verify any direct connection between\nOcean Lotus and CyberOne or with the Vietnamese authorities, the attacks described\nin this investigation confirm a pattern of targeting Vietnamese individuals and\norganizations.\n\n## Attacks against HRDs\n\n[The investigation conducted by Amnesty International’s Security Lab revealed that two](https://www.amnesty.org/en/tech/)\nHRDs and a non-profit human rights organization from Viet Nam have been targeted by a\ncoordinated spyware campaign. This spyware allows to fully monitor a compromised\nsystem, including reading and writing files, or launching other malicious programs.\n\n**Bui Thanh Hieu is a blogger and pro-democracy activist who goes by the name “Nguoi**\nBuon Gio” (The Wind Trader). He writes about social and economic justice and human\nrights. He is also critical of the Vietnamese government’s policies and actions regarding\nits relations with China, including the dispute over sovereignty in the South China Sea.\nDue to his writing and activism, the licence for an Internet Café he owned in Ha Noi has\n[been revoked and he has been repeatedly subjected to reprisals. He was arrested along](https://www.amnesty.org/download/Documents/48000/asa410052009en.pdf)\nwith activists Pham Doan Trang and Nguyen Ngoc Nhu Quynh in 2009 and was kept in\npolice custody for 10 days for “abusing democratic freedoms to infringe upon the interests\nof the State.” In January 2013, Bui Thanh Hieu reported on the trial of 14 dissidents in\nViet Nam and was arrested and released a few days later. He has since left Viet Nam and\nhas lived in exile in Germany since 2013.\n\n**Vietnamese Overseas Initiative**\n**[for Conscience Empowerment](https://vietnamvoice.org/en/)**\n**(VOICE) is a non-profit organization**\nsupporting Vietnamese refugees and\npromoting human rights in Viet Nam.\nIt was established in 1997 in the\nFilipino capital of Manila as a legal aid\noffice, before formally registering in\nthe United States in 2007. The\norganization continues to operate out\nof Manila and has helped 3,000\nVietnamese refugees resettle in third\ncountries. Since 2011, VOICE has\noperated an internship programme to equip Vietnamese people with knowledge, skills,\n\n\n-----\n\nand tools to become effective activists. The organization has faced reprisals from\nVietnamese authorities several times. Staff at VOICE told Amnesty International that\nemployees and interns have been harassed, banned from travelling, and have had their\npassports confiscated when they have returned to Viet Nam. Furthermore, state-owned\nmedia has run an unsubstantiated smear campaign against VOICE, claiming that the\n[organization is a terrorist group.](https://nhandan.com.vn/binh-luan-phe-phan/ve-trinh-hoi-va-to-chuc-voice-238535/)\n\n**A blogger residing in Viet Nam has also**\nbeen confirmed as an Ocean Lotus target by the\nSecurity Lab, but due to security concerns their\nname has been omitted. They are known to\nhave spoken out publicly about the Dong Tam\nincident on 9 January 2020, when\napproximately 3,000 security officers from Ha\nNoi raided Dong Tam village and killed the 84year-old village leader Le Dinh Kinh. Three\npolice officers were also killed. The Dong Tam\nincident sparked a national outcry in Viet Nam.\nActivists and bloggers were at the forefront of\nthe public debate online, prompting a nationwide crackdown on online expression by the\ngovernment. VOICE and the two bloggers all received emails containing spyware between\nFebruary 2018 and November 2020.\n\nThese emails pretended to share an important document. They either contained spyware\nas an attachment or as a link. Once downloaded and launched on the victim’s computer,\nthe spyware would then open a decoy document in line with what the email pretended to\nshare to trick the victim in believing the file was benign.\n\n_Screenshot of the email sent to VOICE in April 2020_\n\nThe spyware identified by the Security Lab were either for Mac OS or Windows systems.\nThe Windows spyware was a variant of a malware family called Kerrdown and used\nexclusively by the Ocean Lotus group. Kerrdown is a downloader that installs additional\nspyware from a server on the victim’s system and opens a decoy document. In this case, it\n[downloaded Cobalt Strike, a commercial spyware toolkit developed by the American](https://www.cobaltstrike.com/)\n[company Strategy Cyber and routinely used to lawfully audit the security of organizations](https://www.cobaltstrike.com/contact)\n[through simulated attacks. It allows an attacker full access to the compromised system](https://www.cobaltstrike.com/features)\nincluding executing scripts, taking screenshots or logging keystrokes. Unlicensed versions\n[of Cobalt Strikes have been increasingly used by attack groups, including Ocean Lotus,](https://unit42.paloaltonetworks.com/tracking-oceanlotus-new-downloader-kerrdown/)\nover the past three years.\n\n_Example of Windows Spyware Infection Chain from one of the emails received_\n\n\n-----\n\nThe Mac OS Spyware was a variant of a malware family for Mac OS developed and used\n[exclusively by Ocean Lotus, analysed by Trend Micro in April 2018 and November 2020.](https://www.trendmicro.com/en_us/research/18/d/new-macos-backdoor-linked-to-oceanlotus-found.html)\nIt allows the perpetrator to access system information, download, upload or execute files\nand execute commands.\n\n## Unlawful Surveillance: A Threat to Human Rights\n\nOur investigation was not able to attribute Ocean Lotus’ activities to any company or\ngovernment entity. However, the extensive list of people and organizations targeted by\nOcean Lotus over years shows that it has a clear focus on targeting human rights and\nmedia groups from Viet Nam and neighbouring countries. This raises questions about\nwhether Ocean Lotus is linked to Vietnamese state actors. The consistent evidence linking\nOcean Lotus to Viet Nam should trigger the Vietnamese authorities to undertake an\nimpartial, thorough and independent investigation into the group's unlawful activities\nand human rights abuses.\n\nThe targeting of human rights defenders using digital surveillance technology is unlawful\nunder international human rights law. Unlawful surveillance violates the right to privacy\nand impinges on the rights to freedom of expression and opinion, of association and of\npeaceful assembly. Both the Universal Declaration of Human Rights and the International\n[Covenant on Civil and Political Rights protect these rights. The Covenant guarantees the](https://www.ohchr.org/EN/ProfessionalInterest/Pages/CCPR.aspx)\nright to hold opinions without interference and the right to free expression (Article 19)\nand guards against arbitrary and unlawful intrusion of privacy (Article 17). International\nlaw and standards also require that any interference by the state on the right to privacy\nshould be lawful, necessary, proportional, and legitimate. States are required to ensure\nthat individuals whose rights have been violated have access to remedy (Article 2(3)). This\n[includes the positive obligation to take appropriate measures to prevent, punish,](https://docstore.ohchr.org/SelfServices/FilesHandler.ashx?enc=6QkG1d%2FPPRiCAqhKb7yhsjYoiCfMKoIRv2FVaVzRkMjTnjRO%2Bfud3cPVrcM9YR0iW6Txaxgp3f9kUFpWoq%2FhW%2FTpKi2tPhZsbEJw%2FGeZRASjdFuuJQRnbJEaUhby31WiQPl2mLFDe6ZSwMMvmQGVHA%3D%3D)\ninvestigate or redress the harm caused by such acts by private persons or entities.\n\nThis targeted surveillance led by Ocean Lotus is part of a broader pattern of censorship\nand criminalization of online expression in Viet Nam, described in depth in Amnesty\nInternational’s [“Let Us Breathe” report. Along with the censorship of political content](https://www.amnesty.org/en/documents/asa41/3243/2020/en/)\ninvolving the complicity of “big tech” companies Google and Facebook and the\ncriminalization of bloggers, it describes the systemic online harassment and abuse of\nactivists. Against this background, these attacks further undermine the ability of HRDs to\nexercise their rights to freedom of expression, opinion and peaceful assembly. Targeting\npeople solely for peacefully exercising their human rights is unlawful. The Vietnamese\ngovernment should conduct an independent and transparent investigation on these\nattacks and ensure that effective legal remedies are provided to people who complain of\nabuses of their human rights due to surveillance.\n\n## Recommendations\n\n### To Vietnamese authorities:\n\n\n-----\n\nConduct an independent, impartial, and transparent investigation into the unlawful\ntargeted surveillance of the human rights defenders mentioned in this report,\nincluding investigating the attack group Ocean Lotus and determining whether\nthere are links between this spyware campaign and any specific government\nagencies\nImplement a human rights regulatory framework that governs surveillance. Until\nsuch a framework is implemented, a moratorium on the purchase, sale, transfer,\nand use of surveillance equipment should be enforced.\n\nAddressing unlawful targeted surveillance also requires changes from the Vietnamese\n[authorities. You can find a full list of recommendations in the “Let Us Breathe” report](https://www.amnesty.org/en/documents/asa41/3243/2020/en/)\nfrom December 2020.\n\n## How to protect yourself\n\nBe careful when receiving emails with attachments or links. If you did not expect to\nreceive the email or do not know the sender, do not click on the links in the email or\nopen attached or shared files.\nYou should pay particularly close attention to shortened links, especially on social\nmedia. Attacks often use these – from Bitly and other shortening services – to trick\nyou into thinking you are clicking a legitimate link, when in fact you are being\ninadvertently directed to a fake site. When in doubt about the shortened link, here is\n[the guide on how to reveal full URLs](https://safecomputing.umich.edu/be-aware/phishing-and-suspicious-email/shortened-url-security#:~:text=There%20are%20a%20number%20of,tinyurl.com.)\nBe careful when a website or application asks for access to your Google account. If it\nasks to access your emails (“Read, send, delete and manage your email”), do not\naccept unless you have full trust in the application getting access to it.\n[Enable two-factor authentication (two-step verification) on all your accounts,](https://ssd.eff.org/vi/module/l%C3%A0m-th%E1%BA%BF-n%C3%A0o-d%C3%B9ng-x%C3%A1c-minh-hai-y%E1%BA%BFu-t%E1%BB%91)\nespecially on your email.\nMake sure your operating system and applications are up to date. Avoid using\npirated system software and office tools, as serious damage can be caused to your PC\nby malware and spyware included within the copy of the pirated software you\nreceive.\nUse antivirus software. Macs need this just as much as Windows computers. Make\nsure Windows Defender (if you are a Windows user), and XProtect (if you are a Mac\nuser) are turned on.\nIf you believe you have been targeted with attacks similar to the ones described in\nthis report, please contact us at:\n\nYou can find more guidelines\n[on how to protect yourself here](https://www.facebook.com/amnesty.Vietnamese/)\n(in Vietnamese)\n\n## Appendix\n\nHere is the list of emails identified in this investigation:\n\n\n-----\n\n**Date** **Target** **Subject** **Spyware**\n\n\nFeb 12,\n2018\n\nJun 10,\n2019\n\nOct 8,\n2019\n\nDec 20,\n2019\n\nApr 29,\n2020\n\nJul 28,\n2020\n\nNov 18,\n2020\n\nNov 27,\n2020\n\n\nBui Thanh\nHieu\n\nBui Thanh\nHieu\n\nBui Thanh\nHieu\n\nBui Thanh\nHieu\n\n\nThư mời thuyết trình trong HMDC\nStuttgart 2018\n\n\nDanh sách nhân sự dự khuyết Đại\nhội13 Đảng CSVN\n\nĐơn kêu cứu của gia đình anh Lê\nNam Trà\n\n\nMac OS Spyware\n\n\nTài liệu quan trọng ! Mac OS and\nWindows Spyware\n\n\nMac OS Spyware\n\nMac OS Spyware\n\nWindows Spyware\n\n\nVOICE Some reviews about Trinh Hoi and\nVoice\n\n\n\n[REDACTED] Thanh toán hóa đơn Windows Spyware\n\n[REDACTED] Yêu cầu thanh toán Windows Spyware\n\n[REDACTED] Hỗ trợ truyền thông Windows Spyware\n\n\nFor a technical analysis of the spyware used in these attacks, see the technical analysis\n[published on Github.](https://github.com/AmnestyTech/investigations/tree/master/2021-02-24_vietnam)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.02.24.Click_and_Bait/amnesty.org-Click%20and%20Bait%20Vietnamese%20Human%20Rights%20Defenders%20Targeted%20with%20Spyware%20Attacks.pdf"
    ],
    "report_names": [
        "amnesty.org-Click and Bait Vietnamese Human Rights Defenders Targeted with Spyware Attacks"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1614554173,
    "ts_modification_date": 1614554173,
    "files": {
        "pdf": "https://archive.orkl.eu/aad302df572c61e3f31f09ceac912cc6b4cf2e9f.pdf",
        "text": "https://archive.orkl.eu/aad302df572c61e3f31f09ceac912cc6b4cf2e9f.txt",
        "img": "https://archive.orkl.eu/aad302df572c61e3f31f09ceac912cc6b4cf2e9f.jpg"
    }
}