{
    "id": "7c172e62-601b-4e91-917f-3af632941f75",
    "created_at": "2023-01-12T15:06:13.41274Z",
    "updated_at": "2025-03-27T02:16:25.949202Z",
    "deleted_at": null,
    "sha1_hash": "a9fefda611d90a06689a5a04e8e31199670cb8e1",
    "title": "2018-11-15 - Mylobot Continues Global Infections",
    "authors": "",
    "file_creation_date": "2022-05-28T04:57:16Z",
    "file_modification_date": "2022-05-28T04:57:16Z",
    "file_size": 2636736,
    "plain_text": "# Mylobot Continues Global Infections\n\n**[blog.centurylink.com/mylobot-continues-global-infections/](https://blog.centurylink.com/mylobot-continues-global-infections/)**\n\n[Black Lotus Labs Posted On November 15, 2018](https://blog.lumen.com/author/black-lotus-labs/)\n\n[0](https://blog.lumen.com/mylobot-continues-global-infections/#respond)\n\n0\n\nShares\n\n\nNovember 15, 2018\n\n\nCenturyLink Threat Research Labs has been tracking the Mylobot botnet, a sophisticated\nmalware family that is categorized as a downloader. What makes Mylobot dangerous is its\nability to download and execute any type of payload after it infects a host. This means at any\ntime it could download any other type of malware the attacker desires. A detailed\nwalkthrough and reverse engineering analysis of Mylobot was first reported in June by Deep\n\n\n-----\n\n[Instinct. During the time we have been monitoring Mylobot we have observed it downloading](https://www.deepinstinct.com/2018/06/20/meet-mylobot-a-new-highly-sophisticated-never-seen-before-botnet-thats-out-in-the-wild/)\n[the Khalesi malware as a second stage to infected hosts. Kaspersky Lab reports that the](https://securelist.com/what-are-botnets-downloading/87658/)\ninformation stealing Khalesi malware is one of the top downloaded malware families in 2018.\n\nWe were first alerted to the botnet’s behavior by IPs interacting with our honeypot network.\nOur team is constantly monitoring attack patterns and looking for common behaviors in these\nattacks. In this case, we observed a common behavior to DNS lookups coming from a\ndistinct group of these IPs. Each of the hosts performed DNS lookups for domains that we\nhad flagged as likely to be algorithmically generated.\n\nThe common behavior was detected by combining the IPs extracted from our honeypot logs\nwith DNS resolution data, and applying unsupervised clustering techniques to isolate large\nclusters of similarly-behaving devices. The resulting behavior appeared to be callbacks to\nDomain Generation Algorithm (DGA) generated domains. Our DGA domains list is generated\nby monitoring lookups to estimate the probability that a domain was generated using a\nvariety of techniques. These techniques could include randomly choosing letters or numbers,\nor randomly choosing words from a dictionary to make up a domain. The domains being\nqueried by this particular cluster of IPs appeared to be seven randomly-chosen letters with\nthe TLDs .ru, .net and .com. The subdomains ranged from m0 to m42.\n\n\n-----\n\nOur investigation in to these domains found that they are hardcoded into samples of the\nMylobot malware. Mylobot contains sophisticated anti-VM and anti-sandboxing techniques.\nFor example, it sits idle for 14 days before attempting to contact the C2.1 This delaying\ntechnique is used to wait out the sandbox environment to avoid detection. When it attempts\nto contact the C2, the malware uses a set of 1,404 hard-coded domain name and port pairs.\n\nFor each domain-port pair, the malware first attempts to resolve 43 subdomains, which are\nthe same as those we saw in passive DNS (m0 through m42). If one of the FQDNs resolves\nto an IP, the malware tries to connect to the IP on the port that was hard-coded with that\n\n\n-----\n\ndomain. With 1,404 domains and 43 subdomains, this results in 60,372 DNS queries from\neach bot.\n\nThe large volume of queries from an individual host can be used as an indication of an\ninfection by this malware. The internet-wide impact of this behavior can be seen when\nlooking at a two-week period. As each region of infected hosts is powered on to begin the\nday, a large volume of queries occurs, slowly dropping off as each host finds the C2. Below\nis a graph showing the total number of queries to these domains we see in our DNS traffic\nover this period.\n\nThrough our analysis it was important to understand if the botnet had shown any noticeable\nvariation in size. We found, that while day-to-day sizes may vary due to normal botnet\nmaintenance and data sampling, the botnet’s total size has remained relatively consistent\nthroughout the year. The below graph displays the number of IPs we see in passive DNS\ntraffic querying the domains in question for the current year.\n\n\n-----\n\nAt CenturyLink Threat Research Labs, we leverage our global visibility to identify botnet\ninfrastructure. Analyzing DNS response data allowed us to generate a list of potential C2s\nfrom the FQDNs that resolved to IP addresses. Searching our sampled Netflow for traffic\nfrom these IPs, we can identify the active C2s and their ports. Below are the active C2s from\nNovember and the number of IPs the C2 sent responses to on the C2 port.\n\n**C2 IP** **Port** **FQDN** **Number of IPs**\n\n74.222.19.103 7432 m20.fywkuzp.ru 2,675\n\n74.222.19.63 7432 m19.fywkuzp.ru 2,511\n\n217.23.13.62 7432 m7.fywkuzp.ru 2,420\n\n89.39.107.19 7432 m12.fywkuzp.ru 2,289\n\n70.36.107.38 7432 m21.fywkuzp.ru 2,259\n\n89.39.105.82 7432 m8.fywkuzp.ru 2,133\n\n89.38.98.48 7432 m10.fywkuzp.ru 2,128\n\n109.236.85.147 7432 m25.fywkuzp.ru 2,108\n\n217.23.6.62 7432 m11.fywkuzp.ru 2,082\n\n89.38.98.165 7432 m6.fywkuzp.ru 1,632\n\n109.236.85.21 7432 m4.fywkuzp.ru 1,532\n\n217.23.3.15 7432 m13.fywkuzp.ru 1,119\n\n109.236.85.150 7432 m1.fywkuzp.ru 986\n\n\n-----\n\n109.236.85.154 7432 m5.fywkuzp.ru 971\n\n46.166.173.180 7432 m24.fywkuzp.ru 943\n\n109.236.85.153 7432 m3.fywkuzp.ru 917\n\n109.236.85.135 7432 m2.fywkuzp.ru 840\n\n109.236.87.49 7432 m9.fywkuzp.ru 683\n\n70.36.107.39 7432 m22.fywkuzp.ru 666\n\n75.126.102.251 9529 m9.qjwhpfe.net 344\n\n109.236.85.93 7432 m26.fywkuzp.ru 184\n\n70.36.107.154 7432 m0.fywkuzp.ru 135\n\nIn total, there were 9,874 unique IPs that received responses from the C2s on the C2 port for\nthis particular day. Comparing this with other time intervals, we have observed the total\nnumber of unique IPs reach as high as 17,979.\n\nThere was speculation in the Deep Instinct analysis that a GeoIP filter was being used by the\nC2s, since researchers were unable to get a response from C2s in certain geographic areas.\nWe were able to get a response from one of the C2s, 70.36.107.154, from an IP located in a\ndifferent geographic region. Therefore, it is unclear to us if there is any GeoIP filtering taking\nplace. Below is a heatmap showing the concentration of IPs that communicated with the C2s\non the C2 port.\n\nBelow are the top 10 countries we observed communicating with the C2 on the C2 port on\nNovember 10.\n\n\n-----\n\n**Country** **Number of IPs**\n\nIraq 3,014\n\nIran 2,788\n\nArgentina 2,602\n\nRussia 1,919\n\nVietnam 1,786\n\nChina 1,202\n\nIndia 926\n\nSaudi Arabia 914\n\nChile 844\n\nEgypt 798\n\nWhen the malware receives a response from the C2, it XORs it with the byte 0xDE. The\nresulting string contains up to two URLs. Each URL contains an IP and a file ending in .gif.\nBelow is the decoded response we received from the C2.\n```\n'\\xde\\xde\\xde\\xde\\xd6http://138.128.150.133/winme.gif\\x00\\xde\\xde\\xde\\xde\\xd9http://13\n\n```\nThe malware connects to this downloader IP and executes the downloaded file. The two files\nwe saw in the C2 response were PE32 executables. These downloaded files appear to be\nmodified quite frequently. While the sizes are always the same, we observed that the file\nhashes change approximately every 30 minutes. We have included the below hashes as\nexamples for further industry analysis.\n```\nwinme.gif (267776 bytes)\n4ca8ef5d00bde49659ca97faf2a2a47445e6a3e82c151f18f0923392826d5af0\nwinext.gif (180224 bytes)\nb7245ed896cd4199b410a326e1295aafb3e23c3311d301b1cdaf964cf7c008d9\n\n```\nThrough collaboration with Kurt Baumgartner at Kaspersky Lab, we believe we can positively\nidentify the second stage payload as the information stealing Khalesi malware. Using a\ngraph analysis technique to find IPs of interest that communicated with a large number of\nbots, we were able to identify two downloaders. One of the downloaders, 138.128.150.133,\nis currently very active and was also the one contained in the response we decoded from the\nC2. [VirusTotal confirms this IP as a malware distribution host. All the URLs associated to this](https://www.virustotal.com/#/ip-address/138.128.150.133)\nIP have similar names to the ones above ending in .gif and are flagged as Khalesi or Zusy\nmalware. This behavior appears as far back as April.\n\n\n-----\n\nThe other downloader, 38.130.218.117, was active until the beginning of the year. The plot\nbelow shows the number of connections to both, with a clear transition of infrastructure\noccurring at the beginning of the year.\n\nBy combining different data sources, such as DNS and Netflow, and using unsupervised\nclustering and graph analysis techniques, CenturyLink Threat Research Labs has been able\nto track the bots, C2s and downloaders for the Mylobot botnet. This analysis, performed\nwithout access to specific malware samples shows the power that network forensics can play\nin tracking malicious infrastructure. CenturyLink has blocked this infrastructure on our\nnetwork to mitigate risk to our customers and notified the owners of any components\noperating within their environments to clean up and protect the global internet.\n\nFor a full list of IOCs such as the C2 domains and IPs, the downloader IP and the file\n[hashes, please visit our GitHub page.](https://github.com/blacklotuslabs/IOCs/blob/main/Mylobot_IoCs.txt)\n\n[CybersecurityLumen](https://blog.lumen.com/tag/cybersecurity/)\n\nAuthor\n\n**Black Lotus Labs**\n\n\n-----\n\nThe mission of Black Lotus Labs is to leverage our network visibility to help protect\ncustomers and keep the internet clean.\n\nTrending Now\n\nYou may also like\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\nServices not available everywhere. ©2022 Lumen Technologies. All Rights Reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-11-15 - Mylobot Continues Global Infections.pdf"
    ],
    "report_names": [
        "2018-11-15 - Mylobot Continues Global Infections.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535973,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653713836,
    "ts_modification_date": 1653713836,
    "files": {
        "pdf": "https://archive.orkl.eu/a9fefda611d90a06689a5a04e8e31199670cb8e1.pdf",
        "text": "https://archive.orkl.eu/a9fefda611d90a06689a5a04e8e31199670cb8e1.txt",
        "img": "https://archive.orkl.eu/a9fefda611d90a06689a5a04e8e31199670cb8e1.jpg"
    }
}