{
    "id": "7c2eee64-9ad9-4f73-beaf-b003ecc195aa",
    "created_at": "2023-01-12T15:01:00.017939Z",
    "updated_at": "2025-03-27T02:14:02.430734Z",
    "deleted_at": null,
    "sha1_hash": "825fa2a696dfcdb008c58da06a4fd584284d82c3",
    "title": "2021-03-10 - New Linux Backdoor RedXOR Likely Operated by Chinese Nation-State Actor",
    "authors": "",
    "file_creation_date": "2022-05-28T15:51:59Z",
    "file_modification_date": "2022-05-28T15:51:59Z",
    "file_size": 1808308,
    "plain_text": "# New Linux Backdoor RedXOR Likely Operated by Chinese Nation-State Actor\n\n**[intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/](https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/)**\n\nJoakim Kennedy, Avigayil Mechtinger March 10, 2021\n\n### Get Free Account\n\nJoin Now\n\nWe discovered a new sophisticated backdoor targeting Linux endpoints and\nservers\n\nBased on Tactics, Techniques, and Procedures (TTPs) the backdoor is believed\nto be developed by Chinese nation-state actors\n\nThe backdoor masquerades itself as polkit daemon. We named it RedXOR for its\nnetwork data encoding scheme based on XOR. The malware was compiled on\nRed Hat Enterprise Linux\n\nWe provide recommendations for detecting and responding to this threat below\n\nMonitor your cloud environments for RedXOR and other Linux malware. Protect 10 servers\nfor free with the [Intezer Protect community edition.](https://protect.intezer.com/signup)\n\n\n-----\n\n## Intro\n\n2020 [set a record for new Linux malware families. New malware families targeting Linux](https://www.intezer.com/blog/cloud-security/2020-set-record-for-new-linux-malware-families/)\nsystems are being discovered on a regular basis. Backdoors attributed to advanced threat\nactors are disclosed less frequently. We have discovered an undocumented backdoor\n[targeting Linux systems, masqueraded as polkit daemon. We named it RedXOR for its](https://linux.die.net/man/8/polkitd)\nnetwork data encoding scheme based on XOR. Based on victimology, as well as similar\ncomponents and Tactics, Techniques, and Procedures (TTPs), we believe RedXOR was\ndeveloped by high profile Chinese threat actors. The samples, which have low detection\nrates in VirusTotal, were uploaded from Indonesia and Taiwan, countries known to be\ntargeted by Chinese threat actors. The samples are compiled with a legacy GCC compiler on\nan old release of Red Hat Enterprise Linux, hinting that RedXOR is used in targeted attacks\nagainst legacy Linux systems. During our investigation we experienced an “on and off”\navailability of the Command and Control (C2) server indicating that the operation is still\nactive.\n\n## Connections to Chinese Threat Actors\n\nWe uncovered key similarities between RedXOR and previously reported malware\nassociated with Winnti umbrella threat group. These malware are PWNLNX backdoor and\n**XOR.DDOS and Groundhog, two botnets attributed to Winnti by** [BlackBerry. The below](https://www.blackberry.com/us/en/pdfviewer?file=/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-bb-decade-of-the-rats.pdf)\nsamples can be used for reference: Similarities between the samples:\n\n1. Use of old open-source kernel rootkits: RedXOR uses an open-source LKM rootkit\n\n[called “Adore-ng” to hide its process. Based on a FireEye report Winnti used this rootkit](https://github.com/yaoyumeng/adore-ng)\nin their “ADORE.XSE” Linux backdoor. Embedding open-source LKM rootkits is a\n[common Winnti technique. The group has been documented using Azazel and](https://medium.com/chronicle-blog/winnti-more-than-just-windows-and-gates-e4f03436031a)\n[Suterusu.](https://www.blackberry.com/us/en/pdfviewer?file=/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-bb-decade-of-the-rats.pdf#MKTG%2020-0089%20Decade_the_RAT%27s_Report.indd%3A.176091%3A522)\n\n1. The CheckLKM function name used by RedXOR has also been used in PWNLNX and\n\nXOR.DDOS.\n\n1. Provides the operator with a pseudo-terminal: RedXOR uses Python pty shell by\n\n[importing the python pty library. PWNLNX implements the pty shell function in c.](https://docs.python.org/3/library/pty.html)\n\n\n-----\n\n_Figure 1: Python pty shell used in RedXOR_\n\n1.\n\n1. Encoding network with XOR: The backdoor encodes its network data with a\n\nscheme based on XOR. Encoding network data with XOR has been used in\nprevious Winnti malware including PWNLNX.\n\n1. Persistence service name: As part of its persistence methods, RedXOR attempts to\n\ncreate a service under rc.d. The developer added “S99” before the name of the service\nto lower its priority and make it run last on system initiation. This technique was used in\nXOR.DDOS and Groundhog samples where the malware developer added “S90” to the\nservice name.\n\n\n-----\n\n1. Main functions flow: PWNLX and RedXOR have a main function which is in charge of\n\ninitialization. In both backdoors, the main function calls another function which is in\ncharge of the main logic. The main logic function names are main_process in RedXOR\nand MainThread in PWLNX. Both main functions daemonize the process to detach\nfrom the terminal and run in the background.\n\n1. XML for file listing: RedXOR’s directory function and PWNLNX’s getfiles function are\n\nboth in charge of directory listing. Their code flow implementation is different, however,\nas both malware send the directory listing as an XML file to the C2 server. Figure 2\nshows the XML structure used in PWNLNX and RedXOR. The file’s data used in both\nfunctions are: path, name, type, user, permission, size, time.\n\n_Figure 2: The XML structure used by PWNLNX’s getfiles function and RedXOR’s directory_\n_function_\n\n1. Legacy Red Hat compilers: RedXOR and PWNLNX were both compiled with a Red\n\nHat 4.4.7 compiler. This compiler is the default GCC compiler on RHEL6.\n\n1. Chown similarity: Both PWNLNX and RedXOR change the file’s user and group\n\nowner to a large ID. The same technique has been used by the XOR.DDoS malware\n[as referenced in the analysis by MalwareMustDie.](https://blog.malwaremustdie.org/2014/09/mmd-0028-2014-fuzzy-reversing-new-china.html)\n\n_Figure 3: Similarity between PWNLNX and RedXOR of the UID and GID used with_\n_“lchown” function call_\n\n1. Overall flow and functionalities: The overall code flow, behavior, and capabilities of\n\nRedXOR are very similar to PWNLNX. Both have file uploading and downloading\nfunctionalities together with a running shell. The network tunneling functionality in both\nfamilies is called “PortMap”.\n\n1. Unstripped ELF binaries: Malware developers will often tamper with a file’s symbols\n\nand/or sections, making it harder for researchers to analyze them. However, RedXOR\nand various Winnti malware, including PWNLNX and XOR.DDOS, are unstripped.\n\n## Technical Analysis\n\n\n-----\n\n[The samples are both unstripped 64-bit ELF files called po1kitd-update-k. Uploaded to](https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/www.intezer.com/blog/research/executable-linkable-format-101-part1-sections-segments/)\nVirusTotal from Taiwan and Indonesia, they are low detected at the time of this writing.\n\n_[Figure 4: 2bd6e2f8c1a97347b1e499e29a1d9b7c in VirusTotal](https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/ELF%20files%20called%20%3Cem%3E%3Cstrong%3Epo1kitd-update-k.%3C/strong%3E%3C/em%3E%C2%A0Uploaded%20to%20VirusTotal%20from%20Taiwan%20and%20Indonesia,%20they%20are%20low%20detected%20at%20the%20time%20of%20this%20writing.%0A%0A%3Ccenter%20style=)_\n\n## Malware Installation\n\nUpon execution RedXOR forks off a child process allowing the parent process to exit. The\npurpose is to detach the process from the shell. The new child determines if it has been\nexecuted as the _root user or as another user on the system. It does this to create a hidden_\nfolder, called “.po1kitd.thumb”, inside the user’s home folder which is used to store files\nrelated to the malware. The malware creates a hidden file called “.po1kitd-2a4D53” inside\nthe folder. The file is locked to the current running process, seen in Figure 5, essentially\ncreating a mutex. If another instance of the malware is executed, it also tries to obtain the\nlock but ultimately fails. Upon this failure the process exits.\n\n\n-----\n\n_Figure 5: The malware creates a “mutex” file locking it to the process ID_ After the malware\ncreates the mutex, it installs itself on the infected machine. As shown in Figure 6, the\nmalware looks up its current path and moves the binary to the created folder. It hides the file\nby naming it “.po1kitd-update-k”.\n\n\n-----\n\n_Figure 6: Malware moves the binary to the hidden folder “po1kitd.thumb” created earlier. It_\n_first tries to use the “rename” function provided by libc. If this fails, it executes an “mv” shell_\n_command via the “system” function_ After installing the binary to the hidden folder, the\nmalware sets up persistence via “init” scripts. The following files are created after\nexecuting the malware on boot:\n\n/usr/syno/etc/rc.d/S99po1kitd-update.sh\n/etc/init.d/po1kitd-update\n/etc/rc2.d/S99po1kitd-update\n\nThe malware checks if the rootkit is active by creating a file and removing it. Then, the\nmalware compares the “saved set-user-ID” of the process to the user ID. If they don’t match,\nthe rootkit is enabled. If they match, it looks to see if the user ID is “10”. If this is the case, the\nrootkit is enabled. This logic is shown in Figure 7.\n\n\n-----\n\n_Figure 7: Logic used by RedXOR to check if the rootkit is enabled_ The “CheckLKM” logic is\n[almost identical to the “adore_init” function in the “adore-ng” rootkit. Afore-ng is a Chinese](https://github.com/yaoyumeng/adore-ng/blob/522c80a2dc043c2d523256472becc88c90d66337/libinvisible.c#L61)\nopen-source LKM (Loadable Kernel Module) rootkit. This technique allows the malware to\nstay under the radar by hiding its processes. The code for the init function is shown in Figure\n\n\n-----\n\n8. _Figure 8:_\n\n_Client authentication code for the adore-ng rootkit_\n\n## Configuration\n\nThe malware stores the configuration encrypted within the binary. In addition to the\nCommand and control (C2) IP address and port it can also be configured to use a proxy. The\nconfiguration includes a password, as can be seen in Figure 9. This password is used by the\nmalware to authenticate to the C2 server.\n\n\n-----\n\n_Figure 9: Configuration options for the malware The configuration values are decrypted by_\nthe “doXor” function. A pseudo-code representation of the function is shown in Figure 10.\nThe decryption logic is a simple XOR against a byte key. The byte key is incremented by a\nconstant for each item in the buffer. The only configuration value that is not encrypted is the\nserver port. The port value is used to derive the key and the adder. The key is derived from\nbit shifting the port value eight steps to the right. The constant uses the port value.\n\n\n-----\n\n_Figure 10: Decryption logic of the configuration_\n\n_data. The data is XORed against a key byte that is incremented by a constant for each entry_\n_in the buffer_\n\n## Communication with the C2\n\nThe malware communicates with the C2 server over a TCP socket. The traffic is made to\nlook like HTTP traffic. Figure 11 shows a pseudo-code representation of the function used by\nthe malware to prepare data that is to be sent to the C2 server. First, it fills the buffer with null\nbytes. The request body is XORed against a key. The malware uses the buffer length as the\nkey. This value is also passed into the function as the “total_length” argument.\n\n_Figure 11: Function for preparing data to be sent to the C2 server The same logic is used to_\ndecrypt the response body from the C2 server. From the response, the malware extracts\n“JSESSIONID”, “Content-Length”, “Total-Length” and the response body. The data is added\nto a struct with the following layout:\n0x0 JSESSIONID as int\n\n0x8 Content-Length as long\n\n0x10 Total-Length as long\n\n0x18 Response body\n\n\n-----\n\nThe content length is the length of the response body but also used as the key. The total\nlength value is used as a constant which is added to the key in each iteration. The\nJSESSIONID value holds the command ID for the job the C2 wants the malware to perform.\n\n## Commands\n\nThe C2 server tells the malware to execute different commands via a command code that is\nreturned in the “JSESSIONID” cookie. The codes are encoded as decimal integers. A full list\nof commands supported by the analyzed malware sample are shown in the table below.\nThey can be grouped into command types. Commands in the 2000 range provide\n“filesystem” interaction, 3000 handle “shell” commands, and 4000 handle network tunneling.\n**Table 1: List of commands supported by the malware**\n\n**Code** **Command**\n\n0000 System information\n\n0008 Update\n\n0009 Uninstall\n\n1000 Ping\n\n1010 Install LKM\n\n2049 List folder\n\n2054 Upload file\n\n2055 Open file\n\n2056 Execute with system\n\n2058 Remove file\n\n2060 Remove folder\n\n2061 Rename\n\n2062 Create new folder\n\n2066 Write content to file\n\n3000 Start shell\n\n3058 Exec shell command\n\n3999 Close tty\n\n4001 Portmap (Proxy)\n\n\n-----\n\n4002 Kill portmap\n\n## System Information\n\nWhen the malware first contacts the C2 server it sends a password encoded in the request\nbody. The C2 server responds with the command code 0 to collect system information. The\ndata collected about the system by the malware is listed in the table below. The data is\nserialized into a URL query-like string, encrypted and then sent as the request body. Table 2:\n**Data collected by the malware and sent back to the C2 server**\n\n**URL key** **Description** **Comment**\n\nhostip IP Hardcoded to 127.0.0.1\n\nsofttype Hardcoded to “Linux”\n\npscaddr MAC address\n\nhostname Machine name\n\nhosttar Username Possibly “host target”\n\nhostos Distribution Extracted from /etc/issue or /etc/redhat-release\n\nhostcpu Clock speed /proc/cpuinfo\n\nhostmem Amount of memory /proc/meminfo\n\nhostpack Hardcoded to “Linux”\n\nlkmtag Is rootkit enabled\n\nkernel Kernel version Extracted from uname\n\nFigure 12 shows the communication between RedXOR and the C2. The malware sends the\npassword “pd=admin” and C2 responds with “all right” (JSESSIONID=0000). Next, the\nmalware sends the system information and the C2 replies with the ping command\n(JSESSIONID=1000).\n\n\n-----\n\n_Figure 12: RedXOR communication with C2_\n\n## Update Functionality\n\nThe malware can be updated by the threat actor. This is performed by sending command\ncode 8 to the malware. When the malware receives this code the following actions are taken:\n\nThe malware opens the mutex file for writing.\nIt sends a request with the command code 8 and an empty request body to the C2\nserver.\nThe response body from the server is written to the mutex file. The response body is\nnot encrypted.\nThe lock is released on the mutex file.\nThe malware executes “chmod” to set the execution flag on the file via the libc system\nfunction.\nThe malware sleeps and tries to obtain the lock on the file again when it wakes up. If it\nfails, it assumes the update was successful, closes the connection to the C2 server and\nexits.\n\n\n-----\n\n## Shell Functionality\n\nThe malware has the ability to provide its operator with a “tty” shell. If a shell is requested via\nthe command code 3000, the malware creates a new thread executing “/bin/sh”. In the new\nspawned shell, the malware executes python -c “import pty;pty.spawn(‘/bin/sh’)” to get a\npseudo-terminal (pty) interface. Any shell commands sent to the malware with the command\ncode of 3058 are executed in the pty and the response is returned to the operator.\n\n## Network Tunneling\n\nNetwork tunneling is enabled by sending the command code 4001 to the malware. As part of\nthe request, a “configuration” is sent as part of the response body. The configuration consists\nof three items separated by a “#” character. The items are: a port to bind to, the IP to connect\nto, and a port to connect to. The malware uses a modified version of the open-source project\nRinetd for the tunneling logic. Rinetd is designed to use a configuration file stored on the\nmachine. To get around this, the malware author has modified the function that parses the\nconfiguration in order to directly take the required values normally found in the configuration\nfile.\n\n## Detection & Response\n\n Detect if a Machine in Your Network Has Been Compromised\n\n[Use a Cloud Workload Protection Platform like Intezer Protect to gain full runtime visibility](https://www.intezer.com/intezer-protect)\nover the code in your Linux-based systems and get alerted on any malicious or unauthorized\n[code or commands. Try our free community edition Figure 13 emphasizes an Intezer Protect](https://protect.intezer.com/signup)\nalert on a compromised machine. The alert provides additional context about the malicious\ncode including threat classification (RedXOR), binary’s path on the disk, process tree,\ncommand, and hash.\n\n\n-----\n\n_Figure 13: Intezer Protect alerts on RedXOR We also recommend using the IOCs section_\nbelow to ensure that the RedXOR process and the files it creates do not exist on your\nsystem.\nIntezer Protect defends all types of compute resources—including VMs, containers and\n[Kubernetes—against the latest Linux threats in runtime. Try our free community edition](https://protect.intezer.com/signup)\n\n## Response\n\nIf you are a victim of this operation, take the following steps:\n\n1. Kill the process and delete all files related to the malware.\n2. Make sure your machine is clean and running only trusted code using a Cloud\n\nWorkload Protection Platform like Intezer Protect.\n\n## Wrap Up\n\nLinux systems are under constant attack given that Linux runs on most of the public cloud\nworkload. A [survey conducted by Sophos found that 70% of organizations using the public](https://secure2.sophos.com/en-us/content/state-of-cloud-security.aspx)\ncloud to host data or workloads experienced a security incident in the past year. Along with\nbotnets and cryptominers, the Linux threat landscape is also home to sophisticated threats\n[like RedXOR developed by nation-state actors. RedXOR samples are indexed in Intezer](https://www.intezer.com/blog/malware-analysis/looking-back-on-the-last-decade-of-linux-apt-attacks/)\nAnalyze so that you can detect any suspicious file that shares code with this malware.\n\n\n-----\n\n_Figure 14: RedXOR sample in Intezer Analyze_\n\n## IoCs\n\n RedXOR\n\n0a76c55fa88d4c134012a5136c09fb938b4be88a382f88bf2804043253b0559f\n0423258b94e8a9af58ad63ea493818618de2d8c60cf75ec7980edcaa34dcc919\n\n## Network\n\nupdate[.]cloudjscdn[.]com 158[.]247[.]208[.]230 34[.]92[.]228[].216\n\n## Process name\n\npo1kitd-update-k\n\n## File and directories created on disk\n\n.po1kitd-update-k .po1kitd.thumb .po1kitd-2a4D53 .po1kitd-k3i86dfv .po1kitd-nrkSh7d6\n.po1kitd-2sAq14 .2sAq14 .2a4D53 po1kitd.ko po1kitd-update.desktop S99po1kitd-update.sh\n\n**Joakim Kennedy**\nDr. Joakim Kennedy is a Security Researcher analyzing malware and tracking threat actors\non a daily basis. For the last few years, Joakim has been researching malware written in Go.\nTo make the analysis easier he has written the Go Reverse Engineering Toolkit\n(github.com/goretk), an open-source toolkit for analysis of Go binaries.\n\n\n-----\n\n**Avigayil Mechtinger**\nAvigayil is a product manager at Intezer, leading Intezer Analyze product lifecycle. Prior to\nthis role, Avigayil was part of Intezer's research team and specialized in malware analysis\nand threat hunting. During her time at Intezer, she has uncovered and documented different\nmalware targeting both Linux and Windows platforms.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-10 - New Linux Backdoor RedXOR Likely Operated by Chinese Nation-State Actor.pdf"
    ],
    "report_names": [
        "2021-03-10 - New Linux Backdoor RedXOR Likely Operated by Chinese Nation-State Actor.pdf"
    ],
    "threat_actors": [
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535660,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1653753119,
    "ts_modification_date": 1653753119,
    "files": {
        "pdf": "https://archive.orkl.eu/825fa2a696dfcdb008c58da06a4fd584284d82c3.pdf",
        "text": "https://archive.orkl.eu/825fa2a696dfcdb008c58da06a4fd584284d82c3.txt",
        "img": "https://archive.orkl.eu/825fa2a696dfcdb008c58da06a4fd584284d82c3.jpg"
    }
}