{
    "id": "7c7d71b6-18d1-4634-adac-2790ae6305c8",
    "created_at": "2023-01-12T15:05:41.544237Z",
    "updated_at": "2025-03-27T02:11:33.907552Z",
    "deleted_at": null,
    "sha1_hash": "e4aa53bf48a4ebbc1c8454b13f21aa5d334ce731",
    "title": "2016-08-16 - Brazil Can’t Catch a Break- After Panda Comes the Sphinx",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:02Z",
    "file_modification_date": "2022-05-28T03:52:02Z",
    "file_size": 1507851,
    "plain_text": "# After Panda Comes the Sphinx\n\n**[securityintelligence.com/brazil-cant-catch-a-break-after-panda-comes-the-sphinx/](https://securityintelligence.com/brazil-cant-catch-a-break-after-panda-comes-the-sphinx/)**\n\n[Malware August 16, 2016](https://securityintelligence.com/category/x-force/malware-threat/)\n\n\nAugust 16, 2016\n\n\n-----\n\nBy [Limor Kessem co-authored by Denis Laskov,](https://securityintelligence.com/author/limor-kessem/) [Ziv Eli 4 min read](https://securityintelligence.com/author/ziv-eli/)\n[Within two weeks of the discovery of Zeus Panda (Panda Banker) activity, IBM X-Force](https://securityintelligence.com/panda-is-one-hungry-bear-a-heavyweight-banking-trojan-rolls-into-brazil/)\nresearchers have uncovered the first signs of Zeus Sphinx attacks in Brazil. A new version of\nZeus Sphinx, which is, like Panda, also a commercially available Zeus v2 variation, now\ntargets the online banking and Boleto payment services of three of the top Brazilian banks\nand one bank in Colombia, according to its configuration file.\n\nSphinx is a modular banking Trojan and considered to be as sophisticated as Panda and\nZeus Citadel. The timing of Sphinx’s migration to Brazil — while the country is hosting a\nglobal sporting event — hardly appears to be a coincidence. Cybercriminals are known to\nincrease their efforts during sporting events, taking advantage of the rise in online activity\nand interest around the competition to lure users into opening malware spam and phishing\npages.\n\n## Sphinx: Mythically Treacherous and Double-Edged\n\nZeus Sphinx is a banking Trojan and is a commercial offering sold to cybercriminals via\nunderground fraudster boards. The malware emerged in August 2015, at which point it\nstarted [targeting major banks in the U.K. This malware was known to primarily target](https://securityintelligence.com/uk-banks-hit-with-new-zeus-sphinx-variant-and-renewed-kronos-banking-trojan-attacks/)\nEuropean entities until recently.\n\nSo, another day, another Zeus? Not quite. Sphinx has been around for about a year now,\nlaunched initially in attacks targeting U.K. and Australian banks. X-Force Research analyzed\nSphinx’s modus operandi at the time and found that the malware combined elaborate fraud\ntactics to steal credentials and one-time passwords.\n\nSphinx’s configuration fetched webinjections in real time from its command-and-control\n(C&C) server, manipulated users to generate authentication codes with their card readers\nand even tricked victims into downloading a malware app to their mobile device to steal\ntransaction authentication codes sent from the bank via SMS.\n\n### Boleto Fraud Costs Brazilians Billions\n\nAccording to X-Force researchers, the Brazilian iteration of Zeus Sphinx, which is dubbed\nSphinx v2, most likely comes from the same developer and is customized to target local\nbanks. Aside from social engineering injections that ask for payment card PIN codes and PII,\nSphinx v2 has been adapted to rob Boleto payments from infected victims. For those that\naren’t familiar with Boleto payments, think of them as something similar to a money order in\nthe U.S.\n\n[According to X-Force researchers, Boletos have been a lucrative target for Brazilian malware](https://securityintelligence.com/boleto-malware-two-new-variants-discovered/)\n[authors for the past few years, with one estimate attributing $3.75 billion in fraud losses to](http://www.acfcs.org/3-75-billion-boleto-fraud-in-brazil-exposes-rise-of-global-cybercrime-threats/)\njust one cybercrime faction that targeted Brazilians from 2012 to 2014.\n\n\n-----\n\n### How Boleto Fraud Works\n\nThe typical Boleto fraud malware is facilitated by various codes, which are specifically\ndesigned to poison and rob payments from infected user endpoints. But in the case of Zeus\nSphinx v2, stealing Boletos is just one of the malware’s preconfigured theft mechanisms,\nenabled by real-time man-in-the-middle (MitM) webinjections.\n\nThe Boleto fraud begins when infected users initiate a Boleto Bancario during their online\nbanking session. At that moment, the malware identifies that a Boleto is being prepared and\ntriggers a set of JavaScript injections.\n\n**Related:** [Panda Is One Hungry Bear! A Heavyweight Banking Trojan Rolls Into Brazil](https://securityintelligence.com/panda-is-one-hungry-bear-a-heavyweight-banking-trojan-rolls-into-brazil/)\nSphinx collects the victim’s Boleto data and sends it to the criminal’s C&C. On the server\nside, the C&C reaches out to a legitimate open source API library that creates Boleto\nbarcodes from transaction details defined by the user. This happens without involving the\nbank’s server, where the victim’s original Boleto barcode should come from. Instead, the\ncriminal-generated barcode contains the routing data to a mule account and a modified\ntransfer amount.\n\nSince the barcode is not readable by humans, the victim cannot tell there is any issue with\nthe barcode response that appears to come from the bank. Ultimately, the rendered barcode\nthe victim unknowingly sends out is the poisoned Boleto request, which effectively reroutes\nthe payment to the criminal. This Sphinx feature automates the fraud and does not require\nmanual intervention from the cybercriminal behind the malware until the actual cashing out of\nthe Boleto payment.\n\n## A Mythical Beast Running the Streets\n\n[Zeus Sphinx, which is based on the leaked source code of the Zeus Trojan, targets retail](https://threatpost.com/zeus-source-code-leaked-051011/75217/)\nbanking and Boleto payments of banks in Brazil and Colombia. The malware adapts social\nengineering injections to manipulate users in each targeted bank. While in some cases\nSphinx webinjections only ask victims to provide passcodes and PII, in others it also requires\npayment card PIN codes as well as the person’s home and mobile phone numbers.\n\nThe latter case is interesting because it tells the story of fraud that’s typical to Brazil: mixing\ndigital and physical social engineering to scam victims and empty their accounts. In these\nschemes, fraudsters may start off the chain by stealing online banking details. Then, to\nobtain more information, they may supplement their scams with phone calls to the victims.\n\n## An Active and Evolving Project\n\nAfter the recent spread of Zeus Panda to Brazil, Sphinx’s move to the country may mark the\n[beginning of a trend that will add to Brazil’s existing cybercrime threats — a landscape that](https://securityintelligence.com/the-brazilian-malware-landscape-a-dime-a-dozen-and-going-strong/)\nhas been, until now, dominated by relatively simplistic Delphi-based malcode.\n\n\n-----\n\nThis migration of yet another commercial Zeus variant into Brazil further underscores the\ntrending collaboration between Brazil-based cybercriminals and cybercrime vendors from\nother countries and underground communities — a movement that has been picking up\nspeed in the country since the beginning of 2016.\n\nJudging by recent emerging campaigns observed by X-Force Research, Zeus Sphinx\nappears to be an active and evolving project, commercialized to cybercriminals through Dark\nWeb forums. As such, we may see more variations of this malware in the coming months\nand an expanding list of targets in Brazil.\n\n## Striking Down Zeus Sphinx Attacks\n\nIBM Security is familiar with Zeus Sphinx and its various attack schemes. To help thwart\n[Sphinx, banks can use adaptive malware detection solutions and](https://www.ibm.com/software/products/en/trusteer-pinpoint-malware-detection?ce=ISM0484&ct=SWG&cmp=IBMSocial&cm=h&cr=Security&ccy=US&ce=ISM0484&ct=SWG&cmp=IBMSocial&cm=h&cr=Security&ccy=US) [protect customer endpoints](https://www.ibm.com/software/products/en/trusteer-rapport?ce=ISM0484&ct=SWG&cmp=IBMSocial&cm=h&cr=Security&ccy=US&ce=ISM0484&ct=SWG&cmp=IBMSocial&cm=h&cr=Security&ccy=US)\nwith malware intelligence that provides real-time insight into fraudster techniques and\ncapabilities.\n\nTo prevent malware infections on their endpoints, users should make sure their operating\nsystem and frequently used programs are up to date at all times. When browsing, users\nshould disable ads and avoid sites typically prone to infection, such as those hosting adult\ncontent, torrents and free gaming. Most importantly, users should avoid clicking on links or\nattachments in unsolicited email.\n\n### Sample MD5\n\nA sample MD5 hash for the Zeus Sphinx Trojan is\n03915A1F03DF164F48AC4DFD04D9C2C4. Antivirus aliases include Trojan[Spy.Win32.Zbot, according to VirusTotal.](https://virustotal.com/en/file/7c73619ff8d5e4ed3b29b7ae71a69602df4071fd8c1029f9674e9978cdc03de9/analysis/)\n\nIBM X-Force Research will be updating information and IOCs on Zeus Sphinx via the XForce Exchange platform. Join XFE today to keep up to date regarding this threat and other\nfindings from our cybercrime labs.\n\n[Read the white paper: Accelerating growth and digital adoption with seamless identity trust](https://www.ibm.com/account/reg/us-en/signup?formid=urx-33205)\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-08-16 - Brazil Can’t Catch a Break- After Panda Comes the Sphinx.pdf"
    ],
    "report_names": [
        "2016-08-16 - Brazil Can’t Catch a Break- After Panda Comes the Sphinx.pdf"
    ],
    "threat_actors": [
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535941,
    "ts_updated_at": 1743041493,
    "ts_creation_date": 1653709922,
    "ts_modification_date": 1653709922,
    "files": {
        "pdf": "https://archive.orkl.eu/e4aa53bf48a4ebbc1c8454b13f21aa5d334ce731.pdf",
        "text": "https://archive.orkl.eu/e4aa53bf48a4ebbc1c8454b13f21aa5d334ce731.txt",
        "img": "https://archive.orkl.eu/e4aa53bf48a4ebbc1c8454b13f21aa5d334ce731.jpg"
    }
}