{
    "id": "7c96050b-4646-490a-8396-771839ed07bf",
    "created_at": "2023-04-23T02:08:58.705017Z",
    "updated_at": "2025-03-27T02:15:58.558544Z",
    "deleted_at": null,
    "sha1_hash": "c988a39b9003b070d8606376a626ab6a7fc4fe49",
    "title": "",
    "authors": "",
    "file_creation_date": "2023-04-10T11:16:57Z",
    "file_modification_date": "2023-04-10T11:16:57Z",
    "file_size": 554075,
    "plain_text": "# Money Over Morals: A Business Analysis of Conti Ransomware\n\n## Ian W. Gray Jack Cable Benjamin Brown Vlad Cuiujuclu Damon McCoy\n_New York University_ _Independent Researcher_ _University of Michigan_ _Flashpoint_ _New York University_\n\n\n**_Abstract—Ransomware operations have evolved from rela-_**\n**tively unsophisticated threat actors into highly coordinated cy-**\n**bercrime syndicates that regularly extort millions of dollars**\n**in a single attack. Despite dominating headlines and crippling**\n**businesses across the globe, there is relatively little in-depth**\n**research into the modern structure and economics of ransomware**\n**operations.**\n**In this paper, we leverage leaked chat messages to provide**\n**an in-depth empirical analysis of Conti, one of the largest**\n**ransomware groups. By analyzing these chat messages, we**\n**construct a picture of Conti’s operations as a highly-profitable**\n**business, from profit structures to employee recruitment and**\n**roles. We present novel methodologies to trace ransom payments,**\n**identifying over $80 million in likely ransom payments to Conti**\n**and its predecessor – over five times as much as in previous public**\n**datasets. As part of our work, we will publish a dataset of 666**\n**labeled Bitcoin addresses related to Conti and an additional 75**\n**Bitcoin addresses of likely ransom payments. Future work can**\n**leverage this case study to more effectively trace – and ultimately**\n**counteract – ransomware activity.**\n**_Index Terms—Ransomware, Conti, cybercrime_**\n\nI. INTRODUCTION\n\nRansomware is a type of malware that encrypts the files\non a victim’s computer, and charges an extortion fee for\nthe decryption key. Ransomware attacks have significantly\nincreased over the past years with the addition of more\nadversarial groups, new extortion tactics, and more targeted\nattacks. In 2021, ransomware payments exceeded $600 million\nUSD, according to cryptocurrency analysis firm Chainalysis\n\n[1].\nThis has resulted in the emergence of large-scale Ransomware as a Service (RaaS) operations that have streamlined\nsegments of their campaigns by dividing the work across\ndifferent roles and responsibilities. This often encompasses\naffiliate models, where a core team responsible for developing\nmalware leases it to others to deploy and infect potential\nvictims. However, there has been little academically peerreviewed analysis of modern ransomware operations. This lack\nof insight into backend information on RaaS campaigns has\nleft the security industry inferring for years, on an anecdotal\nbasis, how these threats operate.\nIn this paper, we perform an analysis of leaked chat messages and cryptocurrency addresses associated with Conti.\nBased on a report from Chainalysis, Conti is one of the\nmost prolific ransomware groups and has attacked thousands\nof organizations [1]. Conti’s victims include critical infrastructure entities such as hospitals and food providers [1].\n\n\nDespite setbacks to the Conti ransomware collective, including\nself-proclaimed shutdowns and re-branding, they continually\nranked in the top three ransomware groups for number of\nvictims and volume of ransoms in 2020 and 2021 [2].\nThe chat data was leaked by a Ukrainian security researcher\nin February 2022 in response to the Russian invasion of\nUkraine [3]. The leak included over 168,000 messages from\nConti’s internal chat logs. The chat logs contain information\npertaining to the inner workings of the group, such as discussions of malware development and victim negotiations. These\nchats contain a wealth of data to aid in the understanding of\nConti’s inner operations, including associates’ Bitcoin wallet\naddresses, employee recruitment processes, and delineation of\nroles and responsibilities.\nOur analysis drives insights that can be leveraged by law\nenforcement and policymakers to aid in counteracting ransomware. For instance, just two exchanges – one unidentified\nexchange and Gemini – are responsible for over 90% of\nidentified payments to Conti. Likewise, Conti exhibits poor\noperational security, with its associates sending a large amount\nof salary payments to exchanges like Gemini and Binance\nthat enforce Know Your Customer (KYC) regulations. These\ncentralized points provide opportunities to trace ransomware\nactors and seize funds.\nIn this paper, we make the following contributions:\n**Economic on-chain measurement. We manually annotate**\nall 666 Bitcoin addresses present in the leak according to their\nfunction (e.g. salary or reimbursement) which we will publicly\npublish. After annotating, we then use on-chain transaction\ndata to provide an analysis of Conti’s bottom line, including\nestimated gross revenue, operating cost, salary per role, cashout techniques, and relation to other cybercrime activity (like\ndark web marketplaces). As part of this analysis, we develop a\nmethodology to identify ransom payments based on common\nproceed splitting behavior, which we use to identify $83.9\nmillion in new likely payments.\n**Qualitative business structure analysis. The chat logs**\nalso contain qualitative information on different roles and\nresponsibilities of Conti. Along with the Bitcoin address\nannotations, we identified the roles and responsibilities within\nthe collective. We assessed team composition from the chats,\nas well as the primary users based upon interactions within\nthe chat logs. We also provide an analysis of their employee\nrecruitment process and challenges managers faced with employees that did not know the illicit nature of their employer.\n\n\n-----\n\nII. BACKGROUND\n\nIn this section, we describe the functional roles of the\narchetypal Ransomware as a Service operation. These roles\nare segmented into specialized tasks that fulfill different parts\nof the ransomware attack chain [4]. We explore how these roles\nexecute the respective parts of the ransomware campaign, from\nmalware delivery to cashing out [5], [6].\nRansomware operations require individuals to build, test,\nmaintain, and deliver the malware, as well as maintain victim\ncommunications during the ransom. Once a victim pays a\nransom in cryptocurrency, the attacker launders the funds\nthrough a variety of exchanges and third party services.\nSince the introduction of the first public ransomware leak\nsite in 2019, approximately 80 ransomware groups have created public leak sites, where they threaten to post victim data\nif victims fail to meets the terms of the extortion [7]. There\nare ransomware groups that do not maintain leak sites, and\nthus this number is not exhaustive. There is also overlap in\nthese operations, including code re-use, and re-branding that\ntypically occurs after a significant ransomware incident [8],\n\n[9].\nAt a macro-level, RaaS operations are generally divided\nbetween Ransomware Operators and Ransomware Affili**ates. The operators are typically salaried workers that recruit**\nnew members, develop the malware, advertise and sell access to their ransomware, and maintain the victim payment\nportal and leak site post-compromise. Affiliates are typically\ncommissioned workers that license the malware for a fee\nor a percentage of the ransom payment. Their role is to\ntarget and compromise new victims, deliver and execute the\nransomware, and handle victim negotiations. Affiliates have\nalso been associated with lateral movement, persistence, and\ndata exfiltration in a victim’s network [9], [10].\n**Management: RaaS operations can encompass hundreds of**\nspecialized workers. They have been likened to a gig economy for their on-demand services provided by their affiliate\nstructure. Additionally, many phases of the attack chain are\nfacilitated by human decision-making [9], [10]. The managers\nare responsible for the human effort, which includes human\nresources, hiring, finances, and payroll. Managers may also\nhave cross-departmental responsibilities, and support the other\nlines of effort listed below.\n**Development and Infrastructure: Illicit economies are**\ndependent upon administrative work and maintenance to ensure uninterrupted operations through development and infrastructure [11]. System administrators and software developers\nare salaried workers, essential to ensure uninterrupted RaaS\noperations. This may include acquiring or developing software,\nvirtual machines, servers, proxies, antivirus (to test malware\nagainst), and a variety of other tools. These roles also offer IT\nsupport functions.\n**Access Operations: Access brokers may sell access to**\naffiliates, who use the access to escalate privileges and move\nlaterally within a victims network. Initial access brokers\nmonetize access to victim’s networks. RaaS collectives may\n\n\nhave their own access brokers, or they may outsource to third\nparties for access-as-a-service. Initial access brokers employ a\nvariety of tactics, techniques, and procedures to gain access to\nvictims networks, including spear-phishing key members of an\norganization, compromised credentials or remote desktop protocols (RDP), and exploiting vulnerabilities [12]–[14]. Access\noperations may employ a variety of tools to deploy malware,\nincluding Emotet, IcedID, Trickbot, and BazarLoader.\n**Negotiations: Affiliates are typically responsible for manag-**\ning negotiations post-compromise through an admin panel included with the ransomware. Large corporations may employ\nthe use of ransomware negotiators, which deal directly with\nthe ransomware affiliates to transfer cryptocurrencies through\nexchanges. RaaS operators manage the public leak site, where\ndetails of the victim are included if they fail to pay within a\ngiven time period. The operators also control the processing\nof ransomware payments.\n\nIII. DATA\n\nOur analysis in this study uses both leaked data, public\nblockchain data, and an annotated set of Bitcoin addresses\nfrom Crystal Blockchain, a commercial blockchain analysis\nplatform [15]. Table I provides a brief description of these\ndata sources. When using leaked data, there can arise both\nethical and validity concerns. In this section, we provide an\noverview of the datasets, discuss how we validated the data,\nand talk about the ethical framework of our study.\n\n_A. Description_\n\nOn February 27, 2022, the Twitter account @ContiLeaks\nbegan tweeting links to an anonymous file sharing service\nthat contained information related to the Conti Ransomware\ncollective. In addition to malware source code and other\ninternal files, the account shared three files of chat logs: two\nfiles containing messages from Conti’s Jabber server and one\nfile containing messages from Conti’s Rocket.Chat server.\nThe dataset that we used for our analysis only contained text\n(i.e., no images). The leaked chats cover the period from July\n2020 to February 2022. The portion of the dataset we analyzed\ndid not contain any Personally Identifiable Information (PII).\nWe created a set of regular expressions to extract Bitcoin addresses and confirmed that they were valid addresses. Table II\nprovides a summary of the the datasets that we analyzed.\n\n_B. Validation_\n\nThe leaked datasets have been extensively validated by the\nsecurity community, including the fact that gaps in the chat\nlogs correlate with times when Conti was disrupted by law\nenforcement [16]. In our analysis, Bitcoin addresses included\nin the leak are consistent with previously-known Conti Bitcoin\naddresses, such as those in the Ransomwhere dataset [17],\nwith addresses in the leak having received funds from both\nConti payment addresses and Ryuk (another ransomware strain\noperated by the same threat group [18]). Furthermore, we do\nnot observe any internal inconsistencies in the dataset.\n\n\n-----\n\nSource Information Explanation\n\nLeaked Chats timestamps, message, participants Leaked Chat logs from Conti Jabber server\nBitcoin Transactions addresses, amount, timestamp Public Bitcoin Blockchain Data\nCrystal Blockchain annotated Bitcoin addresses Platform to investigate Bitcoin addresses\n\nTable I: Summary of Datasets\n\n\nSource Time Period Posts Users Addresses\n\nJabber 2020-06-21 - 2022-02-25 168,624 463 665\nRocket.Chat 2020-08-31 - 2022-02-26 88,110 248 1\n\nTable II: Summary of Leaked Conti Chat Logs\n\n_C. Ethics_\n\nWe reason about potentially harms of our study through\nthe lens of the Menlo report [19]. We have two primary\nethical questions. The first is a high-level question concerning\nwhether the data being leaked should prima facie prohibit all\nsubsequent uses of it. For example, should a researcher be\nprohibited from analyzing the Facebook leaks in understanding\ntheir policies? We believe that the potential benefits of our\nstudy to society outweigh the minimal increased risks of harm.\nWe observe that this data is already broadly available and\nthe knowledge of its existence, its association with the Conti\norganization, and information, such as online handles and\namount of Bitcoin transactions, have been publicly documented. Also, there is likely little if any Personally Identifiable\nInformation (PII) in this leak and we did not find any during\nour analysis. This was a criminal service and the usernames\nare pseudonyms that are intentionally difficult to link to the\nactual persons. Thus, there is a minimal risk of us creating\nany new harm from our analysis.\nTo further manage any remaining harms we institute several\nsafeguards. We did not attempt to deanonymize anyone in\nthese leaks as part of our study. Also, we do not use the\npublicly-known real names of any Conti employees or affiliates.\n\nIV. METHODOLOGY\n\n_A. Database Annotation_\n\nJabber, the Extensible Messaging and Presence Protocol\n(XMPP), is a popular messaging application in the cybercrime\nunderground. The open source instant messenger supports\nstrong encryption, and independent federated servers that\nare located around the world [20]. Well-established cybercrime forums, like Exploit, run their own Jabber servers.\nThe Conti collective also operated their own Jabber server:\nq3mcco35auwcstmt[.]onion.\nSimilar to other online messengers, the Conti Leaks often\nincluded short text that by itself was absent of any substantive\ncontent. The large number of users (n = 463) within the chats\nare often overlapping, and span different parts of the operation.\nAdditionally, Russian cybercriminals often use specialized\nslang, dubbed Феня (Fenya), that is purposefully difficult for a\nlayperson to understand as it provides shorthand, obfuscation,\n\n\nand signals group membership [21]. To better prepare the\nleaked messages for scientific analysis, we included a mixed\nmethod analysis that included quantitative and qualitative data\nanalysis.\nOur primary objective in analyzing the data is to conduct an\neconomic on-chain analysis of the cryptocurrency addresses\nobserved in the dataset. We conducted a regular expression\nsearch within the chat messages to identify all mentions of\nBitcoin addresses. In total, we identified 665 Bitcoin addresses\nin the Jabber dataset and 1 Bitcoin address in the Rocket.Chat\ndataset. As a result, we primarily focused on the Jabber dataset\nfor this analysis.\nIn order to provide context when annotating addresses,\nwe included 10 messages in a conversation before and 10\nmessages after each mention of a Bitcoin address. Using this\napproach, we were able to augment machine-translated text\nwith manual translations for Russian slang, label the context\nof the Bitcoin address to inform the follow-on economic and\nbusiness analysis, and ascribe roles to the Conti ransomware\noperators through the context of the chat messages.\nTo better understand the context of the messages, including\nthe Russian cybercrime slang, one of our annotators is a native\nRussian speaker and expert in the criminal underground. Three\nof the authors annotated the addresses, with one author annotating each address. We maintained a Russian slang dictionary\nthat annotators could reference throughout our analysis.\nWhen reviewing the Bitcoin addresses, we annotated the\naddresses according to the following labels:\n**Salary: The address is associated with a request for salary**\nor payment. Associates in the chat will often request from a\nmanager that a salary be transferred to a wallet.\n**Reimbursement: The address is associated with a request**\nfor reimbursement for a variety of services. Associates may\ndirectly or indirectly request through a manager that funds be\ntransferred to a wallet for reimbursement of various tools.\n**Ransom Payment Address: The address is used to receive**\npayment from a Conti ransomware victim.\n**Claimed Ownership: A member of the Conti collective**\nclaimed to own the address.\n**Services: Any services that we can identify being directly**\nmentioned by the Conti collective.\n**Victim Name: The name of the victim who made the payment.**\n\n_Inter-Annotator agreement: To ensure that our annotations_\nwere consistent across researchers, we randomly sampled\n100 posts containing cryptocurrency addresses and conducted\na blind annotation with 3 raters. We then measured InterAnnotator Agreement (IAA) by computing Fleiss’ Kappa\n\n\n-----\n\nfor all 3 raters, which yielded a score of 0.73, indicating\nsubstantial agreement [22].\n\n_B. Economic On-Chain Measurement_\n\nWe obtained Bitcoin addresses from the Conti leaks as\nwell as the Ransomwhere dataset [17]. Ransomwhere is a\npublic, crowdsourced dataset of ransomware payment addresses, which we use to understand the blockchain techniques\nof Conti. We then performed on-chain blockchain analysis,\ndetailed here, on these addresses.\nTo enrich our data, we fetched incoming and outgoing\ntransaction data for all addresses from the blockchain.com\nAPI [23]. We then calculated dollar values for transactions by\nmultiplying the amount of Bitcoin transacted by the closing\nBitcoin to USD exchange rate the date the transaction was\nmade from the CoinDesk API [24]. While we cannot know\nthe exact amount the ransomware actors sold the Bitcoin for,\nthis serves as an approximation and is consistent with previous\nwork [6], [25].\nAdditionally, to understand the types of wallets the\naddresses have interacted with, we utilized Crystal\nBlockchain [15]. Crystal Blockchain is a blockchain\nanalytics tool that offers insight into the ownership of Bitcoin\naddresses based on a variety of public sources [26]. We\nfetched the source and destination entities for all addresses in\nthe dataset.\nIn order to gain insight into the proceeds of Conti, we\nperformed analysis to identify potential ransom payment addresses. Based on confirmed Conti ransom payment addresses\nfrom Ransomwhere and those labeled in our dataset, we found\n17 of 32 addresses to exhibit payment splitting, where the\nproceeds are immediately split to two wallets according to an\nexact percentage. This is likely due to the affiliate structure\nof Conti, where affiliates and the Conti core developers split\nproceeds. We found that for the 17 split addresses, split\npercentages ranged from 5% to 40%, with the most common (9\naddresses) being 20%. An example of a split payment is shown\nin Figure 1. Note that when we refer to split percentages,\nthe percentage is the portion of the payment that the Conti\ncollective keeps, with the remaining portion going to the\naffiliate.\n\nFigure 1: An example of splitting. This address received 22\nBitcoin from the US-based Gemini exchange, and split into\n25% and 75%. 1 Bitcoin from this address would eventually be\nsent to an address in the leak. Other funds were transferred to\nother illicit entities, such as the sanctioned exchange Garantex.\n\n\nIn addition to low-risk exchanges such as Gemini, a large\nportion of these ransom payments to Conti originate from\nan unlabeled cluster of Bitcoin addresses. It is possible that\nthis cluster belongs to an Over The Counter (OTC) desk,\nwhich many exchanges operate as a way for customers to\nexchange cryptocurrency outside of private markets. Given\nthe significant portion of known Conti ransom payments\noriginating from this cluster, it is possible that it is used by\na common ransomware negotiator or incident response firm\nworking with multiple victims. We consider this cluster in\nfurther analysis as a potential origin of Conti payments. Future\nwork may attempt to identify the owner of this cluster.\nWe also analyzed 41 ransom payment addresses belonging\nto Ryuk from the Ransomwhere dataset. Ryuk is widely\nbelieved to be the predecessor to Conti, and both Conti and\nRyuk have been attributed by Crowdstrike to be operated\nby the Wizard Spider group [27]. Of these 41 addresses, 17\nexhibited splitting. Split percents ranged from 10% to 50%,\nwith the most common (6 addresses) being 35%.\nTo discover other likely ransom payment addresses, we\nconsidered addresses that: (1) sent money (directly or indirectly) to an address in the leaked dataset, (2) exhibited\nsplitting according to an exact percent that was a multiple\nof 5 (e.g. 20%, 25%) and (3) had received more than 99%\nof its funds from a low risk exchange (e.g. Gemini) or the\nidentified unlabeled cluster. Results of this analysis are detailed\nin Section V.\nWhile we are able to designate these addresses as likely\nransom payment addresses, the distinction between whether\nthey are Conti or Ryuk is less clear. Through the course of the\nanalysis, we observed previously known Ryuk addresses being\nused to fund addresses in the leaked Conti dataset, further\nsuggesting that Conti and Ryuk are operated by the same actor.\nAs Wizard Spider (an organized cybercrime group that has\nbeen attributed to Conti, Ryuk, TrickBot, and BazarLoader)\npaused operating Ryuk in March 2020, which coincided with\nthe emergence of Conti, we label a likely ransom payment\naddress as Ryuk if the address was first used before March\n2020, and Conti otherwise [18].\n\n_C. Qualitative Business Analysis_\n\nWe extracted the unique aliases (463) from the Conti Leaks,\nand created a separate annotation document. We then read\nthrough the full dataset of the Conti Leaks (168,624 messages)\nand attempted to categorize the user roles based upon the\ncontent of their conversations. We found that a small number\nof individuals comprise a large number of the chats, so we\nsorted the aliases by degree centrality to understand who sent\nand received the most messages. We then decided to focus on\nthe top 50 aliases, as most were also observed in our prior\nannotation of the cryptocurrency addresses. We maintained a\nfull list of users, however we chose to focus annotations on\nthe top 50.\nWe made the following categories to understand their roles\nwithin the organizations: Role, Direct Report, Working Re**lationships, Alternative Aliases, and Tasks. While certain**\n\n\n-----\n\nSource Amount Addresses\n\nRansom payments in leaked dataset $3.4M 5\nRansom payments (Ransomwhere) $17.1M 28\nLikely ransom payments (Conti) $57.4M 41\nLikely ransom payments (Ryuk) $26.5M 34\n**Total income** **$104.4M** **107**\n\nSalary $21.9M 419\nReimbursement/Salary $5.4M 15\nReimbursement $3.8M 227\n**Total expenses** **$31.2M** **661**\n\nTable III: Conti income and expenses based on annotated\nBitcoin addresses, Ransomwhere data, and inferred payments.\n\ninformation regarding their respective roles could be gleaned\nfrom the chats, we had to otherwise infer based upon the\ncontext of the discussions, or their working relationships.\n\nV. ECONOMIC ANALYSIS\n\nAs with any business, Conti has income and expenses. The\nbigger the profit margin, the more its operators can walk\naway with. To begin our economic analysis, we utilize the\nlabeled addresses to understand which addresses represent a\nbusiness expense for Conti and which represent income. We\nconsider reimbursements and salary to be expenses, while\nransom payments are income.\nTable III shows the total income and expenses for Conti. Of\nthe addresses in the leaked dataset, salaries represent the most\nin number (419) and the highest dollar value at $21.9 million.\nAddresses that are used for both salary and reimbursements\nare relatively low in number but represent $5.4 million in\npayments. Reimbursements, while lower in dollar value at $3.8\nmillion, have 227 addresses, suggesting that less money goes\nto reimbursement wallets on average than salary addresses.\nBased on addresses in the leaks alone (the first row of\nTable III), expenses exceed income. This is to be expected, as\nConti primarily used its administrator portal to communicate\nwith victims, while the leaked chat logs appear to be the primary forum for requesting salary payment and reimbursement.\nAs a result, ransom payment addresses surface in the chat\nlogs only incidentally, while salaries and reimbursements are\nexpected.\nNonetheless, we can identify likely ransom payment addresses. Given that Conti’s income comes from ransom payments, and due to the traceable nature of Bitcoin, we can trace\nback payments visible in the leaked dataset to the ransom\npayments where the funds originate. Using the criteria established in Section IV, we identify 75 likely ransom payment\naddresses representing $83.9 million in payments. Of this,\nbased on the dates Ryuk and Conti were active, we label\n$26.5 million as Ryuk payments and $57.4 million as Conti\npayments. The largest discovered likely payment of $9.5M is\nshown in Figure 2.\nGiven this perspective, income begins to dwarf expenses. In\naddition to leftover money from Ryuk used to fund the Conti\noperation, the total Conti income ($77.9 million) is more than\ndouble total expenses ($31.2 million). A significant portion\n\n\nFigure 2: The largest discovered likely payment, of $9.5M in\nMarch 2020. The funds originated from the unlabeled cluster\ndiscussed in Section IV.\n\nExchange Confirmed Payments Likely Payments Total\n\nUnlabeled Cluster $8.6M $64.8M $73.4M\nGemini $5.9M $17.4M $23.1M\nKraken $1.0M $0.2M $1.2M\nCoinbase $0.4M $0.6M $1.1M\nBinance $0.6M $0.0M $0.6M\n\nTable IV: Top exchanges from which Conti ransom payments\noriginate. Note that \"Unlabeled Cluster\" represents the unlabaled cluster of bitcoin addresses, discussed in Section IV.\n\nof the proceeds go directly to the hands of affiliates. Our\nnumbers are likely incomplete – Chainalysis identified $180\nmillion in proceeds from Conti in 2021 alone [1]. However,\nunlike Chainalysis, we have provided our methodology for\nidentifying ransom payment and we will publicly publish the\naddresses.\nTable IV shows the most common origins of confirmed and\nlikely Conti ransom payments. The unlabeled cluster discussed\nin Section IV represents a majority of payments – almost\n70%. Following that, Gemini composes a significant share at\n$23.1 million. The fact that just two exchanges represent the\nvast majority of identified payments to Conti suggests strong\nintervention points.\nWe have published the derived likely ransom payment\naddresses on GitHub. [1] Notably, the release of these addresses\nincreases the amount of publicly known Conti payments more\nthan fivefold – from Ransomwhere’s $17.1 million to $104.4\nmillion.\nNext, we consider the sources and funds of funds from\nwallets in the leaked dataset, shown in Figure 3. We use money\nlaundering risk levels provided by Crystal Blockchain to group\nexchanges into three categories of low, medium, and high risk.\nConsistent with the hypothesis that most money originates\nfrom victim payments, most money originates either from low\nrisk exchanges or the unlabeled cluster. Moderate-high risk\nexchanges, sanctioned exchanges, illegal services, and mixers\nrepresent smaller amounts – suggesting that some Conti actors\nmight take steps to conceal their funds, though this practice\nis not systematized across the group. The receiving profile\nvaries by type of address – ransom payment funds come almost\nexclusively from low risk exchanges or the unlabeled cluster,\nwhile salaries and reimbursements represent a more diverse\nportfolio. We speculate that some salaries and reimbursements\n\n[1See https://github.com/cablej/conti-payments](https://github.com/cablej/conti-payments)\n\n\n-----\n\nFigure 3: Labelled origins and destinations of wallet funds occurring in the Conti leaks dataset. Note that unknown addresses\nare excluded. “mlrisk” stands for money laundering risk. Further, note that as there are few ransom payment addresses in the\nConti leaks dataset, the \"victim\" section in this chart only represents a fraction of all victim ransom payments to Conti.\n\n\nare paid from a slush fund belonging to the core operators, and\nthus have a variety of sources.\nA large portion of wallet transactions, somewhat surprisingly, are to low risk exchanges – exchanges most likely to\nabide by Know Your Customer (KYC) regulations. Gemini\nand Binance account for a large portion of these funds –\n$4.3 million and $2.9 million, respectively. Given Gemini’s\nposition particularly as a regulated, U.S.-based exchange,\nConti actors may have jeopardized their operational security\nby trading there. Other funds wind up in a variety of illicit\ndestinations, such as $6.8M in Ren Exchange, a peer-to-peer\ncross-blockchain exchange that can be used to launder funds,\n$2.8M in the Seychelles-based exchange Huobi, and $1.4M in\nthe now-sanctioned Hydra marketplace.\nOf the expanded set of ransom payments, the destination of\nfunds includes a variety of services used to launder money.\n$14.4M is sent to Ren Exchange, $17.9M to Huobi, and\n$12.6M to Binance. While both Huobi and Binance enforce\nKYC, certain illicit exchanges such as the now-sanctioned\nSuex have operated \"nested exchanges\" within both exchanges,\nproviding an opportunity to launder funds through otherwiseregulated exchanges [28].\nThe leaks also offer insight into the individual salaries of\nConti associates. Based on addresses where a Conti associate\nappeared to have claimed ownership of the address – most\noften a salary address – we compute the highest-grossing associates to be tramp ($1.2M), mango ($470K), baget ($400K),\nbullet ($280K), and andy ($98K). We note that this is an\nincomplete view into the proceeds of these associates.\nWe also observe evidence of co-spending among some\nassociates. Co-spending occurs when two Bitcoin addresses\nare used as input to the same transaction, suggesting that the\n\n\nsame entity controls both addresses. We observe two clusters\nof associates – viper, jumbo, ganesh and sonar, and sticks,\nstakan, elvira, and bekeeper. It is likely that these two clusters\nuse a shared Bitcoin wallet to manage their funds, or otherwise\nshare ownership of funds.\n\nVI. BUSINESS ANALYSIS\n_A. Overlap and Re-branding_\nConti is assessed to be the successor of the Ryuk RaaS collective, which largely down-scaled their operations in March\n2020 [18]. This is evidenced from the leftover revenue that we\nidentified that was likely used to fund Conti. Ryuk and Conti\nshared multiple features, most notably the use of Trickbot for\ninitial infection.\nIt is well documented that Trickbot and Conti are both\ntechnically and operationally interconnected [29]. This overlap\nis significant to understand some of the roles and structures\nwithin Conti, because there are shared group members duties.\nTrickbot provided the initial infection and facilitated the installation of the Conti ransomware on a victim’s machine, similar\nto Ryuk [30]. An arrest warrant for a member of the Trickbot\ncollective, max, indicates that a large number of Trickbot’s\nmembers had also collaborate on the Dyre Trojan, a precursor\nto Trickbot. The remaining members of the Dyre collective\ntransitioned to Trickbot following Dyre’s takedown in 2015\n\n[30]. max’s alias was identified within the Conti Leaks, also\nindicating overlap with Trickbot and Conti. Further, the Conti\nLeaks Twitter account leaked information from both Trickbot\nand Conti, including Trickbot’s wider membership, indicating\nthat there is approximately 18% overlap with those Trickbot\naliases within Conti’s Jabber.\nThe indictment of Trickbot malware developers max and\nfollow-on indictment of ffx provided further details into the\n\n\n-----\n\nTrickbot organization, which also helped inform our understanding of Conti. Some of the same roles and responsibilities\nthat were observed within the Trickbot organization were\nalso observed within Conti, indicating that it was likely a\nrebranding as opposed to a reorganization. Trickbot and Conti\nalso shared similarities in their roles, responsibilities, and\nrecruiting methods [30], [31].\n\nFigure 4: A flow chart demonstrating the recruitment sources\nof a RaaS affiliate\n\n_B. RaaS Roles, Responsibilities, and Recruiting_\n\nSimilar to RaaS collectives, Trickbot relied upon a network\nof specialized workers to facilitate different functions. For\nexample, the unnamed defendants in the Trickbot indictment\nincluded the following roles:\n\n_• Malware Manager: Recruiting, hiring, testing malware,_\nand procuring infrastructure\n\n_• Malware Developer: Oversaw functionality within the_\ndevelopment of the malware\n\n_• Crypters: Encrypted the malware to prevent detection_\nfrom anti-virus\n\n_• Spammers: Deployed the malware through targeted and_\nbroad-based phishing campaigns\nAccording to the indictment, Trickbot advertised these roles\non legitimate job posting websites, like LinkedIn and Indeed,\nas well as Russia-based freelance websites. After completion\nof a programming test, users were added to a private Jabber\nOTR communication server where they collaborated on \"development, maintenance, and deployment of Trickbot.\" This\nis consistent with our observations of the recruiting methods\nused by Conti, which included recruiting for licit roles on job\n\n\nposting website like Avito, HeadHunter, and Profi[.]ru. Conti\nutilized similar recruiting methods, as observed in their Jabber,\nand select threads on underground forums.\nOn August 5, 2021, a disgruntled Conti affiliate m1Geelka\nleaked internal training materials, and IP addresses of their\nCobalt Strike servers on XSS, a top tier underground forum.\nm1Geelka also commented on an IT recruitment thread from\na user IT_Work, stating that it was an advertisement to\nwork with Conti. Between June 10, 2021 and September 6,\n2021, IT_Work had posted multiple offerings on underground\nRussian language forums, like XSS and Exploit, advertising\nseemingly legitimate job roles to support large IT projects.\nIn our research, we assessed that these advertisements for\nlicit roles were in concert with job postings on Russian-based\nfreelance websites.\n\n_• C++ Programmer (with reverse engineering skills)_\n\n_• Full-stack web developer for PHP, NodeJS_\n\n_• Windows System Administrator_\n\n_• Data Analyst_\n\n_• Business Analyst_\n\n_• UI/UX Designer_\n\n_• HTML Designer_\n\n_• Pentester_\n\nIT_Work’s posts demonstrate that while RaaS collectives\nare commonly associated with illicit tasks, like malware management and development, they also rely on technical talent to\nmaintain infrastructure. These seemingly licit advertisements,\nalbeit on underground forums, allowed Conti to recruit witting\nand unwitting tech workers to support the infrastructure of\ntheir operation.\nFollowing the Colonial Pipeline ransomware incident on\nMay 6, 2021, President Biden threatened action against \"ransomware networks [32].\" As a result, XSS, Exploit, and Raid\nForums banned ransomware advertisements. The leader of\nthe former Babuk ransomware collective then started their\nown dedicated ransomware forum in May 2021, originally\ndubbed Payload.bin. The site changed its name to RAMP\n(Ransom Anon Market Place). While originally a closed forum\ncomposed of reputable threat actors, RAMP became public\nin August 2021 following an extortion attempt. Ransomware\nadvertisements continued to be available on Telegram and\nJabber [33].\nConti suffered a minor disruption in November 2021 after\ndetails of their infrastructure were reported on by a security\nfirm [34]. Shortly thereafter, a user JordanConti surfaced on\nRAMP highlighting that they were undeterred by the disruption, which included \"peripheral IPs and wallets.\" JordanConti\nbegan openly recruiting for illicit roles required for their\nransomware operation on RAMP, listing the Russian language\nas a requirement. The following roles were advertised on\nRAMP:\n\n_• Pentesters: \"Top networkers who know how to bypass_\nproblematic AVs like Sentinel, work with RMM (Remote\nMonitoring Management) and EDR and backups\"\n\n\n-----\n\n_• Bot herders: \"Ideally, people with their own botnet, with_\na sufficient number of corp bots, especially in the US.\"\n\n_• Targeted Spammers: \"who could beautifully send letters_\nfor \"individual recipients\" - the priority is USA.\"\nFrom the Conti Leaks, we were able to ascertain that their\nHR specialists were also continuing to recruit on Russianlanguage freelance job posting websites and specialized universities. According to the Jabber chat logs, details of the roles\nvaried. In a conversation between viper, a hiring representative,\nand bourbon, a developer, the reasoning varied from \"we do\npentesting for big clients,\" to more vague responses like \"the\nwork is remote, communication via messenger, the nature of\nthe work is specific. That’s all I know about conditions.\" viper\nthen specified, \"We do pen testing, write hacker software exploits, grabbers, spam bots and more.\"\nThe legitimacy of the work was often questioned throughout\nthe Conti leaks, as workers wondered why they had to be paid\nin cryptocurrencies, only communicated through encrypted\nmessenger, and were unaware of the name or actual function\nof their employer. It does not appear that Conti used front\ncompanies to obscure their operations, but relied upon their\nmanagers to convey the appropriate messaging of the work.\nThis meant deceiving their employees, or providing indirect\nanswers to describe the true nature of their work.\n\n_C. Team Composition_\n\nFrom the chats, it appears that Conti is divided into several\nsub-teams. These teams are generally divided into functional\nareas, including management, development and infrastructure,\naccess operations, and negotiations. These roles are consistent\nwith the ransomware team structure outlined in the background.\nIn a chat from mango, a manager that oversees development\nand infrastructure, to stern, the organizational leader, mango\nshares details of the structure of his team, along with budgeted\nsalaries:\n\nthe main team - $97,447; 52 people\nnew team - $4,000; 3 people, one has not started\nyet\nreverse engineering - $23,347; 16 people\nresearch team - $12,500; 6 people\nosint intelligence team - $9,000; 4 people\n\nmango’s team does not appear to encompass the whole\nConti operation, however one functional area. The total\nmonthly salary for their team is assessed to be $146,294.\nOther references to a team structure appeared throughout\nthe chat. For example, in a conversation between target and\npoll, target asks if poll needs individuals to attack logistics\nand manufacturing. poll highlights that they have a team that\nonly \"locks defense/military companies.\" In this regard, it\nappears that the sector specific targeting is divided between\nsub-divisions. However, some sector targeting like healthcare\nappeared to be off-limits.\n\n\nAmong RaaS operations as a whole, operators have informally agreed not to target healthcare. Following the DarkSide\nattack on Colonial Pipeline, REvil announced several new selfimposed restrictions for its operators and their affiliates. These\nannounced restrictions included not targeting social sectors\n(such as healthcare and education) or any government entities,\nas well as requiring ransomware affiliates to get REvil operators’ approval for any future targets. In an interview, LockBit\nclaimed that they have a, \"negative attitude towards those who\nencrypt medical and educational institutions.\" In an exchange\nbetween reshaev, one of Conti’s main developers, and pin, who\nis possibly an affiliate, pin defends their reasoning for targeting\na sports treatment center, claiming that it has no resuscitation\nunit and they have over 3K in insurance. reshaev emphasizes\nthat they have a policy prohibiting ransoming healthcare, and\nrecommends that pin \"goes around them now.\" Despite this\nassertion, Conti had ransomed the healthcare sector through\ntheir operation including Ireland’s Health Service Executive\n(HSE) and Department of Health (DoH), presumably choosing\nmoney over morals.\nIn the Conti leaks, there are abstract references to specific\nteams. For example, mango introduces themselves as \"support\nC, manager for general issues of the team trick locker,\nnow I’m looking for access to work for the gang.\" buza, a\nteam lead of coders, in an exchange with hof, a technical\nmanager, makes abstract reference to \"rocket\" and \"A,\" likely\nmeaning Rocket.Chat and team \"A\" (one of three teams). The\nRocket.Chat messages, though not included in our primary\nresearch, did include details of the team composition of\nthe access operations. The user alter briefly described the\nstructure and responsibilities of teams A, B, and C. alter did\nnot mention the size of the groups, however there were 54\nunique aliases in that server.\n\nThe current composition is divided into groups,\neach group is assigned a team leader (one or two\ndepending on the size of the group).\n\n_D. Primary Actors_\n\nTo further understand the main actors within the Conti leaks\nJabber, we sorted the aliases by degree centrality. The top five\nindividuals within the chats, defender, stern, buza, mango, and\nbentley, are Conti managers controlling payments, operations,\ndevelopers, and malware builds. These managers also fulfilled\nHR functions, often sending bulk messages to users with\ncomments, queries, and reminders to share cryptocurrency addresses for payments. Users that had a lower degree centrality\nwere likely affiliates or developers. The limited number of\nchat messages made their roles much more difficult to identify.\nManagers like buza identified their developers by role in bulk\nmessages that included requests to continue working on a bug\ntracker.\nDefender also sent bulk messages, not identifying recipients\nby role, requesting for alternative forms of communication.\nThis likely indicates that the leaked Jabber was likely a\n\n\n-----\n\ncentralized communication channel, and other communication\nchannels may have been used for more specialized operations,\nlike the Rocket.chat and Trickbot Forum, which included\ndetails on using the Trojan.\nThe managers have power of the purse. The top five users by\ncentrality are assessed to be some of the primary leadership,\nsince their role also included communications with the channel. Requests for funds typically occurred in the Conti leaks\nJabber, with team leads requesting salaries and reimbursement\nfrom managers on the behalf of the individuals on their teams.\nThis information helped inform us on the hierarchy of the\nroles, relationship between aliases, and an understanding of\nthe team structure.\nHowever, unlike previous cybercrime research that described the importance of cybercrime cultural capital within\ncommunities, the allure of experience and experimentation, it\nappears that RaaS operations center around mundane tasks of\noperating infrastructure [11], [35]–[37]. The most important\nmembers of the Conti operation appear to be the managers\noverseeing the collective work, administering salaries, and\napproving expenses for reimbursement.\n\n_E. Rewards for Justice_\n\nOn May 6, 2022, the Department of State offered a $10\nmillion reward for information leading to the identification\nor location of the members of Conti collective as part of\nthe Rewards for Justice program. On August 11, 2022, they\nrequested specific information on five individuals:\n\n_• dandis: manager, crypters_\n\n_• professor (aka alter): ransomware negotiator_\n\n_• reshaev: manager, ransomware builds_\n\n_• target: manager, access operations_\n\n_• tramp: manager, operations_\n\nFrom our research, we identified these individuals as being highly technical managers concerned with crypters, ransomware builds and development, access operations, and victim negotiations. Most of these aliases also appears within the\nTrickbot leaks, indicating that this may have overlap with the\naforementioned Trickbot investigation. These individuals were\nmost likely selected based upon the value that they provide the\nConti collective in achieving a competitive advantage in the\nRaaS landscape [38].\nOn February 9, 2023 (following the initial publication of\nthis paper), the United States and United Kingdom sanctioned\nseveral members of the Trickbot collective for their role\nin cybercrime and ransomware operations [39]. These\nindividuals also appeared in the Conti Leaks, through the\nprimary aliases shared in the sanction, or alternative aliases\nthat helped us identify their membership in the collective.\nThe following individuals were included in the sanction:\n\n_• bentley (aka ben): senior manager_\n\n_• baget: developer_\n\n\n\n_• globus: developer_\n\n_• tropa (aka kerasid): money laundering_\n\n_• iseldor: malicious injects_\n\n_• mushroom: manager_\n\n_• strix: administrator_\n\nThese sanctions demonstrate a continued focus on cybercrime and ransomware operations. While the Rewards for\nJustice identified many of the lead members of Conti by\nalias, the sanctions listed the seven individuals by name.\nThese measures underscore the importance of human capital\nin building and maintaining modern ransomware operations.\n\nVII. RELATED WORK\n\nIn order to conduct our analysis of the Conti ransomware\noperation, we use and extend methodologies from cyptocurrency tracking, leaked cybercrime data, and ransomware analysis.\n\n_A. Cryptocurrency Tracking_\n\nPrior work has shown that Bitcoin wallets and transactions\nare often linkable to the same entity using several heuristics [40]–[43]. These Bitcoin tracing heuristics have been\nimplemented into a number of commercial cryptocurrency\nforensic analysis tools which also use techniques to label the\nowner of account clusters, such as Chainalysis, TRM Labs,\nElliptic, and Crystal Blockchain. We use Crystal Blockchain’s\ncryptocurrency forensic tools to perform analysis of Bitcoin\naccounts that we identify in the leaked Conti chat data.\nHuang et al. conducted a two year end-to-end measurement\nof ransomare operations, tracing bitcoin from acquisition to\nransomware payment. In this analysis, known-victim payments\nwere identified through seed addresses, and were clustered\nwith previously unknown-victims. The authors identified ransomware revenue exceeding $16 million USD, and infrastructure that was used to cashout illicit proceeds [6]. PaquetClouston et al. identify $13 million USD in ransomware\npayments between 2013 and 2017 [44].\n\n_B. Ransomware as a Service_\n\nOosthoek et al. analyze over $100 million in ransom\npayments through a crowd-sourced dataset of ransomware\naddresses [25]. The authors characterized the shift from commodity ransomware to RaaS. Along with increased profits\ncame a growing sophistication evidenced by faster time to\nlaunder funds and increased operational security practices.\nWe build on this work by conducting an in-depth analysis\nof a single ransomware groups, which allows us to map over\nfive times the amount of payments to Conti, in addition to\noperating costs which were not previously analyzed.\nPrevious work has also documented the practice of Ransomware as a Service groups \"splitting\" payments between\nthe ransomware group and affiliates. Cong et al. document\nDarkSide’s split percentage, which varies based on the size of\nthe ransom payment [45]. Regarding Conti, Elliptic noted a\n22.5% split for several Conti ransom payment addresses [46].\n\n\n-----\n\n_C. Conti_\n\nTo date, relatively little academic work has analyzed\nthe Conti leaks. Cong et al. investigate the cryptocurrency\nactivities of several notable ransomware groups, including\nConti [45]. The authors compile data from a variety of sources,\nincluding public and proprietary data. As part of their work,\nthe authors discuss Conti’s activity at a high level, including\nanalyzing Conti’s posting of victim data on leak sites. Our\nwork builds on this paper by performing in-depth analysis of\nConti’s economic and business practices, including extracting\nand analyzing 666 Bitcoin addresses, compared to the 239\naddresses the authors extracted.\nOther industry groups have analyzed primarily the business\naspects of the Conti leaks, including ForeScout, Secureworks,\nand Check Point [47]–[49].\n\nVIII. CONCLUSION\n\nOur study of Conti presents a vignette into the structure of\na modern Ransomware as a Service group. This is the first\ncomprehensive crypto-economic analysis of the Conti leaks,\nbased on our annotation of cryptocurrency addresses present in\nthe leaks, on-chain analysis of cryptocurrency payments, and\nqualitative business assessment based upon user conversations.\nThrough our analysis, we developed a methodology to identify ransom payments based on common splitting behavior. We\nuse this methodology to identify $83.9 million in new likely\npayments and can help to better inform ransomware-affiliated\npayments through exchanges. Identifying these payments may\nassist cryptocurrency exchanges in blocking these payments,\nputting additional pressure on ransomware operators.\nWe find significant leverage points in both economic and\nbusiness areas. The fact that a significant portion of funds both\nare received from and sent to low-risk exchanges presents an\nopportunity to monitor and seize funds. Further, targeting the\norganizational leadership responsible for the recruiting, hiring,\ntraining, and administering the various business units and\ninfrastructure can also have an impact on their ability to function. The affiliate structure additionally provides opportunities\nto disrupt the more technical operators of the ransomware,\nthereby preventing affiliates’ ability to lease the malware or\nreceive operational support.\n\nACKNOWLEDGMENT\n\nWe thank the anonymous reviewers for their insightful and\nconstructive suggestions and feedback, and Crystal Blockchain\nfor providing access to their platform. Funding for this work\nwas provided in part by National Science Foundation grants\n1844753 and 2039693.\n\nREFERENCES\n\n[1] Chainalysis, As Ransomware Payments Continue to\n_Grow, So Too Does Ransomware’s Role in Geopolitical_\n_[Conflict, en-US, Feb. 2022. [Online]. Available: https:](https://blog.chainalysis.com/reports/2022-crypto-crime-report-preview-ransomware/)_\n[//blog.chainalysis.com/reports/2022- crypto- crime-](https://blog.chainalysis.com/reports/2022-crypto-crime-report-preview-ransomware/)\n[report-preview-ransomware/ (visited on 09/18/2022).](https://blog.chainalysis.com/reports/2022-crypto-crime-report-preview-ransomware/)\n\n\n\n[2] Trend Micro, LockBit, Conti, and BlackCat Lead Pack\n_Amid Rise in Active RaaS and Extortion Groups: Ran-_\n_somware in Q1 2022 - Security News, en. [Online]._\n[Available: https : / / www. trendmicro . com / vinfo / us /](https://www.trendmicro.com/vinfo/us/security/news/ransomware-by-the-numbers/lockbit-conti-and-blackcat-lead-pack-amid-rise-in-active-raas-and-extortion-groups-ransomware-in-q1-2022)\n[security/news/ransomware- by- the- numbers/lockbit-](https://www.trendmicro.com/vinfo/us/security/news/ransomware-by-the-numbers/lockbit-conti-and-blackcat-lead-pack-amid-rise-in-active-raas-and-extortion-groups-ransomware-in-q1-2022)\n[conti-and-blackcat-lead-pack-amid-rise-in-active-raas-](https://www.trendmicro.com/vinfo/us/security/news/ransomware-by-the-numbers/lockbit-conti-and-blackcat-lead-pack-amid-rise-in-active-raas-and-extortion-groups-ransomware-in-q1-2022)\n[and-extortion-groups-ransomware-in-q1-2022 (visited](https://www.trendmicro.com/vinfo/us/security/news/ransomware-by-the-numbers/lockbit-conti-and-blackcat-lead-pack-amid-rise-in-active-raas-and-extortion-groups-ransomware-in-q1-2022)\non 09/23/2022).\n\n[3] S. Lyngaas, “I can fight with a keyboard’: How one\nUkrainian IT specialist exposed a notorious Russian\nransomware gang”, Mar. 2022. [Online]. Available:\n[https://www.cnn.com/2022/03/30/politics/ukraine-](https://www.cnn.com/2022/03/30/politics/ukraine-hack-russian-ransomware-gang/index.html)\n[hack-russian-ransomware-gang/index.html.](https://www.cnn.com/2022/03/30/politics/ukraine-hack-russian-ransomware-gang/index.html)\n\n[4] A. Hutchings and R. Clayton, “Configuring Zeus: A\ncase study of online crime target selection and knowledge transmission”, in 2017 APWG Symposium on\n_Electronic Crime Research (eCrime), ISSN: 2159-1245,_\n[Apr. 2017, pp. 33–40. DOI: 10.1109/ECRIME.2017.](https://doi.org/10.1109/ECRIME.2017.7945052)\n[7945052.](https://doi.org/10.1109/ECRIME.2017.7945052)\n\n[5] K. Thomas, D. Y. Huang, D. Wang, et al., “Framing\nDependencies Introduced by Underground Commoditization”, en, p. 24,\n\n[6] D. Y. Huang, M. M. Aliapoulios, V. G. Li, et al.,\n“Tracking Ransomware End-to-end”, en, in 2018 IEEE\n_Symposium on Security and Privacy (SP), San Fran-_\ncisco, CA: IEEE, May 2018, pp. 618–631, ISBN: 978[1-5386-4353-2. DOI: 10.1109/SP.2018.00047. [Online].](https://doi.org/10.1109/SP.2018.00047)\n[Available: https : / / ieeexplore . ieee . org / document /](https://ieeexplore.ieee.org/document/8418627/)\n[8418627/ (visited on 07/12/2022).](https://ieeexplore.ieee.org/document/8418627/)\n\n[7] L. Abrams, Allied Universal Breached by Maze Ran_somware, Stolen Data Leaked, en-us, Nov. 2019. [On-_\n[line]. Available: https : / / www . bleepingcomputer .](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)\n[com / news / security / allied - universal - breached - by -](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)\n[maze - ransomware - stolen - data - leaked/ (visited on](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)\n08/24/2022).\n\n[8] L. Abrams, Ryuk successor Conti Ransomware releases\n_data leak site, en-us, Aug. 2020. [Online]. Available:_\n[https://www.bleepingcomputer.com/news/security/ryuk-](https://www.bleepingcomputer.com/news/security/ryuk-successor-conti-ransomware-releases-data-leak-site/)\n[successor- conti- ransomware- releases- data- leak- site/](https://www.bleepingcomputer.com/news/security/ryuk-successor-conti-ransomware-releases-data-leak-site/)\n(visited on 08/28/2022).\n\n[9] K. Baker, Ransomware as a Service (RaaS) Explained |\n_[CrowdStrike, en, Feb. 2022. [Online]. Available: https:](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)_\n[//www.crowdstrike.com/cybersecurity-101/ransomware/](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)\n[ransomware-as-a-service-raas/ (visited on 09/22/2022).](https://www.crowdstrike.com/cybersecurity-101/ransomware/ransomware-as-a-service-raas/)\n\n[10] Microsoft, Human-operated ransomware attacks: A pre_ventable disaster, en-US, Mar. 2020. [Online]. Avail-_\n[able: https://www.microsoft.com/security/blog/2020/03/](https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/)\n[05/human-operated-ransomware-attacks-a-preventable-](https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/)\n[disaster/ (visited on 09/21/2022).](https://www.microsoft.com/security/blog/2020/03/05/human-operated-ransomware-attacks-a-preventable-disaster/)\n\n[11] B. Collier, R. Clayton, A. Hutchings, and D. R. Thomas,\n“Cybercrime is (often) boring: Maintaining the infrastructure of cybercrime economies”, en, p. 25,\n\n[12] E. David, The Secret Life of an Initial Access Broker,\n[en-US, Aug. 2020. [Online]. Available: https://kela.](https://kela.local/the-secret-life-of-an-initial-access-broker/)\n[local / the - secret - life - of - an - initial - access - broker/](https://kela.local/the-secret-life-of-an-initial-access-broker/)\n(visited on 09/05/2022).\n\n\n-----\n\n[13] P.-M. Bureau, Initial access broker repurposing tech_niques in targeted attacks against Ukraine, en-us, Sep._\n[2022. [Online]. Available: https://blog.google/threat-](https://blog.google/threat-analysis-group/initial-access-broker-repurposing-techniques-in-targeted-attacks-against-ukraine/)\n[analysis - group / initial - access - broker - repurposing -](https://blog.google/threat-analysis-group/initial-access-broker-repurposing-techniques-in-targeted-attacks-against-ukraine/)\n[techniques-in-targeted-attacks-against-ukraine/ (visited](https://blog.google/threat-analysis-group/initial-access-broker-repurposing-techniques-in-targeted-attacks-against-ukraine/)\non 09/08/2022).\n\n[14] V. Stolyarov and B. Sevens, Exposing initial access\n_broker with ties to Conti, en-us, Mar. 2022. [Online]._\n[Available: https://blog.google/threat- analysis- group/](https://blog.google/threat-analysis-group/exposing-initial-access-broker-ties-conti/)\n[exposing- initial- access- broker- ties- conti/ (visited on](https://blog.google/threat-analysis-group/exposing-initial-access-broker-ties-conti/)\n08/19/2022).\n\n[15] [“Crystal Blockchain”, [Online]. Available: https : / /](https://crystalblockchain.com/)\n[crystalblockchain.com/.](https://crystalblockchain.com/)\n\n[16] B. Krebs, “Conti ransomware group diaries, part i:\n[Evasion”, Mar. 2022. [Online]. Available: https : / /](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-i-evasion/)\n[krebsonsecurity.com/2022/03/conti-ransomware-group-](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-i-evasion/)\n[diaries-part-i-evasion/.](https://krebsonsecurity.com/2022/03/conti-ransomware-group-diaries-part-i-evasion/)\n\n[17] J. Cable, Ransomwhere: A Crowdsourced Ransomware\n_Payment Dataset, version 1.0.1, Zenodo, May 2022._\n\n[DOI: 10 . 5281 / zenodo . 6562484. [Online]. Available:](https://doi.org/10.5281/zenodo.6562484)\n[https://doi.org/10.5281/zenodo.6562484.](https://doi.org/10.5281/zenodo.6562484)\n\n[18] CrowdStrike, “WIZARD SPIDER Update: Resilient,\nReactive and Resolute”, Oct. 2020. [Online]. Available:\n[https : / / www. crowdstrike . com / blog / wizard - spider-](https://www.crowdstrike.com/blog/wizard-spider-adversary-update/)\n[adversary-update/.](https://www.crowdstrike.com/blog/wizard-spider-adversary-update/)\n\n[19] D. Dittrich and E. Kenneally, “The menlo report: Ethical principles guiding information and communication\ntechnology research”, Accessed: 2022-9-20.\n\n[20] P. Howell O’Neill, Why Jabber reigns across the Rus_sian cybercrime underground, en, Apr. 2017. [Online]._\n[Available: https : / / www . cyberscoop . com / jabber -](https://www.cyberscoop.com/jabber-xmpp-cybercrime-russia-encrypted-chat/)\n[xmpp- cybercrime- russia- encrypted- chat/ (visited on](https://www.cyberscoop.com/jabber-xmpp-cybercrime-russia-encrypted-chat/)\n08/12/2022).\n\n[21] R. Faithfull, Russian prison culture and slang on cyber_criminal forums: Can you cram on the hairdryer? | Dig-_\n_ital Shadows, en-US, May 2022. [Online]. Available:_\n[https://www.digitalshadows.com/blog- and- research/](https://www.digitalshadows.com/blog-and-research/russian-prison-culture-and-slang-on-cybercriminal-forums-can-you-cram-on-the-hairdryer/)\n[russian- prison- culture- and- slang- on- cybercriminal-](https://www.digitalshadows.com/blog-and-research/russian-prison-culture-and-slang-on-cybercriminal-forums-can-you-cram-on-the-hairdryer/)\n[forums- can- you- cram- on- the- hairdryer/ (visited on](https://www.digitalshadows.com/blog-and-research/russian-prison-culture-and-slang-on-cybercriminal-forums-can-you-cram-on-the-hairdryer/)\n08/12/2022).\n\n[22] J. L. Fleiss, “Measuring agreement between two judges\non the presence or absence of a trait”, Biometrics,\nvol. 31, no. 3, pp. 651–659, 1975, ISSN: 0006341X,\n[15410420. [Online]. Available: http://www.jstor.org/](http://www.jstor.org/stable/2529549)\n[stable/2529549 (visited on 09/01/2022).](http://www.jstor.org/stable/2529549)\n\n[23] Blockchain.com, Blockchain Data API, en. [Online].\n[Available: https://www.blockchain.com/api/blockchain_](https://www.blockchain.com/api/blockchain_api)\n[api (visited on 09/07/2022).](https://www.blockchain.com/api/blockchain_api)\n\n[24] [CoinDesk, “Coindesk API”, [Online]. Available: https:](https://api.coindesk.com/v1/bpi/historical/close.json)\n[//api.coindesk.com/v1/bpi/historical/close.json.](https://api.coindesk.com/v1/bpi/historical/close.json)\n\n[25] K. Oosthoek, J. Cable, and G. Smaragdakis, A Tale of\n_Two Markets: Investigating the Ransomware Payments_\n_Economy, en, arXiv:2205.05028 [cs], May 2022. [On-_\n[line]. Available: http://arxiv.org/abs/2205.05028 (visited](http://arxiv.org/abs/2205.05028)\non 07/12/2022).\n\n\n\n[26] Crystal Blockchain, “Frequently asked questions”, [On[line]. Available: https : / / crystalblockchain . com /](https://crystalblockchain.com/frequently-asked-questions/)\n[frequently-asked-questions/.](https://crystalblockchain.com/frequently-asked-questions/)\n\n[27] CrowdStrike, “Wizard spider”, [Online]. Available:\n[https://adversary.crowdstrike.com/en- US/adversary/](https://adversary.crowdstrike.com/en-US/adversary/wizard-spider/)\n[wizard-spider/.](https://adversary.crowdstrike.com/en-US/adversary/wizard-spider/)\n\n[28] A. Baydakova, “Here’s what we know about suex, the\nfirst crypto firm sanctioned by us”, Oct. 2021. [Online].\n[Available: https://www.coindesk.com/business/2021/10/](https://www.coindesk.com/business/2021/10/05/heres-what-we-know-about-suex-the-first-crypto-firm-sanctioned-by-us/)\n[05/heres-what-we-know-about-suex-the-first-crypto-](https://www.coindesk.com/business/2021/10/05/heres-what-we-know-about-suex-the-first-crypto-firm-sanctioned-by-us/)\n[firm-sanctioned-by-us/.](https://www.coindesk.com/business/2021/10/05/heres-what-we-know-about-suex-the-first-crypto-firm-sanctioned-by-us/)\n\n[29] TRM Labs, TRM Analysis Corroborates Suspected Ties\n_Between Conti and Ryuk Ransomware Groups and_\n_Wizard Spider | TRM Insights, en, Apr. 2022. [Online]._\n[Available: https : / / www. trmlabs . com / post / analysis -](https://www.trmlabs.com/post/analysis-corroborates-suspected-ties-between-conti-and-ryuk-ransomware-groups-and-wizard-spider)\n[corroborates-suspected-ties-between-conti-and-ryuk-](https://www.trmlabs.com/post/analysis-corroborates-suspected-ties-between-conti-and-ryuk-ransomware-groups-and-wizard-spider)\n[ransomware - groups - and - wizard - spider (visited on](https://www.trmlabs.com/post/analysis-corroborates-suspected-ties-between-conti-and-ryuk-ransomware-groups-and-wizard-spider)\n08/28/2022).\n\n[30] _Latvian National Charged for Alleged Role in Transna-_\n_tional Cybercrime Organization, en, Jun. 2021. [On-_\n[line]. Available: https : / / www. justice . gov / opa / pr /](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\n[latvian- national- charged- alleged- role- transnational-](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\n[cybercrime-organization (visited on 09/23/2022).](https://www.justice.gov/opa/pr/latvian-national-charged-alleged-role-transnational-cybercrime-organization)\n\n[31] U.S. Department of Justice, Russian National Extra_dited to United States to Face Charges for Alleged Role_\n_in Cybercriminal Organization, en, Oct. 2021. [Online]._\n[Available: https://www.justice.gov/opa/pr/russian-](https://www.justice.gov/opa/pr/russian-national-extradited-united-states-face-charges-alleged-role-cybercriminal)\n[national-extradited-united-states-face-charges-alleged-](https://www.justice.gov/opa/pr/russian-national-extradited-united-states-face-charges-alleged-role-cybercriminal)\n[role-cybercriminal (visited on 08/23/2022).](https://www.justice.gov/opa/pr/russian-national-extradited-united-states-face-charges-alleged-role-cybercriminal)\n\n[32] The White House, Remarks by President Biden on the\n_Colonial Pipeline Incident, en-US, May 2021. [Online]._\n[Available: https://www.whitehouse.gov/briefing-room/](https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/05/13/remarks-by-president-biden-on-the-colonial-pipeline-incident/)\n[speeches-remarks/2021/05/13/remarks-by-president-](https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/05/13/remarks-by-president-biden-on-the-colonial-pipeline-incident/)\n[biden- on- the- colonial- pipeline- incident/ (visited on](https://www.whitehouse.gov/briefing-room/speeches-remarks/2021/05/13/remarks-by-president-biden-on-the-colonial-pipeline-incident/)\n08/30/2022).\n\n[33] Flashpoint, After Ransomware Ads Are Banned On\n_Cybercrime Forums, Alternative Platforms Being Used_\n_to Advertise and Recruit, Jul. 2021. [Online]. Available:_\n[https : / / flashpoint . io / blog / avoslocker - ransomware -](https://flashpoint.io/blog/avoslocker-ransomware-advertise-and-recruit/)\n[advertise-and-recruit/ (visited on 08/30/2022).](https://flashpoint.io/blog/avoslocker-ransomware-advertise-and-recruit/)\n\n[34] MalwareHunterTeam [@malwrhunterteam], Malware_hunterteam on Twitter, en, Tweet, Nov. 2021. [Online]._\n[Available: https://twitter.com/malwrhunterteam/status/](https://twitter.com/malwrhunterteam/status/1461450607311605766)\n[1461450607311605766 (visited on 08/30/2022).](https://twitter.com/malwrhunterteam/status/1461450607311605766)\n\n[35] T. J. Holt, R. Brewer, and A. Goldsmith, “Digital drift\nand the “sense of injustice”: Counter-productive policing of youth cybercrime”, en, 2019, Accepted: 2019-0611T01:47:37Z ISBN: 9780030114939 Publisher: Taylor\n[& Francis, ISSN: 0163-9625. [Online]. Available: https:](https://digital.library.adelaide.edu.au/dspace/handle/2440/119431)\n[//digital.library.adelaide.edu.au/dspace/handle/2440/](https://digital.library.adelaide.edu.au/dspace/handle/2440/119431)\n[119431 (visited on 09/23/2022).](https://digital.library.adelaide.edu.au/dspace/handle/2440/119431)\n\n[36] R. Leukfeldt and T. J. Holt, Eds., The Human Factor\n_of Cybercrime, English. Taylor & Francis, 2019, Ac-_\n[cepted: 2019-12-09 13:48:21. [Online]. Available: https:](https://library.oapen.org/handle/20.500.12657/23615)\n[//library.oapen.org/handle/20.500.12657/23615 (visited](https://library.oapen.org/handle/20.500.12657/23615)\non 09/23/2022).\n\n\n-----\n\n[37] A. Goldsmith and D. S. Wall, “The seductions of\ncybercrime: Adolescence and the thrills of digital\ntransgression”, en, European Journal of Criminol_ogy, vol. 19, no. 1, pp. 98–117, Jan. 2022, Pub-_\n[lisher: SAGE Publications, ISSN: 1477-3708. DOI: 10.](https://doi.org/10.1177/1477370819887305)\n[1177 / 1477370819887305. [Online]. Available: https :](https://doi.org/10.1177/1477370819887305)\n[/ / doi . org / 10 . 1177 / 1477370819887305 (visited on](https://doi.org/10.1177/1477370819887305)\n09/23/2022).\n\n[38] _Conti – Rewards For Justice, en-US. [Online]. Avail-_\n[able: https://rewardsforjustice.net/rewards/conti/ (visited](https://rewardsforjustice.net/rewards/conti/)\non 08/19/2022).\n\n[39] _United States and United Kingdom Sanction Members_\n_of Russia-Based Trickbot Cybercrime Gang, en, Jan._\n[2023. [Online]. Available: https://home.treasury.gov/](https://home.treasury.gov/news/press-releases/jy1256)\n[news/press-releases/jy1256 (visited on 02/09/2023).](https://home.treasury.gov/news/press-releases/jy1256)\n\n[40] F. Reid and M. Harrigan, “An analysis of anonymity in\nthe bitcoin system”, in 2011 IEEE Third International\n_Conference on Privacy, Security, Risk and Trust and_\n_2011 IEEE Third International Conference on Social_\n_Computing, 2011, pp. 1318–1326._ [DOI: 10 . 1109 /](https://doi.org/10.1109/PASSAT/SocialCom.2011.79)\n[PASSAT/SocialCom.2011.79.](https://doi.org/10.1109/PASSAT/SocialCom.2011.79)\n\n[41] E. Androulaki, G. O. Karame, M. Roeschlin, T. Scherer,\nand S. Capkun, “Evaluating user privacy in bitcoin”,\nin Financial Cryptography and Data Security, A.-R.\nSadeghi, Ed., Berlin, Heidelberg: Springer Berlin Heidelberg, 2013, pp. 34–51, ISBN: 978-3-642-39884-1.\n\n[42] D. Ron and A. Shamir, “Quantitative analysis of the full\nbitcoin transaction graph”, in Financial Cryptography\n_and Data Security, A.-R. Sadeghi, Ed., Berlin, Heidel-_\nberg: Springer Berlin Heidelberg, 2013, pp. 6–24.\n\n[43] S. Meiklejohn, M. Pomarole, G. Jordan, et al., “A fistful\nof bitcoins: Characterizing payments among men with\nno names”, Commun. ACM, vol. 59, no. 4, pp. 86–93,\n[Mar. 2016, ISSN: 0001-0782. DOI: 10.1145/2896384.](https://doi.org/10.1145/2896384)\n\n[[Online]. Available: https://doi.org/10.1145/2896384.](https://doi.org/10.1145/2896384)\n\n[44] M. Paquet-Clouston, B. Haslhofer, and B. Dupont,\n“Ransomware payments in the bitcoin ecosystem”,\n_[CoRR, vol. abs/1804.04080, 2018. arXiv: 1804.04080.](https://arxiv.org/abs/1804.04080)_\n\n[[Online]. Available: http://arxiv.org/abs/1804.04080.](http://arxiv.org/abs/1804.04080)\n\n[45] L. Cong, C. R. Harvey, D. Rabetti, and Z.-Y. Wu,\n“An anatomy of crypto-enabled cybercrimes”, 2022.\n\n[[Online]. Available: https://ssrn.com/abstract=4188661.](https://ssrn.com/abstract=4188661)\n\n[46] Elliptic, “Conti Ransomware Nets at Least $25.5 Million in Four Months”, Nov. 2021. [Online]. Available:\n[https://www.elliptic.co/blog/conti-ransomware-nets-at-](https://www.elliptic.co/blog/conti-ransomware-nets-at-least-25.5-million-in-four-months)\n[least-25.5-million-in-four-months.](https://www.elliptic.co/blog/conti-ransomware-nets-at-least-25.5-million-in-four-months)\n\n[47] Forescout, “Analysis of conti leaks”, Mar. 2022. [On[line]. Available: https://www.forescout.com/resources/](https://www.forescout.com/resources/analysis-of-conti-leaks/)\n[analysis-of-conti-leaks/.](https://www.forescout.com/resources/analysis-of-conti-leaks/)\n\n[48] Secure Works, “GOLD ULRICK Leaks Reveal Organizational Structure and Relationships”, Mar. 2022.\n\n[[Online]. Available: https : / / www. secureworks . com /](https://www.secureworks.com/blog/gold-ulrick-leaks-reveal-organizational-structure-and-relationships)\n[blog/gold-ulrick-leaks-reveal-organizational-structure-](https://www.secureworks.com/blog/gold-ulrick-leaks-reveal-organizational-structure-and-relationships)\n[and-relationships.](https://www.secureworks.com/blog/gold-ulrick-leaks-reveal-organizational-structure-and-relationships)\n\n[49] Check Point, “Leaks of Conti Ransomware Group Paint\nPicture of a Surprisingly Normal Tech Start-Up... Sort\n\n\n[Of”, Mar. 2022. [Online]. Available: https://research.](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\n[checkpoint . com / 2022 / leaks - of - conti - ransomware -](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\n[group- paint- picture- of- a- surprisingly- normal- tech-](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\n[start-up-sort-of/.](https://research.checkpoint.com/2022/leaks-of-conti-ransomware-group-paint-picture-of-a-surprisingly-normal-tech-start-up-sort-of/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://damonmccoy.com/papers/Ransomware_eCrime22.pdf"
    ],
    "report_names": [
        "Ransomware_eCrime22.pdf"
    ],
    "threat_actors": [
        {
            "id": "8492b1a0-126f-4113-b8f7-101d28559629",
            "created_at": "2023-01-06T13:46:38.864213Z",
            "updated_at": "2025-03-27T02:00:02.938147Z",
            "deleted_at": null,
            "main_name": "GRIM SPIDER",
            "aliases": [
                "GOLD ULRICK"
            ],
            "source_name": "MISPGALAXY:GRIM SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "53f39e5d-6d69-4402-b03c-ec2dbe045788",
            "created_at": "2024-06-19T02:03:08.132007Z",
            "updated_at": "2025-03-27T02:05:17.401832Z",
            "deleted_at": null,
            "main_name": "GOLD ULRICK",
            "aliases": [
                "UNC1878 ",
                "Grim Spider "
            ],
            "source_name": "Secureworks:GOLD ULRICK",
            "tools": [
                " Buer Loader",
                " Cobalt Strike",
                " Conti",
                " Diavol",
                " Powershell Empire",
                " Ryuk",
                " SystemBC",
                " Team9 (aka BazarLoader)",
                " TrickBot",
                "Bloodhound"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "699b7efc-322d-489d-818d-823fac028124",
            "created_at": "2023-01-06T13:46:39.404825Z",
            "updated_at": "2025-03-27T02:00:03.07918Z",
            "deleted_at": null,
            "main_name": "APT9",
            "aliases": [
                "NIGHTSHADE PANDA",
                "Red Pegasus",
                "Group 27"
            ],
            "source_name": "MISPGALAXY:APT9",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e79324a2-bdae-4dc5-9421-578a59045288",
            "created_at": "2022-10-25T16:07:23.906087Z",
            "updated_at": "2025-03-27T02:02:10.022303Z",
            "deleted_at": null,
            "main_name": "Nightshade Panda",
            "aliases": [
                "APT 9",
                "FlowerLady",
                "FlowerShow",
                "Group 27",
                "Nightshade Panda",
                "Operation Seven Pointed Dagger"
            ],
            "source_name": "ETDA:Nightshade Panda",
            "tools": [
                "3102 RAT",
                "9002 RAT",
                "Agent.dhwf",
                "BKDR_EVILOGE",
                "BKDR_HGDER",
                "BKDR_NVICM",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "EvilGrab",
                "EvilGrab RAT",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "MoonWind",
                "MoonWind RAT",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Vidgrab",
                "Wmonder",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1682215738,
    "ts_updated_at": 1743041758,
    "ts_creation_date": 1681125417,
    "ts_modification_date": 1681125417,
    "files": {
        "pdf": "https://archive.orkl.eu/c988a39b9003b070d8606376a626ab6a7fc4fe49.pdf",
        "text": "https://archive.orkl.eu/c988a39b9003b070d8606376a626ab6a7fc4fe49.txt",
        "img": "https://archive.orkl.eu/c988a39b9003b070d8606376a626ab6a7fc4fe49.jpg"
    }
}