{
    "id": "7d044e79-5cff-47b3-a06d-71ba997d3aa0",
    "created_at": "2023-01-12T15:10:26.796326Z",
    "updated_at": "2025-03-27T02:08:41.432839Z",
    "deleted_at": null,
    "sha1_hash": "0dc67b2b5b5b3101796557ff8f5fbf938dae606d",
    "title": "2022-01-21 - A deeper UEFI dive into MoonBounce",
    "authors": "",
    "file_creation_date": "2022-05-28T23:20:55Z",
    "file_modification_date": "2022-05-28T23:20:55Z",
    "file_size": 86317,
    "plain_text": "# A deeper UEFI dive into MoonBounce\n\n**[binarly.io/posts/A_deeper_UEFI_dive_into_MoonBounce/index.html](https://www.binarly.io/posts/A_deeper_UEFI_dive_into_MoonBounce/index.html)**\n\n[After uncovering FinSpy several months ago, an APT threat targeting UEFI bootloaders, in the](https://securelist.com/finspy-unseen-findings/104322/)\n[morning of January 20th 2022, Kaspersky Lab has released a new report on their latest discovery,](https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468)\na very interesting UEFI firmware threat dubbed MoonBounce.\n\n[Last year, the ESET researchers discovered ESPecter another threat which also targets EFI](https://www.welivesecurity.com/2021/10/05/uefi-threats-moving-esp-introducing-especter-bootkit/)\nbootloaders.\n\nMoonBounce, FinSpy and ESPecter are examples of APT malware comprising components that\ntarget both UEFI and Legacy BIOS boot processes.\n\nTo kickstart our investigation, we leveraged VirusTotal Intelligence and discovered an archive\nexhibiting the detections mentioned in the Kaspersky Lab’s MoonBounce report. Recently, a user\nuploaded the related samples, which surprised us greatly since we did not expect to find them that\nquickly by just querying using the detection name.\n\nFigure1 Figure2\n\nLet’s dive into the dark waters of the MoonBounce firmware implant. In this blog we want to\ndiscuss some of the facts which weren’t covered by the original report and are interesting to share.\n\nKaspersky Lab’s original report emphasizes that the aforementioned malware consists of a number\nof known malware components and frameworks: Microcin, Mimikat SSP, xTalker, etc.\n\nBinarly Research Team has analyzed the samples found in VirusTotal and discovered that the\nUEFI component (the first stage in the malware boot process) is quite old too. It was compiled with\nborrowed code from an unknown old malware project, most likely previously discovered in the wild\non some Dell systems back in 2018 (according to GitHub repository information) and reconstructed\n[in detail in the GitHub repository called “BootLoader”.](https://github.com/lslx/BootLoader)\n\nFigure3\n\nBinarly investigation focused on the firmware research of the UEFI component to provide\nadditional technical information to the already detailed original report on MoonBounce threat.\n\nOur deep dive uncovered similarities between the MoonBounce UEFI component and the binaries\navailable in the BootLoader GitHub repository. Diving into the BootLoader code, visually the\nhooking routine Search_OslArchTransferToKernel() piqued our interest, as it is almost identical\nwith the textual disassembly of the MoonBounce’s CORE_DXE firmware dump component:\n\nFigure4 Code from CORE_DXE of MoonBounce firmware dump\n\n[Figure5 Disassembled 32-bit code of BootLoader binary](https://github.com/lslx/BootLoader/blob/502c43312f2759329c3570920a9101f0368b5d74/BootLoader.Asm#L1056)\n\n\n-----\n\nDuring early runtime of the DXE phase, it is a known practice employed by malicious actors to\nmodify or hook DXE Services to intercept a boot flow inside the firmware. From a forensics\nperspective, such modifications are very visible and can be detected using common integrity\nfirmware monitoring approaches.\n\nFigure6 Disassembly code from CORE_DXE of MoonBounce firmware dump\n\n[This code from MoonBounce component is pretty similar with code flow from BootLoader.asm.](https://github.com/lslx/BootLoader/blob/master/BootLoader.Asm#L1116)\nThese observations lead to the conclusion that MoonBounce's authors are the same or use similar\ncode techniques or frameworks to embed their modification into the firmware and Windows kernel.\n\n_Additional details can be found in the original Kaspersky report “Technical details of MoonBounce’s_\n_implementation” (p. 6, “Code that set up a hook in the ExAllocatePool function within_\n_ntoskrnl.exe”)._\n\nAnother technical detail we'd like to highlight here relates to the multiple infection delivery paths.\nThe original report explains the usage of CoreCreateEventInternal() hook - as support for both\nUEFI boot and Legacy boot mode (assuming it’s targeting deprecated Compatibility Support\nModule (CSM)).\n\n_Compatibility Support Module (CSM) - this module emulates the legacy BIOS in UEFI systems and_\n_was developed by Intel to ease the transition to UEFI world. It's pretty common on hardware_\n_released before 2020. For newer enterprise hardware is usually disabled by default._\n\nThe reason for using CoreExitBootServices() is to hook a call from Windows loader (Winload) and\nprepare the next steps for the MoonBounce boot interception process. What is the point of hooking\n_InternalAllocatePool() at the beginning? The possible motivation for this could be to avoid storing_\nthe shellcode in a virtual address space along the Windows kernel, by placing it in a physical\nmemory and then executing it directly from there. Such a technique can be used for fileless in\nmemory code execution which would be orchestrated directly from the firmware. During incident\nresponse, this will cause complications from a forensic perspective.\n\nUpon further analysis, we found that CORE_DXE contains the target firmware name as a string\nconstant \"E7846IMS.M30\".\n\nFigure7\n\nTherefore, we became curious to determine the exact targeted platform. The first forensic artifact\nis the PE header timestamp for the CORE_DXE module (Fri Jul 18 03:29:55 2014).\n\nFigure8\n\n_PE Tree snapshot of the CORE_DXE module_\n\nOn the same day, Taiwanese company MSI released a firmware update for their hardware platform\nwhich is very similar to the firmware that has been infected by MoonBounce.\n\n_Searching on Google for the string constant \"E7846IMS.M30\", we found the following website:_\n\n\n-----\n\nFigure9\n_hxxps://www.mmnt[.]net/db/0/13/lupd01[.]eu[.]msi[.]com/ALL_BIOS_Update_Genie_update_20140831_\n\nAfter obtaining the original firmware image, we were curious about the similarity between the\noriginal CORE_DXE component and the modified one in MoonBounce. According to our code\nanalysis (binary diffing the MoonBounce UEFI component with the original firmware image from\nthe vendor), there were no other modifications besides hooks for InternalAllocatePool,\n_CoreExitBootServices and CoreCreateEventInternal services._\n\nFigure10 BinDiff analysis with the original CORE_DXE {5AE3F37E-4EAE-41AE-8240_35465B5E81EB} driver from E7846IMS.M30 firmware_\n\nUsing the Binarly Cloud Platform, we found a DXE Core driver which is very similar to the\nMoonBounce UEFI firmware dump component. The similarity was confirmed by matching control\nflow graphs through further analysis with Google BinDiff tool. The code similarity search reveals\nexactly three modified/hooked routines that we discussed earlier.\n\nThere are other interesting questions we need to discuss, such as potential methods of delivering\nmalware to the target system. How could such malware be written into SPI flash storage of the\ntargeted system? It is worth noticing that the analyzed MoonBounce UEFI component was built\n**for a target hardware related to a MSI system from 2014. This fact allows us to suggest two**\npossible initial points of compromise:\n\n**Physical access-based implant delivery to the target system - no Intel Boot Guard**\ntechnology present or enabled thus there are no physical or hardware restrictions to get\naccess to SPI flash storage of the system.\n**Software-based implant delivery to the target system - keeping in mind the historical**\nignorance of many vendors on firmware security threats, we infer that no SPI protections\nwere enabled on the system, hence SPI write-operations could be issued easily with no\nexploits required (access only to physical memory is required for working with PCH SPI\ncontroller MMIO).\n\nPublic information regarding firmware related implants is more present in the media lately, but it is\njust scratching the surface in terms of threat detection. Many security research papers have been\npublished which provide examples of more advanced techniques for threat actors to persist in\nfirmware. The supply chain complexity significantly increases the chances for the attackers to\neffectively reuse 1/N-day vulnerabilities (“The Firmware Supply-Chain Security is broken: Can we\nfix it?”.\n\n**We need to increase the industry awareness to firmware related threats and build more**\n**effective threat hunting programs with cross-industry collaboration between the vendors to**\n**mutually benefit customers and provide better detection rates.**\n\n[MoonBounce Firmware Implants](http://10.10.0.46/posts/MoonBounce) [Threat Intelligence Supply Chain Binarly Platform](http://10.10.0.46/posts/Threat%20Intelligence)\n\n[Back to overview](http://10.10.0.46/posts)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-21 - A deeper UEFI dive into MoonBounce.pdf"
    ],
    "report_names": [
        "2022-01-21 - A deeper UEFI dive into MoonBounce.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536226,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653780055,
    "ts_modification_date": 1653780055,
    "files": {
        "pdf": "https://archive.orkl.eu/0dc67b2b5b5b3101796557ff8f5fbf938dae606d.pdf",
        "text": "https://archive.orkl.eu/0dc67b2b5b5b3101796557ff8f5fbf938dae606d.txt",
        "img": "https://archive.orkl.eu/0dc67b2b5b5b3101796557ff8f5fbf938dae606d.jpg"
    }
}