{
    "id": "7d595845-e087-48b7-9c2d-e5f3fe5dbc40",
    "created_at": "2023-01-12T14:58:55.434088Z",
    "updated_at": "2025-03-27T02:09:29.580868Z",
    "deleted_at": null,
    "sha1_hash": "b7f4c9858673ea5c8bf8cce490841efe129edda4",
    "title": "2021-02-18 - Microsoft Internal Solorigate Investigation – Final Update",
    "authors": "",
    "file_creation_date": "2022-05-28T23:09:38Z",
    "file_modification_date": "2022-05-28T23:09:38Z",
    "file_size": 53840,
    "plain_text": "# Microsoft Internal Solorigate Investigation – Final Update\n\n**[msrc-blog.microsoft.com/2021/02/18/microsoft-internal-solorigate-investigation-final-update/](https://msrc-blog.microsoft.com/2021/02/18/microsoft-internal-solorigate-investigation-final-update/)**\n\nWe believe the Solorigate incident is an opportunity to work with the community, to share\ninformation, strengthen defenses and respond to attacks. We have now completed our\ninternal investigation into the activity of the actor and want to share our findings, which\nconfirm that we found no evidence of access to production services or customer data. The\ninvestigation also found no indications that our systems at Microsoft were used to attack\nothers. Because of our defense-in-depth protections, the actor was also not able to gain\naccess to privileged credentials or leverage the SAML techniques against our corporate\ndomains.\n\n## Additional Details\n\nAs we [previously reported, we detected unusual activity in December and took action to](https://msrc-blog.microsoft.com/2020/12/31/microsoft-internal-solorigate-investigation-update/)\nsecure our systems. Our analysis shows the first viewing of a file in a source repository was\nin late November and ended when we secured the affected accounts. We continued to see\nunsuccessful attempts at access by the actor into early January 2021, when the attempts\nstopped.\n\nThere was no case where all repositories related to any single product or service was\naccessed. There was no access to the vast majority of source code. For nearly all of code\nrepositories accessed, only a few individual files were viewed as a result of a repository\nsearch.\n\nFor a small number of repositories, there was additional access, including in some cases,\ndownloading component source code. These repositories contained code for:\n\na small subset of Azure components (subsets of service, security, identity)\na small subset of Intune components\na small subset of Exchange components\n\nThe search terms used by the actor indicate the expected focus on attempting to find\nsecrets. Our development policy prohibits secrets in code and we run automated tools to\nverify compliance. Because of the detected activity, we immediately initiated a verification\nprocess for current and historical branches of the repositories. We have confirmed that the\nrepositories complied and did not contain any live, production credentials.\n\n## Lessons Learned\n\n\n-----\n\nThe cybersecurity industry has long been aware that sophisticated and well-funded actors\nwere theoretically capable of advanced techniques, patience, and operating below the radar,\nbut this incident has proven that it isn’t just theoretical. For us, the attacks have reinforced\ntwo key learnings that we want to emphasize —embracing a Zero Trust mindset and\nprotecting privileged credentials.\n\nA Zero Trust, “assume breach” philosophy is a critical part of defense. Zero Trust is a\ntransition from implicit trust—assuming that everything inside a corporate network is safe—to\nthe model that assumes breach and explicitly verifies the security status of identity, endpoint,\nnetwork, and other resources based on all available signals and data. We’ve recently shared\nguidance for using Zero Trust principles to protect against sophisticated attacks like\nSolorigate.\n\nProtecting credentials is essential. In deployments that connect on-premises infrastructure to\nthe cloud, organizations can delegate trust to on-premises components. This creates an\nadditional seam that organizations need to secure. A consequence of this decision is that if\nthe on-premises environment is compromised, this creates opportunities for attackers to\ntarget cloud services. We strongly recommend mastering identity in the Cloud, as described\nin [protecting your M365 cloud services from on-premise attacks.](https://techcommunity.microsoft.com/t5/azure-active-directory-identity/protecting-microsoft-365-from-on-premises-attacks/ba-p/1751754)\n\nWe have also shared additional insights on these best practices in Turning the page on\nSolorigate and opening the next chapter for the security community. Though our internal\ninvestigation is closing, it does not mean we are done. It means we are maintaining our\nnormal Zero Trust security posture, where our security teams work continually to protect\nusers, devices and data from ongoing threats to our environment. Our collaborative work\nwith the cybersecurity community to protect from ongoing threats continues and, as we learn\nmore, we will share learnings and guidance as appropriate.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-18 - Microsoft Internal Solorigate Investigation – Final Update.pdf"
    ],
    "report_names": [
        "2021-02-18 - Microsoft Internal Solorigate Investigation – Final Update.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535535,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653779378,
    "ts_modification_date": 1653779378,
    "files": {
        "pdf": "https://archive.orkl.eu/b7f4c9858673ea5c8bf8cce490841efe129edda4.pdf",
        "text": "https://archive.orkl.eu/b7f4c9858673ea5c8bf8cce490841efe129edda4.txt",
        "img": "https://archive.orkl.eu/b7f4c9858673ea5c8bf8cce490841efe129edda4.jpg"
    }
}