{
    "id": "7d8276dd-82bf-4bf8-8434-6bd1b3d1c82f",
    "created_at": "2022-10-25T16:48:14.34033Z",
    "updated_at": "2025-03-27T02:17:00.801617Z",
    "deleted_at": null,
    "sha1_hash": "58a7dc800d633da1fad1756815d0e71ad120b60f",
    "title": "ACTINIUM targets Ukrainian organizations",
    "authors": "microsoft",
    "file_creation_date": "2022-02-21T17:05:14Z",
    "file_modification_date": "2022-02-21T17:05:14Z",
    "file_size": 787771,
    "plain_text": "# ACTINIUM targets Ukrainian organizations\n\n**[microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations](https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations/)**\n\nFebruary 4, 2022\n\nThe Microsoft Threat Intelligence Center (MSTIC) is sharing information on a threat group named ACTINIUM, which has\nbeen operational for almost a decade and has consistently pursued access to organizations in Ukraine or entities related to\nUkrainian affairs. MSTIC previously tracked ACTINIUM activity as DEV-0157, and this group is also referred to publicly as\nGamaredon.\n\nIn the last six months, MSTIC has observed ACTINIUM targeting organizations in Ukraine spanning government, military,\nnon-government organizations (NGO), judiciary, law enforcement, and non-profit, with the primary intent of exfiltrating\nsensitive information, maintaining access, and using acquired access to move laterally into related organizations. MSTIC has\nobserved ACTINIUM operating out of Crimea with objectives consistent with cyber espionage. The Ukrainian government\nhas [publicly attributed this group to the Russian Federal Security Service (FSB).](https://ssu.gov.ua/uploads/files/DKIB/Technical%20report%20Armagedon.pdf)\n\nSince October 2021, ACTINIUM has targeted or compromised accounts at organizations critical to emergency response and\nensuring the security of Ukrainian territory, as well as organizations that would be involved in coordinating the distribution\nof international and humanitarian aid to Ukraine in a crisis. As with any observed nation-state actor activity, Microsoft\ndirectly notifies customers of online services that have been targeted or compromised, providing them with the information\nthey need to secure their accounts. Microsoft has shared this information with Ukrainian authorities.\n\nACTINIUM represents a unique set of activities separate from the destructive malware attacks by DEV-0586 described in an\nearlier blog post. As of this writing, MSTIC has not found any indicators correlating these two actors or their operations. The\nobserved ACTINIUM activities detailed in this blog have been limited only to organizations within Ukraine. We have not seen\nthis actor using any unpatched vulnerabilities in Microsoft products or services.\n\nGiven the geopolitical situation and the scale of observed activity, MSTIC is prioritizing sharing our knowledge of ACTINIUM\ntactics, techniques, and procedures (TTPs), along with a significant number of indicators of compromise (IOCs) from our\nextensive analysis. Our goal is to give organizations the latest intelligence to guide investigations into potential attacks and\ninformation to implement proactive protections against future attempts.\n\n## Activity description\n\nMicrosoft has observed a repeated set of techniques and procedures throughout operations by ACTINIUM, with several\nsignificant elements that we believe are important to understanding these activities. It’s important to note that ACTINIUM’s\ntactics are constantly evolving; the activities described in this blog are some of the most consistent and notable observations\nby Microsoft, but these are not all-encompassing of actor TTPs.\n\n### Phishing using remote templates\n\nOne of the access vectors most used by ACTINIUM is spear-phishing emails with malicious macro attachments that employ\nremote templates. Remote template injection refers to the method of causing a document to load a remote document\ntemplate that contains the malicious code, in this case, macros. Delivery using remote template injection ensures that\nmalicious content is only loaded when required (for example, when the user opens the document). This helps attackers to\nevade static detections, for example, by systems that scan attachments for malicious content. Having the malicious macro\nhosted remotely also allows an attacker to control when and how the malicious component is delivered, further evading\ndetection by preventing automated systems from obtaining and analyzing the malicious component.\n\nMSTIC has observed a range of email phishing lures used by ACTINIUM, including those that impersonate and masquerade\nas legitimate organizations, using benign attachments to establish trust and familiarity with the target.\n\n\n-----\n\n_This phishing email from ACTINIUM uses the sender domain who-int[.]info to masquerade as the legitimate who.int_\n\n_domain, assessed to be impersonating the World Health Organization_\n\nWithin the body of phishing messages, ACTINIUM has been observed to insert web bugs, which are small external image\nreferences that enable the actor to track when a message has been opened and rendered. These web bugs are not malicious by\nthemselves but may indicate that the email is intended for malicious use. Here’s an example of a web bug used by\nACTINIUM:\n\nACTINIUM’s lure documents appear to be legitimate and vary in style and content. For example, the lure document below\nincluded a remote template at the following URL: hxxp://usa-national[.]info/USA/sensible[.]dot. While a domain was used\nin this instance, links with static IP addresses have also been used.\n\n\n-----\n\n_This URL and the related lure .dot document from ACTINIUM is responsible for loading the malicious remote template. This document_\n\n_uses text from a legitimate who.int situational COVID-19 update report published on July 27, 2021._\n\nACTINIUM phishing attachments contain a first-stage payload that downloads and executes further payloads. There may be\nmultiple subsequent “staging” scripts before a more fully-featured malicious capability is deployed to a compromised device.\nIt’s unclear why there are often multiple stages; one hypothesis is that these staging VBScripts are easier to modify to\nincorporate new obfuscation or command-and-control (C2) changes. It’s also possible that ACTINIUM deploys these scripts\nto provide some assurance that detection systems are less likely to detect their main capabilities. These initial staging\ncapabilities vary; examples include heavily obfuscated VBScripts, obfuscated PowerShell commands, self-extracting archives,\nLNK files, or a combination of these. ACTINIUM frequently relies on scheduled tasks in these scripts to maintain persistence.\nMore information on some of the capabilities analyzed by MSTIC is included in the “Malware and capabilities” section.\n\n### ACTINIUM operational infrastructure and wordlists\n\nMSTIC assesses that ACTINIUM maintains a large quantity and degree of variation of its operational infrastructure to evade\ndetection. ACTINIUM’s operational infrastructure consists of many domains and hosts to facilitate payload staging and C2.\nIn a single 30-day snapshot, MSTIC saw ACTINIUM utilizing over 25 new unique domains and over 80 unique IP addresses,\ndemonstrating that they frequently modify or alter their infrastructure.\n\nACTINIUM domain name DNS records frequently change, perhaps not frequently enough to be considered “fast-flux”, but\nmost DNS records for the domains change once a day on average. More than 70% of the recent 200+ ACTINIUM IP\naddresses are owned by ASN 197695 – REG.RU. Most ACTINIUM domains are also registered through the same owning\ncompany registrar (REG.RU). It is unclear why ACTINIUM appears to favor these legitimate providers.\n\nMalware authored by ACTINIUM often utilizes randomized subdomains for C2. These subdomains have included the use of\nan apparent English wordlist in their generation procedure, making the domains appear more legitimate while frustrating\nnetwork defense tools that may rely on domain name blocks. A list of the most common words MSTIC has observed is\n\n\n-----\n\nincluded in the IOCs below. Within the last 30 days, MSTIC has observed randomized schemes being used increasingly for\nsubdomain patterns instead of wordlists, indicating a possible shift in methodology. One example of this randomization is the\neffect of their PowerShell stager using the Get-Random cmdlet:’\n\nExamples of ACTINIUM subdomains encompassing both wordlists and randomized subdomains include:\n\nJealousy[.]Jonas[.]artisola[.]ru\nDeliberate[.]brontaga[.]ru\nregistration83[.]alteration[.]luck[.]mirotas[.]ru\n001912184[.]retarus[.]ru\n637753599292688334[.]jolotras[.]ru\n\nWhile the fast-flux nature of ACTINIUM infrastructure means that IP addresses are less useful IOCs, there is a clear\npreference for it on a specific ASN. Such preference may help defenders determine whether a domain may be more likely to\nbe owned by ACTINIUM. A list of more recent IP addresses is included in the IOCs below.\n\nACTINIUM appears to employ this same wordlist to obfuscate other aspects of their attacks. For example, as previously\nmentioned, ACTINIUM often maintains persistence by using scheduled tasks to run their malicious payloads. The payloads\nare often named with seemingly random words and phrases with valid (but irrelevant) extensions. The files are then executed\nusing scripts with the /E:VBScript flag to specify the VBScript engine (and to effectively ignore the random file extension\nassigned to the payload) and the /b flag to mute alerts and errors. The following is an example:\n\nThe terms deep-grounded, deerfield, and defiance above are used as the name of a scheduled task, a folder name, and a file\nname, respectively. Terms generated from the wordlist, like those in the example above, have been generated and used on\nmultiple targets and are also used to generate subdomains as previously described. These generated terms may frustrate\nnetwork defenders as the names of scheduled tasks, file names, and others are almost never the same for each target. We\nhave compiled a list of the terms that MSTIC has observed in the IOCs provided below. Network defenders may be able to use\nthe said list to determine whether a scheduled task, file, or domain is likely to warrant further investigation.\n\n### Maintaining persistence and gathering intelligence\n\nMSTIC assesses that the primary outcome of activities by ACTINIUM is persistent access to networks of perceived value for\nthe purpose of intelligence collection. Despite seemingly wide deployment of malicious capabilities in the region, follow-on\nactivities by the group occur in areas of discrete interest, indicating a possible review of targeting. Following initial access,\nMSTIC has observed ACTINIUM deploying tools such as “Pterodo” to gain interactive access to target networks. In some\ncases, MSTIC has observed deployments of UltraVNC to enable a more interactive connection to a target. UltraVNC is a\nlegitimate and fully-featured open-source remote desktop application that allows ACTINIUM to easily interact with a target\nhost without relying on custom, malicious binaries that may be detected and removed by security products.\n\n### Malware and capabilities\n\nACTINIUM employs a variety of malware families with assessed objectives to deploy remotely retrieved or embedded\npayloads before execution. MSTIC has analyzed several of these payloads and tracks the rapidly developing binaries as the\nfollowing families: DinoTrain, DesertDown, DilongTrash, ObfuBerry, ObfuMerry, and PowerPunch. The PowerPunch\nmalware family is an excellent example of an agile and evolving sequence of malicious code and is further explained below.\n\nThe actor quickly develops new obfuscated and lightweight capabilities to deploy more advanced malware later. These are\nfast-moving targets with a high degree of variance. Analyzed payloads regularly place a strong emphasis on obfuscated\nVBScripts. As an attack, this is not a novel approach, yet it continues to prove successful as antivirus solutions must\nconsistently adapt to keep pace with a very agile threat.\n\n\n-----\n\nThe most feature rich malware family we track relating to ACTINIUM activity is known widely within the industry as\n“Pterodo”. In the following sections, we break down Pterodo further and review a binary called QuietSieve that is specifically\ngeared toward file exfiltration and monitoring.\n\n**PowerPunch**\n\nThe droppers and downloader family names tend to be fast-moving targets due to the heavy use of obfuscation and simple\nfunctionality. For example, PowerPunch is executed from within PowerShell as a one-line command, encoded using Base64:\n\nThese binaries also exhibit features that rely on data from the compromised host to inform encryption of the next stage.\nPowerPunch also provides an excellent example of this. In the following code snippet, the VolumeSerialNumber of the host\nserves as the basis for a multibyte XOR key. The key is applied to an executable payload downloaded directly from adversary\ninfrastructure, allowing for an encryption key unique to the target host (highlighted variables names were changed for\nclarity).\n\nUltimately, a next-stage executable is remotely retrieved and dropped to disk prior to execution.\n\n**Pterodo**\n\nMSTIC has also reviewed several variants of ACTINIUM’s more fully-featured Pterodo malware. A couple of features play a\ndirect role in this malware’s ability to evade detection and thwart analysis: its use of a dynamic Windows function hashing\nalgorithm to map necessary API components, and an “on-demand” scheme for decrypting needed data and freeing allocated\nheap space when used.\n\nThe function hashing algorithm is used to map a hash value of a given function name to its corresponding location in memory\n[using a process known as Run-Time Dynamic Linking. Pre-computed hashes are passed to the hashing algorithm alongside](https://docs.microsoft.com/en-us/windows/win32/dlls/run-time-dynamic-linking)\nthe Windows library containing the related function name. Each function name within the library is hashed; when a match is\nfound, its address is saved.\n\n\n-----\n\nThe hashing algorithm itself has historically not been terribly complex, and when considering an example such as SHA-256\n51b9e03db53b2d583f66e47af56bb0146630f8a175d4a439369045038d6d2a45, it may be emulated using Python logic as\nfollows:\n\nWhen pre-computing these hashes over different Windows DLLs commonly used in schemes like this, it is possible to map\n[out these hash values and the corresponding Windows function name using open-source tools like the MITRE malchive.](https://github.com/MITRECND/malchive)\n\nWe have seen this behavior in many different malware families before. The hashing algorithm has been consistent within\nthose families, allowing analysis like this to scale forward. Unfortunately, in Pterodo’s case, there is far too much drift in the\nalgorithm for it to be used reliably. The algorithm has been different in many of the samples we’ve reviewed. Additionally, the\napplication of this technique seems to vary among samples. Some samples have been observed to use it for most Windows\nfunction calls, while others have used it very sparingly.\n\nHowever, Windows libraries need to be loaded before function hashes are computed. The names of these libraries and other\nstrings required by the malware are recovered using an “on-demand” scheme that decrypts the data, uses it, and immediately\nfrees the associated heap space once it is no longer needed.\n\n\n-----\n\nAs seen in the screenshot above, data is passed into a decryption function before being used in a call to GetModuleHandleA.\nBefore the hashing routine uses the module handle, the decrypted string representing the function name has its associated\nheap space freed and may be later overwritten. However, the reconstruction of this data is straightforward within the two\ncore decryption algorithms we have observed. The first one relies on an encrypted blob whose first value is interpreted as the\nsize of the decrypted data in DWORD (four-byte) chunks.\n\nThis data is decrypted four bytes at a time, with the last byte being the encrypted content. Each encrypted byte is XOR’d\nusing a multibyte key sequence unique to each sample reviewed. In our example, the ASCII key sequence 39d84sdfjh is\napplied to the content above to produce the module name Kernel32.\n\nA slight deviation from this approach was also uncovered in samples such as SHA-256\n2042a2feb4d9f54d65d7579a0afba9ee1c6d22e29127991fbf34ea3da1659904, where the decryption algorithm is passed data\nrepresenting two WORD values: one mapping to the offset of the encrypted content within the malware and another\nrepresenting the length. These parameters are recovered, and a much longer multibyte XOR sequence is applied to the\nencrypted content after the starting index is computed.\n\nApplication of either approach allows us to gain a greater level of analysis into strings used by the malware. Continuing with\nthe approach used by the previously cited example, we can apply the multibyte XOR key over the entire encrypted data space,\nresulting in the following content:\n\n\n-----\n\n-----\n\nPterodo has been observed to be a constantly evolving malware family with a range of capabilities intended to make analysis\nmore difficult. By applying our understanding, we can expose more malware elements to further advance mitigation and\ndetection efforts.\n\n**QuietSieve**\n\nThe QuietSieve malware family refers to a series of heavily-obfuscated .NET binaries specifically designed to steal\ninformation from the target host. Before enumerating target files on the host, QuietSieve first checks for connectivity by\nsending a test ping to 8.8.8.8 (Google public DNS). The creation of the buffer for the ICMP request is done manually within\nQuietSieve and contains all null values for the 32-byte data portion of the ICMP packet. If this check succeeds, a randomlygenerated alphanumeric prefix is created and combined with the callback domain as a subdomain before an initial request is\nmade over HTTPS.\n\nIf the connection is successful, the following file name extensions are searched for within removable, fixed, or networked\ndrives: doc, docx, xls, rtf, odt, txt, jpg, pdf, rar, zip, and 7z. Candidate files are queued up for upload. They are also\ninventoried via a specific MD5 hash value computed based on attributes of the target file and compromised host, such as the\nvolume serial number, file size, and last write timestamp assigned to the file. Computed hashes are logged to an inventory log\nfile that serves as a reference point checked by the malware to avoid duplicate exfiltration. QuietSieve will also take\nscreenshots of the compromised host approximately every five minutes and save them in the user’s local Application Data\nfolder under Temp\\SymbolSourceSymbols\\icons or Temp\\ModeAuto\\icons using the format yyyy-MM-dd-HH-mm along\nwith the jpg file extension.\n\nWhile the QuietSieve malware family is primarily geared towards the exfiltration of data from the compromised host, it can\nalso receive and execute a remote payload from the operator. These payloads are written to the user’s Application Data folder\nwith a random alphanumeric name and are executed in a hidden window.\n\nMicrosoft will continue to monitor ACTINIUM activity and implement protections for our customers.\n\n## Indicators of compromise (IOCs)\n\nThe following IOCs were observed during our investigation. We encourage our customers to investigate these indicators in\ntheir environments and implement detections and protections to identify past related activity and prevent future attacks\nagainst their systems.\n\n_Analyst note on ACTINIUM IOCs: ACTINIUM registers and administers a large amount of infrastructure. It’s not always_\npossible to accurately determine what malicious component connects to which C2 infrastructure. MSTIC has observed cases\nwhere the same C2 is used for different components (for example, corolain[.]ru).\n\n### Example malware samples and associated infrastructure\n\n**QuietSieve**\n\n\n-----\n\n**Indicator** **Type** **Comments**\n\n\nJolotras[.]ru Domain\nname\n\nMoolin[.]ru Domain\nname\n\n[0afce2247ffb53783259b7dc5a0afe04d918767c991db2da906277898fd80be5](https://www.virustotal.com/gui/file/0afce2247ffb53783259b7dc5a0afe04d918767c991db2da906277898fd80be5) SHA256\n\n[e4d309735f5326a193844772fc65b186fd673436efab7c6fed9eb7e3d01b6f19](https://www.virustotal.com/gui/file/e4d309735f5326a193844772fc65b186fd673436efab7c6fed9eb7e3d01b6f19) SHA256\n\n[f211e0eb49990edbb5de2bcf2f573ea6a0b6f3549e772fd16bf7cc214d924824](https://www.virustotal.com/gui/file/f211e0eb49990edbb5de2bcf2f573ea6a0b6f3549e772fd16bf7cc214d924824) SHA256\n\n[6d4b97e74abf499fa983b73a1e6957eadb2ec6a83e206fff1ab863448e4262c6](https://www.virustotal.com/gui/file/6d4b97e74abf499fa983b73a1e6957eadb2ec6a83e206fff1ab863448e4262c6) SHA256\n\n[eb1724d14397de8f9dca4720dada0195ebb99d72427703cabcb47b174a3bfea2](https://www.virustotal.com/gui/file/eb1724d14397de8f9dca4720dada0195ebb99d72427703cabcb47b174a3bfea2) SHA256\n\n[e4d309735f5326a193844772fc65b186fd673436efab7c6fed9eb7e3d01b6f19](https://www.virustotal.com/gui/file/e4d309735f5326a193844772fc65b186fd673436efab7c6fed9eb7e3d01b6f19) SHA256\n\n[b92dcbacbaaf0a05c805d31762cd4e45c912ba940c57b982939d79731cf97217](https://www.virustotal.com/gui/file/b92dcbacbaaf0a05c805d31762cd4e45c912ba940c57b982939d79731cf97217) SHA256\n\n[b3d68268bd4bb14b6d412cef2b12ae4f2a385c36600676c1a9988cf1e9256877](https://www.virustotal.com/gui/file/b3d68268bd4bb14b6d412cef2b12ae4f2a385c36600676c1a9988cf1e9256877) SHA256\n\n[a6867e9086a8f713a962238204a3266185de2cc3c662fba8d79f0e9b22ce8dd6](https://www.virustotal.com/gui/file/a6867e9086a8f713a962238204a3266185de2cc3c662fba8d79f0e9b22ce8dd6) SHA256\n\n[a01e12988448a5b26d1d1adecc2dda539b5842f6a7044f8803a52c8bb714cdb0](https://www.virustotal.com/gui/file/a01e12988448a5b26d1d1adecc2dda539b5842f6a7044f8803a52c8bb714cdb0) SHA256\n\n[8a8c1a292eeb404407a9fe90430663a6d17767e49d52107b60bc229c090a0ae9](https://www.virustotal.com/gui/file/8a8c1a292eeb404407a9fe90430663a6d17767e49d52107b60bc229c090a0ae9) SHA256\n\n[15099fc6aea1961164954033b397d773ebf4b3ef7a5567feb064329be6236a01](https://www.virustotal.com/gui/file/15099fc6aea1961164954033b397d773ebf4b3ef7a5567feb064329be6236a01) SHA256\n\n[137bfe2977b719d92b87699d93c0f140d659e990b482bbc5301085003c2bd58c](https://www.virustotal.com/gui/file/137bfe2977b719d92b87699d93c0f140d659e990b482bbc5301085003c2bd58c) SHA256\n\n[0e5b4e578788760701630a810d1920d510015367bf90c1eab4373d0c48a921d9](https://www.virustotal.com/gui/file/0e5b4e578788760701630a810d1920d510015367bf90c1eab4373d0c48a921d9) SHA256\n\n[0afce2247ffb53783259b7dc5a0afe04d918767c991db2da906277898fd80be5](https://www.virustotal.com/gui/file/0afce2247ffb53783259b7dc5a0afe04d918767c991db2da906277898fd80be5) SHA256\n\n**Pterodo**\n\n\nQuietSieve, associated with\nmultiple malware samples\n\nQuietSieve, associated with\nmultiple malware samples\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith jolotras[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith jolotras[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\nQuietSieve, communicates\nwith moolin[.]ru domain(s)\n\n\n-----\n\n**Indicator** **Type** **Comments**\n\n\ngorigan[.]ru Domain\nname\n\nteroba[.]ru Domain\nname\n\nkrashand[.]ru Domain\nname\n\n[51b9e03db53b2d583f66e47af56bb0146630f8a175d4a439369045038d6d2a45](https://www.virustotal.com/gui/file/51b9e03db53b2d583f66e47af56bb0146630f8a175d4a439369045038d6d2a45) SHA256\n\n[2042a2feb4d9f54d65d7579a0afba9ee1c6d22e29127991fbf34ea3da1659904](https://www.virustotal.com/gui/file/2042a2feb4d9f54d65d7579a0afba9ee1c6d22e29127991fbf34ea3da1659904) SHA256\n\n[425ee82f20eb87e07a0d4f77adb72bf3377051365be203ee6ded37b399094f20](https://www.virustotal.com/gui/file/425ee82f20eb87e07a0d4f77adb72bf3377051365be203ee6ded37b399094f20) SHA256\n\n[fe068e324cd4175f857dfee4c23512ed01f3abbf8b6138b715caa1ba5e9486c0](https://www.virustotal.com/gui/file/fe068e324cd4175f857dfee4c23512ed01f3abbf8b6138b715caa1ba5e9486c0) SHA256\n\n[798cd714cf9e352c1e9de3d48971a366b09eeffb3513950fd64737d882c25a38](https://www.virustotal.com/gui/file/798cd714cf9e352c1e9de3d48971a366b09eeffb3513950fd64737d882c25a38) SHA256\n\n[ef9b39705decbb85269518705053e7f4087758eea6bab4ba9135bf1ae922b2ea](https://www.virustotal.com/gui/file/ef9b39705decbb85269518705053e7f4087758eea6bab4ba9135bf1ae922b2ea) SHA256\n\n[a87e9d5e03db793a0c7b8e8e197d14745265422f05e6e50867cdfbd150d0c016](https://www.virustotal.com/gui/file/a87e9d5e03db793a0c7b8e8e197d14745265422f05e6e50867cdfbd150d0c016) SHA256\n\n[2042a2feb4d9f54d65d7579a0afba9ee1c6d22e29127991fbf34ea3da1659904](https://www.virustotal.com/gui/file/2042a2feb4d9f54d65d7579a0afba9ee1c6d22e29127991fbf34ea3da1659904) SHA256\n\n[c68eb2fa929373cac727764d2cc5ca94f19a0ec7fd8c0876b98f946e72d9fa03](https://www.virustotal.com/gui/file/c68eb2fa929373cac727764d2cc5ca94f19a0ec7fd8c0876b98f946e72d9fa03) SHA256\n\n[3b6445cf6f8e9e70cb0fff35d723fec8203375d67cbd67c9a672cddc02a7ff99](https://www.virustotal.com/gui/file/3b6445cf6f8e9e70cb0fff35d723fec8203375d67cbd67c9a672cddc02a7ff99) SHA256\n\n[bae9895ad4e392990a09b1b8a01e424a7ad3769e538ac693919d1b99989f0cb3](https://www.virustotal.com/gui/file/bae9895ad4e392990a09b1b8a01e424a7ad3769e538ac693919d1b99989f0cb3) SHA256\n\n[c6e092316f61d2fc9c84299dd224a6e419e74c98c51a44023f8f72530ac28fdc](https://www.virustotal.com/gui/file/c6e092316f61d2fc9c84299dd224a6e419e74c98c51a44023f8f72530ac28fdc) SHA256\n\n[cb0d151d930b17f6376c18aa15fd976eac53d6f07d065fc27c40b466e3bc49aa](https://www.virustotal.com/gui/file/cb0d151d930b17f6376c18aa15fd976eac53d6f07d065fc27c40b466e3bc49aa) SHA256\n\n[8ed03b1d544444b42385e79cd17c796fefae71d140b146d0757a3960d8ba3cba](https://www.virustotal.com/gui/file/8ed03b1d544444b42385e79cd17c796fefae71d140b146d0757a3960d8ba3cba) SHA256\n\n**Various stagers and downloaders**\n\n(DinoTrain, DilongTrash, Obfuberry, PowerPunch, DessertDown, and Obfumerry)\n\n\nPterodo\n\nPterodo\n\nPterodo, associated with\nmultiple malware samples\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\ngorigan[.]ru domain(s)\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\nkrashand[.]ru domain(s)\n\nPterodo, communicates with\ngorigan[.]ru domain(s)\n\nPterodo, communicates with\ngorigan[.]ru domain(s)\n\nPterodo\n\nPterodo, communicates with\nteroba[.]ru domain(s)\n\nPterodo, communicates with\nteroba[.]ru domain(s)\n\nPterodo\n\nPterodo, communicates with\nteroba[.]ru domain(s)\n\n\n-----\n\n**Indicator** **Type** **Comments**\n\n\n%windir%\\System32\\schtasks.exe” /CREATE /sc minute /mo 12 /tn\n“deepness” /tr “wscript.exe “%PUBLIC%\\Pictures\\deepness.fly” //e:VBScript\n//b” /F\n\n\nCommand\nline\n\n\nDessertDown artifact (note\ngenerated word used –\n_deepness, this will vary)_\n\nDinoTrain artifact (note\ngenerated words used –\n\n_[username] and continue, these_\nwill vary)\n\nPowerPunch\n\nPowerPunch\n\nDessertDown\n\nDessertDown and possibly\nother ACTINIUM capabilities\n\nUsed for PowerShell cmdlets\n\nUsed for PowerShell cmdlets\n\nDinoTrain\n\n\nwscript.exe C:\\Users\\[username]\\continue.wav //e:VBScript //b Command\nline\n\nalacritas[.]ru Domain\nname\n\nlibellus[.]ru Domain\nname\n\nbrontaga[.]ru Domain\nname\n\ngortomalo[.]ru Domain\nname\n\ncorolain[.]ru Domain\nname\n\ngoloser[.]ru Domain\nname\n\ndelicacy[.]delicate[.]maizuko[.]ru Domain\nname\n\n\n[0f9d723c3023a6af3e5522f63f649c7d6a8cb2727ec092e0b38ee76cd1bbf1c4](https://www.virustotal.com/gui/file/0f9d723c3023a6af3e5522f63f649c7d6a8cb2727ec092e0b38ee76cd1bbf1c4) SHA-256 DessertDown, communicates\nwith brontaga[.]ru domain(s)\n\n[bf90d5db47e6ba3a1840976b6bb88a8d0dfe97dfe02c9ca31b7be4018816d232](https://www.virustotal.com/gui/file/bf90d5db47e6ba3a1840976b6bb88a8d0dfe97dfe02c9ca31b7be4018816d232) SHA-256 DessertDown, communicates\nwith gloritapa[.]ru and\ngortomalo[.]ru domains\n\n[b9b41fbbd646f11d148cface520a5d4e0ec502ba85c67b00668e239082a302e3](https://www.virustotal.com/gui/file/b9b41fbbd646f11d148cface520a5d4e0ec502ba85c67b00668e239082a302e3) SHA-256 DinoTrain, communicates with\ndelicacy[.]delicate[.]maizuko[.]ru\n\n[c05f4c5a6bb940e94782e07cf276fc103a6acca365ba28e7b4db09b5bbc01e58](https://www.virustotal.com/gui/file/c05f4c5a6bb940e94782e07cf276fc103a6acca365ba28e7b4db09b5bbc01e58) SHA-256 DilongTrash, communicates\nwith privigna[.]ru\n\n[3cbe7d544ef4c8ff8e5c1e101dbdf5316d0cfbe32658d8b9209f922309162bcf](https://www.virustotal.com/gui/file/3cbe7d544ef4c8ff8e5c1e101dbdf5316d0cfbe32658d8b9209f922309162bcf) SHA-256 ObfuBerry\n\n[3bab73a7ba6b84d9c070bb7f71daab5b40fcb6ee0387b67be51e978a47c25439](https://www.virustotal.com/gui/file/3bab73a7ba6b84d9c070bb7f71daab5b40fcb6ee0387b67be51e978a47c25439) SHA-256 ObfuMerry\n\n### ACTINIUM-owned infrastructure\n\n**Domains**\n\nThe following list represents the most recent domains used by ACTINIUM as of this writing. Many of ACTINIUM’s\ncapabilities communicate with generated subdomains following the patterns discussed earlier. A list of commonly observed\nwords in these generated names is available in the next section, although it should be noted that this list is not exhaustive.\n\n\n-----\n\nacetica[.]online lenatara[.]ru oyoida[.]ru riontos[.]ru nerabis[.]ru\n\nadeltorr[.]ru ouichi[.]ru dushnilo[.]ru hostarama[.]ru jokolor[.]ru\n\narianat[.]ru cryptonas[.]ru akowaika[.]ru artisola[.]ru nokratis[.]ru\n\nbartion[.]ru konoatari[.]ru torogat[.]ru boltorg[.]ru machiwo[.]ru\n\nbibliota[.]ru moonilar[.]ru inosokof[.]ru draagotan[.]ru kolotran[.]ru\n\nbilorotka[.]ru reapart[.]ru holotran[.]ru golofir[.]ru volotras[.]ru\n\ndokkade[.]ru nomukou[.]ru huskari[.]ru goloser[.]ru milopoda[.]ru\n\ngoshita[.]ru mirotas[.]ru utemomac[.]ru gortomalo[.]ru zerotask[.]ru\n\nhajimari[.]ru ismetroh[.]ru hortoban[.]ru gloritapa[.]ru vasitron[.]ru\n\nlibellus[.]ru vositra[.]ru hopfar[.]ru bobotal[.]ru nopaster[.]ru\n\nmeshatr[.]ru fartopart[.]ru koprotas[.]ru historap[.]ru dangeti[.]ru\n\nnakushita[.]ru atasareru[.]ru golorta[.]ru jabilen[.]ru haguret[.]ru\n\nnaletovo[.]ru uzumoreru[.]ru screato[.]ru herumot[.]ru klotrast[.]ru\n\nnattanda[.]ru sumikko[.]ru bellinor[.]ru saturapa[.]ru sundabokun[.]ru\n\nnokitrav[.]ru vivaldar[.]ru nokata[.]ru fortfar[.]ru rawaumi[.]ru\n\nnonima[.]ru ikaraur[.]ru nemoiti[.]ru dudocilo[.]ru wokoras[.]ru\n\nonihik[.]ru ruhodo[.]ru mudarist[.]ru gongorat[.]ru yazibo[.]ru\n\npertolka[.]ru asdorta[.]ru holorta[.]ru gortisir[.]ru jupirest[.]ru\n\nruchkalo[.]ru kolorato[.]ru kucart[.]ru filorta[.]ru vostilo[.]ru\n\nshitemo[.]ru warau[.]ru koltorist[.]ru gortova[.]ru lotorgas[.]ru\n\nsorawo[.]ru kimiga[.]ru hokoldar[.]ru amaniwa[.]ru masshir[.]ru\n\ntelefar[.]ru kippuno[.]ru midiatr[.]ru nastorlam[.]ru martusi[.]ru\n\nurovista[.]ru kroviti[.]ru bibikaro[.]ru hilotrapa[.]ru kovalsko[.]ru\n\nvadilops[.]ru hibigaru[.]ru gribata[.]ru alebont[.]ru nukegaran[.]ru\n\nzvustro[.]ru lotorda[.]ru vnestri[.]ru dortisto[.]ru\n\n**Wordlist of observed terms**\n\nACTINIUM likely generates strings for use in various components from a wordlist. A sample of terms observed in use by\nACTINIUM can be found below. ACTINIUM has been observed to use these terms for:\n\nSubdomains for their C2 infrastructure\nScheduled task names\nFolder names\nMalware file names\n\nACTINIUM also likely generates strings for other uses where they attempt to disguise their activities.\n\n\n-----\n\nabrupt allegiance allen alley allied allocation\n\nallow allowance allowing allows alloy alluded\n\nally almond almost alongside alphabet already\n\nalter alteration although always am amazing\n\namber ambitious amends amid among beverley\n\nbeware beyond bicycle big bigger bike\n\nbikes bill billion claimed clank clap\n\nclash clasped classes classroom cough could\n\ncouncilman countenance counteract countries country courage\n\ncourageous cronos debts deceive deceived decent\n\ndeception decide decided decidedly decision decisive\n\ndeck declaration declare declared decline declined\n\ndecoy decrease decree decrepit dedicate deduction\n\ndeed deep deeper deep-going deep-green deep-groaning\n\ndeep-grounded deep-grown deephaven deepish deep-kiss deep-laden\n\ndeep-laid deeplier deep-lunged deeply deep-lying deepmouthed\n\ndeep-musing deep-naked deepnesses deep-persuading deep-piled deep-pointed\n\ndeep-pondering deep-premeditated deep-read deep-revolving deep-rooted deep-rooting\n\ndeep-sea deep-searching deep-seated deep-seatedness deep-set deep-settled\n\ndeep-sighted deep-sinking deep-skirted deepsome deep-sore deep-stapled\n\ndeep-sunken deep-sweet deep-tangled deep-throated deep-toned deep-transported\n\ndeep-troubled deep-vaulted deep-versed deep-voiced deep-water deepwaterman\n\ndeepwatermen deep-worn deep-wounded deer deerberry deerbrook\n\ndeerdog deerdre deere deerflies deerflys deerfood\n\ndeerhorn deering deerlet deer-mouse deers deerstalker\n\ndeery deeryards default defeated defect defective\n\ndefence defend defense defensive defiance defiant\n\ndeficiency defined definite definitely defy degrade\n\ndegree deity dejected delay delayed delete\n\ndeliberate deliberately delicious delight delighted delightful\n\ndelirium deliverance delivered delivery deluge delve\n\ndemand demanded demolition demonstrate demonstration den\n\ndene denial denied denote dense dentist\n\ndeny depart departed department departments departure\n\ndepended dependent deplore deploy deployment depression\n\n\n-----\n\ndepth depths deputy derisive derived des\n\ndescendant descended descent describe description desert\n\ndeserter deserts deserve deserves design designed\n\ndesigner designs desire desolate despair desperate\n\ndesperately despise despite dessert destitute destroyed\n\ndestroyer detach detached detail endanger ending\n\nendless endlessly endure enemies energy enforce\n\nfaithless fake falcon fame familiar family\n\nfamous fan fancied gleaming glide glimpse\n\ngloom gloomy glory glossy gloves glow\n\nglue gnaw goat goes integer integral\n\nintelligence intelligent intend descendant descended descent\n\ndescribe description desert interested interesting interference\n\nisland isolation issue issued its itself\n\njack jackal jacket jackson jake jam\n\njames jan january jar jaw jaws\n\njazz jealous jealousy jean jeanne jeans\n\njeer jeff jelly jerk jersey jerusalem\n\njessamy jessie jest jet jew jewel\n\njeweller jewellery jewels jill joan job\n\njobs joe join joining joint joke\n\njoking jolly jonas joseph josephine josie\n\njoy joyful joyfully judge judgment jug\n\njuice juicy july jumble jumped jumper\n\njune jungle junior junk just justly\n\njuvenile lover low lower loyalty luck\n\nlucy luggage luke lumber lump lunch\n\nluncheon lustre luxurious luxury mankind manners\n\nmansion margaret margarita margin marriage marvellous\n\nmasquerade naturally nature naughty navigation navy\n\nnay near neat necessarily necklace ned\n\nneedle needlework neglect parlor parlour parrots\n\nparsley participate parties parting penknife per\n\nperceive percent percy perfect perform performed\n\nperfume pleasantly pressure presume pretence pretend\n\n\n-----\n\npretty prevail prevailed prevhost prey price\n\npriest primary prince princess printing pumpkin\n\npunctual punish punishment pupil purchase purchaser\n\npure purge purpose purse pursuing references\n\nreflected regions registered registration registry regret\n\nregular regularly regulate reject relations relative\n\nrelax release reliable salary sale salmon\n\nsalt salts salvation same sand scarce\n\nscarcely scared scarf scarlet scattered scene\n\nscenery scenes scent scheme scholars schoolboy\n\nscience scold scope scorn scornful scoundrel\n\nscout scowled shoe shone shooting sorting\n\nsought sound sounding soup sour source\n\nstool stoop stooped stop stopped stopper\n\nstorm stout strawberries stream strengthen stretched\n\nstrict striking string strings striped stripes\n\nstroke stroll\n\nNOTE: These indicators should not be considered exhaustive for this observed activity.\n\n## Detections\n\n### Microsoft 365 Defender\n\n**Microsoft Defender Antivirus**\n\n**Microsoft Defender for Endpoint**\n\nAlerts with the following titles in the security center can indicate threat activity on your network:\n\nACTINIUM activity group\n\nThe following alerts might also indicate threat activity associated with this threat. These alerts, however, may be triggered by\nunrelated threat activity. We’re listing them here because we recommend that these alerts be investigated and remediated\nimmediately given the severity of the attacks.\n\nSuspicious obfuscation or deobfuscation activity\nSuspicious script execution\nA script with suspicious content was observed\nPowerShell dropped a suspicious file on the machine\nAnomalous process executing encoded command\nSuspicious dynamic link library loaded\nAn anomalous scheduled task was created\nAn uncommon file was created and added to a Run Key\nSuspicious screen capture activity\nStaging of sensitive data\nSuspicious process transferring data to external network\n\n\n-----\n\n**Microsoft Defender for Office 365**\n\n[Microsoft Defender for Office 365 customers can use the email entity page to search for and visualize the potential impact of](https://docs.microsoft.com/en-us/microsoft-365/security/office-365-security/mdo-email-entity-page)\nthese attacks to your organization.\n\nThe following email security alerts may indicate threat activity associated with this threat. These alerts, however, may be\ntriggered by unrelated threat activity. We’re listing them here because we recommend that these alerts be investigated and\nremediated immediately given the severity of the attacks.\n\nEmail messages containing malicious file removed after delivery\nEmail messages containing malware removed after delivery\nEmail messages removed after delivery\nEmail reported by user as malware or phish\nMalware campaign detected after delivery\nMalware campaign detected and blocked\nMalware not zapped because ZAP is disabled\n\n## Advanced hunting queries\n\n### Microsoft Sentinel\n\nTo locate possible ACTINIUM activity mentioned in this blog post, Microsoft Sentinel customers can use the queries detailed\nbelow:\n\n**Identify ACTINIUM IOCs**\n\nThis query identifies a match across various data feeds for IOCs related to ACTINIUM:\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/ActiniumFeb2022.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/ActiniumFeb2022.yaml)\n\n**Identify antivirus detection of ACTINIUM activity**\n\nThis query identifies a match in the Security Alert table for Microsoft Defender Antivirus detections related to the ACTINIUM\nactor:\n\n[https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityAlert/ActiniumAVHits.yaml](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/SecurityAlert/ActiniumAVHits.yaml)\n\n\n-----\n\n### Microsoft 365 Defender\n\nTo locate related activity, Microsoft 365 Defender customers can run the following advanced hunting queries:\n\n**Find ACTINIUM-related emails**\n\nUse this query to look for look for emails that may have been received in your environment related to ACTINIUM.\n```\nEmailEvents\n| where SenderMailFromDomain =~ 'who-int.info'\n  or SenderFromDomain =~ 'who-int.info'\n\n```\n**Surface ACTINIUM-related alerts**\n\nUse this query to look for alerts related to ACTINIUM alerts.\n```\nAlertInfo\n| where Title in~('ACTINIUM activity group')\n\n```\n**Surface devices with ACTINIUM related alerts and gather additional device alert information**\n\nUse this query to look for threat activity associated with ACTINIUM alerts.\n```\n// Get any devices with ACTINIUM related Alert Activity\nlet DevicesACTINIUMAlerts = AlertInfo\n| where Title in~('ACTINIUM activity group')\n// Join in evidence information\n| join AlertEvidence on AlertId\n| where DeviceId != \"\"\n| summarize by DeviceId, Title;\n// Get additional alert activity for each device\nAlertEvidence\n| where DeviceId in(DevicesACTINIUMAlerts)\n// Add additional info\n| join kind=leftouter AlertInfo on AlertId\n| summarize DeviceAlerts = make_set(Title), AlertIDs = make_set(AlertId) by DeviceId, bin(Timestamp, 1d)\n\n```\n**Surface suspicious MSHTA process execution**\n\nUse this query to look for MSHTA launching with command lines referencing DLLs in the AppData\\Roaming path.\n```\nDeviceProcessEvents\n| where FileName =~ \"mshta.exe\"\n| where ProcessCommandLine has_all (\".dll\", \"Roaming\") \n| where ProcessCommandLine contains @\"Roaming\\j\"\n| extend DLLName = extract(@\"[jJ][a-z]{1,12}\\.dll\", 0, ProcessCommandLine)\n\n```\n**Surface suspicious Scheduled Task activity**\n\nUse this query to look for Scheduled Tasks that may relate to ACTINIUM activity.\n```\nDeviceProcessEvents\n| where ProcessCommandLine has_all (\"schtasks.exe\", \"create\", \"wscript\", \"e:vbscript\", \".wav\")\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/0qxv3fc5yx2j8lbv1ftlvmaakuy0nrsk"
    ],
    "report_names": [
        "Microsoft_ACTINIUM-Ukrainian-organizations(02-04-2022)"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "025b7171-98f8-4391-adc2-66333629c715",
            "created_at": "2023-06-23T02:04:34.120175Z",
            "updated_at": "2025-03-27T02:02:09.797581Z",
            "deleted_at": null,
            "main_name": "Cadet Blizzard",
            "aliases": [
                "DEV-0586",
                "Operation Bleeding Bear",
                "Ruinous Ursa"
            ],
            "source_name": "ETDA:Cadet Blizzard",
            "tools": [
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "P0wnyshell",
                "PAYWIPE",
                "Ponyshell",
                "Pownyshell",
                "WhisperGate",
                "WhisperKill",
                "netcat",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bdbf873a-048d-4c5d-9d92-922327cc83a8",
            "created_at": "2023-01-06T13:46:39.387696Z",
            "updated_at": "2025-03-27T02:00:03.071819Z",
            "deleted_at": null,
            "main_name": "DEV-0586",
            "aliases": [
                "Ruinous Ursa",
                "Cadet Blizzard"
            ],
            "source_name": "MISPGALAXY:DEV-0586",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1645463114,
    "ts_modification_date": 1645463114,
    "files": {
        "pdf": "https://archive.orkl.eu/58a7dc800d633da1fad1756815d0e71ad120b60f.pdf",
        "text": "https://archive.orkl.eu/58a7dc800d633da1fad1756815d0e71ad120b60f.txt",
        "img": "https://archive.orkl.eu/58a7dc800d633da1fad1756815d0e71ad120b60f.jpg"
    }
}