{
    "id": "7d971cbb-fee6-4900-b551-53dc1f64159a",
    "created_at": "2022-10-25T16:48:23.218189Z",
    "updated_at": "2025-03-27T02:09:18.291298Z",
    "deleted_at": null,
    "sha1_hash": "f1230cf0e92547de6ef275e9677ff5d0c755b583",
    "title": "Ryuk Ransomware Now Targeting Webservers",
    "authors": "",
    "file_creation_date": "2021-06-24T12:33:02Z",
    "file_modification_date": "2021-06-25T09:44:06Z",
    "file_size": 3094765,
    "plain_text": "# R y u k\n\n R a n s o m w a r e\n\n N o w T a r g e t i n g\n\n W e b s e r v e r s\n\n\n-----\n\n### Table of Contents\n\n##### 4 General Overview\n\n 4 Anti-debugging Checks\n\n 5 Execution\n\n 6 Ransom Note\n\n 6 Change Drive Permissions\n\n 7 Process and Service Termination\n\n 8 File Encryption\n\n 11 Print Task\n\n 12 Wake on Lan\n\n 12 Network Shares Enumeration\n\n 13 SMB Replication\n\n\n##### 14 Defending Against Ryuk with McAfee\n\n 15 Initial Access 15 Command and Control\n\n 15 Conclusion\n\n 16 Yara Rule\n\n 16 IOCs\n\n 17 Mitre ATT&CK\n\n 18 Appendix A – Terminated processes\n\n 19 Appendix B – Terminated services\n\n 20 References\n\n\n-----\n\n## Ryuk Ransomware Now Targeting Webservers\n\n### Introduction\n\n#### Ryuk is a ransomware that encrypts a victim’s files and requests payment in Bitcoin cryptocurrency to release the keys used for encryption. Ryuk is used exclusively in targeted ransomware attacks.\n\n Ryuk was first observed in August 2018 during a campaign that targeted several enterprises. Analysis of the initial versions of the ransomware by our team revealed similarities and shared source code with the Hermes ransomware. Hermes ransomware is a commodity malware for sale on underground forums and has been used by multiple threat actors.\n\n To encrypt files, Ryuk utilizes a combination of symmetric AES (256-bit) encryption and asymmetric RSA (2048-bit or 4096-bit) encryption. The symmetric key is used to encrypt the file contents, while the asymmetric public key is used to encrypt the symmetric key. Upon payment of the ransom the corresponding asymmetric private key is released, allowing the encrypted files to be decrypted.\n\n Because of the targeted nature of Ryuk infections, the initial infection vectors are tailored to the victim. Often seen initial vectors are spear-phishing emails, exploitation of compromised credentials to remote access systems and the use of previous commodity malware infections. As an example of the latter, the combination of Emotet and TrickBot has been frequently observed distributing Ryuk, though recently BazarLoader has also been seen distributing it.\n\n\nAuthor\n\nThis report was researched\nand written by:\n\n- Marc EliasDelPozzo\n\n[Subscribe to receive threat](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n[information.](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n\nConnect With Us\n\n\n-----\n\nThe Ryuk infection chain usually starts with a spear-phishing email with\na malicious URL or an Office document to gain initial entry into victim\nenvironments. In certain cases, compromised RDP computers provide\nthe initial access. In the first scenario, either Trickbot or BazarLoader\nwill be executed and used as a loader malware, offering other actors the\nopportunity to purchase hacked machines. Once access to the victim’s\nmachines is acquired by the ransomware actors, a Cobalt Strike beacon is\noften downloaded in order to obtain users’ credentials and move laterally\non the network to take over the domain controllers. Finally, the Ryuk binary\nis distributed to every machine from the domain controllers.\n\nThe main goal of this blog is to deeply analyze the Ryuk binary itself.\n\n##### General Overview\n\nThe analyzed file corresponds to an unpacked ransomware sample from\nthe Ryuk family.\n\nThe sample can be identified by the following hashes:\n\n**Hash type** **Value**\n\nSHA1 1EFC175983A17BD6C562FE7B054045D6DCB341E5\n\nSHA256 8F368B029A3A5517CB133529274834585D087A2D3A\n5875D03EA38E5774019C8A\n\nThe Ryuk final payload has a size of 148Kb and the compilation date is 30\nApril 2021 and, while this date could have been manipulated, we believe it is\ngenuine.\n\n\n##### Anti-debugging Checks\n\nRyuk repeatedly implements anti-disassembly techniques to make analysis\nwith static analysis tools more difficult.\n\nFigure 1. Anti-disassembly trick\n\nLikewise, the malicious code will implement anti-debugging techniques\nby using the API ZwQueryInformationProcess (T1106 - Native API) along\nwith various flags such as ProcessDebugFlags, ProcessDebugPort, and\nProcessDebugObjectHandle (T1497.001 System Checks) which will allow\nthe ransomware to determine if a debugger is present and, if it is, it will\ncrash itself.\n\nFigure 2. Query process\n\n\n-----\n\nAdditionally, the malware will check the BeingDebugged flag (T1497.001\nSystem Checks) from the PEB structure of the process with the same\npurpose as stated above.\n\nFigure 3. Check if process is being debugged\n\n##### Execution\n\nRyuk copies itself three times in the current directory with different names\nand launches these new executables with distinct command lines to\nexecute different functionality in each execution.\n\nFor the first copy of the malware the filename is calculated as a checksum\nof the current username and the suffix “r.exe” is appended. If the malware\ncannot obtain the username, it will use the default filename “rep.exe.” Also,\nwhen the malware executes the file, it uses the “9 REP” command line.\n\n\nThis process will be responsible for the self-replication to other machines\nin the network.\n\nFigure 4. First execution\n\nThe second copy of the malware has a randomly generated name and the\nsuffix “lan.exe” appended. In this case, the malware passes the command\nline “8 LAN.” This process will be responsible for sending the Wake On Lan\npackets to other computers in the network.\n\nFigure 5. Second execution\n\nThe third copy follows the same name convention as the second and has\nthe same command line.\n\nFigure 6. Execution of third copy\n\n\n-----\n\n##### Ransom Note\n\nTo notify the user about the encryption, Ryuk drops an HTML ransom note\nin every folder that it encrypts. This note is remarkably similar to the note\nused in other Ryuk variants, with the only difference being the use of a\ncontact button with some instructions to install the Tor Browser.\n\nFigure 7. HTML Ransom note\n\nWhen the contact button is clicked, an alert appears with instructions to\ncontact the ransomware actors.\n\nFigure 8. Browser alert with instructions\n\n\nIf we follow the instructions and access the Onion link, we can find the\ncontact portal with a form asking for an e-mail, password, the name of the\norganization, and an area in which to write a message to the actors.\n\nFigure 9. Ryuk contact portal\n\n##### Change Drive Permissions\n\nThe malware will identify the mounted local drives via GetLogicalDrives\nAPI call and for each of them it will change their permissions using the\nWindows tool icacls (T1222.001 – Windows File and Directory Permissions\nModification) to grant full access to the drive.\n\nFigure 10. Icacls execution\n\nBelow is an example of the command that Ryuk will execute:\n```\nicacls “C:\\*” /grant Everyone: F /T /C /Q\n\n```\n\n-----\n\n##### Process and Service Termination\n\nBefore starting with the file encryption, the malware will start a new thread\nwhere it will try to finish a list of processes and stop some other services.\n\nFigure 11. Thread creation\n\nIn this new thread, the malware will enumerate the running processes\n(T1057 – Process Discovery) and services (T1489 – Service Stop)\nand check if the name matches with a list of 41 processes (Appendix\nA – Terminated Processes) and 64 services (Appendix B – Terminated\nServices) the malware has hardcoded in the sample. Some of these\nprocesses and services belong to AV products, backup services, and\nothers might be using files which the ransomware targets (T1562.001 –\nDisable or Modify Tools).\n\nFigure 12. Thread functions\n\n\nTo finish the process execution that the malware targets, it uses the\nfollowing command:\n```\n“C:\\Windows\\System32\\taskkill.exe” /IM <ProcessName> /F\n\n```\nTo stop the services that the malware targets, it uses the following\ncommand:\n```\n“C:\\Windows\\System32\\net.exe” stop “<ServiceName>” /y\n\n```\nSince the services and processes that the malware targets are\nchecked with the function ‘strstr,’ and this function returns partial\nmatches of the string, the malware will finish untargeted process like\n‘audioendpointbuilder’ because it contains the string ‘endpoint.’\n\nFigure 13. Bogus service stop\n\n\n-----\n\n##### File Encryption\n\nThe malware will try to encrypt both local drives and network drives and\niterate over each file on the drive and check its path and filename (T1083 –\nFile and Directory Discovery).\n\nRyuk does not encrypt files that contain the following names in its full path:\n```\n\\Windows\\\nWindows\nboot\nWINDOWS\\\nChrome\nMozilla\nSYSVOL\nNTDS\nnetlogon\nsysvol\n\n```\nThe malware also does not encrypt files if the filename contains any of the\nfollowing strings:\n```\nRyukReadMe.html\nboot\ndll\nntldr\n\n```\n```\nexe\n.ini\n.lnk\nbootmgr\nboot\nNTDETECT\n\n```\nAlso, the malware will verify if the filename contains “index.” and if it is true,\nit will call a function we named “RyukDropRansomNoteInIndexFile.”\n\nFigure 14. Check index files\n\n\n-----\n\nIf the file name contains “.php” it will dynamically create PHP code to\nrender the HTML ransom note. Otherwise, it will overwrite the file contents\nwith the HTML ransom note code. With this, the malware ensures that\nwhen someone accesses a website the Ryuk ransom note will appear.\n\nFigure 15. Drop RYUK ransom note in index files\n\n\nIt is believed that this functionality was added to newer versions of the\nmalware to target web servers and deface public websites with the\nRyuk ransom note. This is a tactic never seen before in the ransomware\nlandscape and whose final purpose is to pressure victims to pay.\n\nIn this later version of Ryuk, the encryption scheme is the same as\nprevious versions; it uses random AES 256 keys generated with the API\nCryptGenKey (T1486 – Data Encrypted for Impact) for each file and it\nencrypts those keys with the actor’s RSA public key that is hardcoded in\nthe malware. With this scheme the attackers ensure that the cryptography\nand key management are robust.\n\nFigure 16. AES 256 key generation\n\n\n-----\n\nBefore encrypting a file, the malware will check if it is already encrypted,\nsearching for the keyword “HERMES” for old Ryuk versions and\n“RYUKTM” for recent versions. If it finds those keywords it will close the\nhandle to file and not encrypt it.\n\nFigure 17. HERMES and RYUKTM check\n\n\nThen, the malware will start encrypting the file in chunks with a defined size\nof 1,000,000 bytes.\n\nFigure 18. File chunk encryption\n\nAfter that, the malware will write the keyword “RYUKTM” to mark the file as\nencrypted and will export the AES key encrypted with the RSA public key\nusing the API CryptExportKey and write it at the end of the file.\n\n\n-----\n\nHere is an example of an encrypted file with the 274 bytes of metadata info\nappended at the end of file by Ryuk.\n\nFigure 20. Appended metadata\n\n\n##### Print Task\n\nAfter the encryption of the files, the malware will create a new scheduled\ntask (T1053.005 – Scheduled Task) that will print 50 copies of the RTF\nransom note in the default printer configured in the system. The command\nline to create this task (T1059.003 – Windows Command Shell) is the\nfollowing:\n```\nSCHTASKS /CREATE /NP /SC DAILY /TN “PrintvE” /TR “C:\\Windows\\System32\\cmd.\nexe /c for /l %x in (1,1,50) do start wordpad.exe /p C:\\users\\Public\\YTKkI.\ndll” /ST 10:25 /SD 05/18/2021 /ED 05/25/2021\n\n```\nAt a certain time during the week the task would print 50 pages of an RTF\nransom note containing the password dropped in the Public directory with\na random name and the dll extension (T1036 – Masquerading).\n\nFigure 21. Ryuk RTF note\n\nThis is also a new functionality added to the malware with the intention\nof creating chaos in the victim’s system and pressurizing them to pay the\nransom price to decrypt the files.\n\n\n-----\n\n##### Wake on Lan\n\nThe Ryuk process with the command line “8 LAN” is responsible for\nobtaining the ARP cache entries of the system and sending the Wake on\nLan packets to try to turn on the remote computers. To extract the ARP\ntable, the malware will use the GetIpNetTable API (T1016 – System Network\nConfiguration Discovery) from the iphlpapi.dll and after retrieving the\npreviously mentioned table, it will begin to send the packets using the API\nsendto from the Winsock library.\n\nFigure 22. Send Wake on Lan packet\n\n\nThe Wake on Lan magic packets (T1205 – Traffic Signaling) are made up\nof 6 bytes with the 255 value (0xFF in hexadecimal) followed by sixteen\nrepetitions of the target computer MAC address for a total of 102 bytes.\n\nFigure 23. Wake on Lan packet\n\n##### Network Shares Enumeration\n\nRyuk will also try to move laterally to other hosts in the network, first\nobtaining all the IP addresses assigned to the system and checking if\nthey belong to a private IPv4 addressing range (10.x.x.x, 172.16.x.x and\n192.168.x.x). Because the previously mentioned check is done with the\nfunction strstr, it can match with other public subnets such as 151.192.172.1.\n\nFigure 24. Bug checking private IP networks\n\n\n-----\n\nIf the subnet is one of the above, it will proceed to send ICMP Echo requests\nwith the API IcmpSendEcho to discover new machines in the subnet (T1135\n– Network Share Discovery). If the machine responds to the ping, it will be\nconsidered a potential victim and Ryuk will try to encrypt its files.\n\nFigure 25. ICMP Echo request\n\nFor each host discovered, Ryuk will attempt to encrypt them using a similar\nmethod to the one used for local drives, by building a UNC path in the\nfollowing format for each driver letter, from A to Z:\n```\n\\\\<IP>\\<drive letter>$\n\n```\nAlso, it will try to access and encrypt the following UNC path:\n```\n\\\\<IP>\n\n```\nAs can be seen in the following image:\n\nFigure 26. Ryuk UNC file encryption\n\n\n##### SMB Replication\n\nThe Ryuk process with the command line “9 REP” will be responsible\nfor replicating itself into new computers but first it will check for double\nexecutions of the same process creating a mutex object with the name of\nthe username of the machine (T1082 – System Information Discovery). If\nthe mutex already exists it will finish the process.\n\nFigure 27. Mutex creation\n\nNext, the malware will check if the file already exists in the remote\ncomputer using the API GetFileAttributesW. The UNC file path will be\nconstructed on the fly, and it will always try to access the path “C:\\Users\\\nPublic” from the remote computer. The filename is created by doing a\n[checksum of the current username and appending the suffix “r.exe”.T1053](https://attack.mitre.org/techniques/T1053/005)\n\nFigure 28. Ryuk file copy\n\nThen, it will use the API CopyFileW to copy the file to the remote computer\nand to achieve remote execution it will create a scheduled task with a\nrandom name using the schtasks.exe tool to execute the ransomware copy\n(T1021 – Remote Services).\n\nFigure 29. Remote service creation\n\n\n-----\n\nTherefore, for each compromised remote machine the following two\ncommands will be executed:\n```\nschtasks.exe /Create /S 192.168.56.2 /TN qdpRGwh /TR \\”C:\\\\Users\\\\Pub­\nlic\\\\622r.exe\\” /sc once /st 00:00 /RL HIGHEST\nschtasks.exe /S 192.168.56.2 /Run /TN qdpRGwh\n\n##### Defending Against Ryuk with McAfee\n\n```\nRyuk, like other ransomware, leverages multiple techniques to access the\nnetwork and remain persistent before having an impact. In other words,\nattacks using ransomware do not start with encryption and therefore you\nhave multiple opportunities to prevent, disrupt, or detect the malicious\nactivity. Below is an overview of how you can defend against Ryuk with\nMcAfee® MVISION™ Security Architecture.\n\n\n-----\n\nSome best practices to detect or prevent very early in the attack chain\nwith McAfee® Endpoint Protection and MVISION Unified Cloud Edge can\ninclude:\n\n##### Initial Access\n\nEndpoint Firewall and Web Control (ENS): Restrict access to necessary\nports and prevent access to web sites with malicious or unknown\nreputation.\n\nEndpoint Protection Platform (ENS): Configure both Threat Prevention\nand Adaptive Threat Prevention modules for maximum protection\nagainst malware delivered through Spearphishing. In particular, use GTI\nin both modules and ensure JTI Rules 4 (GTI File Reputation) and 5 (URL\nReputation) are enabled.\n\n##### Command and Control\n\nEndpoint Protection Platform (ENS) and MVISION EDR can both identify\nCobalt Strike and other type of command-and-control techniques.\nMVISION EDR provides a unified view of endpoint prevention and detection\nevents so you can speed up triage.\n\nUnified Cloud Edge (UCE – SWG) can prevent access to risky web sites\nusing threat intelligence, URL reputation, behaviour analysis, and remote\nbrowser isolation. Ensure you have a strong web security policy in place\nand are monitoring logs.\n\nMore details on specific rules and other defense recommendations can be\nfound here.\n\n\n##### Conclusion\n\nIn this short report we have presented a technical overview of the Ryuk\nransomware and the new functionalities added to the malware used to\nincrease the damage on the organizations it targets.\n\nIt is interesting to note that Ryuk has shifted its attention to webservers\nsince it no longer encrypts the index file but replaces it with the ransom\nnote instead. Furthermore, the developers behind Ryuk upgraded the\nmalware with the ability to print the ransom note in the default printer.\nThese new functionalities were included to pressure victims into paying the\nransom.\n\nIn the first half of the year, several Ryuk actors have been known to be\nactively launching new campaigns and targeting organizations all over the\nworld. This is the reason we believe the criminals behind Ryuk will continue\nto develop new features and invent new methods to maximize their profits.\n\nMcAfee Advanced Threat Research is actively monitoring this threat,\ndetected as Ransom-Ryuk![partial-hash], for future releases. Meanwhile,\na solid data loss prevention strategy remains the best advice against\nall forms of ransomware; for general prevention advice please visit\n[NoMoreRansom. Always seek professional assistance when you are faced](https://www.nomoreransom.org/en/prevention-advice.html)\nwith a targeted ransomware attack such as Ryuk.\n\n\n-----\n\n##### Yara Rule\n```\nrule RANSOM _ RYUK _ May2021 : ransomware {\n     meta:\n         \u0007description = “Rule to detect latest May 2021 compiled\n         Ryuk variant”\n         author = “Marc Elias | McAfee ATR Team”\n         date = “2021-05-21”\n         \u0007hash = “8f368b029a3a5517cb133529274834585d087a2d3a5875d03e­\n         a38e5774019c8a”\n         version = “0.1”\n     strings:\n\n```\n$ryuk _ filemarker = “RYUKTM” fullword wide ascii\n```\n         \u0007$sleep _ constants = { 68 F0 49 02 00 FF (15|D1) [0-4] 68 ??\n         ?? ?? ?? 6A 01 }\n         \u0007$icmp _ echo _ constants = { 68 A4 06 00 00 6A 44 8D [1-6]\n         5? 6A 00 6A 20 [5-20] FF 15 }\n     condition:\n         uint16(0) == 0x5a4d\n\n```\nand filesize < 200KB\n\nand ( $ryuk _ filemarker\n```\n         or ( $sleep _ constants\n         and $icmp _ echo _ constants ))\n}\n\n```\n\n##### IOCs\n\nBelow is a list of files identified as Ryuk:\n\nSHA256 8f368b029a3a5517cb133529274834585d087a2d3a5875d03ea38e5774019c8a\n\nSHA256 d8a0d25776c28e17e724da2b1c8fdae28d7c6b32cfa9d3d2a20f3f57ff370488\n\nSHA256 703ee3222eccd0e355b9ef414be9153fa3a2ad8efb8176fee887d7744a9f632f\n\nSHA256 b42d07f0b72879bf21e99f39a21edae1a38c3fd62393bd4e88f1032f561855f9\n\nSHA256 09a0e87008e34a7a434c5d853600f693ab9de181e1f863ef6a90edf8c3fccd54\n\nSHA256 63b44f7fe68cb8a05fa98c5acc59851d4b73f5bbd76e9910c94042c523da8d5b\n\nSHA256 60c16e45c5cbe88a38911f1e3176d90444e4884261d8481d4d719acec1bc5025\n\nSHA256 307a8158e698680c7186e3c1481b29186d8b265bb83662397a54f235b0c9a3d1\n\nSHA256 473bcbcba12296b08b765b4f7c2beea5f56f263d5e6c0d15c1006af28f6172e8\n\nSHA256 23e95ba67603234352ff2864dc7fa54742f501e5922f01f8c182dbefc116f97f\n\nSHA256 d6b7b27e13700aaa7f108bf9e76473717a7a1665198e9aafcc2d2227ca11bba9\n\n\n-----\n\n##### Mitre ATT&CK\n\nThe sample uses the following MITRE ATT&CK™ techniques:\n\n**Technique ID** **Technique Description** **Observable**\n\n[T1134](https://attack.mitre.org/techniques/T1134) Access Token Manipulation Ryuk attempts to adjust its token privilege to have the SeBackupPrivilege.\n\n[T1059.003](https://attack.mitre.org/techniques/T1059/003/) Windows Command Shell Ryuk uses the cmd.exe shell to execute the print task in the infected host.\n\n[T1486](https://attack.mitre.org/techniques/T1486/) Data Encrypted for Impact Ryuk utilizes a combination of symmetric AES (256-bit) encryption and asymmetric RSA (2048-bit or 4096-bit)\nencryption to encrypt files.\n\n[T1083](https://attack.mitre.org/techniques/T1083/) File and Directory Discovery Ryuk uses the API FindFirstFileW and FindNextFileW to enumerate files in the system.\n\n[T1222.001](https://attack.mitre.org/techniques/T1222/001) Windows File and Directory Permissions Modification Ryuk executes the command icacls “<DriveLetter>:\\*” /grant Everyone: F /T /C /Q to grant full access to\nthe drive.\n\n[T1562.001](https://attack.mitre.org/techniques/T1562/001) Disable or Modify Tools Ryuk stops services related to endpoint security software.\n\n[T1036](https://attack.mitre.org/techniques/T1036) Masquerading Ryuk can create .dll files that contain a Rich Text File document.\n\n[T1106](https://attack.mitre.org/techniques/T1106) Native API Ryuk uses the native API ZwQueryInformationProcess to check if a debugger is present.\n\n[T1057](https://attack.mitre.org/techniques/T1057/) Process Discovery Ryuk calls the function CreateToolhelp32Snapshot to enumerate all running processes in the system.\n\n[T1053.005](https://attack.mitre.org/techniques/T1053/005) Scheduled Task Ryuk creates a local scheduled task to print the ransom note on the default printer.\n\n[T1489](https://attack.mitre.org/techniques/T1489) Service Stop Ryuk uses the command net stop “<ServiceName>” /y to stop services before file encryption.\n\n[T1016](https://attack.mitre.org/techniques/T1016) System Network Configuration Discovery Ryuk has called the API GetIpNetTable in attempt to identify all mounted drives and hosts that have Address Resolution\nProtocol (ARP) entries.\n\n[T1205](https://attack.mitre.org/techniques/T1205) Traffic Signaling Ryuk has used Wake-on-Lan to power on turned off systems for lateral movement.\n\n[T1078.002](https://attack.mitre.org/techniques/T1078/002) Domain Accounts Ryuk can use stolen domain admin accounts to move laterally within a victim domain.\n\n[T1497.001](https://attack.mitre.org/techniques/T1497/001/) System Checks Ryuk uses the native API ZwQueryInformationProcess to check if a debugger is present.\n\n[T1135](https://attack.mitre.org/techniques/T1135/) Network Share Discovery Ryuk will attempt to discover network shares by building a UNC path in the following format for each driver letter, from\nA to Z: \\\\<IP>\\<drive letter>$\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System Information Discovery Ryuk calls the API GetUserNameA and GetVersionExW to obtain information about the system.\n\n[T1021](https://attack.mitre.org/techniques/T1021/) Remote Services Ryuk can create a copy of the ransomware on a remote system and create a scheduled task to execute itself.\n\n\n-----\n\n##### Appendix A – Terminated processes\n```\nvirtual\nvmcomp\nvmwp\nveeam\nbackup\n\n```\nBackup\n```\nxcha\nsql\ndbeng\nsofos\ncalc\nekrn\nzoolz\n\n```\n```\nencsvc\nexcel\n\n```\nfirefoxconfig\n```\ninfopath\nmsaccess\nmspub\nmydesktop\nocautoupds\nocomm\nocssd\nonenote\noracle\noutlook\npowerpnt\n\n```\n```\nsqbcoreservice\nsteam\nsynctime\n\n```\ntbirdconfig\n```\nthebat\nthunderbird\nvisio\nword\nxfssvccon\ntmlisten\nPccNTMon\nCNTAoSMgr\nNtrtscan\nmbamtray\n\n```\n\n-----\n\n##### Appendix B – Terminated services\n```\nvmcomp\nvmwp\nveeam\n\n```\nBack\n```\nxcha\nackup\nacronis\nsql\nEnterprise\nSophos\nVeeam\nAcrSch\nAntivirus\nAntivirus\nbedbg\nDCAgent\nEPSecurity\nEPUpdate\nEraser\nEsgShKernel\nFA _ Scheduler\n\n```\n```\nIISAdmin\nIMAP4\n\n```\nMBAM\n```\nEndpoint\nAfee\nMcShield\ntask\nmfemms\nmfevtp\nmms\nMsDts\nExchange\nntrt\nPDVF\nPOP3\nReport\nRESvc\nsacsvr\nSAVAdmin\nSamS\nSDRSVC\nSepMaster\n\n```\n```\nMonitor\nSmcinst\nSmcService\nSMTP\nSNAC\nswi _\nCCSF\nTrueKey\ntmlisten\nUI0Detect\nW3S\nWRSVC\nNetMsmq\nekrn\nEhttpSrv\nESHASRV\nAVP\nklnagent\nwbengine\nKAVF\n\n```\nmfefire\n\n\n-----\n\n##### References\n\n[https://www.fortinet.com/blog/threat-research/ryuk-revisited-analysis-of-recent-ryuk-attack](https://www.fortinet.com/blog/threat-research/ryuk-revisited-analysis-of-recent-ryuk-attack)\n\n[https://www.cert.ssi.gouv.fr/uploads/CERTFR-2021-CTI-006.pdf](https://www.cert.ssi.gouv.fr/uploads/CERTFR-2021-CTI-006.pdf)\n\n[https://www.ccn-cert.cni.es/informes/informes-ccn-cert-publicos/5768-ccn-cert-id-03-21-ryuk-ransomware/file.html](https://www.ccn-cert.cni.es/informes/informes-ccn-cert-publicos/5768-ccn-cert-id-03-21-ryuk-ransomware/file.html)\n\n[https://www.intel471.com/blog/understanding-the-relationship-between-emotet-ryuk-and-trickbot](https://www.intel471.com/blog/understanding-the-relationship-between-emotet-ryuk-and-trickbot)\n\n[https://analyst1.com/file-assets/RANSOM-MAFIA-ANALYSIS-OF-THE-WORLD%E2%80%99S-FIRST-RANSOMWARE-CARTEL.pdf](https://analyst1.com/file-assets/RANSOM-MAFIA-ANALYSIS-OF-THE-WORLD%E2%80%99S-FIRST-RANSOMWARE-CARTEL.pdf)\n\n[https://attack.mitre.org/software/S0446/](https://attack.mitre.org/software/S0446/)\n\n\n-----\n\n##### About McAfee\n\nMcAfee is the device-to-cloud cybersecurity\ncompany. Inspired by the power of working\ntogether, McAfee creates business and\nconsumer solutions that make our world a safer\nplace. By building solutions that work with other\ncompanies’ products, McAfee helps businesses\norchestrate cyber environments that are truly\nintegrated, where protection, detection, and\ncorrection of threats happen simultaneously\nand collaboratively. By protecting consumers\nacross all their devices, McAfee secures their\ndigital lifestyle at home and away. By working\nwith other security players, McAfee is leading\nthe effort to unite against cybercriminals for the\nbenefit of all.\n\n[www.mcafee.com](http://www.mcafee.com)\n\n6220 America Center Drive\nSan Jose, CA 95002\n888 847 8766\n\n\n##### McAfee ATR\n\nThe McAfee® Advanced Threat Research\nOperational Intelligence team operates globally\naround the clock, keeping watch of the latest\ncyber campaigns and actively tracking the\nmost impactful cyber threats. Several McAfee\nproducts and reports, such as MVISION Insights\nand APG ATLAS, are fueled with the team’s\nintelligence work. In addition to providing the\nlatest Threat Intelligence to our customers, the\nteam also performs unique quality checks and\nenriches the incoming data from all of McAfee’s\nsensors in a way that allows customers to hit the\nground running and focus on the threats that\nmatter.\n\n[Subscribe to receive our Threat Information.](https://www.mcafee.com/enterprise/en-us/forms/threat-information-subscription.html?eid=X7AOM1OW)\n\nMcAfee and the McAfee logo are trademarks or registered trademarks of McAfee, LLC or its subsidiaries in the US and other countries.\nOther marks and brands may be claimed as the property of others. Copyright © 2021 McAfee, LLC. 4761_0621\nJUNE 2021\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.mcafee.com/enterprise/en-us/assets/reports/rp-ryuk-ransomware-targeting-webservers.pdf"
    ],
    "report_names": [
        "rp-ryuk-ransomware-targeting-webservers.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1624537982,
    "ts_modification_date": 1624614246,
    "files": {
        "pdf": "https://archive.orkl.eu/f1230cf0e92547de6ef275e9677ff5d0c755b583.pdf",
        "text": "https://archive.orkl.eu/f1230cf0e92547de6ef275e9677ff5d0c755b583.txt",
        "img": "https://archive.orkl.eu/f1230cf0e92547de6ef275e9677ff5d0c755b583.jpg"
    }
}