{
    "id": "7e05b3d9-e27c-4432-8d6b-2e28408b862a",
    "created_at": "2023-01-12T14:59:31.455774Z",
    "updated_at": "2025-03-27T02:09:30.018458Z",
    "deleted_at": null,
    "sha1_hash": "099bf31498911f8160e018c7c51991e3b49ae926",
    "title": "2021-02-25 - Emotet Disruption and Outreach to Affected Users",
    "authors": "",
    "file_creation_date": "2022-05-28T19:01:37Z",
    "file_modification_date": "2022-05-28T19:01:37Z",
    "file_size": 499394,
    "plain_text": "# Emotet Disruption and Outreach to Affected Users\n\n**blogs.jpcert.or.jp/en/2021/02/emotet-notice.html**\n\n佐條 [研(Ken Sajo)](https://blogs.jpcert.or.jp/en/sajo/)\n\nFebruary 25, 2021\n\n[Emotet](https://blogs.jpcert.or.jp/en/tags/emotet/)\n\n[Email](http://10.10.0.46/mailto:?subject=Emotet%20Disruption%20and%20Outreach%20to%20Affected%20Users&body=https%3A%2F%2Fblogs.jpcert.or.jp%2Fen%2F2021%2F02%2Femotet-notice.html)\n\nSince October 2019, many cases of Emotet infection were reported. JPCERT/CC has\n[published a security alert and](https://www.jpcert.or.jp/english/at/2019/at190044.html) [a blog article detailing the detection and security measures, as](https://blogs.jpcert.or.jp/en/2019/12/emotetfaq.html)\nwell as providing notification and support for affected users.\n\nEuropol announced that Emotet infrastructure was disrupted thanks to the joint operation\ntogether with some foreign authorities in January 2021 and information regarding affected\n\n\n-----\n\nusers is to be distributed via the CERT network. In Japan, there are still many infected\ndevices, and JPCERT/CC has been notifying those affected with the support from local and\ninternational partners.\n\nThis article explains the global operation for Emotet disruption and the changes in the\nnumber of infected devices in Japan since then, followed by the notification activity by\nJPCERT/CC and guidance on how to respond to the infection.\n\nContents\n1. Emotet overview\n2. Emotet disruption\n3. Emotet infection in Japan\n4. Notification to affected users\n5. Response to infection\n6. Updates on our notification activities\n\n### 1. Emotet overview\n\nA device is infected with Emotet when a user opens a malicious Word file and selects\n“Enable content”. The malware may perform the following on the infected devices:\n\nSteal credentials stored in the device or browsers\nUse the stolen credentials to spread infection in the network via SMB\nSteal Email accounts and passwords\nSteal Email contents and contact information\nSend emails to spread infection using the stolen Email accounts and contents etc.\nInfect the device with other kinds of malware\n\n### 2. Emotet disruption\n\nEmotet’s infrastructure was disrupted on 27 January 2021 as a result of “Operation\n[LadyBird”, which is a joint effort by the authorities in the Netherlands,](https://www.politie.nl/nieuws/2021/januari/27/11-internationale-politieoperatie-ladybird-botnet-emotet-wereldwijd-ontmanteld.html) [Germany,](https://www.bka.de/DE/Presse/Listenseite_Pressemitteilungen/2021/Presse2021/210127_pmEmotet.html) the United\nStates, [the United Kingdom, France, Lithuania,](https://www.nationalcrimeagency.gov.uk/news/nca-in-international-takedown-of-notorious-malware-emotet) [Canada and](https://www.rcmp-grc.gc.ca/en/news/2021/emotet-malware-the-rcmp-takes-part-international-operation-neutralize-emotet) [Ukraine, coordinated by Europol](https://www.npu.gov.ua/news/kiberzlochini/kiberpolicziya-vikrila-transnaczionalne-ugrupovannya-xakeriv-u-rozpovsyudzhenni-najnebezpechnishogo-v-sviti-komp-yuternogo-virusu-EMOTET/)\n[and Eurojust. The following is the achievement of this operation:](https://www.eurojust.europa.eu/worlds-most-dangerous-malware-emotet-disrupted-through-global-action)\n\nC2 servers connected to Emotet are now under the control of the authorities\nSome members operating Emotet have been arrested\nInfected devices are now redirected to servers controlled by the authorities\n\nThanks to this operation, it is safe to say that Emotet is no longer harmful. Nonetheless,\ninfected devices are still likely at the risk.\n\n### 3. Emotet infection in Japan\n\n\n-----\n\nFollowing the joint operation, foreign partner organisations started providing JPCERT/CC\nwith the information about infected hosts in Japan, particularly the details of the devices\nconnected to the servers that are under the foreign authorities’ control. Figure 1 shows the\nnumber of infected devices in Japan based on the data provided.\n\nFigure 1： Emotet Infected devices in Japan\nAs of 27 January, when the joint operation took place, there were connections to the\ninfrastructure from about 900 IP addresses in Japan. Starting on 5 February, we have also\nbeen receiving the computer name of the infected devices. It is assumed that the number of\nthe unique computer names indicates more accurate number of infected devices, as an IP\naddress linked to a device may change.\n\nWith the disruption of the infrastructure, Emotet’s anti-detection function will no longer work,\nand it will be detected and/or removed by antivirus software instead. However, based on the\nnumber of the computer names, it is assumed that there are about 500 infected devices as of\nFebruary 2021.\n\n### 4. Notification to affected users\n\nBased on the information provided by the relevant parties, JPCERT/CC has been notifying\nthe users of the infected devices in Japan with the support of ISPs and other partners.\n\nOn 19 February, Japan’s Ministry of Internal Affairs and Communication, together with the\nNational Police Agency, ICT-ISAC and ISPs, announced their joint effort on notification\nactivities to users of infected devices based on the information from foreign authorities. While\n\n\n-----\n\ncooperating in this initiative, JPCERT/CC will also continue the aforementioned outreach\nactivities based on the information from partners.\n\nThanks to the global operation, Emotet will be uninstalled from the devices at 12:00 on 25\nApril 2021 (according to the local time of each device). However, security measures still need\nto be implemented on the infected devices as the malware may have already performed the\nfollowing:\n\nSteal credentials stored in the device or browsers\nSteal Email accounts and passwords\nSteal Email contents and contact information\nInfect the device with other kinds of malware\n\nUsers still need to take measures if antivirus software has detected and/or removed Emotet.\n\n### 5. Response to Emotet infection\n\n“EmoCheck”, developed by JPCERT/CC, can be used to check if a device is infected with\nEmotet. Please download the tool from GitHub and copy it to the devices that need checking.\nIt is recommended to run it with the privilege of the user who normally use the device.\n\n[JPCERTCC/EmoCheck - GitHub https://github.com/JPCERTCC/EmoCheck/releases](https://github.com/JPCERTCC/EmoCheck/releases)\n\nIf the message “Emotet was detected” is displayed (as highlighted in red in Figure 2), the\ndevice is infected with Emotet.\n\nFigure 2：Sample results (Emotet detected)\n\n\n-----\n\nFigure 3：Sample image path of Emotet according to EmoCheck result (highlighted in yellow\nin Figure 2)\nWhen the infected devices are identified, please take the following security measures:\n\nDelete Emotet which is stored in the image path according to the EmoCheck result.\nChange email account passwords for Outlook, Thunderbird, etc.\nChange passwords stored in browsers.\nCheck if the device is infected with other kinds of malware.\n\nIf the device is infected with other kinds of malware, evidence may be left in the following\nlocations:\n\nAutorun registry\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nTask scheduler\n\nIf the above settings refer to the suspicious folders as below, the device is possibly infected\nwith other kinds of malware:\n\nFolders under C:\\Users(user name)\\AppData\\\nC:\\ProgramData\\\n\nMore details on how to check and respond to the infection are also available on our past blog\narticle\n\n### 6. Updates on our notification activities (Updated on 25/May 2021)\n\nJPCERT/CC has notified affected users cooperating with ISPs and other organizations since\nwe received the said data in late January until Emotet was automatically deleted in late April.\nThrough the joint notification effort by the National Police Agency and the Ministry of Internal\nAffairs and Communication, the information on the affected IP addresses was provided to\n\n\n-----\n\nICT-ISAC in mid-February and received by each ISP in late March. This accounts for about\n90 percent of the whole affected IP addresses in Japan, and JPCERT/CC has notified the\nrest directly to administrators since late January.\n\nAfter the global take down operation, Emotet was updated so that it automatically stops itself\nat 12:00 on 25 April (local time of each device). The following figure on the number of\nEmotet-infected devices in Japan clearly shows that only few infections have been observed\nsince then.\n\nFigure 4：Emotet Infected devices in Japan\nWe appreciate all the supports we received from everyone concerned.\n\n### In closing\n\nWe would like to take this opportunity to thank the effort by “Operation LadyBird” in disrupting\nthe Emotet infrastructure.\n\nBesides Emotet, there are many other kinds of malware spreading infection via email and its\nattachment. Please pay careful attention when you open attachments. We also recommend\nthat you regularly scan your devices with the latest antivirus definition file, in addition to\napplying the latest security programs for your OS and software.\n\nJPCERT/CC will continue to work closely with both local and international partners.\n\nKen Sajo\n\n(Translated by Yukako Uchida)\n\n\n-----\n\n[Email](http://10.10.0.46/mailto:?subject=Emotet%20Disruption%20and%20Outreach%20to%20Affected%20Users&body=https%3A%2F%2Fblogs.jpcert.or.jp%2Fen%2F2021%2F02%2Femotet-notice.html)\n\nAuthor\n\n佐條 [研(Ken Sajo)](https://blogs.jpcert.or.jp/en/sajo/)\n\nJoined JPCERT/CC in January 2019 after being engaged in security monitoring operation at\na financial institution. Currently in charge of threat analysis and incident response for email\nscam and APT.\n\nWas this page helpful?\n\n0 people found this content helpful.\n\nIf you wish to make comments or ask questions, please use this form.\n\nThis form is for comments and inquiries. For any questions regarding specific commercial\nproducts, please contact the vendor.\n\nplease change the setting of your browser to set JavaScript valid. Thank you!\n\n## Related articles\n\nTrends of Reported Phishing Sites and Compromised Domains in 2021\n\n\n-----\n\nAttack Exploiting XSS Vulnerability in E-commerce Websites\n\nPHP Malware Used in Lucky Visitor Scam\n\nAttacks Embedding XMRig on Compromised Servers\n\n\n-----\n\nLazarus Attack Activities Targeting Japan (VSingle/ValeforBeta)\n\n\n[Back](https://blogs.jpcert.or.jp/en/2021/02/jsac2021report2.html)\n[Top](https://blogs.jpcert.or.jp/en/)\n[Next](https://blogs.jpcert.or.jp/en/2021/03/jsac2021report3.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-25 - Emotet Disruption and Outreach to Affected Users.pdf"
    ],
    "report_names": [
        "2021-02-25 - Emotet Disruption and Outreach to Affected Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535571,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653764497,
    "ts_modification_date": 1653764497,
    "files": {
        "pdf": "https://archive.orkl.eu/099bf31498911f8160e018c7c51991e3b49ae926.pdf",
        "text": "https://archive.orkl.eu/099bf31498911f8160e018c7c51991e3b49ae926.txt",
        "img": "https://archive.orkl.eu/099bf31498911f8160e018c7c51991e3b49ae926.jpg"
    }
}