{
    "id": "7eb64d4d-f79e-4208-b62b-9c0b668f7110",
    "created_at": "2023-01-12T15:06:27.311804Z",
    "updated_at": "2025-03-27T02:15:35.485562Z",
    "deleted_at": null,
    "sha1_hash": "431f64129424ed5e8029481c098d732257c20d0d",
    "title": "2021-09-13 - Hide and Seek - New Zloader Infection Chain Comes With Improved Stealth and Evasion Mechanisms",
    "authors": "",
    "file_creation_date": "2022-05-28T17:39:02Z",
    "file_modification_date": "2022-05-28T17:39:02Z",
    "file_size": 1477112,
    "plain_text": "# Hide and Seek | New Zloader Infection Chain Comes With Improved Stealth and Evasion Mechanisms\n\n**sentinelone.com/labs/hide-and-seek-new-zloader-infection-chain-comes-with-improved-stealth-and-evasion-**\nmechanisms/\n\nAntonio Pirozzi\n\n**By Antonio Pirozzi and Antonio Cocomazzi**\n\n## Executive Summary\n\nNew ZLoader campaign has a stealthier distribution mechanism which deploys a\nsigned dropper with lower rates of detection.\nThe campaign primarily targets users of Australian and German banking institutions.\nThe new infection chain implements a stager which disables all Windows Defender\nmodules.\nThe threat actor uses a backdoored version of the Windows utility `wextract.exe to`\nembed the ZLoader payload and lower the chance of detection.\nSentinelLabs identified the entire infrastructure of the ‘Tim’ botnet, composed of more\nthan 350 recently-registered C2 domains.\n\nRead the Full Report\n\n## Introduction\n\n\n-----\n\n[ZLoader (also known as Terdot) was first discovered in 2016 and is a fork of the infamous](https://malpedia.caad.fkie.fraunhofer.de/details/win.zloader)\nZeus banking trojan. It is still under active development. A multitude of different versions\n[have appeared since December 2019, with an average frequency of 1-2 new versions](https://www.proofpoint.com/us/blog/threat-insight/zloader-loads-again-new-zloader-variant-returns)\nreleased each week.\n\nZLoader is a typical banking trojan which implements web injection to steal cookies,\npasswords and any sensitive information. It attacks users of financial institutions all over the\n[world and has also been used to deliver ransomware families like Egregor and](https://www.sentinelone.com/labs/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone/) [Ryuk. It also](https://www.sentinelone.com/labs/an-inside-look-at-how-ryuk-evolved-its-encryption-and-evasion-techniques/)\nprovides backdoor capabilities and acts as a generic loader to deliver other forms of\nmalware. [Newer versions implement a VNC module which permits users to open a hidden](https://www.malwarebytes.com/resources/files/2020/06/the-silent-night-zloader-zbot_final.pdf)\nchannel that gives the operators remote access to victim systems. ZLoader relies primarily\non dynamic data exchange (DDE) and macro obfuscation to deliver the final payload through\ncrafted documents.\n\nA [recent evolution of the infection chain included the dynamic creation of agents, which](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/)\ndownload the payload from a remote server. The new infection chain observed by\nSentinelLabs demonstrates a higher level of stealth by disabling Windows Defender and\n[relying on living-off-the-land binaries and scripts (LOLBAS) in order to evade detection.](https://www.sentinelone.com/labs/living-off-windows-land-a-new-native-file-downldr/)\nDuring our investigation, we were also able to map all the new ZLoader C2 infrastructure\nrelated to the ‘Tim’ botnet and identify the scope of the campaign and its objectives, which\nprimarily involved stealing bank credentials from customers of European banks.\n\nOverview of the ZLoader infection chain\n\n\n-----\n\n## Technical Analysis\n\nThe malware is downloaded from a Google advertisement published through Google\nAdwords. In this campaign, the attackers use an indirect way to compromise victims instead\nof using the classic approach of compromising the victims directly, such as by phishing.\n\nWe observed the following pattern of activity that leads to infection:\n\nThe user performs a search on www.google.com to find a website to download the\nrequired software from; in our case, we observed a search for “team viewer download”.\nThe user clicks on an advertisement shown by Google and is redirected to the fake\nTeamViewer site under the attacker’s control.\nThe user is tricked into downloading the fake software in a signed MSI format.\n\n[Once the user clicks on the advertisement, it will redirect through the aclk page. This redirect](https://www.warriorforum.com/blogs/clint-butler/15012-google-ad-services-pagead-aclk-what-heck.html)\ndemonstrates the attackers usage of Google Adwords to gain traffic:\n```\nhxxps://www.google.com/aclk?\nsa=L&ai=DChcSEwiMusngi8_yAhVbbm8EHYpXDh0YABABGgJqZg&ae=2&sig=AOD64_05er1E772xSHdHTQn_3\n\n```\nAfter further navigation (and redirects), the malicious `Team-Viewer.msi is downloaded`\nfrom the final URL `hxxps://team-viewer.site/download/Team-Viewer.msi .`\n\nThe downloaded file is a fake TeamViewer installer signed on 2021-08-23 10:07:00. It\nappears that the cybercriminals managed to obtain a valid certificate issued by Flyintellect\nInc, a Software company in Brampton, Canada. The company was registered on 29th June\n2021, suggesting that the threat actor possibly registered the company for the purpose of\nobtaining those certificates.\n\nPivoting from this certificate, we were able to spot other samples signed with the same\ncertificate. These other samples suggest that the attackers had multiple campaigns ongoing\nbeyond TeamViewer and which included fakes such as `JavaPlug-in.mis,` `Zoom.mis,`\nand `discord.msi .`\n\nAt the time of writing, these four samples have no detections on VirusTotal (a complete list of\nIoCs can be found in the full report).\n\n## New Zloader Infection Chain Bypass Defences\n\nThe `.msi file is the first stage dropper which runs an installation wizard. It creates random`\nlegitimate files in the directory `C:\\Program Files (x86)\\Sun Technology`\n```\nNetwork\\Oracle Java SE . Once the folder has been created, it will drop the setup.bat\n\n```\nfile, triggering the initial infection chain by executing `cmd.exe /c setup.bat .`\n\n\n-----\n\nThis initiates the second stage of the infection chain, downloading the dropper\n```\nupdatescript.bat through the PowerShell cmdlet Invoke-WebRequest, from\nhxxps://websekir.com/g00glbat/index/processingSetRequestBat/?\nservername=msi . The dropper then executes the third stage with the command cmd /c\nupdatescript.bat .\n\n```\nThe third stage dropper contains most of the logic to impair the defenses of the machine. It\nalso drops the fourth stage using a stealthy execution technique. At first, it disables all the\nWindows Defender modules through the PowerShell cmdlet `Set-MpPreference . It then`\nadds exclusions, such as `regsvr32,` `*.exe,` `*.dll, with the cmdlet` `Add-`\n```\nMpPreference to hide all the components of the malware from Windows Defender.\n\n```\nAt this point the fourth stage dropper is downloaded from the URL\n```\nhxxps://pornofilmspremium.com/tim.EXE and saved as tim.exe . The execution of\ntim.exe is done through the LOLBAS command explorer.exe tim.exe . This allows\n\n```\nthe attacker to break the parent/child correlation often used by EDRs for detection.\n\nThe first part of the attack chain\nThe `tim.exe binary is a backdoored version of the Windows utility` `wextract.exe. This`\nbackdoored version contains extra embedded resources with names like “RUNPROGRAM”,\n“REBOOT”, and “POSTRUNPROGRAM”, among others.\n\n\n-----\n\nResources embedded in the `tim.exe binary (left) and legit` `wextract.exe (right)`\nThis backdoored version contains additional code for creating a new malicious batch file with\nthe name `tim.bat . It is placed in a temporary directory retrieved with the Win32 function`\n```\nGetTempPath() . It retrieves the content of the resource “RUNPROGRAM” (containing the\n\n```\nstring value `cmd /c tim.bat ) and uses it as the command line parameter for the`\n```\nCreateProcess() Win32 function.\n\n```\nThe `tim.bat file is a very short script that downloads the final ZLoader DLL payload with`\nthe name `tim.dll from the URL` `hxxps://pornofilmspremium.com/tim.dll and`\n[executes it through the LOLBAS command](https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/) `regsvr32 tim.dll . This allows the attackers`\nto proxy the execution of the DLL through a signed binary by Microsoft.\n\nThis dropper downloads the script `nsudo.bat from`\n```\nhxxps://pornofilmspremium.com/nsudo.bat and runs asynchronously in parallel with\n\n```\nthe execution of `tim.dll . The script aims to further impair defenses of the machine.`\n\n## Privilege Escalation and Defense Evasion\n\nThe `nsudo.bat script performs multiple operations with the goal of elevating privileges on`\nthe system and impairing defenses.\n\n\n-----\n\nAt first, it checks if the current context of execution is privileged by verifying the access to the\nSYSTEM hive. This is done through `%SYSTEMROOT%\\system32\\cacls.exe`\n```\n%SYSTEMROOT%\\system32\\config\\system . If the process in which it runs has no access on\n\n```\nthat hive it will jump to the label `:UACPrompt .`\n\nThis part of the script implements an auto elevation VBScript that aims to run an elevated\nprocess in order to make system changes. The snippet of the script in charge of the\nUACPrompt feature is as follows:\n```\n:UACPrompt\n   echo Set UAC = CreateObject^(\"Shell.Application\"^) > \"%temp%\\getadmin.vbs\"\n   set params = %*:\"=\"\n   echo UAC.ShellExecute \"cmd.exe\", \"/c %~s0 %params%\", \"\", \"runas\", 1 >>\n\"%temp%\\getadmin.vbs\"\n     \"%temp%\\getadmin.vbs\"\n   del \"%temp%\\getadmin.vbs\"\n   exit /B\n\n```\nThis snippet creates the VBScript `getadmin.vbs, runs it and deletes it. Using a VBScript`\neases the interaction with COM objects. In this case, it instantiates a `Shell.Application`\nobject and calls the function `ShellExecute() to trigger the UAC elevation and the`\ninteraction with the AppInfo service.\n\nOnce the elevation occurs the script is run with elevated privileges. At this point, the script\nperforms the steps to disable Windows Defender. It does this through a software utility called\n[NSudo renamed as](https://nsudo.m2team.org/en-us/) `javase.exe, which is downloaded from the URL`\n```\nhxxps://pornofilmspremium.com/javase.exe . The attacker leverages this utility in\n\n```\n[order to spawn a process with “TrustedInstaller” privileges. This can be abused by the](https://bugs.chromium.org/p/project-zero/issues/detail?id=997)\nattacker to disable the Windows Defender service even if it runs as a Protected Process\nLight.\n\nThe script downloads the file `autorun100.bat from and places it in the startup folder`\n```\n%USERPROFILE%\\AppData\\Roaming\\Microsoft\\Windows\\Start\nMenu\\Programs\\Startup . This script ensures that the WinDefend service is deleted at the\n\n```\nnext boot through the utility `NSudo .`\n\nThe `nsudo.bat script also completely disables UAC by setting the following registry key to`\n0:\n```\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\System\\EnableLUA\n\n```\nIn order to have these changes take effect, the computer is forced to restart. The\n```\nnsudo.bat script does this with shutdown.exe /r /f /t 00 . At this point, the attack\n\n```\nchain of the script `nsudo.bat is complete.`\n\n## ZLoader Payload Execution Chain\n\n\n-----\n\nThe `tim.dll is the main ZLoader payload that encapsulates the unpacking logic and adds`\npersistence. It is executed through the system signed binary `regsvr32.exe .`\n\nIt first creates a directory with a random name inside `%APPDATA% and then creates a copy`\nof itself in the newly created directory. It then adds a new registry key in\n```\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run . The registry\n\n```\nkey value contains the command line of the malicious process to spawn on user logon. This\nensures that the attacker’s implant survives machine reboots. The DLL execution also relies\non the `regsvr32 binary. This is an example of the registry key created on a single run of`\nthe sample:\n```\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Iwalcacvalue:\nregsvr32.exe /s C:\\Users\\[REDACTED]\\AppData\\Roaming\\Kyubt\\otcyovw.dll\n\n```\nThen it starts the unpacking by leveraging a process injection technique known as Thread\nHijacking. It contains a small variation but essentially uses the same pattern of Win32 API\ncalls used for Thread Hijacking:\n```\nVirtualAllocEx() -> WriteProcessMemory() -> GetThreadContext() -> SetThreadContext()\n-> ResumeThread()\n\n```\nIt first creates a new process as a host for the unpacked DLL, and for this sample it uses a\nnew instance of `msiexec.exe . Then it allocates and writes 2 RWX memory regions inside`\nthe target process. One contains the unpacked version of the DLL XOR’ed with a key; the\nsecond, contains some shellcode to decrypt the DLL and jump to the entry point.\n\nThe unpacking routine\nOnce the memory is written in the remote process it sets the new thread context EIP to point\nto the unpacking routine shellcode and resumes the main thread of `msiexec . This is how`\nthe hijacking of the main thread occurs. The unpacked DLL is extracted from the memory of\n```\nmsiexec.exe process by dumping the memory address used in the first\nWriteProcessMemory() call.\n\n```\nWe have compared the unpacked DLL with the recent ZLoader payloads and found a\nsimilarity score of 92.62%.\n\n\n-----\n\nFinal part of the attack chain\n\n## Analyzing The New Zloader C2 Infrastructure\n\nThe analyzed sample belongs to the ‘Tim’ Botnet as defined in the malware configuration.\nSome of the embedded C2s (the full list can be found in the IoC section of the full report) are\n[also shared by the googleaktualizacija ZLoader botnet.](https://tria.ge/210316-7wv57c1c4n)\n\nOne of the C2s dumped from the infected machine, `mjwougyhwlgewbajxbnn[.]com, used`\nto resolve to `194.58.108[.]89 until the 25th of August 2021. As of the 26th of August,`\nhowever, it points to `195.24.66[.]70 .`\n\nThe IP `194.58.108[.]89 belongs to ASN 48287 – RU-CENTER and seems to deploy`\nmany different domains – 350 at the time of writing – forming the new ZLoader infrastructure.\nSome domains implement the `gate.php component, which is a fingerprint of the ZLoader`\nbotnet. We noticed during our investigation that all the domains were registered from April to\nAug 2021, and they switched to the new IP ( 195.24.66[.]70 ) on the 26th of August.\n\n## A Targeted Campaign: AU And DE Financial Institutions\n\nThe new ZLoader campaign is targeted. The final payload has a list of embedded AU and\nDE domains, and contains some strings with wildcards used by the malware to intercept\nspecific users’ web requests to bank portals.\n\n\n-----\n\n```\n@https:// commerzbank.de \n@https://*.de/*/entry*\n@https://*.de/banking-*/portal?*\n@https://*.de/banking-*/portal;*\n@https://*.de/portal/portal*\n@https://*.de/privatkunden/*\n@https://*.de*abmelden*\n@https://*.de/de/home*\n@https://*.de/en/home*\n@https://*.de/fi/home*\n@https://*banking.sparda.de*\n@https://*banking.sparda-*\n@https://*banking.sparda.de/wps/loggedout.jsp\n@https://*meine.deutsche-bank.de/trxm/db*\n@https://*banking.berliner-bank.de/trxm*\n@https://*meine.norisbank.de/trxm/noris*\n@https://*targobank.de*\n@https://banking4.anz.com/IBAU/BANKAWAY*\n@https://banking.westpac.com.au/*\n@https://www1.my.commbank.com.au/netbank/Portfolio/Home/*\n@https://ibanking.stgeorge.com.au/ibank/*\n@https://ibanking.banksa.com.au/ibank/*\n@https://ibanking.bankofmelbourne.com.au/ibank/*\n@https://online.macquarie.com.au/*\n@https://ob.cua.com.au/ib/*\n@https://banking.bendigobank.com.au/banking*\n@https://internetbanking.suncorpbank.com.au/*\n@https://www.ing.com.au/securebanking/*\n@https://ib.nab.com.au/*\n@https://online.beyondbank.com.au/*\n@https://ib.greater.com.au*\n@www.independentreserve.com*\n@www.coinspot.com.au*\n@https://auth.btcmarkets.net/*\n\n```\nFrom our analysis of the communication patterns related to `mjwougyhwlgewbajxbn[.]com,`\nwe were able to map most of the source traffic used by the operators of the botnet.\n\nThe `pornofilmspremium[.]com domain delivers the` `tim.exe component. The domain`\nwas registered on 2021-07-19 (Location RU, ASN: REG RU 197695) and is associated by\n[the community with ZLoader [1,](https://urlhaus.abuse.ch/host/pornotublovers.com/) [2]. The email address](https://otx.alienvault.com/pulse/6114e84021bab5e48dd64903) `[email protected][.]com was`\nused to register this domain and a number of others, as detailed in the full report.\n\n## Conclusion\n\nThe attack chain analyzed in this research shows how the complexity of the attack has\ngrown in order to reach a higher level of stealthiness. The first stage dropper has been\nchanged from the classic malicious document to a stealthy, signed MSI payload. It uses\nbackdoored binaries and a series of LOLBAS to impair defenses and proxy the execution of\ntheir payloads.\n\n\n-----\n\nThis is the first time we have observed this attack chain in a ZLoader campaign. At the time\nof writing, we have no evidence that the delivery chain has been implemented by a specific\naffiliate or if it was provided by the main operator. SentinelLabs continues to monitor this\nthreat in order to track further activity.\n\n## Indicators of Compromise\n\nFor a full list of IoCS see the full report.\n\n## Read the Full Report\n\n[Read the Full Report](https://assets.sentinelone.com/sentinellabs/SentinelLabs-Zloader)\n\nWe thank Awais Munir for his assistance in the technical analysis of the Zloader campaign.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-13 - Hide and Seek - New Zloader Infection Chain Comes With Improved Stealth and Evasion Mechanisms.pdf"
    ],
    "report_names": [
        "2021-09-13 - Hide and Seek - New Zloader Infection Chain Comes With Improved Stealth and Evasion Mechanisms.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535987,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653759542,
    "ts_modification_date": 1653759542,
    "files": {
        "pdf": "https://archive.orkl.eu/431f64129424ed5e8029481c098d732257c20d0d.pdf",
        "text": "https://archive.orkl.eu/431f64129424ed5e8029481c098d732257c20d0d.txt",
        "img": "https://archive.orkl.eu/431f64129424ed5e8029481c098d732257c20d0d.jpg"
    }
}