{
    "id": "7ecf3939-fff4-47c6-82e7-d6301655eee3",
    "created_at": "2023-01-12T15:05:00.011884Z",
    "updated_at": "2025-03-27T02:05:59.372853Z",
    "deleted_at": null,
    "sha1_hash": "2371954571038bf69a0d8603c0588f372383b11e",
    "title": "2020-12-16 - Adversary Playbook- JavaScript RAT Looking for that Government Cheese",
    "authors": "",
    "file_creation_date": "2022-05-28T02:16:44Z",
    "file_modification_date": "2022-05-28T02:16:44Z",
    "file_size": 433947,
    "plain_text": "# Adversary Playbook: JavaScript RAT Looking for that Government Cheese\n\n**[fortinet.com/blog/threat-research/adversary-playbook-javascript-rat-looking-for-that-government-cheese](https://www.fortinet.com/blog/threat-research/adversary-playbook-javascript-rat-looking-for-that-government-cheese)**\n\nDecember 16, 2020\n\n**An Adversary Playbook by FortiGuard Labs**\n\n_Adversary Playbooks provide detailed threat research on specific malicious campaigns or_\n_threat actors so organizations may better understand the threats they face and align their_\n_defenses accordingly._\n\n## Introduction\n\n[FortiGuards Labs recently discovered a malicious campaign targeting verticals in the](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)\ngovernmental monetary and financial sectors in Asia. This campaign poses as a central bank\nof an Asian nation to compel a victim to open a compressed attachment containing a malicious\n\n\n-----\n\nHTA file. Once the HTA file is executed, it contains heavily obfuscated JavaScript that\nultimately installs and runs a remote access trojan or RAT. What makes this unique from other\nattacks in this space is that it utilizes JsOutProx.\n\nThe attacker has also been careful to ensure that the campaign goes undiscovered. This\nplaybook highlights the observed campaigns, the attack infrastructure, as well as provide new\nupdates about this unique threat.\n\n## Background\n\nThe world continues to shift towards working from home, with the pandemic accelerating this\nshift. As a result, hybrid communications between corporate and home environments have\nseen an uptick, becoming the norm for many organizations. Before the pandemic, it was\nestimated that 3 percent of the United States workforce was working from home. That number\nis now forecast to be around 30 percent after 2021.i\n\nBecause of this radical shift, attackers now have a greater attack surface to target than ever\nbefore, including remote workers, personal devices, and home networks. Naturally, this\nincludes the use of email, via spearphishing attacks. Scouring our feeds, were able to locate\nan interesting spearphishing attack and decided to investigate further, eventually leading us to\nidentify a newly updated JsOutProx campaign.\n\nJsOutProx is a fully functional JavaScript remote access trojan (RAT) first discovered in\nDecember of 2019. The tactics, techniques, and procedures (TTPS) of the attackers behind\nJsOutprox indicate that these are experienced and sophisticated threat actors. Such indicators\ninclude the time and effort the attackers have taken to create this RAT, as well as regular\nupdates that have made it more powerful. The actors also use specially-crafted social\nengineering campaigns that leverage specific technical jargon unique to the verticals being\ntargeted in their spearphishing efforts.\n\nJsOutProx also incorporates heavily obfuscated code and the use of Powershell to further\nalong their endeavours. This playbook highlights updates not noted elsewhere for this\nrelatively new malware family, as well as obeservations from FortiGuard Labs on the reuse of\nthe infrastructure in other historical campaigns.\n\nNot much is known of JsOutProx campaigns as occurrences of this family have been few and\nfar between. First discovered by the YOROI team in [December 2019, this malware family](https://yoroi.company/research/unveiling-jsoutprox-a-new-enterprise-grade-implant/)\n[again resurfaced in another campaign spotted by the ZScaler team in May 2020. ZScaler](https://www.zscaler.com/blogs/research/targeted-attacks-indian-government-and-financial-institutions-using-jsoutprox-rat)\nobserved that JsOutProx was infecting both governmental and financial institutions in India.\nBased on our findings, this latest run follows the same exact model.\n\nThe names of the files containing malicious content attached to this most recent spearphishing\ncampaign are called:\n\n\n-----\n\n_Pilipina_Anti-Money_Laundering_Council_Resolution_pdf.hta_\nSHA256 – [c10ea9b5aade9e98b7c87a6926fed6356d903440a17590c519aec7a54e1e5165]\n\n_Information_on_Compliance_officer_xlsx.hta_\nSHA256 - [f1027d6f01718030a66872a82134418984c2de82e1aff32cb7cc106bf8d3375a]\n\nThe first file was sent to users in the Philippines working in the finance sector. It is specific to\nanti-money laundering and countermeasures. This is consistent with a similar campaign we\nfound that used a forged email claiming to originate from an Asian government that offered\ntraining in this specific vertical as well.\n\n## Why is this important?\n\nRATs are usually portable executable (PE) files. JavaScript RATs are not common, mostly\nbecause JavaScript simply does not offer as much flexibility as a PE file does. However, as\nJavaScript is used by many websites, it appears to most users as benign, as individuals with\nbasic security knowledge are taught to avoid opening attachments that end in .exe. Also,\nbecause JavaScript code can be obfuscated, it easily bypasses antivirus detection, allowing it\nto filter through undetected.\n\nThe attackers in this case are most likely familiar with their targets. You can see this in the\nfindings reported by YOROI (including the capability to intercept the one time password (OTP)\ntoken of a well known security vendor), the specially crafted emails from the Indian campaign\nobserved by Zscaler, and from the usage of terms specific to a niche sector (Anti Money\nLaundering/FINTECH). At the very least, they’ve done their homework. They are not blindly\nsending emails to random organizations but have taken the time to hone their spearphishing\nefforts to compel unsuspecting victims into opening the malicious attachment.\n\nIn this playbook, we will present our findings on not only the latest campaigns, but also newly\ndiscovered updates made to JsOutProx and its infrastructure. For a list of detailed indicators of\n[compromise, please visit our Playbook Viewer.](https://www.fortiguard.com/playbook_viewer)\n\n## Technical Details\n\nIn this latest example, the attackers are using an Asian government entity as a lure for their\nspearphishing tactics. It appears that the attackers are able to bypass spam filters by spoofing\nthe email headers. A cursory analysis of the domains indicate that they originated from a wellknown webhosting company with a large subnet. Investigating the headers, we see the\nattackers are utilizing the SMTP service of the webhosting company.\n\nFigure 1. Spearphishing email\n\nIn keeping with their previous government and financial themes, this email was allegedly sent\nfrom the central bank of a country in Asia. The appeal of the email’s request for information\nrelies on the fact that with more people coming back to work, it is not unheard of to want more\n\n\n-----\n\ninformation about prospective employees and employee training. At the very least, the email\nappears to have been custom-tailored to increase the effectiveness of this attack—not just in a\ntechnical sense, but also with the verbiage used in the spearphishing email. It contains terms,\nsuch as AML/CFT, which is the abbreviation for Anti Money Laundering/Countering Financial\nTerrorism that would be familiar to receipients.ii\n\nThe attached archive contains the following Microsoft .HTA file:\n\n_Information_on_Compliance_officer_xlsx.hta_\nSHA256 - [f1027d6f01718030a66872a82134418984c2de82e1aff32cb7cc106bf8d3375a]\n\nOnce run, it communicates with the following command and control server using dynamic DNS\n(DDNS):\n\nhxxp://myabiggeojs.myftp[.]biz:9895\n185.195.79[.]210\n\nIt then launches the malicious JsOutProx JavaScript, which is a fully developed and functional\nremote access trojan (RAT).\n\n## Variations on a Theme\n\nThis next section provides an analysis of the changes to JsOutProx that we have observed in\nthis latest version versus the December and May variants. JsOutProx’s encoding and\nencryption routines largely remain similar to past variants.\n\nFigure 2. Obfuscation contains 5,000 lines\n\nThe attackers went to great lengths to make sure that their tradecraft would not be easily\nunderstood. For example, we observed that the sample has over 5000 lines of obfuscated\ncode. Because of this, FortiGuard Labs had to develop a custom tool to de-obfuscate the\nJavaScript to help us analyze the file, which saved us a great amount of time.\n\nFor example, when we ran our tool against the following sample\n\n_Information_on_Compliance_officer_xlsx.hta_\n\nSHA256 - [f1027d6f01718030a66872a82134418984c2de82e1aff32cb7cc106bf8d3375a]\n\nit took over five hours to de-obfuscate and provide us with human readable strings for later\nanalysis.\n\nStandard JavaScript engines and emulators may not necessarily be able to display the\nrelevant strings. A decryptor must be used to figure out what this threat does. Depending on\nresources, it may take several hours to decrypt the script. In the end, however, it becomes\nmore readable.\n\nFigure 3. Connecting to C2 along with hiding window size to 0x0\n\n\n-----\n\nOne of the first things we noticed is that this RAT can be executed both as a JavaScript file on\nthe command line, or as a .HTA file inside a window (in this case, inside mshta.exe). If it is\ninside a window, the threat tries to hide the window by resizing it to a height of zero pixels and\na width of 0 pixels. Moreover, it gets moved to outside of the user’s viewable desktop for\nfurther evasion.\n\n### New Additions to JsOutProx\n\nLooking at the capabilities of this RAT, we see that it supports several commands. Newer\ncommands have been highlighted in GREEN and commands that have been deprecated are\nhighlighted in RED.\n\nCommand Action\n\nupd Update the implant\n\nrmz Set zone identifier\n\nrst Restart the implant\n\nl32 Start another process with the same script\n\nl64 Start another process with the same script\n\ndcn Kill the implant\n\nrbt Reboot the machine\n\nshd Shutdown the machine\n\nlgf Log off\n\nejs Evaluate Javascript code\n\nepg ??\n\nevb Execute VisualBasic code\n\nidn ??\n\n\n-----\n\nsdn Load a .NET dll\n\nuis Uninstall the implant\n\nins Install the implant\n\nint.g Send the sleep time to C2\n\nint.s Update the sleep time\n\nFigure 4. Table of changes.\n\nThis new version accepts a new command called ‘rmz’ that modifies the zone identifier\ncontained in the alternate data stream of downloaded files.\n\nFigure 5.\n\nThe malware may have had issues in the past with executing downloaded files. This newly\nadded functionality helps fix that problem by attempting to move the downloaded files across\ndifferent security zones.\n\nJsOutProx can also use plugins. This allows the threat to be more modular and easier to\nupdate and maintain. Once again, new plugin commands are in GREEN while the deprecated\nplugin commands are in RED.\n\nCommand Plugin\n\npr ProcessPlugin\n\ncl ClipboardPlugin\n\nfi FilePlugin\n\nlb LibraryPlugin\n\ndo DownloadPlugin\n\nsc ScreenPlugin\n\n\n-----\n\naut LogPlugin\n\ncm CommandPlugin\n\ndn DownloaderPlugin\n\nfm FilemanagerPlugin\n\nst StartupPlugin\n\nou OutlookPlugin\n\npx ProxyPlugin\n\nsp ScreenPShellPlugin\n\ncn ShellPlugin\n\ntk TokensPlugin\n\nIn InfoPlugin\n\nds DnsPlugin\n\npm PromptPlugin\n\nln.t Exit execution\n\nLn.rst Restart execution\n\nFigure 6. Table of plugins\n\nLooking at the two previous tables, several commands and plugins have been removed. While\nthis may initially indicate that the malware is less powerful, the addition of the PowerShell\nplugin actually makes the malware more extensible, requires less overhead to maintain, and\nenables it to remain under the radar – aka “living off the land.” The following screenshot\ndisplays some of the capabilities of this new plugin:\n\n\n-----\n\nFigure 7. New capabilities added that allow for remote control/monitoring\n\nIts ’capture’ function can take a screenshot of the user’s desktop in order to monitor what the\nuser is seeing. The plugin also allows the attacker to operate the infected machine using a\nvirtual keyboard and mouse. Previously, attackers could execute shell commands and file\nmanager functionality such as copy and execute. With this new plugin however, the attacker is\nvirtually sitting in front of the infected machine. Interestingly enough, the screenshell plugin\nalso lumps in the option to execute either .HTA files or java (.jar) files, as seen in the\nscreenshot below.\n\nFigure 8. Ability to execute either HTA or Jar files\n\n## Connecting the Dots - JsOutProx Infrastructure – Same IP addresses, Different DDNS Domains\n\n**Example #1**\n\nThe following sample\n\nPilipina_Anti-Money_Laundering_Council_Resolution_pdf.hta\n\n[[SHA256- c10ea9b5aade9e98b7c87a6926fed6356d903440a17590c519aec7a54e1e5165]](https://hybrid-analysis.com/search?query=context:c10ea9b5aade9e98b7c87a6926fed6356d903440a17590c519aec7a54e1e5165&block_redirect=1)\n\n[was calling back to a C2 server at: hxxp://afghphae.gotdns[.]ch:9060 (185.19.85[.]156).](https://otx.alienvault.com/indicator/url/http:%2F%2F185.19.85.156)\nHistorical DNS queries for this IP address yield two additional DDNS C2 servers that resolve to\nthe same IP address at:\n\nhxxp://dirhaeednotrtup.hopto[.]org:9097\n\nhxxp://martinluther[.]tk\n\nhxxp://bushaka009.duckdns[.]org\n\nAssociated file:\n\n\nDomain/Port of File\nAnalyzed\n\n\nIP Other Domains Discovered\nSharing Same IP address\n\n\nFile Type\n\n\nafghphae.gotdns[.]ch:9060 185.19.85[.]156 dirhaeednotrtup.hopto[.]org:9097 JSOutProx\n\n“” bushaka009.duckdns[.]org JSOutProx\nand\nOthers\n\n“” Martinluther[.]tk None\nObserved\n\n\n-----\n\nFigure 9. Domains resolving to 185.19.85[.]156\n\nFurther investigation into this domain [dirhaeednotrtup.hopto[.]org:9097] yielded no results.\nThe domain martinluther[.]tk doesn’t have a historical DNS entry, nor is any of the malware\nbeing run associated with it that we can see.\n\n_[On a side note of interest, the Dot TK domain extension can be registered free of charge,_\n_[making it a favorite of phishers and attackers alike. Please reference our blog from 2019 that](https://www.fortinet.com/blog/threat-research/tracking-down-big-phish)_\n_highlights our findings on the abuse of these free services.]_\n\nHowever, as we dug deeper into our passive DNS records for the third DDNS domain\n\n[bushaka009.duckdns[.]org], we discovered a completely different campaign altogether, one\nthat was leveraging multiple samples utilizing shipment schemes and leveraging the likeness\nof an international shipping company. Campaigns began originating from this DDNS domain as\nearly as June 2020, with the last one seen in August. In the June campaigns, we saw that the\nattackers used the same infrastructure to distribute the Netwire RAT:\n\nDocument Second Page.exe\nSHA256\n\n[F17B89058372618DB540C2A8D16A13F59F21C88E21B651D196556207AB54E10C\n\nIn July, the following sample\n\nDhl Shipment Receipt.exe\nSHA256 [43192b0a36d887844309b79dafa88bb2493539093d17bf7296e4bda2fe72dc49]\n\ncommunicated with 185.19.85[.]156 under the same bushaka009.duckdns[.]org using the\nFormbook malware.\n\nAn expansion of this domain led us to this:\n\nFigure 10. Malware related to bushaka009.duckdns[.]org\n\nOur findings revealed 34 recent samples, from July to August of this year, which indicates that\nthis is a recent campaign. Our analysis revealed a variety of malware families being used,\nsuch as Netwire, Remcos, Formbook, and other backdoors—all pointing to the same domain\nbut resolving to different IP addresses at the same time.\n\n### Activity of [185.19.85[.]156] spans more than five years\n\nBecause of the multitude of samples and dynamic DNS domains tied to this one specific IP\naddress [185.19.85[.]156], and to further satisfy our curiousity, we decided to investigate. As\nthreat researchers, it is not unusual to research an attacker infrastructure to deduce any\npossible correlation to previous attacks. This can be a time consuming and exhausting\nprocess, because there are a lot of data points to pivot off of. Sometimes we come to a dead\nend as well. However, we sometimes find items of interest that help “paint a picture” that\n\n\n-----\n\nidentify previous campaigns likely conducted by the same threat actor. Ultimately, this helps\nprovide historical insight into the attackers’ TTPs, or identify a webhosting company allowing\nthis activity to occur for years on end, thereby enabling multiple attackers without any\nrepercussion.\n\nDespite being a recently discovered campaign, our further research in this case revealed that\nthe infrastructure used by the attacker, [185.19.85[.]156], has been in operation for over five\n[years (as noted in this Dynamoo Blog.) We don’t know if this is the same group or if it is simply](https://blog.dynamoo.com/search?q=185.19.85.156)\na bulletproof host catering to threat actors. The usage of RATs, the same DDNS services, and\nthe same IP address 185.19.85[.]156 may be merely coincidental, but it raises some\nsuspicion.\n\nRegardless of whether there is an actual connection, one assumption can be made: Based on\nthe specific language contained in the spearphishing attacks, the infrastructure used, and the\ntechniques seen in the evolving malware, this JsOutProx campaign is not your run-of-the-mill\ncybercrime operation. It is highly sophisticated, and notably, one that has significant resources\navailable.\n\n**Example #2**\n\nFindings for this DDNS Domain were limited to the HTA files of JSOutProx and nothing else.\nWe discovered during passive DNS analysis from our own Central Threat System (CTS) that\nthe [185.195.79[.]210] IP address is shared between the two DDNS domains shown in the\ntable below.\n\nAssociated Files:\n\nSHA256: [f1027d6f01718030a66872a82134418984c2de82e1aff32cb7cc106bf8d3375a]\nSHA256:\n\n[8609210993F4EBC6AA5332B0E5EBE67720B8721E27FCEE79FC82A1C40B587A44]\n\n\nDomain/Port IP Other Domains Discovered\nSharing Same IP address\n\n\nFile Type\n\n\nmyabiggeojs.myftp[.]biz:9895\n\n\n185.195.79[.]210\n\n[Turkey]\n\n\npanarmjsdrew.gotdns[.]ch:9089 JSOutProx\n\nJSOutProx\n\n\n“” 151.106.60[.]163\n\n[France]\n\nFigure 11. Domains resolving to 185.195.79[.]210\n\n\n-----\n\nFurther analysis identified another JSOutProx campaign that followedthe same financial\nnaming convention from August:\n\n_EASTERN-EX_Coverfund_Position-2020_xls.7z_\n\nSHA256:\n\n[8609210993F4EBC6AA5332B0E5EBE67720B8721E27FCEE79FC82A1C40B587A44]\n\nOther than this, no other historical campaigns nor historical data could be found for either the\ndomain or IP address used in this attack. It could be surmised that the attacker may be\nswitching back and forth between hosts and DDNS aliases to thwart further analysis.\nRegarding the 151.106.60[.]163 IP address, only myabiggeojs.myftp[.]biz:9895 URLs were\nassociated.\n\nFigure 12. Domains resolving to 151.106.60[.]163\n\n**Example #3**\n\nNo other historical campaigns nor historical data could be found for either the domain or IP\naddress used in this attack. It could be surmised that the attacker may switch back and forth\nbetween hosts and DDNS aliases to thwart analysis.\n\nAssociated File:\n\nSHA256 [03a80ceb3959f26b193175fc005bf418c4dc47b1e8d725e63a17a1418774b4b9]\n\n\nDomain/Port IP Other Domains Discovered\nSharing Same IP address\n\n\nFile Type\n\n\nposssdhm.ddns[.]net:9060 151.106.14[.]155 N/A jSOutProx\n\n## Indicators of Compromise\n\nf1027d6f01718030a66872a82134418984c2de82e1aff32cb7cc106bf8d3375a\n\nC2:hxxp://myabiggeojs.myftp[.]biz:9895/\n\nDetected as: JS/Agent.VAC!tr\n\n03a80ceb3959f26b193175fc005bf418c4dc47b1e8d725e63a17a1418774b4b9\n\nC2: hxxp://posssdhm.ddns[.]net:9060/\n\nDetected as: JS/Agent.VAC!tr.dldr\n\n\n-----\n\nc10ea9b5aade9e98b7c87a6926fed6356d903440a17590c519aec7a54e1e5165\n\nC2: hxxp://afghphae.gotdns[.]ch:9060/\n\nDetected as: JS/Agent.VAC!tr\n\n8609210993F4EBC6AA5332B0E5EBE67720B8721E27FCEE79FC82A1C40B587A44\n\nC2: hxxp://panarmjsdrew.gotdns[.]ch\n\nDetected as: JS/Agent.VAC!tr\n\n## MITRE ATT&CK\n\nInitial Access\n\nT1566.001: Spearphishing attachment\n\nExecution\n\nT1059.001: Powershell\nT1059.003: Windows command Shell\nT1059.005: Visual Basic\nT1059.007: JavaScript\n\nPersistence\n\nT1547.001: Registry Run Keys / Startup Folder\nT1564.003: Hidden Window\n\nDefense Evasion\n\nT1202: Indirect Command Execution\nT1027: Obfuscated Files or Information\n\nDiscovery\n\nT1082: System Information Discovery\n\nCollection\n\nT1113: Screen Capture\n\nCommand and Control\n\nT1571: Non-Standard Port\n\nImpact\n\n\n-----\n\nT1529: System Shutdown/Reboot\n\n**Additional JSOutProx files**\n\n83f2a34784c9c9abc2009b829e8345afb081817675bd0eb2799d2205d5ef69f9\n\nbbd835c18f2a5eb7a9c9eb967c9aab0c2eee67b03745a07c5cfa11ce272a559a\n\n3ad0b6e98e4415d7d4b319367aaee0930fbb8ef4f3dc8c29e93df3b906654b30\n\n6bf0d9a7ca91f27a708c793832b0c7b6e3bc4c3b511e8b30e3d1ca2e3e2b90a7\n\n7dd2d20bd40f45ecd74fef1c9238cdf3c9f446414fc82456d73f3148252adbd5\n\ne94521788a9b229dc9f583cc6ab2514b2cbe4acbee7a282d6167c1ce45416de3\n\n577a6b1294ec1386fd5d9058ad35296bfd74cd51ab8c1bd8f0b625bbb356f8d0\n\n92c02aa8d666c7b65f1cbb6c801f89bd47088129e899b352737258af28db0dba\n\nf7221949476533af9afe7b190db47697174cabc9af18c278022396e83e7b75cb\n\n0398d1b44bc8be3b56a1bb78c580e6eeee96464992b48599fceebd4d39321a57\n\n8da0526fe5cff2c56be399b9bef560fec6160d8ce0dd7c8517054198c73e6788\n\n96168c26e4c0ec1d84cdb2b912dadabdf2bb73ec14d758cc8a29fb39321b8bd6\n\n891211a8dffa0a4b0147b9c1572916108cb8aa1d6055aa1164f16cc42a3e2c0c\n\n64b402cbe3a2ae21ce2bfcf70acf927db714f5ae4eb3ba0ffb73455b731e6a50\n\ne9d605f9627072eee555b07e3c7797c4d61ded20c7292432565c098f183be9d2\n\ndec809c248f4610bae9d577c23279ffa5e95bdb8612fe941aac60fc1e699343b\n\na1ca1638f3d760789231fc1b567824485b40f4101d6ee9ad4208308d166b87bd\n\n\n-----\n\nefd97b1038e063779fb32a3ab35adc481679a5c6c8e3f4f69c44987ff08b6ea4\n\nfdc61d1ae7f5e53fb4710910bae574a992419e27329693d69236ec1704ac66a4\n\n169c13fd68f9d1b86d77a0e2865050a8eed8bdb9420c3c65ff4cd29574db3217\n\n8609210993f4ebc6aa5332b0e5ebe67720b8721e27fcee79fc82a1c40b587a44\n\ncd16052de2b6f37853935bad389f6018f9106aec873da0e7a2a92da8eb953fd8\n\n698ced4170469c3084afbb0e21778477360d2ac10fb93b33ee3011870c7ca089\n\n**Other Associated Files and Campaigns Related to Threat Actor (Netwire, Tesla,**\n**etc.) 185.19.85[.]156**\n\n34b2b2c0187ebc29239578d78f062d8ebd9aab4bede9c9b6dee323653d2b058c\n\n886fe15d546c595be2e130d98d33ee777d550af69f1def97fedbfae49e3a637e\n\n2ad94746fa52471bd0008285f2d03aab5afa2a8a75ee986ad4ec650aad43730c\n\n84ae04513a1e01e60dbc814cbd483ec397c9dba78cc5ba79a8e234ecc04b0ac3\n\na68fe77207210679a5129b17b797d06fc4d75d6ecac0711e67abcaf18ed42275\n\na22c763f9e222a8e039d39262f6ff30cce934c1181b0c1be9376b4f5f912e96a\n\n2cb5514d1720a32caa239e91ab6a7a3009a78fb1ce30246186ab6ec6e014041e\n\n75e0d9f86c4ebea64bc842bb5f87164372c4b2996680fde42d5113ebbbbae3ff\n\n459d04d2a7cb3399486dbe8095dac1f1e8132d514e4be631c3151f61e0d13506\n\nb9bb827450cf3233c89ef3cc8ee38824faec9afb1fe1f5c2ab0f1738e0e844d1\n\na72617c88b295c70ffcd652a569f5dd3b972a13a445936fed92f8d8eb018958a\n\n\n-----\n\n9aa914e87dda1c3d1c182ed9c08229d10853a5e29b0795accf2a96abdc5fde88\n\ndf3acaf4dcc70a20c485b492958a9d598f43acb9563e0875d8759de62b268789\n\n2936937ebeead6d1c9b62739331fd975248e2998fcf13c94ee817bbfe501a64b\n\nec83164a482f5f6c6f98fcc47e489bc4443554253a32ddbd2344b70b09002d1c\n\n531bdc59bdddaf57aa80e2bd2664ee2e6df138a2374519d14d100cab8d21b5c5\n\n4132f329b4cd47f4e4463963c40345f7a7bb04c5cb64887f3d78579028cb1474\n\n750a4be535f1870464548cda125665422d5a52d83953c44942dfe90c5a146ad9\n\n34c6c1a7a765441e5d01ffd8b839bb932fbee37b2d1a55d4cd7e77d61eebad6b\n\n43192b0a36d887844309b79dafa88bb2493539093d17bf7296e4bda2fe72dc49\n\n_[Learn more about FortiGuard Labs threat research and the FortiGuard Security Subscriptions](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)_\n_[and Services portfolio.](https://www.fortinet.com/support/support-services/fortiguard-security-subscriptions?utm_source=blog&utm_campaign=2020-q2-security-subscriptions)_ _[Sign up for the weekly Threat Brief from FortiGuard Labs.](https://secure.fortinet.com/FortiGuard)_\n\n_Learn more about Fortinet’s_ _[free cybersecurity training initiative or about the Fortinet](https://www.fortinet.com/blog/business-and-technology/why-cybersecurity-training-is-more-important-than-ever.html)_ _Network_\n_Security Expert program,_ _[Network Security Academy program, and](https://training.fortinet.com/local/staticpage/view.php?page=fnsa&utm_source=blog&utm_campaign=2019-q3-fnsa)_ _[FortiVet program.](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=2018-q2-fortivet)_\n\n[iWork-At-Home After Covid-19—Our Forecast](https://globalworkplaceanalytics.com/work-at-home-after-covid-19-our-forecast)\n\nhttps://globalworkplaceanalytics.com/work-at-home-after-covid-19-our-forecast\n\n\nii\n\n\n[FinTech AML Compliance Training](https://baselgovernance.org/fintech-aml-compliance-training)\n\n\n[https://baselgovernance.org/fintech-aml-compliance-training](https://baselgovernance.org/fintech-aml-compliance-training)\n\n_This Adversary Playbook from FortiGuard Labs on the threat malware family known as_\n_“JsOutProx” was created for our customers, as well as part of our role in the Cyber Threat_\n_Alliance. For more information regarding this series of adversary playbooks being created by_\n_[CTA members, please visit the Cyber Threat Alliance Playbook Whitepaper.](https://www.cyberthreatalliance.org/wp-content/uploads/2018/04/CTA_Adversary-Playbook-Principles_White-Paper.pdf)_\n_Also_ _[view the FortiGuard Playbook Viewer detailing this campaign as mapped to MITRE’s](https://www.fortiguard.com/playbook_viewer)_\n_Adversarial Tactics, Techniques, & Common Knowledge (ATT&CK) model._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-16 - Adversary Playbook- JavaScript RAT Looking for that Government Cheese.pdf"
    ],
    "report_names": [
        "2020-12-16 - Adversary Playbook- JavaScript RAT Looking for that Government Cheese.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535900,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653704204,
    "ts_modification_date": 1653704204,
    "files": {
        "pdf": "https://archive.orkl.eu/2371954571038bf69a0d8603c0588f372383b11e.pdf",
        "text": "https://archive.orkl.eu/2371954571038bf69a0d8603c0588f372383b11e.txt",
        "img": "https://archive.orkl.eu/2371954571038bf69a0d8603c0588f372383b11e.jpg"
    }
}