{
    "id": "7ed20b90-5ff6-44ff-b4f3-cf17e3f28964",
    "created_at": "2023-01-12T15:07:58.99327Z",
    "updated_at": "2025-03-27T02:17:05.603389Z",
    "deleted_at": null,
    "sha1_hash": "f0b935083dc627651051bca8100db77f77236c63",
    "title": "2017-12-14 - Attackers Deploy New ICS Attack Framework “TRITON” and Cause Operational Disruption to Critical Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-28T03:37:13Z",
    "file_modification_date": "2022-05-28T03:37:13Z",
    "file_size": 118973,
    "plain_text": "# Attackers Deploy New ICS Attack Framework “TRITON” and Cause Operational Disruption to Critical Infrastructure\n\n**[fireeye.com/blog/threat-research/2017/12/attackers-deploy-new-ics-attack-framework-triton.html](https://www.fireeye.com/blog/threat-research/2017/12/attackers-deploy-new-ics-attack-framework-triton.html)**\n\nThreat Research\n\nBlake Johnson, Dan Caban, Marina Krotofil, Dan Scali, Nathan Brubaker, Christopher Glyer\n\nDec 14, 2017\n\n14 mins read\n\nMalware\n\n**Introduction**\n\n[Mandiant recently responded to an incident at a critical infrastructure organization where an](https://www.fireeye.com/advantage)\nattacker deployed malware designed to manipulate industrial safety systems. The targeted\nsystems provided emergency shutdown capability for industrial processes. We assess with\nmoderate confidence that the attacker was developing the capability to cause physical damage\n\n\n-----\n\nand inadvertently shutdown operations. This malware, which we call TRITON, is an attack\nframework built to interact with Triconex Safety Instrumented System (SIS) controllers. We have\nnot attributed the incident to a threat actor, though we believe the activity is consistent with a\nnation state preparing for an attack.\n\nTRITON is one of a limited number of publicly identified malicious software families targeted at\n[industrial control systems (ICS). It follows](https://www.mandiant.com/services/industrial-control-systems-healthcheck) [Stuxnet which was used against Iran in 2010 and](https://www.mandiant.com/resources/fireeye-reveals-rise-in-advanced-threat-activities-by-iranian-linked-ajax-security)\nIndustroyer which we believe was deployed by Sandworm Team against Ukraine in 2016.\nTRITON is consistent with these attacks, in that it could prevent safety mechanisms from\nexecuting their intended function, resulting in a physical consequence.\n\n\n**Malware**\n**Family**\n\n\n**Main Modules** **Description**\n\n\nTRITON trilog.exe Main executable leveraging\nlibraries.zip\n\nlibrary.zip Custom communication library for interaction with\nTriconex controllers.\n\nTable 1: Description of TRITON Malware\n\n**Incident Summary**\n\nThe attacker gained remote access to an SIS engineering workstation and deployed the\nTRITON attack framework to reprogram the SIS controllers. During the incident, some SIS\ncontrollers entered a failed safe state, which automatically shutdown the industrial process and\nprompted the asset owner to initiate an investigation. The investigation found that the SIS\ncontrollers initiated a safe shutdown when application code between redundant processing units\nfailed a validation check -- resulting in an MP diagnostic failure message.\n\nWe assess with moderate confidence that the attacker inadvertently shutdown operations while\ndeveloping the ability to cause physical damage for the following reasons:\n\nModifying the SIS could prevent it from functioning correctly, increasing the likelihood of a\nfailure that would result in physical consequences.\nTRITON was used to modify application memory on SIS controllers in the environment,\nwhich could have led to a failed validation check.\nThe failure occurred during the time period when TRITON was used.\nIt is not likely that existing or external conditions, in isolation, caused a fault during the time\nof the incident.\n\n**Attribution**\n\n\n-----\n\n[FireEye has not connected this activity to any actor we currently track; however, we assess with](https://www.fireeye.com/)\nmoderate confidence that the actor is sponsored by a nation state. The targeting of critical\ninfrastructure as well as the attacker’s persistence, lack of any clear monetary goal and the\ntechnical resources necessary to create the attack framework suggest a well-resourced nation\nstate actor. Specifically, the following facts support this assessment:\n\nThe attacker targeted the SIS suggesting an interest in causing a high-impact attack with\nphysical consequences. This is an attack objective not typically seen from cyber-crime groups.\n\nThe attacker deployed TRITON shortly after gaining access to the SIS system, indicating that\nthey had pre-built and tested the tool which would require access to hardware and software that\nis not widely available. TRITON is also designed to communicate using the proprietary TriStation\nprotocol which is not publicly documented suggesting the adversary independently reverse\nengineered this protocol.\n\nThe targeting of critical infrastructure to disrupt, degrade, or destroy systems is consistent with\nnumerous attack and reconnaissance activities carried out globally by Russian, Iranian, North\nKorean, U.S., and Israeli nation state actors. Intrusions of this nature do not necessarily indicate\nan immediate intent to disrupt targeted systems, and may be preparation for a contingency.\n\n**Background on Process Control and Safety Instrumented Systems**\n\n\n-----\n\nICS Reference Architecture\n\n\nFigure 1:\n\nICS Reference Architecture\nModern industrial process control and automation systems rely on a variety of sophisticated\ncontrol systems and safety functions. These systems and functions are often referred to as\n[Industrial Control Systems (ICS) or Operational Technology (OT).](https://www.fireeye.com/products/industrial-systems-and-critical-infrastructure-security.html)\n\nA Distributed Control System (DCS) provides human operators with the ability to remotely\nmonitor and control an industrial process. It is a computerized control system consisting of\ncomputers, software applications and controllers. An Engineering Workstation is a computer\nused for configuration, maintenance and diagnostics of the control system applications and\nother control system equipment.\n\nA SIS is an autonomous control system that independently monitors the status of the process\nunder control. If the process exceeds the parameters that define a hazardous state, the SIS\nattempts to bring the process back into a safe state or automatically performs a safe shutdown\nof the process. If the SIS and DCS controls fail, the final line of defense is the design of the\n\n\n-----\n\nindustrial facility, which includes mechanical protections on equipment (e.g. rupture discs),\nphysical alarms, emergency response procedures and other mechanisms to mitigate dangerous\nsituations.\n\nAsset owners employ varied approaches to interface their plant's DCS with the SIS. The\ntraditional approach relies on the principles of segregation for both communication\ninfrastructures and control strategies. For at least the past decade, there has been a trend\ntowards integrating DCS and SIS designs for various reasons including lower cost, ease of use,\nand benefits achieved from exchanging information between the DCS and SIS. We believe\nTRITON acutely demonstrates the risk associated with integrated designs that allow bidirectional communication between DCS and SIS network hosts.\n\n**Safety Instrumented Systems Threat Model and Attack Scenarios**\n\n\nTemporal Relationship Between Cyber Security and Safety\n\n\nFigure\n\n\n2: Temporal Relationship Between Cyber Security and Safety\n\n\n-----\n\nThe attack lifecycle for disruptive attacks against ICS is similar to other types of cyber attacks,\nwith a few key distinctions. First, the attacker’s mission is to disrupt an operational process\nrather than steal data. Second, the attacker must have performed OT reconnaissance and have\nsufficient specialized engineering knowledge to understand the industrial process being\ncontrolled and successfully manipulate it.\n\nFigure 2 represents the relationship between cyber security and safety controls in a process\ncontrol environment. Even if cyber security measures fail, safety controls are designed to\nprevent physical damage. To maximize physical impact, a cyber attacker would also need to\nbypass safety controls.\n\nThe SIS threat model below highlights some of the options available to an attacker who has\nsuccessfully compromised an SIS.\n\n_Attack Option 1: Use the SIS to shutdown the process_\n\nThe attacker can reprogram the SIS logic to cause it to trip and shutdown a process that\nis, in actuality, in a safe state. In other words, trigger a false positive.\nImplication: Financial losses due to process downtime and complex plant start up\nprocedure after the shutdown.\n\n_Attack Option 2: Reprogram the SIS to allow an unsafe state_\n\nThe attacker can reprogram the SIS logic to allow unsafe conditions to persist.\nImplication: Increased risk that a hazardous situation will cause physical consequences\n(e.g. impact to equipment, product, environment and human safety) due to a loss of SIS\nfunctionality.\n\n_Attack Option 3: Reprogram the SIS to allow an unsafe state – while using the DCS to create an_\n_unsafe state or hazard_\n\nThe attacker can manipulate the process into an unsafe state from the DCS while\npreventing the SIS from functioning appropriately.\nImplication: Impact to human safety, the environment, or damage to equipment, the extent\nof which depends on the physical constraints of the process and the plant design.\n\n**Analysis of Attacker Intent**\n\nWe assess with moderate confidence that the attacker’s long-term objective was to develop the\ncapability to cause a physical consequence. We base this on the fact that the attacker initially\nobtained a reliable foothold on the DCS and could have developed the capability to manipulate\nthe process or shutdown the plant, but instead proceeded to compromise the SIS system.\nCompromising both the DCS and SIS system would enable the attacker to develop and carry\nout an attack that causes the maximum amount of damage allowed by the physical and\nmechanical safeguards in place.\n\n\n-----\n\nOnce on the SIS network, the attacker used their pre-built TRITON attack framework to interact\nwith the SIS controllers using the TriStation protocol. The attacker could have caused a process\nshutdown by issuing a halt command or intentionally uploading flawed code to the SIS controller\nto cause it to fail. Instead, the attacker made several attempts over a period of time to develop\nand deliver functioning control logic for the SIS controllers in this target environment. While\nthese attempts appear to have failed due one of the attack scripts’ conditional checks, the\nattacker persisted with their efforts. This suggests the attacker was intent on causing a specific\noutcome beyond a process shutdown.\n\nOf note, on several occasions, we have observed evidence of long term intrusions into ICS\nwhich were not ultimately used to disrupt or disable operations. For instance, Russian operators,\nsuch as Sandworm Team, have compromised Western ICS over a multi-year period without\ncausing a disruption.\n\n**Summary of Malware Capabilities**\n\nThe TRITON attack tool was built with a number of features, including the ability to read and\nwrite programs, read and write individual functions and query the state of the SIS controller.\nHowever, only some of these capabilities were leveraged in the trilog.exe sample (e.g. the\nattacker did not leverage all of TRITON’s extensive reconnaissance capabilities).\n\nThe TRITON malware contained the capability to communicate with Triconex SIS controllers\n(e.g. send specific commands such as halt or read its memory content) and remotely reprogram\nthem with an attacker-defined payload. The TRITON sample Mandiant analyzed added an\nattacker-provided program to the execution table of the Triconex controller. This sample left\nlegitimate programs in place, expecting the controller to continue operating without a fault or\nexception. If the controller failed, TRITON would attempt to return it to a running state. If the\ncontroller did not recover within a defined time window, this sample would overwrite the\nmalicious program with invalid data to cover its tracks.\n\n**Recommendations**\n\nAsset owners who wish to defend against the capabilities demonstrated in the incident, should\nconsider the following controls:\n\nWhere technically feasible, segregate safety system networks from process control and\ninformation system networks. Engineering workstations capable of programming SIS\ncontrollers should not be dual-homed to any other DCS process control or information\nsystem network.\nLeverage hardware features that provide for physical control of the ability to program\nsafety controllers. These usually take the form of switches controlled by a physical key. On\nTriconex controllers, keys should not be left in the PROGRAM mode other than during\nscheduled programming events.\nImplement change management procedures for changes to key position. Audit current key\nstate regularly.\n\n\n-----\n\nUse a unidirectional gateway rather than bidirectional network connections for any\napplications that depend on the data provided by the SIS.\nImplement strict access control and application whitelisting on any server or workstation\nendpoints that can reach the SIS system over TCP/IP.\nMonitor ICS network traffic for unexpected communication flows and other anomalous\nactivity.\n\n\nTriconex Key Switch (source)\n\n\nFigure\n\n\n[3: Triconex Key Switch (source)](https://images-na.ssl-images-amazon.com/images/I/41jr93jKzML._SX466_.jpg)\n\n**Appendix: Technical Analysis**\n\n\n-----\n\nTRITON Architecture and Attack Scenario\n\n\nFigure 4:\n\nTRITON Architecture and Attack Scenario\nTRITON was deployed on an SIS engineering workstation running the Microsoft Windows\noperating system. The malware was named to masquerade as the legitimate Triconex Trilog\napplication. This application is used for reviewing logs and is a part of the TriStation application\nsuite. The malware was delivered as a Py2EXE compiled python script dependent on a zip file\ncontaining standard Python libraries, open source libraries, as well as the attacker-developed\nTriconex attack framework for interacting with the Triconex controllers. Along with the\nexecutable, two binary files, inject.bin (malicious function code) and imain.bin (malicious control\n_logic), were deployed as the controller’s payload. These file names were hard coded in the_\nPy2EXE compiled python script.\n\nTrilog.exe took one option from the command line, which was a single IP address of the target\nTriconex device. It did not leverage the underlying TRITON library’s capability for Triconex\ndevice discovery, instead an instance of trilog.exe had to be invoked separately for each target\ncontroller in the environment. Once invoked, trilog.exe checked the status of the controller, then\nread the configuration information exposed by the TriStation protocol. If the controller was in a\n\n\n-----\n\nrunning state, trilog.exe encoded the two payload files inject.bin and imain.bin and passed them\nto the communication libraries to be appended to the controller’s program memory and\nexecution table.\n\nAfter payload files were inserted into memory on the Triconex controller, the script initiated a\ncountdown, periodically checking the status of the controller. If an error was detected, the\ncommunication library’s method SafeAppendProgramMod attempted to reset the controller to\nthe previous state using a TriStation protocol command. If this failed, trilog.exe attempted to\nwrite a small ‘dummy’ program to memory. We assess that this was an anti-forensics technique\nto hide the presence of the attacker code on the Triconex controller.\n\nWorking with the asset owner, Mandiant ran trilog.exe in a lab environment with a valid Triconex\ncontroller and discovered a conditional check in the malware that prevented the payload binary\nfrom persisting in the environment. Mandiant confirmed that, after correcting patching the attack\nscript to remove this check, the payload binary would persist in controller memory, and the\ncontroller would continue to run.\n\nTRITON implements the TriStation protocol, which is the protocol used by the legitimate\nTriStation application, to configure controllers.\n\n_TsHiis the high-level interface created by the malware’s authors that allows the threat actor’s_\noperators to implement attack scripts using the TRITON framework. It exposes functions for both\nreconnaissance and attack. The functions generally accept binary data from the user, and\nhandle the code ‘signing’ and check sums prior to passing the data to lower level libraries for\nserialization on to the network.\n\n_TsBase, another attacker-written module,contains the functions called by TsHi, which translate_\nthe attacker’s intended action to the appropriate TriStation protocol function code. For certain\nfunctions, it also packs and pads the data in to the appropriate format.\n\n_TsLow is an additional attacker module that implements the TriStation UDP wire protocol. The_\n_TsBase library primarily depends on the ts_exec method. This method takes the function code_\nand expected response code, and serializes the commands payload over UDP. It checks the\nresponse from the controller against the expected value and returns a result data structure\nindicating success or a False object representing failure.\n\n_TsLow also exposes the connect method used to check connectivity to the target controller. If_\ninvoked with no targets, it runs the device discovery function detect_ip. This leverages a \"ping\"\nmessage over the TriStation protocol using IP broadcast to find controllers that are reachable via\na router from where the script is invoked.\n\n**Indicators**\n\n**Filename** **Hash**\n\n\n-----\n\ntrilog.exe MD5: 6c39c3f4a08d3d78f2eb973a94bd7718\n\nSHA-256:\n\ne8542c07b2af63ee7e72ce5d97d91036c5da56e2b091aa2afe737b224305d230\n\nimain.bin MD5: 437f135ba179959a580412e564d3107f\n\nSHA-256:\n\n08c34c6ac9186b61d9f29a77ef5e618067e0bc9fe85cab1ad25dc6049c376949\n\ninject.bin MD5: 0544d425c7555dc4e9d76b571f31f500\n\nSHA-256:\n\n5fc4b0076eac7aa7815302b0c3158076e3569086c4c6aa2f71cd258238440d14\n\nlibrary.zip MD5: 0face841f7b2953e7c29c064d6886523\n\nSHA-256:\n\nbef59b9a3e00a14956e0cd4a1f3e7524448cbe5d3cc1295d95a15b83a3579c59\n\nTS_cnames.pyc MD5: e98f4f3505f05bf90e17554fbc97bba9\n\nSHA-256:\n\n2c1d3d0a9c6f76726994b88589219cb8d9c39dd9924bc8d2d02bf41d955fe326\n\nTsBase.pyc MD5: 288166952f934146be172f6353e9a1f5\n\nSHA-256:\n\n1a2ab4df156ccd685f795baee7df49f8e701f271d3e5676b507112e30ce03c42\n\nTsHi.pyc MD5: 27c69aa39024d21ea109cc9c9d944a04\n\nSHA-256:\n\n758598370c3b84c6fbb452e3d7119f700f970ed566171e879d3cb41102154272\n\nTsLow.pyc MD5: f6b3a73c8c87506acda430671360ce15\n\nSHA-256:\n\n5c776a33568f4c16fee7140c249c0d2b1e0798a96c7a01bfd2d5684e58c9bb32\n\nsh.pyc MD5: 8b675db417cc8b23f4c43f3de5c83438\n\nSHA-256:\n\nc96ed56bf7ee85a4398cc43a98b4db86d3da311c619f17c8540ae424ca6546e1\n\n**Detection**\n\nrule TRITON_ICS_FRAMEWORK\n\n{\nmeta:\n\nauthor = \"nicholas.carr @itsreallynick\"\n\nmd5 = \"0face841f7b2953e7c29c064d6886523\"\n\ndescription = \"TRITON framework recovered during Mandiant ICS incident response\"\n\nstrings:\n\n\n-----\n\n$python_compiled .pyc nocase ascii wide\n$python_module_01 = \"__module__\" nocase ascii wide\n$python_module_02 = \"<module>\" nocase ascii wide\n$python_script_01 = \"import Ts\" nocase ascii wide\n$python_script_02 = \"def ts_\" nocase ascii wide\n\n$py_cnames_01 = \"TS_cnames.py\" nocase ascii wide\n$py_cnames_02 = \"TRICON\" nocase ascii wide\n$py_cnames_03 = \"TriStation \" nocase ascii wide\n$py_cnames_04 = \" chassis \" nocase ascii wide\n\n$py_tslibs_01 = \"GetCpStatus\" nocase ascii wide\n$py_tslibs_02 = \"ts_\" ascii wide\n$py_tslibs_03 = \" sequence\" nocase ascii wide\n$py_tslibs_04 = /import Ts(Hi|Low|Base)/ nocase ascii wide\n$py_tslibs_05 = /module\\s?version/ nocase ascii wide\n$py_tslibs_06 = \"bad \" nocase ascii wide\n$py_tslibs_07 = \"prog_cnt\" nocase ascii wide\n\n$py_tsbase_01 = \"TsBase.py\" nocase ascii wide\n$py_tsbase_02 = \".TsBase(\" nocase ascii wide\n\n$py_tshi_01 = \"TsHi.py\" nocase ascii wide\n$py_tshi_02 = \"keystate\" nocase ascii wide\n$py_tshi_03 = \"GetProjectInfo\" nocase ascii wide\n$py_tshi_04 = \"GetProgramTable\" nocase ascii wide\n$py_tshi_05 = \"SafeAppendProgramMod\" nocase ascii wide\n$py_tshi_06 = \".TsHi(\" ascii nocase wide\n$py_tslow_01 = \"TsLow.py\" nocase ascii wide\n$py_tslow_02 = \"print_last_error\" ascii nocase wide\n$py_tslow_03 = \".TsLow(\" ascii nocase wide\n$py_tslow_04 = \"tcm_\" ascii wide\n$py_tslow_05 = \" TCM found\" nocase ascii wide\n\n$py_crc_01 = \"crc.pyc\" nocase ascii wide\n$py_crc_02 = \"CRC16_MODBUS\" ascii wide\n$py_crc_03 = \"Kotov Alaxander\" nocase ascii wide\n$py_crc_04 = \"CRC_CCITT_XMODEM\" ascii wide\n$py_crc_05 = \"crc16ret\" ascii wide\n$py_crc_06 = \"CRC16_CCITT_x1D0F\" ascii wide\n$py_crc_07 = /CRC16_CCITT[^_]/ ascii wide\n\n$py_sh_01 = \"sh.pyc\" nocase ascii wide\n\n$py_keyword_01 = \" FAILURE\" ascii wide\n$py_keyword_02 = \"symbol table\" nocase ascii wide\n\n$py_TRIDENT_01 = \"inject.bin\" ascii nocase wide\n$py_TRIDENT_02 = \"imain.bin\" ascii nocase wide\n\ncondition:\n2 of ($python_*) and 7 of ($py_*) and filesize < 3MB\n}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12-14 - Attackers Deploy New ICS Attack Framework “TRITON” and Cause Operational Disruption to Critical Infrastructure.pdf"
    ],
    "report_names": [
        "2017-12-14 - Attackers Deploy New ICS Attack Framework “TRITON” and Cause Operational Disruption to Critical Infrastructure.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536078,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653709033,
    "ts_modification_date": 1653709033,
    "files": {
        "pdf": "https://archive.orkl.eu/f0b935083dc627651051bca8100db77f77236c63.pdf",
        "text": "https://archive.orkl.eu/f0b935083dc627651051bca8100db77f77236c63.txt",
        "img": "https://archive.orkl.eu/f0b935083dc627651051bca8100db77f77236c63.jpg"
    }
}