{
    "id": "7f0b4b8c-f251-47d5-906e-489bd55bbf55",
    "created_at": "2023-01-12T15:07:06.205836Z",
    "updated_at": "2025-03-27T02:16:26.054174Z",
    "deleted_at": null,
    "sha1_hash": "4f4140de4189d78822bf915b11a5a3f4c044d289",
    "title": "2017-09-20 - CCleaner Command and Control Causes Concern",
    "authors": "",
    "file_creation_date": "2022-05-27T21:57:48Z",
    "file_modification_date": "2022-05-27T21:57:48Z",
    "file_size": 1946999,
    "plain_text": "# CCleaner Command and Control Causes Concern\n\n**[blog.talosintelligence.com/2017/09/ccleaner-c2-concern.html](http://blog.talosintelligence.com/2017/09/ccleaner-c2-concern.html)**\n\n**_Note: This blog post discusses active research by Talos into a new threat. This information_**\n_should be considered preliminary and will be updated as research continues._\n\n## Introduction\n\n[Talos recently published a technical analysis of a backdoor which was included with version](http://blog.talosintelligence.com/2017/09/avast-distributes-malware.html)\n5.33 of the CCleaner application. During our investigation we were provided an archive\ncontaining files that were stored on the C2 server. Initially, we had concerns about the\nlegitimacy of the files. However, we were able to quickly verify that the files were very likely\ngenuine based upon the web server configuration files and the fact that our research activity\nwas reflected in the contents of the MySQL database included in the archived files.\n\nIn analyzing the delivery code from the C2 server, what immediately stands out is a list of\norganizations, including Cisco, that were specifically targeted through delivery of a secondstage loader. Based on a review of the C2 tracking database, which only covers four days in\nSeptember, we can confirm that at least 20 victim machines were served specialized\nsecondary payloads. Below is a list of domains the attackers were attempting to target. Not\nall companies identified in the targets .php file were seen communicating with a secondary\nC2 or had a secondary payload deployed.\n\n\n-----\n\nInterestingly the array specified contains Cisco's domain (cisco.com) along with other highprofile technology companies. This would suggest a very focused actor after valuable\nintellectual property.\n\nThese new findings raise our level of concern about these events, as elements of our\nresearch point towards a possible unknown, sophisticated actor. These findings also support\nand reinforce our previous recommendation that those impacted by this supply chain attack\nshould not simply remove the affected version of CCleaner or update to the latest version,\nbut should restore from backups or reimage systems to ensure that they completely remove\nnot only the backdoored version of CCleaner but also any other malware that may be\nresident on the system.\n\n## Technical Details\n\n\n-----\n\n### Web Server\n\nThe contents of the web directory taken from the C2 server included a series of PHP files\nresponsible for controlling communications with infected systems. The attacker used a\nsymlink to redirect all normal traffic requesting 'index.php' to the 'x.php' file, which contains\nthe malicious PHP script.\n\nIn analyzing the contents of the PHP files, we identified that the server implemented a series\nof checks to determine whether to proceed with standard operations or simply redirect to the\nlegitimate Piriform web site. The contents of the HTTP Host header, the request method\ntype, and the server port are checked to confirm that they match what is expected from\nbeacons sent from infected systems.\n\nThe PHP contains references to the required table for information storage within the 'x.php'\nvariables as defined:\n\n\n-----\n\nWithin 'init.php' the $db_table is declared to allow insertion into the required database on the\nattacker infrastructure. This is 'Server' as defined below.\n\nThe web server also contains a second PHP file (init.php) that defines core variables and\noperations used. Interestingly, this configuration specifies \"PRC\" as the time zone, which\ncorresponds with People's Republic of China (PRC). It’s important to note that this cannot be\nrelied on for attribution. It also specifies the database configuration to use, as well as the\nfilename and directory location to use for the variable $x86DllName.\n\nThe following information is gathered from infected systems, which is later used to determine\nhow to handle those hosts. This includes OS version information, architecture information,\nwhether the user has administrative rights, as well as the hostname and domain name\nassociated with the systems.\n\n\n-----\n\nThe system profile information was rather aggressive and included specific information such\nas a list of software installed on the machine and all current running processes on the\nmachine with no surprise that 'CCleaner.exe' was a current running process on the victim\nmachine. The system profile information is then stored in the MySQL database.\n\nThere is also functionality responsible for loading and executing the Stage 2 payload on\nsystems that meet the predefined requirements, similar to functionality that we identified\nwould be required in our previous analysis of Stage 1. While there is shellcode associated\nwith both x86 and x64 PE delivery, it appears that only the x86 PE loading functionality is\nactually utilized by the C2 server.\n\n\n-----\n\nAnd below is the shellcode associated with the x64 version of the PE Loader.\n\n\n-----\n\nThe PHP script later compares the system beaconing to the C2 to three values:\n$DomainList, $IPList, and $HostList. This is to determine if the infected system should be\ndelivered a Stage 2 payload. Below is condensed PHP code that demonstrates this:\n\n\n-----\n\nThe use of domain-based filtering further indicates the targeted nature of this attack. While\nwe have confirmed that the number of systems affected by the backdoor was large based\nupon beacon information stored within the MySQL database, the attackers were specifically\ncontrolling which infected systems were actually delivered a Stage 2 payload. While it was\nreported that no systems executed a Stage 2 payload, this is not accurate. In analyzing the\ndatabase table storing information on the systems that were delivered a Stage 2 payload, we\nidentified 20 unique hosts that may have been affected by this payload. The functionality\npresent within Stage 2 is documented in the \"Stage 2 Payloads\" section of this post.\n\n### MySQL Database\n\nThe C2 MySQL database held two tables: one describing all machines that had reported to\nthe server and one describing all machines that received the second-stage download, both of\nwhich had entries were dated between Sept. 12th and Sept. 16th. Over 700,000 machines\nreported to the C2 server over this time period, and more than 20 machines have received\nthe second-stage payload. It is important to understand that the target list can be and was\nchanged over the period the server was active to target different organizations.\n\nDuring the compromise, the malware would periodically contact the C2 server and transmit\nreconnaissance information about infected systems. This information included IP addresses,\nonline time, hostname, domain name, process listings, and more. It's quite likely this\ninformation was used by the attackers to determine which machines they should target\nduring the final stages of the campaign.\n\nThe main connection data is stored in the \"Server\" table. Here is an example of one of Talos'\nhosts in that database table:\n\n\n-----\n\nIn addition, the compromised machines would share a listing of installed programs.\n\nA process list was also captured.\n\n\n-----\n\nWhen combined, this information would be everything an attacker would need to launch a\nlater stage payload that the attacker could verify to be undetectable and stable on a given\nsystem.\n\nA second database table, separate from the 'Server' database table, contained an additional\ninformation set that was associated with systems that had actually been delivered the Stage\n2 payload. This table contained similar survey information to the 'Server' database table, the\nstructure of which is shown below:\n\n\n-----\n\nIn analyzing this second database table 'OK', we can confirm that after deduplicating entries,\n20 systems were successfully delivered the Stage 2 payload. Talos reached out to the\ncompanies confirmed affected by this Stage 2 payload to alert them of a possible\ncompromise.\n\n\n-----\n\nBased on analysis of the 'Server' database table, it is obvious this infrastructure provides\nattackers access to a variety of different targets. Given the filtering in place on the C2 server,\nthe attackers could add or remove domains at any given time, based upon the environments\nor organizations they choose to target. To provide additional perspective regarding the types\nof systems that the attackers could choose to further compromise, the screenshot below\nshows the number of total entries that were contained within the database table used to store\nsystem profile information:\n\n\n-----\n\nThe following screenshot shows the number of affected government systems around the\nworld.\n\nLikewise, looking at compromised systems belonging to domains containing the word 'bank'\nreturns the following results:\n\nThis demonstrates the level of access that was made available to the attackers through the\nuse of this infrastructure and associated malware and further highlights the severityand\npotential impact of this attack.\n\n### Stage 2 Payloads\n\nThe stage 2 installer is GeeSetup_x86.dll. This installer checks the OS version and then\ndrops either a 32-bit or 64-bit version of a trojanized tool. The x86 version is using a\ntrojanized TSMSISrv.dll, which drops VirtCDRDrv (which matches the filename of a\nlegitimate executable that is part of Corel) using a similar method to the backdoored\nCCleaner tool. The x64 version drops a trojanized EFACli64.dll file named SymEFA which is\nthe filename taken from a legitimate executable that is part of \"Symantec Endpoint\". None of\nthe files that are dropped are signed or legitimate.\n\n\n-----\n\nEffectively, they patch a legitimate binary to package their malware. Additionally, the setup\nput an encoded PE in the registry :\n\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\001\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\002\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\003\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\004\n\nThe purpose of the trojanized binary is to decode and execute this PE in registry. This PE\nperforms queries to additional C2 servers and executes in-memory PE files. This may\ncomplicate detection on some systems since the executable files are never stored directly on\nthe file system.\n\nWithin the registry is a lightweight backdoor module which is run by the trojanized files. This\nbackdoor retrieves an IP from data stegged into a github.com or wordpress.com search, from\nwhich an additional PE module is downloaded and run. The stage 3 payload also reaches\nout to \"get.adoble.net\"\n\n## Code Reuse\n\n[Talos has reviewed claims from Kaspersky researchers that there is code overlap with](https://twitter.com/craiu/status/910059453948579840)\n[malware samples known to be used by Group72. While this is by no means proof in terms of](https://blogs.cisco.com/security/talos/opening-zxshell)\nattribution, we can confirm the overlap and we agree that this is important information to be\nconsidered.\n\nOn the left: 2bc2dee73f9f854fe1e0e409e1257369d9c0a1081cf5fb503264aa1bfe8aa06f\n(CCBkdr.dll)\n\nOn the right: 0375b4216334c85a4b29441a3d37e61d7797c2e1cb94b14cf6292449fb25c7b2\n(Missl backdoor - APT17/Group 72)\n\n\n-----\n\n## Conclusion\n\nSupply chain attacks seem to be increasing in velocity and complexity. It's imperative that as\nsecurity companies we take these attacks seriously. Unfortunately, security events that are\nnot completely understood are often downplayed in severity. This can work counter to a\nvictim's best interests. Security companies need to be conservative with their advice before\nall of the details of the attack have been determined to help users ensure that they remain\nprotected. This is especially true in situations where entire stages of an attack go undetected\nfor a long period of time. When advanced adversaries are in play, this is especially true. They\nhave been known to craft attacks that avoid detection by specific companies through\nsuccessful reconnaissance techniques.\n\nIn this particular example, a fairly sophisticated attacker designed a system which appears to\nspecifically target technology companies by using a supply chain attack to compromise a\nvast number of victims, persistently, in hopes to land some payloads on computers at very\n\n\n-----\n\nspecific target networks.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nused in these attacks.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\n## Indicators of Compromise (IOCs)\n\nBelow are indicators of compromise associated with this attack.\n\nInstaller on the CC:\ndc9b5e8aa6ec86db8af0a7aa897ca61db3e5f3d2e0942e319074db1aaccfdc83\n(GeeSetup_x86.dll)\n\n64-bit trojanized binary:\n128aca58be325174f0220bd7ca6030e4e206b4378796e82da460055733bb6f4f (EFACli64.dll)\n\n32-bit trojanized binary:\n07fb252d2e853a9b1b32f30ede411f2efbb9f01e4a7782db5eacf3f55cf34902 (TSMSISrv dll)\n\n\n-----\n\nDLL in registry: f0d1f88c59a005312faad902528d60acbf9cd5a7b36093db8ca811f763e1292a\n\n### Registry Keys:\n\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\001\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\002\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\003\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\004\nHKLM\\Software\\Microsoft\\Windows NT\\CurrentVersion\\WbemPerf\\HBP\n\n### Stage 2 Payload (SHA256):\n\ndc9b5e8aa6ec86db8af0a7aa897ca61db3e5f3d2e0942e319074db1aaccfdc83\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-09-20 - CCleaner Command and Control Causes Concern.pdf"
    ],
    "report_names": [
        "2017-09-20 - CCleaner Command and Control Causes Concern.pdf"
    ],
    "threat_actors": [
        {
            "id": "cea5ceec-0f14-4e34-bd0e-4074bc1a707d",
            "created_at": "2022-10-25T15:50:23.629983Z",
            "updated_at": "2025-03-27T02:00:55.509459Z",
            "deleted_at": null,
            "main_name": "Axiom",
            "aliases": [
                "Group 72"
            ],
            "source_name": "MITRE:Axiom",
            "tools": [
                "ZxShell",
                "gh0st RAT",
                "Zox",
                "PlugX",
                "Hikit",
                "PoisonIvy",
                "Derusbi",
                "Hydraq"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2150d1ac-edf0-46d4-a78a-a8899e45b2b5",
            "created_at": "2022-10-25T15:50:23.269339Z",
            "updated_at": "2025-03-27T02:00:55.416524Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "APT17",
                "Deputy Dog"
            ],
            "source_name": "MITRE:APT17",
            "tools": [
                "BLACKCOFFEE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5c74936a-79d1-41b8-81eb-01d03c90a26b",
            "created_at": "2022-10-25T16:07:23.371052Z",
            "updated_at": "2025-03-27T02:02:09.766782Z",
            "deleted_at": null,
            "main_name": "Axiom",
            "aliases": [
                "Group 72",
                "Operation SMN"
            ],
            "source_name": "ETDA:Axiom",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "BleDoor",
                "Chymine",
                "Darkmoon",
                "DeputyDog",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PNGRAT",
                "PlugX",
                "Poison Ivy",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Roarur",
                "SPIVY",
                "Sensocode",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "ZXShell",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536026,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653688668,
    "ts_modification_date": 1653688668,
    "files": {
        "pdf": "https://archive.orkl.eu/4f4140de4189d78822bf915b11a5a3f4c044d289.pdf",
        "text": "https://archive.orkl.eu/4f4140de4189d78822bf915b11a5a3f4c044d289.txt",
        "img": "https://archive.orkl.eu/4f4140de4189d78822bf915b11a5a3f4c044d289.jpg"
    }
}