{
    "id": "7f174e03-2697-49df-9cea-fa09ce35ce95",
    "created_at": "2024-04-17T02:04:09.758988Z",
    "updated_at": "2025-03-27T02:16:49.01435Z",
    "deleted_at": null,
    "sha1_hash": "f23ca875ba620223aaad8f04fbbf2a67872df1d8",
    "title": "Review of the Summer 2023 Microsoft Exchange Online Intrusion",
    "authors": "",
    "file_creation_date": "2024-03-25T08:55:00Z",
    "file_modification_date": "2024-04-02T17:50:38Z",
    "file_size": 2231700,
    "plain_text": "# Review of the Summer 2023 Microsoft Exchange Online Intrusion \n\n\n#### March 20, 2024 Cyber Safety Review Board\n\n\n-----\n\n## TABLE OF CONTENTS\n\nTable of Contents ................................................................................................................................................................. i\n\nMessage from the Chair and Deputy Chair ......................................................................................................................... ii\n\nExecutive Summary ............................................................................................................................................................ iii\n\n1 Facts........................................................................................................................................................................... 1\n\n1.1 Overview ............................................................................................................................................................... 1\n\n1.2 Intrusion Details ................................................................................................................................................... 3\n\n1.3 Incident Management .......................................................................................................................................... 9\n\n1.4 Public Reporting ................................................................................................................................................. 14\n\n2 Findings and Recommendations .............................................................................................................................. 17\n\n2.1 Cloud Service Providers ..................................................................................................................................... 17\n\n2.2 U.S. Government ................................................................................................................................................ 23\n\nAppendix A: Review Participants – External Parties ......................................................................................................... 25\n\nRelated Briefings ............................................................................................................................................................. 25\n\nAppendix B: Microsoft Exchange Online Intrusion Timeline ............................................................................................. 26\n\nAppendix C: Review Participants – CSRB Members ......................................................................................................... 27\n\nAppendix D: Acronyms ...................................................................................................................................................... 28\n\n\n-----\n\n## MESSAGE FROM THE CHAIR AND DEPUTY CHAIR\n\nIt is not an exaggeration to say that cloud computing has become an indispensable resource to this nation, and indeed,\nmuch of the world. Numerous companies, government agencies, and even some entire countries rely on this\ninfrastructure to run their critical operations, such as providing essential services to customers and citizens. Driven by\nproductivity, efficiency, and cost benefits, adoption of these services has skyrocketed over the past decade, and, in\nsome cases, they have become as indispensable as electricity. As a result, cloud service providers (CSPs) have become\ncustodians of nearly unimaginable amounts of data. Everything from Americans’ personal information to\ncommunications of U.S. diplomats and other senior government officials, as well as commercial trade secrets and\nintellectual property, now resides in the geographically-distributed data centers that comprise what the world now calls\nthe “cloud.”\n\nThe cloud creates enormous efficiencies and benefits but, precisely because of its ubiquity, it is now a high-value target\nfor a broad range of adversaries, including nation-state threat actors. An attacker that can compromise a CSP can\nquickly position itself to compromise the data or networks of that CSP’s customers. In effect, the CSPs have become\none of our most important critical infrastructure industries. As a result, these companies must invest in and prioritize\nsecurity consistent with this “new normal,” for the protection of their customers and our most critical economic and\nsecurity interests.\n\nWhen a hacking group associated with the government of the People’s Republic of China, known as Storm-0558,\ncompromised Microsoft’s cloud environment last year, it struck the espionage equivalent of gold. The threat actors\naccessed the official email accounts of many of the most senior U.S. government officials managing our country’s\nrelationship with the People’s Republic of China.\n\nAs is its mandate, the Cyber Safety Review Board (CSRB, or the Board) conducted deep fact-finding around this\nincident. The Board concludes that this intrusion should never have happened. Storm-0558 was able to succeed\nbecause of a cascade of security failures at Microsoft, as outlined in this report. Today, the Board issues\nrecommendations to Microsoft to ensure this critical company, which sits at the center of the technology ecosystem, is\nprioritizing security for the benefit of its more than one billion customers. In the course of its review, the Board spoke\nwith a range of large CSPs to assess the state of their security practices, and—as is also its mandate—the Board today\nissues recommendations to all CSPs for establishing specific security controls for identity and authentication in the\ncloud. All technology companies must prioritize security in the design and development of their products. The entire\nindustry must come together to dramatically improve the identity and access infrastructure that safeguards the\ninformation CSPs are entrusted to maintain. Global security relies upon it.\n\nWe, and all the members of CSRB, are grateful for Microsoft’s full cooperation in this review. The company provided\nextensive oral and written submissions since November 2023, and we believe answered all of our questions to the best\nof its ability. We also received full cooperation from U.S. intelligence, law enforcement, and cyber defense agencies.\n\nAs we complete our third review since the Board’s establishment in 2022, we are gratified more broadly to observe the\ntrack record of cooperation that CSRB has developed with industry, security researchers, the academic community, and\nforeign government agencies. We are more confident than ever in the Board’s role as a truly public-private institution\nthat conducts authoritative fact-finding and issues actionable recommendations in the wake of major cyber incidents.\n\nWe are grateful to Alejandro Mayorkas, Secretary of Homeland Security, and to Jen Easterly, Director of the\nCybersecurity and Infrastructure Security Agency, for their continued belief in and support of this Board, including by\ncharging us with consequential mandates like this review of the Microsoft Exchange Online incident.\n\nWe offer our thanks to the 20 organizations and individual experts who offered their experience and expertise to allow\nus to conduct this comprehensive review. Finally, we express deep appreciation to our colleagues on the Board for their\ncontinued commitment to our charge, and to the determined and gifted staff who helped the Board discharge its task\nand bring this important review to conclusion.\n\nRobert Silvers Dmitri Alperovitch\nChair Deputy Chair\n\n\n-----\n\n## EXECUTIVE SUMMARY\n\nIn May and June 2023, a threat actor compromised the Microsoft Exchange Online mailboxes of 22 organizations and\nover 500 individuals around the world. The actor—known as Storm-0558 and assessed to be affiliated with the People’s\nRepublic of China in pursuit of espionage objectives—accessed the accounts using authentication tokens that were\nsigned by a key Microsoft had created in 2016. This intrusion compromised senior United States government\nrepresentatives working on national security matters, including the email accounts of Commerce Secretary Gina\nRaimondo, United States Ambassador to the People’s Republic of China R. Nicholas Burns, and Congressman Don\nBacon.\n\nSigning keys, used for secure authentication into remote systems, are the cryptographic equivalent of crown jewels for\nany cloud service provider. As occurred in the course of this incident, an adversary in possession of a valid signing key\ncan grant itself permission to access any information or systems within that key’s domain. A single key’s reach can be\nenormous, and in this case the stolen key had extraordinary power. In fact, when combined with another flaw in\nMicrosoft’s authentication system, the key permitted Storm-0558 to gain full access to essentially any Exchange Online\naccount anywhere in the world. As of the date of this report, Microsoft does not know how or when Storm-0558\nobtained the signing key.\n\nThis was not the first intrusion perpetrated by Storm-0558, nor is it the first time Storm-0558 displayed interest in\ncompromising cloud providers or stealing authentication keys. Industry links Storm-0558 to the 2009 Operation Aurora\ncampaign that targeted over two dozen companies, including Google, and the 2011 RSA SecurID incident, in which the\nactor stole secret keys used to generate authentication codes for SecurID tokens, which were used by tens of millions\nof users at that time. Indeed, security researchers have tracked Storm-0558’s activities for over 20 years.\n\nOn August 11, 2023, Secretary of Homeland Security Alejandro Mayorkas announced that the Cyber Safety Review\nBoard (CSRB, or the Board) would “assess the recent Microsoft Exchange Online intrusion . . . and conduct a broader\nreview of issues relating to cloud-based identity and authentication infrastructure affecting applicable cloud service\nproviders and their customers.”\n\nThe Board conducted extensive fact-finding into the Microsoft intrusion, interviewing 20 organizations to gather\nrelevant information (see Appendix A). Microsoft fully cooperated with the Board and provided extensive in-person and\nvirtual briefings, as well as written submissions. The Board also interviewed an array of leading cloud service providers\nto gain insight into prevailing industry practices for security controls and governance around authentication and identity\nin the cloud.\n\nThe Board finds that this intrusion was preventable and should never have occurred. The Board also concludes that\nMicrosoft’s security culture was inadequate and requires an overhaul, particularly in light of the company’s centrality in\nthe technology ecosystem and the level of trust customers place in the company to protect their data and operations.\nThe Board reaches this conclusion based on:\n\n1. the cascade of Microsoft’s avoidable errors that allowed this intrusion to succeed;\n\n2. Microsoft’s failure to detect the compromise of its cryptographic crown jewels on its own, relying instead on a\ncustomer to reach out to identify anomalies the customer had observed;\n\n3. the Board’s assessment of security practices at other cloud service providers, which maintained security\ncontrols that Microsoft did not;\n\n4. Microsoft’s failure to detect a compromise of an employee's laptop from a recently acquired company prior to\nallowing it to connect to Microsoft’s corporate network in 2021;\n\n5. Microsoft’s decision not to correct, in a timely manner, its inaccurate public statements about this incident,\nincluding a corporate statement that Microsoft believed it had determined the likely root cause of the intrusion\nwhen in fact, it still has not; even though Microsoft acknowledged to the Board in November 2023 that its\nSeptember 6, 2023 blog post about the root cause was inaccurate, it did not update that post until March 12,\n2024, as the Board was concluding its review and only after the Board’s repeated questioning about\nMicrosoft’s plans to issue a correction;\n\n6. the Board's observation of a separate incident, disclosed by Microsoft in January 2024, the investigation of\nwhich was not in the purview of the Board’s review, which revealed a compromise that allowed a different\n\n\n-----\n\nnation-state actor to access highly-sensitive Microsoft corporate email accounts, source code repositories, and\ninternal systems; and\n\n7. how Microsoft’s ubiquitous and critical products, which underpin essential services that support national\nsecurity, the foundations of our economy, and public health and safety, require the company to demonstrate\nthe highest standards of security, accountability, and transparency.\n\nThroughout this review, the Board identified a series of Microsoft operational and strategic decisions that collectively\npoint to a corporate culture that deprioritized both enterprise security investments and rigorous risk management.\n\nTo drive the rapid cultural change that is needed within Microsoft, the Board believes that Microsoft’s customers would\nbenefit from its CEO and Board of Directors directly focusing on the company’s security culture and developing and\nsharing publicly a plan with specific timelines to make fundamental, security-focused reforms across the company and\nits full suite of products. The Board recommends that Microsoft’s CEO hold senior officers accountable for delivery\nagainst this plan. In the meantime, Microsoft leadership should consider directing internal Microsoft teams to\ndeprioritize feature developments across the company’s cloud infrastructure and product suite until substantial security\nimprovements have been made in order to preclude competition for resources. In all instances, security risks should be\nfully and appropriately assessed and addressed before new features are deployed.\n\nBased on the lessons learned from its review and its fact-finding into prevailing security practices across the cloud\nservices industry, the Board, in addition to the recommendations it makes to the President of the United States and\nSecretary of Homeland Security, also developed a series of broader recommendations for the community focused on\nimproving the security of cloud identity and authentication across the government agencies responsible for driving\nbetter cybersecurity, cloud service providers, and their customers.\n\n  - Cloud Service Provider Cybersecurity Practices: Cloud service providers should implement modern control\nmechanisms and baseline practices, informed by a rigorous threat model, across their digital identity and\ncredential systems to substantially reduce the risk of system-level compromise.\n\n  - Audit Logging Norms: Cloud service providers should adopt a minimum standard for default audit logging in\ncloud services to enable the detection, prevention, and investigation of intrusions as a baseline and routine\nservice offering without additional charge.\n\n  - Digital Identity Standards and Guidance: Cloud service providers should implement emerging digital identity\nstandards to secure cloud services against prevailing threat vectors. Relevant standards bodies should refine,\nupdate, and incorporate these standards to address digital identity risks commonly exploited in the modern\nthreat landscape.\n\n  - Cloud Service Provider Transparency: Cloud service providers should adopt incident and vulnerability\ndisclosure practices to maximize transparency across and between their customers, stakeholders, and the\nUnited States government, even in the absence of a regulatory obligation to report.\n\n  - Victim Notification Processes: Cloud service providers should develop more effective victim notification and\nsupport mechanisms to drive information-sharing efforts and amplify pertinent information for investigating,\nremediating, and recovering from cybersecurity incidents.\n\n  - Security Standards and Compliance Frameworks: The United States government should update the Federal\nRisk Authorization Management Program and supporting frameworks and establish a process for conducting\ndiscretionary special reviews of the program’s authorized Cloud Service Offerings following especially highimpact situations. The National Institute of Standards and Technology should also incorporate feedback about\nobserved threats and incidents related to cloud provider security.\n\n\n-----\n\n## 1 FACTS\n\n### 1.1 OVERVIEW\n\nIn May 2023, a threat actor known as Storm-0558 [1] compromised the Microsoft Exchange Online mailboxes of a broad\nrange of victims in the United States (U.S.), the United Kingdom (U.K.), and elsewhere. Storm-0558, assessed by\nmultiple sources to pursue espionage objectives and maintain ties with the People’s Republic of China (PRC), [2, 3]\naccessed email accounts in the U.S. Department of State (State Department, or State), U.S. Department of Commerce\n(Commerce Department, or Commerce), and U.S. House of Representatives. [4] This included the official and personal\nmailboxes of U.S. Commerce Secretary Gina Raimondo; Congressman Don Bacon; U.S. Ambassador to the PRC, R.\nNicholas Burns; Assistant Secretary of State for East Asian and Pacific Affairs, Daniel Kritenbrink; [5] and additional\nindividuals across 22 organizations. [6] These senior officials have substantial responsibilities for many aspects of the\nU.S. government’s bilateral relationship with the PRC. Storm-0558 had access to some of these cloud-based mailboxes\nfor at least six weeks, [7, 8] and during this time, the threat actor downloaded approximately 60,000 emails from State\nDepartment alone. [9]\n\nState Department was the first victim to discover the intrusion when, on June 15, 2023, State’s security operations\ncenter (SOC) detected anomalies in access to its mail systems. [10] The next day, State observed multiple security alerts\nfrom a custom rule it had created, known internally as “Big Yellow Taxi,” [11] that analyzes data from a log known as\nMailItemsAccessed, which tracks access to Microsoft Exchange Online mailboxes. State was able to access the\nMailItemsAccessed log to set up these particular Big Yellow Taxi alerts because it had purchased Microsoft’s\ngovernment agency-focused G5 license that includes enhanced logging capabilities through a product called Microsoft\nPurview Audit (Premium). [12] The MailItemsAccessed log was not accessible without that “premium” service. [13]\n\nThough the alerts showed activity that could have been considered normal—and, indeed, State had seen false positive\nBig Yellow Taxi detections in the past—State investigated these incidents and ultimately determined that the alert\nindicated malicious activity. State triaged the alert as a moderate-level event and, on Friday, June 16, 2023, its security\nteam contacted Microsoft. [14, 15] Microsoft opened and conducted an investigation of its own, and over the next 10 days,\nultimately confirmed that Storm-0558 had gained entry to certain user emails through State’s Outlook Web Access\n(OWA). Concurrently, Microsoft expanded its investigation to identify the 21 additional impacted organizations and 503\nrelated users impacted by the attack and worked to identify and notify impacted U.S. government agencies. [16]\n\nMicrosoft initially assumed that Storm-0558 had gained access to State Department accounts through traditional\nthreat vectors, such as compromised devices or stolen credentials. However, on June 26, 2023, Microsoft discovered\nthat the threat actor had used OWA to access emails directly using tokens that authenticated Storm-0558 as valid\n\n1 Microsoft uses its internal naming taxonomy to label threat actors based on several characteristics including country of origin,\ninfrastructure, and objectives. Source: Lambert, John; Microsoft, “Microsoft shifts to a new threat actor naming taxonomy,” April 18, 2023,\n_https://www.microsoft.com/en-us/security/blog/2023/04/18/microsoft-shifts-to-a-new-threat-actor-naming-taxonomy/_\n2 Anonymized.\n3 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n4 Anonymized.\n5 Schappert, Stefanie; CyberNews, “Another US Congressman reveals emails hacked by China,” November 15, 2023,\nhttps://cybernews.com/news/us-congressman-emails-hacked-china-microsoft/\n6 Anonymized.\n7 Anonymized.\n8 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n9 State Department, “Department Press Briefing – September 28, 2023,” September 28, 2023,\nhttps://www.state.gov/briefings/department-press-briefing-september-28-2023/\n10 Anonymized.\n11 Sakellariadis, John and Miller, Maggie; Politico, “All thanks to ‘Big Yellow Taxi’: How State discovered Chinese hackers reading its emails,”\nSeptember 15, 2023, https://www.politico.com/news/2023/09/15/digital-tripwire-helped-state-uncover-chinese-hack-00115973\n12 State Department, Board Meeting.\n13 Microsoft, “Compare Office 365 Government Plans: Microsoft 365,” https://www.microsoft.com/en-us/microsoft365/enterprise/government-plans-and-pricing\n14 Anonymized.\n15 State Department, Board Meeting.\n16 Microsoft, Board Meeting.\n\n\n-----\n\nusers. Such tokens should only come from Microsoft’s identity system, yet these had not. Moreover, tokens used by the\nthreat actor had been digitally signed with a Microsoft Services Account (MSA) [17] cryptographic key that Microsoft had\nissued in 2016. This particular MSA key should only have been able to sign tokens that worked in consumer OWA, not\nEnterprise Exchange Online. Finally, this 2016 MSA key was originally intended to be retired in March 2021, but its\nremoval was delayed due to unforeseen challenges associated with hardening the consumer key systems. [18] This was\nthe moment that Microsoft realized it had major, overlapping problems: first, someone was using a Microsoft signing\nkey to issue their own tokens; second, the 2016 MSA key in question was no longer supposed to be signing new\ntokens; and third, someone was using these consumer key-signed tokens to gain access to enterprise email accounts.\n\nAccording to Microsoft, this discovery triggered an all-hands-on-deck investigation by Microsoft that ran overnight from\nJune 26 into June 27, 2023, focusing on the 2016 MSA key that had issued the token as well as the access token\nitself. By the end of the day, Microsoft had high confidence that the threat actor had forged a token using a stolen\nconsumer signing key. Microsoft then escalated this intrusion internally, assigning it the highest urgency level and\ncoordinating its investigation across multiple company teams. As a result, Microsoft developed 46 hypotheses to\ninvestigate, including some scenarios as wide-ranging as the adversary possessing a theoretical quantum computing\ncapability to break public-key cryptography or an insider who stole the key during its creation. Microsoft then assigned\nteams for each hypothesis to try to: prove how the theft occurred; prove it could no longer occur in the same way now;\nand to prove Microsoft would detect it if it happened today. Nine months after the discovery of the intrusion, Microsoft\nsays that its investigation into these hypotheses remains ongoing. [19]\n\nMicrosoft began notifying potentially impacted organizations and individuals on or about June 19 and July 4, 2023,\nrespectively. [20, 21] As detailed below, this effort had varying degrees of success. Ultimately, Microsoft determined that\nStorm-0558 used an acquired MSA consumer token signing key to forge tokens to access Microsoft Exchange Online\naccounts for 22 enterprise organizations, as well as 503 related personal [22] accounts, worldwide. [23] Of the 503\npersonal accounts reported by Microsoft, at least 391 were in the U.S. and included those of former government\nofficials, [24] while others were linked to Western European, Asia-Pacific (APAC), Latin American, and Middle Eastern\ncountries and associated victim organizations. [25, 26, 27]\n\nMicrosoft found no sign of an intrusion into its identity system and, as of the conclusion of this review, has not been\nable to determine how Storm-0558 had obtained the 2016 MSA key; it did find a flaw in the token validation logic used\nby Exchange Online that could allow a consumer key to access enterprise Exchange accounts if those Exchange\naccounts were not coded to reject a consumer key. By June 27, 2023, Microsoft believed it had identified the technique\nused to access victim accounts and rapidly cleared related caching data in various downstream Microsoft systems to\ninvalidate all credentials derived from the stolen key. Microsoft believed that this mitigation was effective, as it almost\nimmediately observed Storm-0558 begin to use phishing to try to gain access to the email boxes it had previously\ncompromised. [28] However, by the conclusion of this review, Microsoft was still unable to demonstrate to the Board that\nit knew how Storm-0558 had obtained the 2016 MSA key.\n\n17 Consumer accounts are validated by MSA consumer signing keys, and Azure AD accounts are validated through Azure AD enterprise\nsigning keys. As these keys are from separate providers, and managed in separate systems, they should not be able to validate for the other\nsystem. Source: SecureTeam, “Microsoft Key Used for Unauthorised Email Access,” July 27, 2023,\n_https://secureteam.co.uk/2023/07/27/microsoft-key-used-for-unauthorised-email-access/_\n18 Microsoft, Board Meeting.\n19 Microsoft, Board Meeting.\n20 Anonymized.\n21 Anonymized.\n22 The term “personal” in this context means an individual account. “A Microsoft [personal] account is the name given to the identity service\nthat provides authentication and authorization to Microsoft's consumer services. You use a personal Microsoft account to connect to\nMicrosoft apps, services, and devices.” Source: Microsoft, “What’s the difference between a Microsoft account and a Microsoft 365 work or\n_school account?” October 10, 2023, https://support.microsoft.com/en-au/office/what-s-the-difference-between-a-microsoft-account-and-a-_\n_microsoft-365-work-or-school-account-72f10e1e-cab8-4950-a8da-7c45339575b0_\n23 Microsoft, Board Meeting.\n24 Anonymized.\n25 Microsoft, Board Meeting.\n26 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n27 Microsoft, Response to Board Request for Information.\n28 Microsoft, Board Meeting.\n\n\n-----\n\n### 1.2 INTRUSION DETAILS\n\n#### 1.2.1 TIMELINE\n\nThe Board finds that the intrusion began in May 2023 and known adversaries’ techniques were remediated by the end\nof June 2023. A high-level timeline follows, and a more complete chronology is included in Appendix B.\n\nMay-June 15, 2023: Initial Intrusion, Before Discovery\n\nStorm-0558 compromised Microsoft Exchange Online mailboxes of certain victims in the U.S., the U.K., and elsewhere\nbetween May and the first half of June. [29, 30] However, the Board heard that Microsoft’s window of compromise may\nhave started earlier than May 15, as it had published, based on standard 30-day log retention practices. [31]\n\nJune 15-19, 2023: Department of State Detects the Intrusion\n\nState first detected anomalous activity on June 15, notified Microsoft on June 16, and, with support from Microsoft,\ninvestigated and analyzed the data over the course of the holiday weekend. By June 19, State determined that a threat\nactor had accessed six State email accounts, including those of personnel supporting the Secretary of State’s\nupcoming trip to Beijing. State discovered that the threat actor accessed six other accounts between June 21 and June\n24, and later discovered the compromise of one other account through the analysis of a seized virtual private server\n(VPS). [32 ]\n\nJune 16-26, 2023: The Investigation Broadens; Department of Commerce is Identified as a Victim\n\nState reached out to Microsoft, the Cybersecurity and Infrastructure Security Agency (CISA), and the Federal Bureau of\nInvestigation (FBI). [33, 34] CISA already had personnel at State conducting proactive threat hunting who began collecting\ndata for analysis; [35] FBI shared details about the threat actor, its targets and exploitation vectors, and other indicators\nof compromise. [36, 37] After outreach from State, on June 16, Microsoft conducted an initial investigation, which\nassumed that Storm-0558 had gained entry to user emails through State’s OWA. [38]\n\nOn June 19, Microsoft notified an organization in the U.K. that it was a victim; Microsoft later identified other victim\norganizations in the U.K. [39] On June 23, Microsoft notified Commerce Department that it, too, was a victim. [40] On or\nabout June 26, Microsoft determined that Storm-0558 was using the stolen 2016 MSA key to issue tokens that allowed\nit to access both consumer and enterprise accounts. [41]\n\nJune 24, 2023: Closing the Attack Vector\n\nOn June 24, Microsoft invalidated the stolen key the threat actor was using. [42, 43] Microsoft believed that this action\nended Storm-0558’s access to the email accounts, as it almost immediately observed Storm-0558 attempt phishing\nand other methods to regain access to the email boxes it had previously compromised. [44]\n\nJuly 4, 2023 and Beyond: Continue Victim Notification and Remediation\n\nMicrosoft began victim notification during its initial investigation, and this continued for weeks. Because of the nature\nof the intrusion, only Microsoft was able to identify most of the victims. It worked with the U.S. government to provide\n\n29 Anonymized.\n30 Anonymized.\n31 Anonymized.\n32 State Department, Board Meeting.\n33 FBI, Response to Board Request for Information.\n34 State Department, Board Meeting.\n35 Anonymized.\n36 State Department, Board Meeting.\n37 FBI, Board Meeting.\n38 Microsoft, Board Meeting.\n39 Anonymized.\n40 Commerce Department, Board Meeting.\n41 Microsoft, Board Meeting.\n42 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n43 Anonymized.\n44 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n\n\n-----\n\nvictim information, and federal agencies undertook separate efforts to notify impacted individuals. [45, 46] These different\nefforts had varying degrees of success. Microsoft also took additional steps to ensure that the 2016 MSA key was\nreplaced and that previously issued tokens would not work on any impacted individual customers’ environments. [47]\n\n#### 1.2.2 THREAT ACTOR PROFILE\n\nStorm-0558 has been active since approximately the year 2000. [48] Microsoft described Storm-0558 as “a China-based\nthreat actor with activities and methods consistent with espionage objectives. While we have discovered some minimal\noverlaps with other Chinese groups such as Violet Typhoon (ZIRCONIUM, APT31), we maintain high confidence that\nStorm-0558 operates as its own distinct group.” Microsoft historically observed the group primarily targeting U.S. and\nEuropean diplomatic, economic, and legislative governing bodies; media companies, think tanks, and\ntelecommunications and equipment services providers; and individuals connected to Taiwan and Uyghur geopolitical\ninterests. [49] Microsoft assesses that the Microsoft Exchange Online intrusion was a targeted information-collection\noperation aimed at fulfilling the PRC’s intelligence needs. [50]\n\nMicrosoft has developed insights into Storm-0558’s activity clusters, ways in which its operational network overlaps\nwith Microsoft’s environment, and its affiliates and partnerships. [51] FBI and CISA assess that this latest campaign by\nStorm-0558 was also consistent with that of a nation-state threat actor with a high level of sophistication, [52] particularly\nwith its knowledge of identity and access management (IAM) systems. [53]\n\nFollowing disclosure of the Storm-0558 breach, Google’s Threat Analysis Group was able to link at least one entity tied\nto this threat actor to the group responsible for the 2009 compromise of Google and dozens of other private companies\nin a campaign known as Operation Aurora, [54, 55] as well as the RSA SecurID incident. [56, 57] The threat group believed to\nhave been behind the Operation Aurora campaign has been known to compromise cloud identity systems, steal source\ncode, and engage in token-forging activities to gain access to targeted individuals’ email accounts. [58, 59] Particularly,\nthis threat group sought to understand the location of account login source code and the specific engineers involved in\nits development, ways in which organizations deploy account login systems to their production environment, and where\nand how organizations manage their cryptographic keys for account login cookies. In the wake of these attacks,\ninvestigators assessed that this threat group’s tooling and reconnaissance activities suggest that it is well resourced,\ntechnically adept, and deeply knowledgeable of many authentication techniques and applications. [60]\n\n45 Anonymized.\n46 Anonymized.\n47 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n48 Anonymized.\n49 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n50 Microsoft, Board Meeting.\n51 Microsoft, Board Meeting.\n52 FBI, Board Meeting.\n53 CISA, Board Meeting.\n54 Google, Board Meeting.\n55 Operation Aurora was a series of cyberattacks from China that targeted U.S. private sector companies in 2010, compromising the\nnetworks of Yahoo, Adobe, Dow Chemical, Morgan Stanley, Google, and more than two dozen other companies to steal their trade secrets.\nGoogle was the only company that confirmed it was a victim and publicly attributed the incident to China. The incident is viewed as a\nmilestone in the recent history of cyber operations because it raised the profile of cyber operations as a tool for industrial espionage. Source:\n_Council on Foreign Relations, “Operation Aurora,” January 2010, https://www.cfr.org/cyber-operations/operation-aurora_\n56 The 2011 RSA SecureID intrusion resulted in the compromise of sensitive information relating to its two-factor SecurID authentication\nsystem. Source: Schwartz, Mathew; Dark Reading, “RSA Pins SecurID Attacks On Nation State,” October 12, 2011,\n_https://www.darkreading.com/cyberattacks-data-breaches/rsa-pins-securid-attacks-on-nation-state_\n57 Anonymized.\n58 O’Gorman, Gavin and McDonald, Geoff; Symantec, “The Elderwood Project,” September 6, 2012,\nhttps://www.cs.cornell.edu/courses/cs6410/2012fa/slides/Symantec_ElderwoodProject_2012.pdf\n59 Google specifically described the attack as a highly sophisticated and targeted attack on their corporate infrastructure that resulted in\ntheft of intellectual property and access to targeted Gmail accounts. Source: Google Official Blog, “A new approach to China,” January 12,\n_2010, https://googleblog.blogspot.com/2010/01/new-approach-to-china.html_\n60 Google, Board Meeting.\n\n\n-----\n\n#### 1.2.3 2023 COMPROMISE OF MICROSOFT EXCHANGE ONLINE\n\n1.2.3.1 Storm-0558’s Possession of the 2016 MSA Key\n\nMicrosoft learned that, in 2021, Storm-0558 had accessed a variety of documents stored in SharePoint and assessed\nthat the threat actor was specifically looking for information on Azure service management and identity-related\ninformation. [61] Despite Microsoft’s pursuit of the 46 key-theft hypotheses, [62] the Board assesses that Microsoft does not\nknow how Storm-0558 obtained the 2016 MSA key. Microsoft stated in a September 6, 2023 blog post that the most\nprobable way Storm-0558 had obtained the key was from a crash dump [63] to which it had access during the 2021\ncompromise of Microsoft’s systems. However, Microsoft had only theorized that such a scenario was technically\nfeasible in the 2016 timeframe. While Microsoft updated this blog on March 12, 2024 to correct its assessment of\nthese theories, [64] it has not determined that this is how Storm-0558 obtained the key. [65]\n\nThe Board further determines that Microsoft has no evidence or logs showing the stolen key’s presence in or exfiltration\nfrom a crash dump. During the Board’s interview with Microsoft in November 2023, Microsoft said that soon after\npublication, it realized that the statements in the September 6 blog were inaccurate: Microsoft had found no evidence\nof a crash dump containing the 2016 MSA key material. [66] While Microsoft’s latest update about this incident\nacknowledges that it did not find a crash dump containing the impacted 2016 MSA key material, [67] the possibility that\nthe threat actor had accessed other keys and sensitive data, in addition to the 2016 MSA key, also remains\nunresolved, [68] adding to the Board’s concern about the full consequences of the incident and remaining uncertainty.\n\nIn its November 2023 interview, Microsoft also told the Board that it was debating when to issue a new or updated blog\nbased on the progress of its investigation but had not made any decisions. [69] In a written response to the Board on\nMarch 5, 2024, Microsoft maintained that it “intends to publish an update to the blog in the near future.” [70] Over six\nmonths after its publication of the September 6 blog, and four months after acknowledging to the Board that the blog\nwas inaccurate, Microsoft publicly corrected its mistaken assertions in an addendum, based on its “latest\nknowledge.” [71]\n\n1.2.3.2 How Storm-0558 Used the 2016 MSA Key\n\nStorm-0558 established its first identified component of external hosting infrastructure to execute the Exchange Online\nintrusion and gained access to email accounts on May 15, 2023. [72] After State notified Microsoft about the intrusion on\nJune 16, 2023, Microsoft reviewed logs pertaining to the event, from the month of May, and identified that the first\ninstance of malicious activity took place days after Storm-0558 had established its infrastructure. Microsoft also said\nthat Storm-0558 had, in the past, used more sophisticated covert networks, but Microsoft believes that a previous\ndisruption of the threat actor’s infrastructure forced it to use a less sophisticated infrastructure for this intrusion that\nwas more readily identifiable once discovered. [73] In this instance, Storm-0558 occasionally used infrastructure located\ngeographically near its targets, likely to try to blend in with legitimate activity. [74, 75]\n\n61 Microsoft, Response to Board Request for Information.\n62 Microsoft, Board Meeting.\n63 A system crash (also known as a \"bug check\" or a \"Stop error\") occurs when Windows cannot run correctly. The dump file that is produced\nfrom this event is called a system crash dump. Source: Microsoft Learn, “Generate a kernel or complete crash dump,” September 2, 2022,\n_https://learn.microsoft.com/en-us/troubleshoot/windows-client/performance/generate-a-kernel-or-complete-crash-dump_\n64 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023 (updated March 12,\n2024), https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n65 Microsoft, Board Meeting.\n66 Microsoft, Board Meeting.\n67 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023 (updated March 12,\n2024), https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n68 Anonymized.\n69 Microsoft, Board Meeting.\n70 Microsoft, Response to Board Request for Information.\n71 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023 (updated March 12,\n2024), https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n72 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n73 Microsoft, Board Meeting.\n74 Anonymized.\n75 Microsoft, Board Meeting.\n\n\n-----\n\nMicrosoft designed its consumer MSA identity infrastructure more than 20 years ago. Later, it introduced an enterprise\nEntra infrastructure, previously known as Azure Active Directory (AD). Initially, the consumer MSA system had no\nprocess for automated signing key rotation or deactivation and utilized a manual process instead. Over time, Microsoft\nautomated the key rotation process in the enterprise system with the intent for the consumer MSA system to follow and\nuse the same technology, but it had not done so in the consumer MSA system before the intrusion. Microsoft continued\nto rotate consumer MSA keys infrequently and manually until it stopped the rotation entirely in 2021 following a major\ncloud outage linked to the manual rotation process. While Microsoft had paused manual key rotation, it neither had,\nnor created, an automated alerting system to notify the appropriate Microsoft teams about the age of active signing\nkeys in the consumer MSA service. [76]\n\nThus, possession of the 2016 MSA key—dated though it was—enabled the threat actor to forge authentication tokens\nthat allowed it to access email systems. This access should have been limited to consumer email systems, [77] but due to\na previously unknown flaw that allowed tokens to access enterprise email accounts, Storm-0558 was able to get into\nsystems such as those at State and Commerce. The flaw was caused by Microsoft’s efforts to address customer\nrequests for a common OpenID Connect (OIDC) endpoint service that listed active signing keys for both enterprise and\nconsumer identity systems. [78] However, Microsoft had not adequately updated the software development kits (SDKs),\nwhich Microsoft and its partners both used, to differentiate between the consumer MSA and the enterprise signing keys\nwithin the common endpoint. As a result, this allowed successful authentication to the Entra system for certain\napplications, such as mail, regardless of which key was used. [79]\n\nThus, as illustrated in Figure 1, the stolen 2016 MSA key in combination with the flaw in the token validation system\npermitted the threat actor to gain full access to essentially any Exchange Online account. [80, 81]\n\n\nCloud Service Vulnerabilities\n\n\nCloud service providers (CSPs) do not always register and publicly disclose common vulnerabilities and exposures\n(CVEs) in their cloud infrastructure when mitigating those vulnerabilities does not require customer action. [82] This\nlack of disclosure, which is counter to accepted norms for cybersecurity more generally, makes it difficult for CSP\ncustomers to understand the risks posed by their reliance on potentially vulnerable cloud infrastructure. [83]\n\n\nMicrosoft does not know when Storm-0558 discovered that consumer signing keys (including the one it had stolen)\ncould forge tokens that worked on both OWA consumer and enterprise Exchange Online. Microsoft speculates that the\nthreat actor could have discovered this capability through trial and error. It assessed that during this incident, the actor\nwas researching Microsoft technologies and used this knowledge to pivot and circumvent Microsoft’s security\nmeasures within test cloud tenants. [84]\n\n76 Microsoft, Board Meeting.\n77 Microsoft, Board Meeting.\n78 OpenID providers like the Microsoft identity platform provide an OpenID Provider Configuration Document at a publicly accessible endpoint\ncontaining the provider's OIDC endpoints, supported claims, and other metadata. Client applications can use the metadata to discover the\nURLs to use for authentication and the authentication service's public signing keys. Source: Microsoft; “OpenID Connect on the Microsoft\n_identity platform,” October 23, 2023, https://learn.microsoft.com/en-us/entra/identity-platform/v2-protocols-oidc_\n79 Microsoft, Board Meeting.\n80 Anonymized.\n81 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n82 Anonymized.\n83 Anonymized.\n84 Microsoft, Board Meeting.\n\n\n-----\n\n_Figure 1: Storm-0558 Token Abuse with Stolen 2016 MSA Key_\n\n#### 1.2.4 2021 COMPROMISE OF MICROSOFT CORPORATE NETWORK BY STORM-0558\n\nMicrosoft told the Board that Storm-0558 had compromised Microsoft’s corporate network via an engineer’s account,\nwhich occurred between April and August 2021. Microsoft believes, although it has produced no specific evidence to\nsuch effect, that this 2021 intrusion was likely connected to the 2023 Exchange Online compromise because it is the\nonly other known Storm-0558 intrusion of Microsoft’s network in recorded memory. During this 2021 incident,\nMicrosoft believes that Storm-0558 gained access to sensitive authentication and identity data. [85]\n\nAs announced on March 26, 2020 and completed on April 23, 2020, Microsoft acquired a company called Affirmed\nNetworks [86] that worked in 5G technology and advanced networking. Microsoft believes that prior to the acquisition,\nStorm-0558 targeted an engineer and compromised their device due to their experience in 5G technology and\nadvanced networking. After the acquisition, Microsoft supplied corporate credentials to the acquired engineer that\nallowed access to Microsoft’s corporate environment with the compromised device. Leveraging this access, Storm0558 captured an authentication token, then replayed the token to authenticate as the Microsoft employee on\nMicrosoft’s corporate network. [87, 88]\n\n85 Microsoft, Board Meeting.\n86 Khalidi, Yousef; Microsoft, “Microsoft announces agreement to acquire Affirmed Networks to deliver new opportunities for a global 5G\n_ecosystem,” March 26, 2020, https://blogs.microsoft.com/blog/2020/03/26/microsoft-announces-agreement-to-acquire-affirmed-_\nnetworks-to-deliver-new-opportunities-for-a-global-5g-ecosystem/\n87 Microsoft, Board Meeting.\n88 Anonymized.\n\n\n-----\n\nWhile Storm-0558 exhibited an advanced understanding of Microsoft’s network and demonstrated a particular interest\nin information associated with identity and engineering, Microsoft does not have direct evidence linking the two\nincidents. Microsoft’s insider threat investigation also did not find evidence to indicate that a malicious insider was a\npart of the 2023 intrusion. Through its ongoing investigations, Microsoft said it believes that alternative initial access\nvectors, such as an insider threat, remain unlikely. [89]\n\nStill, the 2021 compromise of Microsoft’s corporate network highlights gaps within the company’s mergers and\nacquisitions (M&A) security compromise assessment and remediation process. Microsoft told the Board that, where\napplicable and based on the risk profile associated with the acquisition and the terms of the agreement, Microsoft\ndeploys telemetry and threat intelligence tools to assess whether an acquisition has been compromised, and\nremediation can occur pre- or post-closing. Microsoft and the acquisition target formalize a security incident response\nprocess to coordinate security incidents until close. Following the acquisition, Microsoft’s internal audit team may\nconduct security audits of an acquisition leveraging findings from due diligence security assessments to inform the\nscope of these assessments. [90]\n\n#### 1.2.5 INCIDENT IMPACT\n\nThe Microsoft Exchange Online intrusion was significant: Storm-0558’s combined possession of the 2016 MSA key and\nits ability to access enterprise Exchange accounts allowed the threat actor to access any Microsoft Exchange Online\naccount. Although Microsoft expressed confidence resulting both from extensive log analysis and direct actor tracking\nthat this intrusion only impacted Microsoft Exchange Online, the stolen key also could have been used by the threat\nactor to access other Microsoft cloud applications had it chosen to do so. These include both Microsoft and third-party\napplications reliant on Microsoft’s identity provider (IDP) that were either intentionally (due to supporting consumer\naccounts) or unintentionally (due to using client libraries or bespoke code that failed to properly validate authentication\ntokens) trusting tokens signed by the stolen key. [91, 92, 93] Microsoft believes that Storm-0558 itself limited the scope of\nthis intrusion, as it appeared to be selective in its targeting, balancing its information-gathering objectives with\nprobabilities of detection. [94] The Board believes that the actor also prioritized high-value and time-sensitive collection\nmissions.\n\nYet while the number of victims was relatively low given the breadth of the access available to the actor, they were\nwidespread: Storm-0558 accessed the email accounts of 22 enterprise organizations, [95] including government\nagencies and three think tanks. [96] This intrusion also impacted the personal accounts of individuals likely associated\nwith these organizations. [97] The non-U.S. victims included four foreign government entities, three private sector\norganizations, and four educational entities. [98]\n\n\nImpacted U.K. Accounts\n\n\nStorm-0558 compromised several U.K. organizations’ email accounts and exfiltrated an unknown number of emails.\nInitially, Microsoft reported three affected accounts to the National Cyber Security Centre (NCSC), [99] but further\ninvestigation by Microsoft revealed additional victims. This discovery underscores both the evolving nature of this\nincident’s impact assessment and the delayed victim identification. [100] The Board has not learned why these U.K.\nindividuals were chosen over others.\n\n\n89 Microsoft, Board Meeting.\n90 Microsoft, Response to Board Request for Information.\n91 Anonymized.\n92 Microsoft, Board Meeting.\n93 Anonymized.\n94 Microsoft, Board Meeting.\n95 Microsoft, Board Meeting.\n96 Anonymized.\n97 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n98 Anonymized.\n99 NCSC, the U.K.’s version of FBI Cyber Division, supports the most critical organizations in the U.K., the wider public sector, industry,\nsubject matter experts, and the general public. Source: NCSC, “What we do,” https://www.ncsc.gov.uk/section/about-ncsc/what-we-do\n100 NCSC, Board Meeting.\n\n\n-----\n\nMicrosoft knew the identity of all of the individuals whom Storm-0558 targeted, many of whom were linked to entities\nassociated with Western European, APAC, Latin American, and Middle Eastern countries. [101, 102] Of these accounts, the\nintrusion impacted at least 391 personal email accounts in the U.S, [103] including some Hotmail accounts belonging to\ncurrent and former employees of an affected government organization. [104]\n\nThe threat actor compromised the official and personal mailboxes of many senior U.S. government officials, some of\nwhich likely contained information about the U.S.’s diplomatic and economic policies toward the PRC. The timing of the\nintrusion, just before Secretary Blinken’s trip to Beijing in 2023, combined with the seniority of the officials targeted,\nhighlights a potential partial rationale for such intrusions. [105]\n\n### 1.3 INCIDENT MANAGEMENT\n\n#### 1.3.1 HOW STATE DEPARTMENT DISCOVERED THE INTRUSION\n\nState Department was the first entity to detect the intrusion when on June 16, 2023, a State SOC analyst observed\nmultiple alerts from the “Big Yellow Taxi” custom alert rule. Detecting an intrusion like this is difficult; State Department\nfound Storm-0558 because it had purchased enhanced logging through the G5 licenses, [106] which few, if any, victims\nhad similarly acquired. [107] As standard practice, State’s SOC uses that enhanced logging to build custom alerts like “Big\nYellow Taxi” in response to an evolving threat environment. [108] Just purchasing the additional logging alone would not\nhave been enough; in fact, the Board heard that few organizations analyzed the voluminous MailItemsAccessed log in\ndetail, and such in-depth analysis would be difficult for smaller organizations.\n\nState, however, used the data to build custom detection rules to enable it to identify anomalous access to mailboxes\nsuch as the activity undertaken in this intrusion. State Department’s SOC designed custom alerting capabilities based\non three years of experience dealing with anomalous access to mailboxes. In particular, State curated log events like\nthe MailItemsAccessed data to enumerate all applications accessing mailboxes within its infrastructure, and to trigger\nalerts for any anomalous events. [109] It also designed a rule to detect deviations in mailbox activity by comparing\nbaseline interactions of applications with Exchange Online. [110] These rules provided detailed information about\napplication IDs touching mailboxes, specific application details, and context about particular mailboxes involved,\nthereby enhancing State’s ability to pinpoint potential issues quickly. [111]\n\n#### 1.3.2 INVESTIGATION AND ANALYSIS\n\n1.3.2.1 Microsoft’s Investigation\n\nAfter receiving State Department’s report on June 16, 2023, Microsoft began an initial investigation using its normal\nprocesses, which involved Microsoft’s Detection and Response Team (DART). Microsoft attributed the intrusion to\nStorm-0558 after identifying infrastructure associated with the threat actor. This investigation continued until June 26,\n2023. At the time, Microsoft determined the impact was larger in scope and may have involved the compromise of\nMicrosoft’s systems. Specifically, Microsoft discovered the threat actor was able to access emails directly using forged\ntokens signed with a consumer token signing key that was supposed to have been inactive. Once it identified and\nrevoked the stolen 2016 MSA key, Microsoft was able to use the key to inform its hunting efforts: since the key was\ninactive at this point, the Microsoft identity system was not using it to sign any tokens. Thus, all signing instances using\nthis key constituted nefarious activity. This insight helped Microsoft determine that its identity system had not issued\nthe invalid tokens and identify threat actor activities with high confidence, [112] meaning the threat actors had an MSA\n\n101 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n102 Microsoft, Response to Board Request for Information.\n103 Anonymized.\n104 Anonymized.\n105 Anonymized.\n106 State Department, Board Meeting.\n107 Anonymized.\n108 State Department, Board Meeting.\n109 State Department, Board Meeting.\n110 Anonymized.\n111 State Department, Board Meeting.\n112 Microsoft, Board Meeting.\n\n\n-----\n\nkey that could be used to issue working—though fraudulently issued—tokens that could grant application access to\nmailboxes within the enterprise environment. [113]\n\nIn response, on June 26, 2023, Microsoft launched an overnight investigation focusing on the key and token and\nassessed with high confidence that the threat actor had forged a token using a consumer MSA key that should have\nbeen inactive. Upon confirming that Storm-0558 had forged the token, Microsoft began converging individual\nprocesses into its Software and Services Incident Response Plan (SSIRP), which has different urgency levels based on\nmultiple criteria, including the number of impacted customers. On June 27, 2023, Microsoft assigned this intrusion a\nSEV-0 rating, the highest urgency level. This meant that the incident required robust communication, visibility, and\ncoordination across Microsoft and up to its most senior leadership, including its Board of Directors. [114]\n\nMicrosoft’s incident response plan leverages several specialty teams that coordinate response for large and small\nincidents. While some incidents are local, like a good faith researcher reporting a vulnerability that can be repaired\nwithout needing cross-team coordination, in this case Microsoft leveraged its standardized global security response\nprocesses, allowing it to coordinate across multiple teams and establish separate workstreams for containment,\ncustomer impact, incident notifications, and investigating the key’s exfiltration. For the last workstream, it assembled\nteam members from DART, the Microsoft Threat Intelligence Center (MSTIC), and various security teams to hypothesize\npotential egress points for the key. This collaborative effort generated the three sub-workstreams dedicated to\ninvestigating Microsoft’s 46 hypotheses. [115]\n\nAfter reexamining the 2021 compromise of the engineer and analyzing what Storm-0558 could have accessed using\nthe stolen credentials at that time, Microsoft determined that it needed to expand its investigation to scan for the\npresence of the 2016 MSA key across its network. Microsoft told the Board that it continues to engage in this work.\nAdditionally, after Microsoft put protections in place to prevent future token generation by invalidating the key, it saw\nthe actor experiment and unsuccessfully attempt to generate new tokens. [116, 117] Storm-0558’s use of the invalid key to\nsign authentication requests allowed Microsoft’s teams to determine the scope of the threat actor’s access. [118]\nMicrosoft found no evidence of a breach in the perimeter of the signing system. During the investigation, Microsoft\nexamined the threat actor’s targeting methods, and looked for evidence of a compromise or the introduction of an\nexternal device into the corporate network as possible attack vectors. The investigation uncovered what Microsoft\nbelieves is the precise number of targeted individuals, and enabled Microsoft’s acquisition of the malware that Storm0558 used to sign tokens for accessing OWA. This discovery was pivotal in focusing the search across Microsoft’s logs\nfor any additional threat activity. Microsoft has not yet determined how Storm-0558 obtained the 2016 MSA key and\nsays that it is continuing to investigate. [119]\n\n1.3.2.2 Investigations by Victim Organizations\n\nVictims found it difficult to investigate these intrusions after initial detection because Microsoft could not, or in some\ncases did not, provide victim organizations with holistic visibility into all necessary data. Although Microsoft activated\nenhanced logging for identified victims who did not have the appropriate license, Microsoft could not give historical logs\nto customers unless they already had the premium licenses at the time of the intrusion. Thus, customers could capture\ndata from the time that Microsoft enabled additional logging capabilities but were unable to view past intrusion activity.\n\nState’s SOC had limited visibility into the activity but, based on the particular email accounts that the threat actor\naccessed, quickly determined that the targeted individuals were supporting the Secretary’s upcoming trip to Beijing.\nThis approach significantly aided State in refining its analysis of the activity. Later joined in its response by the National\nSecurity Agency (NSA), CISA, and Microsoft, State confirmed the intrusion into the mailboxes on June 19, 2023. It then\nbegan a comprehensive investigation to understand what was happening and what the actor had exfiltrated. On June\n21, 2023, after issuing a legal process to the U.S.-based VPS provider that hosted the attacker’s infrastructure, the\ngovernment obtained a disk image from the provider that contained valuable insights into the threat actor’s intrusion\n\n113 Anonymized.\n114 Microsoft, Board Meeting.\n115 Microsoft, Board Meeting.\n116 Microsoft, Board Meeting.\n117 Anonymized.\n118 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n119 Microsoft, Board Meeting.\n\n\n-----\n\nattempts and follow-on activity. That same day, the FBI was notified of the intrusion and received this information. In\nparallel with CISA, FBI conducted an independent analysis on the disk image and made its findings available to the\nbroader group. [120]\n\nMicrosoft first notified Commerce’s Office of the Chief Information Officer (OCIO) about the intrusion into the Commerce\nDepartment’s systems on June 23, 2023, one week after State Department’s discovery. According to Microsoft’s initial\nreports, Storm-0558 accessed and exfiltrated data from Commerce on June 21, 2023. [121, 122] However, later audit logs\nprovided by Microsoft showed Storm-0558 had initially accessed Commerce data on June 6, 2023. [123]\n\nCommerce Department’s Enterprise SOC (ESOC) team immediately contacted CISA for assistance, marking the\nbeginning of the entity’s efforts to understand the intrusion. [124] It then asked Microsoft to share relevant logs, and\nMicrosoft provided some data and activated G5 logging. However, Commerce could not view past activity as these logs\nonly captured data from the time that Microsoft enabled the advanced logging. Microsoft told Commerce that it had\nderived some of its information about the incident from additional logging capabilities available to internal Microsoft\nteams for monitoring threat actor behavior. [125, 126] Commerce Department asked Microsoft to share these logs so that it\ncould do its own assessment of the incident, including any potential impact to other subordinate bureaus’ systems.\nMicrosoft shared certain portions of Commerce’s impacted unified audit logs and provided Internet Protocol (IP)\naddresses that the organization could use to search across its network. This incomplete dataset impacted Commerce\nDepartment’s ability to do a complete assessment of the incident. [127]\n\nCommerce Department collected all affected user devices, temporarily suspended impacted mailbox usage, and\ndeployed signatures at its ESOC to monitor for and detect related activity. Commerce also shared all signatures with\nsubordinate Bureaus to deploy. To monitor for follow-on threat activity and identify impact beyond initial reporting,\nCommerce activated G5 logging, but as discussed, it could not analyze historical telemetry for malicious activity\nbecause Microsoft could only provide these logs and data going forward—it had not collected and did not possess the\ndata for earlier activity because Commerce did not have the G5 licenses then. [128]\n\n1.3.2.3 Investigations by Government Incident Responders\n\nOn June 21, 2023, State Department notified the FBI Washington Field Office’s Cyber Task Force that a threat actor\nhad accessed official State mailboxes between June 13 and June 20, 2023. FBI told the Board that Microsoft was\ncritically important to its ability to understand the nature of the compromise, who the targets were, and how the threat\nactor had exploited the vulnerability. Microsoft also helped FBI in continuing to develop proof of high-level attribution to\nStorm-0558 and voluntarily provided indicators of compromise (IoCs) for further investigation. [129]\n\nCISA was a central point for information sharing related to detection, mitigation, and remediation across and between\nfederal agencies, and with private sector partners and victims. It also shared guidance to agencies for how to detect\nthis intrusion, specifically to examine their logs, to the extent that they had access to the G5 service level, for\nunexpected MailItemsAccessed events with irregular application IDs. [130] At the time of the intrusion, CISA was already\nproviding State Department with proactive threat hunting services as part of a routine, by-request engagement. CISA\nshifted to incident response following State’s detection of Storm-0558 activity and analyzed the pattern of threat\nactivity. CISA also collected data and surveyed observations from other stakeholder organizations to search for\ncompromises beyond State. [131]\n\nCISA tried to recreate Storm-0558’s activity but could not replicate the forged token as it did not possess the necessary\nstolen MSA key. Without the 2016 MSA key, CISA could only emulate the incident in a limited way and had to rely on its\nknowledge of Exchange Online and logs from State Department to conduct its investigation. Leveraging tokens it\n\n120 State Department, Board Meeting.\n121 Anonymized.\n122 Commerce Department, Board Meeting.\n123 Commerce Department, Board Meeting.\n124 Commerce Department, Response to Board Request for Information.\n125 Commerce Department, Board Meeting.\n126 Anonymized.\n127 Commerce Department, Board Meeting.\n128 Commerce Department, Board Meeting.\n129 FBI, Board Meeting.\n130 Anonymized.\n131 CISA, Board Meeting.\n\n\n-----\n\ngenerated in OWA, similar to those used by Storm-0558, CISA conducted a test to emulate the application programming\ninterface (API) used by the threat actor to exfiltrate email. Subsequent forensics on the threat actor’s tooling validated\nthat CISA’s emulation accurately reflected Storm-0558’s activities other than the initial token forgery. As a result of this\nemulation work, CISA assessed that the threat actor could not avoid generating the MailItemsAccessed log data during\nthe intrusion, which meant that it could detect similar future activity if it had the relevant logs. [132]\n\nCISA also worked with international partners; the NCSC engaged CISA during the first week of its investigation after\nrealizing the breadth of the intrusion. The NCSC told the Board that the conversations were useful as the NCSC and\nCISA shared information on intrusion impacts and each organization’s respective engagement with Microsoft. [133]\n\nWhile Microsoft has longstanding relationships with CISA, in this instance, Microsoft delayed reaching out to CISA until\nit could confirm additional details of the intrusion. Microsoft did not know the root cause of the intrusion for some time\nand was reluctant to share data with CISA and others until it had more certainty. CISA reached out to Microsoft to share\nits investigative efforts, at which point Microsoft confirmed that it had observed CISA’s replication of the intrusion using\na test commercial tenant. As a result of this outreach, Microsoft further engaged with CISA and provided detailed\nbriefings, disclosing how it had uncovered Storm-0558’s presence within its network and providing details on the\nnature and methodology of the threat actor. During these discussions, Microsoft provided some of the intrusion’s\ntechnical details and gave CISA limited access to its forensics about the threat actor’s infrastructure. [134 ]\n\n\nInternational Partners: NCSC\n\n\nThe U.K. victims did not have enhanced logging capabilities, which inhibited the NCSC’s ability to verify Microsoft’s\nclaims of earlier threat activity. During its response, the NCSC had to balance disabling the compromised\nenvironment with leaving it operational so it could further analyze the intrusion and ensure that Storm-0558 could\nnot regain access if the NCSC’s mitigations failed to close the underlying vulnerability. [135]\n\nBased on Microsoft’s initial advice, the NCSC suspected the threat actor was likely stealing tokens from endpoints,\nparticularly iOS devices. This led the NCSC to gather as many devices as possible from victims over the first two days\nof its investigation. However, this theory proved fruitless, highlighting the difficulty that organizations faced in\ndetermining the intrusion’s attack vector. By the second week of the NCSC’s investigation, Microsoft had revoked the\nkey and the NCSC’s focus shifted from stopping malicious activity to identifying exfiltrated data. Finally, by mid-July,\nthe NCSC turned its attention to examining potentially compromised corporate accounts. [136]\n\n\n#### 1.3.3 VICTIM COORDINATION AND NOTIFICATION\n\nVictim coordination was complicated for this incident as it involved multiple U.S. government agencies, foreign\ngovernments, senior government officials, private sector organizations, and private individuals. While both Microsoft\nand government agencies undertook separate efforts to notify victims, Microsoft had legal and contractual limitations\non what victim information it could share with the government, absent victim consent. [137]\n\nFBI worked with Microsoft to obtain the U.S. victim information, and on July 10, 2023, Microsoft lawfully provided FBI\nwith a list of affected email accounts and related subscriber information for those accounts. FBI engaged directly with\nalmost every victim with an affected personal account. For compromised enterprise accounts, FBI worked with system\nowners, who in turn informed individuals whose accounts were part of the intrusion. [138]\n\nBy July 25, 2023, FBI had identified the owners of nearly all affected accounts and had begun issuing leads to notify\ngovernment officials deemed to have the most sensitive information, in line with FBI Cyber Division policy on victim\nnotification requirements. FBI learned that some victims were unaware that a threat actor had accessed their emails.\nMicrosoft informed FBI that it had notified customers through several methods, including short message service (SMS)\n\n132 CISA, Board Meeting.\n133 NCSC, Board Meeting.\n134 CISA, Board Meeting.\n135 NCSC, Board Meeting.\n136 NCSC, Board Meeting.\n137 Microsoft, Board Meeting.\n138 FBI, Board Meeting.\n\n\n-----\n\ntext messages, nation-state notifications (NSNs), [139] emails sent to recovery accounts (see Figure 2), and pop-up\nmessages via an authenticator application, but some victims told FBI that they viewed these notifications as possible\nspam and disregarded them. As a result, FBI changed its stance and notified every identified account owner through\ncoordination with FBI field offices, Department of Justice (DoJ), CISA, State, and Commerce. FBI provided each victim\nwith a joint Cybersecurity Advisory previously published by FBI and CISA on July 12, 2023, as well as a copy of\nMicrosoft’s blog outlining analysis of Storm-0558 activity and cyber hygiene best practices. [140]\n\n_Figure 2: Microsoft Victim Notification Email_\n\n\nCase Study: Congressman Don Bacon\n\n\nCongressman Don Bacon is a Member of the House of Representatives and currently serves on the House Armed\nServices Committee, including its Strategic Forces and Tactical Air and Land Forces subcommittees. Congressman\nBacon is also a member of the House Taiwan Caucus. [141] As a prominent congressional voice on national security\nmatters, Congressman Bacon is a high-value target for adversarial intelligence-gathering objectives. Microsoft’s first\nnoticed outreach to Congressman Bacon about the intrusion was an email prompting him to change his password,\nsent a month before FBI contacted him. Congressman Bacon thought the password change email looked strange\nand was potentially fraudulent, so he changed his password directly rather than using the link provided in the\nnotification instructions. He later learned from FBI that his personal email had been compromised. FBI assured him\nthat his devices were secure and that he had done nothing wrong; rather, the intrusion originated from a\ncompromise affecting Microsoft. Microsoft did not advise Congressman Bacon to take any action to protect his\naccount beyond the one email recommending a password change. At some point after the initial password change\nemail, Microsoft sent another that provided details about the intrusion, including that Microsoft believed it had been\nsynchronized with Secretary of State Antony Blinken’s visit, June 16 to June 21, 2023, and Commerce Secretary Gina\nRaimondo’s visit, August 27 to August 30, 2023, to China. [142]\n\n\n139 Whenever an organization or individual account holder is targeted or compromised by observed nation-state activities, Microsoft delivers\nan NSN directly to that customer to give them the information they need to investigate the activity. Source: Lambert, John; Microsoft,\n_“Microsoft Digital Defense Report shares new insights on nation-state attacks,” October 25, 2021, https://www.microsoft.com/en-_\n_us/security/blog/2021/10/25/microsoft-digital-defense-report-shares-new-insights-on-nation-state-attacks/_\n140 FBI, Board Meeting.\n141 United States Congress, “Committees and Caucuses,” https://bacon.house.gov/about/committees-and-caucuses.htm\n142 Rep. Don Bacon, Board Meeting.\n\n\n-----\n\nFrom July 4 to July 14, 2023, Microsoft issued notifications to 63 high-profile individuals in the U.K. [143] who were\nidentified as having been directly targeted or compromised by observed nation-state activities. However, the NCSC was\nconcerned that some victims may not pay attention to these notifications even though the notifications may point to a\nwidely reported incident. All Enterprise NSNs explicitly identified Storm-0558 as the PRC-affiliated threat actor, and a\ndedicated team issued an individualized NSN to each affected person. This process is unique to NSNs and is distinct\nfrom the notifications sent to other personal victims via email or other automated methods. [144] The NCSC provided the\nmost sensitive impacted individuals with tailored and dedicated briefings summarizing the intrusion and asked victims\nwhat data may have been exfiltrated from their emails. The NCSC explored all available avenues and obtained the\nvictim identities through a difficult, time-consuming process. [145]\n\n#### 1.3.4 REMEDIATION AND RECOVERY\n\nBetween June 24 and July 3, 2023, to remediate Storm-0558’s activity, Microsoft:\n\n1) revoked the key’s ability to sign tokens and cleared related caching data stored in downstream systems; [146]\n\n2) accelerated an update to change the way that Exchange Online accepted tokens, blocking any requests using\nthe same method as Storm-0558 had used to exploit the vulnerability; [147, 148]\n\n3) fixed the flaw that allowed unauthorized access to enterprise data with consumer keys by updating various\nsoftware packages within its applications and rapidly deploying these updates across its systems; [149]\n\n4) rotated other signing keys for enterprise and consumer tokens, issuing the new keys from enterprise\ninfrastructure that it deemed safer;\n\n5) enhanced how it monitors and alerts for suspicious activities within its identity systems, a process Microsoft\nwas continuing to refine at the time of its discussion with the Board; [150] and\n\n6) developed and tailored contextual guides that detailed the intrusion and provided them to organizations and\nindividual customers. [151]\n\n\nMicrosoft’s Engagement with the PRC Government\n\n\nGiven the culpability of a PRC-affiliated threat actor in this compromise, the Board was pleased to be told that\nMicrosoft first contacted the PRC government only after it had remediated the incident, having its first\ncommunication with the PRC government on August 17, 2023. Typically, Microsoft directly engages with the PRC\ngovernment at a high level after incidents such as this. In this case, Microsoft published a blog in July 2023, and its\nlegal teams engaged in follow-on discussions with the PRC government. [152]\n\n\n### 1.4 PUBLIC REPORTING\n\nOn July 11, 2023, Microsoft published its first blog about the Exchange Online intrusion, disclosing that Storm-0558\nhad used an MSA consumer signing key that enabled it to forge authentication tokens and access Exchange Online and\n\n143 Anonymized.\n144 Anonymized.\n145 NCSC, Board Meeting.\n146 Microsoft, Board Meeting.\n147 Microsoft identified the design flaw within the GetAccessTokensForResources API. Source: Microsoft, “Analysis of Storm-0558 techniques\n_for unauthorized email access,” July 14, 2023, https://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-_\ntechniques-for-unauthorized-email-access/\n148 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n149 Anonymized.\n150 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n151 Microsoft, Board Meeting.\n152 Microsoft, Board Meeting.\n\n\n-----\n\nOutlook accounts. [153] Microsoft stated that it had notified all impacted customers and launched an investigation, [154, 155]\nand publicly named Commerce as an affected entity; however, the Board learned that Microsoft did not provide\nCommerce forewarning that the blog post would publicly name Commerce as an affected entity. [156]\n\nMicrosoft published a second blog on July 14, 2023, filling some gaps in the first blog post, including indicators and\ntechnical details. This second post also provided insights into detecting the attacker infrastructure. Microsoft also\nprovided details on the scale of the intrusion, characteristics of Storm-0558’s infrastructure, and portions of the\nmalware the threat actor had used to conduct the intrusion. [157] Researchers in the security community scrutinized the\ntiming and content of Microsoft’s second blog, and identified gaps and inconsistencies in Microsoft’s public accounts of\nthe intrusion, including tactics, techniques, and procedures (TTPs), IoCs, and indicators of attack (IoA). [158]\n\nIn response to Microsoft’s blogs, Wiz, a cloud security company, launched a limited independent review of the incident.\nWiz concluded that the compromised 2016 MSA key could sign access tokens for many types of applications, far\nbeyond Microsoft’s initial reporting. For Wiz, this revelation underscored the need for a broader awareness and\nproactive measures across all affected stakeholders. [159] CISA also conducted an in-depth review of Microsoft’s public\nstatements. CISA’s findings pointed to the need for greater clarity and transparency from Microsoft about the initial\ncompromise’s blast radius, token scope, and impact. Specifically, CISA noted information gaps in what additional\ncapabilities the stolen key granted the threat actor, Microsoft’s incident response measures, and the potential for\nthreat actors to access internal servers or additional key material. [160]\n\nOn September 6, 2023, Microsoft published a third blog, entitled “Results of Major Technical Investigations for Storm_0558 Key Acquisition.” This blog stated that, “Our investigation found that a consumer signing system crash in April of_\n2021 resulted in a snapshot of the crashed process (‘crash dump’).” The blog went on to say that “a race condition\nallowed the key to be present in the crash dump” and that the crash dump “was subsequently moved from the isolated\nproduction network into our debugging environment on the internet connected corporate network.” Finally, Microsoft\nsaid that the engineer’s account that Storm-0558 had compromised in 2021 “had access to the debugging\nenvironment containing the crash dump which incorrectly contained the key” and while it had no logs showing the\nactual exfiltration, “this was the most probable mechanism by which the actor acquired the key.” [161]\n\nAs Microsoft continued to investigate, it determined that elements of the September 6 blog related to how the actor\nacquired the impacted customer token signing key were likely inaccurate. Microsoft told the Board that although the\nblog stated its “technical investigation has concluded,” it continued to investigate the threat actor and subsequently\ndetermined that while a crash dump could have included key material and that such a dump could have been moved\nout of the secure token signing environment, Microsoft had not found any dump containing this key material, as it had\nmistakenly asserted in the September 6 blog. [162]\n\nDuring the Board’s interview with Microsoft in November 2023, Microsoft told the Board that it was considering issuing\na new or updated blog on its ongoing investigative findings, but that it had not yet made any decisions in that regard. In\nthis meeting, Microsoft confirmed that although its investigation into how the threat actor obtained the key material\nhad been ongoing, it had no change in the number of customers impacted, depth of impact, or time of impact. At that\ntime, Microsoft intended to publish an update to the blog in the near future. [163] In a written response to follow-up\nquestions on this topic from the Board, Microsoft responded, “We believe that describing how the company is\n\n153 MSRC; Microsoft, “Microsoft mitigates China-based threat actor Storm-0558 targeting of customer email,” July 11, 2023,\nhttps://msrc.microsoft.com/blog/2023/07/microsoft-mitigates-china-based-threat-actor-storm-0558-targeting-of-customer-email/\n154 Tamari, Shir; Wiz, “Compromised Microsoft Key: More Impactful Than We Thought,” July 21, 2023, https://www.wiz.io/blog/storm-0558compromised-microsoft-key-enables-authentication-of-countless-micr\n155 Anonymized.\n156 Commerce Department, Board Meeting.\n157 Microsoft Threat Intelligence; Microsoft, “Analysis of Storm-0558 techniques for unauthorized email access,” July 14, 2023,\nhttps://www.microsoft.com/en-us/security/blog/2023/07/14/analysis-of-storm-0558-techniques-for-unauthorized-email-access/\n158 Anonymized.\n159 Tamari, Shir; Wiz, “Compromised Microsoft Key: More Impactful Than We Thought,” July 21, 2023, https://www.wiz.io/blog/storm-0558compromised-microsoft-key-enables-authentication-of-countless-micr\n160 CISA, Board Meeting.\n161 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023,\nhttps://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n162 Microsoft, Board Meeting.\n163 Microsoft, Board Meeting.\n\n\n-----\n\nconsidering updating its public statements would entail disclosure of attorney-client privileged information. However,\nwe will continue to assess the September 6, 2023 blog, including whether to update it, upon completion of the\ninvestigation.” [164]\n\nOn March 12, 2024, Microsoft published an addendum to its September 6 blog that provided further information as it\nrelated to Microsoft's ongoing investigation. In its update, Microsoft clarified that, in the past, its standard debugging\nprocess did not prohibit the ability to move crash dump material out of the secure signing environment, indicating that\nsuch a scenario was once possible. Microsoft’s statement also confirmed that the race condition discussed above\ncould allow the crash dump to move from the secure token signing environment, but would not impact whether the\n2016 MSA key could be present in the crash dump. [165]\n\nUltimately, this March 12 addendum maintained that Microsoft's “leading hypothesis remains that operational errors\nresulted in key material leaving the secure token signing environment that was subsequently accessed in a debugging\nenvironment via a compromised engineering account.” Still, Microsoft did not recant its initial crash dump theory as a\nlikely root cause, as it initially implied in its September 6 blog. [166] At the conclusion of the Board’s review, even in the\ncontext of Microsoft’s March 12 update, Microsoft has not identified a crash dump that contains the 2016 MSA key, or\nany other evidence of the key having been moved inappropriately.\n\n164 Microsoft, Response to Board Request for Information.\n165 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023 (updated March 12,\n2024), https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n166 MSRC; Microsoft, “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” September 6, 2023 (updated March 12,\n2024), https://msrc.microsoft.com/blog/2023/09/results-of-major-technical-investigations-for-storm-0558-key-acquisition/\n\n\n-----\n\n## 2 FINDINGS AND RECOMMENDATIONS\n\n### 2.1 CLOUD SERVICE PROVIDERS\n\n#### 2.1.1 MICROSOFT CORPORATE SECURITY CULTURE\n\nThe Board concludes that Microsoft’s security culture was inadequate. The Board reaches this conclusion based on:\n\n1. the cascade of Microsoft’s avoidable errors that allowed this intrusion to succeed;\n\n2. Microsoft’s failure to detect the compromise of its cryptographic crown jewels on its own, relying instead on a\ncustomer to reach out to identify anomalies the customer had observed;\n\n3. the Board’s assessment of security practices at other CSPs, which maintained security controls that Microsoft\ndid not;\n\n4. Microsoft’s failure to detect a compromise of an employee’s laptop from a recently acquired company prior to\nallowing it to connect to Microsoft’s corporate network in 2021;\n\n5. Microsoft’s decision not to correct, in a timely manner, its inaccurate public statements about this incident,\nincluding a corporate statement that Microsoft believed it had determined the likely root cause of the intrusion\nwhen in fact, it still has not; even though Microsoft acknowledged to the Board in November 2023 that its\nSeptember 6, 2023 blog post about the root cause was inaccurate, it did not update that post until March 12,\n2024, as the Board was concluding its review and only after the Board’s repeated questioning about\nMicrosoft’s plans to issue a correction;\n\n6. the Board’s observation of a separate incident, disclosed by Microsoft in January 2024, the investigation of\nwhich was not in the purview of the Board’s review, which revealed a compromise that allowed a different\nnation-state actor to access highly-sensitive Microsoft corporate email accounts, source code repositories, and\ninternal systems; and\n\n7. how Microsoft’s ubiquitous and critical products, which underpin essential services that support national\nsecurity, the foundations of our economy, and public health and safety, require the company to demonstrate\nthe highest standards of security, accountability, and transparency.\n\nIf Microsoft had not paused manual rotation of keys; if it had completed the migration of its MSA environment to rotate\nkeys automatically; if it had put in place a technical or other control to generate alerts for aging keys, the 2016 MSA key\nwould not have been valid in 2023. Further, if Microsoft had not made the error that allowed consumer keys to\nauthenticate to enterprise customer data (or, alternatively, if it had detected and addressed this flaw), the scope of the\nintrusion would have been far narrower and would not have impacted the State Department, Commerce Department, or\nany other enterprise customers. If Microsoft had deployed alerting or prevention to detect forged tokens that do not\nconform to Microsoft’s own token generation algorithms, this incident likely could also have been stopped or detected\nby Microsoft all on its own. Even after all this, if Microsoft had other security controls in place for its digital identity\nsystem—as the Board finds other CSPs had in place at the time—this intrusion vector could have been blocked or\ndetected. Finally, once State Department alerted Microsoft to the intrusion, Microsoft did not have the logs or other\nforensic data to determine how or when Storm-0558 had stolen the key.\n\nThe decision to completely stop manual rotation of signing keys in 2021 after a large cloud outage, along with failing to\nprioritize the development of an automated key rotation solution, are troubling examples of decision-making processes\nwithin the company that did not prioritize security risk management at a level commensurate with the threat and with\nMicrosoft technology’s vital importance to more than one billion of its customers worldwide. Taken together with the\ninadequate controls in the authentication system to detect and mitigate key theft after multiple attempts by the threat\nactor to compromise identity and authentication systems, including in Operation Aurora in 2009 and RSA SecureID in\n2011—something that all other major CSPs have worked to address in their systems’ architectures—the Board finds\nthat Microsoft had not sufficiently prioritized rearchitecting its legacy infrastructure to address the current threat\nlandscape. In addition, the failure to detect the compromise of an employee’s laptop in an acquired company in 2021,\nprior to allowing it to connect to Microsoft’s corporate network, raises questions about the robustness of Microsoft’s\nM&A compromise assessment program.\n\n\n-----\n\nThe Board is also concerned with Microsoft’s public communications after the incident. In its September 6, 2023 blog\npost entitled “Results of Major Technical Investigations for Storm-0558 Key Acquisition,” Microsoft explained that\nStorm-0558 likely stole the 2016 MSA key in the “crash dump” scenario described above. However, soon after\npublishing that blog, Microsoft determined it did not have any evidence showing that the crash dump contained the\n2016 MSA key. This led Microsoft to assess that the crash dump theory was no longer any more probable than other\ntheories as the mechanism by which the actor had acquired the key, which Microsoft chose to leave uncorrected for\nmore than six months after publishing its September 6 blog.\n\nThe Board is troubled that Microsoft neglected to publicly correct this known error for many months. Customers (private\nsector and government) relied on these public representations in Microsoft’s blogs. The loss of a signing key is a\nserious problem, but the loss of a signing key through unknown means is far more significant because it means that\nthe victim company does not know how its systems were infiltrated and whether the relevant vulnerabilities have been\nclosed off. Left with the mistaken impression that Microsoft has conclusively identified the root cause of this incident,\nMicrosoft’s customers did not have essential facts needed to make their own risk assessments about the security of\nMicrosoft cloud environments in the wake of this intrusion. Microsoft told the Board early in this review that it believed\nthat the errors in the blog were “not material.” The Board disagrees. After several written follow up questions from the\nBoard regarding the blog, Microsoft informed the Board on March 5, 2024, that it would be updating the blog in the\n“near future.” One week following this communication, and more than six months after its publication of the September\n6 blog, Microsoft corrected its mistaken assertions through an addendum to the blog’s existing webpage.\n\nThe Board also takes note of a separate incident that Microsoft disclosed in January 2024. This disclosure revealed a\ncompromise that allowed a different nation-state actor, which Microsoft calls Midnight Blizzard and the U.S.\ngovernment has previously attributed to the Russian Foreign Intelligence Service (SVR), [167] to access highly-sensitive\nMicrosoft corporate email accounts. [168] Nearly two months later, Microsoft published a new blog post stating that\nMidnight Blizzard had also gained unauthorized access to some of Microsoft’s source code repositories and internal\nsystems. [169] While this second intrusion was outside of the scope of the Board’s current review, the Board is troubled\nthat this new incident occurred months after the Exchange Online compromise covered in this review. This additional\nintrusion highlights the Board’s concern that Microsoft has not yet implemented the necessary governance or\nprioritization of security to address the apparent security weaknesses and control failures within its environment and to\nprevent similar incidents in the future.\n\nIndividually, any one of the failings described above might be understandable. Taken together, they point to a failure of\nMicrosoft’s organizational controls and governance, and of its corporate culture around security.\n\nMicrosoft’s products and services are ubiquitous. It is one of the most important technology companies in the world, if\nnot the most important. This position brings with it utmost and global responsibilities. It requires a security-focused\ncorporate culture of accountability, which starts with the CEO, to ensure that financial or other go-to-market factors do\nnot undermine cybersecurity and the protection of Microsoft’s customers.\n\nUnfortunately, throughout this review, the Board identified a series of operational and strategic decisions that\ncollectively point to a corporate culture in Microsoft that deprioritized both enterprise security investments and rigorous\nrisk management. These decisions resulted in significant costs and harm for Microsoft customers around the world.\nThe Board is convinced that Microsoft should address its security culture.\n\nIn 2002, Microsoft’s founder and then-CEO, Bill Gates, wrote an email to the entire Microsoft workforce on the\nimportance of prioritizing security in product development. He wrote:\n\nSo now, when we face a choice between adding features and resolving security issues, we need to\nchoose security. Our products should emphasize security right out of the box, and we must constantly\nrefine and improve that security as threats evolve. A good example of this is the changes we made in\nOutlook to avoid e-mail-borne viruses. If we discover a risk that a feature could compromise someone's\n\n167 CISA, “SVR Cyber Actors Adapt Tactics for Initial Cloud Access,” February 26, 2024, https://www.cisa.gov/news-events/cybersecurityadvisories/aa24-057a\n168 MSRC; Microsoft, “Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard,” January 19, 2024,\nhttps://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/\n169 MSRC; Microsoft, “Update on Microsoft Actions Following Attack by Nation State Actor Midnight Blizzard,” March 8, 2024,\nhttps://msrc.microsoft.com/blog/2024/03/update-on-microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/\n\n\n-----\n\nprivacy, that problem gets solved first. If there is any way we can better protect important data and\nminimize downtime, we should focus on this. These principles should apply at every stage of the\ndevelopment cycle of every kind of software we create, from operating systems and desktop applications\nto global Web services. [170]\n\nThe Board concludes that Microsoft has drifted away from this ethos and needs to restore it immediately as a top\ncorporate priority. The Board is aware of Microsoft’s recent changes to its security leadership and the “Secure Future\nInitiative” that it announced in November 2023. [171] The Board believes that these and other security-related efforts\nshould be overseen directly and closely by Microsoft’s CEO and its Board of Directors, and that all senior leaders should\nbe held accountable for implementing all necessary changes with utmost urgency. The Board recommends the\nfollowing:\n\n  - RECOMMENDATION 1: Microsoft’s customers would benefit from its CEO and Board of Directors directly\nfocusing on the company’s security culture. The CEO and Board should develop, and share publicly, a plan with\nspecific timelines to make fundamental, security-focused reforms across the company and its full suite of\nproducts, and then hold leaders at all levels of the company accountable for its implementation. Given the\ncompany’s critical importance to its more than one billion customers and the national security of this nation\nand, indeed, the entire world, progress in this area should be rapid and substantial.\n\n  - RECOMMENDATION 2: Microsoft leadership should consider directing internal Microsoft teams to deprioritize\nfeature developments across the company’s cloud infrastructure and product suite until substantial security\nimprovements have been made. In all instances, security risks should be fully and appropriately assessed and\naddressed before new features are deployed.\n\n  - RECOMMENDATION 3: As noted in the National Cybersecurity Strategy, “The most capable and best-positioned\nactors in cyberspace must be better stewards of the digital ecosystem. Today, end users bear too great a\nburden for mitigating cyber risks.” [172] Microsoft and all CSPs should heed this call and take accountability for\nthe security outcomes of their customers, ensuring that senior leaders make security a business priority,\ncreating internal incentives and fostering an across-the-board culture to make security a design requirement.\n\n  - RECOMMENDATION 4: The Board notes that some CSPs, including Microsoft until recently, offer granular\nlogging, which can be invaluable in security incident detection, investigation, and response—as a part of a paid\npackage offering to their core services. This course of business should stop. Security-related logging should be\na core element of cloud offerings and CSPs should provide customers the foundational tools that provide them\nwith the information necessary to detect, prevent, or quantify an intrusion, recognizing that many customers\nwill still require additional or third-party analytic capabilities to build a fully mature security program.\n\n#### 2.1.2 CSP CYBERSECURITY PRACTICES\n\nDuring this review, the Board identified best practices drawn from all CSPs that would materially improve the security of\ncloud systems. These include automated regular key rotation; storage of keys in segmented and isolated key systems\n(e.g., hardware security modules [HSMs] or similar); use of stateful token validation; limiting scope of keys (e.g., to\nindividual customers in some cases); use of proprietary data in token generation algorithms that could allow for\ndetection of adversary-forged tokens that may not include such data; and the use of tokens bound to particular\noperations or sessions rather than broad bearer tokens.\n\nAs a result of threat actors targeting authentication and identity systems in the 2009 Operation Aurora intrusions, [173, ]\n\n174 the Board found that other CSPs recognized the importance of addressing this threat model by implementing\ndifferent approaches to secure their identity systems. This is unsurprising and appropriate, as each CSP is different and\n\n170 Wired, “Bill Gates: Trustworthy Computing,” January 17, 2002, https://www.wired.com/2002/01/bill-gates-trustworthy-computing/\n171 Smith, Brad; Microsoft, “A new world of security: Microsoft’s Secure Future Initiative,” November 2, 2023,\nhttps://blogs.microsoft.com/on-the-issues/2023/11/02/secure-future-initiative-sfi-cybersecurity-cyberattacks/\n172 The White House, “National Cybersecurity Strategy,” March 1, 2023, https://www.whitehouse.gov/wpcontent/uploads/2023/03/National-Cybersecurity-Strategy-2023.pdf\n173 Anonymized.\n174 Google, Board Meeting.\n\n\n-----\n\nshould choose a security architecture best suited to its technological infrastructure and customer use cases, such as\nthose demonstrated in the following examples.\n\n  - Google re-worked its identity system to rely as much as possible on stateful tokens, in which every credential is\nassigned a unique identifier at issuance and recorded in a database as irreversible proof that the credential\nGoogle receives is one that it had issued. Google also implemented fully automatic key rotation where possible\nand tightened the validation period for stateless tokens, reducing the window of time for threat actors to locate\nand obtain active keys. Google also undertook a comprehensive overhaul of its infrastructure security including\nimplementing Zero Trust networks and hardware-backed, Fast IDentity Online (FIDO)-compliant two-factor\nauthentication (2FA) to protect these identity systems. [175]\n\n  - Similarly, the Amazon Web Services (AWS) IAM Signature Version 4 (SigV4) protocol provides each customer\nwith unique authentication keys for each of their users or roles, but these keys are not bearer tokens nor are\nthey used directly for signing. Having no tokens, these credentials are not susceptible to token replay. Instead,\nhighly compartmentalized signing keys are cryptography-derived, and each request is signed in a way that can\nonly authorize the same specific action, which can be safely retried. [176]\n\n  - Oracle Cloud Infrastructure also enables and requires each customer tenancy to have its own public-private\nkey pair that signs each request sent on an encrypted Transport Layer Security (TLS) connection, in a\ntoken spoofing-resistant manner. [177]\n\nCSPs should implement security architectures with a level of security commensurate with their critical role in the\necosystem by making decisions through sound engineering practices that are based on an informed threat model. This\nis especially true for core digital identity systems. CSPs should also collect forensics in their production and corporate\nenvironments so that they can determine the true cause of any intrusion (which was not the case with the stolen 2016\nMSA key).\n\nThe Board therefore recommends that CSPs adopt the following security practices, or their equivalents, as needed to\nachieve the high level of security they require.\n\n  - RECOMMENDATION 5: Given Microsoft’s inability to determine how and when the adversary was able to steal\nits signing key, all CSPs should review and revise as appropriate their logging and overall forensics capabilities\naround their identity systems and other systems that enable environment-level compromise, such as root key\nmaterial. CSPs should maintain sufficient forensics to detect exfiltration of those data, including logging all\naccess to those systems and any private keys stored within them. These logs should be analyzed continuously\nfor any unauthorized insider or external threat actor activity. Retention should include all time the key was in\nactive use and extend at least two years beyond the expiration of that key. Longer retention periods of at least\n10 years may be appropriate for some high-value log types.\n\n  - RECOMMENDATION 6: CSPs should engineer their digital identity and credential systems in such a way that\nsubstantially reduces the risk of complete system-level compromise. This should be an overriding, top-priority,\ndesign goal in the engineering process and be informed by a rigorous threat model developed by the CSP in\nresponse to its understanding of the threat landscape. The Board spoke with all major U.S.-based CSPs to gain\nan understanding of their existing practices and develop a set of recommended baseline best practices. While\nthe specific practices implemented may vary for different use cases and situations, the Board believes\ntechnical mechanisms exist today across the industry that can, if broadly implemented, significantly reduce the\nlikelihood of complete system-level compromise. Each of these practices is implemented by at least one major\nCSP, demonstrating their technical feasibility. Some of these practices, while compatible with accepted\nindustry standards, would also benefit from additional standards development, which is discussed in another\nrecommendation. These mechanisms include the following. [178]\n\n175 Google, Board Meeting.\n176 AWS, Board Meeting.\n177 Oracle, Board Meeting.\n178 Each of these mechanisms would have, if in place at the time of the incident, aided in the prevention, impact reduction, or detection of\nthe reviewed incident. For some mechanisms, as outlined in the Facts section and in the Recommendations, partial implementation aided in\nthe response to this incident. Broad implementation across CSPs would enhance the resilience of critical digital identity systems.\n\n\n-----\n\n`o` Stateful tokens: Microsoft’s authentication system accepted a token that it had not issued. By storing\nrecords in a database when tokens are issued and validating against that database at access time, CSPs\nmay enforce that only tokens issued by the CSP can access customer data. Note: this approach is not\npossible for use with third-party services reliant on an IDP maintained by a cloud provider.\n\n`o` Automated frequent key rotation: Microsoft paused manual key rotations for its MSA system in 2021 but\ndid not remove the 2016 MSA key. By rotating encryption keys frequently (e.g., monthly) and in an\nautomated manner with monitoring of rotation systems, CSPs can ensure that the blast radius of a\ncompromised key is limited in duration.\n\n`o` Per customer keys (key scope): Microsoft had a single key that signed tokens for all consumer, and due to\nthe validation flaw, enterprise customers. Tying encryption keys to customer tenancy would limit the scope\nof key compromise.\n\n`o` Bound tokens: Microsoft’s identity system used bearer tokens that did not require any proof of possession,\nthus making the tokens more vulnerable to replay attacks. By digitally binding tokens to specific requests\nor network sessions, token theft and token replay attacks can be eliminated. While this incident\ndemonstrates the risks of key compromise, some victims and responders spent significant time\ninvestigating bearer token replay attacks to which not all CSPs are vulnerable.\n\n`o` Common authentication libraries: Microsoft used a variety of different client libraries to verify tokens\nacross different systems. This diversity complicated implementing uniform, and correct, validation\nbehavior, as well as made the remediation efforts much more complex and time sensitive. By ensuring\nthat all CSP services use the same authentication libraries, CSPs can more effectively enforce consistent\ntoken validation behavior and authorization policy.\n\n`o` Secure key storage: While Microsoft separated the organization and production environments, this\nincident illustrated that Microsoft insufficiently protected MSA system key material. By storing key material\nin isolated systems and leveraging, where feasible, technologies such as dedicated HSMs, the risk of key\ncompromise can be reduced. The Board recognizes that in some situations and levels of scale, traditional\nHSM technology may not be viable but believes that the core idea of isolated key storage with minimal key\nrelease is appropriate.\n\n`o` Linkable tokens: The relationship between the tokens used in this incident was not exposed in logs made\navailable to customers, making them difficult to track. By linking all tokens derived from a single root\nauthentication event together and exposing this linking to their customers in logs, CSPs and customers\ncan better track and discover identity-related attacks and respond, including in an automated way.\n\n`o` Proprietary data use in token generation algorithm: Some CSPs inject proprietary data into their generated\nauthentication tokens, which they can use to differentiate between tokens that their own systems\ngenerated and those generated by malicious third parties. While one cannot rely on the fact that the\nadversary would not detect and reproduce such behavior, it can nevertheless prove potentially helpful as a\n“canary in the coal mine” alert that the CSP is observing tokens that had not been generated by its own\ncode.\n\n- RECOMMENDATION 7: CISA should validate annually with major CSPs that provide services to the U.S.\ngovernment which of these and other applicable security practices they are implementing. CISA should publish\nthe results of its validation review (including stating that a company refused to provide requested information if\nthat is the case).\n\n- RECOMMENDATION 8: The National Institute of Standards and Technology (NIST) and the Risk Management\nFramework (RMF) Joint Task Force (JTF) should update Special Publication (SP) 800-53’s control catalog to\nbetter account for risks to cloud-based digital identity systems, including incorporating the technical\nrecommendations of the Board from this incident, as appropriate.\n\n- RECOMMENDATION 9: Large enterprises need robust compromise assessment and remediation processes for\nentities they acquire or with whom they merge. These processes should recognize that smaller, acquiree\ncompanies may have less robust security procedures and that adversaries may view them as an entry point\n\n\n-----\n\nonto a parent company’s corporate network. This can include targeting them after announcement of an\nacquisition but before closing.\n\n#### 2.1.3 AUDIT LOGGING NORMS \n\nLogging is essential to detection, investigation, and remediation of potential intrusions. In this case, the logs State\nDepartment used to detect this incident (MailItemsAccessed) are of critical value and have enabled detection of other\nnation-state compromises involving Exchange Online. Despite this obvious utility, these logs, and similar logs at other\nCSPs, are not available for all types of critical business data stored by CSPs. The Board recommends the following.\n\n  - RECOMMENDATION 10: CSPs, as part of a CISA-led task force, should define and adopt a minimum standard\nfor default audit logging in cloud services. This standard should, at a minimum, ensure that all access\n(including access by the CSP itself) to customer business data in the cloud produces logs that are available to\nthe customer without additional charges, with a minimum default retention of six months by the CSP.\n\n#### 2.1.4 DIGITAL IDENTITY STANDARDS AND GUIDANCE \n\nThe Board finds that the current ecosystem of Digital Identity standards does not provide the security necessary to\ncounter modern threat actors, and that some CSPs have not sufficiently prioritized implementing emerging standards\nthat improve the security of digital identity systems. This is both a current problem (the need to implement emerging\nstandards) and a long-term need (upleveling the security bar of digital identity standards). The Board recommends the\nfollowing.\n\n  - RECOMMENDATION 11: CSPs should implement emerging standards such as Open Authorization (OAuth) 2\nDemonstrating Proof-of-Possession (DPoP) (bound tokens) and OpenID Shared Signals and Events (SSE)\n(sharing session risk) that better secure cloud services against credential related attacks.\n\n  - RECOMMENDATION 12: Relevant standards bodies should refine and update these standards to account for a\nthreat model of advanced nation-state attackers targeting core CSP identity systems.\n\n  - RECOMMENDATION 13: CSPs and relevant standards bodies, such as OpenID Foundation (OIDF), Organization\nfor the Advancement of Structured Information Standards (OASIS), and The Internet Engineering Task Force\n(IETF), should develop or update profiles for core digital identity standards such as OIDC and Security Assertion\nMarkup Language (SAML) to include requirements and/or security considerations around key rotation, stateful\ncredentials, credential linking, and key scope.\n\n#### 2.1.5 CSP TRANSPARENCY\n\nCustomers rely on CSPs for more than their cloud services—they rely on CSPs to be transparent about security incidents\nand vulnerabilities, as these disclosures will influence decisions the customers make about their own risk tolerance\nand investment decisions, along with necessary transparency to their own customers, clients, and regulators. Moreover,\nthese customers reasonably expect that CSPs will update them, in a timely manner, about security incidents as\ninvestigations evolve, including correcting any information that later proves to be wrong. Finally, the U.S. government\nrelies on CSPs to share information about incidents with a potential national security nexus, including suspected nationstate intrusions. During its review, the Board finds that Microsoft fell short, as, for many months, it chose to not update\nthe September 6 blog that incorrectly implied that the 2016 MSA key had been stolen from a crash dump and that it\nhad identified and corrected the issues that led to the adversary stealing the key.\n\nThe Board recommends that all CSPs adopt transparency and disclosure practices commensurate with their customers’\nneeds and expectations, including the following.\n\n  - RECOMMENDATION 14: U.S.-based CSPs should report all incidents suspected to have been perpetrated by an\nactor affiliated with a nation-state targeting their infrastructure and corporate systems to the U.S. government,\neven in the absence of a regulatory obligation to report. Separately, CISA and the Office of Management and\nBudget (OMB) should consider appropriate contractual provisions with CSPs to require such reporting. [179]\n\n179 CISA, “Cyber Incident Reporting for Critical Infrastructure Act of 2022,” March 9, 2022, https://www.cisa.gov/sites/default/files/202301/Cyber-Incident-Reporting-ForCriticalInfrastructure-Act-o-f2022_508.pdf\n\n\n-----\n\n  - RECOMMENDATION 15: CSPs should be transparent to U.S. government agencies, customers, and other\nstakeholders on what they know as well as what they do not know when initially investigating a cyber incident.\n\n  - RECOMMENDATION 16: CSPs should promptly correct significant factual inaccuracies as they discover them in\ntheir public or customer statements.\n\n  - RECOMMENDATION 17: CSPs should commit to disclosing through the CVE process all vulnerabilities, including\nflaws such as the one in Microsoft's token validation logic and those that do not require customer action to\npatch. CSPs should work with the CVE program to develop necessary updates to Common Weakness\nEnumeration (CWE) to account for the particulars of cloud environments. CSPs should collaborate with the CVE\nProgram to develop these norms and commit to timely and comprehensive disclosure of these vulnerabilities,\nenabling organizations to make thoughtful risk decisions about all their vendors’ security programs, including\ncloud services. The Board believes that incorporating all known vulnerabilities across the entire technology\nstack in CVE’s comprehensive repository would be a public benefit for industry and government customers, as\nwell as security researchers.\n\n#### 2.1.6 VICTIM NOTIFICATION PROCESSES\n\nVictim notification in cyber incidents is never simple and can be even more complicated when attackers compromise\ncloud-based services. In this intrusion, the Board found that some victims ignored or did not see the notifications, and\nsome who saw them believed them to be spam or phishing. In some cases, Storm-0558 compromised the personal\naccounts of some government employees, but Microsoft was initially unable to share the employee’s names with their\nemployer due to legal restrictions and recommended the U.S. government issue a warrant for the information so it\ncould provide those details. This impacted and delayed the agencies’ ability to aid their employees in responding to that\naspect of the intrusion.\n\nThe Board recommends that CSPs and the U.S. government improve processes for notifying individuals of intrusions,\nincluding ensuring receipt of such notifications, to include the following.\n\n  - RECOMMENDATION 18: CSPs and the U.S. government, in conjunction with major mobile device platform\nvendors, should develop a targeted, quickly recognizable “amber alert” style victim notification mechanism for\nhigh-impact situations. The alert should be more readily distinguishable from notification emails, which are\nfrequently mistaken by victims for phishing, building on some existing mechanisms for NSNs within platform\nproviders’ ecosystems where the mobile device operating system can send a native system alert about the\ncompromise of an end user’s CSP account, such as a push notification.\n\n  - RECOMMENDATION 19: CSPs should develop a process to identify and categorize high-impact incidents\ninvolving compromised accounts that present higher risks to national security, such as those of government\nofficials. CSPs should verify whether the victim is in receipt of the notifications; provide guidance to the victim\non how they can further protect their information; and detail next steps based on the severity or type of\nincident, particularly when the victim is targeted by a nation-state actor.\n\n  - RECOMMENDATION 20: CSPs and the U.S. government should develop mechanisms to incentivize and enable\nCSPs to connect victims with the appropriate U.S. government resources, international partners, and different\nsets of victims. These mechanisms should enable collaborative investigation and sharing of best practices to\nbreak down silos and barriers that create independent and duplicative investigative workstreams, even within\nU.S. government and allied partner agencies.\n\n### 2.2 U.S. GOVERNMENT\n\n#### 2.2.1 SECURITY STANDARDS AND COMPLIANCE FRAMEWORKS\n\nA large, vibrant, and diverse ecosystem of secure cloud services is important for the economic competitiveness of the\nU.S. and the execution of the U.S. government’s varied missions.\n\nCloud services are a critical component of the cybersecurity ecosystem, especially when they protect the most sensitive\ngovernment data. However, the Board finds that existing compliance requirements for government cybersecurity do not\nconsistently require sound practices around key management or token issuance. To address this, the Federal Risk\n\n\n-----\n\nAuthorization Management Program (FedRAMP) can play a key role in ensuring stronger cybersecurity practices,\nincluding in cloud-based digital identity, across the cloud service ecosystem.\n\n\nFedRAMP\n\n\nFedRAMP was established by OMB in December 2011 to promote the adoption of secure cloud services across the\nfederal government by providing a standardized approach to security and risk assessment for cloud technologies\nand federal agencies.\n\nThe General Services Administration (GSA) operates the FedRAMP Program Management Office (PMO) and is\ngoverned by the FedRAMP Board. FedRAMP leverages many controls that are published in NIST SP 800-53 “Security\nand Privacy Controls for Information Systems and Organizations.”\n\n\nThe Board concludes that a more flexible tailoring of security controls for cloud-based digital identity systems provides a\npath to balance the importance of securing these systems with the other important goal of supporting such an\necosystem. To that end, the Board recommends updating both the FedRAMP program itself as well as the supporting\nframeworks that implement the Federal Information Security Modernization Act (FISMA) such as the NIST RMF.\nSpecifically, the Board recommends the following.\n\n  - RECOMMENDATION 21: FedRAMP, in coordination with OMB and CISA, should establish a minimum threshold\nfor periodically re-evaluating legacy FedRAMP authorization packages. For example, some FedRAMP authorized\npackages are for services that have become especially widely used across the government while others may be\nconsidered High Value Assets (HVA) that may merit more regular review. FedRAMP should consult with CISA\nand NIST to identify additional relevant security requirements for critical components (such as digital identity\naccess) of these higher-risk FedRAMP authorized providers, and how to effectively tailor security baselines to\nfocus cloud provider effort on addressing these requirements. This threshold should drive the priority in which\nFedRAMP PMO re-reviews FedRAMP authorized security packages for continuous data monitoring.\n\n  - RECOMMENDATION 22: FedRAMP should work with OMB to establish a Technical Advisory Group (TAG). The\nTAG should be available to FedRAMP for consultation for technical, strategic, and operational direction. The\nTAG should regularly provide recommendations on security best practices and ways to iteratively improve\nFedRAMP continuous monitoring requirements and guidance.\n\n  - RECOMMENDATION 23: FedRAMP should establish a process for conducting discretionary special reviews of\nFedRAMP authorized Cloud Service Offerings (CSOs) that convene security experts within the federal\ngovernment to make recommendations for security improvements for the CSO. Recommendations from these\nreviews should inform the issuance (or continuation) of a FedRAMP authorization. FedRAMP should establish\ncriteria for these reviews that limit their scope to especially high-impact situations.\n\n  - RECOMMENDATION 24: FedRAMP should strengthen the minimum audit logging standards (e.g., FedRAMP\nAssignment of AU-2) to align with the goal of logging access to sensitive business data (including by the CSP\nitself). FedRAMP should further require that these logs be made available to customers (not just the CSP itself)\nat no additional cost.\n\n  - RECOMMENDATION 25: NIST is encouraged to continue releasing point updates to add and remove controls\nfrom its security and privacy control baselines to maintain focus on contemporary threats, and to consult with\nthe FedRAMP program to incorporate feedback about observed threats and incidents related to cloud provider\nsecurity.\n\n\n-----\n\n## APPENDIX A: REVIEW PARTICIPANTS – EXTERNAL PARTIES\n\nThe Board’s review involved organizations and individuals representing a variety of viewpoints, including targeted\norganizations, law enforcement, CSPs, cloud security, incident response, regulators, cybersecurity and industry experts,\nand others. The Board requested information in the form of briefings and written materials.\n\nThe Board is grateful for the voluntary participation of those parties that provided timely responses. Their efforts helped\nthe Board collect the observable timeline of events, corroborate facts, and understand the complex and nuanced\ndimensions of the Microsoft Exchange Online intrusion and related cloud identity topics.\n\n### RELATED BRIEFINGS \n\nThe Board engaged with 20 organizations with expertise in cloud security, cloud identity, and/or the Microsoft Exchange\nOnline intrusion. Those organizations are identified below.\n\n  - Amazon Web Services, Inc.\n\n  - Broadcom Inc.\n\n  - Canadian Centre for Cyber Security\n\n  - CrowdStrike Holdings, Inc.\n\n  - Cybersecurity and Infrastructure Security Agency (CISA)\n\n  - Federal Bureau of Investigation (FBI)\n\n  - Federal Risk and Authorization Management Program (FedRAMP)\n\n  - Google LLC\n\n  - International Business Machines Corporation (IBM)\n\n  - Lacework, Inc.\n\n  - Mandiant, Inc.\n\n  - Microsoft Corporation\n\n  - National Security Agency (NSA)\n\n  - Office of the Director of National Intelligence (ODNI)\n\n  - Office of Representative Don Bacon\n\n  - Oracle Corporation\n\n  - U.K. National Cyber Security Centre (NCSC)\n\n  - U.S. Department of Commerce\n\n  - U.S. Department of State\n\n  - Wiz Inc.\n\n\n-----\n\n## APPENDIX B: MICROSOFT EXCHANGE ONLINE INTRUSION TIMELINE\n\n_Figure 3: Microsoft Exchange Online Intrusion Timeline_\n\n\n-----\n\n## APPENDIX C: REVIEW PARTICIPANTS – CSRB MEMBERS\n\nThe Cyber Safety Review Board members listed below participated in the review of the Summer 2023 Microsoft\nExchange Online intrusion in the following roles and capacity.\n\nFederal members serve in their official capacity and act on behalf of their agency or department. Private sector\nmembers have been appointed as Special Government Employees (SGEs) for the purposes of serving on the Cyber\nSafety Review Board. SGEs serve in their individual capacity, though current affiliations are included in the list below.\n\nRobert Silvers, (Chair), Under Secretary for Policy, representing the Department of Homeland Security\n\nDmitri Alperovitch, (Deputy _Chair), Co-Founder and Chairman, Silverado Policy Accelerator_\n\nJake Braun, Acting Principal Deputy National Cyber Director, representing the Office of the National Cyber Director\n\nJerry Davis, Senior Vice President, Cyber Operations and Technology, Truist Bank\n\nChris DeRusha, Federal Chief Information Security Officer, representing the Office of Management and Budget\n\nEric Goldstein, Executive Assistant Director for Cybersecurity, representing the Cybersecurity and Infrastructure\nSecurity Agency\n\nRob Joyce, Director of Cybersecurity, representing the National Security Agency\n\nCynthia Kaiser, Deputy Assistant Director, representing the Federal Bureau of Investigation\n\nMarshall Miller, Principal Associate Deputy Attorney General, representing the Department of Justice\n\nChris Novak, Co-Founder and Managing Director, Verizon Threat Research Advisory Center\n\nTony Sager, Senior Vice President and Chief Evangelist, Center for Internet Security\n\nJohn Sherman, Chief Information Officer, representing the Department of Defense\n\n\n-----\n\n## APPENDIX D: ACRONYMS\n\n2FA two-factor authentication\n\nAD Active Directory\n\nAPAC Asia-Pacific\n\nAPI application programming interface\n\nAWS Amazon Web Services\n\nCEO Chief Executive Officer\n\nCISA Cybersecurity and Infrastructure Security Agency\n\nCSO Cloud Service Offering\n\nCSP cloud service provider\n\nCSRB Cyber Safety Review Board, or the Board\n\nCVE common vulnerability and exposure\n\nCWE Common Weakness Enumeration\n\nDART Detection and Response Team\n\nDoJ Department of Justice\n\nDPoP Demonstrating Proof-of-Possession\n\nESOC Enterprise Security Operations Center\n\nFBI Federal Bureau of Investigation\n\nFedRAMP Federal Risk Authorization Management Program\n\nFIDO Fast IDentity Online\n\nFISMA Federal Information Security Modernization Act\n\nGSA General Services Administration\n\nHSM hardware security module\n\nHVA High Value Asset\n\nIAM identity and access management\n\nIDP identity provider\n\nIETF The Internet Engineering Task Force\n\nIoA indicator of attack\n\nIoC indicator of compromise\n\nIP Internet Protocol\n\nJTF Joint Task Force\n\n\n-----\n\nM&A mergers and acquisitions\n\nMSA Microsoft Services Account\n\nMSTIC Microsoft Threat Intelligence Center\n\nNCSC National Cyber Security Centre\n\nNIST National Institute of Standards and Technology\n\nNSA National Security Agency\n\nNSN nation-state notification\n\nOASIS Organization for the Advancement of Structured Information Standards\n\nOCIO Office of the Chief Information Officer\n\nOIDC OpenID Connect\n\nOIDF OpenID Foundation\n\nOMB Office of Management and Budget\n\nOWA Outlook Web Access\n\nPMO Project Management Office\n\nPRC People’s Republic of China\n\nRMF Risk Management Framework\n\nSAML Security Assertion Markup Language\n\nSDK software development kit\n\nSigv4 Signature Version 4\n\nSMS short message service\n\nSOC security operations center\n\nSSIRP Software and Services Incident Response Plan\n\nSVR Russian Foreign Intelligence Service\n\nTAG Technical Advisory Group\n\nTLS Transport Layer Security\n\nTTPs tactics, techniques, and procedures\n\nU.K. United Kingdom\n\nU.S. United States\n\nVPS virtual private server\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.cisa.gov/sites/default/files/2024-04/CSRB_Review_of_the_Summer_2023_MEO_Intrusion_Final_508c.pdf"
    ],
    "report_names": [
        "CSRB_Review_of_the_Summer_2023_MEO_Intrusion_Final_508c.pdf"
    ],
    "threat_actors": [
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "57d2c58d-0445-441f-b94f-99d217b9e3c4",
            "created_at": "2023-01-06T13:46:38.327743Z",
            "updated_at": "2025-03-27T02:00:02.805939Z",
            "deleted_at": null,
            "main_name": "Beijing Group",
            "aliases": [
                "SIG22",
                "G0066",
                "SNEAKY PANDA",
                "Elderwood",
                "Elderwood Gang"
            ],
            "source_name": "MISPGALAXY:Beijing Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "86fb4ddd-989e-4613-8db8-ca646c553aae",
            "created_at": "2023-11-01T02:00:07.404201Z",
            "updated_at": "2025-03-27T02:00:03.144548Z",
            "deleted_at": null,
            "main_name": "Storm-0558",
            "aliases": [],
            "source_name": "MISPGALAXY:Storm-0558",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1c762729-56f7-48d5-8fb0-b64a43716319",
            "created_at": "2023-09-07T02:02:47.944899Z",
            "updated_at": "2025-03-27T02:02:10.14702Z",
            "deleted_at": null,
            "main_name": "Storm-0558",
            "aliases": [],
            "source_name": "ETDA:Storm-0558",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "SinoChopper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a339e456-3f5a-40e9-b293-233281105e85",
            "created_at": "2022-10-25T15:50:23.260847Z",
            "updated_at": "2025-03-27T02:00:55.411558Z",
            "deleted_at": null,
            "main_name": "Elderwood",
            "aliases": [
                "Elderwood",
                "Elderwood Gang",
                "Beijing Group",
                "Sneaky Panda"
            ],
            "source_name": "MITRE:Elderwood",
            "tools": [
                "PoisonIvy",
                "Naid",
                "Briba",
                "Hydraq",
                "Linfo",
                "Nerex",
                "Vasport",
                "Wiarp",
                "Pasam",
                "Darkmoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "86fd71d3-06dc-4b73-b038-cedea7b83bac",
            "created_at": "2022-10-25T16:07:23.330793Z",
            "updated_at": "2025-03-27T02:02:09.740703Z",
            "deleted_at": null,
            "main_name": "APT 17",
            "aliases": [
                "APT 17",
                "ATK 2",
                "Beijing Group",
                "Bronze Keystone",
                "Deputy Dog",
                "Elderwood",
                "Elderwood Gang",
                "Operation Aurora",
                "Operation DeputyDog",
                "Operation Ephemeral Hydra",
                "Operation RAT Cook",
                "SIG22",
                "Sneaky Panda",
                "TEMP.Avengers",
                "TG-8153",
                "Tailgater Team"
            ],
            "source_name": "ETDA:APT 17",
            "tools": [
                "9002 RAT",
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "Briba",
                "Chymine",
                "Comfoo",
                "Comfoo RAT",
                "Darkmoon",
                "DeputyDog",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Jumpall",
                "Kaba",
                "Korplug",
                "Linfo",
                "MCRAT.A",
                "McRAT",
                "MdmBot",
                "Mdmbot.E",
                "Moudour",
                "Mydoor",
                "Naid",
                "Nerex",
                "PCRat",
                "PNGRAT",
                "Pasam",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Naid",
                "Vasport",
                "Wiarp",
                "Xamtrav",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1713319449,
    "ts_updated_at": 1743041809,
    "ts_creation_date": 1711356900,
    "ts_modification_date": 1712080238,
    "files": {
        "pdf": "https://archive.orkl.eu/f23ca875ba620223aaad8f04fbbf2a67872df1d8.pdf",
        "text": "https://archive.orkl.eu/f23ca875ba620223aaad8f04fbbf2a67872df1d8.txt",
        "img": "https://archive.orkl.eu/f23ca875ba620223aaad8f04fbbf2a67872df1d8.jpg"
    }
}