{
    "id": "7f1bcd45-ee1b-490b-8fea-adae8cabca65",
    "created_at": "2023-01-12T15:00:57.552917Z",
    "updated_at": "2025-03-27T02:12:08.786869Z",
    "deleted_at": null,
    "sha1_hash": "3c8d217ea275b96d7c43fa6594e9603029b70e08",
    "title": "2016-11-21 - PrincessLocker – ransomware with not so royal encryption",
    "authors": "",
    "file_creation_date": "2022-05-06T08:48:55Z",
    "file_modification_date": "2022-05-06T08:48:55Z",
    "file_size": 3948980,
    "plain_text": "# Alert (AA22-083A) More Alerts\n\n## Tactics, Techniques, and Procedures of Indicted State-Sponsored Russian Cyber Actors Targeting the Energy Sector\n\nOriginal release date: March 24, 2022\n\n## Summary\n\nActions to Take Today to Protect Energy Sector Networks:\n\n     - Implement and ensure robust network segmentation between IT and ICS networks.\n\n     - Enforce MFA to authenticate to a system.\n\n     - Manage the creation of, modification of, use of—and permissions associated with—privileged\naccounts.\n\nThis joint Cybersecurity Advisory (CSA)—coauthored by the Cybersecurity and Infrastructure\nSecurity Agency (CISA), the Federal Bureau of Investigation (FBI), and the Department of Energy\n(DOE)—provides information on multiple intrusion campaigns conducted by state-sponsored\nRussian cyber actors from 2011 to 2018 and targeted U.S. and international Energy Sector\norganizations. CISA, the FBI, and DOE responded to these campaigns with appropriate action in and\naround the time that they occurred. CISA, the FBI, and DOE are sharing this information in order to\nhighlight historical tactics, techniques, and procedures (TTPs) used by adversaries to target U.S. and\ninternational Energy Sector organizations.\n\nOn March 24, 2022, the U.S. Department of Justice unsealed indictments of three Russian Federal\nSecurity Service (FSB) officers and a Russian Federation Central Scientific Research Institute of\nChemistry and Mechanics (TsNIIKhM) employee for their involvement in the following intrusion\n[campaigns against U.S. and international oil refineries, nuclear facilities, and energy companies.[1]](https://www.justice.gov/opa/pr/four-russian-government-employees-charged-two-historical-hacking-campaigns-targeting-critical)\n\nGlobal Energy Sector Intrusion Campaign, 2011 to 2018: the FSB conducted a multi-stage\ncampaign in which they gained remote access to U.S. and international Energy Sector networks,\ndeployed ICS-focused malware, and collected and exfiltrated enterprise and ICS-related data.\n\nOne of the indicted FSB officers was involved in campaign activity that involved deploying\nHavex malware to victim networks.\nThe other two indicted FSB officers were involved in activity targeting U.S. Energy Sector\nnetworks from 2016 through 2018.\nCompromise of Middle East-based Energy Sector organization with TRITON Malware, 2017:\nRussian cyber actors with ties to the TsNIIKhM gained access to and leveraged TRITON (also\nknown as HatMan) malware to manipulate a foreign oil refinery’s ICS controllers. TRITON was\ndesigned to specifically target Schneider Electric’s Triconex Tricon safety systems and is capable\n\nf di i h S h id El i h i d h i i h i k f h\n\n\n-----\n\nremain vigilant against these threat actors’ TTPs.\n\nThe indicted TsNIIKhM cyber actor is charged with attempt to access U.S. protected computer\nnetworks and to cause damage to an energy facility.\nThe indicted TsNIIKhM cyber actor was a co-conspirator in the deployment of the TRITON\nmalware in 2017.\n\nThis CSA provides the TTPs used by indicted FSB and TsNIIKhM actors in cyber operations against\nthe global Energy Sector. Specifically, this advisory maps TTPs used in the global Energy Sector\ncampaign and the compromise of the Middle East-based Energy Sector organization to the MITRE\n[ATT&CK for Enterprise and ATT&CK for ICS frameworks.](https://attack.mitre.org/versions/v10/matrices/enterprise/)\n\nCISA, the FBI, and DOE assess that state-sponsored Russian cyber operations continue to pose a\nthreat to U.S. Energy Sector networks. CISA, the FBI, and DOE urge the Energy Sector and other\ncritical infrastructure organizations to apply the recommendations listed in the Mitigations section\nof this advisory and Appendix A to reduce the risk of compromise.\n\nFor more information on Russian state-sponsored malicious cyber activity, see CISA's Russia Cyber\nThreat Overview and Advisories webpage. For more information on the threat of Russian statesponsored malicious cyber actors to U.S. critical infrastructure as well as additional mitigation\nrecommendations, see joint CSA Understanding and Mitigating Russian State-Sponsored Cyber\n[Threats to U.S. Critical Infrastructure and CISA's Shields Up Technical Guidance webpage.](https://www.cisa.gov/uscert/shields-technical-guidance)\n\n### Rewards for Justice Program\n\nIf you have information on state-sponsored Russian cyber operations targeting U.S. critical\ninfrastructure, contact the Department of State’s (DOS) Rewards for Justice program. You may be\neligible for a reward of up to $10 million, which DOS is offering for information leading to the\nidentification or location of any person who, while acting under the direction or control of a foreign\ngovernment, participates in malicious cyber activity against U.S. critical infrastructure in violation of\nthe Computer Fraud and Abuse Act (CFAA). Contact +1-202-702-7843 on WhatsApp, Signal, or\nTelegram, or send information via the Rewards for Justice secure Tor-based tips line located on the\n[Dark Web. For more details refer to rewardsforjustice.net.](https://rewardsforjustice.net/rewards/foreign-malicious-cyber-activity-against-u-s-critical-infrastructure/)\n\n[Click here for a PDF version of this report.](https://www.cisa.gov/uscert/sites/default/files/publications/AA22-083A_TTPs_of_Indicted_State-Sponsored_Russian_Cyber_Actors_Targeting_the_Energy_Sector.pdf)\n\n## Technical Details\n\nNote: This advisory uses the MITRE ATT&CK® for Enterprise framework, version 10, and the ATT&CK\n[for ICSs framework. See the ATT&CK for Enterprise and ATT&CK for ICS frameworks for all referenced](https://attack.mitre.org/versions/v10/matrices/enterprise/)\nthreat actor tactics and techniques.\n\n### Global Energy Sector Intrusion Campaign, 2011 to 2018\n\nFrom at least 2011 through 2018, the FSB (also known as Berserk Bear, Energetic Bear, TeamSpy,\nDragonfly, Havex, Crouching Yeti, and Koala) conducted an intrusion campaign against international\nand U.S. Energy Sector organizations. The threat actor gained remote access to and deployed\nmalware designed to collect ICS-related information on compromised Energy Sector networks, and\nexfiltrated enterprise and ICS data.\n\nBeginning in 2013 and continuing through 2014, the threat actor leveraged Havex malware on\nEnergy Sector networks. The threat actor gained access to these victim networks via spearphishing\n\n\n-----\n\nmalware, which infected systems of users who downloaded the compromised updates.\n\nHavex is a remote access Trojan (RAT) that communicates with a command and control (C2) server.\nThe C2 server deploys payloads that enumerate all collected network resources and uses the Open\nPlatform Communications (OPC) standard to gather information about connected control systems\ndevices and resources within the network. Havex allowed the actor to install additional malware and\nextract data, including system information, lists of files and installed programs, e-mail address\nbooks, and virtual private network (VPN) configuration files. The Havex payload can cause common\nOPC platforms to crash, which could cause a denial-of-service condition on applications that rely on\nOPC communications. Note: for additional information on Havex, see to CISA ICS Advisory ICS\n[Focused Malware and CISA ICS Alert ICS Focused Malware (Update A).](https://us-cert.cisa.gov/ics/alerts/ICS-ALERT-14-176-02A)\n\nBeginning in 2016, the threat actor began widely targeting U.S. Energy Sector networks. The actor\nconducted these attacks in two stages: first targeting third-party commercial organizations (such as\nvendors, integrators, and suppliers) and then targeting Energy Sector organizations. The threat actor\nused the compromised third-party infrastructure to conduct spearphishing, watering hole, and\nsupply chain attacks to harvest Energy Sector credentials and to pivot to Energy Sector enterprise\nnetworks. After obtaining access to the U.S. Energy Sector networks, the actor conducted network\ndiscovery, moved laterally, gained persistence, then collected and exfiltrated information pertaining\nto ICS from the enterprise, and possibly operational technology (OT), environments. Exfiltrated\ninformation included: vendor information, reference documents, ICS architecture, and layout\ndiagrams.\n\nFor more detailed information on FSB targeting of U.S. Energy Sector networks, See CISA Alert\n[Russian Government Cyber Activity Targeting Energy Sector and Other Critical Infrastructure Sectors.](https://us-cert.cisa.gov/ncas/alerts/TA18-074A)\n\nRefer to Appendix A for TTPs of Havex malware and TTPs used by the actor in the 2016 to 2018\ntargeting of U.S. Energy Sector networks, as well as associated mitigations.\n\n### Compromise of Middle East-based Energy Sector Organization with TRITON Malware, 2017\n\nIn 2017, Russian cyber actors with ties to TsNIIKhM gained access to and manipulated a foreign oil\nrefinery’s safety devices. TsNIIKhM actors used TRITON malware on the ICS controllers, which\nresulted in the refinery shutting down for several days.\n\nTRITON is a custom-built, sophisticated, multi-stage malware affecting Schneider Electric’s Triconex\nTricon, a safety programmable logic controller (PLC) (also referred to as a safety instrumented\nsystem [SIS]), which monitors industrial processes to prevent hazardous conditions. TRITON is\ncapable of directly interacting with, remotely controlling, and compromising these safety systems.\nAs these systems are used in a large number of environments, the capacity to disable, inhibit, or\nmodify the ability of a process to fail safely could result in physical consequences. Note: for\nadditional information on affected products, see to CISA ICS Advisory Schneider Electric Triconex\nTricon (Update B).\n\nTRITON malware affects Triconex Tricon PLCs by modifying in-memory firmware to add additional\nprogramming. The extra functionality allows an attacker to read/modify memory contents and\nexecute custom code, disabling the safety system.\n\n\n-----\n\nand malicious shellcode that contains an injector and a payload. For detailed information on\nTRITON’s components, refer to CISA Malware Analysis Report (MAR): HatMan: Safety System\nTargeted Malware (Update B).\n\nNote: the indicted TsNIIKhM cyber actor was also involved in activity targeting U.S. Energy Sector\ncompanies in 2018, and other TsNIIKhM-associated actors have targeted a U.S.-based company’s\nfacilities in an attempt to access the company’s OT systems. To date, CISA, FBI, and DOE have no\ninformation to indicate these actors have intentionally disrupted any U.S. Energy Sector\ninfrastructure.\n\nRefer to Appendix A for TTPs used by TRITON as well as associated mitigations.\n\n## Mitigations\n\n### Enterprise Environment\n\nCISA, the FBI, and DOE recommend Energy Sector and other critical infrastructure organizations\nimplement the following mitigations to harden their corporate enterprise network. These\nmitigations are tailored to combat multiple enterprise techniques observed in these campaigns\n(refer to Appendix A for observed TTPs and additional mitigations).\n\nPrivileged Account Management\n\nManage the creation of, modification of, use of—and permissions associated with—privileged\naccounts, including `SYSTEM and root.`\n\nPassword Policies\n\nSet and enforce secure password policies for accounts.\n\nDisable or Remove Features or Programs\n\nRemove or deny access to unnecessary and potentially vulnerable software to prevent abuse by\nadversaries.\n\nAudit\n\nPerform audits or scans of systems, permissions, insecure software, insecure configurations, etc.,\nto identify potential weaknesses.\n\nOperating System Configuration\n\nMake configuration changes related to the operating system or a common feature of the\noperating system that result in system hardening against techniques.\n\nMultifactor Authentication\n\nEnforce multifactor authentication (MFA) by requiring users to provide two or more pieces of\ninformation (such as username and password plus a token, e.g., a physical smart card or token\ngenerator) to authenticate to a system.\n\nFilter Network Traffic\n\nUse network appliances to filter ingress or egress traffic and perform protocol-based filtering.\nConfigure software on endpoints to filter network traffic.\n\nNetwork Segmentation\n\nArchitect sections of the network to isolate critical systems, functions, or resources. Use physical\n\n\n-----\n\nfrom the internal network.\n\nLimit Access to Resources over the Network\n\nPrevent access to file shares, remote access to systems, and unnecessary services. Mechanisms\nto limit access may include use of network concentrators, Remote Desktop Protocol (RDP)\ngateways, etc.\n\nExecution Prevention\n\nBlock execution of code on a system through application control, and/or script blocking.\n\n### Industrial Control System Environment\n\nCISA, the FBI, and DOE recommend Energy Sector and other critical infrastructure organizations\nimplement the following mitigations to harden their ICS/OT environment.\n\nNetwork Segmentation\n\nImplement and ensure robust network segmentation between IT and ICS networks to limit the\nability of cyber threat actors to move laterally to ICS networks if the IT network is compromised.\n\nImplement a network topology for ICS that has multiple layers, with the most critical\ncommunications occurring in the most secure and reliable layer. For more information refer\nto National Institute of Standard and Technology Special Publication 800-82: Guide to\nIndustrial Control Systems (ICS) Security. Further segmentation should be applied to\nportions of the network that are reliant on one another by functionality. Figure 5 on page 26\n[of the CISA ICS Defense in Depth Strategy document describes this architecture.](https://us-cert.cisa.gov/sites/default/files/recommended_practices/NCCIC_ICS-CERT_Defense_in_Depth_2016_S508C.pdf)\nUse one-way communication diodes to prevent external access, whenever possible.\nSet up DMZs to create a physical and logical subnetwork that acts as an intermediary for\nconnected security devices to avoid exposure.\nEmploy reliable network security protocols and services where feasible.\nConsider using virtual local area networks (VLANs) for additional network segmentation, for\nexample, by placing all printers in separate, dedicated VLANs and restricting users’ direct printer\naccess. This same principle can be applied to segmentation of portions of the process for which\ndevices are used. As an example, systems that are only involved in the creation of one\ncomponent within an assembly line that is not directly related to another component can be on\nseparate VLANs, which allows for identification of any unexpected communication, as well as\nsegmentation against potential risk exposure on a larger scale.\nImplement perimeter security between network segments to limit the ability of cyber threat\nactors to move laterally.\n\nControl traffic between network segments by using firewalls, intrusion detection systems\n(IDSs), and rules for filtering traffic on routers and switches.\nImplement network monitoring at key chokepoints—including egress points to the internet,\nbetween network segments, core switch locations—and at key assets or services (e.g., remote\naccess services).\nConfigure an IDS to create alarms for any ICS traffic outside normal operations (after\nestablishing a baseline of normal operations and network traffic).\nConfigure security incident and event monitoring to monitor, analyze, and correlate event\nlogs from across the ICS network to identify intrusion attempts.\n\nICS Best Practices\n\n\n-----\n\nassets, and zones should participate in the patch management program.\nTest all patches in out-of-band testing environments before implementation into production\nenvironments.\nImplement application allow listing on human machine interfaces and engineering workstations.\nHarden software configuration on field devices, including tablets and smartphones.\nReplace all end-of-life software and hardware devices.\nDisable unused ports and services on ICS devices (after testing to ensure this will not affect ICS\noperation).\nRestrict and manage remote access software. Enforce MFA for remote access to ICS networks.\nConfigure encryption and security for network protocols within the ICS environment.\nDo not allow vendors to connect their devices to the ICS network. Use of a compromised device\ncould introduce malware.\nDisallow any devices that do not live solely on the ICS environment from communicating on the\nplatform. ‘Transient devices’ provide risk exposure to the ICS environment from malicious\nactivity in the IT or other environments to which they connect.\nMaintain an ICS asset inventory of all hardware, software, and supporting infrastructure\ntechnologies.\nMaintain robust host logging on critical devices within the ICS environment, such as jump boxes,\ndomain controllers, repository servers, etc. These logs should be aggregated into a centralized\nlog server for review.\nEnsure robust physical security is in place to prevent unauthorized personal from accessing\ncontrolled spaces that house ICS equipment.\nRegularly test manual controls so that critical functions can be kept running if ICS/OT networks\nneed to be taken offline.\n\n## Contact Information\n\nAll organizations should report incidents and anomalous activity to CISA 24/7 Operations Center at\n[report@cisa.gov or (888) 282-0870 and/or to the FBI via your local FBI field office or the FBI’s 24/7](mailto:report@cisa.gov)\n[CyWatch at (855) 292-3937 or CyWatch@fbi.gov.](mailto:CyWatch@fbi.gov)\n\n## References\n\n[1] https://www.justice.gov/opa/pr/four-russian-government-employees-charged-two-historicalhacking-campaigns-targeting-critical\n\n[[2] https://collaborate.mitre.org/attackics/index.php/Software/S0003](https://collaborate.mitre.org/attackics/index.php/Software/S0003%C2%A0)\n\n[[3] https://collaborate.mitre.org/attackics/index.php/Software/S0003](https://collaborate.mitre.org/attackics/index.php/Software/S0003)\n\n[[4] https://collaborate.mitre.org/attackics/index.php/Software/S0013](https://collaborate.mitre.org/attackics/index.php/Software/S0013%C2%A0)\n\n## APPENDIX A: CAMPAIGN AND MALWARE TACTICS, TECHNIQUES, AND PROCEDURES\n\n### Global Energy Sector Campaign: Havex Malware\n\n[Table 1 maps Havex’s capabilities to the ATT&CK for Enterprise framework, and table 2 maps Havex’s](https://attack.mitre.org/versions/v10/matrices/enterprise/)\n[capabilities to the ATT&CK for ICS framework. Table 1 also provides associated mitigations. For](https://collaborate.mitre.org/attackics/index.php/Main_Page)\nadditional mitigations, refer to the Mitigations section of this advisory.\n\n\n-----\n\n|Col1|Table 1: Enterprise Doma|main Tactics and Technique|TLP:WHITE es for Havex [2]|\n|---|---|---|---|\n|Tactic|Technique|Use|Detection/Mitigations|\n|Persistence [TA0003]|Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder [T1547.001]|Havex adds Registry Run keys to achieve persistence.|Monitor: monitor Registry for changes to run keys that do not correlate with known sofwt are, patch cycles, etc. Monitor the start folder for additions or changes. Tools such as Sysinternals Autoruns may also be used to detect system changes that could be attempts at persistence, including listing the run keys' Registry locations and startup folders. Suspicious program execution as startup programs may show up as outlier processes that have not been seen before when compared against historical data.|\n|Privilege Escalation [TA0004]|Process Injection [T1055] Note: this technique also applies to: Tactic: Defense Evasion [TA0005]|Havex injects itself into explorer.exe .|Behavior Prevention on End Point: use capabilities to prevent suspicious behavior patterns from occurring on endpoint systems. This could include suspicious process, file, Application Programming Interface (API) call, etc., behavior. Privileged Account Management: manage the creation of, modification of, use of, and permissions associated with privileged accounts, including SYSTEM and root.|\n|Defense Evasion [TA0005]|Indicator Removal on Host: File Deletion [T1070.004]|Havex contains a cleanup module that removes traces of itself from victim networks.|Monitor: monitoring for command-line deletion functions to correlate with binaries or other files that an adversary may drop and remove may lead to detection of malicious activity. Another good practice is monitoring for known deletion and secure deletion tools that are not already on systems within an enterprise network, which an adversary could introduce. Some monitoring tools may collect command-line arguments but may not capture DEL commands since DEL is a native function within cmd.exe .|\n|Credential Access [TA0006]|Credentials from Password Stores: Credentials from Web Browsers [T1555.003]|Havex may contain a publicly available web browser password recovery tool.|Password Policies: set and enforce secure password policies for accounts.|\n\n\nDiscovery\n\n[[TA0007]](https://attack.mitre.org/versions/v10/tactics/TA0007/)\n\n\nMonitor: monitor processes and command-line\narguments for actions that could be taken to gather\nsystem and network information. Remote access\ntools with built-in features may interact directly with\nthe Windows API to gather information. Information\nmay also be acquired through Windows system\nmanagement tools such as Windows Management\nInstrumentation (WMI) and PowerShell.\n\n\nAccount Discovery: Email\n[Account [T1087.003]](https://attack.mitre.org/versions/v10/techniques/T1087/003/)\n\n\nHavex collects address\nbook information from\nOutlook\n\n\n-----\n\np\narguments for actions that could be taken to gather\nsystem and network information. Remote access\ntools with built-in features may interact directly with\nthe Windows API to gather information. Information\nmay also be acquired through Windows system\nmanagement tools such as WMI and PowerShell.\n\n\nFile and Directory Discovery\n\n[[T1083]](https://attack.mitre.org/versions/v10/techniques/T1083/)\n\n\ninformation about\navailable drives, default\nbrowser, desktop file\nlist, My Documents,\ninternet history,\nprogram files, and root\nof available drives.\n\n|Col1|[T1083]|list, My Documents, internet history, program files, and root of available drives.|the Windows API to gather information. Information may also be acquired through Windows system management tools such as WMI and PowerShell.|\n|---|---|---|---|\n||Process Discovery [T1057]|Havex collects information about running processes.|Monitor: normal, benign system and network events that look like process discovery may be uncommon, depending on the environment and how they are used. Monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as WMI and PowerShell.|\n||System Information Discovery [T1082]|Havex collects information about the OS and computer name.|Monitor: monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as WMI and PowerShell. In cloud-based systems, native logging can be used to identify access to certain APIs and dashboards that may contain system information. Depending on how the environment is used, that data alone may not be useful due to benign use during normal operations.|\n||System Network Configuration Discovery [T1016]|Havex collects information about the internet adapter configuration.|Monitor: monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information. Information may also be acquired through Windows system management tools such as WMI and PowerShell.|\n||System Owner/User Discovery [T1033]|Havex collects usernames.||\n|Collection [TA0009]|Archive Collected Data [T1560]|Havex writes collected data to a temporary file in an encrypted form before exfiltration to a C2 server.|Audit: audit or scan systems, permissions, insecure software, insecure configurations, etc., to identify potential weaknesses.|\n\n\n-----\n\nflows (e.g., a client sending significantly more data\nthan it receives from a server). Processes using the\nnetwork that do not normally have network\ncommunication or have never been seen before are\nsuspicious. Analyze packet contents to detect\ncommunications that do not follow the expected\nprotocol behavior for the port that is being used.\n\n\nCommand\nand Control\n\n[[TA0011]](https://attack.mitre.org/versions/v10/tactics/TA0011/)\n\n\nData Encoding: Standard\n[Encoding [T1132.001]](https://attack.mitre.org/versions/v10/techniques/T1132/001/)\n\n\nHavex uses standard\nBase64 + bzip2 or\nstandard Base64 +\nreverse XOR + RSA-2048\nto decrypt data received\nfrom C2 servers.\n\n\n[Table 2: ICS Domain Tactics and Techniques for Havex [3]](https://collaborate.mitre.org/attackics/index.php/Software/S0003)\n\nTactic Technique Use\n\n[Spearphishing Attachment [T0865]](https://collaborate.mitre.org/attackics/index.php/Technique/T0865) Havex is distributed through a Trojanized installer attached to emails.\n[Supply Chain Compromise [T0862]](https://collaborate.mitre.org/attackics/index.php/Technique/T0862)\n\n[Initial Access](https://collaborate.mitre.org/attackics/index.php/Initial_Access) Havex is distributed through Trojanized installers planted on compromised vendor\n\nNote: this activity also applies to Tactic: websites.\n[Drive by Compromise [T0817]](https://collaborate.mitre.org/attackics/index.php/Technique/T0817)\n\n[Execution](https://collaborate.mitre.org/attackics/index.php/Execution) [User Execution [T0863]](https://collaborate.mitre.org/attackics/index.php/Technique/T0863) Execution of Havex relies on a user opening a Trojanized installer attached to an email.\n\nHavex uses Windows networking (WNet) to discover all the servers, including OPC servers\n[Remote System Discovery [T0846]](https://collaborate.mitre.org/attackics/index.php/Technique/T0846)\nthat are reachable by the compromised machine over the network.\n\n[Discovery](https://collaborate.mitre.org/attackics/index.php/Discovery)\n\nHavex gathers server information, including CLSID, server name, Program ID, OPC version,\n[Remote System Information Discovery [T0888]](https://collaborate.mitre.org/attackics/index.php/Technique/T0888)\nvendor information, running state, group count, and server bandwidth.\n\n[Automated Collection [T0802]](https://collaborate.mitre.org/attackics/index.php/Technique/T0802) Havex gathers information about connected control systems devices.\n[Collection](https://collaborate.mitre.org/attackics/index.php/Collection)\n[Point & Tag Identification [T0861]](https://collaborate.mitre.org/attackics/index.php/Technique/T0861) Havex can enumerate OPC tags; specifically tag name, type, access, and ID.\n\nInhibit\n[Response](https://collaborate.mitre.org/attackics/index.php/Inhibit_Response_Function) [Denial of Service [T0814]](https://collaborate.mitre.org/attackics/index.php/Technique/T0814) Havex has caused multiple common OPC platforms to intermittently crash.\nFunction\n\n[Impact](https://collaborate.mitre.org/attackics/index.php/Impact) [Denial of Control [T0813]](https://collaborate.mitre.org/attackics/index.php/Technique/T0813) Havex can cause PLCs inability to control connected systems.\n\n### Global Energy Sector Campaign: 2016 to 2018 U.S. Energy Sector Targeting\n\nTable 3 maps the 2016 to 2018 U.S. Energy Sector targeting activity to the MITRE ATT&CK Enterprise\nframework. Mitigations for techniques are also provided in table. For additional mitigations, refer to\nthe Mitigations section of this advisory.\n\nTable 3: Energy Sector Campaign, 2016 to 2018 targeting U.S. Energy Sector: Observed MITRE\n\nATT&CK Enterprise Tactics and Techniques\n\n|Tactic|Technique|Use|\n|---|---|---|\n|Initial Access|Spearphishing Attachment [T0865]|Havex is distributed through a Trojanized installer attached to emails.|\n||Supply Chain Compromise [T0862] Note: this activity also applies to Tactic: Drive by Compromise [T0817]|Havex is distributed through Trojanized installers planted on compromised vendor websites.|\n|Execution|User Execution [T0863]|Execution of Havex relies on a user opening a Trojanized installer attached to an email.|\n|Discovery|Remote System Discovery [T0846]|Havex uses Windows networking (WNet) to discover all the servers, including OPC servers that are reachable by the compromised machine over the network.|\n||Remote System Information Discovery [T0888]|Havex gathers server information, including CLSID, server name, Program ID, OPC version, vendor information, running state, group count, and server bandwidth.|\n|Collection|Automated Collection [T0802]|Havex gathers information about connected control systems devices.|\n||Point & Tag Identification [T0861]|Havex can enumerate OPC tags; specifically tag name, type, access, and ID.|\n|Inhibit Response Function|Denial of Service [T0814]|Havex has caused multiple common OPC platforms to intermittently crash.|\n|Impact|Denial of Control [T0813]|Havex can cause PLCs inability to control connected systems.|\n\n|Tactic|Technique|Use|Detection/Mitigations|\n|---|---|---|---|\n\n\n-----\n\ncommercial organizations by sending spearphishing\nemails that contained a PDF attachment. The PDF\nattachment contained a shortened URL that, when\nclicked, led users to a website that prompted the\nuser for their email address and password.\nThe threat actor harvested credentials of Energy\nSector targets by sending spearphishing emails with\na malicious Microsoft Word document or links to the\nwatering holes created on compromised third-party\nwebsites.\n\nNote: this activity also applies to:\n\n[Tactic: Reconnaissance [TA0043], Technique:](https://attack.mitre.org/versions/v10/tactics/TA0043/)\n[Phishing for Information [T1598]:](https://attack.mitre.org/versions/v10/techniques/T1598)\n\n[Spearphishing Attachment [T1598.002]](https://attack.mitre.org/versions/v10/techniques/T1598/002/)\n[Spearphishing Link [T1598.003]](https://attack.mitre.org/versions/v10/techniques/T1598/003/)\n\n\nSoftware Configuration: implement\nconfiguration changes to software (other\nthan the operating system) to mitigate\nsecurity risks associated to how the\nsoftware operates.\n\nUser Training: train users to be aware of\naccess or manipulation attempts by an\nadversary to reduce the risk of successful\nspearphishing, social engineering, and\nother techniques that involve user\ninteraction.\n\n\nReconnaissance\n\n[[TA0043]](https://attack.mitre.org/versions/v10/tactics/TA0043/)\n\n\nGather Victim\nIdentity\n\nInformation:\nCredentials\n\n[[T1589.001]](https://attack.mitre.org/versions/v10/techniques/T1589/001/)\n\n|Resource Development [TA0042]|Compromise Infrastructure: Server [T1584.004]|The threat actor created watering holes on compromised third-party organizations’ domains.|This activity typically takes place outside the visibility of target organizations, making detection of this behavior difficult. Ensure that users browse the internet securely. Prevent intentional and unintentional download of malware or rootkits, and users from accessing infected or malicious websites. Treat all traffic as untrusted, even if it comes from a partner website or popular domain.|\n|---|---|---|---|\n\n\n-----\n\n[[TA0001]](https://attack.mitre.org/versions/v10/tactics/TA0001/)\n\n\nof the network to isolate critical systems,\nfunctions, or resources. Use physical and\nlogical segmentation to prevent access to\npotentially sensitive systems and\ninformation. Use a DMZ to contain any\ninternet-facing services that should not be\nexposed from the internal network.\n\nMFA: enforce use of two or more pieces of\nevidence (such as username and password\nplus a token, e.g., a physical smart card or\ntoken generator) to authenticate to a\nsystem.\n\nPrivileged Account Management: manage\nthe creation of, modification of, use of, and\npermissions associated with privileged\naccounts, including `SYSTEM and root.`\n\nUpdate Software: perform regular software\nupdates to mitigate exploitation risk.\n\nExploit Protection: use capabilities to\ndetect and block conditions that may lead\nto or be indicative of a software exploit\noccurring.\n\nApplication Isolation and Sandboxing:\nrestrict execution of code to a virtual\nenvironment on or in transit to an\nendpoint system.\n\n\nValid Accounts\n\n[[T1078]](https://attack.mitre.org/versions/v10/techniques/T1078/)\n\n\nThe threat actor obtained access to Energy Sector targets by\nleveraging compromised third-party infrastructure and previously\ncompromised Energy Sector credentials against remote access\nservices and infrastructure—specifically VPN, RDP, and Outlook Web\nAccess—where MFA was not enabled.\n\n\n-----\n\nExternal\nRemote\n\nServices\n\n[[T1133]](https://attack.mitre.org/versions/v10/techniques/T1133/)\n\n\nThe threat actor installed VPN clients on compromised third-party\ntargets to connect to Energy Sector networks.\n\n\nof the network to isolate critical systems,\nfunctions, or resources. Use physical and\nlogical segmentation to prevent access to\npotentially sensitive systems and\ninformation. Use a DMZ to contain any\ninternet-facing services that should not be\nexposed from the internal network.\n\nMFA: enforce use of two or more pieces of\nevidence (such as username and password\nplus a token, e.g., a physical smart card or\ntoken generator) to authenticate to a\nsystem.\n\nLimit Access to Resource Over Network:\nprevent access to file shares, remote access\nto systems, and unnecessary services.\nMechanisms to limit access may include\nuse of network concentrators, RDP\ngateways, etc.\n\nDisable or Remove Program: remove or\ndeny access to unnecessary and\npotentially vulnerable software to prevent\nabuse by adversaries.\n\n\nExecution\n\n[[TA0002]](https://attack.mitre.org/versions/v10/tactics/TA0002/)\n\n|Command and Scripting Interpreter: PowerShell [T1059.001]|During an RDP session, the threat actor used a PowerShell Script to create an account within a victim’s Microsoft Exchange Server. Note: this activity also applies to: Tactic: Persistence [TA0003], Technique: Create Account: Local Account [T1136.001]|Antivirus/Antimalware: use signatures or heuristics to detect malicious software. Code Signing: enforce binary and application integrity with digital signature verification to prevent untrusted code from executing. Disable or Remove Program: remove or deny access to unnecessary and potentially vulnerable software to prevent abuse by adversaries. Privileged Account Management: manage the creation of, modification of, use of, and permissions associated with privileged accounts, including SYSTEM and root.|\n|---|---|---|\n\n\n-----\n\nCommand and\nScripting\n\nInterpreter:\nWindows\nCommand\nShell\n\n[[T1059.003]](https://attack.mitre.org/versions/v10/techniques/T1059/003/)\n\n\nembedded Command Shell script to:\n\nCreate a local administrator account;\nDisable the host-based firewall;\nGlobally open port 3389 for RDP access; and\nAttempt to add the newly created account to the\nadministrators group to gain elevated privileges.\n\nNote: this activity also applies to:\n\n[Tactic: Credential Access [TA0006], Technique:](https://attack.mitre.org/versions/v10/tactics/TA0006/)\n[Input Capture [T1056]](https://attack.mitre.org/versions/v10/techniques/T1056/)\n[Tactic: Execution [TA0002], Technique:](https://attack.mitre.org/versions/v10/tactics/TA0002/)\nCommand and Scripting Interpreter: JavaScript\n\n[[T1059.007]](https://attack.mitre.org/versions/v10/techniques/T1059/007/)\n[Tactic: Persistence [TA0003], Technique: Create](https://attack.mitre.org/versions/v10/tactics/TA0003/)\n[Account: Local Account [T1136.001]](https://attack.mitre.org/versions/v10/techniques/T1136/001/)\n\n\nExecution Prevention: block execution of code on a\nsystem through application control, and/or script\n\nblocking.\n\n\nPersistence\n\n[[TA0003]](https://attack.mitre.org/versions/v10/tactics/TA0003/)\n\n|Col1|Tactic: Execution [TA0002], Technique: Command and Scripting Interpreter: JavaScript [T1059.007] Tactic: Persistence [TA0003], Technique: Create Account: Local Account [T1136.001]|Col3|\n|---|---|---|\n|Scheduled Task/Job: Scheduled Task [T1053.005]|The threat actor created a Scheduled Task to automatically log out of a newly created account every eight hours.|Audit: audit or scan systems, permissions, insecure software, insecure configurations, etc., to identify potential weaknesses. Harden Operating System Configuration: make configuration changes related to the operating system or a common feature of the operating system that result in system hardening against techniques. Privileged Account Management: manage the creation of, modification of, use of, and permissions associated with privileged accounts, including SYSTEM and root. User Account Management: manage the creation of, modification of, use of, and permissions associated with user accounts.|\n|Create Account: Local Account [T1136.001]|The threat actor created local administrator accounts on previously compromised third-party organizations for reconnaissance and to remotely access Energy Sector targets. MFA: enforce use of two or more pieces of evidence (such as username and password plus a token, e.g., a physical smart card or token generator) to authenticate to a system.|MFA: enforce use of two or more pieces of evidence (such as username and password plus a token, e.g., a physical smart card or token generator) to authenticate to a system. Privileged Account Management: manage the creation of, modification of, use of, and permissions associated with privileged accounts, including SYSTEM and root.|\n\n\n-----\n\nmay be small and look innocuous. Process monitoring\n\nmay be used to detect Web servers that perform\nsuspicious actions such as running cmd.exe or accessing\nfiles that are not in the Web directory. File monitoring\nmay be used to detect changes to files in the Web\ndirectory of a Web server that do not match with updates\nto the Web server's content and may indicate\nimplantation of a Web shell script. Log authentication\n\nattempts to the server and any unusual traffic patterns to\nor from the server and internal network.\n\nEncrypt Sensitive Information: protect\nsensitive information with strong\nencryption.\n\nRemote Data Storage: use remote security\nlog and sensitive file storage where access\ncan be controlled better to prevent\nexposure of intrusion detection log data or\nsensitive information.\n\nRestrict File and Directory Permissions:\nrestrict access by setting directory and file\npermissions that are not specific to users\nor privileged accounts.\n\nMonitor: monitoring for command-line deletion functions\nto correlate with binaries or other files that an adversary\n\nmay drop and remove may lead to detection of malicious\nactivity. Another good practice is monitoring for known\ndeletion and secure deletion tools that are not already on\nsystems within an enterprise network that an adversary\ncould introduce. Some monitoring tools may collect\ncommand-line arguments, but may not capture `DEL`\n\ncommands since `DEL is a native function within`\n```\ncmd.exe .\n\n\n```\nRestrict File and Directory Permissions:\nrestrict access by setting directory and file\npermissions that are not specific to users\nor privileged accounts.\n\nCode Signing: enforce binary and\napplication integrity with digital signature\nverification to prevent untrusted code from\nexecuting.\n\nExecution Prevention: block execution of\ncode on a system through application\n\n\nDefense\nEvasion\n\n[[TA0005]](https://attack.mitre.org/versions/v10/tactics/TA0005/)\n\n\nServer\nSoftware\n\nComponent:\nWeb Shell\n\n[[T1505.003]](https://attack.mitre.org/versions/v10/techniques/T1505/003/)\n\nIndicator\nRemoval on\n\nHost: Clear\nWindows\nEvent Logs\n\n[[T1070.001]](https://attack.mitre.org/versions/v10/techniques/T1070/001/)\n\nIndicator\nRemoval on\nHost: File\nDeletion\n\n[[T1070.004]](https://attack.mitre.org/versions/v10/techniques/T1070/004/)\n\nTechnique:\nMasquerading\n\n[[T1036]](https://attack.mitre.org/versions/v10/techniques/T1036/)\n\n\nThe threat actor created webshells on Energy Sector targets’ publicly\naccessible email and web servers.\n\nThe threat actor created new accounts on victim\nnetworks to perform cleanup operations. The\naccounts created were used to clear the following\nWindows event logs: System, Security, Terminal\nServices, Remote Services, and Audit.\n\nThe threat actor also removed applications they\ninstalled while they were in the network along with\nany logs produced. For example, the VPN client\ninstalled at one third-party commercial facility was\ndeleted along with the logs that were produced from\nits use. Finally, data generated by other accounts\nused on the systems accessed were deleted.\n\nNote: this activity also applies to:\n\n[Tactic: Persistence [TA0003], Technique: Create](https://attack.mitre.org/versions/v10/tactics/TA0003/)\n[Account: Local Account [T1136.001]](https://attack.mitre.org/versions/v10/techniques/T1136/001/)\n\nThe threat actor cleaned up target networks by\ndeleting created screenshots and specific registry\nkeys.\n\nThe threat actor also deleted all batch scripts,\noutput text documents, and any tools they brought\ninto the environment, such as `scr.exe .`\n\nNote: this activity also applies to:\n\n[Technique: Modify Registry [T1112]](https://attack.mitre.org/versions/v10/techniques/T1112)\n\nAfter downloading tools from a remote server, the threat actor\nrenamed the extensions.\n\n|Col1|Col2|attempts to the server and any unusual traffic patterns to or from the server and internal network.|\n|---|---|---|\n|Indicator Removal on Host: Clear Windows Event Logs [T1070.001]|The threat actor created new accounts on victim networks to perform cleanup operations. The accounts created were used to clear the following Windows event logs: System, Security, Terminal Services, Remote Services, and Audit. The threat actor also removed applications they installed while they were in the network along with any logs produced. For example, the VPN client installed at one third-party commercial facility was deleted along with the logs that were produced from its use. Finally, data generated by other accounts used on the systems accessed were deleted. Note: this activity also applies to: Tactic: Persistence [TA0003], Technique: Create Account: Local Account [T1136.001]|Encrypt Sensitive Information: protect sensitive information with strong encryption. Remote Data Storage: use remote security log and sensitive file storage where access can be controlled better to prevent exposure of intrusion detection log data or sensitive information. Restrict File and Directory Permissions: restrict access by setting directory and file permissions that are not specific to users or privileged accounts.|\n|Indicator Removal on Host: File Deletion [T1070.004]|The threat actor cleaned up target networks by deleting created screenshots and specific registry keys. The threat actor also deleted all batch scripts, output text documents, and any tools they brought into the environment, such as scr.exe . Note: this activity also applies to: Technique: Modify Registry [T1112]|Monitor: monitoring for command-line deletion functions to correlate with binaries or other files that an adversary may drop and remove may lead to detection of malicious activity. Another good practice is monitoring for known deletion and secure deletion tools that are not already on systems within an enterprise network that an adversary could introduce. Some monitoring tools may collect command-line arguments, but may not capture DEL commands since DEL is a native function within cmd.exe .|\n\n\n-----\n\nevidence (such as username and password\nplus a token, e.g., a physical smart card or\ntoken generator) to authenticate to a\nsystem.\n\n\n[Access [TA0006]](https://attack.mitre.org/versions/v10/tactics/TA0006/)\n\n\nBrute Force:\nPassword\n\nCracking\n\n[[T1110.002]](https://attack.mitre.org/versions/v10/techniques/T1110/002/)\n\n\np g q\nto obtain the plaintext passwords from obtained\ncredential hashes.\n\n|Cracking [T1110.002]|The threat actor dropped and executed open-source and free password cracking tools such as Hydra, SecretsDump, and CrackMapExec, and Python.|system. Password Policies: set and enforce secure password policies for accounts.|\n|---|---|---|\n|Forced Authentication [T1187]|Microsoft Word attachments sent via spearphishing emails leveraged legitimate Microsoft Office functions for retrieving a document from a remote server over Server Message Block (SMB) using Transmission Control Protocol ports 445 or 139. As a part of the standard processes executed by Microsof tWord, this request authenticates the client with the server, sending the user’s credential hash to the remote server before retrieving the requested file. (Note: transfer of credentials can occur even if the file is not retrieved.)|Password Policies: set and enforce secure password policies for accounts. Filter Network Trafifc: use network appliances to filter ingress or egress traffic and perform protocol-based filtering. Configure software on endpoints to filter network trafifc.|\n||The threat actor’s watering hole sites contained altered JavaScript and PHP files that requested a file icon using SMB from an IP address controlled by the threat actors.||\n||The threat actor manipulated LNK files to repeatedly gather user credentials. Default Windows functionality enables icons to be loaded from a local or remote Windows repository. The threat actor exploited this built-in Windows functionality by setting the icon path to a remote server controller by the actors. When the user browses to the directory, Windows attempts to load the icon and initiate an SMB authentication session. During this process, the active user’s credentials are passed through the attempted SMB connection. Note: this activity also applies to: Tactic: Persistence [TA0003], Technique: Boot or Logon Autostart Execution: Shortcut Modification [T1547.009]||\n\n\n-----\n\nOS Credential\nDumping:\nLocal Security\nAuthority\nSubsystem\nService\n(LSASS)\nMemory\n\n[[T1003.001]](https://attack.mitre.org/versions/v10/techniques/T1003/001/)\n\nOS Credential\nDumping:\n\nNTDS\n\n[[T1003.003]](https://attack.mitre.org/versions/v10/techniques/T1003/003/)\n\n\nThe threat actor used an Administrator PowerShell prompt to enable\nthe WDigest authentication protocol to store plaintext passwords in\n\nthe LSASS memory. With this enabled, credential harvesting tools can\ndump passwords from this process’s memory.\n\nThe threat actor collected the files `ntds.dit . The file` `ntds.dit is`\n\nthe Active Directory (AD) database that contains all information\nrelated to the AD, including encrypted user passwords.\n\n\nconfiguration changes related to the\noperating system or a common feature of\nthe operating system that result in system\nhardening against techniques.\n\nPassword Policies: set and enforce secure\npassword policies for accounts.\n\nPrivileged Account Management: manage\nthe creation of, modification of, use of, and\npermissions associated with privileged\naccounts, including `SYSTEM` and root.\n\nPrivileged Process Integrity: protect\nprocesses with high privileges that can be\nused to interact with critical system\ncomponents through use of protected\nprocess light, anti-process injection\ndefenses, or other process integrity\nenforcement measures.\n\nUser Training: train users to be aware of\naccess or manipulation attempts by an\nadversary to reduce the risk of successful\nspearphishing, social engineering, and\nother techniques that involve user\ninteraction.\n\nCredential Access Protection: use\ncapabilities to prevent successful\ncredential access by adversaries; including\nblocking forms of credential dumping.\n\nMonitor: monitor processes and\ncommand-line arguments for program\nexecution that may be indicative of\ncredential dumping, especially attempts to\naccess or copy the `NTDS.dit .`\n\nPrivileged Account Management: manage\nthe creation of, modification of, se of, and\npermissions associated with privileged\naccounts, including `SYSTEM and root.`\n\nUser Training: train users to be aware of\naccess or manipulation attempts by an\nadversary to reduce the risk of successful\nspearphishing, social engineering, and\nother techniques that involve user\ninteraction\n\n\n-----\n\naccess the Energy Sector victim’s domain controller.\nOnce on the domain controller, the threat actors\nused batch scripts `dc.ba t and` `dit.bat to`\nenumerate hosts, users, and additional information\nabout the environment.\n\nNote: this activity also applies to:\n\n\nDiscovery Network Connection (VNC) profiles that contained\n\n[[TA0007]](https://attack.mitre.org/versions/v10/tactics/TA0007/)\n\nconfiguration information on accessing ICS systems\nand took screenshots of a Human Machine Interface\n(HMI).\n\nNote: this activity also applies to\n\n[Tactic: Discovery [TA0007], Technique File and](https://attack.mitre.org/versions/v10/tactics/TA0007/)\n[Directory Discovery [T1083]](https://attack.mitre.org/versions/v10/techniques/T1083)\n[Tactic: [TA0009], Technique: Screen Capture](https://attack.mitre.org/versions/v10/tactics/TA0009/)\n\n[[T1113]](https://attack.mitre.org/versions/v10/techniques/T1113/)\n\nThe actor used `dirsb.bat` to gather folder and file\n\nnames from hosts on the network.\n\nNote: this activity also applies to:\n\nFile and\nDirectory [Tactic: Execution [TA0002], Command and](https://attack.mitre.org/versions/v10/tactics/TA0002/)\n\nDiscovery Scripting Interpreter: Windows Command Shell\n\n[[T1083]](https://attack.mitre.org/versions/v10/techniques/T1083)\n\n[[T1059.003]](https://attack.mitre.org/versions/v10/techniques/T1059/003/)\n\nThe threat actor conducted reconnaissance operations within the\nnetwork. The threat actor focused on identifying and browsing file\n\nservers within the intended victim’s network.\nLateral Lateral Tool The threat actor moved laterally via `PsExec, batch`\nMovement Transfer\n\nscripts, RDP, VNC, and admin shares.\n\n[[TA0008]](https://attack.mitre.org/versions/v10/tactics/TA0008/) [[T1570]](https://attack.mitre.org/versions/v10/techniques/T1570/)\n\n|Col1|Tactic: Persistence [TA0003], Technique: Valid Accounts: Domain Accounts [T1078.002] Tactic: Discovery [TA0007], Technique: System Owner/User Discovery [T1033]|Col3|\n|---|---|---|\n||The threat actor accessed workstations and servers on corporate networks that contained data output from control systems within energy generation facilities. The threat actors accessed files pertaining to ICS or supervisory control and data acquisition (SCADA) systems.||\n||The actor targeted and copied profile and configuration information for accessing ICS systems on the network. The threat actor copied Virtual Network Connection (VNC) profiles that contained configuration information on accessing ICS systems and took screenshots of a Human Machine Interface (HMI). Note: this activity also applies to Tactic: Discovery [TA0007], Technique File and Directory Discovery [T1083] Tactic: [TA0009], Technique: Screen Capture [T1113]||\n|File and Directory Discovery [T1083]|The actor used dirsb.bat to gather folder and file names from hosts on the network. Note: this activity also applies to: Tactic: Execution [TA0002], Command and Scripting Interpreter: Windows Command Shell [T1059.003]|This type of attack technique cannot be easily mitigated with preventive controls since it is based on the abuse of system features. Monitor processes and command-line arguments for actions that could be taken to gather system and network information. Remote access tools with built-in features may interact directly with the Windows API to gather information.|\n||The threat actor conducted reconnaissance operations within the network. The threat actor focused on identifying and browsing file servers within the intended victim’s network.||\n\n\nNote: this activity also applies to:\n\n[Tactic: Lateral Movement [TA0008], Techniques:](https://attack.mitre.org/versions/v10/tactics/TA0008/)\n\nRemote Services: Remote Desktop Protocol\n\n[[T1021.001]](https://attack.mitre.org/versions/v10/techniques/T1021/001/)\n\n\nNetwork Intrusion Prevention: use\nintrusion detection signatures to block\ntraffic at network boundaries.\n\nNetwork Segmentation: architect sections\nof the network to isolate critical systems,\nfunctions, or resources. Use physical and\nlogical segmentation to prevent access to\n\n\n-----\n\n[Shares [T1021.002]](https://attack.mitre.org/versions/v10/techniques/T1021/002/)\n[Remote Services: VNC [T1021.005]](https://attack.mitre.org/versions/v10/techniques/T1021/005/)\n\n\ninternet-facing services that should not be\nexposed from the internal network.\n\nOperating System Configuration: make\nconfiguration changes related to the\noperating system or a common feature of\nthe operating system that result in system\nhardening against techniques.\n\nPrivileged Account Management: manage\nthe creation of, modification of, use of, and\npermissions associated with privileged\naccounts, including `SYSTEM and root.`\n\nUser Account Management: manage the\ncreation of, modification o, se of, and\npermissions associated with user accounts.\n\nDisable or Remove Feature or Program:\nremove or deny access to unnecessary and\npotentially vulnerable software to prevent\nabuse by adversaries.\n\nAudit: audit or scan systems, permissions,\ninsecure software, insecure configurations,\netc. to identify potential weaknesses.\n\nMFA: enforce use of two or more pieces of\nevidence (such as username and password\nplus a token, e.g., a physical smart card or\ntoken generator) to authenticate to a\nsystem.\n\nLimit Access to Resource Over Network:\nprevent access to file shares, remote access\nto systems, and unnecessary services.\nMechanisms to limit access may include\nuse of network concentrators, RDP\ngateways, etc.\n\nFilter Network Traffic: use network\nappliances to filter ingress or egress traffic\nand perform protocol-based filtering.\nConfigure software on endpoints to filter\nnetwork traffic.\n\nLimit Software Installation: block users or\ngroups from installing unapproved\nsoftware.\n\n\n-----\n\nData from\nLocal System\n\n[[T1005]](https://attack.mitre.org/versions/v10/techniques/T1005)\n\n\nThe threat actor collected the Windows `SYSTEM registry hive file,`\n\nwhich contains host configuration information.\n\n\ncommand-line arguments for actions that\ncould be taken to collect files from a\nsystem. Remote access tools with built-in\nfeatures may interact directly with the\nWindows API to gather data.\n\n\nCollection\n\n[[TA0009]](https://attack.mitre.org/versions/v10/tactics/TA0009/)\n\n|Col1|Col2|Data may also be acquired through Windows system management tools such as WMI and PowerShell.|\n|---|---|---|\n|Archive Collected Data: Archive via Utility [T1560.001]|The threat actor compressed the ntds.dit file and the SYSTEM registry hive they had collected into archives named SYSTEM.zip and comps.zip .|Audit: audit or scan systems, permissions, insecure software, insecure configurations, etc. to identify potential weaknesses.|\n|Screen Capture [T1113]|The threat actor used Windows’ Scheduled Tasks and batch scripts, to execute scr.exe and collect additional information from hosts on the network. The tool scr.exe is a screenshot utility that the threat actor used to capture the screen of systems across the network. Note: this activity also applies to: Tactic: Execution [TA0002], Techniques: Command and Scripting Interpreter: Windows Command Shell [T1059.003] Scheduled Task/Job: Scheduled Task [T1053.005]|Network Segmentation: architect sections of the network to isolate critical systems, functions, or resources. Use physical and logical segmentation to prevent access to potentially sensitive systems and information. Use a DMZ to contain any internet-facing services that should not be exposed from the internal network. MFA: enforce use of two or more pieces of evidence (such as username and password plus a token, e.g., a physical smart card or token generator) to authenticate to a system. Limit Access to Resource Over Network: prevent access to file shares, remote access to systems, and unnecessary services. Mechanisms to limit access may include use of network concentrators, RDP gateways, etc. Disable or Remove Feature or Program: remove or deny access to unnecessary and potentially vulnerable software to prevent abuse by adversaries.|\n||The actor used batch scripts labeled pss.bat and psc.bat to run the PsExec tool. PsExec was used to execute scr.exe across the network and to collect screenshots of systems in a text file. Note: this activity also applies to: Tactic: Execution [TA0002], Techniques: Command and Scripting Interpreter: Windows Command Shell [T1059.003] System Services: Service Execution [T1569.002]||\n\n\n-----\n\nCommand and\nControl\n\n[[TA0011]](https://attack.mitre.org/versions/v10/tactics/TA0011/)\n\n\nIngress Tool\nTransfer\n\n[[T1105]](https://attack.mitre.org/versions/v10/techniques/T1105/)\n\n\nThe threat actor downloaded tools from a remote server.\n\n\ntransferred into the network. Unusual\nprocesses with external network\nconnections creating files on-system may\nbe suspicious. Use of utilities, such as File\nTransfer Protocol, that does not normally\noccur may also be suspicious.\n\nAnalyze network data for uncommon data\nflows (e.g., a client sending significantly\nmore data than it receives from a server).\nProcesses utilizing the network that do not\nnormally have network communication or\nhave never been seen before are\nsuspicious.\n\nAnalyze packet contents to detect\ncommunications that do not follow the\nexpected protocol behavior for the port\nthat is being used.\n\nUse intrusion detection signatures to block\ntraffic at network boundaries.\n\n\n### TRITON Malware\n\n[Table 4 maps TRITON’s capabilities to the ATT&CK for ICS framework. For mitigations to harden](https://collaborate.mitre.org/attackics/index.php/Main_Page)\nICS/OT environments, refer to the Mitigations section of this advisory.\n\n[Table 4: ICS Domain Tactics and Techniques for TRITON [4]](https://collaborate.mitre.org/attackics/index.php/Software/S0013)\n\n|Initial Access|Engineering Workstation Compromise [T0818]|TRITON compromises workstations within the safety network.|\n|---|---|---|\n||Change Operating Mode [T0858] Note: this technique also applies to Evasion.|TRITON can halt or run a program through the TriStation protocol. (Note: TriStation protocol is the protocol that Triconex System software uses to communicate with the Tricon PLCs.)|\n||Execution through API [T0871]|TRITON leverages a custom implementation of the TriStation protocol, which triggers APIs related to program download, program allocation, and program changes.|\n\n\n-----\n\nNote: this\ntechnique also\napplies to Tactic:\nPrivilege\nEscalation.\n\nModify Controller\n[Tasking [T0821]](https://collaborate.mitre.org/attackics/index.php/Technique/T0821)\n\n[Native API [T0834]](https://collaborate.mitre.org/attackics/index.php/Technique/T0834)\n\n[Scripting [T0853]](https://collaborate.mitre.org/attackics/index.php/Technique/T0853)\n\nSystem Firmware\n\n[[T0857]](https://www.cisa.gov/uscert/ncas/alerts/-https://collaborate.mitre.org/attackics/index.php/Technique/T0857)\n\nNote: this\n\n[Persistence](https://collaborate.mitre.org/attackics/index.php/Persistence) technique also\n\napplies to Tactic:\nInhibit Response\nFunction.\n\nExploitation for\n\nPrivilege\n\nPrivilege Escalation\n\nEscalation\n\n[[T0890]](https://collaborate.mitre.org/attackics/index.php/Technique/T0890)\n\nExploitation for\n[Evasion [T0820]](https://collaborate.mitre.org/attackics/index.php/Technique/T0820)\n\nIndicator Removal on\n\n[Evasion](https://collaborate.mitre.org/attackics/index.php/Evasion) [Host [T0872]](https://collaborate.mitre.org/attackics/index.php/Technique/T0872)\n\nMasquerading\n\n[[T0849]](https://collaborate.mitre.org/attackics/index.php/Technique/T0849)\n\nRemote System\n\n[Discovery](https://collaborate.mitre.org/attackics/index.php/Discovery) Discovery\n\n[[T0846]](https://collaborate.mitre.org/attackics/index.php/Technique/T0846)\n\nLateral Program Download\nMovement [[T0843]](https://collaborate.mitre.org/attackics/index.php/Technique/T0843)\n\nDetect Operating Mode\n\n[[T0868]](https://collaborate.mitre.org/attackics/index.php/Technique/T0868)\n\n[Collection](https://collaborate.mitre.org/attackics/index.php/Collection) Program Upload\n\n[[T0845]](https://collaborate.mitre.org/attackics/index.php/Technique/T0845)\n\nImpair Unauthorized\n[Process](https://collaborate.mitre.org/attackics/index.php/Impair_Process_Control) Command Message\nControl [[T0855]](https://collaborate.mitre.org/attackics/index.php/Technique/T0855)\n\n[Impact](https://collaborate.mitre.org/attackics/index.php/Impact)\n\n## Revisions\n\nMarch 24, 2022: Initial Version\n\n|Col1|technique also applies to Tactic: Privilege Escalation.|TRITON's injector modifies the address of the handler for a Tristation protocol command so that when the command is received, the payload may be executed instead of normal processing.|\n|---|---|---|\n||Modify Controller Tasking [T0821]|Some TRITON components are added to the program table on the Tricon so that they are executed by the firmware once each cycle.|\n||Native API [T0834]|TRITON's payload takes commands from TsHi.ExplReadRam(Ex) , TsHi.ExplWriteRam(Ex) , and TsHi.ExplExec functions to perform operations on controller memory and registers using syscalls written in PowerPC shellcode.|\n||Scripting [T0853]|TRITON communicates with Triconex Tricon PLCs using its custom Python script. This Python script communicates using four Python modules that collectively implement the TriStation protocol via User Datagram Protocol (UDP) 1502. Note: this use also applies to: Tactic: Command and Control │Technique: Commonly Used Port [T0885]|\n|Persistence|System Firmware [T0857] Note: this technique also applies to Tactic: Inhibit Response Function.|TRITON's injector injects the payload into the Tricon PLCs’ running firmware. A threat actor can use the payload to read and write memory on the PLC and execute code at an arbitrary address within the firmware. If the memory address it writes to is within the firmware region, the malicious payload disables address translation, writes the code at the provided address, flushes the instruction cache, and re-enables address translation. This allows the malware to change the running firmware.|\n|Privilege Escalation|Exploitation for Privilege Escalation [T0890]|TRITON can gain supervisor-level access and control system states by exploiting a vulnerability.|\n|Evasion|Exploitation for Evasion [T0820]|TRITON's injector exploits a vulnerability in the device firmware to escalate privileges and then it disables and (later patches) a firmware RAM/ROM consistency check.|\n||Indicator Removal on Host [T0872]|Afetr running the malicious payload, TRITON's Python script overwrites the malicious payload with a “dummy” program.|\n||Masquerading [T0849]|TRITON’s Python script masquerades as legitimate Triconex software.|\n|||TRITON’s injector masquerades as a standard compiled PowerPC program for the Triconex PLC.|\n|Discovery|Remote System Discovery [T0846]|TRITON’s Python script can autodetect Triconex PLCs on the network by sending a UDP broadcast packet over port 1502.|\n|Lateral Movement|Program Download [T0843]|TRITON leverages the TriStation protocol to download programs to the Tricon PLCs.|\n|Collection|Detect Operating Mode [T0868]|A TRITON Python module provides string representations of difefrent features of the TriStation protocol, including message and error codes, key position states, and other values returned by the status functions.|\n||Program Upload [T0845]|TRITON uploads its payload to the Tricon PLCs.|\n|Impair Process Control|Unauthorized Command Message [T0855]|A threat actor can use TRITON to prevent the Tricon PLC from functioning appropriately.|\n|Impact|Loss of Safety [T0880]|TRITON can reprogram the safety PLC logic to allow unsafe conditions or state to persist.|\n\n\n-----\n\n[This product is provided subject to this Notification and this Privacy & Use policy.](https://www.cisa.gov/uscert/privacy/notification)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Triton/TTPs of Indicted State-Sponsored Russian Cyber Actors Targeting the Energy Sector (AA22-083A).pdf"
    ],
    "report_names": [
        "TTPs of Indicted State-Sponsored Russian Cyber Actors Targeting the Energy Sector (AA22-083A).pdf"
    ],
    "threat_actors": [
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d8dd2ca-5592-482e-b89d-6a7e1a49f4f6",
            "created_at": "2023-01-06T13:46:38.408359Z",
            "updated_at": "2025-03-27T02:00:02.826069Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "TeamSpy",
                "Team Bear",
                "Anger Bear",
                "IRON LYRIC"
            ],
            "source_name": "MISPGALAXY:TeamSpy Crew",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535657,
    "ts_updated_at": 1743041528,
    "ts_creation_date": 1651826935,
    "ts_modification_date": 1651826935,
    "files": {
        "pdf": "https://archive.orkl.eu/3c8d217ea275b96d7c43fa6594e9603029b70e08.pdf",
        "text": "https://archive.orkl.eu/3c8d217ea275b96d7c43fa6594e9603029b70e08.txt",
        "img": "https://archive.orkl.eu/3c8d217ea275b96d7c43fa6594e9603029b70e08.jpg"
    }
}