{
    "id": "7f32c41e-0808-4b85-8881-7395a388b32f",
    "created_at": "2023-01-12T15:02:19.755608Z",
    "updated_at": "2025-03-27T02:11:33.903094Z",
    "deleted_at": null,
    "sha1_hash": "30bfbd0089dc0dfdfeaaca59709d93aa815112af",
    "title": "2021-07-21 - The life and death of the ZeuS Trojan",
    "authors": "",
    "file_creation_date": "2022-05-28T15:30:49Z",
    "file_modification_date": "2022-05-28T15:30:49Z",
    "file_size": 409336,
    "plain_text": "# The life and death of the ZeuS Trojan\n\n**[blog.malwarebytes.com/101/2021/07/the-life-and-death-of-the-zeus-trojan/](https://blog.malwarebytes.com/101/2021/07/the-life-and-death-of-the-zeus-trojan/)**\n\nMalwarebytes Labs July 21, 2021\n\nWhether you’ve read up on Greek mythology or you’re simply a big fan of Marvel comics, the\nname “Zeus” should be familiar to you. In the context of cybercrime though, ZeuS (aka the\nZbot Trojan) is a once-prolific malware that could easily be described as one of a handful of\ninformation stealers ahead of its time. Collectively, this malware and its variants infected\n[millions of systems and stole billions of dollars worldwide.](https://securityintelligence.com/brazil-cant-catch-a-break-after-panda-comes-the-sphinx/)\n\nZeuS was primarily created to be a financial or banking Trojan, otherwise known as\n[crimeware. But, as you’ll see, the extent of its information stealing ability could easily go](https://blog.malwarebytes.com/glossary/crimeware/)\nbeyond covertly pilfering financial information, making it a real threat to individuals and\norganizations of all sizes.\n\nFirst spotted in-the-wild in 2007, the earliest known version of the ZeuS Trojan was caught\nstealing sensitive information from systems owned by the United States Department of\nTransformation. It was believed that ZeuS originated in Eastern Europe. ZeuS affiliates\nfocused their efforts away from corporations and large banks, going after small- to mediumsized organizations, including towns and churches, according to the Federal Bureau of\nInvestigation (FBI).\n\n\n-----\n\n[ZeuS usually arrives via phishing campaigns,](https://blog.malwarebytes.com/glossary/phishing/) [spam campaigns, and drive-by downloads.](https://blog.malwarebytes.com/glossary/spam/)\nHowever, this is easy to change and anyone motivated to conduct financial fraud can easily\nchange who they target and how they want their ZeuS to be delivered. Victims have been\ninfected by ZeuS variants via instant messengers (IM), messaging features in social media\nplatforms, and even a pay-per-install (PPI) service—a way to distribute ads to users that a\nZeuS user employed for their campaigns.\n\nOnce a machine gets infected, ZeuS immediately steals information from web browsers and\n[Windows’ protected storage (PStore), such as banking or financial information and stored](https://docs.microsoft.com/en-us/windows/win32/devnotes/pstore)\naccount credentials, respectively. All stolen data are siphoned off via a command & control\n(C&C) server.\n\n[Furthermore, any system infected with ZeuS also becomes a bot in a](https://blog.malwarebytes.com/glossary/bot/) [botnet. A kind of illegal](https://blog.malwarebytes.com/glossary/botnet/)\nCloud computing platform that can be rented out to other criminals. These bots were also\nused to remotely update the ZeuS variants residing in them.\n\nTo date, there are 545 versions of the ZeuS Trojan, according to a website called\n[ZeuSMuseum.com.](https://zeusmuseum.com/)\n\nThe\n\n\n-----\n\n[FBI’s illustration of a ZeuS cyber theft ring works. (Source: FBI)](https://archives.fbi.gov/archives/news/stories/2010/october/cyber-banking-fraud)\n\n## How mighty is the ZeuS Trojan?\n\nA ZeuS Trojan toolkit can be fashioned to do a number of things both for the fledgling and\nadept fraudster.\n\nZeuS lurks inside infected machines as it stealthily monitors the websites users visit. It\nrecognizes when a user is on a banking website, for example, and then records keystrokes\nwhen the user logs into the site. Because of this, fraudsters can easily log back into that\nbanking account using the recorded keystrokes.\n\nSome variants of ZeuS also affect mobile devices that run Android, Symbian, and Blackberry.\nZeuS is the first information stealing malware that steals Mobile Transaction Authentication\nNumbers (mTANs), a type of [two-factor authentication (2FA) method that banks use when](https://blog.malwarebytes.com/101/2017/01/understanding-the-basics-of-two-factor-authentication/)\nyou want to perform transactions. An mTAN, also called SMS TAN code, is usually a 6-digit\nnumber that is unique per transaction and is sent via SMS.\n\nZeuS steals information in a number of ways, including: Stealing user keystrokes; collecting\nthe text users enter into web forms; taking screenshots whenever the mouse is clicked; so[called man-in-the-browser (MiTB) attacks that add new elements to web forms asking for](https://blog.malwarebytes.com/glossary/man-browser-mitb/)\nthings like social security numbers or bank PINs.\n\n\n-----\n\n[As to what, exactly, ZeuS steals, here is non-exhaustive a list provided by the SecureWorks](https://www.secureworks.com/research/zeus)\nsecurity researchers:\n\nData submitted in HTTP forms\nAccount credentials stored in the Windows Protected Storage\nClient-side X.509 public key infrastructure (PKI) certificates\nFTP and POP account credentials\nHTTP and Flash cookies\n\nZeuS is also capable of re-encrypting itself every time it infects a system, making each\ninfection “unique” and therefore harder to detect.\n\nMany researchers attribute ZeuS’s ability to stay under the radar for long periods of time as\nthe main reason why it became the most sought-after info-stealer kit in the underground\nmarket during its time. It’s likely that ZeuS infected millions of computers, with many victims\nnot realizing that their sensitive data had fallen into the hands of criminals and that their\ncomputer was part of a botnet.\n\nThe ZeuS developers also put a lot of effort into protecting their malware. According to\nSecureWorks, ZeuS 1.3.4.x, a privately sold version of the kit, is protected via a hardwarebased licensing system. Also known as hardware-locked licensing, this system allows the kit\nto be installed on only one computer.\n\n## The “fall” of ZeuS Trojan\n\nIn 2011, the source code for ZeuS 2.0.8.9 was leaked. Some groups or individuals started\noffering the use of ZeuS botnets on a subscription basis. According to a case study on ZeuS\nfrom students at the University of Cambridge, this “maximises earnings by providing the\nsame service to multiple users. For the user of the service, the benefits are in a reduction in\nthe initial financial outlay, while outsourcing the logistical and maintenance requirements, and\nreducing the risk of failure to achieve results.”\n\nCybercriminals also began creating their own ZeuS-based information stealers, make ZeuS\nitself something of a footnote. Citadel, GameOver, Panda Banker, [Terdot, Floki, and Sphinx](https://blog.malwarebytes.com/threat-analysis/malware-threat-analysis/2017/11/terdot-trojan-likes-social-media/)\nare some of the known ZeuS variants to date.\n\nBefore the code leak, it was rumored that the ZeuS creator would be retiring and then selling\nhis code to a competitor called SpyEye, an up-and-coming information stealer that made\nheads turn for being able to remove ZeuS infections. There had been reports of a code\nhand-over, yes, further confirming the merging of the two malware, but the ZeuS creator\ndidn’t quit. [According to a report from Brian Krebs, the creator merely stopped selling it](https://krebsonsecurity.com/2015/02/fbi-3m-bounty-for-zeus-trojan-author/)\npublicly and started creating “a more robust and private version of Zeus” instead.\n\n\n-----\n\n[In 2013, the FBI charged and arrested Aleksander Harderman Panin, a 24-year-old](https://krebsonsecurity.com/2014/01/feds-to-charge-alleged-spyeye-trojan-author/)\nRussian male believed to be the creator of the SpyEye Trojan. That same year, Hamza\nBendelladj, a 24-year-old Algerian male, was arrested and charged for developing\ncomponents of SpyEye, operating botnets infected with SpyEye, and of course, fraud\ncharges.\n\n## Is ZeuS dead?\n\nAs long as criminals continue to use bits and pieces of its code to create their own malware,\nZeuS can’t be considered dead, so much as fading away slowly. However, ZeuS’s purpose,\ndata theft, is making a comeback.\n\nBanking trojans haven’t gone away, but in recent years their activity has been eclipsed by an\nepidemic of ransomware. Recently though, major ransomware operators have taken to\nstealing victims’ data before encrypting it, so they can threaten to leak it.\n\n[The tactic has been so successful that some ransomware actors claim to be moving away](https://blog.malwarebytes.com/reports/2021/06/babuk-ransomware-builder-leaked-following-muddled-retirement/)\nfrom encrypting files, and focussing entirely on finding and exfiltrating sensitive data from\norganisations.\n\nIn fact, following a devastating attack on Ireland’s public health system, the Conti\n[ransomware gang issued the Health Service Executive (HSE), a free decryption key to](https://www.bbc.co.uk/news/world-europe-57197688)\nunlock all of their affected files, convinced that simply publishing and selling the data they\nhad stolen was leverage enough.\n\nHow long I wonder, before information stealers are another thing Biden will be phoning Putin\nfor?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-21 - The life and death of the ZeuS Trojan.pdf"
    ],
    "report_names": [
        "2021-07-21 - The life and death of the ZeuS Trojan.pdf"
    ],
    "threat_actors": [
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535739,
    "ts_updated_at": 1743041493,
    "ts_creation_date": 1653751849,
    "ts_modification_date": 1653751849,
    "files": {
        "pdf": "https://archive.orkl.eu/30bfbd0089dc0dfdfeaaca59709d93aa815112af.pdf",
        "text": "https://archive.orkl.eu/30bfbd0089dc0dfdfeaaca59709d93aa815112af.txt",
        "img": "https://archive.orkl.eu/30bfbd0089dc0dfdfeaaca59709d93aa815112af.jpg"
    }
}