{
    "id": "7f34810d-3f65-48bf-a2f1-d25476ffe159",
    "created_at": "2023-01-12T15:02:34.571751Z",
    "updated_at": "2025-03-27T02:09:18.518961Z",
    "deleted_at": null,
    "sha1_hash": "233ce90efcfcaa902aa444256dc36dd189290910",
    "title": "2021-08-04 - Hotcobalt – New Cobalt Strike DoS Vulnerability That Lets You Halt Operations",
    "authors": "",
    "file_creation_date": "2022-05-28T04:47:02Z",
    "file_modification_date": "2022-05-28T04:47:02Z",
    "file_size": 1214975,
    "plain_text": "# Hotcobalt – New Cobalt Strike DoS Vulnerability That Lets You Halt Operations\n\n**[labs.sentinelone.com/hotcobalt-new-cobalt-strike-dos-vulnerability-that-lets-you-halt-operations/](https://labs.sentinelone.com/hotcobalt-new-cobalt-strike-dos-vulnerability-that-lets-you-halt-operations/)**\n\nGal Kristal\n\n## Executive Summary\n\nVersions 4.2 and 4.3 of Cobalt Strike’s server contain multiple Denial of Service\nvulnerabilities (CVE-2021-36798).\nThe vulnerabilities can render existing Beacons unable to communicate with their C2\nserver, prevent new beacons from being installed, and have the potential to interfere\nwith ongoing operations.\nWe have released a new Python library to help generically parse Beacon\ncommunication in order to help the research security community.\n\n## Introduction\n\nCobalt Strike is one of the most popular attack frameworks designed for Red Team\noperations. At the same time, many APTs and malicious actors also use it.\n\nSentinelOne has seen numerous attacks involving Cobalt Strike Beacons across our\ncustomer base. SentinelOne detects Cobalt Strike Beacon and we are constantly rolling out\nnew ways to detect modifications or novel ways to load Beacon in memory.\n\n\n-----\n\nGiven its rampant adoption by red teams and attackers alike, we wanted to better\nunderstand the operational security of Cobalt Strike. This led us to discover the\nvulnerabilities reported in CVE-2021-36798 and which we describe below.\n\n## Beacon Communications\n\nTo understand the vulnerabilities we found, we will briefly cover how Cobalt Strike Beacon\ncommunication works.\n\nThe first time the Cobalt Strike server runs, it creates randomly generated RSA keys, private\nand public, stored in a file named “.Cobalt Strike.beacon_keys”. Every Beacon stager has\nthe public key embedded in it.\n\n[We can get the Beacon’s public RSA key by parsing its configuration](https://github.com/Sentinel-One/CobaltStrikeParser)\nWhen a Beacon stager runs, it gathers information about the computer it is running on (CPU\narchitecture, keyboard layout, internal IP, etc.), encrypts that info using the public key, and\nsends it to the server in an HTTP GET request. We will refer to that part as “Beacon\nregistration”.\n\nAfter the Beacon has registered with the server, the attacker can interact with the Beacon.\nFrom this point, the Beacon works by receiving and replying to “tasks”. Tasks can, for\nexample, be used to get a process list, run a command, conduct lateral movement, and\nmany other things of interest to the attacker.\n\nReceiving tasks generally happens over HTTP GET requests and the Beacon replies with\nthe task data over HTTP POST requests. Tasks are encrypted using an AES key sent by the\nBeacon in the registration request. The entire communication flow is explained in the official\ndocumentation, but the outline above should suffice for what follows.\n\nOne of the most famous features of Cobalt Strike is its [Malleable C2. In short, this feature](https://www.cobaltstrike.com/help-malleable-c2)\nlets the attacker encode (“transform” in Cobalt’s language) all the beacon’s HTTP\ncommunications. The entire process described above is wrapped in the chosen Malleable\nprofile’s transformation steps, which are also embedded in the stager itself.\n\nBelow is an example of a popular Malleable C2 profile that masquerades traffic as a normal\n[request for the jquery code (source):](https://github.com/threatexpress/malleable-c2/blob/master/jquery-c2.3.11.profile)\n\n\n-----\n\nAn example of\n\na popular Malleable C2 profile\n\n## Vulnerabilities\n\n[First, it should be noted that there was already one known vulnerability in Cobalt Strike that](https://blog.cobaltstrike.com/2016/09/28/cobalt-strike-rce-active-exploitation-reported/)\n[was previously reported. A great write-up written by nccgroup is worth reading for a more in-](https://research.nccgroup.com/2020/06/15/striking-back-at-retired-cobalt-strike-a-look-at-a-legacy-vulnerability/)\ndepth understanding of Beacon’s communication internals. In practice, that vulnerability\nallowed for remote code execution on the server.\n\nWe’re not interested in remote code execution vulnerability here as it would be overkill for our\npurposes. Considering that the server’s code is written in Java and isn’t very large, it wasn’t\ntoo hard to find bugs there.\n\nFor example, in the Screenshot and Keylogger task replies, there’s an interesting behavior\nwhen reading the reply’s data:\n\n\n-----\n\n```\npublic void process_beacon_callback_decrypted(final String beaconID, final byte[]\nresponseBytes) {\n...\n// Sanity checks here\n...\ntry {\nfinal DataInputStream responeBytesStream = new DataInputStream(new\nByteArrayInputStream(responseBytes));\ncmd = responeBytesStream.readInt();\nif (cmd == 0) {...}\n...\nelse if (cmd == 3) {\n     final DataParser dp = new\nDataParser(CommonUtils.readAll(responeBytesStream));\n     dp.little();\n     final byte[] scData = dp.readCountedBytes();  // Bug #1 here\n     final int scDesktop = dp.readInt();\n     final String scTitle = this.getCharsets().process(beaconID,\ndp.readCountedBytes());\n     final String process6 = this.getCharsets().process(beaconID,\ndp.readCountedBytes());\n     if (scData.length == 0) {\n          output(BeaconOutput.Error(beaconID, \"screenshot from desktop \" +\nscDesktop + \" is empty\"));\n          return;\n     }\n     ...  \n     output(BeaconOutput.OutputB(beaconID, \"received screenshot of \" + scTitle + \"\nfrom \" + process6 + \" (\" + CommonUtils.formatSize(scData.length) + \")\"));\n     ...\n}}}\n\n```\nIn this example, we see the parsing of a screenshot task reply. To read the screenshot’s\ndata, it calls the function readCountedBytes, which reads an integer from the first four bytes\nof the data and treats it as the screenshot’s size without any sanity checks.\n\nThen, before reading the screenshot’s data, it allocates a buffer big enough to hold it:\n```\nbyte[] array = new byte[ReplySize];\n\n```\nBy manipulating the screenshot’s size we can make the server allocate an arbitrary size of\nmemory, the size of which is totally controllable by us. However, in order to trigger this piece\nof code, we need to be able to talk to the server like a Beacon.\n\nBy combining all the knowledge of Beacon communication flow with our configuration parser,\nwe have all we need to fake a Beacon.\n\n[We’ve published a POC python script that does just that: it parses a Beacon’s configuration](https://github.com/Sentinel-One/CobaltStrikeParser/blob/master/extra/communication_poc.py)\nand uses the information stored in it to register a new random Beacon on the server. After\nregistering the Beacon, it’s pretty trivial to use the primitive found above to iteratively send\n\n\n-----\n\nfake task replies that squeeze every bit of available memory from the C2 s web server\nthread:\n```\nsize = 1000000000\nwhile True:\n  try:\n    if size < 20:\n      break\n    send_task(fake_beacon, size)\n  except KeyboardInterrupt:\n    break\n  except Exception as e:\n    size = size // 2\n\n```\nThis leads to the crashing of the server’s web thread that handles HTTP stagers and Beacon\ncommunication:\n\nCrashing the server's web thread\nThis would allow an attacker to cause memory exhaustion in the Cobalt Strike server (the\n“Teamserver”) making the server unresponsive until it's restarted. This means that live\nBeacons cannot communicate to their C2 until the operators restart the server.\n\nRestarting, however, won’t be enough to defend against this vulnerability as it is possible to\nrepeatedly target the server until it is patched or the Beacon’s configuration is changed.\n\nEither of these will make the existing live Beacons obsolete as they’ll be unable to\ncommunicate with the server until they’re updated with the new configuration. Therefore, this\nvulnerability has the potential to severely interfere with ongoing operations.\n\nAlthough used every day for malicious attacks, Cobalt Strike is ultimately a legitimate\nproduct, so we have disclosed these issues responsibly to HelpSystems and they have fixed\nthe vulnerabilities in the last release.\n\n## Utilities\n\nOn our [Cobalt Strike parser repository, we’ve added new modules and code examples that](https://github.com/Sentinel-One/CobaltStrikeParser)\nimplement:\n\nParsing of a Beacon’s embedded Malleable profile instructions\nParsing of a Beacon’s configuration directly from an active C2 (like the popular nmap\nscript)\nBasic code for communicating with a C2 as a fake Beacon\n\nOther than registering a fake Beacon with the server, the code we are releasing makes it\neasier to parse captured Beacon communications in a generic way.\n\n\n-----\n\nLet s take, for example, a case of a captured unencrypted Beacon communication from\n[malware-traffic-analysis and decode it using the new communication module:](https://www.malware-traffic-analysis.net/2019/07/25/index.html)\n```\nfrom urllib import parse\nfrom pcaper import PcapParser\nfrom parse_beacon_config import *\nfrom comm import *\nconf = cobaltstrikeConfig(r\"beacon.bin\").parse_config()\npparser = PcapParser()\nreqs = pparser.read_pcap({'input': r\"2019-07-25-Hancitor-style-Amadey-with-Pony-andCobalt-Strike.pcap\"})\nt = Transform(conf['HttpPost_Metadata'])\nfor req in reqs:\n     if conf['HttpPostUri'] in req.uri:\n          params = {k: v[0] for k, v in\nparse.parse_qs(parse.urlsplit(req.uri).query).items()} \n          print('nnFound beacon reply:n', t.decode(req.body, req.headers,\nparams)[1])\n\n```\nOutput:\n```\n...\nFound beacon reply:\n ♠r↓10.7.25.101:445 (platform: 500 version: 6.1 name: HIDDENROAD-PC domain:\nWORKGROUP)\nScanner module is complete\n\"))\nFound beacon reply:\n ☺►[*] Wrote hijack DLL to 'C:UsersSARAH~1.RUTAppDataLocalTemp745f.dll'\n[+] Privileged file copy success! C:WindowsSystem32sysprepCRYPTBASE.dll\n[+] C:WindowsSystem32sysprepsysprep.exe ran and exited.\n[*] Cleanup successful\n...\n\n```\nIt parses the Malleable C2 instructions embedded in the Beacon’s configuration and uses it\nto decode Beacon replies from the captured HTTP requests.\n\nThere’s a lot that can be done with this new communication library and it will be interesting to\nsee what other researchers from the community will do with it.\n\n## Conclusion\n\n[Research into attack frameworks like Cobalt Strike and Cellebrite is still a niche area. We](https://signal.org/blog/cellebrite-vulnerabilities/)\nhope that this research and the tools we have released help to further encourage research\ninto the robustness of attack frameworks and expand the range of available options when\nfacing their consistent abuse.\n\n## Disclosure Timeline\n\n\n-----\n\nWe would like to thank HelpSystems for their approach to our disclosure and for remediating\nthe vulnerabilities.\n\n04/20/2021 - Initial contact with HelpSystems for issue disclosure.\n04/22/2021 - Issue details disclosed to HelpSystems.\n04/23/2021 - HelpSystems confirmed the issue and asked for an extension until August 3rd.\n04/28/2021 - SentinelOne accepted the extension.\n07/18/2021 - Submitted CVE request to MITRE.\n07/19/2021 - CVE-2021-36798 was assigned and reserved for the specified issue.\n08/02/2021 - SentinelOne shared the publication date and post for review.\n08/02/2021 - HelpSystems reviewed and confirmed the post for publication.\n08/04/2021 - HelpSystems released Cobalt Strike 4.4, which contains a fix for CVE-202136798.\n\nAll issues found by SentinelOne are disclosed to the relevant third party according to our\n[Responsible Disclosure Policy for Third Parties.](https://www.sentinelone.com/legal/responsible-disclosure-policy-for-third-parties/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-04 - Hotcobalt – New Cobalt Strike DoS Vulnerability That Lets You Halt Operations.pdf"
    ],
    "report_names": [
        "2021-08-04 - Hotcobalt – New Cobalt Strike DoS Vulnerability That Lets You Halt Operations.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535754,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653713222,
    "ts_modification_date": 1653713222,
    "files": {
        "pdf": "https://archive.orkl.eu/233ce90efcfcaa902aa444256dc36dd189290910.pdf",
        "text": "https://archive.orkl.eu/233ce90efcfcaa902aa444256dc36dd189290910.txt",
        "img": "https://archive.orkl.eu/233ce90efcfcaa902aa444256dc36dd189290910.jpg"
    }
}