{
    "id": "7f62fac9-84f6-4454-8189-9c1fa19fba34",
    "created_at": "2023-01-12T15:00:10.540362Z",
    "updated_at": "2025-03-27T02:08:40.679832Z",
    "deleted_at": null,
    "sha1_hash": "b4e7a4126a4e5851576c54567a1d3801018457bd",
    "title": "2011-03-28 - Microsoft Hunting Rustock Controllers",
    "authors": "",
    "file_creation_date": "2022-05-28T04:08:56Z",
    "file_modification_date": "2022-05-28T04:08:56Z",
    "file_size": 212292,
    "plain_text": "# Microsoft Hunting Rustock Controllers\n\n**[krebsonsecurity.com/2011/03/microsoft-hunting-rustock-controllers/](https://krebsonsecurity.com/2011/03/microsoft-hunting-rustock-controllers/)**\n\nWho controlled the Rustock botnet? The question remains unanswered: Microsoft’s recent\ntakedown of the world’s largest spam engine offered tantalizing new clues to the identity and\nearnings of the Rustock botmasters. The data shows that Rustock’s curators made millions\nby pimping rogue Internet pharmacies, but also highlights the challenges that investigators\nstill face in tracking down those responsible for building and profiting from this complex crime\nmachine.\n\nEarlier this month, Microsoft [crippled Rustock by convincing a court to let it seize dozens of](http://krebsonsecurity.com/2011/03/rustock-botnet-flatlined-spam-volumes-plummet/)\nRustock control servers that were scattered among several U.S.-based hosting providers.\nShortly after that takedown, I began following the money trail to learn who ultimately paid the\nbotnet controllers’ hosts for their services.\n\n\n-----\n\nAccording to interviews with investigators involved in the\nRustock takedown, approximately one-third of the control\nservers were rented from U.S. hosting providers by one entity:\nA small business in Eastern Europe that specializes in\nreselling hosting services to shadowy individuals who frequent\nunderground hacker forums.\n\nKrebsOnSecurity.com spoke to that reseller. In exchange for\nthe agreement that I not name his operation or his location, he\nprovided payment information about the customer who\npurchased dozens of servers that were used to manipulate the\nday-to-day operations of the massive botnet.\n\nThe reseller was willing to share information about his client\nbecause the customer turned out to be a deadbeat: The\ncustomer walked out on two months worth of rent, an\noutstanding debt of $1,600. The reseller also seemed willing to talk to me because I might be\nable bend the ear of Spamhaus.org, the anti-spam group that urged ISPs worldwide to\nblock his Internet addresses (several thousand dollars worth of rented servers) shortly after\nMicrosoft announced the Rustock takedown.\n\nI found the reseller advertising his services on a Russian-language forum that caters\nexclusively to spammers, where he describes the hardware, software and connection speed\ncapabilities of the very servers that he would later rent out to the Rustock botmaster. That\nsolicitation, which was posted on a major spammer forum in January 2010, offered\nprospective clients flexible terms without setting too many boundaries on what they could do\nwith the servers. A translated version of part of his message:\n\n“I am repeating again that the servers are legitimate, funded by us and belong to our\ncompany. To the datacenters, we are responsible to ensure that you are our client, and\nthat you will not break the terms of use. Also, to you we are responsible to make sure\nthat the servers are not going to be closed down because of credit card chargebacks,\nas it happens with servers funded with stolen credit cards. In conclusion, they do not\nhave an abuse report center, they are suitable for legitimate projects, VPNs and\neverything else that does not lead to problems and complaints to the data center from\nactive Internet users. Please, take it in consideration, so that nobody is pissed off and\nthere is no bad impression from our partnership.”\n\nThe reseller said he had no idea that his customer was using the servers to control the\nRustock botnet, but he hastened to add that this particular client didn’t attract too much\nattention to himself. According to the reseller, the servers he resold to the Rustock botmaster\ngenerated just two abuse complaints from the Internet service providers (ISPs) that hosted\nthose servers. Experts say this makes sense because botnet control servers typically\ngenerate few abuse complaints, because they are almost never used for the sort of activity\n\n\n-----\n\nthat usually prompts abuse reports, such as sending spam or attacking others online.\nInstead, the servers only were used to coordinate the activities of hundreds of thousands of\nPCs infected with Rustock, periodically sending them program updates and new spamming\ninstructions.\n\n[The reseller was paid for the servers from an account at WebMoney, a virtual currency](https://secure.wikimedia.org/wikipedia/en/wiki/WebMoney)\nsimilar to PayPal but more popular among Russian and Eastern European consumers. The\nreseller shared the unique numeric ID attached to that WebMoney account — WebMoney\npurse “Z166284889296.” That purse belonged to an “attested” WebMoney account, meaning\nthat the account holder at some point had to verify his identity by presenting an official\nRussian passport at a WebMoney office. A former law enforcement officer involved in the\nRustock investigation said the name attached to that attested account was “Vladimir\nShergin.” According to the reseller, the client stated in an online chat that he was from Saint\nPetersburg, Russia.\n\nA LUCRATIVE PILL-PUSHING MACHINE\n\nAs it happens, that same WebMoney account is\nconnected to three of the top promoters of\n“SpamIt,” a rogue pharmacy program that paid\nspammers millions of dollars to promote fly-bynight sites that sold counterfeit prescription\ndrugs. SpamIt closed its doors in September\n2010 when its alleged leader came under\nscrutiny from Russian authorities. The SpamIt\nfinancial books sent to me by an anonymous\nsource last year include the ICQ numbers,\nphone numbers and financial account\ninformation for hundreds of established criminal hackers and spammers. The SpamIt\naccounts show that a promoter using the nickname “Cosma2k” who used that WebMoney\naccount was consistently among the top 10 moneymakers for SpamIt, and that he earned\nmore than a half-million dollars in commissions over the course of three years with the\npharmacy program.\n\nYet this appears to be only a fraction of Cosma2k’s total earnings through SpamIt. The\npharmacy program’s records show that a Cosma2k affiliate also used at least one other\nWebMoney account that was shared with two other top SpamIt members, accounts tied to\nthe user names “Bird” and “Adv1.” A review of the account details for all three affiliates\nshow they also all provided the same ICQ number at time of registration. The total\ncommissions from all three user accounts at SpamIt was nearly $2.14 million over three-anda-half years.\n\n\n-----\n\nBut that s not all: Those same three affiliate names — Cosma2k, Bird and Adv1 — also were\nregistered using the same ICQ account at Rx-Promotion, a competing rogue Internet\npharmacy program. Rx-Promotion suffered a security breach last year in which its affiliate\nrecords were taken. A copy of those records was shared with KrebsOnSecurity.com, and\nthey show that these three accounts collectively earned approximately $200,000 in\ncommissions by promoting pharmacy Web sites for Rx-Promotion in 2010.\n\nIf Cosma2k really is responsible for Rustock, the payment data suggests either that he was\nsharing control over the botnet with others, or that he split his promotion activities across\nmultiple accounts, perhaps to keep legions of other affiliates from feeling resentful of his\nearnings and to avoid calling undue attention to any one account. In fact, the SpamIt account\nbelonging to Bird was by far the highest earning affiliate account in the entire history of\nprogram, and Bird routinely earned twice as much in commissions as the next most\nsuccessful affiliate (which often enough was either Cosma2k or Adv1). In January 2010, for\nexample, the SpamIt records show Bird’s spam generated more than $130,000 in pharmacy\nsales, while the next most successful affiliate for that month realized about $86,000 in sales.\n\n**Alex Lanstein, a network architect at FireEye, a Milpitas,**\nCalif. based security firm that [worked closely with Microsoft on](http://blog.fireeye.com/research/2011/03/an-overview-of-rustock.html)\nthe Rustock takedown, said he doubts there were multiple\npeople responsible for running Rustock.\n\n[In fact, Lanstein said, bots such as ZeuS and](http://krebsonsecurity.com/tag/zeus/) [Mega-D have](http://krebsonsecurity.com/2010/12/fbi-identifies-russian-mega-d-spam-kingpin/)\nshown that it doesn’t take more than one coder to be wildly\nsuccessful. “Most people probably assume that to be wildly\nsuccessful in the world of botnets, you need to have a huge\nteam of programmers. Most malware these days is specialized\nwith only one or two real functions built-in,” Lanstein said.\n“Why incur of the overhead of splitting profits when a bot\noperator can pay one-time fees to a 3rd party service and keep\nthe real profit for yourself?”\n\n“Unfortunately the barrier for entry into the malware game is extremely low, and when\nextradition is difficult, and the criminals avoid affecting computers in their own country, the\nburden on law enforcement is extreme.”\n\nSOFTWARE GIANT SEEKS BOTMASTER FOR COURTROOM DRAMA\n\nMicrosoft also was in communication with my informant reseller, and obtained much of the\nsame data as I did. And the company plans to soon publish at least some of the information,\nalbeit in a rather unusual way. According to Richard Boscovich, senior attorney for\nMicrosoft’s Digital Crimes Unit, the software giant seized the Rustock control servers by\nsecuring what’s known as an “ex parte temporary restraining order,” which allowed Microsoft\nto take down the botnet without giving the defendants advance notice.\n\n\n-----\n\nBut Microsoft is required by law to now make a good faith effort to contact the owner(s) of\nRustock control domains and other infrastructure the company has since seized, and to\nnotify the individual(s) of the date, time and location of an upcoming court hearing in Seattle,\nWashington, where the defendants will have an opportunity to be heard.\n\nMicrosoft will publish the information on a Web site set up for this purpose –\n[noticeofpleadings.com. The company may also seek to publish the information in one or](http://noticeofpleadings.com/)\nmore major Russian newspapers, Boscovich said.\n\n“We will have to send out a notice to the individual or [group of] individuals we believe is\nbehind the bot,” Boscovich said. “We will probably also serve notice of process in Russian\nnewspapers or in a Saint Petersburg newspaper, saying ‘Hey, Mr. Such-and-Such, there is a\ncourt hearing in Seattle on this case and we expect you to be there.'”\n\nIt will be interesting to see who, if anyone, responds to the Microsoft notices, and whether\nthe veil of anonymity will be lifted from the pseudonyms of botmasters, spammers, and\naccount holders. Stay tuned!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-03-28 - Microsoft Hunting Rustock Controllers.pdf"
    ],
    "report_names": [
        "2011-03-28 - Microsoft Hunting Rustock Controllers.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535610,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653710936,
    "ts_modification_date": 1653710936,
    "files": {
        "pdf": "https://archive.orkl.eu/b4e7a4126a4e5851576c54567a1d3801018457bd.pdf",
        "text": "https://archive.orkl.eu/b4e7a4126a4e5851576c54567a1d3801018457bd.txt",
        "img": "https://archive.orkl.eu/b4e7a4126a4e5851576c54567a1d3801018457bd.jpg"
    }
}