{
    "id": "7fab313f-c027-4576-8d91-85825ba0a172",
    "created_at": "2023-01-12T15:06:39.390168Z",
    "updated_at": "2025-03-27T02:12:13.856531Z",
    "deleted_at": null,
    "sha1_hash": "36b8c2b47aed727a60fb5a1a68f0144c38c5debf",
    "title": "2022-05-24 - Blame the Messenger- 4 Types of Dropper Malware in Microsoft Office & How to Detect Them",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:05Z",
    "file_modification_date": "2022-06-01T12:23:05Z",
    "file_size": 5487800,
    "plain_text": "# Blame the Messenger: 4 Types of Dropper Malware in Microsoft Office & How to Detect Them\n\n**[deepinstinct.com/blog/types-of-dropper-malware-in-microsoft-office](https://www.deepinstinct.com/blog/types-of-dropper-malware-in-microsoft-office)**\n\nMay 24, 2022\n\n## 100% Prevention Score in the 2022 MITRE ATT&CK Evaluation for\n Enterprise\n\n[Learn more](https://www.deepinstinct.com/news/deep-instinct-shows-100-percent-score-in-mitre-evaluations)\n\nMay 24, 2022 | [Bar Block](https://www.deepinstinct.com/author/bar-block)\n\nMicrosoft Office droppers have been a favorite of threat actors for years, continuously finding\nand exploiting them. Cybersecurity vendors take note and block these entry routes. It‘s a\nperpetual cat and mouse game and, unfortunately, bad actors typically have the upper hand\n\n\n-----\n\n– at least for a short time. And as AI-based solutions have matured and gained market share\nthese tools have also been targeted for evasion.\n\nThis blog will review a variety of VBA droppers that employ different bypass techniques,\n[including an analysis of an evasion method used in the recent Emotet wave. We will also](https://www.deepinstinct.com/blog/the-re-emergence-of-emotet)\nintroduce a Python script I wrote to increase the likelihood of detecting these threats.\n\n## You Got Malware — Aggah’s Use of MsgBox Comments\n\n[Aggah, a threat actor group that has been active since 2019, has delivered many payloads,](https://www.deepinstinct.com/blog/aghast-at-aggah-teasing-security-controls-with-advanced-evasion-techniques)\nmostly RevengeRAT, to numerous victims. This group is particularly adept at working with\nMicrosoft Office documents and employs various methods in their VBA scripts to make them\nstealthier. One of these methods, which appears to be used to evade AI-based cyber tools, is\nthe use of comments containing the string ‘MsgBox.’\n\n‘MsgBox’ is a function used in VBA to prompt message boxes, which appear in many Visual\nBasic scripts and is usually benign. Having this string in the comments of a VBA code\nincreases the likelihood that it will be classified as benign by an AI module. If the code is\nshort and the lengthy ‘MsgBox’ comments comprise a substantial part of it, this will further\nincrease the chances that it will be classified as benign.\n\nAn Aggah dropper's VBA code\n\n## A Command in a Comments Stack — Emotet’s Use of Random Sentences\n\nWe have seen recent Emotet VBA droppers containing long comments composed of random\nwords. As we see in the figure below, the executed command and the variable containing it\nwere not obfuscated, just floating in a sea of long random comments.\n\n\n-----\n\nUsing these excessive comments might fool both analysts and AI solutions (the former might\nmiss the malicious MSHTA execution when looking at the code, and the latter might give\nmore consideration to the benign features, aka the excessive comments, than to the\nmalicious ones).\n\nFigure 2: An Emotet dropper's VBA\n\ncode, the actual commands are highlighted in yellow. Note: a few long comments were redacted, since each of them is justa compilation of random words and none of them contribute to the understanding of the code’s functionality.\n\n## Homegrown Obfuscation — Dridex’s Usage of Self-Created Functions\n\nOne of the most interesting droppers we have recently observed was crafted by the\nnotorious threat group Dridex. In the following example, Dridex employs several\nsophisticated methods aimed at increasing its likelihood of success — delivering a payload\nsuccessfully and without detection.\n\n\n-----\n\nAs we see below, the script retrieves strings stored in Excel cells and runs them through the\n‘slow’ function, which returns a de-obfuscated version of its input. The first string is collected\nfrom the “B101” cell and is translated into “WScript.Shell,” the second is assembled by\nactivating VBA’s “Transpose” and “Join” commands on the cells range “K111:K118.”\n\nThe Dridex dropper’s VBA\n\noutput. Note: some parts of the code were redacted, since they are irrelevant to this blog.\n\nAfter retrieving the data from the cells, the following is received:\n\n\n-----\n\nTo de-obfuscate this part, I replaced every “${PJ}” and “${GAB}” mentioned in comma and\nquotation mark, respectively. I also replaced the indexed placeholders with the appropriate\nstrings and removed unnecessary characters, such as backticks.\n\nThis resulted in the following code:\n\n\n-----\n\nThis is obviously obfuscated as well — the main executed string is base64 encoded and\ndeflate compressed. Of note, the attackers went the extra mile and tried to hide their use of\nthe ‘iex’ command (short for ‘Invoke-Expression’) by retrieving the characters ‘i’ and ‘e’ from\nthe value of the environment variable ‘pshome,’ which contains the path to the PowerShell\ndirectory, as can be seen in the highlighted section above.\n\nAfter base64 decoding and decompressing the base64 encoded string, yet another\nobfuscated string is received.\n\n\n-----\n\nAfter reassembling the strings and removing unnecessary characters, the following is\nreceived:\n\n\n-----\n\nJust as before, base64 decoding and decompression are required in order to retrieve the\ncode of the next stage. However, this time Dridex employs something we have not seen in\nprevious stages — aliases.\n\nIn the above snippet, ‘nal’ (‘New-Alias’) and ‘sal’ (‘Set-Alias’) are used to set ‘cf’ and ‘ox’ as\naliases for ‘New-Object’ and ‘iex,’ respectively.\n\n“.(‘yi’)(${aB})” returns another call to the ‘yi’ function, which in turn provides the following\noutput:\n\n\n-----\n\nAnd after some cleanup, we can finally get a semi-clear picture of what the dropper tries to\ndo:\n\n\n-----\n\n-----\n\nAfter going over the above code (and adding a few notes for myself along the way, which I\nleft in the snippet), I finally reached a verdict regarding the dropper’s true intention: it\nretrieves the user’s ID, removes the hyphens it contains, and assembles a URL that looks\nlike this https://geronaga[.]com/gero?myHyphenLackingUID. It then downloads a file to the\nuser’s temp directory, decodes and decrypts it, executes the file’s content using ‘regsvr32’\nand then, finally, deletes this content to avoid leaving any traces.\n\nSince the domain is inactive and the focus of our blog is to present evasion techniques in\nMicrosoft Office droppers, I did not expand my analysis of the downloaded file. However,\nsince we know that ‘regsvr32’ is used to execute the file’s content and that the payload is a\nDLL, we can assume that the downloaded file contains a DLL registration command for the\npayload.\n\nFor a more expanded analysis of this dropper, you can read [this excellent blog.](https://haxys.net/tutorials/reversing/powershell/0-reverse/)\n\n## Less Complicated, More Files\n\nSometimes, simple obfuscation techniques can be sufficient to avoid detection, especially if\nthe infection flow involves multiple stages and files written in different scripting languages, as\ndemonstrated below in the analysis of an Emotet dropper from the malware family’s recent\nresurrection.\n\n\n-----\n\nThe Emotet dropper's VBA output. Note:\n\nsome parts of the code were redacted, since they are irrelevant to this blog, moreover, some of them are never executed.\n\nAs you can see, the VBA function “Cells” is used in this script to extract contents of specified\nExcel cells and use them in the VBA script. Without knowing what these cells contain, it is\ndifficult to determine whether the file is malicious or not, especially since none of the\ncommands seems damning enough.\n\nTo get a clearer picture, I replaced all the cells highlighted functions in the above code\nsnippet with the matching string values, highlighted in yellow in the below code snippet.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\nThis provided greater insight into the script’s functionality; the “Wscript.shell” string suggests\nWscript will be used to execute additional commands, while \"c:\\programdata\\ughldskbhn.bat\"\nand \"c:\\programdata\\yhjlswle.vbs\" imply that Emotet uses these Batch and VBS files in this\ninfection flow.\n\nThe strings highlighted in green in the above snippet are replaced in the lengthy strings\nextracted from the Excel cells by an empty string using the VBA “Replace” function. Padding\nparts of the actual commands with these strings decreases the chances of them being\nflagged during a static analysis. After the VBA “Replace” command is run, the following is\nreceived:\n\n\n-----\n\nWith the information from the above decoded strings in hand, I could determine that the next\nstage in the infection flow is the VBS script, which the VBA dropper executes using “wscript.”\nSince there were no direct calls to the BAT script in the VBA code, I could assume that, if\nused, it would be executed from the VBS script.\n\nBasically, the VBA dropper only creates the VBS and BAT files, writes content into each of\nthem, and then the VBS script takes center stage.\n\n\n-----\n\nc:\\programdata\\yhjlswle.vbs’s original content\n\nAs can be seen above, the VBS script contains several commands, all concatenated using\ncolons. After separating the commands into different lines and activating the “replace”\nfunctions, I received the following:\n\nBasically, the script executes the previously created Batch file and then tries to execute\n“c\\:programdata\\x08neuihlows.dll,” while providing it with the value “hjyldksfkw3” using\nrundll32. Since this is the first mention of “x08neuihlows.dll” and the VBS file executes the\nBatch script before running the DLL, it is fair to assume that the BAT script is in charge of\ndropping the executable in the right location.\n\nJust like the VBS file uses colons to concatenate commands, the BAT script uses\nampersands to do the same:\n\n\n-----\n\nIn short, the script sets a few variables, and concatenates their values in the below\ncommand.\n\n\n-----\n\nWhich translates into the following:\n\nAfter base64 decoding the PowerShell script, I discovered how Emotet downloads their DLL\npayload and from where.\n\nAs can be seen below, the variable “MJXdfshDrfGZses4” contains a list of URLs which the\nscript goes over using a “for” loop. Each time the “for” loop runs, it tries to download the\nEmotet DLL into \"c:\\programdata\\bneuihlows.dll\" using “Invoke-WebRequest.” Then, it\nchecks if the downloaded file’s length is greater than 47436 bytes. If so, it means that the\nDLL was downloaded successfully, and the loop breaks.\n\n\n-----\n\nThe PowerShell code used\n\nto retrieve the Emotet payload\n\n## Interesting Cells and Where to Find Them\n\nAs we see in the above analysis, storing the actual commands in Excel cells instead of in the\nVBA code itself can be a good way to avoid detection because when a static analysis\nmechanism goes over the VBA code, it cannot determine whether the executed content is\nmalicious or not. Since Excel cells have benign uses in VBA code as well, a security product\nmay deem them as benign, to avoid a false positive.\n\nOf course, if the cells are replaced with their content, the likelihood for detection increases.\nSo I tried to find a way to replace the “cells” function calls with the right strings without\nrunning the VBA code during the analysis.\n\nDuring my research, which focused on OOXML files, I found two files, which Excel creates\nby default, that could help achieve this goal: “sharedStrings.xml” and\n“xl/worksheets/sheetName.xml.”\n\nThe first file, “sharedStrings.xml,” contains all the strings in the Excel file. The class\nSharedStringItem (ssi) represents string items (si) and each si element contains a text (t).\nThe file contains unique strings, each representing the full content of one or more Excel\ncells.\n\n\n-----\n\nA SharedStrings.xml\n\nexample\n\nTo match the strings to the right cells, we need a cell to string mapping — this is where\n“xl/worksheets/sheetName.xml” comes into the picture. In OOXML Excel files, data\ncontaining cells will be mapped in an XML file, which will be found in the following path“xl/worksheets/sheetName.xml,” for example, the cells of “sheet1” will be mapped in\n“xl/worksheets/sheet1.xml.” Each one of these cells mapping files contains a tag called\n“SheetData,” which contains a “row” tag for each row in the sheet that contains data. Each\n\n\n-----\n\nrow entry contains c (cell) entries. Cells that contain strings have their t (type) values set\nto ‘s’ and their ‘v’ (value) tags contain an integer that is the index of the ‘si‘ object whose\nstring the cell contains in “sharedStrings.xml.” Cells that contain other types of data, such as\nintegers and floats, have it contained in their ‘v’ tags.\n\nAn example of an\n\n“xl/worksheets/sheetName.xml” file\n\n\n-----\n\n[By writing a script that extracts that data, matches cells to their appropriate values, and](https://github.com/deepinstinct/Exceller)\nreplaces “cell” function calls with these values, I could make the script less obfuscated and\nincrease the likelihood of it being flagged by a static analysis mechanism. I also addressed\nthe VBA “replace” functions issue and mimicked its functionality in my code.\n\nThe script is still in the works and currently handles only the “cells,” “transpose,” and\n“replace” functions. In addition, it only works on OOXML files and expects to get the VBA\n[code as an input (I used oledump to extract it from examined Office files). There is still much](https://github.com/DidierStevens/DidierStevensSuite/blob/master/oledump.py)\nwork to do and cases to address, such as use of variables in function calls, e.g.: “cells($i, $j)”\nand of OLE files.\n\n## Prevention, Detection, and Everything in Between\n\nObfuscated droppers are more difficult to detect — they contain intentionally broken strings\nthat evade static signatures, store malicious content in Excel cells, and use excessive\ncomments in the hope of hiding their malicious content. But difficult does not mean\nimpossible. Some patterns can still be signed statically, other behaviors can be detected\ndynamically, and if you want to take the bulldozer approach, you can just forbid all script\nexecutions (or at least most of them).\n\n## Conclusion\n\nDeep Instinct’s agent uses deep learning to prevent malicious droppers, ensuring they can’t\n[execute in your environment. The Deep Instinct Prevention Platform stops known, unknown,](https://www.deepinstinct.com/platform)\nand zero-day threats with the highest accuracy and lowest false-positive rate in the industry.\nWe stop attacks before they happen, identifying malicious files in <20ms, before execution.\n\nIf you’d like to see the platform in action for yourself, we’d be honored to show you what true\n[prevention looks like. Please request a demo.](https://www.deepinstinct.com/request-a-demo)\n\n## Indicators of Compromise (IoCs)\n\n0042404ac9cbe7c082b9c0ae130e956ab7989cfa72a3f3b0c7f2226e23a6c6cb Emotet (Excel\ncells method) Office dropper\n\n40a1e0aa0e580e2a15bbfd70ba4b89d3dd549bdc7bc075a223f12db0ddd2195d Emotet\n(Excel cells method) VBA code\n\ned7c68c3c103beaa7e5f30a3b70a52bb5428ce1498b7f64feda74342f93e16fe Emotet\n(excessive comments method) VBA code\n\n028a5447d36c7445e3b24757d5cb37bafa54c5dfa7c3393fa69dd26e278442a4 Emotet\n(excessive comments method) Office dropper\n\n\n-----\n\n9caed14e7f7d3e4706db2e74dc870abff571cce715f83ef91c563627822af6ad Dridex Office\ndropper\n\n4f5ecf2c3073edd549e8ea2b1e65d8c478f3390567cffa3c909d328a3969ddd8 Dridex VBA\ncode\n\ncb9a5f0ad26cbb7b9f510b80df97f0045d7232d31cfde3cbce095d1c88c90e89 Aggah VBA\ncode\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-24 - Blame the Messenger- 4 Types of Dropper Malware in Microsoft Office & How to Detect Them.pdf"
    ],
    "report_names": [
        "2022-05-24 - Blame the Messenger- 4 Types of Dropper Malware in Microsoft Office & How to Detect Them.pdf"
    ],
    "threat_actors": [
        {
            "id": "28851008-77b4-47eb-abcd-1bb5b3f19fc2",
            "created_at": "2023-06-20T02:02:10.254614Z",
            "updated_at": "2025-03-27T02:00:03.130853Z",
            "deleted_at": null,
            "main_name": "Hagga",
            "aliases": [
                "TH-157",
                "Aggah"
            ],
            "source_name": "MISPGALAXY:Hagga",
            "tools": [
                "Agent Tesla"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b0d34dd6-ee90-483b-bb6c-441332274160",
            "created_at": "2022-10-25T16:07:23.296754Z",
            "updated_at": "2025-03-27T02:02:09.724313Z",
            "deleted_at": null,
            "main_name": "Aggah",
            "aliases": [
                "Operation Red Deer",
                "Operation Roma225"
            ],
            "source_name": "ETDA:Aggah",
            "tools": [
                "AgenTesla",
                "Agent Tesla",
                "AgentTesla",
                "Aggah",
                "Atros2.CKPN",
                "Bladabindi",
                "Jorik",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Negasteal",
                "Origin Logger",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "Warzone",
                "Warzone RAT",
                "ZPAQ",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535999,
    "ts_updated_at": 1743041533,
    "ts_creation_date": 1654086185,
    "ts_modification_date": 1654086185,
    "files": {
        "pdf": "https://archive.orkl.eu/36b8c2b47aed727a60fb5a1a68f0144c38c5debf.pdf",
        "text": "https://archive.orkl.eu/36b8c2b47aed727a60fb5a1a68f0144c38c5debf.txt",
        "img": "https://archive.orkl.eu/36b8c2b47aed727a60fb5a1a68f0144c38c5debf.jpg"
    }
}