{
    "id": "7feacf3d-631a-40be-baca-183ac94ee75a",
    "created_at": "2023-01-12T15:04:40.239904Z",
    "updated_at": "2025-03-27T02:06:07.159855Z",
    "deleted_at": null,
    "sha1_hash": "516b082600a2a7a5bc52c3bd8e28b88738018d08",
    "title": "2021-07-18 - Digital Forensics Show S.A.R. Geelani’s Phone Was Hacked, Likely With Zero-Click Exploit",
    "authors": "",
    "file_creation_date": "2022-05-28T19:27:22Z",
    "file_modification_date": "2022-05-28T19:27:22Z",
    "file_size": 589077,
    "plain_text": "# Digital Forensics Show S.A.R. Geelani’s Phone Was Hacked, Likely With Zero-Click Exploit\n\n**[thewire.in/rights/sar-geelani-pegasus-spyware-phone-messages](https://thewire.in/rights/sar-geelani-pegasus-spyware-phone-messages)**\n\nS.A.R. Geelani. Photo: Twitter\n\nRights\n\nPotential target for surveillance was ‘Committee for the Release of Political Prisoners’, with\nthe phone numbers of scholars and activists also appearing in leaked list.\n\n[Sukanya Shantha](https://thewire.in/author/sukanya-shantha)\n\nGovernment\n\nRights\n\nTech\n\n18/Jul/2021\n\n\n-----\n\n**Mumbai: Sometime in mid-2017, former Delhi University professor Syed Abdul Rahman**\nGeelani received a barrage of SMSes on his mobile phone. “United Nations launches online\n_portal for the independence of Kashmir,” read one._\n\nAnother message, a few days later, claimed: “Another incident showing Indian army beating\n_librandu Kashmiri youth mercilessly to chant Pakistan Murdabad.”_\n\nThere were\nseveral more –\nall unique,\ntailor-made\nmessages,\nspecifically\ndesigned to\ncapture\nGeelani’s\nattention – sent\nfrom what\nlooked like an\ninternational\nnumber.\n\nGeelani’s number, selected as a target for hacking by an government client of Israel’s NSO\nGroup, was infected between 2017 and 2019, according to the results of an independent\ndigital forensics study conducted on his phone in the last month.\n\nAmnesty International’s Security Lab carried out a forensic analysis of Geelani’s phone, an\niPhone still preserved by his family, the results of which the organsation say confirm that the\nphone was compromised on and off for over two years.\n\nGeelani’s phone was infected with Pegasus spyware – the Tel Aviv-based firm’s flagship\nproduct, which allows operators of the tool to gain unauthorised access to a user’s mobile\ndevice and functions.\n\nIt’s unclear if the SMS-based attacks worked, but specific forensic analysis conducted by\nAmnesty International’s Security Lab show that the phone was compromised by Pegasus\non and off between February 2018 and January 2019, and then again from September\n2019 to October 2019. At least one of these attacks, Amnesty notes, was carried out\nthrough a zero-click iMessage exploit.\n\n[Also read: FAQ: On the Pegasus Project’s Digital Forensics](https://thewire.in/tech/faq-pegasus-project-digital-forensics)\n\n\n-----\n\nThe France-based media non-profit, Forbidden Stories, and Amnesty International s\nSecurity Lab gained access to these records, which they shared with The Wire and 15 other\nnews organisations worldwide as part of a collaborative investigation and reporting project.\n\nGeelani, who used to teach Arabic at Delhi University’s Zakir Hussain College, was arrested\nin connection with the parliament attack case but was later acquitted for “want of evidence”\nby the Delhi high court in October 2003, a decision later upheld by the Supreme Court in\nAugust 2005.\n\nGeelani, who had garnered massive support at the time of his incarceration, dedicated his\nlife to working for those jailed, especially for their political views. He, along with his friend\nRona Wilson – named as a prime accused in the 2018 Elgar Parishad case – founded the\nCommittee for Release of Political Prisoners (CRPP). Associated with several causes\nrelating to human rights violations across the country, Geelani later became a core part of\nthe 17-member Committee for Defence and Release of G.N. Saibaba.\n\nSaibaba, a Delhi University professor, was sentenced to life under several sections of the\nUnlawful Activities (Prevention) Act (UAPA) for his alleged links with a banned Maoist\norganisation. With over 90% physical disability, Saibaba has faced severe hardships in jail\nbut been denied bail multiple times both by the lower and higher judiciary.\n\nAlso read: Old RTI Response Enough To Deny Govt-Pegasus Link, Media Didn’t Do Due\nDiligence: MeitY\n\nGeelani’s son Sayed Atif Geelani, a Delhi-based lawyer, who had preserved the phone\neven after his father’s death in October 2019, told The Wire that the forensic report has only\nconfirmed the fears they had lived under for decades. “We have always feared that the\nfamily is being tracked. For months after his (Geelani’s) death, his phone would notify us\nabout attempts made to hack into his email and phone. This forensic result has only\nconfirmed our suspicion,” Atif said.\n\nScreenshots of malware-laden messages sent to S.A.R. Geelani’s iPhone. He was one of the initial\n\nvictims of the Pegasus attack.\n\n\n-----\n\nBesides Geelani, the leaked data has also thrown up the numbers of nine more members\nand close supporters of the Saibaba Defence Committee.\n\nWilson and his co-accused in the Elgar Parishad case and an associate professor from\nDelhi University, Hany Babu, were also on the list. Hany Babu was also a core team\nmember of both CRPP and the Saibaba Defence Committee; he mainly handled the press\nreleases and his email ID and phone numbers were usually printed on the press\nstatements.\n\nOther members or close supporters of the Saibaba Defence Committee and CRPP to be\nselected as potential targets were retired professor G. Haragopal, chairman of the Defence\nCommittee, Saroj Giri and Rakesh Ranjan, both assistant professors in Delhi University\nwho would regularly attend solidarity meetings, Saibaba’s wife Vasantha Kumari and two\nother academics who did not wish to be named from Delhi.\n\nTo be clear, it is not possible to know whether the phones of Babu, Wilson and other\nmembers of the committee saw attempted targeting or were compromised by an infection\nwithout digital forensic analysis.\n\n_The Wire had arranged for a forensic analysis of Haragopal’s Android phone devices._\nHowever, the results were inconclusive because unlike iPhones, Androids do not log the\nkind of information needed for Amnesty’s technical investigation.\n\nWhile the Saibaba Defence Committee is a separate entity, many associated with it have\nbeen questioned by the National Investigating Agency in the Elgar Parishad case too. Atif\ntold The Wire that the family had feared Geelani’s arrest in the Elgar Parishad case. “If my\nfather hadn’t died in October, we are pretty certain that they would have found a way to\nimplicate him too in the case,” claimed Atif.\n\n[Also read: Read: NSO Group’s Response to the Pegasus Project and Our Take](https://thewire.in/tech/pegasus-project-nso-response)\n\nVasantha said the period of surveillance overlaps with many significant meetings and\nprotests organised across India demanding Saibaba’s release. “Soon after Saibaba’s\nconviction, the Defence Committee had organised several meetings across different cities.\nThe activities were all in the public domain, with press statements published regularly on\ndifferent social media platforms,” she said.\n\nVasantha was not surprised that she was also one of the potential targets of Pegasus. “I\nhave been facing threats and intimidation ever since Saibaba was falsely charged in 2014\nand I began participating in public meetings and speaking against his false arrest and later\nhis conviction. This is an extension of the targeted harassment I have been enduring over\nthe past decade,” she added.\n\n\n-----\n\nHany Babu s wife Jenny Rowena, also an associate professor at DU s Miranda College,\nfeels that her husband came to be targeted because of his identity. “He is a Muslim man, an\nOBC (Other Backward Classes) and spoke against the state machinery for criminalising\npeople from similar marginalised identities.”\n\nAn Appeal: [Support Investigative Journalism That Brings You The Truth. Support The Wire.](https://support.thewire.in/)\n\nRanjan and Giri told to The Wire that although they weren’t office-bearers of the committee,\nthey would participate in meetings regularly. “Saibaba’s arrest and conviction was widely\nopposed. Like most others, I too would participate in those meetings regularly,” Ranjan\nconfirmed.\n\nGiri said his long association with both Saibaba and Wilson may have made him a target. “I\nhave been an integral to the committee which has been demanding his release. In the last\nfew years, I have tried to mobilise support for the incarcerated DU professor G.N. Saibaba,”\nhe told The Wire. When Saibaba’s house was raided twice before his arrest his 2014, Giri\nwas by his side, defending and mobilising people against the arrest. Later when Saibaba\nwas out on bail, Giri says, he would take him to the hospital many times. “His condition was\ncritical then. I would travel with him to hospitals regularly.”\n\n_[Read The Wire’s coverage as part of the Pegasus Project here.](https://thewire.in/tag/pegasus-project)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-18 - Digital Forensics Show S.A.R. Geelani’s Phone Was Hacked, Likely With Zero-Click Exploit.pdf"
    ],
    "report_names": [
        "2021-07-18 - Digital Forensics Show S.A.R. Geelani’s Phone Was Hacked, Likely With Zero-Click Exploit.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535880,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653766042,
    "ts_modification_date": 1653766042,
    "files": {
        "pdf": "https://archive.orkl.eu/516b082600a2a7a5bc52c3bd8e28b88738018d08.pdf",
        "text": "https://archive.orkl.eu/516b082600a2a7a5bc52c3bd8e28b88738018d08.txt",
        "img": "https://archive.orkl.eu/516b082600a2a7a5bc52c3bd8e28b88738018d08.jpg"
    }
}