{
    "id": "800a212e-207e-4bd0-aa6e-ba3b26302331",
    "created_at": "2023-01-12T14:59:41.50035Z",
    "updated_at": "2025-03-27T02:17:05.611396Z",
    "deleted_at": null,
    "sha1_hash": "9c8aa38d416f0bc237c60c845b52e76a0ded6f5a",
    "title": "2022-02-25 - Russia or Ukraine- Hacking groups take sides",
    "authors": "",
    "file_creation_date": "2022-05-29T01:08:09Z",
    "file_modification_date": "2022-05-29T01:08:09Z",
    "file_size": 214325,
    "plain_text": "# Russia or Ukraine: Hacking groups take sides\n\n**[therecord.media/russia-or-ukraine-hacking-groups-take-sides/](https://therecord.media/russia-or-ukraine-hacking-groups-take-sides/?msclkid=235244a7ba6611ec92f21c9bd3b8ee49)**\n\nImage: Luis Villasmil\n_Updated March 3 at 7:35pm._\n\n\nFebruary 25, 2022\n\n\nRussia’s invasion of Ukraine has taken place both on and offline, blending physical\ndevastation with escalating digital warfare. Ransomware gangs and other hacking groups\nhave taken to social media to announce where their allegiances lie.\n\nThe Record will be tracking who these groups align with, as well as any attacks they launch\nrelated to the conflict.\n\nMany of the pronouncements from these groups include threats against critical government\ninfrastructure. Some collectives are state-sponsored while others are decentralized — but all\nare able to take down computer systems and breach organizations.\n\n“It is now an inevitable part of any military action that so-called ‘Cyber Patriots’ will engage\nthe perceived enemy either of their own free will or at the direction of their government.\nSome of these activities, such as Anonymous launching DDoS attacks, will be nothing more\nthan minor nuisances but others could have real consequences,” said Allan Liska, a\nransomware expert at Recorded Future. “Ransomware groups, for example, have more\ntargets than they can go after right now and may decide to focus on attacking the enemies of\ntheir country to create real disruption. And the more skilled groups can have an even greater\nimpact.”\n\n\n-----\n\nLiska warned that Sandworm and UNC1151 are the most concerning in terms of their\ncapabilities and activity, and should be closely monitored.\n\n## Siding with Ukraine\n\n**Anonymous – United with Ukraine and “officially in a cyber war against the Russian**\n[government.” The group later tweeted that they targeted Russian-state controlled](https://twitter.com/YourAnonOne/status/1496965766435926039)\ninternational television network RT, and “has taken down the website of the #Russian\npropaganda station RT News.” Anonymous is said to be a decentralized hacktivist group that\ntargets different government institutions and government agencies, corporations, and the\nChurch of Scientology. GNG, a hacking group affiliated with Anonymous, has gained access\n[to SberBANK database and leaked hundreds of data files. Sberbank, Russia’s biggest](https://twitter.com/nenan_djabhata/status/1498022696982138884/photo/1)\n[lender, is now facing failure. NB65 is another affiliate of Anonymous who Tweeted their](https://twitter.com/xxNB65/status/1497869041507213314)\n[support for Ukraine: “#Anonymous is not alone. NB65 has officially declared cyber war on](https://twitter.com/hashtag/Anonymous?src=hashtag_click)\nRussia as well. You want to invade Ukraine? Good. Face resistance from the entire world.\n[#UkraineWar All of us are watching. All of us are fighting.”](https://twitter.com/hashtag/UkraineWar?src=hashtag_click)\n\nAs of February 28th, another group under the Anonymous umbrella named DeepNetAnon\nhas joined in the operations against Russia by attacking and intercepting Russian radio\nreceivers. “The Russians have now taken offline the second web server hosting a SoftwareDefined Radio receiver (used to interact with Radio Frequencies). Too bad there’s many\n[more sites we can use. (;” the group tweeted. The collective also announced that they have](https://twitter.com/DeepNetAnon/status/1498603818514272257)\nsuccessfully hacked the Ministry of Economic Development of Russia. 1LevelCrew also\n[showed their support for Ukraine and tweeted, “TANGO DOWN – http://pfr.gov.ru – Pension](https://twitter.com/1levelcrew/status/1498054945987203073)\n[Fund of Russian offline. | #OpRussia #Anonymous.” Another collective known as HydraUG](https://twitter.com/hashtag/OpRussia?src=hashtag_click)\n[made a clear statement via Twitter: “Im not here to deface/destroy your website, im here to](https://twitter.com/Hydra_UG/status/1498659706365227014/photo/1)\nliberate Ukraine.”\n\nThe Anonymous collective is officially in cyber war against the Russian government.\n[#Anonymous](https://twitter.com/hashtag/Anonymous?src=hash&ref_src=twsrc%5Etfw) [#Ukraine](https://twitter.com/hashtag/Ukraine?src=hash&ref_src=twsrc%5Etfw)\n\n[— Anonymous (@YourAnonOne) February 24, 2022](https://twitter.com/YourAnonOne/status/1496965766435926039?ref_src=twsrc%5Etfw)\n\n[As of Wednesday, another affiliate named N3UR0515 took to Twitter to share support and](https://twitter.com/Ur0515N3)\ncall on YouTube to take down Russian propaganda. The group has administered DDoS\nattacks and taken down ‘ria.ru’ — the Official Russian Information Website. Joining the\n[Anonymous collective, v0g3ISec announced that they had hacked into the Russian Space](https://twitter.com/v0g3lSec)\nResearch Institute database and leaked files from Roscosmos, though the hack has not\nbeen confirmed.\n\n**Ghostsec –** [Announced their support for Ukraine today: “In support of the people in Ukraine](https://twitter.com/Cyberknow20/status/1497271361705693185)\nWE STAND BY YOU!” Also known as Ghost Security, the group considers itself a ‘vigilante’\ngroup and was initially formed to target ISIS websites that preach Islamic extremism.\nGhostsec is also commonly referred to as an offshoot of Anonymous.\n\n\n-----\n\n**IT army of Ukraine – After Ukraine s deputy prime minister and minister for digital**\ntransformation Mykhailo Fedorov enacted the volunteer application, over 175,000 people\nhave subscribed. Many have been tasked with distributed denial-of-service attacks against\nRussian websites including government websites, banks, and energy companies. On\nFebruary 27, officials also told volunteers to target websites registered in Belarus. Fedorov\n[released the target list.](https://twitter.com/BrettCallow/status/1497650024922054659)\n\n**AgainstTheWest (ATW) – Standing with Ukraine, the group’s** [Twitter account says, “We’re](https://twitter.com/AgainstTheWest_)\nback in action. Standing against Russia. Active until Russia stands down.” The group is\nactively working to breach Russian infrastructure including Russian railways and Russian\nGovernment contractor “promen48[.]ru.” As of March 1, the group has issued a new\nstatement for further clarification, “we won’t be collaborating with anonymous.” Furthermore,\n“ATW will be splitting into two groups. One for Russia related breaches, one for Chinese\nrelated,” the group states. ATW accused Anonymous of taking the credit for the work done by\nATW: “Anonymous has had a lot of media publicity over the years for hacking, and to see\nthis. It didn’t sit right.” ATW seems to have been suspended from Twitter as of March 3.\n\n**[SHDWsec – Joins the movement to support Ukraine. The group is working in collaboration](https://twitter.com/shdwpnda/status/1498297405351112704)**\nwith ATW and Anonymous in operations against Russia, “SHDWSec joined forces with\n[@AgainstTheWest_ First stage is now on the roll. Expecting us is too late. Brace for impact.](https://twitter.com/AgainstTheWest_)\nMore to come.”\n\n**Belarusian Cyber Partisans – Supporting Ukraine. The activist hacking group successfully**\naccessed the computers that control the Belarusian train system, stopping trains in Minsk\nand Orsha, as well as in the town of Osipovichi. The operation was intended to “slow down\nthe transfer” of Belarus-based Russian troops into Ukraine. Over the past year, the\nhacktivists have [worked against the Belarus government and were able to leak data of secret](https://www.bloomberg.com/news/articles/2022-02-27/belarus-hackers-allegedly-disrupted-trains-to-thwart-russia)\npolice archives, lists of alleged police informants, personal information about top government\nofficials and spies, and more.\n\n**KelvinSecurity – Announced they stand with Ukraine: “I want to release this to support the**\ndigital war against RUSSIA. I have a list of weapons development documents that I took from\na Russian ballistic institute and I also have internal videos from RT, and the Russian nuclear\ninstitute,” the [statement says. The group has been tweeting evidence of their engagement in](https://twitter.com/Cyberknow20/status/1497815359445168132)\ncyber operations.\n\n**[Raidforums Admin – Stands with Ukraine. The group announced: “Raidforums2 is in](https://twitter.com/Cyberknow20/status/1498029548914757633)**\nsupport of Ukraine. Members are actively DDOS Russian websites and attacking Russian\ninfrastructure. We also have reason to believe the Chinese are hacking Ukrainian networks.”\nPreviously labeled as Raidforum, the collective is now operating as Raidforum2 after having\noutage and access issues. It is unclear what went wrong with the original Raidforum.\n\n\n-----\n\n**ContiLeaks – Backing Ukraine. The group has exposed infamous ransomware group Conti**\nfrom the inside out. Since February 27, following Conti’s statement of Russian support, an\n[account named ContiLeaks leaked hundreds of files containing internal Conti](https://twitter.com/ContiLeaks)\ncommunications. The informant is believed to be Ukrainian and has continued to leak more\nand more files as days go by. A more recent [data set shows communication depicting the](https://twitter.com/ValeryMarchive/status/1499107984777035779/photo/1)\nchaos within Conti. Actor 1 says, “Hi, all VM farms are cleared and deleted, servers are\ndisabled.” Actor 2 responds, “I deleted all the farms with the shredder and shut down the\nservers.”\n\n**Secjuice – Stands with Ukraine. This collective is taking a less volatile approach by using**\nopen-source intelligence (OSINT) and psychological operations (PsyOps). At the request of\nIT army, they are creating a website for missing persons within Ukraine as a resource for\nfamilies. In a [tweet on March 2, the group asked for assistance in ensuring the website is](https://twitter.com/Secjuice/status/1499046977937494016)\nhosted on a safe server and not vulnerable to attacks.\n\n## Siding with Russia\n\n**Conti – In full support of Russia — “If anybody will decide to organize a cyberattack or any**\nwar activities against Russia, we are going to use our all possible resources to strike back at\nthe critical infrastructures of an enemy,” Emsisoft ransomware expert Brett Callow shared in\na [tweet. The Conti ransomware gang is highly sophisticated and known for being the first](https://twitter.com/BrettCallow/status/1497249143663652865)\ngroup to weaponize the Log4Shell vulnerability and operate a fully-developed attack chain.\nDays after Conti ransomware group announced their support for Russia, an insider who is\nbelieved to be Ukrainian, leaked 400 files of internal communications between members of\nthe group. The leaked messages go back to January 2021. The data was shared with the\n[malware research group VX-Underground. The hacking collective leaking Conti information](https://twitter.com/vxunderground/status/1498060366445613056?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1498060366445613056%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Ftechcrunch.com%2F2022%2F02%2F28%2Fconti-ransomware-chats-leaked%2F)\nis now being referred to as ContiLeaks.\n\n[The Conti #ransomware operation sides with Russia and threatens attacks on critical](https://twitter.com/hashtag/ransomware?src=hash&ref_src=twsrc%5Etfw)\ninfrastructure. [pic.twitter.com/L8E7lEW1MJ](https://t.co/L8E7lEW1MJ)\n\n[— Brett Callow (@BrettCallow) February 25, 2022](https://twitter.com/BrettCallow/status/1497249143663652865?ref_src=twsrc%5Etfw)\n\n**Minsk-based group ‘UNC1151’ – Support lies with Russia. The hacking group is commonly**\nregarded as being state-sponsored by Belarus and has already been working to compromise\nthe email accounts of Ukrainian military personnel. The group’s “‘members are officers of the\n[Ministry of Defence of the Republic of Belarus,’ Ukrainian officials added,” as reported by](https://therecord.media/ukraine-says-belarusian-hackers-are-targeting-its-military-personnel/)\n[The Record. Facebook (or Meta) has taken down accounts used by UNC1151 which](https://www.bleepingcomputer.com/news/security/meta-ukrainian-officials-military-targeted-by-ghostwriter-hackers/?utm_content=199331083&utm_medium=social&utm_source=twitter&hss_channel=tw-983606922338295808)\ntargeted Ukrainian officials through Facebook posts that displayed videos that depicted\nUkrainian soldiers as weak. The platform also blocked various phishing domains that were\nbeing used to jeopardize Ukrainian accounts.\n\n\n-----\n\n**Zatoichi – Supports Russia through the spread of disinformation via the group s Twitter**\n[account. Amongst many false claims, the account stated, “Killnet has already put down the](https://twitter.com/ZATOICHIJR/status/1498671579798065157)\nAnonymous website, which announced the start of a cyber war with the Russian\ngovernment, the Right Sector website, and the website of the President of Ukraine.”\n\n**[Killnet — Stands with Russia. The group published a video addressing the people of Russia](https://twitter.com/Cyberknow20/status/1499349570890842113)**\nencouraging them to never doubt their country. The video features a hooded figure with a\ndistorted voice claiming to have taken down the website belonging to Anonymous. Little is\nknown about the group and it is unclear as to whether the group existed previously.\n\n**XakNet — Backing Russia. The collective called itself a “team of Russian patriots” in a**\nrecent [statement and criticized Anonymous, “We do not hide behind the mask of abstract](https://twitter.com/Cyberknow20/status/1498995815301345281/photo/1)\n‘Anonymous’.” The announcement concludes with a final threat, “For every hack/ddos in our\ncountry, similar incidents will occur in Ukraine.”\n\n**[Stormous Ransomware – The collective stands with Russia after they publicly announced,](https://twitter.com/darktracer_int/status/1498644747316981762/photo/1)**\n“The STORMOUS team has officially announced its support for the Russian governments.\nAnd if any party in different parts of the world decides to organize a cyber-attack or cyberattacks against Russia, we will be in the right direction and will make all our efforts to\nabandon the supplication of the West, especially the infrastructure. Perhaps the hacking\noperation that our team carried out for the government of Ukraine and a Ukrainian airline was\njust a simple operation but what is coming will be bigger!!” The group has been around since\nthe beginning of 2022 and is believed to be financially motivated. Their messages are in\n[Arabic. More recently on March 1, the group issued a warning against “western unions” and](https://twitter.com/Cyberknow20/status/1498890450346070018/photo/1)\nmore specifically companies in the U.S., after being attacked by unspecified U.S. companies\ncausing their site to be shut down.\n\n**Digital Cobra Gang (DCG) – Supports Russia. Another group has stated their allegiance**\n[with Russia in a public statement that reads, “DIGITAL COBRA GANG DCG has officially](https://twitter.com/a_lead_1/status/1498429375733067778)\ndeclared cyber war on hackers who attacking Russia as well and to protect justice. Do you\nwant to invade Russia? Taste the good from the whole WORLD #Ukrainewar #Russia We\nfight for the Good, 10m deaths and 50 wars Russia? NO!” The group entered the cyber war\n[via Twitter on February 27th. The most recent update declares their use of a ‘secret weapon.’](https://twitter.com/a_lead_1/status/1498721202319286276)\n“We set many traps so we have wired 27.918 computers from the guys who attacking Russia\nand we are ready to drop our secret weapon.”\n\n**[Freecivilian – United with Russia. The group is reportedly advertising stolen data from 50](https://orpheus-cyber.com/blog-suspected-state-front-freecivilian-publishes-ukrainian-government-data-after-ddos-and-wiper-attacks/)**\ndifferent Ukrainian government websites from a February 23 attack. The attacks on the\nwebsites included displayed defacement messages that were almost identical to messages\nfrom a January 15 attack linked to UNC1151. Although claiming to be an independent\ncybercriminal, many suspect the group is linked to nation-state actors.\n\n\n-----\n\n**SandWorm – Backed by Russia. The group, known for its recent malware called Cyclops**\nBlinks, is comprised of Russian state-sponsored hackers. The malware was first deployed in\n[June 2019 and “has been primarily detected targeting WatchGuard Firebox firewalls, but they](https://www.watchguard.com/wgrd-products/firewall-appliances)\ndon’t exclude having the ability to infect other types of networking equipment too,” Catalin\n[Cimpanu reported for The Record.](https://therecord.media/us-and-uk-expose-new-russian-malware-targeting-network-devices/)\n\n**[The Red Bandits – Stands with Russia. On February 22, the group tweeted, “We’ve](https://twitter.com/RedBanditsRU/status/1495986961760370689)**\nhijacked the @UkrainePolice Dashcams and have been watching them. If Ukraine does not\ndo what #Russia wants we will escalate our attacks against Ukraine to involve panic scares.\nWe will also consider distributing #ransomeware in #UkraineRussiaCrisis #RussiaUcraina\n#Ukraine.” The collective self-identifies as a cybercrime group from Russia, however, it is\nwidely speculated to in fact be Russian Intelligence.\n\nSince their original statement, the group seems to be wavering in its threats against Ukraine.\nThe group tweeted on March 1: “We want everyone from #Ukraine to read this: We stand\nstrongly with citizens of #Ukraine and that’s why we have not attacked anything other than\ntheir government. We also have not given a percentage of intel we have against Ukraine,”\nthe [tweet continues in a long thread. “We do not respect Putin as a #leader of #Russia but](https://twitter.com/RedBanditsRU/status/1498697787608813568)\nwe respect him as a citizen of #Russia as we support every citizen. We do not agree with his\nunpeaceful actions against #Ukraine as an operation.” The statement continues in a later\npost, “Please understand, we’re not going to stop defending our country. We will not\nsurrender because of reasons but we will not attack first, we’ll defend attack meaning you\n[guys hack Russia a few times we hack back. Simple, please understand we see #Ukraine](https://twitter.com/hashtag/Ukraine?src=hashtag_click)\ncitizens as family.”\n\nThe group’s messages have become increasingly ambiguous and ominous, and they\n[tweeted — hours after claiming to be family with Ukrainians — a job application for those](https://twitter.com/RedBanditsRU/status/1498761699553431552)\nexperienced with breaching networks. On Wednesday, March 2 they [tweeted, “We seen a](https://twitter.com/RedBanditsRU/status/1499081110734741509)\nchance to make millions, we’re going to take that chance.”\n\n[We've hijacked the @UkrainePolice Dashcams and have been watching them. If](https://twitter.com/UkrainePolice?ref_src=twsrc%5Etfw)\n[Ukraine does not do what #Russia wants we will escalate our attacks against Ukraine](https://twitter.com/hashtag/Russia?src=hash&ref_src=twsrc%5Etfw)\n[to involve panic scares. We will also consider distributing #ransomeware in](https://twitter.com/hashtag/ransomeware?src=hash&ref_src=twsrc%5Etfw)\n[#UkraineRussiaCrisis](https://twitter.com/hashtag/UkraineRussiaCrisis?src=hash&ref_src=twsrc%5Etfw) [#RussiaUcraina](https://twitter.com/hashtag/RussiaUcraina?src=hash&ref_src=twsrc%5Etfw) [#Ukraine](https://twitter.com/hashtag/Ukraine?src=hash&ref_src=twsrc%5Etfw) [pic.twitter.com/zEgtZxzDqP](https://t.co/zEgtZxzDqP)\n\n[— TheRedBanditsRU (@RedBanditsRU) February 22, 2022](https://twitter.com/RedBanditsRU/status/1495986961760370689?ref_src=twsrc%5Etfw)\n\n**[Coomingproject – Sides with Russia. The international hacker group announced today in a](https://twitter.com/BrettCallow/status/1497281494758268930)**\nstatement, “Hello everyone this is a message we will help the Russian government if cyber\nattacks and conduct against Russia.” The gang is linked to the 2021 data breach and leak of\nthe South African National Space Agency.\n\n\n-----\n\nThe domino effect of hacker announcements prompted Ukraine s Defense Ministry to send a\n[message to the Ukrainian underground hacker community. The message was a call-to-action](https://www.reuters.com/world/exclusive-ukraine-calls-hacker-underground-defend-against-russia-2022-02-24/)\nencouraging Ukrainian hackers to assemble in a mission to protect the nation’s critical\ninfrastructure from cyberattacks and act offensively against Russia in cyber espionage\noperations. Although requested by the Defense Ministry, the message was published by\nYegor Aushev, the founder of Cyber Unit Technologies, who provided an application for those\nin the hacker community to apply.\n\nEmma Vail is an editorial intern for The Record. She is currently studying anthropology and\nwomen, gender, and sexuality at Northeastern University. After creating her own blog in\n2018, she decided to pursue journalism and further her experience by joining the team.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-25 - Russia or Ukraine- Hacking groups take sides.pdf"
    ],
    "report_names": [
        "2022-02-25 - Russia or Ukraine- Hacking groups take sides.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f547e816-ea17-442e-915d-c5c76a30669b",
            "created_at": "2022-10-25T16:07:23.891717Z",
            "updated_at": "2025-03-27T02:02:10.016882Z",
            "deleted_at": null,
            "main_name": "NB65",
            "aliases": [],
            "source_name": "ETDA:NB65",
            "tools": [
                "NB65"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0bce7575-ba34-4742-afb7-a4d3ade12dbe",
            "created_at": "2023-11-14T02:00:07.091122Z",
            "updated_at": "2025-03-27T02:00:03.221412Z",
            "deleted_at": null,
            "main_name": "XakNet",
            "aliases": [
                "UAC-0100",
                "UAC-0106"
            ],
            "source_name": "MISPGALAXY:XakNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4f472ea8-b147-486d-8533-88f8036343a6",
            "created_at": "2024-01-23T13:22:35.081084Z",
            "updated_at": "2025-03-27T02:00:03.285792Z",
            "deleted_at": null,
            "main_name": "Cyber Partisans",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Partisans",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8754f54b-7154-4996-b065-94f04f846022",
            "created_at": "2023-11-07T02:00:07.095161Z",
            "updated_at": "2025-03-27T02:00:03.171719Z",
            "deleted_at": null,
            "main_name": "NB65",
            "aliases": [
                "Network Battalion 65"
            ],
            "source_name": "MISPGALAXY:NB65",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "93b7776d-9b37-496d-94a5-30bc36fd8800",
            "created_at": "2023-11-07T02:00:07.10019Z",
            "updated_at": "2025-03-27T02:00:03.17401Z",
            "deleted_at": null,
            "main_name": "GhostSec",
            "aliases": [
                "Ghost Security"
            ],
            "source_name": "MISPGALAXY:GhostSec",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63f532e6-4b4a-4f17-bbff-8517f0dd1868",
            "created_at": "2024-01-09T02:00:04.192588Z",
            "updated_at": "2025-03-27T02:00:03.277255Z",
            "deleted_at": null,
            "main_name": "KelvinSecurity",
            "aliases": [],
            "source_name": "MISPGALAXY:KelvinSecurity",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "05b0c294-6e79-4d58-8291-73d2c1c7d9bd",
            "created_at": "2024-06-25T02:00:05.048321Z",
            "updated_at": "2025-03-27T02:00:03.392046Z",
            "deleted_at": null,
            "main_name": "BlueHornet",
            "aliases": [
                "APT49",
                "AgainstTheWest"
            ],
            "source_name": "MISPGALAXY:BlueHornet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535581,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653786489,
    "ts_modification_date": 1653786489,
    "files": {
        "pdf": "https://archive.orkl.eu/9c8aa38d416f0bc237c60c845b52e76a0ded6f5a.pdf",
        "text": "https://archive.orkl.eu/9c8aa38d416f0bc237c60c845b52e76a0ded6f5a.txt",
        "img": "https://archive.orkl.eu/9c8aa38d416f0bc237c60c845b52e76a0ded6f5a.jpg"
    }
}