{
    "id": "802dacd1-187c-44a5-b554-f7f069fe752a",
    "created_at": "2022-10-25T16:48:10.99549Z",
    "updated_at": "2025-03-27T02:15:35.48282Z",
    "deleted_at": null,
    "sha1_hash": "5352306527c9f9cbd00390846f430f159d9e6797",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-11-12T14:39:40Z",
    "file_modification_date": "2020-11-12T14:39:45Z",
    "file_size": 1605440,
    "plain_text": "## THREAT PROFILE\n# JUPYTER INFOSTEALER\n\n\n-----\n\n#### Introduction...................................................................................................3\n\n Inno Setup Attack Phase..............................................................................4\n\n C2 Jupyter Client............................................................................................6\n\n PowerShell Intermediate Loader..............................................................13\n\n Jupyter Infostealer......................................................................................13\n\n Conclusion...................................................................................................16\n\n IOCS..............................................................................................................16\n\n About MORPHISEC......................................................................................18\n\n\n-----\n\n###### INTRODUCTION\n\n An Infostealer is a trojan that is designed to 0 detections in VirusTotal over the last 6 gather and exfiltrate private and sensitive months, making it exceptional at bypassing information from a target system. There is most endpoint security scanning controls. a large variety of info stealers active in the\n Upon execution of the installer, a .NET\n wild, some are independent and some act\n C2 client (Jupyter Loader) is injected into\n as a modular part of a larger task such as a\n a memory. This client has a well defined\n Banking Trojan (Trickbot) or a RAT.\n communication protocol, versioning matrix,\n Infostealers are usually lightweight and has recently included persistence and stealthy payloads that do not have modules. persistence or propagation (get-in and\n The client then downloads the next stage,\n get-out) capabilities. This type of trojan is\n a PowerShell command that executes the\n particularly difficult to detect as it leaves an\n in-memory Jupyter .NET module. Both of\n extremely small footprint.\n the .Net components have similar code\n During what began as a routine incident structures, obfuscation, and unique UID response process, Morphisec has identified implementation. These commonalities (and prevented) a new .NET infostealer indicate the development of an end to end variant called Jupyter. Morphisec framework for implementing the Jupyter discovered this variant as part of assisting a\n Infostealer.\n higher education customer in the U.S. with their incident response. Morphisec has monitored a steady stream\n of forensic data to trace multiple versions\n Jupyter is an infostealer that primarily\n of Jupyter starting in May 2020. While\n targets Chromium, Firefox, and Chrome browser data. However, its attack chain, many of the C2s are no longer active, they delivery, and loader demonstrate additional consistently mapped to Russia when we capabilities for full backdoor functionality. were able to identify them. These include:\n This is not the only piece of evidence that\n\n • a C2 client\n this attack is likely Russian in origin. First,\n\n • download and execute malware\n there is the noticeable Russian to English\n\n • execution of PowerShell scripts and\n misspelling of the planet name. Additionally,\n commands\n Morphisec researchers ran a reverse Google\n\n • hollowing shellcode into legitimate\n Image search of the C2 admin panel image\n windows configuration applications.\n and were not surprised to find the exact\n Jupyter’s attack chain typically starts with a image on Russian-language forums. downloaded zip file that contains an installer, an executable that usually impersonates This report details the changes and legitimate software such as Docx2Rtf. evolution of the Jupyter infostealer and its Some of these installers have maintained backdoor component.\n\n\n-----\n\n###### INNO SETUP ATTACK PHASE\n\n Inno Setup, a free software-script driven installation system with many legitimate uses, is leveraged as the first stage of the attack. The Inno Setup executable usually comes as a zipped file and has a low detection rate in VirusTotal.\n\n**Figure 1: Inno Setup’s detection in Virus Total.**\n\nIn order to deceive the victim, and convince them to open the executable, it uses Microsoft Word icons and\nnames, such as:\n\n- The-Electoral-Process-Worksheet-Key.exe\n\n- Mathematical-Concepts-Precalculus-With-Applications-Solutions.exe\n\n- Excel-Pay-Increase-Spreadsheet-Turotial-Bennett.exe\n\n- Sample-Letter-For-Emergency-Travel-Document\n\n\n**Figure 2: Detection antivirus results.**\n\n\n-----\n\nWhen running, the installer executes legitimate tools such as Docx2Rtf, Magix Photo Manager (view and edit\nphotos), etc. In the background it drops two files to a temporary directory. One file is a PowerShell script that is\nexecuted by the malicious installer. This PowerShell script reads the second file, and then decrypts and runs it\nas the next stage.\n\n**Figure 3: The PowerShell script.**\n\n\n### When running, the installer executes legitimate tools such as Docx2Rtf, Magix Photo Manager (view and edit photos), etc.\n\n\nThe decoded PowerShell drops two files in a random\ndirectory in the Application Data Folder. Once again, one file\nis responsible for decrypting the other. This time it’s a CMD\nbatch script that executes PowerShell to decrypt the in-memory\nmanaged .NET assembly and run it.\n\n[Additionally, it uses the PoshC2 persistence method in newer](https://github.com/nettitude/PoshC2/blob/master/resources/modules/Stage2-Core.ps1)\nversions of the installer. It creates a LNK file and places it\ndirectly in the Windows startup folder for persistence.\n\n\n**Figure 4: PoshC2 persistency**\n\n\n-----\n\n###### C2 JUPYTER CLIENT\n\n INTRODUCTION\n\nAs mentioned previously, Jupyter’s client is a highly maintained component. Progressively upgraded versions\nhave been leveraged over the last five to six months, and Morphisec researchers have identified more than nine\nversion upgrades in a single month. The following analysis will cover the different updates that were introduced\nto the protocol, unique ID computation, and the various capabilities that have been added and removed.\n\n**VERSIONS:**\n\n**_DN-DN/1.2:_**\n\n**Creation date: 2020-05-11**\n\n**SHA-1: 26AF2E85B0A50BF2352D46350744D4997448E51D**\n\nThis was the first version seen in the wild. It holds the C2 address and its version as variables and collects\ninformation from the infected machine such as: Computer name, OS version, architecture, permissions, UID.\n\n**Figure 5: Version DN-DN/1.2 of Jupyter.**\n\nThe Unique Identifier (HWID) is generated based on the user name, computer name, and physical media\nserial number.\n\n\n-----\n\n**Figure 6: How the Unique ID is generated.**\n\nThe information is converted to bytes and sent as part of the GET request. The version of the loader that is used\nis based on information about the victim. The options for the next stage are:\n\n- Drop and Execute a PowerShell script\n\n- Drop and Execute application\n\n- Drop and Inject a shellcode into a Microsoft legitimate process, “msinfo32.exe,” using a standard Process\nHollowing technique.\n\n**Figure 7: Options for the next stage.**\n\nThe payload (PowerShell, executable, or shellcode) retrieved from the C2 is decoded using XOR with a decimal\nnumber.\n\n\n-----\n\n**Figure 8: The payload is decoded.**\n\n**_DN-DN/1.7:_**\n\n**Creation date: 2020-06-21**\n\n**SHA-1: ea2b5b7bcc0efde95ef1daf91dcb1aa55e3458a9**\n\nThis version added the Workgroup to the collected information.\n\n**Figure 9: Workgroup is added to the information being collected.**\n\n\n-----\n\nIt also added a FingerPrint class that generates the UID (HWID) based on the following properties.\n\n**Figure 10: The FingerPrint class is added.**\n\n**_DN-DN/FB1:_**\n\n**Creation date: 2020-09-24**\n\n**SHA-1: f76e293d627c55eca18ce96e587fb8c6e37d8206**\n\nThis version removed the FingerPrint class and added LdrConfig class that holds the loader configuration (C2\naddress and loader version).\n\n**Figure 11: The LdrConfig class is added.**\n\nThe UID (HWID) is generated based on 32 random bytes and saved to the disk as solarmarker.dat.\n\n\n-----\n\n**Figure 12: The UID is saved as solarmarker.dat.**\n\n**_DR/1.0:_**\n\n**Creation date: 2020-10-05**\n\n**SHA-1: 8133304181d209cb302fbcdbf3965b0b5c7fa20c**\n\nIn this version, the Process Hollowing option was removed for a new option – a get PowerShell command to\nrun in-memory. It also changed the version naming convention from DN-DN to DR and added a XOR key to the\nconfiguration class.\n\n**Figure 13: Process Hollowing is replaced by “get PowerShell.”**\n\n\n-----\n\nThere are also the additional JSON classes in order to parse the new communication protocol. All of the\nrequests to and from the C2 are base64 decoded/encoded and XORed with the pre-configured key. This new\nprotocol is added to the victim’s collected information as protocol_version:1 with a new key called action that\nindicates to the C2 which stage it’s in.\n\n**Figure 14: The encoding of the new protocol.**\n\nThe above JSON is sent with the action “ping,” and as a response it gets the following JSON:\n\n{“status”: <status>, “type”: <attack_type>, “task_id”: <task_id>}.\n\n- “status”: file, command or idle.\n\n- “type”: ps1, exe.\n\n- “task_id”: ID of the current attack.\n\n\n-----\n\nIn the case of “status”:“command,” the powershell command will be retrieved and run without writing the\ncommand to disk.\n\nIf “type” is “ps1”/“exe,” a random named powershell/exe file will be created in the Temp directory. Then, the\nfollowing request will be sent to the C2 to get the powershell command:\n\n{“action”:”get_file”,”hwid”:<hwid>,”task_id”:<task_id>,”protocol_version”:1}. The command is then written to the\npreviously created random file and executed. This stage will be discussed in a subsequent section.\n\nWhile the next stage is running, another request gets sent to the C2 with the action: {“action”:”change_\nstatus”,”hwid”:<hwid>,”task_id”: <task_id>,”is_success”:true,”protocol_version”:1}.\n\nThis indicates that the next stage is running successfully. The response is then {“status”: “idle”}, which enters the\nprocess to a loop waiting for the next commands.\n\n**_DR/1.1:_**\n\n**Creation date: 2020-10-13**\n\n**SHA-1: d5a6ebdd65398f0a3591900192992220df49b03c**\n\nIn this phase, the creators added the domain name into the information they’re seeking to collect. All the other\ncollected information remains the same; they haven’t deleted anything or changed anything else from the\nprevious version.\n\n**Figure 15: The domain name is added.**\n\n\n-----\n\n**_DR/1.4:_**\n\n**Creation date: 2020-11-03**\n\n**SHA-1: aecd083118b9333133c2f43f85558730285ed292**\n\nThere were no significant or interesting changes from version DR/1.1\n\n###### POWERSHELL INTERMEDIATE LOADER\n\nIn most cases, based on the availability of active C2 connections, the next stage is a PowerShell script that is\ndownloaded by the Jupyter C2 client as described in a previous section.\n\nThe PowerShell script holds a base64 encoded blob and a XOR key that is similar to the previously mentioned\nPowerShell scripts. It decrypts the base64 blob (another .NET assembly) and, once again, runs it in-memory.\n\n**Figure 16: The PowerShell intermediate loader.**\n\n###### JUPYTER INFOSTEALER\n\n**INTRODUCTION**\n\nThe decrypted .NET assembly blob is the Jupyter infostealer. It has a different C2 address and different version\nnumber adhering to the patterns of the C2 client. It also implements similar obfuscation patterns.\n\n**Figure 17: The Jupyter infostealer .NET assembly blob.**\n\nInitially Morphisec researchers identified that all the infostealer payloads had the same namespace, Jupyter.\nLater, they traced the random DLLs to the original first version of Jupyter and identified that it was its original\n\n\n-----\n\nfilename. Furthermore, it looks like the adversaries have a special interest in the planet Jupiter as an image\nof the planet is found on the main page of the admin panel accessed by the infostealer. As stated in the\nintroduction, the image was most likely extracted from a Russian-language forum, which wasn’t a big surprise\nconsidering the fact that all the investigated C2s point back to Russia.\n\n**VERSIONS:**\n\n**_CS-DN/1.3:_**\n\n**Creation date: 2020-06**\n\n**SHA-1: 864fa452bef69f877917c6feebf245e77a213c9d**\n\nThis is the first version seen in the wild of the infostealer. Stealing information (autocomplete, cookies, and\npasswords) only from Chrome browsers, it uses the same FingerPrint class mentioned in the previous stage to\nget the UID.\n\n**Figure 18: Jupyter version CS-DN/1.3.**\n\nIt copies the stolen information to another directory, and then reads the information from there to avoid\ntriggering alerts. This allows it to evade defenses and continue on to achieving the attacker’s ultimate goal of\nexfiltration.\n\n**Figure 19: Jupyter’s defense evasion.**\n\n\n-----\n\n**_CS-DN/1.8:_**\n\n**Creation date: 2020-10-07**\n\n**SHA-1: 942c1b5eb8ea14e2fa0d0b83a296cf37c8efa688**\n\nThis version added Firefox information stealing (cookies, logins, certificates, and form history). This version uses\nthe same technique of copying the stolen information before accessing it to evade detection.\n\n**Figure 20: Jupyter added Firefox information stealing.**\n\nAll of the stolen information is sent to the configured C2, which is different from the loader. At the time of\nwriting this, the admin panel was still active.\n\n**Figure 21: The admin panel.**\n\n\n-----\n\n###### CONCLUSION\n\nEvery version of the Jupyter infostealer adds yet another unknown element to the attack so that detectioncentric solutions can be evaded and continuously bypassed. As our analysis shows, the infostealer creator\nconstantly changes the code to collect more information and more efficiently evade detection without causing\nalerts.\n\nJupyter and similarly evolving attacks make clear the fundamental issue with detection-centric tools because\nthey show that the adversary can consistently iterate on their attack to stay ahead of the defender. Morphisec\ncustomers are secured against unknown attacks like this without needing to detect any portion of the attack\nchain through the zero trust runtime environment created by our moving target defense technology.\n\n###### IOCS\n Yara:\nrule Jupyter_Infostealer\n{\nmeta:\ndescription = “Rule to detect Jupyter Infostealer”\nauthor = “Morphisec labs\nstrings:\n$uid = “\\”hwid\\”:” wide\n$version_loader1 = “DR/” wide\n$version_loader2 = “DN-DN/” wide\n$version_jupyter = “CS-DN/” wide\ncondition:\nuint16(0) == 0x5A4D and $uid and 1 of ($version*)\n}\n\n**Zip:**\n\n- 02a52b218756fa65e9fd8a9acb75202afd150e4c\n\n- ce9d62978c8af736935af5ed1808bfc829cbb546\n\n- 591f33f968ed00c72e2064e54ccb641272681cb4\n\n**Installer (from zipped folder):**\n\n- b2ed7e45eec9afb74ffbfa90495824945b8a84c7\n\n- 6ad28e1810eb1be26e835e5224e78e13576887b9\n\n- 3854bc3263c1bf3e3a79c0310e1b972bcb17b8a5\n\n- 59488aa15eeb47cd0b024c8a117db82f1bc17a80\n\n- 5bc62d38e3249c9e5cb6fe2cb4e11b4dfb3c8917\n\n\n-----\n\n###### C2 Jupyter client:\n\n- 26af2e85b0a50bf2352d46350744d4997448e51d\n\n- 1478b1ead914f03d801087dc0b4cca07b19c7f53\n\n- ea2b5b7bcc0efde95ef1daf91dcb1aa55e3458a9\n\n- f76e293d627c55eca18ce96e587fb8c6e37d8206\n\n- 8133304181d209cb302fbcdbf3965b0b5c7fa20c\n\n- aecd083118b9333133c2f43f85558730285ed292\n\n###### Jupyter Infostealer:\n\n- 261ed0f6c7b5052a6f4275a2c4d3207e56333b05\n\n- 942c1b5eb8ea14e2fa0d0b83a296cf37c8efa688\n\n- 864fa452bef69f877917c6feebf245e77a213c9d (the original one without firefox and with original UID)\n\n##### C2:\n\n- 45.135.232[.]131\n\n- 45.146.165[.]222\n\n- 45.146.165[.]219\n\n- 91.241.19[.]21\n\n- gogohid[.]com\n\n- spacetruck[.]biz\n\n- blackl1vesmatter[.]org\n\n- Mixblazerteam[.]com\n\n- vincentolife[.]com/j\n\n- On-offtrack[.]biz\n\n\n-----\n\n###### ABOUT MORPHISEC\n\n Morphisec delivers an entirely new level of innovation to customers with its patented\n\n Moving Target Defense technology - placing defenders in a prevent-first posture against\n\n the most advanced threats to the enterprise, including APTs, zero-days, ransomware,\n\n evasive fileless attacks and web-borne exploits. Morphisec provides a crucial,\n\n smallfootprint memory-defense layer that easily deploys into a company’s existing\n\n security infrastructure to form a simple, highly effective, cost-efficient prevention stack\n\n that is truly disruptive to today’s existing cybersecurity model.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.11.12.Jupyter_InfoStealer/Jupyter%20Infostealer%20WEB.pdf",
        "https://www.morphisec.com/hubfs/eBooks_and_Whitepapers/Jupyter%20Infostealer%20WEB.pdf"
    ],
    "report_names": [
        "Jupyter Infostealer WEB",
        "Jupyter%20Infostealer%20WEB.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1605191980,
    "ts_modification_date": 1605191985,
    "files": {
        "pdf": "https://archive.orkl.eu/5352306527c9f9cbd00390846f430f159d9e6797.pdf",
        "text": "https://archive.orkl.eu/5352306527c9f9cbd00390846f430f159d9e6797.txt",
        "img": "https://archive.orkl.eu/5352306527c9f9cbd00390846f430f159d9e6797.jpg"
    }
}