{
    "id": "8034ca56-f542-498e-9ab1-c7ac47bd2eb8",
    "created_at": "2023-01-12T14:59:46.52187Z",
    "updated_at": "2025-03-27T02:05:45.205476Z",
    "deleted_at": null,
    "sha1_hash": "5d6904eb385cbbfad0b5853b16c208bba91644ec",
    "title": "2021-05-13 - Meet Lorenz — A new ransomware gang targeting the enterprise",
    "authors": "",
    "file_creation_date": "2022-05-27T02:08:55Z",
    "file_modification_date": "2022-05-27T02:08:55Z",
    "file_size": 1809088,
    "plain_text": "# Meet Lorenz — A new ransomware gang targeting the enterprise\n\n**[bleepingcomputer.com/news/security/meet-lorenz-a-new-ransomware-gang-targeting-the-enterprise/](https://www.bleepingcomputer.com/news/security/meet-lorenz-a-new-ransomware-gang-targeting-the-enterprise/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nMay 13, 2021\n12:54 PM\n2\n\nA new ransomware operation known as Lorenz targets organizations worldwide with\ncustomized attacks demanding hundreds of thousands of dollars in ransoms.\n\nThe Lorenz ransomware gang began operating last month and has since amassed a growing\nlist of victims whose stolen data has been published on a ransomware data leak site.\n\n[Michael Gillespie of ID Ransomware has told BleepingComputer that the Lorenz](https://id-ransomware.malwarehunterteam.com/)\nransomware encryptor is the same as a previous operation known as ThunderCrypt.\n\nIt is not clear if Lorenz is the same group or purchased the ransomware source code to\ncreate its own variant.\n\n## Data leak site launched to extort victims\n\n\n-----\n\nLike other human-operated ransomware attacks, Lorenz will breach a network and spread\nlaterally to other devices until they gain access to Windows domain administrator credentials.\n\nWhile spreading throughout the system, they will harvest unencrypted files from victims'\nservers, which they upload to remote servers under their control.\n\nThis stolen data is then published on a dedicated data leak site to pressure victims to pay a\nransom or to sell the data to other threat actors.\n\nThis Lorenz data leak site currently lists twelve victims, with data released for ten of them.\n\n**Lorenz data leak site**\nWhen the Lorenz gang publishes data, they do things a bit differently compared to other\nransomware gangs.\n\nTo pressure victims into paying the ransom, Lorenz first makes the data available for sale to\nother threat actors or possible competitors. As time goes on, they start releasing passwordprotected RAR archives containing the victim's data.\n\n\n-----\n\nUltimately, if no ransom is paid, and the data is not purchased, Lorenz releases the\npassword for the data leak archives so that they are publicly available to anyone who\ndownloads the files.\n\nAnother interesting characteristic not seen in other data leak sites is that Lorenz sells access\nto the victim's internal network along with the data.\n\n**Offering access to victim's internal network**\nFor some threat actors, access to the networks could be more valuable than the data itself.\n\n## The Lorenz encryptor\n\nFrom samples of the Lorenz ransomware seen by BleepingComputer, the threat actors\ncustomize the malware executable for the specific organization they are targeting.\n\nIn one of the samples [shared with BleepingComputer, the ransomware will issue the](https://twitter.com/AndreGironda/status/1390681165309235212)\nfollowing commands to launch a file named ScreenCon.exe from what appears to be the\nlocal network's domain controller.\n```\nwmic /node:\"0.0.0.0\" /USER:\"xx.com\\Administrator\" /PASSWORD:\"xx\" process call create\n\"cmd.exe /c schtasks /Create /F /RU System /SC ONLOGON /TN sz402 /TR\n\"\\\\xx.com\\NETLOGON\\MSI_Install\\ScreenConn.exe\" & SCHTASKS /run /TN sz402&SCHTASKS\n/Del\n\n```\nWhen encrypting files, the ransomware uses AES encryption and an embedded RSA key to\nencrypt the encryption key. For each encrypted file, the .Lorenz.sz40 extension will be\nappended to the file's name.\n\nFor example, a file named 1.doc would be encrypted and renamed to 1.doc.Lorenz.sz40, as\nshown in the image of an encrypted folder below.\n\n\n-----\n\n**Lorenz encrypted files**\nUnlike other enterprise-targeting ransomware, the Lorenz sample we looked at did not kill\nprocesses or shut down Windows services before encrypting.\n\nEach folder on the computer will be a ransom note named\n**HELP_SECURITY_EVENT.html that contains information about what happened to a victim's**\nfiles. It will also include a link to the Lorenz data leak site and a link to a unique Tor payment\nsite where the victim can see their ransom demand.\n\n\n-----\n\n**Lorenz ransom note**\nEach victim has a dedicated Tor payment site that includes the ransom demand in Bitcoin\nand a chat form that victims can negotiate with the attackers.\n\n\n-----\n\n**Lorenz Tor payment page**\nFrom ransom notes seen by BleepingComputer, Lorenz ransom demands range from\n$500,000 to $700,000. Earlier versions of the ransomware included million-dollar ransom\ndemands, but it is unclear if those were affiliated with the same operation.\n\nThe ransomware is currently being analyzed for weaknesses, and BleepingComputer does\nnot advise victims to pay the ransom until its determined if a free decryptor can recover files\nfor free.\n\n### Related Articles:\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[Quantum ransomware seen deployed in rapid network attacks](https://www.bleepingcomputer.com/news/security/quantum-ransomware-seen-deployed-in-rapid-network-attacks/)\n\n[Snap-on discloses data breach claimed by Conti ransomware gang](https://www.bleepingcomputer.com/news/security/snap-on-discloses-data-breach-claimed-by-conti-ransomware-gang/)\n\n[Shutterfly discloses data breach after Conti ransomware attack](https://www.bleepingcomputer.com/news/security/shutterfly-discloses-data-breach-after-conti-ransomware-attack/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n\n-----\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-13 - Meet Lorenz — A new ransomware gang targeting the enterprise.pdf"
    ],
    "report_names": [
        "2021-05-13 - Meet Lorenz — A new ransomware gang targeting the enterprise.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535586,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653617335,
    "ts_modification_date": 1653617335,
    "files": {
        "pdf": "https://archive.orkl.eu/5d6904eb385cbbfad0b5853b16c208bba91644ec.pdf",
        "text": "https://archive.orkl.eu/5d6904eb385cbbfad0b5853b16c208bba91644ec.txt",
        "img": "https://archive.orkl.eu/5d6904eb385cbbfad0b5853b16c208bba91644ec.jpg"
    }
}