{
    "id": "80554bf1-3d01-45f4-ab02-92317c34b7de",
    "created_at": "2022-10-25T16:48:14.227929Z",
    "updated_at": "2025-03-27T02:13:34.255658Z",
    "deleted_at": null,
    "sha1_hash": "a2425e6cac6127d7c43e5135ede2b9cc7fdb2543",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-02-01T05:50:19Z",
    "file_modification_date": "2018-02-01T05:50:19Z",
    "file_size": 5476555,
    "plain_text": "[Blog Home (https://researchcenter.paloaltonetworks.com/) > Unit 42 (https://researchcenter.paloaltonetworks.com/unit42/)](https://researchcenter.paloaltonetworks.com/)\n\n- Comnie Continues to Target Organizations in East Asia\n# Comnie Continues to Target Organizations in East Asia\n\n[By Josh Grunzweig (https://researchcenter.paloaltonetworks.com/author/josh-grunzweig/)](https://researchcenter.paloaltonetworks.com/author/josh-grunzweig/)\nJanuary 31, 2018 at 5:00 AM\n[Category: Unit 42 (https://researchcenter.paloaltonetworks.com/unit42/)](https://researchcenter.paloaltonetworks.com/unit42/)\n[Tags: Comnie (https://researchcenter.paloaltonetworks.com/tag/comnie/)](https://researchcenter.paloaltonetworks.com/tag/comnie/)\n\n 1,606 (2)\n\n(https://twitter.com/home?\n[status=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-comnie-continues-](https://twitter.com/home?status=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-comnie-continues-target-organizations-east-asia%2F+Comnie+Continues+to+Target+Organizations+in+East+Asia)\ntarget-organizations-east-asia%2F+Comnie+Continues+to+Target+Organizations+in+East+Asia) \n(https://www.facebook.com/sharer/sharer.php?\nu=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-comnie-continuestarget-organizations-east-asia%2F)  (https://www.linkedin.com/shareArticle?\nmini=true&url=https%3A%2F%2Fresearchcenter.paloaltonetworks.com%2F2018%2F01%2Funit42-comniecontinues-target-organizations-eastasia%2F&title=Comnie+Continues+to+Target+Organizations+in+East+Asia&summary=&source=)\n(//www.reddit.com/submit)\n\nUnit 42 has been tracking a series of attacks using a remote backdoor malware family named Comnie, which have been\nobserved targeting organizations in the East Asia region. Comnie, first named by Sophos seemingly after the Windows LNK\nfile name it created, is a custom malware family that is used in targeted attacks, and has been observed in the wild since at\nleast April 2013. The Comnie malware family is notable in that it leverages online blogs and third-party services to obtain\ncommand and control (C2) information. Recent instances of the malware have been observed leveraging github.com,\ntumbler.com, and blogspot.com.\n\nAttackers using Comnie are leveraging malicious macros that initially hide decoy documents and shows them when the\nvictim enables macros. These decoys documents pertain to various subject matters that the targets would be likely to be\ninterested in. The contents of these documents suggest that the main interests of threat actor likely included the\norganizations in the following industries, located in Taiwan:\n\nTelecommunication\nDefense\nGovernment\nHigh Tech\n\nThe most recent attacks, in November 2017, likely targeted organizations in the following industries, located in South Korea:\n\nAerospace\nDefense\n\nAdditionally, while researching this campaign, we identified historical attacks that appear to target the Taiwan government,\nan IT service vendor based in Asia, and a journalist of a Tibetan radio station.\n\n### Activities Involving Comnie\n\nBeginning in mid of 2015, we observed the Comnie malware family delivered via malicious macros with various file names\nand decoy subject matters. Original file names, as well as information revealed within the decoy documents used by these\nsamples provide clues as to who the targets may be. In the most recent attacks in November 2017, the information\nsuggests that these attacks have most likely taken place against Aerospace and Defense industry targets in South Korea.\n\n\n-----\n\n|Original File Name|Translation|Decoy|Location|Most Likely Target|\n|---|---|---|---|---|\n|관계기관번 호.xls|Affiliate numbers.xls|Affiliate phone numbers for a South Korean international airport|KR|Aerospace|\n|PBCS_관련 _현황_보 고.doc|PBCS_related_status_report.doc|Report on the status of Performance- Based Communication and Surveillance (PBCS)|KR|Aerospace Defense|\n\n\nThe following decoy contents are only shown to the victim after macros have been enabled:\n\n_Figure 1 Decoy document discussing an airport contact list in Korean_\n\n\n-----\n\nBefore the attacks against South Korean targets, the same malicious macros were used to deliver the Comnie malware\nfamily to targets in Taiwan as early as 2015. Again, based on the original file names and the decoy contents, the most\ncommonly witnessed targets in attacks that occurred in 2017 included those involving the Telecommunication, Defense, and\nHigh-Tech industries in Taiwan.\n\n**Original File** **Translation** **Decoy** **Location Most Likely**\n**Name** **Target**\n\n1060315 本部 1060315 Defense Industry TW Defense\n發言參考.doc Headquarters Development\n\nSpeech Strategy\nReference.doc\n\n轉給苦逼的網管 Passing to cool Network TW High Tech\n兄弟.doc fellow network administration\n\nTelecommunication\n\nadministrators.doc jokes\n\n2.SC OAM 2.SC OAM Network topology TW High Tech\nFirewall Firewall diagrams\n\nTelecommunication\n\nPolicy_0306.xls Policy_0306.xls\n\n_Figure 3 Decoy document discussing Taiwan’s defense industry development strategy_\n\n|Original File Name|Translation|Decoy|Location|Most Likely Target|\n|---|---|---|---|---|\n|1060315 本部 發言參考.doc|1060315 Headquarters Speech Reference.doc|Defense Industry Development Strategy|TW|Defense|\n|轉給苦逼的網管 兄弟.doc|Passing to cool fellow network administrators.doc|Network administration jokes|TW|High Tech Telecommunication|\n|2.SC OAM Firewall Policy_0306.xls|2.SC OAM Firewall Policy_0306.xls|Network topology diagrams|TW|High Tech Telecommunication|\n\n\n-----\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/figure4_comnie.png)\n\n_Figure 4 Network firewall configuration description for a major telecommunication company in Taiwan_\n\n_Figure 5 Decoy document providing network topology information_\n\nIt is worth noting that in the attack that made use of the decoy document in Figure 4, the attacker also included related\nfirewall logs and appears to have originated from a compromised an IT service vendor.\n\nLooking at earlier attacks between 2013 and 2016, we believe Comnie was also used in targeted attacks against the\nfollowing individuals or organizations:\n\n\n-----\n\nJournalist of a Tibetan radio station\n\n(https://researchcenter.paloaltonetworks.com/wp-content/uploads/2018/01/figure6_comnie.png)\n\n_Figure 6 Email sent to Journalist of Tibetan radio station_\n\n### Malicious Macros\n\nThe malicious macro documents used to deliver Comnie initially hide the content inside and requests that the user enables\nmacros prior to viewing the document. Once the user enables macros, the macro will perform the following actions:\n\n1. Displays decoy content\n2. Checks for the existence of a file at %APPDATA%⧵wscript.exe\n3. If %APPDATA%⧵wscript.exe does not exist, the macro converts an embedded hex-encoded string into bytes and\n\nsaves this data to the %APPDATA%⧵wscript.exe.\n4. Executes the newly created wscript.exe payload\n\n\n-----\n\n_Figure 7 Example macro used to delivery Comnie_\n\nAn interesting discovery was made when examining the macros used to deliver Comnie. Based on evidence gleaned from\nboth the macro and other data collected from the samples, it appears that the threat actor did not generate these\ndocuments from scratch. Instead, they appear to have been created based on an existing sample available via public\nsample repositories. The existing sample in question was created by a red team penetration tester at a financial institution\nfor internal testing. The following image shows a comparison of macro code extracted from Comnie dropper and financial\ninstitution’s penetration test sample.\n\n_Figure 8 Comparison of macros extracted from Comnie dropper versus a pentest sample used by a financial organization_\n\n### Comnie Malware Family\n\nComnie uses the RC4 algorithm in multiple locations both to obfuscate strings used by the malware, as well as for network\ncommunication. Additionally, the malware looks for multiple security products on victim machines and sometimes alters its\nbehavior depending on the products present. More information about how Comnie handles identified security products may\n\n\n-----\n\nComnie is able to achieve persistence via a .lnk file that is stored within the victim’s startup path. When originally run,\nComnie will convert itself from an executable file to a DLL and will write this newly created DLL to the host machine’s\n%APPDATA% directory. The built-in Windows utility rundll32.exe is then used to load this DLL by the original .lnk file.\n\nUnit 42 has observed a total of two variants of Comnie. One of the ways the variants differ is in how they obtain their\ncommand and control (C2) information. Both variants make use of third-party online services in an attempt to prevent DNS\nbased blocking of their first stage communications. However, the obfuscation mechanism varies slightly. In older variants,\nComnie was found to look for the ‘++a++’ markers. The example C2s used by older variants of Comnie demonstrates this:\n\n_Figure 9 Old Comnie variants collecting C2 information_\n\nPlease refer to the Appendix for a script that may be used to decode C2 information from the older Comnie variants.\n\nNewer Comnie variants, such as the ones witnessed in the most recent attacks, instead look for the ‘magnet:/’ and ‘?’\nmarkers, such as in the following recent example:\n\n_Figure 10 New Comnie variants determining their C2 information via a GitHub profile._\n\nAfter Comnie collects the remote C2 information, it will communicate with these remote servers using HTTP requests. These\nrequests are encrypted using the RC4 algorithm. Comnie will upload information about the victim. It also allows the attacker\nto provide and subsequently execute a batch script (BAT), executable file (EXE), or dynamic-link library (DLL).\n\nMore detailed information about how C2 information is decoded and additional technical analysis of Comnie may be found\nin the Appendix.\n\n\n-----\n\n### Conclusion\n\nComnie is far from a new threat, however, it continues to remain active. In the past year, we have observed multiple low\nvolume attacks in various regions of East Asia. Based on clues provided by the malware’s original file names, as well as the\ndecoy content embedded within these samples, we can make a reasonable estimation that these attacks targeted\norganizations in Taiwan in the Telecommunication, Defense, Government, and High-Tech industries. Additionally, those same\nestimations may be made for attacks in South Korea targeting the Aerospace and Defense industries.\n\nWhile we have witnessed modifications to the attacker’s toolsets, the overall architecture and operations of the Comnie\nmalware family have remained consistent, suggesting that the attackers have been able to stay below the radar of the\nsecurity community.\n\nThe Comnie malware family is notable in that it leverages third-party online services to download and parse C2 information.\nBecause these third-party online services are legitimate, it allows Comnie to circumvent a number of security preventions\nthat may be present in the environment. This overall technique has previously been referred to as using a “Dead Drop\n[Resolver” or DDR. (https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=Trojan:Win32/Barlaiy.A!dha)\nName=Trojan:Win32/Barlaiy.A!dha)\n\nPalo Alto Networks customers are protected from this threat in the following ways:\n\nAll identified samples have been flagged as malicious by WildFire and Traps\nCustomers may track this threat using the ‘Comnie’ AutoFocus tag\nTraps appropriately catches the macro execution from the malware and prevents it\n\nAdditionally, blogspot, tumblr, and github have been alerted to the malicious activity discovered.\n\n### Appendix\n\n Comnie Technical Analysis\n\nFor the analysis of the Comnie malware family, we investigated the following sample:\n\n**SHA256** 18ec68e1bd9b11f22e481d48c415f8d80edb76e9032ba4e1d31d87e16eed9959\n\nWhen the sample is initially executed, it will attempt to create a mutex with a name of ‘tmutexabc’ to ensure only a single\ninstance of Comnie is running at a given time. Should this mutex already be found to exist, the malware will immediately\nexit.\n\nComnie continues to load an embedded bitmap (BMP) file and decrypt data at offset 0x512.\n\n_Figure 11 Embedded BMP file containing encrypted string data_\n\nRC4 is used to decrypt this data using a 16 byte key that is stored within the BMP file at offset 0x502 Once decrypted we\n\n|SHA256|18ec68e1bd9b11f22e481d48c415f8d80edb76e9032ba4e1d31d87e16eed9959|\n|---|---|\n\n\n-----\n\n_Figure 12 Decrypted strings from embedded BMP file_\n\nAfter these strings are decrypted, the malware will load a series of Microsoft Windows API calls to be used later on. After\nthese functions are loaded, Comnie determines if it is running within the %TEMP% directory of the victim machine. In the\nevent it is not running within this directory, it will copy itself to %TEMP% and execute this newly created file with an\nargument of the original file’s path. A total of 64MB of garbage data is appended to this copied file, likely as a way to deter\nany security products in place that may be scanning files on disk. After running within the %TEMP% path, Comnie will\ndelete the original file.\n\nAfter Comnie has been copied to the %TEMP% directory, it will look for the presence of the ‘DQuit.tmp’ file in this path. It is\nunclear how this file is used exactly, as it does not appear to ever be written during runtime by Comnie.\n\nComnie continue to enter its installation routine. In doing so, it will attempt to detect the following Anti-Virus products via\nvarious techniques:\n\nTrend Micro\nKaspersky\nSymantec\nAvira\nAVG\nALYac\nAhnlab\n\nAhnlab and ALYac are the most widely used Anti-Virus solutions in South Korea (http://www.dt.co.kr/contents.html?\narticle_no=2017102502101260041001), and Trend Micro and the rest are also known to be most widely used in Taiwan.\nThese are in-line with the targeting of the victims witnessed by the attackers using Conmie.\n\nWith a few exceptions, Comnie will perform the following actions regardless of what security product, if any, is discovered:\n\nConvert itself to a temporary DLL with a default export of ‘Dm’ in the %TEMP% directory.\nIf running with administrator privileges on a 32-bit host:\n\nCopy the temporary DLL in %TEMP% to %WINDOWS%⧵LINKINFO.dll\nOtherwise:\n\nCopy the temporary DLL in %TEMP% to %APPDATA%⧵cnagnt.dll\nDelete the temporary DLL in %TEMP%\nWrite a ‘Conime.lnk’ file in the user’s startup path. This shortcut file points to\n‘C:⧵Windows⧵system32⧵rundll32.exe “%APPDATA%⧵cnagnt.dll”,Sd’\n\n\n-----\n\np p y p\n\nAdditionally, in the event Kaspersky is detected, the malware will immediately run the ‘Conime.lnk’ shortcut file in a new\nprocess after it is created.\n\nAfter the installation routine, the malware will decrypt an embedded blob of data using RC4 with an embedded 8-byte static\nkey of ‘⧵x11⧵xcc⧵xd1⧵x32⧵x61⧵x21⧵xd1⧵xe2’. The results of the decoded data may be seen below:\n\n_Figure 13 Decrypted information_\n\nThe decrypted data contains URLs for various online services that will be used by the attacker for downloading data that will\ncontain the command and control (C2) server(s) and port(s) to be used by Comnie.\n\nComnie will make requests to these URLs, looking for base64-encoded data after an identifier of ‘magnet:/’, as seen in the\nexample below:\n\n_Figure 14 GitHub storing Comnie C2 information_\n\nIn the example above, the C2 information is being stored within the user’s URL parameter within GitHub. In order to decode\nthis data, Comnie first decodes it using base64 with the following non-standard alphabet (note that it is simply the original\nalphabet in reverse):\n\n/+9876543210zyxwvutsrqponmlkjihgfedcbaZYXWVUTSRQPONMLKJIHGFEDCBA\n\n\n-----\n\np y g g, g p p yp g\n\nmailto:121.126.211[.]94:8080;80;80\n\nThe following Python script may be used to decode the C2 data used by the newest Comnie variant:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n\n\nimport base64\nimport sys\nimport re\nfrom string import maketrans\nfrom struct import *\nimport requests\n\ndef rc4_crypt(data, key):\nS = range(256)\nj = 0\nout = []\nfor i in range(256):\nj = (j + S[i] + ord( key[i % len(key)] )) % 256\nS[i], S[j] = S[j], S[i]\ni = j = 0\nfor char in data:\ni = ( i + 1 ) % 256\nj = ( j + S[i] ) % 256\nS[i], S[j] = S[j], S[i]\nout.append(chr(ord(char) ^ S[(S[j] + S[i]) % 256]))\nreturn ''.join(out)\n\ndef decode(data):\no = \"\"\nfor d in data:\nod = ord(d)\no += chr((4 * (16 * od | od & 0xC) | (((od >> 4 | od & 0x30) >> 2))) & 0xFF)\nreturn o\n\nbase64fixTable = maketrans(\"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/\"[::-1], \"ABCDEFGHIJKLMNOP\nQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/\");\n\ndef trans(string):\nreturn str(string).translate(base64fixTable)\n\ndef altdecode(string):\nreturn base64.b64decode(trans(string))\n\nreq = requests.get(sys.argv[1])\nfd = req.text\n\noriginal_data = re.search(\"magnet:/\\?([^\\?]+)\\?\", fd).group(1)\nparsed_data = altdecode(original_data)\n\ndataLength = unpack(\"<I\", parsed_data[64:68])[0]\nkey = decode(parsed_data[0:64])\ndata = parsed_data[dataLength*-1:]\n\nd = rc4_crypt(data, key)\n\nprint(d)\n\n\nComnie will make attempts at connecting to the IP address above using the various ports specified. Data is sent via HTTP,\nand is encrypted against using the RC4 algorithm. The URIs used in the HTTP requests are randomly generated. Data is\nprovided first via the ‘pid’ GET parameter initially, and via the ‘iid’ GET parameter when POST requests are made by\nComnie. Initially, Comnie will send the following request:\n\n_Figure 15 Comnie initial beacon_\n\n\n-----\n\ny g p y,,,,,,,\nform an 8-byte RC4 key. After applying this decryption algorithm, we are presented with the following data:\n\nh=HOSTNAME­PC&f=mission.ini&c=&\n\nThe response made by the C2 server uses the same RC4 key for encryption. The data above contains the hostname\n(‘HOSTNAME-PC’) of the victim machine, as well as an instruction. In this case, the instruction is asking for information that\nis to be written to a temporary BAT file within the %TEMP% directory. The following example information is provided by the\nremote C2 server:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n\n\n\n[MISSION]\nId=2017\nCrc=201701\n\n[BAT]\nNum=1\nFileName1=gethostinfo.bat\nCrc1=2017011\nResultFile1=info.dat\n\n\nThis INI file is parsed to determine what Comnie should do. Comnie allows the attacker to provide and subsequently\nexecute a batch script (BAT), executable file (EXE), or dynamic-link library (DLL). Using this example, Comnie will then\nrequest data to supply to the BAT script, via the following decrypted request:\n\nh=HOSTNAME­PC&f=gethostinfo.bat&c=&\n\nBased on network traffic witnessed, the remote C2 server was found to respond with the following information:\n\n\n1\n2\n3\n4\n5\n6\n7\n\n\nnetstat -ano > %TEMP%\\info.dat\nipconfig /all >> %TEMP%\\info.dat\nroute PRINT >> %TEMP%\\info.dat\nnet view >> %TEMP%\\info.dat\ntasklist >> %TEMP%\\info.dat\nnet user >> %TEMP%\\info.dat\nnet start >> %TEMP%\\info.dat\n\n\nThis script is written to a temporary file prior to be executed. The results of this BAT script are uploaded to the remote C2\nserver.\n\n### Old Comnie Variant C2 Decoder\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n\n\nimport requests\nimport sys\nimport re\n\ndef decode(data):\no = \"\"\nfor c in data:\nif c == \"*\":\no += \".\"\nelif c == \"|\":\no += \":\"\nelif c == \"+\":\no += \";\"\nelse:\no += chr(ord(c)-49)\nreturn o\n\nr = requests.get(sys.argv[1])\nfd = r.text\n\ndata = fd.split(\"++a++\")[1].split(\"++a++\")[0]\nprint(decode(data))\n\n\n### Samples Analyzed\n\need5945c36ba22a2531dd2d9dd7bc4e17e68544d512be75670919caf287c1b4a\n\n8026442b812469e48ccd11611ab6eacdcb312a8f1aabd563b7f4cb4868315e16\n\nc8951038fd53321661274e5a12532c3fb6f73c75fd75503a1089c56990658fef\n\n48a1ce103e5bf47c47cc5ed40b2dc687ebaf3674d667419287bcb1d0b8d8dda6\n\n\n-----\n\nbf6ee8426245b167a69292e513c0841d818b310dda87daea649221f4e0afd1b3\n\n62b98dde60cb4dd0d0088bde222c5c2c4c92560cccf4753f1ce94e044093ab85\n\n756952652290ad09fe03c8674d44eab2077b091398187c3abcb6f1ddc462c32d\n\n639a49390c6f8597d36ec0bd245efa1b4a078c0506fb515e577a40389b39a614\n\n29ed6eb3c882b018c2bb6bf2f8eb15069dc5510ca119abebf24f09e3c91f10aa\n\n0e8a4e4d5ca501bad25a730fb5de534fa324c6ac23e0a573524693f2d996d105\n\n316a0c6849f183a1a52d0c7648e722c4ca85bd57b0804a147c0c8656b84bbdb9\n\n### Identified C2s\n\n121.126.211[.]94:8080\n\n113.196.70[.]11:80,8080\n\n133.130.101[.]47:443\n\n123.51.208[.]157:443;8000;8080\n\n### C2 Hosting URLs (DDR URLs)\n\ngithub[.]com/korlee5643\n\nitsmonsee.tumblr[.]com\n\nallworldnewsway.blogspot[.]com\n\n##### Got something to say?\n\nLeave a comment...\n\n**Notify me of followup comments via e-mail**\n\n\nName (required)\n\n\nEmail (required)\n\n\nWebsite\n\n\nSUBMIT\n\n\n-----\n\nEmail SUBSCRIBE\n\n**COMPANY**\n\n[Company (https://www.paloaltonetworks.com/company)](https://www.paloaltonetworks.com/company)\n\n[Careers (https://www.paloaltonetworks.com/company/careers)](https://www.paloaltonetworks.com/company/careers)\n\n[Sitemap (https://www.paloaltonetworks.com/sitemap)](https://www.paloaltonetworks.com/sitemap)\n\n[Report a Vulnerability (https://www.paloaltonetworks.com/security-disclosure)](https://www.paloaltonetworks.com/security-disclosure)\n\n**LEGAL NOTICES**\n\n[Privacy Policy (https://www.paloaltonetworks.com/legal-notices/privacy)](https://www.paloaltonetworks.com/legal-notices/privacy)\n\n[Terms of Use (https://www.paloaltonetworks.com/legal-notices/terms-of-use)](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n**ACCOUNT**\n\n[Manage Subscription (https://www.paloaltonetworks.com/company/subscriptions)](https://www.paloaltonetworks.com/company/subscriptions)\n\n##  (https://www.linkedin.com/company/palo-alto-networks)   (https://www.facebook.com/PaloAltoNetworks/)   (https://twitter.com/PaloAltoNtwks)\n\n(https://ignite.paloaltonetworks.com/usa/?\n\nCampaignId=7010g000001IH8U&utm_content=Ignite18USA&utm_medium=390x90banner&utm_source=website)\n\n© 2016 Palo Alto Networks, Inc. All rights reserved.\n\n\nSALES > 888.219.8447 \n\n\nSEE A DEMO \n\n\n[TAKE A TEST DRIVE (HTTP://CONNECT.PALOALTONETWORKS.COM/VIRTUAL-UTD)](http://connect.paloaltonetworks.com/virtual-utd)\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.01.31.Comnie_Continues_to_Target_Organizations_in_East_Asia/unit42-comnie-continues-target-organizations-east-asia.pdf"
    ],
    "report_names": [
        "unit42-comnie-continues-target-organizations-east-asia"
    ],
    "threat_actors": [
        {
            "id": "ad59becc-29c2-4b7a-a958-d7f242d222ea",
            "created_at": "2023-01-06T13:46:38.956494Z",
            "updated_at": "2025-03-27T02:00:02.962214Z",
            "deleted_at": null,
            "main_name": "Blackgear",
            "aliases": [
                "Topgear",
                "Comnie",
                "BLACKGEAR"
            ],
            "source_name": "MISPGALAXY:Blackgear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1517464219,
    "ts_modification_date": 1517464219,
    "files": {
        "pdf": "https://archive.orkl.eu/a2425e6cac6127d7c43e5135ede2b9cc7fdb2543.pdf",
        "text": "https://archive.orkl.eu/a2425e6cac6127d7c43e5135ede2b9cc7fdb2543.txt",
        "img": "https://archive.orkl.eu/a2425e6cac6127d7c43e5135ede2b9cc7fdb2543.jpg"
    }
}