{
    "id": "8065d944-3db6-4ddd-b7d0-bf9475e4034a",
    "created_at": "2023-01-12T15:00:58.469818Z",
    "updated_at": "2025-03-27T02:16:26.340695Z",
    "deleted_at": null,
    "sha1_hash": "859be9e94f0c39fa30772a5fde891e348f9b8108",
    "title": "2022-04-13 - Zhadnost strikes again… this time in Finland.",
    "authors": "",
    "file_creation_date": "2022-10-02T12:13:15Z",
    "file_modification_date": "2022-10-02T12:13:15Z",
    "file_size": 3491223,
    "plain_text": "# Zhadnost strikes again… this time in Finland.\n\n**[securityscorecard.com/blog/zhadnost-strikes-again-this-time-in-finland](https://securityscorecard.com/blog/zhadnost-strikes-again-this-time-in-finland)**\n\n1. [Blog](https://securityscorecard.com/blog)\n\nBy Ryan Slaney, Staff, Threat Researcher\n\nPosted on April 13th, 2022\n\n**Executive Summary**\n\nSecurityScorecard (SSC) has identified a DDoS attack which targeted the websites of\nthe Finnish Ministry of Foreign Affairs and Ministry of Defense.\n\nSSC discovered more than 350 bots, mainly located in Bangladesh and African\n[countries, which are now considered to be part of the Zhadnost botnet, previously](https://securityscorecard.com/blog/securityscorecard-discovers-new-botnet-zhadnost-responsible-for-ukraine-ddos-attacks)\ndiscovered by SSC in March.\n\nThe majority of the bots are MikroTik routers, running various MikroTik services, or\ndevices running Squid Proxy and vulnerable Apache web servers.\n\nThe DDoS attack against the Finnish websites does not appear to have a lasting\nimpact, as the sites were back online within hours of the attack.\n\n\n-----\n\nThe attack was conducted at the same time as Ukrainian President Volodymyr\nZelensky’s virtual address to the Finnish parliament, and hours after a Russian aircraft\nis suspected of invading Finland’s air space.\n\nThe attack coincides with Finland’s accelerated pursuit for NATO membership, a likely\nmotivating factor for the DDoS attack.\n\nAttributing Zhadnost and the DDoS attacks to any one threat actor is difficult, however,\nSSC assesses with moderate confidence that Russia, or Russian-aligned actors, are\nlikely behind this DDoS campaign.\n\nBased on prior history of Russian attacks, the next play in the Russian cyber threat\nactor playbook would be the deployment of wiper-style attacks, possibly against critical\ninfrastructure and government targets.\n\n**Background**\n\n“Russia is not the neighbor we thought it was.” Those were the words of Finland’s Prime\nMinister, Sanna Marin, when she told the Finnish people that it was very likely Finland would\njoin NATO during her time in office. This was seen as a sea change for Finland who, even\nafter two wars with the former Soviet Union, kept its independence during the Cold War, and\navoided joining alliances in the East or West. However, Russia’s second invasion of Ukraine\nappears to be the tipping point. Finland is now rocketing through the political process to\nbecome a NATO member, with a final decision expected as early as May. If Finland is\nsuccessful in its NATO bid, the length of the Russian - NATO border would double overnight.\n\nRussia has made it clear it isn’t keen on Finland’s pursuit of NATO membership. On March\n12, Russian foreign ministry spokesman Sergei Belyayev said that Finnish or Swedish NATO\nmembership would have “serious military and political consequences, and would require\nchanging the whole palette of relations with these countries and require retaliatory\nmeasures.”\n\n**DDoS Attack**\n\nOn April 8, as members of the Finnish parliament were listening intently to a virtual address\nby Ukrainian President Volodymyr Zelensky, reports emerged that the websites of Finland’s\nMinistry of Foreign Affairs (um.fi) and Defense (defmin.fi) were knocked offline for several\nhours as a result of a DDoS attack.\n\nSSC resolved the IP addresses of these domains and conducted netflow analysis for the\nperiod corresponding with the DDoS attack. Our data shows a sustained DDoS attack,\nlasting approximately four hours, launched by more than 350 unique IP addresses, spanning\nmultiple countries and continents. The most active bots were located in Bangladesh and\nAfrican countries. Of note, none of the IP addresses involved in any of the observed DDoS\n\n\n-----\n\nattacks were located in Russia or Belarus. The attack itself consisted of HTTPS flooding on\n[port 443. This type of attack is designed to overwhelm a targeted server with HTTP requests.](https://www.cloudflare.com/learning/ddos/glossary/hypertext-transfer-protocol-http/)\nOnce the target has been saturated with requests and is unable to respond to normal traffic,\na [denial-of-service will occur for additional requests from actual users.](https://www.cloudflare.com/learning/ddos/glossary/denial-of-service/)\n\nSSC then used proprietary data enrichment techniques, as well as open and closed\nintelligence sources to conduct further research and analysis on the 50 most active bots\ninvolved in the attack. What we discovered was that the majority (82%) of the bots were\nMikroTik routers, running various MikroTik services. The remaining IP addresses were\nrunning Squid Proxy, Caddy Server, and vulnerable versions of Apache.\n\n_Image 1: Breakdown of Bot Types (Source: SSC Attack Surface Intelligence)_\n\n[The makeup of these bots are nearly identical to that of the Zhadnost botnet, which was](https://securityscorecard.com/blog/securityscorecard-discovers-new-botnet-zhadnost-responsible-for-ukraine-ddos-attacks)\nresponsible for three separate DDoS attacks against Ukrainian government and financial\nwebsites before and shortly after the Russian invasion of Ukraine. The Finland attack is\nidentical to the first Ukraine attack, which was conducted on February 15. Both attacks\nconsisted of HTTPS flooding and relied on MikroTik, Squid Proxy, and Apache devices to\nconduct the attack. (Of note: the last two Ukraine attacks consisted of DNS amplification\nfrom misconfigured MikroTik routers.)\n\n[As we mentioned in our previous blog post on Zhadnost, MikroTik routers have a bevy of](https://securityscorecard.com/blog/securityscorecard-discovers-new-botnet-zhadnost-responsible-for-ukraine-ddos-attacks)\nvulnerabilities that allow threat actors to use them for DDoS attacks and other malicious\n[purposes. Although some patches have been deployed, multiple botnets, including Mēris,](https://blog.qrator.net/en/meris-botnet-climbing-to-the-record_142/)\n[Dvinis, and](https://www.netscout.com/blog/asert/meris-dvinis-botnets) [Glupteba consist of vast numbers of compromised MikroTik routers. According to](https://thehackernews.com/2022/03/over-200000-microtik-routers-worldwide.html?m=1)\n\n\n-----\n\nour Attack Surface Intelligence Data, there are at least 875,000 MikroTik devices deployed\nall over the world. This could potentially represent a near infinite number of bots, provided\nthey are vulnerable and DNS recursion is not properly configured on these devices.\n\nImage 2. Location and density of MikroTik devices. (Source: SSC Attack Surface\nIntelligence)\n\nWith the addition of the more than 350 bots we identified in this campaign, SSC is now\naware of nearly 3350 bots that make up the Zhadnost botnet.\n\n**Breach of Airspace - Innocent Mistake or Calculated Move?**\n\nThe attack came several hours after Finland’s Ministry of Defense announced Finnish air\n[space had been breached by a Russian aircraft. According to a press release, a Russian](https://www.defmin.fi/en/topical/press_releases_and_news/suspected_violation_of_finnish_air_space_off_the_coast_near_the_city_of_porvoo.12617.news#b391fb23)\nIlyushin IL-96-300 was suspected to have violated Finnish airspace for about three minutes,\noff the coast of the Gulf of Finland near the city of Porvoo in the morning of April 8. The press\nrelease did not specify if it was a Russian military, government, or civilian aircraft.\n\nThe Russian government is known to operate several IL-96-300s in various configurations. In\n2013, the Kremlin announced that it would receive two brand new IL-96-300PU “command\npost” aircraft, fitted with VIP interiors and special communications equipment, in order to\nallow for confidential communications and management of nuclear forces.\n\nIt’s unclear which IL-96-300 variant was involved in the suspected breach of Finnish\nairspace, who was operating it, or whether the breach was intentional or simply a\nnavigational error. However, given the timing of the airspace breach and the cyber attacks,\nit’s possible that Russia was conducting a coordinated flexing of both its air and cyber\nmuscles as a warning to both Finland and Sweden.\n\n\n-----\n\n_Image 3: Iluskin IL-96-300PU (Source: jetlinemarvel.net)_\n\n**Attribution**\n\nAttributing Zhadnost and the DDoS attack to any one threat actor is difficult, given that many\nbotnets rely on compromised MikroTik devices, and that individual bots can be used by more\nthan one botnet. Furthermore, it is difficult to identify the botnet’s command and control\ninfrastructure since the router’s traffic is combined with the legitimate traffic of the devices\nbehind them. However, taking into account the current geopolitical factors, and considering\nwhich country is likely to gain from such an attack, SSC can assess with moderate\nconfidence that Russia-or Russian-aligned actors–are likely behind this latest DDoS\ncampaign.\n\n**Outlook**\n\nThe DDoS attack against the Finnish websites does not appear to have a lasting impact, as\nthe sites were back online within hours of the attack. It’s likely that the threat actor was aware\nthat this attack would have a small impact, but still conducted it to achieve a different goal–to\nserve as a warning to Finland, and by extension, Sweden.\n\nAs Finland continues down the path of obtaining NATO membership, it is likely that cyber\nattacks will not only continue, but they will escalate. If history were to repeat itself, the next\nplay in the Russian cyber threat actor playbook would be the deployment of wiper-style\nattacks, possibly against critical infrastructure and government targets.\n\n**Recommendations**\n\nIt is critical to put DDoS mitigations in place, via a service like Cloudflare, Akamai, or\nAWS Cloudfront. Having a firewall will not stop the volume of traffic we have observed\nduring a Zhadnost DDoS attack.\n\n\n-----\n\nFurthermore, blocking Russian IPs will not stop DDoS attacks. The attacks are coming\nfrom across the world leveraging exploited devices located within neutral countries in\nLatin America, EU (not Russia or Belarus), and southeast Asia.\n\n**Indicators of Compromise**\n\nPlease contact [[email protected] for IoCs associated with the Zhadnost botnet, or with any](https://securityscorecard.com/cdn-cgi/l/email-protection#2e4740584b5d5a47494f5a4741405d6e5d4b4d5b5c475a575d4d415c4b4d4f5c4a004741)\nquestions or comments.\n\n[Return to Blog](https://securityscorecard.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-13 - Zhadnost strikes again… this time in Finland..pdf"
    ],
    "report_names": [
        "2022-04-13 - Zhadnost strikes again… this time in Finland..pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535658,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1664712795,
    "ts_modification_date": 1664712795,
    "files": {
        "pdf": "https://archive.orkl.eu/859be9e94f0c39fa30772a5fde891e348f9b8108.pdf",
        "text": "https://archive.orkl.eu/859be9e94f0c39fa30772a5fde891e348f9b8108.txt",
        "img": "https://archive.orkl.eu/859be9e94f0c39fa30772a5fde891e348f9b8108.jpg"
    }
}