{
    "id": "806e747c-08d3-4e5e-9579-741d4042b419",
    "created_at": "2023-01-12T15:06:59.034534Z",
    "updated_at": "2025-03-27T02:16:11.538032Z",
    "deleted_at": null,
    "sha1_hash": "ee48dce33a52eae87488f918514b88c30ef9f006",
    "title": "2022-09-08 - Charming Kitten- -Can We Have A Meeting-- Important puzzle pieces of Charming Kitten's cyber espionage operations",
    "authors": "",
    "file_creation_date": "2022-10-02T12:02:50Z",
    "file_modification_date": "2022-10-02T12:02:50Z",
    "file_size": 207159,
    "plain_text": "# Charming Kitten: “Can We Have A Meeting?”\n\n**[blog.certfa.com/posts/charming-kitten-can-we-wave-a-meeting/](https://blog.certfa.com/posts/charming-kitten-can-we-wave-a-meeting/)**\n\n**Important puzzle pieces of Charming Kitten's cyber espionage operations**\n\nCertfa Lab · 2022.9.8\n\nImportant puzzle pieces of Charming Kitten's cyber espionage operations\n\n## Introduction\n\nCharming Kitten (known as APT42, ITG18, UNC788, TA453, PHOSPHORUS, Yellow\nGaruda, also APT35) is an Iranian state-sponsored threat group1 that conducts persistent\ncyber espionage operations to have extensive surveillance of targeted Iranian and foreign\ncitizens, who have strategic intelligence value for the Islamic Revolutionary Guard Corps\n(IRGC).\n\nCharming Kitten actors have targeted individuals, academics, journalists, activists, think\ntankers, institutes, organizations, military and government sectors in the United State,\nEuropean, and Middle Eastern countries since as early as 2014.\n\nAlthough a number of technical reports in recent years shows that they used multiple\nvulnerabilities, semi-advanced and unique tools against different sectors and targets, they\npredominantly use ‘spear phishing’ methods with g(old) ideas in their cyber-espionage\noperations.\n\nThe Charming Kitten hackers use a combination of fictitious personas, impersonation and\nabuse of well-known people’s hacked online accounts in their sophisticated attacks and that\nis how some attempts are successful.\n\nAdditionally, as part of the social engineering scheme, they build trust with potential targets in\nthe initial stage, and sometimes they try to have lengthy conversations with victims that can\nlast for several days, and then trick them into clicking on malicious links at scheduled times.\n“Interview”, “Meeting”, “Discussion”, and “Cooperation” are the most common topics in their\nphishing scenarios.\n\nFurthermore, it is evident that they are always active and by reviewing the activities of this\ngroup, we can say that they regularly have ongoing campaigns throughout the year.\n\n\n-----\n\nBased on our recent investigation at Certfa Lab, the APT42 has been running multiple\nphishing campaigns since late 2021 and some of them are ongoing and still active. We\nbelieve, based on the details from the latest infrastructure indicators used by Charming\nKitten, the similarities between these attacks and related techniques are still important\nknowledge for the public audience and potentially at-risk individuals. As a result, in the\nfollowing report, we briefly described some examples of these attacks for public awareness.\n\n## Operation Alfa: French National Center for Scientific Research\n\nSamuel Valable is one of the researchers at the French National Center for Scientific\nResearch (CNRS)2 who is specialist in imaging and therapeutic strategies for cancers and\nbrain tissues .3\n\n\nOur latest findings showed that the Charming Kitten hacking group impersonated him on\nsocial media platforms, by using his academic and professional background in CNRS, and\ncreated accounts under his name. The Iranian state-backed hackers created a fake LinkedIn\naccount and then targeted researchers and academia in other countries to collect\nintelligence and hack their accounts.4\n\nFigure 1. A screenshot of the fake LinkedIn profile of Sameul Valable, researcher at the\nCNRS, which was created by Charming Kitten\nFigure 1. A screenshot of the fake LinkedIn profile of Sameul Valable, researcher at the CNRS, which was\ncreated by Charming Kitten\n\nFor example, in one of their operations, the hackers initiated a conversation with a professor\nat the one of the universities in the US, via a fake profile on LinkedIn, by impersonating\nSamuel Valable.\n\nFigure 2. Parts of the conversation between the Charming Kitten group and the target via\nLinkedIn Messaging\nFigure 2. Parts of the conversation between the Charming Kitten group and the target via LinkedIn\nMessaging\n\nThe novel and important part of this conversation on LinkedIn Messaging is all sent links by\nCharming Kitten were legitimate and real and they did not sent any phishing links or\nmalicious files to the target. At the end of their conversation with the target, the hackers sent\na link of a video call from Zoom to the target and asked the person to have a video call\nconversation with them.\n\nFigure 3. The video call between the Charming Kitten and target on Zoom. The identity and voice of the\ntarget are redacted by Certfa Lab. [Download](https://blog.certfa.com/posts/charming-kitten-can-we-wave-a-meeting/zoom-call-charming-kitten.mp4)\n\nFigure 3 shows part of the audio/video conversation that Charming Kitten Hackers had with\nthe target on a Zoom call. The attacker used frames of a fake video (from an unknown\nsource) for webcam input on the Zoom call and explained a long story about the research\nbackground of Samuel Valable, and tried to engage with the target. After the hackers got the\n\n\n-----\n\ntarget s interest, they shared a link (hxxps://view[.]googlebook[.]com[.]websitemain[.]live/view?v=xxxxxx) with the target in the middle of the call and claimed this is the\nbook they talked about. While the link was a fake login page for Google and in reality, if the\ntarget enters their username and password in the phishing form, the attacker would capture\nthese details and get access to the target’s Google account.\n\nThe view[.]googlebook[.]com[.]website-main[.]live subdomain is hosted on Hetzner Cloud\nGmbH servers with 65.21.137[.]141 IP address, which was used for other phishing domains\nas well, such as mail-download-attachment[.]xyz and france24[.]live. Additionally, Attackers\nused this server to host the fake/clone website of the Islamic Republic of Iran’s Embassy in\nFrance, according to the historical records of RiskIQ .5\n\nBased on the previous operations of Charming Kitten and from our analysis, we believe this\nserver (65.21.137[.]141) has been used by Charming Kitten to run cyber espionage\noperations against public figures, researchers, academians, organizations, and institutions\nthat are linked to France. We are certain that Charming Kitten used this method to hack\nonline accounts of a few researchers in the last year.\n\nAlthough we cannot accurately calculate the total number of victims that Charming Kitten has\ntargeted by using the fake profile of Samuel Valable, we believe the number to be high.\nThere is also the chance that Charming Kitten has impersonated other members of CNRS.\n\n## Operation Bravo: Middle East Institute\n\n\nPaul Salem6 is president of The Middle East Institute (MEI). This institution is working on\nproviding non-partisan analysis and promoting greater understanding between the people of\nthe US and the Middle East.\n\nWe have discovered that Charming Kitten has impersonated Paul Salem and contacted\nIranian and non-Iranian activists who work on different topics in the Middle East. They invite\nindividuals for collaboration and partnership in the area where the target is a well known\nexpert.\n\nAccording to analyzed samples, it appears the attackers targeted at least one LGBTQ+\nactivist and a media manager with the fake email addresses of paul_sallem@yahoo[.]com\nand paul_salem@outlook[.]com and impersonated Paul Salem.\n\nFigure 4 shows the initial conversation of attackers with an individual and as it is clear that\nthe hackers tried to build trust by impersonating Paul Salem and convincing the target to\nparticipate in a virtual meeting.\n\nFigure 4. The initial conversation of Charming Kitten with the target while impersonating\nPaul Salem\n\n\n-----\n\nFigure 4. The initial conversation of Charming Kitten with the target while impersonating Paul Salem\n\nSame as Operation Alfa, after a series of conversations to build trust with the targets, in this\ncampaign attackers use phishing links through a live-load[.]online domain and send it to the\ntarget to steal the victims’ Google account credentials. It is noteworthy that in some cases,\nCharming Kitten does not send phishing links without proper planning; they calculate when\nthe target is ready to enter credential details to login to an account. For example, they send\nphishing links during an online conversation, or after finishing the conversation.\n\nAt the time of writing this report, this domain is hosted on Hetzner Cloud GmbH servers;\nApart from this domain, view-online[.]live, load-panel[.]online, and panel-archieve[.]live are\nhosted on the same server and they are affiliated with other Charming Kitten servers and\ndomains.\n\nAccording to Paul Salem’s tweet on 5 March 20217 emails of scholars and experts at the MEI\nwere targeted by the foreign-government-backed hackers and we believe these hackers are\nCharming Kitten.\n\n## Operation Charlie: Atlantic Council\n\n\nHagar Hajjar Chemali is an American political commentator and one of the nonresident\nsenior fellows at the Atlantic Council’s GeoEconomics Center. She is an expert on sanctions,\ncounter-terrorist financing policy, and the Middle East .8\n\nAccording to our findings, Charming Kitten impersonated Hagar Hajjar Chemali in at least\ntwo cases and contacted two different targets, where in one case the hackers managed to\ntake control of the Twitter account of a minority rights activist. In these two cases, the Iranian\nstate-backed hackers sent a fake online meeting link and then redirected the target to a\nphishing website.\n\nThe target groups for this impersonation operation were political, media, human rights\ndefenders and women rights activists who are experts in the Middle East.\n\nFigure 5 and 6 are samples of fake pages of legitimate services in this operation where\nCharming Kitten hosted them on the Google Site (sites.google.com) service, which they used\nin their previous campaigns9 10.\n\nFigure 5. A fake page of Skype call on Google Site\nFigure 5. A fake page of Skype call on Google Site\n\nFigure 6. A fake page of Google Meet on Google Site\nFigure 6. A fake page of Google Meet on Google Site\n\nIn this case, where one of the victims was a minority rights activist, the hackers used a short\nlink such as hxxps://beasze[.]live/xyz in the fake pages on Google Site. This domain\n(beasze[ ]live) was previously used in the TA453 (also known as Charming Kitten) PDF\n\n\n-----\n\nsample, which was mentioned in the Proofpoint report in July 2022 .\n\nAlso, in another case related to this hacking campaign, Charming Kitten contacted\njournalists, human rights defenders and women rights activists inside and outside Iran\nthrough a fake Twitter account, Elina Noomen12.\n\nA Twitter page of Elina Noomen as an author and researcher, which was created by\nCharming Kitten\nFigure 7. A Twitter page of Elina Noomen as an author and researcher, which was created by Charming\nKitten\n\nIn at least one case, the hackers contacted a victim with this fake Twitter account and\nclaimed they are working with Hagar Hajjar Chemali and would like to have an online\nmeeting. The hackers used phishing links to steal email account credentials of the victim and\nthey took control of the other online accounts of the victim.\n\nAfter hijacking the victim’s Twitter account, they used the account to start to contact other\nactivists to collect specific information such as the names of Iranian women’s rights activists\nliving in Iran, Iraq and European countries who are seeking and eligible for financial support.\n\nIt is necessary to mention that this kind of data is significant for Iran’s regime and in some\ncases can lead to the arrest and detention of activists on charges of cooperation with foreign\ncountries.\n\n\nOur investigation shows Hagar Hajjar Chemali is not the only member of the Atlantic Council\nwho was impersonated by Iranian state-backed hackers and other members were\nimpersonated in recent months. Also, it is important to mention that a part of this operation\ninfrastructure has an overlap with the Meta report in Q1 202213 about the Iranian statebacked hacker’s cyber operations, in which UNC788 (also known as Charming Kitten)\nhackers targeted people in the Middle East, including Saudi military, dissidents and human\nrights activists from Israel and Iran, politicians in the US, Iran-focused academics, activists\nand journalists around the world.\n\n## Operation Delta: Further Cyber Ops\n\nHussein Ibish is the senior resident scholar at the Arab Gulf States Institute in Washington\n(AGSIW), who tweeted about an impersonation operation of him on 29 June 202214.\nAccording to his tweet, hackers created an email address, hibish@husseinibish[.]org, and\nsent phishing emails to others to steal the credentials of multiple targets.\n\n\nLater on the same day, Claudia Gazzini, who is a senior Libya analyst at the International\nCrisis Group (ICG), published a thread on Twitter15 and said hackers contacted her via an\nemail and set up an interview with her, and the hackers did a long interview with her. After\n\n\n-----\n\nthe interview, the hackers sent a phishing link to Claudia Gazzini as a draft of the interview\nfor her review. Figure 8 is the details of Claudia Gazzini explanations on Twitter.\n\n##### Figure 8. The Twitter thread of Claudia Gazzini about the hacking operation against\nher\nFigure 8. The Twitter thread of Claudia Gazzini about the hacking operation against her\n\nAdditionally, Dareen Khalifa, a senior Syria analyst at ICG, said her colleague and herself\nreceived an email from husseinibish8@gmail[.]com16 and the attackers also contacted them\nvia +1 (951) 638-085417.\n\n\nIt is noteworthy that these people are not the only individuals who are impersonated by\nhackers or targeted by sophisticated attacks. Various documents show many people and\norganizations have recently been attacked by Charming Kitten. Due to the similarity with\nother cyber espionage operations of Charming Kitten in terms of techniques and\ninfrastructures, we can confirm that these attacks were carried out by Charming Kitten.\n\n## Conclusion And Recommendations\n\nAlthough the mentioned examples in these operations are a small pieces of Charming\nKitten’s cyber espionage operation puzzle, we believe these snippets are crucial for the\ngeneral public and at-risk individuals in order to create awareness and to encourage the\npublic and at-risk individuals to act with caution when dealing with unsolicited communication\nonline. We also believe this operation is still active on a large scale and this hacking group\nhas sophisticated phishing attack methods such as impersonation to attack many other\norganizations and individuals.\n\nAccording to our findings, Charming Kitten has increased its interest in cyber espionage\nagainst individuals who are experts in different areas in the Middle East and North Africa,\nparticularly Iran and Syria.\n\nWe strongly recommend using secure multi-factor authentication such as two-factor\nauthentication with security keys18, for online accounts and also enable an Advanced\nProtection Program19 for Google accounts.\n\n\nVetting the legitimacy of a request for an online meeting is vital as we have seen that\nsending an invitation to have a video/audio call has become a permanent method of the\nphishing operation of Charming Kitten to obtain credentials. One of the best ways to check\nthe legitimacy of these invitations is to double-check them through another channel with the\nsender or ask a friend/colleague who might know the person and cross check the legitimacy\nof the meeting request.\n\n\n-----\n\nUpdate (9.9.2022): Based on the latest report of Mandiant about APT42:\nCrooked Charms, Cons, and Compromises” and considering the overlap with\nAPT42 operations, it is necessary to mention that for accurate attribution and\nclassification of attackers’ origin in this report, APT35 has been replaced by\nAPT42.\n\n## IOCs\n\npaul_sallem@yahoo[.]com\npaul_salem@outlook[.]com\nsamuelvalable@gmail[.]com\nhusseinibish8@gmail[.]com\nhibish@husseinibish[.]org\n41002e8ed24836d8a99157c12eba69271fae8511\n65.21.137[.]137\n65.21.137[.]139\n65.21.137[.]141\n85.10.193[.]10\n88.80.148[.]161\n88.80.148[.]162\n88.80.148[.]188\n88.80.148[.]189\n144.76.115[.]26\n144.76.115[.]28\n144.76.115[.]29\n144.76.115[.]59\n168.119.47[.]242\napp-online[.]live\nicloud[.]app-online[.]live\nitunes[.]app-online[.]live\nbasepage[.]xyz\nbeape[.]live\nbeasze[.]live\nlogin[.]beasze[.]live\napi[.]beasze[.]live\nbeasze[.]online\nadmin[.]beasze[.]online\napi[.]beasze[.]online\nremote[.]beasze[.]online\ntest[.]beasze[.]online\nbnt2[.]live\n\n\n-----\n\nbtoltf[.]store\ncheckout-panel[.]live\napi[.]checkout-panel[.]live\nlogin[.]checkout-panel[.]live\nsecure[.]checkout-panel[.]live\nstaging[.]checkout-panel[.]live\nvpn[.]checkout-panel[.]live\ncheck-panel-account[.]icu\ndownload[.]check-panel-account[.]icu\ngo[.]check-panel-account[.]icu\nwebdav[.]check-panel-account[.]icu\nblog[.]check-reload-page[.]live\ncheck-reload-page[.]live\nconfluence[.]check-reload-page[.]live\ncover-home-page[.]xyz\ncover-home-panel[.]xyz\ndirect-view-panel[.]xyz\nfrance24[.]live\nfree-guy[.]xyz\nfront-cover-panel[.]xyz\ngalil-merkazi[.]co\nhome-check-direct[.]icu\nhome-reload-page[.]xyz\nict-amar[.]org\njoin-room[.]online\nlive-load[.]online\nload-online-app[.]live\nload-panel[.]online\nmail-download-attachment[.]xyz\nblog[.]mail-download-attachment[.]xyz\nmaill-support[.]com\nmailupdate[.]info\nmsnpayee[.]com\nmsn-service[.]co\nmsn-services[.]center\nnc5[.]live\nnco2[.]live\nonline-dashboard[.]live\nonline-live[.]top\npage-home-reload[.]xyz\npanel-archieve[.]live\npanel-check[.]online\n\n\n-----\n\npanel-review-check[.]live\npanel-review-home[.]xyz\npingview-home-panel[.]icu\ndev[.]pingview-home-panel[.]icu\nmysql10[.]pingview-home-panel[.]icu\nservice[.]pingview-home-panel[.]icu\nstage[.]pingview-home-panel[.]icu\nwebdisk[.]pingview-home-panel[.]icu\nstudent-rank-number[.]icu\nview-check[.]online\nview-direct-panel[.]icu\nview-direct-panel[.]live\nview-home-panel[.]xyz\napi[.]view-home-panel[.]xyz\nblog[.]view-home-panel[.]xyz\njenkins[.]view-home-panel[.]xyz\nview-online[.]live\nweb-link[.]live\nwebsite-main[.]live\naccount[.]security[.]google[.]com[.]website-main[.]live\nview[.]googlebook[.]com[.]website-main[.]live\nwatch-video[.]youtube[.]com[.]website-main[.]live\n\n## Footnotes:\n\n[1. Mitre.org. “Magic Hound”. Accessed September 5, 2022. https://s.certfa.com/mG0059](https://s.certfa.com/mG0059)\n\n↩︎\n\n2. CNRS.fr. “Samuel Valable, CNRS researcher”. Accessed September 1, 2022.\n\n[https://s.certfa.com/cNrsFr](https://s.certfa.com/cNrsFr) ↩︎\n\n3. Cyceron.fr. “A new article from the unit in collaboration with colleagues from the\n\nBurdenko Institute has just been published in Clinical Nuclear Medicine”. Accessed\n[September 2, 2022. https://s.certfa.com/istctF](https://s.certfa.com/istctF) ↩︎\n\n4. LinkedIn.com. “Samuel Valable”. Accessed September 2022.\n\nhxxps://www.linkedin[.]com/in/samuel-valable-70b36b1a9/ ↩︎\n\n5. RiskIQ.com. Accessed August 29, 2022. [https://s.certfa.com/Rcs65t](https://s.certfa.com/Rcs65t) ↩︎\n\n\n-----\n\n6. MEI.edu. Paul Salem, President . Accessed September 4, 2022.\n\n[https://s.certfa.com/MeiEdu](https://s.certfa.com/MeiEdu) ↩︎\n\n7. Twitter.com. Accessed August 30, 2022. [https://s.certfa.com/pStc61](https://s.certfa.com/pStc61) ↩︎\n\n8. AtlanticCouncil.org. “Hagar Hajjar Chemali”. Accessed September 1, 2022.\n\n[https://s.certfa.com/aCEhhc](https://s.certfa.com/aCEhhc) ↩︎\n\n9. Certfa.com. “Fake Interview: The New Activity of Charming Kitten”.\n\n[https://s.certfa.com/bCfick](https://s.certfa.com/bCfick) ↩︎\n\n10. Certfa.com. “Charming Kitten’s Christmas Gift”. [https://s.certfa.com/ckCGcb](https://s.certfa.com/ckCGcb) ↩︎\n\n11. Proofpoint.com. “Above the Fold and in Your Inbox: Tracing State-Aligned Activity\n\nTargeting Journalists, Media”. Accessed September 1, 2022.\n[https://s.certfa.com/PpAfiT](https://s.certfa.com/PpAfiT) ↩︎\n\n12. User id 1504372203969814530 ↩︎\n\n13. FB.com. “Adversarial Threat Reports”. Accessed September 3, 2022.\n\n[https://s.certfa.com/MQatrq](https://s.certfa.com/MQatrq) ↩︎\n\n[14. Twitter.com. Accessed September 1, 2022. https://s.certfa.com/tIs618](https://s.certfa.com/tIs618) ↩︎\n\n[15. Twitter.com. Accessed September 1, 2022. https://s.certfa.com/cG1077](https://s.certfa.com/cG1077) ↩︎\n\n[16. Twitter.com. Accessed September 1, 2022. https://s.certfa.com/dK2150](https://s.certfa.com/dK2150) ↩︎\n\n[17. Twitter.com. Accessed September 1, 2022. https://s.certfa.com/dK0426](https://s.certfa.com/dK0426) ↩︎\n\n[18. Yubico.com. Accessed September 5, 2022. https://s.certfa.com/y22Co0](https://s.certfa.com/y22Co0) ↩︎\n\n19. Google Advanced Protection Programme. Accessed September 5, 2022.\n\n[https://s.certfa.com/lGapro](https://s.certfa.com/lGapro) ↩︎\n\n20. Mandiant.com. “APT42: Crooked Charms, Cons, and Compromises”, Accessed\n\n[September 9, 2022. https://s.certfa.com/cHcC42](https://s.certfa.com/cHcC42) ↩︎\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-08 - Charming Kitten- -Can We Have A Meeting-- Important puzzle pieces of Charming Kitten's cyber espionage operations.pdf"
    ],
    "report_names": [
        "2022-09-08 - Charming Kitten- -Can We Have A Meeting-- Important puzzle pieces of Charming Kitten's cyber espionage operations.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "82f54603-89e0-4f5a-8df9-eae0c3a90d70",
            "created_at": "2022-10-25T16:07:23.745406Z",
            "updated_at": "2025-03-27T02:02:09.958406Z",
            "deleted_at": null,
            "main_name": "ITG18",
            "aliases": [],
            "source_name": "ETDA:ITG18",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d0e8337e-16a7-48f2-90cf-8fd09a7198d1",
            "created_at": "2023-03-04T02:01:54.091301Z",
            "updated_at": "2025-03-27T02:00:03.119447Z",
            "deleted_at": null,
            "main_name": "APT42",
            "aliases": [
                "UNC788",
                "CALANQUE"
            ],
            "source_name": "MISPGALAXY:APT42",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae26d287-8ba7-447e-9391-cf13c02d7481",
            "created_at": "2023-03-04T02:01:54.0962Z",
            "updated_at": "2025-03-27T02:00:03.120665Z",
            "deleted_at": null,
            "main_name": "TA453",
            "aliases": [],
            "source_name": "MISPGALAXY:TA453",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47fa514e-15a8-4adb-a782-e2ffb12944d8",
            "created_at": "2024-04-24T02:00:49.644637Z",
            "updated_at": "2025-03-27T02:00:55.560836Z",
            "deleted_at": null,
            "main_name": "UNC788",
            "aliases": [
                "UNC788"
            ],
            "source_name": "MITRE:UNC788",
            "tools": [
                "HilalRAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536019,
    "ts_updated_at": 1743041771,
    "ts_creation_date": 1664712170,
    "ts_modification_date": 1664712170,
    "files": {
        "pdf": "https://archive.orkl.eu/ee48dce33a52eae87488f918514b88c30ef9f006.pdf",
        "text": "https://archive.orkl.eu/ee48dce33a52eae87488f918514b88c30ef9f006.txt",
        "img": "https://archive.orkl.eu/ee48dce33a52eae87488f918514b88c30ef9f006.jpg"
    }
}