{
    "id": "80769bf3-ff65-469c-95fe-29faf1391036",
    "created_at": "2023-01-12T15:07:04.808503Z",
    "updated_at": "2025-03-27T02:05:48.659628Z",
    "deleted_at": null,
    "sha1_hash": "f02692dea716ee6a85a087fc7887a3c3fab3bbe2",
    "title": "2016-07-21 - Phishing Attacks Employ Old but Effective Password Stealer",
    "authors": "",
    "file_creation_date": "2015-07-31T16:53:40Z",
    "file_modification_date": "2015-08-12T11:17:51Z",
    "file_size": 1145038,
    "plain_text": "# Industrial Control Systems Assessments FY 2014 Overview and Analysis\n\n## Industrial Control Systems Cyber Emergency Response Team\n\n\n-----\n\n#### CONTENTS\n\n1. INTRODUCTION .............................................................................................................................. 3\n1.1 Purpose and Scope ................................................................................................................... 3\n1.2 Background .............................................................................................................................. 4\n1.3 ICS-CERT’s Assessment Program .......................................................................................... 5\n\n2. ICS-CERT ONSITE ASSESSMENTS: OVERVIEW ....................................................................... 6\n2.1 ICS-CERT Assessment Types ................................................................................................. 6\n2.2 Cyber Security Evaluation Tool Assessments ......................................................................... 7\n2.3 Design Architecture Review .................................................................................................... 8\n2.4 Network Architecture Validation and Verification .................................................................. 9\n\n3. FY 2014 ASSESSMENT PROGRAM ACTIVITY & FINDINGS ................................................. 10\n3.1 Recommended Mitigation Strategies and Best Practices ....................................................... 14\n3.2 Systems and Communications Protection .............................................................................. 14\n3.3 Access Control—Information Flow Enforcement ................................................................. 15\n3.4 Access Control—Remote Access .......................................................................................... 16\n3.5 Access Control—Least Privilege ........................................................................................... 17\n3.6 Physical and Environmental Protection ................................................................................. 19\n\n4. CONCLUSION ................................................................................................................................ 21\n\n#### FIGURES\n\nFigure 1. FY 2014 CSET Assessments by State. .......................................................................................... 7\n\nFigure 2. CSET Assessment High-Level Process. ........................................................................................ 8\n\nFigure 3. FY 2014 DAR and NAVV Assessments by State. ........................................................................ 9\n\nFigure 4. FY 2014 Total Assessments by State. ......................................................................................... 10\n\nFigure 5. Number of FY 2014 DAR and NAVV Assessments Conducted by CI Sector. .......................... 11\n\nFigure 6. Identified Weaknesses by Security Control Family Sub-Category ............................................. 12\n\n#### TABLES\n\nTable 1. NIST 800-53 Security Control Families. ...................................................................................... 11\n\nTable 2. FY 2014 Common Vulnerabilities and Associated Risk. ............................................................. 13\n\n\n-----\n\n#### 1. INTRODUCTION\n\n##### 1.1 Purpose and Scope\n\nThis report provides an overview and summary analysis of on-site assessments conducted by\nthe Industrial Control Systems Cyber Emergency Response Team (ICS-CERT) in Fiscal Year\n2014.\n\nICS-CERT is a component of the National Cybersecurity and Communications Integration\nCenter (NCCIC), a division with the Department of Homeland Security’s (DHS) Office of\nCybersecurity and Communications (CS&C).\n\nICS-CERT’s mission is to reduce risk to the Nation’s critical infrastructure by\n**_strengthening control systems security and resilience through public-private partnerships._**\n\nAs a core part of its mission, ICS-CERT offers a range of cybersecurity assessment products\nand services at no cost to critical infrastructure owners and operators. Through a comprehensive\nvoluntary public-private partnership, ICS-CERT works with critical infrastructure owners and\noperators, industrial control systems vendors, integrators, Sector-Specific Agencies, other\nFederal departments and agencies, State, Local, Tribal, Territorial (SLTT) governments,\ninternational partners, and others to assess various aspects of critical infrastructure pertinent to\nthe control systems risk environment. Cybersecurity assessments help DHS and public and\nprivate sector stakeholders to understand ICS risks and implement policies, standards, and\nactions to mitigate that risk. This report contains the following core elements:\n\n- An overview of ICS-CERT’s Assessment Program, including a description of the assessment\nproducts and services ICS-CERT provides.\n\n- Quantitative and qualitative summaries of assessment types, geographic location, and critical\ninfrastructure sectors assessed in FY 2014.\n\n- Assessment findings for FY 2014, including common ICS vulnerabilities and cybersecurity\nweaknesses.\n\n- Guidance to assist critical infrastructure owners and operators in reducing cyber risk and\nenhancing industrial control systems security.\n\n- Information for stakeholders interested in requesting an assessment and learning more about\nICS-CERT and its programs.\n\n\n-----\n\n#### 1.2 Background\n\nDHS established the Control Systems Security Program (CSSP) in 2003 to help secure the\nNation’s critical infrastructure against cybersecurity threats to industrial control systems. In\n2012, ICS-CERT replaced the CSSP as part of a functional realignment of CS&C. ICS-CERT\nworks through voluntary partnerships with a broad range of government, private-sector, and\nother stakeholders to provide a range of products, services, and capabilities that improve national\ncapacity to detect, analyze, and mitigate cybersecurity threats and vulnerabilities to industrial\ncontrol systems and to better respond to cybersecurity incidents.\n\nThe United States depends on critical infrastructure (CI)[1] to support national defense, public\nhealth and safety, economic vitality, and overarching societal well-being. Disruptions or\nsignificant damage to CI could result in potentially catastrophic and cascading consequences to\nthe Nation.\n\nAlthough CI sectors differ greatly, many share a common characteristic: a dependence on\nICS for process automation and safety. Common ICS examples include Supervisory Control and\nData Acquisition (SCADA) systems, Distributed Control Systems (DCS), and Process Control\nSystems (PCS). These systems control, monitor, and manage vital functions that support critical\ninfrastructure, such as subway systems, dams, water treatment facilities, energy pipelines,\nchemical manufacturing plants, nuclear power plants, electric power generators, and\ntelecommunications networks.\n\nTraditionally, most control systems were purpose-built, stand-alone systems. Over time,\nhowever, the convergence of physical and cyber business processes and systems led to the\nintegration of control systems networks with corporate enterprise networks as well as wireless,\nmobile, and cloud-based applications that support remote access and other capabilities. While\nimproving efficiency and functionality, this integration also creates the potential for malicious\ncyber exploitation of what were traditionally stand-alone proprietary systems.\n\nA successful cyber-attack on a control system could result in significant physical damage,\nloss of life, and cascading effects that could disrupt or destroy critical infrastructure at a local,\nregional, and even national level. In addition, significant cyberattacks could also undermine\npublic confidence in the safety, security, and reliability of critical infrastructure.\n\n1 Critical infrastructure is defined as “… systems and assets, whether physical or virtual, so vital to the United States that the incapacity or\ndestruction of such systems and assets would have a debilitating impact on security, national economic security, national public health or safety,\nor any combination of those matters.” Presidential Policy Directive-21: Critical Infrastructure Security and Resilience identifies 16 critical\n[infrastructure sectors: https://www.whitehouse.gov/the-press-office/2013/02/12/presidential-policy-directive-critical-infrastructure-security-and-](https://www.whitehouse.gov/the-press-office/2013/02/12/presidential-policy-directive-critical-infrastructure-security-and-resil)\n[resil](https://www.whitehouse.gov/the-press-office/2013/02/12/presidential-policy-directive-critical-infrastructure-security-and-resil)\n\n\n-----\n\n##### 1.3 ICS-CERT’s Assessment Program\n\nThe first step in protecting industrial control systems from harm is to understand the\ncybersecurity threats, vulnerabilities, and overarching cyber risk that critical infrastructure\nstakeholders face. DHS formally developed its control systems assessment program in 2009 to\nhelp CI asset owners and operators identify potential weaknesses in their ICS networks and to\nprovide guidance for hardening those systems against cyber threats. ICS-CERT works with CI\npartners to review, verify, and provide recommendations for enhancing the protective and\ndetective controls, policies, and procedural elements of their cybersecurity framework. ICSCERT offers cybersecurity assessments of industrial control systems for companies, entities, and\nasset owner-operators across all 16 critical infrastructure sectors.\n\nICS-CERT assessments help critical infrastructure owners and operators do the following:\n\n- Identify potential weaknesses or gaps within their ICS network.\n\n- Understand cybersecurity threats and vulnerabilities.\n\n- Establish a baseline security posture.\n\n- Pursue risk mitigation options, as appropriate.\n\n\n**Requesting a Cybersecurity Assessment**\nICS-CERT assessments are available at no cost to critical infrastructure asset owners and operators.\nFollowing completion of DAR and NAVV assessments, ICS-CERT compiles an in-depth report for\nthe asset owner, including analysis of key discoveries and practical mitigation options for enhancing\nICS cyber security.\nInformation shared with ICS-CERT can be protected by DHS as Protected Critical Infrastructure\nInformation (PCII).\nTo schedule an assessment, please contact ICS-CERT at [icsassessments@hq.dhs.gov.](mailto:icsassessments@hq.dhs.gov)\nTo learn more about ICS-CERT and its programs, go to: [https://ics-cert.us-cert.gov/](https://ics-cert.us-cert.gov/)\n\n\n-----\n\n#### 2. ICS-CERT ONSITE ASSESSMENTS: OVERVIEW\n\nICS-CERT offers both self-assessment and facilitated onsite assessment products and\nservices at no cost to CI owners and operators. ICS-CERT provides three primary assessment\nservices:\n\n- Cybersecurity Evaluation using the Cyber Security Evaluation Tool (CSET®).\n\n- Design Architecture Review (DAR).\n\n- Network Architecture Validation and Verification (NAVV).\n\nICS-CERT performs onsite assessments at the request of critical infrastructure asset owners\nand other entities. ICS-CERT tailors service offerings to the needs, size, and sophistication of\nasset owners. The types of organizations for which ICS-CERT conducts assessments vary\ngreatly, ranging from small entities that have never completed an evaluation and review of their\ncontrol system operations (from a cybersecurity perspective) to larger entities subject to strong\nregulation. ICS-CERT aligns its service offerings to asset owner requirements (e.g., level of\ndetail and depth of evaluation the asset owner requests) as well as factors such as the risk profile\nof the organization, the current threat landscape, and known adversarial activity against specific\nentities or sectors.\n\n##### 2.1 ICS-CERT Assessment Types\n\nICS-CERT uses the National Institute of Standards and Technology’s Recommended Security\n_Controls for Federal Information Systems (NIST 800-53) as a structured method to group and_\nanalyze vulnerabilities discovered during assessments. The NIST 800-53 control family\nmappings provide a consistent and repeatable methodology for collecting and correlating data to\nanalyze and trend key discoveries at a holistic level. Data collected during these assessments is\nused for reporting and trending, and helps ICS-CERT to continually refine its assessment\nservices. Appendix A, “NIST 800-53 Security Control Family Descriptions” lists NIST 800-53\ncontrol categories.\n\nNIST Special Publication 800-82, Guide to Industrial Control Systems (ICS) Security,[2]\nimplements an industrial control systems overlay to NIST 800-53, tailoring security guidance to\nthe unique operational and system characteristics of industrial control systems. While NIST 80082 applies generally to all critical infrastructure sector control systems, ICS-CERT can work\nwith sector stakeholders to provide additional tailoring to unique aspects of the individual\nsectors, as necessary.\n\n2 Special publication 800-82, Revision 2 (Draft) Guide to Industrial Control Systems (ICS) Security is a document revision out\nfor public comment at the time of this report, however, the guidance is being actively utilized and evaluated by the ICS-CERT\nSite Assessment team.\n\n\n-----\n\n##### 2.2 Cyber Security Evaluation Tool Assessments\n\nICS-CERT developed and maintains CSET, a software tool used to conduct cybersecurity\nassessments. DHS developed CSET to provide a snapshot of an organization’s cybersecurity\nposture. CSET maps evaluation outputs to cybersecurity standards and best practices[3]. In FY\n2014, ICS-CERT conducted 48 facilitated CSET assessments in partnership with various critical\ninfrastructure stakeholders, as shown in Figure 1.\n\nFigure 1. FY 2014 CSET Assessments by State.\n\nUsing CSET software, ICS-CERT provides on-site facilitated cybersecurity assessments as\nthe introductory assessment within ICS-CERT’s portfolio, but they are not a prerequisite for\nmore in-depth assessments. CSET assessments typically take one day to complete (per control\nsystem architecture). While CSET is also available to asset owners as a downloadable selfassessment tool that can be used without the assistance of ICS-CERT, the onsite facilitated\nassessment provides a learning opportunity for asset owners to understand how to most\neffectively use the tool on a repeatable and continuous basis.\n\nFigure 2 shows the high-level process that CSET assessments follow. The asset owner works\nwith the ICS-CERT assessment team to conduct a discovery-oriented evaluation of the entity’s\nunderlying control processes, procedures, policies, methodologies, and protective and detective\nsecurity controls. These compose the cybersecurity foundation for ensuring the availability and\nintegrity of the control process.\n\n3For example, NIST 800 SP82, NIST 800 SP53, Chemical Facility Anti-Terrorism Standards, Nuclear Regulatory Commission\nand the Critical Infrastructure Protection Subcommittee.\n\n\n-----\n\nFigure 2. CSET Assessment High-Level Process.\n\n##### 2.3 Design Architecture Review\n\nA Design Architecture Review (DAR) entails a deep-dive assessment and analysis of the\noperational process, focusing on the underlying ICS network architecture, integration of\nInformation Technology (IT) and Operational Technology (OT) teams, vendor support,\nmonitoring, cyber security controls, and a review of all internal and external connections utilized\nwithin the control systems environment. The DAR focuses heavily on three key areas:\n\n- ICS Network Architecture.\n\n- Asset Inventory.\n\n- Protective and Detective Security controls.\n\nThis type of assessment generally takes two days to complete (per control system\narchitecture). ICS-CERT can conduct DARs independently of or in conjunction with CSET\nassessments. A DAR includes a comprehensive evaluation and discovery process, focusing on\ndefense-in-depth strategies associated with an asset owner’s specific control systems network. A\nDAR provides the asset owner with a thorough evaluation of system interdependencies,\nvulnerabilities, and mitigation options. It examines information related to key ICS external\nconnections and includes an in-depth review of control systems design documents, drawings, and\narchitectures.\n\n\n**DAR and NAVV Evaluation Benchmarks**\nICS-CERT uses the National Institute of Standards and Technology’s Recommended Security\n_Controls for Federal Information Systems (NIST 800-53) as a structured method to group and analyze_\nvulnerabilities found during DAR and NAVV assessments.\nThe NIST 800-53 control family mappings provide a consistent and repeatable methodology for\ncollecting and correlating data to analyze and trend key discoveries at a holistic level. Data collected\nduring these assessments is used for reporting and trending, and helps ICS-CERT to continually refine\nits assessment services.\n\n\n-----\n\n##### 2.4 Network Architecture Validation and Verification\nThe Network Architecture Validation and Verification (NAVV) assessment entails the\nanalysis of network traffic (passively captured) occurring within the ICS network. Using a\ncombination of both open-source and commercially available tools, ICS-CERT is able to\nstrategically visualize and present the network traffic and device-to-device communications\noccurring within various ICS network segments.\n\nThe tools ICS-CERT utilizes also include relevant threat data and indicators, for which\ncollected network traffic can be reviewed and verified. NAVV assessments enable asset owners\nto do the following:\n\n- Verify the accuracy of ICS network diagrams.\n\n- Identify potentially rogue/misconfigured devices or malicious data communications.\n\n- Analyze data flows to ensure that boundary protection devices work as designed.\n\n- Identify opportunities or areas to improve zoning and perimeter protections.\n\n- Baseline the ICS network (including a protocol hierarchy and organization of network\ntraffic).\n\n- Gain practical knowledge of how to passively monitor and verify the communications\noccurring within their ICS networks.\nThe NAVV provides organizations with an accurate and comprehensive view of network\ncommunication occurring within the ICS network infrastructure, in addition to those\ncommunications sourced from or destined to ICS network segments. ICS-CERT typically\nprovides NAVV reviews as an extension to DARs, although this service is also offered\nindependently. In FY 2014, ICS-CERT conducted 56 DAR and NAVV assessments, as shown in\nFigure 3.\n\nFigure 3. FY 2014 DAR and NAVV Assessments by State.\n\n\n-----\n\n#### 3. FY 2014 ASSESSMENT PROGRAM ACTIVITY & FINDINGS\n\nAt the request of its partners, ICS-CERT performed a total of 104 assessments in FY 2014, as\nshown in Figure 4. ICS-CERT’s stakeholders drive the demand for cybersecurity assessments.\n\nFigure 4. FY 2014 Total Assessments by State.\n\nICS-CERT’s partners participate in ICS cybersecurity assessments on a voluntary basis, and\nstakeholder requests—along with factors such as sector risk profile, specific threat information,\nthe dependence of specific critical infrastructure sectors on control systems, etc.—focus ICSCERT’s assessment activity. For example, in FY14, ICS-CERT and the Federal Energy\nRegulatory Commission’s (FERC) Office of Energy Infrastructure Security (OEIS)[4] introduced a\nnew technical assessment service offering. This offering provided select Energy Sector asset\nowners and operators with proactive and customized cyber security assessment services based\nupon their specific interest and areas of focus. As part of that engagement, various Energy Sector\nentities requested multiple assessment services, resulting in a comparatively high number of\nassessments conducted for that sector in 2014. The number of assessments in any given sector\nwill fluctuate from year to year, based on the current threat landscape and other factors. Figure 5,\non the next page, provides a percentage breakout of FY 2014 DAR and NAVV assessments by\ncritical infrastructure sector.\n\n4 FERC OEIS is non-regulatory and its mission does not include compliance or enforcement actions.\n\n\n-----\n\nFigure 5. Number of FY 2014 DAR and NAVV Assessments Conducted by CI Sector.\n\nDAR and NAVV assessments form the basis for identifying common vulnerabilities as they\noffer the most comprehensive evaluation of an organization’s cybersecurity posture. In addition,\nICS-CERT does not collect or retain data from CSET assessments (asset owners alone retain this\ndata). DAR and NAVV assessments use NIST 800-53 security control families (see Appendix A,\n“NIST 800-53 Security Control Family Descriptions”) as the evaluation benchmark. Table 1 lists\nthe top-level NIST 800-53 Security Control Families; each control family also contains subcategories.[5]\n\nTable 1. NIST 800-53 Security Control Families.\n\n**ID**\n\n**ID** Security Control Family **ID** Security Control Family\n\n**AT** Awareness and Training **PE** Physical and Environmental Protection\n\n**CA** Security Assessment and Authorization **PM** Program Management\n\n**CP** Contingency Planning **RA** Risk Assessment\n\n**IR** Incident Response **SC** System and Communications Protection\n\n5 Additional information on NIST 800-53 Security Control Families and sub-categories can be found at:\n\n[http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf](http://nvlpubs.nist.gov/nistpubs/SpecialPublications/NIST.SP.800-53r4.pdf)\n\n|ID|Col2|Col3|Col4|\n|---|---|---|---|\n|ID|Security Control Family|ID|Security Control Family|\n|||||\n|AT|Awareness and Training|PE|Physical and Environmental Protection|\n|||||\n|CA|Security Assessment and Authorization|PM|Program Management|\n|||||\n|CP|Contingency Planning|RA|Risk Assessment|\n|||||\n|IR|Incident Response|SC|System and Communications Protection|\n|||||\n\n\n-----\n\nIn FY 2014, ICS-CERT conducted 56 DAR and NAVV assessments (35 DARs and 21\nNAVVs) in multiple critical infrastructure sectors. While ICS-CERT’s assessments identified\nweaknesses across all control families, Table 2 shows that six vulnerabilities were most\nprevalent, representing approximately 28% of the total vulnerabilities discovered across assessed\ncritical infrastructure sectors. Figure 6 shows the distribution of discovered vulnerabilities,\nmapped to sub-categories within NIST 800-53 Security Control Families.\n\nFigure 6. Identified Weaknesses by Security Control Family Sub-Category\n\nICS-CERT assessments most frequently found Boundary Protection, Information Flow\nEnforcement, and Remote Access vulnerabilities. Table 2, below, summarizes the six most\ncommon vulnerabilities by Security Control Family, sub-category weakness, and potential risk.\nSection 4 describes recommended mitigation activities and best practices for each of these\ncommon vulnerabilities.\n\n\n-----\n\nTable 2. FY 2014 Common Vulnerabilities and Associated Risk.\n\n|FY 2014 DAR/NAVV: Common Vulnerabilities|Col2|Col3|\n|---|---|---|\n|NIST 800-53 Security Control Family|Sub- Category Assessment Discovery|Risk|\n|System and Communications Protection (SC)|Boundary Protection|• Without adequate boundary protections for the ICS network, it becomes very difficult to detect potentially malicious or nefarious activity. In addition, the lack of boundary protection provides various vectors for interfacing with devices and systems which directly support the control process. • The scope of threats and general risk to control systems operations increases significantly without logical separation of the ICS network from a traditional enterprise network (or from untrusted systems like the internet).|\n|Access Control (AC)|Information Flow Enforcement|• Without a comprehensive understanding and visibility of network traffic both within the ICS network and traffic sourced and/or destined to/from the ICS network, potential nefarious or malicious communications will likely go unnoticed, until an incident occurs. • Adversaries establish unauthorized or malicious data communications through the use of available ports, services, and communications channels (conduits). It is critical for asset owners to consider detection and monitoring capabilities for activity occurring within the ICS network in addition to enforcing robust user authentication protocols, strong password protection on ICS devices, and oversight for restricting the usage of non-dedicated mobile devices for interfacing with the ICS (e.g., laptops utilized on corporate or internet-accessible network segments).|\n|Access Control (AC)|Remote Access|• Remote access is a common attack vector for interfacing with control systems. Weak remote access security controls introduce many avenues for interfacing with critical components and control system devices – possibly undetected by an organization. • Attack vectors can include internet facing devices, third party vendors or contractors whom have a direct connection to the ICS, weak virtual private network (VPN) configurations, the use of personal computing devices, and the exploitation of vulnerable Operating System services and configurations.|\n|Access Control (AC)|Least Privilege|• An attacker or malicious insider can leverage user and computer accounts in trusted domains (or network segments) to potentially interface with the ICS. • Assigning elevated or enhanced privileges to personnel (above and beyond what they may require for their daily job functions) introduces many risks, and provides a means for either intentional (malicious insider/outsider) or unintentional (accidental) consequences. • Personnel utilizing elevated privileges and administrative accounts for daily job functions increases risk, which could ultimately impact operations. Common vulnerabilities associated with allowing unnecessary privileges include the installation of unapproved or untested software, the successful execution of malware or a malicious application on a critical asset, disabling security features and controls (A/V, host-based firewall), or modifying application permissions or configuration settings.|\n|Physical and Environmental Protection (PE)|Physical Access Control|• Direct physical access to control system equipment (by either an outsider or a malicious insider) can allow an attacker easier access to ICS assets allowing direct manipulation (via a human-machine interface (HMI) station), reprogramming, or tampering with field controller equipment.|\n|System and Communications Protection (SC)|Security Function Isolation|• Flat network architectures minimize the complexity required for successful exploitation or unauthorized access to the ICS. • Without appropriate boundary protections, multiple layers of authentication, and security controls, adversaries could utilize accounts and systems within the corporate (or trusted third-party) environments as a vector for downstream access to control system components. • In addition, flat architectures do not provide an inherent means to readily monitor and detect nefarious activity between systems and devices.|\n\n\n-----\n\n##### 3.1 Recommended Mitigation Strategies and Best Practices\n\nAs the threat landscape evolves, and actors continue to develop new tools and techniques to\nfind and exploit vulnerabilities in systems, it is imperative that ICS users implement a secure and\nrobust architecture to support the availability and integrity of process automation and operations.\nThe cyber security risks that organizations face decrease significantly with a strong ICS\narchitectural framework that includes both protective and detective cybersecurity controls,\nimplemented at multiple layers. Similarly, a robust architecture improves the organization’s\ncapability to adequately detect and defend against potential threats and exploits. The common\nvulnerabilities identified in Section 3 represent significant weaknesses that asset owners should\nunderstand and know how to mitigate. To assist critical infrastructure owners and operators, ICSCERT offers the mitigation strategies and best practices described below.\n\n##### 3.2 Systems and Communications Protection\n\nWithout a comprehensive asset inventory of the devices and systems that directly support the\nOT environment, it can be difficult to establish a cyber-boundary and enforce protective and\ndetective measures. To establish a sound defensive boundary and ensure the proper scope of\nsecurity controls required to support operations, asset owners should conduct, document, and\nmaintain a thorough asset inventory. The inventory should include the following:\n\n- All ICS components, including all software and hardware\n\n- Networking and communications system components\n\n- Dependent systems and applications utilized in support of the process automation. These\ninclude, for example, domain controllers, backup servers, logging and auditing platforms,\nand alerting mechanisms.\n\nTo comprehensively incorporate cybersecurity within the OT architecture, asset owners\nshould establish zones of protection around ICS systems. This requires a thorough understanding\nof network communications and system dependencies, based upon the operational requirements\nassociated with the automated process. Understanding the nature of communication flows—\nincluding operational ingress/egress points—and protocol hierarchy helps define the logical\nboundary. It is also imperative to fully understand and define the range of ports and services\nrequired for the systems within the ICS environment, as these delineations are necessary for\nenforcing proper zoning. Without completing this analysis and understanding the required\nintercommunications at the design onset, existing security and segmentation controls (for\nexample, firewalls, virtual local area networks [VLAN], and access-control lists) can quickly\nbecome ineffective, particularly if network paths must be continually opened and modified\nbetween devices and network segments.\n\n\n**Applying Control Systems Specific Standards**\nNIST Special Publication 800-82, Guide to Industrial Control Systems (ICS) Security, implements an\nindustrial control systems overlay to NIST 800-53, tailoring security guidance to the unique operational\nand system characteristics of industrial control systems.\n\nWhile NIST 800-82 applies generally to control systems in all critical infrastructure sectors, ICSCERT can work with sector stakeholders to provide additional tailoring to the unique aspects of\nindividual sectors, as necessary.\n\n\n-----\n\nOnce asset owners identify and verify the scope of required communication flows, the design\nof the infrastructure should support both virtual and logical separation of the ICS network, on\nphysically separate devices from the enterprise/corporate network. Communications to and from\nthe ICS network, and communications sourced from and/or destined to an untrusted network\n(e.g., the enterprise network), should traverse an intermediary demilitarized zone (DMZ) or\nperimeter network. The organization should create a defined perimeter, with specific ingress and\negress points for data flows and “choke points” for enforcing monitoring and protective controls\nfor data flows traversing from one zone to another. For additional information pertaining to\ndesigning ICS architectures, reference NIST 800-82 (Section 5 – Network Architecture).[6]\n\nProper segmentation must also include any safety and protective systems if they are\naccessible via a cyber-mechanism or network-based conduit. These systems are the last line of\ndefense for an industrial process and should be further isolated from the cyber communication\nchannels that govern the ICS (or other systems) using best practice boundary protections and\nisolation.\n\nPerhaps most importantly, people are a key foundational element for enforcing, managing,\nmonitoring, tuning, responding, and continually adapting and validating cyber security controls\nand practices employed throughout the enterprise. The design for automated control systems is\nhighly dependent on the ability of people to architect, tune, monitor, and continually enhance\nprotective and detective cyber security controls. Without this foundational element, even the\nmost robust control systems architectures will not provide the necessary protections on a\ncontinual basis.\n\n##### 3.3 Access Control—Information Flow Enforcement\n\nUnderstanding the communication flows occurring within the ICS network—and conversely\nthose sourced from or destined to the ICS network—is an essential precursor to building a\npowerful detection and monitoring platform for verifying network traffic and ensuring the\nintegrity and availability of the control process.\n\nIf devices do not have an operational need to establish a communications channel, the\narchitecture should support the capability to deny and prevent devices and systems from\ncommunicating via a direct or indirect channel. In addition, asset owners should maintain the\ncapability to log and record traffic for systems attempting to establish a communications channel,\neven if explicitly denied. Asset owners should also baseline intra-network traffic in accordance\nwith the operational nature of the control process. Common examples include the following:\n\n- Verifying and monitoring device-to-device communications.\n\n- Establishing security controls and enhancing visibility into the commands transmitted\nbetween devices (e.g., reads, writes, function codes, acknowledge responses, and exception\nmessages).\n\n- Isolating and enhancing security controls pertaining to devices that can illicit write\ncommands or make modifications to downstream devices.\n\n- Verifying and monitoring for communication requests sourced from field devices attempting\nto “back-channel” into the core of the control network.\n\n[6 NIST 800-82: guide to Industrial Control Systems Security (http://csrc.nist.gov/publications/nistpubs/800-82/SP800-82-](http://csrc.nist.gov/publications/nistpubs/800-82/SP800-82-final.pdf)\n\n[final.pdf](http://csrc.nist.gov/publications/nistpubs/800-82/SP800-82-final.pdf) )\n\n\n-----\n\n##### 3.4 Access Control—Remote Access\n\nThe nature of distributed operations, coupled with an observed reduction in the personnel\ndirectly responsible for maintaining and monitoring process automation, presents a challenge for\nreal-time monitoring, response, and investigative actions, an important part of control system\noperations. As asset owners and operators move away from maintaining personnel physically\nlocated within a control center to a more distributed model for maintaining and operating ICS\narchitectures, this can create challenges. If not architected properly, remote access can elevate\nrisk and become a catalyst for potential unauthorized access or nefarious activity.\n\nRemote access should not sacrifice security for the sake of convenience. An insecure\nimplementation and use of remote access capabilities can completely invalidate even the best\nsecurity architecture. Control systems and their supporting systems must never be directly\naccessible through untrusted networks such as the internet; they should be protected and\nsequestered from untrusted (external) networks and systems.\n\nWhen designing a network architecture that supports remote access, asset owners should\nconsider detective and protective controls and include them as part of the underlying\ninfrastructure. The design should provide an inherent means to do the following:\n\n- Monitor and verify the scope of remote access communications and connectivity\n\n- Monitor communication flows occurring via the remote access channel\n\n- Log authentications (both successful and unsuccessful)\n\n- Enforce protective and detective measures pertaining to failed connectivity attempts or\nnefarious traffic patterns\n\n- Restrict the scope of remote access sessions to only those personnel assigned a responsibility\nfor supporting the ICS and process operations\n\n- Disable split-tunneling when connected via a remote session (effectively routing all traffic\nthrough the VPN or remote access gateway)\n\n- Enforce connectivity from only authorized origination systems\n\n- Implement application layer firewalls, application whitelisting, and endpoint policy\nenforcement for origination systems.\n\nThe architecture supporting remote access should not only account for access required by the\norganization’s internal engineers and operators, but also third-party contractors or vendors, who\nmay be required to remotely assist the organization.\n\nAsset owners should implement multiple defense layers for accessing control system\nnetworks from a remote location. Generally, most organizations require their personnel to utilize\na VPN technology using encryption to interface with corporate systems and applications when\naccessing from a remote location. For control systems, the capability to directly interface with\nsupporting systems and components should not be permissible directly from systems housed on\nthe corporate or enterprise network. Rather, asset owners should only allow access through an\nintermediate system or “jump box” resident within a dedicated Control Systems DMZ.\n\n\n-----\n\nAccess to the intermediate system should require a second layer of authentication, which is\nunique and different from that used to remotely access the corporate environment or corporate\nsystems via VPN. In addition, personnel accessing the control systems network from remote\nlocations should authenticate using an appropriately strong mechanism (multi-factor\nauthentication) from a validated and secured company issued and controlled device (e.g., desktop\nor laptop PC).\n\nThe intermediate system—or “jump box” within the Control Systems DMZ—provides a\ncentralized means to monitor, restrict, and govern remote access into the control systems\nenvironment. This system also provides a capability to adequately limit the boundary of the\ncontrol system perimeter. Rather than virtually extending the boundary to the initiating remote\nsystem, the boundary is now logically restricted to the intermediate system, where the necessary\nscope of applications and protective and detective security controls can be deployed.\n\nFor third party vendors or contractors, the organization must ensure that remote connectivity\nis subject to the same scope of security controls enforced for organizational personnel\nconnectivity via a remote avenue. To the degree possible, security policy should limit the use of\npersistent VPN tunnels, and the organization should have the capability to directly control and\nauthorize specific vendors or contractors to initiate remote sessions. Asset owners should\nmonitor the duration of remote sessions and disable that function once service support is no\nlonger required or is complete.\n\nOnce the architecture is implemented, verification of all remote access methods should be\ncontinuously enforced, to ensure adherence to the organization’s defined policy and their\nsupporting security controls. Asset owners should also test and verify the capability to readily\nbypass remote access controls. As a practical example, the usage of dial-up modems is still a\ncommon vector for remotely interfacing with various field device and systems. Modems are\ntypically overlooked, and are sometimes not considered when performing audits and assessments\nof supporting components utilized as part of the control system infrastructure. If unsecured and\nunmonitored, modems can provide a backdoor for directly interfacing with ICS components,\nmost likely undetected by the organization. Security controls for consideration include restricting\ndial-in capabilities (limiting use to emergency “dial-out”), limiting dial-back capabilities to predefined phone numbers, or enforcing a PIN or passphrase for initial authentication. Asset owners\nshould also review the use of more recent technologies such as wireless Wi-Fi and Bluetooth,\nbased on their potential to tie into enabled devices that result in bridging of networks. This may\nenable attackers to use these secondary communications pathways to connect to ICS devices,\nthus bypassing security controls.\n\n##### 3.5 Access Control—Least Privilege\n\nAsset owners should assign roles and permissions to users of the various systems and\napplications in the automation process based upon the concept of least privilege. Least privilege\nis the practice of limiting access to the minimal level that allows for normal operations. Quite\noften, users are granted permissions beyond what is necessary based upon a person’s assigned\nrole or responsibility.\n\nBefore assigning users’ specific permissions, an organization must formally define the roles\nand responsibilities required to support operational needs. Once user roles and responsibilities\nare defined, asset owners should review the technologies in place to ensure that the necessary\nmappings and restrictions can be enforced, tracked, audited, and verified. Whether this occurs\n\n\n-----\n\nlocally at the application level or centrally within an access-control technology (Active\nDirectory, Identity Access Management platform), the organization must document and verify\nhow it will apply and manage permissions within the scope of its infrastructure and platforms.\n\nThe organization can then map and assign users and operator permissions, based upon their\noperational need. Organizations should not allow the unnecessary use of elevated and\nadministrative permissions for daily job functions, and personnel should utilize an account with\nminimal permissions assigned for normalized operations. If there is a need for use of a privileged\naccount for daily job functions, the organization should harden that system and consider\nadditional defense-in-depth measures to isolate and protect the system.\n\nLogging and monitoring should track user activity and have the capability to provide a record\n(including timestamp) of user activity occurring on a system or within an application. Asset\nowners should log, audit, and review changes made by users, including changes pertaining to\nuser mappings, roles, and privilege assignments. Additional logging and security controls should\nbe enforced for users and groups that provide and assign an administrative or root-level context\nwithin a system or application. Specific to industrial control systems, least privilege and\nmonitoring should include the following:\n\n- Roles, mappings, and privilege assignments of responsibility within SCADA or HMI\napplications.\n\n- An audit record of personnel attempting to use an elevated or administrative account to\nperform daily job functions (even for those personnel who do not require administrative\naccess, but are attempting to elevate privileges).\n\n- When monitoring and controlling an ICS process, it may not always be feasible to enforce an\nautomated lock for display terminals or display boards for idle sessions. For these conditions,\nensure that display terminals within areas of a facility where various personnel may have\naccess present a “read-only” or “view-only” capability, and that a standard user or someone\nwith unapproved access could not interface with a terminal and make unauthorized changes\nor modifications to the process. Asset owners should also enforce appropriate physical\nsecurity controls for these areas (e.g., key card access on the doors to the control center).\n\n- Monitoring for specific changes to roles assigned to users and/or groups.\n\n- Monitoring of personnel or permissions assigned to groups, especially those that provide an\nadministrative or privileged context within a control system application.\n\n- Changes assigned to various areas of responsibility and privilege mappings.\n\n- Monitoring of access attempts, for personnel who are attempting to access a resource or\nprogram function for which they are specifically denied or not assigned privileges.\n\n- If the organization uses domain services—for example, Active Directory—in support of the\nICS applications and systems, this domain should be separate and isolated from the domain\nservices utilized in support of the enterprise or corporate environment. The accounts and\nservices provided by the ICS domain should exist solely to support the ICS and automation\nprocess. It should not have a direct trust relationship with any other domains or third party\nentities.\n\n\n-----\n\n##### 3.6 Physical and Environmental Protection\n\nMany asset owners rely upon physical security controls to safeguard and protect key systems\nutilized in support of the process and automation. If adversaries can exploit a weakness in\nphysical security, this could lead to risks correlating to both cyber and physical consequences,\nincluding the following:\n\n- Physical theft or damage to hardware and data.\n\n- Unauthorized changes to configuration settings and processes within the control and\nautomation environment.\n\n- Disconnection of physical data links or interference of wireless (telemetry) data paths.\n\n- Interception or manipulation (spoofing) of data, which could lead to system unavailability\nand impact the integrity of the control process.\n\n- The practice of operating with Programmable Logic Controllers (PLCs) in “program” mode\nfor the convenience of engineering and maintenance elevates risks associated with an\nunauthorized user modifying the controller’s operating logic, which could compromise the\nintegrity of the automated process.\nAs many control system environments are widely distributed over a large geographic area,\nremote sites and locations may not always be physically manned by personnel at all times. It is\nespecially important to enforce both physical and cyber security controls, including monitoring\nfor these environments. If a physical breach were to occur, this could provide a vector for an\noutsider to gain upstream access back into the core of the control systems infrastructure.\nCommon examples of physical controls to include are as follows:\n\n- A detailed inventory of all hardware and software components utilized in support of\noperations, including detailed information pertaining to device/model type, serial number,\nand firmware version.\n\n- Physical access control measures for governing and restricting access to the facility,\nincluding areas within a facility (e.g., gates, buildings, doors, and rooms).\n   - If utilizing keys, ensure that the physical control of keys is audited and maintained,\nespecially for personnel no longer supporting the organization, or who no longer have a\nneed to access various parts of the facilities.\n   - Ensure that physical keys are marked with “DO NOT COPY” or “DO NOT\nDUPLICATE.”\n\n- Enforce intrusion detection alarms and alerts for all ingress/egress areas within a facility—\nincluding those at the perimeter and within various buildings and rooms (e.g., doors,\nwindows, cabinets, racks, and card readers). Special attention should be given to alternate\nmethods that can be utilized for circumventing traditional security controls for unauthorized\nphysical access to a facility.\n\n- If utilizing cameras for physical monitoring of a facility or site, ensure the following:\n\n   - Default credentials and settings for the cameras are changed and modified.\n   - The cameras are resident on a secured and controlled VLAN or network segment, which\ncannot be directly accessed by unauthorized personnel or systems within the\norganization.\n\n\n-----\n\n− The cameras cannot be used as a vector to gain unauthorized access or provide a\n“back channel” into the enterprise or control systems network infrastructure.\n   - The cameras cannot be remotely accessed or viewed without authentication and logging\nof the connectivity attempts (both successful and unsuccessful).\n   - The cameras provide adequate and clear coverage for the areas they monitor.\n\n- For systems that centrally manage physical access controls (for example, an access control\nsystem that utilizes badge readers), ensure the following:\n   - Restrict physical and virtual access (including enforcing role-based access control) for\nthe centralized application that governs physical access control.\n− This should also include the workstations and systems that are initiating connectivity\nto manage and administer the physical access control system.\n   - Systems housing the centralized application or backend database do not have the\ncapability to establish an outbound session or communications channel to untrusted\nresources or networks (like the internet).\n   - Testing of access control functionality, especially if communications from the centralized\napplication to the card or badge readers is lost. Asset owners should understand whether\nthe system operates based on the last configuration or “denies” access until\ncommunications have been re-established.\n\n- If possible, place PLCs in “run” mode when in operation and remove and secure the key.\n\n\n-----\n\n#### 4. CONCLUSION\n\nThe protection of the Nation’s critical infrastructure is essential for ensuring public\nconfidence and safeguarding the Nation’s safety, prosperity, and well-being. As the threat\nlandscape continues to evolve, control systems and their underlying architecture must be secured\nto withstand cyber-attacks. It is important that organizations conduct both risk and vulnerability\nassessments for the systems that drive the automation and processes that support our Nation’s\ncritical infrastructure.\n\nThe high-level discoveries and mitigation recommendations outlined within this document\nshould not be used as an all-inclusive focus of an assessment; rather, these areas should be\ncarefully reviewed and encompassed within the scope of an organization’s overall cyber security\nframework, design, and review. Addressing the best practices and recommendations in this\nreport can greatly improve a CI asset owner’s overall security posture and heighten awareness of\npotential threats or cyber-attacks targeting their specific operations.\n\n\n**Additional ICS-CERT Resources and Information**\nIn addition to onsite assessment services, ICS-CERT offers a number of free services and\nproducts to help secure control systems. These services and products include training, recommended\npractices, white papers, incident response, and malware analysis.\n\nFor general questions or comments, contact ICS-CERT at [ics-cert@hq.dhs.gov.](mailto:ics-cert@hq.dhs.gov)\nFor information on training or downloading white papers and other useful documents on\n[ICS cybersecurity, visit the web site https://ics-cert.us-cert.gov.](http://www.ics-cert.us-cert.gov/)\n\nTo report an incident or vulnerability, call 1-888-282-0870 or send an email to\n[ics-cert@hq.dhs.gov.](mailto:ics-cert@hq.dhs.gov)\n\n\n-----\n\n### Appendix A\n NIST 800-53 Security Control Family Descriptions\n\nICS-CERT uses the National Institute of Standards and Technology’s (NIST) Recommended\nSecurity Controls for Federal Information Systems (NIST 800-53) to categorize the\nvulnerabilities found during assessments. Using NIST 800-53 provides a consistent and\nrepeatable methodology for collecting and correlating data.\n\nThe NIST 800-53 controls are organized into 18 families; each family contains subcategories related to the general security topic of the family. Subcategories include, for example,\npolicy, oversight, supervision, manual processes, actions by individuals, or automated\nmechanisms implemented by system technologies. Descriptions of the 18 Security Control\nFamilies follow below:\n\n**Access Control (AC) - The process of granting or denying specific requests for obtaining**\nand using information and related information processing services for physical access to areas\nwithin the information system environment.\n\n**Awareness and Training (AT) - Policies and procedures to ensure that all information**\nsystem users are given appropriate security training relative to their usage of the system and\nthose accurate training records are maintained.\n\n**Audit and Accountability (AU) - Independent review and examination of records and**\nactivities to assess the adequacy of system controls, to ensure compliance with established\npolicies and operational procedures, and to recommend necessary changes in controls, policies,\nor procedures.\n\n**Security Assessment and Authorization (CA) - Assurance that the specified controls are**\nimplemented correctly, operating as intended, and producing the desired outcome.\n\n**Contingency Planning (CP) - Policies and procedures designed to maintain or restore**\nbusiness operations, including computer operations, possibly at an alternate location, in the event\nof emergencies, system failures, or disaster.\n\n**Configuration Management (CM) - Policies and procedures for controlling modifications**\nto hardware, firmware, software, and documentation to ensure the information system is\nprotected against improper modifications prior to, during, and after system implementation.\n\n**Identification and Authentication (IA) - The process of verifying the identity of a user,**\nprocess, or device, through the use of specific credentials (e.g., passwords, tokens, biometrics),\nas a prerequisite for granting access to resources in an IT system.\n\n**Incident Response (IR) - Policies and procedures pertaining to incident response training,**\ntesting, handling, monitoring, reporting, and support services.\n\n**Maintenance (MA) - Policies and procedures to manage all maintenance aspects of an**\ninformation system.\n\n**Media Protection (MP) - Policies and procedures to ensure secure handling of media.**\nControls cover access, labeling, storage, transport, sanitization, destruction, and disposal.\n\n\n-----\n\n**Physical and Environmental Protection (PE) - Policies and procedures addressing**\nphysical, transmission, and display access control as well as environmental controls for\nconditioning (e.g., temperature, humidity) and emergency provisions (e.g., shutdown, power,\nlighting, fire protection).\n\n**Planning (PL) - Development and maintenance of a plan to address information system**\nsecurity by performing assessments, specifying and implementing security controls, assigning\nsecurity levels, and responding to incidents.\n\n**Personnel Security (PS) - Policies and procedures for personnel position categorization,**\nscreening, transfer, penalty, and termination; also addresses third-party personnel security.\n\n**Risk Assessment (RA) - The process of identifying risks to operations, assets, or individuals**\nby determining the probability of occurrence, the resulting impact, and additional security\ncontrols that would mitigate this impact.\n\n**System and Services Acquisition (SA) - Allocation of resources for information system**\nsecurity to be maintained throughout the systems life cycle and the development of acquisition\npolicies based on risk assessment results including requirements, design criteria, test procedures,\nand associated documentation.\n\n**System and Communications Protection (SC) - Mechanisms for protecting both system**\nand data transmission components.\n\n**System and Information Integrity (SI) - Policies and procedures to protect information**\nsystems and their data from design flaws and data modification using functionality verification,\ndata integrity checking, intrusion detection, malicious code detection, and security alert and\nadvisory controls.\n\n**Program Management (PM) - Provides security controls at the organizational rather than**\nthe information-system level.\n\n\n-----\n\nDepartment of Homeland Security\n\nOffice of Cybersecurity and Communications\n\nNational Cybersecurity and Communications Integration Center\n\nIndustrial Control System – Cyber Emergency Response Team\n\n[https://ics-cert.us-cert.gov](https://ics-cert.us-cert.gov/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/ICS Vulnerabilities/ICS-CERT - Industrial Control Systems  Assessments - FY 2014.pdf"
    ],
    "report_names": [
        "ICS-CERT - Industrial Control Systems  Assessments - FY 2014.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536024,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1438361620,
    "ts_modification_date": 1439378271,
    "files": {
        "pdf": "https://archive.orkl.eu/f02692dea716ee6a85a087fc7887a3c3fab3bbe2.pdf",
        "text": "https://archive.orkl.eu/f02692dea716ee6a85a087fc7887a3c3fab3bbe2.txt",
        "img": "https://archive.orkl.eu/f02692dea716ee6a85a087fc7887a3c3fab3bbe2.jpg"
    }
}