{
    "id": "80d97a87-275b-4065-982e-b5df32ace9d0",
    "created_at": "2023-04-05T02:09:31.40782Z",
    "updated_at": "2025-03-27T02:16:20.986769Z",
    "deleted_at": null,
    "sha1_hash": "4b666d0a689db35201f6c67988fee0bc790eabc5",
    "title": "2023-03-07 - Using Memory Analysis to Detect EDR-Nullifying Malware",
    "authors": "",
    "file_creation_date": "2023-04-03T08:32:33Z",
    "file_modification_date": "2023-04-03T08:32:33Z",
    "file_size": 1566585,
    "plain_text": "# Using Memory Analysis to Detect EDR-Nullifying Malware\n\n**[volexity.com/blog/2023/03/07/using-memory-analysis-to-detect-edr-nullifying-malware/](https://www.volexity.com/blog/2023/03/07/using-memory-analysis-to-detect-edr-nullifying-malware/)**\n\nMarch 7, 2023\n\nby Paul Rascagneres, Volexity Volcano Team\n\nIn the ever-changing cybersecurity landscape, threat actors are forced to evolve and\ncontinually modify the tactics, techniques, and procedures (TTPs) they employ to launch and\nsustain attacks successfully. They are continually modifying their malware and commandexecution methods to evade detection. The attackers in these cases are attempting to get a\nstep ahead of security software at the most basic level.\n\nHowever, some techniques take a different approach, aiming further up the stack and directly\ntaking on security software. The most brazen methods involve leveraging various tools that\ndirectly terminate or shutdown security software. If successful, this method is effective at\ngiving an attacker free reign on a system. However, it comes at the potential cost of alerting\nusers or administrators that the software unexpectedly stopped reporting or was shut off.\nWhat about a technique that potentially flies a bit more under the radar?\n\n[In November 2022, Trend Micro published a blog post related a Chinese APT threat actor](https://www.trendmicro.com/en_us/research/22/k/hack-the-real-box-apt41-new-subgroup-earth-longzhi.html)\nthey called “Earth Longzhi”, and that Volexity tracks as “SnakeCharmer”. One tool Trend\nMicro described, dubbed “AVBurner”, used a technique to patch process-creation callbacks\nin kernel memory to nullify security software running on a victim system. The end result: the\nsecurity software would appear to be running fine, but in reality, it was neutered and\n\n\n-----\n\nrendered useless. When successful, this approach allows an attacker to carry on their\noperations with little risk of being detected as a result of the security software. While there\nare several documented cases of attackers patching these callbacks, this particular\ntechnique leveraged by SnakeCharmer and others lends itself to specific methods of\ndetection by way of memory analysis.\n\nVolexity conducted research and testing to determine ways this technique of attacking\nendpoint detection and response (EDR) and antivirus (AV) software could reliably be\ndetected through memory analysis. This blog:\n\nExamines the technique used by AVBurner, building upon the Trend Micro blog.\nProvides a refresher on the internal mechanism of the Windows callbacks and how\nAVBurner disables functionality of security products.\nExplains how memory analysis can identify manipulated EDR callbacks, such as those\n[employed by AVBurner, using either via Volatility 3 or](https://github.com/volatilityfoundation/volatility3) [Volexity Volcano.](https://www.volexity.com/products-overview/volcano/)\n\n## Kernel Process Callbacks\n\nIn order to function, both EDR and AV solutions must effectively monitor process creation.\nWhen a process is created, security products can block it from starting or inject a library into\nit to monitor its behavior. To do so, most security products use a driver to register a kernel\n[callback, most commonly using the PsSetCreateProcessNotifyRoutine() API.](https://learn.microsoft.com/en-us/windows-hardware/drivers/ddi/ntddk/nf-ntddk-pssetcreateprocessnotifyroutine)\n\nFigure 1 shows the pseudocode of this function.\n\n_Figure 1. PsSetCreateProcessNotifyRoutine() pseudocode_\n\nAs can be seen, this function’s sole purpose is to execute another function,\nPspSetCreateProcessNotifyRoutine(). This API is not documented by Microsoft, but it can be\nunderstood by examining its disassembly pseudocode.\n\n\n-----\n\n_Figure 2. PspSetCreateProcessNotifyRoutine() pseudocode_\n\nFigure 2 shows the pseudocode of this function when the second argument is true (i.e., when\na callback is to be removed).\n\nLines 19 and 44 of this pseudocode show a loop that increments the v9 variable from\n“0” to “0x40”. This variable is an index for the PspCreateProcessNotifyRoutine This\narray is used as a first argument to the ExDerefenceCallBackBlock() function and\ncontains the callbacks. A maximum of “0x40” (64) callbacks can be defined.\nLines 32 and 34 show two interesting variables:\nPspCreateProcessNotifyRoutineExCount and PspCreateProcessNotifyRoutineCount. If\na callback is removed, one of these variables is decremented. The sum of these two\nvariables is the number of defined callbacks.\n\n\n-----\n\nThe ExCompareExchangeCallBack() API shows a mask ( 0xFFFFFFFF FFFFFFF0 )\nmust be applied to the address stored in the PspCreateProcessNotifyRoutine\n\n[WinDBG can be used to confirm these conclusions. Figure 3 shows the](https://learn.microsoft.com/en-us/windows-hardware/drivers/debugger/debugger-download-tools)\nPspCreateProcessNotifyRoutineExCount and PspCreateProcessNotifyRoutineCount values.\n\n_Figure 3. The count of defined callbacks_\n\nIn this example, there are 13 callbacks defined on this system.\n\nFigure 4 shows the PspCreateProcessNotifyRoutine array (13 callbacks) and the called\nfunctions for the first three callbacks.\n\n_Figure 4. 13 defined callbacks and the definition of the first three_\n\nIn this example, each time a process is created, nt!ViCreateProcessCallback(),\ncng!CngCreateProcessNotifyRoutine(), ksecdd!KsecCreateProcessNotifyRoutine(), and the\n10 others are called.\n\n\n-----\n\nArmed with this knowledge, one can further analyze AVBurner and its approach to tampering\nwith these callbacks.\n\n## AVBurner Kernel Process Callback Bypass\n\n**Name(s)** execute.exe\n\n**Size** 158.0KB (161792 Bytes)\n\n**File Type** Win64 EXE\n\n**MD5** 494cc48a9856cf5b46fb13bcd68c256f\n\n**SHA1** 39727e755b2806fc2ed5204dae4572a14b2d43d1\n\n**SHA256** 4b1b1a1293ccd2c0fd51075de9376ebb55ab64972da785153fcb0a4eb523a5eb\n\nAVBurner is designed to disable callbacks from the kernel space. A userland application\ncannot modify kernel memory, so the malware authors include a vulnerable driver,\nRTCore64.sys, to read and write into this protected memory space. This driver has been\n[previously reported as being used for the same purpose by ransomware groups. The threat](https://www.picussecurity.com/resource/blog/blackbyte-ransomware-bypasses-edr-products-via-rtcore64.sys-abuse#:~:text=sys.-,RTCore64.,graphic%20cards%20on%20the%20system.)\nactor in this case is not a ransomware attacker.\n\nThis technique of using an older, vulnerable driver to load malicious code was famously used\nby Turla for the purposes of loading a malicious rootkit. A public GitHub repository, [KDU,](https://github.com/hfiref0x/KDU)\nowned by hFiref0x, documents a list of drivers that can be abused for this “Bring Your Own\nVulnerable Driver” (BYOVD) technique.\n\nAVBurner follows the same logic outlined in the Kernel Process Callbacks section to identify\nthe callback array and disable specific callbacks. Specifically, it has the following workflow:\n\nCheck the OS version, as this is required for the next step.\nAbuse RTCore64.sys to identify the PspCreateProcessNotifyRoutine array. The\nidentification of this array is based on a byte pattern, which differs according to the OS\nversion (hence the requirement for the previous step).\nAbuse RTCore64.sys to parse the array in order to get the list of currently defined\ncallbacks.\nFor each registered callback address, gets the location of any SYS file in the directory\nC:\\Windows\\ or its subdirectories. If the SYS file is not located in this directory it is\nskipped.\nChecks the metadata of the SYS file to see if the file matches specific criteria. This is to\nidentify whether or not the callback must be removed.\n\n\n-----\n\nIf the callback is identified as one that should be removed, AVBurner abuses\nRTCore64.sys to replace the callback address with “0x00000000`00000000” which\neffectively disables the callback.\n\nThis specific sample of AVBurner targets any drivers with the string “360” in their metadata\ndescription, meaning it was almost certainly configured to prevent security products by Qihoo\n360 from functioning correctly. Figure 5 summarizes AVBurner’s workflow.\n\n_Figure 5. AVBurner workflow_\n\nSince the Qihoo 360 security product cannot be downloaded and installed for free, for the\npurposes of demonstration in this report Volexity patched AVBurner to target the free version\nof [Immunet, which embeds Cisco AMP. Note that the approach employed by AVBurner could](https://www.immunet.com/index)\nbe used to target any security product using the same APIs, and the use of Cisco AMP in\nthis post is simply for illustrative purposes. Some products may have anti-tampering\nmechanisms to prevent or detect this style of attack.\n\nFigure 6 shows the callback array before and after AVBurner execution.\n\n\n-----\n\n_Figure 6. Callback array before AVBurner execution (left) and after (right)_\n\nTwo callbacks are removed from the list and the address is replaced by\n“0x00000000`00000000”. Figure 7 shows the values before the AVBurner execution; as\nexpected, these callbacks are related to AMP.\n\n_Figure 7. Callback before AVBurner execution_\n\nThis post is limited to process creation monitoring, but AVBurner also supports manipulation\nof additional callbacks, such as thread creation and image load callbacks.\n\n## Detecting Disappearing Callbacks with Volatility 3\n\nVolatility 3 natively lists the currently registered callbacks with the windows.callbacks\ncommand. Figure 8 shows the command’s output before and after the execution of\nAVBurner; as expected, the two Cisco AMP callbacks disappear.\n\n\n-----\n\n_Figure 8. Volatility 3 windows.callback output_\n\nTwo approaches can be used to identify the callback anomaly:\n\nGet the count of callbacks (see next section for details on how to do this) and compare\nthe value with the windows.callbacks output.\nMaintain a list of EDR or AV modules that register process creation callbacks, and\ncheck if the driver is loaded but a callback that should be registered is missing.\n\n### Volshell: Getting the Count of Callbacks\n\nVolatility 3 provides a shell that supports symbols to query the kernel objects. The following\ncode shows how to get the values for PspCreateProcessNotifyRoutineExCount and\nPspCreateProcessNotifyRoutineCount (Figure 9). Note that color has been added for\nemphasis.\n\n\n-----\n\n_Figure 9. Highlighted example command-line output showing the number of callbacks that_\n_should exist_\n\nThe offsets of the variables, PspCreateProcessNotifyRoutineExCount and\nPspCreateProcessNotifyRoutineCount, (denoted in purple and gold) match what is shown in\nFigure 9; the sum is 13. However, there are only 11 defined callbacks shown when listing\nthem using windows.callbacks (Figure 10).\n\n_Figure 10. Highlighted Volatility output showing only 11 callbacks are still defined_\n\n### Detecting Tampered EDR Callbacks with Volexity Volcano\n\nAlthough these malicious modifications are possible to detect with Volatility, many analysts\nprefer a more robust, out-of-the-box solution, especially in time-sensitive engagements.\nVolexity Volcano can help assess if systems are trustworthy, even if AV and EDR products\nreport being healthy and fully operational. Figure 11 shows a summary of some of the IOCs\nthat triggered on the AVBurner memory sample. It points out that two kernel modules,\nCiscoAMPCEFWDriver.sys and CiscoAMP.sys, are affected by the malware.\n\n_Figure 11. Volcano IOC summary includes two Disabled AV/EDR Callbacks_\n\n\n-----\n\nIn addition to the IOC summary, Volcano offers more specific details on the artifacts\nthemselves (including the full path on disk to the kernel module) and an explanation of\nexactly what functionality has been disabled. Color-coded labels and associated notes are\nautomatically added to the artifacts to bring these alerts to the analyst’s attention.\n\n_Figure 12. Zooming in on specific details for CiscoSAM.sys_\n\nAnother valuable feature of Volcano that defenders can leverage against the previously\ndescribed BYOVD technique is listing recently unloaded kernel modules. In most cases,\nmalware will not need a vulnerable driver in the long term. It will load the driver, use it, then\nunload it quickly to avoid further detection. For debugging purposes, Windows stores unload\nevents in memory, which Volcano can query. Although the vulnerable driver was referred to\nby its original name, RTCore64.sys, the malware drops it to disk as a.sys. Figure 13 shows\nhow Volcano preserves this activity for forensic purposes and provides an unload timestamp\nfor incorporation into timelines.\n\n\n-----\n\n_Figure 13. Volcano showing details of unloaded Kernel modules_\n\n## Conclusion\n\nThis blog posts describes how process creation callbacks work on Windows, and how\nAVBurner can bypass modern EDR and AV solutions by patching kernel memory. In this\ncase, the malware was only used to disable monitoring process creation, but the same\napproach can be used to disable other callbacks used for events like thread creation and\nimage loading.\n\nHaving detection capabilities related to AVBurner is useful. However, it is even better to have\nrobust techniques for broadly detecting whether or not security products have been\ntampered with in this manner. Callback manipulation can be identified by analyzing the\nmemory of the system, either through automated detections in Volexity Volcano, or through\nuse of Volatility 3 and Volshell.\n\nTo generically identify BYOVD related attacks, Volexity recommends the following:\n\nMonitor for creation of the file RTCore64.sys and the other vulnerable drivers listed in\nthe KDU project, as they are commonly used by threat actors.\n[If possible, consider enforcing the mitigations recommended by Microsoft here.](https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-driver-block-rules)\n\nTo detect the specific malware referenced in this blog post, Volexity recommends the\nfollowing:\n\nUse the [YARA rule available on GitHub to identify instances of AVBurner.](https://github.com/volexity/threat-intel/blob/main/2023/2023-03-07%20AVBurner/yara.yar)\n\n\n-----\n\n_Volexity s Threat Intelligence research, such as the content from this blog, is published to_\n_customers via its_ _[Threat Intelligence service and was covered by in MAR-20230112 and](https://www.volexity.com/services-overview/threat-intelligence/)_\n_original activity related to this threat actor was discussed in TIB-20211124._\n\n_[Volexity's leading memory analysis product, Volexity Volcano, detects the EDR and AV](https://www.volexity.com/products-overview/volcano/)_\n_evasion technique discussed in this post through the “Disabled AV/EDR Callbacks” indicator._\n\n_If you are interested in learning more about these products and services, please do not_\n_hesitate to_ _[contact us.](https://www.volexity.com/company/contact/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-07 - Using Memory Analysis to Detect EDR-Nullifying Malware.pdf"
    ],
    "report_names": [
        "2023-03-07 - Using Memory Analysis to Detect EDR-Nullifying Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b317799-01c0-48fa-aee2-31a738116771",
            "created_at": "2022-11-20T02:02:37.746719Z",
            "updated_at": "2025-03-27T02:02:09.755811Z",
            "deleted_at": null,
            "main_name": "Earth Longzhi",
            "aliases": [
                "Earth Longzhi"
            ],
            "source_name": "ETDA:Earth Longzhi",
            "tools": [
                "Agentemis",
                "BigpipeLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "CroxLoader",
                "MultiPipeLoader",
                "OutLoader",
                "Symatic Loader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d196cb29-a861-4838-b157-a31ac92c6fb1",
            "created_at": "2023-11-04T02:00:07.66699Z",
            "updated_at": "2025-03-27T02:00:03.151446Z",
            "deleted_at": null,
            "main_name": "Earth Longzhi",
            "aliases": [
                "SnakeCharmer"
            ],
            "source_name": "MISPGALAXY:Earth Longzhi",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1680660571,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1680510753,
    "ts_modification_date": 1680510753,
    "files": {
        "pdf": "https://archive.orkl.eu/4b666d0a689db35201f6c67988fee0bc790eabc5.pdf",
        "text": "https://archive.orkl.eu/4b666d0a689db35201f6c67988fee0bc790eabc5.txt",
        "img": "https://archive.orkl.eu/4b666d0a689db35201f6c67988fee0bc790eabc5.jpg"
    }
}