{
    "id": "80f7cd14-3ce4-483e-9ddb-5dcefef3cc71",
    "created_at": "2023-01-12T15:09:21.398064Z",
    "updated_at": "2025-03-27T02:11:15.756828Z",
    "deleted_at": null,
    "sha1_hash": "382826a832959f6c2582ed306fa9acc51160a69e",
    "title": "2010-03-31 - ICS Advisory (ICSA-10-090-01)- Mariposa Botnet",
    "authors": "",
    "file_creation_date": "2022-05-29T01:03:35Z",
    "file_modification_date": "2022-05-29T01:03:35Z",
    "file_size": 110660,
    "plain_text": "# ICS Advisory (ICSA-10-090-01)\n\n**us-cert.gov/ics/advisories/ICSA-10-090-01**\n\n[All information products included in https://us-cert.cisa.gov/ics are provided \"as is\" for](https://www.us-cert.gov/ics)\ninformational purposes only. The Department of Homeland Security (DHS) does not provide\nany warranties of any kind regarding any information contained within. DHS does not\nendorse any commercial product or service, referenced in this product or otherwise. Further\ndissemination of this product is governed by the Traffic Light Protocol (TLP) marking in the\nheader. For more information about TLP, see [https://us-cert.cisa.gov/tlp/.](https://www.us-cert.gov/tlp/)\n\n## Overview\n\nICS-CERT has received reports and investigated infections of the Mariposaa botnet, which\nhave affected the business networks of multiple control system owners in recent months.\n\nICS-CERT has no information to indicate that these infections have specifically targeted\nUnited States Critical Infrastructure and Key Resources (CIKR), or any specific sector or\norganization.\n\n## Background\n\nIn May 2009, Defence Intelligence announced the discovery of a botnet, called “Mariposa.”\nAn investigation followed this discovery and targeted bringing down the criminal network\nbehind what has become one of the largest botnets on record.\n\nAfter months of investigation by the Guardia Civil in Spain, the FBI, security firm Panda\nSecurity, and Defence Intelligence, authorities took down a 12.7 million strong zombie\nnetwork in December. In February 2010, Spanish authorities arrested three suspects in\nSpain.b\n\nAlthough the primary command and control (C2) infrastructure for the Mariposa botnet is\nconsidered to have been rendered inoperative by the Mariposa Working Group,c malware\nfiles that were used by the botnet are still thought to be on computers in production\nenvironments and should be identified and removed. Additionally, it is not uncommon for new\ngroups to assume control of old or abandoned botnets by compromising existing command\nand control or by establishing new command and control infrastructure using slightly\nmodified malware.\n\n## Details\n\n\n-----\n\nIn February 2010, a US utility company (USUTIL1) was notified by another US Utility partner\ncompany (USUTIL2) that a USUTIL1 employee had visited USUTIL2 with a Mariposainfected laptop. There had been no indication from USUTIL1’s computer network defense\nmechanisms (Anti-Virus, Intrusion Detection Systems, Firewalls etc.) that an infection had\noccurred and USUTIL2’s notification was USUTIL1’s first indication that there was an issue.\n\nUSUTIL1’s investigation found that the initial infection vector may have been a USB drive\nshared at an industry conference. An instructor shared a USB drive among participants at a\ntraining event attended by USUTIL1’s employee. It is believed that when the employee\nreturned and connected his laptop to the corporate network, the malware spread to multiple\nbusiness systems.\n\nTo date, none of USUTIL1’s control systems are known to be affected by the botnet malware.\n\nUSUTIL1’s internal investigation found the malware file “Schl.exe” in deleted files on one\nsystem. USUTIL1’s continued searching and found other systems with this deleted file.\nThese systems were also attempting to make UDP connections with systems outside of their\nfirewall.\n\nICS-CERT was contacted and at the request of the organization, deployed a fly-away team\nto assist with identification and analysis of the malware.\n\n## Analysis\n\nA dynamic analysis was made on the file schl.exe. The method used for code injection is\nsimilar to the method described by Defence Intelligenced however, callbacks appeared to be\nunique. It should be noted that the following information is solely from ICS-CERT’s\ninvestigation into the malware variant found at USUTIL1. This information, along with other\nopen source information should be leveraged in any comprehensive detection and mitigation\nactivities.\n\nThe following information can be used to develop detection signatures:\n\n### File: SCHL.EXE\n\nSize: 140800\n\nMD5: 645C4DD7508B3DC83807FCF9918FE1C7\n\nSHA1: d452e2df58fad206b2213683356033822ff335c9\n\nType: PE32 executable for MS Windows (GUI) Intel 80386 32-bit\n\n### Antivirus Identification\n\nMicrosoft: Trojan:Win32/Meredrop\n\nMcafee: Backdoor-EEC.gen\n\nSymantec: Trojan Horse\n\n\n-----\n\n### DNS Lookups\n\nhnox[dot]org\n\nsocksa[dot]com\n\nronpc[dot]net\n\n### Callbacks\n\n**Domain** **IP** **Protocol/Port**\n\nhnox[dot]org 92.241.165.162 UDP 21039\n\nsocksa[dot]com 92.241.164.82 UDP 21039\n\n_ronpc[dot]net_ _92.241.164.82_ _UDP 21039_\n\n_Note: All network traffic in/out is UDP_\n\nThe initial outbound packet is 49 bytes (7 bytes encrypted payload) to hnox[dot]org or\nsocksa[dot]com, using UDP port 21039, for the purpose of establishing the C2 channel. The\nC2 server responds from 21039 to the same local port, with a UDP packet of varying length\nand encrypted payload. C2 command syntax appears to be consistent with the Mariposa\nbotnet.\n\n### Malware Files\n\nschl.exe – dropper\n\njack.exe – dropped file\n\nconfig.inf – dropped file\n\ndesktop.ini – dropped file (0-byte file located at source of originally executed file)\n\nBotnets, including Mariposa, are highly dynamic. C2 operators frequently update their code\nto evade detection or implement new features. Other files may also be associated with\nMariposa, so the list above is not a complete list of files used by Mariposa. For example,\nDefence Intelligenceee has also identified blackjackson.exe, which provided Mariposa with\ndistributed denial-of-service (DDoS) capability by using the BlackEnergy DDoS bot.\n\n### Windows Registry Modifications\n\nKey: [HKEY_LOCAL_MACHINE\\Software\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon]\n\nValue: \"Taskman\" = \"<file_path>\\schl.exe\"\n\n_Note: Where \"file path\" = location of schl.exe when executed_\n\n### Domain Names Observed as C2 Servers\n\n\n-----\n\nThe following domain names have been observed as command and control servers:\n\nbf2back.sinip.es\nbfisback.no-ip.org\nbfisback.sinip.es\nbinaryfeed.in\nbooster.estr.es\nbutterfly.BigMoney.biz\nbutterfly.sinip.es\ndefintelsucks.com\ndefintelsucks.net\ndefintelsucks.sinip.es\nextraperlo.biz\ngusanodeseda.mobi\ngusanodeseda.net\ngusanodeseda.sinip.es\nlalundelau.sinip.es\nlegion.sinip.es\nlegionarios.servecounterstrike.com\nmierda.notengodominio.com\nqwertasdfg.sinip.es\nsexme.in\nshv4.no-ip.biz\nshv4b.getmyip.com\ntamiflux.net\ntamiflux.org\nthejacksonfive.biz\nthejacksonfive.mobi\nthejacksonfive.us\nthesexydude.com\nyouare.sexidude.com\nyougotissuez.com\n\n### ICS-CERT Identified Malware Files\n\nICS-CERT identified the following three malware files during analysis:\n\nschl.exe\njack.exe\nconfig.inf\n\n### Outbound Command & Control Attempts\n\nICS-CERT observed attempted UDP C2 connections with the following IP addresses:\n\n\n-----\n\n24.173.86.145\n67.210.170.32\n92.241.165.162\n62.128.52.191\n74.208.162.142\n200.74.244.84\n66.197.176.41\n76.73.56.12\n204.16.173.30\n67.210.170.131\n87.106.179.75\n\n### Mariposa M alware UDP Ports\n\nMariposa malware has been observed using the following UDP ports:\n\n3431\n3435\n5907\n3433\n3437\n21039\n3434\n5906\n\n### Affected Operating Systems\n\nAlthough botnet malware can affect any operating system, most current botnets including\nMariposa target Windows systems.f\n\n### Impact\n\nAlthough the primary Mariposa C2 is believed to be inactive, the malware is still spreading.\nThe possibility exists that another actor will attempt to “commandeer” the existing C2 or\ncreate a new C2 infrastructure. Without C2 direction, the malware won’t perform malicious\nactions; however, the malware still presents a risk and any remaining Mariposa malware\nshould be identified, removed, and systems should be properly re-imaged or restored if reimaging is not feasible.\n\nImpact to individual organizations depends on many factors that are unique to each\norganization. ICS-CERT recommends that organizations evaluate the impact of this\nvulnerability based on their environment, architecture, and product implementation.\n\n## Recommendations\n\n\n-----\n\nBecause IP addresses, UDP ports, and domains used by the C2 structure of Mariposa\nchanged continually, it created a difficult challenge for security administrators to mitigate the\ncapabilities of this botnet. The best mitigation strategy is to track down compromised\nsystems using all information available about the malware. Organizations should establish\nfirewall rules to block communication from malware to known command and control sites and\nmonitor their network for this activity to identify compromised machines. Additionally, UDP\nconnections are used for Mariposa communication, so observance of your network activity is\nthe best place to start. If one system is frequently sending outbound UDP packets,\nregardless of port, mark it as suspicious and investigate the source of the traffic on the\nsystem.\n\nIt is important to identify all of the infected machines and to disable them simultaneously to\nprevent re-infection of your assets. Advanced threats such as botnets can be extremely\ndifficult to eradicate. If a compromised system is missed, the threat can re-infect “clean”\nsystems. Clean systems should be isolated while the remainder of the network is cleaned, or\nthe clean systems risk being re-infected. In large networks, this can be a challenging\nexercise.\n\nAs mentioned, IP addresses, ports, and domains used by Mariposa’s C2 system have\ncontinually changed. These changes created new malware variants (mariposa had over\n1,500 variants) resulting in a persistent and dynamic botnet. It is important to use all\navailable information when eradicating and defending against a botnet infection to ensure\nthat all variants are detected and properly removed.\nHere are some general guidelines for dealing with Mariposa malware:\n\nAny infected systems should be immediately isolated from the network.\nAny systems sharing network drives with the infected systems, including file servers\nhosting said network drives, should also be isolated from the network.Reimage infected\nhosts prior to returning to normal operation.\nConsider maintaining an infected system for more detailed analysis (i.e., digital media\nanalysis, malware collection).\nReview antivirus software specific removal guidelines for the malware if re-imaging is\nnot possible.\nUsers should refrain from or be administratively prohibited from browsing the Internet\nusing Windows accounts with Administrator-level privileges. This reduces the potential\ndamage an infection can inflict upon a system.\nOrganizations should warn users about the risks of using USB drives on business\nsystems. For more information, review ICS-CERT CSAR -10-090-01- USBs Used as\n_Attack Vectorg and US-CERT Cyber Security Tip ST08-001, “Using Caution with USB_\n_Drives.”g_\nKeep systems up to date with the latest patches and antivirus signatures.\nEstablish an internet proxy service and monitor it for suspicious activity.\n\n\n-----\n\nMonitor IDS/IPS solutions for connections to the malicious domains and IP addresses\nlisted in ICS-CERT advisories and US-CERT CIINs.\nDo NOT trust unsolicited e-mail.\nDo NOT click links and attachments in unsolicited e-mail messages.\nEmploy the use of a spam filter.\nTo educate users about social engineering and phishing attacks, review US-CERT\n_Cyber Security Tip ST04-014, “Avoiding Social Engineering and Phishing Attacks.”_\nTo learn more about botnets, review US-CERT Cyber Security Tip ST06-001,\n_“Understanding Hidden Threats: Rootkits and Botnets.\"_\n\naDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last\naccessed March 15, 2010.\nbJohn Leyden,\nhttp://www.theregister.co.uk/2010/03/04/mariposapolicehuntmorebotherders/, website\nlast accessed March 15, 2010.\ncPandaLabs, http://pandalabs.pandasecurity.com/mariposa-botnet/, website last\naccessed March 15, 2010.\ndDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last\naccessed March 15, 2010.\neDefence Intelligence, http://defintel.com/docs/MariposaAnalysis.pdf, website last\naccessed March 15, 2010.\nfZeng, Hu, & Shin, “Detection of Botnets Using Combined Host- and Network-Level\nInformation,” 16th ACM Conference on Computer and Communications Security,\nNovember 2009:2.\ngUS-CERT Cyber Security Tip, http://www.us-cert.gov/cas/tips/ST08-001html, website\nlast accessed March 15, 2010.\n\n## Contact Information\n\nFor any questions related to this report, please contact the CISA at:\n\nEmail: [CISAservicedesk@cisa.dhs.gov](http://10.10.0.46/mailto:cisaservicedesk@cisa.dhs.gov)\n\nToll Free: 1-888-282-0870\n[For industrial control systems cybersecurity information: https://us-cert.cisa.gov/ics](https://www.us-cert.gov/ics)\n\n[or incident reporting: https://us-cert.cisa.gov/report](https://www.us-cert.gov/report)\n\nCISA continuously strives to improve its products and services. You can help by choosing\none of the links below to provide feedback about this product.\n\n[This product is provided subject to this Notification and this](https://www.us-cert.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n\n-----\n\n[We recently updated our anonymous product survey; we d welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ics/advisories/ICSA-10-090-01)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-03-31 - ICS Advisory (ICSA-10-090-01)- Mariposa Botnet.pdf"
    ],
    "report_names": [
        "2010-03-31 - ICS Advisory (ICSA-10-090-01)- Mariposa Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "92c0dae2-e255-4b90-8d8f-be88e393ab8d",
            "created_at": "2022-10-25T16:07:24.402328Z",
            "updated_at": "2025-03-27T02:02:10.209983Z",
            "deleted_at": null,
            "main_name": "Wild Neutron",
            "aliases": [
                "Butterfly",
                "Morpho",
                "Sphinx Moth",
                "The Postal Group",
                "Wild Neutron"
            ],
            "source_name": "ETDA:Wild Neutron",
            "tools": [
                "HesperBot",
                "Jiripbot",
                "JripBot"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536161,
    "ts_updated_at": 1743041475,
    "ts_creation_date": 1653786215,
    "ts_modification_date": 1653786215,
    "files": {
        "pdf": "https://archive.orkl.eu/382826a832959f6c2582ed306fa9acc51160a69e.pdf",
        "text": "https://archive.orkl.eu/382826a832959f6c2582ed306fa9acc51160a69e.txt",
        "img": "https://archive.orkl.eu/382826a832959f6c2582ed306fa9acc51160a69e.jpg"
    }
}