{
    "id": "811d2e66-ac50-4884-873e-fb8a552278d2",
    "created_at": "2023-01-12T15:09:58.020222Z",
    "updated_at": "2025-03-27T02:05:36.371265Z",
    "deleted_at": null,
    "sha1_hash": "d6503a91921fb122e79bfbe5df3e1b5c7f498e69",
    "title": "2019-05-09 - Tracking One Year of Malicious Tor Exit Relay Activities (Part II)",
    "authors": "",
    "file_creation_date": "2022-05-28T17:03:12Z",
    "file_modification_date": "2022-05-28T17:03:12Z",
    "file_size": 4876445,
    "plain_text": "# Tracking One Year of Malicious Tor Exit Relay Activities (Part II)\n\n**[nusenu.medium.com/tracking-one-year-of-malicious-tor-exit-relay-activities-part-ii-85c80875c5df](https://nusenu.medium.com/tracking-one-year-of-malicious-tor-exit-relay-activities-part-ii-85c80875c5df)**\n\nnusenu May 8, 2021\n\n[nusenu](https://nusenu.medium.com/?source=post_page-----85c80875c5df--------------------------------)\n\nMay 8, 2021\n\n\n19 min read\n\n>25% of the Tor network’s exit capacity has been attacking Tor users\n\nFigure 1: Malicious Tor exit fraction (measured in % of the entire available Tor network exit\ncapacity) over time by this particular malicious entity between July 2020 and April 2021.\nPeak value: The attacker did manage approx. 27.5% of the Tor networks exit capacity on\n2021–02–02. Graph by (raw data source: )\nIn August 2020 I reported about “How Malicious Tor Relays are Exploiting Users in 2020\n(Part I)”. Back then I made the hypothesis that the entity behind these malicious tor relays is\nnot going to stop its activities anytime soon. Unfortunately this turned out to be true. In this\nfollow-up post, I will give you an update, share what additional information we learned about\nthe attacker since August 2020 and to what extend they were and still are active on the tor\nnetwork.\n\nAfter publishing the previous blog post it took only a few days until two sets of relay groups\n[that were on my radar at the time (Figure 8 in Part I) got confirmed performing the same kind](https://nusenu.medium.com/how-malicious-tor-relays-are-exploiting-users-in-2020-part-i-1097575c0cac)\nof attacks against Tor users as previously observed:\n\n\n-----\n\nFigure 2: 2020–08–16: ContactInfo “exitrelays@protonmail.com” tor relays get caught doing\nMITM attacks. They got removed from the tor network on 2020–08–17. Source:\n\nFigure 3: 2020–08–18: ContactInfo “kleinendorstwiebe AT gmail DOT com” tor relays are\nconfirmed as malicious. They got removed on 2020–08–19. Source:\n\n## New negative records\n\n\n-----\n\n[The graph in Figure 1 starts where the first graph in the previous blog post ends and shows](https://nusenu.medium.com/how-malicious-tor-relays-are-exploiting-users-in-2020-part-i-1097575c0cac)\nthe fraction of known malicious exit capacity linked to this specific actor between July 2020\nand April 2021. You can see the repeating pattern of new malicious relays getting added to\nthe tor network and gaining significant traction before dropping sharply, when they got\nremoved.\n\nIn terms of scale of the attacker’s exit fraction, they managed to break their own record from\nMay 2020 (>23% malicious exit fraction) twice:\n\non 2020–10–30 the malicious entity operated more than 26% of the tor network’s exit\nrelay capacity\nand on 2021–02–02 they managed more than 27% of tor’s exit relay capacity. This is\nthe largest malicious tor exit fraction I’ve ever observed by a single actor.\n\nSince there likely are additional malicious exit relays by this actor — which I did not manage\nto uncover I expect their actual fraction to be slightly higher (+1–3%) than the fractions stated\nabove.\nThe attacker managed such a large fraction, that the total fraction managed by somewhat\nknown tor relay community members — that made up about 73% before this attacker started\nits operations over a year ago — dropped to bellow 50% at the end of 2020 before it started\nto recover again after 2021–02–05.\n\n[Figure 4 shows the malicious exit fraction split by relay ContactInfo. The attack strategy to](https://2019.www.torproject.org/docs/tor-manual.html.en#ContactInfo)\nhide large amounts of malicious tor exit relays by faking multiple distinct ContactInfos\ncontinued (as previously reported).\n\nFigure 4: Confirmed malicious Tor exit capacity (measured in % of the entire available Tor\nexit capacity) between 2020–06–21 and 2020–11–01 by ContactInfo (stacked). Only actual\nmalicious relays are included (for example not all relays using ContactInfo CypherpunkLabs\nwere malicious. Graph by (raw data source: )\n\n## New malicious trends\n\nBut also new attack trends and have been observed:\n\n\n-----\n\nThis actor is increasingly adding malicious tor relays without any ContactInfo (this is the\nlargest fraction, shown in red in Figure 4). Once a malicious tor exit relay is detected,\nall other relays using the same ContactInfo are easily found and removed, this is not an\nissue for them if they do not have a ContactInfo at all. Figure 5 shows the overall tor\nexit fraction that had no ContactInfo set (blue) and what part of it was malicious (red).\nWe can obviously not rule out that even more of them are malicious and we failed to\ndetect them. The vast majority of exit capacity without ContactInfo was malicious\nbetween October 2020 and March 2021.\n\nFigure 5: What fraction of exit relays not having any relay ContactInfo was malicious? (You\ncan ignore the straight red line above “Apr 1, 2021”, that is just a interpolation) Graph by (raw\ndata source: )\n[The “Expectations for Relay Operators” document (draft) says:](https://gitlab.torproject.org/tpo/community/team/-/wikis/Expectations-for-Relay-Operators)\n\nBe sure to set your ContactInfo to a working address […]\n\n[Roger Dingledine (one of the founders of the Tor Project) also has a clear opinion on this](https://gitlab.torproject.org/tpo/web/community/-/issues/165)\ntopic:\n\nMake clear that being a relay operator requires transparency about the relay operator,\nnot secrecy\n\nThe tor client has no configuration option to say “do not use exits without ContactInfo”. I\nwrote a short [proof-of-concept python script (not reviewed, not signed) that demonstrates](https://github.com/nusenu/noContactInfo_Exit_Excluder)\nsuch a feature by excluding exit relays without ContactInfo in the exit position via the\n[“ExcludeExitNodes” option, but it is not meant to be used by the average user and we aim for](https://2019.www.torproject.org/docs/tor-manual.html.en#ExcludeNodes)\nmore robust protections than a simple “has ContactInfo? y/n” test (it still can be one of\nmultiple factors). To allow everyone to easily see what exit fraction is currently contributed by\n[exit relays without ContactInfo I added a new graph to](https://nusenu.github.io/OrNetStats/no-contactinfo-exits) [OrNetStats which gets updated on a](https://nusenu.github.io/OrNetStats/)\ndaily basis.\n\n\n-----\n\nThis is not directly visible because the list of contacts was too large to include in Figure\n4, but the malicious actor also started to impersonate other operators to hide malicious\nrelays by using their ContactInfos. In one case they used ’ ContactInfo. (Side note: To\navoid false positives Figure 4 was generated by identifying malicious relays by\nfingerprint and not by searching for the ContactInfos used by CypherPunkLabs.)\n\n## Reaction time matters\n\nIn August and September 2020 malicious relays got reported and removed continuously (see\nthe Appendix II for examples). In October 2020 the malicious exit fraction reached a new\nrecord (>26% malicious exit fraction). What was different in October 2020? Like the\npreviously identified groups, also the groups appearing at the end of September and the\n[beginning of October 2020 got detected by OrNetRadar (a relay group detector):](https://nusenu.github.io/OrNetRadar)\n\nThey got reported to the Tor Project on 2020–10–04, unfortunately there was no reaction and\nso these malicious relay groups gained significant exit fraction over time before they got\nprobably discovered again and removed at the end of October 2020:\n\nFigure 6: Malicious exits using ContactInfo “supportanonymity.club” and\n“coronamitmdisease2019@hotmail.com” got reported when their exit fraction was at 0.57%.\nGraph by (raw data source: )\n\n\n-----\n\n[Another example: The following graph shows the exit fraction of a set of malicious relays](https://nusenu.github.io/OrNetRadar/2020/08/02/a6.html)\n(identified by their relay fingerprint), that got reported in August 2020 and was found again on\nthe tor network with over 1% exit fraction in April 2021.\n\nFigure 7: Malicious Tor exit relays reported on 2020–08–20 and found on the tor network\nagain in April 2021 (removed on 2021–04–27). Graph by (raw data source: )\n\n## New adversarial tactics\n\n[In September, on 2020–09–03 “Андрей Гвоздев <andrejgvozdev55@gmail.com>” reported](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\nCypherpunkLabs relays, an undeclared relay group (but not necessarily run with malicious\nintends), to bad-relays at lists.torproject.org.\n\nAt the time I answered:\n\nthanks for your email. We have them on our radar and they promised to improve things\nafter our first contact but in fact they didn’t. We will follow up on them.\n\n[https://lists.torproject.org/pipermail/tor-relays/2020-August/018878.html](https://lists.torproject.org/pipermail/tor-relays/2020-August/018878.html)\n\nEven though I contacted CypherpunkLabs multiple times the situation with their relay\n[configuration had not improved at the time. Such MyFamily misconfigurations make](https://2019.www.torproject.org/docs/tor-manual.html.en#MyFamily)\nimpersonation attacks easier for attackers.\n\n\n-----\n\nAbout three weeks later, on 2020–09–26, the malicious entity started to take advantage of\nCypherpunkLabs’ relay misconfiguration. New malicious exit relays using CypherPunkLabs’\nContactInfo appeared. Is this related to the email from 2020–09–03? A coincidence? At the\ntime I did not realize what just happened, but the events that followed until the end of 2020\nmade it clear.\n\n## Unexpected Luck with WHOIS data\n\n[On 2020–10–31 Roger Dingledine sent an email to the tor-relays mailing list mentioning that](https://lists.torproject.org/pipermail/tor-relays/2020-October/019045.html)\ntor directory authorities removed a long list of malicious exit relays for performing the known\nattacks (mitmproxy, sslstrip) against tor users. Side note: Since CypherPunkLabs did not\nproperly declare their relay group it was not possible to tell their relays apart from the\nattacker’s relays (they even used the same hosting company for the malicious relays). So all\nof them, those actually run by CypherpunkLabs and those run by the attacker, got removed\naltogether:\n\nSource:\nAt the bottom of the [long list of malicious tor exit relays published by Roger Dingledine, we](https://lists.torproject.org/pipermail/tor-relays/2020-October/019045.html)\ncan see the following set of malicious exit relay identifiers (fingerprints):\n```\nGroup #7:\nother4E6C7297F16523A236EE1A2EE23AF54ABEF1549055D490E9E440DD4458F16ABCDD79F48396D55EA97\n\n```\nUnlike most of the other relays they were not located at one of the usual hosters (OVH,\nLeasweb, Frantech). These relays did run on the following IP addresses: 185.32.222.167–\n[185.32.222.170 (if you would like to verify that: archive) located in Switzerland at the internet](https://collector.torproject.org/archive/relay-descriptors/server-descriptors/server-descriptors-2020-10.tar.xz)\n[service provider Datasource AG (AS51395). Let’s have a look at what WHOIS information is](https://bgp.he.net/AS51395)\navailable for these IP addresses:\n\n\n-----\n\nFigure 8: WHOIS records contain the email address “” as abuse contact for the small IP\nblock used by malicious exit relays. Source: RIPE Database ()\nDue to the size (just a few IP addresses) and it’s status (“ASSIGNED PA”) the assignment,\nthis is likely an end user assignment (instead of the hoster’s contact info). Of particular\ninterest is the abuse-contact, since it shows the email address that contacted the bad-relays\nteam on 2020–09–03 and reported the CypherpunkLabs relays which then became a\nimpersonation attack victims after they got reported.\n\nThe RIPE database can also be used to find other IP blocks that use the same abusecontact (inverse lookup). Using that search method we found one additional IP block also\nhosting tor exit relays but unlike the other exit relays these relays were not removed at the\ntime (October 2020):\n\nFigure 9: Inverse RIPE DB lookup for abuse handle finds an additional IP block also\ncontaining malicious exit relays. Source: RIPE database (2021–01–04).\nOn 2020–12–31 a new tor exit relay using a confirmed malicious ContactInfo\n[(“fbirelays@protonmail.com” — see](http://10.10.0.46/mailto:fbirelays@protonmail.com) [Part I) joined the tor network. The IP address of that](https://nusenu.medium.com/how-malicious-tor-relays-are-exploiting-users-in-2020-part-i-1097575c0cac)\nrelay (91.192.103.35) happened to be located in this IP address block. That means that we\n[have multiple independent paths that link the email address andrejgvozdev55@gmail.com to](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\nthe attacker:\n\n\n-----\n\ntested the bad-relays team by reporting the CypherPunkLabs relays to see if they get\nremoved for improper MyFamily configuration. This information is crucial for them\nbecause an attacker can not establish a mutual MyFamily configuration with the victim\nthey impersonate. A few weeks later malicious relays appeared using the\nCypherPunkLabs ContactInfo (CypherPunkLabs was not the only relay group they\nreported..).\nshows up as abuse-contact in WHOIS for two small IP blocks that contain malicious tor\nexit relays.\nOne of these exit relays in these IP blocks used a confirmed malicious ContactInfo\npreviously identified (“”).\n\nIt is unclear why they would reuse confirmed malicious ContactInfos and link their new exit\nrelays to known malicious activities, since one would expect that known malicious\nContactInfos are on an alert and removal list, but since they removed the known malicious\nContactInfo from the relay configuration on 2021–01–16 while keeping the relay running, my\nguess is that they reused tor configuration files and unintentionally used a confirmed\nmalicious ContactInfo. Such presumably unintentional disclosure happened multiple times.\n\nThe RIPE database abuse-contact records for these IP blocks leads to an address in\nMoscow, Russia:\n\nThe abuse-contact information for the IP addresses used by malicious tor exit relays.\nSource: RIPE database ()\n\n\n-----\n\nFigure 10/11: The abuse-contact address of the IP range hosting malicious tor exit relays\n(185.32.222.166–185.32.222.173) is allegedly located at this building in Moscow according\nto RIPE database records. Image Source: yandex.com\n\n\n-----\n\nFigure 12/13: The alleged abuse-contact address used by the malicious exit relay operator\ncan also be found on booking.com. According to the building has 108 apartments and 9\nfloors. That makes 12 apartments per floor, so apart. 12 (“kv12”) could theoretically be on the\n\n\n-----\n\nground floor. Image Source: Google Maps / (, ) (Zvenigorodsko(y)e shosse 13 /\nЗвенигородское шоссе 13)\nAn email address in the RIPE database is not necessarily there with the consent of the\n[actual email address owner even though addresses are validated to some extend by the](https://labs.ripe.net/author/angela_dallara/abuse-c-validation-update-on-progress-and-some-numbers/)\nRIPE NCC. There was still the possibility that the actual attacker fraudulently provided the\n[address “andrejgvozdev55@gmail.com” as abuse-contact without actually having access to](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\nit (impersonation), but we can rule that out since the hosting company confirmed that the\nRIPE database records are correct and the email address is verified. There is also a second\nreason why using someone else’s email address as abuse-contact for a tor exit IP block will\nnot remain unnoticed for very long: That email address will get actual abuse emails delivered\n[to it. So we are confident that the owner of the email address andrejgvozdev55@gmail.com](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\n[is actually running these malicious exit relays. After confronting them they did not respond](https://lists.torproject.org/pipermail/tor-relays/2021-April/019591.html)\n(not too surprising).\n\nTo what extend the physical address is authentic is unknown at this point. It would obviously\nnot make much sense for an attacker to use their actual address when ordering servers, but\nat the same time they used a single email address when ordering servers for malicious\nrelays and reporting non-malicious relays to the Tor Project. And it is not clear whether they\nknew that their email address and (alleged) physical address ends up in public RIPE\ndatabase records.\n\nWHOIS information is rarely ever useful for malicious tor relay investigations, but in this\nparticular case we were lucky and found useful information and were even able to find more\nmalicious exit relays using RIPE database inverse-lookups.\n\n## >1 000 new exit relays in early May 2021\n\n[The tor network usually consists of less than 1 500 tor exit relays. In early May 2021 over 1](https://metrics.torproject.org/relayflags.html?start=2016-02-04&end=2021-05-05&flag=Exit)\n000 new unnamed tor exit relays without ContactInfo joined the tor network within less than\n[24 hours (1,](https://nusenu.github.io/OrNetRadar/2021/05/03/a3.html) [2,](https://nusenu.github.io/OrNetRadar/2021/05/04/a5.html) [3,](https://nusenu.github.io/OrNetRadar/2021/05/04/a4.html) [4). Although that sounds like an impressive number of exit relays, such](https://nusenu.github.io/OrNetRadar/2021/05/03/a1.html)\nmassive relay groups impose little risk for tor users because they basically get removed right\naway before gaining any meaningful traction. When I noticed them I thought they are trolling\nbecause no one can assume such a large Sybil stays on the network for long, until I got\nemail from them. Someone responded off-list to a short note I wrote to the tor-relays mailing\n[list about this event. Apparently they were not amused by the removal of these exit relays (I](https://gist.github.com/nusenu/2a2f160a42411a38be4d834696eb9a9c)\ndo not claim any credit for their removal). It is likely that this is the same entity previously\nobserved, because their limited vocabulary is consistent with earlier emails I got from\n[“andrejgvozdev55@gmail.com”.](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\n\n## Countermeasures\n\n\n-----\n\n[My previous blog posts about malicious tor relay activities (1,](https://nusenu.medium.com/the-growing-problem-of-malicious-relays-on-the-tor-network-2f14198af548) [2) featured a section about](https://nusenu.medium.com/how-malicious-tor-relays-are-exploiting-users-in-2020-part-i-1097575c0cac)\nproposals the Tor Project could implement to reduce the risks for Tor Browser users. That did\nnot turn out to be fruitful. So after several attempts to convince them to improve the situation\nI’m going to take an another approach: Digital self-defense for tor users. This is a work in\nprogress and my plan is to write about it in more detail in a future blog post but this section\nmight provides some overview.\n\nIn addition to tor user protections I also tackle tor relay operator impersonation attacks via a\nnon-spoofable ContactInfo — which (exit) relay operators are encouraged to implement and\nmany (exit) relay operators adopted it already. Being able to confirm if a relay is actually\noperated by the entity it is claimed to be operated in an automated manner is a corner stone\nfor addressing operator impersonation attacks and malicious relays in general.\n\nWhy did it take me several years before even considering the self-defense approach?\n\nThe scale of the detected attacks has never been as large as in 2021.\nNon-central options should only be considered after trying (and failing) to achieve\nprotections at the tor directory authority level because they will never reach all users.\nTor client configuration changes should generally be avoided to avoid splitting the\nanonymity set and only be used as an option of last resort (or as a method to vote with\nyour feed as a tor user).\nNon-default tor client configurations make network wide load balancing harder.\nIt requires more effort.\n\nNonetheless we are in a dilemma between knowingly using malicious tor exit relays vs.\nexcluding them via the tor client configuration at the price of having a non-default\nconfiguration. This is additionally complicated by the fact that the exact nature of the attacks\nare not entirely known. We know about mitmproxy, sslstrip, bitcoin address rewrites and\ndownload modification attacks but it is not possible to rule out other types of attacks. Imagine\nan attacker runs 27% of the tor network’s exit capacity and a firefox exploit affecting Tor\nBrowser gets published before all users got their (auto)updates.\n\n## HTTPS-Only Browser Mode\n\nThe [HTTPS-Only mode (which might land in Tor Browser based on Firefox 91 ESR) would](https://blog.mozilla.org/security/2020/11/17/firefox-83-introduces-https-only-mode/)\nbe a strong protection, but there are still some uncertainties with that as well as a Tor\n[Browser developer points out on a tor mailing list:](https://lists.torproject.org/pipermail/tor-relays/2021-April/019628.html)\n\nWhen Tor Browser migrates to Firefox 91esr we will look at enabling https-only\n\nmode for everyone, but there remains a significant concern that there are many\n\nsites that do not support HTTPS (especially more region specific sites) and the\n\nquestion of what messaging Tor Browser should use in that case.\n\n## Solving the fake ContactInfo impersonation attacks\n\n\n-----\n\n**Problem: ContactInfo is an unverified arbitrarily spoofable string and malicious actors**\ntake advantage of that by using other peoples ContactInfos to hide their malicious relays —\nespecially if their MyFamily configuration is not properly setup. This even goes as far as\nusing names of (former) tor community people that do not even run exit relays.\n\n**Solution: Non-spoofable ContactInfos. The** [ContactInfo Information Sharing Specification](https://nusenu.github.io/ContactInfo-Information-Sharing-Specification/)\n[(version 2) provides a non-spoofable ContactInfo “url” field that can be protected against](https://nusenu.github.io/ContactInfo-Information-Sharing-Specification/#url)\n[impersonation attacks. The specification ties a relay to a domain and makes use of the IANA](https://www.iana.org/assignments/well-known-uris/well-known-uris.xhtml)\n[registered “tor-relay” well-known URI to place the list of relay fingerprints operated by an](https://gitlab.torproject.org/tpo/core/torspec/-/blob/master/proposals/326-tor-relay-well-known-uri-rfc8615.md)\nentity at a well defined location on the operator domain (or via DNS TXT records). An\n[attacker claiming to be another trusted operator (for example “emeraldonion.org”) can be](https://emeraldonion.org/)\n[detected because the attacker can not place his relay fingerprints at the defined location.](https://emeraldonion.org/.well-known/tor-relay/rsa-fingerprint.txt)\nThis effectively protects the provided “url” field. Even operators that do not own a domain\nhave used Github pages and similar services to protect their relay’s ContactInfo in this way.\nThis non-spoofable ContactInfo field is also the foundation for graphs showing\ntrusted/untrusted exit fraction over time.\n\nOver 20% of the tor network’s exit capacity is already protecting their ContactInfo “url” field\n[using this method. Please consider using a non-spoofable ContactInfo if you are a tor relay](https://mastodon.social/@nusenu/106094297537909911)\noperator to help prevent these attacks. As a nice side effect you get an aggregated graph for\n[your group of relays on OrNetStats (example). Generating the ContactInfo string has](https://nusenu.github.io/OrNetStats/tuxli.ch.html)\n[become rather easy with the availability of https://torcontactinfogenerator.netlify.app/](https://torcontactinfogenerator.netlify.app/)\n[contributed by Eran Sandler (only “url”, “proof” and “ciissversion” fields are needed for a non-](https://github.com/erans)\nspoofable ContactInfo).\n\nNote: Also malicious operators can and will setup these fields, but the key point is, that they\ncan not impersonate other relay operators.\n\n## Visualizing known and unknown exit fraction\n\nVisualizations provide a good overview on what is going on on the tor network with regards\nto changes related to who controls what exit fraction for example. I use the following graph to\nget an idea on what is going on before proceeding with more specific investigations. It shows\nthe aggregated exit probability from operators I classify as “somewhat known/non-malicious”.\n\n\n-----\n\nFigure 14: Likely non-malicious exit fraction over time graph allows to draw indirect\nconclusions about (large scale) malicious activities. Graph by (raw data source: )\nThe graph spans over more than one year and can indirectly show malicious relay activities\n(indicated by a significantly decreasing exit fraction) or outages at known operators. This can\nbe seen without having to know anything about the attackers in specific but it requires\nconstant manual investigations because it has a significant problem: It uses untrusted input\ndata (ContactInfo) that malicious entities are taking advantage of by using other peoples\nContactInfo.\n\nThis is where the non-spoofable ContactInfo “url” field comes in. With the increasing\nadoption of the non-spoofable ContactInfo field we can visualize what fraction of the network\nis “known” without depending on arbitrarily spoofable input data. Instead we simply use\ndomain names from the non-spoofable ContactInfo url field and specify “I know\nemeraldonion.org, hviv.nl, …”. Figure 15 shows all current non-spoofable domains by exit\n[operators. This is a snapshot of the daily updated graph I’m adding to OrNetStats with the](https://nusenu.github.io/OrNetStats/exit-fractions)\nrelease of this blog post. On OrNetStats you can interactively select whether a operator\nshould be include or not by clicking on an operator domain. It is up to the user to decide\nwhich operator they consider trusted.\n\n\n-----\n\nFigure 15: Contributed exit fraction by (non-spoofable) operator domain. Graph by\n[This graph is similar to what Roger Dingledine wrote in this Tor Project gitlab issue, but](https://gitlab.torproject.org/tpo/metrics/relay-search/-/issues/40001)\ninstead of tagging each relay individually we leave the task to (verifiable) link a relay to an\noperator to the operator running it and then do the tagging (known vs. unknown) on the\noperator level instead of at the relay level, this should scale well and does not require any\nactions if an operator adds a new relay to the network.\n\nThe aggregated exit fraction in Figure 14 is significantly larger than in Figure 15 where we\nuse non-spoofable input data, but we have just started and more operators are about to\nadopt the non-spoofable ContactInfo to make this even more useful. I envision a future\nwhere a tor user can choose his preferred risk level between “I want to use known exits only”\nand “I’m fine with some higher risk, I want more diversity, allocate up to 20% of unknown tor\nexit relays ”. Beware that his comes at the price of splitting the anonymity set. On the long\nrun all Tor Browser traffic should be authenticated and encrypted which will make running\nmalicious exit relays less profitable for malicious entities.\n\n## Summary\n\nThe entity attacking tor users, originally disclosed in, is actively exploiting tor users\nsince over a year and expanded the scale of their attacks to a new record level (>27%\nof the tor network’s exit capacity has been under their control on 2021–02–02).\nThe average exit fraction this entity controlled was above 14% throughout the past 12\nmonths (measured between 2020–04–24 and 2021–04–26).\n\n\n-----\n\nThe malicious actor actively reported non-malicious but poorly configured relays to the\nTor Project’s bad-relays mailing list to find viable victims to use for operator\nimpersonation attacks.\nMost of the malicious tor exit capacity did not have any relay ContactInfo. Throughout\nthe last 6 months the majority of tor exit capacity without ContactInfo was malicious.\nThe attacker primarily uses servers at the hoster OVH.\nIn early May 2021 the attacker attempted to add over 1 000 exit relays to the tor\nnetwork.\nThe attacker (or one of them) likely uses the Russian language interface of gmail.com.\nAs of 2021–05–08 I estimate their exit fraction between 4-6% of the tor network’s exit\ncapacity.\nA new field for tor relays has been specified and has been adopted by over 20% of the\nnetwork’s exit capacity so far.\nOrNetStats has been extended to include two new graphs: exit fraction and graphs\nshowing\n\n**key take away for tor relay operators:**\n\nWant to help with tor network safety? on your tor relays.\n\n## Additional Background / Disclosure\n\n[After publishing Part I in August 2020 I got email from the Tor Project in which they shared](https://nusenu.medium.com/how-malicious-tor-relays-are-exploiting-users-in-2020-part-i-1097575c0cac)\ntheir concerns about me “leaking” information from the private bad-relays mailing list without\ntheir consent. While I agree that it is reasonable to expect some level of confidentiality after\nbeing invited to a non-public mailing list I questioned that my blog post did any damage to\nthe goals of the bad-relays team. I have unsubscribed from the bad-relays mailing list as of\n2021–01–01. It did not feel like being on that list allowed me to help reduce the risk for tor\nusers and relevant discussions happen also elsewhere. Regardless of that I’ll continue to\nwork towards a safer tor network.\n\nI have informed them about the upcoming publication of information related to\n[“andrejgvozdev55@gmail.com” before this blog post went public:](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\n\nfyi: I’ll soon publish information about this email address and its links\n\nto malicious relay operations.\n\nIt will include information I learned through this list via my interactions\n\nwith that gmail address (timestamps and content).\n\nThey had no objections.\n\n## Want to support this type of research?\n\n\n-----\n\nI m looking for a new maltego license (the previously donated license I got after publishing\nmy previous blog post expired).\n\n## Appendix (bonus material)\n\n Fake profiles for fake relays: relaystor.xyz\n\nOn [2021–02–13 and](https://nusenu.github.io/OrNetRadar/2021/02/13/a4) [2021–02–16 close to 100 relays joined the network. All of them had the](https://nusenu.github.io/OrNetRadar/2021/02/16/a7)\n[domain https://relaystor.xyz in their ContactInfo field. They are not so relevant from an exit](https://relaystor.xyz/)\nfraction point of view because they were not on the tor network for long but I still found them\ninteresting because they made some effort to build some fake profiles:\n\n(rudimentary) website\ntwitter profiles (created 2012 and 2014)\ntelegram channel\nBTC donation address\n\nHere is a screenshot of their “about” page:\n\nSource: (archived version: )\nThe twitter links point to these profiles:\n\n\n-----\n\nSource:\n\n\n-----\n\nSource:\nThe profile pictures can be found on a stock image website (unsplash) using image reverse\nsearch:\n\nSource:\n\n\n-----\n\nSource:\nThe website also has a donation page pointing to a bitcoin address, which could be\ninteresting from a ‘follow-the-money’ perspective, but there are unfortunately no transactions\nwith this address:\n\n\n-----\n\nDonation bitcoin address shown on the rudimentary relaystor.xyz website. This address has\n0 transactions: (source: )\n\n## Timeline for events related to andrejgvozdev55@gmail.com (not comprehensive)\n\n2020–09–03 Андрей Гвоздев reports the undeclared relay group of CypherPunkLabs\nto the bad-relays mailing list. (10 days before that I did send about this — which might\ngave them this idea in the first place)\n2020–09–03 I responded by letting them know that the CypherPunkLabs relay group is\non our radar and that we were in contact with them.\n2020–09–07 first malicious exit at SOFTplus Entwicklungen GmbH gets added\n(185.32.222.167) — no ContactInfo given. The abuse contact (RIPE database) later\npoints to\n2020–09–15 first RIPE DB entries related to are created\n2020–09–21 ’s on the tor-relays mailing list\n2020–09–26 impersonation: first malicious exit relays using CypherPunkLabs as\ncontact appear (relay fingerprint:\n1EC0CCAFA8ABD5470B062AF470EAC97DD069C655)\n2020–10–31 a large fraction of by tor directory authorities\n2020–11–06–2020–12–16: more tor exit relays get added in the two identified IP blocks\nlocated in (Datasource AG) and at other known hosters (, more, )\n2020–12–31 a new relay using a previously confirmed and known malicious\nContactInfo (“” — see ) appears on one of the known IP block in AS51395\n(91.192.103.35) with abuse contact pointing to “”\n2021–01–16 ContactInfo (“”) and nickname is removed from that relay (using this\nknown malicious ContactInfo was probably unintentional)\n2021–01–18 I reached out to using a random email address, but they didn’t want to\ndisclose which tor relays they run.\n2021–02–04 malicious tor exit relays removal event: at (, )\n2021–02–18 malicious tor exit relays removal event at multiple hosters (Amarutu Tech.,\nOVH, Frantech, …)\n2021–02–22: get added again ()\n2021–03–04 malicious tor exit relays removal event at OVH\n2021–03–14 malicious tor exit relays removal event: this is the last seen date for many\nmalicious tor exit relays at AS51395, Datasource AG and a few other ASes (Amarutu\nTech, Liteserver Holding, …).\n2021–04–08 23 new tor exit relays using contactInfo\n“andrejgvozdev55(at)gmail(dot)com [tor-relay.co]” join the tor network\n2021–04–10 previously identified malicious exit relays (reported to the Tor Project in\nAugust 2020) join the Tor network again. (removed on 2021–04–27)\n2021–04–12: Last seen date for the relays using contactInfo\n“andrejgvozdev55(at)gmail(dot)com [tor-relay co]”;\n\n\n-----\n\n## Appendix II\n\nTimeseries graph showing the new malicious groups getting added immediately after a\nremoval event, which makes them linkable. Graph by (raw data source: )\n\n: malicious exit group with contact “kleinendorstwiebe AT gmail DOT com” gets\nkicked→”cockcockcockcock(at)cock(dot)li” relays become exit relays (previously nonexits)\n: malicious exit group with contact “cockcockcockcock(at)cock(dot)li” gets kicked →\n“exit_abuse@posteo.net” relays\n: exit group with contact “BlackHatsMatter@protonmail.com” gets\nkicked→”hgonxhe51@gmail.com” relays\n\n## Appendix III\n\nEmails from [andrejgvozdev55@gmail.com on public Tor Project mailing lists:](http://10.10.0.46/mailto:andrejgvozdev55@gmail.com)\n\n## [tor-relays] SSH\n\n### Hello I'm running a TOR relay, every time I SSH to my server I see a message that there were thousands of failed login…\n\nlists.torproject.org\n\n[https://lists.torproject.org/pipermail/tor-relays/2021-March/019420.html](https://lists.torproject.org/pipermail/tor-relays/2021-March/019420.html)\n\n## [tor-relays] ISP\n\n### Edit description\n\nlists.torproject.org\n\n## [tor-relays] Relay Configurator\n\n\n-----\n\n### Next message (by thread): [tor-relays] Relay Configurator\n\nlists.torproject.org\n\n[https://lists.torproject.org/pipermail/tor-relays/2021-April/019552.html](https://lists.torproject.org/pipermail/tor-relays/2021-April/019552.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-09 - Tracking One Year of Malicious Tor Exit Relay Activities (Part II).pdf"
    ],
    "report_names": [
        "2019-05-09 - Tracking One Year of Malicious Tor Exit Relay Activities (Part II).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536198,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653757392,
    "ts_modification_date": 1653757392,
    "files": {
        "pdf": "https://archive.orkl.eu/d6503a91921fb122e79bfbe5df3e1b5c7f498e69.pdf",
        "text": "https://archive.orkl.eu/d6503a91921fb122e79bfbe5df3e1b5c7f498e69.txt",
        "img": "https://archive.orkl.eu/d6503a91921fb122e79bfbe5df3e1b5c7f498e69.jpg"
    }
}