{
    "id": "81301bd6-dc66-41de-b1b8-6bd7965c59d1",
    "created_at": "2022-10-25T16:48:20.125804Z",
    "updated_at": "2025-03-27T02:10:04.123637Z",
    "deleted_at": null,
    "sha1_hash": "c79955cffa52bfa23d4255615fca253b9bbd385f",
    "title": "The snooping dragon: social-malware surveillance of the Tibetan movement",
    "authors": "",
    "file_creation_date": "2009-03-31T18:15:49Z",
    "file_modification_date": "2009-03-31T18:18:46Z",
    "file_size": 254980,
    "plain_text": "# Technical Report\n\n#### Number 746\n\n\nUCAM-CL-TR-746\nISSN 1476-2986\n\n##### Computer Laboratory\n\n\n## The snooping dragon: social-malware surveillance of the Tibetan movement\n\n### Shishir Nagaraja, Ross Anderson\n\n#### March 2009\n\n15 JJ Thomson Avenue\nCambridge CB3 0FD\nUnited Kingdom\nphone +44 1223 763500\n\n_http://www.cl.cam.ac.uk/_\n\n\n-----\n\n_⃝c_ 2009 Shishir Nagaraja, Ross Anderson\n\nTechnical reports published by the University of Cambridge\nComputer Laboratory are freely available via the Internet:\n\n_http://www.cl.cam.ac.uk/techreports/_\n\nISSN 1476-2986\n\n\n-----\n\n### The snooping dragon: social-malware surveillance of the Tibetan movement\n\n##### Shishir Nagaraja Information Trust Institute University of Illinois at Urbana-Champaign\n```\n         sn275@iti.uiuc.edu\n\n Ross Anderson Cambridge University Computer Laboratory\n       Ross.Anderson@cl.cam.ac.uk\n\n```\n**Abstract**\n\nIn this note we document a case of malware-based electronic surveillance of a\npolitical organisation by the agents of a nation state. While malware attacks are not\nnew, two aspects of this case make it worth serious study. First, it was a targeted\nsurveillance attack designed to collect actionable intelligence for use by the police\nand security services of a repressive state, with potentially fatal consequences for\nthose exposed. Second, the modus operandi combined social phishing with highgrade malware. This combination of well-written malware with well-designed email\nlures, which we call social malware, is devastatingly effective. Few organisations\noutside the defence and intelligence sector could withstand such an attack, and although this particular case involved the agents of a major power, the attack could in\nfact have been mounted by a capable motivated individual. This report is therefore\nof importance not just to companies who may attract the attention of government\nagencies, but to all organisations. As social-malware attacks spread, they are bound\nto target people such as accounts-payable and payroll staff who use computers to\nmake payments. Prevention will be hard. The traditional defence against social\nmalware in government agencies involves expensive and intrusive measures that\nrange from mandatory access controls to tiresome operational security procedures.\nThese will not be sustainable in the economy as a whole. Evolving practical low-cost\ndefences against social-malware attacks will be a real challenge.\n\n3\n\n\n-----\n\n#### 1 Introduction\n\nFollowing the Chinese invasion of Tibet, the Dalai Lama fled in 1959 to exile in India\nfrom where he has acted as the Tibetan spiritual leader and campaigned for Tibetan\nindependence. His campaign has often embarrassed the Chinese government. In the runup to the Peking Olympics of 2008, Tibet was particularly sensitive; bloody anti-Chinese\nriots in Lhasa and elsewhere in March 2008 were followed by a police crackdown involving\nmany arrests and killings. The crackdown continues to this day.\n\nThe activities of the Dalai Lama and the Tibetan government in exile are coordinated\nby the Office of His Holiness the Dalai Lama (OHHDL) in Dharamsala. Most of its\nactivities are quite overt and have to do with the Dalai Lama’s diplomatic and campaigning work, including overseas trips, and his spiritual mission which ranges from religious\nfestivals through pastoral care for Tibetan refugees to routine scholarly work.\n\nSome of this work has of necessity a covert element. For example, a campaigning\ngroup such as the OHHDL may plan a publicity coup in secret for maximum effect. A\ntactical matter like this may require secrecy only for a few weeks or months, and the\nconsequences of a leak are typically mild – loss of operational effectiveness.\n\nHowever there are other covert matters where secrecy must be maintained for much\nlonger, and the consequences of a leak may be severe. An example comes from schooling.\nWhile organising Tibetan-language schools in India or the USA is an open matter, such\nschools in Tibet itself may have to be covert. Their operation may place teachers’ and\neven students’ lives at risk. Indeed, everyone associated with the Tibetan movement\nwho sets foot in Tibet or China is at risk of their lives. Another potentially sensitive\ninformation asset is a database of Tibetan refugees, including where they lived in Tibet,\nwhen they left and where they live now.\n\nThe OHHDL first started using the Internet to publish talks and speeches in the\n1990s [1]. Since then, the use of IT in its daily activities has grown steadily. Email is\nnow the staple means of communication within both the OHHDL and other arms of the\nTibetan movement. Tibetans also generate a growing number of electronic documents in\nthe process of scholarship and administration. Most of this is routine, but some documents\nare sensitive in the strong sense that they could be used to construct actionable intelligence\nfor Chinese government agencies leading to fatal consequences for people in Tibet and\nChina. In what follows, we will follow NATO practice and call such documents ‘secret’,\nwhile documents whose compromise will merely cause a loss of operational effectiveness\n(such as those relating to forthcoming political meetings) we will call ‘confidential’. (In\nthe past, the Tibetans did not differentiate between levels of sensitivity. Secret documents\nwere sometimes sent by email; confidential documents still are.)\n\nAs in other organisations, the ease of communication brought by the Internet has\nshifted the social rules for information management. Many of the safeguards available in\nthe world of paper files are much more difficult to implement in the electronic world in\nways that provide both adequate strength of mechanism and acceptable usability. This\nraises the difficult and (now) urgent problem of what combination of technical controls\nand procedural measures are needed in the new world of online working.\n\n4\n\n\n-----\n\n#### 2 Attacks on the Dalai Lama’s Private Office\n\nThe OHHDL started to suspect it was under surveillance while setting up meetings between His Holiness and foreign dignitaries. They sent an email invitation on behalf of His\nHoliness to a foreign diplomat, but before they could follow it up with a courtesy telephone call, the diplomat’s office was contacted by the Chinese government and warned not\nto go ahead with the meeting. The Tibetans wondered whether a computer compromise\nmight be the explanation; they called ONI Asia who called us. (Until May 2008, the first\nauthor was employed on a studentship funded by the OpenNet Initiative and the second\nauthor was a principal investigator for ONI.)\nEmail users at the OHHDL have been suffering spam attacks for some time. While\nsome of these are a part of a wider pattern of attacks on anyone plausibly associated with\nthe Tibetan movement, others are specifically targeted at OHHDL users.\nThe web-hosting and email services used by the OHHDL are provided by a California\ncompany. A look at the email server logs revealed a number of successful logins from\na range of IP addresses that belonged to Chinese and Hongkong ISPs, with which none\nof the OHHDL email users were associated. Given that there are fewer than 50 email\naccounts, the possibility of error or accident seemed low – and especially so as many of\nthe suspicious source IP addresses belonged (according to APNIC) to ISPs operating not\njust in the Chinese mainland, but in China’s Xinjiang Uyghur Autonomous Region, where\npolice and intelligence units dealing with Tibetan independence campaigners are based.\nFollowing discussions with the OHHDL, the first author travelled to Dharamsala in\nSeptember 2008 to assist in a forensic investigation. A technical report on the background\nto this investigation, and on follow-up visits to Tibetan offices round the world by ONI\nAsia personnel, is published separately by ONI Asia and CitizenLab [2]. The purpose of\nthis paper is to set out the technical findings of our investigation and discuss their wider\nimplications.\nWe monitored the network traffic from the OHHDL to its mail service in California\nand immediately observed that gaining access to emails would have been straightforward\nfor anyone who could monitor this circuit, since the traffic was unencrypted. The email\nserver could be contacted via POP, IMAP and HTTP in insecure modes, with passwords\nand mail passing in plain text. We also noted that some passwords chosen by monks were\neasily broken with a dictionary attack using John the Ripper in about 15 minutes [3].\nThe ‘standard’ security-consultant advice might therefore have been that the monks\nturn on TLS encryption to their mail server, and adopt a password policy. However such\na superficial diagnosis and prescription would not have given the Tibetans much of a\ndefence. It turned out that the attackers used a different route.\n\n##### 2.1 The attack vector\n\nEmail attachments appear to have been the favoured strategy to deliver malicious payloads. This worked because the attackers took the trouble to write emails that appeared\nto come from fellow Tibetans and indeed from co-workers. The use of carefully-written\nemail lures based on social context to get people to visit bogus websites has been called\n‘social phishing’ [4]; in this incident, such email was used to spread malware and we\ntherefore call this strategy social malware.\n\n5\n\n\n-----\n\nFigure 1: One of the tampered emails used to spread malware\n\nThe initial break may have been facilitated by the fact that the monks in the OHHDL\nwere not just engaged in administrative tasks but were also active on various discussion\nsites. A passive observer could easily note their names, their interests and the names of\npeople with whom they interacted. Emails were sent to monks, purporting to come from\nother monks, but that had in fact come from outside. We assume that one monk clicked\non an infected attachment, giving the attackers their first foothold. It is possible that the\ninitial break came from somewhere else, such as a guessed password for the mail server, or\na mail server compromise; but we did not see evidence of the pattern of compromise likely\nafter a passive wiretap, or of malware attacks on the mail servers themselves. We assess\nthat the attackers probably used publicly-accessible mailing-list archives to construct the\nsocial-malware emails that they sent to their first targets.\n\nOur analysis strongly suggested that once they has secured an initial foothold, the\nattackers gained access to the mailboxes of several users at the mail server. The successful\nlogon attempts from China recorded from the mail server log point to this. They then\nused social engineering based on the contents of internal emails to expand this compromise\nto infect many other machines at the OHHDL. In particular, they targeted the email\naddresses of prominent members of the OHHDL and of key support staff including the\nsystem administration team.\n\nAn interesting and very effective twist was that the attackers did not just use the\nsocial information they gained from their initial attack to send plausible phish. They also\nstole mail in transit and replaced the attachments with toxic ones. Figure 1 shows an\nemail whose body was stolen from the mailbox of a user and then used to construct the\nattack by attaching a malicious payload.\n\n6\n\n\n-----\n\n##### 2.2 The payload\n\nOur next observation concerns the malware payloads used. These were packaged as either .doc or .pdf files that installed rootkits on the machines of monks who clicked on\nthem. During our initial network monitoring exercise, we observed sensitive files being\ntransferred out of the OHHDL using a modified HTTP protocol: the malware picked up\nfiles from local disks and sent them to three servers which, according to APNIC, were in\nChina’s Sichuan province, using a custom protocol based on HTTP. The malware uses\nHTTP GET and HTTP POST messages to transfer files out and also appears to verify\nsuccessful transmission. Sichuan, by the way, is the location of the Chinese intelligence\nunit specifically tasked with monitoring the OHHDL.\nWe then examined samples of email attachments from the local filesystems with the\nexpert help of Mikko Hypponen at F-Secure Corporation, who determined that they could\nsupport file search and retrieval operations and also function as keyloggers. This confirms\nthat the attackers had pretty much full access to the data on the infected computers. (In\nfact, one monk claimed that he actually ‘saw’ the bot open his Outlook Express and send\ninfected attachments to others without any action on his part!)\n\n##### 2.3 The attackers’ operational security\n\nWe initially expected that the attackers would seek some form of anonymity, perhaps by\nattacking through intermediate relays, or maybe an anonymity service such as Tor [5] –\nthe largest such system. But a comparison of the IP addresses used in the attack with\nTor exit node IP addresses (both in China and elsewhere) proved negative.\nHowever, after a while, we saw a number of accesses through Dynaweb – a set of\nanonymisation proxy servers associated with the Falun Gong religious movement, which\nis also detested by the Government of China. We are at a loss how to explain this. Perhaps\nthe Chinese detected the start of our clean-up operation and decided to hint that they\nhad compromised Dynaweb – whether to deter people from using it, or to deter the US\ngovernment from funding it? We just have no idea.\nWith hindsight, the Tibetans were fortunate in that the Chinese made the operational\nerror of using surveillance product for a minor and tactical diplomatic purpose. By\ndemonstrating that they had access to confidential data, they alerted the OHHDL to\nworry about the secret data too. This underlines the wisdom of the traditional NATO\ndoctrine of treating communications intelligence product as Top Secret Codeword and\nenforcing very severe restrictions on its use.\n\n#### 3 Analysis and Countermeasures\n\nThe informal security model used at the OHHDL (as in most companies) was essentially\none of discretionary access control: users were trusted to use computer resources sensibly.\nYet we observed users storing secret documents on the local filesystem of a computer also\nused for risky activities such as browsing the Internet and opening emails with attachments\nfrom colleagues (actually strangers pretending to be colleagues). The handling of sensitive\ndata was thus inadequately separated from risky activities – activities that require the\nuser to trust content from strangers.\n\n7\n\n\n-----\n\nNext, although the attacks we document here came from the intelligence services of\na major country, there is nothing in the modus operandi that prevents them from being\ncarried out by a smaller opponent. For example, we saw no evidence that the initial\nbreak involved wiretapping the backbone traffic from Dharamsala to California – the\nkind of exploit popularly associated with a large-country agency. There was no need,\ngiven the tools and methods they actually employed. In fact, even a capable motivated\nindividual could have carried out the attacks we describe here. Until recently, one might\nhave assumed that it would take a ‘geek’ to write good malware, and someone with\ninterpersonal skills to do the social manipulation. But the industrialisation of online\ncrime over the past five years means that capably-written malware, which will not be\ndetected by anti-virus programs, is now available on the market. All an attacker needs\nis the social skill and patience to work the malware from one person to another until\nenough machines have been compromised to complete the mission. What’s more, the\n‘best practice’ advice that one sees in the corporate sector comes nowhere even close to\npreventing such an attack.\nThus social malware is unlikely to remain a tool of governments. Certainly organisations of interest to governments should take proper precautions now, but other firms\nhad better start to think about what it will mean for them when social malware attacks\nbecome widespread. What Chinese spooks did in 2008, Russian crooks will do in 2010,\nand even low-budget criminals from less developed countries will follow in due course.\nSo what are the broader implications? How can social malware be dealt with?\n\n##### 3.1 Countermeasures for NGOs\n\nThe first question is what defences are available to an organisation such as the OHHDL.\nThe world of defence computing gives us a workable, if very expensive, answer. It starts\nwith the use of mandatory access controls (MAC) to provide strong separation of processes\nand data. At its simplest, the Bell-LaPadula model ensures that information may flow\nup from Low to High but not down; this is also known as multi-level security (MLS). An\nimmense research programme, lasting over thirty years, led to the creation of software\nproducts and an assurance infrastructure to support this model; a good introduction may\nbe found in [7]. Until recently, high-grade MAC/MLS products were not available to\nnormal users and were even export-controlled; but now products such as Trusted Solaris\nand SELinux are available without restriction. But could a typical organisation use these\ntools effectively?\nThe classical MAC/MLS approach to the Tibetans’ protection problem would start\nwith a system of information classification, as we discussed already. A firewall or mail\nguard implemented on an SELinux platform might be used to ensure that no secret documents are made available to resources at a lower level, such as a machine on which\nexternal email or web pages had been read. And clearances matter as well as classifications. Access to secret documents would be restricted to staff who have at the very least\nhad a background check – otherwise Chinese agents can simply walk over the border from\nTibet and volunteer to work at the OHHDL.\nThen there’s the hardest part – operational security. How do you train your staff so\nthat they won’t fall prey to social engineering attacks? An old NSA security manual that\nfell into the public domain in the early 1990s gives some insight of the lengths that the\n\n8\n\n\n-----\n\nagencies go to to prevent hostile agencies targeting their staff [8]. The emphasis is not\njust on discretion but on anonymity. This again is sound advice for any organisation\nthat handles real secrets – only a handful of carefully-chosen people should have access to\nthe secrets, their names should not be public, and they should have a low profile online.\nHowever, it is against the Dalai Lama’s policy to have any secret organisations.\nFinally there’s the red team. It’s important to test your defences; we discovered the\nextent of the compromise rapidly when we started monitoring the traffic to and from\nthe OHHDL. One technique is to probe your operational security. Phone up your own\norganisation and see what you can extract with just a little bit of guile; Mitnick’s book\nhas lots of ideas to work with [9]. But there are limits on the level of operational security\nthat can be sustained outside the world of defence and intelligence. Most companies\nwould rather not teach staff to be (even more) unhelpful to customers and to each other,\nand few religions would want to train their headquarters staff to be rude to the faithful.\nWhere there is a dedicated cell of people handling secret data, the regular operational\nsecurity testing effort should be directed at them. The organisation as a whole should\nplace greater emphasis on monitoring outgoing traffic to see whether anything is escaping\nthat shouldn’t, such as the names (or cover names) of staff involved in field work, and of\nsome of the people in the refugee database.\nOverall, our fieldwork brought home to us that a small organisation with few secrets,\nsuch as the OHHDL, is likely to find the engineering costs and administrative overhead\nof doing multilevel security to NSA standards to be unsustainable. It is much more\npractical to keep the secret data on machines in a separate building with no network\nconnection – or better still, to work with pen and paper. The access control, opsec and\nnetwork monitoring can become much more manageable if secret data are kept away from\nnetwork-attached computers.\n\n##### 3.2 Countermeasures for companies\n\nWhat happens when criminals start using social malware to attack companies? No-one\nshould think that it could not happen to them, just because their company is in New York\nor London rather than an Indian hill station! The Tibetan sysadmins were just as capable\nas one finds in the USA or Britain. Indeed, they were probably more aware of the Chinese\nthreat and as a result more alert than a typical company security team. They observed\nthat a security compromise might have taken place, and called expert help. Furthermore,\nthey have permitted us to document what happened. All in all, the Tibetans’ performance\nhas been more effective than we would have expected from a randomly-chosen Western\norganisation.\nThere have been reports before of Chinese industrial espionage against defence companies in the West, notably the 2008 annual report of the U.S.-China Economic and Security\nReview Commission, according to which U.S. government agencies and defence companies have had their unclassified networks compromised by Chinese hackers [11]. But the\nevidence they heard on these attacks was classified, and their report lacks the technical\ndetail that we provide here. A fuller (if still non-technical) story is told by U.S. military\nexpert Timothy Thomas, whose book tracks the history of Chinese information warfare\ndoctrine [10]. According to Thomas, Chinese strategic thinkers consider that a state of\ninformation warfare already exists between them and the West; in an extension of the\n\n9\n\n\n-----\n\nCold War, the West is already attacking China by exporting subversive ideas to it over the\nInternet. Both the attack on the Tibetans described here, and the industrial espionage\nattacks described elsewhere, are consistent with the picture Thomas paints.\nIn view of continuing concerns about industrial espionage, strict separation is indeed\npracticed in some sectors. We are aware of one company that maintains totally separate\nnetworks for design work and external communications; the typical lab has PCs that\nconnect to the CAD/CAM system, and PCs of a different colour that connect to the\nInternet. Draconian physical and procedural controls try to prevent data leakage from\none network to the other. But while such arrangements may be sustainable in a cost-plus\ndefence-contracting environment, they are too expensive for the normal economy.\nSo what will happen when normal criminals start using social malware to steal money\nfrom normal companies?\nA typical medium-sized company, or an operating division of a large company, might\npay several thousand employees and tens of thousands of invoices every month. So payments must be automated. Typically this involves an accounting package feeding a payment application supplied by the company’s bank. A crook could target the payment\nPC directly, or proceed indirectly by taking over the PC of an accounts payable clerk or\npayroll clerk in order to input false data to the accounting system.\nIt is possible to make payment systems malware-proof. Twenty years ago, the second\nauthor worked at a bank that used a cash-management system consisting of an application\nthat was run on a PC XT from a write-protected floppy disk that also contained a copy\nof the operating system, supplied by the bank. This was a good design; it turned the\nPC into a payment appliance and excluded the simultaneous use of any other software,\nincluding malware. Unfortunately, it has been downhill all the way since then! It would\nin our view be prudent practice to run a high-value payment system on a PC that does\nnot contain a browser or email client, or indeed any other software at all. Perhaps within\na few years banks will insist on this, and design payment applications that won’t run\notherwise. (Microsoft sells a stripped-down version of Windows for use in ATMs; perhaps\ntheir market is about to grow.) Perhaps a few years later we will see the payment function\nbecoming a hardware appliance: a tamper-resistant device supplied by the bank that does\nnothing except display payments and signs them when the approval button is pressed.\nCryptographers have mused about such systems for years; perhaps social malware will at\nlast provide their killer application.\nDesigners of accounting systems will also need to make more pessimistic assumptions.\nAt present such systems are designed to deal with the presence of a single dishonest insider,\nusing mechanisms for separation of duty and audit. Their vendors may take the view that\na single infected PC is no worse than a dishonest member of staff. But it is in the nature\nof social malware that a successful attack is likely to compromise many of the machines\nin an office. The implications will require careful study. Banks have a hard enough time\ncoping with the effects of phishing, where the computers of less than 1% of customers\nmay be under hostile control at any one time [12]; how can you run an accounting system\nif half the machines are under hostile control? Will it be possible, for example, to anchor\ninternal controls on a hardened payment PC? Or should companies insist that accounting\nstaff use separate PCs for accounting and for email? Initial discussions with accounting\nstaff suggest that this would be very tiresome. Is virtualisation the answer? Within a few\nyears, we may have to find out.\n\n10\n\n\n-----\n\nOne thing we predict, though, is that the social response to the threat of social malware\nwill be slow and ineffective. This is because of elementary security economics [13]. Banks\nwill try to shift the blame to accounting system providers, and vice versa. The accounting\nvendors will advise customers to lock down user PCs, without being too explicit about\nhow. Companies seeking redress will find themselves up against standard terms and\nconditions whereby both banks and vendors disclaim liability; in many markets they are\noligopolistic suppliers, so may be able to defend these contract terms for some time. The\nbanking regulators have shown that they believe whatever the banks tell them, that they\nare uninterested in protecting bank customers, and in any case they have no expertise in\ninformation security. The initial attacks will affect only a minority of firms, so the rest\nwill prefer to blame the attacks on the victims’ negligence rather than acknowledging that\ntheir own policies need to change. Many companies will rely for advice on their auditors,\nand big audit firms, being ponderous and bureaucratic, give the same advice year-in yearout until litigation or regulation forces change. In short, we predict that the criminals\nwho adapt social malware to fraud will enjoy many years of rich pickings. Indeed, if either\nof us were inclined to crime, this would be what we’d go for.\n\n#### 4 Conclusions\n\nIn this note we described how agents of the Chinese government compromised the computing infrastructure of the Office of His Holiness the Dalai Lama. They used social phishing\nto install rootkits on a number of machines and then downloaded sensitive data. People\nin Tibet may have died as a result. The compromise was detected and dealt with, but\nits implications are sobering. It shows how difficult it is to defend sensitive information\nagainst an opponent who uses social engineering techniques to install malware.\nWe have described this social malware attack here and considered its consequences.\nAlthough the attack we describe in this case study came from a major government, the\ntechniques their agents used are available even to private individuals and are quite shockingly effective. In fact, neither of the two authors is confident that we could keep secrets\non a network-connected machine that we used for our daily work in the face of determined\ninterest from a capable motivated opponent. The necessary restrictions on online activity\nwould not be consistent with effective academic work.\nOrganisations that maintain sensitive information on network-attached computers and\nthat may have such opponents had better think long and hard. The implications are serious already for people and groups who may become the target of hostile state surveillance.\nIn the medium term we predict that social malware will be used for fraud, and the typical\ncompany has really no defence against it. We expect that many crooks will get rich before\neffective countermeasures are widely deployed.\n\n**Acknowledgements: The first author is supported by a generous grant from the I3P**\nConsortium. We are also grateful to a number of colleagues, some of whom wish to remain\nanonymous, and most of all to the Office of His Holiness the Dalai Lama for permission to\nwrite this report so that others may learn from their experience. Established governments\nappear unwilling to discuss their experience of such attacks; the Tibetan openness is by\ncomparison truly enlightened.\n\n11\n\n\n-----\n\n#### References\n\n[1] http://www.tibet.com was already active when http://www.archive.org\nopened spidered it in 1996; http://www.tibet.net has been active since 2001\n\n[2] “Tracking Ghostnet: Investigating a Cyber Espionage Network”, in Information\n_Warfare Monitor JR02-2009, 29 Mar 2009_\n\n[3] http://www.openwall.com/john/\n\n[4] “Social phishing”, Tom Jagatic, Nathaniel Johnson, Markus Jakobsson, Filippo\nMenczer, in Communications of the ACM v 50 no 10 (Oct 2007) pp 94–100\n\n[5] “Tor: anonymity online”, at http://www.torproject.org/\n\n[6] “Dynaweb”, at http://www.dit-inc.us/dynaweb\n\n[7] ‘Security Engineering – A Guide to Building Dependable Distributed Systems’,\nRoss Anderson, Wiley 2008\n\n[8] ‘The NSA Security Manual’, at http://www.cl.cam.ac.uk/~rja14/Papers/\n```\n   nsaman.pdf\n\n```\n[9] ‘The Art of Deception: Controlling the Human Element of Security’, Kevin Mitnick, William Simon and Steve Wozniak, Wiley 2002\n\n[10] ‘Dragon Bytes: _Chinese Information-War Theory and Practice’, Timothy L._\nThomas, Foreign Military STudies Office, Fort Leavenworth, Kansas, 2004\n\n[11] ‘2008 REPORT TO CONGRESS of the U.S.-CHINA ECONOMIC AND SECU_RITY REVIEW COMMISSION’, 110th Congress, Nov 2008, at http://www._\n```\n   uscc.gov/annual_report/2008/annual_report_full_08.pdf\n\n```\n[12] “Closing the Phishing Hole – Fraud, Risk and Nonbanks”, Ross Anderson, at\n_Nonbanks in the Payment System, Santa Fe, NM, May 2007; available from http:_\n```\n   //www.ross-anderson.com\n\n```\n[13] ‘Security Economics and the Internal Market’, Ross Anderson, Rainer B¨ohme,\nRichard Clayton and Tyler Moore, ENISA, March 2008; shortened version in\n_Workshop on the Economics of Information Security (WEIS 08); available from_\n```\n   http://www.ross-anderson.com\n\n```\n12\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.cl.cam.ac.uk/techreports/UCAM-CL-TR-746.pdf"
    ],
    "report_names": [
        "UCAM-CL-TR-746.pdf"
    ],
    "threat_actors": [
        {
            "id": "3cc6c262-df23-4075-a93f-b496e8908eb2",
            "created_at": "2022-10-25T16:07:23.682239Z",
            "updated_at": "2025-03-27T02:02:09.920109Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "GhostNet",
                "Snooping Dragon"
            ],
            "source_name": "ETDA:GhostNet",
            "tools": [
                "AngryRebel",
                "Farfli",
                "Gh0st RAT",
                "Gh0stnet",
                "Ghost RAT",
                "Ghostnet",
                "Moudour",
                "Mydoor",
                "PCRat",
                "Remosh",
                "TOM-Skype"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e91dae30-a513-4fb1-aace-4457466313b3",
            "created_at": "2023-01-06T13:46:38.974913Z",
            "updated_at": "2025-03-27T02:00:02.967085Z",
            "deleted_at": null,
            "main_name": "GhostNet",
            "aliases": [
                "Snooping Dragon"
            ],
            "source_name": "MISPGALAXY:GhostNet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041404,
    "ts_creation_date": 1238523349,
    "ts_modification_date": 1238523526,
    "files": {
        "pdf": "https://archive.orkl.eu/c79955cffa52bfa23d4255615fca253b9bbd385f.pdf",
        "text": "https://archive.orkl.eu/c79955cffa52bfa23d4255615fca253b9bbd385f.txt",
        "img": "https://archive.orkl.eu/c79955cffa52bfa23d4255615fca253b9bbd385f.jpg"
    }
}