{
    "id": "814a890f-0978-4c04-a2ee-2630950fe3f7",
    "created_at": "2023-01-12T15:08:54.520489Z",
    "updated_at": "2025-03-27T02:05:19.094502Z",
    "deleted_at": null,
    "sha1_hash": "eb3c3780f04fd5e71e101c7d944520ee8626775e",
    "title": "2018-04-18 - Stresspaint Malware Targeting Facebook Credentials",
    "authors": "",
    "file_creation_date": "2022-05-28T17:51:24Z",
    "file_modification_date": "2022-05-28T17:51:24Z",
    "file_size": 110938,
    "plain_text": "# Stresspaint Malware Targeting Facebook Credentials\n\n**[security.radware.com/malware/stresspaint-malware-targeting-facebook-credentials/](https://security.radware.com/malware/stresspaint-malware-targeting-facebook-credentials/)**\n\n[THREAT ALERTS](https://security.radware.com/security/threat-advisories-attack-reports)\nStresspaint Malware Targeting Facebook Credentials\n\n[StressPaint Malware Targeting Facebook Credentials](https://security.radware.com/getattachment/Security/Malware-Alerts/1957/ERT-Alert-StressPaint-Malware.pdf.aspx?lang=en-US)\nRadware’s threat research group detected malicious activity via internal feeds of a group collecting user credentials and payment methods from\nFacebook users.\n\n[Download a Copy Now](https://security.radware.com/getattachment/Security/Malware-Alerts/1957/ERT-Alert-StressPaint-Malware.pdf.aspx?lang=en-US)\n\n## Abstract\n\nOn April 12, 2018, Radware’s threat research group detected malicious activity via internal feeds of a group\ncollecting user credentials and payment methods from Facebook users across the globe. The group manipulates\nvictims via phishing emails to download a painting application called ‘Relieve Stress Paint.’ While benign in\nappearance, it runs a malware dubbed ‘Stresspaint’ in the background.\n\nWithin a few days, the group had infected over 40,000 users, stealing tens of thousands Facebook user\ncredentials/cookies. This rapid distribution and high infection rate indicates this malware was developed\nprofessionally. The group is specifically interested in users who own Facebook pages and that contain stored\npayment methods.\n\nWe suspect that the group’s next target is Amazon as they have a dedicated section for it in the attack control panel.\nRadware will continue to analyze the campaign and monitor the group’s activity. Prior to publication of this alert,\nRadware has detected another variant of the malware and saw indication of this new version in the control panel.\n\n\n-----\n\nFigure 1 & 2: Breakdown of malware by infections and geographies\n\n\n**Figure 1 & 2: Breakdown of malware by infections and geographies**\n\n## Infection Process\n\nRadware suspects the infection campaign is via phishing emails or directly on Facebook itself (Radware has not yet\nreceived one). Recipients are led to believe they are going to legitimate sites (i.e. AOL) to download a legitimate\napplication, however the site is really a Unicode domain of the AOL site.\n\n\n-----\n\n**Figure 3: The phony website**\n\nThe site advertises an application called “Relieve Stress Paint” and contains a download link.\nWhile the application or website are not yet visible by search engines, specific strings in the site led Radware to a\nsite on Google called ‘aol.net.’ This is not really ‘aol.net’ but rather a Unicode representation of aol.net and its true\naddress is ‘xn--80a2a18a.net.’\n\n\n-----\n\n**Figure 4: The malicious website as indexed by Google**\n\n## The Malware\n\nOnce the file is downloaded and executed, a window is opened showing the “legitimate program” to the user. This is\na paint program that changes colors and line size for each click.\n\n\n-----\n\n**Figure 5: Screenshot of paint program**\n\nIn the background, the malware immediately starts running and dropping files on the system.\n\n**Temp\\\\DX.exe - the main module of the malware that remains persistent on the system**\n**Temp\\\\updata.dll - possibly used later on for credential/cookie stealing purposes**\n**Desktop\\RelieveStressPaint.lnk – a desktop link to run the original downloaded executable. Supports the**\nlegitimacy of the program.\n**AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data11111**\n**AppData\\Local\\Google\\Chrome\\User Data\\Default\\Cookies11111**\n\nBoth are copies of the original files that are stored on the chrome folder and are used for cookies/saved password\nstealing and are immediately deleted.\n\nNext, a number of registry keys are also created/modified.\n\n**HKLM\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\Updata - with the value of DX.exe**\n\n**[parameter]. We have seen two different parameters which may indicate two different infection campaigns that**\nthe author wants to track. This is also represented in the control panel.\n**HKCU\\Software\\Classes\\VirtualStore\\MACHINE\\SOFTWARE\\RelieveStressPaint\\guid - with the value of**\nuser GUID. This is saved in the following format [5 random letters/numbers]HHMMSSYYYYMMDD.\n\n## Facebook Data Theft\n\nInformation is stolen when the malware is run for the first time, if the user runs the application again (using the .lnk\non his desktop), and every restart of the computer. It is done by copying the content of Chrome browser cookies and\nlogin data files to a new location and querying the data from there. Once saved login credentials (username +\npassword) or Facebook cookies are found, they are sent encrypted to the C2 in the following format:\n**{\\\"fid\\\":\\\"%s\\\",\\\"fpwd\\\":\\\"%s\\\",\\\"cookies\\\":\\\"%s\\\",%s}**\n\n\n-----\n\n**Figure 6: Exfiltration of compromised user credentials to the C&C server**\n\nOn other requests, general information on the infected machine is sent in the following format:\n**{\\\"guid\\\":\\\"%s\\\",\\\"os\\\":\\\"%s\\\",\\\"agent\\\":\\\"%s\\\",\\\"Auto\\\":%s,\\\"flag\\\":%s,\\\"data\\\":%s,\\\"seller\\\":\\\"%s\\\"}**\n\nOnce the credentials are validated and access is granted, additional data is collected, such as number of friends,\nwhether the account manages a page or not, and if the payment method is configured for the account. This is done\nby accessing several predefined Facebook URLs which return this information. All requests are accomplished using\nthe hard coded User agent:\n**Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87**\n**Safari/537.36**\n\n## Stealth\n\n\n-----\n\nThe malware authors decided to leverage a specific data theft method to stay hidden on the system as long as they\ncan.\n\nNo general credential stealing is done which might raise some flags by security vendors\nThe cookies and saved password theft is only accomplished from querying copies of the original cookies/login\ndata files\nThe process that is in charge of the credential theft resides on the system for less than a minute each time\n\nSince they are interested only in Facebook access at this stage, they get it either from the first infection saved\nlogin/cookies or when the computer is restarted.\n\n## Control Panel\n\n[The operators of this botnet decided to use an open source Chinese CMS called Layuicms2.0. They have](https://github.com/BrotherMa/layuicms2.0)\ncustomized it to show information of the botnet outbreak such as stolen credentials and cookies, but also other\nmetrics and the ability to export Facebook data. The panel also features a section for Amazon, but it is not yet\nfunctional. Radware believes that this implies that the group’s next target will be Amazon.\n\n\n-----\n\n**Figure 7: Control panel (translated from Chinese by Google Chrome)**\n\n\n-----\n\n**Figure 8: Users’ data**\n\n## Possible Impact\n\nSince the group is at the data collection phase, Radware can only speculate what the operators of this botnet do with\nthe stolen credentials.\n\n**Monetization - simply selling stolen credentials to malicious actors and cyber-criminals. Online identities have**\nbeen traded over the dark web for some time.\n**Ransom – extort victims by threating them to reveal personal information like photos etc.**\n**Espionage - take advantage of the possessed credentials to track specific people’s activity, network and**\nconversations\n**Profit - use the stolen credentials and payment information to shop on eCommerce sites and services**\n**Identity Theft – reuse the credentials to log-in into other accounts or services via Facebook.**\n\n\n-----\n\nHowever, the fact that this group is looking specifically for accounts with pages, and members with large networks,\nlead us to consider a couple of additional options.\n\n**Malvertising – with the stolen credentials, access to web pages and payment details, the group can launch**\nmalicious advertisement campaigns, whether to make profit or spread more malwares. They can use small\namounts from each user without raising suspicion and collect a critical mass to launch any activity.\n**Propaganda – with the same information, instead of advertising a product or a service, they can run a**\ncampaign to promote their agenda and reveal people/personal identities\n\n## Steps to Protect From Data Harvesting Malwares\n\nDetect new zero-day malware using cutting-edge machine learning algorithms\nBlock new threats by integrating with existing protection mechanisms and defense layers\nReport on malware infection attempts in your network\nAudit defenses against new exploits and see where you are vulnerable\n\nAs this malware rapidly expands, the group will certainly continue to try to find new ways to utilize the stolen assets.\nSuch groups continuously create new malware and mutations to bypass security controls. Radware recommends\nindividuals and organizations to update their current password and only download applications from trusted sources.\nRadware’s [Malware Research Group will keep monitoring and analyzing new threats to provide protection to its](https://www.radware.com/products/cloud-malware-protection-service/)\ncustomers.\n\n## Disclosure\n\n_\"We have brought our research findings to the Facebook information security team, including all the stolen_\n_credentials of the accounts. Facebook is investigating this operation and has provided the following statement._\n\n_[We encourage people to check the mails they receive for trusted domains. Facebookmail.com is a common domain](http://facebookmail.com/)_\n_that Facebook uses to send notifications when we detect an attempt to log in to your account or change a password._\n_If you're unsure if an email you received was from Facebook, you can check its legitimacy by visiting_\n_[facebook.com/settings to view a list of security-related emails that have been recently sent. We are investigating](https://facebook.com/settings)_\n_these malware findings and we are taking steps to help protect and notify those who are impacted_\n\n_“We maintain a number of automated systems to help stop harmful links and files from appearing on Facebook and_\n_in Messenger. If we suspect your computer is infected with malware, we will provide you with a free anti-virus scan_\n_[from our trusted partners. We share tips on how to stay secure and links to these scanners on facebook.com/help.”](http://facebook.com/help)_\n– Pete Voss, Facebook communications manager\n\nRadware also reached out to the domain registrar to cease and decease this activity but as of time of publication\nreceived no response.\n\n[Click here to download a copy of the Malware Threat Alert.](https://security.radware.com/getattachment/Security/Malware-Alerts/1957/ERT-Alert-StressPaint-Malware.pdf.aspx?lang=en-US)\n\n[Download Now](https://security.radware.com/getattachment/Security/Malware-Alerts/1957/ERT-Alert-StressPaint-Malware.pdf.aspx?lang=en-US)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-04-18 - Stresspaint Malware Targeting Facebook Credentials.pdf"
    ],
    "report_names": [
        "2018-04-18 - Stresspaint Malware Targeting Facebook Credentials.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536134,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653760284,
    "ts_modification_date": 1653760284,
    "files": {
        "pdf": "https://archive.orkl.eu/eb3c3780f04fd5e71e101c7d944520ee8626775e.pdf",
        "text": "https://archive.orkl.eu/eb3c3780f04fd5e71e101c7d944520ee8626775e.txt",
        "img": "https://archive.orkl.eu/eb3c3780f04fd5e71e101c7d944520ee8626775e.jpg"
    }
}