{
    "id": "81621df2-6c80-46e9-9a42-ad857a3eadc5",
    "created_at": "2023-01-12T14:59:33.30273Z",
    "updated_at": "2025-03-27T02:05:59.907125Z",
    "deleted_at": null,
    "sha1_hash": "ac64741f0066002efbb6e67189bfa6f53c10d6a0",
    "title": "2022-04-18 - Trends in the Recent Emotet Maldoc Outbreak",
    "authors": "",
    "file_creation_date": "2022-05-28T15:14:42Z",
    "file_modification_date": "2022-05-28T15:14:42Z",
    "file_size": 229538,
    "plain_text": "# Trends in the Recent Emotet Maldoc Outbreak\n\n**[fortinet.com/blog/threat-research/Trends-in-the-recent-emotet-maldoc-outbreak](https://www.fortinet.com/blog/threat-research/Trends-in-the-recent-emotet-maldoc-outbreak)**\n\nApril 18, 2022\n\nEmotet is a malware family that steals sensitive and private information from victims'\ncomputers. The malware has infected more than a million devices and is considered one of\nthe most dangerous threats of the decade.\n\n[In addition to analyzing threats, FortiGuard Labs also focuses on how malware spreads. We](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguardlabs)\nhave observed that the recent Emotet outbreak is being spread through a variety of\nmalicious Microsoft Office files, or maldocs, attached to [phishing emails. Once a victim opens](https://www.fortinet.com/resources/cyberglossary/phishing?utm_source=blog&utm_medium=blog&utm_campaign=phishing)\nthe attached document, a VBA Macro or Excel 4.0 Macro is used to execute malicious code\nthat downloads and runs the Emotet malware.\n\nIn this blog, we will focus on what these malicious documents look like and how they drop\nEmotet malware onto a victim's local disk. We will first look at the samples captured in this\ncampaign and then examine their propagation trends.\n\n\n-----\n\n**Affected Platforms: Microsoft Windows**\n**Impacted Users: Windows users**\n**Impact: Controls victim's device and collects sensitive information**\n**Severity Level: Critical**\n\n## Phishing Emails with Malicious Attachment\n\n[The recent Emotet outbreak uses phishing emails combined with social engineering to trick](https://www.fortinet.com/resources/cyberglossary/social-engineering?utm_source=blog&utm_campaign=social-engineering)\n[victims into loading the malware onto their devices. These emails often include \"Re:\" or \"Fw:\"](https://www.fortinet.com/resources/cyberglossary/malware?utm_source=blog&utm_campaign=malware)\nin the subject line, as shown in Figure 1 and 2, to disguise the email as a reply or forwarded\nmessage to help convince the target that the email is legitimate.\n\nFigure 1: Reply email with an attachment\n\nFigure 2: Forwarded email with .xls file attachment\n\nFigure 3 showcases another technique, where the malicious document is packed into a ZIP\narchive with a password that is attached to an email, with the password included in the body\nof the text.\n\nFigure 3: Email with a password-protected ZIP archive attachment\n\n## Examining the Malicious Excel Files and Word Documents\n\nThe attached Excel files and Word documents contain malicious macros. Once opened, they\ndisplay an image requesting the victim to click the \"Enable Content\" button in the security\nwarning bar. This enables the malicious macro to be executed.\n\nThe images below show the techniques used to trick victims into clicking the \"Enable\nContent\" button in the Excel files and Word documents used in this campaign. Figure 4\nshows screenshots of an opened Word document and Figure 5 is of the opened Excel file.\n\nFigure 4: Word document content when opened\n\nFigure 5: Excel file content when opened\n\n## Analyzing the Malicious Macros and their Behaviors\n\nMacros in Microsoft Office files are usually written in VBA (Visual Basic for Applications). In\nthis case, the Word documents contain malicious VBA code while the Excel files use Excel\n4.0 Macro in addition to VBA Macro.\n\nWe captured five different samples connected with this Emotet campaign that contain\ndifferences in the macro code and execution flow. For identification purposes, we have given\neach sample a tag name, which is from when the sample first appeared. The tag name\n\n\n-----\n\nconsists of two parts, the year prefix and a suffix with the week of the month, connected by\nan underscore.\n\nThe first sample appeared in the third week of November 2021 and its tag name is\n\"2021_NovW3\". It is an Excel file or Word document with VBA Macro. The second is an\nExcel file using Excel 4.0 Macro. It appeared in the fourth week of November 2021 with the\ntag name \"2021_NovW4\". The third sample is a Word document with a VBA Macro with the\ntag name of \"2021_DecW2\". The fourth sample is an Excel file with an Excel 4.0 Macro. It’s\ntag name is \"2021_DecW4\". The fifth sample is an Excel file with a VBA Macro and the tag\nname of \"2022_FebW2\".\n\n**Tag Name** **File Type** **Macro Type**\n\n2021_NovW3 Excel/Word VBA Macro\n\n2021_NovW4 Excel Excel 4.0 Macro\n\n2021_DecW2 Word VBA Macro\n\n2021_DecW4 Excel Excel 4.0 Macro\n\n2022_FebW2 Excel VBA Macro\n\nBelow is an analysis of the malicious macro component of each captured sample.\n\n### 2021_NovW3:\n\nThis sample has a VBA function called \"Workbook_Open()\" or \"Document_Open()\" that is\nexecuted automatically when the file is opened. It then calls another function to write script\ndata to a VBS file and save it in the \"C:\\ProgramData\\\" folder. Next, it uses \"Wscript.exe\" to\nexecute the VBS file.\n\nFigure 6: VBA code used to execute the dropped VBS file\n\nIn the VBS file it generates a PowerShell code snippet to download the Emotet malware dll\ninto the \"C:\\ProgramData\\\" folder and then execute it using \"regsvr32.exe\".\n\nFigure 7: Script code in the dropped VBS file\n\n### 2021_NovW4:\n\n\n-----\n\nThis is an Excel file that uses formulas on an Excel 4.0 Macro sheet instead of a VBA Macro\nto execute malicious code. As shown in Figure 8, some sheets are hidden, including the one\nthat contains the malicious formulas. Cell A1 in sheet \"FEGFL\" is named \"Auto_Open\" and\nincludes a built-in macro that automatically runs the formula from that cell once the file is\nopened.\n\nThis macro sheet includes formulas that call the API \"URLDownloadToFileA\" to download the\nEmotet malware from different URLs. It attempts to download the Emotet malware from the\nURL in each formula until a download is successful. The Emotet malware is a dll file saved\nwith an .ocx file extension and executed using \"regsvr32.exe\".\n\nFigure 8: The Macro Sheet is hidden and cell A1 is named \"Auto_Open\"\n\n### 2021_DecW2:\n\nThis VBA code includes a function called \"AutoOpen()\" that automatically runs a macro when\nthe document is opened. In this function, it saves itself as an HTA (HTML Application) file in\ntext format, as shown in Figure 9. At the same time, script data is displayed in the content\ntext area below the picture that is hidden with a minimum font size and white font color (the\nfont color has been changed to red in Figure 9 for easier viewing). Since the HTA file is in\ntext format, the script data in the content text area is the only part included in the file. To\nexecute the HTA file, \"explorer.exe\" on Windows system is used in the VBA Macro.\n\nFigure 9: VBA code to save ActiveDocument as HTA file\n\nFigure 10: VBA code to execute the dropped HTA file\n\nScript code in the HTA file extracts JavaScript code to download the Emotet malware. The\nEmotet malware is saved to the \"C:\\Users\\Public\" folder as a JPG file, but it is actually a dll\nfile. In the end, the Emotet malware dll is executed with \"rundll32.exe\".\n\nFigure 11: Script code in the HTA file\n\n### 2021_DecW4:\n\nIn the hidden macro sheet \"Macro1\", cell F1 is named \"Auto_Open\" to automatically run the\nformula when the file is opened. There is normal text in the cells below cell F1 until cell F18,\nwhich contains the formula to execute. The simple formula, shown in Figure 12, uses\n\"mshta.exe\" to execute an HTML URL. The web page of HTML URL is protected by HTML\nGuardian, a tool that encrypts source code.\n\nFigure 12: Formula and \"Auto_Open\" in macro sheet\n\nAfter decrypting the HTML source code, there is a VBScript code snippet obfuscated by the\nstring \"{GOOGLE}\", as shown in Figure 13. It runs a PowerShell code snippet to download\nand execute script from a PNG URL The PNG URL is not an image file but a PowerShell\n\n\n-----\n\nscript file that contains multiple URLs to download Emotet malware. Finally, the Emotet\nmalware is saved as a dll file in the \"C:\\Users\\Public\\Documents\\\" folder and executed using\n\"rundll32.exe\".\n\nFigure 13: VBScript code used to run a PowerShell script\n\n### 2022_FebW2:\n\nThis sample has the same code and execution flow as \"2021_DecW4\". But instead of using\nan Excel 4.0 Macro, it uses a VBA Macro to execute its malicious behaviors. Figure 14\nshows the content in the autorun function \"AutoOpen()\". Although there are lots of\ncomments, the VBA code is very simple, using \"mshta.exe\" to execute an HTML URL. As the\nscript code and subsequent process in the HTML URL is identical to the contents in\n\"2021_DecW4\", we can look at it for more details.\n\nFigure 14: VBA code that an HTML URL is executed\n\n## Attack Trends in the Latest Emotet Campaign\n\nEmotet was first discovered in 2014 and continues to attack victims. The latest Emotet\ncampaign broke out in mid-November of 2021 and is spread using malicious documents\n[attached to phishing emails. FortiGuard Labs has been tracking these malicious documents](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguardlabs)\nas well as the number of variants used to evade detection in this campaign. Figure 15 shows\nthe daily timestamps for Emotet maldocs used from mid-November 2021 to March 2022. All\nthe samples mentioned in the previous section emerged during this period.\n\nThe first attack appeared on November 16, 2021. After that, it spread different types of\nmalicious documents every week until the Christmas break. Once the break ended on\nJanuary 12, it surged with more frequent and consistent attacks, releasing a large number\nand variety of malicious documents. From the end of February through the end of March, it\nturned to using the same type of malicious document (2021_NovW4) with different phishing\npicture templates. After February 28th, new malicious documents appeared every day except\nfor weekends, with only one or two days off.\n\nFigure 15: Timeline of the latest Emotet Maldoc campaign\n\n## Conclusion\n\nIn the previous section, we showed that some types of malicious documents have more\ntimestamps on the timeline than others. The pie chart in Figure 16 is based on the\noccurrence frequency of timestamps, showing the usage rate of each malicious document in\nthis campaign. According to this chart, \"2021_NovW4\" has been the most active, involving\nmore than 50% of the malicious documents discovered. The second most is \"2021_NovW3\",\nconsisting of 27% Excel files and 6% Word documents. It is worth mentioning that Excel files\n\n\n-----\n\naccounted for 93% of all malicious documents, much higher than Word documents at only\n7%. One of the possible reasons is that the Excel 4.0 Macro only works with Excel files.\nBecause if this, users should be especially cautious about suspicious emails with an\nattached Excel file from an unknown sender.\n\nFigure 16: Types of malicious documents in the campaign\n\n[FortiGuard Labs also collected the Emotet malware payloads during this period. Figure 17](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguardlabs)\nshows the weekly counts of Emotet malware, with timestamps for each Emotet maldoc in the\ntimeline displayed below the bar chart. Weeks with high counts match when malicious\ndocuments appeared, while those without malicious documents were almost silent.\n\nFigure 17: Count of Emotet malware per week\n\nThe graph also shows that all malicious documents detected after Christmas were Excel\nfiles. Using an Excel file is more flexible because its macro type can be VBA Macro, Excel\n4.0 Macro, or both. One of the benefits is that Excel 4.0 Macro, an older technique, bypasses\nantivirus detection more easily than a VBA Macro.\n\nAs shown in the timeline, Emotet malware has primarily been spread since March 2022\nthrough the malicious Excel file \"2021_NovW4\", which uses the Excel 4.0 Macro. We believe\nthat the authors prefer to use Excel files with Excel 4.0 Macro for malicious documents to\nreduce detection by antivirus engines.\n\n## Fortinet Protections\n\nFortinet customers are protected from this malware by FortiGuard’s [Web Filtering, AntiVirus,](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/web-filtering.html?utm_source=blog&utm_campaign=web-filtering)\n[FortiMail,](https://www.fortinet.com/products/email-security/fortimail.html?utm_source=blog&utm_campaign=fortimail-main-page) [FortiClient,](https://www.fortinet.com/products/endpoint-security/forticlient.html?utm_source=blog&utm_campaign=endpoint-web-page) [FortiEDR, and CDR (content disarm and reconstruction) services:](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n\nThe malicious macros inside the Excel sample can be disarmed by the FortiGuard CDR\n(content disarm and reconstruction) service.\n\n[FortiEDR detects the Word and Excel files and Emotet dll file as malicious based on their](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\nbehavior.\n\nFortinet customers are protected from these malicious documents and malware by\n[FortiGuard AntiVirus, which is included in FortiMail. It detects all malicious macro file types,](https://www.fortinet.com/products/email-security/fortimail.html?utm_source=blog&utm_campaign=fortimail-main-page)\nincluding Excel 4.0 Macro samples.\n\nAll malicious documents described in this report are detected by FortiGuard AntiVirus as\nfollows:\n\nVBA/Agent.8095!tr.dldr\n\nVBA/Agent.5A47!tr\n\nVBA/Bomber.46B3!tr.dldr\n\n\n-----\n\nXF/Agent.NN!tr.dldr\nXF/CoinMiner.Z!tr\nMSExcel/Agent.DVP!tr.dldr\nHTML/Sabsik.FL!tr\n\nThe Emotet malware payloads are detected by FortiGuard AntiVirus as follows:\n\nW32/Emotet.EHR!tr\nW32/GenKryptik.FSPR!tr\nW32/Emotet.1156!tr\nW32/Agent.FSUQ!tr\nW32/Kryptik.HNXJ!tr\nW32/Emotet.1143!tr\nW32/Emote.CQ!tr\n\nIn addition, Fortinet has multiple solutions designed to train users on how to understand and\ndetect phishing threats:\n\nThe [FortiPhish Phishing Simulation Service uses real-world simulations to help organizations](https://www.fortinet.com/products/phishing-simulation)\ntest user awareness and vigilance to phishing threats and to train and reinforce proper\npractices when users encounter targeted phishing attacks.\n\nWe also suggest that organizations have their end users go through our FREE NSE\ntraining: [NSE 1 – Information Security Awareness. It includes a module on Internet threats to](https://training.fortinet.com/local/staticpage/view.php?page=nse_1&utm_source=blog&utm_campaign=nse-1)\ntrain end users on how to identify and protect themselves from phishing attacks.\n\n## IOCs\n\n### Malicious documents (SHA256):\n\n3e97f09fc53890ba2d5ae2539b5c8df372ed2506ed217d05ff2cf8899d15b8e6\n\n2ecc2a48fa4eadb80367f69799277c54a0fe6dd2220a6a2dd7b81cfba328ed19\n\ned180371dfec2186148bbcab99102ce45fb1fcc3764b384c2abcaceba2fa65b6\n\n719900e330cecd87250ac1f6c31f2d6f42f226294fb011cf47c442f8d2b7455b\n\n3ccb809cd97cc08ff380600dcaa5244ef2abd7afd9e7a9f2df7c4e28fee637f0\n\ne167804a6f36dc99e96909bcededa8a733dd8633037b8b52e8d7881d20446c16\nbd9b8fe173935ad51f14abc16ed6a5bf6ee92ec4f45fd2ae1154dd2f727fb245\n57fcbb058fc0dfe0cce29676569f2e30d1f8a59345ab161d8183d0769428f4e2\n\n### Emotet malware (SHA256):\n\n\n-----\n\n4900d1e66cef8507b265c0eec3ff94cb5f774847d969e044dc8ccd72334181f5\n2dcfcaaf3ccd8e06043e651cd5b761ae50f3463c6420d067b661969e0500dce2\n52f6fce27184b61ceb3c02d360e04dc1489c4136a0ffcbb39c50d27474e4283b\nccbefa930edc4d5b5b34a5dea16c73c9d3f3b4167406c3ae841bc71fce45c68e\ncd105196cbf17f11dbff2b623f5bfaf9ef8d91f2598fe3bc2a7da192c2cee457\n9535c3f02ee8a47ad1392f36a1ff44a3d5cb067ecef748e63e1628bc489c9d90\nca2b7c0f2a2a42ce586d63ccfcf131f8b99d73521742cc15d6255e76f9278fbc\nd5f4292d4f5661ce12dd8384cfbb22a3d17908290ba80d9de3a1697064d248a7\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-18 - Trends in the Recent Emotet Maldoc Outbreak.pdf"
    ],
    "report_names": [
        "2022-04-18 - Trends in the Recent Emotet Maldoc Outbreak.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535573,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653750882,
    "ts_modification_date": 1653750882,
    "files": {
        "pdf": "https://archive.orkl.eu/ac64741f0066002efbb6e67189bfa6f53c10d6a0.pdf",
        "text": "https://archive.orkl.eu/ac64741f0066002efbb6e67189bfa6f53c10d6a0.txt",
        "img": "https://archive.orkl.eu/ac64741f0066002efbb6e67189bfa6f53c10d6a0.jpg"
    }
}