{
    "id": "81a6830b-f141-443b-9f32-e3bae6c04e76",
    "created_at": "2023-01-12T15:04:04.644347Z",
    "updated_at": "2025-03-27T02:09:18.409548Z",
    "deleted_at": null,
    "sha1_hash": "1cb6a595cdcecb1e74be2d683743b3ce76c79527",
    "title": "2022-02-08 - Ransomware Spotlight- LockBit",
    "authors": "",
    "file_creation_date": "2022-05-28T18:14:57Z",
    "file_modification_date": "2022-05-28T18:14:57Z",
    "file_size": 2170504,
    "plain_text": "# Ransomware Spotlight: LockBit\n\n**[trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-lockbit](https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-lockbit)**\n\nLockBit\n\nBy Trend Micro Research\n\nThe LockBit intrusion set, tracked by Trend Micro as Water Selkie, has one of the most active ransomware operations today. With LockBit’s\nstrong malware capabilities and affiliate program, organizations should keep abreast of its machinations to effectively spot risks and defend\nagainst attacks.\n\n\n-----\n\nView infographic of \"Ransomware Spotlight: LockBit\"\n\n[LockBit first emerged as the ABCD ransomware on September 2019, which was improved to become one of the most prolific ransomware](https://www.trendmicro.com/vinfo/us/security/definition/ransomware)\nfamilies today.\n\nThrough their professional operations and strong affiliate program, LockBit operators proved that they were in it for the long haul. Thus, being\nacquainted with their tactics will help organizations fortify their defenses for current and future ransomware attacks.\n\n## What do organizations need to know about LockBit?\n\n[LockBit uses a ransomware-as-a-service (RaaS) model and consistently conceived new ways to stay ahead of its competitors. Its double](https://www.trendmicro.com/vinfo/us/security/definition/ransomware-as-a-service-raas)\nextortion methods also adds more pressure to victims, raising the stakes of their campaigns.\n\nOne of its notable tactics was the creation and use of the malware StealBit, which automates data exfiltration. This tool was seen with the\nrelease of [LockBit 2.0, the latest known version, which has been touted by its creators for having the fastest and most efficient encryption](https://www.trendmicro.com/en_us/research/21/h/lockbit-resurfaces-with-version-2-0-ransomware-detections-in-chi.html)\namong its competition. In October 2021, LockBit also expanded to Linux hosts, specifically ESXi servers, in its release of Linux-ESXI Locker\nversion 1.0. This variant is capable of targeting Linux hosts and could have a big impact on targeted organizations.\n\nAnother side of LockBit’s operations is its recruitment of and marketing to affiliates. It has been known to hire network access brokers,\ncooperate with other criminal groups (such as the now defunct Maze), recruit company insiders, and sponsor underground technical writing\ncontests to recruit talented hackers. Using such tactics, the LockBit group has built itself into one of the most professional organized criminal\ngangs in the criminal underground.\n\n[The tactics we’ve enumerated are evident in their attack on Accenture in 2021. Experts suspect that an insider helped the group gain access to](https://www.zdnet.com/article/accenture-says-lockbit-ransomware-attack-caused-no-impact-on-operations-or-clients/)\nthe firm’s network. LockBit also reportedly published a small part of the stolen data from the attack.\n\n\n-----\n\nFigure 1. LockBit’s timeline of notable activities\n\n## The impact of LockBit and insights from Water Selkie\n\nOur investigation into the intrusion set behind LockBit, which we track as Water Selkie, reveals the effectiveness and impact of the tactics we\nhave discussed. The key takeaways are the following:\n\n**The malware’s performance is a strong selling point. The malware’s speed and capabilities are widely known because the group**\nuses them as selling points. The threat group’s efforts to publicize their malware’s capabilities have established it as the ransomware with\none of the fastest and most efficient encryption methods.\n**It considers external pressures and issues faced by its potential targets. Water Selkie’s operators have indicated a preference for**\nvictims in Europe who fear breaching EU’s General Data Protection Regulation (GDPR). They continue to also consider the US to have\nlucrative targets, but see that data privacy laws can affect their chances of getting a successful payout. In general, they are attuned to\ngeopolitical issues that they can use to their advantage.\n**Banks on the strength of its affiliate program. As mentioned earlier, a contributing factor in LockBit’s success is how well it recruits**\ntrustworthy and capable affiliates. Evidence also suggests that several of its affiliates are involved in multiple RaaS operations, which\nhelps Water Selkie innovate and keep up with its competition. In return, Water Selkie prides itself on its professional operation that can\nbe trusted by affiliates.\n**It has more in store for the future. Water Selkie clearly ramped up operations in the second half of 2021. We see that the intrusion set**\nwill either maintain or increase their level of activity in the first half of 2022. Organizations should also expect more supply chain attacks\n[in the future according to an interview conducted with one of LockBit’s operators.](https://ke-la.com/lockbit-2-0-interview-with-russian-osint/)\n\nWith LockBit affiliates being likely involved in other RaaS operations, its tactics slipping into those of other ransomware groups isn’t a farfetched notion. Organizations would therefore benefit from recognizing LockBit’s tactics, techniques, and procedures (TTPs) laid out in the next\nsections.\n\n## Top affected industries and countries\n\nIn this section, we discuss Trend Micro™ Smart Protection Network™ data, which are detections of LockBit attempts to compromise\norganizations. LockBit has been detected all over the globe, with the US seeing most of the attack attempts from June 2021 to January 20,\n2022, followed by India and Brazil. Like many ransomware families LockBit avoids Commonwealth of Independent States (CIS) countries.\n\n\n-----\n\nFigure 2. Countries with the highest number of attack attempts per machine for LockBit ransomware (July 1, 2021 to January 20, 2022)\n\n_Source: Trend Micro™ Smart Protection Network™ infrastructure_\n\nWe saw the most LockBit-related detections in the healthcare industry followed by the education sector. LockBit threat actors have [claimed](https://www.avertium.com/blog/an-in-depth-look-at-lockfile-and-lockbit)\n[that they do not attack healthcare, educational, and charity institutions. This “contradictory code of ethics,” has been noted by the US](https://www.healthcareitnews.com/news/hhs-cybersecurity-agency-sounds-alarm-lockbit-ransomware-variant)\nDepartment of Health Services (HHS) who warns the public not to rely on such statements as these tend to dissolve in the face of easy\ntargets.\n\nFigure 3. Industries with the highest number of attack attempts per machine for LockBit ransomware (July 1, 2021 to January 20, 2022)\n\n_Source: Trend Micro Smart Protection Network infrastructure_\n\nOverall, we saw increased LockBit-related activity following the release of LockBit 2.0, peaking in November 2021.\n\n\n-----\n\ngu e oc t o t y detect o s pe ac e (Ju y, 0 to Ja ua y 0, 0 )\nSource: Trend Micro Smart Protection Network infrastructure\n\n## Targeted regions and sectors according to LockBit leak site\n\nIn this section, we examine the number of attacks recorded on LockBit’s leak site, which represents successfully compromised organizations\nwho, as of writing, have refused to pay ransom. In our foray into the leak site of LockBit operators from December 16, 2021 to January 15,\n[2022, we observed that they had the highest number of recorded victims among active ransomware groups at 41, followed by Conti at 29. Do](https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-conti)\n[note, however, that LockBit has been accused of artificially inflating the number of their victims.](https://www.lemagit.fr/actualites/252510802/Ransomware-comment-la-franchise-LockBit-20-gonfle-artificiellement-ses-chiffres)\n\nLooking into the list of their victims, it appears that more than half of the organizations are based in North America, followed by Europe and\nAsia Pacific.\n\nFigure 5. Regional distribution of LockBit victims according to the group’s leak site (December 16, 2021 to January 15, 2022)\n\nLockBit targets organizations indiscriminately, in that their victims come from many different sectors compared to other groups. In the\nabovementioned time period, they have victims coming from financial, professional services, manufacturing, and construction sectors, just to\nname a few. The majority of LockBit’s victims have been either small or small and medium-size businesses (SMBs) – 65.9% and 14.6%\nrespectively, with enterprises only comprising 19.5%. That’s at odds with a group like Conti who victimized 44.8% of enterprises and 34.5%\nSMBs, and only victimized 20.7% of small businesses.\n\nFigure 6. Sector distribution of LockBit victims according to the group’s leak site (December 16, 2021 to January 15, 2022)\n\nIn our observation of the activities within the LockBit leak site for the same time period, majority of attacks took place during weekdays,\napproximately 78% of the total, while 22% happened during the weekend.\n\n## Infection chain and techniques\n\nOperating as a RaaS, LockBit infection chains show a variety of tactics and tools employed, depending on the affiliates involved in the attack.\nAffiliates typically buy access to targets from other threat actors, who typically obtain it via phishing, exploiting vulnerable apps, or brute forcing\nremote desktop protocol (RDP) accounts.\n\nHere are some of the observed infection flows of LockBit variants:\n\n\n-----\n\nFigure 7. A LockBit 1.0 campaign that used PowerShell Empire to perform command and control after gaining access to the system\n\nFigure 8. A LockBit 1.0 campaign that used Microsoft RAS to access other systems\n\nFigure 9. A LockBit 1.0 campaign that used Meterpreter to perform command and control after gaining access to the system\n\n\n-----\n\nFigure 10. A LockBit 1.0 campaign that did not involve any network scanning as it directly deployed the payload after gaining access to the\nsystem\n\nFigure 11. LockBit 2.0 infection chain that uses StealBit for automated data exfiltration\n\n**Initial Access**\n\nLockBit operators mostly gain access via compromised servers or RDP accounts that are usually bought or obtained from affiliates.\nIn some instances, it arrived via spam email or by brute forcing insecure RDP or VPN credentials.\nIt can also arrive via exploiting Fortinet VPN’s [CVE-2018-13379 vulnerability.](https://nvd.nist.gov/vuln/detail/CVE-2018-13379)\n\n**Execution**\n\nLockBit is usually executed via command line as it accepts parameters of file path or directories if desired to only encrypt specific paths.\nIt may also be executed via created scheduled tasks. This is usually the case if it is propagated in other machines.\nThere are also reports of it being executed using PowerShell Empire, a pure PowerShell post-exploitation agent.\n\n\n-----\n\nAside from using credentials obtained from affiliates. LockBit attacks were also observed using Mimikatz to further gather credentials.\n\n**Defense Evasion**\n\nSome infections were observed to have GMER, PC Hunter, and/or Process Hacker. These are tools that are usually used to disable\nsecurity products.\nIn some observed attacks, a Group Policy was created to disable Windows Defender.\n\n**Discovery**\n\nNetwork Scanner, Advanced Port Scanner, and AdFind were also used to enumerate connected machines in the network. Probably to\nlocate the Domain Controller or Active Directory server as these are usually the best targets for deploying ransomware with network\nencryption or propagation.\n\n**Lateral Movement**\n\nLockBit can self-propagate via SMB connection using obtained credentials.\nSome samples can self-propagate and execute via Group Policy.\nIn some instances, PsExec or Cobalt Strike were used to move laterally within the network.\n\n**Exfiltration**\n\nUploads stolen files via cloud storage tools like MEGA or FreeFileSync.\nSometimes, the StealBit malware (also sold by the threat actors) was used instead to exfiltrate stolen files.\n\n**Impact**\n\nThe ransomware payload will proceed with encryption routine upon execution. Encryption includes both local and network encryption.\nIt encrypts files using AES and encrypts AES key with RSA encryption. The AES Key is generated using BCryptGenRandom.\nFor faster encryption, it only encrypts the first 4KB of a file and appends it to “.lockbit.”\nIt will also replace the desktop wallpaper with a note that includes a statement where it tries to recruit insiders or affiliates within\ncompanies.\n\n\n-----\n\ngu e Sa p e a pape used by oc t\n\nLockBit also sends a WoL packet to ensure that network drives are active for its network encryption; this behavior was first observed on\nthe [Ryuk ransomware.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/addressing-threats-like-ryuk-via-trend-micro-xdr)\nLockBit also has the capability to print its ransom note using connected printers using WinSpool APIs, which is probably inspired by\n[Egregor ransomware.](https://www.trendmicro.com/en_ph/research/20/l/egregor-ransomware-launches-string-of-high-profile-attacks-to-en.html)\n\n## MITRE tactics and techniques\n\n\n**Initial**\n**Access** **Execution** **Persistence** **Privilege Escalation** **Defense Evasion** **Discovery**\n\n\n**Lateral**\n**Movement** **Exfiltrat**\n\n\n**T1566 -**\nPhishing\n\n_Arrives via_\n_phishing_\n_emails_\n\n**T1190 -**\nExploit\npublic-facing\napplication\n\n_Arrives via_\n_any the_\n_following_\n_exploits:•_\n_CVE-2018-_\n_13379_\n\n**T1078 - Valid**\naccounts\n\n_Has been_\n_reported to_\n_make use of_\n_compromised_\n_accounts to_\n_access_\n_victims via_\n_RDP or VPN_\n\n**T1106 -**\nExecution\nthrough API\n\n_Uses native_\n_API to_\n_execute_\n_various_\n_commands/_\n_routines_\n\n\n**T1059 -**\nCommand\nand\nscripting\ninterpreter\n\n_Uses_\n_various_\n_scripting_\n_interpreters_\n_like_\n_PowerShell_\n_and_\n_Windows_\n_command_\n_shell_\n\n**T1204 -**\nUser\nexecution\n\n_User_\n_execution is_\n_needed to_\n_carry out_\n_the payload_\n_from the_\n_spear_\n_phishing_\n_link or_\n_attachments_\n\n\n**T1547 -**\nBoot or\nlogon\nautostart\nexecution\n\n_Creates_\n_registry run_\n_entries_\n\n\n**T1134 - Access token**\nmanipulation\n\n_Use AdjustTokenPrivilege_\n_API to modify token attribute_\n_to_\n_SE_PRIVILEGE_ENABLED_\n\n**T1548 - Abuse Elevation**\nControl Mechanism\n\n_Makes use of_\n_ucmDccwCOMMethod in_\n_UACME, a github collection_\n_of UAC bypass techniques_\n\n\n**T1140 - Deobfuscate/Decode**\nFiles or Information\n\n_Strings to be used_\n_throughout the routine are_\n_encrypted using XOR or_\n_Subtraction._\n\n**T1562 - Impair defenses**\n\n_Disables security related_\n_services via terminating_\n_them. May include using_\n_tools like PC Hunter, Process_\n_Hacker, KillAV/KillProc_\n\n**T1574 - Hijack execution flow**\n\n_DLL side-loading can also be_\n_used as a form of defense_\n_evasion_\n\n**T1218 - Signed Binary Proxy**\nExecution\n\n_Executes mshta to open the_\n_ransom note_\n\n**T1484 - Domain Policy**\nModification\n\n_It releases group policy_\n_update that will be able to_\n_terminate AV tools and_\n_create scheduled tasks to_\n_execute the propagated_\n_copies via SMB_\n\n**T1070 - Indicator Removal**\non Host\n\n_It is capable of deleting_\n_Windows event logs and its_\n_executable file to remove_\n_traces_\n\n\n**T1083 -**\nFile and\ndirectory\ndiscovery\n\n_Searches_\n_for specific_\n_files and_\n_directory_\n_related to_\n_its_\n_encryption_\n\n**T1135 -**\nNetwork\nShare\nDiscovery\n\n_Enumerate_\n_network_\n_share for_\n_its network_\n_encryption_\n\n**T1018**\n\n- Remote\nsystem\ndiscovery\n\n_Makes use_\n_of tools for_\n_network_\n_scans_\n\n**T1057**\n\n- Process\ndiscovery\n\n_Discovers_\n_certain_\n_processes_\n_for process_\n_termination_\n\n\n**T1570 -**\nLateral tool\ntransfer\n\n_Can make_\n_use of RDP,_\n_SMB admin_\n_shares, or_\n_PsExec to_\n_transfer the_\n_ransomware_\n_or tools_\n_within the_\n_network_\n\n\n**T1567 -**\nExfiltrati\nover web\nservice\n\n_Syncs fil_\n_a specifi_\n_cloud_\n_storage,_\n_such as_\n_MegaSy_\n_FreeFile_\n\n**T1041**\n\n- Exfiltra\nOver C2\nChannel\n_Exfiltrati_\n_using_\n_StealBit_\n\n\n## Summary of malware, tools, and exploits used\n\nSecurity teams can watch out for the presence of the following malware tools and exploits that are typically used in LockBit attacks:\n\n\n**Initial Entry** **Execution** **Discovery**\n\n\n**Lateral**\n**Movement** **Defense Evasion** **Exfiltration**\n\n\nPhishing emails\nRDP/Valid\naccounts\nExploit:\n\nCVE-201813379\n\n## Recommendations\n\n\nScheduled tasks\nWindows commandline\n\n\nNetwork\nScanner\n\n\nGroup\nPolicy\nSMB\nPsExec\n\n\nKillAV/KillProc\nPC Hunter\nProcess\nHacker\n\n\nStealBit\nFreeFileSync\nMegaSync\n\n\n-----\n\ns e t o ed ea e, e e pect t e oc t to co t ue ts e e o act ty, ot c ease t t e co g o t s o ou d scuss o,\nLockBit also demonstrates both consistent and versatile operations that adapt to current trends that affect the threat landscape. Organizations\ntherefore should also keep abreast of the latest shifts that could influence their own security measures.\n\nTo help defend systems against similar threats, organizations can establish security frameworks that can allocate resources systematically for\nestablishing a solid defense against ransomware.\n\nHere are some best practices that can be included in these frameworks:\n\n**Audit and inventory**\n\nTake an inventory of assets and data\nIdentify authorized and unauthorized devices and software\nMake an audit of event and incident logs\n\n**Configure and monitor**\n\nManage hardware and software configurations\nGrant admin privileges and access only when necessary to an employee’s role\nMonitor network ports, protocols, and services\nActivate security configurations on network infrastructure devices such as firewalls and routers\nEstablish a software allow list that only executes legitimate applications\n\n**Patch and update**\n\nConduct regular vulnerability assessments\nPerform patching or virtual patching for operating systems and applications\nUpdate software and applications to their latest versions\n\n**Protect and recover**\n\nImplement data protection, backup, and recovery measures\nEnable multifactor authentication (MFA)\n\n**Secure and defend**\n\nEmploy sandbox analysis to block malicious emails\nDeploy the latest versions of security solutions to all layers of the system, including email, endpoint, web, and network\nDetect early signs of an attack such as the presence of suspicious tools in the system\nUse advanced detection technologies such as those powered by AI and machine learning\n\n**Train and test**\n\nRegularly train and assess employees on security skills\nConduct red-team exercises and penetration tests\n\nA multilayered approach can help organizations guard the possible entry points into the system (endpoint, email, web, and network). Security\nsolutions can detect malicious components and suspicious behavior could help protect enterprises.\n\n[Trend Micro Vision One™ provides multilayered protection and behavior detection, which helps block questionable behavior and tools](https://www.trendmicro.com/en_us/business/products/detection-response.html)\nearly on before the ransomware can do irreversible damage to the system.\n[Trend Micro Cloud One™ Workload Security protects systems against both known and unknown threats that exploit vulnerabilities. This](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-workload-security.html)\nprotection is made possible through techniques such as virtual patching and machine learning.\n[Trend Micro™ Deep Discovery™ Email Inspector employs custom sandboxing and advanced analysis techniques to effectively block](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-inspector.html)\nmalicious emails, including phishing emails that can serve as entry points for ransomware.\n\n\n-----\n\ne d c o pe O e o e s e t e e auto ated t eat detect o a d espo se aga st ad a ced co ce s suc as e ess t eats\nand ransomware, ensuring the protection of endpoints.\n\n## Indicators of Compromise (IOCs)\n\nThe IOCs for this article can be found [here. Actual indicators might vary per attack.](https://documents.trendmicro.com/images/TEx/articles/iocs_lockbit_spotlightt0LVE8b.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-08 - Ransomware Spotlight- LockBit.pdf"
    ],
    "report_names": [
        "2022-02-08 - Ransomware Spotlight- LockBit.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535844,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653761697,
    "ts_modification_date": 1653761697,
    "files": {
        "pdf": "https://archive.orkl.eu/1cb6a595cdcecb1e74be2d683743b3ce76c79527.pdf",
        "text": "https://archive.orkl.eu/1cb6a595cdcecb1e74be2d683743b3ce76c79527.txt",
        "img": "https://archive.orkl.eu/1cb6a595cdcecb1e74be2d683743b3ce76c79527.jpg"
    }
}