{
    "id": "81ba062a-4f92-4966-ac62-f94c8444cccd",
    "created_at": "2024-08-01T02:04:11.281191Z",
    "updated_at": "2025-03-27T02:05:28.834433Z",
    "deleted_at": null,
    "sha1_hash": "0b7549d2bf3b39256c32f3b4924113d0fec9c817",
    "title": "Operation ShadowCat: Targeting Indian Political Observers via a Stealthy RAT",
    "authors": "cyble",
    "file_creation_date": "2024-07-31T15:08:26Z",
    "file_modification_date": "2024-07-31T15:08:26Z",
    "file_size": 1329287,
    "plain_text": "# Operation ShadowCat: Targeting Indian Political Observers via a Stealthy RAT\n\n**[cyble.com/blog/operation-shadowcat-targeting-indian-political-observers-via-a-stealthy-rat](https://cyble.com/blog/operation-shadowcat-targeting-indian-political-observers-via-a-stealthy-rat/)**\n\nJuly 24, 2024\n\n## KeyTakeaways\n\nCyble Research and Intelligence Labs (CRIL) came across an intriguing shortcut (.LNK) file\nmasquerading as a legitimate Office document.\nWhen the user executes the LNK file, it triggers the infection process, which runs a PowerShell\ncommand to drop and execute a .NET loader, ultimately delivering the final payload to the victim’s\nmachine.\nThe Threat Actor (TA) employs steganography to conceal a malicious Gzip-compressed payload\nwithin a PNG file, which is hosted on a Content Delivery Network (CDN).\nThe decompressed payload is then injected into PowerShell.exe using the Asynchronous Procedure\nCall (APC) injection method.\nThe final payload is a RAT (Remote Access Trojan) written in Go. It is designed to take control of the\ncompromised machine and deploy ransomware on the victim’s device.\nThe TA excludes infections from Russian-speaking regions, indicating that the TA could potentially be\na Russian-speaking individual or group.\nBased on the lure used in this campaign, we observed that the TA is targeting individuals with a keen\ninterest in Indian political affairs. This could include government officials, political analysts,\njournalists, researchers, and think tanks who closely follow parliamentary proceedings.\n\n## Overview\n\n[A security researcher first detected and reported a similar variant in 2023. Based on these similarities, we](https://www.linkedin.com/pulse/malware-w-skr%C3%B3cie-lnk-ireneusz-tarnowski/)\nsuspect that the malicious LNK file is distributed to users via spam email. The attack starts with a\ndeceptive shortcut (.LNK) file that deceives users into opening it. Once executed, the .LNK file runs a\nPowerShell command that drops a malicious .NET loader file and a decoy Word document on the victim’s\nmachine. The PowerShell script then invokes methods in the .NET file, which are designed to fetch a\nsteganographic PNG image from a remote server.\n\n\n-----\n\nThis image contains a Gzip compressed payload. The methods also decompress the payload and inject it\ninto the PowerShell.exe process. These actions are executed entirely in memory to avoid detection by\nsecurity products.\n\nCyble Research & Intelligence Labs has dubbed this attack “Operation ShadowCat” due to its stealthy\ncharacteristics, including the use of a C&C server at “use1.netcatgroup.site” and the custom “NetCat”\nsubprotocol employed for WebSocket communication.\n\nThe final payload is a RAT written in the Go programming language. This RAT provides extensive control\nover the infected system, enabling file and directory manipulation, command execution, and interactive\ncommunication with a Command & Control server.\n\nUpon successful infection, this RAT can enable ransomware activities, stage environments for payload\ndeployment, gather detailed system information, perform network scanning, and upload sensitive data from\nthe victim’s machine. It also uses tools for Active Directory mapping and credential extraction, facilitating\nadvanced lateral movement and attack strategies. The figure below shows an overview of the infection.\n\n_Figure 1 – Overview of the Attack_\n\n## Technical Analysis\n\nThe attack originates from a shortcut file named “Untitled Document.LNK”. This file appears to be a Word\ndocument but conceals its malicious content within the Shortcut Target path, as shown below.\n\n\n-----\n\n_Figure 2– Properties of .LNK file_\n\nWhen the user executes the LNK file, it loads the embedded PowerShell script, as shown in the figure\nbelow.\n\n_Figure 3– Malicious PowerShell script_\n\n\n-----\n\nThe PowerShell script can be divided into four sections:\n\n1. Execution Prevention Based on geo-location\n\n2. De-obfuscating strings through character manipulation\n\n3. Self-deleting an LNK file and creating and opening a lure document\n\n4. Creating and executing a malicious DLL file\n\n**Execution Prevention Based on geo-Location**\n\nThe initial section of the PowerShell script in the LNK file is designed to prevent execution in specific\ncountries. It retrieves the victim’s system’s GeoID using the “Get-WinHomeLocation” command. If the\nGeoID matches any of the specified values listed in the table below, the script terminates its execution.\nThese checks are intended to exclude the threat actors’ specified locations or countries from this attack.\nThe table below shows the GeoID and the respective locations.\n\n**Geographical identifier** **Locations**\n\n3 Afghanistan\n\n5 Azerbaijan\n\n7 Armenia\n\n29 Belarus\n\n130 Kyrgyzstan\n\n137 Kazakhstan\n\n152 Moldova\n\n154 Mongolia\n\n203 Russia\n\n228 Tajikistan\n\n238 Turkmenistan\n\n247 Uzbekistan\n\nNext, the script begins to de-obfuscate an array of strings. This array contains five strings, as shown in the\nimage below, each of which represents obfuscated data, including base64-encoded strings, PowerShell\ncommands, and URLs necessary for the subsequent stages of the infection chain.\n\n_Figure 4 – Obfuscated strings_\n\nThe image below shows the de-obfuscated strings.\n\n\n-----\n\n_Figure 5 – De-obfuscated strings_\n\nThe next section of the PowerShell script is intended to delete the original LNK file and open a lure\ndocument. The image below displays the code responsible for generating the document.\n\n_Figure 6 – Generating lure document_\n\nBefore creating the lure document, the script first searches the current directory for any “.LNK” files that\nhave the same size as the original LNK file. If any such files are found, the script deletes them and then\nwrites the base64-decoded content to a new file with the same name as the original LNK file but with a\n“.docx” extension.\n\n## Lure Document:\n\nThe script then opens the newly created lure document, which appears to be a question posed to the\nIndian parliament, submitted by a member of the Rajya Sabha or “Council of States” in India. The image\nbelow shows the lure document.\n\n\n-----\n\n_Figure 7 – Lure document_\n\nBased on the lure document, it is evident that the Threat Actor (TA) is targeting individuals who have a\nspecific interest in Indian political affairs. This suggests a strategic approach to select victims who are likely\nto be involved in or have significant knowledge regarding political matters in India. The targeted individuals\nmay include government officials, political analysts, journalists, researchers, or think tanks who closely\nfollow parliamentary proceedings.\n\nThe final section of the PowerShell script is designed to load a malicious binary file (DLL) decoded from\nbase64 in two ways. The first method loads and executes the DLL content directly in memory using\n“Reflection.Assembly” without writing it to disk. The second method serves as a fallback if the direct inmemory execution fails. It writes the DLL content to a file into the “%temp%” directory as\n“daephaphahph.dll“ and then loads it. The image below shows the code responsible for loading the DLL\nfile.\n\n_Figure 8 – Loading malicious binary file_\n\nOnce the DLL file is loaded into PowerShell’s memory, it uses the previously de-obfuscated URLs for\nfurther execution. The image below demonstrates the PowerShell script executing methods within the\nloaded DLL file, passing the URLs as parameters along with the Username and UserDomain.\n\n\n-----\n\n_Figure 9 – PowerShell Script calls DLL methods_\n\nThe loaded .NET assembly file functions as a shellcode loader, first determining the victim’s system\narchitecture. If the system supports 64-bit architecture, the malware retrieves a PNG file named\n“x86_64.png”. For a 32-bit system, it fetches a PNG file named “x86.png” using the URLs passed to the\nfunction, as illustrated in the figure below.\n\n_Figure 10 – System Architecture Check_\n\n**Steganography Technique**\n\nUpon successfully obtaining the PNG content, the DLL file proceeds to parse the PNG file and decompress\nthe hidden GZip content present within the image, as shown below.\n\n[During the course of our research, we observed that this image also appeared on a predominantly](https://vk.com/)\nRussian-speaking social media platform. The TA may have altered this image to help deliver malware,\nleading us to suspect that they could also be of Russian origin.\n\n\n-----\n\n_Figure 11 Steganography PNG Image_\n\nThe decompressed stream contains shellcode and an MZ header, as shown in the image below. The\n[shellcode is generated using Donut – an open-source project.](https://github.com/TheWover/donut)\n\n_Figure 12 – Shellcode along with final Payload_\n\n**APC (Asynchronous Procedure Call) Injection:**\n\nThe .NET loader executes the shellcode using the APC injection method. The APIs required for the\ninjection are encrypted, base64 encoded and stored in the binary as hardcoded strings. The loader\nretrieves the API names by performing a simple XOR operation, passing the encrypted string and key as\nparameters to a function, as shown below.\n\n\n-----\n\n_Figure 13 – XOR operation to decrypt strings_\n\nAfter getting the APIs required for injection, the .NET DLL creates a new process called “powershell.exe” in\na suspended state using the CreateProcess() API with the CREATE_SUSPENDED flag. This ensures that\nthe “powershell.exe” process is created but does not start executing immediately. Then, it uses the\n_WriteProcessMemory() API to write the shellcode and the PE (Portable Executable) file extracted from the_\nPNG file into the memory space of the suspended “powershell.exe” process.\n\nSubsequently, it uses the QueueUserAPC() API to queue an Asynchronous Procedure Call (APC) to a\nthread within the suspended process. The queued APC will execute the shellcode when the thread enters\na resume state.\n\nFinally, the DLL calls the ResumeThread() API to resume the main thread of the suspended process,\ncausing it to execute the queued APC and thereby run the injected shellcode, as shown below. The\nshellcode subsequently loads and executes the embedded binary, facilitating further malicious activities.\n\n\n-----\n\n_Figure 14 – Invoking Resumethread Win32 Api_\n\n**Final payload**\n\nThe final payload is a Go-compiled file with a size of approximately 8.4 MB. The following publicly available\nGo utilities are utilized in this binary:\n\n**[HashiCorp Yamux – This is a multiplexing library for Golang that operates over a reliable and](https://github.com/hashicorp/yamux)**\nordered underlying connection, such as TCP or Unix domain sockets. The TA is abusing Yamux to\nmultiplex multiple communication streams over a single connection, making their network traffic less\nconspicuous.\n\n**[Secsy goftp – It’s an open-source High-level FTP client utilized by TA to facilitate file transfers or](https://github.com/secsy/goftp)**\ndownloads on a compromised system.\n\nDespite the complexity of reverse-engineering Go binaries, we successfully obtained insights through the\nexamination of memory strings. Further analysis revealed several memory strings that confirm the\nmalware’s behavior as a Remote Access Trojan (RAT). The RAT executes the following commands.\n\n\n-----\n\n**Command** **Description**\n\ndiscover/walker Traverse directories to collect information about files and directories.\n\nfilesys/append Appends data to a file.\n\nfilesys/create Creates a new file.\n\nfilesys/delete Deletes a file.\n\nfilesys/lsdir Lists files in the directory.\n\nfilesys/mkdir Creates a new directory.\n\nfilesys/read Reads data from a file.\n\nfilesys/rename Renames a file.\n\nfilesys/truncate Truncates a file to a specified size.\n\nfilesys/write Writes data to a file.\n\ninteract Engages in interactive communication with a C&C server.\n\ncommand Executes a command, likely on a remote system.\n\nnetwork/listen Listens for incoming network connections.\n\nnetwork/tlsdial Establishes a network connection using TLS encryption.\n\npersist Creates persistence\n\nprocess/kill Terminates a process\n\nransom Deploy Ransomware\n\nstager/earlybird Executes early-stage payload\n\nsysinfo/curuser Retrieves information about the current user.\n\nsysinfo/install Gathers installation-related information.\n\nsysinfo/network Collects network-related information.\n\nsysinfo/osvers Retrieves the operating system version information.\n\ndiscover/tcpscan Scans for open TCP ports on a network.\n\nupload/post Uploads data, possibly via HTTP POST requests.\n\nupload/ftpc Uploads data using FTP (File Transfer Protocol).\n\ntools/sharphound Performs Active Directory Enumeration\n\ntools/mimikatz extracts plaintext passwords, hashes, PINs, and Kerberos tickets from lsass.exe\nmemory\n\ntools/rubeus Facilitates Kerberos ticket extraction, manipulation, and pass-the-ticket attacks.\n\n**C&C Communication:**\n\nThe RAT connects to its Command & Control (C&C) server via a WebSocket connection on port 443.\nUtilizing WebSockets over port 443, which is usually designated for secure HTTPS traffic, helps the RAT\nbypass traditional network security measures, as WebSocket traffic is often less monitored and more\nchallenging to detect compared to standard HTTP or other protocols.\n\n\n-----\n\nThe RAT initiates a GET request to wss://use1.netcatgroup.site/ctrl/, seeking to use a custom subprotocol\ncalled “NetCat.” The custom “NetCat” subprotocol suggests that the RAT may be using Netcat-like features\nfor establishing a reverse shell, transferring data, executing commands, or performing remote control\noperations. The below figure shows the communication to its C&C server.\n\n_Figure 15 -C&C communication_\n\n## Threat Actor Attribution\n\nThe threat actor appears to avoid infecting systems in nations where Russian is either the official language\nor spoken widely, suggesting a deliberate self-imposed restriction. This strategy is likely intended to\nmitigate potential backlash or reduce exposure in regions where they may have a presence or be known.\nSuch tactics are commonly observed among Ransomware-as-a-Service (RaaS) groups.\n\nAdditionally, the original, unedited image that the TA later altered via steganography was posted on a\nsocial media platform commonly used by Russian-speaking users, yet another factor that may indicate that\nthe TA is either a Russian speaker or group.\n\nBased on the available evidence, we cannot attribute this activity to any specific threat actor or Advanced\nPersistent Threat (APT) group at this time. However, the nature of the attack and its operational patterns\nindicate that it may be the work of a financially motivated group. The observed linguistic and operational\ncharacteristics lead us to suspect that the perpetrators could be a Russian-speaking group or a RaaS\nentity.\n\n## Conclusion\n\nThis campaign demonstrates a highly sophisticated attack that utilizes a shortcut file (.LNK) to execute\nPowerShell commands, which then deploys a .NET loader and a malicious payload concealed within a\nPNG file using steganography. The final payload, a RAT written in Go, facilitates remote access and\npotential ransomware deployment.\n\nThe threat actor’s intentional avoidance of Russian-speaking nations indicates a strategy to minimize\ndetection and backlash. Additionally, targeting individuals interested in Indian political affairs suggests a\ncalculated approach. Although we cannot precisely attribute the activity to a specific threat actor or APT\ngroup, the evidence suggests it is likely the work of a financially motivated, Russian-speaking group or\nRansomware-as-a-Service (RaaS) entity.\n\n## Recommendations\n\nThis campaign reaches users via potential phishing campaigns, so exercise extreme caution when\nhandling email attachments and external links. Always verify the legitimacy of the sender and links\nbefore opening them.\n\nMonitor network traffic, even if it appears to come from trusted CDNs. It’s important to correlate and\nverify the traffic before allowing it.\n\n\n-----\n\nConsider disabling or limiting the execution of scripting languages on user workstations and servers if\nthey are not essential for legitimate purposes.\n\nImplement application whitelisting to ensure only approved and trusted applications and DLLs can\nexecute on your systems\n\nSegment your organization’s networks to limit the spread of malware\n\nDeploy strong antivirus and anti-malware solutions to detect and remove malicious files.\n\n## MITRE ATT&CK® Techniques\n\n**Tactic** **Technique** **Procedure**\n\n\n**Initial**\n**Access** **[(TA0001)](https://attack.mitre.org/tactics/TA0001/)**\n\n\nSpearphishing Attachment\n[(T1566.001)](https://attack.mitre.org/techniques/T1566/001)\n\n\n**[Execution (TA0002)](https://attack.mitre.org/versions/v14/tactics/TA0002)** User Execution: Malicious File\n[(T1204.002)](https://attack.mitre.org/techniques/T1204/002/)\n\n**[Execution (TA0002)](https://attack.mitre.org/versions/v14/tactics/TA0002)** Command and Scripting\n[Interpreter: PowerShell (T1059.001)](https://attack.mitre.org/techniques/T1059/001/)\n\n\n.LNK file shared as mail attachments\n\nUser opens an .LNK file as a file\npretending to be an Office Document\n\nEmbedded PowerShell commands\nexecuted\n\nLNK file disguised as a legitimate office\nfile\n\n\n**Defense Evasion**\n**[(TA0005)](https://attack.mitre.org/tactics/TA0005/)**\n\n\nMasquerading: Masquerade File\n[Type (T1036.008)](https://attack.mitre.org/techniques/T1036/008/)\n\n\n**Discovery** **[(TA0007)](https://attack.mitre.org/tactics/TA0007/)** [System Location Discovery (T1614)](https://attack.mitre.org/techniques/T1614/) Checks GeoLocation using (Get_WinHomeLocation).GeoID_\n\n\n**Defense**\n**Evasion** **[(TA0005)](https://attack.mitre.org/tactics/TA0005/)**\n\n**Defense**\n**Evasion** **[(TA0005)](https://attack.mitre.org/tactics/TA0005/)**\n\n**Command and**\n**Control** [(TA0011)](https://attack.mitre.org/tactics/TA0011/)\n\n**Defense Evasion**\n**[(TA0005)](https://attack.mitre.org/tactics/TA0005/)**\n\n\nIndicator Removal: File Deletion\n[(T1070.004)](https://attack.mitre.org/techniques/T1070/004/)\n\nSystem Information\n[Discovery (T1082)](https://attack.mitre.org/techniques/T1082/)\n\nObfuscated Files or\nInformation: Steganography\n[(T1027.003)](https://attack.mitre.org/techniques/T1027/003/)\n\nDe-obfuscate/Decode Files or\n[Information (T1140)](https://attack.mitre.org/techniques/T1140)\n\n\nSelf-Deleting .LNK file after execution\n\nChecking for System architecture using\n_“Int.ptr”_\n\nMalicious GZip compressed stream is\nhidden inside a PNG file\n\nAPI and other program strings are\nobfuscated\n\n\n**[Execution (TA0002)](https://attack.mitre.org/versions/v14/tactics/TA0002)** [Native API (T1106)](https://attack.mitre.org/techniques/T1106) _CreateProcess(),QueueUserAPC() used_\nfor Process Injection\n\n\n**Privilege**\n\n**Escalation**\n\n**[(TA0004)](https://attack.mitre.org/tactics/TA0004/)**\n\n**C&C**\n\n**[(TA0011)](https://attack.mitre.org/tactics/TA0011/)**\n\n\nProcess Injection: Asynchronous\n[Procedure Call (T1055.004)](https://attack.mitre.org/techniques/T1055/004)\n\nApplication Layer Protocol: Web\n[Protocols (T1071.001)](https://attack.mitre.org/techniques/T1071/001/)\n\n\nUsing QueueUserAPC, it injects the\nshellcode into powershell.exe\n\nStealer communicates with the C&C\nserver.\n\n\n## Indicators Of Compromise\n\n\n-----\n\n**Indicators** **Indicator**\n**Type**\n\n\n**Description**\n\n\nffe5b09cbc0073be33332436150c81edfa952d2af749160699fc8b10b912ef35 SHA256 Zip\nattachement\n\n6f4dc0d9fe5970586403865d551bbea13e2ceb1bfe41f22e235a6456a5ec509b SHA256 LNK File\n\n168182578da46de165d10e6753d1c7db7b214efc723c89c6d9d0038264abad54 SHA256 Dropped\nDLL file\n\n8edc8f3eed761694c6b1df740de376f9e12f82675df7507417adb2c8bbedd8da SHA256 x86.png\n\nac957c501867a86c13045fa72d53faacb291cc8b6b2750915abc1b5815b164c6 SHA256 x86_64.png\n\nc42ea4d3c8b6ae2c4727a11de65f624a70dabba46c1996aa545de35a58804802 SHA256 Final\ninjected\npayload PE\nfile (32-bit)\n\n83d6e377a5527f41d8333f8eb0d42f7c6a24f8694ed3caceb3a1e63de7b23e9d SHA256 Final\ninjected\npayload PE\nfile (64-bit)\n\naef4d36ce252a9181767f263b1cbd831ac79f6e80516aa640222f9c56b06de4f SHA256 PE file with\nShellCode\n\nhxxps://suquaituupie.global.ssl.fastly[.]net/static/x86.png?u= URL PNG file\ncontains\nGZip stream\n\nhxxps://suquaituupie.global.ssl.fastly[.]net/static/x86_64.png?u= URL PNG file\ncontains\nGZip stream\n\nuse1.netcatgroup[.]site Domain C&C\n\nsuquaituupie.global.ssl.fastly[.]net Domain C&C\n\n## Yara Rule\n\n\n-----\n\n```\n    _ _\n{\n\n  meta:\n\nauthor = \"Cyble Research and Intelligence Labs\" \n\ndescription = \"Detects RAT written in GO\" \n\ndate = \"2024-07-24\" \n\nos = \"Windows\" \n\nstrings:\n\n$a =  \"network/tlsdial\" nocase wide ascii\n\n$b =  \"tools/sharphound\" nocase wide ascii\n\n$c =  \"process/kill\" nocase wide ascii\n\n$d =  \"sysinfo/osvers\" nocase wide ascii\n\n$e =  \"process/kill\" nocase wide ascii\n\n  condition:\n\nuint16(0) == 0x5A4D and all of them\n\n} \n\n## References:\n\n```\n[https://www.linkedin.com/pulse/malware-w-skr%C3%B3cie-lnk-ireneusz-tarnowski](https://www.linkedin.com/pulse/malware-w-skr%C3%B3cie-lnk-ireneusz-tarnowski)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/7zh1da1jvdytf6x68glxex92i863ep5l"
    ],
    "report_names": [
        "Cyble_OperationShadowCat-Targeting-Indian-Political-Observers(07-24-2024)"
    ],
    "threat_actors": [],
    "ts_created_at": 1722477851,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1722438506,
    "ts_modification_date": 1722438506,
    "files": {
        "pdf": "https://archive.orkl.eu/0b7549d2bf3b39256c32f3b4924113d0fec9c817.pdf",
        "text": "https://archive.orkl.eu/0b7549d2bf3b39256c32f3b4924113d0fec9c817.txt",
        "img": "https://archive.orkl.eu/0b7549d2bf3b39256c32f3b4924113d0fec9c817.jpg"
    }
}