{
    "id": "81cbc0d6-5439-4a6d-95a1-46a5835798a8",
    "created_at": "2023-01-12T15:00:23.727996Z",
    "updated_at": "2025-03-27T02:09:18.176528Z",
    "deleted_at": null,
    "sha1_hash": "7a990eceb63576cb1e39f2d2d80b0f190d586fb7",
    "title": "2020-12-04 - Snakes & Ladders- the offensive use of Python on Windows",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:45Z",
    "file_modification_date": "2022-05-28T04:10:45Z",
    "file_size": 403520,
    "plain_text": "# Snakes & Ladders: the offensive use of Python on Windows\n\n**[theta.co.nz/news-blogs/cyber-security-blog/snakes-ladders-the-offensive-use-of-python-on-windows/](https://www.theta.co.nz/news-blogs/cyber-security-blog/snakes-ladders-the-offensive-use-of-python-on-windows/)**\n\n[Home](https://www.theta.co.nz/)\n[News & Blogs](https://www.theta.co.nz/news-blogs/)\n[Cyber Security Blog](https://www.theta.co.nz/news-blogs/cyber-security-blog/)\nSnakes & Ladders: the offensive use of Python on Windows\n\n04/12/2020\n\nAs Microsoft further integrates Python into its ecosystem, there are concerns around the\noffensive use of it. Can these offensive attacks be mitigated and are the current control\nmechanisms enough to stop this happening?\n\n[Recent news that Python’s founder (and previous BDFL) Guido Van Rossum is working with](https://twitter.com/gvanrossum/status/1326932991566700549)\nMicrosoft - along with the prospect of integration between Python and Windows - is an\ninteresting and ultimately good development for fans of the versatile and incredibly popular\nlanguage. However, the offensive use of Python on Windows remains an edge case to be\n[considered (as some have) by defensive and offensive security practitioners alike.](https://twitter.com/JohnLaTwC/status/1326940870042554373)\n\n\n-----\n\n## The state of the art\n\nTheta’s Cyber Security Practice has several forward-leaning observations around the\noffensive use of Python in Windows environments, which may only accelerate in relevance\nas Microsoft further integrates the language into its ecosystem. Much of the offensive\ntradecraft and detection engineering efforts of the world are currently (and rightly) focused\n[on things like .NET and C#, along with coverage of “classic” windows LOLBins (so-called](https://lolbas-project.github.io/)\n“living off the land binaries” – such as bitsadmin, certutil, scrobj and mavinject etc).\n\nThis comes after the instrumentation and subsequent transition away from PowerShell and\ncmd.exe before that. However, Python currently remains a good way to deploy and execute\ntooling and scripts onto Windows hosts: either as a scripting interface or as a fully-fledged\ninterpreter.\n\n[Traditional use of offensive Python has been focused around its usage on dedicated Linux](https://nostarch.com/blackhatpython)\n[hosts for pentesting, particularly for network or packet manipulation, or in the delivery of](https://github.com/secdev/scapy)\nfully functioning and otherwise “fat” remote access trojans (or RATS) to systems. While\nMITRE ATT&CK has the sub technique T1059.006 - Command and Scripting Interpreter:\n_Python, few are familiar with its capabilities - specifically in relation to Windows. Cobalt_\n[Strike’s flexible Agressor Scripts (its own native scripting language for modification and](https://www.cobaltstrike.com/aggressor-script/index.html)\nextension of the popular offensive software) comes with a hook for Python as an example.\n\n## Year of the snake\n\nUnless it’s been disabled, Python can be installed from the Windows store\n[(programmatically via `winget Python.Python`, if winget is deployed – which itself is likely to](https://docs.microsoft.com/en-us/windows/package-manager/winget/)\nsee an uptick in adoption and worthy of practitioners' understanding). Whilst installed\nPython packages do touch disk and can be discovered by investigators, there aren’t many\nreasons to hunt for them.\n\nWe've observed first hand the ability to directly download offensive modules via pip onto\notherwise orchestrated or monitored systems. EDR and AV are likely to turn a blind eye to\npackages like Skelsec’s [Pypykatz – an implementation of the infamous Mimikatz (admittedly](https://pypi.org/project/pypykatz/)\n[with some reduced functionality), the ever-useful Impaket (GetUserSPNs.py) or FOXIT’s](https://pypi.org/project/impacket/)\n[Bloodhound.py ingestor module. Rounding out offensive capabilities, there are also Python](https://pypi.org/project/bloodhound/)\n[implementations of psexec and](https://pypi.org/project/pypsexec/) [wmiexec (part of the](https://github.com/Hackndo/lsassy/blob/master/lsassy/exec/wmi.py) [lsassy project).](https://pypi.org/project/lsassy/)\n\nNone of any of these items would be expected to be on a normal corporate workstation and\nwhose presence would cause alarm to a human analyst.\n\nIn systems where the Windows store isn’t available, Python can be downloaded from the\nweb. Doing so is extremely unlikely to trigger any detection by either host or network\ninstrumentation: proxies, firewalls or other security controls simply do not classify IDEs as\nmalicious - and nor should they.\n\n\n-----\n\nPython s pip (its main package manager which can be used to download all of the tooling\nmentioned above) is an interesting delivery mechanism as implemented in Windows. The\npackages it collects are written to disk as compiled .exe files - valid DOS MZ executables –\nhowever, these exe’s come with zip archives embedded (with a “__main__.py” file inside\nthem); and possibly hints to some of the reasons behind defensive tooling not responding\nwell to offensive packages.\n\nNote the “PK” the header for a .zip file - embedded at the end of the .exe\n\nThis is in contrast to a unix system - where pip will collect ultimately a script (a text file).\n\nAt the end of the day, this leaves us with a stark difference between downloading via a web\nbrowser or PowerShell a well-known “Offensive Security Tool” (OST) and using pip to\ndownload the Python equivalent.\n\n## Effects\n\nTheta has developed a range of cross-platform capabilities in Python to support our\noperations – performing many of the same types of capabilities we've observed real\nmalicious actors and their tools in the wild. So far, we can sadly report that they haven’t\nbeen detected or blocked in environments with EDR or other monitoring – even without\nobfuscation - including against specific software designed to detect particular TTPs. In the\nreal world, this is only made worse as many endpoint security products make for easy\ntargets. It’s usually a trivial exercise to degrade and disable them – which is something we\nsee ransomware operators, in particular, do very frequently.\n\n\n-----\n\nUnsettlingly, we ve been able to conduct a complete kerberoast of a domain from a single\nhost using Python from the Windows Store without any need for lateral movement, privilege\nescalation or defensive evasion; all while AV was running on the machine.\n\n## Defensive Advice\n\nUnlike PowerShell, Python’s logging isn’t well understood or documented. Execution or\nTranscript logging doesn't exist as it does with modern PowerShell, nor is there any\nequivalency of AMSI. Python requires the inclusion of additional modules to write out to the\nWindows Event Log, making it a dark spot for introspection and analysis – which is ironic\ngiven the extremely heavy use of Python in the forensics world for performing analysis.\n\nFrom an analysis standpoint, finding the following on-disk is cause for some alarm and\nwould be considered high fidelity sign of malicious activity if there wasn’t legitimate testing\nbeing carried out.\n\nSource: %LOCALAPPDATA% \\Programs\\Python\\Python<Version>\\Scripts\\\n\nWe debated releasing some Yara to look for these indicators. But rather than focusing on\nbrittle detections for attributes like file names (remember the pyramid of pain), it's likely to\nbe more useful if we understand what types of systems should be installing fully-fledged\ninterpreters - particularly on servers where workloads should be fairly static. Albeit less\nstraightforward advice: the reasons for non-technical users to suddenly deploy Python on a\nWindows endpoint remain limited, although the effort or cost to get that level of insight and\nvisibility across an estate isn’t trivial.\n\nFor those with hunt programs, developing Python-specific hunts or including Python\nartefacts in them may prove fruitful, along with potentially building out specific detections for\nPython execution. Hunting across\n%LOCALAPPDATA%\\Programs\\Python\\Python<Version>\\Scripts\\ for evidence of pip\nmodule names could prove a simple start. Detections based on pypsexec or similar lateral\nmovement tools are also likely to be higher fidelity signs of something amiss than their nonPython equivalents – although this moves towards network instrumentation or in-memory\ndetections.\n\n\n-----\n\nAt a more abstract level, looking for other languages (particularly ones with Windows\ninterpreters or script interfaces) with these sorts of techniques is a valid exercise as more\n[and more offensive research about different frameworks and](https://twitter.com/Myrtus0x0/status/1329095313072680961) [languages available to](https://twitter.com/jorgeorchilles/status/1330921819222716424)\npractitioners continues to surface. This type of over-the-horizon scanning may not be\nrelevant for what’s happening today, but new offensive tradecraft has been shown to be\nadopted rapidly by sophisticated adversaries and red teams once it’s been shown to work;\nunderstanding what’s going on in the Twittersphere and GitHub provides some degree of\nearly warning.\n\nSystem administrators and security practitioners should also be cognizant of the Windows\nStore and develop a strategy for its use in their organisations. Microsoft’s traditional model\nof application deployment being a free-for-all is slowly getting a viable alternative, but as\nwith all things, there is an edge case around malicious usage to be considered. This goes\nbeyond just Python. The opportunity to use WSL (or WSL2) to do ill is large and an\n[interesting topic all of its own (going all the way to having Kali Linux built-in). Although, in](https://www.youtube.com/watch?v=xvTPPC6jeZ0)\nour experience, this is more likely a trap for curious internal users than serious adversaries.\n\n## Summary\n\nFurther research by the community is required into the additional forensic opportunities\navailable with Python Scripting on Windows; very little is currently available in the public\ndomain. We can only hope that Microsoft places extra attention on working towards logging\nparity between PowerShell and Python in Windows. Especially if it’s going to get further\nintegrated into the Windows ecosystem.\n\nUntil then, you should strap yourselves in. If offensive use of Python and supporting\nfeatures like NuGet goes the same way as PowerShell, then we’re all in for a rough ride.\n\n[Speak to us at Theta if you want to know more about advanced cyber threats, defensive](https://www.theta.co.nz/contact-us/)\nstrategies and solutions to protect your organisation.\n\n**Lead author: Hamish Krebs, Lead Consultant**\n\nHamish has spent time across Australia and New Zealand responding to advanced threat\nactors; running large DFIR engagements in complex environments. He’s also designed and\ndeployed a variety of security solutions such as SIEMs and EDR suites across APAC.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-04 - Snakes & Ladders- the offensive use of Python on Windows.pdf"
    ],
    "report_names": [
        "2020-12-04 - Snakes & Ladders- the offensive use of Python on Windows.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535623,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653711045,
    "ts_modification_date": 1653711045,
    "files": {
        "pdf": "https://archive.orkl.eu/7a990eceb63576cb1e39f2d2d80b0f190d586fb7.pdf",
        "text": "https://archive.orkl.eu/7a990eceb63576cb1e39f2d2d80b0f190d586fb7.txt",
        "img": "https://archive.orkl.eu/7a990eceb63576cb1e39f2d2d80b0f190d586fb7.jpg"
    }
}