{
    "id": "8231fd27-e1ee-41bc-85fb-4502f624cc2f",
    "created_at": "2023-01-12T15:05:48.971655Z",
    "updated_at": "2025-03-27T02:16:39.96524Z",
    "deleted_at": null,
    "sha1_hash": "c02b1d8a1db188361bdbd4d36c65c451680883c8",
    "title": "2022-01-26 - ALPHV (BlackCat) Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T02:37:59Z",
    "file_modification_date": "2022-05-28T02:37:59Z",
    "file_size": 1306282,
    "plain_text": "# BlackCat Ransomware (ALPHV)\n\n**varonis.com/blog/alphv-blackcat-ransomware**\n\n[Inside Out Security Blog  /](https://www.varonis.com/blog) [Threat Research](https://www.varonis.com/blog/tag/threat-research)\n\n[Jason Hill](https://www.varonis.com/blog/author/jason-hill)\n|\n\n9 min read\n\n|\nLast updated January 26, 2022\n\n\n-----\n\n[Following news that members of the infamous ‘big-game hunter’ ransomware group REvil have](https://www.nytimes.com/2022/01/14/world/europe/revil-ransomware-russia-arrests.html)\nbeen arrested by Russian law enforcement, effectively dismantling the group and their operations,\nit is likely that the group’s affiliates will migrate to other ransomware-as-a-service (RaaS)\nproviders.\n\nVaronis Threat Labs has observed one such RaaS provider, ALPHV (aka BlackCat ransomware),\ngaining traction since late 2021, actively recruiting new affiliates and targeting organizations across\nmultiple sectors worldwide.\n\nHere are some of the key takeaways:\n\nThe group is actively recruiting ex-REvil, BlackMatter, and DarkSide operators\nIncreased activity since November 2021\nLucrative affiliate pay-outs (up to 90%)\nRust-based ransomware executable (fast, cross-platform, heavily customized per victim)\nAES encryption by default\n\nBuilt-in privilege escalation (UAC bypass, Masquerade_PEB, CVE-2016-0099)\nCan propagate to remote hosts via PsExec\nDeletes shadow copies using VSS Admin\nStops VMware ESXi virtual machines and deletes snapshot\n\nThe group’s leak site, active since early December 2021, has named over twenty victim\norganizations as of late January 2022, though the total number of victims, including those that\nhave paid a ransom to avoid exposure, is likely greater.\n\nThis article seeks to provide an overview of this emerging ransomware threat, detailing both the\nLinux and Windows variants of their encryption tool.\n\n## Background\n\nFirst observed in November 2021, ALPHV, also known as ALPHV-ng, BlackCat, and Noberus, is a\nransomware-as-a-service (RaaS) threat that targets organizations across multiple sectors\nworldwide using the triple-extortion tactic.\n\n\n-----\n\nBuilding upon the common double-extortion tactic in which sensitive data is stolen prior to\nencryption and the victim threatened with its public release, triple-extortion adds the threat of a\ndistributed denial-of-service (DDoS) attack if the ransomware group’s demands aren’t met.\n\nDemonstrating prior experience in this threat space, such as the use of proven big-game hunter\ntactics, techniques, and procedures (TTP) and the apparent recent success, this threat was likely\ncreated by a former ransomware group member rather than a new-comer.\n\nGoing further, some cybercrime forum users have commented that ALPHV may even be an\n[evolution or rebranding of BlackMatter, itself a ‘spin-off’ or successor of REvil and](https://www.varonis.com/blog/blackmatter-ransomware?hsLang=en) [DarkSide.](https://www.varonis.com/blog/darkside-ransomware?hsLang=en)\n\nPreviously advertised on Russian-language cybercrime forums (Figure 1), affiliates are enticed to\njoin the group with returns of up to ninety percent of any ransom collected.\n\n_Figure 1 – ALPHV ‘Looking for WINDOWS/LINUX/ESX pentesters’_\n\nWorking with these new affiliates, the initial intrusion of a victim network will likely use tried-andtested techniques. For example, the exploitation of common vulnerabilities in network infrastructure\ndevices such as VPN gateways and credential misuse via exposed remote desktop protocol (RDP)\nhosts.\n\nSubsequently, those conducting ALPHV attacks have been observed as using PowerShell to\nmodify Windows Defender security settings throughout the victim network as well as launching the\nransomware binary, an interactive process, on multiple hosts using PsExec.\n\n## Ransomware\n\nHaving gained initial access to a victim network, the group will undoubtedly conduct\nreconnaissance and lateral movement phases in which sensitive and valuable data will be\nidentified for exfiltration and later encryption.\n\n\n-----\n\nUtilizing their own ransomware executable, created afresh rather than being based on some\nexisting threat, the threat actor will build a victim-specific threat that takes into account elements\nsuch as encryption performance, perhaps electing to only encrypt parts of large files, as well as\nembedded victim credentials to allow automated propagation of the ransomware payload to other\nservers.\n\nUnlike many other ransomware threats, ALPHV was developed using Rust, a programming\nlanguage known for its fast performance and cross-platform capabilities, leading to both Linux and\nWindows variants being observed throughout December 2021 and January 2022.\n\nWhilst many suggest that ALPHV could be the first ‘in-the-wild’ ransomware threat using this\n[language, a Rust ransomware proof-of-concept was published on GitHub in June 2020 albeit there](https://github.com/cdong1012/Rust-Ransomware)\nis nothing to suggest that the two are in any way related.\n\nNotably, the use of Rust, amongst other modern languages including Golang and Nim, appears to\nbe a growing trend amongst cybercrime threat actors over the past year or two.\n\nIn addition to creating new cross-platform and high-performance threats, some threat actors have\nalso taken to rewriting their older threats likely to evade detection and thwart analysis, as seen with\nthe updated ‘Buer’ downloader dubbed ‘RustyBuer’.\n\nAnalysis of ALPHV samples collected recently indicates that the development process likely took\nplace during early-to-mid November 2021 given the release history of Rust ‘crates’ (programming\nlibraries) used.\n\nSpecifically, recently observed ALPHV samples utilize ‘Zeroize’ version 1.4.3 which was not\nreleased until November 4, 2021, whilst also using public key cryptography versions that were\nsuperseded by versions released on November 16 and 17, 2021.\n\nWhilst many of the Rust crates used are somewhat obvious, such as the use of command-line\ninterface and encryption libraries, the use of Zeroize, a library that securely clears secrets from\nmemory, appears to be a deliberate attempt to prevent encryption secrets from being recovered\nfrom a compromised host.\n\n### Configuration\n\nEach victim-specific ALPHV ransomware binary has an embedded JSON data structure (Figure 2)\nthat contains a tailored configuration taking into account the threat actor’s knowledge of the victim\nnetwork.\n\n\n-----\n\n_Figure 2 – Example embedded JSON data structure_\n\nRecently observed samples include configurations with a common set of options (Table 1) some of\nwhich apply to both variants and others that are operating system specific.\n\n**Configuration Option** **Description**\n\n**config_id** Not set in recently observed samples.\n\n**public_key** Victim-specific RSA public key used to secure the\nencryption key.\n\n**extension** Victim-specific extension appended to encrypted files, a\nseemingly randomly generated string of seven lowercase\nalphanumeric characters (Regular Expression: [a-z0-9]{7}).\n\n**note_file_name** Ransom note filename, set to ‘RECOVER-${EXTENSION}_FILES.txt’ in recently observed samples._\n\n**note_full_text** Ransom note text, consistent across recently observed\nsamples with a victim-specific Tor onion address used for\nnegotiations.\n\n**note_short_text** Windows desktop wallpaper text directing the victim to the\nransom note, consistent across recently observed samples.\n\n\n-----\n\n**default_file_mode** Typically set to ‘Auto’ although two ‘SmartPattern’ values\nhave been observed that result in a specified number of\nmegabytes of each file being encrypted in steps of ten:\n\nmap[SmartPattern:[1.048576e+07 10]]\nmap[SmartPattern:[3.145728e+07 10]]\n\nThese values would be set for performance reasons on\nspecific victim hosts such as when dealing with very large\nfiles.\n\n**default_file_cipher** Set to ‘Best’ in all recently observed samples, attempts to\nuse AES encryption first and falls back to ChaCha20.\n\n**credentials** Victim-specific, and likely used for propagation. Both domain\nand local administrator credentials have been observed in\nsome samples.\n\n**kill_services** Typical list of common Windows services related to\napplications, backup utilities, security solutions and servers\nwith some victim-specific services observed in recent\nsamples.\n\n**kill_processes** Typical list of common Windows processes related to\napplications, backup utilities, security solutions and servers\nwith victim-specific processes observed in recent samples.\n\n**exclude_directory_names** Typical list of Windows system directories to ensure that the\nhost remains stable post-encryption (allowing the ransom\nnote to be accessed).\n\n**exclude_file_names** Typical list of Windows system files to ensure the host\nremains stable post-encryption (allowing the ransom note to\nbe accessed).\n\n**exclude_file_extensions** Typical list of Windows system file extensions to ensure the\nhost remains stable post-encryption (allowing the ransom\nnote to be accessed).\n\n**exclude_file_path_wildcard** Not set in recently observed samples, excludes specified file\npaths from the encryption process on a per-host/victim\nbasis.\n\n**enable_network_discovery** Boolean value, set to ‘true’ in recently observed samples\nand enabling network discovery via NetBIOS/SMB in search\nof other hosts to encrypt.\n\n\n-----\n\n**enable_self_propagation** Boolean value, mixed configurations observed in recent\nsamples suggest this is configured on a per-host/victim\nbasis.\n\n**enable_set_wallpaper** Boolean value, set to ‘true’ in recently observed samples\nresulting in the Windows desktop wallpaper displaying\n‘note_short_text’.\n\n**enable_esxi_vm_kill** Boolean value, determines if VMware ESXi virtual machines\nwill be terminated.\n\n**enable_esxi_vm_snapshot_kill** Boolean value, determines if VMware ESXi virtual machine\nsnapshots will be removed (configuration option only\npresent in recently observed Linux samples).\n\n**strict_include_paths** Not set in recently observed samples, results in the\nencryption process only processing files within the specified\npaths.\n\n**esxi_vm_kill_exclude** Boolean value, excludes specific VMware ESXi virtual\nmachines from the termination process\n\n_Table 1 – ALPHV Configuration Options_\n\nAlthough many options appear within the embedded configurations of both samples, it appears\nthat the ransomware will ignore those that don’t apply to the host, for example, recently observed\nWindows samples include references to VMware ESXi, a platform supported by the Linux variant,\nwhilst recently observed Linux samples retain references to Windows directories, files, and file\nextensions.\n\nBased on the command-line options available to both variants, many of the embedded\nconfiguration options can likely be overridden at execution.\n\n### Command-line Interface\n\nLaunching the ransomware with the ‘--help’ parameter conveniently shows available options\n(Figure 3) and provides an insight into its capabilities.\n\n\n-----\n\n_Figure 3 – ALPHV ‘Core’ Options (Windows variant)_\n\nDifferences in the options displayed may indicate an earlier version or victim/Windows-specific\nvariant, with many options allowing the threat actor to override any embedded configuration.\n\nIn addition to these core capabilities, analysis of a recent Linux variant provides insight (Figure 4)\ninto support for VMware ESXi hosts including the ability to stop virtual machines and, if enabled,\nwipe virtual machine snapshots to thwart recovery efforts.\n\n\n-----\n\n_Figure 4 – ALPHV ESXi Options (Linux variant)_\n\nOnce initially launched, both the Linux and Windows variants include a multi-threaded worker pool\nthat spawns a ‘file worker pool’ comprised of four workers that are used to open and modify each\ntarget file, replacing the original content with encrypted data.\n\n## Windows Variant\n\nHaving initialized its core features, including the creation of the file worker pool, privilege escalation\ncapabilities can be executed by the Windows variant under certain conditions.\n\nGiven that the manual execution of the ransomware element occurs post-intrusion, after the\nreconnaissance and data exfiltration stages, it is expected that the threat actor would already have\nelevated privileges.\n\nRegardless, the following privilege escalation capabilities appear to be embedded within the\nransomware and will likely increase the chance of success when propagated to other Windows\nhosts:\n\n[‘Masquerade_PEB’, previously released as a proof-of-concept script [6] and used to give a](https://github.com/FuzzySecurity/PowerShell-Suite/blob/master/Masquerade-PEB.ps1)\nPowerShell process the appearance of another process that in turn could allow elevated\noperations.\nUser Account Control (UAC) bypass via an elevated COM interface, in this case abusing the\nMicrosoft Connection Manager Admin API Helper for Setup COM object (cmstplua.dll):\n\n**%SYSTEM32%\\DllHost.exe /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}**\n\nCVE-2016-0099, a Secondary Logon Service exploit via the ‘CreateProcessWithLogonW’\nAPI.\n\nAdditionally, the Windows variant performs a number of processes prior to the encryption phase\nthat differs from common ransomware threats, namely:\n\nAcquiring the host universally unique identifier (UUID) using the Windows Management\nInterface command-line utility (WMIC) that, along with the ‘access token’ value, generates an\n‘access-key’ to allow access to the victim-specific Tor site:\n\n**wmic csproduct get UUID**\n\nEnabling both ‘remote to local’ and ‘remote to remote’ symbolic links using the file system\nutility (fsutil) to allow the creation of links that redirects to some other file or directory:\n\n**fsutil behavior set SymlinkEvaluation R2L:1**\n**fsutil behavior set SymlinkEvaluation R2R:1**\n\nSetting the number of network requests the Server Service can make to the maximum,\navoiding any remote file access issues when the encryption process executes, by updating\nthe configuration in the Windows registry:\n\n\n-----\n\n**reg add**\n**HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters**\n**/v MaxMpxCt /d 65535 /t REG_DWORD /f**\n\nEnumerating all local disk partitions and, if any hidden partitions are found, mounting these to\nallow additional data to be encrypted, potentially rendering recovery partitions useless.\nPropagation, if enabled, likely uses credentials contained within the embedded configuration\nand makes use of PsExec, a Microsoft Windows Sysinternals utility, to execute the\nransomware on a remote host:\n\n**psexec.exe -accepteula \\\\<TARGET_HOST> -u <USERNAME> -p <PASSWORD> -s -d -f**\n**-c <ALPHV_EXECUTABLE> [FLAGS] [OPTIONS] --access-token <ACCESS_TOKEN>**\n\n**[SUBCOMMAND]**\n\nIn addition to suppressing the display of the PsExec license dialog (-accepteula), the propagated\nransomware process will be executed using the SYSTEM account (-s) in a non-interactive session\n(-d), negating the need to wait for the remote process to complete, with the ransomware\nexecutable being copied to the remote host (-c) and overwriting any existing file (-f).\nNotably, the legitimate PsExec executable is embedded within the Windows variant and is dropped\nin the victim’s %TEMP% directory.\n\nAs expected, common Windows ransomware traits are also performed:\n\nDeletion of shadow copies using the Volume Shadow Copy Service (VSS) administrative\nutility (vssadmin) to thwart recovery efforts:\n\n**vssadmin.exe delete shadows /all /quiet**\n\nTerminating the processes and/or services specified within the configuration to minimize the\nnumber of locked (open) files as well as potentially disabling backup utilities and security\nsoftware to evade detection.\n\nEmptying the Recycle Bin.\n\nDefaulting to AES encryption, signified by the ‘best’ configuration option, the process can fallback\nor be overridden to use ChaCha20.\n\nAfter a file has been encrypted, the pre-configured seven-character alphanumeric file extension is\nappended to the filename, a value that appears to differ between victims.\n\nFollowing the encryption phase, a number of final tasks are performed:\n\nNetwork discovery, using NetBIOS and SMB, likely in preparation for propagation, seemingly\nincluding the use of native address resolution protocol (ARP) command to gather the IP and\nMAC addresses from the ARP table (a list of hosts known to the victim host):\n\n**arp -a**\n\n\n-----\n\nCreating the predefined ransom note in each folder containing encrypted files as well as an\nimage containing the short ransom note on the Desktop of all users:\n\n**RECOVER-<ENCRYPTED_FILE_EXTENSION>-FILES.txt**\n**%USERPROFILE%\\Desktop\\RECOVER-<ENCRYPTED_FILE_EXTENSION>-**\n**FILES.txt.png**\n\nSetting the desktop wallpaper (Figure 5) to the dropped PNG image file for each user through\na Windows registry key update:\n**HKEY_USERS\\<SID>\\Control Panel\\Desktop\\WallPaper = \"C:\\\\Users\\\\**\n**<USERNAME>\\\\Desktop\\\\RECOVER-<ENCRYPTED_FILE_EXTENSION>-FILES.txt.png\"**\n\n_Figure 5 – Desktop wallpaper post-encryption_\n\nRepeating the shadow copy deletion process using vssadmin.\nUsing the Windows Event Log utility (wevtutil) to list and then clear all event logs:\n\n**for /F \\\"tokens=*\\\" %1 in ('wevtutil.exe el') DO wevtutil.exe cl \\\"%1\\\"\"**\n\n### VMware ESXi Behaviour\n\nAssuming the ESXi options are not disabled, the VMware ESXi command-line interface utility\n(esxcli) is called and generates a comma-separated list of all running virtual machines:\n\n**esxcli --formatter=csv --format-param=fields==\"WorldID,DisplayName\" vm process list**\n\nThe output of this command is subsequently ‘piped’ to AWK, a text-processing utility, to parse the\nresult and launch the ESXI command-line interface utility to force terminate each virtual machine:\n\n**awk -F \"\\\"*,\\\"*\" '{system(\"esxcli vm process kill --type=force --world-id=\"$1)}'**\n\nUtilizing the VMware Virtual Infrastructure Management utility (vimcmd), another list of virtual\nmachines is gathered and parsed, the results of which are passed back to vimcmd with the\n‘snapshot.removeall’ command that results in any, and all, snapshots being deleted:\n\n**for i in `vim-cmd vmsvc/getallvms| awk '{print$1}'`;do vim-cmd**\n**vmsvc/snapshot.removeall $i & done**\n\n## Victimology\n\nAs is common with big-game hunter ransomware threats, victims are typically large organizations\nfrom which bigger ransoms can be extorted with reports suggesting that demands have ranged\nfrom US$400K up to $3M payable in cryptocurrency.\n\n\n-----\n\nWhilst the true number of victims is unknown, over twenty organizations have been named on the\ngroup’s Tor ‘leak site’, across a variety of sectors and countries including:\n\nAustralia, Bahamas, France, Germany, Italy, Netherlands, Philippines, Spain, United\nKingdom, and the United States.\nBusiness services, construction, energy, fashion, finance, logistics, manufacturing,\npharmaceutical, retail, and technology.\n\n## Indicators of Compromise (IOC)\n\n### Linux Processes\n\nThe following legitimate, albeit suspicious, processes were spawned by the Linux/VMware ESXi\nvariant:\n\n**esxcli --formatter=csv --format-param=fields==\"WorldID,DisplayName\" vm process list**\n**| awk -F \"\\\"*,\\\"*\" '{system(\"esxcli vm process kill --type=force --world-id=\"$1)}'**\n**for i in `vim-cmd vmsvc/getallvms| awk '{print$1}'`;do vim-cmd**\n**vmsvc/snapshot.removeall $i & done**\n\n### Windows Processes\n\nThe following legitimate, albeit suspicious, processes were spawned by the Windows variant:\n\n**arp -a**\n**%SYSTEM32%\\DllHost.exe /Processid:{3E5FC7F9-9A51-4367-9063-A120244FBEC7}**\n**for /F \\\"tokens=*\\\" %1 in ('wevtutil.exe el') DO wevtutil.exe cl \\\"%1\\\"\"**\n**fsutil behavior set SymlinkEvaluation R2L:1**\n**fsutil behavior set SymlinkEvaluation R2R:1**\n\n**psexec.exe -accepteula \\\\<TARGET_HOST> -u <USERNAME> -p <PASSWORD> -s -d -f**\n**-c <ALPHV_EXECUTABLE> [FLAGS] [OPTIONS] --access-token <ACCESS_TOKEN>**\n\n**[SUBCOMMAND]**\n**reg add**\n**HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\LanmanServer\\Parameters**\n**/v MaxMpxCt /d 65535 /t REG_DWORD /f**\n**wmic csproduct get UUID**\n\n### Linux Ransomware Executables (SHA256)\n\nGiven that each sample is victim-specific, the following are provided for research rather than\ndetection purposes:\n\n**3a08e3bfec2db5dbece359ac9662e65361a8625a0122e68b56cd5ef3aedf8ce1**\n**5121f08cf8614a65d7a86c2f462c0694c132e2877a7f54ab7fcefd7ee5235a42**\n**9802a1e8fb425ac3a7c0a7fca5a17cfcb7f3f5f0962deb29e3982f0bece95e26**\n**e7060538ee4b48b0b975c8928c617f218703dab7aa7814ce97481596f2a78556**\n\n\n-----\n\n**f7a038f9b91c40e9d67f4168997d7d8c12c2d27cd9e36c413dd021796a24e083**\n\n**f8c08d00ff6e8c6adb1a93cd133b19302d0b651afd73ccb54e3b6ac6c60d99c6**\n\n### Windows Ransomware Executables (SHA256)\n\nGiven that each sample is victim-specific, the following are provided for research rather than\ndetection purposes:\n\n**0c6f444c6940a3688ffc6f8b9d5774c032e3551ebbccb64e4280ae7fc1fac479**\n**13828b390d5f58b002e808c2c4f02fdd920e236cc8015480fa33b6c1a9300e31**\n\n**15b57c1b68cd6ce3c161042e0f3be9f32d78151fe95461eedc59a79fc222c7ed**\n**1af1ca666e48afc933e2eda0ae1d6e88ebd23d27c54fd1d882161fd8c70b678e**\n**2587001d6599f0ec03534ea823aab0febb75e83f657fadc3a662338cc08646b0**\n**28d7e6fe31dc00f82cb032ba29aad6429837ba5efb83c2ce4d31d565896e1169**\n**2cf54942e8cf0ef6296deaa7975618dadff0c32535295d3f0d5f577552229ffc**\n\n**38834b796ed025563774167716a477e9217d45e47def20facb027325f2a790d1**\n**3d7cf20ca6476e14e0a026f9bdd8ff1f26995cdc5854c3adb41a6135ef11ba83**\n**4e18f9293a6a72d5d42dad179b532407f45663098f959ea552ae43dbb9725cbf**\n**59868f4b346bd401e067380cac69080709c86e06fae219bfb5bc17605a71ab3f**\n**5bdc0fb5cfbd42de726aacc40eddca034b5fa4afcc88ddfb40a3d9ae18672898**\n\n**658e07739ad0137bceb910a351ce3fe4913f6fcc3f63e6ff2eb726e45f29e582**\n**7154fdb1ef9044da59fcfdbdd1ed9abc1a594cacb41a0aeddb5cd9fdaeea5ea8**\n**722f1c1527b2c788746fec4dd1af70b0c703644336909735f8f23f6ef265784b**\n**731adcf2d7fb61a8335e23dbee2436249e5d5753977ec465754c6b699e9bf161**\n**7b2449bb8be1b37a9d580c2592a67a759a3116fe640041d0f36dc93ca3db4487**\n\n**7e363b5f1ba373782261713fa99e8bbc35ddda97e48799c4eb28f17989da8d8e**\n**9f6876762614e407d0ee6005f165dd4bbd12cb21986abc4a3a5c7dc6271fcdc3**\n**aae77d41eba652683f3ae114fadec279d5759052d2d774f149f3055bf40c4c14**\n**b588823eb5c65f36d067d496881d9c704d3ba57100c273656a56a43215f35442**\n**bd337d4e83ab1c2cacb43e4569f977d188f1bb7c7a077026304bf186d49d4117**\n\n**be8c5d07ab6e39db28c40db20a32f47a97b7ec9f26c9003f9101a154a5a98486**\n**c3e5d4e62ae4eca2bfca22f8f3c8cbec12757f78107e91e85404611548e06e40**\n**c5ad3534e1c939661b71f56144d19ff36e9ea365fdb47e4f8e2d267c39376486**\n**c8b3b67ea4d7625f8b37ba59eed5c9406b3ef04b7a19b97e5dd5dab1bd59f283**\n**cda37b13d1fdee1b4262b5a6146a35d8fc88fa572e55437a47a950037cc65d40**\n\n**cefea76dfdbb48cfe1a3db2c8df34e898e29bec9b2c13e79ef40655c637833ae**\n**d767524e1bbb8d50129485ffa667eb1d379c745c30d4588672636998c20f857f**\n**f837f1cd60e9941aa60f7be50a8f2aaaac380f560db8ee001408f35c1b7a97cb**\n\n\n-----\n\nJason Hill\n\nJason is a Security Researcher within the Varonis Research Team and has a penchant for all\nthings threat intelligence. Equally happy analyzing nefarious files or investigating badness, Jason\nis driven by the desire to make the cyberworld a safer place.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-26 - ALPHV (BlackCat) Ransomware.pdf"
    ],
    "report_names": [
        "2022-01-26 - ALPHV (BlackCat) Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535948,
    "ts_updated_at": 1743041799,
    "ts_creation_date": 1653705479,
    "ts_modification_date": 1653705479,
    "files": {
        "pdf": "https://archive.orkl.eu/c02b1d8a1db188361bdbd4d36c65c451680883c8.pdf",
        "text": "https://archive.orkl.eu/c02b1d8a1db188361bdbd4d36c65c451680883c8.txt",
        "img": "https://archive.orkl.eu/c02b1d8a1db188361bdbd4d36c65c451680883c8.jpg"
    }
}