{
    "id": "823ba3c7-7b54-4981-86b9-4649469e9949",
    "created_at": "2023-02-02T02:09:04.187723Z",
    "updated_at": "2025-03-27T02:13:12.002011Z",
    "deleted_at": null,
    "sha1_hash": "124ec482bddde6b4892339ee5334c030e9a3639d",
    "title": "2021-12-23 - Cyber Threat Profile MALTEIRO",
    "authors": "",
    "file_creation_date": "2023-02-01T07:40:11Z",
    "file_modification_date": "2023-02-01T07:40:11Z",
    "file_size": 1538852,
    "plain_text": "# Cyber Threat Profile MALTEIRO\n\n**blog.scilabs.mx/cyber-threat-profile-malteiro/**\n\nSCILabs December 23, 2021\n\n## Panorama general\n\nEl presente post tiene como objetivo mostrar el modus operandi, el malware utilizado y los TTP de un grupo de ciberdelincuentes nombrado\npor el equipo de SCILabs como Malteiro, el cual opera y distribuye el troyano bancario URSA/Mispadu. Por otro lado, se presenta una\ninvestigación de las campañas de distribución de los troyanos bancarios más recientes, las cuales representan un riesgo potencial para la\ninformación de los titulares de cuentas bancarias mexicanas y latinoamericanas.  Si bien las campañas de URSA/Mispadu se han lanzado\ndesde finales de 2019, ha sufrido diversas modificaciones a lo largo del tiempo, hasta convertirse en un malware sofisticado y difícil de\ndetectar por las soluciones antivirus. Este malware reutiliza y mejora algunos TTP utilizados en sus primeras versiones, que en su momento\nfueron analizados en algunos blogs de seguridad.\n\n## Región de operación\n\nDe acuerdo con la evidencia recopilada por SCILabs, la campaña está dirigida principalmente a México y Latinoamérica y otros países de los\n[continentes europeo, africano y asiático. Es importante resaltar que algunos estudios apuntan a que URSA/Mispadu es uno de los troyanos](https://www.welivesecurity.com/wp-content/uploads/2020/09/ESET_LATAM_financial_cybercrime.pdf)\nbancarios que más está afectando a la región.\n\nFigura 1 – Países objetivo\n\nCon base en la información analizada por SCILabs de fuentes públicas y nuestro ciberecosistema, a continuación, se presenta el cronograma\nde las campañas identificadas:\n\n\n-----\n\nFigura 2 – Línea del tiempo de las\n\ncampañas\n\n## Acerca de las víctimas\n\nDurante la investigación, SCILabs identificó que las campañas de phishing están dirigidas principalmente a México. De acuerdo nuestra\ntelemetría, se enumeran los principales sectores a los que podrían dirigirse estas campañas:\n\nSector financiero\nSector alimenticio\nSector de las comunicaciones\nSector salud\nSector minorista\nIndustria manufacturera\nSector Industrial\nGobierno\n\n## Modelo de operación\n\n**Contexto de la amenaza Malteiro es un grupo de ciberdelincuentes que opera, administra y vende el troyano bancario URSA/Mispadu, así**\ncomo las herramientas para su instalación y configuración. Con la información obtenida por SCILabs, es posible determinar que los\nciberdelincuentes utilizan el modelo de negocio Malware-as-a-Service (MaaS).\n\nFigura 3 – Modus\n\noperandi de los ciberdelincuentes basado, en el modelo de negocio Malware as a Service\nAsimismo, supervisan la creación de campañas y otras técnicas para la distribución de malware, como se puede ver en la siguiente imagen:\n\n\n-----\n\nFigura 4 – Modus\n\noperandi utilizado para la distribución de URSA/Mispadu\n_URSA/Mispadu es una familia de troyanos bancarios que se dirige principalmente a México y Latinoamérica, la cual se observó por primera_\nvez en noviembre de 2019. El malware está escrito en Delphi y puede ejecutar acciones como captura de pantalla, simular acciones de\nmouse y teclado, registro de pulsaciones de teclas y control remoto del equipo infectado. Además, tiene capacidades de actualización a\ntravés de un archivo de Visual Basic Script (VBS), que se descarga y ejecuta automáticamente. Durante el proceso de infección, el malware\nrecopila los siguientes datos de la computadora de la víctima:\n\nVersión del sistema operativo\nNombre de la computadora\nIdioma del dispositivo\nAntivirus instalado\n\nEl principal vector de entrada de URSA/Mispadu es el spam y la publicidad maliciosa, al igual que en otras campañas activas en la región.\nTambién se utilizan cupones de descuento falsos, así como correos electrónicos maliciosos con supuestas facturas vencidas, en donde los\natacantes crean una situación aparentemente urgente que luego invita a los destinatarios a descargar un archivo .zip desde una URL\nmaliciosa.\n\n## La ingeniería social como método de propagación\n\n**Generación de empresas apócrifas para distribuir malware En el proceso de investigación, SCILabs observó que el ciberdelincuente**\nutiliza empresas apócrifas de comercio electrónico para desplegar el troyano URSA/Mispadu a través de facturas falsas y robo de información\nbancaria de los clientes. A continuación, se muestra un sitio, llamado “Baratomx“, que es una página falsa de comercio electrónico, creada\npara distribuir malware:\n\nFigura 5 – Página de comercio electrónico\n\nfalsa, creada por ciberdelincuentes para distribuir malware\n**Cupones, sorteos y premios falsos basados en la suplantación de instituciones financieras en México El grupo cibercriminal ha**\ncompartido en redes sociales como Facebook, cupones de descuento falsos de McDonald’s, así como rifas de vehículos a nombre de bancos\nen México, las cuales conducen a páginas maliciosas.\n\n\n-----\n\nFigura 6 – Campaña de\n\nmalversting en redes sociales\nEntre las campañas de publicidad maliciosa identificadas por SCILabs, también hay una relacionada con un supuesto sorteo de 50 iPhone,\nque se distribuyó a través de las redes sociales. A continuación, el análisis de cada una de las campañas de malware generadas por los\nciberdelincuentes.\n\n## Primera campaña distribuida a través de publicidad maliciosa y spam.\n\nSe colocaron anuncios patrocinados en Facebook que ofrecían falsos cupones de descuento de McDonald’s. En caso de hacer clic en uno de\nlos anuncios, la víctima potencial es dirigida a una de las páginas Web apócrifas que, al hacer clic en el botón sugerido por el anuncio,\ndescargará un archivo ZIP con un instalador malicioso de tipo MSI. Ocasionalmente, el archivo ZIP también incluirá software legítimo como\n_Mozilla Firefox o PuTTY, usados como señuelos para engañar a la víctima. El grupo cibercriminal compiló dos versiones diferentes del_\ntroyano bancario, según el país al que ataca. Además, decidió utilizar diferentes instaladores y etapas posteriores para cada país.\n\nFigura 7 – Flujo de infección de la primera campaña\n\n## Segunda campaña distribuida a través de campañas de phishing\n\nSe caracterizó porque los operadores de URSA/Mispadu enviaron correos electrónicos de phishing con supuestas facturas, siendo México el\npaís más afectado de Latinoamérica. En Portugal y países cercanos, se lanzaron campañas de phishing suplantando a entidades como\nVodafone o la policía judicial portuguesa. En esta campaña, los ciberdelincuentes invitan a los destinatarios de los correos electrónicos a\ndescargar un archivo .zip desde una URL maliciosa. Al igual que en la campaña anterior, el archivo .zip contiene un instalador de tipo MSI con\nun script de Visual Basic; a esto le sigue la descarga de dos droppers y tres capas de ofuscación que, cuando se eliminan, generan el archivo\n.vbs final que ejecuta un script de AutoIT. El objetivo final es cargar en memoria un binario de Delphi que contiene el código malicioso. Cabe\nresaltar que el malware utiliza nombres y logotipos bancarios legítimos para crear ventanas y superponer el navegador de la víctima, para\nrobar sus datos bancarios. El binario también utiliza dos herramientas legítimas, WebBrowserPassView y Mail PassView de NirSoft, que se\nutilizan para robar las credenciales almacenadas en los navegadores y clientes de correo electrónico de la víctima. Entre las funcionalidades\nde esta versión del troyano está finalizar la ejecución del script si detecta un entorno virtual como Hyper-V, VirtualBox o VMWare; también\nverifica que la computadora de la víctima tenga un código correspondiente a los idiomas español – España, portugués brasileño, español –\nMéxico, portugués – Portugal o español. Si el sistema usa un ID de idioma diferente a los listados, el proceso de ataque se detiene, cosa que\ntambién ocurre si el nombre de la computadora es “JOHN-PC”.\n\n\n-----\n\nFigura 8 – Flujo de\n\ninfección de la segunda campaña\n\n## Tercera campaña analizada por SCILabs\n\nEl análisis de SCILabs identificó que, con respecto a campañas anteriores de URSA/Mispadu, los TTP utilizados por los ciberdelincuentes han\nevolucionado. Además, el grupo de cibercriminales tiene una gran infraestructura para la distribución, almacenamiento y administración de\ncomputadoras infectadas con el troyano bancario URSA/Mispadu. Una vez que la víctima descarga y ejecuta el correo electrónico de\nphishing, se descarga otro archivo .vbs que realiza una solicitud GET a un archivo .xml en línea que contiene otro código .vbs. Este código\nfunciona como un dropper para obtener los archivos: Autoit script y un cargador del ejecutable. El objetivo es inyectar en memoria una DLL\nmaliciosa correspondiente a URSA/Mispadu y descargar los complementos necesarios para concluir su actividad maliciosa. Flujo técnico La\nvíctima recibe el correo electrónico de phishing, relacionado con una supuesta factura, que contiene un archivo comprimido adjunto. Si la\nvíctima lo extrae y lo ejecuta, el flujo de infección continúa como se muestra en el siguiente diagrama:\n\nFigura 9 – Flujo de\n\ninfección de la tercera campaña\nComo se observó en la campaña anterior, para crear, descargar y procesar los artefactos de infección, el dropper verificará que el código de\nidioma de la máquina víctima sea español – España, español – México, portugués – Brasil, portugués – Portugal o español; además revisará\nque el equipo no tenga el nombre “JOHN-PC” y que no se esté ejecutando en una máquina virtual, tal y como se muestra en el siguiente\ndiagrama:\n\n\n-----\n\nFigura 10 – Flujo de\n\nvalidación del script malicioso\nUna vez que se generan los artefactos finales (Autoit loader, un autoit script con la DLL maliciosa y un archivo de extensión aleatoria), el script\nmalicioso llamará al método ShellExecute y cargará el script Autoit, para continuar la infección.  Cuando la DLL maliciosa se carga en\nmemoria, se descargan dos carpetas comprimidas que contienen los archivos ssleay32.dll y libeay32.dll, que están asociados con el kit de\nherramientas OpenSSL utilizado por el troyano.  En la última etapa, este malware puede crear ventanas bancarias apócrifas superpuestas en\nel navegador cuando las víctimas ingresan a portales bancarios, para robar sus credenciales. Además, el troyano utiliza dos herramientas\nlegítimas (WebBrowserPassView y Mail PassView) para extraer las credenciales almacenadas en los navegadores y correo electrónico.\nFinalmente, los datos se envían al servidor de comando y control.  Cuando el troyano detecta que una víctima ingresa a un portal bancario,\nestablece una conexión con el servidor C2, con lo cual el ciberdelincuente gana el control de la computadora comprometida, permitiéndole\nutilizar diferentes comandos bajo demanda.\n\n## Modelo de diamante\n\n Perfil de amenaza basado en la matriz MITRE (PRE-ATT&CK)\n\n\n-----\n\nCo base e a est gac ó ea ada po SC abs, se obtu o a s gu e te at\n\n\n**Reconnaissance** T1592.002Software\n\n\nT1589.001Credentials\n\nT1583.004Server\n\n\nT1589.002-Email\nAddress\n\nT1586.001SocialMediaAccounts\n\n\nT1598.003SpearPhishingAttachment\n\nT1586.002-Email\nAccounts\n\n\nT1585.001Social\nMedia\nAccounts\n\n\n**Resource**\n**Development**\n\n\nT1583.001Domains\n\n\nT1592.004Client\nConfigurations\n\nT1583.003Virtual Private\nServer\n\n\nT1587.001Malware\n\n\n## Perfilamiento de la amenaza basado en la matriz MITRE (ATT&CK)\n\n**Initial Access** **Execution** **Persistence** **Defense Evasion** **Credential**\n**Access**\n\n\n**Discovery** **Collection** **C&C** **Exfiltration**\n\n\nT1566.002-Phishing:\nSpearphishing Link\n\nT1204.002–Malicious\nFile\n\nT1497Virtualization/Sandbox\nEvasion\n\nT1497.001-System\nChecks\n\n## Recomendaciones\n\n\nT1059.005Command\nand\nScripting\nInterpreter:\nVisual\nBasic\n\nT1106Native API\n\nT1055.001Dynamiclink Library\nInjection\n\nT1614System\nLocation\nDiscovery\n\n\nT1176Browser\nExtensions\n\nT1547.001Boot or\nLogon\nAutostart\nExecution:\nRegistry\nRun Keys /\nStartup\nFolder\n\nT1027Obfuscated\nFiles or\nInformation\n\nT1555.003Credentials\nfrom Web\nBrowsers\n\nT1082System\nInformation\nDiscovery\n\nT1074-Data\nStaged\n\n\nT1140Deobfuscate/Decode\nFiles or Information\n\nT1036Masquerading\n\nT1552.002Unsecured\nCredentials:\nCredentials in\nRegistry\n\nT1010-Application\nwindow discovery\n\nT1005-Data from\nlocal system\n\n\nT1552.001Unsecured\nCredentials:\nCredentials\nin Files\n\nT1081Credentials\nin Files\n\nT1518.001Software\nDiscovery:\nSecurity\nSoftware\nDiscovery\n\nT1560Archive\nCollected\nData\n\n\nT1083File and\nDirectory\nDiscovery\n\nT1057Process\nDiscovery\n\nT1113Screen\nCapture\n\n\nT1056Input\nCapture\n\nT1115Clipboard\nData\n\nT1001Data\nobfuscation\n\n\nT1573Encrypted\nChannel\n\nT1132.002NonStandard\nEncoding\n\n\nT1041Exfiltration\nOver C2\nChannel\n\n\nRealizar, en todos los niveles de la organización, campañas constantes de sensibilización sobre las diferentes técnicas de ingeniería\nsocial y phishing.\nEvitar descargar y ejecutar archivos adjuntos de correos electrónicos sospechosos, especialmente si tienen extensiones: “.exe”, “.vbs”,\n“.jar” y “.msi”.\nCrear políticas de contraseñas seguras y aplicar el principio de privilegio mínimo para los usuarios dentro de la organización.\nMantener todo el equipo informático de la organización con las últimas versiones del sistema operativo y las actualizaciones de\nseguridad aplicadas.\nConsiderar los indicadores de compromiso que se comparten en este documento.\n\n\n## IOC\n\n\n-----\n\n**oya o ba ca o U S /** **spadu** 099 33 C 8 6 85 C 8 C C 8 0889 5 9 556 0 5 83\n87340165EA0FB1E06364AA479ACB2FF104CEDDEAACE0E548F687B2960A28ED36\n09886CE8106CD07A3694F221DD19899AA29A72826F2FEE8A8BAA1B044704737A\n91A687ED27F469797317D82B8EB2BCEB4DFC84973B4BFB00F15E951DFDAEA9AE\n0916767D0EAA4E3E94DAF740B621C62258832F3F811FE4FA1C9536227FCBEA17\nC9E22D965771D8A8005D79B771AF602B95C14B0E23187ED4F718FFC0E87B26E2\n4BDA083A30A82698F57F672C5A333ADC84F37FE53D8FED6D8AA7AA31ECAC02FC\n02F541522898F87AA36552EAC38A70DC8A23B59E2BF6D4F65EE55485B05EDAAB\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-23 - Cyber Threat Profile MALTEIRO.pdf"
    ],
    "report_names": [
        "2021-12-23 - Cyber Threat Profile MALTEIRO.pdf"
    ],
    "threat_actors": [
        {
            "id": "646bbace-ef73-4848-a786-f91689ee276f",
            "created_at": "2024-04-24T02:00:49.596899Z",
            "updated_at": "2025-03-27T02:00:55.519655Z",
            "deleted_at": null,
            "main_name": "Malteiro",
            "aliases": [
                "Malteiro"
            ],
            "source_name": "MITRE:Malteiro",
            "tools": [
                "Mispadu"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "22e68267-f4ce-4dbc-a38f-415787753034",
            "created_at": "2023-01-06T13:46:39.497381Z",
            "updated_at": "2025-03-27T02:00:03.109838Z",
            "deleted_at": null,
            "main_name": "Malteiro",
            "aliases": [],
            "source_name": "MISPGALAXY:Malteiro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1675303744,
    "ts_updated_at": 1743041592,
    "ts_creation_date": 1675237211,
    "ts_modification_date": 1675237211,
    "files": {
        "pdf": "https://archive.orkl.eu/124ec482bddde6b4892339ee5334c030e9a3639d.pdf",
        "text": "https://archive.orkl.eu/124ec482bddde6b4892339ee5334c030e9a3639d.txt",
        "img": "https://archive.orkl.eu/124ec482bddde6b4892339ee5334c030e9a3639d.jpg"
    }
}