{
    "id": "828467fd-6624-444f-a42b-219630642432",
    "created_at": "2023-01-12T15:03:03.499622Z",
    "updated_at": "2025-03-27T02:17:11.300098Z",
    "deleted_at": null,
    "sha1_hash": "a148fa26f474f6f3cc3d9a68accddbaf313e16ac",
    "title": "2016-09-26 - Sofacy’s ‘Komplex’ OS X Trojan",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1652554,
    "plain_text": "# 2015\n\n## THREAT REPORT\n\n\n## THREAT REPORT\n\n\n-----\n\n## Contents\n\n##### Foreword 2\n\n About the ACSC 3\n\n Introduction 4\n\n The Australian Threat Environment 5\n\nCyber adversaries targeting Australia 5\n\nCyber espionage 6\n\nCyber attack 8\n\nCybercrime 8\n\nDisruption 9\n\nCyber security incidents reported to ACSC agencies 10\n\n##### Activity Targeting Australian Networks 12\n\nCyber intrusions 12\n\nRemote Access Tools 13\n\nWatering-hole techniques 13\n\nMalware 14\n\nRansomware 16\n\nDistributed Denial of Service 17\n\nHacktivism 18\n\nMitigation advice 18\n\n##### Key Cyber Security Alerts 20\n\nHeartbleed 20\n\nBash / Shellshock 21\n\nEnd of Support for Windows XP and MS Office 2003 21\n\nMicrosoft Active Directory Group Policy Preferences Vulnerability 21\n\n##### Cloud Computing Security 22\n\n Incident Reporting 23\n\n Outlook 24\n\nTrends for 2015 and beyond 24\n\n##### Glossary 25\n\n\n-----\n\n## The Australian Cyber Security Centre Threat Report 2015\n\n#### Foreword\n\nThe cyber threat to Australian organisations is undeniable, unrelenting and continues to grow. If an\norganisation is connected to the internet, it is vulnerable. The incidents in the public eye are just the tip\nof the iceberg.\n\nAustralia must be vigilant and proactive in its approach to cyber security, investing resources to meet\nthe challenges of a complex cyber environment.\n\nCompromise is expensive. It can include financial losses, damage to reputation, loss of intellectual\nproperty and disruption to business. Australia cannot afford this.\n\nThis is the first unclassified Australian Cyber Security Centre (ACSC) Threat Report. All ACSC partner\nagencies have contributed to provide information tailored for Australian organisations about the threats\ntheir networks face from cyber espionage, cyber attacks and cybercrime. It also contains mitigation\nand remediation information to assist organisations to prevent, and respond to, the threat.\n\nTo combat the threats detailed in this report and reduce the risk of compromise, organisations must\nmove now to implement cyber security measures to make Australia a harder target, increase the\nconfidence of Australians when they are online, and maximise the benefits of the internet for\nAustralian organisations.\n\nUltimately, this will see organisations and their users taking greater responsibility for the security of\ntheir networks and information. The ACSC has been established to help in this process.\n\nThe information in this report is designed to assist the achievement of a more cyber secure Australia.\nYour feedback is welcome.\n\n\n-----\n\n#### About the ACSC\n\nThe ACSC brings cyber security capabilities from across government together in one location. It is a\nhub where the private and public sector can collaborate and share information to combat serious\ncyber security threats. ACSC partner agencies include:\n\nAustralian Crime Commission (ACC)\n\nAustralian Federal Police (AFP)\n\nAustralian Security Intelligence Organisation (ASIO)\n\nAustralian Signals Directorate (ASD)\n\nComputer Emergency Response Team (CERT) Australia\n\nDefence Intelligence Organisation (DIO).\n\nFor more information about the ACSC, visit acsc.gov.au.\n\nTo provide feedback or otherwise contact the ACSC about this Report please use the details available\nat acsc.gov.au/contact.html.\n\n\n-----\n\n#### Introduction\n\nThe number, type and sophistication of cyber security threats to Australia and Australians are\nincreasing. Due to the varied nature of motivations for cyber adversaries targeting Australian\norganisations, organisations could be a target for malicious activities even if they do not think the\ninformation held on their networks is valuable, or that their business would be of interest to cyber\nadversaries.\n\nThis first unclassified report by the ACSC describes the range of cyber adversaries targeting\nAustralian networks, explains their motivations, the malicious activities they are conducting and their\nimpact, and provides specific examples of activity targeting Australian networks during 2014. This\nreport also offers mitigation advice on how organisations can defend against these activities.\n\nThe ACSC’s ability to detect and defend against sophisticated cyber threats continues to improve. But\ncyber adversaries are constantly improving their tradecraft in their attempts to defeat our network\ndefences and exploit the new technologies we embrace.\n\nThere are gaps in our understanding of the extent and nature of malicious activity, particularly against\nthe business sector. The ACSC is reaching out to industry to build partnerships to improve our\ncollective understanding. Future iterations of the Threat Report will benefit from these partnerships\nand help to close gaps in our knowledge.\n\n\n-----\n\n#### The Australian Threat Environment\n\nAustralian government and businesses increasingly rely on the internet to deliver products and\nservices. This comes with risks – Australian networks and their users are vulnerable to malicious cyber\nactivity such as cyber espionage, cyber attack and cybercrime.\n\nAustralia’s information and communications technology (ICT) security community, academia and\ndecision makers in government and business need to:\n\n   - keep pace with developments\n\n   - identify new vulnerabilities\n\n   - advise Australian organisations on how to mitigate emerging threats.\n\n**Internet subscribers in Australia**\nAt the end of December 2014 there were:\n\n\n\n- more than 12.6 million internet subscribers in Australia\n\n\n\n- **21 million subscribers to mobile services with an internet connection.[ 1]**\n\n\n##### Cyber adversaries targeting Australia\n\n\n**_What is a cyber adversary?_**\n\n\nA cyber adversary is an individual or organisation (including an agency of a nation\nstate) that conducts cyber espionage, crime or attack.\n\nCyber adversaries are aggressive and persistent in their efforts to compromise Australian networks\nand information. They are constantly improving their tradecraft in an attempt to defeat our network\ndefences and exploit new technologies.\n\nAustralia is an innovative country with a globally important resources sector. We are a regional leader\nwith global interests and important partnerships. This makes Australia a target-rich environment for\ncyber adversaries.\n\nThere are a range of cyber adversaries motivated to target Australian networks.\n\n**_Foreign state-sponsored adversaries_**\n\nForeign state-sponsored adversaries, including nation-states, seek economic, foreign policy, defence\nand security information for strategic advantage. Such adversaries have traditionally possessed the\nmost advanced and sophisticated tools to conduct their activities, sometimes maintaining access to an\norganisation’s network for years at a time to steal the information they require. These adversaries are\nmost frequently identified as Advanced Persistent Threats (APT).\n\n**_Serious and Organised Criminals_**\n\nFinancially motivated criminals that exploit and access systems for financial gain are a substantial\nthreat to Australia. Transnational serious and organised cybercrime syndicates are of most concern,\nspecifically those which develop, share, sell and use sophisticated tools and techniques to access\nnetworks and systems impacting Australia’s interests.\n\n1 Australian Bureau of Statistics, Internet activity Australia, December 2014, 2015,\nabs.gov.au/ausstats/abs@.nsf/mf/8153.0/\n\n\n-----\n\n**_Issue motivated groups and individuals with personal grievances_**\n\nHacktivists and individuals causing nuisance, attempting to draw attention to themselves and their\ncauses, while usually less capable and sophisticated, are still able to cause disruption to Australian\ngovernment and businesses.\n\n##### Cyber espionage\n\n\n**_What is cyber espionage?_**\n\n\nCyber espionage is offensive activity designed to covertly collect information from a\nuser’s computer network for intelligence purposes.\n\nCyber espionage can have a significant impact on Australia’s national security and economic\nprosperity. Foreign state-sponsored adversaries are targeting the networks of the Australian\ngovernment (including state and territory), industry and individuals to satisfy requirements for\neconomic, foreign policy, defence and security information, and gain advantage over Australia.\n\nAustralia is an attractive target for cyber espionage due to our:\n\n#####  resource wealth\n\n  range of commercial interests in Australia and internationally\n\n  expertise in certain fields of scientific research, manufacturing and technology\n\n  particular bilateral relationships and alliances\n\n   - prominent role in the Indo-Pacific region.\n\nSignificant compromises can also cause economic harm, damage Australia’s reputation and\nundermine international and domestic confidence in Australian network security.\n\nAn increasing number of countries are developing cyber espionage capabilities as this type of activity\noffers high returns with relatively low cost and risk. Many countries will continue to deny they have a\ncyber espionage program, however, as more cyber security firms publicise these activities, it is\nbecoming more difficult for adversaries to plausibly deny their capabilities.\n\nThe ACSC is aware that cyber espionage adversaries target industry networks in addition to\ngovernment networks to acquire desired information. Cyber adversaries will target the weakest link; if\nthe network security of their primary target is robust, they will move to secondary targeting of other\nnetworks that may hold the same information but are easier to compromise.\n\nThe cyber espionage threat to Australia continues to evolve and expand. The ACSC is aware of\nforeign state-sponsored adversaries using malicious software typically used by cybercriminals. In\nsome cases, their activity appears to be financially motivated cybercrime, making it difficult for the\nvictim to identify the true adversary, assess how much damage has resulted from the activity and\nremediate the damage.\n\nCyber espionage does not always happen in isolation, with cyber espionage activities efforts\nsometimes combined with other means of collection. As such, organisations need to work within their\nown organisations to consider how cyber defences are integrated with other security measures as part\nof a broader security posture.\n\n\n-----\n\n**_Cyber espionage against Australian Government networks_**\n\nThe ACSC sees daily cyber espionage activity targeting Australian Government networks.\n\nAustralian Government agencies that have implemented ASD’s Top 4 Strategies to Mitigate Targeted\n_Cyber Intrusions_ and a selection of the remaining strategies based on internal risk assessments, are\nimproving their protection against cyber espionage activities.[2] In addition, they are reducing the\nconsequences of these activities to Australia’s national security and economic prosperity.\n\nWhile the overall number of cyber security incidents increased in 2014, the number of confirmed\nsignificant compromises of federal Australian Government networks has decreased since 2012.\nImproving network security forces cyber adversaries to either develop their capability or find alternative\ntargets.\n\n**_Cyber espionage against Australian businesses_**\n\nAustralian businesses are increasingly being identified as targets of cyber espionage. The theft of\nintellectual property or commercially sensitive information can:\n\n   - seriously impair reputations, profitability and ability to compete in the global economy\n\n   - limit business opportunities and reduce a company’s economic competitiveness\n\n   - undermine a company’s business model and viability.\n\n**_Targeting of systems of national interest and critical infrastructure_**\n\n\n**_What are systems of national interest and critical infrastructure?_**\n\n\n**Systems of national interest are those systems that, if rendered unavailable or**\notherwise compromised, could result in significant impacts on Australia’s economic\nprosperity, international competitiveness, public safety, social wellbeing or national\ndefence and security.\n\n\n**Critical infrastructure is a subset of systems of national interest.**\n\n\nAustralia’s systems of national interest and critical infrastructure are vulnerable to malicious cyber\nactivity. In 2014, CERT Australia responded to 11,073 cyber security incidents affecting Australian\nbusinesses, 153 of which involved systems of national interest, critical infrastructure and government.\n\nIn 2014, the top five non-government sectors assisted by CERT Australia in relation to cyber security\nincidents were: energy, banking and financial services, communications, defence industry, and\ntransport.\n\nThe ACSC relies primarily on voluntary self-reporting for information about cyber security incidents\naffecting these networks. Some sectors have not yet invested heavily in cyber security, and therefore\nmay not understand the level of risk or potential economic harm to their business. Furthermore, some\nbusinesses may be hesitant to report incidents due to the perceived impact or harm to their reputation.\n\nThe ACSC is working to forge stronger relationships with Australian businesses to better assess cyber\nsecurity practices and support improved cyber security.\n\n2 Access ASD’s Top 4 Strategies to Mitigate Targeted Cyber Intrusions at asd.gov.au/infosec/mitigationstrategies.htm\n\n\n-----\n\n##### Cyber attack\n\n\n**_What is a cyber attack?_**\n\n\nA cyber attack is a deliberate act through cyber space to manipulate, destruct, deny,\ndegrade or destroy computers or networks, or the information resident in them, with\nthe effect, in cyber space or the physical world, of seriously compromising national\nsecurity, stability or prosperity.\n\nThe ACSC treats cyber attacks as extremely serious and provocative events. Destructive cyber\nattacks could be considered equivalent to an armed attack, and therefore, an act of war.\n\nAustralia has not yet been subjected to any activities that could be considered a cyber attack. A\ndestructive cyber attack against Australian networks or critical infrastructure – that would seriously\ncompromise national security, stability or prosperity – is unlikely outside a period of significant\nheightened tension or escalation to conflict with another country.\n\nDue to some overlap in the tools and techniques used in cyber attack and cyber espionage, efforts by\norganisations to improve network resilience and better protect their networks from cyber espionage\nwill reduce the effectiveness of cyber attacks that target Australia.\n\nAs the technological and financial barriers to developing an effective attack capability diminish,\nAustralia faces the threat of a more diverse set of state and non-state-based cyber attacks in the\nfuture. Although some non-state adversaries – such as terrorist and issue-motivated groups – have\nexpressed intent to conduct cyber attacks, they will probably continue to use disruption and vandalism\nto gain publicity and further their causes.\n\n##### Cybercrime\n\n\n**_What is cybercrime?_**\n\n\nIn Australia, cybercrime refers to criminal acts involving the use of computers or\nother ICT, or targeted against computers or other ICT.\n\n**_Pure cybercrime: Crimes directed at computers or other ICT such as_**\nunauthorised access to, modification of or impairment of electronic\ncommunications or data.\n\n**_Technology-enabled crime: Crimes where computers or ICT are an integral_**\npart of an offence, such as online fraud, online identity theft and the online\ndistribution of child exploitation material.\n\nCybercrime affects individuals, businesses and governments. Australia’s relative wealth and high use\nof technology – including social media, email and online banking and government services – make it\nan attractive target for organised criminal syndicates. Misreporting and under-reporting of cybercrime\nmake it difficult to assess the prevalence and impact of offences.\n\nAlthough it is difficult to establish an accurate figure for the cost of cybercrime in Australia, an\nOctober 2013 industry estimate put the cost over the previous 12 months at A$1 billion.[3] This is likely\nto be an underestimation as it is based on adult individuals affected and does not include the cost to\nbusiness and government.\n\n3 Symantec, 2013 Norton Report: Total Cost of Cybercrime in Australia amounts to A$1.06 billion, 13 October 2013,\nsymantec.com/about/news/resources/press_kits/detail.jsp?pkid=norton-report-2013\n\n\n-----\n\nThere are direct and indirect costs to cybercrime victims including:\n\n   - damage to personal identity and reputation\n\n   - loss of business or employment opportunities\n\n   - impact on emotional and psychological wellbeing of individual victims.\n\nThe actual costs of cybercrime at the systemic level encompass the:\n\n   - financial losses from fraud\n\n   - costs of immediate responses\n\n   - system remediation costs\n\n   - flow-on costs to government support programs that assist cybercrime victims.\n\nThe complexity, sophistication and impact of cybercrime evolves as technology evolves, making it\ndifficult to track the technological advancements of cyber criminals. Furthermore, the complexity and\nsophistication of malware used for cybercrime now rivals the capabilities of some state-sponsored\nadversaries. As mentioned previously, foreign state-sponsored adversaries are using malicious\nsoftware typically used for financially motivated cybercrime to mask their identities and activities.\n\nThe ACSC assesses that cybercrime activity will continue to increase over the next five years.\nOrganised crime groups are using sophisticated malware to improve their success, and avoid\ndetection, in gaining unauthorised access to computer systems. Previously considered a niche\ncapability, malware used for cybercrime is now readily available through the online criminal\nmarketplace, often with ongoing technical support, making it accessible to people with minimal ICT\nknowledge.\n\n##### Disruption\n\nThe disruption of services or networks can affect Australian government and businesses. Hacktivists\nand individuals causing nuisance favour activities such as denial of service, web defacement and\nelectronic graffiti to disrupt business and government activities. These activities are frequently\nopportunistic in nature rather than targeted, taking advantage of a victim’s poor cyber security posture.\n\nIssue-motivated groups can be particularly active around high profile events that attract significant\nmedia attention, as these often result in the disruption gaining maximum visibility. The capabilities of\nadversaries conducting these activities, while not as sophisticated as that of foreign state-sponsored\nadversaries, can still be very effective in achieving their limited aims.\n\nHacktivism and denial of service activities are explained later in the report.\n\n\n-----\n\n#### Cyber security incidents reported to ACSC agencies\n\n\n**_What is a cyber security incident?_**\n\n\nA cyber security incident is any activity that may threaten the security of a system or\nits information. A compromise is an incident where the security of a system or its\ninformation was successfully harmed. Examples of compromises include the\nextraction of information from a computer network, defacement of a website, or\ndegradation in the reliability of an online service.\n\nAttempts to compromise government, business and other networks of national importance are\nregularly identified by, or reported to, the ACSC. Cyber adversaries are constantly adapting their\ntechniques in an attempt to breach security and compromise Australian networks.\n\nACSC partner agencies continued to compile separate statistics until the ACSC was officially opened\nin November 2014. Consequently the following cyber security incident response statistics for 2014\nhave been presented separately in this publication.\n\nASD is predominantly responsible for responding to cyber security incidents involving Australian\nGovernment networks and other networks of national importance; consequently, ASD statistics may\nreflect this bias. The 2014 ASD statistics reflect cyber security incidents that were triaged through the\nformer Cyber Security Operations Centre.\n\n**Figure 1: Cyber security incident responses by ASD**\n\n\n-----\n\nCERT Australia is predominantly responsible for responding to cyber security incidents involving\nAustralian businesses and systems of national interest, including critical infrastructure operators;\nCERT Australia statistics may reflect this bias.\n\n**Figure 2: Incidents responded to by CERT Australia affecting**\n**systems of national interest and critical infrastructure in 2014**\n\n\n-----\n\n#### Activity Targeting Australian Networks\n\n##### Cyber intrusions\n\n\n**_What is a cyber intrusion?_**\n\n\nA cyber intrusion, also referred to as unauthorised access or hacking, occurs when\nsomeone gains access to a computer or device without the owner’s permission.\n\nForeign state-sponsored actors conduct targeted cyber intrusions, seeking information about\nAustralia’s business dealings, intellectual property, scientific data and government policy decisions.\nThese activities can give them a diplomatic, political, military or economic advantage over Australia.\n\nAdversaries that conduct intrusions for cybercrime purposes gain unauthorised access to computers,\nnetworks and devices to illicitly obtain funds. This can involve extortion as well as extracting\nusernames, passwords and other information to undertake theft and fraud.\n\nCyber adversaries exploit security vulnerabilities in a targeted computer or network to gain access,\nand frequently use social engineering techniques such as carefully crafted emails to entice a user to\nclick on a link or open an attachment. These techniques, also known as spear phishing, remained a\nprevalent method used to target Australian organisations in cyber intrusions during 2014. The\nsophistication of these emails continues to grow, making them more difficult to detect.\n\n\n**Case study: Spear phishing**\n\n\nOrganisations with poor cyber security are particularly susceptible to compromises\nresulting from socially engineered emails.\n\nAn employee at an Australian business received an email that appeared to have\nbeen sent from another business with which they dealt regularly. However, the email\nhad been sent from an unfamiliar webmail account. Although the recipient of the\nemail was suspicious and attempted to check the legitimacy of the email, they\nopened an email attachment without waiting for a response.\n\nThe attachment was an executable (.exe) file masked as a MS Excel file.\nConsequently, the network was compromised, and it is believed that intellectual\nproperty, personnel records, business development proposals and project\ninformation may have been stolen.\n\nThe compromise could have been prevented if application whitelisting had been\nadequately implemented on the network, including on the laptop that the employee\nwas using when the attachment was opened.\n\n\n-----\n\n##### Remote Access Tools\n\nA Remote Access Tool (RAT) is an administration tool that allows someone to access a computer from\na remote location. While RATs have legitimate purposes, they can also be associated with malicious\nactivity. In 2014, the ACSC observed RATs being used in targeted cyber intrusions.\n\n**Case study: RAT**\nIn 2014, the ACSC received a report from an Australian state government agency\nthat had discovered a compromise of one of its servers when performing an annual\npenetration test.\n\nAn ACSC investigation confirmed the presence of Java ServerPage RAT (jRAT) on\nfour servers. This had allowed remote administrator-level access to the servers and\nconfidential files stored on them. The default administrator credentials had not been\nchanged after a recent software upgrade. To remediate, the servers were removed\nfrom the network and rebuilt.\n\n##### Watering-hole techniques\n\n\n**_What is a watering-hole?_**\n\n\nA watering-hole is a compromised legitimate website, frequented by a cyber\nadversary’s intended targets. Malware placed on the website is intended to\ncompromise the computers of visitors to the site.\n\nThe use of watering-hole techniques by cyber adversaries targeting Australian networks continues to\ngrow. Taking full advantage of a user’s trust in a website, the watering-hole technique provides an\neffective method for exploitation.\n\nIn 2014, the ACSC noted incidents involving watering-hole exploitation of websites regularly visited by\nAustralian government employees. These incidents were mitigated successfully, as the malware was\nattempting to exploit a vulnerability to which the visitor was not exposed. It is important to understand\nhowever that this type of activity is no longer opportunistic; it is now an activity targeting Australian\ngovernment and business.\n\nDuring 2014, CERT Australia handled more than 8,100 incidents involving compromised websites.\nWebsites can often be compromised due to poor maintenance or security configuration. Cyber\nadversaries often target these websites to distribute malware, host phishing websites or build denial of\nservice botnets.\n\nWhile these issues are relatively easy to remedy from a technical perspective, the potential impact to\nthe website owner and visitors can be significant. In many cases, the owner of the website was not\naware of the compromise until they were notified or the website had been blacklisted by a security\norganisation. A blacklisted website can experience a significant drop in regular traffic and therefore a\ndrop in revenue.\n\n**Case study: Watering-hole**\nIn October 2014, CERT Australia issued an advisory warning of watering-hole\nactivity specifically targeting organisations in the energy sector. The advisory listed\nwebsites that had likely been compromised, and encouraged clients to report any\nsuspicious activity. CERT Australia clients were able to use the information provided\nto successfully detect and block communications to watering-hole sites.\n\n\n-----\n\n##### Malware\n\n\n**_What is malware?_**\n\n\nMalware is MALicious softWARE designed to facilitate unauthorised access to a\nsystem, or cause damage or disruption to a system.\n\nIn 2014, malware, including ransomware, was the predominant cybercrime threat in Australia. It is a\npersistent threat because new malware types are developed and released regularly, and antivirus\nsoftware cannot detect all new variants. Some malware remains dormant on a system for a period of\ntime, circumventing security and running undetected until achieving its objectives.\n\nThe Australian Communications and Media Authority (ACMA) operates the Australian Internet Security\nInitiative (AISI) program. The AISI provides participants with daily notifications of IP addresses on their\nnetworks observed as potentially vulnerable to malicious exploits or infected by malware.[4]\n\nBetween 17 October 2014 and 14 January 2015, the AISI reported over 15,000 malware compromises\ndaily to Australian Internet Service Providers (ISPs) for them to action.[5]\n\nData collected by the AISI between April and December 2014 indicates the three malware variants\nmost frequently detected on Australian IP ranges were:\n\n   - Zeus\n\n   - ZeroAccess\n\n   - Conficker.\n\n**_Zeus_**\n\nDiscovered in July 2007, Zeus is a Trojan that steals banking details through keylogging and\nform-grabbing. It is spread through drive-by downloads and socially engineered emails. Zeus\nGameOver is a variant of this Trojan.\n\nIn June 2014, approximately 1 million computers worldwide were thought to be infected with Zeus\nGameOver, causing an estimated loss of US$100m.\n\n\n**Case Study: Zeus GameOver takedown**\n\n\nIn 2014, the AFP assisted in operational activity led by the US Federal Bureau of\nInvestigation (FBI), which resulted in the takedown of Zeus GameOver infrastructure.\nThe US obtained civil and criminal orders authorising measures to sever\ncommunication between the infected computers and redirect them from criminal\nservers to government controlled servers. Additionally, these orders authorised the\nFBI to identify victim IP addresses and provide this victim information to international\nCERTs, ISPs and other private sector organisations to assist victims in removing the\nmalware from their computers.\n\nEvgeniy Bogachev, the leader of a cybercrime group based in Russia and the\nUkraine, was responsible for developing and operating Zeus GameOver, as well as\na type of ransomware named CryptoLocker.\n\n4 The 140 AISI participants include ISPs, educational institutions and other Internet providers\n\n5 Australian Communications and Media Authority, AISI malware statistics, 2014 www.acma.gov.au/Industry/Internet/eSecurity/Australian-Internet-Security-Initiative/australian-internet-security-initiative\n\n\n-----\n\n**Case Study: Zeus GameOver takedown (continued) The takedown of Zeus**\nGameOver demonstrates that international collaboration across government and\nindustry can successfully disrupt serious and organised cybercrime activity.[6]\n\n**_ZeroAccess_**\n\nZeroAccess is another type of malware used for financially motivated cybercrime. ZeroAccess causes\ncomputers that are infected to generate ‘clicks’ on advertisements to receive commission from the\nadvertising companies (also known as ‘click fraud’). These companies are not usually aware that the\nclick activities are not legitimate. Infection by this malware is typically through drive-by downloads and\nsocially-engineered emails. While ZeroAccess is currently used for click fraud and bitcoin mining, the\nthreat arises from its ability to undertake any activity desired by its controller. The large network of\nZeroAccess botnets can be used as the delivery mechanism for any other desired activities that may\npose significant risks to Australian interests.\n\n\n**Case Study: ZeroAccess**\n\n\nZeroAccess is highly commercialised and highly profitable malware with a ‘pay-perinstall’ incentive that has contributed to its growth. The amount paid is based on the\ncountry in which the installation occurs, with installations on Australian computers\nearning US$75. According to AISI data, ZeroAccess malware compromised an\naverage of 4,000 devices per day between October and December 2014.\n\nZeroAccess targets a range of devices, and uses an advanced method of selfprotection by disabling any security tool trying to detect and remove it. In 2014, it\naffected Point of Sale systems in 60 Australian Pizza Hut outlets. During these\nincidents, stores were unable to serve customers for up to two hours. In some cases,\nstores were offline for an entire day while computers were re-imaged.\n\nDespite law enforcement interdiction, ZeroAccess remains resilient to disruption due\nto the complexity of its network. It continues to be a threat in Australia, through\nbitcoin mining and click fraud, and it has the potential to be used for other types of\ncybercrime activity.[7] **_[8]_** **_[9]_**\n\n**_Conficker_**\n\nFirst detected in November 2008, Conficker is a worm that targets Microsoft Windows operating\nsystems, using vulnerabilities to gain privileged access to a network. Although security patches to\naddress these vulnerabilities have existed for years, many computers remain vulnerable and infected.\n\n6 GameOver Zeus Botnet Disrupted – Collaborative Effort Among International Partners\nfbi.gov/news/stories/2014/june/gameover-zeus-botnet-disrupted/\n\n7 Sophos, Sophos Technical Paper: The ZeroAccess Botnet – Mining and Fraud for Massive Financial Gain, 2012\nsophos.com/en-us/why-sophos/our-people/technical-papers/zeroaccess.aspx\n\n8 Australian Communications and Media Authority, AISI malware statistics, 2014 acma.gov.au/Industry/Internet/eSecurity/Australian-Internet-Security-Initiative/australian-internet-security-initiative\n\n9 Tech Worm, Pizza Hut Australia Point of Sales hit with ZeroAccess rootkit malware for over a year, 2014\ntechworm.net/2014/11/pizza-hut-australia-point-sales-hit-zeroaccess-rootkit-malware-year.html\n\n\n-----\n\n##### Ransomware\n\n\n**_What is ransomware?_**\n\n\nRansomware refers to extortion through the use of malware that typically locks a\ncomputer’s content and requires victims to pay a ransom to regain access. It can\nalso be accompanied by a threat that the computer has been locked as a result of\nillegal or questionable conduct by the victim.\n\nRansomware campaigns against computers in Australia and overseas are increasing. There are a\nvariety of campaign methodologies and themes, but most types of ransomware encrypt files on a\ncomputer so that they cannot be accessed until a ransom has been paid. Some types of ransomware\nwill also activate the webcam to try to convince the user that their computer is under real-time\nsurveillance. This may be reinforced by an accompanying message (frequently purporting to be from a\nlaw enforcement or government agency) claiming that the computer has been used for illegal activity\nand demanding payment of a fine.\n\nIn July 2014, a number of ACSC partner agencies issued alerts notifying their customers of an\naggressive encrypting ransomware campaign. The campaign was targeting government and nongovernment organisations through phishing emails with links to a website hosting a .zip file containing\nmalicious executable content.\n\nIn separate activity during 2014, it was discovered that CryptoWall 2.0 ransomware was using\n‘malvertising’ to infect computers visiting popular Australian websites. These malvertisements\nexploited Adobe Flash vulnerabilities in web browsers to covertly install CryptoWall 2.0 on the\ncomputers of visitors to these websites. The ransomware then encrypted the hard drive and disabled\naccess until the victim paid a fee for the decryption key.[10] It is important to note that the websites\nthemselves were not compromised. Rather, it was the advertising network connected to the websites\nwhich did not have sufficient screening detection against advertisements originating from malicious\nsources.\n\nMany large organisations and some members of the community were able to remove the ransomware\ninfections by restoring computers and data from a backup. However, organisations that had not\nperformed a recent backup experienced much greater disruption (the ACSC was aware of one\norganisation that had not performed a network backup in the previous 12 months). Some\norganisations found that, despite restoration from backup, roaming profiles were continuing to execute\nthe malware and re-compromising their networks.\n\n10 Proofpoint, Malware in Ad Networks Infects Visitors and Jeopardizes Brands, 22 October 2014\nadmin.proofpoint.com/threatinsight/posts/malware-in-ad-networks-infects-visitors-and-jeopardizes-brands.php\n\n\n-----\n\n**Case study: TorrentLocker**\n\n\nTorrentLocker was first identified as a new variant of ransomware in February 2014.\nMasquerading as CryptoLocker, it initially only targeted Australia but by the end of\nthe year had been observed targeting a total of 13 countries. Australian victims\nreceived a ransom message specifying the ransom fee, and demanding that they\npurchase bitcoins from specified Australian websites and send the payment to the\naddress provided. The ransom amount ranged from A$500 to A$600.\n\nTorrentLocker used the branding of trusted and well-known Australian corporations\nas part of its social engineering techniques.\n\nMisappropriation of business names and counterfeiting of legitimate brands harms\nthe reputation of these businesses and impacts customer loyalty. Businesses need\nto invest time and resources to inform customers about scams that exploit their\nidentity, and then incur further costs to improve security.\n\nOne prominent Australian corporate victim, whose brand has been exploited,\nestimates that its response to TorrentLocker, including monitoring, takedown actions\nagainst malicious domains, and brand protection, has so far cost A$185,000.\n\nThe ACC estimated in December 2014, that approximately 16,000 victims had been\naffected and paid a cumulative ransom of approximately A$8 million. The numbers of\nthose systems that were infected without a ransom being paid are much higher, and\na cost may be associated with each infection for the subsequent system repairs.[11] [12]\n\n##### Distributed Denial of Service\n\n\n**_What is a Denial of Service (DoS)?_**\n\n\nA DoS is an attempt by a cyber adversary to prevent legitimate access to online\nservices (typically a website), by consuming the amount of available bandwidth or\nthe processing capacity of the computer hosting the online service. A DoS can also\noccur unintentionally through misconfiguration or a sudden and unexpected surge in\nlegitimate usage. When multiple computers are used to conduct these activities,\nsuch as through the use of a botnet, it is referred to as Distributed Denial of Service\n(DDoS).\n\nThe impact of DDoS activities can be amplified when they are bounced off other internet services.\nCyber adversaries are now using infrastructure that can turn small requests into large responses\n(some up to 500 times larger), meaning that even relatively small botnets can cause significant\nproblems for Australian organisations.\n\nThe number of DDoS activities identified by or reported to the ACSC during 2014 remained steady\ncompared to 2013. The ACSC assesses that DDoS activities will remain a threat to Australian\nnetworks and organisations, particularly from issue-motivated groups and individuals demanding\nattention. Cyber adversaries are increasingly finding ways to monetise activities that were previously\nconsidered to be solely nuisance value.\n\n11 iSIGHT Partners, Analysis of ‘TorrentLocker’ – A New Strain of Ransomware Using Components of Cryptolocker and\n_CyrptoWall, 2014 isightpartners.com/2014/08/analysis-torrentlocker-new-strain-malware-using-components-cryptolocker-_\ncryptowall/\n\n12 Australian Crime Commission, Organised Crime in Australia 2015, 2015\ncrimecommission.gov.au/sites/default/files/FINAL-ACC-OCA2015-180515.pdf\n\n\n-----\n\nA growing trend observed by the ACSC is DDoS extortion, where an adversary will threaten to launch\nDDoS activity against an organisation unless a fee is paid. These threats can be accompanied by a\nsmall-scale DDoS activity to demonstrate intent.\n\nThe ACSC advises Australian organisations not to respond to threats. There is no way to determine if\nthe threat is credible, or to guarantee that the DDoS will not occur if the fee is paid.\n\nThe ACSC has recently updated its advice on DDoS, including information on preparing for and\n[responding to such activities, see asd.gov.au/publications/protect/preparing-for-responding-to-ddos-](http://www.asd.gov.au/publications/protect/preparing-for-responding-to-ddos-activities.htm)\n[activities.htm.](http://www.asd.gov.au/publications/protect/preparing-for-responding-to-ddos-activities.htm)\n\n\n**Case study: DDoS**\n\n\nA major Australian organisation was the victim of a sustained DDoS targeting its\nmain website. An issue-motivated group purporting to oppose the work of this\norganisation claimed responsibility for the activity. The group had exploited poorly\nconfigured domain name system (DNS) infrastructure to conduct the activity.\n\nCERT Australia provided advice to the organisation on how to protect itself from a\nDDoS activity, and analysed logs of the activity. As a result of the analysis, CERT\nAustralia identified DNS servers utilised in the activity, and contacted the system\nowners to help them improve the configuration so that those systems would not be\nused in further DDoS activity.\n\n##### Hacktivism\n\n**_What is hacktivism?_**\n\n\nMalicious cyber activity conducted by issue-motivated groups or individuals for the\npurpose of promoting a particular cause or targeting a particular person or\norganisation associated with an issue or cause.\n\nAnother type of malicious activity occasionally observed in Australia is issue-motivated hacking, also\nreferred to as hacktivism. Hacktivists use cyberspace to sustain political debate and engage in protest.\nThis can include electronic graffiti such as offensive propaganda postings on social media platforms\nand defacement of web pages, unauthorised computer intrusions and other acts of digital tampering.\nThis type of activity can cause disruption for affected organisations.\n\nOver the past two years, the AFP has disrupted activities and arrested individuals involved in the\ncompromise and defacement of government websites and theft of personal and corporate data\nholdings. While cyber adversaries can operate from anywhere, arrests can be a significant deterrent to\nhackers in Australia.\n\n##### Mitigation advice\n\n**_Mitigating cyber intrusions_**\n\nKey publications such as the Australian Government Information Security Manual (ISM) and the\n_Strategies to Mitigate Targeted Cyber Intrusions are regularly updated to reflect the increasing_\nsophistication of cyber adversaries targeting Australian networks. When implemented as a package,\nthe Top 4 Strategies to Mitigate Targeted Cyber Intrusions can mitigate at least 85% of targeted cyber\n[intrusions responded to by the ACSC. See both asd.gov.au/infosec/ism/index.htm](http://www.asd.gov.au/infosec/ism/index.htm) and\n[asd.gov.au/infosec/mitigationstrategies.htm.](http://www.asd.gov.au/infosec/mitigationstrategies.htm)\n\n\n-----\n\n**_Mitigating watering-hole techniques_**\n\nEducation will not necessarily prevent a user from visiting a legitimate website that has been\ntemporarily compromised as part of a watering-hole attack. Visiting such a website might compromise\na user’s computer without any obvious indications of the compromise.\n\nIt is essential that organisations implement technical measures to defend against this type of activity.\nIn addition to implementing the Top 4 Strategies to Mitigate Targeted Cyber Intrusions, organisations\nshould consider introducing additional technical measures such as:\n\n   - Strategy 5: User application configuration hardening\n\n   - Strategy 6: Automated dynamic analysis\n\n   - Strategy 7: Operating system generic exploit mitigation\n\n   - Strategy 18: Web content filtering.\n\nOrganisations should also ensure that their own websites and web applications cannot be\ncompromised and used as watering-holes.\n\n**_Mitigation strategies for malware_**\n\nThe ACSC recommends Australian government and businesses defend against malware infections by\nimplementing the Strategies to Mitigate Targeted Cyber Intrusions, with particular attention to the Top\n4 strategies. In addition:\n\n   - educating staff about cyber security can assist in preventing and identifying an initial\nsystem infection\n\n   - using up-to-date antivirus software configured to perform internet-based reputation\nchecking can help detect malware if it does make its way onto the system\n\n   - disabling AutoRun and AutoPlay features may help to prevent malware from propagating\nthrough a network via removable media.\n\n**_Mitigation strategies for ransomware_**\n\nAvoid paying a ransom if you experience this type of infection, as this perpetuates the incentive for the\ncyber adversary to continue their activities. Data loss can be minimised by taking the appropriate\nsteps to prevent this type of infection from occurring in the first place.\n\nThe ACSC recommends the following to avoid falling victim to ransomware:\n\n   - implement the Top 4 Strategies to Mitigate Targeted Cyber Intrusions\n\n   - block executable files from entering a corporate network through email or web downloads\n\n   - inspect compressed file formats for executable content\n\n   - create regular offline backups, including backups of peripheral data storage devices.\n\nIf you do experience a cyber security incident involving encrypting ransomware, the ACSC offers the\nfollowing remediation advice:\n\n   - identify any compromised workstations and remove them from the network\n\n   - block known indicators to prevent an immediate re-compromise, check for profile-resident\nmalware and clean profiles\n\n   - restore from backup.\n\n\n-----\n\n#### Key Cyber Security Alerts\n\n##### Heartbleed\n\nIn April 2014, Heartbleed, a serious vulnerability in OpenSSL’s implementation of the TLS/SSL\nHeartbeat extension, was publicly disclosed. OpenSSL is commonly used in Apache software running\non Linux/Unix web servers, and other Linux/Unix services. Exploitation of this vulnerability causes the\nmemory contents to leak, allowing a cyber adversary to gain access to private keys, usernames,\npasswords and protected content that could facilitate further cyber activities. The vulnerability also\nallows cyber adversaries to repeatedly access the data by sending a series of commands to\nvulnerable servers. Within four hours of the vulnerability becoming public, adversaries were taking full\nadvantage of it, much faster than vendors were able to create and release patches.\n\nOpenSSL released a patch for the Heartbleed vulnerability the day it was publicly disclosed.\nOrganisations using a vulnerable version of OpenSSL were advised to upgrade their OpenSSL, install\na new certificate and revoke old certificates.\n\nA problem associated with the vulnerability was that users of affected web servers had to wait for\ninstructions from the organisations prior to changing their passwords. Changing passwords before the\nservers were patched and old certificate revoked would still expose the users to exploitation.\nCommunicating this message and ensuring that users adhered to the specific instructions presented a\nchallenge.\n\nIn April 2015, 12 months after Heartbleed was first publicised, it was revealed that an estimated 84%\nof Australian businesses had yet to fully remediate this vulnerability.[13]\n\nThe ACSC urges Australian organisations to check that they are not affected by Heartbleed, and take\nappropriate action as required.\n\n\n**Case study: Heartbleed**\n\n\nAfter Heartbleed was publicised, the ACSC saw numerous adversaries conduct\ntesting against a range of systems in Australia.\n\nDuring an investigation by the AFP in May 2014, analysis of an alleged offender’s\ncomputer showed that they made over 360 attempts to access data exploiting\nHeartbleed. The offender targeted remote access servers in an effort to extract\nusernames and passwords, in an attempt to gain access to more sensitive data.\n\nVictims that had implemented intrusion detection/prevention systems were able to\nmitigate the activity. The alleged offender was charged with several counts of\nattempted unauthorised access to twelve Australian servers.\n\n13 The Register, Most top corporates still Heartbleeding over the Internet, 2015\n[theregister.co.uk/2015/04/08/still_bleeding_one_year_laterheartbleed_2015_research/](http://www.theregister.co.uk/2015/04/08/still_bleeding_one_year_laterheartbleed_2015_research/)\n\n\n-----\n\n##### Bash / Shellshock\n\nIn September 2014, an extreme risk vulnerability in the Bash shell was made public. Bash is the\ndefault shell on Linux and Apple OS X systems used to execute command lines and scripts. It is\nwidely present in the firmware of common devices such as routers and wireless access points. The\nvulnerability affects UNIX based platforms, including Apple Mac. This vulnerability can be exploited to\nremotely execute arbitrary code, potentially permitting full system control for cyber adversaries. The\nvulnerability allows malicious commands to be included, which can then download and run malicious\nprograms.\n\nPatches for this vulnerability are available for download; however, this vulnerability may still be present\nin third party applications and programs that are embedded in the systems. Vendors must first\nupgrade the firmware of their appliances and programs for the systems to be considered fully patched.\n\n##### End of Support for Windows XP and MS Office 2003\n\nIn April 2014, Microsoft ended support for Windows XP and Microsoft Office 2003. Organisations still\nusing this software are urged to review the threat and risk assessments for their ICT environments and\nimplement additional controls to reduce their risk exposure.\n\nThe ACSC has produced tailored advice for organisations using Windows XP and MS Office 2003,\nhighlighting which Strategies to Mitigate Targeted Cyber Intrusions can offer additional security\nimprovements until they upgrade their standard operating environment. This advice is available at\n[asd.gov.au/publications/protect/win_xp_office_2003_end_support.htm.](http://www.asd.gov.au/publications/protect/win_xp_office_2003_end_support.htm)\n\n##### Microsoft Active Directory Group Policy Preferences Vulnerability\n\nIn July 2014, the ACSC notified Australian Government customers of a vulnerability associated with\nMicrosoft Active Directory Group Policy (CVE-2014-1812).\n\nSeveral months prior to this, Microsoft had released a patch to prevent easy privilege escalation by a\ncyber adversary. The patch prevented a cyber adversary from creating new local accounts with\npasswords but did not remove existing vulnerable local accounts from systems or existing group\npolicies.\n\nIf the vulnerability is not fully mitigated, a cyber adversary can move laterally across a network. They\nare able to obtain clear text credentials of local administrator accounts. As such, this vulnerability\npresents a high level of risk for Australian Government agencies in particular, and other organisations\nvaluable to cyber adversaries.\n\nThe ACSC recommends organisations ensure that this vulnerability is patched, or that this feature not\nbe used to store credentials in group policy preferences.\n\n\n-----\n\n#### Cloud Computing Security\n\n\n**_What is cloud computing?_**\n\n\nCloud computing is a service model that enables network access to a shared pool of\ncomputing resources such as data storage, servers, software applications and other\nICT services.\n\nThere are three types of cloud service offerings: Infrastructure as a Service (IaaS);\nPlatform as a Service (PaaS); Software as a Service (SaaS). Any of these services\ncan be provided through community, hybrid, private or public cloud models.[14]\n\nCloud computing can be a cost-effective option for providing information technology services,\ndelivering a superior service and greater security in some circumstances. Many Australian public and\nprivate sector organisations are already using cloud services to enable their business, a trend that is\ncertain to continue.\n\nCloud services are subject to similar threat vectors as traditional ICT service models, and can\nintroduce additional cyber security threats to an organisation’s information. In June 2014, a company\nwas put out of business when a cyber adversary used the company’s legitimate cloud login credentials\nto irretrievably delete company data from the Cloud Service Provider (CSP).[15]\n\nIt is essential that organisations conduct comprehensive risk assessments to identify and manage\njurisdictional, governance, privacy, technical and security risks. Some points to consider include but\nare not limited to:\n\n   - Where your data may reside (onshore versus offshore), and therefore whether that data is\nsubject to a foreign government’s lawful access, as well as jurisdictional laws. Foreignowned CSPs operating in Australia may also be subject to a foreign government’s lawful\naccess. Major cloud service providers acknowledge that they have to disclose customer\ndata in response to legally binding requests, and may not be able to notify customers\nbeforehand.\n\n   - Storing information in multiple disparate locations and allowing more people to access it\ncan increase the opportunities for information and networks to be compromised.\n\n   - The multi-tenancy nature of cloud computing (ie hosting multiple customers on the same\ninfrastructure), increases the likelihood of unauthorised access or network compromise.\nProof-of-concept exploits have been developed to circumvent virtualisation software that\nunderpins cloud computing technologies.\n\n   - Some security measures that were previously visible to and controlled by an organisation\nwill become the responsibility of the CSP. However, organisations must still consider the\nsecurity of virtualised environments, including implementation of the Top 4 Strategies to\n_Mitigate Targeted Cyber Intrusions._\n\n[14 NIST Special Publication 800-145: NIST Definition of Cloud Computing csrc.nist.gov/publications/nistpubs/800-](http://csrc.nist.gov/publications/nistpubs/800-145/SP800-145.pdf)\n[145/SP800-145.pdf](http://csrc.nist.gov/publications/nistpubs/800-145/SP800-145.pdf)\n\n15 Threat post, Hacker puts hosting service Code Spaces out of Business, 9 June 2014\n\n\n-----\n\n**_Mitigation strategies for risks associated with cloud computing_**\n\nAlthough mitigating the risks associated with cloud computing is a responsibility shared between the\ntenant and the CSP, organisations are ultimately responsible for protecting their information. While\ncloud computing may be a daunting prospect for some organisations, many of the risks can be\nmitigated through mechanisms such as the contract with the CSP and specific security measures.\n\nThe ACSC has updated its cloud computing security advice for both tenants and CSPs, including\nidentified risks and mitigation advice for managing these risks. The Australian Government ISM has\nalso been updated to include information and controls on Outsourced Cloud Services. These\npublications are complemented by ASD’s new Certified Cloud Services List, a list of CSPs that have\nbeen assessed and certified against security and governance requirements.\n\nRefer to the following for further information about cloud computing:\n\n   - [Australian Government ISM asd.gov.au/infosec/ism/index.htm](http://www.asd.gov.au/infosec/ism/index.htm)\n\n   - _[Certified Cloud Services List asd.gov.au/infosec/irap/certified_clouds.htm](http://www.asd.gov.au/infosec/irap/certified_clouds.htm)_\n\n   - ACSC Protect publications: Cloud Computing Security for Tenants; Cloud Computing\n_Security for Providers_ [asd.gov.au/infosec/cloudsecurity.htm.](http://www.asd.gov.au/infosec/cloudsecurity.htm)\n\nFor assistance with legal and financial considerations for contracts, visit the Australian Department of\nFinance website at [finance.gov.au/cloud/.](http://www.finance.gov.au/cloud/)\n\n#### Incident Reporting\n\nAustralian organisations are urged to report cyber security incidents to the ACSC by following the links\n[on the ACSC website acsc.gov.au. Australian government agencies and businesses reporting cyber](http://www.acsc.gov.au/)\nsecurity incidents to the ACSC can request advice and assistance on how to remediate these\nincidents.\n\nThe ACSC uses cyber security incident reports as the basis for identifying and responding to cyber\nsecurity incidents across Australia. These reports can also be used to develop new policies,\nprocedures, techniques and training measures to prevent the recurrence of similar cyber security\nincidents.\n\nOrganisations that have outsourced ICT services may request that their service provider report cyber\nsecurity incidents to the ACSC. This could be specified in either a memorandum of understanding or\nas part of the service contract. In these cases, it is recommended the service provider inform the\norganisation’s IT Security Advisor about any reporting of cyber security incidents to the ACSC.\n\nACORN is the primary method for Australians to report cybercrime. ACORN is a national policing\ninitiative of the Commonwealth, State and Territory governments and has been designed to make it\neasier for Australians to recognise, report and avoid common types of cybercrime. Visit the ACORN\n[website at acorn.gov.au.](http://www.acorn.gov.au/)\n\nIn January 2015, the ACSC released a video, Recognise. Report. to encourage reporting of cyber\nsecurity incidents. This video may assist organisations in reinforcing important cyber security\nmessages to staff. Visit the ACSC website to watch the video.\n\n\n-----\n\n#### Outlook\n\nThe ever-changing nature of technology offers significant opportunities and challenges for Australia’s\ncyber security. Robust cyber defences will continue to allow a high degree of confidence in network\nand information security. However, the ability of cyber adversaries to create, identify and exploit\nvulnerabilities in networks and ICT-enabled capabilities will continue to provide opportunities to take\nadvantage of networks. Through support and collaboration, cyber defenders can make it more difficult\nfor adversaries to succeed.\n\n##### Trends for 2015 and beyond\n\nWhile the ACSC is still developing a detailed understanding of the full spectrum of threats to Australian\nnetworks, we predict the following trends to manifest globally in the near future:\n\n   - The number of state and cyber criminals with capability will increase.\n\n   - Due to the limited number of quality software developers, cybercrime-as-a-service is likely\nto increase, reducing the barriers for entry for cybercriminals.\n\n   - The sophistication of the current cyber adversaries will increase, making detection and\nresponse more difficult.\n\n   - Spear phishing will continue to be popular with adversaries, and the use of watering-hole\ntechniques will increase.\n\n   - Ransomware will continue to be prominent.\n\n   - There will be an increase in the number of cyber adversaries with a destructive capability\nand, possibly, the number of incidents with a destructive element.\n\n   - There will be an increase in electronic graffiti, such as web defacements and social media\nhijacking, which is designed to grab a headline.\n\nEnsuring a resilient, cyber secure Australia requires the expertise and collective capabilities of the\nACSC, government and industry network owners, operators and users, academia and our\ninternational partners.\n\nIn our approach to cyber security, Australia must remain vigilant, proactive and resourced to meet the\nchallenges of a complex cyber environment.\n\nCyber security efforts should aim to make Australia a harder target and thereby increase the trust and\nconfidence of all Australians to engage in the benefits the internet brings. Effective cyber security\nrequires a partnership between government and the private sector, with organisations and their users\ntaking greater responsibility for the security of their networks and information.\n\n\n-----\n\n#### Glossary\n\n|Glossary|Col2|\n|---|---|\n|Term|Definition|\n|application whitelisting|Application whitelisting is one of the top four strategies in ASD’s Strategies to Mitigate Targeted Cyber Intrusions. It is designed to protect against unauthorised and malicious programs executing on a computer. It aims to ensure that only specifically selected programs and software libraries (DLLs) can be executed, while all others are prevented from executing.|\n|botnet|A collection of infected computers remotely controlled by a cyber adversary to conduct malicious activities without the user's knowledge, such as to send spam, spread malware, conduct denial of service activities and steal data.|\n|cloud computing|A service model that enables network access to a shared pool of computing resources such as data storage, servers, software applications and services.|\n|compressed file formats|A type of file format which compresses data to consume less storage space and network bandwidth. Examples of compressed file formats include .zip files, .rar files and .jar files.|\n|critical infrastructure|The physical facilities, supply chains, information technologies and communications networks which if destroyed, degraded or rendered unavailable, damage national security, or the social or economic wellbeing of the nation.|\n|cyber adversary|An individual or organisation (including an agency of a nation state) that conducts cyber espionage, crime or attack.|\n|cyber attack|Includes deliberate acts through cyber space to manipulate, destruct, deny, degrade or destroy computers or networks, or the information resident in them, with the effect, in cyber space or the physical world, of seriously compromising national security, stability or prosperity.|\n|cyber espionage|Offensive activity designed to covertly collect information from a user’s computer network for intelligence purposes.|\n|cyber intrusion|Occurs when someone gains access to a computer or device without the owner’s permission. Also referred to as unauthorised access or hacking.|\n|cyber security incident|An occurrence or activity that may threaten the confidentiality, integrity or availability of a system or the information stored, processed or communicated by it. A compromise is an incident where the security of a system or its information was successfully harmed.|\n|cybercrime|Criminal acts involving the use of computers or other ICT, or targeted against computers or other ICT.  Pure cybercrime: Crimes directed at computing or other ICT such as unauthorised access to, modification of or impairment of electronic communications or data.  Technology-enabled crime: Crimes where computers or ICT are an integral part of an offence, such as online fraud, online identity theft and the online distribution of child exploitation material.|\n|Denial of Service (DoS)|An attempt by a cyber adversary to prevent legitimate access to online services (typically a website), by consuming the amount of available bandwidth or the processing capacity of the computer hosting the online service. A DoS can also occur unintentionally through misconfiguration or a sudden and unexpected surge in legitimate usage. When multiple computers are used to conduct these activities, such as through the use of a botnet, it is referred to as Distributed Denial of Service (DDoS).|\n\n\n-----\n\n|Term|Definition|\n|---|---|\n|drive-by download|Occurs when a user visits a malicious website or a legitimate website that has been compromised, involving malicious software designed to automatically run on the user's computer typically without requiring any additional user interaction.|\n|exploit|A piece of software, a chunk of data, or sequence of commands that takes advantage of a bug, glitch or vulnerability in order to cause unintended or unanticipated behaviour to occur on computer software, hardware, or something electronic (usually computerised). This frequently includes such actions as gaining control of a computer system, allowing privilege escalation or a denial-of-service attack.|\n|form-grabbing|A more advanced type of keylogging where the data is captured from browser forms, before data is sent over the internet to a secure server. This method is able to acquire data regardless of input method (i.e. through the use of virtual keyboard, auto-fill or copy and paste). It only records data specified by the cyber adversary, and logs which website data origin, such as IP address and URL.|\n|hacktivism|Malicious cyber activity conducted by issue-motivated groups or individuals for the purpose of promoting a particular cause or targeting a particular person or organisation associated with an issue or cause.|\n|issue-motivated group|A coalition of communities or individuals, often loosely formed, that is primarily drawn around a common interest.|\n|keylogger|Software on a system that records what a user types on their keyboard or the use of their mouse.|\n|malware|MALicious softWARE designed to facilitate unauthorised access to a system, or cause damage or disruption to a system.|\n|malvertising|A drive-by download primarily affecting legitimate websites, where the malicious software is delivered to the user via an advertisement.|\n|ransomware|Extortion through the use of malware that typically locks a computer’s content and requires victims to pay a ransom to regain access. It can also be accompanied by a threat that the computer has been locked as a result of illegal or questionable conduct by the victim.|\n|removable media|Storage media that can be easily removed from a system and is designed for removal, for example USB flash drives or optical media.|\n|social engineering|Manipulating a person into performing actions or divulging sensitive information. Cyber adversaries use a wide variety of tools such as email and social media to conduct social engineering against target personnel.|\n|sophisticated capability|An adversary with a full range of access, expertise and operational reach. Sophisticated state-sponsored adversaries fully integrate cyber, information operations programs and traditional signals and human intelligence collection capabilities.|\n|spear phishing|Also referred to as socially-engineered emails, spear phishing emails are constructed to target specific people, often containing a hyperlink or an attachment which, when clicked on or opened, attempts to download malicious code to a workstation to enable a cyber adversary to conduct further malicious activities. The email is crafted to look like a legitimate email from a legitimate sender. Targeted communication (usually email) to members of an organisation as a group or as an individual in order to acquire sensitive information or infect with malware.|\n\n\n-----\n\n|Term|Definition|\n|---|---|\n|SQL injection|A vulnerability which results in a cyber adversary having the ability to execute malicious SQL queries that are passed to a database in a network, allowing them to have greater access to data within that database.|\n|state-sponsored|An activity initiated and/or conducted by or for a foreign government body.|\n|systems of national interest|Systems that, if rendered unavailable or otherwise compromised, could result in significant impact on Australia's economic prosperity, international competitiveness, public safety, social wellbeing or national defence and security.|\n|tradecraft|The combination of tools, techniques and procedures used by cyber adversaries to conduct their activities. These tools, techniques and procedures can be distinct and attributed to these adversaries.|\n|Trojan|Malicious software that a cyber adversary aims to run on a user's computer by deceiving the user as to the true intent of the software.|\n|vulnerability|In the context of information security, a vulnerability is a weakness in system security requirements, design, implementation or operation that could be accidentally triggered or intentionally exploited and result in a violation of the system’s security policy.|\n|watering-hole techniques|Compromise and placement of malware by cyber adversaries on a legitimate website frequented by their intended targets in an attempt to compromise the computers of visitors to the website.|\n|website defacement|An unauthorised change to the content of a website.|\n\n\n-----\n\n### acsc.gov.au\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/ACSC - Cyber Threat Report 2015.pdf"
    ],
    "report_names": [
        "ACSC - Cyber Threat Report 2015.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535783,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/a148fa26f474f6f3cc3d9a68accddbaf313e16ac.pdf",
        "text": "https://archive.orkl.eu/a148fa26f474f6f3cc3d9a68accddbaf313e16ac.txt",
        "img": "https://archive.orkl.eu/a148fa26f474f6f3cc3d9a68accddbaf313e16ac.jpg"
    }
}