{
    "id": "82bc50ca-3260-42cd-92ea-c834df43aad0",
    "created_at": "2023-01-12T15:10:48.706549Z",
    "updated_at": "2025-03-27T02:16:34.631993Z",
    "deleted_at": null,
    "sha1_hash": "404255815068ace90c510a370fa759bf6259f213",
    "title": "2022-08-22 - A Cyber Threat Intelligence Self-Study Plan- Part 2",
    "authors": "",
    "file_creation_date": "2022-09-01T10:22:54Z",
    "file_modification_date": "2022-09-01T10:22:54Z",
    "file_size": 1201919,
    "plain_text": "# A Cyber Threat Intelligence Self-Study Plan: Part 2\n\n**[medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-2-d04b7a529d36](https://medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-2-d04b7a529d36)**\n\nKatie Nickels August 23, 2022\n\n[Katie Nickels](https://medium.com/@likethecoins?source=post_page-----d04b7a529d36--------------------------------)\n\nAug 22\n\n\n11 min read\n\nIt’s been a while, but here it is — part 2 of my cyber threat intelligence (CTI) self-study plan.\nThis is much later than I intended, but life happens. It has been wonderful to hear feedback\non how part 1 helped many people learn more about CTI, and I truly appreciate everyone\nwho reached out to say that this helped them. You all are the reason I created part 2, and I\nhope it’s just as helpful. For background on this plan and how I recommend using it, please\nread my [first post. This post covers four topics:](https://medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-1-968b5a8daf9a)\n\nOSINT and Open Sources\nPivoting\nClustering, Naming, and Creating Groups\nAttribution\n\nLet’s dive right in!\n\n## OSINT and Open Sources\n\nOpen source intelligence (OSINT) is a separate but complementary field to CTI. As you\n[learned in part 1, intelligence is analyzed information to support a decision, so it’s important](https://medium.com/katies-five-cents/a-cyber-threat-intelligence-self-study-plan-part-1-968b5a8daf9a)\nto remember that definition still applies. I think of OSINT as being intelligence produced\nusing open sources, though it’s commonly used to refer to open source data or information.\nIt’s particularly important to critically evaluate open sources before using them to produce\nintelligence.\n\n## Read and watch\n\n\n-----\n\nRead selections from this Army publication on OSINT: —you can skim the whole thing,\nbut I recommend reading just pages 21–23 (starting at Open-Source Reliability\nheading), page 41 (Information Reliability and Credibility heading), and page 43\n(section 4–13) (hat tip to Casey Brooks for this reference)\nRead about how to differentiate reports from vendors as threat intelligence or\nmarketing using the ADEPT model.\nSkim, focusing on the OSINT definition and the other 5 “INTs”.\nWatch this from Sherman Chu on Current Intelligence.\nSkim this page that lists many available open sources: . Think about the major\ncategories of sources and where you think this data comes from.\n\n## Things to do\n\nIf you haven’t already, create a Twitter account and follow some CTI people (if you\nfollow me @likethecoins, Twitter will automagically start recommending other accounts\nto follow). I also recommend creating your own RSS feed as recommended in, but if\nyou don’t want to, here is that you can import into any RSS feed tool of your choice.\n(Feedly is a good starting point!) Please note this is a recommended starting point, and\nI’m certain I forgot some excellent blogs, so I appreciate your understanding if yours\nisn’t included.\nFind a blog post or report from a cybersecurity vendor via your Twitter or RSS feed.\nApply Sergio’s ADEPT model and make your own assessment on whether it falls more\nunder intelligence and marketing.\n\nFind a different blog post or report and evaluate its reliability and credibility based on\nsection 4–13 of the Army PDF above — Identity, Authority, Motive, Access, Timeliness,\nInternal and External Consistency (note that you will likely apply the Internal and\nExternal Consistency criteria differently than the Army publication. Think of internal\nconsistency as whether the piece contradicts itself. Think of external consistency as\nwhether the piece has contradictory information to other external sources.).\nFind a Twitter account and apply the same criteria above to an account and tweet.\nHere’s an example for the following tweet:\n\n\n-----\n\n-----\n\n**Identity: With a little searching, I can determine this account is owned by Brad**\nDuncan, who is a researcher at Palo Alto’s Unit 42.\n\n**Authority: I have read blog posts from Unit 42 in the past that have been well written,**\nso that makes me more likely to trust this account if I’ve never seen it before. I look\nthrough Brad’s previous tweets and see he has a long history of tweeting about various\nmalware and threat actors. He has over 65K followers, which is a lot, but that’s not the\nonly point I’m using to evaluate his authority.\n\n**Motive: I see Brad has a whole website full of packet capture and malware samples:**\n[https://www.malware-traffic-analysis.net/. Combined with all his previous tweets and](https://www.malware-traffic-analysis.net/)\nhis [replies to other researchers, I assess he is someone who shares information](https://twitter.com/malware_traffic/with_replies)\nbecause he wants to help others track threats. I should remember he also works for\nUnit 42, but the fact his website is separate suggests he isn’t motivated by marketing\nfor his employer.\n\n**Access: The fact that Brad showed screenshots of the packet capture suggests he did**\nhave direct access on this network traffic.\n\n**Timeliness: This is very timeline, he tweeted this information the same day the traffic**\noccurred.\n\n**Internal and external consistency: Brad spelled everything correctly in his tweet and**\ndiagrams, and nothing in the information contradicts itself. Additionally, Brad cited\nanother researcher, @drb_ra, who reported the same findings.\n\n## Questions to think about\n\nBased on the DNI webpage, how does the U.S. government think about OSINT? How\ndoes that differ from how the private sector should think about and practice OSINT?\nWhat are the risks and drawbacks of using open sources in cyber threat intelligence\nanalysis? How can you mitigate those in order to use open sources in an appropriate\nway?\nWho produces what is available in different open sources (for example, the sources\nlisted in Awesome Threat Intelligence)? What limitations does that result in?\nWhat CTI requirements (see part 1 for more on requirements) do you think can be\nfulfilled with open sources? How do you think open sources can be best used to\nproduce CTI?\n\n## Pivoting\n\nI define pivoting as the act of identifying a new piece of information based on a connection to\na previously-known piece of information. CTI analysts apply pivoting in many ways, such as\nlooking for connections between domain names and IP addresses that have hosted them\n\n\n-----\n\nSometimes, these connections can reveal new relationships between groups or malware that\nanalysts weren’t previously aware of. Pivoting can be challenging to learn because it requires\nboth an understanding of the data source an analyst wants to pivot through as well as\nmethodology for doing so. I’ve included resources that provide explanations for common\ndata sources used for pivoting, but note that you may need to do more research to deeply\nunderstand these sources.\n\n## Read and watch\n\nWatch a short clip of a I did (18:37–21:02).\nRead Joe Slowik’s on “Analyzing Network Infrastructure as Composite Objects”, which\npresents three pivotable artifact types: domain names, IP addresses, and TLS\ncertificates.\nRead Kelsey LaBelle’s blog post series on,, and, which are all commonly-used\nsources for pivoting.\nWatch Mark Parsons’ on TLS certificates and/or read his .\nRead Joe Slowik’s on “Formulating a Robust Pivoting Methodology” and/or watch his\non “Pivoting from Art to Science.”\n\n## Things to do\n\nTry a TLS certificate pivot by…1. Identifying the default SHA256 hash value shipped on\nCobalt Strike servers (see ), 2. Searching for that hash value in Censys (), and3.\nIdentifying IP addresses that result. What do those IP addresses potentially represent?\nWhat could you do to try to validate if that pivot you performed was meaningful? Go do\nit!\nFind a recent blog post on a threat group or malware family that contains some\npivotable artifact (look at the RSS feed you hopefully set up based on ). Try searching\nfor those artifacts in free search sources and see if you can reproduce the research\nfrom the blog post about any pivots and/or find any new artifacts from pivoting.\n\nHere are some free search sources you might find useful for this: Censys\n[(https://search.censys.io/), Shodan (https://www.shodan.io/), DomainTools WhoIs](https://search.censys.io/)\n[(https://whois.domaintools.com/), VirusTotal (https://www.virustotal.com/), URLhaus](https://whois.domaintools.com/)\n[(https://urlhaus.abuse.ch/), and Malware Domain List](https://urlhaus.abuse.ch/)\n[(https://www.malwaredomainlist.com/). There are many others listed on Awesome](https://www.malwaredomainlist.com/)\nThreat Intelligence that you can try as well.\n\nIf you need an example to get you started, try looking up hash values and IPs from this\nESET blog post in VirusTotal.\n\n## Questions to think about\n\n\n-----\n\nWhat types of artifacts and data sources can we use for pivoting? What artifacts do you\nsee most analysts use? What are the pros and cons of each type of artifact/data\nsource? Can you think of data sources that could be useful for pivoting that weren’t\nmentioned in the above resources?\nHow do we know if pivots are meaningful or not? What level of specificity or\nuniqueness makes for a meaningful pivot?\nWhat is the point of pivoting? What do analysts gain from it?\nWhat are potential consequences of making analytic conclusions based solely on\npivots?\nWhat happens as you continue pivoting off of newly-found information? How does each\n“hop” from your initial data point affect the relationship of the newly-found information?\nWhat are the risks and limitations of pivoting? (Hint: see below. Also see the Attribution\nsection and Sarah Jones’ presentation on attribution mistakes.)\n\nis a cautionary tale of what happens when you pivot too far\n\n## Clustering, Creating, and Naming Groups\n\n\n-----\n\nThere are many ways to create clusters and threat groups, and this leads to confusion in the\ncommunity as well as a lot of different names. While this can be frustrating for many\nanalysts, hopefully you can reduce this frustration by gaining a better understanding of how\nCTI analysts create and name these groups.\n\n## Read and watch\n\nWatch part of I did that discusses group naming with the Diamond Model using the\nRule of 2. (watch from 37:12–41:43)\nWatch I did on a deep-dive into group naming.\nRead Florian Roth’s on group names.\nRead these blog posts on how various teams name groups: (and ), Microsoft (first\nparagraph and take a look at the nation state group names on page 51 ), and .\nRead on UNC2452 and APT29.\n\n## Things to do\n\nChoose a group from the that has multiple associated names. Read the reference(s)\nfor that associated name overlapping with the “main” group page name. Note what\ndetails, if any, explain the reason for the overlap.\nUsing the methodology of your choice (a spreadsheet might be a good option),\norganize data points from the following information on various IcedID campaigns:,,,\nand . Considering using the Diamond Model and Rule of 2 to do this (see above link for\nbackground). Based on the data you have, decide if you think you should create a\ngroup (since IcedID is malware, you could create a group for the delivery of it). If you\ncreate a group, create a definition for that group — in other words, if you saw a new\nIcedID intrusion, what criteria would it need to meet in order to be part of the new group\nyou created? Think about what challenges you had in doing this and what criteria is\n“close enough” to create a group or not.\nSearch Twitter to find a recent debate about group names in which analysts disagree\n(this is a debate that comes up a lot in the CTI community). Think about each party’s\nperspective and note reasons why they likely hold that view, even if you don’t agree.\n(Hint: search Twitter for APT31, APT10, or TA410.)\n\n## Questions to think about\n\nDo you think Rosetta Stones are useful? (A is a resource that “translates” different\ngroup names, for example, .) What are the limitations of Rosetta Stones for tracking\ngroup names?\nDo you think the CTI community can agree on a consistent names and definition for\ngroups? Why or why not? How could this happen if analysts wanted to try?\n\n\n-----\n\nWhat are the risks of using a group name that another team created? (Here s .) Do you\nthink that risk is worth it to not add another group name (and potentially more\nconfusion)?\nWhat are some common attributes/observables/data points that analysts use when\nidentifying overlaps to create groups? (The Spooky RYUK-y webinar is a great place to\nlook for this.) Which of these attributes do you think are most and least useful for\nidentifying meaningful overlaps? (for example, if you saw PowerShell used in two\ndifferent incidents, would you create a group based solely on that technique use?)\nWhat do you like and not like about methodologies used by different teams to cluster?\nWhat are the benefits and drawbacks of using an uncategorized clustering\nmethodology for initial analysis? (e.g. )\n\n## Attribution\n\nAttribution is a popular topic in CTI. While it is the primary focus for some analysts, it may not\nbe for others. It’s important to understand some of the nuances of attribution and how it’s\ndone, as well as how it can be useful (and when it might not be). Attribution is a topic that\nintersects cybersecurity and international relations, as an attribution assessment can have a\nsignificant impact on the relationships between countries. There are many articles on\nattribution from academia, and I’ve just chosen a sampling below.\n\n## Read and watch\n\nRead I wrote on types of attribution.\nRead from Steve Miller on Detectrum.\nRead from Robert M. Lee.\nWatch Sarah Jones’ on “A Brief History of Attribution Mistakes.” Tying this back to an\nearlier section, think about the role pivoting played in these mistakes.\nRead from Jason Healey that includes the ever-useful Spectrum of State\nResponsibility.\nSkim from Thomas Rid and Ben Buchanan — if you’re short on time, just look at the\ndetailed Q Model on page 31.\nRead, “The Purposes of U.S. Government Public Cyber Attribution,” from Jon\nBateman.\n\n## Things to do\n\nChoose an indictment from . Look at the indictment itself (PDF format) and write down\nthe key evidence/information used to associate activity to an individual or group.\n\n\n-----\n\nExamine the IcedID campaigns from the section on clustering. Write down what\nadditional information you think you would need in order to try to attribute these\ncampaigns to 1. A country, and 2. A person. You could use the information types from\nthe indictment you analyzed above, or other sources you can think of.\n\n## Questions to think about\n\nHow is attribution commonly thought about in the cybersecurity community? What\ncould be different ways to look at or define attribution?\nDo you think attribution matters? Under what circumstances would certain types of\nattribution matter or not matter? What requirements would result in CTI analysts\ndeciding to do different types of attribution?\nWhat are the differences between the public and private sectors in 1. The process of\nconducting attribution (available data sources), and 2. Requirements to conduct “true”\nattribution (to a country, military unit, or person)?\nWhat are the risks of performing attribution, especially attribution to a country, military\nunit, or person?\nWhat are some of the challenges of performing attribution?\n\nThat’s all I have for now! I make no promises on Part 3, but the more I hear that this helps\npeople, the more likely it is that will happen. :)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-22 - A Cyber Threat Intelligence Self-Study Plan- Part 2.pdf"
    ],
    "report_names": [
        "2022-08-22 - A Cyber Threat Intelligence Self-Study Plan- Part 2.pdf"
    ],
    "threat_actors": [
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9ffcbb0c-7a0f-419f-a174-f18a02ce47f1",
            "created_at": "2023-01-06T13:46:39.059774Z",
            "updated_at": "2025-03-27T02:00:02.98747Z",
            "deleted_at": null,
            "main_name": "TA410",
            "aliases": [],
            "source_name": "MISPGALAXY:TA410",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ec14074c-8517-40e1-b4d7-3897f1254487",
            "created_at": "2023-01-06T13:46:38.300905Z",
            "updated_at": "2025-03-27T02:00:02.799108Z",
            "deleted_at": null,
            "main_name": "APT10",
            "aliases": [
                "TA429",
                "STONE PANDA",
                "POTASSIUM",
                "Red Apollo",
                "HOGFISH",
                "Cloud Hopper",
                "BRONZE RIVERSIDE",
                "ATK41",
                "G0045",
                "Menupass Team",
                "happyyongzi",
                "CVNX",
                "Granite Taurus"
            ],
            "source_name": "MISPGALAXY:APT10",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba3fff0c-3ba0-4855-9eeb-1af9ee18136a",
            "created_at": "2022-10-25T15:50:23.298889Z",
            "updated_at": "2025-03-27T02:00:55.433541Z",
            "deleted_at": null,
            "main_name": "menuPass",
            "aliases": [
                "menuPass",
                "POTASSIUM",
                "Stone Panda",
                "APT10",
                "Red Apollo",
                "CVNX",
                "HOGFISH",
                "BRONZE RIVERSIDE"
            ],
            "source_name": "MITRE:menuPass",
            "tools": [
                "certutil",
                "FYAnti",
                "UPPERCUT",
                "SNUGRIDE",
                "P8RAT",
                "RedLeaves",
                "SodaMaster",
                "pwdump",
                "Mimikatz",
                "PlugX",
                "PowerSploit",
                "ChChes",
                "cmd",
                "QuasarRAT",
                "AdFind",
                "Cobalt Strike",
                "PoisonIvy",
                "EvilGrab",
                "esentutl",
                "Impacket",
                "Ecipekac",
                "PsExec",
                "HUI Loader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ba9fa308-a29a-4928-9c06-73aafec7624c",
            "created_at": "2024-05-01T02:03:07.981061Z",
            "updated_at": "2025-03-27T02:05:17.28602Z",
            "deleted_at": null,
            "main_name": "BRONZE RIVERSIDE",
            "aliases": [
                "CTG-5938 ",
                "CVNX ",
                "Hogfish ",
                "MenuPass ",
                "POTASSIUM ",
                "Red Apollo ",
                "Stone Panda ",
                "APT10 "
            ],
            "source_name": "Secureworks:BRONZE RIVERSIDE",
            "tools": [
                " ChChes",
                " Cobalt Strike",
                " PlugX",
                " PoisonIvy",
                " QuasarRAT",
                " QuasarRAT Loader",
                " RedLeaves",
                "ANEL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536248,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1662027774,
    "ts_modification_date": 1662027774,
    "files": {
        "pdf": "https://archive.orkl.eu/404255815068ace90c510a370fa759bf6259f213.pdf",
        "text": "https://archive.orkl.eu/404255815068ace90c510a370fa759bf6259f213.txt",
        "img": "https://archive.orkl.eu/404255815068ace90c510a370fa759bf6259f213.jpg"
    }
}