{
    "id": "82fdcc03-17cd-4659-8dba-07bde87d3e4f",
    "created_at": "2023-01-12T15:01:09.971085Z",
    "updated_at": "2025-03-27T02:13:08.200416Z",
    "deleted_at": null,
    "sha1_hash": "c533990eda954f71497e901428add5e18f8a81bd",
    "title": "2021-03-30 - Campo Loader - Simple but effective",
    "authors": "",
    "file_creation_date": "2022-05-28T02:39:54Z",
    "file_modification_date": "2022-05-28T02:39:54Z",
    "file_size": 1948970,
    "plain_text": "# Campo Loader - Simple but effective\n\n**fr3d.hk/blog/campo-loader-simple-but-effective**\n\n1. You are here: [fr3d.hk](https://fr3d.hk/blog/)\n[2. Malware](https://fr3d.hk/blog/category/malware)\n[3. Campo Loader - Simple but effective](https://fr3d.hk/blog/campo-loader-simple-but-effective)\n\nMarch 30, 2021 - Reading time: 8 minutes\n\nCampo Loader is a simple but effective malware distribution chain that has been used in\ntandem with BazarCall to spread malware such as TrickBot and BazarLoader.\n\n## Foreword\n\nCampo loader has been a piece of malware I've been following for quite some time. I've seen\nthe malware develop to the point as described within this post. I would like to say thank you\nto [ViriBack &](https://twitter.com/ViriBack) [ExecuteMalware for assistance in crafting this post and as always a huge thank](https://twitter.com/ExecuteMalware)\nyou to [Steved3 for reviewing and editing this post.](https://twitter.com/steved3)\n\n## Overview\n\nCampo Loader, also known as Redirected, OpenField, and Baza Loader, is a tool used to\ndeliver malware from a first stage payload. This malware has been seen spreading TrickBot,\nGozi, and Zloader. Campo Loader appears to be a malware distribution as a service\noperation, targeting specific countries per campaign. Countries that have been targeted\ninclude Italy, Japan and the United States. The malware begins with an email spam\ncampaign known as Bazar Call.\n\n\n-----\n\nFigure 1: Bazar Call Lure\n\nAs shown in Figure 1, there's a reference of an ongoing subscription that is set to be\nautomatically renewed. In order to cancel, the victim must call a phone number where they\nwill be told to download and open a macro spreadsheet. A good example of this can be\n[found within this video. When a victim enables the macros within the spreadsheet, the](https://www.youtube.com/watch?v=uAkeXCYcl4Y)\nprocess of Campo Loader is starts. Campo Loader will use different processes to either\ninfect the victim with an executable or DLL.\n\n## EXE Loader\n\nWhen Campo Loader drops an executable onto the victim it will use an intermediary DLL to\ndownload and execute a payload provided by the C2. When a victim enables the macro\ncontent within the spreadsheets the following macro is run:\n\nFigure 2: Spreadsheet Macros (Executable)\n\n\n-----\n\nThe spreadsheet drops a PDI file into the public directory. The macro in Figure 2 uses certutil\nto decode the dropped file into an executable DLL. The DLL that is produced from this is\na intermediary file used to download and execute the final payload. Looking at the main code\nof the dropped DLL, we see the following:\n\nFigure 3: Main of dropped DLL\n\nWithin Figure 3, we can see the DLL first getting imports and then creating a directory to\ndrop the final payload. After the directory has been created, it will proceed to execute a\nfunction I have named DownloadAndExecute.\n\n\n-----\n\nFigure 4: Download and execute function\n\nThe malware will use a simple socket function to create an HTTP POST request to the\npredefined C2, seen in line number 9. Campo Loader makes a first request to the C2 to\ncheck it's alive. If the loader C2 is alive, then Campo Loader will make a request to it, and\nproceed to download, and then drop the provided payload. This payload is then executed\nwith CreateProcessA within the function I have named CreateProcess (see Figure 4).\n\n## DLL Loader\n\n\n-----\n\nCampo Loader will not use an intermediary DLL when it attempts to download and execute a\nDLL. The macro code within the spreadsheet changes to accomodate a final payload of a\nDLL.\n\nFigure 5: Spreadsheet macros (DLL)\n\nAs seen in Figure 5 the process of download and execution of a DLL is much simpler than\nthe executable process. The spreadsheet macros begin by creating a directory where the\nmalware will drop the payload. Then it proceeds to use the Windows function\n_URLDownloadToFileA to retrieve the final payload and place it within the previously created_\ndirectory. After the final payload has been retrieved the malware will then execute it with\n_ShellExecuteA._\n\n## Panel & Geofence\n\nWhat makes Campo Loader interesting is the C2 which the malware will retrieve its payload\nfrom. The malware always requests a URL that contains the Spanish word campo, meaning\ncountryside, hence the name Campo Loader. The C2 is thought to have some kind of\ngeofence within it that will redirect the incoming request to websites such as Yahoo and\nUPS, if the request does not meet certain criteria.\n\nIf a request does meet a certain criteria, then the malware will either retrieve the payload\nfrom local storage, or redirect to a site that has been compromised with a web shell. This\nweb shell is used to upload payloads to a site so that Campo Loader can then use it as a\nmalware host. This process of redirection is synonymous with the name on the C2 panel.\n\n\n-----\n\nFigure 6: C2 panel login\n\nThe C2 panel has a title of Redirected which may be a description of the C2s process of\nredirecting an incoming request to a separate malware host. The panel also seems to have\nthe capability of email spam and other spreading methods but these have not been observed\nto be in use.\n\nThese C2 panels have been moved from different host, below is a list of the hosts and dates\nof move.\n\n1. (09-09-2020) DigitalOcean\n2. (22-12-2020) Hetzner\n3. (24-12-2020) Linode\n4. (25-02-2021) ITLDC\n5. (17-03-2021) Sayda\n\n[A history of C2s, IPs and hosts can be found in the following file (link) kindly provided by](https://pastebin.com/raw/Cw4fZAKf)\n[ViriBack.](https://twitter.com/ViriBack)\n\n## Epilogue\n\nCampo Loader is a demonstration of the phrase \"less is more\". The malware uses simplistic\nmethods to effectively deliver malware to victims. The combination of the malware being\nused with call scams will also make the process of detection much easier. Thank you for\nreading.\n\nIOCS:\n\n67f0f93d82bcc598f5ea9186cf76ec54\n8a3364bafa63166394862068b05f5469\nballpro.xyz\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-30 - Campo Loader - Simple but effective.pdf"
    ],
    "report_names": [
        "2021-03-30 - Campo Loader - Simple but effective.pdf"
    ],
    "threat_actors": [
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535669,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653705594,
    "ts_modification_date": 1653705594,
    "files": {
        "pdf": "https://archive.orkl.eu/c533990eda954f71497e901428add5e18f8a81bd.pdf",
        "text": "https://archive.orkl.eu/c533990eda954f71497e901428add5e18f8a81bd.txt",
        "img": "https://archive.orkl.eu/c533990eda954f71497e901428add5e18f8a81bd.jpg"
    }
}