{
    "id": "8311f3c6-382a-47aa-aeab-0ad34b057b8b",
    "created_at": "2022-10-25T16:48:15.678749Z",
    "updated_at": "2025-03-27T02:05:40.070228Z",
    "deleted_at": null,
    "sha1_hash": "619ad9c2d675c411b5c18457546aa7bcc58b31a7",
    "title": "Cyber Attack Targeting Indian Navy's Submarine And Warship Manufacturer",
    "authors": "Cysinfo",
    "file_creation_date": "2017-02-23T04:47:37Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 2506804,
    "plain_text": "# Manufacturer\n\n**cysinfo.com/cyber-attack-targeting-indian-navys-submarine-warship-manufacturer/**\n\n2/10/2017\n\n[In my previous blog posts I described attack campaigns targeting Indian government organizations, and Indian](https://cysinfo.com/malware-actors-using-nic-cyber-security-themed-spear-phishing-target-indian-government-organizations/)\nEmbassies and Ministry of External affairs. In this blog post I describe a new attack campaign where cyber\nespionage group targeted the users of Mazagon Dock Shipbuilders Limited (also called as ship builder to the\n**_[nation). Mazagon Dock Shipbuilders Limited (MDL) is a Public Sector Undertaking of Government of India (Ministry](https://en.wikipedia.org/wiki/Mazagon_Dock_Limited)_**\nof Defence) and it specializes in manufacturing warships and submarines for the Indian Navy.\n\nIn order to infect the users associated with Mazagon Dock Shipbuilders Limited (MDL), the attackers distributed\nspear-phishing emails containing malicious excel file which when opened drops a malware capable of spying on\ninfected systems. The email purported to have been sent from legitimate email ids. The attackers spoofed the email\n[id associated with a Spain based equipment manufacturing company Hidrofersa which specializes in designing,](http://hidrofersa.com/?lang=en)\nmanufacturing naval, industrial and mining machinery.\n\n**Overview of the Malicious Emails**\n\n[On 26th January, 2017 Indian Navy displayed its state-of-the-art stealth guided missile destroyer INS Chennai and](https://en.wikipedia.org/wiki/INS_Chennai_(D65))\n[the indigenously-made Kalvari class Scorpene submarines at the Republic Day parade showcasing India’s military](https://en.wikipedia.org/wiki/Kalvari-class_submarine)\nstrength and achievements. INS Chennai and Kalvari class submarines were manufactured by Mazagon Dock\nShipbuilders Limited (MDL).\n\nOn 25th January (day before the Republic day) attackers spoofed an email id associated with Hidrofersa a Spain\nbased company which specializes in designing, manufacturing naval, industrial and mining machinery and the email\nwas sent to the users of Mazagon Dock Shipbuilders Limited (MDL). The email attachment contained two malicious\nexcel files (both excel files turned out to be same but used different names). The email was made to look like it was\nsent by a General service manager of Hidrofersa enquiring about the product delivery schedule.\n\n\n-----\n\nMazagon Dock Shipbuilders Limited (MDL) is listed as one of clients of Hidrofersa (mentioned in Hidrofersa\nwebsite) and as per their website Hidrofersa has shipped equipments to Mazagon Dock Shipbuilders Limited (MDL)\nin the past as shown in the below screen shots. This is probably the reason attackers spoofed the email id of\nHidrofersa as it is less likely to trigger any suspicion and there is high chance of recipients opening the attachment\nas it is coming from a trusted equipment manufacturer (Hidrofersa) . It looks like attackers carefully researched (or\nthey already knew about) the trust relationship between these two companies.\n\nFrom the email it looks like the goal of the attackers was to infect, take control of the systems of users associated\nwith Mazagon Dock Shipbuilders Limited (MDL) and to steal sensitive information (like Product design documents,\nblueprints, manufacturing processes etc) related to warships and submarines.\n\n**Analysis of Malicious Excel File**\n\nWhen the recipient of the email opens the attached excel file it prompts the user to enable macro content and the\nexcel also contains instruction on how to enable the macros.\n\n\n-----\n\nOnce the the macro content is enabled, it calls an auto execute function Workbook_Open() which in turn downloads\nthe malware sample and executes on the system. The malicious macro code was reverse engineered to understand\nits capabilities. The macro code was heavily obfuscated (used obscure variable/function names to make analysis\nharder) as shown below.\n\nThe macro also contained lot of junk code, unnecessary comments and variable assignments as shown below. The\nattackers used this technique to delay, divert and confuse the manual analysis.\n\n\n-----\n\nThe macro then decodes a string which runs PowerShell script to download malware from a popular university site\nlocated in Indonesia as shown below. The attackers probably compromised the university website to host the\nmalware. The technique of hosting malicious code in a university site (legitimate site) has advantages and it is\nunlikely to trigger any suspicion in security monitoring and also can bypass reputation based devices.\n\nThe PowerShell script (shown below) drops the downloaded executable in the %TEMP% directory as “doc6.exe“. It\nthen adds a registry entry for the dropped executable and invokes eventvwr.exe, this is an interesting registry hijack\ntechnique which allows the doc6.exe to be executed by _eventvwr.exe with high integrity level and also this_\ntechnique silently bypasses the UAC (user account control). This technique of UAC bypass is mentioned in the blog\n[“Fileless” UAC Bypass Using eventvwr.exe and Registry Hijacking](https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/)\n\n\n-----\n\nopens eventvwr.msc causing the Event Viewer to be displayed. To start mmc.exe, _eventvwr.exe searches this_\nregistry key “HKCU\\Software\\Classes\\mscfile\\shell\\open\\command” looking for mmc.exe before looking at\n_HKCR\\mscfile\\shell\\open\\command._\n\nIn this case since this registry “ HKCU\\Software\\Classes\\mscfile\\shell\\open\\command” was hijacked to contain the\nentry for “doc6.exe”, this will cause the eventvwr.exe process to invoke doc6.exe with high integrity level.\n\nBelow screen shot shows doc6.exe running from the %TEMP% directory\n\nThe dropped file (doc6.exe) was determined as KeyBase malware. This malware can steal and send sensitive\ninformation to the attackers like keystrokes, opened applications, web browsing history, usernames/passwords,\nupload Desktop screen shots etc. The feature of uploading the Desktop screen shot is notable because if the\ninfected user opens a design or design document related to submarines or warships the screen shot of that can be\nsent to the attacker.\n\nThe attackers also hosted multiple samples of KeyBase malware in the compromised university website. Below\nscreen shot shows hashes of 25 samples hosted on the university site.\n\n\n-----\n\n**Analysis of the Dropped Executable (doc6.exe)**\n\nThe dropped file was analyzed in an isolated environment (without actually allowing it to connect to the c2 server).\nThis section contains the behavioral analysis of the dropped executable\n\nOnce the dropped file (doc6.exe) is executed the malware copies itself into %AllUsersProfile% directory as\n_“Important.exe”, In addition to that it also drops two files_ _“Mails.txt” and “Browsers.txt” into the same directory as_\nshown below.\n\nThe malware then creates a registry value for the the dropped file (Important.exe), this ensures that malware is\nexecuted every time the system restarts.\n\n\n-----\n\nThe malware after execution keeps track of the user activity (like applications opened, files opened etc) but does not\nimmediately generate any network traffic, this is to make sure that no network activity is generated during\nautomated/sandbox analysis. After sleeping for a long time malware makes an http connection to the C2 server\n(command & control server) and sends the tracked user activity to the attacker. The below screen shot shows the\ncommunication to the C2 server on port 80.\n\n**C2 Communication Pattern**\n\nOnce malware makes an http connection after sleeping for a long time, it sends the system information and the\ntracked activity to the C2 server as http parameters. Below screen shot shows the network communication pattern\nwhere the hostname and the machine time is sent to C2 server.\n\nBelow screen shot shows a network communication pattern where the opened window title was sent to the C2\nserver, this pattern below indicates that “test.txt” file was opened with notepad on the infected system.\n\n\n-----\n\nBelow screen shot shows a network communication pattern indicating a document named _“secret.docx” was_\nopened with Microsoft Word.\n\nBelow screen shot shows a network communication pattern indicating _Internet Explorer was launched on the_\ninfected system.\n\nEvery activity on the infected system is sent to the attacker, this allows the attacker to take further action and also\nsince the open window title is sent to attacker, this lets the attacker know about the documents opened and the tools\nrunning on the system or if any analysis tools are used to inspect the malware.\n\n**C2 Domain Information**\n\nThis section contains the details of the C2 domain (tripleshop[.]id). All the 25 samples hosted on compromised\nuniversity site was analyzed and it was determined that all these samples also communicated to the C2 domain\n_tripleshop[.]id_\n\n\n-----\n\nIndonesia as shown in the screen shots below\n\nBelow screen shot shows the timeline when the IP address was active. The IP was first seen to be active on 18th\nJan, 2017 (one week before the spear-phishing mail was sent to the victims).\n\n**Threat Intelligence**\n\nEven though attackers tried to make it look like the spear phishing email was sent by an email id associated with\nHidrofersa but inspecting the email headers revealed some interesting information.\n\nThe X-AuthUser in the header below revealed the identity of the sender. The sender is associated with a company\nnamed “Combined Freight (PVT) Limited” (combinedfreight[.]com)\n\n\n-----\n\nCombined Freight (PVT) Limited is freight forwarding company which is into ocean & air freight business\nheadquartered in Karachi, Pakistan (as per their website). This company has 4 other offices in Pakistan (Lahore,\nIslamabad, Sialkot, Faisalabad). Below is the screen shot taken from their website.\n\n\n-----\n\nBased on the information mentioned above, It looks like the spoofed email was sent by a user associated with a\nPakistan based company Combined Freight (PVT) Limited.\n\n**Indicators Of Compromise**\n\nIn this case the cyber espionage group targeted _Mazagon Dock Shipbuilders Limited (MDL) but it is possible that_\nother defense equipment manufacturers could also be targeted as part of this attack campaign. The indicators\nassociated with this attack are provided so that the organizations (Government, Public, Private organizations,\nDefense and Defense equipment manufacturers) can use these indicators to detect, remediate and investigate this\nattack campaign. Below are the indicators\n\n**_Dropped Malware Sample:_**\n_08f2fc9cb30b22c765a0ca9433b35a46_\n\n**_Samples hosted on the compromised University site:_**\n_6c94b4c7610d278bf8dfc3dbb5ece9ce_\n_a81eaed8ae25f5fa5b107cbc6fe6e446_\n_9a708879fd0a03d4089ee343c9254e5b_\n_069629248742f9d762f66568ba7bcec8_\n_6455a43366f4da09429738076e7f289c_\n_34d5a3d6ae3c1836e0577b6f94ee0294_\n_6eee8a69bc40b104931abdd68509df85_\n_01c85dd7d8202765331a5cc818948213_\n_42664aa65c473832a5c0df62c8b38d68_\n_18e7480894149194f2cd17ee40d0ad7b_\n_575b4b449a12f2bed583f2a59485f776_\n_eae013aec7f45661223ea115ee38cc95_\n_33b9c2c2cbecd4a4844057491b02379e_\n_bf499821c935e67e0fb606915453a964_\n_42e411bcb48240fb44c48327b81d8c57_\n_efaa8d161bbe6342204ffa5b1b22ed0c_\n_4623d0e188dc225de8dcd494c7802f7f_\n_3cba51905a78bd221a2433ee180111c0_\n_a6e6a131887c0cdbf67569e1320840d8_\n_08f2fc9cb30b22c765a0ca9433b35a46_\n\n\n-----\n\n_5b5edc209737b6faa3a6d6711fba1648_\n_bf5e7ea70c2dab12100b91d77ca76ff2_\n_34c44c9138a2d4c31391c2cc0b044c02_\n\n**_Network Indicators Associated with C2:_**\n_tripleshop[.]id_\n_103[.]229[.]74[.]32_\n\n**_C2 Communication Patterns:_**\n_hxxp://tripleshop[.]id/userfiles/media/pixum/okilo/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/agogo/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/alpha/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/ariri/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/bobby/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/chisom/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/crack/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/declan/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/elber/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/figure/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/henry/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/ike/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/jizzy/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/kcc/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/kc/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/matte/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/nels/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/notes/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/polish/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/turbo/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/whesilo/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/yboss/post.php_\n_hxxp://tripleshop[.]id/userfiles/media/pixum/yg/post.php_\n\n**Conclusion**\n\nAttackers in this case made every attempt to launch a clever attack campaign by spoofing legitimate email ids and\nusing an email theme relevant to the targets. The following factors in this cyber attack suggests the possible\ninvolvement of Pakistan state sponsored cyber espionage group to steal the intellectual property such as\ndesign/blueprints and manufacturing data related to submarines and warships.\n\n_Victims/targets chosen (Submarine & Warship manufacturer for Indian Navy)_\n\n_Use of Email theme related to the targets_\n\n_Timing of the spear phishing emails sent to the victims (The day before the Republic Day)_\n\n_Email header information indicating the possible Pakistan connection_\n\n_Use of malware that is capable of spying and uploading screen shots_\n\n_Use of TTP’s (tactics, techniques & procedures) similar to the_ _[previous campaign](https://cysinfo.com/uri-terror-attack-spear-phishing-emails-targeting-indian-embassies-and-indian-mea/)_\n\nThe following factors reveal the attackers intention to remain stealthy and the attempt to evade sandbox analysis,\n\n\n-----\n\n_Use of junk code (to divert the manual analysis)_\n\n_Use of compromised university site to host malicious code (to bypass security monitoring)_\n\nUse of Silent UAC (user account control) bypass technique\n\n_Use of Malware that sleeps for long time without generating any network activity (to evade sandbox analysis)_\n\n_Use of hosting provider to host C2 infrastructure_\n\nCyber espionage groups will continue targeting defense sectors and defense equipment manufacturers for the\nfollowing reasons:\n\n_To steal defense related information and proprietary product information that can provide their sponsoring_\n_governments with military and economic advantages._\n\n_To identify vulnerabilities in the defense technologies to gain advantage over adversary’s military capabilities_\n\n_To reduce their research and development costs and produce and sell similar products at lower prices_\n\n**References**\n\n[http://researchcenter.paloaltonetworks.com/2015/06/keybase-keylogger-malware-family-exposed/](http://researchcenter.paloaltonetworks.com/2015/06/keybase-keylogger-malware-family-exposed/)\n\n[http://www.brycampbell.co.uk/new-blog/2015/7/14/keybase-malware](http://www.brycampbell.co.uk/new-blog/2015/7/14/keybase-malware)\n\nhttp://researchcenter.paloaltonetworks.com/2016/02/keybase-threat-grows-despite-public-takedown-a-picture-isworth-a-thousand-words/\n\n[https://www.fireeye.com/current-threats/reports-by-industry/aerospace-threat-intelligence.html](https://www.fireeye.com/current-threats/reports-by-industry/aerospace-threat-intelligence.html)\n\n[Follow us on Twitter: @monnappa22](https://twitter.com/monnappa22) [@cysinfo22](https://twitter.com/cysinfo22)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/zdwfwsi2pw1081j2reu3qotz577g7pt6"
    ],
    "report_names": [
        "Cysinfo-Targeting-Indian-Navys-Submarine-Warship-Manufacturer(02-10-2017)"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1487825257,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/619ad9c2d675c411b5c18457546aa7bcc58b31a7.pdf",
        "text": "https://archive.orkl.eu/619ad9c2d675c411b5c18457546aa7bcc58b31a7.txt",
        "img": "https://archive.orkl.eu/619ad9c2d675c411b5c18457546aa7bcc58b31a7.jpg"
    }
}