{
    "id": "8338a11f-9cb2-4887-9cf7-2752e203ff55",
    "created_at": "2023-01-12T15:00:38.757778Z",
    "updated_at": "2025-03-27T02:06:12.396742Z",
    "deleted_at": null,
    "sha1_hash": "48d06575b10327724d1b806b66c31cd55eafc4d4",
    "title": "2021-02-19 - Behind the Scenes of the SunBurst Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:45:16Z",
    "file_modification_date": "2022-05-28T19:45:16Z",
    "file_size": 3181722,
    "plain_text": "# Behind the Scenes of the SunBurst Attack\n\n**[thenewstack.io/behind-the-scenes-of-the-sunburst-attack/](https://thenewstack.io/behind-the-scenes-of-the-sunburst-attack/)**\n\nBy February 19, 2021\n\nCheck Point sponsored this post.\n\n\n-----\n\nLior Sonntag\nLior is a Security Researcher at Check Point Software Technologies. He is a security\nenthusiast who loves to break stuff and put it back together. He's passionate about various\nInfoSec topics such as Cloud Security, Offensive Security, Vulnerability Research and\nReverse Engineering.\nThe biggest cyberattack in recent times came in the form of what seems like a nation-statesponsored supply chain attack, in December when the Sunburst malware was installed on\nSolarWinds’ Orion product. This made headlines worldwide for good reason — postcompromise activity included data theft through lateral movement, which is when the attacker\nmoves through a network searching for targeted key data and assets. This attack was the\nwork of a highly-skilled actor and the operation was conducted with significant operational\nsecurity.\n\nThis attack consisted of lateral movement of the threat actor from the on-premises network to\nthe cloud, and it was done in two phases:\n\n1. Phase One: The On-Prem Golden SAML Attack. Here the threat actors gained\n\nadministrative access to the organization’s Active Directory Federation Services\n(ADFS) server. This allowed them to forge Security Assertion Markup Language\n(SAML) tokens and create illegitimate registrations of SAML Trust Relationships. By\nimpersonating a user with valid administrative credentials, the threat actors could\nchange the configuration of the SAML Service Provider (in this case, Azure AD). From\nthere, they successfully gained administrative access to the Azure AD.\n\n\n-----\n\n2. Phase Two: Malicious activity in the Cloud. The threat actors then used the Azure\n\nActive Directory administrative credentials for malicious activities. This included (but\nwas not limited to): enumeration of existing applications and service principals, injection\nof credentials into them, impersonation and execution of actions on behalf of them, and\nthe exfiltration of sensitive data like users and mails.\n\nDror Alon\nDror is Security Research Team Leader at Check Point Software Technologies. He's a\nproactive researcher in the cyber domain; investigating cyber events, and identifying and\nresolving the security issues faced by organizations worldwide.\nIn this analysis, we will focus on the second attack phase, in the cloud, and present key\ntactics and techniques used by the nation-state actors in the malicious campaign. By using\nthe [MITRE ATT&CK framework, we will provide the most likely technical attack flow of the](https://attack.mitre.org/matrices/enterprise/cloud/)\nnation-state actor’s actions.\n\n[Reviewing Microsoft’s article, the chain of events that occurred through this attack were:](https://techcommunity.microsoft.com/t5/azure-active-directory-identity/understanding-quot-solorigate-quot-s-identity-iocs-for-identity/ba-p/2007610)\n\n1. Initial Access (On-Prem): Forged SAML tokens and illegitimate registrations of SAML\n\nTrust Relationships; impersonating a user with administrative credentials (in this case,\nAzure AD).\n2. Discovery: The threat actor enumerates existing applications/service principals\n\n(preferably with high traffic patterns).\n3. Credential Access: The threat actor adds credentials to an existing application or\n\nservice principal.\n\n\n-----\n\n4. Privilege Escalation: The threat actor elevates the privileges of the\n\napplication/service-principal, to allow access to MS Graph APIs Application\npermissions.\n5. Defense Evasion and Lateral Movement: The threat actor acquires OAuth access\n\ntokens of applications, allowing them to impersonate the applications and obfuscate\ntheir activity.\n6. Exfiltration: The threat actor calls MS Graph APIs to exfiltrate sensitive data such as\n\nusers’ data and emails.\n\nHere we will focus on the attack flow in the Cloud Environment after the initial\nauthentication(i.e. steps 2-6). But first, let’s elaborate on the AzureAD Authentication and\nAuthorization mechanisms.\n\nIn short, Authentication is proving you are who you say you are. This is done by the Identity\nProvider (in this case Azure AD). Authorization is the act of granting an authenticated party\npermission to do something. This is done by the resource the identity is trying to query,\nutilizing the OAuth 2.0 protocol.\n\n**Sponsor Note**\nCheck Point Software Technologies is a leading provider of cyber security and threat\nprevention Check Point CloudGuard provides unified cloud native security for networks\n\n\n-----\n\nassets and workloads — automating cloud security,\npreventing threats, and managing posture — across\nmulticloud environments.\n**Read the latest from Check Point**\n\n## Discovery\n\nFirst, the threat actor gains an initial foothold into the Cloud Environment by compromising\nprivileged cloud users with administrative access to the Azure AD. They then add credentials\nto an existing application or service principal. However, in order to do that, the threat actor\nneeds to firstly list all the existing applications:\n\nThe threat actor prefers applications with high traffic patterns (e.g. mail archival applications)\nwhich can be used to obfuscate their activity. So, they decide to choose the “MailApp” (an\nimaginary application name) and extracts its ObjectId and ApplicationId:\n\nIn addition, the threat actor extracts the account’s tenantId:\n\n\n-----\n\n## Credential Access\n\nNext, the threat actor creates new credentials and adds them to the application:\n\nAlternatively, the threat actor can create new credentials and add them to an existing service\nprincipal associated with the MailApp application:\n\nAfter this phase, the threat actor has the credentials of the application — which can be used\nto authenticate to AzureAD on behalf of the application.\n\n## Application/Service-Principal Privilege Escalation\n\nIn this step, the threat actor lists all the available permissions related to Microsoft Graph\nAPIs:\n\n\n-----\n\nThe threat actor decides to add the User.ReadWrite.All permission to the MailApp\napplication:\n\nAfterward, the threat actor lists all the available permissions related to Mails and associated\nto the Microsoft Graph API:\n\nThey decide to also add the Mail.ReadWrite permission to the MailApp application:\n\n\n-----\n\nThe error in red indicates that an admin consent must be launched to approve this\npermission.\n\nThe admin consent workflow gives admins a secure way to grant access to applications\nthat require admin approval. When a user tries to access an application but is unable to\nprovide consent, they can send a request for admin approval. The request is sent to admins\nwho have been designated as reviewers.\n\nDue to the fact that the actor already has administrative permissions, they can launch an\nadmin consent on their own:\n\nThe admin consent was successful and the Microsoft Graph APIs permissions were\nsuccessfully added to the MailApp application!\n\n## Defense Evasion and Lateral Movement\n\nThen, the actor acquired an OAuth access token for the application, by initiating an HTTP\nGET request which included the tenantId, objectId, appId and the secret (credentials)\nobtained from before:\n\nThis access token enabled the actor to move laterally, impersonate the MailApp application,\nand execute actions on behalf of it.\n\n## Exfiltration\n\nFinally, the threat actor calls APIs with permissions assigned to the MailApp application.\n\nThe threat actor initiated an HTTP GET request, which included the access token to exfiltrate\n**all users in the tenant and all emails related to a specific user.**\n\n\n-----\n\nUsers exfiltration\n\n\n-----\n\nEmails exfiltration\n\nEmails’ subjects exfiltration\n\nIn conclusion, the SunBurst attack was by far one of the most sophisticated attacks of our\ntime — extending beyond on-prem and into the cloud. The threat actor executed advanced\ntechniques to cover their tracks; using discovery, credential access, privilege escalation,\nlateral movement, defense evasion, and exfiltration all in one attack flow.\n\nSince the attack, the number of victims compromised by SunBurst continues to rise, and\ncould happen again on any of the cloud providers. Many security vendors are offering free\ntrials to help organizations get a handle on the security of their environment. While this is a\nstep in the right direction, the question is, will you know what to look for and will you be\nprepared?\n\n[Check Point sponsored this post.](https://www.checkpoint.com/products/cloud-native-security/?utm_content=inline-mention)\n\nFeature image via Pixabay.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-19 - Behind the Scenes of the SunBurst Attack.pdf"
    ],
    "report_names": [
        "2021-02-19 - Behind the Scenes of the SunBurst Attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535638,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1653767116,
    "ts_modification_date": 1653767116,
    "files": {
        "pdf": "https://archive.orkl.eu/48d06575b10327724d1b806b66c31cd55eafc4d4.pdf",
        "text": "https://archive.orkl.eu/48d06575b10327724d1b806b66c31cd55eafc4d4.txt",
        "img": "https://archive.orkl.eu/48d06575b10327724d1b806b66c31cd55eafc4d4.jpg"
    }
}