{
    "id": "83578d64-bb40-46fe-968e-05d1af8ae0ef",
    "created_at": "2023-01-12T15:04:06.942594Z",
    "updated_at": "2025-03-27T02:09:30.07404Z",
    "deleted_at": null,
    "sha1_hash": "31aabf4556092d760866eff4e823f5a80629c880",
    "title": "2017-12 - TRISIS- Analyzing Safety System Targeting Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T05:13:47Z",
    "file_modification_date": "2022-05-28T05:13:47Z",
    "file_size": 533035,
    "plain_text": "# TRISIS: Analyzing Safety System Targeting Malware\n\n**[dragos.com/resource/trisis-analyzing-safety-system-targeting-malware/](https://dragos.com/resource/trisis-analyzing-safety-system-targeting-malware/)**\n\nDecember 14, 2017\n\nWhitepaper\n\nBy Robert M. Lee\n\n12.14.17\n\n\n-----\n\nToday, the Dragos, Inc. team is releasing a report titled TRISIS: Analyzing Safety System\nTargeted Malware. TRISIS is malware that was developed and deployed to at least one\nvictim in the Middle East to target safety instrumented systems (SIS). Dragos, Inc. found\nand analyzed the malware last month and made sure our ICS WorldView customers were\naware and prepared with proper defense recommendations. We did not make news of this\nmalware public because it is in our policy not to be the first to disclose ICS targeted\nmalware or threats. Our reasons for this revolve around the fact that releasing such\ninformation can have a blow back effect on the industrial community. ICS threats are\ncommonly hyped up in the public and the asset owners and operators are hit with trying to\ndeal with the consequences of that while also trying to gather how they will prepare and\nrespond to the threat. Additionally, informing the public about the threat also reveals to the\nthreat what we know and can help the adversary be more effective. This is a delicate\nbalance though because there is value in informing the larger community for lessons\nlearned and information sharing as well. This puts security vendors in a difficult choice at\ntimes where there is no right answer. Our choice though looking at the balance from our\nperspective is only to publicly talk about threats, even if we find them first in the community,\nafter someone else talks about it or the information leaks to the public. This allows our\nreporting to focus on the “so what” factor and the nuance of the issue as well.\n\nThe key takeaways from the report and things to know about TRISIS:\n\nThe malware targets Schneider Electric’s Triconex safety instrumented system (SIS)\nthus the name choice of TRISIS for the malware\nTRISIS has been deployed against at least one victim which resulted in operational\nimpact\nThe victim identified so far is in the Middle East and currently there is no intelligence\nto support that there are victims outside of the Middle East\n\n\n-----\n\nTriconex line of safety systems are leveraged in numerous industries however each\nSIS is unique and to understand process implications would require specific\nknowledge of the process. This means that this malware must be modified for each\nspecific victim reducing its scalability\nThe Triconex SIS controller had the keyswitch in ‘program mode’ during the time of\nthe attack and the SIS was connected to the operations network against best\npractices. In a proper configuration and with the controller placed in Run mode\n(program changes not permitted) the attackers would face a more difficult challenge\nimplementing the attack. Hindsight advice is not appropriate to apply to future attacks,\nbut it is important to always try to reduce the effectiveness of adversary attack vectors.\nAlthough the malware is not highly scalable the tradecraft displayed is now available\nas a blueprint to other adversaries looking to target SIS and represents an escalation\nin the type of attacks seen to date as it is specifically designed to target the safety\nfunction of the process\nCompromising the security of an SIS does not necessarily compromise the safety of\nthe system. Safety engineering is a highly specific skillset and adheres to numerous\nstandards and approaches to ensure that a process has a specific safety level. As\nlong as the SIS performs its safety function the compromising of its security does not\nrepresent danger as long as it fails safe.\n\nThe TRISIS malware is a very significant event for the community as the fifth ever ICStailored malware and the first to directly target SIS. It is a very bold attack while not\ntechnically complicated. The Dragos team intends for our report to ensure the proper\nnuance and recommendations to the community are captured. Our threat intelligence\ncustomers of our ICS WorldView reports can access the Dragos Intelligence Portal to get\nfurther information and technical details. We will continue to analyze and report out on this\nmalware and its developments as well. Good luck to the community and always remember\n[that defense is doable. If you missed the TRISIS Webinar you can watch it here.](https://www.dragos.com/media/trisis-webinar-20171219.html)\n\nDOWNLOAD\n\nEnter your information to download the whitepaper.\n\n## Discover more resources.\n\nExplore more resources to support you on your ICS cybersecurity journey.\n\n\n-----\n\n[VIEW MORE RESOURCES](https://dragos.com/resources)\n\n## Read our next whitepaper\n\n[whitepapers](https://dragos.com/resources/?_block_resources_resource_type_filter=whitepaper)\n\n\n## CRASHOVERRIDE: Analyzing the Malware that Attacks Power Grids\n\nDragos, Inc.\n\n## View more whitepapers\n\n Ready to put your insights into action?\n\nTake the next steps and contact our team today.\n\n[CONTACT US TODAY](https://dragos.com/contact)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-12 - TRISIS- Analyzing Safety System Targeting Malware.pdf"
    ],
    "report_names": [
        "2017-12 - TRISIS- Analyzing Safety System Targeting Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535846,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653714827,
    "ts_modification_date": 1653714827,
    "files": {
        "pdf": "https://archive.orkl.eu/31aabf4556092d760866eff4e823f5a80629c880.pdf",
        "text": "https://archive.orkl.eu/31aabf4556092d760866eff4e823f5a80629c880.txt",
        "img": "https://archive.orkl.eu/31aabf4556092d760866eff4e823f5a80629c880.jpg"
    }
}