{
    "id": "83700a80-5326-46c8-9567-49eb3c6158f7",
    "created_at": "2023-01-12T15:04:09.564267Z",
    "updated_at": "2025-03-27T02:16:34.853651Z",
    "deleted_at": null,
    "sha1_hash": "ec2e404f6d87681baffcb454fb99b7cb84d69735",
    "title": "2021-04-15 - FACT SHEET- Imposing Costs for Harmful Foreign Activities by the Russian Government",
    "authors": "",
    "file_creation_date": "2022-05-28T18:27:27Z",
    "file_modification_date": "2022-05-28T18:27:27Z",
    "file_size": 553963,
    "plain_text": "# FACT SHEET: Imposing Costs for Harmful Foreign Activities by the Russian Government\n\n**whitehouse.gov/briefing-room/statements-releases/2021/04/15/fact-sheet-imposing-costs-for-harmful-foreign-activities-**\nby-the-russian-government/\n\nApril 15, 2021\n\n[Briefing Room](https://www.whitehouse.gov/briefing-room/)\n\n - [Statements and Releases](https://www.whitehouse.gov/briefing-room/statements-releases/)\n\nThe Biden administration has been clear that the United States desires a relationship with\nRussia that is stable and predictable. We do not think that we need to continue on a negative\ntrajectory. However, we have also been clear—publicly and privately—that we will defend our\nnational interests and impose costs for Russian Government actions that seek to harm us.\n\nToday the Biden administration is taking actions to impose costs on Russia for actions by its\ngovernment and intelligence services against U.S. sovereignty and interests.\n\n**Executive Order Targeting the Harmful Foreign Activities of the Russian Government**\n\nToday, President Biden signed a new sanctions executive order that provides strengthened\nauthorities to demonstrate the Administration’s resolve in responding to and deterring the full\nscope of Russia’s harmful foreign activities. This E.O. sends a signal that the United States\nwill impose costs in a strategic and economically impactful manner on Russia if it continues\nor escalates its destabilizing international actions. This includes, in particular, efforts to\nundermine the conduct of free and fair democratic elections and democratic institutions in the\n\n\n-----\n\nUnited States and its allies and partners; engage in and facilitate malicious cyber activities\nagainst the United States and its allies and partners; foster and use transnational corruption\nto influence foreign governments; pursue extraterritorial activities targeting dissidents or\njournalists; undermine security in countries and regions important to United States national\nsecurity; and violate well-established principles of international law, including respect for the\nterritorial integrity of states.\n\nThe U.S. Department of the Treasury (Treasury) carried out the following actions pursuant to\nthe new E.O.:\n\nTreasury issued a directive that prohibits U.S. financial institutions from participation in\nthe primary market for ruble or non-ruble denominated bonds issued after June 14,\n2021 by the Central Bank of the Russian Federation, the National Wealth Fund of the\nRussian Federation, or the Ministry of Finance of the Russian Federation; and lending\nruble or non-ruble denominated funds to the Central Bank of the Russian Federation,\nthe National Wealth Fund of the Russian Federation, or the Ministry of Finance of the\nRussian Federation. This directive provides authority for the U.S. government to\nexpand sovereign debt sanctions on Russia as appropriate.\nTreasury designated six Russian technology companies that provide support to the\nRussian Intelligence Services’ cyber program, ranging from providing expertise to\ndeveloping tools and infrastructure to facilitating malicious cyber activities. These\ncompanies are being designated for operating in the technology sector of the Russian\nFederation economy. We will continue to hold Russia accountable for its malicious\ncyber activities, such as the SolarWinds incident, by using all available policy and\nauthorities.\n\n**Imposing Additional Sanctions**\nTreasury sanctioned 32 entities and individuals carrying out Russian government-directed\nattempts to influence the 2020 U.S. presidential election, and other acts of disinformation\nand interference. This action seeks to disrupt the coordinated efforts of Russian officials,\nproxies, and intelligence agencies to delegitimize our electoral process. The U.S.\ngovernment will continue to pursue those who engage in such activity.\n\nTreasury, in partnership with the European Union, the United Kingdom, Australia, and\nCanada, sanctioned eight individuals and entities associated with Russia’s ongoing\noccupation and repression in Crimea. The Transatlantic community stands united in\nsupporting Ukraine against unilateral Russian provocations along the Line of Contact in\neastern Ukraine, in occupied Crimea, and along Ukraine’s borders, as well as agreeing on\nthe need for Russia to immediately cease its military buildup and inflammatory rhetoric.\n\n**Reported Afghanistan Bounties**\nThe Administration is responding to the reports that Russia encouraged Taliban attacks\nagainst U.S. and coalition personnel in Afghanistan based on the best assessments from the\nIntelligence Community (IC) Given the sensitivity of this matter which involves the safety\n\n\n-----\n\nand well-being of our forces, it is being handled through diplomatic, military and intelligence\nchannels. The safety and well-being of U.S. military personnel, and that of our allies and\npartners, is an absolute priority of the United States.\n\n**Expelling Diplomatic Personnel**\nThe United States is expelling ten personnel from the Russian diplomatic mission in\nWashington, DC. The personnel include representatives of Russian intelligence services.\n\n**Further Responses to the SolarWinds Malicious Cyber Activity**\nToday the United States is formally naming the Russian Foreign Intelligence Service (SVR),\nalso known as APT 29, Cozy Bear, and The Dukes, as the perpetrator of the broad-scope\ncyber espionage campaign that exploited the SolarWinds Orion platform and other\ninformation technology infrastructures. The U.S. Intelligence Community has high confidence\nin its assessment of attribution to the SVR.\n\nThe SVR’s compromise of the SolarWinds software supply chain gave it the ability to spy on\nor potentially disrupt more than 16,000 computer systems worldwide. The scope of this\ncompromise is a national security and public safety concern. Moreover, it places an undue\nburden on the mostly private sector victims who must bear the unusually high cost of\nmitigating this incident.\n\nToday, the National Security Agency, the Cybersecurity & Infrastructure Security Agency, and\nthe Federal Bureau of Investigation are jointly issuing a cybersecurity advisory, “Russian\nSVR Targets U.S. and Allied Networks,” that provides specific details on software\nvulnerabilities that the SVR uses to gain access to victim devices and networks. The\nadvisory also provides specific steps that network defenders can take to identify and defend\nagainst the SVR’s malicious cyber activity.\n\nAdditionally, the SVR’s compromise of SolarWinds and other companies highlights the risks\nposed by Russia’s efforts to target companies worldwide through supply chain exploitation.\nThose efforts should serve as a warning about the risks of using information and\ncommunications technology and services (ICTS) supplied by companies that operate or\nstore user data in Russia or rely on software development or remote technical support by\npersonnel in Russia. The U.S. government is evaluating whether to take action under\nExecutive Order 13873 to better protect our ICTS supply chain from further exploitation by\nRussia.\n\n**Supporting a Global Cybersecurity Approach**\nThe United States continues to strongly affirm the importance of an open, interoperable,\nsecure, and reliable Internet. Russia’s actions run counter to that goal, which is shared by\nmany of our allies and partners. To strengthen our collective approach to bolstering\ncybersecurity, we are announcing two additional steps:\n\n\n-----\n\nFirst, the United States is bolstering its efforts to promote a framework of responsible\nstate behavior in cyberspace and to cooperate with allies and partners to counter\nmalign cyber activities. We are providing a first-of-its kind course for policymakers\nworldwide on the policy and technical aspects of publicly attributing cyber incidents,\nwhich will be inaugurated this year at the George C. Marshall Center in Garmisch,\nGermany. We are also bolstering our efforts through the Marshall Center to provide\ntraining to foreign ministry lawyers and policymakers on the applicability of international\nlaw to state behavior in cyberspace and the non-binding peacetime norms that were\nnegotiated in the United Nations and endorsed by the UN General Assembly.\nSecond, we are reinforcing our commitment to collective security in cyberspace. The\nDepartment of Defense is taking steps to incorporate additional allies, including the UK,\nFrance, Denmark, and Estonia, into the planning for CYBER FLAG 21-1, which is an\nexercise designed to improve our defensive capabilities and resiliency in cyberspace.\nCYBER FLAG 21-1 will build a community of defensive cyber operators and improve\noverall capability of the United States and allies to identify, synchronize, and respond in\nunison against simulated malicious cyberspace activities targeting our critical\ninfrastructure and key resources.\n\nThe United States is committed to the security of our allies and partners; these efforts are\nintended to reinforce again our commitment to that bedrock principle.\n\n###\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-15 - FACT SHEET- Imposing Costs for Harmful Foreign Activities by the Russian Government.pdf"
    ],
    "report_names": [
        "2021-04-15 - FACT SHEET- Imposing Costs for Harmful Foreign Activities by the Russian Government.pdf"
    ],
    "threat_actors": [
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535849,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653762447,
    "ts_modification_date": 1653762447,
    "files": {
        "pdf": "https://archive.orkl.eu/ec2e404f6d87681baffcb454fb99b7cb84d69735.pdf",
        "text": "https://archive.orkl.eu/ec2e404f6d87681baffcb454fb99b7cb84d69735.txt",
        "img": "https://archive.orkl.eu/ec2e404f6d87681baffcb454fb99b7cb84d69735.jpg"
    }
}