{
    "id": "838862ef-9846-4532-b0f9-2fe5fda7f3aa",
    "created_at": "2022-10-25T16:48:10.399258Z",
    "updated_at": "2025-03-27T02:17:05.837957Z",
    "deleted_at": null,
    "sha1_hash": "1e7b9c2fb9c9533572df9070f118b15bdbcb6104",
    "title": "New Sandworm Malware Cyclops Blink Replaces VPNFilter",
    "authors": "CISA",
    "file_creation_date": "2022-02-23T11:57:25Z",
    "file_modification_date": "2022-02-23T10:04:46Z",
    "file_size": 305097,
    "plain_text": "## Advisory.\n New Sandworm malware Cyclops Blink replaces VPNFilter\n\n###### Version 1.0\n\n 23 February 2022\n\n\n-----\n\n### New Sandworm malware Cyclops Blink replaces VPNFilter \n\nThe Sandworm actor, which the UK and US have previously attributed to\nthe Russian GRU, has replaced the exposed VPNFilter malware with a new\nmore advanced framework.\n\n#### Background \n\nThe UK National Cyber Security Centre (NCSC), the Cybersecurity and Infrastructure\nSecurity Agency (CISA), the National Security Agency (NSA) and the Federal Bureau\nof Investigation (FBI) in the US have identified that the actor known as Sandworm or\nVoodoo Bear is using a new malware, referred to here as Cyclops Blink. The NCSC,\nCISA, NSA and FBI have previously attributed the Sandworm actor to the Russian\nGRU’s Main Centre for Special Technologies GTsST. The malicious cyber activity\nbelow has previously been attributed to Sandworm:\n\n     - The BlackEnergy disruption of Ukrainian electricity in 2015\n\n     - Industroyer in 2016\n\n     - NotPetya in 2017\n\n     - Attacks against the Winter Olympics and Paralympics in 2018[1]\n\n     - A series of disruptive attacks against Georgia in 2019[2]\n\nCyclops Blink appears to be a replacement framework for the VPNFilter malware\nexposed in 2018, which exploited network devices, primarily small office/home office\n(SOHO) routers and network attached storage (NAS) devices.\n\n1https://www.ncsc.gov.uk/news/uk-and-partners-condemn-gru-cyber-attacks-against-olympic-an-paralympic-games\n\n2 https://www.gov.uk/government/news/uk-condemns-russias-gru-over-georgia-cyber-attacks\n\n\n-----\n\nThis advisory summarises the VPNFilter malware it replaces, and provides more detail\nabout Cyclops Blink, as well as the associated tactics, techniques and procedures\n(TTPs) used by Sandworm. An NCSC malware analysis report on Cyclops Blink is\nalso available and can be read in parallel.\nIt also points to mitigation measures to help organisations that may be affected by this\nmalware.\n\n#### VPNFilter \n\n###### First exposed in 2018\n\nA series of articles published by Cisco Talos in 2018[1] describes VPNFilter and its\nmodules in detail. VPNFilter was deployed in stages, with most functionality in the\nthird-stage modules. These modules enabled traffic manipulation, destruction of the\ninfected host device, and likely enabled downstream devices to be exploited. They\nalso allowed monitoring of Modbus SCADA protocol which appears to be an ongoing\nrequirement for Sandworm, as also seen in their previous attacks against ICS\nnetworks.\nVPNFilter targeting was widespread and appeared indiscriminate, with some\nexceptions: Cisco Talos reported an increase of victims in Ukraine in May 2018.\nSandworm also deployed VPNFilter against targets in the Republic of Korea before\nthe 2018 Winter Olympics.\nIn May 2018 Cisco Talos published the blog that exposed VPNFilter, and the US\nDepartment of Justice linked the activity[2] to Sandworm, and announced its disruption\nof the botnet.\n\n###### Activity since its exposure \n\nA Trendmicro[3] blog in January 2021 detailed residual VPNFilter infections and\nprovided data showing a reduction in requests to a known C2 domain. Since the\ndisruption in May 2018, Sandworm has shown limited interest in existing VPNFilter\nfootholds, instead preferring to retool.\n\n1 https://blog.talosintelligence.com/2018/05/VPNFilter.html\n\n2 https://www.justice.gov/opa/pr/justice-department-announces-actions-disrupt-advanced-persistent-threat-28-botnet-infected\n\n3 https://www.trendmicro.com/en_gb/research/21/a/vpnfilter-two-years-later-routers-still-compromised-.html\n\n\n-----\n\n#### Cyclops Blink\n\n###### Active since 2019\n\nThe NCSC, CISA, FBI and NSA, along with industry partners, have now identified a\nlarge-scale modular malware framework which is affecting network devices. The new\nmalware is referred to here as Cyclops Blink and has been deployed since at least\nJune 2019, fourteen months after VPNFilter was disrupted. In common with VPNFilter,\nCyclops Blink deployment also appears indiscriminate and widespread.\n\nThe actor has so far primarily deployed Cyclops Blink to WatchGuard devices,[1] but it\nis likely that Sandworm would be capable of compiling the malware for other\narchitectures and firmware.\n\n###### Malware overview \n\nThe malware itself is sophisticated and modular with basic core functionality to beacon\n[(T1132.002) device information back to a server and enable files to be downloaded](https://attack.mitre.org/techniques/T1132/002)\nand executed. There is also functionality to add new modules while the malware is\nrunning, which allows Sandworm to implement additional capability as required.\n\n[The NCSC has published a malware analysis report](https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf) on Cyclops Blink which provides\nmore detail about the malware.\n\n###### Post exploitation \n\nPost exploitation, Cyclops Blink is generally deployed as part of a firmware ‘update’\n[(T1542.001). This achieves persistence when the device is rebooted and makes](https://attack.mitre.org/techniques/T1542/001/)\nremediation harder.\n\n1 Note that only WatchGuard devices that were reconfigured from the manufacture default settings to open remote\nmanagement interfaces to external access could be infected.\n\n\n-----\n\nVictim devices are organised into clusters and each deployment of Cyclops Blink has\n[a list of command and control (C2) IP addresses and ports that it uses (T1008). All the](https://attack.mitre.org/techniques/T1008)\nknown C2 IP addresses to date have been used by compromised WatchGuard firewall\ndevices. Communications between Cyclops Blink clients and servers are protected\n[under Transport Layer Security (TLS) (T1071.001), using individually generated keys](https://attack.mitre.org/techniques/T1071/001)\nand certificates. Sandworm manages Cyclops Blink by connecting to the C2 layer\nthrough the Tor network:\n\n#### Mitigation\n\nCyclops Blink persists on reboot and throughout the legitimate firmware update\nprocess. Affected organisations should therefore take steps to remove the malware.\n\nWatchGuard has worked closely with the FBI, CISA and the NCSC, and has provided\ntooling and guidance to enable detection and removal of Cyclops Blink on WatchGuard\ndevices through a non-standard upgrade process. Device owners should follow each\n\n\n-----\n\nstep in these instructions to ensure that devices are patched to the latest version and\nthat any infection is removed.\nWatchGuard tooling and guidance is available at:\n**https://detection.watchguard.com/**\n\n**In addition:**\n\n  - If your device is identified as infected with Cyclops Blink, you should assume\n\nthat any passwords present on the device have been compromised and\nreplace them (see NCSC password guidance for organisations:\n[https://www.ncsc.gov.uk/collection/passwords )](https://www.ncsc.gov.uk/collection/passwords)\n\n  - You should ensure that the management interface of network devices is not\n\nexposed to the internet.\n\n#### Indicators of compromise\n\nPlease refer to the accompanying Cyclops Blink [malware analysis report for indicators](https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf)\nof compromise which may help detect this activity.\n\n\n-----\n\n#### MITRE ATT&CK[® ]\n\n[This advisory has been compiled with respect to the MITRE ATT&CK® framework, a](https://attack.mitre.org/)\nglobally accessible knowledge base of adversary tactics and techniques based on\nreal-world observations.\n\n|Tactic|Technique|Procedure|\n|---|---|---|\n|Initial Access|T1133|External Remote Services The actors most likely deploy modified device firmware images by exploiting an externally available service|\n|Execution|T1059.004|Command and Scripting Interpreter: Unix Shell Cyclops Blink executes downloaded files using the Linux API|\n|Persistence|T1542.001|Pre-OS Boot: System Firmware Cyclops Blink is deployed within a modified device firmware image|\n||T1037.004|Boot or Logon Initialisation Scripts: RC Scripts Cyclops Blink is executed on device startup, using a modified RC script|\n|Defence Evasion|T1562.004|Impair Defenses: Disable or Modify System Firewall Cyclops Blink modifies the Linux system firewall to enable C2 communication|\n||T1036.005|Masquerading: Match Legitimate Name or Location Cyclops Blink masquerades as a Linux kernel thread process|\n|Discovery|T1082|System Information Discovery Cyclops Blink regularly queries device information|\n|Command and Control|T1090|Proxy|\n||T1132.002|Data Encoding: Non-Standard Encoding Cyclops Blink command messages use a custom binary scheme to encode data|\n||T1008|Fallback Channels Cyclops Blink randomly selects a C2 server from contained lists of IPv4 addresses and port numbers|\n||T1071.001|Application Layer Protocol: Web Protocols Cyclops Blink can download files via HTTP or HTTPS|\n||T1573.002|Encrypted Channel: Asymmetric Cryptography Cyclops Blink C2 messages are individually encrypted using AES-256-CBC and sent underneath TLS|\n||T1571|Non-Standard Port The list of port numbers used by Cyclops Blink includes non-standard ports not typically associated with HTTP or HTTPS traffic|\n|Exfiltration|T1041|Exfiltration Over C2 Channel Cyclops Blink can upload files to a C2 server|\n\n\n-----\n\n#### Conclusion \n\nA Cyclops Blink infection does not mean that an organisation is the primary target,\nbut it may be selected to be, or its machines could be used to conduct attacks.\n\n[Organisations are advised to follow the mitigation advice](https://detection.watchguard.com/) in this advisory and to refer\n[to indicators of compromise (not exhaustive) in the Cyclops Blink malware analysis](https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf)\n[report](https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf) to detect possible activity on networks.\n\nUK organisations affected by the activity outlined in this advisory should report any\n[compromises to the NCSC via our website.](https://report.ncsc.gov.uk/)\n\n\n-----\n\n###### Further guidance \n\nA variety of mitigations will be of use in defending against the malware featured in this\nadvisory.\n\n  - **Do not expose management interfaces of network devices to the internet: the**\nmanagement interface is a significant attack surface, so not exposing them\nreduces the risk. See NCSC guidance:\n[https://www.ncsc.gov.uk/guidance/acquiring-managing-and-disposing-network-](https://www.ncsc.gov.uk/guidance/acquiring-managing-and-disposing-network-devices)\n[devices](https://www.ncsc.gov.uk/guidance/acquiring-managing-and-disposing-network-devices)\n\n  - **Protect your devices and networks by keeping them up to date: use the latest**\nsupported versions, apply security patches promptly, use anti-virus and scan\nregularly to guard against known malware threats. See NCSC\nguidance: [https://www.ncsc.gov.uk/guidance/mitigating-malware](https://www.ncsc.gov.uk/guidance/mitigating-malware)\n\n  - **Use multi-factor authentication to reduce the impact of password**\n**[compromises. See NCSC guidance: https://www.ncsc.gov.uk/guidance/multi-](https://www.ncsc.gov.uk/guidance/multi-factor-authentication-online-services)**\n[factor-authentication-online-services and](https://www.ncsc.gov.uk/guidance/multi-factor-authentication-online-services) [https://www.ncsc.gov.uk/guidance/setting-](https://www.ncsc.gov.uk/guidance/setting-two-factor-authentication-2fa)\n[two-factor-authentication-2fa](https://www.ncsc.gov.uk/guidance/setting-two-factor-authentication-2fa)\n\n  - **Treat people as your first line of defence. Tell staff how to report suspected**\nphishing emails, and ensure they feel confident to do so. Investigate their reports\npromptly and thoroughly. Never punish users for clicking phishing links or opening\nattachments. See NCSC guidance: [https://www.ncsc.gov.uk/phishing](https://www.ncsc.gov.uk/phishing)\n\n  - **Set up a security monitoring capability so you are collecting the data that will be**\nneeded to analyse network intrusions. See NCSC\nguidance: [https://www.ncsc.gov.uk/guidance/introduction-logging-security-](https://www.ncsc.gov.uk/guidance/introduction-logging-security-purposes)\n[purposes.](https://www.ncsc.gov.uk/guidance/introduction-logging-security-purposes)\n\n  - **Prevent and detect lateral movement in your organisation’s networks. See**\nNCSC guidance: [https://www.ncsc.gov.uk/guidance/preventing-lateral-movement](https://www.ncsc.gov.uk/guidance/preventing-lateral-movement)\n\n\n-----\n\n##### About this document\n\n\nThis advisory is the result of a collaborative effort by United Kingdom’s\nNational Cyber Security Centre (NCSC), the United States’\nCybersecurity and Infrastructure Security Agency (CISA), Federal\nBureau of Investigation (FBI) and National Security Agency (NSA)\nThe United States’ Cybersecurity and Infrastructure Security Agency\n(CISA), Federal Bureau of Investigation (FBI) and National Security\nAgency (NSA) agree with this attribution and the details provided in the\nreport.\n[This advisory has been compiled with respect to the MITRE ATT&CK®](https://attack.mitre.org/)\nframework, a globally accessible knowledge base of adversary tactics\nand techniques based on real-world observations.\n\n##### Disclaimers\n\n\nThis report draws on information derived from NCSC and industry\nsources. Any NCSC findings and recommendations made have not been\nprovided with the intention of avoiding all risks and following the\nrecommendations will not remove all such risk. Ownership of information\nrisks remains with the relevant system owner at all times.\n\nAll material is UK Crown Copyright ©\n\nDISCLAIMER OF ENDORSEMENT The information and opinions\ncontained in this document are provided \"as is\" and without any\nwarranties or guarantees. Reference herein to any specific commercial\nproducts, process, or service by trade name, trademark, manufacturer,\nor otherwise, does not constitute or imply its endorsement,\nrecommendation, or favoring by the United States Government, and this\nguidance shall not be used for advertising or product endorsement\npurposes.\n\nFor NSA client requirements or general cybersecurity inquiries, contact\nthe NSA Cybersecurity Requirements Center at 410-854-4200 or\nCybersecurity_Requests@nsa.gov.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/2izfjfe8wgev78jqsawow0lozxtkaf4z",
        "https://www.cisa.gov/uscert/sites/default/files/publications/AA22-054A%20New%20Sandworm%20Malware%20Cyclops%20Blink%20Replaces%20VPN%20Filter.pdf"
    ],
    "report_names": [
        "CISA_AA22-054A New Sandworm Malware Cyclops Blink Replaces VPN Filter(03-23-2022)",
        "AA22-054A%20New%20Sandworm%20Malware%20Cyclops%20Blink%20Replaces%20VPN%20Filter.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1645617445,
    "ts_modification_date": 1645610686,
    "files": {
        "pdf": "https://archive.orkl.eu/1e7b9c2fb9c9533572df9070f118b15bdbcb6104.pdf",
        "text": "https://archive.orkl.eu/1e7b9c2fb9c9533572df9070f118b15bdbcb6104.txt",
        "img": "https://archive.orkl.eu/1e7b9c2fb9c9533572df9070f118b15bdbcb6104.jpg"
    }
}