{
    "id": "842058c1-b878-4944-bd17-403f8561febe",
    "created_at": "2023-01-12T15:00:04.266737Z",
    "updated_at": "2025-03-27T02:05:53.071401Z",
    "deleted_at": null,
    "sha1_hash": "1a6059525602725cfc85c3358af08b53a78f9bfc",
    "title": "2022-10-31 - Mondelez and Zurich reach settlement in NotPetya cyberattack insurance suit",
    "authors": "",
    "file_creation_date": "2022-11-28T18:59:05Z",
    "file_modification_date": "2022-11-28T18:59:05Z",
    "file_size": 330949,
    "plain_text": "# Mondelez and Zurich reach settlement in NotPetya cyberattack insurance suit\n\n**[therecord.media/mondelez-and-zurich-reach-settlement-in-notpetya-cyberattack-insurance-suit/](https://therecord.media/mondelez-and-zurich-reach-settlement-in-notpetya-cyberattack-insurance-suit/)**\n\nOctober 31, 2022\n\nImage: Colin Lloyd\nMondelez International and Zurich American Insurance reached a settlement late last week\nin their multi-year legal battle over the food company’s $100 million claim regarding damage\nfrom the NotPetya cyberattack in 2017.\n\nThe insurer had initially refused to cover the damage to Mondelez, which in court documents\nattested it lost more than 1,700 servers and 24,000 laptops to the malware. Details of the\nfinal settlement have not been disclosed.\n\n[NotPetya was a destructive attack which masqueraded as ransomware, and reportedly](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/)\ncaused more than $10 billion in global damages. While it encrypted its victims’ machines and\nleft a demand for a ransom payment, it was not actually designed to be decrypted.\n\nThe malware used an exploit which allowed the virus to spread automatically through trusted\nnetworks. It had first been introduced into a popular Ukrainian accounting company’s\nsoftware but quickly spread beyond Ukraine to hit numerous other countries and companies,\nincluding Mondelez and Merck.\n\nMondelez, the multinational corporation behind Oreos, Ritz crackers, and dozens of other\nsnack food brands, did not respond to The Record for comment. A spokesperson for Zurich\nInsurance said they could only provide a short statement in response: “The parties have\n\n\n-----\n\nmutually resolved the matter.\n\nThe case between the two was complex because Mondelez had not taken out an explicit\ncyber insurance policy but a property policy that it argued covered cyberattacks.\n\nZurich claimed in response that the damage caused by NotPetya was excluded from this\npolicy on the grounds it was a “hostile or warlike action” conducted by a “government or\nsovereign power.”\n\nThe settlement will “fuel growth for the cyber insurance market,” according to Billy Gouveia,\nthe chief executive of incident response business Surefire Cyber.\n\n“As cyber risk remains a top concern for businesses, it is important for organizations to\nprepare and protect themselves on all fronts,” he told The Record, referencing a range of\npreparations from incident response planning through to insurance.\n\nCraig Dunn, the head of Cyber M&A Insurance EMEA for Aon, told The Record he didn’t\nthink the settlement was “much of a surprise.”\n\n“In short, the policy was not a cyberinsurance policy — it was a property policy that provided\nsome cover for cyber events — and Zurich was in a bit of hot water while Mondelez felt like\nthey were in a fairly strong position.”\n\nDunn, who previously led Hiscox Europe’s cyberinsurance business, explained that NotPetya\nleft the whole market feeling the war exclusions included in most policies were not fit for\npurpose. Lloyds of London recently led an effort to revamp these exclusions and find some\nkind of solution that balanced the needs of the customers and the insurance market.\n\nThe exercise involved different insurers and brokers who ultimately came up with four\ndifferent exclusions that can be used to reject claims for state-based attacks in different\nways.\n\n“Despite the negative press that Lloyds of London got for some of the exclusions they’ve\ncome up with, the vast majority of insurers are adopting variants where the intention is to\nonly exclude nation state attacks that form part of an armed conflict or impact the underlying\nfunctioning of a state. In short, the intention is generally not to exclude something like North\nKorea hacking Sony back in 2014,” said Dunn.\n\nWhile one of the exclusions would not cover incidents like the Sony hack, Dunn said “most\ninsurers realize this does not meet their clients’ needs and are happy to provide cover for\nevents that impact individual companies. This important detail was missed by previous\nreporting.”\n\n## Act of War?\n\n\n-----\n\n[The settlement follows earlier this year a New Jersey court ruling in favor of Merck, which](https://therecord.media/merck-wins-cyber-insurance-lawsuit-related-to-notpetya-attack/)\nhad sued its insurer, Ace American, for refusing to cover the damages it suffered because of\nNotPetya.\n\nIn that case, the court dismissed Ace Americans’ defense that the attack was an “Act of War”\nand therefore excluded by the insurance contract. Merck’s lawyers successfully argued that\n“Acts of War” as defined in the contract referred exclusively to “official state actions,” which\nthe NotPetya attack did not count as.\n\nThe United States and United Kingdom have attributed the NotPetya malware to the Russian\n[Federation, with the National Cyber Security Centre finding the Russian military was “almost](https://www.ncsc.gov.uk/news/russian-military-almost-certainly-responsible-destructive-2017-cyber-attack)\ncertainly responsible” — the highest confidence rating the intelligence agency gives. The\nKremlin has repeatedly denied it orchestrated the attack.\n\nNotPetya highlighted the risks that a catastrophic cyberattack could pose for the insurance\nindustry, which could find itself without the capital to support claims.\n\n“There are a lot of concerns about aggregation of risk. Unlike in property insurance where\ninsurers can diversify risk by simply ensuring they don’t insure too many homes or\nbusinesses in one geographical region – the same cannot be said of cyber,” explained Dunn.\n\nPart of the problem is a lack of diversity within the technology sector, with so many\nbusinesses using Windows and relying on cloud services provided by a limited number of\nvendors, Dunn said, “meaning risk can’t be diversified based on geographical location, so\ninsurers must be careful not to take on too much risk.”\n\nThe four different exclusions which Lloyds had come up with included the concept of an\nimpact state, where the only losses excluded will be those that are incurred within a war\nzone or within the state where the critical national infrastructure has been severely damaged.\n“Losses suffered in other countries, where critical national infrastructure (CNI) remains\noperational and where no state of war exists, would be covered,” explained Dunn.\n\n“For instance, if a company operating both inside and outside of Ukraine is attacked today by\nthe Russians and they happened to have this version of the war exclusion in their cyber\ninsurance policy, then any losses incurred as a result of their IT infrastructure being taken out\ninside of Ukraine, which is in a state of war and as such is an ‘impacted state,’ would be\nexcluded,” he said. “However, if their operations in the U.S. or U.K. are also impacted, any\nlosses stemming from this would be covered, since the U.S. and U.K. are outside of the war\nzone and have not suffered attacks against their CNI.”\n\nTags\n\n[Cyber insurance](https://therecord.media/tag/cyber-insurance/)\n[cybercrime](https://therecord.media/tag/cybercrime/)\n\n\n-----\n\n[Mondelez](https://therecord.media/tag/mondelez/)\n[NotPetya](https://therecord.media/tag/notpetya/)\n[Russia](https://therecord.media/tag/russia/)\n[Zurich](https://therecord.media/tag/zurich/)\n\nAlexander Martin is the UK Editor for The Record. He was previously a technology reporter\nfor Sky News and is also a fellow at the European Cyber Conflict Research Initiative.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-31 - Mondelez and Zurich reach settlement in NotPetya cyberattack insurance suit.pdf"
    ],
    "report_names": [
        "2022-10-31 - Mondelez and Zurich reach settlement in NotPetya cyberattack insurance suit.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535604,
    "ts_updated_at": 1743041153,
    "ts_creation_date": 1669661945,
    "ts_modification_date": 1669661945,
    "files": {
        "pdf": "https://archive.orkl.eu/1a6059525602725cfc85c3358af08b53a78f9bfc.pdf",
        "text": "https://archive.orkl.eu/1a6059525602725cfc85c3358af08b53a78f9bfc.txt",
        "img": "https://archive.orkl.eu/1a6059525602725cfc85c3358af08b53a78f9bfc.jpg"
    }
}