{
    "id": "8463c384-518a-4b64-af69-cc1c481249bb",
    "created_at": "2023-01-12T15:05:16.272388Z",
    "updated_at": "2025-03-27T02:08:40.963247Z",
    "deleted_at": null,
    "sha1_hash": "cd03c75823284e5f21e1eb92336c36a0b25fc0f5",
    "title": "2021-06-07 - Siloscape- First Known Malware Targeting Windows Containers to Compromise Cloud Environments",
    "authors": "",
    "file_creation_date": "2022-05-28T17:45:10Z",
    "file_modification_date": "2022-05-28T17:45:10Z",
    "file_size": 2086740,
    "plain_text": "# Siloscape: First Known Malware Targeting Windows Containers to Compromise Cloud Environments\n\n**unit42.paloaltonetworks.com/siloscape/**\n\nDaniel Prizmant June 7, 2021\n\nBy [Daniel Prizmant](https://unit42.paloaltonetworks.com/author/daniel-prizmant/)\n\nJune 7, 2021 at 3:00 AM\n\n[Category: Cloud,](https://unit42.paloaltonetworks.com/category/cloud/) [Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [containers,](https://unit42.paloaltonetworks.com/tag/containers/) [Kubernetes,](https://unit42.paloaltonetworks.com/tag/kubernetes/) [Siloscape](https://unit42.paloaltonetworks.com/tag/siloscape/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/siloscape/)\n\n## Executive Summary\n\nIn March 2021, I uncovered the first known malware targeting Windows containers, a development\nthat is not surprising given the massive surge in cloud adoption over the past few years. I named the\nmalware Siloscape (sounds like silo escape) because its primary goal is to escape the container,\n[and in Windows this is implemented mainly by a server silo.](https://unit42.paloaltonetworks.com/what-i-learned-from-reverse-engineering-windows-containers/)\n\nSiloscape is heavily obfuscated malware targeting Kubernetes clusters through Windows\ncontainers. Its main purpose is to open a backdoor into poorly configured Kubernetes clusters in\norder to run malicious containers.\n\n\n-----\n\nCompromising an entire cluster is much more severe than compromising an individual container, as\na cluster could run multiple cloud applications whereas an individual container usually runs a single\ncloud application. For example, the attacker might be able to steal critical information such as\nusernames and passwords, an organization’s confidential and internal files or even entire databases\nhosted in the cluster. Such an attack could even be leveraged as a ransomware attack by taking the\norganization's files hostage. Even worse, with organizations moving to the cloud, many use\nKubernetes clusters as their development and testing environments, and a breach of such an\nenvironment can lead to devastating software supply chain attacks.\n\nSiloscape uses the Tor proxy and an .onion domain to anonymously connect to its command and\ncontrol (C2) server. I managed to gain access to this server. We identified 23 active Siloscape\nvictims and discovered that the server was being used to host 313 users in total, implying that\nSiloscape was a small part of a broader campaign. I also discovered that this campaign has been\ntaking place for more than a year.\n\nThis report provides background on Windows container vulnerabilities, gives a technical overview of\nSiloscape and offers recommendations on best practices for securing Windows containers.\n\n[Palo Alto Networks customers are protected from this threat with Prisma Cloud’s Runtime Protection](https://docs.paloaltonetworks.com/prisma/prisma-cloud.html)\nfeatures.\n\n## Windows Server Container Vulnerabilities Overview\n\n[On July 15, 2020, I released an article about Windows container boundaries and how to break them.](https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/)\nIn that article, I presented a technique for escaping from a container and discussed some potential\napplications that such an escape can have in the hands of an attacker. The most significant\napplication, and the one I chose to focus on, was an escape from a Windows container node in\nKubernetes in order to spread in the cluster.\n\nMicrosoft originally didn’t consider this issue a vulnerability, based on the reasoning that Windows\nServer containers are not a security boundary, and therefore each application that is being run\ninside a container should be treated as if it is executed directly on the host.\n\nA few weeks after that discussion, I reported the issue to Google because Kubernetes is vulnerable\nto those issues. [Google contacted Microsoft, and after some back and forth, it was determined by](https://googleprojectzero.blogspot.com/2021/04/who-contains-containers.html)\nMicrosoft that an escape from a Windows container to the host, when executed without\nadministrator permissions inside the container, [will in fact be considered a vulnerability.](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-24096)\n\nFollowing this, I discovered Siloscape, which is malware that actively attempts to exploit Windows\nServer containers in the wild. Siloscape is heavily obfuscated malware targeting Kubernetes through\nWindows containers (using Server Containers and not Hyper-V). Its main purpose is to open a\nbackdoor into poorly configured Kubernetes clusters in order to run malicious containers such as,\nbut not limited to, cryptojackers.\n\nThe malware is characterized by several behaviors and techniques:\n\nTargets common cloud applications such as web servers for initial access, using known\nvulnerabilities (“1-days”) – presumably those with a working exploit in the wild.\n\n\n-----\n\nUses Windows container escape techniques to escape the container and gain code execution\non the underlying node.\nAttempts to abuse the node's credentials to spread in the cluster.\nConnects to its C2 server using the IRC protocol over the Tor network.\nWaits for further commands.\n\nThis malware can leverage the computing resources in a Kubernetes cluster for cryptojacking and\npotentially exfiltrate sensitive data from hundreds of applications running in the compromised\nclusters.\n\nInvestigating the C2 server showed that this malware is just a small part of a larger network and that\nthis campaign has been taking place for over a year. Furthermore, I confirmed that this specific part\nof the campaign was online with active victims at the time of writing.\n\n## Technical Overview\n\nBefore diving into the technical details of Siloscape, it is important to get a better understanding of\nits overall behavior and flow.\n\nFigure 1. Execution flow of Siloscape.\n\n1. The attacker achieves remote code execution (RCE) inside a Windows container using a\n\nknown vulnerability or a vulnerable web page or database.\n2. The attacker executes Siloscape (CloudMalware.exe) with the necessary C2 connection\n\ninformation provided as command line arguments (and not hardcoded inside the binary).\n3. Siloscape impersonates CExecSvc.exe to obtain SeTcbPrivilege privileges (this technique is\n\n[described in detail in my previous article).](https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/)\n\n\n-----\n\n4. Siloscape creates a global symbolic link to the host, practically linking its containerized X drive\n\nto the host’s C drive.\n5. Siloscape searches for the kubectl.exe binary by name and the Kubernetes config file by\n\nregular expression on the host, using the global link.\n6. Siloscape checks if the compromised node has enough privilege to create new Kubernetes\n\ndeployments.\n7. Siloscape extracts the Tor client to the disk from an archived file using an unzip binary. Both\n\nfiles are packed into the main Siloscape binary.\n8. Siloscape connects to the Tor network.\n9. Using the provided command line argument, Siloscape decrypts the C2 server’s password.\n10. Siloscape connects to the C2 server using an .onion domain (a domain accessible through the\n\nTor network) provided as a command line argument.\n11. Siloscape waits for commands from the C2 and executes them.\n\nUnlike other malware targeting containers, which are mostly cryptojacking-focused, Siloscape\ndoesn’t actually do anything that will harm the cluster on its own. Instead, it focuses on being\nundetected and untraceable and opens a backdoor to the cluster.\n\n**Defense Evasion and Obfuscation**\n\nSiloscape is heavily obfuscated. There are almost no readable strings in the entire binary. While the\nobfuscation logic itself isn’t complicated, it made reversing this binary frustrating.\n\nFigure 2. Strings obfuscation as it looks in Interactive Disassembler (IDA).\nEven simple API calls were obfuscated, and instead of just calling the functions, Siloscape made the\neffort to use the Native API (NTAPI) version of the same function.\n\n\n-----\n\nFigure 3. Dynamic search of functions in ntdll.dll.\nFor example, instead of calling CreateFile, Siloscape calls NtCreateFile. Instead of calling\nNtCreateFile directly, Siloscape calls it dynamically, meaning it searches for the function name in\nntdll.dll at runtime and jumps to its address. Not only that, but it also obfuscates the function and\n\n\n-----\n\nmodule names and deobfuscates them only at runtime. The end result is malware that is very\ndifficult to detect with static analysis tools and frustrating to reverse engineer.\n\nSiloscape uses a pair of keys to decrypt the C2 server’s password. One of the most important\nfeatures of its obfuscation is that one key is hardcoded into the binary, while the other is supplied as\n[a command line argument. I searched for its hash in multiple engines, such as AutoFocus and](https://www.paloaltonetworks.com/cortex/autofocus)\nVirusTotal, and couldn’t find any results. This led me to believe that Siloscape is being compiled\nuniquely for each new attack, using a unique pair of keys. The hardcoded key makes each binary a\nlittle bit different than the rest, which explains why I couldn’t find its hash anywhere. It also makes it\nimpossible to detect Siloscape by hash alone.\n\nFigure 4. Siloscape using Visual Studio Resource Manager.\nAnother interesting technique this malware uses is Visual Studio’s Resource Manager. This is a\nfeature built into Visual Studio that allows one to attach basically any file to the original binary and\nget a pointer to its data with a few simple API calls. Siloscape uses this method to write the Tor\narchive to the disk, as well as the unzip binary used to open the archive. It also uses Tor to securely\nconnect to its C2.\n\n\n-----\n\n**The Container Escape**\n\nOne of the more interesting things about Siloscape is the way it escapes the container. To execute\nthe system call NtSetInformationSymbolicLink that enables the escape, one must gain\nSeTcbPrivilege first. There are a few ways to do this. For example, in my tests, I injected a DLL into\nCExecSvc.exe, which has the relevant privileges, and executed NtSetInformationSymbolicLink from\nthe CExecSvc.exe context. Siloscape, however, uses a technique called Thread Impersonation.\nThis method has little documentation online and even fewer working examples. The most critical\nfunction for this technique is the undocumented system call NtImpersonateThread.\n\nSiloscape mimics CExecSvc.exe privileges by impersonating its main thread and then calls\nNtSetInformationSymbolicLink on a newly created symbolic link to break out of the container. More\nspecifically, it links its local containerized X drive to the host’s C drive.\n\n**Choosing the Cluster**\n\nAfter Siloscape creates a link to the host, it will search for two specific files: kubectl.exe and the\nKubernetes config file, which normally exists on Kubernetes nodes.\n\nFigure 5. Siloscape searches for the kubectl.exe binary.\nSiloscape searches for kubectl.exe by name and the config file using a regular expression. The\nsearch function takes an extra argument: a pointer to a vector that holds folder names to exclude\nfrom the search.\n\nFigure 6. Siloscape searches for the config file by regular expression.\nWhen it calls FindFile to search for the above files, it excludes the folders Program Files, Program\nFiles (x86), Windows and Users. It does this to make the search faster and because it is unlikely the\npreviously mentioned files are in those folders. If both files are found, their paths are saved to a\nglobal variable. If the files are not located, Siloscape exits, abandoning the attack.\n\nAfter Siloscape finds everything it needs to execute kubectl commands, it continues to check if the\ncompromised node actually has enough permissions to use for the attacker’s malicious activities. It\ndoes this by executing the kubectl command %ls auth can-i create deployments --kubeconfig=%ls\nwhere the strings in the format are replaced by the paths it saved earlier as global variables.\n\n**Connecting to the C2 and Supported Commands**\n\nAfter getting everything it needs and checking that the compromised node is indeed capable of\ncreating new deployments, Siloscape writes the Tor archive (ZIP) and an unzip binary to the host’s\nC drive. After extracting Tor, it launches tor.exe to a new thread and waits for it to finish by checking\nthe Tor thread output\n\n\n-----\n\nAfter Tor is up and running, Siloscape uses it to connect to its C2 – an IRC server, using an onion\naddress that was provided as a command line argument.\n\nThe server is password-protected. Siloscape uses its first command line argument to decrypt the\npassword by a simple byte by byte XOR. The following is a simplified version of the C2 server’s\npassword decryption:\n\nchar hardCodedXor[32] = \"HARD_CODED_32_LONG_STRING\";\nchar ircPass[32] = { 0 };\nfor (int i = 0; i < 32; i++)\nircPass[i] = hardCodedXor[i] ^ argv[1][i];\n\nOnce successfully connected to the IRC server, it issues a JOIN #WindowsKubernetes command to\njoin the WindowsKubernetes IRC channel and then idles there.\n\nSiloscape allows two types of instructions, one for kubectl supported commands and one for regular\nWindows cmd commands.\n\nFigure 7. Siloscape\n\ncomparing the sender’s username to admin.\nIt waits for a private message. If one from a user named admin is received, Siloscape follows the\nfollowing logic:\n\nIf the message starts with a K, it executes a kubectl command to the cluster using the paths it\nfound earlier by running the command %ls %s --kubeconfig=%ls where:\n\nThe first parameter is the global variable of the kubectl’s path.\nThe second parameter is the message from the admin minus the first character.\nThe third parameter is the global variable of the config’s path.\nIf the message starts with a C, it simply runs the command minus the first character as a\nregular Windows cmd command.\n\n\n-----\n\n## Command and Control\n\nAfter I reversed the malware, especially the part that handles the C2, I wanted to discover whether\nthis campaign was still up and running.\n\nI set up a brand new virtual machine, downloaded Tor and started looking for an IRC client that\nsupports SOCKS5, the proxy protocol that is needed in order to connect through Tor. IRC is a very\nold protocol and is less popular today than it was 20 years ago. Furthermore, IRC came out almost\na decade before SOCKS5. I found HexChat, a simple, lightweight IRC client that supports both\nSOCKS5 and connecting to onion domains.\n\nWhen our Silospace sample was originally executed, its command line argument for the IRC\nusername was php_35, so I decided to use this username when connecting to the C2 server from\nHexChat, thinking it would appear legitimate to the attacker.\n\nFigure 8. #WindowsKubernetes channel active victims.\nI connected to the server and discovered it was still working. I joined #WindowsKubernetes just like\nSiloscape does. There were 23 active victims there and a channel operator named admin.\n\n\n-----\n\nFigure 9. C2 server shutting down.\nUnfortunately, after about two minutes, I was noticed and kicked out of the server. Two minutes after\nthat, the server was no longer active – at least not at the original onion domain I used.\n\n### What Can We Learn?\n\nWhen I went over my findings, the first thing that came to mind is that there were many more active\nusers on the C2 server than I actually saw in the #WindowsKubernetes channel – 313 users in total,\nto be exact. This implies that the Siloscape malware was just a small part of a bigger campaign.\n\nSadly, when I connected to the server, the channels list was empty, indicating that the server was\nconfigured to not reveal its channels. Therefore, I couldn’t get more information from the channel\nnames.\n\nThe second and more important detail that stood out was the convention used for the victims’\nnames. Our name was php_35, and when our sample of Siloscape first executed, it indeed was\nexecuted through a vulnerable php instance. The other names clearly suggest the way the attacker\nmanaged to achieve code execution (sqlinj probably means SQL injection):\n\n@admin sqlinj_64 sqlinj_51 php_34 weblogic_12 sqlinj_138 weblogic_19 php_66 sqlinj_87 sqlinj_8\nsqlinj_33 sqlinj_114 activemq_5 sqlinj_44 tomcat_9 sqlinj_52 sqlinj_107 redis_10 php_76 sqlinj_28\nactivemq_25 sqlinj_35 php_8 weblogic_31 php_35\n\nThe last piece of information I was able to obtain from the C2 is the creation date of the server: Jan.\n12, 2020. Note that this doesn’t necessarily mean that Siloscape was created on that date. Instead,\nit’s likely the campaign started at that time.\n\n## Conclusion\n\n\n-----\n\nUnlike most cloud malware, which mostly focuses on resource hijacking and denial of service (DoS),\nSiloscape doesn’t limit itself to any specific goal. Instead, it opens a backdoor to all kinds of\nmalicious activities.\n\nAs discussed in my [last article, users should follow Microsoft’s guidance recommending not to use](https://unit42.paloaltonetworks.com/windows-server-containers-vulnerabilities/)\nWindows containers as a security feature. Microsoft recommends using strictly Hyper-V containers\nfor anything that relies on containerization as a security boundary. Any process running in Windows\nServer containers should be assumed to have the same privileges as admin on the host, which in\nthis case is the Kubernetes node. If you are running applications in Windows Server containers that\nneed to be secured, we recommend moving these applications to Hyper-V containers.\n\nFurthermore, administrators should make sure their Kubernetes cluster is securely configured. In\nparticular, a secured Kubernetes cluster won’t be as vulnerable to this specific malware as the\nnodes’ privileges won’t suffice to create new deployments. In this case, Siloscape will exit.\n\nSiloscape shows us the importance of container security, as the malware wouldn’t be able to cause\nany significant damage if not for the container escape. It is critical that organizations keep a wellconfigured and secured cloud environment to protect against such threats.\n\n[Existing Prisma Cloud capabilities will successfully detect and mitigate the Siloscape malware.](https://docs.paloaltonetworks.com/prisma/prisma-cloud.html)\n\n\n-----\n\nFigure 10. Choosing action for unexpected processes on Prisma Cloud.\nPrisma Cloud’s Runtime Protection feature learns the machine’s behavior and creates a set of rules\nfor processes. Once the learning is complete, the user can choose the action for new, unexpected\nprocesses attempting to execute. The user can choose to alert, prevent or completely block the\nexecution.\n\n\n-----\n\nFigure 11. Siloscape blocked by Prisma Cloud\n\n**Indicators of Compromise**\n\n**Description** **SHA256**\n\n\nOur\nSiloscape\nvariant\n\nunzip.exe,\nthe unzip\nbinary\nSiloscape\nwrites to the\ndisk\n\ntor.zip, the\ntor archive\nSilsocape\nwrites to the\ndisk\n\n\n5B7A23676EE1953247A0364AC431B193E32C952CF17B205D36F800C270753FCB\n\n81046F943D26501561612A629D8BE95AF254BC161011BA8A62D25C34C16D6D2A\n\n010859BA20684AEABA986928A28E1AF219BAEBBF51B273FF47CB382987373DB7\n\n\n## Additional Resources\n\n[Unit 42 Discovers First Known Malware Targeting Windows Containers](https://www.paloaltonetworks.com/blog/2021/06/siloscape-malware-windows-containers)\n\n[Webinar: Unit 42 researchers will cover the details of Siloscape live.](https://register.paloaltonetworks.com/newtargetedattack)\n\n\n-----\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-07 - Siloscape- First Known Malware Targeting Windows Containers to Compromise Cloud Environments.pdf"
    ],
    "report_names": [
        "2021-06-07 - Siloscape- First Known Malware Targeting Windows Containers to Compromise Cloud Environments.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535916,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653759910,
    "ts_modification_date": 1653759910,
    "files": {
        "pdf": "https://archive.orkl.eu/cd03c75823284e5f21e1eb92336c36a0b25fc0f5.pdf",
        "text": "https://archive.orkl.eu/cd03c75823284e5f21e1eb92336c36a0b25fc0f5.txt",
        "img": "https://archive.orkl.eu/cd03c75823284e5f21e1eb92336c36a0b25fc0f5.jpg"
    }
}