{
    "id": "8484e10a-c77e-40ba-8f0e-bfebb98f13ad",
    "created_at": "2023-01-12T15:07:47.095978Z",
    "updated_at": "2025-03-27T02:16:26.442151Z",
    "deleted_at": null,
    "sha1_hash": "37277b311ae10dfcad47a237be7a5fe480d381e6",
    "title": "2021-03-08 - Renewed SideWinder Activity in South Asia",
    "authors": "",
    "file_creation_date": "2022-05-28T18:10:58Z",
    "file_modification_date": "2022-05-28T18:10:58Z",
    "file_size": 1123830,
    "plain_text": "# Renewed SideWinder Activity in South Asia\n\n**[deependresearch.org/2021/03/renewed-sidewinder-activity-in-south.html](http://www.deependresearch.org/2021/03/renewed-sidewinder-activity-in-south.html)**\n\nA few months ago, [Trend Micro released a post which encapsulated the SideWinder APT](https://www.trendmicro.com/en_us/research/20/l/sidewinder-leverages-south-asian-territorial-issues-for-spear-ph.html)\ngroup activity in the past year, showcasing SideWinder’s mobile malware development\naspirations and spear phishing campaigns targeting the government and military of Nepal,\nthe government of Afghanistan, the Myanma Posts and Telecommunications state owned\ncompany, the Chinese Ministry of Foreign Affairs, and several other entities.\n\nThe SideWinder APT which is also tracked as RAZOR TIGER, APT-C-17, and Rattlesnake is\n[known to pick its targets in the South Asia region in multiple previous campaigns [1,](https://www.trendmicro.com/en_us/research/20/a/first-active-attack-exploiting-cve-2019-2215-found-on-google-play-linked-to-sidewinder-apt-group.html) [2,](https://securelist.com/apt-trends-report-q1-2018/85280/) [3].](https://s.tencent.com/research/report/479.html)\nSideWinder’s targets mainly consist of the countries of Nepal, Pakistan, Afghanistan, and\nChina along with some other target countries from the group’s known past activity. This\nthreat group is somewhat believed to be associated with Indian interests and seems to\nmainly choose to target government and military entities in its espionage attacks.\n\nWhile we were hunting through world scan data provided by BinaryEdge, we encountered an\ninteresting server during our research which was hosting an executable file that led us on a\npath to uncover a renewed set of activity being conducted by the SideWinder group - picking\nright where they left off from in their previous year of operation.\n\nKey Findings:\n\nThe group renewed its spear phishing activity with new domains registered targeting\ngovernment entities in Nepal.\nNepal recently cancelled its upcoming elections scheduled for 30 April and 10 May\n2021.\nUncovered evidence of the group likely targeting Nepal's Election Commission.\nEvidence of continued efforts of malware development being conducted by the group.\n\nCommand and Control\n\n\n-----\n\nThe server which was the initial point in our investigation was hosting the following shellcode\nwe identified in the scan response we checked on port 8087.\n\nServer's raw response showing an expected C2 domain connection.\n\nOutputting this raw data for initial analysis and triage, we managed to figure out this was\nmost likely 2nd stage malware being used for Command and Control purposes through this\nserver.\n\n\n-----\n\nPE-Studio showing us the malware's used libraries, headers, references, and compilation\n\ndate.\n\nAnd as we continued our search throughout the server, we realized that it was also\ncommunicating with what looked to be 1st stage malware via port 8085. We think that such\n1st stage malware is being used in SideWinder’s spear phishing attacks, and we suspect\n[that a sample of one was uploaded in January to VirusTotal.](https://www.virustotal.com/gui/file/66dcaaa42e3f36f0560af741017c13c528758140f0f7f4260b9213739ffd9e70/)\n\nUpon further search, we managed to find the 2nd stage payload that was being used by the\ngroup and hosted on this server via a simple text file encoded in Base64. After a\nstraightforward decode, we were able to see the code used by the threat actor for the 2nd\nstage payload they are utilizing.\n\n\n-----\n\nMeterpreter 2nd Stage Payload code excerpt.\n\nWe immediately had our assumption verified, as we were able to see that the server is being\nused for command and control purposes using a meterpreter based payload written in\nPython.\n\nFirst Stage Payload\nAn example of what we suspect this group is using that precedes the command and control\ninfrastructure we first laid eyes on was this malware file uploaded to VirusTotal:\n\n\n-----\n\nAn .hta file most likely attached to spear phishing emails.\n\n[We suspect that this actor is using malicious .hta files that are attached to emails containing](https://www.virustotal.com/gui/file/ddc19d1421e2eed9c606c4249fab0662f1253e441da2f1285242cb03d5be5b32/detection)\nlinks to decoy document lures along with embedded 1st stage malware inside the hta files.\nHere we see such an embedded link to a PE-file being disguised as a txt file being used to\ndeploy spyware upon execution.\n\nOnce this spyware is downloaded the malware will check for the environment it’s running in\nand attempt to identify the infected machine’s IP address with an external HTTP request.\n\n\n-----\n\nExternal request to an online IP check API.\n\nAnother Python based malware, this specific sample runs in the background after execution\nand creates a database file of extracted logins from browser files, creates archived files of all\nof the infected machine's downloads, documents, and desktop files to a then daunting task of\nexfiltration.\n\nUtilizing the WriteFile function to write the stolen data to files.\n\nImmediately after execution the malware attempts to steal files, writing the stolen browser\ndata to a \"Loginvault.db\" file and .zip files using the folder location, the machine's IP address\nand datestamp as the naming scheme.\n\n\n-----\n\nExfiltration attempt to the C2 server using port 8080.\n\nThis spyware sample takes us directly to the spear phishing efforts we suspect SideWinder\nmay be conducting while using similar malware techniques.\n\nSpear Phishing\n\nAnother finding that we encountered while searching through the contents and configurations\nof this server were the decoy pages SideWinder is using to phish against their intended\ntargets. When we looked at what was being hosted we were surprised to find the server as a\nsingle staging point for a lot of the group’s phishing activity (on top of some mobile malware\ndevelopment efforts we cover further along in the post).\n\nThe server we were investigating was using various dynamic DNS resolutions to the main IP\naddress and resolving almost all of the domain names with naming schemes that mimic the\nnaming convention of the real entities SideWinder are targeting.\n\nSideWinder are still very adamant at focusing their attention on the same entities they’ve\npreviously attempted to target as showcased by Trend Micro’s report, while adding some\nadditional in-country organizations to their target list.\n\nAs of the last few weeks, it seems this group has renewed its activity and started to ramp up\nattack efforts against their targets of choice. For example, through our investigation of the\nserver, we’ve managed to find that the group is renewing their efforts against government\nentities of Nepal and setting up phishing infrastructure to launch such campaigns.\n\n\n-----\n\nIn our findings, it seems that SideWinder has added the Ministry of Physical Infrastructure\nand Transport of Nepal to their list of targets and are still actively trying to gain access to\nother government offices of the country.\n\nMinistry of Physical Infrastructure and Transport of Nepal domain and login panel.\n\nAnother such target in Nepal is the Ministry of Foreign Affairs with a preceding lure intended\non motivating the recipient to login with their credentials to be able to continue reading the\ndecoy article planted by the threat actor. In this case, a press release by the Nepal Mission to\nthe UN pertaining to the COVID-19 situation around the region, and human rights issues.\n\n\n-----\n\nMinistry of Foreign Affairs decoy lure.\n\nA short while after accessing the link the unsuspecting reader will be redirected to the\nMinistry’s login page.\n\nAfter a redirect from the lure article, the reader is redirected to this login panel.\n\n[Here CapTipper is showcasing us the ~15 seconds it takes to get redirected from the initial](https://github.com/omriher/CapTipper)\ndecoy article to the login panel.\n\n\n-----\n\nThe phishing efforts being conducted by the group in this activity are reliant on the content\ndelivery backbone of the actual target website to deliver all of the page's media and redirect\nto it once credentials are entered. Meaning the actor controlled server just hosts basic\nphishing kits which use the target's own content delivery network to mimic the respective\nlogin panel which they are targeting.\n\nThe fake page making lookup requests to the real Nepal Foreign Affairs government\n\nwebsite.\n\nSome other decoy tricks that are being employed by the group in this campaign are error\nmessages hardcoded in the phishing pages. Such as the one in a phishing page spoofing\nthe Nepal central government email system:\n\n\n-----\n\nSource code showing the hardcoded error message.\n\nOr an additional one hardcoded in the phishing page targeting the Ministry of Defense:\n\nMinistry of Defense login panel with a hardcoded error.\n\nWe imagine this is a social engineering tactic employed by the actor in efforts of achieving\nfurther enticement to enter login credentials by adding pretext to complete the action.\n\n\n-----\n\nWe have also witnessed renewed attention in efforts against organizations such as the Nepal\nstate owned Nepal Telecom company, while continuing the techniques of utilizing the real\nwebsite’s content backbone including the reCaptcha widget.\n\nNepal Telecom phishing page piggybacking the reCaptcha widget.\n\nAs you can see, the SideWinder group is still very interested in targeting entities located in\nNepal. With an additionally very interesting phishing page we managed to find being hosted\non this server to what we think is also a current and new target focus for the group.\n\nThis new phishing target seems to be the Election Commission of Nepal:\n\n\n-----\n\nA phishing page targeting the Election Commission of Nepal\n\nAs we've shown previously, the actor is again utilizing the same tactic of loading the content\nfrom the real government website and redirecting to it once credentials are entered:\n\nThis finding is particularly interesting considering the fact that Nepal was meant to be having\nelections fast approaching in April and May of this year, only to be very recently overturned\nas of [last week.](https://www.wionews.com/south-asia/nepal-supreme-court-overturns-prime-minister-kp-sharma-olis-house-dissolution-365693)\n\nConsidering that these elections were only recently announced in the end of December\n2020, we think that this proves as to some of the motivation behind the group’s renewed\nactivity and new target focus as of the past couple of months.\n\nConclusion\n\n\n-----\n\nThere were a few other findings we gathered from this server which we decided not to blog\nabout in this post as we didn't consider them much different from the phase of operations this\ngroup was at at the end of last year. Like some which were connected to the mobile malware\napplications being developed by SideWinder, as this part of their operations seems to be still\nvery much in the development and testing stage. As evident by what looks like internal\ntesting left behind by the developers.\n\nLog left behind by the group.\n\nWe also can’t confirm that all of the phishing infrastructure we uncovered will indeed be\ninfected with malware or have a preceding malicious payload once in use. Even with the\nproximity of the phishing pages residing on the same server with other malware it remains\nunclear at this stage. Some of these pages may very well be used in single purpose\ncredential phishing campaigns.\n\nOn the other hand, what we did cover in this post indicates how SideWinder is very much\nfocused on conducting espionage operations against their target area of interest in South\nAsia. Taking into account what this group has done in the past year; we see that we should\ntake this renewed activity as an indication that SideWinder will only continue to ramp up its\nactivities in the rest of the upcoming months of 2021 and beyond.\n\nThe group’s continued interest in Nepal serves as evidence to that – We can only speculate\nthat regional developments such as the potential elections in countries of the region,\ngeopolitical tensions such as the military clashes in the India-China border, international\nevents mixed in with regional efforts such as COVID-19 vaccine distribution, and other\nregional interests will only continue to fuel such campaigns conducted by the group in South\nAsia. We should anticipate more of such spear phishing activity and further development of\n\n\n-----\n\ntheir malware and specific mobile malware capabilities to launch such campaigns against the\ngroup’s targets of interest.\n\nIndicators of Compromise\n\nmail-ntcnetnp.serveftp[.]com\nmail.aop.gavaf[.]org\nmail.nepal.gavnp[.]org\nmail.ncp.gavnp[.]org\nmail-mofa.hopto[.]org\nmail-mofagovpk.myftp[.]org\nmail-mopitgovnp.hopto[.]org\nwebmail-accbt.hopto[.]org\nmail-opmcmgavnp.hopto[.]org\nmail-nepalpolgavnp.hopto[.]org\nmail-apfgavnp.hopto[.]org\nmail-meagovmv.hopto[.]org\n\nmicrosoft-winupdate.servehttp[.]com\nchangeworld.hopto[.]org\nteamchat.hopto[.]org\n\n45.153.240[.]66\n\n680196722f65117a62cb3738f390e3552ffafcd663e85b7a81965f55462be994\n0c182b51ff1dffaa384651e478155632c6e65820322774e416be20e6d49bb8f9\n66dcaaa42e3f36f0560af741017c13c528758140f0f7f4260b9213739ffd9e70\nddc19d1421e2eed9c606c4249fab0662f1253e441da2f1285242cb03d5be5b32\nf120cb306cb9e2cc0fbfb47e6bd4fdf2a3eea0447a933bc922f33ff458b43a86\nfd48c8ae2753bb729ed26535726459f6c19e598fd270eaaa5c14f4d51ce348d5\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-08 - Renewed SideWinder Activity in South Asia.pdf"
    ],
    "report_names": [
        "2021-03-08 - Renewed SideWinder Activity in South Asia.pdf"
    ],
    "threat_actors": [
        {
            "id": "031ca94c-6a81-4cdc-b0d4-2f6d388801eb",
            "created_at": "2022-10-25T16:07:24.100451Z",
            "updated_at": "2025-03-27T02:02:10.107611Z",
            "deleted_at": null,
            "main_name": "Razor Tiger",
            "aliases": [],
            "source_name": "ETDA:Razor Tiger",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536067,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653761458,
    "ts_modification_date": 1653761458,
    "files": {
        "pdf": "https://archive.orkl.eu/37277b311ae10dfcad47a237be7a5fe480d381e6.pdf",
        "text": "https://archive.orkl.eu/37277b311ae10dfcad47a237be7a5fe480d381e6.txt",
        "img": "https://archive.orkl.eu/37277b311ae10dfcad47a237be7a5fe480d381e6.jpg"
    }
}