{
    "id": "84ce0892-34e4-4d81-8678-80c7b41717ad",
    "created_at": "2023-01-12T14:59:44.235944Z",
    "updated_at": "2025-03-27T02:05:23.461823Z",
    "deleted_at": null,
    "sha1_hash": "2a75477c48d4e3e631a5dadf368dd9ff2a90b09f",
    "title": "2010-07-15 - Black DDoS",
    "authors": "",
    "file_creation_date": "2022-05-28T21:46:06Z",
    "file_modification_date": "2022-05-28T21:46:06Z",
    "file_size": 602849,
    "plain_text": "# Black DDoS\n\n**securelist.com/black-ddos/36309/**\n\nAuthors\n\n[Dmitry Tarakanov](https://securelist.com/author/dmitryt/)\n\nCybercriminals use a variety of bots to conduct DDoS attacks on Internet servers. One of the\nmost popular tools is called Black Energy. To date, Kaspersky Lab has identified and\nimplemented detection for over 4,000 modifications of this malicious program. In mid-2008\nmalware writers made significant modifications to the original version, creating Black Energy\n2 (which Kaspersky Lab detects as Backdoor.Win32.Blakken). This malicious program is the\nsubject of this article.\n\n## Step-by-step: the bot components\n\nThe bot has several main functions: it hides the malware code from antivirus products,\ninfects system processes and, finally, offers flexible options for conducting a range of\nmalicious activities on an infected computer when commands are received from the botnet\ncommand-and-control (C&C) center. Each task is performed by a different component of the\nmalicious program.\n\n\n-----\n\n**Figure 1. A step-by-step guide to how Black Energy 2 works**\n\n### The protective layer\n\nLike most other malicious programs, Black Energy 2 has a protective layer that hides the\nmalicious payload from antivirus products. This includes encryption and code compression;\nanti-emulation techniques can also be used.\n\nOnce the Black Energy 2 executable is launched on a computer, the malicious application\nallocates virtual memory, copies its decryptor code to the memory allocated and then passes\ncontrol to the decryptor.\n\nExecution of the decryptor code results in code with dropper functionality being placed in\nmemory. Once the dropper code is executed, a decryptor driver with a random name, e.g.\n“EIBCRDZB.SYS”, is created in system32drivers. A service (which also has a random name)\nassociated with the driver is then created and started:\n\n\n-----\n\n**Figure 2. The launch of the malicious decryptor driver**\n\nLike the original executable, this driver is, in effect, a ‘wrapper’ that hides the most interesting\npart of the malware.\n\n### The infector\n\nThe code of the decryptor driver contains a block of encrypted and packed data:\n\n\n-----\n\n**Figure 3. Encrypted data within the decryptor driver**\n\nThe data block has the following structure:\n\n**Figure 4. Encrypted data structure**\n\nThe key from this block is used to create another key, 100h bytes in size, which is used to\ndecrypt the archive. The encryption is based on the well-known RC4 algorithm. If the archive\nsize is equal to the data size, it means that the data is not packed. However, if the two do not\ncoincide, the encrypted archive has to be unpacked.\n\nThe decrypted data is an infector driver which will inject a DLL into the svchost.exe usermode process. In order to launch the infector driver, the decryptor driver allocates memory,\ncopies the decrypted code to that memory area, remaps address offset fixups and passes\ncontrol to it. The malicious DLL is stored in the .bdata section of the infector driver. This data\nblock has the same structure as that described above. The infector driver locates the\nsvchost.exe process and allocates memory in its address space. The malicious DLL is then\ncopied to this memory area and address offsets are remapped according to the relocation\ntable The injected library’s code is then launched from kernel mode as shown below:\n\n\n-----\n\n**Figure 5. Launching the DLL injected into svchost.exe**\n\nThis method uses APC queue processing. First, an APC with the address of the DllEntry\nfunction for the library injected is initialized, then the APC is queued using\nKeInsertQueueApc APC. As soon as svchost.exe is ready to process the APC queue (which\nis almost immediately), a thread from the DllEntry address is launched in its context.\n\n### The injected DLL\n\nThe DLL which is injected into svchost.exe is the main controlling factor in launching a DDoS\nattack from an infected computer. Like the infector driver, the DLL has a .bdata section; this\nincludes a block of encrypted data, which has the same structure as that shown above. The\ndata makes up an xml document that defines the bot’s initial configuration. This screenshot\ngives an example:\n\n**Figure 6. The bot’s initial settings**\n\n\n-----\n\nThe address of the botnet s C&C is of course the most important information. In this case,\ntwo addresses are given for the sake of reliability: if one server is down and the bot is unable\nto contact it, the bot can attempt to connect to its owner using the backup address.\n\nThe bot sends a preformed http request to the C&C address; this is a string containing data\nwhich identifies the infected machine. A sample string is shown below:\n\nid=xCOMPUTERNAME_62CF4DEF&ln=ru&cn=RU&nt=2600&bid=3\n\nThe id parameter, which is the infected machine’s identifier, includes the computer name and\nthe serial number of the hard disk on which the C: drive is located. This is followed by\noperating system data: system language, OS installation country and system build number.\nThe build identifier for the bot ( ‘build_id’ in the initial configuration options xml document)\ncompletes the string.\n\nThe format of the request string is used as confirmation that the request actually comes from\nthe bot. In addition, the C&C center also uses the user-agent header of the http request as a\npassword of sorts.\n\nIf the C&C accepts the request, it responds with a bot configuration file which is also an\nencrypted xml document. RC4 is also used to encrypt this file, with the infected machine’s\nidentifier (the id parameter of the request string, in the example above –\nxCOMPUTERNAME_62CF4DEF) serving as a key.\n\nHere is an example of such instructions:\n\n\n-----\n\n**Figure 7. Configuration file – instructions from the C&C**\n\nThe section tells the bot which modules are available on the owner’s server to set up a DDoS\nattack. If the bot does not have a particular module or if a newer version is available on the\nserver, the bot will send a plug-in download request to the server, e.g.:\n\ngetp=http&id=xCOMPUTERNAME_62CF4DEF &ln=ru&cn=RU&nt=2600&bid=3\n\nA plug-in is a DLL library, which is sent to the bot in an encrypted form. If the key used to\nencrypt a plugin differs from the value of the id parameter, it will be specified in the field of\nthe configuration file. Once the plug-in DLL has been received and decrypted, it will be\nplaced in the memory area allocated. It is then ready to begin a DDoS attack as soon as the\nappropriate command is received.\n\n\n-----\n\nPlug-ins will be regularly downloaded to infected machines: as soon as the malware writer\nupdates their attack methods, the Black Energy 2 bot will download the latest version of the\nrelevant plugin.\n\nThe downloaded plug-ins are saved to the infected computer’s hard drive as str.sys in\nsystem32drivers. Str.sys is encrypted, with the id parameter being used as the key. Prior to\nencryption, the str.sys data looks like this:\n\n**Figure 8. Unencrypted contents of str.sys: plug-in storage**\n\nEach plug-in has an exported function, DispatchCommand, which is called by the main\nmodule – the DLL injected into the svchost.exe process. A parameter (one of the commands\nfrom the section in the bot configuration file) is passed to the DispatchCommand function.\nThe plug-in then executes the command.\n\n## The main plug-ins\n\nThe main plug-ins for Black Energy 2 are ddos, syn and http. A brief description of each is\ngiven below.\n\n### The ddos plug-in\n\n\n-----\n\nThe server address, protocol and port to be used in an attack are the input for the ddos plugin. The plug-in initiates mass connections to the server, using the port and protocol specified.\nOnce a connection is established, a random data packet is sent to the server. The following\nprotocols are supported: tcp, udp, icmp and http.\n\nBelow is an example of a “ddos_start udp 80” command being carried out:\n\n**Figure 9. Creating a socket, UDP protocol**\n\n**Figure 10-1. Sending data: sendto and the stack**\n\n**Figure 10-2. Sending data: sendto and the stack**\n\n\n-----\n\n**Figure 10-3. What data is sent: a random set of bytes**\n\nWhen the http protocol is specified in the command, the ddos plugin uses the socket,\nconnect and send functions to send a GET request to the server.\n\n### The syn plug-in\n\nUnlike the other plug-ins described in this article, the syn plugin includes a network driver.\nWhen the plugin’s DllEntry function is called, the driver is installed to system32drivers folder\nas synsenddrv.sys. The driver sends all the network packets. As can be easily guessed, the\nDispatchCommand function waits for the main DLL to send it the following parameter:\n“syn_start ” or “syn_stop “. If the former parameter is received, the plugin begins an attack, if\nthe latter is received, the attack is stopped. An attack in this case consists of numerous\nconnection requests being made to the server, followed by so-called ‘handshakes’, i.e. the\nopening of network sessions.\n\n**Figure 11. SYN attack: SYN->ACK->RST**\n\nNaturally, if numerous requests are made from a large number of infected computers, this\ncreates a noticeable load on the server.\n\n### The http plug-in\n\n\n-----\n\nThe DDoS attack methods described above are often combated by using redirects: a server\nwith online resources is hidden behind a gateway that is visible to the outside world, with the\ngateway redirecting requests to the server hosting the resources. The gateway can use a\nvariety of techniques to fend off DDoS attacks and taking it down is not easy. Since the ddos\nand syn plugins target IP addresses and have no features which allow them to recognize\ntraffic redirects, they can only attack the gateway. Hence, the network flooding that they\ngenerate simply does not reach the server hosting Internet resources. This is where the http\nplugin comes in.\n\nHaving received the http_start command, the http plugin creates a COM object named\n“Internet Explorer(Ver 1.0)” with an IWebBrowser2 interface. The Navigate method is called\nby the http_start command with the parameter, resulting in the Internet Explorer(Ver 1.0)\nobject navigating to the URL specified. The Busy method is then used by the malicious\nprogram which waits until the request is completed.\n\n**Figure 12-1. Creating a COM object**\n\n**Figure 12-2. Pointer to CLSID**\n\n**Figure 12-3. Pointer to the interface ID**\n\n\n-----\n\n**Figure 13. Calling the Navigate method**\n\n**Figure 14. Calling the Busy method**\n\nUsing these steps, the malicious program imitates an ordinary user visiting a particular page.\nThe only difference is that, unlike a user, the malicious program makes many ‘visits’ to the\nsame address within a short period of time. Even if a redirecting gateway is used, the http\nrequest is redirected to the protected server hosting web resources, thus creating a\nsignificant load on the server.\n\n## General commands\n\nIn addition to downloading plug-ins and executing plug-in commands, Black Energy 2\n‘understands’ a number of general commands that can be sent by the C&C server:\n\nrexec – download and execute a remote file;\n\nlexec – execute a local file on the infected computer;\n\ndie – terminate bot execution;\n\nupd – update the bot;\n\nsetfreq – set the frequency with which the bot will contact the C&C server;\n\nhttp – send http request to the specified web page.\n\n## Conclusion\n\nInitially, the Black Energy bot was created with the aim of conducting DDoS attacks, but with\nthe implementation of plugins in the bot’s second version, the potential of this malware family\nhas become virtually unlimited. (However, so far cybercriminals have mostly used it as a\nDDoS tool). Plugins can be installed, e.g. to send spam, grab user credentials, set up a\nproxy server etc. The upd command can be used to update the bot, e.g. with a version that\n\n\n-----\n\nhas been encrypted using a different encryption method. Regular updates make it possible\nfor the bot to evade a number of antivirus products, any of which might be installed on the\ninfected computer, for a long time.\n\nThis malicious tool has high potential, which naturally makes it quite a threat. Luckily, since\nthere are no publicly available constructors online which can be used online to build Black\nEnergy 2 bots, there are fewer variants of this malware than say, ZeuS or the first version of\nBlack Energy. However, the data we have shows that cybercriminals have already used\nBlack Energy 2 to construct large botnets, and these have already been involved in\nsuccessful DDoS attacks.\n\nIt is difficult to predict how botnet masters will use their botnets in the future. It’s not hard for\nmalware writers to create a plug-in and get it downloaded to infected user machines.\nFurthermore, any plug-in code is only present in an infected computer’s memory; in all other\ninstances the malicious modules are encrypted, whether this is during transmission or when\nstored on a hard drive.\n\nIn addition, Black Energy 2 plugins are not executable (.exe) files. Plugins are loaded directly\nonto an infected machine, which means that they will not be distributed using mass\npropagation techniques and antivirus vendors may not come across new plugins for\nextended periods of time. However, it is the plug-ins that ultimately meet the cybercriminals’\ngoal, i.e. delivering the malicious payload which is the ultimate aim of infecting victim\nmachines with the Black Energy 2 bot.\n\nConsequently, it’s essential to track the plug-ins. Kaspersky Lab monitors which Black\nEnergy 2 plugins are available for download to track the evolution of this malicious program.\nWe’ll keep you posted.\n\n[APT](https://securelist.com/tag/apt/)\n[BlackEnergy](https://securelist.com/tag/blackenergy/)\n[Botnets](https://securelist.com/tag/botnets/)\n[DDoS-attacks](https://securelist.com/tag/dos-attacks/)\n[Scada](https://securelist.com/tag/scada/)\n[Wiper](https://securelist.com/tag/wiper/)\n\nAuthors\n\n[Dmitry Tarakanov](https://securelist.com/author/dmitryt/)\n\nBlack DDoS\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2010/2010-07-15 - Black DDoS.pdf"
    ],
    "report_names": [
        "2010-07-15 - Black DDoS.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535584,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653774366,
    "ts_modification_date": 1653774366,
    "files": {
        "pdf": "https://archive.orkl.eu/2a75477c48d4e3e631a5dadf368dd9ff2a90b09f.pdf",
        "text": "https://archive.orkl.eu/2a75477c48d4e3e631a5dadf368dd9ff2a90b09f.txt",
        "img": "https://archive.orkl.eu/2a75477c48d4e3e631a5dadf368dd9ff2a90b09f.jpg"
    }
}