{
    "id": "850d059d-20a2-4080-bc12-bc3d907d49a1",
    "created_at": "2023-01-12T14:59:04.850725Z",
    "updated_at": "2025-03-27T02:09:44.499449Z",
    "deleted_at": null,
    "sha1_hash": "9f9247ed70b8059d5ebd05447a37222130aadfaf",
    "title": "2020-10-29 - DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread",
    "authors": "",
    "file_creation_date": "2022-05-28T15:56:30Z",
    "file_modification_date": "2022-05-28T15:56:30Z",
    "file_size": 1778754,
    "plain_text": "# DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread\n\n**[blog.talosintelligence.com/2020/10/donot-firestarter.html](https://blog.talosintelligence.com/2020/10/donot-firestarter.html)**\n\nBy [Warren Mercer,](https://twitter.com/securitybeard) [Paul Rascagneres and](https://twitter.com/r00tbsd) [Vitor Ventura.](https://twitter.com/_vventura)\n\nThe newly discovered Firestarter malware uses Google Firebase Cloud Messaging to\nnotify its authors of the final payload location.\n\n\n-----\n\nEven if the command and control (C2) is taken down, the DoNot team can still redirect\nthe malware to another C2 using Google infrastructure.\nThe approach in the final payload upload denotes a highly personalized targeting\npolicy.\n\n**What's new? The DoNot APT group is making strides to experiment with new methods of**\ndelivery for their payloads. They are using a legitimate service within Google's infrastructure\nwhich makes it harder for detection across a users network.\n\n**How did it work? Users are lured to install a malicious app on their mobile device. This**\nmalicious app then contains additional malicious code which attempts to download a payload\nbased on information obtained from the compromised device. This ensures only very specific\ndevices are delivered the malicious payload.\n\n**So what? Innovation across APT Groups is not unheard of and this shouldn't come as a**\nhuge surprise that a group continues to modify their operations to ensure they are as stealth\nas can be. This should be another warning sign to folks in geo-politically \"hot\" regions that it\nis entirely possible that you can become a victim of a highly motivated group.\n\n## Executive Summary\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/kLlOlveVKtU\n\nThe DoNot team is known for targeting Kashmiri non-profit organizations and Pakistani\ngovernment officials. The region of Kashmir is under ongoing disputes from India, China and\nPakistan about its ownership. This fuels potential conflict at times. This actor, DoNot, recently\nstarted using a new malware loader we're calling \"Firestarter.\" Our research revealed that\nDoNot has been experimenting with new techniques to keep a foothold on their victim\nmachines. These experiments, substantiated in the Firestarter loader, are a sign of how\ndetermined they are to keep their operations despite being exposed, which makes them a\nparticularly dangerous actor operating in the espionage area. The same experiments also\nshowed the capability of keeping their operations stealthy as now they have the capability to\ndecide which infections receive the final payload based on geographical and personal\nidentification criteria. This reduces the likelihood that researchers will access it.\n\nDoNot is now leveraging Google Firebase Cloud Messaging (Google FCM) as a mandatory\ncommunication channel with the malware. This communication channel is encrypted and\nmixed among other communications performed by Android Operating System with the\nGoogle infrastructure, DoNot team is hiding part of their traffic among legitimate traffic. Even\nthough the malicious actors still need a command and control (C2) infrastructure, the\nhardcoded one is only needed at installation time, afterwards it can be discarded and easily\nreplaced by another one. Thus, if their C2 is taken down by law enforcement or deemed\nmalicious they can still access the victim's device and instruct it to contact a new C2. With\nthis new tactic only Google has the capability to effectively stop the malware, since it's the\nonly institution that could disable the Google FMC mechanism on the victim's device.\n\nWe believe the propagation is most likely done via direct messages luring the victims to\ninstall the malware Organizations and individuals can protect themselves by preventing the\n\n\n-----\n\ninstallation of software from unknown sources on Android and, if possible, by detecting the\ninitial network flow done to the C2.\n\n## Victimology\n\nThe DoNot Team is already known to have an interest in India and Pakistan. The filename of\nthe few Android applications show the same interest, for example: kashmir_sample.apk or\nKashmir_Voice_v4.8.apk. This new campaign points to the same victimology as usual: India,\nPakistan and the Kashmir crisis.\n\nThe targets are mainly end users and non-profit organizations linked to this area of the world.\n\n## Loader flow\n\nThe first execution of the loader provides a lure to make the victim believe that there was no\nmalicious install. The sequence below shows what a user sees during the first execution.\n\n\n-----\n\nOnce the message of uninstallation is shown, the icon is removed from the user interface.\nThe only way to detect the application is by checking the application list. There, the user\nsees an icon for the application that seems to be disabled, as can be seen below.\n\nIf the user checks the permissions, it can see that they exist but with the name \"System\nService,\" which is made to deceive the user into thinking that it's seeing system related\npermissions and not the application permissions.\n\nWhile the user is presented with the messages regarding the incompatibility, the malware\nmakes the first contact with the C2. It will send information regarding the victim's identity and\ngeolocation, both crucial for the next steps the operators will perform. The full flow consists\nof six steps before the malware starts receiving commands from the C2 as shown below.\n\n\n-----\n\nAfter getting the Google FMC token (Step 1) the operators have everything they need to\nsend the Google FMC message containing the URL for the malware to download the\npayload. They also have the geographic location, IP address, IMEI and email address from\nthe victims, allowing them to decide which victims should receive the payload.\n\nUsing static analysis, followed the code execution to the point of confirming the role played\nby the Google FMC mechanism used within this loader, we decided that we should test it\ndynamically.\n\nWhen the malware receives a message from Google FMC, it checks if it contains a key\ncalled \"link.\" If that exists, it will check if it starts with \"https,\" if everything checks out, it will\nuse the link to download the payload from a hosting server. Once the file arrives, the\nmalware will import the classes from the payload, and being now able to start the malicious\nservice, which is declared on the manifest\n\n, as you can see in the picture below.\n\n\n-----\n\nThis is a different malware sample, which contains the embedded payload and starts the\nmalicious service.\n\nOnce the payload is on the victim device, the loader will load the classes and start the\nmalicious service. If the device is rebooted, the loader will automatically check for the\npresence of the payload on the device, and load it if present.\n\n## Instrumenting the malware\n\nWe patched the malware sample to allow us to control the messaging flows, and then we\ncan confirm what we already established statically. The first step was the creation of a\nGoogle Firebase project associated with one of our accounts — the entry level for this\nservice is free, and conceivably anyone could do it. Once we had our project created, we\ndefined an application with the exact same name as our malware sample. In this case, it was\ncalled \"com.chatlitesocial.app.\" This generated a JSON Google Services configuration file,\nlike the one below, which a developer should add to his project in order to use the services.\n\n\n-----\n\nNow that we have the IDs, we need to add them to the malware. We unpacked the malware\nand searched for the Google Services configuration, which we found in the resources\ndirectory in the strings.xml file. The image below shows the entries that we replaced by the\nvalues we got from the JSON configuration file.\n\nFinally, we rebuilt the APK, signed it and installed it into our test device. Then we set up a\ntest environment that consisted of an HTTPS web server to log the malware request, a\nlogcat to see the malware log messages and a script that interacts with Google Firebase\nCloud Messaging Admin APIs to send the message to our victim.\n\n## Why a new loader?\n\n### Better control of the compromised devices even if the C2 is switched off\n\nThis new loader provides at least two important features to the attackers. First, it allows them\nto decide who receives the payload, being able to verify the victim before sending the\npayload. Thus, they can prevent the payload from falling into researchers' or law\nenforcement's hands. Second, it provides them with a powerful off-band persistence\nmechanism.\n\nUsually, taking a C2 down is enough to render a malware inert, even if it stays active on the\nvictim's device. This can be done by law enforcement or by the hosting platforms when they\nbecome aware. However, it can be difficult to notify the victims, and in some cases it's almost\nimpossible. Using Google Firebase Messaging service as a C2 control channel allows the\nattackers to regain control of the malware even after the C2 is taken down. From the\nnetwork's point-of-view, this action is completely innocuous, since all communication is done\nthrough Google and encrypted using legitimate certificates.\n\nIf a C2 server is down, the operator can push a new Google Firebase message to download\na new payload from a new location, which can be a new C2 or a hosting location. This action\nis entirely hidden for the compromised devices, requiring no user interaction. During our\nresearch, we found that other versions of the same malware existed using Google Firebase\nas an alternative communication channel. Earlier versions, however, would simply issue a\ncommand to start the malicious service.\n\n\n-----\n\n### No final payload for the analysts\n\nAs the final payload is not embedded in the Android application, it is impossible for analysts\nto dissect it. This approach also makes detection more difficult. The application is a loader\nwith a fake user interface that manipulates the target after installing it. As we explained\nabove, the malware needs to contact the C2 before the operator uses Google Firebase to\ncontact the malware. It is interesting to notice that the C2 url is not obfuscated, however the\nGoogle Firebase component is not so obvious. The code snippet below is responsible for\ndownloading the payload.\n\nOn the second line the authors set the HTTP method to GET, this is not necessary since\nGET is the default. Then, the actors change the method to POST by calling\nsetDoOutput(True). Without setting any data to be sent, the authors issue the connect()\nmethod to contact the C2. We believe that this was done on purpose to make analysis more\ndifficult. First, there was no need to set the method to GET, and then it was changed to\nPOST without using the correct method. Finally for this approach to work, the operators had\nto configure the payload hosting server to accept POST without data. This would have\nrequired interaction from the attackers configuration perspective, as this is not a default\nmethod.\n\n### Same final payloads than previously without additional work\n\nThe loader is design to load a class named: \"com.system.myapplication.Activities.dcteat\"\n\nThis name is the same as previous samples from the same group. Thanks to this choice, this\nloader can load any previous APK from this threat actor. It does not need additional cost for\nthe attacker and the previous malware can be used transparently with this loader.\n\n\n-----\n\n## DoNot's mobile framework\n\nWe identified a new loader developed by DoNot Team APT. This threat actor is known to\n[develop and use Android malware. Here is an example of analysis by RiskIQ. The malware](https://staging.community.riskiq.com/article/6f60db72)\ndeveloped by DoNot Team takes control of the compromised devices. It supports all the\nclassic features of a spying framework:\n\nGet the call history\nGet the address book\nGet the SMS\nKeyboard input\nGet files from the SD card\nGet user information\nGet network information\nGet location of the device\nGet installed applications\nGet browser information\nGet calendar information\nGet WhatsApp information\n\nThe new loader is 100 percent compatible with the standard malware used by DoNot Team.\nThis loader makes analysis more difficult by dynamically downloading and loading the final\npayload and to make the malware more reliable by using the Google Firebase messaging\nframework. This framework is used to send messages on the compromised devices with an\nURL where the final payload is located. With the new loading blocking the C2 server is not\nenough, if the Firebase messaging is still active, the loader can download a new payload\nfrom a new C2 server.\n\n## Conclusion\n\nThreat actors continue to innovate their operations. The DoNot team has actively avoided\ntraditional methods of various components throughout this new piece of malware. They\nattempted to evade and masquerade by using Google platforms, they used different\nconfiguration options to allow specially created features for their web server infrastructure\nand they ensured they had backward compatibility with previous versions of their malware.\nWe assess that this is a team that has the ability to fund ongoing features to be built into their\nAndroid arsenal. The DoNot team continues to focus on India and Pakistan, and this\nmalware further enforces that. The included fallback mechanisms ensure their malware\n\n\n-----\n\nremains persistent on the infected devices. This is crucial to ensuring long term access to\ncompromised victims. This, along with their selective delivery mechanism, suggests their\npreference is to remain under the radar and remain undetected for long periods of time to\nallow sufficient intelligence and espionage gathering to take place.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors. Exploit Prevention present within AMP is designed to\nprotect customers from unknown attacks such as this automatically.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), Cisco ISR, and Meraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n\n-----\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org. Snort rules 56081 specifically defend](https://www.snort.org/products)\nagainst Firestarter.\n\n## IOCs\n\n Hashes\n\nb4c112d402c2555bea91d5c03763cfed87aa0fb0122558554c9a3bc7ac345990\n\n69f257092947e003465f24b9b0b44d489e798bd5b8cf51f7e84bc161937b2e7c\n\na5cfb2de4ca0f27b012cb9ae56ceacc2351c9b9f16418406edee5e45d1834650\n\nd0a597a24f9951a5d2e7cc71702d01f63ff2b914a9585dbab5a77c69af5d60b5\n\ne7a24751bc009bbd917df71fd4815d1483f52669e8791c95de2f44871c36f7f4\n\n86194d9cb948d61da919e238c48a01694c92836a89c6108730f5684129830541\n\n8770515a5e974a59f023c4c71b0c772299578f1e386f60f9dd203b64e2e2d92e\n\na074aa746a420a79a38e27b766d122e8340f81221fe011f644d84ff9b511f29a\n\n3d3f61d5406149fd8f2c018fbc842ccef2f645fc22f4e5702368131c1bd4e560\n\n3d40fdc4dc550394884f0b4e38aa8a448f91f8e935c1b51fedc4b71394fa2366\n\n83d174c65f1c301164683c163dab3ea79d56caeda1a4379a5a055723e1cb9d00\n\n0c2494c03f07f891c67bb31390c12c84b0bb5eea132821c0873db7a87f27ccef\n\nb583ae22c9022fb71b06ec1bae58d0d40338432b47d5733bf550972c5cb627c4\nc4971a65af3693896fdbb02f460848b354251b28067873c043366593b8dbc6f9\n\nfa85813a90a2d0b3fc5708df2156381fdb168919b57e32f81249f8812b20e00a\n\nfde7ca904d9ae72ea7e242ee31f7fbaee963937341ca2863d483300828a4c6e0\n0c2494c03f07f891c67bb31390c12c84b0bb5eea132821c0873db7a87f27ccef\n192f699e6ce2cccb2c78397392f4d85566892d9c8cf7de1175feb4d58f97d815\n\ne8605854c8730d2e80d8a5edd8bc83eb7c397a700255754ec9140b9717f7d467\n2481f133dd3594cbf18859b72faa391a4b34fd5b4261b26383242c756489bf07\n\n0c2494c03f07f891c67bb31390c12c84b0bb5eea132821c0873db7a87f27ccef\n\n### Domains and IP addresses\n\n178.62.188[.]181\n\nbulk[.]fun\n\ninapturst[.]top\n\nseahome[.]top\n\n\n-----\n\nfif0[.]top\napkv6.endurecif[.]top\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-29 - DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread.pdf"
    ],
    "report_names": [
        "2020-10-29 - DoNot’s Firestarter abuses Google Firebase Cloud Messaging to spread.pdf"
    ],
    "threat_actors": [
        {
            "id": "2ac63ef4-a7b8-4a30-96ad-b30ccb2073fc",
            "created_at": "2022-10-25T16:07:23.546262Z",
            "updated_at": "2025-03-27T02:02:09.856624Z",
            "deleted_at": null,
            "main_name": "Donot Team",
            "aliases": [
                "APT-C-35",
                "SectorE02"
            ],
            "source_name": "ETDA:Donot Team",
            "tools": [
                "BackConfig",
                "EHDevel",
                "Jaca",
                "yty"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd350b-de30-4d29-bbee-28159f26c8c2",
            "created_at": "2023-01-06T13:46:38.433736Z",
            "updated_at": "2025-03-27T02:00:02.832565Z",
            "deleted_at": null,
            "main_name": "VICEROY TIGER",
            "aliases": [
                "OPERATION HANGOVER",
                "Donot Team",
                "APT-C-35",
                "SectorE02",
                "Orange Kala"
            ],
            "source_name": "MISPGALAXY:VICEROY TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535544,
    "ts_updated_at": 1743041384,
    "ts_creation_date": 1653753390,
    "ts_modification_date": 1653753390,
    "files": {
        "pdf": "https://archive.orkl.eu/9f9247ed70b8059d5ebd05447a37222130aadfaf.pdf",
        "text": "https://archive.orkl.eu/9f9247ed70b8059d5ebd05447a37222130aadfaf.txt",
        "img": "https://archive.orkl.eu/9f9247ed70b8059d5ebd05447a37222130aadfaf.jpg"
    }
}