{
    "id": "850d2ab1-0f0b-43bc-bece-f9e969cce9a2",
    "created_at": "2023-01-12T15:04:57.214168Z",
    "updated_at": "2025-03-27T02:05:46.518384Z",
    "deleted_at": null,
    "sha1_hash": "7a95de595f91f288aec68441e3ad3a308821b7fb",
    "title": "2021-02-05 - Microsoft warns of increasing OAuth Office 365 phishing attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T01:24:58Z",
    "file_modification_date": "2022-05-28T01:24:58Z",
    "file_size": 533796,
    "plain_text": "# Microsoft warns of increasing OAuth Office 365 phishing attacks\n\n**[bleepingcomputer.com/news/security/microsoft-warns-of-increasing-oauth-office-365-phishing-attacks/](https://www.bleepingcomputer.com/news/security/microsoft-warns-of-increasing-oauth-office-365-phishing-attacks/)**\n\nSergiu Gatlan\n\nBy\n[Sergiu Gatlan](https://www.bleepingcomputer.com/author/sergiu-gatlan/)\n\nFebruary 5, 2021\n12:07 PM\n0\n\nMicrosoft has warned of an increasing number of consent phishing (aka OAuth phishing)\nattacks targeting remote workers during recent months, BleepingComputer has learned.\n\nThese attacks were part of two campaigns that ran between September and December\n2020, targeting victims in multiple recurring waves.\n\nOne of the two attack campaigns specifically targeted Spanish speaking victims with OAuth\nlinks and lures impersonating Mexico's tax administration service — Servicio de\nAdministración Tributaria (SAT) — on two occasions, in September and October.\n\nThe phishing activity of the second spiked multiple times between October and December,\nspewing financial lures targeting organizations' \"investment teams.\"\n\n\n-----\n\nThreat actors behind these attacks abused cloud service providers or used\npreviously compromised domains to deliver their phishing emails. The OAuth URLs\nredirected the potential victims to attacker-owned domains for displaying the authentication\nrequest.\n\nMicrosoft issued this warning in a private security advisory shared with Microsoft Defender\nATP subscribers in late-January.\n\n**OAuth phishing attack flow (Microsoft)**\n\n## What is consent phishing?\n\nConsent phishing (also known as OAuth phishing) is an application-based attack\nvariant where the attackers attempt to trick targets into providing malicious Office 365\nOAuth apps (web apps registered by the attackers with an OAuth 2.0 provider) with access\nto their Office 365 accounts.\n\nOnce victims grant the malicious apps permissions to their account's data, the threat actors\npounce on their access and refresh tokens.\n\nThey enable them to take over the targets' Microsoft accounts and make API calls through\nthe attacker-controlled malicious Office 365 OAuth app.\n\nThe compromised Office 365 accounts provide the attackers with access to victims' emails,\nfiles, contacts, as well as sensitive information and resources stored on corporate\nSharePoint document management/storage systems and/or OneDrive for Business cloud\nstorage spaces.\n\n\"Once victims clicked on the deceptive links, they were ultimately prompted to grant access\npermissions to a malicious web application (web app),\" Microsoft Corporate Vice President\nfor Customer Security & Trust Tom Burt explained.\n\n\n-----\n\nUnknown to the victim, these malicious web apps were controlled by the criminals, who,\nwith fraudulently obtained permission, could access the victim’s Microsoft Office 365\naccount.\"\n\nBleepingComputer reported on the inner-workings of a consent phishing attack in\nDecember 2019, showing how it makes it possible for attackers to hijack Office 365\naccounts.\n\n**Phishing email sample**\n\n**Office 365 OAuth app**\n\n## Consent phishing warnings\n\nMicrosoft warned of phishers' shift to new types of phishing tactics such as consent\nphishing in July 2020, adding to other, more conventional phishing vectors such as email\nphishing and credential theft attacks.\n\nAt the time, multiple phishing campaigns were launching consent phishing attacks against\nMicrosoft customers trying to take control of their accounts, stealing sensitive data, and\nlater using them to defraud organizations in Business Email Compromise (BEC) fraud\nschemes.\n\nMicrosoft took legal action and dismantled part of the attack infrastructure by taking down\nsix of the domains used to host malicious 365 OAuth apps used to hijack customers' Office\n365 accounts.\n\nAdditionally, the company identified and disabled malicious Office 365 OAuth apps to block\nusers from accessing them and getting their accounts hijacked.\n\n\n-----\n\nStarting with October 2020, Microsoft announced that Office 365 consent phishing\nprotections are generally available, including app consent policies and OAuth app publisher\nverification.\n\nLast year, the FBI also warned of BEC scammers abusing cloud email services such\nas Microsoft Office 365 and Google G Suite in Private Industry Notifications published\nin [March and in April.](https://www.bleepingcomputer.com/news/security/fbi-warns-of-bec-attacks-abusing-microsoft-office-365-google-g-suite/)\n\n## Defense measures\n\nMicrosoft customers can check if they have any user consent apps or services tied to their\n[accounts by going to their account's consent manager dashboard.](https://account.live.com/consent/Manage)\n\nTo remove any of the listed consents, you have to click on its entry and, on the page that\nopens, click on the 'Remove these permissions' button to remove it.\n\nOrganizations can also take measures to protect their remote workforce from OAuth\n[phishing by requiring the use of publisher verified apps, educating employees on how to](https://docs.microsoft.com/en-us/azure/active-directory/develop/publisher-verification-overview)\nspot consent phishing tactics, and only allow access to OAuth apps trusted by the\norganization or provided by verified publishers.\n\nEmployers can also educate workers on how Microsoft permissions and the consent\nframework work:\n\n- Understand the data and permissions an application is asking for and understand how\n[permissions and consent work within our platform.](https://docs.microsoft.com/en-us/azure/active-directory/develop/v2-permissions-and-consent)\n\n[• Ensure administrators know how to manage and evaluate consent requests.](https://docs.microsoft.com/en-us/azure/active-directory/manage-apps/manage-consent-requests)\n\n- [Audit apps and consented permissions in your organization to ensure applications being](https://docs.microsoft.com/en-us/azure/security/fundamentals/steps-secure-identity#audit-apps-and-consented-permissions)\nused are accessing only the data they need and adhering to the principles of least privilege.\n\nMore details on how to defend against security threats can be found in Microsoft's Detect\nand Remediate Illicit Consent Grants in Office 365 and Five steps to securing your identity\ninfrastructure support docs.\n\n\n-----\n\n### Related Articles:\n\n[Intuit warns of QuickBooks phishing threatening to suspend accounts](https://www.bleepingcomputer.com/news/security/intuit-warns-of-quickbooks-phishing-threatening-to-suspend-accounts/)\n\n[GitHub: Attacker breached dozens of orgs using stolen OAuth tokens](https://www.bleepingcomputer.com/news/security/github-attacker-breached-dozens-of-orgs-using-stolen-oauth-tokens/)\n\n[Google: Russian phishing attacks target NATO, European military](https://www.bleepingcomputer.com/news/security/google-russian-phishing-attacks-target-nato-european-military/)\n\n[FBI warns election officials of credential phishing attacks](https://www.bleepingcomputer.com/news/security/fbi-warns-election-officials-of-credential-phishing-attacks/)\n\n[Tails 5.0 Linux users warned against using it \"for sensitive information\"](https://www.bleepingcomputer.com/news/security/tails-50-linux-users-warned-against-using-it-for-sensitive-information/)\n\n[OAuth](https://www.bleepingcomputer.com/tag/oauth/)\n[Office 365](https://www.bleepingcomputer.com/tag/office-365/)\n[Phishing](https://www.bleepingcomputer.com/tag/phishing/)\n[Warning](https://www.bleepingcomputer.com/tag/warning/)\n\n[Sergiu Gatlan](https://www.bleepingcomputer.com/author/sergiu-gatlan/)\n\nSergiu Gatlan is a reporter who covered cybersecurity, technology, Apple, Google, and a\nfew other topics at Softpedia for more than a decade. Email or Twitter DMs for tips.\n\n[Previous Article](https://www.bleepingcomputer.com/offer/deals/expand-your-cloud-computing-skills-with-this-nine-course-bundle/)\n[Next Article](https://www.bleepingcomputer.com/news/security/sitepoint-discloses-data-breach-after-stolen-info-used-in-attacks/)\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-05 - Microsoft warns of increasing OAuth Office 365 phishing attacks.pdf"
    ],
    "report_names": [
        "2021-02-05 - Microsoft warns of increasing OAuth Office 365 phishing attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535897,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653701098,
    "ts_modification_date": 1653701098,
    "files": {
        "pdf": "https://archive.orkl.eu/7a95de595f91f288aec68441e3ad3a308821b7fb.pdf",
        "text": "https://archive.orkl.eu/7a95de595f91f288aec68441e3ad3a308821b7fb.txt",
        "img": "https://archive.orkl.eu/7a95de595f91f288aec68441e3ad3a308821b7fb.jpg"
    }
}