{
    "id": "85486b37-5e92-4f48-b894-d2d14dc922ee",
    "created_at": "2023-01-12T15:04:30.164019Z",
    "updated_at": "2025-03-27T02:06:09.656569Z",
    "deleted_at": null,
    "sha1_hash": "c6085acef654d99b129669ac0da3fcb593551e96",
    "title": "2020-10-20 - An update on disruption of Trickbot",
    "authors": "",
    "file_creation_date": "2022-05-27T22:05:45Z",
    "file_modification_date": "2022-05-27T22:05:45Z",
    "file_size": 199317,
    "plain_text": "# An update on disruption of Trickbot\n\n**[blogs.microsoft.com/on-the-issues/2020/10/20/trickbot-ransomware-disruption-update/](https://blogs.microsoft.com/on-the-issues/2020/10/20/trickbot-ransomware-disruption-update/)**\n\nOctober 20, 2020\n\nLast week, [we announced a disruption targeting the botnet Trickbot. Trickbot is a network of](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)\nservers and infected devices run by criminals responsible for a wide range of nefarious\nactivity including the distribution of ransomware which can lock up computer systems. Our\ndisruption is intended to disable Trickbot’s infrastructure and make it difficult for its operators\nto enable ransomware attacks, which have been identified as one of the biggest threats to\nthe upcoming U.S. elections. We’ve had many requests for updates on the operation, so I’d\nlike to share more on how it’s going.\n\nAs of October 18, we’ve worked with partners around the world to eliminate 94% of Trickbot’s\ncritical operational infrastructure including both the command-and-control servers in use at\nthe time our action began and new infrastructure Trickbot has attempted to bring online.\n\nHere’s how the numbers break down. We initially identified 69 servers around the world that\nwere core to Trickbot’s operations, and we disabled 62 of them. The seven remaining\nservers are not traditional command-and-control servers but rather internet of things (IoT)\ndevices Trickbot infected and was using as part of its server infrastructure; these are in the\nprocess of being disabled. As expected, the criminals operating Trickbot scrambled to\nreplace the infrastructure we initially disabled. We tracked this activity closely and identified\n59 new servers they attempted to add to their infrastructure. We’ve now disabled all but one\n\n\n-----\n\nof these new servers. In sum, from the time we began our operation until October 18, we\nhave taken down 120 of the 128 servers we identified as Trickbot infrastructure around the\nworld.\n\nTo be clear, these numbers will change regularly as we expect action we’ve already taken\nwill continue to impact the remaining infrastructure and as we and others continue to take\nnew action between now and the election. This is challenging work, and there is not always a\nstraight line to success. At the same time, we’re pleased with our progress and for several\nreasons I’m optimistic about the outcomes we can achieve.\n\nFirst, Microsoft and our partners are trying to take a persistent and layered approach to\naddressing Trickbot’s operations around the world. This is necessary due to the unique\narchitecture of the Trickbot botnet, and the creativity and persistence of the criminals\noperating it. Since the initial court order we obtained, we’ve gone back to court and secured\nsubsequent orders to take down the newly activated infrastructure. We will continue to do\nthis between now and election day on November 3. Additionally, our partners and the hosting\nproviders we work with – who have been crucial to our progress – have been sharing\ninformation that has uncovered more command-and-control servers. As we continue to cut\noff these new servers, our partners are also working to clean and remediate the\ncompromised IoT devices, especially routers, that the Trickbot operators are using as nontraditional command-and-control infrastructure. These compromised routers pose a unique\nchallenge for the internet service providers (ISPs) as they must simultaneously work to\nremediate devices while keeping legitimate traffic uninterrupted, and this delicate work is\nunderway. Finally, we’re working with ISPs and others to also clean devices in people’s\nhomes and businesses that might be infected.\n\nSecond, this work has always been about disrupting Trickbot’s operations during peak\nelection activity – doing what we can to take action at a critical time – and we’re encouraged\nby what we’re seeing. Anytime a botnet’s server infrastructure is eliminated, the attempt to\nrebuild is not as simple as setting up new servers. New servers need to be provisioned to\nbegin talking with the botnet’s infected devices and issuing commands, all of which takes\ntime. We have identified new Trickbot servers, located their respective hosting provider,\ndetermined the proper legal methodology to take action, and completely disabled those\nservers in less than three hours. Our global coordination has allowed a provider to take quick\naction as soon as we notify them – in one case, in less than six minutes. What we’re seeing\nsuggests Trickbot’s main focus has become setting up new infrastructure, rather than\ninitiating fresh attacks, and it has had to turn elsewhere for operational help.\n\nIn fact, we and others have detected the Trickbot operators attempting to use a competing\ncriminal syndicate to drop what were previously Trickbot payloads. This is one of many signs\nthat suggests to us that, faced with its critical infrastructure under repeated attack, Trickbot\noperators are scrambling to find other ways to stay active. While an arrangement with other\nactors will not enable Trickbot to equal its homegrown capabilities, it’s also a reminder that\nthere are many threats to keeping cyberspace secure and it’s important for people –\n\n\n-----\n\nespecially those involved in the security of our electoral processes – to stay vigilant. It s also\n[why we offer those involved in the election tools such as AccountGuard,](https://www.microsoftaccountguard.com/en-us/) Microsoft 365 for\nCampaigns and [Election Security Advisors.](https://blogs.microsoft.com/on-the-issues/2020/04/02/defending-democracy-program-extended/)\n\nThird, we have the right team and the right groundwork in place to continue having impact in\nthe coming weeks. Our Digital Crimes Unit has spent years studying, documenting and\ncategorizing Trickbot’s infrastructure, identifying which command-and-controls are traditional\nservers and which are actually IoT devices. We believe we understand the right details about\nTrickbot’s infrastructure to focus our attention on the specific command-and-control servers\nthat allow for the greatest degree of disruption. Even more importantly, our network of global\npartners is monitoring Trickbot’s activities and sharing information around the clock. And we\nhave members of our Digital Crimes Unit around the world in direct contact with local ISPs\nand telecommunications companies.\n\nWe fully expect that Trickbot’s operators will continue looking for ways to stay operational,\nand we and our partners will continue to monitor them and take action. We encourage others\nin the security community who believe in protecting the elections to join the effort and share\ntheir intelligence directly with hosting providers and ISPs that can take Trickbot’s\ninfrastructure offline. As this work continues, it will be important to focus on the collective\nimpact to Trickbot’s capabilities between now and the election, rather than to focus on\npotentially misleading simplified snapshots from any single moment in time.\n\nTags: [cyberattacks,](https://blogs.microsoft.com/on-the-issues/tag/cyberattacks/) [cybersecurity,](https://blogs.microsoft.com/on-the-issues/tag/cybersecurity-2/) [Defending Democracy Program,](https://blogs.microsoft.com/on-the-issues/tag/defending-democracy-program/) [ElectionGuard,](https://blogs.microsoft.com/on-the-issues/tag/electionguard/) Microsoft\n365 for Campaigns, [Microsoft AccountGuard,](https://blogs.microsoft.com/on-the-issues/tag/microsoft-accountguard/) [ransomware,](https://blogs.microsoft.com/on-the-issues/tag/ransomware/) [trickbot](https://blogs.microsoft.com/on-the-issues/tag/trickbot/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-20 - An update on disruption of Trickbot.pdf"
    ],
    "report_names": [
        "2020-10-20 - An update on disruption of Trickbot.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535870,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1653689145,
    "ts_modification_date": 1653689145,
    "files": {
        "pdf": "https://archive.orkl.eu/c6085acef654d99b129669ac0da3fcb593551e96.pdf",
        "text": "https://archive.orkl.eu/c6085acef654d99b129669ac0da3fcb593551e96.txt",
        "img": "https://archive.orkl.eu/c6085acef654d99b129669ac0da3fcb593551e96.jpg"
    }
}