{
    "id": "85a70414-1ff0-48e8-9e63-26b618165a81",
    "created_at": "2023-01-12T15:04:10.536051Z",
    "updated_at": "2025-03-27T02:08:40.807634Z",
    "deleted_at": null,
    "sha1_hash": "e39f8d38adcfede24329475f9f4a682b34de40db",
    "title": "2022-10-31 - Orion Threat Alert- Qakbot TTPs Arsenal and the Black Basta Ransomware",
    "authors": "",
    "file_creation_date": "2022-11-28T19:04:51Z",
    "file_modification_date": "2022-11-28T19:04:51Z",
    "file_size": 9229470,
    "plain_text": "# Orion Threat Alert: Qakbot TTPs Arsenal and the Black Basta Ransomware\n\n**[cynet.com/blog/orion-threat-alert-qakbot-ttps-arsenal-and-the-black-basta-ransomware/](https://www.cynet.com/blog/orion-threat-alert-qakbot-ttps-arsenal-and-the-black-basta-ransomware/)**\n\n**Max Malyutin – Orion Threat Research Team Leader**\n\n\nOctober 31, 2022\n\n\n[This report covers the execution of the notorious Qakbot malware infection, with in-depth details about TTPs (Tactics,](https://attack.mitre.org/software/S0650/)\ntechniques, and procedures) and the Qakbot different functionalities.\n\n## Qakbot Executive Summary\n\nQakbot (also known as QBot, QuakBot, or Pinkslipbot) is a modular information stealer and banking trojan malware that\nhas been active for over a decade. Qakbot was discovered in the wild in 2007.\n\nThreat actors behind the malware are financially motivated cybercriminals. They steal financial data, banking\ncredentials, and web browser information from infected systems and compromise systems.\n\nOnce Qakbot threat actors succeed in infecting a system, they install a backdoor to grant access to ransomware\noperators, leading to double extortion attacks.\n\nQakbot’s main goals are:\n\nCollecting credentials and financial information\nInstalling a backdoor\nDropping additional malware (in most cases ransomware)\n\nQakbot has led to widespread infections and is known as one of the most dangerous malwares.\n\nQakbot has evolved in the last two years and has a wide range of capabilities such as installing persistence, evading\ndefenses, escalating privileges, and communicating with a Command and Control (C2). These capabilities allow it to\ncompromise the system without being detected by endpoint detection and response (EDR) vendors or antivirus (AV)\nsolutions.\n\n\n-----\n\nRecently (in the last three months), multiple Qakbot campaigns were seen in the wild.\n\nQakbot’s rapid change in its TTPs provides the ability to quickly spread and avoid defenses. The frequency of changing\nits TTPs makes it harder for security analysts and defenders to monitor and prevent Qakbot attacks.\n\n## Orion’s observations\n\nCynet Orion Threat Research team closely monitors Qakbot campaigns, TTPs, and attack methods. Since Microsoft\nchanged the default policy in their Office products by [disabling macros, threat actors changed their initial infection](https://learn.microsoft.com/en-us/deployoffice/security/internet-macros-blocked)\nmethods. Qakbot in the past used malicious documents (MalDocs) to infect the system but these days it uses different\nmethods.\n\n## Qakbot Infection Flow Summary\n\n[Qakbot’s initial infection distribution starts with a spam\\hijacked email that contains malicious HTML (HTML smuggling),](https://attack.mitre.org/techniques/T1566/)\nor password-protected ZIP. We have also observed malicious URL links as part of the malicious email. All of them lead\n[to an ISO image file (could also be VHD or IMG), which lures the victim to execute a malicious LNK file. After the LNK](https://attack.mitre.org/techniques/T1204/)\nexecution, the next infection step could be different due to the change in the TTPs.\n\n[Usually, Qakbot threat actors at this stage of the infection abuse legitimate binaries (LOLBins – Living Off the Land](https://lolbas-project.github.io/)\nBinaries) or capabilities of the Microsoft Windows operating system. Orion observed the following LOLBins (From June\n[2022 until today) that were recently used – CMD and](https://attack.mitre.org/techniques/T1059/003/) [WScript for script\\batch file execution,](https://attack.mitre.org/techniques/T1059/007/) [CURL for downloading](https://attack.mitre.org/techniques/T1105/)\nQakbot’s DLL, and [Regsvr32 or](https://attack.mitre.org/techniques/T1218/010/) [Rundll32 for Qakbot’s stager DLL execution.](https://attack.mitre.org/techniques/T1218/011/)\n\nIn the technical part of this report, we will cover different TTPs and explain each one.\n\n[Once Qakbot’s DLL is executed, a process injection is taking place. A new process is created and injected with Qakbot’s](https://attack.mitre.org/techniques/T1055/)\nDLL. After [Anti-VM and Anti-Analysis checks, the injected process installs its configuration in a registry key. A copy of](https://attack.mitre.org/techniques/T1497/)\n[the same DLL is dropped for persistence which is executed by the registry Run key. In the case of a high-privileged](https://attack.mitre.org/techniques/T1547/001/)\n[compromised user (Administrator), it will install persistence via a Scheduled Task.](https://attack.mitre.org/techniques/T1053/)\n\nOnce the threat actors set up persistence, the Qakbot-injected process communicates to multiple C2 servers. The C2\nservers wait for information about the compromised system, which leads to the execution of an automated series of\n[discovery commands that collect information about the system.](https://attack.mitre.org/tactics/TA0007/)\n\nThe injected process also extracts information from web browsers (Internet Explorer and Microsoft Edge) by abusing a\nbuilt-in utility, [esentutl binary. In addition, the C2 sends an info-stealing module that allows the injected process to](https://attack.mitre.org/software/S0404/)\naccess [web browser data and credentials.](https://attack.mitre.org/techniques/T1555/003/)\n\n[After Qakbot has all the information and sends it to the C2 server, the infection leads to Cobalt Strike or](https://attack.mitre.org/software/S0154/) [Brute Ratel.](https://bruteratel.com/)\nThese frameworks allow threat actors to control the compromised system and perform multiple actions such as\ncredential dumping, lateral movement, exfiltration, etc.\n\n[The final stage of the infection is a human-operated ransomware attack with](https://learn.microsoft.com/en-us/security/compass/human-operated-ransomware) [double extortion.](https://attack.mitre.org/techniques/T1486/)\n\nRansomware threat actors locate and secure access to high-value assets, exfiltrate sensitive data and execute\nransomware across the domain.\n\n## From spam email to ransomware infection: Breaking down Qakbot campaign TTPs\n\n### Initial Access, Execution, and Defense Evasion\n\nThe Qakbot campaign distribution method is through malicious spam (malspam) emails.\n\nHere are some examples below.\n\n\n-----\n\nA malicious email with an HTML file attachment\n\nThe HTML distribution is extremely popular in the recent Qakbot campaigns.\n\nThe victim opens the HTML attachment in their browser which leads to a fake local HTML site. Threat actors use\ndifferent fake sites which seem legitimate and lure the victim to keep executing (clicking) until the Qakbot infection starts.\nThe HTML fake site then downloads a password-protected ZIP archive.\n\nThreat actors use this technique – Obfuscated Files or Information: HTML Smuggling (MITRE ID: T1027.006) – to avoid\ndetection by smuggling a hidden ZIP file inside of an HTML file.\n\nA fake Google Drive site with a password and drops a ZIP file\n\n\n-----\n\nA fake Dropbox site with a password and drops a ZIP file\n\nA fake Acrobat site with a password and drop a ZIP file\n\nThe malicious HTML file contains JavaScript code and a Base64 encoded chunk that runs once the file opens. The\nJavaScript automatically saves the Base64 data (ZIP archive) to a local file.\n\n\n-----\n\nExamples of HTML smuggling file names:\n\nContract#[digits].html\nCancellation_[digits].html\nIN[digits].html\nComplianceReportCopy#[digits]4.html\nGrant#[digits].html\nREF#[digits]_ [month]_ [day].html\nContractCopy#[digits].html\nDocument#[digits](mmdd).html\n\n### Now we will cover some Qakbot infection flows and check which TTPs are being used.\n\nThe password-protected ZIP archive contains an ISO image. The password of the ZIP is presented in the HTML fake\nsite.\n\nExample of ISO files names:\n\nDetails[digits].iso\nContract_[digits].iso\nCancellation#[digits].iso\nComplianceReportCopy_[digits].iso\nGrant_[digits].iso\nA7[digits].iso\nDK[digits].iso\nVV[digits].iso\n\n\n-----\n\nUntil this point, the victim did exactly what the threat actors planned. The victim was first lured by a malicious spam\nemail and then downloaded an attachment, saved a ZIP file that contained an ISO file, and opened it.\n\nThe ISO contains an LNK file that has an icon of a directory or a document to lure the victim to double-click on it. In\naddition, there is a hidden folder that contains some payloads and the Qakbot DLL.\n\n\n-----\n\nThe LNK file serves as a shortcut to the cmd.exe command line that executes a batch script (.cmd) from the hidden\ndirectory.\n\nLNK file meta-data:\n\nLNK file properties and origin:\n\n\n-----\n\nIn the hidden directory there are four files (.txt, .cmd, .gif and .dat), the LNK file executes the .cmd file which contains the\nfollowing code:\n\n\n-----\n\nThe batch script has two batch commands set (lines 4 8) and call (line 10). The set command creates five\nenvironment variables and the “call” command executes an obfuscated command line with all the environment variables.\n\nNote: at line 8, the last set command the new environment variables contain the replace.exe binary that will be used to\ncopy regsvr32 to a different location to evade security products.\n\nThe “call” command executes the following:\n\nThe threat actors use a masquerading technique to avoid detections by placing the regsvr32.exe binary in a different\nlocation with the replace.exe Microsoft built-in utility.\n\nreplace C:\\Windows\\system32\\regsvr32.exe C:\\Users\\Admin\\AppData\\Local\\Temp /A\n\nThe /A parameter copies the new file to the requested directory instead of moving the existing file.\n\nThe %1 %2 %3 are the arguments that reside in the LNK command line. Their concatenation results in regsvr32.exe,\nwhich will be executed to load the Qakbot’s DLL. The Qakbot’s DLL in this case is the “volleyed.dat” file.\n\n\n-----\n\nThis is the execution flow after double-clicking the LNK file:\n\n**Another example of Qakbot infection uses different TTPs which will be described in the next section.**\n\nThis infection also starts with an LNK file execution.\n\nLNK meta-data:\n\nLNK file properties and origin:\n\n\n-----\n\nThe batch file (.cmd) also has “set” and “call” commands.\n\nThe interesting part is found in line 7 where an unknown executable is in the %temp% directory (C:\\Users\\\n{User}\\AppData\\Local\\Temp). At lines 4-6 the batch file sets environment variables. The concatenation of the\nenvironment variables values will result in regsvr32.exe which will be copied to the %temp% directory and renamed.\n\n\n-----\n\nThe Qakbot DLL that is executed by the masqueraded Regsvr32\n\nThe execution flow after double-clicking the LNK file:\n\nIn the last three months, Qakbot’s threat actors used unique TTPs for each campaign. We are monitoring Qakbot\ncampaigns closely and we observed unique infections flow each time:\n\n\n-----\n\nJune 2022: LNK > CMD & CURL > PING > Regsvr32\n\nExecution flow description: A LNK file executes a curl command to download a Qakbot DLL to\n\\\\AppData\\\\Roaming\\\\[RandomDir] for a compromised distribution URL, and finally executes the DLL with\nregsvr32.\n\nJuly 2022: LNK > CALC > Regsvr32\n\nExecution flow description: A LNK file executes a copy of calc.exe (stored in the ISO). The ISO also contains\ntwo DLL files, WindowsCodecs.dll, and a payload named [Random].dll to exploit a DLL hijacking. Finally,\nregsvr32 loads the Qakbot DLL.\n\nSeptember 2022: LNK > CURL & WSCRIPT > CMD > PING & Regsvr32\n\nExecution flow description: A LNK file executes curl to download a .js file to \\\\AppData\\\\Roaming\\\\\n\n[RandomDir]\\\\[RandomDir]. The JS script downloads the Qakbot DLL and executes it with Regsvr32.\n\n**Now that we have covered different Qakbot TTPs and infection flows, let’s focus on what happens after the**\n**Qakbot DLL is executed by regsvr32.exe.**\n\nQakbot DLL targets system processes for process injection (Process Hollowing). The targeted process will be chosen\nfrom a hardcoded list according to AV solutions that are running on the compromised system to evade them.\nCreateToolhelp32Snapshot, Process32Next, and Process32First APIs allow enumerating running processes on the\ncompromised system.\n\nThe target processes are:\n\n%SystemRoot%\\SysWOW64\\wermgr.exe (in the last campaigns the target process was:\n%SystemRoot%\\SysWOW64\\explorer.exe)\n%SystemRoot%\\SysWOW64\\mobsync.exe\n%SystemRoot%\\ SysWOW64\\msra.exe\n%SystemRoot%\\ SysWOW64\\OneDriveSetup.exe\n%ProgramFiles(x86)%\\Internet Explorer\\iexplore.exe\n\nWe observed a new process in the new Qakbot campaign: %SystemRoot%\\ SysWOW64\\dxdiag.exe thanks to\n[@Kostastsale from the DFIR Report Team.](https://twitter.com/Kostastsale/status/1585000374628659200?s=20&t=gn0msuX427pu6gFk6jpxUA)\n\n\n-----\n\nThese are the AV processes that were checked:\n\nkavtray.exe, avp.exe == Kaspersky\nbdagent.exe, vsserv.exe, vsservppl.exe == Bitdefender\nSavService.exe, SAVAdminService.exe == Sophos\ncoreServiceShell.exe, PccNTMon.exe, NTRTScan.exe == Trend Micro\nMsMpEng.exe == Windows Defender\nAvastSvc.exe == Avast\n\nThe process injection uses the following Windows APIs: CreateProcessW, WriteProcessMemory, and NtResumeThread.\n\n\n-----\n\nCreateProcessW API is used to start a new system process using the flag CREATE_SUSPENDED to create the\ntargeted process in suspended mode.\n\nAfter injecting the Qakbot DLL code with WriteProcessMemory, it finally resumes the injected process and its execution\nwith NtResumeThread.\n\n\n-----\n\nThe injected process (wermgr.exe) contains a newly allocated memory space found in 0x302000. The page has RWX\n(Read, Write, Execute) protection, and this page contains an MZ header of the injected Qakbot DLL.\n\n\n-----\n\nIn addition to the AV enumeration, Qakbot also checks if it is running on the Windows Defender sandbox. Qakbot\nchecks the existence of a subdirectory: “C:\\\\INTERNAL\\\\__empty.” If this folder exists, the Qakbot process terminates\nitself.\n\nDuring our analysis, we spotted that the unpacked Qakbot DLL was inside the injected process memory.\n\nThis unpacked Qakbot DLL has unique indicators:\n\nDLL internal name: fwpolicyiomgr.dll\nDLL export functions: DllRegisterServer, DllInstall\n\nHere is an older version of the Qakbot unpacked DLL from previous campaigns:\n\nDLL internal name: visualstudio_helper.dll\nDLL export function: DllRegisterServer\n\n\n-----\n\nAfter the injection, Qakbot stores the content of its DLL in memory, and it corrupts the image file (DLL) on the disk by\noverwriting it with junk data. This is done to interfere with forensics and analysis attempts:\n\nQakbot stores its configuration in a fileless manner by loading its configuration from its resource section and then storing\nits configuration in the registry, in HKCU\\\\Software\\\\Microsoft\\\\[RandomDir].\n\n\n-----\n\nTwo suspicious Qakbot resources\n\n## Persistence\n\nThe persistence mechanism of Qakbot is a registry Run key (HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run).\n\nFirst Qakbot creates a subdirectory with a random name under the %APPDATA%\\\\Microsoft\\\\ and drops a copy of\nQakbot’s DLL for the Run key persistence. The persistence mechanism triggers when the system shuts down or\nrestarts.\n\n\n-----\n\nDuring the system shutdown/restart the copy of the Qakbot DLL is dropped to “C:\\\\Users\\\\\n{User}\\\\AppData\\\\Roaming\\\\Microsoft\\\\Zadabakyje\\\\uboeuai.dll”:\n\nAnd a new value in the registry Run key is created. Registry value = KNBLORIAPI, the data type of the value is a\nREG_SZ and it contains the following data: regsvr32.exe “C:\\\\Users\\\\\n{User}\\\\AppData\\\\Roaming\\\\Microsoft\\\\Zadabakyje\\\\uboeuai.dll”:\n\nAt the reboot of the compromised system, the Run key is executed, and run the following command:\n\nHere’s another example of the persistence process:\n\n\n-----\n\nQakbot uses an anti-forensics technique by deleting and removing the persistence. On the system boot, the DLL file is\nremoved from the C:\\\\Users\\\\{User}\\\\AppData\\\\Roaming\\\\Microsoft\\\\{RandomDir}\\\\, and the run key value is removed\nfrom the registry key.\n\n## Discovery\n\nThe injected Qakbot process executes automated discovery commands with legitimate Microsoft Windows built-in\ncommand-line binaries.\n\nThese discovery commands collect information about the compromised system and send the information to the C2\nserver. This action serves the threat actors for mapping the system for lateral movement.\n\nnet view\n\nDescription: This command displays a list of domains, computers, or resources that are being shared by the\nspecified computer. Used without parameters, net view displays a list of computers in your current domain.\ncmd /c set\n\nDescription: This command displays the system environment variables.\narp -a\n\nDescription: This command displays entries in the ARP (Address Resolution Protocol) table.\nnslookup -querytype=ALL -timeout=12 _ldap._tcp.dc._msdcs.<domain_fqdn>\n\nDescription: This command displays SRV service location records specifically the domain controllers on the\ndomain.\nipconfig /all\n\nDescription: This command displays all current TCP/IP network configurations.\nnet share\n\nDescription: This command displays information about all the resources that are shared on the local\ncomputer.\nroute print\n\nDescription: This command displays the entries in the local IP routing table.\nnetstat -nao\n\nDescription: This command displays active TCP connections, ports on which the computer is listening,\nEthernet statistics, the IP routing table, IPv4 statistics\nnet localgroup\n\nDescription: This command displays the name of the server and the names of local groups on the computer\n\n\n-----\n\nwhoami /all\n\nDescription: This command displays user, group, and privileges information for the user who is currently\nlogged on to the local system.\n\n## Credential Access and Collection (Web-Browser)\n\nOne of the Qakbot capabilities is information stealing. It steals sensitive information from Internet Explorer and Microsoft\nEdge by executing the esentutl.exe command line:\n\nesentutl.exe /r V01 /l”C:\\\\Users\\\\{User}\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache” /s”C:\\\\Users\\\\\n{User}\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache” /d”C:\\\\Users\\\\\n{User}\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\WebCache”\n\nThe injected Qakbot process performed the Web-Browser collection by receiving from the C2 server a cookie grabber\nmodule that allows it to access web-browsers credentials and data. This data is stored on the disk:\n\nThe cookie-stealing module contains the following strings:\n\n\n-----\n\nThe credential stealing and keylogging module contains the following strings:\n\n\n-----\n\n-----\n\n## Qakbot botnet; Command and Control\n\nQakbot injected process communicates (over HTTPS POST request with the victim fingerprinting data) with the C2\nservers. Their IP addresses are stored in a hardcoded list in the configuration that resides in the registry.\n\nOnce the Qakbot communication is established, the C2 will send additional modules to the injected Qakbot process.\n\nThe following fingerprinting data is sent to the C2 server:\n\nOS information\nCPU information\nComputer name\nUsername\nAD Domain\nRunning processes\n\nIn addition, all the discovery outputs are also sent to the C2 server.\n\nThe Qakbot botnet IDs: Obama, BB, etc., are located inside the injected process memory. Here’s an example from an\ninjected Explorer.exe process:\n\n\n-----\n\nAnother example of the C2 connection data from the injected process memory. The “POST /t5 HTTP/1.1” (“POST /t4\nHTTP/1.1” in previous campaigns) is indicative of the Qakbot C2 server HTTP request:\n\nThe C2 server (41[.]111[.]118[.]56) detections by VirusTotal:\n\n\n-----\n\n[Here’s a list of active Qakbot C2 servers could be monitored via https://feodotracker.abuse.ch/browse/qakbot/.](https://feodotracker.abuse.ch/browse/qakbot/)\n\n## Cobalt Strike Infection\n\nAfter all the above actions (defense evasion, discovery, credential access, collection, and the C2 communication) we\nsaw that in one of our incident responses (IR) that the Qakbot infection leads to a Cobalt Strike.\n\nThe Qakbot injected process (in the IR case: OneDriveSetup.exe) injected into a different process – a Cobalt Strike DLL\nbeacon – 45 minutes after the initial infection. The injection created a new remote thread in the targeted Rundll32.exe\nprocess. The MZAR header (reflective loader):\n\nIn addition, the Cobalt Strike beacon was injected into the “C:\\\\Windows\\\\system32\\\\svchost.exe -k UnistackSvcGroup”\nprocess which executes another instance of rundll32.exe:\n\nOne of the actions that the threat actors executed is a fileless .NET Mimikatz. This is the Mimikatz executed inside the\ninjected process (rundll32.exe) memory:\n\n\n-----\n\nMimikatz functionality allows the threat actors to dump passwords and NTLM hashes from memory, collect Kerberos\ntickets and run “Pass the Hash.” With this functionality, the threat actors perform lateral movement and privilege\nescalation.\n\n## Human-operated ransomware\n\nWe observed that at this point of the infection (Cobalt Strike execution), the attack switched to Human-operated\nransomware. It is an active attack performed by ransomware cybercriminals with a “hands-on keyboard.” Threat actors\ntake advantage of the domain to deploy ransomware.\n\nWe have investigated several Qakbot infections and based on that, we have observed a collaboration with CONTI and\nBlack Basta ransomware groups.\n\nThis makes sense based on the Threat Intelligence reports that link these two ransomware groups (Black Basta is an\noffshoot of CONTI). Black Basta ransomware was first seen at the beginning of 2022.\n\nBlack Basta ransomware technical info:\n\nRansomware encryption algorithms: ChaCha20 and RSA-4096\nRansomware skips the following files/directories:\n\n$Recycle.Bin\nreadme.txt\nWindows\nreadme.txt\nRansomware extension: .basta\nRansomware note: readme.txt\nRansomware replaces the desktop wallpaper with your image\n\n\n-----\n\nRansomware inhibits system recovery commands:\n\nC:\\Windows\\SysNative\\vssadmin.exe delete shadows /all /quiet\ncmd.exe /c “C:\\Windows\\SysNative\\vssadmin.exe delete shadows /all /quiet”\nC:\\Windows\\SysNative\\bcdedit /set safeboot networkChanges\n\n\n-----\n\nRelated Black Basta ransomware sample that was detected in one of the IR cases.\n\nMD5: 0c69e91c2f54978ae3103b26686b2610\nSHA-256: a083060d38984e7c6f36dcd2c57ec1aa3f50f9c201c8538257c8cbf2b3217e96\nSSDEEP:\n12288:9yufBWp/QcYqt+QxxbxgU532BjZak//A6/NLaBCfwYkijMsZ2rEIaOtZBQipEen7:9yufBWpW3/k6M7tZBLpEelW3it\nImphash:23f9df8e3fa0bbe313771c0a01ac6eae\n\n## TTPs: Tactics, Techniques, and Procedures, MITRE\n\nNow that we’ve covered the execution details, I am going to share the TTPs with you.\n\nTA0001 Initial Access:\n\n1566.001 Phishing: Spear phishing Attachment\nT1566.001 Phishing: Spear phishing Attachment\nTA0002 Execution:\n\nT1204.001 User Execution: Malicious Link\nT1204.002 User Execution: Malicious Link\nT1059.005 Command and Scripting Interpreter: Visual Basic Script\nT1059.007 Command and Scripting Interpreter: JavaScript\nT1027 Obfuscated Files or Information\nTA0003 Persistence:\n\nT1547.001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder\nT1053.005 Scheduled Task\nT1543.003 Create or Modify System Process: Windows Service\nT1574.001 Hijack Execution Flow: DLL Search Order Hijacking\n\n\n-----\n\nTA0005 Defense Evasion:\n\nT1027.006 Obfuscated Files or Information: HTML Smuggling\nT1218.011 Signed Binary Proxy Execution: Rundll32\nT1218.010 System Binary Proxy Execution: Regsvr32\nT1027.002 Obfuscated Files or Information: Software Packing\nT1027.005 Obfuscated Files or Information: Indicator Removal from Tools\nT1070.004 Indicator Removal on Host: File Deletion\nT1112 Modify Registry\nT1055.012 Process Injection: Process Hollowing\nT1562.009 Impair Defenses: Safe Boot Mode\nT1622 Debugger Evasion\nTA0006 Credential Access:\n\nT1555.003 Credentials from Password Stores: Credentials from Web Browsers\nT1003 OS Credential Dumping\nTA0007 Discovery:\n\nT1057 Process Discovery\nT1018 Remote System Discovery\nT1482 Domain Trust Discovery\nT1135 Network Share Discovery\nT1069.001 Permission Groups Discovery: Local Groups\nT1082 System Information Discovery\nT1016 System Network Configuration Discovery\nT1049 System Network Connections Discovery\nT1033 System Owner/User Discovery\nT1010 Application Window Discovery\nTA0009 Collection:\n\nT1005 Data from Local System\nTA0011 Command and Control:\nT1573 Encrypted Channel\nT1071 Application Layer Protocol\nT1041 Exfiltration Over C2 Channel\nTA0040 Impact:\n\nT1486 Data Encrypted for Impact\nT1490 Inhibit System Recovery\n\nWe will continue to share threat alerts in real time so keep an eye on our social channels. You can also find our monthly\n[ransomware reports here.](https://www.cynet.com/services/)\n\nStay safe!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-31 - Orion Threat Alert- Qakbot TTPs Arsenal and the Black Basta Ransomware.pdf"
    ],
    "report_names": [
        "2022-10-31 - Orion Threat Alert- Qakbot TTPs Arsenal and the Black Basta Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535850,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1669662291,
    "ts_modification_date": 1669662291,
    "files": {
        "pdf": "https://archive.orkl.eu/e39f8d38adcfede24329475f9f4a682b34de40db.pdf",
        "text": "https://archive.orkl.eu/e39f8d38adcfede24329475f9f4a682b34de40db.txt",
        "img": "https://archive.orkl.eu/e39f8d38adcfede24329475f9f4a682b34de40db.jpg"
    }
}