{
    "id": "85ac3d0f-d87a-49bc-b3dc-748e7f497bb3",
    "created_at": "2023-01-12T15:03:52.859636Z",
    "updated_at": "2025-03-27T02:09:30.211286Z",
    "deleted_at": null,
    "sha1_hash": "8fdf35ba85ea104a66283713b78b5a2031988cb9",
    "title": "2020-07-08 - Restricting SMB-based lateral movement in a Windows environment",
    "authors": "",
    "file_creation_date": "2022-05-28T17:12:37Z",
    "file_modification_date": "2022-05-28T17:12:37Z",
    "file_size": 149433,
    "plain_text": "# Restricting SMB-based lateral movement in a Windows environment\n\n**[medium.com/palantir/restricting-smb-based-lateral-movement-in-a-windows-environment-ed033b888721](https://medium.com/palantir/restricting-smb-based-lateral-movement-in-a-windows-environment-ed033b888721)**\n\nPalantir July 8, 2020\n\nPal\nantir\n\n\n[Palantir](https://palantir.medium.com/?source=post_page-----ed033b888721--------------------------------)\n[Follow](https://medium.com/m/signin?actionUrl=https%3A%2F%2Fmedium.com%2F_%2Fsubscribe%2Fuser%2F1529195d9f13&operation=register&redirect=https%3A%2F%2Fblog.palantir.com%2Frestricting-smb-based-lateral-movement-in-a-windows-environment-ed033b888721&user=Palantir&userId=1529195d9f13&source=post_page-1529195d9f13----ed033b888721---------------------follow_byline-----------)\nJul 8, 2020\n\n\n19 min read\n\n[When Palantir entered into a technical collaboration partnership with](https://medium.com/palantir/palantir-specterops-partnership-288d06f7136d) [SpecterOps in 2018, one](https://twitter.com/SpecterOps)\nof our key initiatives was the advancement of defensive capabilities against the latest Windows\nsecurity tradecraft. To that end, the Adversary Simulation team at SpecterOps perform regular\nred team engagements inside the various Palantir networks and leverage their latest tools and\ntechniques to provide a continual feedback loop for defensive security improvement.\n\nLateral movement via Windows Server Message Block (SMB) is consistently one of the most\neffective techniques used by adversaries. In our engagements with the SpecterOps team, this\nmechanism is consistently targeted for abuse.\n\nEven in networks where significant efforts have been made to eliminate unnecessary SMB\nexposure, there are usually a small number of servers with a business-critical need to serve\nfiles to legitimate clients. In most organizations, the list will include Domain Controllers (the\nSYSVOL share), File Servers, and PowerShell logging servers, at the very least.\n\nThis blog post aims to consolidate the defensive information we’ve compiled in our efforts to\nrestrict SMB-based lateral movement, after many iterations against the SpecterOps Adversary\nSimulation Team.\n\n\n-----\n\n## Why is SMB-based lateral movement effective?\n\nAt a high level, Server Message Block (SMB) is a network communication protocol that can\nprovide shared access to services on a network. SMB is well-known for file services and for\nprinters, but it’s much more versatile than that. It can also provide an authenticated inter**process communication mechanism between nodes.**\n\nRyan Hausknecht (SpecterOps) published an excellent blog that goes into detail on Offensive\n[Lateral Movement including details about SMB here.](https://posts.specterops.io/offensive-lateral-movement-1744ae62b14f)\n\n\n-----\n\nFor the purpose of this defensive blog post, we can oversimplify Ryan s post and say that when\nan adversary has both:\n\nNetwork access to the SMB service (TCP port 139 or 445) and\nValid credentials\n\nthere’s high probability that they’ll be able to gain code execution on the remote host and\nexpand their attack surface in the environment.\n\n## Bypassing MFA\n\nThe risk created by SMB is especially important in mature environments where multi-factor\nauthentication is required for administrative access to servers.\n\nSMB can provide a convenient MFA bypass for adversaries, handing them a foothold that will\nallow for remote code execution without any additional authentication factor. Depending on the\nenvironment, SMB may also provide adversaries the ability to disable security controls\n(including MFA) and improve their position in the network.\n\nExample:\n\nIn many environments which implement a 3rd party MFA provider, an attacker can\nremove the MFA restriction with their SMB-based shell. They achieve this by enabling\n[‘Restricted Admin Mode’. This seems counterintuitive, but works for many MFA clients](https://social.technet.microsoft.com/wiki/contents/articles/32905.remote-desktop-services-enable-restricted-admin-mode.aspx)\nbecause restricted admin mode changes the supported Windows logon types and takes\nthe MFA provider out of the picture. The setting is controlled via a single registry key:\n“HKLM\\System\\CurrentControlSet\\Control\\Lsa\\DisableRestrictedAdmin” and setting it to 0\nis all that is required in many cases. This single change gives the adversary the option of\nsingle-factor RDP access to machines that would have otherwise been protected with an\nMFA prompt.\n\n## Summary of Controls\n\nWe understand that readers will be operating in networks with various levels of operational\nmaturity, and not all of the recommendations will be practical for every environment. Use this\nsummary to skip forward to the sections/steps that are relevant to your situation.\n\nThe controls that have been effective for Palantir are as follows:\n\nImplementing a simple three-tiered administration model (Workstations, General Servers,\nAuthentication Servers)\nDenying logon for security principals in the wrong tier\nDenying SMB communication between workstations\nDenying SMB communication from workstations to servers\nPrioritizing Operating System upgrades for ‘high risk’ servers\nDeploying Windows Defender Code Integrity rules\n\n\n-----\n\nDeploying Windows Defender Attack Surface Reduction rules\n\nWe also believe it is worth calling out the options that we haven’t yet been able to derive value\nfrom:\n\nDenying network logon for security principals likely to be used for adversary lateral\nmovement*\nDenying ‘log on as a service’ for administrative accounts\nWindows Token filtering policies\nImproved Service Control Manager ACLs\nWMI access restrictions\nAdvanced Windows Firewall configurations for all SMB traffic — IPSEC (null encryption)**\nNetwork-based tiering restrictions on a per service level\nWindows Firewall built in Named Pipe rules\n\n   - We begin many of our red team engagements with the assumption that some low-level,\nstandard user credentials have been stolen from an endpoint and the operator has\nremote code execution on that device.\n\n** We make heavy use of Windows Firewall and IPSec with null encryption for other use\ncases.\n\n## Effective Mitigations\n\n [1]: Implementing a simple tiered administration model (Workstations, General Servers, Authentication Servers)\n\nAs best as we can, we follow Microsoft guidance in our approach to setting up a tiering model\nfor each of our environments. Microsoft have excellent documentation on the topic, including an\n[implementation guide here.](https://docs.microsoft.com/en-us/windows-server/identity/securing-privileged-access/securing-privileged-access)\n\nWe take a simple approach and divide our environments into three asset types:\n\nTier 0 — Domain Controllers, ADFS servers and others that have direct ability to influence\nauthentication.\nTier 1 — All other servers\nTier 2 — Workstations\n\nThen, for each of the tier types we restrict the security principals that can log on. Example:\n\nTier 0 — ‘username-t0’ + require MFA.\nTier 1 — ‘username-t1’ + require MFA.\nTier 2 — standard username and MFA depending on the service and scenario.\n\nWe restrict all administrative ports to bastion hosts for each tier.\n\n\n-----\n\nEven if an adversary is in possession of stolen administrative credentials (tier 1 or tier 0), the\nadministrative ports such as RDP and WinRM are not available from lower tier machines.\n\nAdministrative ports are only open to traffic from bastion hosts, which are protected with a 3rd\nparty MFA provider. We achieve this with Windows host-based firewall and back it with network\nfirewall rules.\n\n[Palantir CISO Dane Stuckey’s ‘Endpoint Isolation with Windows Firewall’ post provides](https://medium.com/@cryps1s/endpoint-isolation-with-the-windows-firewall-462a795f4cfb)\ndetail for configuring Windows firewall to suit this model.\n\nIn a perfect world, this level of separation would mean that even if an adversary stole tier 1 or\ntier 0 credentials from a workstation, they would not be able to use them. They’d require MFA to\nposition themselves on a host with access to administrative ports on their targets. Unfortunately,\nthis is where SMB steps in and provides options for abuse.\n\nThis first foundational step provides the following significant improvements:\n\nAttackers need to be on a bastion host to access administrative ports for servers\nAttackers need specific credentials to move between tiers and users do not use those\ncredentials on workstations.\n\n## [2]: Denying logon for security principals in the wrong tier\n\nUsers are prevented from logging in to a workstation with a tier 1 (server administration) or 0\n(domain administration) accounts.\n\nWithout extra effort on the side of the adversary, processes can’t execute in the context of a tier\n0 or 1 security principal on lower tier devices.\n\n[We use the “Allow log on locally” Group policy for this, linked to the top Organizational Unit for](https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/allow-log-on-locally)\neach service tier. The policy denies logon to the two groups containing principals for each of the\nother two tiers.\n\nThis simple policy prevents attackers from logging on to our workstations with server\ncredentials. Interestingly, it also provides protection against remote code execution via SMB if\nan adversary was to execute:\n\nrunas /user:contoso\\bob-t1 ‘psexec.exe \\\\tier1server.contoso.com cmd.exe’\n\nUnfortunately, there’s a gap in this control as it applies to SMB-based lateral movement. If an\nattacker is able to leverage a ‘network only’ logon type, this control will fail. Legitimate tools like\npsexec have a ‘/netonly’ parameter, as do adversary frameworks.\n\nThe improvements:\n\nAdversaries will meet resistance in leveraging stolen administrative credentials.\nCredentials from higher tiers should not be in memory on a lower tier machine.\n\n\n-----\n\n## [3] Denying all SMB communication between workstations\n\nWe leverage Windows firewall to DENY all inbound SMB communication to workstations.\n\nWe don’t provide exceptions to this policy.\n\nWe use a simple Windows Firewall rule, distributed via Group Policy and applied to the\nworkstations OU. The rule denies all inbound communication on ports 139 and 445.\n\nNote: We also recommend that you deny inbound WinRM and RDP to workstations and\ndon’t allow the machines to use LLMNR, Netbios or mDNS outbound.\n\nThe improvement:\n\nLateral movement with SMB between our workstations is unlikely.\nMalware which spreads via SMB is also unlikely to move through our workstation fleet.\n\n## [4] Denying most SMB communication from workstations to servers.\n\nWe’ve audited the requirements of each of our servers and DENY SMB inbound to any that\nhave no business need.\n\nThis single step reduces the overall risk in a very significant way. SMB-based lateral movement\nis now highly unlikely for the majority of our servers, and the remaining machines are\ndesignated as ‘high risk’ and will require additional controls and monitoring. Teams supporting\n\n\n-----\n\nhigh risk servers accept that additional controls and constraints may apply to servers in this\ncategory.\n\nServers that require SMB in most Windows environments will be limited to Domain Controllers,\nFile Servers, logging servers and a small handful of environment specific devices. It’s difficult to\nprovide accurate numbers, but in our experience a reduction in exposed servers is likely to be\ngreater than 90%.\n\nThe recommended implementation approach is similar to workstations. Link a “DENY SMB”\npolicy at the Servers OU and use security group based filtering to prevent the small number of\nhigh risk servers from applying the policy.\n\nDENY the “apply group policy” right to the high risk servers group in the security ACL for\nthe new SMB group policy.\n\nThe improvement:\n\nSignificant reduction in surface area for SMB-based lateral movement.\nReduction in the number of servers that require a compensating control makes it easier to\ntailor a solution to the server type and function.\n\n## [5] Prioritize Operating System upgrades for ‘high risk’ servers\n\nSMB-based lateral generally starts by copying a payload to the remote target. The payload is\nthen executed via one of a handful of techniques: Service Control Manager & WMI are common\nexamples.\n\nTo provide an example:\n\nThe Microsoft Sysinternals utility psexec.exe deploys a binary to the Admin$ share on the\nremote machine. It then uses the DCE/RPC interface over SMB to access the Windows Service\nControl Manager API. That operation starts the PSExec ‘service’ on the remote machine and\ncreates a named pipe that can be used to send commands to the system.\n\nMany adversary tools also use this approach or substitute WMI in the code execution step.\n\nThe summary of access required to make this work is:\n\nTCP Port 139 or 445 open on the remote machine, i.e., SMB.\nWrite permissions to a network shared folder.\nPermissions to create services on the remote machine:\nSC_MANAGER_CREATE_SERVICE (Access mask: 0x0002). or permissions to use WMI.\nAbility to start the service created: SERVICE_QUERY_STATUS (Access mask: 0x0004) +\nSERVICE_START (Access mask: 0x0010) — or permissions to start a process via WMI.\n\n\n-----\n\nThe challenge for defenders is that even in a well tiered environment, the list above are all\npermissions that a tier 1 administrator account would have, and with SMB, the adversary has\nan MFA bypass available allowing them to leverage stolen credentials.\n\nThe recommendation we’ve adopted is to adjust our corporate security policy to require that\nHigh Risk servers run the latest Windows Operating System.\n\nWindows Server 2019 Defender will provide a significant improvement without configuring any\nadditional control. This is because Defender is especially effective when a payload touches the\ndisk. This will usually happen when the default SMB lateral movement approaches are\nattempted. Without additional effort on the side of the adversary, payloads from Cobalt Strike,\nEmpire, and Metasploit are likely to be intercepted when copied to the disk of a Windows\nServer 2019 server.\n\n\n-----\n\nThe improvement:\n\nDefault payloads will be destroyed by the Defender service.\nAlerting and Detection improvements when Defender eats a malicious payload.\nOpportunity to leverage additional modern OS controls in later steps.\n\nNote: the recommendation is not to rush a 2019 upgrade/replacement for your entire fleet\n(although that would be nice). Instead, we’ve identified a subset of servers that still expose\nSMB in the previous step and classified them as ‘high risk’ — they’re the urgent ones.\n\n## [6] Windows Defender Code Integrity rules\n\nWindows Defender Code Integrity policies provide modern application whitelisting that works\nespecially well when the role of a server is static and well understood. We combine this\nrecommendation with the advice to deny SMB outright to most servers. Code Integrity is the\nprimary compensating control for the small number of servers that have a business need to\nexpose SMB to clients: our ‘high risk servers’.\n\n\n-----\n\nWindows Device Guard Code Integrity provides an Audit Mode, allowing administrators to\ndeploy the technology for a period of time, then review the logs, adjust the policy, and repeat\nuntil a block operation is a high-fidelity event. Even without ever moving to the blocking phase,\nthis provides a lot of value for the detection team.\n\nMatt Graeber’s post is the go to for those wishing to use code integrity in their detection\nstrategy: https://posts.specterops.io/threat-detection-using-windows-defender-applicationcontrol-device-guard-in-audit-mode-602b48cd1c11\n\nCarefully implemented, code integrity policies provide an excellent compensating control for our\nservers that still require SMB to be exposed to clients. We’ve been fortunate enough to work\ndirectly with Matt Graeber and recommend his blog for detail. Our tips:\n\nMake heavy use of audit mode before attempting anything in blocking mode. You can\niterate on audit mode policies until you no longer log any events (because you’ve added\neverything you need to the whitelist) and then leave the policy in place for a period of time\nto be sure.\nStart out with a specific server or service type you’d like to protect and perfect the process\nbefore attempting anything at scale. Domain Controllers are a reasonable choice because\nthey have a single, well-understood role and shouldn’t have much 3rd party software\nchurn.\n\nThe improvement:\n\nAttackers are unable to run arbitrary code on high risk servers.\nVery strong control (but requires configuration time investment).\n\n## [7] Attack Surface Reduction rules\n\nIf you’re operating in a blue team environment and haven’t come across Attack Surface\nReduction rules, Microsoft has a treat for you.\n\nASR rules are simple to deploy and incredibly effective, although not all the rules will be\napplicable for all environments. The majority of them offer audit mode to improve your ADS\ncoverage, even if there is no desire to use block more.\n\nASR rules are generally targeted more towards workstations than servers but there is still\nsignificant, low effort value available for defenders.\n\nThe current ASR rules are:\n\nBlock executable content from email client and webmail\nBlock all Office applications from creating child processes\nBlock Office applications from creating executable content\nBlock Office applications from injecting code into other processes\nBlock JavaScript or VBScript from launching downloaded executable content\n\n\n-----\n\nBlock execution of potentially obfuscated scripts\nBlock Win32 API calls from Office macros\nUse advanced protection against ransomware\nBlock credential stealing from the Windows local security authority subsystem (lsass.exe)\n\nBlock untrusted and unsigned processes that run from USB\nBlock Office communication application from creating child processes\nBlock Adobe Reader from creating child processes\nBlock persistence through WMI event subscription\n\nThe bolded one, “Block process creations originating from PSExec and WMI commands,” is\nespecially interesting for some environments:\n\n[“This rule blocks processes created through PsExec and](https://docs.microsoft.com/sysinternals/downloads/psexec) [WMI from running. Both PsExec](https://docs.microsoft.com/windows/win32/wmisdk/about-wmi)\nand WMI can remotely execute code, so there is a risk of malware abusing this\nfunctionality for command and control purposes, or to spread an infection throughout an\norganization’s network.”\n\nThat’s a built-in control that will stop the PSExec-style lateral movement and provide excellent\ncoverage against some of the other approaches that use WMI to trigger the code execution.\n\nYou can deploy ASR rules with group policy, and remember that even if you don’t want to block\non these, you can put them in audit mode and use the events in your ADS’s.\n\nNote: The PSExec/WMI ASR kills SCCM and Intune. If your high risk servers are\nmanaged by those, you’ll have to consider the trade-off. In either case, you can leverage\naudit mode.\n\nThe improvement:\n\nOS-level protection against common SMB-based lateral movement.\n\n## [ALL] Combining the recommendations\n\nCombining the recommendations above, we arrive at a baseline where:\n\nCredentials are restricted by tier, and stolen credentials from one tier provide limited value\nto an attacker who is seeking to improve their position in the network (MFA and Bastions\nare required).\nVery few servers in the environment allow network connectivity to the SMB service (port\n139/445).\nThe remaining servers are categorized as ‘high risk’ and have strong and simple-tomanage protection via Defender.\n‘High risk’ servers leverage built-in lateral movement controls via attack surface reduction.\n‘High risk’ servers prevent arbitrary code execution via code integrity policies.\n\n\n-----\n\n## Mitigations that didn t pan out for us\n\nThe following options were discussed and/or tested as potential improvements to our strategy.\nThey either didn’t work, or had significant downside.\n\nOur reasons for each are discussed below:\n\n## [1] Deny network logon type for tiering violations\n\nIn mitigation [2] we recommended that teams configure “allow log on locally” in a way where tier\nrestrictions are enforced by group policy.\n\nWe provided an example: ‘runas /user:contoso\\bob-t1 ‘psexec.exe\n**\\\\tier1server.contoso.com cmd.exe’ where ‘bob-t1’ represents a stolen server administration**\naccount trying to execute psexec from a workstation, targeting SMB-based lateral movement to\na server.\n\nThe control we’ve applied works with psexec defaults but as we mentioned, the workaround\n(build into adversary tools) is to force a ‘network only’ logon type.\n\n[There is a policy that says “Access this computer from the network” — more detail here. It’s](https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/access-this-computer-from-the-network)\ndefined down in: Computer Configuration\\Windows Settings\\Security Settings\\Local\nPolicies\\User Rights Assignment which sounds like it might provide value against network onlytype logons.\n\nIt was suggested that maybe we could prevent our admins from doing the network only-style\nlogon, while still allowing them standard logon.\n\nUnfortunately, this option is not appropriate here. If you applied this setting to your servers then\nlegitimate server admins will not be able to log on.\n\nCross it off the list.\n\nNote: You could still use this policy as an extra control to stop tier violations. You just can’t\nuse it to get additional granular control over legitimate users.\n\n## [2] Deny ‘log on as a service’ for administrative accounts\n\nThis consideration was based on one of the main approaches for SMB lateral movement:\nleveraging the service control manager to execute a payload.\n\nIt stands to reason that if we could somehow restrict server admins from interacting with the\nservice control manager except via some break glass process, we could kill off this particular\ncode execution approach.\n\n[The group policy is documented here. It’s set here: Computer Configuration\\Windows](https://docs.microsoft.com/en-us/windows/security/threat-protection/security-policy-settings/deny-log-on-as-a-service)\nSettings\\Security Settings\\Local Policies\\User Rights Assignment.\n\n\n-----\n\nWe didn t have success with this setting in our testing.\n\nMicrosoft also advise against it: “We recommend that you not assign the Deny log on as a\n_service user right to any accounts. This is the default configuration.”_\n\n## [3] Token filtering policies\n\nThere’s a security configuration setting called “LocalAccountTokenFilterPolicy” that may provide\nsome protection against lateral movement via local administrative accounts with the same\npassword. However, we use LAPS in our environment and work with an assumption that no\ndevices share local admin passwords. We capture LAPS password change events and have a\ngood level of confidence in the solution.\n\nToken filtering policies are interesting, though, and Will Schroeder did a great job of discussing\nthe risks in [this blog post.](https://www.harmj0y.net/blog/redteaming/pass-the-hash-is-dead-long-live-localaccounttokenfilterpolicy/)\n\nWe wanted to mention token filtering policies here because when discussing lateral movement\nthey should come up. For this effort though, we are specifically targeting SMB and already have\ncontrols that would restrict pass the hash using local administrative accounts. Token filtering\npolicies were not part of this specific defensive effort but if you are working through your lateral\nmovement strategy they are an important consideration.\n\n[Token filtering policy STIG is here.](https://www.stigviewer.com/stig/windows_server_2008_r2_member_server/2014-04-02/finding/V-36439)\n\n## [4] Improved Service Control Manager ACL\n\nWe started out with an assumption that the Service Control Manager approach to getting\nbinaries to run on remote systems was very common in SMB-based lateral movement, but\nthrough iterations with the red team, we realized that more often than not the WMI (over SMB)\napproach was preferred. With that in mind, we abandoned this control, but wanted to share our\nnotes.\n\nThe hypothesis was that we could restrict our tier 1 administrative accounts from being able to\ncreate new services, then implement a process to add this ability back for the rare occasions on\nwhich an administrator would actually need to create a new service.\n\n[It’s all documented here, but in brief — we can inspect the permissions for a service using:](https://docs.microsoft.com/en-us/windows/win32/secauthz/security-descriptor-definition-language)\n```\nsc sdshow scmanager\n\n```\nThe result is a SDDL string like:\n```\nD:(A;;CC;;;AU)(A;;CCLCRPRC;;;IU)(A;;CCLCRPRC;;;SU)(A;;CCLCRPWPRC;;;SY)(A;;KA;;;BA)\n(A;;CC;;;AC)S:(AU;FA;KA;;;WD)(AU;OIIOFA;GA;;;WD)\n\n```\n\n-----\n\nIf you re not familiar with SDDL, it looks horrible, but it s actually reasonably straightforward to\ninterpret. What you’re seeing in the output above is both the DACL (security) and the SACL\n(auditing). You can break it up by separating on the D: and S: like:\n```\n(A;;CC;;;AU)(A;;CCLCRPRC;;;IU)(A;;CCLCRPRC;;;SU)(A;;CCLCRPWPRC;;;SY)(A;;KA;;;BA)\n(A;;CC;;;AC)(AU;FA;KA;;;WD)(AU;OIIOFA;GA;;;WD)\n\n```\nWe only care about the D: part for our goal.\n\nThen you break up the individual access control entries. They’re separated by brackets so\n(A;;CC;;;AU) is an ACE, (A;;CCLCRPRC;;;IU) is an ACE and so on.\n\nThen, each ACE can be interpreted the same way:\n\nACE type (allow/deny/audit)\nACE flags (inheritance and audit settings)\nPermissions (list of incremental permissions)\nObjectType (GUID)\nInherited Object Type (GUID)\nTrustee (SID)\n\nSo using the first example: (A;;CC;;;AU) breaks out to:\n\n**(A;;CC;;;AU)**\n\nAllow\n.\nCreate All Child Objects\n.\n.\n\nIf we wanted to build a new ACE for the ACL, we’d construct it in the same way and add it to\nthe string. You could set the configuration with:\n```\nsc sdset scmanager NEW-SDDL-STRING\n\n```\nOur idea was to construct a new SDDL string where our “all-tier1-admins” group didn’t have the\n‘create service’ right and then deploy the new ACL to all our servers.\n\nWhile it wasn’t as complex as it first seemed, and did provide effective control against this\nspecific type of SMB-based attack, we ultimately opted out because it provided no cover for\nSMB-based movement that used a different RPC approach.\n\n## [5] Local WMI Access restrictions\n\n\n-----\n\nWe considered modification to the WMI permissions for each server to restrict process creation\nusing the common adversary approaches. There are a few ways to make the changes; the\nmost direct is to use “wmimgmt.msc.” You could make adjustments via the security tab and\npotentially export configurations.\n\nAfter spending a small amount of time here, we abandoned this line of research. We did so for\nthe same reason we abandoned the service control manager changes. The level of complexity\nweighed against the incomplete coverage made it less compelling. We also realized that new\nprocesses would be required for break-glass and that we’d need to be very careful with the\ncompatibility of applications and services, especially SCCM.\n\nUltimately, the juice wasn’t worth the squeeze while good alternatives such as Code Integrity\npolicies existed.\n\n## [6] Advanced Windows Firewall configurations for all SMB traffic — IPSEC (null encryption)\n\nWe use this approach a lot already and highly recommend it for other use cases.\n\nThe premise is:\n\n\n-----\n\nUse Windows firewall to deny access to administrative ports (RDP for example).\nThen use some properties of the firewall\nDENY usually overrides ALLOW in Windows firewall.\nThe one exception to that rule is IPSEC.\nIf you use IPSEC you can override a DENY in a very granular way.\n(RDP example) DENY access to RDP for everyone, from everywhere, then configure an\nIPSEC policy for those that need RDP access to override that rule.\nThe IPSEC policy can use Kerberos to further restrict access to specific users and\ngroups.\nWe use null encryption. We are leveraging the authentication component of IPSEC, but\nno encryption.\n\nThe reasons we decided not to take this approach for restricting SMB-based lateral movement:\n\nWe’d still like administrators to be able to use SMB from bastion servers (achievable; but\nadds complexity).\nWe can’t configure a blanket DENY rule for SMB then override with IPSEC policy specific\nto our administrative accounts. We’d have to apply the override for all normal accounts\nthat do need SMB access, and block the admins — so it’s kind of the opposite of the\nmodel we are comfortable with.\nThere’s risk. There’s potential for chicken and egg problems with the domain controllers\nand IPSEC, especially when considering GPO application may require SMB. Chances are\nthe risks could be designed around for safe implementation, but given alternative controls\nwere available, we decided not to pursue this route.\n\n## [7] Network-based tiering restrictions on a per service level\n\nOur network team have the ability to get very granular with network traffic. We have ACEs on\nthe firewalls that tie into active directory groups, and the team are able to inspect for service\ntypes in addition to traditional port-based restrictions.\n\nWe found it difficult to accurately break the problem down in a way that scaled and responded\nwell to change. With SMB in particular, we are usually dealing with legitimate credentials, and it\nis a legitimate service.\n\nWe did deny our tier 1 and tier 0 accounts from using SMB from any workstation network, to\nany server network. The challenge was the ‘network login’ type that we mentioned earlier in the\npsexec notes: if the adversary was able to perform network logon, the traffic appeared to\noriginate from a non-administrative account and would PASS the ACL.\n\n## [8] Windows Firewall built-in Named Pipe rules\n\nWhen we found this built-in setting, we thought we’d struck gold.\n\n\n-----\n\nIf we interpreted the rule the way it is written — Remote Service Management (NP-In) where\nNP is “Named Pipes” — we’d have an amazing level of protection against this problem for very\nlittle effort. (Remember that the majority of lateral movement via SMB works through Named\nPipes).\n\nUnfortunately, there is no special sauce in this rule.\n\nIt’s actually a port-based rule (445), with a fancy name describing why 445 might be needed. So\nif you switch it to “Block the connection,” you’ll be denying all SMB traffic — which is not our\ngoal for all servers (and is already implemented on the others).\n\n## General SMB Advice\n\nWhile not directly related to lateral movement, we felt it important to mention two extra points\nthat are relevant to running SMB services safely:\n\nif at all possible: Ned Pyle provides all the reasons in post.\nTest, then for client and server on all devices. Microsoft provide advice .\n\n## Wrapping it up\n\nWe’ve spent a lot of time thinking about lateral movement. We work with the fundamental\nprinciple that administrative port access to servers is not allowed from our workstations at all,\nand that all administrative access should be via a bastion and require MFA.\n\n\n-----\n\nFor the longest time, SMB has provided a frustrating lateral movement gap in this security\nbaseline that makes things easier for our adversary simulation team.\n\nIt’s a cat and mouse game, but we’re feeling confident that the changes in this post significantly\nraise the bar. We hope the lessons learned can be useful to others tasked with protecting their\nenvironments from adversarial lateral movement.\n\n## Author\n\n[Chad D.](https://twitter.com/duff22b)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-08 - Restricting SMB-based lateral movement in a Windows environment.pdf"
    ],
    "report_names": [
        "2020-07-08 - Restricting SMB-based lateral movement in a Windows environment.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535832,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653757957,
    "ts_modification_date": 1653757957,
    "files": {
        "pdf": "https://archive.orkl.eu/8fdf35ba85ea104a66283713b78b5a2031988cb9.pdf",
        "text": "https://archive.orkl.eu/8fdf35ba85ea104a66283713b78b5a2031988cb9.txt",
        "img": "https://archive.orkl.eu/8fdf35ba85ea104a66283713b78b5a2031988cb9.jpg"
    }
}