{
    "id": "860d7788-cb30-4a04-9edf-549a08d92de0",
    "created_at": "2023-01-12T14:59:39.552453Z",
    "updated_at": "2025-03-27T02:06:10.289727Z",
    "deleted_at": null,
    "sha1_hash": "072b7e07f0bc6c76dc3be5510dd1b231ae7c6bd5",
    "title": "2022-07-20 - LockBit- Ransomware Puts Servers in the Crosshairs",
    "authors": "",
    "file_creation_date": "2022-08-18T03:22:37Z",
    "file_modification_date": "2022-08-18T03:22:37Z",
    "file_size": 1630090,
    "plain_text": "# LockBit: Ransomware Puts Servers in the Crosshairs\n\n**[symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lockbit-targets-servers](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lockbit-targets-servers)**\n\nVishal KamblePrincipal Threat Analysis Engineer\n\nLahu KhatalSenior Threat Analysis Engineer\n\n## LockBit affiliates using servers to spread ransomware throughout networks.\n\n[Symantec, a division of Broadcom Software, has observed threat actors targeting server](https://software.broadcom.com/)\nmachines in order to spread the LockBit ransomware threat throughout compromised\nnetworks.\n\n\n-----\n\nIn one attack observed by Symantec, LockBit was seen identifying domain-related\ninformation, creating a Group Policy for lateral movement, and executing a \"gpupdate /force\"\ncommand on all systems within the same domain, which forcefully updates group policy.\n\n## LockBit\n\nLockBit is a ransomware-as-a-service (RaaS) operated by malicious actors Symantec tracks\nas Syrphid.\n\nShortly after it first appeared in September 2019, the Syrphid gang expanded its operations,\nusing a network of affiliates to deploy the LockBit ransomware on victim networks. The\n[ransomware, which has currently reached version 3.0, has evolved over the past few years,](https://www.darkreading.com/threat-intelligence/lockbit-3-debut-bug-bounty-program)\n[as has its operators who have recently launched a bug bounty program in order to weed out](https://www.bleepingcomputer.com/news/security/lockbit-30-introduces-the-first-ransomware-bug-bounty-program/)\nweaknesses in the malware’s code and the RaaS operation as a whole.\n\n## Attack chain\n\nIn one observed instance, before dropping and executing the LockBit ransomware, an\nattacker had RDP access to the enterprise network for a couple of weeks at least. This\naccess may have been obtained through remote desktop applications such as AnyDesk or\nWindows RDP, or by exploiting a known vulnerability, etc.\n\nLockBit behaves differently on server machines with domain controllers than on Windows 10\nmachines. When executed on a server, it has the capability to spread through the network\nusing Group Policy. On Windows 10 machines it performs routine ransomware activity and\nencrypts files.\n\nWhen LockBit is executed on a server machine it carries out the following actions:\n\n1. Debugger check\n\nLockBit first checks if the malware process is being debugged. If this is the case, it\ngoes into an infinite loop.\n\n\n-----\n\nFigure 1. If malware process is being debugged, LockBit goes into an infinite loop\n2. Language Check\n\nIt calls GetSystemDefaultUILanguage and GetUserDefaultUILanguage to check the\nlanguage.\nIf the language matches with the one on the malware’s list then it terminates\nimmediately.\nLockBit does not target Russia or a selection of nearby countries.\n\n\n-----\n\nFigure 2. LockBit calls GetSystemDefaultUILanguage and GetUserDefaultUILanguage to\ncheck the language.\n3. End running processes and disable services\n\nLockBit ends a list of running processes related to malware analysis and other\nprocesses like Process Explorer, Process Monitor, Wireshark, Dumpcap, Process\nHacker, cmd.exe, TeamViewer, Notepad, Notepad++, WordPad etc.\nDisables a list of services related to SQL, backup, and MSExchange etc.\n\n4. Privilege escalation\n\nDuplicates the token by calling DuplicateTokenEx and creates a new process using\n**CreateProcessAsUserW.**\nAfter it achieves privilege escalation, LockBit relaunches itself under DLLHost.exe.\nOnce the new process is spawned, the LockBit process ends itself.\n\n5. Bypass UAC\n\nLockBit injects code into dllhost.exe with CLSIDs of COM objects, which runs the\nfollowing command to bypass UAC:\n\nA. Exploiting USERENV.dll to bypass UAC\n\n\n-----\n\nB. Bypass method in hfiref0x s UACME\n\nC. Exploiting the ICMLuaUtil elevated COM Interface-Object\n\n6. LockBit creates a copy of itself under the SYSVOL directory\n“c:\\windows\\sysvol\\domain\\scripts\\< Lockbit executable>”\n\n7. Creating a Group Policy:\n\nOnce the malware identifies it is running as an admin user and a domain controller is\ninstalled on the system, it creates a Group Policy to stop services, end processes, and\ncopy LockBit etc.\nUnder the “C:\\Windows\\SYSVOL\\domain\\Policies\\<policy GUID>” folder, LockBit\ncreates XML files that are required for the Group Policy.\n\nComputer configurations:\n\nIt first creates a policy to turn off Windows Defender, suppress all notifications, disable\nfile submissions, turn off real-time protection etc.\nIt then maps the network drive through Group Policy.\nDisables services related to SQL server at startup.\n\nUser Configurations:\n\nThe malware copied the ransomware from SYSVOL to the Desktop directory.\nIt then creates a scheduled task to end the list of processes previously mentioned.\n\nFigure 3.Group Policy XML file used to copy LockBit from the shared SYSVOL location to\nclient’s desktop location.\n\n\n-----\n\nFigure 4. Group Policy created by LockBit can be seen in the Group Policy Management\nconsole.\n\n\n-----\n\nFigure 5. Group Policy details to disable Defender and several additional options.\n\nFigure 6. Group Policy used to map network drives.\n\n\n-----\n\nFigure 7. Group Policy used to disable SQL services at startup.\n\nFigure 8 Group Policy used to copy LockBit from the SYSVOL shared location to the\ndesktop.\n\n\n-----\n\nFigure 9. Group Policy used to end processes using the taskkill command.\n\n\n-----\n\nFigure 10. Group Policy used to execute the LockBit ransomware.\n8. Lateral movement:\n\nLockBit launches powershell.exe to run the command shown below in order to search\nthrough all the computers on the Active Directory. For each host it uses the GPUpdate\nforce command (gpupdate) to apply the newly created Group Policy.\n\n9. Executes gpupdate command on the domain controller where LockBit is running. Also\nruns gpupdate to run policies from the computer configurations and user configurations.\n\n10. Firewall\n\nLockBit reads firewall rules using the Windows Defender Firewall with Advanced\nSecurity API's “FwPolicy2” object. The following CLSID COM object is called:\n\n11. Impact\n\n\n-----\n\nLockBit attempts to delete shadow copies using VSSADMIN and WMIC. It also tries to\ndisable recovery using the BCDEdit command.\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-20 - LockBit- Ransomware Puts Servers in the Crosshairs.pdf"
    ],
    "report_names": [
        "2022-07-20 - LockBit- Ransomware Puts Servers in the Crosshairs.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535579,
    "ts_updated_at": 1743041170,
    "ts_creation_date": 1660792957,
    "ts_modification_date": 1660792957,
    "files": {
        "pdf": "https://archive.orkl.eu/072b7e07f0bc6c76dc3be5510dd1b231ae7c6bd5.pdf",
        "text": "https://archive.orkl.eu/072b7e07f0bc6c76dc3be5510dd1b231ae7c6bd5.txt",
        "img": "https://archive.orkl.eu/072b7e07f0bc6c76dc3be5510dd1b231ae7c6bd5.jpg"
    }
}