{
    "id": "861cf984-ea75-423e-ba76-78efa78ca155",
    "created_at": "2023-01-12T14:59:30.712279Z",
    "updated_at": "2025-03-27T02:16:47.113476Z",
    "deleted_at": null,
    "sha1_hash": "dd273dd8da867cdaa50dda190882138a75b4b864",
    "title": "2021-11-18 - BlackMatter, LockBit, and THOR",
    "authors": "",
    "file_creation_date": "2022-05-28T17:47:42Z",
    "file_modification_date": "2022-05-28T17:47:42Z",
    "file_size": 440787,
    "plain_text": "# BlackMatter, LockBit, and THOR\n\n**[umbrella.cisco.com/blog/cybersecurity-threat-spotlight-blackmatter-lockbit-thor](https://umbrella.cisco.com/blog/cybersecurity-threat-spotlight-blackmatter-lockbit-thor)**\n\nNovember 18, 2021\n\nEver wonder what happens when some of yesterday’s most crippling ransomware or RAT\nattacks evolve? That’s what we unpack in this month’s Cybersecurity Threat Spotlight. Our\nthree cyberattacks wreak havoc by borrowing some of the most effective techniques and\ntools formerly used by DarkSide, REvil, LockBit, and the PlugX RAT.\n\nWe break down this evolution in today’s blog, and discuss the ways in which you can protect\n[your network in an on-demand webinar.](https://learn-umbrella.cisco.com/threat-intelligence/threat-spotlight-series-episode-3?utm_medium=web-referral&utm_source=blog&utm_campaign=UMB-FY22-Q2-cybersecurity-threat-spotlight-blackmatter-lockbit-thor&utm_term=pgm&utm_content=UMB-FY22-Q1-NA-0930-Webinar-Threat-Spotlight-Series-Episode-Three)\n\n## Threat Name: BlackMatter\n\n**Threat Type: Ransomware**\n\n**Attack Chain:**\n\n\n-----\n\n**Description: BlackMatter ransomware is both a ransomware variant and a ransomware-as-**\na-service, borrowing techniques and tools from DarkSide and REvil RaaS platforms and from\nLockBit 2.0 ransomware. One interesting change in BlackMatter from similar variants is that\nit will encrypt Russian systems.\n\nFirst appearing in July, 2021, BlackMatter appears to be the next generation of DarkSide,\nREvil, and LockBit 2.0, using the best techniques from each to be more effective at achieving\nits goals. The name BlackMatter applies to its operators, its use as a Ransomware-as-aService (RaaS), and the artifacts used in infections.\n\nThe operators have a presence on TOR, where they claim transparency with victims,\nrecovery companies, and journalists while providing a list of verticals they do not target.\n\nMany similarities between BlackMatter, DarkSide, REvil, and LockBit 2.0 exist. These include\nbeing provided as RaaS, multi-threading, in-place file encryption, and similar ransom desktop\nwallpaper on victim machines. Some of the notable differences with BlackMatter include a\nlarger encryption size of 1,024 KB and the fact that it will encrypt Russian-language systems.\n\nThe ransom notes are similar to what has been observed in DarkSide infections in regard to\nfile size, image format, and appearance. BlackMatter uses Initial Access Brokers, individuals\nor groups who are willing to sell access to compromised networks while also recruiting\naffiliates to deliver ransomware for a portion of the ransom payments. Variants exist for\nWindows and Linux, affecting Windows Server 2003 and later and Windows 7 and later on\nx86 and x64 architectures. Affected Linux versions include VMWare ESXI, Ubuntu, Debian,\nand CentOS.\n\nInitial access is via compromised remote desktop, phishing, the use of stolen credentials, or\nexploitation of vulnerabilities in web browsers or operating systems. When a system is\ninfected with BlackMatter, the privilege of the current user is verified and an attempt to\nescalate occurs. Processes are terminated to close any running programs that might prevent\nencryption of files, shadow volume copies are deleted, data is exfiltrated, and the files on the\nsystem are encrypted. During encryption, files are opened, checked to determine if they were\nalready encrypted, renamed with a new extension, and partially encrypted. Then, data to\nindicate the file was encrypted is added and the file is closed. Access permissions for\nencrypted files are changed to ‘All’. Victims who choose to pay the ransom to recover files\n\n\n-----\n\nare unable to restore the original access permissions. If unable to run due to endpoint\nprotection, BlackMatter will reboot a Windows system in safe mode. To inhibit analysis, string\ninformation in malware artifacts are encrypted and only decrypted while running in memory.\n\n**Target Geolocations: Any**\n**Target Data: Any**\n**Target Businesses: Financial, Legal, Manufacturing, Professional Services, Retail,**\nTechnology1\n**Exploits: Web Browser or OS Vulnerabilities**\n\n**MITRE ATT&CK for BlackMatter**\n**Initial Access: Phishing, External Remote Services**\n**Persistence: Scheduled Task/Job**\n**Evasion: Deobfuscate/Decode Files or Information, Obfuscated Files or Information,**\nProcess Injection: Dynamic-Link Library Injection\n**Collection: N/A**\n**Exfiltration: Exfiltration Over Web Service, Transfer Data to Cloud Account, Exfiltration Over**\nC2 Channel\n\n**IOCs**\n\n**Domains:**\nkucukisletmeler[.]com\nlentingbouw[.]nl\nfluentzip[.]org\nnowautomation[.]com\nmojobiden[.]com\nPaymenthacks[.]com\n\n**Additional Information:**\n[BlackMatter ransomware emerges from the shadow of DarkSide](https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/)\n[BlackMatter Ransomware Portal Tweet](https://twitter.com/fwosar/status/1420117333096419330)\n\n**Which Cisco Products Can Block:**\nCisco Secure Endpoint\nCisco Cloud Web Security\nCisco Network Security\nCisco Secure Network Analytics\nCisco Secure Cloud Analytics\nCisco Secure Malware Analytics\nCisco Umbrella\nCisco Secure Web Appliance\n\n\n-----\n\nThese target businesses were identified by BlackMatter operators, but this attack may\ntarget other businesses\n\n## Threat Name: LockBit\n\n**Threat Type: Ransomware**\n\n**Attack Chain:**\n\n**Description: LockBit ransomware was first seen in 2019. A second version, called LockBit**\n2.0, appeared in July, 2021 and operates as ransomware-as-a-service (RaaS). It shares\nfeatures with Ryuk and Egregor ransomware families, such as Wake-on-LAN and Print\nBombing (sending the ransom note to connected printers). LockBit operators use doubleextortion methods and attempt to recruit affiliates from within the targeted organizations.\nAutomatic encryption on victim systems occurs across Windows domains by abusing Active\nDirectory policies. LockBit uses multithreading for encryption and only partially encrypts files\nto increase speed.\n\nOriginally known as the .abcd virus, the first version of LockBit was able to self-replicate,\nperformed host discovery using ARP tables, and would move laterally by exploiting SMB on\nWindows systems. It would spread via PowerShell and avoided encrypting Russianlanguage systems.\n\nA new version of LockBit, called LockBit 2.0, began appearing in late 2019. The wallpaper\nthat was set on victim systems would attempt to recruit internal affiliates or members of the\nvictim organization to help further the infection and provide additional data for exfiltration in\nexchange for payment. LockBit 2.0 also attempted to recruit outside affiliates by advertising\nfaster encryption speed than the first version of LockBit as well as other Ransomware\n\n\n-----\n\nvariants. Delivery is typically via phishing, where a dropper is installed. C2 communication\nbegins shortly after and additional tools are downloaded. Data exfiltration then occurs,\nfollowed by data encryption.\n\nOnce LockBit is installed on a system, Cobalt Strike and remote access tools are also\ninstalled. Some of these tools are legitimate, which helps to avoid detection. Data is then\nexfiltrated for additional ransom if payment is not made. LockBit 2.0 samples employ antianalysis techniques similar to BlackMatter, where strings are encrypted until runtime.\nShadow volume copies are deleted on victim systems prior to encryption. When encrypting\nfiles, the extension is changed to .lockbit and a custom icon is set to display for that file type.\nIt then looks for connected drives and network volumes, creates a ransom note in all\ndirectories, encrypts the files, and changes the desktop background to a ransom message.\nOne of the final steps is to print the ransom note to any connected printers.\n\n**Target Geolocations: Asia, North America, South America, Europe**\n**Target Data: Any**\n**Target Businesses: Any**\n**Exploits: N/A**\n\n**MITRE ATT&CK for LockBit**\n**Initial Access: Unconfirmed**\n**Persistence: Registry Run Keys / Startup Folder**\n**Evasion: Virtualization/Sandbox Evasion**\n**Collection: Data From Local System**\n**Exfiltration: Exfiltration Over Command and Control Channel**\n\n**IOCs**\n\n**Domains:**\nNone\n\n**IPs:**\n139.60.160[.]200\n168.100.11[.]72\n174.138.62[.]35\n185.215.113[.]39\n193.162.143[.]218\n193.38.235[.]234\n45.227.255[.]190\n88.80.147[.]102\n93.190.143[.]101\n\n\n-----\n\n**Additional Information:**\n[LockBit ransomware now infects Windows domains using group policies](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/)\n[LockBit Resurfaces With version 2.0 Ransomware Detections in Chile, Italy, Taiwan, UK](https://www.trendmicro.com/en_us/research/21/h/lockbit-resurfaces-with-version-2-0-ransomware-detections-in-chi.html)\n\n**Which Cisco Products Can Block:**\nCisco Secure Endpoint\nCisco Cloud Web Security\nCisco Network Security\nCisco Secure Network Analytics\nCisco Secure Cloud Analytics\nCisco Secure Malware Analytics\nCisco Umbrella\nCisco Secure Web Appliance\n\n## Threat Name: THOR\n\n**Threat Type: RAT**\n\n**Attack Chain:**\n\n**Description: THOR is a variant of the PlugX Remote Access Tool (RAT). PlugX RATs have**\nbeen in use since 2008 and have the ability to upload, download, and modify files, perform\nkeystroke logging, webcam control, and provide access to a remote shell. THOR is unique\nfrom previous PlugX variants in that it changed the word ‘PLUG’ to ‘THOR’ in its source\ncode. It is further differentiated from past PlugX RATs by its use of modified payload delivery\nmechanisms and the use of trusted binaries on a victim system to accomplish its goals. It\nfirst appeared in March, 2021 as part of an attack on Exchange Servers via CVE-202126855 and CVE-2021-27065.\n\n\n-----\n\n**THOR Spotlight: THOR is a new variant of the PlugX malware, which has been involved in**\ntargeted attacks and intrusions since 2008. PlugX is often installed as a second-stage\nimplant following the initial infection. It’s built for modular use, allowing the use of plug-ins to\nachieve specific objectives. Delivery is via malicious documents in phishing emails and C2\ncommunication occurs after infection. Additional components may be downloaded after\ncommunication begins.\n\nIn March of 2019, two zero-day exploits (CVE-2021-26855 and CVE-2021-27065) were\ndiscovered affecting Microsoft Exchange Servers. These exploits were used to upload a\nwebshell to a publicly accessible web directory, allowing code execution, the ability to write\nmalicious files to any path, run commands, escalate privilege, and allow remote access. In\nthe attacks, a variant of PlugX was being used to install a remote access tool. This variant\nhad a modification in its source code, changing a well-known variable name from PLUG to\nTHOR.\n\nWhen run, a legitimate Windows binary is used to download a dropper, which is designed to\nremain undetected and can only be run with a specific loader. All variants of PlugX require\nthe use of DLL side-loading to run. The downloaded dropper has its first 1000 bytes filled\nwith random padding until it has a NULL byte, signaling the beginning of the file. When\nloaded into memory, the code unpacks and communication with a command and control (C2)\nserver begins.\n\nWhen running, THOR behaves the same as previous PlugX variants, decrypting hard-coded\nand embedded configuration settings. Communication with the C2 server is over ports 80,\n443, 53, and 8000 using UDP and TCP. While the first handshake with the C2 looks like\nHTTP data, it is made of random bytes with variable lengths. If the return value from the C2\nis the correct length, actual HTTP communication between the victim and C2 starts. Various\nvalues in the C2 traffic are hard-coded, such as the user-agent and a known PlugX constant.\nWhen installation is complete, a Windows system service named HP Digital Image is created\nand system events are logged to a hidden file labeled NTUSER.dat. The MZ and PE headers\nof the running module are removed and replaced with ROHT, which is THOR written\nbackwards.\n\nThe primary goals of THOR and other PlugX variants are to monitor, make changes, and\ninteract with the system, as well as to install additional malware.\n\n**Target Geolocations: Myanmar, Taiwan, Vietnam, Indonesia, Mongolia, Tibet, Xinjiang**\n**Target Data: Any**\n**Target Businesses: Any**\n**Exploits: CVE-2021-26855, CVE-2021-27065**\n\n**MITRE ATT&CK for THOR**\n**Initial Access: Spearphishing Attachments, Malspam**\n**Persistence: Server Software Component**\n\n\n-----\n\n**Evasion: Deobfuscate/Decode Files or Information, Hide Artifacts**\n**Collection: Audio Capture, Clipboard Data, Input Capture, Screen Capture, Video Capture**\n**Exfiltration: Exfiltration Over Command and Control Channel**\n\n**IOCs**\n\n**Domains:**\napple-net[.]com\ndestroy2013[.]com\nemicrosoftinterview[.]com\nfitehook[.]com\nflashplayerup[.]com\nindonesiaport[.]info\nmanager2013[.]com\nrainydaysweb[.]com\nupload.ukbbcnews[.]com\n\n**IPs:**\n185.239.226[.]65\n45.251.240[.]55\n58.158.177[.]102\n\n**Additional Information**\nTHOR: Previously Unseen PlugX Variant Deployed During Microsoft Exchange Server\nAttacks by PKPLUG Group\n[PKPLUG: Chinese Cyber Espionage Group Attacking Southeast Asia](https://unit42.paloaltonetworks.com/pkplug_chinese_cyber_espionage_group_attacking_asia/)\n[Take a Deep Dive into PlugX Malware](https://logrhythm.com/blog/deep-dive-into-plugx-malware/)\n\n**Which Cisco Products Can Block:**\nCisco Secure Endpoint\nCisco Cloud Web Security\nCisco Network Security\nCisco Secure Network Analytics\nCisco Secure Cloud Analytics\nCisco Secure Malware Analytics\nCisco Umbrella\nCisco Secure Web Appliance\n\n## See security in action\n\nLet one of our experts show you how Cisco Umbrella can simplify your security and protect\nyour users everywhere.\n\n[Schedule a demo](https://umbrella.cisco.com/schedule-a-demo?utm_medium=web-referral)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-18 - BlackMatter, LockBit, and THOR.pdf"
    ],
    "report_names": [
        "2021-11-18 - BlackMatter, LockBit, and THOR.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "93542ae8-73cb-482b-90a3-445a20663f15",
            "created_at": "2022-10-25T16:07:24.058412Z",
            "updated_at": "2025-03-27T02:02:10.093621Z",
            "deleted_at": null,
            "main_name": "PKPLUG",
            "aliases": [
                "Stately Taurus"
            ],
            "source_name": "ETDA:PKPLUG",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535570,
    "ts_updated_at": 1743041807,
    "ts_creation_date": 1653760062,
    "ts_modification_date": 1653760062,
    "files": {
        "pdf": "https://archive.orkl.eu/dd273dd8da867cdaa50dda190882138a75b4b864.pdf",
        "text": "https://archive.orkl.eu/dd273dd8da867cdaa50dda190882138a75b4b864.txt",
        "img": "https://archive.orkl.eu/dd273dd8da867cdaa50dda190882138a75b4b864.jpg"
    }
}