{
    "id": "866cef23-43b0-4623-b6d8-fc031cdcfb70",
    "created_at": "2023-01-12T15:05:34.644976Z",
    "updated_at": "2025-03-27T02:05:26.185882Z",
    "deleted_at": null,
    "sha1_hash": "71ffe1db440dbd906ba516937d42538447e62174",
    "title": "2022-02-28 - Threat Actor targeted attack against Finance and Investment industry (ENG)",
    "authors": "",
    "file_creation_date": "2022-05-28T23:22:22Z",
    "file_modification_date": "2022-05-28T23:22:22Z",
    "file_size": 1262860,
    "plain_text": "# Threat Actor targeted attack against Finance and Investment industry (ENG)\n\n**[redalert.nshc.net/2022/02/28/threat-actor-targeted-attack-against-finance-and-investment-industry-eng/](https://redalert.nshc.net/2022/02/28/threat-actor-targeted-attack-against-finance-and-investment-industry-eng/)**\n\n## Overview\n\nAmidst confusion due to the COVID-19 pandemic in the world, cyber hacking activities\nthrough malware are continuing in various industries.\n\nAmong them, a specific form of malware themed on finance and investment industries has\nbeen continuously identified recently, and it is believed that attacks are targeted on workers\nin the industry. Referring to Figure 1, the hacking activities were against targeting finance\nand investment industries located in various parts of the world, and countries colored in\ndarker shades of red were found to have a higher rate of attack.\n\n[Figure 1: Hacking activities against finance and investment industry]\n\nIn this report, we identify the activities the document type malware used against finance and\ninvestment industries for over at least a year and the characteristics of the hacking activities.\n\n\n-----\n\n## Attacks flow and analysis of Word malware used in the attacks\n\nThe first Word malware identified by the NSHC ThreatRecon Team was last edited in August\n2020 by a user named “Nord”. From the file name, the malware was disguised as a NonDisclosure Agreement (NDA) file of an investment company located in Spain, and had a\nworkflow as shown in Figure 2.\n\nLundbergs NDA Mutual Form.docx\nBE17FDBE8D7E674EC397CD457DDA1B78824ED6597CDEF665D1ADBF31EAF58D66\n\n[Figure 2: Attack flow of the distributed Word malware]\n\nThe attacker initially used attachments to a spear phishing email or a similar attacking\nmethod to pass on the malware disguised as a Non-Disclosure Agreement file related to a\nfinancial investment to the workers in the industry.\n\nWhen the target executes the Word malware passed on through email or other ways, the\nWord document embed with malicious macro or a Word template with vulnerabilities are\ndownloaded. It is analyzed that other malware such as RAT (Remote Administration Tool) are\nadditionally downloaded into the target organization system through this attack technique.\n\n## A. Word document that leads to content activation\n\nWhen the target activates the found Word malware, the activated Word screen displays a\nmessage ‘This document has been secured by Kaspersky. To view this protected content,\nClick “Enable Content”’ and leads the target to activate the contents.\n\nIn addition, the contents shown in the background of the image was identified to be a NonDisclosure Agreement related to the company mentioned in the title of the Word document.\n\n\n-----\n\n[Figure 3: Word malware execution screen]\n\n## B. Remote Template Injection\n\nThe disseminated malware does not contain macro scripts, and when the Word malware is\nactivated, it is seen to access a specific address as shown in Figure 4.\n\n\n-----\n\n[Figure 4: Attempt to access C2 server upon Word document execution]\n\nThe attacker uses normal functions of OOXML(Office Open XML) formatted Word\ndocuments to carry out the malicious activities. For Word documents that use template files,\nan external template can be downloaded and executed by modifying the Setting.xml.rels file.\nHowever, the current payload being additionally downloaded are not identified.\n\nhttps://lundbergs[.]cc/6cjmh0mczuykox148kbxttlm5ocfa2y3cyjcdv3zrxlswb5hs1boyw==\n\n[Figure 5: C2 server included in Settings.xml.rels file]\n\n## Relation between the targets of the hacking group and the Word malware\n\nThe attackers make use of various tactics to make the target interested and distributes the\nmalware. The document title and the contents used in the malwares provide clear\ninformation regarding the proven tactics, and the malware distributed from the hacking group\nsince 2020 is as shown in Figure 6.\n\n\n-----\n\n[Figure 6: Current situation of all Word malwares distributed since August 2020 to now]\n\nThe identified malware is disguised as investment companies located in various parts of the\nworld such as Sweden, USA, Japan, and contains document titles and contents that pull the\ninterest of all companies and workers in the finance and investment industry.\n\n\n-----\n\n[Figure 7: Part of page an executed Word document]\n\n\n-----\n\n[Figure 8: Part of the document content set as hidden elements]\n\nThe original document content included in the Word malware contains openly revealed\ndocuments, but also contains restricted documents and the CEO’s handwritten signature, so\nis analyzed that there is a possibility that information has already been distributed through\nunderground hacking communities and darkwebs.\n\n\n-----\n\n[Figure 9: Word document with handwritten signature]\n\n## Characteristics and correlation of Word malware\n\n A. Metadata of document malwares\n\nThe metadata of the Word document used in hacking activities contains properties\ninformation and characteristics, and the associations with other hacking resources. From the\nmetadata in core.xml, app.xml, settings.xml within the Word document, the correlation of\ndocuments used by the attackers can be verified, and the similarity between the documents\nwere also identified.\n\n(1) Name of last user to edit the document\n\nWord malwares with the document template applied has a template name following it, and\nthe template information is included in the docProps\\app.xml. The following are the template\nnames included in the Word malwares identified until now.\n\n**Last modified user name:**\n\n\n-----\n\nNord\n\nNever\n\n(2) Name of template\n\nWord malwares with the document template applied has a template name following it, and\nthe template information is included in the docProps\\app.xml. The following are the template\nnames included in the Word malwares identified until now.\n\n**Template name:**\n\nReport .dotx\nSingle spaced (blank).dotx\nAPA style report (6th edition).dotx\nBlue curve letterhead.dotx\nInsert your first table of contents tutorial.dotx\n\nBlue spheres cover letter.dotx\n\n(3) docId\n\ndocId is a unique identifier contained by the Word document and is included in\nWord\\settings.xml. The following are the docid of the Word malwares identified until now.\n\n**docid:**\n\n{0F5E949A-4017-445B-97B7-3CB064E583DF}\n{1F179ADB-02CF-4A51-820D-20B798FDFF46}\n{76DBC1C4-9921-4935-B8A9-9B3167BB1700}\n{81D6A9AD-4211-4696-97A5-6897FE7766B7}\n{861123BC-1DAC-4C24-964C-E9447C597276}\n{B44EC542-F37B-44A7-A5B3-617396920BEF}\n\n{BB154D86-973E-4497-9CC3-F86A34B8EEA0}\n\n## B. C2 Server and certification\n\nThe domain used by the hacking group in their activities are disguised as companies in\ninvestment, cryptocurrency market, blockchain, energy innovation and software sectors.\n\n\n-----\n\nSo far, the number of domains identified is 82, and the number of IP allocated to domains are\n10, all of them registered under HOSTWINDS web hosting companies, allocated in the range\nof 104.168.128.0/17\n\n[Figure 10: Number of domains assigned to IP]\n\nTo conceal the network traffic for the payload attempting downloads from the C&C server, the\nattacker received a SSL(Secure Socket Layer) certificate that was free to use for 90 days.\nThe CN(Common Name) is detected as ET TROJAN Observed Malicious SSL Cert\n**(Lazarus APT MalDoc 2020-11-30) by several online sandbox services.**\n\n[Figure 11: A section of the extracted certificate information]\n\n\n-----\n\nThe attack group uses a multi domain certificate which includes multiple domains in a single\ncertificate, and continuously receives new certificates instead of renewing of the existing one.\nWhen a new certificate is issued, the C2 server is managed by adding a new domain or\ndeleting the previous domain\n\n[Figure 12: Certificate using multi domain]\n\nThe identified number of CN issued a certificate as of now is 5, and the current situation of\ncertificate issuance can be found in figure 13.\n\n\n-----\n\n[Figure 13: History of certificate issuance]\n\n## Attribution of hacking groups\n\nConsidering the C2 server’s certificate issuance including domain information and the time of\ndiscovery of the Word malware, the hacking group is believed to have been preparing the\nvarious hacking resources and malware for their hacking activities since before August 2020.\nAdditionally, from the contents of the documents including the Word malware created by the\nhacking group, the hacking group is targeting finance and investment industries, or the\nworkers of the sector, or the people associated with the industry.\n\nTo prevent cybersecurity organizations from detecting the attack, the hacking group used the\nRemote Template Injection method, which downloads the macro for serving malicious\nfunctions or templates with vulnerabilities from the C2 server prepared by the hacking groups\nonly when the targets of the hacking group access the Word document.\n\nTaking these situations into consideration, the hacking group is believed to attempt hacking\nwith the purpose of stealing financial investment information or financial transaction\ninformation from the financial and investment industry.\n\nWith regards to this, there are some associations found in relation to the hacking activities of\na certain government-supported hacking group, but based on the findings so far, it is difficult\nto conclude that the hacking activities are hacking activities by a certain governmentsupported hacking group with the purpose of stealing financial assets.\n\n## Conclusion\n\nThe hacking group undergoing hacking activities against financial and investment related\nindustries for at least a year are using the Remote Template Injection method.\n\nThey are taking advantage of the fact that there are difficulties in detecting Word format\n\n\n-----\n\ndocuments without malicious functions from the defender s point of view, so there is a need\nto monitor documents in Word format or trials of connecting to external networks by related\nfiles.\nIn addition, special attention is needed by financial and investment related companies and\ninstitutions which holds information and data such as financial and investment information,\nthat can be directly linked to financial profits in the real world.\n\n## IOC(Indicator of Compromised)\n\nThe IOC information related to hacking activities of the hacking group mentioned above can\nbe found in ThreatRecon Team Github below.\n\nThreat Actor targeted attack against Finance and Investment industry\n\nhttps://github.com/nshc-threatrecon/IoC[List/blob/master/Threat%20Actor%20targeted%20attack%20against%20Finance%20and%2](https://github.com/nshc-threatrecon/IoC-List/blob/master/Threat%20Actor%20targeted%20attack%20against%20Finance%20and%20Investment%20industry)\n0Investment%20industry\n\n## MITRE ATT&CK TECHNIQUES\n\n**Initial access**\n\nSpearphishing Attachment – T1193\n\n**Execution**\n\nCommand-Line Interface – T1059\n\nExecution through API – T1106\n\nScripting – T1064\n\nUser Execution – T1204\n\n**Defense evasion**\n\nHidden Window – T1143\n\nMasquerading – T1036\n\nScripting – T1064\n\nTemplate Injection – T1221\n\nWeb Service – T1102\n\n\n-----\n\n**Discovery**\nFile and Directory Discovery – T1083\nSystem Information Discovery – T1082\nSystem Network Connections Discovery – T1049\n\n**Lateral movement**\nRemote File Copy – T1105\n\n**Collection**\nData from Local System – T1005\nAutomated Collection – T1119\n\n**Command and control**\nCommonly Used Port – T1043\nRemote File Copy – T1105\nStandard Application Layer Protocol – T1071\nWeb Service – T1102\n\n**Exfiltration**\nAutomated Exfiltration – T1020\nExfiltration Over Command-and-Control Channel – T1041\n\nThe full report detailing each event together with IoCs (Indicators of Compromise) and\nrecommendations is available to existing NSHC ThreatRecon customers. For more\n[information, please contact RA.global@nshc.net.](http://10.10.0.46/mailto:RA.global@nshc.net)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - Threat Actor targeted attack against Finance and Investment industry (ENG).pdf"
    ],
    "report_names": [
        "2022-02-28 - Threat Actor targeted attack against Finance and Investment industry (ENG).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535934,
    "ts_updated_at": 1743041126,
    "ts_creation_date": 1653780142,
    "ts_modification_date": 1653780142,
    "files": {
        "pdf": "https://archive.orkl.eu/71ffe1db440dbd906ba516937d42538447e62174.pdf",
        "text": "https://archive.orkl.eu/71ffe1db440dbd906ba516937d42538447e62174.txt",
        "img": "https://archive.orkl.eu/71ffe1db440dbd906ba516937d42538447e62174.jpg"
    }
}