{
    "id": "868b6996-d16d-4450-a4dd-b6a48b6b3244",
    "created_at": "2023-01-12T15:02:54.93616Z",
    "updated_at": "2025-03-27T02:08:33.391868Z",
    "deleted_at": null,
    "sha1_hash": "b7a8f570006cc26fcdfbfe2f054329487f740efd",
    "title": "2022-08-30 - NanoCore RAT Hunting Guide",
    "authors": "",
    "file_creation_date": "2022-09-01T10:26:48Z",
    "file_modification_date": "2022-09-01T10:26:48Z",
    "file_size": 707980,
    "plain_text": "# NanoCore RAT Hunting Guide\n\n**[medium.com/@the_abjuri5t/nanocore-rat-hunting-guide-cb185473c1e0](https://medium.com/@the_abjuri5t/nanocore-rat-hunting-guide-cb185473c1e0)**\n\nJohn F August 30, 2022\n\n[John F](https://medium.com/@the_abjuri5t?source=post_page-----cb185473c1e0--------------------------------)\n\nAug 30\n\n\n9 min read\n\n## Analysis and tools for hunting NanoCore command-and-control\n\nNanoCore is a prevalent RAT (Remote Access Trojan) which is used by threat actors to spy\n[on victims and provide remote access to target computers. CISA identified NanoCore as a](https://www.cisa.gov/uscert/ncas/alerts/aa22-216a)\ntop malware strain of 2021 due to its prevalence among cyber criminals and potential to\ncause damage. I have researched NanoCore’s command-and-control framework and I wrote\nthis blog post as a guide for hunting-down and blocking NanoCore.\n\n## Table of Contents\n\n Background and Functionality\n\n\n-----\n\n[In 2013, Taylor Huddleston (arrested in 2017) wrote NanoCore using the .NET framework.](https://www.fbi.gov/news/stories/malware-creator-sentenced-070518)\nDespite its age, the RAT remains popular among cyber-criminals and malware-as-a-service\nmarkets because of its ease of use for non-technical threat actors and various plugin\n[features. NanoCore is widely used today with ANY.RUN Trends documenting it as the 8th](https://any.run/malware-trends/)\nmost-common malware strain in July 2022.\n\nAs a RAT, NanoCore is well-suited for providing initial access, stealing information, and\nspying on victims. Historically, NanoCore’s remote access and spyware capabilities have\nbeen used to attack businesses, stalk victims, and conduct espionage for nation-state\ngroups¹. There are multiple NanoCore plugins which can be purchased (or stolen/cracked)\nfrom cyber-crime forums to add new features and capabilities — though NanoCore’s base\npayload is already capable of:\n\naccessing files\nexecuting programs\nstealing saved passwords\nlogging keystrokes\nand surveilling webcams\n\nNanoCore payloads are primarily controlled from a GUI installed on the threat actor’s\ncomputer. The GUI functions as both a payload builder and command-and-control panel.\nUsing the GUI to create and operate NanoCore payloads requires limited technical\nknowledge as there is no shell involved and the interface provides guiding documentation.\nOnce built and deployed, a threat actor can control single agents or an entire collection of\nbots from the panel.\n\nFigure 1: Experiments with NanoCore platform included builder configurations and traffic\nanalysis.\n\n\n-----\n\n_I downloaded cracked NanoCore platforms and used them to conduct experiments inside_\n_virtual machines. It’s disturbing to see the “community” which forms around malware-as-a-_\n_service capabilities…_\n\n## Command-and-Control Analysis\n\nAt start-up, a NanoCore payload will query the domain name of its assigned C2 (Commandand-Control) server and then attempt to use the answered IP address for all of its\ncommunications². NanoCore payloads are configured with 8.8.8.8 as their primary DNS\nserver and 8.8.4.4 as a backup. Some payloads are also configured with primary and\nsecondary C2 domains — though in practice, many threat actors just list the same C2 twice.\n\nA NanoCore payload will then send an ‘introduction’ message to its C2 server with basic\ncontext about the payload configuration and the infected target host. Following an\nacceptance message from its C2 server, NanoCore will then begin sending a ‘heartbeat\nmessage’ to the C2 server in order to let the server know that the payload is still active and\nto request new tasks. NanoCore will encode these heartbeat messages to the C2 server as\n_0x00000600. Experiments show that NanoCore will send these heartbeat messages almost_\nimmediately after processing the C2’s response — leading to a stream of communication\n(unlike other RATs/agents which may only communicate once every several minutes). The\ngeneric heartbeat messages are interspersed with commands and requests from the C2\nserver itself. Most often, these messages are automated requests for status updates though\nthey will also include commands initiated by the threat actor.\n\nFigure 2: PCAP of server DNS request, C2 introduction message, and encrypted heartbeat\nThe content of the messages sent from NanoCore to its C2 server will be encrypted using a\ncustom protocol over TCP. NanoCore uses DES to encrypt the contents of its messages\n(curiously, the DES key and IV have the same value). The length of the message ciphertext\n\n\n-----\n\nis then appended to the front of the TCP data payload and sent to the C2 server. I wrote a\n[CyberChef recipe to help explain NanoCore’s custom protocol and decrypt its messages.](https://gchq.github.io/CyberChef/#recipe=From_Hexdump()To_Hex('Space',0)Find_/_Replace(%7B'option':'Regex','string':'%5E%5B0-9a-fA-F%5D%5B08%5D%2000%2000%2000%20'%7D,'',true,false,false,false)From_Hex('Auto')Comment('%22722018788C294897%22%20is%20the%20most%20common%20Key/IV%20pair%20used%20by%20NanoCore%20in%20the%20wild')DES_Decrypt(%7B'option':'Hex','string':'722018788C294897'%7D,%7B'option':'Hex','string':'722018788C294897'%7D,'CBC','Raw','Raw')To_Hexdump(16,false,false,false)&input=MDAwMCAgIDA4IDAwIDAwIDAwIGMxIGMzIGQwIDMyIDQzIDU5IGExIDc4)\n\nFigure 3: Debugging of NanoCore’s method for message encryption — including IV/Key\nvalues\n_For more analysis of NanoCore’s actual code, check-out the awesome reverse engineering_\n_conducted by and ._\n\n## Network Defenses\n\n Signature-Based Detection\n\nNanoCore’s encryption of its C2 communications makes PCAP analysis and signature\nmapping more difficult. The custom protocol which NanoCore implements, however,\ninadvertently creates patterns that can be leveraged to develop network signatures³. There\nare a few DES Keys/IVs that have been hard-coded into NanoCore strains and are\ncommonly used in different payloads — even those appearing to belong to unique threat\nactors. Accurate network signature rules for tools such as Snort can be written to monitor for\nNanoCore’s heartbeat message, as encrypted by these common keys.\n```\n# NanoCore ’heartbeat’ signature (0x00000600) encrypted by common keyalert tcp any\nany -> any any (msg:\"NanoCore ’heartbeat’ signature\";flags:PA;dsize:12;content:\"|08\n00 00 00 c1 c3 d0 32 43 59 a1 78|\";)\n\n```\n\n-----\n\nSeveral less-popular NanoCore strains have begun changing their DES Keys/IVs — making\nthe encryption of the heartbeat message difficult to predict. The command-and-control\nmessages from these rarer strains can still be detected by taking-advantage of NanoCore’s\ncustom protocol. In the protocol, the first 4 bytes of a TPC payload are used to encode the\nlength of a message and the possible lengths are limited due to the protocol’s reliance on\nDES. NanoCore’s custom C2 messaging protocol can still be detected regardless of Key/IV\nby searching the first 4 bytes of TCP data and matching the value to the message length.\n```\n# NanoCore command-and-control custom message protocolalert tcp any any -> any any\n(msg:\"NanoCore DES length 08\";flags:PA;dsize:12;content:\"|08 00 00\n00|\";depth:4;)alert tcp any any -> any any (msg:”NanoCore DES length\n40\";flags:PA;dsize:68;content:\"|40 00 00 00|\";depth:4;)\n\n```\n[By implementing these network signature rules into a monitoring tool such as Snort or](https://github.com/Abjuri5t/Hunting-NanoCore/blob/main/NanoCore-C2-protocol.rules)\nSuricata, you will be alerted to an infected host sending NanoCore’s ‘introduction’ to the C2\nserver, the encrypted ‘heartbeat’, and all subsequent communications which use its custom\nmessage protocol.\n\n_The rules have been released publicly in my GitHub repository NanoCore-Hunting._\n_Additionally, I strongly encourage you to monitor for C2 traffic as well as outgoing. I have_\n_worked with cloud services, small businesses, and others in the past to help them take-down_\n_malicious C2 servers that they were unknowingly hosting. It is better to handle hosting abuse_\n_before your infrastructure is used to harm others._\n\n## Infrastructure Blocking\n\nTraditional network blocking solutions can of course be used to deny access to NanoCore C2\nservers — though these methods require constant updating. With a DNS sinkhole deployed⁴,\nDNS requests from NanoCore can be answered with an incorrect IP address to redirect\nNanoCore from its real C2 server — though this redirection is only possible if the DNS\nsinkhole is configured with the payload’s domain name (for more information, see Palo Alto’s\n[explanation of DNS sinkholes). Simple firewalls can also be deployed to block⁵ connection](https://docs.paloaltonetworks.com/pan-os/10-2/pan-os-admin/threat-prevention/use-dns-queries-to-identify-infected-hosts-on-the-network/dns-sinkholing)\nattempts to known NanoCore IP addresses but again, this blocking solution only works if the\nC2 server’s address is known and added to the blocklist.\n\n_The following lists are based on the hundreds of recently-active NanoCore C2s I verified_\n_while researching the RAT. The lists likely do not include all active NanoCore C2s but they_\n_should block a decent amount of connections._\n\n[IP-list.txt](https://raw.githubusercontent.com/Abjuri5t/Hunting-NanoCore/master/IP-list.txt) [domain-list.txt](https://raw.githubusercontent.com/Abjuri5t/Hunting-NanoCore/master/domain-list.txt) [Indicators-of-Compromise.csv](https://raw.githubusercontent.com/Abjuri5t/Hunting-NanoCore/master/Indicators-of-Compromise.csv)\n\nThose of you familiar with my SarlackLab project know that I track malicious infrastructure —\nnot to look for specific IOCs but to gather intelligence and get a better picture of the Internet\nthreat landscape.\n\n\n-----\n\n## Meta-Analysis of IOCs\n\nI set my malware analysis lab to collect and analyze thousands of NanoCore samples\nthroughout the Spring and Summer of 2022. By analyzing network traffic generated during\nsample detonation and cross-referencing apparent C2 traffic with malware configuration\nextractors, I confirmed the existence of hundreds of NanoCore C2 servers.\n\n## Domain Patterns\n\nI analyzed trends among the NanoCore C2 servers I had identified and uncovered patterns\nfor server domains as well as suspicious hosting providers. Almost all of the domain names I\nfound are legible and do not appear to be high-entropy or randomized. Many of the Fully\nQualified Domain Names (FQDNs) have the same second-level domains (see Figure 4) — of\nwhich most appear to be tied to dynamic record and redirection services.\n\nFigure 4: Second-Level Domains of NanoCore C2 Domain Names\nThe second-level domains ddns[.]net, duckdns[.]org, hopto[.]org, bounceme[.]net, and\n3utilities[.]com appeared in almost 80% of all NanoCore FQDNs. The listed second-level\ndomains are tied to Dynamic DNS services which their FQDNs appear to be utilizing. The\nservice ngrok[.]io, however, is a distributed reverse proxy that is commonly used as a\nnetwork tunnel for hosting gaming servers or file shares — though it also has a history of\nabuse.\n\n\n-----\n\n```\n (abbreviated as DDNS) is built upon common (DNS) technology but uses special\nauthoritative DNS servers. Unlike traditional DNS records, which have static IP\naddresses that can take up to 24 hours to update, Dynamic DNS records can be updated\nrapidly using their highly-responsive authoritative DNS servers (such as\nduckdns[.]org). Dynamic DNS can be used for the benign purpose of resolving dynamic\nIP addresses (ie addresses granted by a home ISP) - however Cybercriminals Dynamic\nDNS to in an attempt to survive server take-downs and IP blocking.\n\n```\nI have used DNS sinkholes to great effect in denying access from hosts to various C2\nservers — regardless of how threat actor modify their DNS or DDNS records. Personally, I\nrecommend sinkholing⁴ DNS requests to all subdomains of the identified infrastructure and\nauthoritative DDNS servers, then only allowing specific FQDNs as-needed⁶. By configuring\nsuch a sinkhole, many NanoCore payloads will be unable to resolve the IP address of the C2\nserver — even if the payload is attempting to connect to a novel subdomain, not yet\nidentified as an IOC.\n\n## Part 2 — TLP:GREEN\n\nThere is a second part to this command-and-control meta-analysis which is labeled\n[TLP:GREEN. If you are interested, contact me via](https://www.cisa.gov/tlp) [Twitter and I will send you a copy of the](https://twitter.com/Abjuri5t/)\nresearch.\n\n## Hunting Summary\n\nNanoCore is a powerful remote access trojan that remains popular among cybercriminals\ntoday. To hunt-down NanoCore command-and-control communications in your network, look\n[for the signature of its custom messaging protocol (see published rules). You can of course](https://github.com/Abjuri5t/Hunting-NanoCore/blob/main/NanoCore-C2-protocol.rules)\n[attempt blocking individual IPs and sinkholing specific domains — but I recommend](https://raw.githubusercontent.com/Abjuri5t/Hunting-NanoCore/master/IP-list.txt)\nconsidering the overall trends of malicious traffic on the Internet and denying access to\n[commonly malicious infrastructure. Please contact me on Twitter, if you have any feedback](https://twitter.com/Abjuri5t)\nor wish to contribute.\n\n## See Also\n\nOther work on NanoCore analysis (technical deep-dives). Config extractor. Other places to\nwatch.\n\nFull break-down of IOCs available at\nCyberChef recipe\n\n## Footnotes\n\n[1] According to [research compiled by MITRE ATT&CK, groups back by nation-states have](https://attack.mitre.org/software/S0336/#groups)\nbeen attributed to the use of NanoCore.\n\n\n-----\n\n[2] In my research, I found a couple of NanoCore payloads which used hard-coded IP\naddresses. The overwhelming trend among threat actors, however, appears to be relying on\ndomain names because the hosting IP addresses may change.\n\n[3] I work for Vectra AI as a Network MDR Analyst. I honestly believe that network metadata\nand AI models (ya, I said it) are the best indicators of malicious activity in a network. That\nbeing said, signatures and IOCs are useful as part of a complete balanced b̶r̶e̶a̶k̶f̶a̶s̶t̶\ndefense. I wrote a Vectra custom model based on these IDS signatures which Recall\ncustomers can install.\n\n[4] When configuring your DNS sinkhole, remember to re-direct all DNS requests to your\nlocal server. Otherwise, NanoCore’s DNS requests will just go to 8.8.8.8 and the sinkhole will\nfail.\n\n[5] Make sure you log these connection attempts as well and consider setting an alert for\nthem. Just because you have blocked a C2 server does not mean that you have completely\nmanaged the threat.\n\n[6] Check your SIEM and/or firewall logs before applying these restrictions. Depending on\nhow locked-down your network is, you may accidentally block an important service that\nhappens to be using ngrok or similar.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-30 - NanoCore RAT Hunting Guide.pdf"
    ],
    "report_names": [
        "2022-08-30 - NanoCore RAT Hunting Guide.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535774,
    "ts_updated_at": 1743041313,
    "ts_creation_date": 1662028008,
    "ts_modification_date": 1662028008,
    "files": {
        "pdf": "https://archive.orkl.eu/b7a8f570006cc26fcdfbfe2f054329487f740efd.pdf",
        "text": "https://archive.orkl.eu/b7a8f570006cc26fcdfbfe2f054329487f740efd.txt",
        "img": "https://archive.orkl.eu/b7a8f570006cc26fcdfbfe2f054329487f740efd.jpg"
    }
}