{
    "id": "869d4b6b-0212-47d7-ac31-d3784920609e",
    "created_at": "2023-01-12T15:07:46.827115Z",
    "updated_at": "2025-03-27T02:05:38.002392Z",
    "deleted_at": null,
    "sha1_hash": "96eba640c5a224058a1dddb77e493064bd08087c",
    "title": "2018-10-02 - DanaBot Gains Popularity and Targets US Organizations in Large Campaigns",
    "authors": "",
    "file_creation_date": "2022-05-28T19:51:29Z",
    "file_modification_date": "2022-05-28T19:51:29Z",
    "file_size": 3574965,
    "plain_text": "# DanaBot Gains Popularity and Targets US Organizations in Large Campaigns\n\n**[proofpoint.com/us/threat-insight/post/danabot-gains-popularity-and-targets-us-organizations-large-campaigns](https://www.proofpoint.com/us/threat-insight/post/danabot-gains-popularity-and-targets-us-organizations-large-campaigns)**\n\nOctober 2, 2018\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nDanaBot Gains Popularity and Targets US Organizations in Large Campaigns\n\n\n-----\n\nOctober 02, 2018 Proofpoint Staff\n\n**Overview**\n\nProofpoint researchers first discovered DanaBot in May of 2018 [1], describing its use by a single actor\ntargeting Australian organizations. As we predicted at the time, other threat actors targeting Europe and\nNorth America have since adopted the banking Trojan, increasing its footprint and taking advantage of\nits extensive anti-analysis features. In this blog we describe a campaign affecting organizations in the\nUnited States and present new reverse engineering analysis of DanaBot.\n\n**Recent DanaBot Campaigns**\n\nOur colleagues at ESET recently blogged about DanaBot campaigns and described the latest\nexpansion of targeted countries to include Poland, Italy, Germany, and Austria [2]. We have also\nobserved several campaigns since May targeting Australia. Finally, at the end of September, an actor\nthat typically targets the United States with daily campaigns distributing the Panda banking Trojan\nswitched to delivering DanaBot for a day.\n\n**Hancitor Campaign**\n\nOn September 26, Proofpoint researchers observed a campaign with hundreds of thousands of email\nmessages targeting US recipients. The emails used an eFax lure (Figure 1) and contained a URL\nlinking to the download of a document containing malicious macros (Figure 2). The macros, if enabled\nby the user, executed the embedded Hancitor malware [3], which, in turn, received tasks to download\ntwo versions of Pony stealer and the DanaBot banking malware. You can find a more in-depth analysis\nof the recent macros used by this actor [in a post written by 0verfl0w [4].](https://0ffset.wordpress.com/2018/08/12/post-0x16-hancitor-stage-1/)\n\n\n-----\n\n_Figure 1: Message example with URLs linking to the download of a document containing macros that_\n_download the Hancitor payload_\n\n\n-----\n\n_Figure 2: Macro document that contains the Hancitor payload_\n\n**Malware Analysis (v2.003)**\n\nAs previously described, DanaBot is a banking malware written in the Delphi programming language.\nThis section continues our analysis of DanaBot by examining details of version 2.003. This is the latest\nversion that we have seen in the wild, first appearing in early September. The version number is based\non a version string (Figure 3) that is sometimes transmitted when the malware sends data to the\ncommand and control (C&C) server.\n\n_Figure 3: DanaBot’s version string being sent to the C&C server along with system information_\n\n\n-----\n\nDanaBot is composed of three components:\n\n1. Loader: downloads and loads main component\n2. Main component: downloads, configures, and loads modules\n3. Modules: various malware functionality\n\nAnti-analysis\n\nDanaBot includes a significant amount of junk code including extra instructions, conditional statements,\nand loops. When combined with the use of Delphi, these features dramatically impair reverse\nengineering. In addition, DanaBot uses Windows API function hashing and encrypted strings to prevent\nanalysts and automated tools from easily determining the code’s purpose.\n\nA version of the API hashing algorithm written in Python [7], a list of the resolved Windows API\nfunctions used in the loader [8] and the main component [9] are available on Github.\n\nThe characters of the encrypted strings are stored as an array of DWORDs and are decrypted using a\nkey and a basic substitution cipher. An IDA Pro Python script [10] and a list of decrypted strings used in\nthe loader [11] and the main [12] component are available on Github.\n\nCommand & Control IPs\n\nIn both the loader and main components there is a list of 10 C&C IP addresses stored as DWORDs.\nFigure 4 shows an example from a memory dump of a loader component:\n\n_Figure 4: Example of C&C IP addresses in a memory dump of DanaBot’s loader component_\n\nNote: Please see the “C&C Infrastructure” section for a potential caveat about these hard-coded IP\naddresses.\n\nC&C Communications\n\n\n-----\n\nIn the previous versions we analyzed, DanaBot s loader component used HTTP for communications\nand its main component used a binary protocol. In version 2.003, both components use a binary\nprotocol over TCP port 443. Despite the port number, it does not use TLS.\n\nThe protocol has some quirks, but in general consists of a 183-byte header followed by optional\npayload data. Most of the header values in a request are echoed back in the response header. If there\nis payload data, the format depends on the particular command.\n\nBinary Protocol Header\n\nAn example of the header is shown in Figure 5.\n\n_Figure 5: Example 183-byte header used in DanaBot’s binary protocol_\n\nIt can be broken down into the following fields:\n\nOffset 0: random values (stack junk) (DWORD)\nOffset 4: hardcoded -1 (DWORD)\nOffset 8: command (DWORD)\nOffset 0xc: affiliate ID (DWORD)\nOffset 0x10: hardcoded 1 (DWORD)\nOffset 0x14: random value based on a linear congruential generator (DWORD)\nOffset 0x18: unknown counter variable (DWORD)\nOffset 0x1c: system architecture (DWORD)\nOffset 0x20: Windows version information (DWORD)\nOffset 0x24: command argument (DWORD)\nOffset 0x28: admin status (DWORD)\nOffset 0x2c: process integrity level (DWORD)\nOffset 0x30: payload length (QWORD)\n\nDepending on the command this can contain random values (stack junk) instead\n\n\n-----\n\nOffset 0x38: length of next field (BYTE)\nOffset 0x39: bot ID (32 bytes)\n\nMD5 hex digest of various system information\nOffset 0x59: length of next field (BYTE)\nOffset 0x5a: command-dependent (32 bytes)\n\nCan be used as part of an encryption key; in this case, it would be the MD5 hex digest of the\nbot ID (offset 0x39)\nCan be used as a module identifier when requesting a module\nOffset 0x7a: length of next field (BYTE)\nOffset 0x7b: a nonce (32 bytes)\nOffset 0x9b - end of header: random values (stack junk)\n\nCommands\n\nWe have identified and analyzed the following commands. The first command is performed by the\nloader, while the rest are performed by the main component.\n\nCommand 0x454 (1108): “Request main component”\n\nThis command is used by the loader to request the main component from the C&C server. The\ncommand argument (offset 0x24 in the header) will contain the integer “32” or “64” to request either the\nx86 version or x64 version of the component. The response payload contains encrypted data and an\nencrypted 128-byte RSA signature block used to verify the data. A decryption key is generated by the\nCryptDeriveKey Windows API function where it is initialized by taking the MD5 digest of the value at\noffset 0x5a in the header. Data is AES-256-CBC-encrypted using an initialization vector (IV) of 16 null\n(\\x00) bytes. The decrypted data is the main component DLL which will be executed by rundll32.exe.\n\nCommand 0x453 (1107): “Initial beacon”\n\nThis is the first command sent by the main component to the C&C server. There is no data in the\nrequest or the response, so we believe this is just an initial beacon.\n\nCommand 0x44c (1100): “Request module identifiers”\n\nThis command is used by the malware to request a list of module identifiers from the C&C server.\nFigure 6 shows an example response listing these 6 module identifiers:\n\n759CBB3E1B883BDCA23E9052462F641E\nE0FBBC92DB9927BFC474A64DF4F9C22F\nD0C851FBCA030928B535FAF3188DAFBA\nA5BBBAB3A17BA2119F47F0E4316EE5BF\n4F06D71C93E4105307339704D21C49A3\n8C59B6C9985F983E248E27CC0BF98A2D\n\n\n-----\n\n_Figure 6: Command 0x44c response payload data containing a list of module identifiers_\n\nCommand 0x44d (1101): “Request module”\n\nThis command is used to request a module from the C&C server. To indicate what module to download,\nfield at offset 0x5a in the header will contain a module identifier (received via command 0x44c). The\nresponse payload data will contain a 1699-byte subheader, encrypted data, and a encrypted 128-byte\nRSA signature block used to verify the data. Figure 7 shows an example subheader:\n\n_Figure 7: Command 0x44d response payload data containing 1699-byte subheader_\n\nThe following fields have been identified in this subheader:\n\nOffset 0: total length of subheader and data (QWORD)\nOffset 8: hardcoded -1 (DWORD)\n\n\n-----\n\nOffset 0x10: module name (520-byte wide string)\nOffset 0x218: module filename (520-byte wide string)\nOffset 0x649: length of next field (BYTE)\nOffset 0x64a: module identifier (32 bytes)\nOffset 0x682: module architecture (DWORD)\nOffset 0x686: module type (DWORD)\nOffset 0x68e: data is ZLIB-compressed flag (DWORD)\nOffset 0x692: length of encrypted data (QWORD)\n\nA decryption key (used to decrypt the module) is generated by the CryptDeriveKey Windows API\nfunction where it is initialized by the following process:\n\n1. Copying the 1699-byte subheader into a buffer and zeroing the following fields:\n\n1. Offset 0: total length of subheader and data (QWORD)\n2. Offset 0x692: length of encrypted data (QWORD)\n2. The buffer is MD5 hashed\n3. The uppercase hex digest of the hash is itself MD5 hashed\n\nData is AES-256-CBC-encrypted using an initialization vector (IV) of 16 null (\\x00) bytes. The decrypted\ndata is optionally ZLIB compressed and once decompressed contains a module DLL that will be\nexecuted by rundll32.exe\n\nTable 1: List of modules typically seen\n\n\n**Module identifier** **Name** **Old**\n**name**\n\n\n**Functionality**\n\n\n759CBB3E1B883BDCA23E9052462F641E FF1 Sniffer Proxy\n\nE0FBBC92DB9927BFC474A64DF4F9C22F FF2 Stealer Stealer module\n\nD0C851FBCA030928B535FAF3188DAFBA FF3 NA 64-bit version of Stealer module\n(new)\n\n8C59B6C9985F983E248E27CC0BF98A2D FF4 NA RDP module (new)\n\nA5BBBAB3A17BA2119F47F0E4316EE5BF FF5 TOR TOR proxy\n\n4F06D71C93E4105307339704D21C49A3 FF6 VNC VNC\n\nCommand 0x44f (1103): “Get configuration files”\n\nThis command is used by the malware to request configuration files from the C&C. It has a quirk where\nafter the malware receives the 183-byte response header, the malware sends “\\xff\\xff\\xff\\xff\\xff\\xff\\xff\\xff”\nbefore the C&C server responds with the response payload data. The payload data is formatted and\n\n\n-----\n\nencrypted like a module, but multiple configuration files are sent (multiple 1699-byte subheader,\nencrypted data, and signature packages).\n\nTable 2: Configuration files typically seen\n\n\n**Config**\n**filename**\n\n\n**Variants** **Purpose** **Comments**\n\n\nBitVideo VVie Processes to watch For screenshots/video recording\nperhaps\n\nKeyBit BitKey, VKey Processes to watch For keylogging possibly\n\nBitFiles Vfiles, VBit Cryptocurrency wallet files to\nsteal\n\n\nPosWtFilter PostWFilter,\nVFilter\n\n\nList of websites for which to\nsteal requests\n\n\nPosWtFilter may be a typo (in affiliate\nIDs 3 and 9)\n\n\nwebinj33 uabanks Proxying config Incrementing versions\n\n\n**inj25** InjectZZ,\nInjectSW\n\n\nWebinjects Incrementing versions; Zeus-style\ninjects\n\n\nThis command is used by the malware to send data to the C&C such as the system information (Figure\n3 above) or a screenshot. The request payload data contains a 656-byte subheader, encrypted data,\nand encrypted session key (Figure 8 shows an example subheader):Command 0x44e (1102): “Send\ndata to C&C”\n\n_Figure 8: Command 0x44e request payload data containing 656-byte subheader_\n\nThe following fields have been identified in the subheader:\n\n\n-----\n\nOffset 0: total length (QWORD)\nOffset 8: hardcoded -1 (DWORD)\nOffset 0xc: affiliate ID (DWORD)\nOffset 0x17: length of next field (BYTE)\nOffset 0x18: bot ID (32 bytes)\nOffset 0x38: length of next field (BYTE)\nOffset 0x39: MD5 hex digest of plaintext data (32 bytes)\nOffset 0x5a: filename (520-byte wide string)\nOffset 0x264: data type (DWORD)\nOffset 0x270: system time (unknown format) (QWORD)\nOffset 0x280: timezone bias (DWORD)\nOffset 0x288: encrypted data length (QWORD)\n\nData can be ZLIB-compressed and AES-256-CBC-encrypted using an initialization vector (IV) of 16 null\n(\\x00) bytes. The encryption key is generated using the CryptDeriveKey Windows function and RSAencrypted using an embedded RSA public key. The RSA-encrypted AES key is then appended to the\nend of the encrypted data.\n\nTable 3: Files typically seen sent\n\n**Filename** **Comments**\n\ndesktopscreen.bmp Screenshot\n\nCookies.txt Stored web browser cookies\n\n“System Info\" Various system information\n\nC&C Infrastructure\n\nWhile we do not have specific visibility into DanaBot’s back-end infrastructure, we have observed some\nnoteworthy behavior that allows some speculation.\n\nAs noted above, DanaBot uses a loader to download its main component from a C&C server. The main\ncomponent contains a list of 10 hardcoded C&C IP addresses that are used for malware\ncommunications. Our first observation was that the hardcoded C&C lists changed approximately every\nhour when a main component was downloaded. We downloaded the main component in hourly\nintervals for 24 hours and analyzed the C&C lists. Each sample’s list turned out to be different. Overall\nwe ended up with 240 IP addresses (available on Github [13]) with 194 (80%) of them being unique.\nThe top 10 overlapping IPs were:\n\n158.255.215[.]31 (in 7 lists)\n149.154.152[.]64 (in 7 lists)\n37.235.53[.]232 (in 6 lists)\n95.179.151[.]252 (in 5 lists)\n178.209.51[.]227 (in 5 lists)\n149.154.157[.]220 (in 5 lists)\n\n\n-----\n\n45.77.54[.]180 (in 4 lists)\n45.77.96[.]198 (in 3 lists)\n45.77.51[.]69 (in 3 lists)\n45.77.231[.]138 (in 3 lists)\n\nOut of the total list of possible C&C IPs, only the following 10 (4%) seemed responsive:\n\n149.154.152[.]64\n149.154.157[.]220\n158.255.215[.]31\n178.209.51[.]227\n37.235.53[.]232\n45.77.231[.]138\n45.77.51[.]69\n45.77.54[.]180\n45.77.96[.]198\n95.179.151[.]252\n\nInterestingly, these synced up with the overlapping IP list. We also noted that the overall IP list\ncontained some unrouteable IPs such as:\n\n10.181.255[.]78\n225.100.146[.]224\n225.21.55[.]173\n226.181.243[.]104\n228.226.171[.]37\n234.106.187[.]114\n234.63.249[.]87\n234.97.12[.]178\n235.40.105[.]171\n238.87.111[.]55\n\nAs a result of these observations, we can speculate that the main component may contain only a few\nreal C&Cs while the rest are random decoys.\n\n**Affiliate System**\n\nBased on distribution methods and targeting, we have been grouping DanaBot activity using an “affiliate\nID” that we have observed in various part of the C&C protocol (e.g., offset 0xc of the 183-byte binary\nprotocol header). At the time of publication, we observed the following affiliate IDs:\n\n\n**Affiliate**\n**ID**\n\n\n**Targeting** **Distribution**\n\n\n3 Poland, Austria, Germany,\nItaly\n\n\nZipped-VBS attachments in email campaigns\n\n\n4 Australia Links in email campaigns\n\n\n-----\n\n5 No webinjects unknown\n\n8 UK, Ukraine, and Canada Various email campaigns\n\n9 Same as affiliate ID 3 Fallout Exploit Kit\n\n11 US, No webinjects Hancitor downloader malware from links in email\ncampaigns\n\n12 Australia unknown\n\n13 Germany unknown\n\n20 No webinjects unknown\n\nWe observed that DanaBot samples with different affiliate IDs seem to use some of the same C&C IP\naddresses. At this point we speculate that DanaBot may be set up as a “malware as a service” system\nin which one threat actor controls a global C&C panel and infrastructure system and then sells access\nto other threat actors (affiliates) who distribute and target DanaBot as they see fit.\n\n**Comparison with CryptXXX Ransomware**\n\nProofpoint blogged about CryptXXX file-encrypting ransomware in 2016 [5] and noted that it shared\nmany similarities with Reveton “police” ransomware. In particular, we noted that it was written in Delphi\nand used a custom command and control protocol on TCP port 443.\n\nDanaBot’s C&C traffic appears to be an evolution of this protocol, now using AES encryption in addition\nto the Zlib compression. For example, in the traffic included in the Malware Traffic Analysis blog [6], the\ninitial CryptXXX checkin format is:\n\n_Figure 9: CryptXXX checkin format_\n\nThe following fields are among those common to both CryptXXX and DanaBot:\n\nOffset 0: length of next field (BYTE)\nOffset 2: bot ID (32 bytes)\n\n\n-----\n\nOffset 0x34 : length of compressed buffer\nOffset 0x38: Zlib-compressed buffer (0x4e bytes)\n\nThe compressed buffer decodes to:\n\n_Figure 10: Decoded payload buffer_\n\nThe following fields have been identified in the decoded buffer:\n\nOffset 4: length of next field (BYTE)\nOffset 5: bot ID (32 bytes)\nOffset 0xce : length of next field (BYTE)\nOffset 0xcf : Affiliate ID (7 bytes)\nOffset 0xfc : length of next field (BYTE)\nOffset 0xfd : Version string (5 bytes)\netc\n\nLater on in the communication there is a (decoded) request to download a “Stealer” module “stiller.dll”:\n\n_Figure 11: Decoded request to download the “Stealer” module\\_\n\nThus it would seem that Danabot follows in a long line of malware from one particular group. This family\nbegan with ransomware, to which stealer functionality was added in Reveton. The evolution continued\nwith CryptXXX ransomware and now with a banking Trojan with Stealer and remote access functionality\nadded in Danabot.\n\n**Conclusion**\n\n\n-----\n\nWhen we first discovered DanaBot, we predicted that it would likely be picked up by other actors.\nDistribution of this malware has now extended well beyond Australia, with campaigns targeting Poland,\nItaly, Germany, Austria, and, more recently, the United States. DanaBot is a banking Trojan, meaning\nthat it is necessarily geo-targeted to a degree. Adoption by high-volume actors, though, as we saw in\nthe US campaign, suggests active development, geographic expansion, and ongoing threat actor\ninterest in the malware. The malware itself contains a number of anti-analysis features, as well as\nupdated stealer and remote control modules, further increasing its attractiveness and utility to threat\nactors.\n\n**References**\n\n[1] https://www.proofpoint.com/us/threat-insight/post/danabot-new-banking-trojan-surfaces-down-under0\n\n[2] [https://www.welivesecurity.com/2018/09/21/danabot-targeting-europe-adds-new-features/](https://www.welivesecurity.com/2018/09/21/danabot-targeting-europe-adds-new-features/)\n\n[3] [https://www.proofpoint.com/us/threat-insight/post/hancitor-ruckguv-reappear](https://www.proofpoint.com/us/threat-insight/post/hancitor-ruckguv-reappear)\n\n[4] [https://0ffset.wordpress.com/2018/08/12/post-0x16-hancitor-stage-1/](https://0ffset.wordpress.com/2018/08/12/post-0x16-hancitor-stage-1/)\n\n[5] https://www.proofpoint.com/us/threat-insight/post/cryptxxx-new-ransomware-actors-behind-revetondropping-angler\n\n[6] [http://malware-traffic-analysis.net/2016/04/20/index.html](http://malware-traffic-analysis.net/2016/04/20/index.html)\n\n[7] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/func_hashes.py](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/func_hashes.py)\n\n[8] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/loader_func_hashes.txt](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/loader_func_hashes.txt)\n\n[9] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/main_func_hashes.txt](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/main_func_hashes.txt)\n\n[10] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/decrypt_str_ida.py](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/decrypt_str_ida.py)\n\n[11] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/loader_strings.txt](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/loader_strings.txt)\n\n[12] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/main_strings.txt](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/main_strings.txt)\n\n[13] [https://github.com/EmergingThreats/threatresearch/blob/master/danabot/24_hours_of_ips.txt](https://github.com/EmergingThreats/threatresearch/blob/master/danabot/24_hours_of_ips.txt)\n\n**Indicators of Compromise (IOCs)**\n\n\n**IOC** **IOC**\n**Type**\n\n\n**Description**\n\n\n288615e28672e1326231186230f2bc74ea84191745cc40369d49bf385bf9669b SHA256 DanaBot\nLoader\n(affiliate ID\n8)\n\n\n-----\n\n45.77.96.198 IP\nAddress\n\n\nDanaBot\nLoader C&C\n\n\n57cac2bdc44415c6737149bda8fc4e53adfab7d35cac3de94ced9d6675f1c5db SHA256 DanaBot\nMain x64\n(affiliate ID\n8)\n\n1184c7936c82f1718f9e547be4a8eeaa1c16c2f16790e2b5ae66a870a17b7454 SHA256 DanaBot\nMain x86\n(affiliate ID\n8)\n\n\n149.154.152.64 IP\nAddress\n\n149.154.157.220 IP\nAddress\n\n158.255.215.31 IP\nAddress\n\n178.209.51.227 IP\nAddress\n\n37.235.53.232 IP\nAddress\n\n45.77.231.138 IP\nAddress\n\n45.77.51.69 IP\nAddress\n\n45.77.54.180 IP\nAddress\n\n45.77.96.198 IP\nAddress\n\nHancitor Campaign IOCs:\n\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\nDanaBot\nMain C&C\n\n\n-----\n\ngenesislouisville[.]com Domain Link to\nmacro\ndocument\n\ngenesisofdallas[.]com Domain Link to\nmacro\ndocument\n\ngenesisoflouisville[.]com Domain Link to\nmacro\ndocument\n\ngenesisofportland[.]com Domain Link to\nmacro\ndocument\n\nkccmanufacturing[.]com Domain Link to\nmacro\ndocument\n\nlouisvillegenesis[.]com Domain Link to\nmacro\ndocument\n\nlouisvilleride[.]com Domain Link to\nmacro\ndocument\n\nmotionscent[.]com Domain Link to\nmacro\ndocument\n\noxmoorautomall[.]com Domain Link to\nmacro\ndocument\n\nridesharelouisville[.]com Domain Link to\nmacro\ndocument\n\n6dcf41dd62e909876e9ef10bd376ea3a6765c2ecb281844fc4bebd70bfebeb27 SHA256 Macro\ndocument\n\nc82081823ba468ad2d10c4beca700a7bf0ba82b371bc57286cc721e271019080 SHA256 Hancitor\n\n\n-----\n\nhxxp://tontheckcatan[.]ru/4/forum[.]php URL Hancitor\nC&C\n\nhxxp://onthethatsed[.]ru/4/forum[.]php URL Hancitor\nC&C\n\nhxxp://kitezona[.]ru/wp-content/plugins/redirection/modules/1 URL Hancitor\nTask\n\nhxxp://xn--hllo-bpa[.]com/guestlist/1 URL Hancitor\nTask\n\nhxxp://music-open[.]com/1 URL Hancitor\nTask\n\nhxxp://allnicolerichie[.]com/wp-content/plugins/ubh/1 URL Hancitor\nTask\n\nhxxp://mpressmedia[.]net/wp-content/plugins/ubh/1 URL Hancitor\nTask\n\nhxxp://bwc[.]ianbell[.]com/wp-content/plugins/ubh/1 URL Hancitor\nTask\n\nhxxp://kitezona[.]ru/wp-content/plugins/redirection/modules/2 URL Hancitor\nTask\n\nhxxp://xn--hllo-bpa[.]com/guestlist/2 URL Hancitor\nTask\n\nhxxp://music-open[.]com/2 URL Hancitor\nTask\n\nhxxp://allnicolerichie[.]com/wp-content/plugins/ubh/2 URL Hancitor\nTask\n\nhxxp://mpressmedia[.]net/wp-content/plugins/ubh/2 URL Hancitor\nTask\n\nhxxp://bwc[.]ianbell[.]com/wp-content/plugins/ubh/2 URL Hancitor\nTask\n\nhxxp://kitezona[.]ru/wp-content/plugins/redirection/modules/4 URL Hancitor\nTask\n\n\n-----\n\nhxxp://xn--hllo-bpa[.]com/guestlist/4 URL Hancitor\nTask\n\nhxxp://music-open[.]com/4 URL Hancitor\nTask\n\nhxxp://allnicolerichie[.]com/wp-content/plugins/ubh/4 URL Hancitor\nTask\n\nhxxp://mpressmedia[.]net/wp-content/plugins/ubh/4 URL Hancitor\nTask\n\nhxxp://bwc[.]ianbell[.]com/wp-content/plugins/ubh/4 URL Hancitor\nTask\n\n9a816d9626f870617400df384d653b02a15ad940701b4fb2296e1abe04d3777f SHA256 DanaBot\n\nhxxp://tontheckcatan[.]ru/mlu/forum[.]php URL Pony C&C\n\nhxxp://onthethatsed[.]ru/mlu/forum[.]php URL Pony C&C\n\nhxxp://tontheckcatan[.]ru/d2/about[.]php URL Pony C&C\n\nhxxp://onthethatsed[.]ru/d2/about[.]php URL Pony C&C\n\n**ET and ETPRO Suricata/Snort Signatures**\n\n2819978 | ETPRO TROJAN Tordal/Hancitor/Chanitor Checkin\n\n2014411 | ET TROJAN Fareit/Pony Downloader Checkin 2\n\n2831891 | ETPRO CURRENT_EVENTS Hancitor Encrypted Payload Jul 19\n\n2832816 | ETPRO TROJAN Win32/DanaBot CnC Checkin (affid 11)\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-10-02 - DanaBot Gains Popularity and Targets US Organizations in Large Campaigns.pdf"
    ],
    "report_names": [
        "2018-10-02 - DanaBot Gains Popularity and Targets US Organizations in Large Campaigns.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536066,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653767489,
    "ts_modification_date": 1653767489,
    "files": {
        "pdf": "https://archive.orkl.eu/96eba640c5a224058a1dddb77e493064bd08087c.pdf",
        "text": "https://archive.orkl.eu/96eba640c5a224058a1dddb77e493064bd08087c.txt",
        "img": "https://archive.orkl.eu/96eba640c5a224058a1dddb77e493064bd08087c.jpg"
    }
}