{
    "id": "86a3c36c-5bb0-4101-b463-2ee31dea9e46",
    "created_at": "2023-01-12T15:10:22.089741Z",
    "updated_at": "2025-03-27T02:16:25.937188Z",
    "deleted_at": null,
    "sha1_hash": "b4c62748a7df694df560d076bdab7a372fcb495b",
    "title": "2021-08-02 - All Access Pass- Five Trends with Initial Access Brokers",
    "authors": "",
    "file_creation_date": "2022-05-28T03:57:41Z",
    "file_modification_date": "2022-05-28T03:57:41Z",
    "file_size": 7008049,
    "plain_text": "# All Access Pass: Five Trends with Initial Access Brokers\n\n**[ke-la.com/all-access-pass-five-trends-with-initial-access-brokers/](https://ke-la.com/all-access-pass-five-trends-with-initial-access-brokers/)**\n\nAugust 2, 2021\n\nFor more than a year, KELA has been tracking Initial Access Brokers and the initial network\n_access listings that they publish for sale on various cybercrime underground forums. Initial_\n_Network Access refers to remote access to a computer in a compromised organization._\nThreat actors selling these accesses are referred to as Initial Access Brokers. Initial Access\nBrokers play a crucial role in the ransomware-as-a-service (RaaS) economy, as they\nsignificantly facilitate network intrusions by selling remote access to a computer in a\ncompromised organization and linking opportunistic campaigns with targeted attackers, often\nransomware operators.\n\nThis research includes an in-depth analysis of Initial Access Brokers and their activity for a\nfull year from July 1, 2020 to June, 30 2021. KELA analyzed IABs’ activities over the last\nyear (when their role became increasingly more popular in the cybercrime underground) and\nsummarized 5 major trends that were observed throughout our analysis.\n\n## Background\n\nKey research takeaways include:\n\nKELA explored over 1000 access listings offered for sale over the last year. The\naverage price for network access during this period was 5,400 USD, while the median\nprice was 1,000 USD. The top affected countries included the US, France, UK,\nAustralia, Canada, Italy, Brazil, Spain, Germany, and UAE.\nIABs built a pricing model for initial access. The most valuable offers include domain\nadmin privileges on a computer within a company with hundreds of millions in revenue.\nWith RDP and VPN-based access being the most common offer, IABs find new attack\nvectors and accommodate the changing software targets of ransomware gangs,\nincluding network management software and virtual servers.\n\n\n-----\n\nSuccessful IABs find regular customers, some of which are ransomware affiliates, and\nmove most of their operations to private conversations. However, new actors\ncontinually enter the scene.\nSome IABs adopted ethics that were introduced by some ransomware gangs. Namely,\nthere is a certain criticism against actors trading access to healthcare companies,\nthough it’s still an initiative of a few actors and not a typical attitude.\nIABs are eager to monetize their access and are using all means to do so. Some IABs\nwere seen stealing data from the affected company to gain profits even if the access is\nnot bought.\nIABs have become professional participants of the RaaS economy. They constantly\nfind new initial access vectors, expanding the attack surface, and follow their\ncustomers’ demands. It requires network defenders to track IABs activities and all other\nactors who have formed around ransomware.\n\n## Introduction: The Not-So-Secret Life of An Initial Access Broker\n\n[Nearly one year ago, KELA released a blog about the life of initial access brokers, as they](https://ke-la.com/the-secret-life-of-an-initial-access-broker/)\nbecame more active and popular in the cybercrime underground ecosystem. During a year\nwhere remote work became mandatory, Initial Access Brokers began identifying further\nintrusion points that can be exploited. Companies were forced to implement work-from-home\nwith little to no preparation for this on the security front. Remote connections – created\nquickly and not always securely – opened more treasures for Initial Access Brokers that were\n\n\n-----\n\nlooking for entry points into organizations networks. This shift in the real world gave way to\nInitial Access Brokers in the cybercrime underground who were trying to establish a name\nand place for themselves.\nOver one single year of analysis, KELA has already observed some successful IABs\nchanging their method of selling – from once offering their sales publicly on underground\nforums to shifting the majority of their trading into private conversations. Now, as the\neconomy continues to grow, we not only see trends emerging amongst existing Initial Access\nBrokers, but we see many new sellers entering the zone.\n\n## Network Access Eases Ransomware Attacks: Case Studies\n\nBefore diving into the major trends that KELA observed in the world of Initial Access Brokers,\nKELA laid out some recent case studies to illustrate the significance of compromised network\naccess listed for sale. Though researchers cannot always assess exactly how many attacks\nhappened following the purchase of the initial network access on sale, KELA was able to\nanalyze some examples to confirm the links between access for sale and ransomware\nattacks.\n\nOn February 20, 2021, the DarkSide operators published a blog post claiming to have\ncompromised Gyrodata, a US technology provider in the energy industry. On January 16,\n2021, a month before Darkside claimed Gyrodata as a victim, an initial access broker was\nobserved selling access to the company. On January 18, 2021, the access was sold –\nprobably to a ransomware affiliate that leveraged it to infect the network. Gyrodata’s\ninvestigation of the incident determined that the unauthorized actor gained access to certain\nsystems and related data within the company’s environment at various times from\napproximately January 16, 2021 to February 22, 2021, which corresponds with the findings.\n\n\n-----\n\n_Gyrodata’s access on sale_\n\nAnother instance involves Avaddon ransomware operators publishing a blog post on March\n31, 2021, claiming they breached a UAE supplier of steel products. At the beginning of\nMarch, a threat actor offered for sale access to the same company. Since the offer was made\nabout a month before Avaddon disclosed the victim, it is possible that the actor sold the\naccess to one of Avaddon’s affiliates who then exploited it to get into the system and infiltrate\nthe network with the ransomware.\n\nThese examples perfectly showcase the need for monitoring activities from the cybercrime\nunderground. Monitoring for network access sales could significantly reduce the chances of\na ransomware attack on an organization. The time between network access for sale, and a\nransomware attack occurring is not imminent, therefore the earlier the detection of weakness\nin your organization’s network, the better chances your security team will have to mitigate\nthat weakness and prevent further damage from a ransomware attack.\n\nInitial Access Brokers continue to become more popular in the cybercrime underground\necosystem, and as their notoriety grows, KELA’s researchers observed 5 trends that\nemerged among them.\n\n## Trend 1. Pricing Based on Company Size and Level of Privileges Within the Compromised Network\n\n**The average price for network access during July 2020-June 2021 was 5,400 USD,**\n**while the median price was 1,000 USD. 25% of the listings published were allegedly**\n**sold. Over this past year, KELA observed Initial Access Brokers creating a pricing model for**\n\n\n-----\n\naccess sales. While some actors are ready to work for a percentage (a share from the\namount gained in a successful ransomware attack), the majority of IAB prefer to stick to the\nfixed prices.\nThe pricing model seems to be mainly dependent on the revenue and the size of the affected\ncompany; therefore, companies from all geographies and all sectors can be affected. Still,\naccess to US companies is the most popular type, though it is not only because IABs\nspecifically target the country, but because the US has more profitable companies making\nthem particularly interesting for threat actors. It’s important to note that it does not mean that\nIABs only sell access to large companies – there are plenty of offers to small firms for about\n100-200 USD per offer – but the most pricey offers usually involve corporations that are\nlucrative for attackers.\n\nAnother important metric for setting the price is the level of privileges that the access\nenables, of which the domain admin type is the most expensive. KELA’S recent findings\nshow that average domain admin access costs at least 10 times more than access to a\nmachine with user rights.\n\nThe priciest offers from reputable threat actors KELA observed included:\n\n\n-----\n\nAccess to an Australian company with 500 million USD in revenue that enables an\nattacker with “admin” level of privileges (most likely domain admin) offered for 12 BTC\nAccess through ConnectWise to a US IT company offered for 5 BTC\nAccess to a Mexican government body offered for 100,000 USD and used for the\nLockBit ransomware attack\n\n## Trend 2. Diversification of Access Grows\n\nThe term “network access” is very loosely defined; threat actors use it to describe multiple\ndifferent vectors, permission levels, and entry points. Over a year, KELA observed that the\n**most common offer is RDP- and VPN-based access, usually provided in the form of**\n**valid credentials. Such remote access can be supplied through the ConnectWise and**\nTeamViewer software, which provide actors with RDP-like capabilities. VPN access can be\ngained and sold through various software, such as Citrix, Fortinet, and Pulse Secure\nproducts – just to name a few popular ones among cybercriminals. After accessing a\ncompromised machine via such access, an intruder can try to move laterally and eventually\nsteal sensitive information, execute commands, and deliver malware.\n\nIn addition, IABs are finding new attack vectors and ways to supply access to buyers,\n**meaning that the attack surface is expanding. For example, access to VMWare’s ESXi**\n**servers which have recently become quite popular among ransomware attackers (for**\n**example, REvil and Darkside have versions of their malware targeting ESXi) appeared**\n**on the market. It seems that ESXi became targeted by IABs and ransomware affiliates only**\nin 2020.\n\n\n-----\n\n**Moreover, the news of the year – SolarWinds’ and Kaseya’s products being used in a**\n**global cyber espionage/criminal campaign – bring attention to network management**\n**solutions that attackers can exploit.**\n\nFor example, KELA has seen an actor offering access through remote monitoring and\nmanagement tools, which can be attractive to threat actors, particularly for ransomware\ngangs. It allows multiple operations to be carried out on the network, including remote control\nof hosts and – maybe most importantly – running custom scripts remotely on groups of\nendpoint devices. While describing the type of access, the threat actor described the range\nof capabilities usually in demand by ransomware attackers, including even changing\nwallpaper, which can be used to announce that the system is encrypted. Another example of\nnetwork management software being abused – access on sale related to the DX NetOps and\nDX Spectrum network monitoring and fault management software.\n\n\n-----\n\n_Description of RMM access offered for sale_\n\n## Trend 3. Successful IABs Are Going Quiet\n\nThe number of active Initial Access Brokers and listings on sale has been changing over the\npast year. While the year 2020 saw an abundance and increase in access listings for sale,\nthe year 2021 showed different dynamics. The average number of access on sale per\nquarter was growing during Q3 and Q4 of 2020 and Q1 2021. However, in Q2 2021, the\naverage number per month declined by 35%; while in Q1 2021, we’ve seen more than 100\n**access listings on sale every month, this number decreased in Q2. It doesn’t**\nnecessarily mean that Initial Access Brokers suspended their activity, rather KELA concluded\nthat the decrease is due to the fact that IABs simply moved part of the deals to private\n**correspondence with middlemen or ransomware affiliates in an effort to avoid**\n**detection from researchers and law enforcement agencies.**\n\n\n-----\n\nNot all IABs operate in private-mode, though. Based on the actors whose activity KELA\ntracks, it seems that once new Initial Access Brokers enter the field, they first try to gain\nreputation and establish themselves as experienced sellers by posting many access listings\npublicly on forums. Then, some of them find returning buyers and reduce their number of\npublic offers. Most likely, KELA has observed that these IABs will proceed with public sales if\ntheir regular customers are not interested.\n\nAnother instance in which we see IABs selling their offerings in private is when they publicly\npost a partial list of accesses that they are selling and offer to share the complete list in\nprivate. These brokers generally are interested in getting one buyer for all the accesses\nbeing sold and sometimes go as far as to request a percentage of the ransom if an attack is\nsuccessful.\n\n\n-----\n\n_Threat actors looking for buyers for multiple accesses. The left post offers “70 Citrix accesses from Tier 1_\n_countries”, while the right post’s author claims to have a constant supply of domain admin accesses that_\n_he is ready to sell to one buyer._\n\nThe core of the active actors is constantly changing, and the scene is continually replenished\nwith new sellers entering the RaaS supply chain. Selling accesses on forums is just the\n**tip of the iceberg: successful IABs more likely trade access listings directly with**\n**[ransomware affiliates, especially after the ransomware ban on two major](https://www.bleepingcomputer.com/news/security/ransomware-ads-now-also-banned-on-exploit-cybercrime-forum/)** **Russian-**\n**speaking forums. Therefore, tracking the access listings requires not only monitoring IABs’**\n“surface” activities but also communicating with them.\n\n## Trend 4. Professional Ethics Appear Following Ransomware Gangs’ Blacklists\n\nAs some ransomware gangs, such as DarkSide, promised not to target certain sectors, new\nethics seem to be established among actors participating in the RaaS economy. Depending\non the gangs, they were seen forbidding their affiliates to attack healthcare, government,\neducation, and non-profit sectors to not to cause damage to patients, students, citizens, and\n\n\n-----\n\nother categories of people. The ransomware gangs seemed to pass a message they hunt\nonly companies and aim only for financial gain.\n**Following this trend, some IABs try to reduce the number of access to companies**\n**from particular sectors. KELA** [saw actors posting victims from the healthcare sector and](https://ke-la.com/to-attack-or-not-to-attack-targeting-the-healthcare-sector-in-the-underground-ecosystem/)\nthen deleting the offers after the criticism from other users. However, there are still no rules\n**on this matter: most of the brokers still sell all the accesses they were able to gain.**\nAnd as always, IABs trading in Russian-speaking forums do not attack Russia, following the\nrules of the forums.\n\n## Trend 5. Monetizing Access in All Ways\n\nChasing money, actors look for different ways to monetize the gained access. KELA spotted\n**some actors using accesses for their own benefit to steal data from the victims before**\n**posting the access on sale – allowing them to monetize the access gained in a couple**\n**different ways.**\n\nFor example, in November 2020, we observed a threat actor offering domain admin access\nto Pakistani Airlines’ Network for 4,000 USD on two Russian-speaking cybercrime forums\nand one English-speaking forum. A week after putting up access to the airline’s network, the\nactor announced that he was also selling all the databases from the airline’s network. He\nstated that he had around 15 databases with different amounts of records — some around\n500k records and some around 60k–50k records. Therefore, the actor took two different\napproaches to try and monetize, leveraging the network access to the airline’s network that\nhe obtained to exfiltrate the company’s data.\n\n\n-----\n\nAnother example is an actor who claimed to have VPN access to a company that\nmanufactures electronic products “owned by every fifth person in the world.” The company’s\nrevenue he shared narrowed the circle up to several major players in the electronic goods\nmarket. Two weeks later, the mystery was solved when he opened another thread and\nadmitted that the access was found and burned by security researchers. The actor claimed\nthe breached company was Panasonic India and that he managed to steal some corporate\ndata for which he asks a $500,000 ransom. Apparently, Panasonic decided not to react to\n[this statement since the actor posted a stolen archive a few days later.](https://www.bankinfosecurity.com/panasonic-india-held-to-500k-ransom-data-released-a-15573)\n\n## KELA’s Solution for Monitoring Initial Access Brokers\n\nAs expressed throughout this research, Initial Access Brokers have grown tremendously\nover the last year, and new players are entering the field to earn their profits. Trends\nemerging amongst Initial Access Brokers is proof to the fact that they are changing\noperations in an effort for them to continue their work.\n\nTracking IABs public activity on underground forums is crucial for network defenders willing\nto understand the threat landscape and prevent damaging cyber-attacks. KELA’s offerings –\nsuch as LUMINT, providing handpicked insights from the dark web, and DARKBEAST,\nKELA’s technology used for cybercrime research and investigations – provides defenders\n[with the possibility to hunt Initial Access Brokers and their offers. Continually monitoring such](https://ke-la.com/hunting-down-initial-access-brokers-with-darkbeast/)\nactivity, patching the vulnerable software, and educating employees, is an approach that\nshould be taken into service by all organizations that want to avoid the post-factum\n\n\n-----\n\nnegotiations with the ransomware operators.\n_By subscribing to KELA’s LUMINT you’ll gain immediate access to insights from the dark_\n_[web at your fingertips for free. Click here to subscribe today.](https://lumint.ke-la.com/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-02 - All Access Pass- Five Trends with Initial Access Brokers.pdf"
    ],
    "report_names": [
        "2021-08-02 - All Access Pass- Five Trends with Initial Access Brokers.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536222,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653710261,
    "ts_modification_date": 1653710261,
    "files": {
        "pdf": "https://archive.orkl.eu/b4c62748a7df694df560d076bdab7a372fcb495b.pdf",
        "text": "https://archive.orkl.eu/b4c62748a7df694df560d076bdab7a372fcb495b.txt",
        "img": "https://archive.orkl.eu/b4c62748a7df694df560d076bdab7a372fcb495b.jpg"
    }
}