{
    "id": "86db2952-9f3c-4c32-9fd7-c6f8dc5afde0",
    "created_at": "2023-01-12T15:01:23.543358Z",
    "updated_at": "2025-03-27T02:13:08.227037Z",
    "deleted_at": null,
    "sha1_hash": "822f282049d38b72b06c2eb2de9bac2bb06741c7",
    "title": "2022-11-21 - Threat Assessment- Luna Moth Callback Phishing Campaign",
    "authors": "",
    "file_creation_date": "2022-11-28T19:11:10Z",
    "file_modification_date": "2022-11-28T19:11:10Z",
    "file_size": 1158338,
    "plain_text": "# Threat Assessment: Luna Moth Callback Phishing Campaign\n\n**[unit42.paloaltonetworks.com/luna-moth-callback-phishing/](https://unit42.paloaltonetworks.com/luna-moth-callback-phishing/)**\n\nKristopher Russo November 21, 2022\n\nBy [Kristopher Russo](https://unit42.paloaltonetworks.com/author/kristopher-russo/)\n\nNovember 21, 2022 at 3:00 AM\n\n[Category: Threat Briefs and Assessments](https://unit42.paloaltonetworks.com/category/threat-briefs-assessments/)\n\nTags: [BazarLoader,](https://unit42.paloaltonetworks.com/tag/bazarloader/) [callback phishing,](https://unit42.paloaltonetworks.com/tag/callback-phishing/) [conti ransomware,](https://unit42.paloaltonetworks.com/tag/conti-ransomware/) [Cortex,](https://unit42.paloaltonetworks.com/tag/cortex/) [Cortex XDR,](https://unit42.paloaltonetworks.com/tag/cortex-xdr/) Enterprise\nDLP, [Extortion,](https://unit42.paloaltonetworks.com/tag/extortion/) [incident response,](https://unit42.paloaltonetworks.com/tag/incident-response/) [Luna Moth,](https://unit42.paloaltonetworks.com/tag/luna-moth/) [next-generation firewall,](https://unit42.paloaltonetworks.com/tag/next-generation-firewall/) [Phishing,](https://unit42.paloaltonetworks.com/tag/phishing/) Silent\nRansom Group, [threat intelligence](https://unit42.paloaltonetworks.com/tag/threat-intelligence/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/luna-moth-callback-phishing/)\n\n## Executive Summary\n\nUnit 42 investigated several incidents related to the Luna Moth/Silent Ransom Group\ncallback phishing extortion campaign targeting businesses in multiple sectors including legal\nand retail. This campaign leverages extortion without encryption, has cost victims hundreds\nof thousands of dollars and is expanding in scope.\n\nBy design, this style of social engineering attack leaves very few artifacts because of the use\nof legitimate trusted technology tools to carry out attacks. However, Unit 42 has identified\nseveral common indicators implying that these attacks are the product of a single highly\n\n\n-----\n\norganized campaign. This threat actor has significantly invested in call centers and\ninfrastructure that’s unique to each victim.\n\nCybersecurity awareness training is the most effective defense against these stealthy and\ndiscreet attacks. However, Palo Alto Networks customers receive protection from the attacks\ndiscussed in this blog through the Next-Generation Firewall and Cortex XDR detecting data\nexfiltration or connections to suspicious networks.\n\nRelated Unit 42 Topics [Phishing,](https://unit42.paloaltonetworks.com/tag/phishing/) [BazarLoader](https://unit42.paloaltonetworks.com/tag/bazarloader/)\n\n## Table of Contents\n\nWhat Is Callback Phishing?\n\nThe Typical Callback Phishing Attack Chain\n\nLuna Moth Campaign Analysis\n\nPrevention and Detection\n\nConclusion\n\nAdditional Resources\n\n## What Is Callback Phishing?\n\nCallback phishing, also referred to as telephone-oriented attack delivery (TOAD), is a social\nengineering attack that requires a threat actor to interact with the target to accomplish their\nobjectives. This attack style is more resource intensive, but less complex than script-based\nattacks, and it tends to have a much higher success rate.\n\nIn the past, threat actors associated with the [Conti group have had great success with this](https://unit42.paloaltonetworks.com/conti-ransomware-gang/)\nattack style in the BazarCall campaign. Unit 42 has been tracking these types of attacks\nsince 2021. Early iterations of this attack focused on tricking the victim into downloading the\nBazarLoader malware using documents with malicious macros.\n\n[This new campaign, which Sygnia has attributed to a threat actor dubbed \"Luna Moth,\" does](https://blog.sygnia.co/luna-moth-false-subscription-scams)\naway with the malware portion of the attack. In this campaign, attackers use legitimate and\ntrusted systems management tools to interact directly with a victim’s computer, to manually\nexfiltrate data to be used for extortion. As these tools are not malicious, they’re not likely to\nbe flagged by traditional antivirus products.\n\nPlease note that the tools named in this post are legitimate. Threat actors often abuse, take\nadvantage of or subvert legitimate products for malicious purposes. This does not imply a\nflaw or malicious quality to the legitimate product being abused.\n\n## The Typical Callback Phishing Attack Chain\n\n\n-----\n\nThe initial lure of this campaign is a phishing email to a corporate email address with an\nattached invoice indicating the recipient’s credit card has been charged for a service, usually\nfor an amount under $1,000. People are less likely to question strange invoices when they\nare for relatively small amounts. However, if people targeted by these types of attacks\nreported these invoices to their organization’s purchasing department, the organization might\nbe better able to spot the attack, particularly if a number of individuals report similar\nmessages.\n\nThe phishing email is personalized to the recipient, contains no malware and is sent using a\nlegitimate email service. These phishing emails also have an invoice attached as a PDF file.\nThese features make a phishing email less likely to be intercepted by most email protection\nplatforms.\n\nThe attached invoice includes a unique ID and phone number, often written with extra\ncharacters or formatting to prevent data loss prevention (DLP) platforms from recognizing it.\nWhen the recipient calls the number, they are routed to a threat actor-controlled call center\nand connected to a live agent.\n\nUnder the guise of canceling the subscription, the threat actor agent guides the caller\nthrough downloading and running a remote support tool to allow the attacker to manage the\nvictim’s computer. This step usually generates another email from the tool’s vendor to the\nvictim with a link to start the support session.\n\nThe attacker then downloads and installs a remote administration tool that allows them to\nachieve persistence. If the victim does not have administrative rights on their computer, the\nattacker will skip this step and move directly to finding files for exfiltration.\n\nThe attacker will then seek to identify valuable information on the victim’s computer and\nconnected file shares, and they will quietly exfiltrate it to a server they control using a file\ntransfer tool.\n\nIn this way, the threat actor is able to compromise organizational assets through a social\nengineering attack on an individual.\n\nAfter the data is stolen, the attacker sends an extortion email demanding victims pay a fee or\nelse the attacker will release the stolen information. If the victim does not establish contact\nwith the attackers, they will follow up with more aggressive demands. Ultimately, attackers\nwill threaten to contact victims’ customers and clients identified through the stolen data, to\nincrease the pressure to comply.\n\n## Luna Moth Campaign Analysis\n\n\n-----\n\nUnit 42 has responded to multiple cases related to a single campaign that occurred from\nmid-May to late October 2022. ADVIntel attributes this campaign to a threat actor dubbed\nSilent Ransom with ties to Conti. While Unit 42 cannot confirm Silent Ransom’s tie to Conti at\nthis time, we are monitoring this closely for attribution.\n\nThese cases show a clear evolution of tactics that suggests the threat actor is continuing to\nimprove the efficiency of their attack. Cases analyzed at the beginning of the campaign\ntargeted individuals at small- and medium-sized businesses in the legal industry. In contrast,\ncases later in the campaign indicate a shift in victimology to include individuals at larger\ntargets in the retail sector.\n\nDuring the initial campaign, the phishing email frequently originated from an address using\nthe format FirstName.LastName.[SpoofedBusiness]@gmail[.]com as seen in Figure 1. The\nattacker often spoofs the names of obscure athletes for these email addresses.\n\nUnit 42 has also observed emails with the format [RandomWords]@outlook[.]co.th.\n\nFigure 1. Redacted phishing email.\n\n\n-----\n\nThe wording in the body of the phishing email has changed throughout the campaign. This\nwas likely done to thwart email protection platforms. Regardless of what wording was used,\nthe email always indicated the victim is responsible for the charges detailed in the attached\ninvoice.\n\nPDF documents containing an invoice number were attached to the phishing emails. Unit 42\nobserved fake invoices spoofing both an online class platform and a health club aggregator\nin this campaign.\n\nEarly incidents used a logo from one of the spoofed businesses at the top of the invoice.\nLater cases replaced this with the simple header welcoming the target to the second spoofed\nbusiness on a plain blue background, as shown in Figure 2. Each invoice features a nine- or\n10-digit confirmation number near the top, which is also incorporated into the filename. When\nthe recipient contacts the threat actor, this confirmation number is used to identify them.\n\n\n-----\n\nFigure 2. Redacted fake invoice.\nEarly iterations of the extortion campaign recycled phone numbers, but later attacks either\nused a unique phone number per victim, or victims would be presented with a large pool of\navailable phone numbers in the invoice.\n\nThe attacker registered all of the numbers they used via a Voice over IP (VoIP) provider.\nWhen the victim called one of the attacker’s numbers, they were placed into a queue and\neventually connected with an agent who sent a remote assist invitation for the remote\nsupport tool [Zoho Assist.](https://www.zoho.com/assist/)\n\nThe footer of these invitation emails (shown in Figure 3) revealed the email address the\nthreat actor used to register with Zoho. In most incidents, the attacker chose an address from\nan encrypted email service provider to masquerade as the same vendor used in the fake\ninvoice.\n\n\n-----\n\nFigure 3. Redacted remote assistance invitation.\nOnce the victim connected to the session, the attacker took control of their keyboard and\nmouse, enabled clipboard access, and blanked out the screen to hide their actions.\n\n\n-----\n\n[Once the attacker blanked the screen, they installed remote support software Syncro for](https://syncromsp.com/remote-access/)\n[persistence and open source file management tools Rclone or](https://rclone.org/) [WinSCP for exfiltration. Early](https://winscp.net/eng/index.php)\n[cases also included remote management tools Atera and](https://www.atera.com/) [Splashtop, but recently the](https://www.splashtop.com/)\nattacker appears to have tightened their toolset.\n\nIn cases where the victim did not have administrative rights to their operating system, the\nattacker skipped installing software to establish persistence. Attackers instead downloaded\nand executed WinSCP Portable, which does not require administrative privileges and is able\nto run within the user’s security context.\n\nIn cases where the attacker established persistence, exfiltration occurred hours to weeks\nafter initial contact. Otherwise, the attacker only exfiltrated what they could during the call.\nThe attacker exfiltrated data shortly before the attack.\n\nThe domains used early in the campaign were random words with a top-level domain (TLD)\nof .xyz. Later in the campaign, domains consistently followed the format of [5 letters].xyz. All\nobserved domains fell into the 192.236.128[.]0/17 network range.\n\nExfiltration was followed with an extortion email, as shown in Figure 4. Like in other\ntemplates used in this campaign, the wording and format in the extortion email has evolved\nover time. In the cases Unit 42 investigated, the attacker claimed to have exfiltrated data in\namounts ranging from a few gigabytes to over a terabyte.\n\n\n-----\n\nFigure 4. Redacted extortion email.\nThe threat actor created unique Bitcoin wallets for each victim’s extortion payments. These\nwallets contained only two or three transactions and were emptied immediately after funding.\n\nAttacker’s monetary demands ranged from 2-78 BTC. They researched the target\norganization’s revenue and used it to justify this extortion amount. However, attackers were\nquick to offer discounts of approximately 25% for prompt payment.\n\nPaying the attacker did not guarantee they would follow through with their promises. At times\nthey stopped responding after confirming they had received payment, and did not follow\nthrough with negotiated commitments to provide proof of deletion.\n\n## Prevention and Detection\n\nThe threat actors behind this campaign have taken great pains to avoid all non-essential\ntools and malware, to minimize the potential for detection. Since there are very few early\nindicators that a victim is under attack, employee cybersecurity awareness training is the first\nline of defense.\n\n\n-----\n\nPeople should always be cautious of messages that invoke fear or a sense of urgency. Do\nnot respond directly to suspicious invoices. Contact the requester directly via the channels\nmade available on the vendor’s official website. People should also consult internal support\nchannels before downloading or installing software on their corporate computers.\n\nThe second line of defense against this attack type is a robust security technology stack\ndesigned to detect behavioral anomalies in the environment. Palo Alto Networks customers\nreceive protection from the attacks discussed in this blog through the Next-Generation\nFirewall and [Cortex XDR detecting data exfiltration or connections to suspicious networks.](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\n## Conclusion\n\nUnit 42 expects callback phishing attacks to increase in popularity due to the low per-target\ncost, low risk of detection and fast monetization. While groups that can establish\ninfrastructure to handle inbound calls and identify sensitive data for exfiltration are likely to\ndominate the threat landscape initially, a low barrier to entry makes it probable that more\nthreat actors will enter the fray.\n\nCommon observables suggest a pervasive multi-month campaign that is actively evolving.\nTherefore, organizations in currently targeted industries, such as legal and retail, should be\nparticularly vigilant to avoid becoming victims.\n\nAll organizations should consider strengthening cybersecurity awareness training programs\nwith a particular focus on unexpected invoices, as well as requests to establish a phone call\nor to install software. Additionally, expand investments in cybersecurity tools designed to\ndetect and prevent anomalous activity, such as installing unrecognized software or\nexfiltrating sensitive data.\n\nIf you think you may have been compromised or have an urgent matter, get in touch with the\n[Unit 42 Incident Response team or call:](http://start.paloaltonetworks.com/contact-unit42.html)\n\nNorth America Toll-Free: 866.486.4842 (866.4.UNIT42)\nEMEA: +31.20.299.3130\nAPAC: +65.6983.8730\nJapan: +81.50.1790.0200\n\n## Additional Resources\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n\n-----\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-21 - Threat Assessment- Luna Moth Callback Phishing Campaign.pdf"
    ],
    "report_names": [
        "2022-11-21 - Threat Assessment- Luna Moth Callback Phishing Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535683,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1669662670,
    "ts_modification_date": 1669662670,
    "files": {
        "pdf": "https://archive.orkl.eu/822f282049d38b72b06c2eb2de9bac2bb06741c7.pdf",
        "text": "https://archive.orkl.eu/822f282049d38b72b06c2eb2de9bac2bb06741c7.txt",
        "img": "https://archive.orkl.eu/822f282049d38b72b06c2eb2de9bac2bb06741c7.jpg"
    }
}