{
    "id": "86fcc00d-d7ae-4f54-94a0-25b35488b3ae",
    "created_at": "2023-01-12T15:03:52.047727Z",
    "updated_at": "2025-03-27T02:16:44.299942Z",
    "deleted_at": null,
    "sha1_hash": "a91aeaf86bcc6fc64069c58680ab96c99a9bf0b0",
    "title": "2021-02-22 - The Story of Jian – How APT31 Stole and Used an Unknown Equation Group 0-Day",
    "authors": "",
    "file_creation_date": "2022-05-28T03:24:32Z",
    "file_modification_date": "2022-05-28T03:24:32Z",
    "file_size": 1657349,
    "plain_text": "# The Story of Jian – How APT31 Stole and Used an Unknown Equation Group 0-Day\n\n**research.checkpoint.com/2021/the-story-of-jian**\n\nFebruary 22, 2021\n\nFebruary 22, 2021\n**Research by: Eyal Itkin and Itay Cohen**\n\nThere is a theory which states that if anyone will ever manage to steal and use nation-grade\ncyber tools, any network would become untrusted, and the world would become a very\ndangerous place to live in.\n\nThere is another theory which states that this has already happened.\n\nWhat would you say if we told you that a foreign group managed to steal an American\nnuclear submarine? That would definitely be a bad thing, and would quickly reach every\nheadline.\n\nHowever, for cyber weapons – although their impact could be just as devastating – it`s\nusually a different story.\n\nCyber weapons are digital and volatile by nature. Stealing them and transferring from one\ncontinent to another, can be as simple as sending an email. They are also very obscure, and\ntheir mere existence is a closely guarded secret That is exactly why as opposed to a\n\n\n-----\n\nnuclear submarine, stealing a cyber-weapon can easily go under the radar and become a\nfact known only to a selected few.\n\nThe implications of such a scenario can be devastating, as the world have already\nexperienced with the case of the Shadow Brokers leak, in which a mysterious group have\ndecided to publicly publish a wide range of cyber weapons allegedly developed by the\nTailored Access Operations (TAO) unit of the NSA – also referred to as the ‘Equation Group’.\nThe Shadow Brokers leak lead to some of the biggest cyber outbreaks in history – the most\nfamous of which was the WannaCry attack causing hundreds of millions of dollars in\ndamages to organizations across the globe – and which its implications are still relevant\neven 3 years after it happened.\n\nThe Shadow brokers leak however, just gave us a taste of some of the possible implications\nsuch a cyber-theft can cause. Many important questions still remain – could this have also\nhappened before? And if so, who is behind it and what did they use it for?\n\nOur recent research aims to shed more light on this topic, and reveal conclusive evidence\nthat such a leak did actually take place years before the Shadow Brokers leak, resulting in\nUS developed cyber tools reaching the hands of a Chinese group which repurposed them in\norder to attack US targets.\n\n### Key Findings\n\nThe caught-in-the-wild exploit of CVE-2017-0005, a 0-Day attributed by Microsoft to the\nChinese APT31 (Zirconium), is in fact a replica of an Equation Group exploit codenamed “EpMe.”\nAPT31 had access to EpMe’s files, both their 32-bits and 64-bits versions, more than 2\nyears before the Shadow Brokers leak.\nThe exploit was replicated by the APT during 2014 to form “Jian”, and used since at\nleast 2015, until finally caught and patched in March 2017.\nThe APT31 exploit was reported to Microsoft by Lockheed Martin’s Computer Incident\nResponse Team, hinting at a possible attack against an American target.\nThe framework containing the EpMe exploit is dated to 2013, and contains 4 Windows\nPrivilege Escalation exploits overall, two of which were 0-Days at the time of the\nframework’s development.\nOne of the 0-Days in the framework, code-named “EpMo”, was never publicly\ndiscussed, and was patched by Microsoft with no apparent CVE-ID in May 2017. This\nwas seemingly in response to the Shadow Brokers leak.\n\n\n-----\n\n**Figure 1: Timeline of the events detailing the story of EpMe / Jian / CVE-2017-0005.**\n\n## Introduction\n\nIn the last few months, our malware and vulnerability researchers focused on recent\nWindows Privilege Escalation exploits attributed to Chinese actors. During this investigation,\nwe managed to unravel the hidden story behind “Jian”, a 0-Day exploit that was previously\nattributed to APT31 (Zirconium), and show its true origins.\n\nIn this blog we show that CVE-2017-0005, a Windows Local-Privilege-Escalation (LPE)\nvulnerability that was attributed to a Chinese APT, was replicated based on an Equation\n**Group exploit for the same vulnerability that the APT was able to access. “EpMe”, the**\nEquation Group exploit for CVE-2017-0005, is one of 4 different LPE exploits included in the\nDanderSpritz attack framework. EpMe dates back to at least 2013 – four years before APT31\nwas caught exploiting this vulnerability in the wild.\n\nThis isn’t the first documented case of a Chinese APT repurposing an Equation Group\n[exploit. In the Bemstour case, discussed by both Symantec and our own research team, the](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/buckeye-windows-zero-day-exploit)\nmain assumption was that APT3 (Buckeye) sniffed the EternalRomance exploit from network\ntraffic, and later upgraded it to the equivalent of EternalSynergy using an additional APT3\nvulnerability. In the present case, however, we have strong evidence that APT31 had\n**access to the actual exploit files of Equation Group, in both their 32-bits and 64-bits**\nversions.\n\n\n-----\n\nIn the following sections we introduce the 4 different Windows LPE exploits included in the\nDanderSpritz framework, and reveal an additional exploit code named “EpMo.” This exploit\nwas patched in May 2017, probably as part of the follow-up fixes for the Shadow Brokers\n“Lost in Translation” leak of Equation Group tools. While the vulnerability was fixed, we failed\nto identify the associated CVE-ID. To our knowledge, this is the first public mention of the\nexistence of this additional Equation Group vulnerability.\n\n## Background\n\n[As part of our ongoing research on Windows LPE exploits, and tracking exploit authors, we](https://research.checkpoint.com/2020/graphology-of-an-exploit-volodya/)\nstarted analyzing exploits attributed to Chinese APTs. As CVE-2019-0803 was recently\nmentioned in the NSA list of top 25 vulnerabilities used by Chinese actors, we decided this\nwas a good place to start. After we finished documenting all the information we gathered on\nthis unique exploit, originally a 0-Day attributed to Chinese actors, we went on to the next\nChinese-attributed exploit in our list: CVE-2017-0005.\n\n[In our review of Microsoft’s report on the vulnerability that was caught exploited in the wild](https://www.microsoft.com/security/blog/2017/03/27/detecting-and-mitigating-elevation-of-privilege-exploit-for-cve-2017-0005/)\nand was attributed to Zirconium (APT31), we found a few interesting details:\n\nThe exploit was caught and reported to Microsoft by Lockheed Martin’s Computer\nIncident Response Team.\nThe exploit uses a multi-staged packer, which appears identical to the one we saw\nused by CVE-2019-0803.\n\n**Figure 2: Comparison between the packer of CVE-2017-0005 (left) and that of CVE-2019-**\n0803 (right).\n\n\n-----\n\nArmed with these two leads, and already familiar with the packer used by these exploits, we\nset out to find the described exploit of CVE-2017-0005.\n\nAfter we obtained a 64-bit sample of the CVE-2017-0005 exploit, we verified it against the\ninformation described by Microsoft in their blog. Not only did it match, when ignoring the\nrandom page allocation, both samples use the same addresses (same lower 3 nibbles).\n\n**Figure 3: Comparison between Microsoft’s sample (left) and ours (right).**\n\n## Comparing CVE-2017-0005 and CVE-2019-0803\n\nIn the following section, we describe in detail some of the characteristics of the packer and\nthe loader used in CVE-2017-0005 and CVE-2019-0803, and highlight their commonalities\nand differences.\n\nJian, the exploit of CVE-2017-0005, was shipped in a DLL named `Add.dll . It contained an`\ninteresting PDB path suggesting that it was written in 2015 under a project named\n“rundll32_getadmin”.\n\nF:\\\\code\\\\2015\\\\rundll32_getadmin\\\\Add\\\\x64\\\\Release\\\\Add.pdb\n\nWhen we checked the Time Date Stamp of the binary in the file header, we saw that the DLL\nwas compiled on `Wed May 06 02:08:24 2015, which fits nicely with the folder name from`\nthe PDB. An additional timestamp on the export directory points to the exact same date.\nSpeaking of the export directory, the DLL has a single exported function named “AddByGod”,\nwhich, as we will learn soon, is the entry function of the packer.\n\nThe decryption routine is very straightforward. The packer starts by allocating memory for the\nencrypted code and copies it to the newly allocated buffer. It then allocates a buffer with\n```\nPAGE_EXECUTE_READWRITE protection to store the decrypted code. After the buffers are\n\n```\nallocated, the packer checks if a string argument, which will be used as a decryption key,\nwas passed to the `AddByGod function. Next, the packer uses the AES256 algorithm with a`\nSHA1 derived key of the passed argument to decrypt the encrypted code. If the decryption is\n\n\n-----\n\nsuccessful, the decrypted code is executed and a second stage payload runs. Luckily, we\nmanaged to obtain the password that was needed to execute the binary and decrypt the\nencrypted payload.\n\nrundll32.exe Add.dll AddByGod [password]\n\nThe second stage begins with a typical shellcode technique, searching the module’s header\nfor the address of `kernel32.dll and dynamically retrieving a pointer to the`\n```\nGetProcAddress export function. Next, the program decompresses another Portable\n\n```\nExecutable (PE) and jumps to its entry point. The decompressed PE, which is the 3rd stage\nin the loading sequence, has intentionally corrupted headers. It does basic loading\noperations and then begins with a reflective loading of an embedded executable (yes,\nanother one). The loaded PE is the last stage in the loading sequence and is responsible for\nexecuting the exploit.\n\nIt’s interesting to mention that the compilation time of the embedded binary — the exploit\nitself — goes back to October 2014. This suggests that the attackers used this 0-day in\n2014, almost three years before it became publicly available in the Shadow Brokers leak and\nwas fixed by Microsoft.\n\n**Figure 4: The execution flow of the loaders used for CVE-2017-0005 and CVE-2019-0803.**\n\nAs can be seen in the figure above, the packer used for CVE-2019-0803 is very similar to the\none used in CVE-2017-0005. In fact, the flow is almost identical. The file was compiled on\nSeptember 18, 2018, and is also internally named “Add.dll”. Like the previously packed\n\n\n-----\n\nexploit, CVE-2019-0803 also has an export function named AddByGod and contains debug\ninformation:\n\nC:\\Users\\sms2056\\Desktop\\Add（未修改dll‘）\\x64\\Release\\Add.pdb\n\nUnlike the previous sample, this one uses a different decryption password and needs an\nadditional argument when running (used in later stages). The execution flow then continues\nexactly as we observed in the previous sample with one exception: after the program\ndecompresses a PE payload and jumps to its entry point, it does not have a 4th stage of\nanother embedded PE, but simply begins the exploitation stage.\n\nWe looked for more samples that use this or a similar variant of the packer we described,\nand found multiple samples and malware families that have used it for many years. All of the\nmalware are clearly and exclusively attributed to Chinese-affiliated attack groups. Adding this\nconclusion to the contextual information we have, Microsoft’s independent attribution of CVE2017-0005 to a Chinese APT, and NSA’s attribution of CVE-2019-0803 to “Chinese StateSponsored Actors”, make us believe that the exploit of CVE-2017-0005 was indeed used by\nattackers that are part of a Chinese group.\n\n## Jian – CVE-2017-0005\n\nWhen analyzing Jian, we noticed the following interesting characteristics.\n\n### Operating System (OS) Version Context\n\nThe exploit creates a rich version context that includes multiple fields, each representing a\ndifferent characteristic of the target’s operating system. This extensive context isn’t typical of\nthe Chinese-attributed exploits we previously analyzed and looks like some sort of a\nutility/framework. This is even more suspicious, as some fields in the context aren’t even\ninitialized (marked in red), and overall only three of them are used by the exploit itself\n(marked in blue).\n\n\n-----\n\n**Figure 5: Rich version information, as collected by Jian.**\n\nJust for comparison, the exploit of CVE-2019-0803 supported only a single Windows version\nand used the hardcoded version-dependent constants for Windows Server 2008 R2. Alibaba\neven reported that the tool’s file name was `2008.dll, leaving no doubt about the tool’s`\nintended target.\n\n### Global Configuration Table\n\nThe OS version enum is used as an index for a global configuration table. This is a classic\nexample of using such an enum when one needs a version-dependent configuration. The\nconfiguration table itself looks like a promising artifact that might appear in additional exploits\nby the same authors.\n\nWe created detection signatures and looked for samples that contain this configuration table.\nOur search query resulted in the following samples:\n```\n   Mcl_NtElevation_EpMe_GrSa.dll  (x86) –\n   292fe1fc7d350cc7b970da0f308d22089cd36ab552e5659e3cfb0d9690166628\n   Mcl_NtElevation_EpMo_GrSa.dll (x64) –\n   1537cad1d2c5154e142af775ed555d6168d528bbe40b31f451efa92c9e4f02de\n\n```\nThe naming convention of the files and their context immediately caught us by surprise. We\nrecognized them as part of the Shadow Brokers’ “Lost in Translation” leak of Equation Group\ntools. Equation Group is the name given to an APT group which is believed to be the Tailored\n\n\n-----\n\nAccess Operations (TAO) unit of the NSA. How did our search for extremely-unique artifacts\nextracted from a Chinese 0-Day exploit that was patched in March 2017 show results of\nleaked Equation Group tools from 2013? To answer this question, we started to dive deep\nand analyze the information we found.\n\n## Lost In Translation\n\nBefore we describe our analysis, we want to give a brief history of The Shadow Brokers\ngroup and their leaks of Equation Group tools. We believe that understanding the nature of\nthe leak, and especially the timeline, is crucial for understanding what happened next.\n\nThe Shadow Brokers is a mystery group of hackers that first appeared on August 12, 2016,\nwhen they invited the public to participate in an auction of Equation Group’s “Cyber\nWeapons.” Since then, the group started to leak more and more files over a period of several\nmonths. One of these leaks, called “Lost in Translation”, emerged in April 2017, and is well\n[known for releasing Equation Group’s notorious exploits such as Eternal Blue.](https://en.wikipedia.org/wiki/EternalBlue)\n\nOne of the main components in this leak is DanderSpritz, Equation Group’s post-exploitation\nframework that contains a wide variety of tools for persistence, reconnaissance, lateral\nmovement, bypassing Antivirus engines, and more. The framework is very modular and\nprovides the operator many capabilities to access victims’ computers. During the recent\nmonths, we revisited the DanderSpritz framework, reverse-engineered some of its modules\nand implants, and plan to publish a detailed publication dedicated to the framework and\n**our findings.**\n\nOur project of profiling exploit authors focuses on Windows LPE exploits, like CVE-20170005 whose artifacts we searched. As common in post-exploitation frameworks,\nDanderSpritz and the Lost In Translation leak also contain LPE exploits, and two of them\nmatched our query.\n\nWe now present a brief overview of some of the LPE exploits that were attributed to the\nEquation Group and their connection to the leaked DanderSpritz framework.\n\n## History of Equation Group LPE Exploits\n\n### PrivLib and the Houston Disk\n\nThe term “PrivLib” is often used when referring to a Privilege Escalation module embedded\ninside a given Equation Group implant. PrivLib contains a selected set of Windows LPE\nexploits chosen from the Equation Group arsenal, and all of them are wrapped using a thin\nwrapper known by its “prkMtx” unique mutex.\n\n\n-----\n\nIn 2015, Kaspersky [reported a set of Windows LPEs embedded inside a booby-trapped disk](https://securelist.com/equation-group-from-houston-with-love/68877/)\ngiven away at a Houston scientific convention. The exploits, attributed to Equation Group,\nwere all 0-Day at the time of development, and some even dated as far back as 2008. All in\nall, the Houston Disk contained a PrivLib version that executes a set of 3 exploits one after\nthe other, until the desired privileges are acquired.\n\nHere is a list of the exploits included in the disk, according to their execution order:\n\n1. MS09-025 (Fanny / Stuxnet)\n2. CVE-2013-3128\n3. CVE-2011-3402\n\n**Note: The CVEs listed here don’t match those mentioned originally by Kaspersky in their**\n[report. First, Kaspersky’s researchers weren’t sure about the CVE-IDs to begin with, marking](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08064459/Equation_group_questions_and_answers.pdf)\nthem as “possibly.” Second, we found additional information regarding the latter two exploits,\nwhich helped shed light on more probable CVE-IDs for each. More details about the CVE-ID\nidentification can be found later on under the respective sections describing each exploit.\n\n### DanderSpritz NtElevation\n\nDanderSpritz is a modular post-exploitation framework that contains dozens of different\ninterdependent modules. For example, some modules do not run unless specific modules\nare not executed first, and others require special privileges or artifacts to run. Some of the\nmodules require privileges of a SYSTEM account to run. For this to happen, DanderSpritz\nexecutes a set of modules named ‘NtElevation’ that are responsible for elevating the\nprivileges of the implant running on the victim’s computer.\n\n**Figure 6: An example for the dependencies of the** `PasswordDump module, including`\n```\nNtElevation .\n\n```\n\n-----\n\nThese privilege escalation modules are the ones we caught when we queried for Jian s\nglobal configuration table. And they were not alone. We also found a couple of more Local\nPrivilege Escalation exploits from the NtElevation series.\n\nWhile the `Eternal* exploits received a lot of attention, and rightly so, mentions of the`\nNtElevation exploits were somehow missing. We couldn’t find any online reference that\npoints to the existence of the NtElevation module as part of the Equation Group arsenal or\neven as part of the “Shadow Brokers Exploits”, nor any reference to the following 4 exploit\ncode names.\n\n**ElEi**\n**ErNi**\n**EpMo**\n**EpMe**\n\n**Note: Equation Group’s exploits are known to have code names that are abbreviated using 4**\nletters. For example, Eternal Blue and Eternal Romance are internally referred to as `ETBL`\nand `ETRO . Similarly, the Local Privilege Escalation exploits we discussed have their own`\ncode names, as listed above.\n\nDespite our attempts, we couldn’t manage to trace back the full code names for these\nexploits. However, the naming convention suggests that `EpMo and` `EpMe are of the same`\ntype or that they exploit vulnerabilities in the same module, just like the `Eternal* exploits`\n(EternalBlue, EternalRomance, etc). This conclusion does make sense as our single search\nquery found both of these exploits.\n\nWhen we analyzed the DanderSpritz NtElevation API, we found the checks that each module\ndeploys to declare that the exploit is indeed supported. When combined with the original\npatch dates Kaspersky estimated for the two font exploits from the Houston Disk, this new\ninformation helped us make a better estimate of the inner workings of each CVE-ID.\n\nWe thoroughly analyzed the found exploits and tried to match each exploit file to its\nrespective CVE-ID. These are the results of our analysis and our conclusions.\n\n## ElEi – CVE-2011-3402\n\n**Houston Disk: 3rd in the execution order.**\n\n**Supported DanderSpritz Windows Versions: Windows 2000 to Windows 7, inclusive.**\n\nThe exploit also contains an additional check that `win32k.sys is dated to before`\nNovember 23, 2011. This is a clear indication of CVE-2011-3402, which is the only font\nvulnerability that was fixed in December 2011. The gap in the dates is explained by the fact\nthat Microsoft compiled the patched driver on the mentioned date.\n\n\n-----\n\nWe are aware that CVE-2011-3402 was originally spotted as a 0-Day that was exploited in\n[the wild, and was found in Duqu (1.0). Currently, we can only point out this interesting CVE-](https://msrc-blog.microsoft.com/2011/12/13/more-information-on-ms11-087/)\nID match, but we have not yet studied it further or compared the two exploits, as these font\nexploits are outside of the scope of our research, which focuses on the unknown\nDanderSpritz exploits and their connection to CVE-2017-0005.\n\nWe do recommend this lead for a future work publication and invite security researchers\nworldwide to examine this connection.\n\n## ErNi – CVE-2013-3128\n\n**Houston Disk: 2nd in the execution order.**\n\n**Supported DanderSpritz Windows Versions: Only Windows 2000.**\n\nThe exploit also contains an additional check that `ATMFD.dll is of the exact version`\n“5.0.2.227”. As the Houston Disk exploit supported additional versions, we aren’t fully sure\nwhy the version range was narrowed down in DanderSpritz. Compared to `ElEi, there is no`\nindicative patch check, which may be because the DanderSpritz files are dated to mid-2013,\nwhich is prior to the patch that was identified by Kaspersky and is dated to October 2013.\n\nWe chose CVE-2013-3128 instead of CVE-2013-3894 because this vulnerability is an\nOpenType Font vulnerability, which correlates with the exploit at hand. This identification\nshould be taken with a grain of salt as none of these CVE-IDs were actually marked as\n“exploited in the wild.” The reason we chose this CVE-ID is merely because it is mentioned in\nthe Patch Tuesday cited by Kaspersky. As with `ElEi, further study of these font exploits is`\nmore than welcome.\n\n## User Mode Print Driver (UMPD) 101\n\nBasic analysis of both `EpMo and` `EpMe found them to be GDI User-Mode-Print-Driver`\n(UMPD) related, which explains why we found them when searching for a GDI UMPD related\nartifact from Jian. Before diving into the exploits, we first provide some background on what\nexactly is a User-Mode-Print-Driver.\n\nThe Windows operating system supports the option of rendering most of the needed\ngraphics for a given print job in user-mode, in contrast to the traditional implementation of\nsuch drivers inside the Windows kernel. The architecture of deploying such a User-ModePrint-Driver (UMPD) is shown below.\n\n\n-----\n\n**[Figure 7: UMPD architecture, based on figures from this Black-Hat Europe talk.](https://i.blackhat.com/eu-20/Wednesday/eu-20-Han-Discovery-20-Yeas-Old-Vulnerabilities-In-Modern-Windows-Kernel.pdf)**\n\nSupporting such a data flow dictates that the kernel is aware of the user’s UMPD device and\ncan forward it a set of requests, depending on the types that the driver declared to support.\n[As is explained in more detail in this excellent Black Hat Europe 2020 talk focusing on](https://i.blackhat.com/eu-20/Wednesday/eu-20-Han-Discovery-20-Yeas-Old-Vulnerabilities-In-Modern-Windows-Kernel.pdf)\nUMPD, allowing for user-mode callbacks, invoked from the kernel, is a sure recipe for\nsecurity vulnerabilities.\n\nIn the next few sections, we explain in detail how each Equation Group exploit uses the\nUMPD, and which vulnerabilities in this mechanism were exploited.\n\n## EpMo – Analysis\n\n**Houston Disk: N/A.**\n\n**Supported DanderSpritz Windows Versions: Windows 2000 to Windows Server 2008 R2,**\ninclusive.\n\n### Root Cause\n\nAfter we finished reverse engineering the rich context and utilities exposed as part of the\nDanderSpritz framework and API, the vulnerability itself was quite simple. A short analysis\nrevealed that this is probably a NULL-Deref vulnerability, as the NULL page is allocated, and\n\n\n-----\n\nthe shellcode is immediately copied to it, as can be seen below:\n\n**Figure 8: Preparation of the NULL-page, as part of the EpMo exploit.**\n\nAs this is a NULL-Deref vulnerability, we can immediately rule out CVE-2017-0005, as the\nstack trace shown in Microsoft’s blog has nothing to do with the NULL page. This means that\nthis is possibly another vulnerability found and exploited by Equation Group in 2013. With\nthat out of the way, it is time to understand what triggers this NULL-Deref vulnerability.\n\nOur first hint as to the identity of the affected module, which we expect to be the UMPD, can\nbe found in this classic example of the use of the OS version enum field:\n\n**Figure 9: Using OS version enum to query for the** `ppClientPrinterThunk callback index.`\n\nAfter the version-dependent index of the callback is fetched, the callback itself is replaced\nwith the attacker’s fake `ClientPrinterThunk callback.`\n\n\n-----\n\n**Figure 10: Replacing the** `KernelCallbackEntry with the attacker’s`\n```\nClientPrinterThunk .\n\n```\nBingo! The exploit indeed makes use of a fake `ClientPrinterThunk . Let’s dig in and`\nanalyze the exploit logic inside this fake callback.\n\nThe callback itself is a thin wrapper that forwards the `gdi_ctx and the original argument to`\na function that is very similar to Windows’s own `GdiPrinterThunk . As a matter of fact, the`\ncode of the exploit is very modular, and each supported driver command is handled by its\nown virtual handler implemented in the `gdi_ctx class. Aside from the chosen set of`\nimplemented handlers, there is no real logic in this function.\n\n**Figure 11: Driver command types that are handled by the exploit’s user-mode driver.**\n\n\n-----\n\nWhile analyzing this function, we stumbled upon the GDI configuration array that originally\npointed us to this exploit sample. Now, placed in the right context, we can easily deduce the\nrole of this configuration array. It holds the print driver’s `INDEX_LAST value for each version`\nof the target operating system.\n\n**Figure 12: Global** `INDEX_LAST configuration table, as used by the driver.`\n\nAs can be seen above, this configuration value is crucial for the driver’s logic as it represents\nthe total number of dispatched functions that should be handled by the driver.\n\nNow that we understood the overall flow of the exploit, and the structure of the User-ModePrint-Driver (UMPD), tracing the root cause of the vulnerability proved to be a relatively\nsimple task. The driver implemented special handlers only for the following basic command\ntypes:\n\n**Figure 13: List of driver-supported command types.**\n\n\n-----\n\nOn top of these commands, there is one additional supported command, with the osdependent value of `INDEX_LAST + 4 :`\n\n**Figure 14: Handler for the** `DrvFN command type.`\n\nIn this command, we initialize an array that tells the operating system which function\nhandlers we support. The attackers chose to mark all of the functions as “supported” except\nfor 3 specific function handlers:\n```\n   DrvStartDoc (0x23)\n   DrvEnableSurface (0x03)\n   DrvDisableSurface (0x04)\n\n```\nPlease pay close attention to `DrvEnableSurface . The syscall that triggers the vulnerability`\nis `NtGdiStartDoc, which is responsible for starting the print job. However, to do so, the`\nvulnerable function `win32k!PDEVOBJ::bMakeSurface() is invoked and tries to create a`\nsurface, exactly the operation that isn’t supported by our driver. Here is a debugging output\nfrom the vulnerable function:\n\n\n-----\n\n**Figure 15: Debugger output inside the vulnerable function showing the missing handler**\nentry.\n\nWhile the entry for `DrvDisablePDEV (0x02) exists, and points to the correct Windows`\nfunction, the adjacent entry for `DrvEnableSurface (0x03) contains only zeros.`\n\nFrom this point, the vulnerability is clear. The vulnerable function assumes that our driver\nsupports this handler, fetches the empty entry from the struct, and invokes NULL as the\nfunction responsible for enabling the surface. The figure below shows the full stack trace,\nright at the point in which the control flow is passed to the shellcode that the attacker stored\nat address 0x0:\n```\n00 8aeb8c6c 8fa42330 0x0\n01 8aeb8c88 8fbae3f6 win32k!PDEVOBJ::bMakeSurface+0x43\n02 8aeb8cb0 8fbae94c win32k!GreStartDocInternal+0x7e\n03 8aeb8d1c 82a4f42a win32k!NtGdiStartDoc+0x2ff\n04 8aeb8d1c 000f0813 (T) nt!KiFastCallEntry+0x12a\n05 0022eed0 10008118 (T) 0xf0813\n06 0022ef18 10006f53 Mcl_NtElevation_EpMo_GrSa+0x8118\n07 0022ef28 10006fc3 Mcl_NtElevation_EpMo_GrSa+0x6f53\n08 0022ef44 10007af4 Mcl_NtElevation_EpMo_GrSa+0x6fc3\n09 0022ef74 10006ce5 Mcl_NtElevation_EpMo_GrSa+0x7af4\n0a 0022efcc 10004a31 Mcl_NtElevation_EpMo_GrSa+0x6ce5\n0b 0022f324 100038c0 Mcl_NtElevation_EpMo_GrSa+0x4a31\n0c 0022f338 10003a7b Mcl_NtElevation_EpMo_GrSa+0x38c0\n0d 0022f370 10002adf Mcl_NtElevation_EpMo_GrSa+0x3a7b\n0e 0022f3d8 77d5af24 Mcl_NtElevation_EpMo_GrSa+0x2adf\n\n```\n\n-----\n\n### The Patch\n\nMicrosoft fixed this vulnerability in May 2017, one month after the Shadow Brokers’s Lost in\nTranslation leak. However, we failed to find a CVE-ID that refers to this fix. The patch itself\naddresses the exact flaw in the vulnerable function `win32k!PDEVOBJ::bMakeSurface() . It`\nadds a sanity check after the handler is fetched from the struct, and before it is invoked by\nthe function. If the entry is NULL, the function aborts.\n\n**Figure 16: Patched version now checks the function handler before invoking it.**\n\nTo conclude, the `EpMo Equation Group exploit is a NULL-Deref in GDI’s UMPD module,`\nand is therefore not an exploit for CVE-2017-0005. It was patched by Microsoft in May 2017,\nand we couldn’t find a clear CVE-ID associated with it.\n\nNow that we better understand the framework’s API, and have a better understanding of the\nUMPD module, it is time to focus on the next exploit – `EpMe .`\n\nJust to recap, we found both of these exploits when searching for an artifact from Jian,\nAPT31’s exploit for CVE-2017-0005. As `EpMo is a different vulnerability that originates from`\nthe same module, our hope was that `EpMe does indeed exploit CVE-2017-0005. Time to`\nanalyze it and find out.\n\n## EpMe – Analysis\n\n**Houston Disk: N/A.**\n\n**Supported DanderSpritz Windows Versions: Windows XP to Windows 8, inclusive.**\n\n### Root Cause\n\nArmed with our newly acquired knowledge about the UMPD module, we started analyzing\nthe EpMe exploit. The exploit itself shares a lot of code with EpMo, thus allowing us to easily\nfocus on the exploit-specific logic that is unique to EpMe. While the initialization phase of this\nexploit is longer and involves a lot of GDI-related bootstrapping ( DrawStream(), finding the\nwanted Display, etc.), the actual flow that hijacks the control flow is relatively simple.\n\n\n-----\n\nAfter the bootstrap is finished, the exploit triggers a call to the `NtGdiBitBlt syscall. This`\ninitiates a chain of events in the Windows kernel and eventually passes the flow back to our\nuser-mode callback ( DrvBitBlt() ) registered by our UMPD. Here lies the heart of the\nexploit.\n\nOur function allocates a new `Rbrush using` `NtGdiBRUSHOBJ_pvAllocRbrush(), whose`\nsole purpose is to allow UMPD implementations to allocate themselves an `Rbrush and`\ncouple it with a `BRUSHOBJ . As a direct result, it also means that the` `Rbrush is allocated in`\n**user-mode, using** `EngAllocUserMemEx() . Storing it in user-mode means that we can`\naccess it and craft the struct’s content. And so, the attackers corrupted the `Rbrush to point`\nat a set of fake GDI objects that were forged on a local stack buffer inside the callback.\n\nTo hijack the control flow, the attackers chose to use a Palette and crafted it so that\n```\nPALETTE.pfnGetNearestFromPalentry points to their shellcode, exactly as Microsoft\n\n```\npointed out in their blog on the caught-in-the-wild exploit. After everything is built, the\ncallback invokes the `NtGdiEngBitBlt syscall with a` `rop4 parameter of` `0xCCAA . This`\nspecific syscall was chosen because of two key features:\n\nThe user passes to it a `BRUSHOBJ .`\nA `rop4 value of` `0xCCAA means the kernel directly accesses the user-controlled`\n```\n   Rbrush from within the supplied BRUSHOBJ .\n\n```\nMore specifically, a Stream is extracted from the fully-controlled `Rbrush and is forwarded`\non to `EngDrawStream(), causing the unsuspecting kernel function to use our fully crafted`\nStream.\n\n\n-----\n\n**Figure 17: Control flow of the EpMe exploit of CVE-2017-0005.**\n\nThis chain of functions gradually uses all of the GDI objects that we’ve crafted in our usermode callback, eventually leading to `XLATEOBJ_iXlate() . This last function invokes our`\ncrafted `PALETTE.pfnGetNearestFromPalentry function pointer, thus hijacking the control`\nflow and triggering the execution of our shellcode.\n\nTo summarize, the root cause for this vulnerability is based on the complex design involved\nin supporting UMPD, and the need to allocate objects for it in user-mode. The vulnerability\nitself lies inside `EngBitBlt(), which blindly trusts and directly uses our crafted` `Rbrush`\nand the set of fake GDI objects it points to. Not only does this vulnerability give an attacker a\npowerful exploit primitive, but it also points at a design issue in the Windows kernel. As long\nas there is a function somewhere in the kernel that directly accesses a user-supplied\n```\nRbrush, it also blindly trusts all the values that it points to and that are fully controlled by\n\n```\nthe user.\n\n### The Patch – CVE-2017-0005\n\nAnother important conclusion we drew from analyzing the exploited vulnerability is that we\nnow know for sure that EpMe exploits CVE-2017-0005. On top of our analysis of both the\nEquation Group and APT31 exploits, the EpMe exploit aligns perfectly with the details\nreported in Microsoft’s blog on CVE-2017-0005. And if that wasn’t enough, the exploit indeed\nstopped working after Microsoft’s March 2017 patch, the patch that addressed the said\nvulnerability.\n\nThe patch itself is rather straightforward: `EngBitBlt() with a` `rop4 value of` `0xCCAA no`\nlonger supports the option to draw a Stream, an action that demands extracting a Stream\nfrom the user-supplied `Rbrush . By removing this feature altogether, Microsoft completely`\neliminated the vulnerable code flow.\n\n**Before:**\n\n\n-----\n\n**Figure 18: Vulnerable** `win32k.sys, supports both` `EngDrawStream() and`\n```\nEngTransparentBlt() .\n\n```\n**After:**\n\n**Figure 19: Patched** `win32k.sys, no longer supports` `EngDrawStream() .`\n\n\n-----\n\nIt is important to remember that two APTs exploiting the same vulnerability (CVE-2017-0005)\ncould just be a coincidence. When this happens to security researchers, such a case is often\nreferred to as a “bug-collision.” It’s possible that researchers on both sides found this\nvulnerability independently, and it doesn’t necessarily mean that there is a real connection\nbetween the tools.\n\nWe now compare the two exploit samples, Jian and EpMe, and see if we can spot any\nconnection between them aside from them exploiting the same vulnerability.\n\n## EpMe vs Jian\n\n### Similar Version Context\n\nAt the beginning of our research, we saw that Jian uses a context that holds multiple fields\nabout the version of the target’s operating system. Used fields are marked in blue, and\nuninitialized fields are marked in red.\n\n**Figure 20: Rich version information, as collected by Jian.**\n\nNow, when we review the version context used by all exploits shared by the DanderSpritz\nframework, we can see the following, very similar, structure:\n\n\n-----\n\n**Figure 21: Version context used by DanderSpritz and shared by all Equation Group exploits.**\n\nThe fields that are marked in red in Jian were marked again in the sample from the Equation\nGroup exploits. As can be seen, one field is still unused in all 4 DanderSpritz exploits, but the\nother field is heavily used and holds the handle for the mapped version of NTOS kernel. It is\nhard to miss the wide similarity between the two structures, up to the order and size of the\n**first 9 fields, even including the size of the unused field in between.**\n\nThe changes between the two configuration structures are that Equation Group’s\nconfiguration contains more fields, mostly used for security mitigation policies, that are\nrelevant for Windows 8 systems and higher. The last difference between the structures is in\nthe field specifying the architecture of the target’s kernel, which for some reason was\nnegated in Jian. Anyway, this field was never used by the exploit.\n\nOverall, having a Chinese-attributed exploit use a version context is uncommon. Having one\nthat is nearly identical to the version context used by the entire DanderSpritz NtElevation\nmodule can’t be a coincidence.\n\n\n-----\n\n### Same Memory Layout\n\nAt the heart of the exploits lies a single function that populates a buffer with the various fake\nGDI objects, which is pointed to by our user-mode `Rbrush object. Not only do both exploits`\nuse a single function for the construction of all of these fake objects, but the memory layout\nof the objects in the argument buffer is also identical.\n\n**Figure 22: Construction of the fake GDI objects, as done in Jian.**\n\nWhen we analyzed the code of the Equation Group exploit, we used it to recreate a source\ncode Proof-Of-Concept (POC). The result is the following beautified and labeled code:\n\n\n-----\n\n```\nvoid populate_buffer_and_brush(char pBuffer, HBRUSH hbrush)\n{\n  memset(pBuffer, 0, 0x200);\n  memset(&pBuffer[0x200], 0, 0xA8);\n  memset(&pBuffer[0x2A8], 0, 0x30);\n  memset(&pBuffer[0x2D8], 0, 0x10);\n  // 0x00: PALETTE\n  *(DWORD *)( pBuffer + 0x18) = 2;        // 0x14 - 0x1C: flPal\n  *(size_t *)(pBuffer + 0x80) = pBuffer + 0x2A8; // 0x80 - 0x88: apalColor\n  // Brush (DRAWSTREAMINFO)\n  size_t * pBrush = (size_t*)hbrush;\n  pBrush[3] = pBuffer + 0x29C; // pptlDstOffset - Pointer to 0\n  pBrush[4] = pBuffer + 0x208; // pxloSrcToBGRA\n  pBrush[5] = pBuffer + 0x208; // pxloDstToBGRA\n  pBrush[6] = pBuffer + 0x208; // pxloBGRAToDst <-- We use this one (offset 0x30)\n  pBrush[7] = 60;       // ulStreamLength - 60\n  pBrush[8] = pBuffer + 0x260; // pvStream    - Pointer to our built \"Stream\"\n  // Second Struct\n  *(size_t *)(pBuffer + 0x200) = hbrush;\n  // 0x208: _XLATE\n  *(size_t *)(pBuffer + 0x230) = pBuffer; // ppalSrc\n  *(size_t *)(pBuffer + 0x238) = pBuffer; // ppalDst <-- We use this one (offset\n0x30)\n  *(size_t *)(pBuffer + 0x240) = pBuffer; // ppalDstDC\n  // 0x260 - 0x2A8: Our \"Stream\"\n  *(DWORD *)(pBuffer + 0x260) = 9; // DS_NINEGRIDID (ulCmdID)\n  *(DWORD *)(pBuffer + 0x26C) = 1; // rclDst.right = 0x01\n  *(DWORD *)(pBuffer + 0x270) = 1; // rclDst.bottom = 0x01\n  *(DWORD *)(pBuffer + 0x27C) = 80; // rclSrc.right = 0x50\n  *(DWORD *)(pBuffer + 0x280) = 80; // rclSrc.bottom = 0x50\n  *(DWORD *)(pBuffer + 0x284) = 4; // ngi.flFlags := DSDNG_PERPIXELALPHA (4)\n  // 0x2A8: Palette Color Table\n  *(DWORD *)(pBuffer + 0x2CC) = 100;\n  // Fourth Struct\n  *(size_t *)(pBuffer + 0x2D8) = AllocMemoryPage(0x10000);\n  *(size_t *)(pBuffer + 0x2E0) = g_pRtlCopyUnicodeString;\n}\n\n```\nAside from the added struct at the end of the buffer, which uses `RtlCopyUnicodeString,`\nthe memory layout of the objects inside the argument buffer was completely identical.\n\nAs we also labeled the different objects, we can see that the important part is the references\nfrom one object to another, and not the location in which they are stored in the buffer itself.\nAnd yet, as if by magic, both exploits share this memory layout.\n\n### Shared Constants\n\nOne more advantage of our recreated code POC for EpMe is that it enabled us to play\naround with various constants used throughout the exploit, such as:\n\nGUI Window Name – Originally “h”.\nPoint locations – One of which was originally (100, 100).\n\n\n-----\n\nPrint Job ID – Originally 5.\nDriver Name / Document Name – A weird Unicode string is shown below.\n\n**Figure 23: Weird Unicode string, later used as both the driver and document names.**\n\nNeedless to say, none of the above were related to the vulnerability itself, and changing them\ndidn’t affect the exploit at all. They are simply hardcoded constants chosen by the original\ndevelopers of the exploit.\n\nThe interesting thing is, both EpMe and the Jian use the exact same hardcoded\n**constants. The fact that all of these constants are shared between the two samples, even**\nthe weird looking Unicode string above, just shows that one of the exploits was most\nprobably copied from the other.\n\n**Figure 24: Jian containing the same constants as the Equation Group exploit.**\n\nIt is also possible that both parties were inspired by some unknown 3rd-party implementation\nthat used all of these constants. Alas, we failed to find any evidence for the existence of such\na module. We must say that the odds of this scenario are rather slim, especially when taking\ninto account the weird-looking Unicode string.\n\n### Comparison Conclusion\n\nThe meaning of all of this is pretty simple:\n\n\n-----\n\nOne APT found the vulnerability and developed an exploit for it.\nAnother APT caught it and replicated it for their own use.\n\nWhile both of them deserve full credit for these remarkable achievements, we still want to\nfind out who copied from whom. Time to attribute the exploit.\n\n## Exploit Attribution – Who was the original developer?\n\n### Weird Looking Unicode String\n\nTo the eyes of a Western researcher, the Unicode string used for both the print driver name\nand the name of the printed document looks foreign. And indeed, we can surely say that the\nstring “屁썟“ doesn’t look like an obvious choice for native English speakers.\n\nWe therefore consulted with colleagues around the world who are fluent in Chinese, Korean\nand Japanese, and asked for their opinion about these two symbols. The unanimous answer\nwe received declared that there is no language in which these symbols make sense. In each\nlanguage, only one symbol has a meaning, and in any case doesn’t make sense as part of\na two-symbol phrase. We also checked for a meaning for the symbols created from inverting\nthe order of the original bytes, and the result was the same.\n\nSo this is probably not a Chinese phrase used by the original developers of the exploit, but\nwhat is it?\n\nOur main hypothesis is based on the op-sec of the developers. Aside from names of DLL\nfiles and imported functions, it is very rare to find any string inside Equation Group samples.\nEven the name of the created window is only “h”, not exactly a long string that could be used\nby YARA rules so as to “sign” the binary. Faced with the need to use a Unicode string that is\nsurely longer than a single ASCII char string, we believe that the developers chose to use a\npattern that matches their needs:\n\nUnicode-enough for the Windows API.\nNot a real string that might be traced by security researchers / solutions.\n\nIf we look closely at the chosen Unicode string, we can see that it actually makes more\nsense as an x64 assembly snippet:\n```\n41 5C        pop   r12\n5F          pop   rdi\nC3          retn\n\n```\nAs a matter of fact, this byte sequence is actually a very popular assembly snippet, found\nalmost 150 times just in `ntdll.dll . Choosing such a popular assembly sequence for a`\n“Unicode string” achieves all of the stated goals.\n\nFinally the string can also be randomly generated and lacks any meaning whatsoever\n\n\n-----\n\n### Window Name – h\n\nAs we just mentioned in the previous section, the GUI Window name used in both of the\nexploits is “h”. What may seem like a randomly selected short string actually has quite a\nhistory behind it. Since the earliest PrivLib version we managed to find, dated to 2008, all of\nthe Equation Group exploits that we’ve analyzed used the exact same string when a window\nname was needed. And this string was always “h”.\n\nAs a matter of fact, all of the 3 exploits included in the Houston Disk used the exact same\nglobal string when creating their window:\n\n**Figure 25: Global string used as the window name in all Houston Disk exploits.**\n\nThis is one small indication that the original authors of the exploits could indeed have been\nEquation Group. However, as this artifact could also be just a coincidence, we now review\nadditional aspects of the exploits.\n\n## Quirks in Jian\n\n### Windows 2000 support\n\nClose examination of the vulnerable function shows us that Windows 2000 was never\nvulnerable, as can be seen below:\n\n**Figure 26:** `win32k.sys from Windows 2000, just before the version reached End-of-Life.`\n\nDespite Windows 2000 not being vulnerable, the UMPD code in Jian has special cases for\nWindows 2000, and Windows 2000 is part of the OS Version enum.\n\n\n-----\n\n**Figure 27: Jian’s logic for supporting Windows 2000, inside the UMPD module.**\n\nThe interesting issue is that according to the exploit configurations of Equation Group, EpMe\n**doesn’t support Windows 2000. The minimal supported version is Windows XP, which**\naligns perfectly with the vulnerable Windows versions.\n\nThe fact that Equation Group built proper frameworks means that the UMPD module was\nshared between EpMe and EpMo. The variation between the exploits is based on exploitspecific logic that was implemented inside virtual handlers that are invoked by the generic\nUMPD module. Because EpMo supports Windows 2000, so does the UMPD module, which\nexplains why EpMe might seem to support this version of Windows.\n\n**Figure 28: Support for Windows 2000 in the shared UMPD module of EpMo and EpMe.**\n\n\n-----\n\nIf we assume for a moment that APT31 was the original developer of the exploit for CVE2017-0005, why would they even attempt to add support for Windows 2000? Windows 2000\nwas never vulnerable in the first place. To be clear, we have no indication that the actors had\ntheir own version of the EpMo exploit or anything similar, meaning we have no indication\nthey ever needed such Windows 2000 support for any other tool / exploit.\n\nA far more probable scenario is that APT31 copied the exploit from Equation Group. It is\nlikely that the threat group’s developers probably didn’t fully understand the limitations of the\nexploit, and so left the Windows 2000 specific code untouched. An old relic inherited from the\nEpMo exploit of which APT31 wasn’t even aware of or care about.\n\n### Enum value rotation\n\nFor some unknown reason, Jian contains the syscall definitions for a 32-bit exploit, on top of\nthose needed for the 64-bit exploit. While they aren’t used in practice, as the sample is 64bit, they still give us a glimpse of how their 32-bit exploit would have looked.\n\nWe can see that Jian’s 32-bit logic for each syscall ID once again matches that of the\nEquation Group sample, up to the level of adjusting some IDs based on the refined Service\nPack Major Number.\n\n\n-----\n\n**Figure 29: Jian’s logic for configuring 32-bit syscalls, using a refined Service Pack value.**\n\nThe problem is, if we check the actual syscall numbers for Windows XP Service Pack 0 and\nService Pack 1, we can see that the condition for setting the value of `SP_delta is flawed. It`\nwas correct for the Equation Group exploit, but is not correct here as APT31 modified the\n```\nwSpMajor_refined value during the exploit’s initialization.\n\n```\n\n-----\n\n**Figure 30: Jian’s rotation of almost all** `wSpMajor values.`\n\nThis value update is even stranger, as the Equation Group exploits have no mention of it\nwhatsoever:\n\n**Figure 31: Equation Group exploit setting the value of** `wSpMajor_refined .`\n\nYou might ask, “Why would someone perform the above value rotation?” The answer is\nactually rather simple. From our past analyses of several exploits attributed to Chineseaffiliated actors, we saw that the developers have a habit of using the value 0 as a marker for\n“illegal value.” This can be clearly seen as all Service Pack values above 6 are mapped back\n\n\n-----\n\nto the value 0, which marks them as illegal. This was also the case for the OS Version\nEnum, which was fully incremented by 1, making Windows NT use a value of 1 instead of 0,\nand reserving the sacred value of 0 to mark an error state.\n\nAnd yet, this time the developers used only a partial rotation for the Service Pack value,\ncausing a collision with the legitimate value for Service Pack 0 which for some reason they\ndidn’t remap to “1”. This means that 0 is simultaneously an illegal value that shouldn’t be\nsupported, and a legitimate value that is crucial for configuring the correct syscall numbers.\nThe correct adjustment should probably have been to increment all values by 1, map the\nillegal values to 0, and adjust the syscall check to `wSpMajor_refined != 1 .`\n\nOnce again, we see a weird pattern. Even under the premise that Chinese exploits should\nreserve the value 0 for illegal values, the code still looks odd. A developer writing this exploit\nfrom scratch would probably have just incremented the `wSpMajor_refined value by 1,`\nwhile remembering that in future checks Service Pack 0 is marked with the value 1. Instead,\nas if not to break an existing piece of code, the syscall initialization still checks for 0, and this\nvalue is simultaneously both valid and illegal at the same time.\n\nA more probable explanation is that the original code was the Equation Group version, and\nthat the developers affiliated with Chinese attack groups were afraid to break it, thus going\nonly half-way in remapping the values. This fear of breaking the code also reflects on their\npoor understanding of the overall exploit.\n\n### Debug string in the trigger function\n\nJian contains a debug string “int the overflow!!!” that can be found inside UMPD’s\n```\nDrvBitBlt(), the callback responsible for triggering the vulnerability.\n\n```\n**Figure 32: APT31 debug string inside the trigger function.**\n\nAs we already established, the exploited vulnerability is not an “overflow” vulnerability. While\nthe string may hint at either a “buffer overflow” or an “integer overflow”, none of them have\nany connection to the user-mode callback design issue that was actually exploited.\n\nWhile it may just be a language barrier issue, this is yet another possible clue that the\nattackers behind Jian didn’t properly understand the true nature of the exploited vulnerability.\n\n## Attribution Conclusion\n\nTogether with additional artifacts that match Equation Group artifacts and habits shared\nbetween all exploits even as far back as 2008, we can safely conclude the following:\n\n\n-----\n\nEquation Group s EpMe exploit, existing since at least 2013, is the original exploit for\nthe vulnerability later labeled CVE-2017-0005.\nSomewhere around 2014, APT31 managed to capture both the 32-bit and 64-bit\nsamples of the EpMe Equation Group exploit.\nThey replicated them to construct “Jian”, and used this new version of the exploit\nalongside their unique multi-staged packer.\nJian was caught by Lockheed Martin’s IRT and reported to Microsoft, which patched\nthe vulnerability in March 2017 and labeled it CVE-2017-0005.\n\n## Timeline\n\nBelow is a timeline of the events surrounding both exploit versions of what began as EpMe\n(Equation Group) and was eventually patched by Microsoft as CVE-2017-0005 (APT31).\n\n**Figure 33: Timeline of the events detailing the story of EpMe / Jian / CVE-2017-0005.**\n\nIn greater detail:\n\n2008/2009 – Early Equation Group exploit tools: PrivLib / Houston Disk.\n2013 – DanderSpritz NtElevation exploits: ElEi, ErNi, EpMo, EpMe.\nOctober 27, 2014 – Early timestamp from the embedded PE – cloned EpMe.\nMay 6, 2015 – Multiple indicators that the complete APT31 tool was compiled in 2015.\nAugust 13, 2016 – Initial Shadow Brokers publication.\nJanuary 8, 2017 – Shadow Brokers leak a directory structure of their files, clearly\nindicating the possession of DanderSpritz and Eternal* exploits\n\n\n-----\n\nFebruary 14, 2017 – Patch Tuesday is cancelled, merged with March s fixes.\nMarch 14, 2017 – Patch Tuesday – Fixed CVE-2017-0005 and 1st round of critical\nEquation Group exploits included in the to be published “Lost in Translation” SB leak.\nMarch 27, 2017 – Microsoft publishes the blog on CVE-2017-0005 that was reported by\nLockheed Martin, and attributed it to a Chinese APT (Zirconium / APT31).\nApril 14, 2017 – Lost in Translation leak is published.\nMay 9, 2017 – Patch Tuesday: Second round of Equation Group patches includes a\n**silent fix for the EpMo Equation Group exploit.**\n\n## Summary\n\nWe began with analyzing “Jian”, the Chinese (APT31 / Zirconium) exploit for CVE-20170005, which was reported by Lockheed Martin’s Computer Incident Response Team. To our\nsurprise, we found out that this APT31 exploit is in fact a reconstructed version of an\n**Equation Group exploit called “EpMe”. This means that an Equation Group exploit was**\neventually used by a Chinese-affiliated group, probably against American targets.\n\nThis isn’t the first documented case of a Chinese APT using an Equation Group 0-Day. The\nfirst was when APT3 used their own version of EternalSynergy (called UPSynergy), after\nacquiring the Equation Group EternalRomance exploit. However, in the UPSynergy case, the\nconsensus among our group of security researchers as well as in Symantec was that the\nChinese exploit was reconstructed from captured network traffic.\n\nThe case of EpMe / Jian is different, as we clearly showed that Jian was constructed from\nthe actual 32-bits and 64-bits versions of the Equation Group exploit. This means that in this\nscenario, the Chinese APT acquired the exploit samples themselves, in all of their\nsupported versions. Having dated APT31’s samples to 3 years prior to the Shadow Broker’s\n“Lost in Translation” leak, our estimate is that these Equation Group exploit samples could\nhave been acquired by the Chinese APT in one of these ways:\n\nCaptured during an Equation Group network operation on a Chinese target.\nCaptured during an Equation Group operation on a 3rd-party network which was also\nmonitored by the Chinese APT.\nCaptured by the Chinese APT during an attack on Equation Group infrastructure.\n\nWhile reviewing the NtElevation exploits used in Equation Group’s DanderSpritz postexploitation framework, we found 4 Windows LPE exploits. The first two NtElevation exploits\nwere font vulnerabilities that were previously discussed as part of the Houston disk (an\nearlier sample attributed to Equation Group). In addition, EpMe (CVE-2017-0005) was\nmentioned and patched when Jian was caught, even if at that point in time the true origins of\nit weren’t yet known.\n\n\n-----\n\nFinally, although EpMo was indeed patched by Microsoft in May 2017, we couldn t trace the\nCVE-ID that was assigned to the patched vulnerability. Not only that, to our knowledge, our\npublication is the first to even mention the existence of this Equation Group exploit, even\n[though it was publicly accessible on GitHub for the last 4 years.](https://github.com/x0rz/EQGRP_Lost_in_Translation/blob/6692b1486f562f027567a49523b8c151a4050988/windows/Resources/Dsz/Modules/Files-dsz/x64-winnt-vc9s/release/Mcl_NtElevation_EpMo_GrSa.dll)\n\nThese are our new additions to the attribution map:\n\n**EpMe (CVE-2017-0005) – An Equation Group exploit that was cloned by APT31, thus**\ncausing CVE-2017-0005 to be attributed to the latter, instead of to Equation Group.\n**EpMo – An additional Equation Group exploit that was never discussed before.**\n**Jian – APT31’s cloned version of EpMe, which was caught-in-the-wild by Lockheed**\nMartin’s IRT.\n**CVE-2019-0803 – Attributed by multiple sources to a “Chinese State-Sponsored Actor.”**\nWe showed that it shares the same exploit loader (and tool API) as APT31’s Jian.\n\n## Appendix – IOC Table\n\n### Jian – CVE-2017-0005:\n\n**Jian:** `AE512F13136774B4AAB79EBCC378927143BE77181E3B256E6F9940CE73696DE4`\n\n### CVE-2019-0803:\n\n**tools.dll:** `68A3710765DA1886F00E40F2D5E02776D224C77AEA114CD22C3A6204A7FAD363`\n\n**2008.dll:** `279320EE5C3B2DA4364AFBACBE5286EC4EED9AB5E887D4E0B9AAB2EB618BC539`\n\n## Equation Group Exploits:\n\n**Note: There are several variants of each exploit in the leak. The following are single**\nexamples of each exploit.\n\n**Houston Disk:**\n```\n868EB363F32BEACD8BCDC7A114E020D4CFE67913A15275F4E7493D87DB643FF2\n\n```\n**DanderSpritz – ElEi:**\n\n```\nC99FFACBA6D6689F7934E6E912E36EFCC4BD6A09C8A4D1E43BB27C3AFD131882\n\n```\n\n**DanderSpritz – ErNi:**\n\n```\nE4FBF75ABF928CD1C9073656A61755FD3F0C25DC2E7922FB5073E1F64E5E9161\n\n```\n\n**DanderSpritz – EpMo:**\n\n```\n1537CAD1D2C5154E142AF775ED555D6168D528BBE40B31F451EFA92C9E4F02DE\n\n```\n\n**DanderSpritz – EpMe (CVE-2017-0005):**\n\n```\n634A80E37E4B32706AD1EA4A2FF414473618A8C42A369880DB7CC127C0EB705E\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-22 - The Story of Jian – How APT31 Stole and Used an Unknown Equation Group 0-Day.pdf"
    ],
    "report_names": [
        "2021-02-22 - The Story of Jian – How APT31 Stole and Used an Unknown Equation Group 0-Day.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61c4ddc4-156b-4828-8570-0979da81f3d0",
            "created_at": "2022-10-25T16:47:55.593828Z",
            "updated_at": "2025-03-27T02:05:17.275161Z",
            "deleted_at": null,
            "main_name": "BRONZE MAYFAIR",
            "aliases": [
                "Gothic Panda ",
                "TG-0110 ",
                "APT3 "
            ],
            "source_name": "Secureworks:BRONZE MAYFAIR",
            "tools": [
                " HUC Proxy Malware (Htran)",
                " Pirpi",
                " SplitVPN",
                " ctt",
                " ctx",
                "Cookiecutter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "761d1fb2-60e3-46f0-9f1c-c8a9715967d4",
            "created_at": "2023-01-06T13:46:38.269054Z",
            "updated_at": "2025-03-27T02:00:02.789278Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "TG-0110",
                "Group 6",
                "Buckeye",
                "Boyusec",
                "BORON",
                "BRONZE MAYFAIR",
                "Red Sylvan",
                "GOTHIC PANDA"
            ],
            "source_name": "MISPGALAXY:APT3",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13354d3f-3f40-44ec-b42a-3cda18809005",
            "created_at": "2022-10-25T15:50:23.275272Z",
            "updated_at": "2025-03-27T02:00:55.418075Z",
            "deleted_at": null,
            "main_name": "APT3",
            "aliases": [
                "APT3",
                "Gothic Panda",
                "Pirpi",
                "UPS Team",
                "Buckeye",
                "Threat Group-0110",
                "TG-0110"
            ],
            "source_name": "MITRE:APT3",
            "tools": [
                "OSInfo",
                "schtasks",
                "PlugX",
                "LaZagne",
                "SHOTPUT",
                "RemoteCMD"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "06f622cb-3a78-49cf-9a4c-a6007a69325f",
            "created_at": "2022-10-25T16:07:23.315239Z",
            "updated_at": "2025-03-27T02:02:09.733197Z",
            "deleted_at": null,
            "main_name": "APT 3",
            "aliases": [
                "APT 3",
                "Bronze Mayfair",
                "Buckeye",
                "Gothic Panda",
                "Group 6",
                "Operation Clandestine Fox",
                "Operation Clandestine Fox, Part Deux",
                "Operation Clandestine Wolf",
                "Operation Double Tap",
                "Red Sylvan",
                "TG-0110",
                "UPS Team"
            ],
            "source_name": "ETDA:APT 3",
            "tools": [
                "APT3 Keylogger",
                "Agent.dhwf",
                "BKDR_HUPIGON",
                "Backdoor.APT.CookieCutter",
                "Badey",
                "Bemstour",
                "CookieCutter",
                "Destroy RAT",
                "DestroyRAT",
                "DoublePulsar",
                "EXL",
                "EternalBlue",
                "HTran",
                "HUC Packet Transmit Tool",
                "Hupigon",
                "Hupigon RAT",
                "Kaba",
                "Korplug",
                "LaZagne",
                "MFC Huner",
                "OSInfo",
                "Pirpi",
                "PlugX",
                "RedDelta",
                "RemoteCMD",
                "SHOTPUT",
                "Sogu",
                "TIGERPLUG",
                "TTCalc",
                "TVT",
                "Thoper",
                "Xamtrav",
                "remotecmd",
                "shareip",
                "w32times"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535832,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1653708272,
    "ts_modification_date": 1653708272,
    "files": {
        "pdf": "https://archive.orkl.eu/a91aeaf86bcc6fc64069c58680ab96c99a9bf0b0.pdf",
        "text": "https://archive.orkl.eu/a91aeaf86bcc6fc64069c58680ab96c99a9bf0b0.txt",
        "img": "https://archive.orkl.eu/a91aeaf86bcc6fc64069c58680ab96c99a9bf0b0.jpg"
    }
}