{
    "id": "872c67d1-d994-4cf3-a9c8-371377fd8b2f",
    "created_at": "2023-01-12T15:00:50.615776Z",
    "updated_at": "2025-03-27T02:05:32.852761Z",
    "deleted_at": null,
    "sha1_hash": "3f80f3b45d29a54ffc5a0fd4d67ed09e7b886f86",
    "title": "2011-10-26 - Tsunami Backdoor Can Be Used for Denial of Service Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T03:30:15Z",
    "file_modification_date": "2022-05-28T03:30:15Z",
    "file_size": 81980,
    "plain_text": "# Menu ☰\n\n**[intego.com/mac-security-blog/tsunami-backdoor-can-be-used-for-denial-of-service-attacks](https://www.intego.com/mac-security-blog/tsunami-backdoor-can-be-used-for-denial-of-service-attacks)**\n\n[Malware](https://www.intego.com/mac-security-blog/category/malware/)\n\n\nOctober 26, 2011\n\n\n## Tsunami Backdoor Can Be Used for Denial of Service Attacks\n\nPosted on October 26th, 2011 by [Peter James](https://www.intego.com/mac-security-blog/author/peter/)\n\nA new backdoor and hacker tool, Tsunami, has been discovered. This hacker tool seems to\nbe a port of a Linux malware, which has been around for some time, and provides remote\naccess to hackers by listening in on an IRC (Internet relay chat) channel for instructions.\n\nTools like this are often used for distributed denial of service (DDoS) attacks (more on that\nbelow). These attacks flood computers with standard network requests, with a goal of\noverloading them. If a server receives more requests than it can handle, it can slow down, or\neven crash.\n\nThe Tsunami backdoor accepts a number of commands, and can change servers, download\nfiles, such as updates, and send packets to a specified IP address.\n```\n* TSUNAMI <target> <secs>   = A PUSH+ACK flooder          *\n* PAN <target> <port> <secs>  = A SYN flooder            *\n* UDP <target> <port> <secs>  = An UDP flooder            *\n* UNKNOWN <target> <secs>   = Another non-spoof udp flooder    *\n* NICK <nick>         = Changes the nick of the client    *\n* SERVER <server>       = Changes servers           *\n* GETSPOOFS          = Gets the current spoofing      *\n* SPOOFS <subnet>       = Changes spoofing to a subnet     *\n* DISABLE           = Disables all packeting from this bot *\n* ENABLE            = Enables all packeting from this bot *\n* KILL             = Kills the knight           *\n* GET <http address> <save as> = Downloads a file off the web     *\n* VERSION           = Requests version of knight      *\n* KILLALL           = Kills all current packeting     *\n* HELP             = Displays this            *\n* IRC <command>        = Sends this command to the server   *\n* SH <command> = Executes a command *\n\n```\n\n-----\n\nSource code for this backdoor has been publicly available since at least September 2009,\nand it is trivial to compile this code, using Apple’s XCode, and create a Mac executable.\n\nThis tool requires installation, and may actually be installed manually by people who choose\n[to participate in DDoS attacks, such as those in the Anonymous group.](https://en.wikipedia.org/wiki/Anonymous_(group))\n\nIndividual users generally have little to fear from these tools. However, servers connected to\nthe Internet can be vulnerable to remote installation. Hackers can take advantage of\nweaknesses in server tools, or especially PHP vulnerabilities, to gain access to a server and\ninstall a tool like this. In addition, once such a tool has been installed, the remote hacker can\ninstall other software onto the infected Mac.\n\n### What is a denial of service attack?\n\nA denial of service attack, or a distributed denial of service attack (DDoS), occurs when one\nor many computers “gang up” on a web site or server by sending a flood of traffic to that\nserver. Most web servers can handle standard traffic of a certain number of connection\nattempts per second. Large web sites, such as the biggest online retailers, can handle\nthousands of connections a second or more. But when thousands of computers get together\nand send requests all at the same time, sending “floods” of requests, servers have trouble\nremaining operable. When this type of attack happens, most firewalls will act and block the\nsending address, but in sophisticated attacks, these addresses are forged, and may change\nwith each new packet.\n\nDenial of service attacks are illegal; they are done for malicious purposes, such as to prevent\na web site from functioning, or to block network traffic to and from a specific server. In some\ncases, such as [Operation Payback, denial of service attacks were launched by a company](https://en.wikipedia.org/wiki/Operation_Payback)\npaid by some Bollywood movie studios to attack websites that would not take down\ncopyrighted material. After this, a retaliatory attack was made against a number of copyright\norganizations, law firms and others. Another attack was made on financial organizations that\nrefused to process donations to Wikileaks.\n\nSome users may install the Tsunami backdoor intentionally, to be part of such attacks. It is\nalso possible that this tool is installed remotely on servers to increase the number of\ncomputers participating in such attacks, and, therefore, their effectiveness.\n\n### Hacker tools and their usage\n\nTsunami is one of the many dozens of hacker tools that Intego VirusBarrier X6 protects\nagainst. These are tools that are used to attack a machine other than the one on which it is\ninstalled, and include tools for executing DDoS attacks, scanning ports, sniffing network\ntraffic, searching for known vulnerabilities and much more.\n\n\n-----\n\nMost hacker tools are in limited circulation, and are not used for direct attacks; they need to\nbe manually installed on computers, after which they are operated remotely. As such, their\nthreat level is generally very low. Nevertheless, VirusBarrier X6 protects against all such\ntools, notably to protect servers where they may be installed via exploits that take advantage\nof vulnerabilities in third-party code, such as PHP.\n\nIn any case, Intego has updated the threat filters for VirusBarrier X6 to protect against this\nbackdoor; threat filters dated October 25, 2011 or later, will spot and block this malware as\nOSX/Tsunami.A.\n\n[Download 30-day free trial](https://www.intego.com/demo?blog2)\n\n**[Protect your Mac from malware](https://www.intego.com/demo?blog2)**\n\n[Download a free 30-day trial version of VirusBarrier X6 and save $5](https://www.intego.com/demo?blog2)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-10-26 - Tsunami Backdoor Can Be Used for Denial of Service Attacks.pdf"
    ],
    "report_names": [
        "2011-10-26 - Tsunami Backdoor Can Be Used for Denial of Service Attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535650,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653708615,
    "ts_modification_date": 1653708615,
    "files": {
        "pdf": "https://archive.orkl.eu/3f80f3b45d29a54ffc5a0fd4d67ed09e7b886f86.pdf",
        "text": "https://archive.orkl.eu/3f80f3b45d29a54ffc5a0fd4d67ed09e7b886f86.txt",
        "img": "https://archive.orkl.eu/3f80f3b45d29a54ffc5a0fd4d67ed09e7b886f86.jpg"
    }
}