{
    "id": "87783c80-ed64-4266-8148-a2878909bafe",
    "created_at": "2022-10-25T16:48:16.404951Z",
    "updated_at": "2025-03-27T02:12:51.732616Z",
    "deleted_at": null,
    "sha1_hash": "248c00716584d84cbf66e6d19a4b27f28ee27c79",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-04-27T08:16:31Z",
    "file_modification_date": "2022-04-27T08:16:31Z",
    "file_size": 2135285,
    "plain_text": "# Asylum Ambuscade: State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement\n\n**proofpoint.com/us/blog/threat-insight/asylum-ambuscade-state-actor-uses-compromised-private-ukrainian-**\nmilitary-emails\n\nMarch 1, 2022\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nAsylum Ambuscade: State Actor Uses Compromised Private Ukrainian Military Emails to\nTarget European Governments and Refugee Movement\n\nMarch 01, 2022\nMichael Raggi, Zydeca Cass and the Proofpoint Threat Research Team\n\n## Key Takeaways\n\nProofpoint has identified a likely nation-state sponsored phishing campaign using a\npossibly compromised Ukrainian armed service member’s email account to target\nEuropean government personnel involved in managing the logistics of refugees\nfleeing Ukraine.\nThe email included a malicious macro attachment which attempted to download a\nLua-based malware dubbed SunSeed.\nThe infection chain used in this campaign bears significant similarities to a historic\ncampaign Proofpoint observed in July 2021, making it likely the same threat actor is\nbehind both clusters of activity.\nProofpoint is releasing this report in an effort to balance accuracy with\nresponsibility to disclose actionable intelligence during a time of high-tempo\nconflict.\n\n## Overview\n\n“Ambuscade: To attack suddenly and without warning from a concealed place”\n\n\n-----\n\nProofpoint researchers have identified a phishing campaign originating from an email\naddress (ukr[.]net) that appears to belong to a compromised Ukranian armed service\n[member. This discovery comes on the heels of alerts by the Ukrainian Computer](https://www.cyberscoop.com/ukrainian-cyber-officials-warn-of-new-wave-of-phishing-attacks/)\nEmergency Response Team (CERT-UA) and the State Service of Special Communications\nand Information Protection of Ukraine about widespread phishing campaigns targeting\nprivate email accounts of Ukrainian armed service members by ‘UNC1151’, which\nProofpoint tracks as part of TA445. The email observed by Proofpoint may represent the\nnext stage of these attacks. The email included a malicious macro attachment which\nutilized social engineering themes pertaining to the Emergency Meeting of the NATO\nSecurity Council held on February 23, 2022. The email also contained a malicious\nattachment which attempted to download malicious Lua malware named SunSeed and\ntargeted European government personnel tasked with managing transportation and\npopulation movement in Europe. While Proofpoint has not definitively attributed this\ncampaign to the threat actor TA445, researchers acknowledge that the timeline, use of\ncompromised sender addresses aligning with Ukrainian government reports, and the\nvictimology of the campaign align with published TA445 tactics to include the targeting\nand collection around refugee movement in Europe.\n\nProofpoint assesses that, in light of the ongoing Russia-Ukraine war, actions by proxy\nactors like TA445 will continue to target European governments to gather intelligence\naround the movement of refugees from Ukraine and on issues of importance to the\nRussian government. TA445, which appears to operate out of Belarus, specifically has\n[a history of engaging in a significant volume of disinformation operations intended to](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\nmanipulate European sentiment around the movement of refugees within NATO\ncountries. These controlled narratives may intend to marshal anti-refugee sentiment\nwithin European countries and exacerbate tensions between NATO members, decreasing\nWestern support for the Ukrainian entities involved in armed conflict. This approach is\n[a known factor within the hybrid warfare model employed by the Russian military and by](https://carnegieendowment.org/2019/07/03/west-fears-russia-s-hybrid-warfare.-they-re-missing-bigger-picture-pub-79412)\nextension that of Belarus.\n\n## Delivery\n\nOn February 24, 2022, Proofpoint detected an email originating from a ukr[.]net email\naddress which was sent to a European government entity. The email utilized the subject\n\"IN ACCORDANCE WITH THE DECISION OF THE EMERGENCY MEETING OF THE\nSECURITY COUNCIL OF UKRAINE DATED 24.02.2022\" and included a macro enabled\nXLS file titled “list of persons.xlsx,” which was later determined to deliver SunSeed\nmalware. The social engineering lure utilized in this phishing campaign were very timely,\nfollowing a NATO Security Council meeting on February 23, 2022 and a news story about\na Russian government “kill list” targeting Ukrainians that began circulating in Western\nmedia outlets on February 21, 2022. The format of the subject included the date\n“24.02.2022” at the end of subject line and was superficially similar to emails reported by\nthe State Service of Special Communications and Information Protection of Ukraine\n(SSSCIP) on February 25, 2022. This alert indicated that mass phishing campaigns were\n\n\n-----\n\ntargeting “Citizens’ e-mail addresses” in Ukraine. The timing of the Proofpoint observed\ncampaign is notable as it occurred within close proximity to the campaigns reported by\nUkrainian state agencies.\n\n_[Figure 1. SSSCIP Ukraine reported email including date format 24.02.2022.](https://twitter.com/dsszzi/status/1497103078029291522)_\n\n\n-----\n\n_[Figure 2. CERT-UA reports of UNC1151 targeting private accounts of Ukrainian](https://www.facebook.com/UACERT/posts/312939130865352)_\n_military personnel._\n\nOpen-source research on the sender email address identified the account on a Ukrainian\npublic procurement document for a Stihl lawn mower in 2016. The email account was\nlisted as the contact address on the purchase, while the customer was listed as “Військова\nчастина А2622” or military unit A2622. This title, as well as the address listed, appear to\nrefer to a military barracks that houses a military unit in “Чернігівська область” or the\nChernihiv region of Ukraine. While Proofpoint has not definitively determined that this\ndetected campaign is aligned with the phishing campaigns reported by the Ukrainian\ngovernment or that this activity can be attributed to TA445, researchers assess that this\nmay represent a continuation of the campaigns that utilize compromised Ukrainian\npersonal accounts of armed service members to target the governments of NATO\nmembers in Europe.\n\n\n-----\n\n-----\n\n_Figure 3. Ukrainian military procurement documents including possible compromised_\n_sender email as contact._\n\n## Macro Enabled Attachments\n\nThe malicious XLS attachment observed in the email was laden with a simple but distinct\nmacro. When enabled, it executes a VB macro named “Module1” which creates a\nWindows Installer (msiexec.exe) object invoking Windows Installer to call out to an\nactor-controlled staging IP and download a malicious MSI package. It also sets a\n[Microsoft document UILevel equal to “2” which specifies a user interface level of](https://docs.microsoft.com/en-us/windows/win32/msi/uilevel)\n“completely silent installation.” This hides all macro actions and network connections\nfrom the user. The actor accesses the delivery IP via the Microsoft\n[Installer InstallProduct method which is intended to obtain an MSI install file from a](https://docs.microsoft.com/en-us/windows/win32/msi/downloading-an-installation-from-the-internet)\nURL, save it to a cached location, and finally begin installation of the MSI package. Since\nthe actor is utilizing an MSI package as an installer for a Lua-based malware, this method\nis well suited to be deployed via a malicious macro-laden document delivered via\nphishing.\n\n\n-----\n\n_Figure 4. Observed malicious macro within list of persons.xlsx._\n\n## SunSeed Lua Malware Installation\n\nAnalysis of the actor-controlled delivery infrastructure identified an MSI package which\ninstalled a series of Lua-based dependencies, executed a malicious Lua script that\nProofpoint has dubbed SunSeed, and established persistence via an LNK file installed for\nautorun at Windows Startup. This file, named qwerty_setup.msi, was\n[previously identified publicly by security researcher Colin Hardy in response to](https://twitter.com/cybercdh/status/1497486233743863812)\n[Proofpoint’s initial content regarding this threat. The package installs 12 legitimate Lua](https://twitter.com/threatinsight/status/1497355737844133895)\ndependencies, a Windows Lua interpreter, a malicious Lua script (SunSeed), and a\nWindows shortcut LNK file for persistence. Notably, the legitimate Windows Lua\ninterpreter sppsvc.exe has been modified so it does not print any output to the Windows\nConsole. This is likely an effort to conceal the malware installation from the infected user.\nAll files, except for the LNK file, are installed to the folder C:\\ProgramData\\.security\n\n-----\n\nsoft\\. The LNK persistence script, which executes the SunSeed command “print.lua” via\nthe Window Lua interpreter, is saved to the directory C:\\ProgramData\\.securitysoft\\sppsvc.exe to be executed at startup. This executes the malicious SunSeed Lua script\n“print.lua” that attempts to retrieve additional malicious Lua code from the actor\ncommand and control (C2) server.\n\n**Legitimate Files and Lua Dependencies:**\n\nluacom.dll (LuaCom Library)\nltn12.lua (LuaSocket: LTN12 module)\nmime.lua (MIME support for the Lua language)\nhttp.lua (HTTP library for Lua)\nurl.lua (luasocket)\ntp.lua (luasocket)\nsocket.lua (luasocket)\ntp.lua\ncore.dll\nmime.dll\nlua51.dll\nsppsvc.exe (Lua Windows Standalone Interpreter – modified to suppress console\noutput)\n<6 characters>.rbs (Windows Installer Rollback Script)\n\n**Persistence File:**\n\nSoftware Protection Service.lnk\n\nInstallation Directory:\n\n~\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\Software\nProtection Service.lnk\n\n**Malicious SunSeed Lua Script:**\n\nprint.lua|\n7bf33b494c70bd0a0a865b5fbcee0c58fa9274b8741b03695b45998bcd459328\n\n\n-----\n\n_Figure 5. Asylum Ambuscade - Campaign Snapshot._\n\nProofpoint researchers observed several distinct and unusual aspects about the MSI\npackage upon closer inspection. The actor utilized the Japanese Shift-JIS code base,\nresulting in a Japanese language installation message upon launching the MSI package.\nThis may be a rudimentary false flag intended to conceal the spoken language of the\nthreat actor. Additionally, examination of the cryptography calls made by the package\nduring installation indicates that the MSI file appears to have been created using a dated\nversion of WiX Toolset version 3.11.0.1528. This is an open-source software that allows\nusers to “build MSIs without requiring additional software on a build server” from the\ncommand line. This version was last updated in 2017 with a more recent update being\npushed in 2019 and an entirely new version of the toolset made available in May 2021.\n\n\n-----\n\n_Figure 6. Japanese code base MSI package installation display._\n\n_Figure 7. MSI package cryptography call indicating Windows Installer XML version._\n\n## SunSeed Malware Capabilities: A Lua Downloader\n\nBased on decoding of the SunSeed print.lua malicious second stage payload script, it\nappears to be a simple downloader which obtains the C Drive partition serial number\nfrom the host, appends to a URL request via a Lua socket, consistently pings the C2 server\nfor additional Lua code, and executes the code upon receiving it within a response. At the\ntime of analysis, Proofpoint did not receive additional Lua code from the C2 server.\nHowever, researchers believe that this is likely intended to deliver subsequent stage\n\n\n-----\n\npayloads to the infected host. Further attempts to decode the SunSeed Lua host included\nseveral notable strings that may suggest a possible response from the actor-controlled\nserver. These strings do not appear to be part of the initial SunSeed script’s functionality\nin the absence of a C2 server response. Observed string values include, but are not limited\nto:\n\n“serial”\n“string”\n“luacom”\n“CreateObject”\n“Scripting.FileSystemObject”\n“Drives”\n“SerialNumber”\n“socket.http”\n“request”\n“http://84.32.188[.]96/”\n“ socket”\n“sleep”\n\n## Command and Control\n\nThe SunSeed malware when executed issues GET requests over HTTP via port 80 using a\nLua Socket. The requests are issued to the C2 server every three seconds anticipating a\nresponse. The malware specifies the user agent as “LuaSocket 2.0.2” and appends the\ninfected target’s C Drive partition serial number to the URI request. This is a unique\ndecimal digit value assigned to a drive upon creation of the file system. It may be an\nattempt by actors to track infected victims on the backend per their unique serial number.\nAdditionally, this may allow operators to be selective about which infections are issued a\nnext stage payload response. Based on the observed strings in the Lua script, researchers\nspeculate that the server response may include further malicious commands, or a Lua\nbased installer code which is executed as a response to the SunSeed payload, depending\non the received serial identification number.\n\n_Figure 8. SunSeed Lua malware C2 communication._\n\n## Victimology and Targeting\n\nWith the finite data set available to Proofpoint surrounding this campaign, limited\nconclusions can be drawn regarding targeting. The Proofpoint-observed email messages\nwere limited to European governmental entities. The targeted individuals possessed a\n\n\n-----\n\nrange of expertise and professional responsibilities. However, there was a clear\npreference for targeting individuals with responsibilities related to transportation,\nfinancial and budget allocation, administration, and population movement within\nEurope. This campaign may represent an attempt to gain intelligence regarding the\nlogistics surrounding the movement of funds, supplies, and people within NATO member\ncountries.\n\n## Attribution Remains Unclear\n\nSeveral temporal and anecdotal indicators exist which suggest that this activity aligns\n[with reported campaigns by the threat actor TA445/UNC1151/Ghostwriter. However,](https://www.mandiant.com/resources/unc1151-linked-to-belarus-government)\nProofpoint has not yet observed concrete technical overlaps which would allow us to\ndefinitively attribute this campaign to this actor. In addition to the notable overlaps with\nUkrainian government reported campaigns referenced previously, the victimology of this\ncampaign with prominent NATO governments being targeted and a possible focus on the\nmovements of refugees in NATO countries recalls historic motivations of TA445’s\ninformation operations circa 2021. Specifically, the anti-migratory narratives\ndisseminated by the group also referred to as Ghostwriter during the 2021 migratory\ncrisis in which Belarus intentionally funneled refugees to the Polish border belies a\npossible connection between this 2022 campaign and TA445’s historic mandate. Mainly\nboth campaigns may indicate the weaponization of migrants and refugees of war through\na hybrid information warfare and targeted cyber-attack model. Researchers at Mandiant\naddressed these tactics by UNC1151’s information operation team referred to as\n[Ghostwriter (collectively TA445) in a recent presentation (12:17 time stamp), disclosing](https://www.youtube.com/watch?v=l2KqGBkDwww)\nthe existence of the group and attributing the activity to Belarus. Proofpoint also notes\nthat, in addition to the Asylum Ambuscade operation, in recent days researchers have\ndetected TA445 credential harvesting activity that aligns with Mandiant’s description of\nthis threat group to include the use of GoPhish to deliver malicious email content. This\nactivity appears distinct from the Asylum Ambuscade campaign. Proofpoint is currently\ntracking the actor responsible for Asylum Ambuscade as distinct from TA445 until a\ntechnical relationship can be further established.\n\n\n**Tactic** **Asylum Ambuscade**\n\n**Campaign**\n\n**Document Attachment Phishing**\n\n**Focus on Refugee Issues and NATO**\n\n\n**TA445**\n\n\n-----\n\n**Use of Macro Enabled Documents**\n\n**Use of GoPhish**\n\n**Use of MSI Packages**\n\n**Use of Lua Based Malware**\n\n**Use of Compromised Sender**\n\n**Infrastructure**\n\n_Figure 9. Comparison of Asylum Ambuscade campaign and TA445 TTPs._\n\nWhile Proofpoint has not definitively determined attribution at this time, researchers\nassess with moderate confidence that this campaign and a historic campaign from July\n2021 were conducted by the same threat actor. The July 2021 campaign utilized a highly\nsimilar macro-laden XLS attachment to deliver MSI packages that install a Lua malware\nscript. Similarly, the campaign utilized a very recent government report as the basis of the\n[social engineering content and titled the malicious attachment “list of participants of the](https://www.virustotal.com/gui/file/a8fd0a5de66fa39056c0ddf2ec74ccd38b2ede147afa602aba00a3f0b55a88e0)\nbriefing.xls.” In addition to the file name being quite similar to the Asylum Ambuscade\ncampaign, the Lua script created a nearly identical URI beacon to the SunSeed sample,\nwhich was composed of the infected victim’s C Drive partition serial number. Analysis of\nthe cryptography calls in both samples revealed that the same version of WiX 3.11.0.1528\nhad been utilized to create the MSI packages. Finally, the macros in this historic\ncampaign utilized the identical technique as the Asylum Ambuscade campaign, using\nWindows Installer to retrieve an MSI package from an actor-controlled IP resource and\nsuppressing indications of installation from the user. The July 2021 campaign targeted\nsenior cyber security practitioners and decisionmakers at private US-based companies,\nincluding those in the defense sector.\n\n\n-----\n\n_Figure 10. Historic malicious macro seen in July 2021._\n\n## Conclusion: Balancing Accurate Reporting in a Timely Fashion\n\nThis activity, independent of attribution conclusions, represents an effort to target NATO\nentities with compromised Ukrainian military accounts during an active period of armed\nconflict between Russia, its proxies, and Ukraine. In publishing this report, Proofpoint\nseeks to balance the accuracy of responsible reporting with the quickest possible\ndisclosure of actionable intelligence. The onset of hybrid conflict, including within the\ncyber domain, has accelerated the pace of operations and reduced the amount of time that\ndefenders have to answer deeper questions around attribution and historical correlation\nto known nation-state operators. However, these are issues that Proofpoint will continue\nto research while protecting customers globally. Proofpoint invites additional details and\ninput around any observed activity that aligns with these reports. While the utilized\n\n\n-----\n\ntechniques in this campaign are not groundbreaking individually, if deployed collectively,\nand during a high tempo conflict, they possess the capability to be quite effective. As the\nconflict continues, researchers assess similar attacks against governmental entities in\nNATO countries are likely. Additionally, the possibility of exploiting intelligence around\nrefugee movements in Europe for disinformation purposes is a proven part of Russian\nand Belarussian-state techniques. Being aware of this threat and disclosing it publicly are\nparamount for cultivating awareness among targeted entities.\n\n**Indicators of Compromise (IOCs)**\n\n**IOC** **Type**\n\n**IOC**\n\n<redacted>@ukr[.]net Sende\n\nEma\n\n\nIN ACCORDANCE WITH THE DECISION OF THE EMERGENCY MEETING\nOF THE SECURITY COUNCIL OF UKRAINE DATED 24.02.2022\n\n\nEma\nSubje\n\n\nlist of persons.xls\n1561ece482c78a2d587b66c8eaf211e806ff438e506fcef8f14ae367db82d9b3\n\n\nAttachm\n\n\n84.32.188[.]96 IP\n\n\nqwerty_setup.msi\n\n31d765deae26fb5cb506635754c700c57f9bd0fc643a622dc0911c42bf93d18f\n\n\nMSI\nPacka\n\n\nprint.lua\n7bf33b494c70bd0a0a865b5fbcee0c58fa9274b8741b03695b45998bcd459328\n\n\nLua Sc\n\n\n-----\n\nluacom.dll\nf97f26f9cb210c0fcf2b50b7b9c8c93192b420cdbd946226ec2848fd19a9af2c\n\nltn12.lua\nb1864aed85c114354b04fbe9b3f41c5ebc4df6d129e08ef65a0c413d0daabd29\n\nmime.lua\ne9167e0da842a0b856cbe6a2cf576f2d11bcedb5985e8e4c8c71a73486f6fa5a\n\nhttp.lua\nd10fbef2fe8aa983fc6950772c6bec4dc4f909f24ab64732c14b3e5f3318700c\n\nsocket.dll\n3694f63e5093183972ed46c6bef5c63e0548f743a8fa6bb6983dcf107cab9044\n\nmime.dll\n976b7b17f2663fee38d4c4b1c251269f862785b17343f34479732bf9ddd29657\n\nlua5.1.dll\nfbbe7ee073d0290ac13c98b92a8405ea04dcc6837b4144889885dd70679e933f\n\nurl.lua\n269526c11dbb25b1b4b13eec4e7577e15de33ca18afa70a2be5f373b771bd1ab\n\nsppsvc.exe\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\ntp.lua\n\n343afa62f69c7c140fbbf02b4ba2f7b2f711b6201bb6671c67a3744394084269\n\nsocket.lua\n15fd138a169cae80fecf4c797b33a257d587ed446f02ecf3ef913e307a22f96d\n\n\nFiles\n\n\nSoftware Protection Service.lnk File Na\n\n\nAppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\Software\nProtection Service.lnk\n\n\nDirecto\n\nPath\n\n\nC:\\ProgramData\\.security-soft Directo\n\nPath\n\nhxxp://84.32.188[.]96/<hexadecimal_value> URL\n\n\n-----\n\nlist of participants of the briefing.xls\n\na8fd0a5de66fa39056c0ddf2ec74ccd38b2ede147afa602aba00a3f0b55a88e0\n\n\nFile\n\n\n157.230.104[.]79 IP\n\n\ni.msi\n\n2e1de7b61ed25579e796ec4c0df2e25d2b98a1f8d4fdb077e2b52ee06c768fca\n\n\nMSI\nPacka\n\n\nhxxp://45.61.137[.]231/?id=<hexdecimal_value> URL\n\n\nwlua5.1.exe\n\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\ncore.lua\n\n737f08702f00e78dbe78acbeda63b73d04c1f8e741c5282a9aa1409369b6efa8\n\nluacom.dll\n\nf97f26f9cb210c0fcf2b50b7b9c8c93192b420cdbd946226ec2848fd19a9af2c\n\nstruct.dll\n\n5b317f27ad1e2c641f85bef601740b65e93f28df06ed03daa1f98d0aa5e69cf0\n\nltn12.lua\n\nb1864aed85c114354b04fbe9b3f41c5ebc4df6d129e08ef65a0c413d0daabd29\n\nmime.lua\n\ne9167e0da842a0b856cbe6a2cf576f2d11bcedb5985e8e4c8c71a73486f6fa5a\n\nhttp.lua\n\nd10fbef2fe8aa983fc6950772c6bec4dc4f909f24ab64732c14b3e5f3318700c\n\nsocket.dll\n\n3694f63e5093183972ed46c6bef5c63e0548f743a8fa6bb6983dcf107cab9044\n\ncore.dll\n\n9aa3ca96a84eb5606694adb58776c9e926020ef184828b6f7e6f9b50498f7071\n\n\nFiles\n\n\n-----\n\ncore.lua\n\n20180a8012970453daef6db45b2978fd962d2168fb3b2b1580da3af6465fe2f6\n\nmime.dll\n\n976b7b17f2663fee38d4c4b1c251269f862785b17343f34479732bf9ddd29657\n\nlua5.1.dll\n\nfbbe7ee073d0290ac13c98b92a8405ea04dcc6837b4144889885dd70679e933f\n\nurl.lua\n\n269526c11dbb25b1b4b13eec4e7577e15de33ca18afa70a2be5f373b771bd1ab\n\nalien.lua\n\n303e004364b1beda0338eb10a845e6b0965ca9fa8ee16fa9f3a3c6ef03c6939f\n\ntp.lua\n\n343afa62f69c7c140fbbf02b4ba2f7b2f711b6201bb6671c67a3744394084269\n\nsocket.lua\n\n15fd138a169cae80fecf4c797b33a257d587ed446f02ecf3ef913e307a22f96d\n\n**YARA Signatures**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2022/2022.03.01.Asylum_Ambuscade/Asylum%20Ambuscade_%20State%20Actor%20Uses%20Compromised%20Private%20Ukrainian%20Military%20Emails%20to%20Target%20European%20Governments%20and%20Refugee%20Movement%20_%20Proofpoint%20US.pdf"
    ],
    "report_names": [
        "Asylum Ambuscade_ State Actor Uses Compromised Private Ukrainian Military Emails to Target European Governments and Refugee Movement _ Proofpoint US"
    ],
    "threat_actors": [
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f53f4b13-b055-426f-876a-18cf9a0f4fa0",
            "created_at": "2024-05-01T02:03:08.129377Z",
            "updated_at": "2025-03-27T02:05:17.412789Z",
            "deleted_at": null,
            "main_name": "MOONSCAPE",
            "aliases": [
                "UAC-0051 ",
                "UNC1151 ",
                "TA445 "
            ],
            "source_name": "Secureworks:MOONSCAPE",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041571,
    "ts_creation_date": 1651047391,
    "ts_modification_date": 1651047391,
    "files": {
        "pdf": "https://archive.orkl.eu/248c00716584d84cbf66e6d19a4b27f28ee27c79.pdf",
        "text": "https://archive.orkl.eu/248c00716584d84cbf66e6d19a4b27f28ee27c79.txt",
        "img": "https://archive.orkl.eu/248c00716584d84cbf66e6d19a4b27f28ee27c79.jpg"
    }
}