{
    "id": "8778e4a4-4cf8-47b6-b493-5ccf87ba10d1",
    "created_at": "2023-01-12T15:00:10.997637Z",
    "updated_at": "2025-03-27T02:06:11.751584Z",
    "deleted_at": null,
    "sha1_hash": "b61368088728611984c5c44cb806c388f1594eaa",
    "title": "2013-09-18 - A New Wave Of WIN32-CAPHAW Attacks - A ThreatLabZ Analysis",
    "authors": "",
    "file_creation_date": "2022-12-29T00:29:32Z",
    "file_modification_date": "2022-12-29T00:29:32Z",
    "file_size": 1126011,
    "plain_text": "# A New Wave Of WIN32/CAPHAW Attacks\n\n**[zscaler.com/blogs/security-research/new-wave-win32caphaw-attacks-threatlabz-analysis](https://www.zscaler.com/blogs/security-research/new-wave-win32caphaw-attacks-threatlabz-analysis)**\n\n## Introduction and setting the context\n\nOver the last month, the ThreatLabZ researchers have been actively monitoring a recent\n[uptick in the numbers of Win32/Caphaw (henceforward known as Caphaw) infections that](http://www.microsoft.com/security/portal/threat/encyclopedia/entry.aspx?Name=Backdoor:Win32/Caphaw.A)\nhave been actively targeting users' bank accounts since 2011. You may recognize this threat\nfrom research done by WeLiveSecurity earlier this year in regards to this threat targeting EU\nBanking sites. This time would appear to be no different. So far, we have tied this threat to\nmonitoring it's victims for login credentials to 24 financial institutions.\n\n### About Win32/Caphaw\n\nThe Caphaw trojan is a financial malware attack that functions similarly to the Carberp,\n[Ranbyus, and Tinba threats according to analysis done by WeLiveSecurity Researcher,](http://www.welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/)\nAlekandr Matrosov. These attacks are carried out utilizing stealth tactics both on and off the\nwire. Caphaw avoids local detection by injecting itself into legitimate processes such as\nexplorer.exe or iexplore.exe, while simultaneously obfuscating its phone home traffic through\nthe use of [Domain Generated Algorithm created addresses using Self Signed SSL](http://en.wikipedia.org/wiki/Domain_generation_algorithm)\ncertificates. This limits the ability of traditional network monitoring solution to dissect the\npackets on the wire for any malicious transactions. Caphaw attacks major European banks\nand previous analysis has shown that the malware is most active in the UK, Italy, Denmark\nand Turkey. This is especially prevalent considering the mapped known infected nodes seen\n[here.](http://www.virusradar.com/en/Win32_Caphaw/map)\n\nThe geoip (location) information derived from the infected host is of special significance to\nthis malware. The malware leverages the following legitimate URL:\n\n\n-----\n\nhxxp://j.maxmind.com/app/geoip.js to discover geoip information about its freshly infected\nvictim. Administrators should view this transaction as a starting point for their investigation\ninto any suspicious activity. It is not a malicious service, but illustrates how malware writers\ncan leverage even legitimate services. The infection uses the output of this script to extract\nlocation information about the infected host/victim.\nAt the time of research, we were unable to identify the initial infection vector. We can tell that\nit is more than likely arriving as part of an Exploit Kit honing in on vulnerable versions of\nJava. The reason we suspect this is that the User-Agent for every single transaction that has\ncome through our Behavioral Analysis (BA) solution has been: Mozilla/4.0 (Windows XP 5.1)\nJava/1.6.0_07.\n\nThe UserAgent for known drop locations of this are manipulating users with Java version\n1.6.07\n\nThe variation in the dropped executable is different across every instance, so its no wonder\n[standard AV is having a problem keeping up (1/46 at time of research). This AV performance](https://www.virustotal.com/#/file/32a107cefbc1f6a5cd194a638b8d625e420eba2a6b866d509684192edb7c561a/analysis/)\nalso indicates that the likelihood of someone proactively catching this infection inside their\nnetwork is fairly low at the time of this writing.\n\n### Use of DGA\n\nA [domain generation algorithm (or DGA) represents an algorithm seen in various families of](http://en.wikipedia.org/wiki/Domain_generation_algorithm)\nmalware to generate a large number of quasi-random domain names. These can be used to\nidentify the malware's command and control (CnC) servers so that the infected hosts can\n\"dial home\" and receive/send commands/data. The large number of potential rendezvous\npoints with randomized names makes it extremely difficult for investigators and law\nenforcement agencies to identify and \"take down\" the CnC infrastructure. Furthermore, by\nusing [encryption, it adds another layer of difficulty to the process of identifying and targeting](http://en.wikipedia.org/wiki/Public-key_cryptography)\nthe command and control assets.\nWhat initially drew us to this threat was the use of DGA following the execution of the\ndropped malicious package. We ran three test instances of the attack sequence in our\nBehavior Analysis (BA) lab to illustrate the use of DGA in the malware's attack sequence:\nInstance 1\n\n**cso0vm2q6g86owao.thepohzi.su**\n\n**5qloxxe.tohk5ja.cc**\n\n**k2s0euuz.oogagh.su**\n\n\n-----\n\nInstance 2\n\n**v8ylm8e.thepohzi.su**\n\n**2g24ar4vu8ay6.tohk5ja.cc**\n\n**d6vh5x1cic1yyz1i.oogagh.su**\n\nInstance 3\n\n**t2250p29079m6oq8.thepohzi.su**\n\n**ngb0ef99.tohk5ja.cc**\n\n**nxdhetohak91794.oogagh.su**\n\n[The pattern (\"ping.html?r=\") is commonly known to be used by past versions of Caphaw.](http://www.welivesecurity.com/2013/02/25/caphaw-attacking-major-european-banks-with-webinject-plugin/)\nDon't panic straight away if you see this string in your user logs however as it is also\ncommonplace among sites that use \"outbrain.com\" services. You'll want to look for any URI\npath that uses /ping.html?r= that does not contain \"/utils/\". Hopefully that helps narrow the\nsearch to see if you've encountered transactions similar to the following screenshot.\n\n\n-----\n\nDGA is used to hide the phone home activity of the initial detection\n\nAcross all 64 distinct samples we've collected of this threat thus far, there have been 469\ndistinct IPs where there has been a call to a DGA location. A small sample of those illustrate\nthe connection between the phone home data collected via network logs and the BA of the\nCaphaw samples.\n\n\n-----\n\nThe DGA used here shows a connection between Caphaw phone home activity and\nSandboxed samples of the threat in question\n\n### Use of SSL encrypted communications\n\nThe initial indicators were in the form of mysterious self-signed SSL traffic between end user\nhosts and various points of presence on the Internet, potentially components of the\nmalware’s CnC infrastructure. See the screenshot below showing the self signed SSL cert.\nused in the malware communication:\n\nOther screenshots below show the SSL handshake between the infected hosts and the\nremote CnC servers:\n\n\n-----\n\nSSL communication between infected host(s) and the remote CnC servers\n\nA binary executable (.exe) file is created in the attack sequence and masquerades as a .php\nfile. This executable is created using Microsoft Visual C++ and the creator has not removed\nthe debugging information from the final executable.\n\nBoth the location of where this file is dropped and the name of the file itself is selected quasirandomly. For example, in one of the test instances we found this to be:\n\n**C: Documents and**\n**Settings\\user\\ApplicationData\\Sun\\Java\\Deployment\\SystemCache\\6.0\\9\\typeperf.exe**\n\nDuring the three instances of malware execution we ran in our BA lab, we observed the\nfollowing executables and their drop locations:\n\n**\\Documents and Settings\\%USER%\\ApplicationData\\Sun\\Java\\utilman.exe**\n\n**\\Documents and Settings\\%USER%\\ApplicationData\\Microsoft\\Proof\\eventtriggers.exe**\n\n**\\Documents and Settings\\%USER%\\ApplicationData\\Microsoft\\Office\\cliconfg.exe**\n\nThe malware makes the following significant API calls:\n\nLoadLibrary\n\n\n-----\n\nGetProcAddress\nVirtualalloc\n\nThe malware executable checks to see if it is running in a VM environment and also ensures\nthat the host on which it is installed is connected to the Internet (failing which it will not run).\n\nThe malware also exhibits persistence by creating the following autorun entry in the registry:\n\n**HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Run  dfrgntfs.exe**\n**Unicode   C:\\Documents and Settings\\user\\Application**\n**Data\\Sun\\Java\\Deployment\\SystemCache\\6.0\\9\\typeperf.exe* success or wait  1**\n**B8EF5F   RegSetValueExA**\n\nFurther, the executable when run, modifies the explorer.exe process to ensure that it's selfsigned certificates are not cached and it also hides inside the explorer.exe process to ensure\nthat the protection banner is hidden for a stealthier execution:\n**HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet**\n**Settings\\Zones\\3   2500 dword 3   success or wait  1   DAEF5F**\n**RegSetValueExA**\n\n**HKEY_USERS\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings**\n**DisableCachingOfSSLPages   dword 1   success or wait 1   DAEF5F**\n**RegSetValueExA**\n\n**HKEY_USERS\\Software\\Microsoft\\Internet Explorer\\Main NoProtectedModeBanner**\n**dword 1   success or wait  1   DAEF5F   RegSetValueExA**\n\nThe malware then augments system processes to hinder its removal, once again for\npersistence:\n\n**328  C:\\WINDOWS\\system32\\wscntfy.exe   B30000   344064   D4 1E 5E EA 74 1E**\n**9F 25 F9 CC 18 A3 28 FD 93 C3 1E 78 1D 8C AC 81 22 5F D3 DF AB 7E 34 3E 49 B5 D4**\n**7A 45 F5 5D 15 72 6E 0F 93 F6 4C 2F E6 6D 31 16 6C E1 DD BB 23 F7 71 6D 06 A7 40**\n**D7 A7 EB FE 12 70 30 28 92 BD 7F 1D 41 BE 44 5F 38 97 F5 27 E9 14 29 96 D1 28 05 C5**\n**E5 D4 C8 72 94 D8 6A 11 EF 63 1D B4 89 A5 B8 FE 23 F2 1E C0 71 0E 18 7D 5B 74 B7**\n**20 A1 5A 5F CE 27 FC 53 7E E7 D7 55 72 31 BA 28 54 33 25 22 88 A2 15 45 59 CE A5 CF**\n**64 23 A7 AB E3 A4 4C C4 08 79 FC 5C BE 9C D1 FE 87 58 22 A4 B5 7D 64 29 E4 30 EC**\n**87 D3 5D 1F F5 2B 4F A9 56 42 B9 6C B2 77 BD 90 C5 42 39 03 9E FD 93 E1 91 42 AF**\n**F8 1B 69 FD 2A 5E 5B 02 0A B4 6D FE FE 73 0C AE 6C AD D6 36 C3 6D EA 48 B5 85 58**\n**E3 94 81 07 09 18 66 9F 63 79 8F C4 3D B1 CB D3 72 6C 45 4B 9B A3 3C 44 0B 61 57 98**\n**7D 98 83  success or wait  1   DA8FB2   WriteProcessMemory**\n\n**1612   164  7C8106E9  DC5A7B   C:\\WINDOWS\\explorer.exe success or wait**\n**1   CC004D   CreateThread**\n\n\n-----\n\n### Scope of the threat and impact\n\nFurther evidence of this being Caphaw exists in the banking information that it is listening for\nonce it is injected into key Windows Processes. Amongst all samples analyzed, we found\nthe following 24 major banks' sites were actively being monitored by the infection primarily to\nseek out the victim's online banking credentials. This is based on data pulled from an added\nthread to explorer.exe process.\n\nBank of Scotland\nBarclays Bank\nFirst Direct\nSantander Direkt Bank AG\nFirst Citizens Bank\nBank of America\nBank of the West\nSovereign Bank\nCo-operative Bank\nCapital One Financial Corporation\nChase Manhattan Corporation\nCiti Private Bank\nComerica Bank\nE*Trade Financial\nHarris Bank\nIntesa Sanpaolo\nRegions Bank\nSunTrust\nBank of Ireland Group Treasury\nU.S. Bancorp\nBanco Mercantil, S.A.\nVarazdinska Banka\nWintrust Financial Corporation\nWells Fargo Bank\n\n\n-----\n\nStrings found in explorer thread added by Capchaw\n\nThreatLabZ continues to monitor the Internet for this threat and it's propagation. The lab is\nalso engaged currently in dissecting this threat further in order to obtain more information\nabout its attack methodology, scope and impact.\n\n**Written by Sachin Deodhar & Chris Mannon (ThreatLabZ)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-09-18 - A New Wave Of WIN32-CAPHAW Attacks - A ThreatLabZ Analysis.pdf"
    ],
    "report_names": [
        "2013-09-18 - A New Wave Of WIN32-CAPHAW Attacks - A ThreatLabZ Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535610,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1672273772,
    "ts_modification_date": 1672273772,
    "files": {
        "pdf": "https://archive.orkl.eu/b61368088728611984c5c44cb806c388f1594eaa.pdf",
        "text": "https://archive.orkl.eu/b61368088728611984c5c44cb806c388f1594eaa.txt",
        "img": "https://archive.orkl.eu/b61368088728611984c5c44cb806c388f1594eaa.jpg"
    }
}