{
    "id": "878aa3dd-2d8f-4007-b375-0e59ef24944c",
    "created_at": "2023-01-12T15:07:47.988616Z",
    "updated_at": "2025-03-27T02:05:50.068373Z",
    "deleted_at": null,
    "sha1_hash": "3b61e7ad7ff0a9731579ae19c37c6aaf9e944965",
    "title": "2020-12-18 - Protecting Microsoft 365 from on-premises attacks",
    "authors": "",
    "file_creation_date": "2022-05-29T01:25:52Z",
    "file_modification_date": "2022-05-29T01:25:52Z",
    "file_size": 595412,
    "plain_text": "# Protecting Microsoft 365 from on-premises attacks\n\n**techcommunity.microsoft.com/t5/azure-active-directory-identity/protecting-microsoft-365-from-on-premises-**\nattacks/ba-p/1751754\n\nDecember 19, 2020\n\nDec 18 2020 04:01 PM\n\nMany customers connect their private corporate networks to Microsoft 365 to benefit their\nusers, devices, and applications. However, there are many well-documented ways these\nprivate networks can be compromised. As we have seen in recent events related to the\nSolarWinds compromise, on-premises compromise can propagate to the cloud. Because\nMicrosoft 365 acts as the “nervous system” for many organizations, it is critical to protect it\nfrom compromised on-premises infrastructure.\n\nThis document will show you how to configure your systems to protect your Microsoft 365\ncloud environment from on-premises compromise. We primarily focus on Azure AD tenant\nconfiguration settings, the ways Azure AD tenants can be safely connected to on-premises\nsystems, and the tradeoffs required to operate your systems in ways that protect your cloud\nsystems from on-premises compromise.\n\nWe strongly recommend you implement this guidance to secure your Microsoft 365 cloud\nenvironment.\n\n\n-----\n\n## Understanding primary threat vectors from compromised on- premises environments\n\nYour Microsoft 365 cloud environment benefits from an extensive monitoring and security\ninfrastructure. Using machine learning and human intelligence that looks across worldwide\ntraffic can rapidly detect attacks and allow you to reconfigure in near-real-time. In hybrid\ndeployments that connect on-premises infrastructure to Microsoft 365, many organizations\ndelegate trust to on-premises components for critical authentication and directory object\nstate management decisions. Unfortunately, if the on-premises environment is compromised,\nthese trust relationships result in attackers’ opportunities to compromise your Microsoft 365\nenvironment.\n\nThe two primary threat vectors are federation trust relationships and account\n**synchronization. Both vectors can grant an attacker administrative access to your cloud.**\n\n1. Federated trust relationships, such as SAML authentication, are used to authenticate\n\nto Microsoft 365 via your on-premises Identity Infrastructure. If a SAML token signing\ncertificate is compromised, federation would allow anyone with that certificate to\nimpersonate any user in your cloud\n\n**. We recommend you disable federation trust relationships for authentication to**\n**Microsoft 365 when possible.**\n\n2. Account synchronization can be used to modify privileged users (including their\n\ncredentials) or groups granted administrative privileges in Microsoft 365. We\n**recommend you ensure that synchronized objects hold no privileges beyond a**\n**userin Microsoft 365, either directly or via inclusion in trusted roles or groups. Ensure**\nthese objects have no direct or nested assignment in trusted cloud roles or groups.\n\n## Principles for Protecting Microsoft 365 from on-premises compromise\n\nTo address the threat vectors outlined above, we recommend you adhere to the principles\nillustrated below:\n\n\n-----\n\n1. Fully Isolate your Microsoft 365 administrator accounts. They should be\n\nMastered in Azure AD.\nAuthenticated with Multi-factor authentication (MFA).\nSecured by Azure AD conditional access.\nAccessed only by using Azure Managed Workstations.\n\nThese are restricted use accounts. There should be no on-premises accounts with\n**administrative privileges in Microsoft 365. For more information see this overview of**\nMicrosoft 365 administrator roles. Also see [Roles for Microsoft 365 in Azure Active Directory.](https://docs.microsoft.com/azure/active-directory/roles/m365-workload-docs)\n\n1. Manage devices from Microsoft 365. Use Azure AD Join and cloud-based mobile\n\ndevice management (MDM) to eliminate dependencies on your on-premises device\nmanagement infrastructure, which can compromise device and security controls.\n\n\n-----\n\n2. No on-premises account has elevated privileges to Microsoft 365. Accounts\n\naccessing on-premises applications that require NTLM, LDAP, or Kerberos\nauthentication need an account in the organization’s on-premises identity\ninfrastructure. Ensure that these accounts, including service accounts, are not included\nin privileged cloud roles or groups and that changes to these accounts cannot impact\nthe integrity of your cloud environment. Privileged on-premises software must not be\ncapable of impacting Microsoft 365 privileged accounts or roles.\n\n3. Use Azure AD cloud authentication to eliminate dependencies on your on-premises\n\ncredentials. Always use strong authentication, such as Windows Hello, FIDO, the\nMicrosoft Authenticator, or Azure AD MFA.\n\n## Specific Recommendations\n\nThe following sections provide specific guidance on how to implement the principles\ndescribed above.\n\n### Isolate privileged identities\n\nIn Azure AD, users with privileged roles such as administrators are the root of trust to build\nand manage the rest of the environment. Implement the following practices to minimize the\nimpact of a compromise.\n\nUse cloud-only accounts for Azure AD and Microsoft 365 privileged roles.\n[Deploy Azure Managed Workstations for privileged access to manage Microsoft 365](https://docs.microsoft.com/azure/active-directory/devices/howto-azure-managed-workstation)\nand Azure AD.\n[Deploy Azure AD Privileged Identity Management (PIM) for just in time (JIT) access to](https://docs.microsoft.com/azure/active-directory/privileged-identity-management/pim-configure)\nall human accounts that have privileged roles, and require strong authentication to\nactivate roles.\n[Provide administrative roles the least privilege possible to perform their tasks.](https://docs.microsoft.com/azure/active-directory/roles/delegate-by-task)\nTo enable a richer role assignment experience that includes delegation and multiple\nroles at the same time, consider using Azure AD security groups or Microsoft 365\n[Groups (collectively “cloud groups”) and enable role-based access control. You can](https://docs.microsoft.com/azure/active-directory/roles/groups-assign-role)\nalso use [Administrative Units to restrict the scope of roles to a portion of the](https://docs.microsoft.com/azure/active-directory/roles/administrative-units)\norganization.\n\n\n-----\n\n[Deploy Emergency Access Accounts and do NOT use on-premises password vaults to](https://docs.microsoft.com/azure/active-directory/roles/security-emergency-access)\nstore credentials.\n\n[For more information, see Securing privileged access, which has detailed guidance on this](https://aka.ms/SPA)\ntopic. Also, see [Secure access practices for administrators in Azure AD.](https://docs.microsoft.com/azure/active-directory/roles/security-planning)\n\n### Use cloud authentication\n\nCredentials are a primary attack vector. Implement the following practices to make\ncredentials more secure.\n\n[Deploy passwordless authentication: Reduce the use of passwords as much as](https://docs.microsoft.com/azure/active-directory/authentication/howto-authentication-passwordless-deployment)\npossible by deploying passwordless credentials. These credentials are managed and\nvalidated natively in the cloud. Choose from:\n\n[Windows Hello for business](https://docs.microsoft.com/windows/security/identity-protection/hello-for-business/passwordless-strategy)\n[Authenticator App](https://docs.microsoft.com/azure/active-directory/authentication/howto-authentication-passwordless-phone)\n\n[FIDO2 security keys](https://docs.microsoft.com/azure/active-directory/authentication/howto-authentication-passwordless-security-key-windows)\n\n[Deploy Multi-Factor Authentication: Provision multiple strong credentials using Azure](https://aka.ms/deploymentplans/mfa)\nAD MFA. That way, access to cloud resources will require a credential that is managed\nin Azure AD in addition to an on-premises password that can be manipulated.\n\nFor more information, see Create a resilient access control management strategy\nwith Azure active Directory.\n\n**Limitations and tradeoffs**\n\nHybrid account password management requires hybrid components such as password\nprotection agents and password writeback agents. If your on-premises infrastructure is\ncompromised, attackers can control the machines on which these agents reside. While\nthis will not compromise your cloud infrastructure, your cloud accounts will not protect\nthese components from on-premises compromise.\n\n\n-----\n\nOn-premises accounts synced from Active Directory are marked to never expire in\nAzure AD, based on the assumption that on-premises AD password policies will\nmitigate this. If your on-premises AD is compromised and synchronization from AD\nconnect needs to be disabled, you must set the option\n[EnforceCloudPasswordPolicyForPasswordSyncedUsers.](https://docs.microsoft.com/azure/active-directory/hybrid/how-to-connect-password-hash-synchronization#enforcecloudpasswordpolicyforpasswordsyncedusers)\n\n### Provision User Access from the Cloud\n\nProvisioning refers to the creation of user accounts and groups in applications or identity\nproviders.\n\n**Provision from cloud HR apps to Azure AD: This enables an on-premises**\ncompromise to be isolated without disrupting your Joiner-Mover-Leaver cycle from your\ncloud HR apps to Azure AD.\n**[Cloud Applications: Where possible, deploy Azure AD App Provisioning as opposed](https://docs.microsoft.com/azure/active-directory/app-provisioning/user-provisioning)**\nto on-premises provisioning solutions. This will protect some of your SaaS apps from\nbeing poisoned with malicious user profiles due to on-premises breaches.\n\n\n-----\n\n**External Identities: Use** [Azure AD B2B collaboration. This will reduce the dependency](https://docs.microsoft.com/azure/active-directory/external-identities/what-is-b2b)\non on-premises accounts for external collaboration with partners, customers, and\nsuppliers. Carefully evaluate any direct federation with other identity providers. We\nrecommend limiting B2B guest accounts in the following ways.\n\nLimit guest access to browsing groups and other properties in the directory.\n\nUse the external collaboration settings to restrict guest ability to read groups\nthey are not members of.\nBlock access to the Azure portal. You can make rare necessary exceptions.\n\nCreate a Conditional Access policy that includes all guests and external\n[users and then implement a policy to block access.](https://docs.microsoft.com/azure/role-based-access-control/conditional-access-azure-management)\n\n**Disconnected Forests: Use** [Azure AD Cloud Provisioning. This enables you to](https://docs.microsoft.com/azure/active-directory/cloud-provisioning/what-is-cloud-provisioning)\nconnect to disconnected forests, eliminating the need to establish cross-forest\nconnectivity or trusts, which can broaden the impact of an on-premises breach.\n\n**Limitations and Tradeoffs:**\n\nWhen used to provision hybrid accounts, the Azure AD from cloud HR systems relies\non on-premises synchronization to complete the data flow from AD to Azure AD. If\nsynchronization is interrupted, new employee records will not be available in Azure AD.\n\n### Use cloud groups for collaboration and access\n\nCloud groups allow you to decouple your collaboration and access from your on-premises\ninfrastructure.\n\n**Collaboration: Use Microsoft 365 Groups and Microsoft Teams for modern**\ncollaboration. Decommission on-premises distribution lists, and Upgrade distribution\nlists to Microsoft 365 Groups in Outlook.\n**Access: Use Azure AD security groups or Microsoft 365 Groups to authorize access to**\napplications in Azure AD.\n\n**Office 365 licensing: Use group-based licensing to provision to Office 365 using**\ncloud-only groups. This decouples control of group membership from on-premises\ninfrastructure.\n\nOwners of groups used for access should be considered privileged identities to avoid\nmembership takeover from on-premises compromise. Take over includes direct manipulation\nof group membership on-premises or manipulation of on-premises attributes that can affect\ndynamic group membership in Microsoft 365.\n\n\n-----\n\n### Manage devices from the cloud\n\nUse Azure AD capabilities to securely manage devices.\n\n**Use Windows 10 Workstations:** [Deploy Azure AD Joined devices with MDM policies.](https://docs.microsoft.com/azure/active-directory/devices/azureadjoin-plan)\n[Enable Windows Autopilot for a fully automated provisioning experience.](https://docs.microsoft.com/mem/autopilot/windows-autopilot)\n\nDeprecate Windows 8.1 and earlier machines.\nDo not deploy Server OS machines as workstations.\n\nUse [Microsoft Intune as the source of authority of all device management](https://www.microsoft.com/en/microsoft-365/enterprise-mobility-security/microsoft-intune)\nworkloads.\n\n**[Deploy Azure Managed Workstations for privileged access to manage Microsoft 365](https://docs.microsoft.com/azure/active-directory/devices/howto-azure-managed-workstation)**\nand Azure AD.\n\n### Workloads, applications, and resources\n\n**On-premises SSO systems: Deprecate any on-premises federation and Web Access**\nManagement infrastructure and configure applications to use Azure AD.\n**SaaS and LOB applications that support modern authentication protocols:** Use\nAzure AD for single sign-on. The more apps you configure to use Azure AD for\nauthentication, the less risk in the case of an on-premises compromise.\n**Legacy Applications**\n\nAuthentication, authorization, and remote access to legacy applications that do\nnot support modern authentication can be enabled via Azure AD Application\nProxy. They can also be enabled through a network or application delivery\n[controller solution using secure hybrid access partner integrations.](https://docs.microsoft.com/azure/active-directory/manage-apps/secure-hybrid-access)\nChoose a VPN vendor that supports modern authentication and integrate its\nauthentication with Azure AD. In the case of an on-premises compromise, you\ncan use Azure AD to disable or block access by disabling the VPN.\n**Application and workload servers**\n\nApplications or resources that required servers can be migrated to Azure IaaS\nand use [Azure AD Domain Services (Azure AD DS) to decouple trust and](https://docs.microsoft.com/azure/active-directory-domain-services/overview)\ndependency on AD on-premises. To achieve this decoupling, virtual networks\nused for Azure AD DS should not have connection to corporate networks.\n[Follow the guidance of the credential tiering. Application Servers are typically](https://aka.ms/TierModel)\nconsidered Tier 1 assets.\n\n\n-----\n\n### Conditional Access Policies\n\nUse Azure AD Conditional Access to interpret signals and make authentication decisions\n[based on them. For more information, see the Conditional Access deployment plan.](https://aka.ms/deploymentplans/ca)\n\n[Legacy Authentication Protocols:Use Conditional Access to block legacy authentication](https://docs.microsoft.com/azure/active-directory/fundamentals/auth-sync-overview)\nprotocols whenever possible. Additionally, disable legacy authentication protocols at\nthe application level using application-specific configuration.\n\n[See specific details for Exchange Online and](https://docs.microsoft.com/exchange/clients-and-mobile-in-exchange-online/disable-basic-authentication-in-exchange-online#how-basic-authentication-works-in-exchange-online) [SharePoint Online.](https://docs.microsoft.com/powershell/module/sharepoint-online/set-spotenant?view=sharepoint-ps)\n[Implement the recommended Identity and device access configurations.](https://docs.microsoft.com/microsoft-365/security/office-365-security/identity-access-policies?view=o365-worldwide)\nIf you are using a version of Azure AD that does not include Conditional Access,\n[ensure that you are using the Azure AD security defaults.](https://docs.microsoft.com/azure/active-directory/fundamentals/concept-fundamentals-security-defaults)\n\nFor more information on Azure AD feature licensing, see the Azure AD pricing\nguide.\n\n### Monitoring \n\nOnce you have configured your environment to protect your Microsoft 365 from an on[premises compromise, proactively monitor the environment.](https://docs.microsoft.com/azure/active-directory/reports-monitoring/overview-monitoring)\n\n**Scenarios to Monitor**\n\nMonitor the following key scenarios, in addition to any scenarios specific to your\norganization. For example, you should proactively monitor access to your business-critical\napplications and resources.\n\n**Suspicious activity: All** [Azure AD risk events should be monitored for suspicious](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection#risk-detection-and-remediation)\nactivity. [Azure AD Identity Protection is natively integrated with Azure Security Center.](https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection)\n\n[Define the network named locations to avoid noisy detections on location-based](https://docs.microsoft.com/en-us/azure/active-directory/reports-monitoring/quickstart-configure-named-locations)\nsignals.\n\n**User Entity Behavioral Analytics (UEBA) alerts: Use UEBA to get insights on**\nanomaly detection.\n\n[Microsoft Cloud App Discovery (MCAS) provides UEBA in the cloud.](https://docs.microsoft.com/en-us/cloud-app-security/tutorial-ueba)\nYou can integrate on-prem UEBA from Azure ATP. MCAS reads signals from\nAzure AD Identity Protection.\n\n\n-----\n\n**Emergency access accounts activity: Any access using emergency access**\n[accounts should be monitored and alerts created for investigations. This monitoring](https://docs.microsoft.com/azure/active-directory/users-groups-roles/directory-emergency-access#monitor-sign-in-and-audit-logs)\nmust include:\n\nSign-ins.\nCredential management.\nAny updates on group memberships.\nApplication Assignments.\n\n**Privileged role activity: Configure and review security alerts generated by Azure AD**\nPIM. Monitor direct assignment of privileged roles outside PIM by generating alerts\nwhenever a user is assigned directly.\n\n**Azure AD tenant-wide configurations: Any change to tenant-wide configurations**\nshould generate alerts in the system. These include but are not limited to\n\nUpdating custom domains\nAzure AD B2B allow/block list changes\nAzure AD B2B allowed identity providers (SAML IDPs through direct federation or\nsocial logins)\nConditional Access or Risk policy changes\n**Application and service principal objects:**\n\nNew applications or service principals that might require Conditional Access\npolicies\nAdditional credentials added to service principals\nApplication consent activity\n**Custom roles:**\n\nUpdates of the custom role definitions\n\nNew custom roles created\n\n**Log Management**\n\nDefine a log storage and retention strategy, design, and implementation to facilitate a\nconsistent toolset such as SIEM systems like Azure Sentinel, common queries, and\ninvestigation and forensics playbooks.\n\n**Azure AD Logs Ingest logs and signal produced following consistent best practices**\n(e.g., diagnostics settings, log retention, SIEM ingestion, etc.). The log strategy must\ninclude the following Azure AD logs:\n\nSign-in activity\nAudit logs\nRisk events\n\n\n-----\n\n[Azure AD provides Azure Monitor integration for the sign-in activity log and audit logs. Risk](https://docs.microsoft.com/azure/active-directory/reports-monitoring/concept-activity-logs-azure-monitor)\n[events can be ingested through Microsoft Graph API. You can](https://aka.ms/AzureADSecuredAzure/32b) stream Azure AD logs to\nAzure monitor logs.\n\n**Hybrid Infrastructure OS Security Logs. All hybrid identity infrastructure OS logs**\nshould be archived and carefully monitored as a Tier 0 system, given the surface area\nimplications. This includes:\n\nAzure AD Connect. [Azure AD Connect Health must be deployed to monitor](https://aka.ms/AzureADSecuredAzure/32e)\nidentity synchronization.\nApplication Proxy Agents\nPassword write-back agents\nPassword Protection Gateway machines\n\nNPS that have the Azure MFA RADIUS extension\n\n## Stay up to date\n\nThe Solarwinds attack is an ongoing investigation, and our teams continue to act as first\nresponders to these attacks. As new information becomes available, we will make updates\n[through our Microsoft Security Response Center (MSRC) blog at https://aka.ms/solorigate.](https://nam06.safelinks.protection.outlook.com/?url=https%3A%2F%2Fcomm.microsoft.com%2FPoliteMail245%2Fdefault.aspx%3Fpage%3DmOgDA41300uL7Q32_8nsGA%26ref_id%3DKI8WohcEM0KIdOtHZj3pQw&data=04%7C01%7Cadhall%40microsoft.com%7Ca48f35f285d94ccd698f08d8a3956502%7C72f988bf86f141af91ab2d7cd011db47%7C1%7C0%7C637439209352849256%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=Xebz37S3gWRu3E8WvV1FRMz6vDhcBRDY0uQCZi9ogEc%3D&reserved=0)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-18 - Protecting Microsoft 365 from on-premises attacks.pdf"
    ],
    "report_names": [
        "2020-12-18 - Protecting Microsoft 365 from on-premises attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536067,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653787552,
    "ts_modification_date": 1653787552,
    "files": {
        "pdf": "https://archive.orkl.eu/3b61e7ad7ff0a9731579ae19c37c6aaf9e944965.pdf",
        "text": "https://archive.orkl.eu/3b61e7ad7ff0a9731579ae19c37c6aaf9e944965.txt",
        "img": "https://archive.orkl.eu/3b61e7ad7ff0a9731579ae19c37c6aaf9e944965.jpg"
    }
}