{
    "id": "8797f9d2-7a5a-44b8-9d9c-5f7892f02804",
    "created_at": "2023-01-12T15:04:57.279236Z",
    "updated_at": "2025-03-27T02:13:34.617529Z",
    "deleted_at": null,
    "sha1_hash": "10f450603b4be39ce0b9b6667838378aa7dc024a",
    "title": "2021-03-02 - Malware in images",
    "authors": "",
    "file_creation_date": "2022-05-29T10:37:55Z",
    "file_modification_date": "2022-05-29T10:37:55Z",
    "file_size": 2609820,
    "plain_text": "# Malware in Images: When You Can’t See “the Whole Picture”\n\n**blog.reversinglabs.com/blog/malware-in-images**\n\n[Threat Research | March 2, 2021](https://blog.reversinglabs.com/blog/tag/threat-research)\n\nBlog Author\n\n\n-----\n\n[Karlo Zanki, Reverse Engineer at ReversingLabs. Read More...](https://blog.reversinglabs.com/blog/author/karlo-zanki)\n\n## Introduction\n\nMalicious actors often want to get information of interest from targeted computer\nenvironments. To achieve this goal, they usually decide to plant some kind of software that\nwill provide that information continuously. Throughout history, the most common way of doing\nthat was to plant an executable file and make it run. Over time, the defensive systems\nimproved and became more successful at detecting such executable implants. In this catand-mouse game, both sides try to improve their tools and, as defensive tools get better,\nmalware actors try to find new ways of smuggling malicious software into a system. There\nare several popular ways of doing this, suchs as embedding malicious code into various\ndocument formats or executing malicious code in memory without saving anything on disk.\nAs time passes, security solutions are becoming increasingly more aware of such threats.\n\nReversingLabs continuously improves its malware-detection capabilities. One of the more\nnovel methods that caught our eye is hiding malware inside image formats like PNG, BMP,\nGIF or JPEG. Recently, we enhanced our platform support for unpacking these image\n[formats, and listed some of those improvements in one of our previous blog posts.](https://blog.reversinglabs.com/blog/platform-technology-updates-better-malware-detection-for-multiple-image-formats-with-titaniumcore)\nIn this blog, we will demonstrate how these new enhancements can be used to discover\nnovel malware threats and showcase several examples of images with hidden PHP\nexecutable content. Most of them try to fetch additional resources from a remote server and\nuse different kinds of obfuscation to hide their malicious intents. As an example of threat\nhunting via this new functionality, a hidden web shell which led to discovery of a vulnerable\nweb site will also be shown.\n\n## Malware hiding in images\n\n\n-----\n\nImage formats are interesting to malware authors because they are generally considered far\nless harmful than executable files. Images can be used to deploy malware in combination\nwith a dropper, where the dropper acts as a benign executable which parses malicious\ncontent hidden inside of an image.\n\nOne area where this technique can be used are web uploads. Many websites enable\nuploading image content, but improperly filter out executables and scripts. In such cases,\nmalicious code can be packed into an image and uploaded to a web server containing a\npotential vulnerability which enables execution of its contents. Probably the most familiar\ntype of such payloads are PHP web shells.\n\nThreat actors discover and exploit vulnerabilities in applications used to parse image\nformats. To remain undetected and avoid attracting the attention of security tools, they\ntypically try to create files which adhere to the image format specification whenever possible.\n\nThe simplest way to embed malicious content into an image is to append it to the image end,\nor, as it’s commonly referred to, the overlay. Malicious actors typically just take a benign\nimage file and append some content. This makes it a well-known method that is quite easy to\ndetect.\n\nFor example, in the case of a GIF file, all bytes after the GIF’s trailer byte (0x3B) can be\nconsidered an overlay. In the case of a PNG file, everything after the end of the IEND chunk\ncan be considered an overlay. This is conceptually the same as appending content to any\nother regular file format, so we won’t go into more details about overlays in this blog post.\n\nAnother interesting place to look for malware when analyzing image samples are the EXIF\ntags. These tags are metadata fields used to store additional descriptive data about the\nimage, like the model of the camera used to take the picture, the date and time when the\npicture was taken, or even the geolocation of the place where the image was taken. This\ndata is part of the image format, but it isn’t required for the image's visual interpretation and\nsome tools used to view the images opt to not present all of these tags to the users, which\nmakes them a great hiding place.\n\n## Malware in PHP EXIF tags\n\nTitanium Platform uses a proprietary parser to extract these metadata fields and makes it\npossible to search for images based on their EXIF metadata content. Therefore, an\ninteresting starting point is searching for images containing PHP code in their EXIF tags.\nEven such a simple search query provides a few worthy results.\n\n\n-----\n\nUsing A1000’s advanced search to find sample with PHP code in exif tags\n\nThe first one in the list is a file with the b497e231d19934c5d96853985bdbc147589a9a77\nSHA1 hash. Analyzing its Artist and ImageDescription EXIF tags reveals PHP code getting\ncontent from a URL. Even though this isn’t necessarily malicious behaviour as it can have\nsome legitimate uses, it is also quite possible that such PHP code could be used to fetch\nmalicious content from a C2 server.\n\nEXIF data from b497e231d19934c5d96853985bdbc147589a9a77 sample\n\nThe second one in the list is a file with the 518178bdd959ca17eca15777d38499bc9f3d95ad\nSHA1 hash. It has quite a large code snippet in its Copyright tag. At the beginning of the\nsnippet are some manipulations of PHP comments. It seems that the code is trying to\nconceal the fact that it is a PHP script by commenting out the PHP opening tag. Regular\nPHP parsers would ignore the comment opening before the tag. However, some tools might\nhave a different implementation of the PHP parsing algorithm.\n\n\n-----\n\nEXIF data from 518178bdd959ca17eca15777d38499bc9f3d95ad sample\n\nA detailed look at the code reveals that it tries to open a socket to a specific IP address and\nport, then uses that socket to fetch a stream of data and execute it with the eval() function\nafterwards. Even though the IP address is from the private IP range, it is hard to imagine a\nlegitimate reason for embedding this kind of code into an EXIF tag of an image. Such a\nsample could be used for lateral movement by a malicious actor within the private network\nafter getting the initial foothold.\n\nThe third example is a file with the 1c308589a493469416df53acaa75a7fd4aed7e65 SHA1\nhash. The only EXIF metadata it has is a Copyright tag. It is obvious that this is a specifically\nchosen sequence of bytes. A bit of googling provides a quick answer: this PHP code was\nused in the past to check if a server is vulnerable to file inclusion attacks. Mainly on sites\n\n\n-----\n\nusing Content Management Systems like Joomla or Wordpress.\n\nEXIF data from 1c308589a493469416df53acaa75a7fd4aed7e65 sample\n\nWhile this PHP code on its own is detected by the majority of security tools, hiding it inside of\nan image drastically reduces the detection rate. It is understandable why detection rate was\nlow 10 years ago when this code was first spotted in the wild, but the problem is that the\ndetection rate of this type of code smuggling hasn’t significantly improved over the years.\n\n## How a packed web shell led to a vulnerable website\n\nPrevious samples were found using the Titanium Platform’s advanced search engine, but\n[another way of finding interesting files is by using the ReversingLabs YARA Retrohunt](https://www.reversinglabs.com/solutions/hunt-threats-continuously)\nfeature.\n\nrule image_eval_hunt\n\n{\nstrings:\n\n$png = {89 50 4E 47}\n\n$jpeg = {FF D8 FF}\n\n$gif = \"GIF\"\n\n$eval = \"eval(\"\n\ncondition:\n\n(($png at 0) or ($jpeg at 0) or ($gif at 0)) and $eval\n\n}\n\nYARA rule for hunting samples with eval call\n\nThe provided YARA rule is trying to match samples starting with some of the magic byte\nsequences characteristic for image formats and also have the string “eval (” within, meaning\nthey potentially have a call to an eval function somewhere in the image content which isn’t\nexpected in multimedia files. TitaniumCloud YARA Retrohunt provides quite a few samples,\nand after analyzing the results, two interesting ones emerge. Both of these samples have\nPHP code in a regular image segment.\n\nThe first one is a file with the e3a64475e1272f34fe8a9043b486d60595460aa2 SHA1 hash.\n\n\n-----\n\nReversingLabs A1000 - Sample summary\n\nIt is visible from the summary that this is a JPEG image. The summary also shows that\nTitanium Platform detected and extracted an additional file from it. Quick examination of the\nextracted files shows that it is recognized as a Text/PHP file, and by using the A1000’s\n_Preview Sample feature its content is shown. This simple PHP script first decodes a base64_\nencoded string and then calls the eval function on the decoded content.\n\nContent preview of the segment extracted from the image sample\n\n[The base64 encoded string can be decoded with a handy tool called CyberChef. This](https://gchq.github.io/CyberChef)\noperation leads to more obfuscated PHP code which can be seen in the following image.\n\n\n-----\n\nResult of the first layer base64 string decoding\n\nCode above performs self-deobfuscation and results in yet another layer of obfuscated code.\nThis obfuscation method includes inserting ‘I’ character at random places in some of the\nstring literals, and inserting of ‘an’ character sequence to hide create_function string.\n\nThe simplest way to deobfuscate such PHP code is to copy/paste it to a PHP sandbox and\nreplace the last line of code with an echo on the $H variable. This will print out the\ndeobfuscated code.\n\nResult of deobfuscating the second layer code\n\n\n-----\n\nThis is the last layer. It takes raw data after the HTTP-headers of the HTTP-request and tries\nto find content delimited by values specified by the $kh and $kf variables. When the regular\nexpression gets matched, it takes the content between the delimiters, decodes it via base64,\nand passes it as an argument to function x that performs simple XOR decryption on it. The\noutput of all these operations is a compressed stream which is decompressed and then\nexecuted by the eval function.\n\nBeside the information on the functionality of the code embedded within the image, Titanium\nPlatform also provides a way to find the origin of a sample. Looking at the sources from\nwhich this sample was acquired, an interesting URL reveals itself.\n\nReversingLabs A1000 - Source of the sample\n\nThis sample can be found in the wild on a live web location behinburg.com. This address\nhosts a legitimate-looking Iranian travel agency’s web-site. The URL path contains an\ninteresting directory structure with “uploads” that have an unrestricted access to content\nuploaded by the users. The website also doesn’t try to restrict unauthorized users from\nexploring the directory structure. The contents of the directory where this image was located\nincluded 35 other files uploaded between the 11th and 12th of December 2020. They all\ncontained some kind of a web shell and were obviously used in an attempt to compromise\nthis server.\n\n\n-----\n\nDirectory listing\n\nUsing our telemetry, we weren’t able to conclude if the attacker attempt was successful.\nHowever, in this case the attacker didn’t need to get any additional privileges to get sensitive\ndata. In the same upload directory, besides the files uploaded by the attacker, a lot of images\ncontaining passport scans could be found. This travel agency enables its users to apply for\nIranian visas using their web page. In order to apply, the users need to upload a passport\nscan through the webform.\n\n\n-----\n\nPart of the visa application form\n\nThe uploaded images appear to be kept on the server for an indefinite time. It is a very poor\nsecurity practice to keep unprotected and unencrypted files in a publicly accessible web\ndirectory. Users are recommended to consider other options before uploading scans of their\npersonal documents to any web page. There are many similar web sites that fail to follow the\nbest security practices when it comes to handling personal information.\n\n## When small PHP code brings in his big friend\n\nThe last sample we will look into is a JPEG image with an embedded PHP script in one of its\nregular segments. This keeps it in line with the JPEG format specification. Titanium Platform\ncan easily detect and extract such embedded malicious content.\n\n\n-----\n\nSample summary\n\nLooking at the preview of the extracted image segment shows that this is yet another\nobfuscated PHP script. This time the obfuscation method is creating a URL string by calling\nthe chr function on integer values representing ASCII codes. The output characters are then\nconcatenated to form the resulting URL.\n\nReversingLabs A1000 - Preview of the segment content\n\nThe PHP comments between the $password and $c variable assignment are encoded in ISO\n_2022 Simplified Chinese, giving us a clue about the possible origins of this malicious script._\n\nThe entire PHP code, with deobfuscated constants in comments, can be seen in the\nfollowing image.\n\n\n-----\n\nScript contents\n\nThe deobfuscated URL “http://i.niupic.com/images/2017/05/21/v1QR1M.gif” was accessible\nat the time of writing. It hosted a file with the\n370788d26150bba413082979e26da4cd6828a752 SHA1 hash.\n\nThis is a compressed Gzip stream containing a PHP webshell. It is 145KB in size with almost\n3,000 lines of PHP code, comprising functionalities that include privilege escalation,\noperation on the SQL database, file download, port scanning and a few others.\n\nMost of the string literals in the messages displayed by the webshell are encoded in the\nalready mentioned Chinese character set.\n\nGoogling for intelligence on the specific strings shows that some Chinese sources call this\n[type of webshell PHP Malaysia backdoor, with one similar sample found in this github](https://github.com/ysrc/webshell-sample/blob/master/php/0a8e7002d9c256117a1dad9b1460e3c9ecb9a698.php)\nrepository.\n\n## Conclusion\n\nImage formats can be as dangerous as executables, and Titanium Platform is a reliable\npartner that can quickly detect such embedded threats. Even though in most cases images\nare used as a non-executable container for the malware, there are instances where images\ncan trigger execution if placed in an unexpected, misconfigured place. For example, the\ndescribed PHP web shells placed on a vulnerable server.\n\nThis is why every piece of content entering a business network must be analyzed and\nchecked for malicious content, regardless of the file format. Malware authors and threat\nactors will always look for blind spots where they can bypass defenses. Having detection\ngaps can lead to severe business operation interruption and cause brand damage.\n\nReversingLabs makes continuous improvements to its products in order to keep on track\nwith never-sleeping malware authors. While some security solutions might help you detect if\na non-executable file contains something that might be considered malicious, Titanium\nPlatform provides you with additional information which helps you to understand how, where\nand why content is characterized as malicious. Its inspection capabilities give you the ability\nto [analyze and collect metadata from over 400 file formats. To detect malware before it](https://blog.reversinglabs.com/resources/explainable-threat-intelligence)\nbecomes a problem.\n\n## IOC list\n\nThe following list contains SHA1 hashes of the samples mentioned in this blog post.\n\n\n-----\n\nb497e231d19934c5d96853985bdbc147589a9a77\n518178bdd959ca17eca15777d38499bc9f3d95ad\n1c308589a493469416df53acaa75a7fd4aed7e65\ne3a64475e1272f34fe8a9043b486d60595460aa2\n9b7284f89af7174a1d3ba91330f67c08a0054c60\n370788d26150bba413082979e26da4cd6828a752\n\n## Read Other Research Blogs by Karlo:\n\n MORE BLOG ARTICLES\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-02 - Malware in images.pdf"
    ],
    "report_names": [
        "2021-03-02 - Malware in images.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "92049df8-7902-48e8-ad17-97398b923698",
            "created_at": "2022-10-25T16:07:23.81315Z",
            "updated_at": "2025-03-27T02:02:09.990217Z",
            "deleted_at": null,
            "main_name": "LuminousMoth",
            "aliases": [],
            "source_name": "ETDA:LuminousMoth",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535897,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653820675,
    "ts_modification_date": 1653820675,
    "files": {
        "pdf": "https://archive.orkl.eu/10f450603b4be39ce0b9b6667838378aa7dc024a.pdf",
        "text": "https://archive.orkl.eu/10f450603b4be39ce0b9b6667838378aa7dc024a.txt",
        "img": "https://archive.orkl.eu/10f450603b4be39ce0b9b6667838378aa7dc024a.jpg"
    }
}