{
    "id": "87d3c463-67d5-4ed8-902e-8ae644064679",
    "created_at": "2023-01-12T15:02:46.093587Z",
    "updated_at": "2025-03-27T02:16:34.805495Z",
    "deleted_at": null,
    "sha1_hash": "924cdb518da8b742f6b5f11760cee3e1ef9bd1ca",
    "title": "2021-08-18 - Cobalt Strike- Detect this Persistent Threat",
    "authors": "",
    "file_creation_date": "2022-05-28T18:24:18Z",
    "file_modification_date": "2022-05-28T18:24:18Z",
    "file_size": 9401164,
    "plain_text": "# How to Detect Cobalt Strike\n\n**[intezer.com/blog/malware-analysis/cobalt-strike-detect-this-persistent-threat/](https://www.intezer.com/blog/malware-analysis/cobalt-strike-detect-this-persistent-threat/)**\n\nWritten by Ryan Robinson - 18 August 2021\n\n### Get Free Account\n\nJoin Now\n\n### Top Blogs\n\n**[Top Cyber Threats to the Telecom Industry](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)**\n\n\nAugust 18, 2021\n\n\nIn our interconnected society, the telecom industry is responsible for keeping the world\nconnected 24/7.... [Read more](https://www.intezer.com/blog/incident-response/cyber-threats-telecom-industry/)\n\n**[Automate Alert Triage and Response Tasks with Intezer EDR Connect](https://www.intezer.com/blog/incident-response/alert-triage-edr-integrations/)**\n\nIntegrate with SentinelOne, CrowdStrike, and More One of the biggest pain points of cyber\nsecurity... [Read more](https://www.intezer.com/blog/incident-response/alert-triage-edr-integrations/)\n\n\n-----\n\n**[Elephant Framework Delivered in Phishing Attacks Against Ukrainian Organizations](https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs/)**\n\nA recently developed malware framework called Elephant is being delivered in targeted\nspear phishing campaigns... [Read more](https://www.intezer.com/blog/research/elephant-malware-targeting-ukrainian-orgs/)\n\nCobalt Strike is a penetration testing tool created by Raphael Mudge in 2012. To this day, it\nremains extremely popular both in red team activities and for malicious purposes by threat\nactors. Cobalt Strike is popular due to its range of deployment options, ease of use, ability\nto avoid detection by security products, and the number of capabilities it has.\n\nIt is for these reasons that threat actors also like Cobalt Strike. Since Cobalt Strike is widely\nused by a range of actors, this lack of exclusivity makes attribution harder. Companies still\nstruggle to detect Cobalt Strike also due to the various defensive techniques it has.\n\nThis blog explains Cobalt Strike and practical steps to take if you believe that you are being\ntargeted by Cobalt Strike or already compromised. We will demonstrate some real world\nexamples of Cobalt Strike delivery and steps to detect each.\n\n## What is Cobalt Strike?\n\nCobalt Strike is [marketed as “Software for Adversary Simulations and Red Team](https://www.cobaltstrike.com/)\nOperations.”\n\n[It is a popular platform that allows users to emulate advanced threats, perform](https://www.cobaltstrike.com/features)\nreconnaissance, hide communications, escalate privileges, move laterally across the\nnetwork, and deploy additional payloads. The main payload of Cobalt Strike is called\n[“Beacon.” The Beacon payload is used to model advanced APT malware, and can do the](https://www.cobaltstrike.com/help-beacon)\nfollowing:\n\nReceive commands (either passively or from an interactive console)\nEgress communications over HTTP, HTTPS, and DNS\nLaunch PowerShell\nExecute binaries\nModify and query the Windows registry\nInject malicious code into legitimate processes\nLog keystrokes\nTake screenshots\nSet up proxies\nEscalate privileges\nBypass UAC\nDump password hashes\nScan ports among other abilities\n\n\n-----\n\nThis tool is mainly used in red team operations for government agencies and private\nenterprises, but it’s also a popular tool leveraged by cybercrime and APT groups in cracked\nversions. It is evident why Cobalt Strike is used by organizations and threat actors alike\nbecause of the extensive suite of capabilities it possesses, and also due to its ability to\n[bypass defenses. It also comes with the feature to generate reporting in which the attacking](https://www.cobaltstrike.com/help-reporting)\nteam or threat actor can continuously study and improve their campaigns.\n\n## Why is it difficult to detect Cobalt Strike?\n\nCobalt Strike is difficult to detect because of its several defense techniques. Cobalt Strike\npayloads are usually shellcode encrypted with a rolling XOR key. This makes static analysis\ndifficult to conduct. This, combined with the ability to configure many parts of the payload,\nmakes hash-based detection almost impossible. Cobalt Strike stagers are designed to be\nloaded and executed only in-memory. This opens up a ton of possibilities for how this\nshellcode is shipped, making signature-based detection on the delivery method a cat and\n_mouse game. Depending on how the code is delivered, the code can be injected into other_\nlegitimate running processes, bypassing defenses that do not scan legitimate processes or\ncode in-memory.\n\n## How has Cobalt Strike been deployed?\n\nCobalt Strike has many different ways for deployment. This flexibility has helped attackers\nfind many unconventional and creative ways to infect victims with a payload. For an indepth technical analysis of Cobalt Strike’s deployment options and how they differ, check\nout Avast’s [blog or this Cisco Talos](https://decoded.avast.io/threatintel/decoding-cobalt-strike-understanding-payloads/) [white paper. Let’s take a look at some real world](https://talos-intelligence-site.s3.amazonaws.com/production/document_files/files/000/095/031/original/Talos_Cobalt_Strike.pdf)\nexamples of how Cobalt Strike is being used in the wild. We will cover the following:\n\nMacro-Laden Microsoft Office files\nSupply Chain Attack\nLiving off the Land (LotL)\nExecutables (EXE) files\n\n## Macro-Laden Microsoft Office Files Detection\n\nAn example of a Cobalt Strike payload being delivered to victims via Microsoft Excel\nspreadsheets demonstrates that this tool is also used in mass phishing campaigns, not just\ntargeted APT attacks. The attack starts by sending potential victims a Microsoft OneDrive\nlink from which an Excel (.xls) file is downloaded.\n\n\n-----\n\n_OneDrive URLs sent to victims_\n\nUsing cloud storage links to deliver malicious files is a well-known strategy. It leverages the\ngood reputation of cloud provider domains such as Microsoft, Amazon, and Google to\nbypass domain reputation-based security controls. This link delivers an Excel file pretending\nto be an Apple Store invoice requesting the target “enable content to view receipt.”\n\n\n-----\n\n_Spreadsheet lure masquerading as an Apple Store receipt_\n\nUpon enablement of macros, the spreadsheet will fetch and execute the payload inmemory.\n\nThis can be difficult to detect, as there are multiple degrees of separation before the Cobalt\nStrike payload is executed. Detection first requires dynamic analysis in order to reach the\nCobalt Strike stage. When this stage is reached, the best ways to detect the running Cobalt\n\n\n-----\n\nStrike code are through static signatures or genetic code analysis.\n\nWhen it comes to static signatures, it can be difficult to isolate the exact area in-memory\nthat you should run the signatures over. One way this can be achieved is running the file\nthrough debugging tools and manually dumping memory to perform signature analysis. This\ncan be extremely time consuming and requires a high degree of technical knowledge.\nAnother possible way is to use a sandbox and download memory dumps from a finished\nanalysis in order to run static analysis tools. This requires slightly less technical knowledge\nbut it still can be time consuming. We suggest taking the suspicious document and\n[uploading it to Intezer Analyze to find out if Cobalt Strike is hidden in-memory.](https://analyze.intezer.com/)\n\n_Intezer Analyze result for Cobalt Strike payload_\n\n## How to Detect Supply Chain Attacks\n\nOne of the biggest cybersecurity stories of 2020 was the SolarWinds supply chain attack\nthat compromised high-profile entities around the world. This attack was done by an APT\ngroup known as NOBELIUM (UNC2452) leveraging the “Orion” business software to\ndistribute malware to private and public organizations. Among the deployed malware was a\nCobalt Strike loader dubbed TEARDROP by FireEye. The variant was named Raindrop by\nSymantec. The TEARDROP dropper is a memory-only DLL that runs as a service spawning\na thread that pulls the Cobalt Strike payload from a fake JPG file.\n\nThe [Raindrop variant is built from a modified version of 7-ZIP source code. It uses a](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware)\ndifferent custom packer than TEARDROP, also leveraging steganography to locate the start\nof the encoded payload. Once the encoded payload has been located, it extracts, decrypts,\n\n\n-----\n\nand decompresses the data to be executed as shellcode.\n\nIt can often be difficult to detect if your organization has been the victim of a supply chain\nattack. It can be especially hard to collect forensic evidence for an attack when it could be\nmixed in with the code of legitimate and large files. Due to the nature of supply chain\nattacks, there are often a large number of machines in an organization infected at one time.\nAn action you can take is to run Intezer’s [live endpoint scanner across all machines in the](https://analyze.intezer.com/endpoint-analyses)\norganization. This will give you immediate visibility over all running code and quickly identify\ninfected machines by detecting any traces of malicious code found in-memory. An example\nof a machine with Raindrop loading Cobalt Strike is shown in the endpoint scan below.\n\n_Intezer Analyze endpoint scan result for Raindrop loading and executing a fileless Cobalt_\n_Strike payload_\n\n## Living off the Land (LotL) Detection\n\nLiving off the Land (LotL) is the attack process of using legitimate and signed tools, usually\nprovided within the operating system, to execute malware. This is a powerful tactic as it can\nresult in unauthorized code being executed within the memory space of a trusted process,\nevading malware defenses by flying under the radar. This type of tactic also makes incident\nresponse difficult, since analysts can’t just filter out known legitimate processes during\ntriage. All processes must be inspected in order to find that one needle in the haystack.\n\n\n-----\n\nOne popular tool used for LotL operations is the Microsoft.NET framework utility called\n[MSBuild. MSBuild is the build platform used for Microsoft and Visual Studio. Visual Studio](https://docs.microsoft.com/en-us/visualstudio/msbuild/walkthrough-using-msbuild?view=vs-2019)\nrelies on MSBuild to build projects for testing and releases. Attackers are able to pass\nMSBuild.exe, a project (.proj) file, to build and execute. The payload, usually shellcode, is\ninjected into another process. This attack is effective for attackers as many sandboxing\nsolutions are not able to handle project files and struggle with fileless malware. This\n[technique was observed by Cisco Talos researchers in 2020 to deploy Cobalt Strike.](https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html)\n\n_Project file code_\n\nAs shown above, the project file has an encoded and compressed payload. This payload is\ndecrypted, decompressed, and then copied into memory. The shellcode is then executed in\na new thread.\n\n## How to Detect?\n\nAn endpoint with a system injected with Cobalt Strike via MSBuild is shown below. Note the\nprocess tree at the bottom indicating the “fileless code.”\n\n\n-----\n\n_Intezer Analyze endpoint scan of a Cobalt Strike-infected system via LotL technique_\n\n## How to Detect Executables (EXE) Files\n\nThere is an acronym in the United States Armed Forces called “KISS.” KISS stands for\n“Keep it simple, stupid!” Sometimes simple is better, and another way for Cobalt Strike to be\ndeployed is in a simple Windows EXE form. This requires either social engineering tactics\nto get the target to execute the malware or another program/script to execute the file. This\nprocess involves creation of a thread that sets up a named pipe for privilege escalation.\nOnce the shellcode is written to the named pipe, it is decrypted and executed in a separate\nthread.\n\n[An example of one of these payloads is shown in the analysis below. Notice how the Cobalt](https://analyze.intezer.com/files/e233fc08c1a41ed8cc7d32c8e851614aeb159f95470f4491262c818137591afc)\nStrike code is only shown when it is executed and found in-memory.\n\n\n-----\n\n_Cobalt Strike found via memory analysis_\n\n## How can Cobalt Strike be detected and remediated?\n\nDue to the many ways Cobalt Strike is deployed, detection can be hard. The use of\nshellcode, encoding, compression, obfuscated strings, process injection, hashing\nalgorithms, domain fronting, different communication channels, and dynamically loaded\nlibraries all give malware and network defenses a run for their money.\n\n### Static Analysis\n\nStatic analysis involves examining the file using various techniques without actually having\nto execute the file itself. Static analysis can involve hashing the file and finding intel on it,\ntaking a look at the strings to see if there are functionality or network indicators, or checking\nimports and running signatures such as YARA for the file. Although useful, static analysis\non its own is probably not sufficient to detect Cobalt Strike.\n\nUsing hash-based identification of Cobalt Strike is insufficient, since each payload will be\nencrypted with different keys and each configuration will uniquely change the hash value. It\nis trivial to generate a new payload for each new target.\n\nChecking strings may be insufficient also. Strings for pipe names are dynamically generated\nand incorporate random numbers, meaning they can change every time the malware is\nexecuted. Encrypted payloads will also obfuscate useful strings from static analysis.\n\n[API Hashing algorithms employed by Cobalt Strike hide imports from static analysis](https://www.ired.team/offensive-security/defense-evasion/windows-api-hashing-in-malware)\ntechniques. Signature-based detection is great for detecting malware, but due to the\nversatility of Cobalt Strike’s deployment using multiple stages and encrypted/obfuscated\npayloads, an analyst may only be able to detect that a file is going to load and execute a\npayload in-memory. Without dynamic analysis, they won’t be able to detect exactly what\nthat payload will be.\n\n### Dynamic Analysis\n\nDynamic analysis is the process of executing the suspect file in order to analyze its\nbehavior and how it affects the environment it runs in. Dynamic analysis can open up new\nareas to explore as one can follow the malware through each stage of its deployment and\nfunctionality. Dynamic analysis can get the malware to unpack, decode, or download\nadditional stages. These new stages are then subject to further dynamic analysis as well as\nthe previously mentioned static analysis techniques.\n\nDynamic analysis does not have many limitations, although some malware includes\nfunctionality to detect if it is being observed or running inside a sandboxed environment.\nThere is also the possibility that during dynamic analysis, areas of malicious code may not\n\n\n-----\n\nbe intentionally executed, and thus not detected in the behavior. The best way to detect\nmalicious code is via genetic code analysis which is done automatically for you in Intezer\nAnalyze.\n\n## Combination of Several Techniques\n\nThe best way to detect Cobalt Strike code is through a combination of dynamic, static, and\ngenetic analysis. Let’s take a suspicious looking document from an unknown entity as an\nexample. Before opening the document, we submit it to Intezer Analyze and get the verdict,\nas shown below.\n\n_Intezer Analyze result showing in-memory Cobalt Strike code_\n\nThe document drops and executes Cobalt Strike in the memory space of “rundll32.exe.”\nSignatures are leveraged to show capabilities and file characteristics. Under the “TTPs” tab\nthe user can see the techniques/capabilities employed by the malicious document.\n\n\n-----\n\n_TTPs section showing capabilities detected during execution_\n\nThe document displays interesting techniques such as macros with auto-execution, network\nactivity with a unique user agent, office process starting martian subprocess, and process\ninjection. You can also dive deeper into capabilities specific to the injected Cobalt Strike\nprocess.\n\n\n-----\n\nThe IoCs tab in Intezer Analyze shows indicators that can help you pivot and search in\nyour environment during investigations to map out the scope of an attack. IoCs provide you\nwith file hashes and network indicators such as URLs, and IP addresses being contacted\nthrough irregular ports.\n\n_IoCs tab showing file and network indicators_\n\nThe “Behavior” tab shows a more in-depth analysis of the file’s behavior, where you can see\nthe process tree, network activity, screenshots and file/registry activity.\n\n_Behavior tab showing observed behavior during sandbox execution_\n\n## The Only Abused Pen Testing Tool?\n\n\n-----\n\nCobalt Strike is [not the only penetration testing or legitimate tool that has been co-opted](https://www.intezer.com/blog/research/advanced-pasta-threat-mapping-malware-use-of-open-source-offensive-security-tools/)\nand abused by threat actors. In the past, tools such as [Pafish (Paranoid Fish) have been](https://github.com/a0rtega/pafish)\n[used by Iranian actors in their tooling for virtual machine (VM) detection. The “Sysinternals”](https://cdn2.hubspot.net/hubfs/1903456/Whitepapers/CopyKittens.pdf)\nsuite has been used extensively by threat actors. Most notably, [PsExec has been used in](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\n[high-profile attacks such as the 2017 NotPetya global ransomware outbreak.](https://www.theregister.com/2017/06/28/petya_notpetya_ransomware/)\n\nMore recently, legitimate and penetration testing tools for the cloud have been used by\n[threat actors. The threat actor TeamTNT has used Weave Scope, a trusted tool which gives](https://www.intezer.com/blog/cloud-security/attackers-abusing-legitimate-cloud-monitoring-tools-to-conduct-cyber-attacks/)\nthe user full access to their cloud environment, and is integrated with Docker, Kubernetes,\nthe Distributed Cloud Operating System (DC/OS), and AWS Elastic Compute Cloud (EC2).\nThe attacker installs this tool in order to map the cloud environment of their victim and\nexecute system commands without needing to deploy malicious code on the server. The\n[same group has also been documented using the penetration testing tool Break Out The](https://www.cadosecurity.com/post/botnet-deploys-cloud-and-container-attack-techniques)\nBox (BOTB) for cloud and containerized environments.\n\n## Get Started for Free\n\nWith Intezer Analyze, you can analyze any suspicious files that you encounter, including\nnon-executable files such as Microsoft Office documents, scripts, archives, and more. Stay\n[on top of analyzing and classifying Cobalt Strike and other threats. Get started for free and](https://analyze.intezer.com/create-account)\nstart with 50 file uploads per month.\n\n**Ryan Robinson**\nRyan is a security researcher analyzing malware and scripts. Formerly, he was a researcher\non Anomali's Threat Research Team.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-18 - Cobalt Strike- Detect this Persistent Threat.pdf"
    ],
    "report_names": [
        "2021-08-18 - Cobalt Strike- Detect this Persistent Threat.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "467c5e72-55a6-40a9-9b73-bb764889c0a5",
            "created_at": "2022-10-25T16:07:23.486532Z",
            "updated_at": "2025-03-27T02:02:09.829604Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "CopyKittens",
                "Operation Wilted Tulip",
                "Slayer Kitten"
            ],
            "source_name": "ETDA:CopyKittens",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "EmPyre",
                "EmpireProject",
                "Matryoshka",
                "Matryoshka RAT",
                "PowerShell Empire",
                "TDTESS",
                "Vminst",
                "ZPP",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9fb19abe-4035-4f22-a595-641b7f3443a9",
            "created_at": "2022-10-25T15:50:23.748944Z",
            "updated_at": "2025-03-27T02:00:55.537809Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "CopyKittens"
            ],
            "source_name": "MITRE:CopyKittens",
            "tools": [
                "Cobalt Strike",
                "TDTESS",
                "Matryoshka"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4557ed9-2455-44c5-a768-dfb80ccae259",
            "created_at": "2023-01-06T13:46:38.652329Z",
            "updated_at": "2025-03-27T02:00:02.883544Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "Slayer Kitten",
                "G0052"
            ],
            "source_name": "MISPGALAXY:CopyKittens",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535766,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653762258,
    "ts_modification_date": 1653762258,
    "files": {
        "pdf": "https://archive.orkl.eu/924cdb518da8b742f6b5f11760cee3e1ef9bd1ca.pdf",
        "text": "https://archive.orkl.eu/924cdb518da8b742f6b5f11760cee3e1ef9bd1ca.txt",
        "img": "https://archive.orkl.eu/924cdb518da8b742f6b5f11760cee3e1ef9bd1ca.jpg"
    }
}