{
    "id": "87e8b97a-97dc-4a3c-80ce-c990e789bf9d",
    "created_at": "2022-10-25T16:48:22.728941Z",
    "updated_at": "2025-03-27T02:08:41.026014Z",
    "deleted_at": null,
    "sha1_hash": "9b22d8de05493cd184246d30a4691005e9a30b94",
    "title": "Defense official discloses cyberattack",
    "authors": "Washington Post",
    "file_creation_date": "2017-05-17T19:45:20Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 23858,
    "plain_text": "# y\n\n**[washingtonpost.com /wp-dyn/content/article/2010/08/24/AR2010082406495.html](http://www.washingtonpost.com/wp-dyn/content/article/2010/08/24/AR2010082406495.html?tid=a_inl)**\n\nNow it is official: The most significant breach of U.S. military computers was caused by a flash drive inserted into a\nU.S. military laptop on a post in the Middle East in 2008.\n\nIn an article to be published Wednesday discussing the Pentagon's cyberstrategy, Deputy Defense Secretary\nWilliam J. Lynn III says malicious code placed on the drive by a foreign intelligence agency uploaded itself onto a\nnetwork run by the U.S. military's Central Command.\n\n\"That code spread undetected on both classified and unclassified systems, establishing what amounted to a digital\nbeachhead, from which data could be transferred to servers under foreign control,\" he says in the Foreign Affairs\narticle.\n\n\"It was a network administrator's worst fear: a rogue program operating silently, poised to deliver operational plans\ninto the hands of an unknown adversary.\"\n\nLynn's decision to declassify an incident that Defense officials had kept secret reflects the Pentagon's desire to raise\ncongressional and public concern over the threats facing U.S. computer systems, experts said.\n\nMuch of what Lynn writes in Foreign Affairs has been said before: that the Pentagon's 15,000 networks and 7 million\ncomputing devices are being probed thousands of times daily; that cyberwar is asymmetric; and that traditional Cold\nWar deterrence models of assured retaliation do not apply to cyberspace, where it is difficult to identify the instigator\nof an attack.\n\nBut he also presents new details about the Defense Department's cyberstrategy, including the development of ways\nto find intruders inside the network. That is part of what is called \"active defense.\"\n\nHe puts the Homeland Security Department on notice that although it has the \"lead\" in protecting the dot.gov and\ndot.com domains, the Pentagon - which includes the ultra-secret National Security Agency - should support efforts to\nprotect critical industry networks.\n\nLynn's declassification of the 2008 incident has prompted concern among cyberexperts that he gave adversaries\nuseful information. The Foreign Affairs article, Pentagon officials said, is the first on-the-record disclosure that a\nforeign intelligence agency had penetrated the U.S. military's classified systems. In 2008, the Los Angeles Times\n[reported, citing anonymous Defense officials, that the incursion might have originated in Russia.](http://www.washingtonpost.com/wp-srv/world/countries/russia.html?nav=el)\n\nThe Pentagon operation to counter the attack, known as Operation Buckshot Yankee, marked a turning point in U.S.\ncyberdefense strategy, Lynn said. In November 2008, the Defense Department banned the use of flash drives, a ban\nit has since modified.\n\nInfiltrating the military's command and control system is significant, said one former intelligence official who spoke on\nthe condition of anonymity because of the sensitivity of the matter. \"This is how we order people to go to war. If\nyou're on the inside, you can change orders. You can say, 'turn left' instead of 'turn right.' You can say 'go up' instead\nof 'go down.' \"\n\nIn a nutshell, he said, the \"Pentagon has begun to recognize its vulnerability and is making a case for how you've\ngot to deal with it.\"\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/071o7zzbyj0z4ixl69iupwow0bo82jqj"
    ],
    "report_names": [
        "WashingtonPost_2010-Defense-official-discloses-cyberattack(08-24-2010)"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1495050320,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/9b22d8de05493cd184246d30a4691005e9a30b94.pdf",
        "text": "https://archive.orkl.eu/9b22d8de05493cd184246d30a4691005e9a30b94.txt",
        "img": "https://archive.orkl.eu/9b22d8de05493cd184246d30a4691005e9a30b94.jpg"
    }
}