{
    "id": "881ef0cf-5e33-418f-96ce-f36b5e5525dd",
    "created_at": "2023-01-12T15:05:01.570615Z",
    "updated_at": "2025-03-27T02:16:25.791824Z",
    "deleted_at": null,
    "sha1_hash": "32418263bddcd0456f5a2bbdccf9d763d564111a",
    "title": "2021-04-12 - A chat with DarkSide",
    "authors": "",
    "file_creation_date": "2022-05-27T23:20:45Z",
    "file_modification_date": "2022-05-27T23:20:45Z",
    "file_size": 283286,
    "plain_text": "# A chat with DarkSide\n\n**databreaches.net/a-chat-with-darkside/**\n\n_If you would meet us on the street – you would never realize that we are cyberpests,_\n_because we are the same normal people like everyone else. Many have families and_\n_children, the only thing that these circumstances in which we found themselves in our_\n_country are. We have no hatred and desire to cause damage, we perceive our_\n_business as any other, the ultimate goal of which is profit._\n\n_— DarkSide_\n\nOne of Darkside’s earlier notices.\nIn a recent article on BankInfoSecurity, Mathew J. Schwartz reports that ransomware threat\n[actors have been on somewhat of a “charm offensive” since last year, giving interviews to](https://www.bankinfosecurity.com/charm-offensive-ransomware-gangs-tell-all-in-interviews-a-16241)\nmedia. Because this blogger has absolutely no hacking knowledge or skills, I would never\ntry to do an actual technical interview with any threat actor. In fact, given my professional\nbackground, I have always been more interested in why and how threat actors make the\ndecisions they make — and how some seem to have absolutely no scruples or ethics about\n\n\n-----\n\nattacking some victims while others appear to develop some sort of ethics code. With those\ninterests in mind, DataBreaches.net recently interviewed DarkSide operators about their\napproach to their ransomware operations and changes since they first emerged as DarkSide.\n\nIn August, 2020, when the ransomware group known as DarkSide introduced themselves via\na press release on their web site, they made a point of immediately claiming that although\ntheir product might be new, they were not new kids on the block:\n\nWe are a new product on the market, but that does not mean that we have no\nexperience and we came from nowhere. We received millions of dollars profit by\npartnering with other well-known cryptolockers. We created DarkSide because we\ndidn’t find the perfect product for us. Now we have it.\n\nTheir announcement also stated what kinds of entities they did not attack, and that they only\nattacked companies that could pay the demanded amount — an amount they claim they\ndetermine by researching the companies they attack.\n\nTheir launch announcement was met with skepticism by some and outright scorn or ridicule\nby others, and Brian Barrett’s description of DarkSide as having a “veneer of\nprofessionalism” was somewhat understandable. But in some respects, DarkSide has proved\nBarrett wrong. They actually are more professional in their conduct than some other\nransomware groups, even though their conduct is certainly illegal and cruel to victims. And\nthey have not only kept their word about who they will not attack, but they actually expanded\nthe exclusions.\n\nSo seven months after they announced their launch and then put their heads down and got\nto work, what, if anything, has changed for them?\n\n**“Big-Game Hunters”**\n\nLike other groups such as REvil, Ryuk, and DoppelPaymer, DarkSide is considered a “biggame hunter,” targeting larger corporations that can afford to pay higher ransoms. DarkSide’s\ndedicated leak site currently lists Guess, the well-known American clothing and fashion\naccessories retailer. Guess’s revenue last year was estimated at $2.68 billion. DarkSide\nclaims to have exfiltrated more than 200 GB of data, and posted a number of samples as\nproof. DataBreaches.net does not know how much ransom DarkSide has demanded for the\ndecryption key, but they publicly advise Guess:\n\nWe recommend using your insurance, which just covers this case. It will bring you four\ntimes more than you spend on acquiring such a valuable experience.\n\nThat statement is consistent with DarkSide’s first press release in which they stated that they\nwere not out to kill companies. It is also consistent with DarkSide’s explanation to\nDataBreaches.net in the interview recently conducted by email. [Because of language\n\n\n-----\n\nissues, DarkSide would translate my e-mailed questions into Russian, answer me in\nRussian, and then translate the answers back into English. With only one exception, that\nseemed to work fairly decently]. One of the exchanges was:\n\n_DataBreaches.net (DBN):_ _Do you ever demand more than what their cyberinsurance policy_\n_might cover?_\n\n**DarkSupp: Always before putting the amount of ransom, we study the internal**\n**reporting of the company and definitely understand how much they can really pay, all**\n**our partners work in the same way and we always remind about it. Basically, we do**\n**not require more than the amount of cyber insurance, but we can not always check**\n**the actions of our partners.**\n\n_DBN:_ _Someone suggested that if companies didn’t have cyberinsurance, ransomware threat_\n_actors would lose interest and just go away. Do you think that’s true?_\n\n**DarkSupp: (no response or comment)**\n\nFrom the files on their site, it would appear that Guess was attacked in February. Unlike\nsome groups that reach out to media quickly to get coverage, DarkSide had not reached out\nabout Guess or other victims. When asked about how long they wait and what steps they\ntake, they answered:\n\n**DarkSupp: We act in stages and notify the press usually already when exactly**\n**sure that the company will not pay. As for [Guess and another company DBN**\n**had named] – I think the press will see them.**\n\n_DBN: Do you notify the press to punish the companies for not paying or to try to_\n_pressure them more — or for both reasons?_\n\n**DarkSupp: For both reasons.**\n\n_DBN: Do you actually call targets on the phone like some others do? Do you ever_\n_contact targets’ customers directly like CLOP seems to be doing about the Accellion_\n_breach?_\n\n**DarkSupp: Yes, a few weeks ago, we launched a balanced service of the calls to**\n**our victims, while we call only our customers, but soon we also want to put**\n**pressure on their partners. A few days ago, we launched DDOS of our targets**\n**(Layer 5 Layer 7), which significantly increased pressure and has already**\n**brought the first results.**\n\n**Exclusions**\n\n\n-----\n\nLike some other RaaS groups, DarkSide uses a popular Russian-language forum to\nadvertise or recruit partners and to promote its service and updates to its product. A recent\nannouncement in early March described a number of updates to the features and rates for\npartners, as well as seeking affiliates. The announcement also repeated the rules about\nwhat was not permissible to attack:\n\n1. The following areas are prohibited:\n\n– Medicine (only: hospitals, hospitals, any palliative care organization, nursing\nhomes, companies that develop and participate (largely at the supply chain level)\nin the distribution of the COVID-19 vaccine).\n– Funeral services (Morgues, crematoria, funeral homes).\n– Education (Universities, schools).\n– Public sector (municipalities, any government bodies).\n– Non-profit organizations (charities, associations).\n2. Any actions that damage the reputation of the product are prohibited.\n3. Any work in the CIS (including Georgia, Ukraine) is prohibited.\n4. It is forbidden to transfer the account to third parties.\n5. It is forbidden to use other lockers in one project.\n\nThe list of excluded entities is what they had established in August, with one difference:\nfuneral services (morgues, crematoria, and funeral homes) were added to the list. When\nDataBreaches.net asked DarkSupp if they had ever regretted attacking a target, they had\nreplied:\n\n**DarkSupp: Yes, for the actions of our partners. After that, a ban on blocking of**\n**morgues and crematoriums appeared.**\n\nSo unlike what we saw with some entities refusing to commit to leaving medical entities\nalone or reneging on pledges, DarkSide has consistently prohibited attacks on medical\nentities as defined in their rules. They also have a more extensive exclusion list than any\nother group. [There will be some who argue, “So what? They are still criminals.” Yes, they\nare, but DataBreaches.net believes in giving credit where it’s due, and if they stick to leaving\nmedical alone, I give them credit for that.]\n\nThat said, and while their intentions may sound noble in excluding medical,\nDataBreaches.net was surprised to learn that DarkSide doesn’t consider medical targets\nlikely to pay, as indicated in this exchange in the interview:\n\n_DBN: You seem to have kept your word about leaving medical entities alone. Will you always_\n_leave medical, schools, and non-profits alone, or will that change when the pandemic ends?_\n\n**DarkSupp: There are several reasons why we do not attack medical institutions: 1.**\n**This may lead to aggravation of health problems and the death of people, which is**\n**unacceptable for us. In the encryption of medical institutions, they lose the history of**\n\n\n-----\n\n**patient diseases, a schedule of operations (including due to the loss of test results,**\n**which is now digitized) 2. Such companies on reviews of our colleagues usually do**\n**not pay a ransom.**\n\n_DBN: Are you saying that hospitals usually do NOT pay ransom when they are attacked or_\n_are you saying something else?_\n\n**DarkSupp: Yes, we mean that in addition to negative moral consequences, hospitals**\n**also pay money less often than companies.**\n\nThat statement seems to directly contradict what was reported at the same time last year\nwhen we were told that “Hospitals pay 80% to 90% of the time because they simply have no\n[choice.” Have they stopped paying as often? Hospitals in Germany,](https://www.databreaches.net/chwapi-hospital-hit-by-ransomware-operations-canceled-and-another-city-hit/) [Belgium, and](https://www.databreaches.net/chwapi-hospital-hit-by-ransomware-operations-canceled-and-another-city-hit/) [France](https://www.databreaches.net/another-french-hospital-hit-by-cyberattack/)\nhave been in the news in recent months as victims of ransomware attacks — in at least\nsome cases by DoppelPaymer. But are any paying? And are those who are attacking them\nmaking demands that far exceed cyberinsurance? Have the criminals gotten so greedy that\nmore victims are now refusing to pay?\n\nDarkSide did acknowledge that some things may change after the pandemic, but not\neverything:\n\n**DarkSupp: If we talk about medical companies: the ban on their encryption will always**\n**be, other spheres may be permissible but with a preliminary change of rules.**\n\n**Charitable Donations**\n\nIn an October press release, DarkSide revealed that they had made donations to some\ncharities. It did not get a positive response from the security community, members of the\nforum where it was discussed, or the general public. Concerned that entities might reject\ntheir donations if they knew the source, DarkSide announced that in the future, they would\nmake their donations anonymously. DataBreaches.net followed up on that by asking them\nwhether they had been making any donations (DBN did not ask them to name any\norganizations specifically).\n\n**DarkSupp: At that time, we did not consider it as an advertising move, donations**\n**were really shipped to help people. We do not know about the unpleasant**\n**consequences that in the end happened with money, but no one returned to us,**\n**as the money was sent through a mixer.**\n\n**DarkSupp: Yes, sometimes we sacrifice money for enlightenment with various**\n**charitable funds (not everyone who we wanted to give money to accept Bitcoin),**\n**but mostly we are anonymously supporting several open-source projects on**\n**anonymity on the Internet.**\n\n\n-----\n\nUnurprisingly, perhaps, Unknown of REvil also specifically mentioned supporting anonymity\n[projects when interviewed by Dmitry Smilyanets of Recorded Future last month.](https://therecord.media/i-scrounged-through-the-trash-heaps-now-im-a-millionaire-an-interview-with-revils-unknown/)\n\nIndeed, there were many respects in which the two groups seemed comparable in their\nstatements about their operations and approach to ransomware-as-a-service. They both\nrecognize that ransomware groups are in competition to give affiliates what they want and\nthat affiliates may jump ship to get better features or percentages of take. At the beginning\nof March, DarkSide published a detailed update and solicitation for partners. In it, they\npromote themselves as serious competitors whose features are better than what others have\nto offer potential affiliates.\n\nIn an announcement on a Russian-language forum, DarkSide advertises the competitive\nfeatures of DarkSide v. 2.1.\nIn our interview, they elaborated on how they see their position in the community:\n\n**DarkSupp: Objectively speaking, we have only a few competitors, the rest of the**\n**partnership programs at least do not provide the level of service that we have.**\n**After we started to develop and take the audience from them – they began to**\n**more actively develop their projects and create new services (it can easily notice**\n**the nomination of Russian hacker forums). So it can be said that our project**\n**globally affected the market for the development of cryptolocrineers.**\n\nREvil would probably make the same claim. And both groups have put up money on the\nforum to cover any incidents or problems that might develop (DarkSide put up 23 btc in\nNovember for such contingencies while REvil recently explained that they removed their\n\n\n-----\n\ndeposit because of the exchange rate).\n\nTheir commitment became important after BitDefender released a free decryptor for victims\nof DarkSide ransomware. DarkSide’s response was immediate and public: they\nacknowledged what had happened and how (as translated below):\n\nBitdefender has released a utility that can decrypt some of our Windows lockers. Linux\nis not decrypted. This is not connected with breaking our encryption or another bug in\nthe locker (RSA + Salsa20), but with the generation of keys. Due to the way the\ngenerator works under Linux, some private keys of the targets could be generated the\nsame, so BitDefender created its own decryptor based on one public key (previously\npurchased). We estimate that up to 40% of private keys are affected.\n\nAt the moment, this problem has been resolved, no new targets will be decrypted,\nthere have been no bugs in the locker itself, and there never will be.\n\nDarkSide offered monetary compensation to any affiliates who had lost money because of\nthe error, and then offered new affiliates a better deal for the next 30 days with higher shares.\nThey also thanked BitDefender publicly for helping them improve their product.\n\nBecause the decryptor was released right before the holidays, fewer than 5 victims were\nreportedly able to benefit from it, and DarkSide claimed that not only had the incident not\ncost them any affiliates, but it had actually helped them attract even more affiliates within 48\nhours because they offered a better deal to new affiliates while compensating any existing\nones who had suffered any losses. But they also told DBN:\n\n**If we talk about Bitdefender, we can say that they have made a big mistake by**\n**publishing the decryption key in public. In their place, we would distribute it**\n**among the recovery companies, and that would have caused more damage later**\n**for us.**\n\nAt the present time, DarkSide claims to work with more than 20 affiliates or partners. That is\nsignificantly less than what Unkn of REvil claimed Sodinokibi had as a maximum number of\naffiliates at any one time, and DarkSide is generally not listed among the currently most\nprofitable ransomware groups that seem to include Ryuk, REvil, and DoppelPaymer. But the\ncompetition is certainly evident as we have seen groups come and go in the past seven\nmonths and some grouping into what has been labeled by others as a cartel. DarkSide has\nnot expressed any public interest in joining any cartel, and made no mention of anything like\nthat in our interview.\n\nBut will DarkSide ever make enough money to quit? I put the question to them.\n\n_DBN: Unknown from REvil had said he can never have too much money because he grew_\n_up poor. How about you? Do you have some monetary goal in mind, and if you reach it, you_\n_will retire, or will you just keep going to make even more money?_\n\n\n-----\n\n**DarkSupp: We have a definite goal after which we will retire.**\n\nIt seems that they haven’t reached it yet.\n\n## Related Posts:\n\n[Secrets and Lies: The Games Ransomware Attackers Play](https://www.databreaches.net/secrets-and-lies-the-games-ransomware-attackers-play/)\n[Fake DarkSide gang targets energy, food industry in…](https://www.databreaches.net/fake-darkside-gang-targets-energy-food-industry-in-extortion-emails/)\n[\"We are apolitical\" -- DarkSide threat actors](https://www.databreaches.net/we-are-apolitical-darkside-threat-actors/)\n[DarkSide ransomware decryptor recovers victims' files for…](https://www.databreaches.net/darkside-ransomware-decryptor-recovers-victims-files-for-free/)\n[DarkSide ransomware is creating a secure data leak service…](https://www.databreaches.net/darkside-ransomware-is-creating-a-secure-data-leak-service-in-iran/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-12 - A chat with DarkSide.pdf"
    ],
    "report_names": [
        "2021-04-12 - A chat with DarkSide.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535901,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653693645,
    "ts_modification_date": 1653693645,
    "files": {
        "pdf": "https://archive.orkl.eu/32418263bddcd0456f5a2bbdccf9d763d564111a.pdf",
        "text": "https://archive.orkl.eu/32418263bddcd0456f5a2bbdccf9d763d564111a.txt",
        "img": "https://archive.orkl.eu/32418263bddcd0456f5a2bbdccf9d763d564111a.jpg"
    }
}