{
    "id": "884aa95f-683d-45c4-9f4c-9e3084179f06",
    "created_at": "2023-01-12T14:59:48.377919Z",
    "updated_at": "2025-03-27T02:13:34.354181Z",
    "deleted_at": null,
    "sha1_hash": "1b5083ff0ee004e9d27b11319810332259bc076b",
    "title": "2020-08-03 - Take a “NetWalk” on the Wild Side",
    "authors": "",
    "file_creation_date": "2022-05-28T22:06:04Z",
    "file_modification_date": "2022-05-28T22:06:04Z",
    "file_size": 7489219,
    "plain_text": "# Take a “NetWalk” on the Wild Side\n\n**[mcafee.com/blogs/other-blogs/mcafee-labs/take-a-netwalk-on-the-wild-side/](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/take-a-netwalk-on-the-wild-side/)**\n\n## Executive Summary\n\n\nAugust 3, 2020\n\n\nThe NetWalker ransomware, initially known as Mailto, was first detected in August 2019.\nSince then, new variants were discovered throughout 2019 and the beginning of 2020, with a\nstrong uptick noticed in March of this year.\n\nNetWalker has noticeably evolved to a more stable and robust ransomware-as-a-service\n(RaaS) model, and our research suggests that the malware operators are targeting and\nattracting a broader range of technically advanced and enterprising criminal affiliates.\n\nMcAfee Advanced Threat Research (ATR) discovered a large sum of bitcoins linked to\nNetWalker which suggest its extortion efforts are effective and that many victims have had no\noption other than to succumb to its criminal demands.\n\n\n-----\n\nWe approached our investigation of NetWalker with some possible ideas about the threat\nactor behind it, only to later disprove our own hypothesis. We believe the inclusion of our\nthinking, and the means with which we debunked our own theory, highlight the importance of\nthorough research and we welcome further discussion on this topic. We believe it starts\nvaluable discussions and helps avoid duplicate research efforts by others. We also\nencourage our peers in the industry to share information with us in case you have more\nevidence.\n\nMcAfee protects its customers against the malware covered in this blog in all its products,\nincluding personal antivirus, endpoint and gateway. To learn more about how McAfee\nproducts can defend against these types of attacks, visit our blog on Building Adaptable\nSecurity Architecture Against NetWalker.\n\n[Check out McAfee Insights to stay on top of NetWalker’s latest developments and](https://www.mcafee.com/enterprise/en-us/products/mvision-insights.html)\nintelligence on other cyber threats, all curated by the McAfee ATR team. Not only that,\nInsights will also help you prioritize threats, predict if your countermeasures will work and\nprescribe corrective actions.\n\n## Introduction\n\nSince 2019, NetWalker ransomware has reached a vast number of different targets, mostly\nbased in western European countries and the US. Since the end of 2019, the NetWalker\ngang has indicated a preference for larger organisations rather than individuals. During the\nCOVID-19 pandemic, the adversaries behind NetWalker [clearly stated that hospitals will not](https://www.bleepingcomputer.com/news/security/ransomware-gangs-to-stop-attacking-health-orgs-during-pandemic/)\nbe targeted; whether they keep to their word remains to be seen.\n\nThe ransomware appends a random extension to infected files and uses Salsa20 encryption.\nIt uses some tricks to avoid detection, such as a new defence evasion technique, known as\nreflective DLL loading, to inject a DLL from memory.\n\n[The NetWalker collective, much like those behind Maze,](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/ransomware-maze/) [REvil and other ransomware,](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/?hilite=%27sodinokibi%27)\nthreatens to publish victims’ data if ransoms are not paid.\n\nAs mentioned earlier, NetWalker RaaS prioritizes quality over quantity and is looking for\npeople who are Russian-speaking and have experience with large networks. People who\nalready have a foothold in a potential victim’s network and can exfiltrate data with ease are\nespecially sought after. This is not surprising, considering that publishing a victims’ data is\npart of NetWalker’s model.\n\nThe following sections are dedicated to introducing the NetWalker malware and displaying\nthe telemetry status before moving on to the technical malware analysis of the ransomware’s\nbehaviour. We will explain how the decryptor works and show some interactions between\nNetWalker’s operators and their victims. After this, we discuss the changes in modus\noperandi since September 2019, especially regarding payment behaviour. Then we show our\n\n\n-----\n\nattempts, unfruitful as they were, at discovering a link between NetWalker and previous,\nseemingly unrelated ransomware variants. Finally, we deliver an overview of IOCs related to\nNetWalker and its MITRE ATT&CK techniques.\n\n## Telemetry\n\nUsing McAfee’s billion Insights sensors, we can show the global prevalence of the NetWalker\nransomware.\n\n_Figure 1. McAfee MVISION Insights shows global prevalence of the NetWalker ransomware_\n\n## Technical Analysis\n\n### Ransom note (pre-March 2020)\n\nBefore March 2020, the NetWalker ransom note indicated how to contact the adversary\ndirectly using anonymous email account services with random names (such as\nkkeessnnkkaa@cock.li and hhaaxxhhaaxx@tuta.io):\n\n\n-----\n\n_Figure 2. Example of ransom note prior to March 2020_\n\n### Ransom Note (Post-March 2020)\n\nOn 12 March 2020, a researcher shared a screenshot of a new NetWalker ransom note in a\n[tweet and we can see that the attackers have changed the contact method significantly.](https://twitter.com/raby_mr/status/1237996344410701825)\nEmail communication has been dropped completely with victims now required to make\ncontact through the NetWalker Tor interface where, after submitting their user key, they will\nthen be redirected to a chat with NetWalker technical support. This change in contact method\ncoincides with underground forum postings where NetWalker revealed it was opening its\nRaaS up for new affiliates. The Tor page was not the only noticeable change we will highlight\nin this blog.\n\n\n-----\n\n_Figure 3. Example of ransom note after March 2020_\n\n## NetWalker Analysis\n\n\n-----\n\n_Figure 4. NetWalker behavior_\n\n### NetWalker Resource Analysis (Pre-March 2020)\n\n\n-----\n\nThe NetWalker malware uses a custom resource type (1337 or 31337) containing its entire\nconfiguration. This file is extracted to memory and decrypted using the RC4 algorithm with a\nhard-coded key in the resource.\n\nBefore 12 March 2020, NetWalker used the email contact process between its support\noperation and the victims to proceed with payment and send the decryption program. To do\nthis, NetWalker used its configuration file in the resource to set its encryption mode, the\nname of the ransom note, etc., and email contacts.\n\n**Name** wwllww.exe\n\n**Size** 96256 bytes\n\n**File-Type** EXE\n\n**SHA 256** 58e923ff158fb5aecd293b7a0e0d305296110b83c6e270786edcc4fea1c8404c\n\n\n**Compile**\n**time**\n\n\n6 December 2019\n\n\n_Figure 5. NetWalker resource from wwllww.exe_\n\nOnce decrypted, the configuration file reveals several parameters, allowing us to understand\nhow it works (how it constitutes the ransom note, the number of threads allocated for\nencryption, etc.):\n\nmpk Public key\n\nmode Encryption mode\n\n\n-----\n\nthr Allocated threads for encryption process\n\nspsz Encryption chunk\n\nnamesz Name length\n\nidsz ID length\n\ncrmask .mailto[email].{ID}\n\nmail Contact mail\n\nlfile Ransom Note name\n\nlend B64 encoded ransom note\n\nwhite Encryption whitelist\n\nkill Processes, tasks, service names to terminate\n\nunlocker Decryption exclusion list\n\n### NetWalker Resource Analysis (Post-March 2020)\n\nWhen Netwalker changed its contact mode and switched from email to the submission of the\nuser key directly on the web portal of the group’s blog, the configuration file in the resource\nalso changed. We found changes in the configuration file, such as the disappearance of the\ncontact “mail” and “crmask” fields (previously set as XXX@cock.li,XXX@tuta.io, etc., and\n.mailto[email].{ID}). This field was replaced by “onion1” and “onion2”, and these fields are set\nwith the NetWalker blog URL/payment page (hxxp://rnfdsgm<snip>drqqd.onion/). We also\nnoticed that the NetWalker developers complemented their “unlocker” field with some\nspecific values (e.g. “psexec.exe, system, forti*.exe, fmon.exe*, etc”).\n\n**Name** cnt.ex\n\n**Size** 70656 bytes\n\n**File-Type** EXE\n\n**SHA 256** 26dfa8512e892dc8397c4ccbbe10efbcf85029bc2ad7b6b6fe17d26f946a01bb\n\n\n**Compile**\n**time**\n\n\n2 May 2020\n\n\n-----\n\n_Figure 6. NetWalker resource from cnt.ex_\n\nUsually, attackers use RC_DATA or a malicious BITMAP. The latter can, for example, be a\nregular Bitmap (open matrix image format used by Windows) that can be used by malware to\nexecute code or as a payload dropper. The image’s pixels are an actual binary\nrepresentation of the payload. This process can be summarized as Exe -> Resources ->\nBMP with embedded data in pixels fetched and decrypted by, e.g. a DLL -> Payload), etc.\nHowever, in this case, they use this special custom type to increase obfuscation. The\nNetWalker developers chose custom types by using 1337 or 31337 structs, so the resource\nformat does not change. However, as we said, several values have changed or been\nreplaced:\n\nmpk Public Key\n\nmode Encryption mode\n\nspsz Encryption chunk\n\nthr Allocated threads for encryption process\n\nnamesz Name length\n\nidsz ID length\n\nlfile Ransom Note name\n\nonion1 Blog URL 1\n\nonion 2 Blog URL 2\n\nwhite Encryption whitelist\n\n\n-----\n\nkill Processes, tasks, service names to terminate\n\nnet Network resources encryption\n\nunlocker Decryption exclusion list\n\nlend B64 encoded ransom note\n\n### NetWalker Executable Analysis (Post-March 2020)\n\nThe malware sample used for this blog post has the same information:\n\n**Name** c21ecd18f0bbb28112240013ad42dad5c01d20927791239ada5b\n61e1c6f5f010\n\n**Size** 70656 bytes\n\n**File-Type** EXE\n\n**SHA 256** c21ecd18f0bbb28112240013ad42dad5c01d20927791239ada5b\n61e1c6f5f010\n\n**Compile time** 2 May 2020\n\nThe unpacked malware is a binary file of 32 bits that can be found as an EXE file.\n\n_Figure 7. Information sample of the malware_\n\n\n-----\n\nThe malware s first action is to combine all the required functions it needs into one large\nfunction, combining the modules already loaded in Windows with additional DLLs as\ndescribed below.\n\nInstead of searching for the function in the usual way, the malware makes a CRC32 hash of\nthe name of each function and compares with hardcoded values. Additionally, instead of\nusing the function “GetProcAddress”, the malware uses the Process Environment Block\n(PEB) to make analysis harder.\n\n_Figure 8. Get the module accessing the PEB and using a CRC32_\n\nIf the module cannot be discovered, it will load with “LdrLoadDll”, a native function of\nWindows, to try avoiding hooks in the usual functions, e.g. “LoadLibraryW”:\n\n\n-----\n\n_Figure 9. Load library using LdrLoadDll_\n\n_Figure 10. Get functions from module, e.g. using a CRC32 hash_\n\nIf the malware fails to get a function, it will go to a “sleep” call and terminate itself.\n\nLater, the malware extracts the configuration file from a resource with a custom type and a\ncustom name using the functions “FindResourceA”, “LockResource”, “LoadResource” and\n“SizeOfResource”. The file extracted in memory is decrypted using the RC4 algorithm with a\nhardcoded key in the resource.\n\nThe struct of the resource is:\n\n\n-----\n\n4 bytes -> The size of the hardcoded key to decrypt the configuration file.\nVariable size -> the hardcoded key to decrypt the configuration file.\nVariable size -> the configuration file encrypted.\n\nThe malware reads the first 4 bytes and reserves memory with the size of the password and\nreserves memory of the resource minus 4 bytes and the size of the password. Finally, it\ndecrypts the configuration file:\n\n_Figure 11. Get configuration file and decrypt it_\n\nIf the malware fails to get the configuration file, it will terminate itself.\n\nAfter getting the configuration file, the malware will parse it and save the fields in memory\nand write in the registry information to encrypt the files in the machine. The malware will try\nfirst to write in the registry-hive “HKEY_LOCAL_MACHINE” but if it cannot create it, it will\nuse the registry-hive “HKEY_CURRENT_USER”:\n\n\n-----\n\n_Figure 12. Write in the registry_\n\nAfter the writing in the registry has been completed, it will get some privileges using a token\nas SE_DEBUG_PRIVILEGE and SE_IMPERSONATE_PRIVILEGE:\n\n_Figure 13. Get some special privileges in the token_\n\n\n-----\n\nLater, the malware creates three threads, one to get information about the machine, such as\nthe operating system version, one to get processes and the last one to get services in the\nsystem.\n\nAfter this step, it will get the system directory and use “VSSadmin” to delete the Volume\nShadow copies of the system. Volume Shadow copies can contain copies of the encrypted\nfiles and would be an option to restore from if no backup exists.\n\n_Figure 14. Delete the shadow volumes_\n\nLater, the malware will enumerate the logical units, prepare the new extension for the future\nencrypted files, based on the size that is defined in the ransomware config with a random\nextension, and encrypt all files in the fixed type units and remote units with the new\nextension.\n\n\n-----\n\n_Figure 15. Crypt the files_\n\nAfter all these steps have been completed, it will create the ransom note on the desktop\nusing the functions “SHGetFolderPathlW” and “CreateFileW”. Subsequently, it will write the\nransom note from the memory into a new file with the function “WriteFile”. The malware will\ncreate the ransom note in the root folder (for example “c:\\”) of each logical unit. Next, it will\nlaunch “notepad.exe” with an argument to the ransom note file to show the user what\nhappened on the system:\n\n_Figure 16. Creation of the ransom note in the desktop and root units_\n\nFinally, after the encryption of the files and creation of the ransom note, the malware creates\na bat file in the %temp% folder of the machine with a temporary name and writes the content\nto destroy itself using the program “taskkill”. The batch script will delete the malware sample\nwith its path using the command “del” and finally delete the bat file with the command “del\n%0%”. Of course, as the malware uses the “del” command without destroying itself before\nthe deletion, it can be recovered with some forensic tools with luck (the same can also be\nsaid for the bat file).\n\nThis way the malware tries to remove itself from the machine to avoid being detected and\nanalyzed by security researchers:\n\n\n-----\n\n_Figure 17. Get Temp path and make a temporary file as a bat and launch it_\n\nFinally, the malware will finish with “ExitProcess”.\n\n## Decryptor\n\nWhen a NetWalker victim goes through technical support (see an example of this below) and\npays the ransom demanded by the group they will be able to download the decryptor to\nclean up their environment.\n\n_Figure 18. Conversation with NetWalker operators_\n\n\n-----\n\nThe download is done directly from the NetWalker Tor site, where the payment page\nswitches to a download page certifying that the payment was made and received:\n\n_Figure 19. Decryptor download_\n\nThe decryptor is delivered in a zip archive containing the decryptor executable and a note\nexplaining how to run the program correctly:\n\n\n-----\n\n_Figure 20. Decryptor delivery_\n\nThe program launches a graphical interface allowing the user to decipher their workstation\nautomatically or manually:\n\n\n-----\n\n_Figure 21. Decryptor execution_\n\nAt the end of the decryption process, the program indicates the number of decrypted files,\ndeletes the ransom note if the user has checked that option, and terminates, leaving the user\nto resume their work peacefully:\n\n_Figure 22. Decryptor has finished the decryption process_\n\nThe decryptor program appears unique and is linked to one victim specifically. In our\nexample, it only decrypts the files belonging to the victim who made the payment from the\nuser key specified in the ransom note.\n\n## Underground Advertising\n\nIn March 2020, the moniker Bugatti began actively advertising the NetWalker Ransomwareas-a-Service on two popular underground fora. Bugatti seems to have joined the\nunderground scene in February 2020 but claims to have been active with NetWalker\nransomware since September 2019. We have seen NetWalker activity before March but\nthere has been a noticeable uptick in larger victims since their advertisement. For a relatively\nnew ransomware it has been well received and respected among other cybercriminals as\ncompared to, for instance, [Nemty ransomware. The strength of NetWalker’s reputation is](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/nemty-ransomware-learning-by-doing/?hilite=%27nemty%27)\nsuch that our current hypothesis is that the individual behind Bugatti is most likely a wellrespected and experienced cybercriminal, even though it is a new moniker.\n\n\n-----\n\n_Figure 23. Bugatti advertising NetWalker on an underground forum_\n\nBugatti provides regular updates on the improvements in the ransomware, such as the\npopular Invoke-ReflectivePEInjection method, also commonly used by Sodinokibi. In addition\nto the improvements in the ransomware, open slots for new affiliates are advertised. Bugatti\nstrongly emphasized that they are primarily looking for experienced affiliates that focus on\ncompromising the complete networks of organizations as opposed to end users. NetWalker\nis clearly following in the footsteps of its illustrious targeted ransomware peers like\nSodinokibi, Maze and Ryuk.\n\nOne forum message in particular caught our attention as it included screenshots of several\npartial bitcoin addresses and USD amounts. This was most likely done to showcase the\nfinancial success of the ransomware. We have seen a similar posting in the past with the\n[influential Sodinokibi affiliate Lalartu, so we decided to follow the money once more.](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-follow-the-money/?hilite=%27sodinokibi%27)\n\n_Figure 24. Bugatti is looking for advanced affiliates and shows samples of BTC payments_\n\n\n-----\n\nWith the help of [CipherTrace software we were able to find the complete BTC addresses](http://www.ciphertrace.com/)\nfrom the screenshot and investigate the ledger further:\n\n**Screenshot 1**\n\n3JHTYZhRmMcq7WCKRzFN98vWvAZk792w9J\n\n**Screenshot 2**\n\n39aovzbz5rGoQdKjDm6JiybkSu1uGdVJ2V\n\n**Screenshot 3**\n\n39NRnZtgACDVhhmc7RwmvH9ZDUKTNwwaeB\n\n**Screenshot 4**\n\n\n-----\n\n3L4AW5kHnUCZBBjg2j1LBFCUN1RsHPLxCs\n\n## Following the Money\n\nIn the transactions mentioned in the underground forum post, the ransom amount payed by\nthe victims is presumably shown. Since the bitcoin blockchain is a publicly accessible ledger,\nwe can follow the money and see where the ransomware actors are transferring it to. In the\ncase of the four posted transactions above, the full amount payed by the victim was\ntransferred to two addresses (these addresses begin with bc1q98 and 1DgLhG respectively).\nIt is safe to say that these two bitcoin addresses are under control of the NetWalker actors.\nWe then proceeded on to analyze all incoming transactions to these two addresses and we\nwere able to make the following observations:\n\nThe first incoming transaction occurs on 1 March 2020.\nOn 30 March 2020 the first incoming transaction appears where the amount is split\nbetween 4 different bitcoin addresses. A split like this is typically seen in Ransomwareas-a-Service, where the ransom payment is split between the RaaS operators and the\naffiliate who caused the infection. In this first transaction, the split is 80%, 10% and two\n5% portions. This split matches the advertisement on the underground forum (80% –\n20%).\nThe two 5% portions of the ransom payments that are split, seem to be consistently\ntransferred to the two bitcoin addresses we revealed earlier (bc1q98 and 1DgLhG).\nWhile the beneficiaries of the 5% cuts remain the same, the beneficiary of the 10% cut\nseems to change over time. Based on the forum post we assume these addresses also\nbelong to the NetWalker actors.\nPayments to the bc1q98 and 1DgLhG addresses that are not being split continue up\nuntil the end of May. Possibly the initial NetWalker operators added a RaaS operation,\nwhile continuing to cause NetWalker infections themselves.\n\n\n-----\n\nWhile analyzing the bitcoin addresses that received 80% or more of the transaction\namount, we noticed that there are some addresses that receive payments multiple\ntimes. A possible explanation could be that the address is configured as payout\naddresses for a certain campaign or affiliate. We identified 30 unique bitcoin addresses\nthat seem to be the beneficiary of this larger portion of the ransom transaction. Some of\nthese only received one payment but there are several that received multiple\npayments.\nIn the two addresses uncovered by tracing the transactions a total of 641 bitcoin is held\non 27 July 2020. Which at the current market value of bitcoin is worth well over 7\nmillion USD.\n\n### Amounts Extorted\n\nWorking under the hypothesis that all the incoming transactions are ransomware payments;\nwe can make the following observations:\n\nWe found 23 transactions where the ransom payments were not split up and the\nbeneficiaries are the two bitcoin addresses found by following the transactions\nmentioned in the underground forum post. The total amount of bitcoin extorted this way\nbetween 1 March 2020 and 27 July 2020 is 677 BTC. Additionally, the amount received\nfrom remaining transactions following the Ransomware-as-a-Service scheme by these\naddresses between 1 March 2020 and 27 July 2020 is 188 BTC.\nIn the transactions that are split, the largest amount (usually 80% to 90% of the total\ntransaction value) is presumably transferred to the affiliate that caused the infection.\nWhen we summed up these largest portions, we saw a total of 1723 BTC being\ntransferred to affiliates.\nThe total amount of extorted bitcoin that has been uncovered by tracing transactions to\nthese NetWalker related addresses is 2795 BTC between 1 March 2020 and 27 July\n2020. By using historic bitcoin to USD exchange rates, we estimate a total of 25 million\nUSD was extorted with these NetWalker related transactions.\n\nEven though we do not have complete visibility into the BTC flow before NetWalker started\nramping up, one thing is certain, this quarter alone it has been highly successful at extorting\norganisations for large amounts of money. All this at a time when many sectors are struggling\nbecause people are sheltering in place and governments are trying to keep businesses from\ngoing bankrupt. NetWalker is making millions off the backs of legitimate companies.\n\n\n-----\n\n_Figure 25. Overview of uncovered bitcoin transactions, highlighting the two identified actor_\n_addresses._\n\n### Observed Changes\n\nWhile talking about the impact of NetWalker with our partners, we learned that the change in\nmodus operandi not only affected the way the actors communicate with their victims. When\nthere was a change from email communication to a dedicated Tor hidden service, the actors\nalso moved away from using legacy bitcoin addresses to SegWit addresses. The benefits of\nusing the newer SegWit addresses include faster transaction time and lower transaction\ncost. The NetWalker advertisement on the underground forum mentions instant and fully\n\n\n-----\n\nautomatic payments around the time of this observed change. This makes us believe the\nransomware actors were professionalizing their operation just before expanding to the\nRansomware-as-a-Service model.\n\n## Comparison with Previous Ransomware\n\nGiven the sudden appearance of NetWalker ransomware and the associated threat actor, it\nsuggests that some prior knowledge on ransomware development or underground presence\nhad to be in place. Armed with this hypothesis, we searched for possible links to\nunderground actors and other ransomware strains that might fit the bill. We came across one\nthreat actor offering ransomware that caught our attention. It was the use of the name\nNetWalker, in combination with a strong ransomware connection, that sparked our interest.\n\nSome years ago, a threat actor using the moniker Eriknetwalker was advertising ransomware\non several underground forums. We found posts from 2016 and the latest public activity was\naround June 2019, several months before NetWalker ransomware made its appearance.\n\n_Figure 26. Eriknetwalker began advertising their ransomware in 2016 (Google-translated_\n_from Russian)_\n\nBased on our underground research, we linked the moniker Eriknetwalker to the\ndevelopment and/or distribution of Amnesia, Bomber and Scarab ransomware. Eriknetwalker\nstopped advertising ransomware around June 2019. Therefore, we decided to perform a\ncomparative analysis between the different ransomware strains linked to Eriknetwalker and\nsome of the earliest versions of NetWalker we could find\n\n\n-----\n\nThe goal of this comparative analysis was to identify whether there was an overlap between\nsource codes. Such overlap could suggest a stronger link between the current NetWalker\nversion and the other ransomware versions from Eriknetwalker, possibly even explaining the\nname overlap.\n\nTo execute the analysis, we used several tools one of which was the binary visualization tool\n[Veles, which dynamically translates binary information into an abstract visualization that](https://codisec.com/veles/)\nallows us to identify and compare patterns.\n\nThe different types of ransomware we began analyzing were the variants of Amnesia,\nScarab, and NetWalker.\n\n_Figure 27. Flat visualization of binary data of the different ransomware variants_\n\n\n-----\n\n_Figure 28. 3D visualization of binary data of the different ransomware variants_\n\nVisualizing data in such a manner is a way to use the human brain to quickly identify patterns\nand be able to draw comparisons between objects. In our case, we see that, based on the\nbinary data visualized in Figures 27 and 28, the ransomware binaries do yield differences\nthat we cannot ignore.\n\n\n-----\n\n_Figure 29. Comparison of source code results_\n\nFigure 29 shows the results of a source code similarity analysis led on the different variants\nof ransomware named in the figure itself. Interesting enough, Scarab and Amnesia show a\nhigher overlap with Buran and Zeppelin than the early NetWalker samples. The percentages\nshown are the amount of code that is similar between two variants.\n\nAs illustrated in the overview, the September 2019 NetWalker version has a different\ncodebase from the ErikNetWalker-linked ransomware variants. This finding disproves our\nearlier hypothesis that NetWalker is linked to the older Amnesia variants based on code\noverlap.\n\nOften, research teams do not publish their results when it disproves their own hypothesis.\nHowever, for the sake of transparency, we decided to include our research efforts.\n\n## YARA Rules\n\n[We uploaded a YARA rule to detect almost all the samples observed in the wild to date.](https://github.com/advanced-threat-research/Yara-Rules/blob/master/ransomware/RANSOM_netwalker.yar)\n\n## Indicators of Compromise\n\nDuring our investigation we have observed numerous IoCs linked to NetWalker ransomware.\n[To obtain them please visit our McAfee ATR GitHub site, or get the latest NetWalker IoCs](https://github.com/advanced-threat-research/IOCs/tree/master/2020/2020-08-03-Take-a-NetWalk-on-the-wild-side)\n[and intelligence on many other threats with McAfee Insights.](https://www.mcafee.com/enterprise/en-us/products/mvision-insights.html)\n\n## MITRE ATT&CK Techniques\n\nThe below techniques were based on our research and complemented with research from\nindustry peers.\n\n**Initial Access**\n\nExploit Public-Facing Application (T1190) : Exploit Tomcat, Exploit WebLogic\nSpear phishing Attachment (T1566.001): Phishing email\nValid Accounts (T1078): RDP compromised\n**Execution**\n\nPowerShell (T1059.001): PowerShell Script\nCommand and Scripting Interpreter: Windows Command Shell (003)\nService Execution (T1569.002): PsExec\nNative API (T1106): Use Windows API functions to inject DLL\nWindows Management Instrumentation (T1047)\n**Persistence**\n\nRegistry Run Key (T1547.001): Place a value on RunOnce key\nModify Registry key (T1112): Create its own registry key in \\SOFTWARE\\\n<uniquename>\n\n\n-----\n\n**Privilege Escalation**\n\nExploitation for Privilege Escalation (T1068): CVE-2020-0796, CVE-2019-1458,\nCVE-2017-0213, CVE-2015-1701\nProcess Injection (T1055.001): Reflective DLL Injection\n**Defense Evasion**\n\nDisabling Security Tools (T1562.001): ESET AV Remover, Trend Micro’s Security\nAgent Uninstall Tool, Microsoft Security Client Uninstall\nProcess Injection (T1055.001): Reflective DLL Injection\nDeobfuscate/Decode Files or Information (T1140)\nObfuscated Files or Information (T1027): PowerShell Script uses Base64 and\nhexadecimal encoding and XOR-encryption\n**Credential Access**\n\nCredential Dumping (T1003): Mimikatz, Mimidogz, Mimikittenz, Windows\nCredentials Editor, Pwdump, LaZagne\nBrute Force (T1110.001): NLBrute\n**Discovery**\n\nNetwork Service Scanning (T1046): SoftPerfect Network Scanner\nSecurity Software Discovery (T1518.001)\nSystem Information Discovery (T1082)\n**Lateral Movement**\n\nThird-Party Software (T1072): TeamViewer, Anydesk\nService Execution (T 1569.002): PsExec\nLateral Tool Transfer (T1570)\n**Collection**\n\nData from information repositories (T1213)\nData from local system (T1005)\nData from network shared drive (T1039)\n**Command and Control**\n\nIngress Tool Transfer (T1105)\n**Impact**\n\nData Encrypted (T1486): NetWalker Ransomware\nInhibit System Recovery (T1490): Shadow Copies Deleted\nService Stop (T1489)\n\n\n-----\n\n## Conclusion\n\nRansomware has evolved into a lucrative business for threat actors, from underground\nforums selling ransomware, to offering services such as support portals to guide victims\nthrough acquiring crypto currency for payment, to the negotiation of the ransom. McAfee’s\nAdvanced Threat Research team has analysed the NetWalker ransomware and have been\nfollowing its evolution from the initial sighting of the Mailto ransomware to its redevelopment\ninto the NetWalker ransomware. The recent shift to a business-centric model of\nRansomware-as-a-Service is a clear sign that it is stepping up, so it seems that the\nNetWalker group is following in the footsteps of REvil and other successful RaaS groups.\nThe ransomware developers have proven the ability to refocus and capitalize on current\nworld events and develop lures to help ensure the effectiveness of the ransomware, which\nhas allowed them to become selective of their affiliates by limiting access to the ransomware\nto only those with vetted access to large organizations. As development of the ransomware\ncontinues, we have witnessed recent shifts in activity that closely follow in the footsteps of\nother ransomware developments, including threatening victims with the release of\nconfidential information if the ransom is not met.\n\nMcAfee ATR is actively monitoring ransomware threats and will continue to update McAfee\nMVISION Insights and its social networking channels with new and current information.\nMVISION Insights is the only proactive endpoint security solution that simultaneously\nprioritizes and predicts threats that matter to our customers while offering prescriptive\nguidance on what to do in their local environment. Want to stay ahead of the adversaries?\n\n\n-----\n\n[Check out McAfee MVISION Insights for more information. If you want to experience some of](https://www.mcafee.com/enterprise/en-us/products/mvision-insights.html)\n[the MVISION Insights capabilities, go the Preview of MVISION Insights where you can select](https://www.mcafee.com/enterprise/en-us/lp/insights-dashboard.html)\nthe top threat information that is available.\n\n[Authored by: Thibault Seret,](https://www.mcafee.com/blogs/author/thibault-seret/) [Valentine Mairet,](https://www.mcafee.com/blogs/author/valentine-mairet/) [Jeffrey Sman,](https://www.mcafee.com/blogs/author/jeffrey-sman/) [Alfred Alvarado,](https://www.mcafee.com/blogs/author/alfred-alvarado/) [Tim Hux,](https://www.mcafee.com/blogs/author/tim-hux/)\n[Alexandre Mundo,](https://www.mcafee.com/blogs/author/alexandre-mundo/) [John Fokker,](https://www.mcafee.com/blogs/author/John-fokker/) [Marc Rivero Lopez and](https://www.mcafee.com/blogs/author/marc-rivero-lopez/) [Thomas Roccia.](https://www.mcafee.com/blogs/author/thomas-roccia/)\n\n[ATR Operational Intelligence Team](https://www.mcafee.com/blogs/author/atr-operational-intelligence-team/)\nMcAfee’s Advanced Threat Research Operational Intelligence team operates globally around\nthe clock, keeping watch of the latest cyber campaigns and actively tracking the most\nimpactful cyber threats.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-03 - Take a “NetWalk” on the Wild Side.pdf"
    ],
    "report_names": [
        "2020-08-03 - Take a “NetWalk” on the Wild Side.pdf"
    ],
    "threat_actors": [
        {
            "id": "e7d03ac8-7d6f-4ea0-83a9-10dff2ea1486",
            "created_at": "2022-10-25T16:07:24.158325Z",
            "updated_at": "2025-03-27T02:02:10.127249Z",
            "deleted_at": null,
            "main_name": "Scarab",
            "aliases": [
                "UAC-0026"
            ],
            "source_name": "ETDA:Scarab",
            "tools": [
                "Scieron"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9099912b-a00a-4afb-8294-c6d35af421a1",
            "created_at": "2023-01-06T13:46:39.338108Z",
            "updated_at": "2025-03-27T02:00:03.054726Z",
            "deleted_at": null,
            "main_name": "Scarab",
            "aliases": [],
            "source_name": "MISPGALAXY:Scarab",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535588,
    "ts_updated_at": 1743041614,
    "ts_creation_date": 1653775564,
    "ts_modification_date": 1653775564,
    "files": {
        "pdf": "https://archive.orkl.eu/1b5083ff0ee004e9d27b11319810332259bc076b.pdf",
        "text": "https://archive.orkl.eu/1b5083ff0ee004e9d27b11319810332259bc076b.txt",
        "img": "https://archive.orkl.eu/1b5083ff0ee004e9d27b11319810332259bc076b.jpg"
    }
}