{
    "id": "884ca8a3-7cf9-4cc4-8e95-200caf32a9e6",
    "created_at": "2023-01-12T15:06:16.544245Z",
    "updated_at": "2025-03-27T02:05:46.608205Z",
    "deleted_at": null,
    "sha1_hash": "9328f2638990b919bb676b974cc95e8c9ec77631",
    "title": "2019-01-22 - Happy New Year 2019! Anatova is here!",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:43Z",
    "file_modification_date": "2022-05-28T16:16:43Z",
    "file_size": 1880485,
    "plain_text": "# Happy New Year 2019! Anatova is here!\n\n**[securingtomorrow.mcafee.com/other-blogs/mcafee-labs/happy-new-year-2019-anatova-is-here/](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/happy-new-year-2019-anatova-is-here/)**\n\nJanuary 22, 2019\n\nDuring our continuous hunt for new threats, we discovered a new ransomware family we call\nAnatova (based on the name of the ransom note). Anatova was discovered in a private peerto-peer (p2p) network. After initial analysis, and making sure that our customers are\nprotected, we decided to make this discovery public.\n\n\n-----\n\n_Our telemetry showed that although Anatova is relatively new, we already discovered a_\n_widespread detection of the thread around the globe_\n\nWe believe that Anatova can become a serious threat since the code is prepared for modular\nextension.\n\nAdditionally, it will also check if network-shares are connected and will encrypt the files on\nthese shares too. The developers/actors behind Anatova are, according our assessment,\nskilled malware authors. We draw this conclusion as each sample has its own unique key, as\nwell as other functions we will describe, which we do not often see in ransomware families.\n\nThis post will explain the technical details of Anatova, as well as some interesting facts about\nthis new ransomware family.\n\nFor the analysis we used this particular hash:\n**170fb7438316f7335f34fa1a431afc1676a786f1ad9dee63d78c3f5efd3a0ac0**\n\nThe main goal of Anatova is to cipher all the files that it can before requesting payment from\nthe victim.\n\n## Anatova Overview\n\nAnatova usually uses the icon of a game or application to try and fool the user into\ndownloading it. It has a manifest to request admin rights.\n\n\n-----\n\n_Information about the binary_\n\nThe Anatova ransomware is a 64bits application with the compile date of January 1, 2019.st\nThe file size of this particular hash is 307kb, but it can change due to the amount of\nresources used in the sample. If we remove all these resources, the size is 32kb; a very\nsmall program with a powerful mechanism inside.\n\n\nAnatova has some strong protection techniques against static analysis which makes things\nslightly tricky:\n\nMost of the strings are encrypted (Unicode and Ascii), using different keys to decrypt\nthem, embedded in the executable.\n90% of the calls are dynamic;, they only use the following non-suspicious Windows\nAPI’s and standard library of C- programming language: GetModuleHandleW,\nLoadLibraryW, GetProcAddress, ExitProcess and MessageBoxA.\nWhen we open the binary in IDA Pro (included the latest version of IDA) the functions\nare bad detected, and they finish being processed after 3 opcodes. We are not sure if\nthis is a bug in IDA Pro or perhaps the malware authors created something to cause\nthis on purpose (which we doubt).\n\n\n-----\n\n_Problem in IDA Pro 7.2 last version_\n\n## Entry Vector\n\nAt the moment we don´t know all entry vectors that Anatova is using, or will be using, in the\nnear future. Our initial finding location was in private p2p.\n\nThe goal of Anatova, as with other ransomware families, is to encrypt all or many files on an\ninfected system and insist on payment to unlock them. The actor(s) demand a ransom\npayment in cryptocurrency of 10 DASH – currently valued at around $700 USD, a quite high\namount compared to other ransomware families.\n\n## In-depth highlights of version 1.0\n\nSince this is a novel family, we didn’t find any version number inside the code, but let’s call\nthis version 1.0\n\nThe first action that the malware executes is to get the module handle of the library\n“kernel32.dll” and get 29 functions from it using the function “GetProcAddress”.\n\n\n-----\n\n_Get kernel32 functions after decrypt strings_\n\nIf the malware can´t get the module handle of kernel32, or some of the functions can´t be\nfound, it will quit without executing any encryption.\n\nLater, the malware will try to create a mutex with a hardcoded name (in this case:\n6a8c9937zFIwHPZ309UZMZYVnwScPB2pR2MEx5SY7B1xgbruoO) but the mutex name\nchanges in each sample. If the mutex is created, and gets the handle, it will call the\n“GetLastError” function and look if the last error is ERROR_ALREADY_EXISTS or\nERROR_ACCESS_DENIED. Both errors mean that a previous instance of this mutex object\nexists. If that is the case, the malware will enter in a flow of cleaning memory, that we will\nexplain later in this post, and finish.\n\n_Check mutex_\n\nAfter this check, Anatova will get some functions from the library “advapi32.dll”, “Crypt32.dll”\nand “Shell32.dll” using the same procedure as in the kernel case. All text is encrypted and\ndecrypted one per one, get the function, free the memory, and continue with the next one.\n\n\n-----\n\nIf it fails in getting some of these modules or some of the functions it needs, it will go to the\nflow of cleaning tool and exit.\n\nOne interesting function we discovered was that Anatova will retrieve the username of the\nlogged in and/or active user and compare with a list of names encrypted. If one of the names\nis detected, it will go to the cleaning flow procedure and exit.\n\nThe list of users searched are:\n\nLaVirulera\ntester\nTester\nanalyst\nAnalyst\nlab\nLab\nMalware\nmalware\n\nSome analysts or virtual machines/sandboxes are using these default usernames in their\nsetup, meaning that the ransomware will not work on these machines/sandboxes.\n\nAfter this user-check, Anatova will check the language of the system. When we say\nlanguage, we mean the system language. When a user installs the Windows OS, they\nchoose a language to install it with (though later the user could install a different language).\nAnatova checks for the first installed language on the system to ensure that a user cannot\ninstall one of these blacklisted languages to avoid encryption of the files.\n\nThe list of the countries that Anatova doesn’t affect are:\n\nAll CIS countries\nSyria\nEgypt\nMorocco\nIraq\nIndia\n\nIt’s quite normal to see the CIS countries being excluded from execution and often an\nindicator that the authors might be originating from one of these countries. In this case it was\nsurprising to see the other countries being mentioned. We do not have a clear hypothesis on\nwhy these countries in particular are excluded.\n\n\n-----\n\n_Check system language_\n\nAfter the language check, Anatova looks for a flag that, in all samples we looked at, has the\nvalue of 0, but if this flag would change to the value of 1 (the current malware samples never\nchange that value), it will load two DLLs with the names (after decryption) of “extra1.dll” and\n“extra2.dll”. This might indicate that Anatova is prepared to be modular or to be extended\nwith more functions in the near future.\n\n\n-----\n\n_Load extra modules_\n\nAfter this, the malware enumerates all processes in the system and compares them with a\nlarge list including, for example “steam.exe”, “sqlserver.exe”, etc. If some of these processes\nare discovered, the malware will open them and terminate them. This action is typical of\nransomware that attempts to unlock files that later will be encrypted, such as database files,\ngame files, Office related files, etc.\n\nThe next action is to create an RSA Pair of Keys using the crypto API that will cipher all\nstrings. This function is the same as in other ransomware families, such as GandCrab or\nCrysis, for example. It makes sure that the keys that will be used, are per user and per\nexecution.\n\nIf the malware can´t create the keys, it will go to the clean flow and exit.\n\nAfter this, Anatova will make a random key of 32 bits and another value of 8 bytes using the\nfunction of the crypto API “CryptGenRandom” to encrypt using the Salsa20 algorithm and the\nprivate previous blob key in runtime.\n\n\n-----\n\nDuring the encryption process of the files, it will decrypt the master RSA public key of the\nsample of 2 layers of crypto, the first one is a XOR with the value 0x55 and the second one\nis to decrypt it using a hardcoded key and IV in the sample using the Salsa20 algorithm.\n\n_Decrypt from first layer the master RSA public key of sample_\n\nAfter this, it will import the public key and with it, will encrypt the Salsa20 key and IV used to\nencrypt the private RSA key in runtime.\n\nThe next step is to prepare a buffer of memory and with all of the info encrypted (Salsa20\nkey, Salsa20 IV, and private RSA key). It makes a big string in BASE64 using the function\n“CryptBinaryToStringA”. The ransomware will later clean the computer’s memory of the key,\nIV, and private RSA key values, to prevent anyone dumping this information from memory\nand creating a decrypter.\n\nThis BASE64 string will be written later in the ransom note. Only the malware authors can\ndecrypt the Salsa20 key and IV and the private RSA key that the user would need to decrypt\nthe files.\n\nIf this does not work, Anatova will delete itself, enter in the clean flow and exit.\n\nWhen the keys are encrypted in the memory buffer, Anatova will enumerate all logic units\nand will search for all existing instances of the type DRIVE_FIXED (a normal hard disk for\nexample) or DRIVE_REMOTE (for remote network shares that are mounted). Anatova will try\nto encrypt the files on each of those locations. This means that one corporate victim can\ncause a major incident when files on network-shares are being encrypted.\n\n\n-----\n\n_Check all logic units_\n\nFor each mounted drive – hard disk or remote share, Anatova will get all files and folders. It\nwill later check if it is a folder and, if it is, will check that the folder name doesn’t have the\nname of “.” and “..”, to avoid the same directory and the previous directory.\n\nIn the list of gathered folder names, Anatova checks against a list of blacklisted names such\nas “Windows”, “Program Files”, “Program Files(x86)”, etc. This is usual in many ransomware\nfamilies, because the authors want to avoid destroying the Operating System, instead\ntargeting the high value files. Anatova does the same for file-extensions .exe, .dll and .sys\nthat are critical for the Operating system as well.\n\n\n-----\n\n_Check file name and extension_\n\nIf this check is passed, Anatova will open the file and get its size, comparing it to1 MB.\nAnatova will only encrypt files1 MB or smaller to avoid lost time with big files; it wants to\nencrypt fast. By setting pointers at the end of the encrypted files, Anatova makes sure that it\ndoes not encrypt files that are already encrypted.\n\nNext, Anatova will create a random value of 32bits as a key for the Salsa20 algorithm and\nanother value of 8 bytes that will be used as IV for Salsa20.\n\nWith these values, it will read all files in memory or files with a maximum size of 1 MB and\nencrypt this information with the key and IV using the Salsa20 algorithm (this is very popular\nlately because it is a very quick algorithm and has open source implementations).\n\n\n-----\n\n_Encryption of files function_\n\nIt will import the RSA public key created in runtime and with it, encrypt the key and IV used to\nencrypt the file. Next, it will write the encrypted content in the same file from the beginning of\nthe file and then it will set the pointer to the end of the file and write the next things:\n\nThe block encrypted of the Salsa20 key is ciphered with the public RSA key.\nThe block encrypted of the Salsa20 IV is ciphered with the public RSA key.\nThe size of the file is smaller than 1 MB.\nA special hardcoded value for each sample that will appear in the ransom note.\nA special hardcoded value in the sample that is the mark of infection checked before to\navoid encrypting the same file twice.\n\nWhen this is completed, Anatova will write a ransom note in the same folder. So, if Anatova\ncan´t encrypt at least something in a folder, it won’t create a ransom note in this folder, only\nin the affected folders.\n\n\n-----\n\nThis behavior is different from other ransomware families that write a ransom note in all\nfolders.\n\nThe ransom note text is fully encrypted in the binary, except for the mail addresses to contact\nthe author(s) and the dash address to pay.\n\nAnatova doesn’t overwrite the ransom note if it already exists in a folder in order to save\ntime.The ransom note contains the base64 block with all encrypted information that is\nneeded to decrypt the files in a block that start with the string “—-KEY—-”, as well asthe id\nnumber.\n\nResponding victims are then allowed to decrypt one .jpg file of maximum size 200kb free of\ncharge, as proof that they the decrypted files can be retrieved.\n\n_Example of ransom note_\n\nWhen all this is done, Anatova will destroy the Volume Shadow copies 10 times in very quick\nsuccession. Like most ransomware families, it is using the vssadmin program, which\nrequired admin rights, to run and delete the volume shadow copies.\n\n\n-----\n\n_Delete of Shadow Volumes 10 times_\n\nFinally, when all steps are completed, the ransomware will follow the flow of cleaning code,\nas described earlier, mainly to prevent dumping memory code that could assist in creating a\ndecryption tool.\n\n## COVERAGE\n\nCustomers of McAfee gateway and endpoint products are protected against this version.\nDetection names include Ransom-Anatova![partialhash].\n\n## INDICATORS OF COMPROMISE\n\nThe samples use the following MITRE ATT&CK™ techniques:\n\nExecution through API\nApplication processes discovery\nFile and directory discovery: to search files to encrypt\nEncrypt files\nProcess discovery: enumerating all processes on the endpoint to kill some special ones\nCreate files\nElevation of privileges: request it to run.\nCreate mutants\n\n**Hashes**\n\n2a0da563f5b88c4d630aefbcd212a35e\n\n\n-----\n\n366770ebfd096b69e5017a3e33577a94\n\n9d844d5480eec1715b18e3f6472618aa\n\n61139db0bbe4937cd1afc0b818049891\n\n596ebe227dcd03863e0a740b6c605924\n\n[Alexandre Mundo](https://www.mcafee.com/blogs/author/alexandre-mundo/)\nAlexandre Mundo, Senior Malware Analyst is part of Mcafee's Advanced Threat Research\nteam. He reverses the new threads in advanced attacks and make research of them in a\ndaily basis....\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-22 - Happy New Year 2019! Anatova is here!.pdf"
    ],
    "report_names": [
        "2019-01-22 - Happy New Year 2019! Anatova is here!.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535976,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653754603,
    "ts_modification_date": 1653754603,
    "files": {
        "pdf": "https://archive.orkl.eu/9328f2638990b919bb676b974cc95e8c9ec77631.pdf",
        "text": "https://archive.orkl.eu/9328f2638990b919bb676b974cc95e8c9ec77631.txt",
        "img": "https://archive.orkl.eu/9328f2638990b919bb676b974cc95e8c9ec77631.jpg"
    }
}