{
    "id": "886eb4eb-96f6-40df-91c8-c7b091af30fb",
    "created_at": "2023-01-12T15:11:01.065382Z",
    "updated_at": "2025-03-27T02:05:49.19908Z",
    "deleted_at": null,
    "sha1_hash": "4048379da667a34adbc097aa6d0de17bb311d407",
    "title": "2020-08-23 - Dispatches from Drovorub- Network Threat Hunting for Russia GRU GTsSS' Malware at Scale",
    "authors": "",
    "file_creation_date": "2022-05-28T03:12:37Z",
    "file_modification_date": "2022-05-28T03:12:37Z",
    "file_size": 870615,
    "plain_text": "# Dispatches from Drovorub: Network Threat Hunting for Russia GRU GTsSS' Malware at Scale\n\n**github.com/Insane-Forensics/drovorub-hunt**\n\nInsane-Forensics\n\nRecently, the National Security Agency and Federal Bureau of Investigation released a\nreport outlining command and control capabilities leveraged by the Russian General Staff\nMain Intelligence Directorate (GRU) 85th Main Special Service Center (GTsSS), military unit\n26265 to interfere with the 2016 U.S. Presidential election. While this report contained\ntechnical details outlining the malware technologies, the report did not provide a networkscale tool ready for network-based threat hunting. Today, [Insane Forensics makes public a](https://insaneforensics.com/)\nfree, open source tool to assist with scaled network detection and response for GRUs\nDrovorub malware using Elasticsearch and Kibana. The provided tool works on existing\nnetwork captures (pcap files) and also supports live capture mode.\n\n\n-----\n\n_Disclaimer: We built this tool entirely with the NSA/FBI report data. We did not have actual_\n_malware samples or packet captures. If you have samples/network captures or can validate_\n_this tool with real data, please get in touch._\n\n## Included in this Toolkit\n\nA python script to load previously collected pcap data or listen live on an interface\nElasticsearch index mapping\nKibana dashboards for analyst\n\n## Requirements\n\nTShark in environment path\nElasticsearch and Kibana\nPython3\n\n## Usage\n\n**These instructions are for informational purposes only. Understand variations**\n**required for your environment before proceeding**\n\n\n-----\n\n1. Install needed python dependencies using the provided requirements.txt file.\n\n1. `pip install -r requirements.txt`\n2. Create the Elasticsearch index mapping.\n\n1. We've provided a helper script to assist with this. For our authenticated ELK\n\nstack, we used `python3 create_elk_index.py https://<elk ip>:9200`\n```\n      drovorub_test -elk_un <elk username> -elk_pw <elk password>\n\n```\n3. Add the kibana saved objects (visualizations, dashboards, index pattern)\n\n1. In Kibana: Management -> Stack Management -> Saved Objects -> Import\n2. Use the provided drovorub_hunt.ndjson\n4. Load data to analyze using one of the following options. The elk_un and elk_pw fields\n\nshould only be used if your elk node uses authentication.\n\n1. Packet Capture Mode: `python3 drovorubhunt.py <elk ip> drovorub_test`\n```\n      -elk_un <username> -elk_pw <password> -pcap <pcap file>\n\n```\n2. Live Capture Mode: `python3 drovorubhunt.py <elk ip> drovorub_test -`\n```\n      elk_un <username> -elk_pw <password> -live <interface>\n\n```\n3. Test Data Mode: `python3 drovorubhunt.py <elk ip> drovorub_test -`\n```\n      elk_un <username> -elk_pw <password> -test . If you use test data, make\n\n```\nsure to set the time window back to 2016 as the sample data is from that\ntimestamp. The test data payload comes from the NSA/FBI report screenshots.\n\n## Data Analysis Techniques\n\nThe provided dashboard allows for primary hunting and response techniques covering\nDrovorub's command and control (c2). Drovorub C2 uses the WebSockets protocol outlined\nin RFC 6455. All WebSocket communications will appear in the source, destination, and\nnetwork protocol panels of the provided dashboard. We came to this design decision in\nwanting to allow a wider aperture on potential unknown or undecoded WebSocket\ncommunications beyond known communication formats outlined in the report.\n\nAs a network analyst, you should try to understand the difference between healthy and\nabnormal WebSocket communications in your environment. The innermost ring of the source\nand destination panes shows the mac addresses of communicating assets. The middle circle\nshows IP addresses, and the outer ring shows the port. For the network protocol pane, the\ninner ring shows the transport protocol while the outer ring shows the application-level\nprotocols. You can pivot by clicking on any ring value or the values on the right.\n\n\n-----\n\n### Pivoting by Drovorub Communication Session\n\nThe pane titled Drovorub Session Tracking allows you to pivot between session IDs present\nin Drovorub C2 sessions. This pane can also show how many sessions are active across\nyour environment and to a single host. The inner ring represents the destination ID, the\nmiddle ring represents the source ID, and the outer ring represents the session ID. In the\ndashboard shown, we see one session between two Drovorub communicating assets.\n\n### Pivoting by Drovorub Module and Action\n\nThe module and action panes allow you to pivot by the Drovorub module or actions\nobserved. Each panel represents a word cloud of the weighted count of each module or\naction seen. You can pivot on a particular module by merely clicking on it. Clicking applies a\nKibana filter to the entire dashboard. In the image below, the active filter displays Drovorub\nshell module communication traffic. We can see quickly see shell module traffic between two\nhosts with a root level command prompt returned in the data field.\n\n\n-----\n\n### Viewing Parameter Data\n\n\n-----\n\nThe rest of the dashboard displays a few parameters for various modules and actions. The\ntunnel local connection and tunnel remote connection panes above show tunnel information\nused by Drovorub's tunnel module.\n\n\n-----\n\nThe local and remote path fields show information on what files were requested and where\nthe files moved. In this case, the /etc/passwd file moved to /tmp/passwd.\n\n## We Want To Hear From You\n\nIf you find this tool useful, need help or want to contribute, please let us know! You can reach\n[us on our website or](https://insaneforensics.com/) [LinkedIn.](https://www.linkedin.com/company/insane-forensics/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-23 - Dispatches from Drovorub- Network Threat Hunting for Russia GRU GTsSS' Malware at Scale.pdf"
    ],
    "report_names": [
        "2020-08-23 - Dispatches from Drovorub- Network Threat Hunting for Russia GRU GTsSS' Malware at Scale.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536261,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1653707557,
    "ts_modification_date": 1653707557,
    "files": {
        "pdf": "https://archive.orkl.eu/4048379da667a34adbc097aa6d0de17bb311d407.pdf",
        "text": "https://archive.orkl.eu/4048379da667a34adbc097aa6d0de17bb311d407.txt",
        "img": "https://archive.orkl.eu/4048379da667a34adbc097aa6d0de17bb311d407.jpg"
    }
}