{
    "id": "88af3111-63cc-44c9-b925-9f628924478b",
    "created_at": "2023-01-12T15:07:46.872783Z",
    "updated_at": "2025-03-27T02:09:29.763576Z",
    "deleted_at": null,
    "sha1_hash": "aa53fd85f151bd9df8ab907a21a65f5521b91644",
    "title": "2019-10-21 - Gustuff return, new features for victims",
    "authors": "",
    "file_creation_date": "2022-05-29T01:10:39Z",
    "file_modification_date": "2022-05-29T01:10:39Z",
    "file_size": 1441395,
    "plain_text": "# Gustuff return, new features for victims\n\n**blog.talosintelligence.com/2019/10/gustuffv2.html**\n\nBy [Vitor Ventura with contributions from Chris Neal.](https://twitter.com/_vventura)\n\n## Executive summary\n\nThe Gustuff banking trojan is back with new features, months after initially appearing\n\n\n-----\n\n[targeting financial institutions in Australia. Cisco Talos first reported on Gustuff in April. Soon](https://blog.talosintelligence.com/2019/04/gustuff-targets-australia.html)\nafter, the actors behind Gustuff started by changing the distribution hosts and later disabled\nits command and control (C2) infrastructure. The actor retained control of their malware\nsince there is a secondary admin channel based on SMS.\n\nThe latest version of Gustuff no longer contains hardcoded package names, which\ndramatically lowers the static footprint when compared to previous versions. On the\ncapability side, the addition of a \"poor man scripting engine\" based on JavaScript provides\nthe operator with the ability to execute scripts while using its own internal commands backed\nby the power of JavaScript language. This is something that is very innovative in the Android\nmalware space.\n\nThe first version of Gustuff that we analyzed was clearly based on Marcher, another banking\ntrojan that's been active for several years. Now, Gustuff has lost some similarities from\nMarcher, displaying changes in its methodology after infection..\n\nToday, Gustuff still relies primarily on malicious SMS messages to infect users, mainly\ntargeting users in Australia. Although Gustuff has evolved, the best defense remains token[based two-factor authentication, such as Cisco Duo, combined with security awareness and](https://www.cisco.com/c/en/us/products/security/adaptive-multi-factor-authentication.html)\nthe use of only official app stores.\n\n## Campaigns\n\nAfter Talos' initial report, the Gustuff operators changed their deployment redirections. When\nthose were blocklisted, the actors eventually disabled the C2, but they never totally stopped\noperations. Several samples were still around, but the hardcoded C2 was not available. A\nnew campaign was detected around June 2019, there were no significant changes the\nmalware. The campaign was using Instagram, rather than Facebook, to lure users into\n\n\n-----\n\ndownloading and installing malware.\n\nDomain hits in June\n\nThe Instagram-related domains are used for the initial infection, using the exact same\nmethod of operation as before.\n\nBut a new campaign spun up at the beginning of this month, this time with an updated\nversion of the malware. Just like in the previous version, any target that would be of no use\nas a potential target is still used to send propagation SMS messages. Each target is\nrequested to send SMSs at a rate of 300 per hour. Even though the rate will be limited to the\nmobile plan of each target, this is an aggressive ask.\n\nDomain hits in October\n\n\n-----\n\nThis method of propagation has a low footprint, since it uses SMS alone, but it doesn't seem\nto be particularly effective, given the low number of hits we've seen on the malware-hosting\ndomains.\n\nTargeted applications\n\nJust as before, this campaign mainly targets Australian banks and digital currency wallets.\nThis new version seems to target hiring sites' mobile apps.\n\nOne of Gustuff's capabilities is the dynamic loading of webviews. It can receive a command\nto create a webview targeting specific domains, while fetching the necessary injections from\na remote server.\n\n\n-----\n\nRequest                                   Result\nDuring our investigation, we received a command from the C2 to target the Australian\nGovernment Portal that hosts several public services, such as taxes and social security. The\ncommand was issued before the local injections were loaded (using the changearchive\ncommand). The injections were loaded from one of the C2 infrastructure servers. This\ncommand is not part of the standard activation cycle and was not part of the injections\nloaded by the version we analyzed in April.\n\nThis represents a change for the actor, who now appears to be targeting credentials used on\nthe official Australian government's web portal.\n\n## Technical analysis\n\nThis new version of Gustuff seems to be another step in its planned evolution. This malware\nis still deployed using the same packer, but\n\nthere are several changes in the activity cycle, which take advantage of functionalities which\neither where already there or where being prepared. One of the changes in the behaviour is\nthe state persistency across installations.\n\nID file\n\nDuring the activation process, the malware attempts to create a file called \"uu.dd\" in the\nexternal storage. If the file exists, it will read the UUID value stored inside it that will be used\nas an ID for the C2. When this happens, the malware won't go through all the activation\n\n\n-----\n\nprocess. Instead, it will receive commands from the C2 immediately. This file already existed\nin previous versions. However, the behaviour described above was never observed.\n\nThe main API follows the same philosophy. Gustuff pings the C2 at a predetermined interval,\nwhich will either reply with an \"ok\" or it will issue the command to be executed.\n\nThe targeted applications are no longer hardcoded in the sample. They are now provided to\nthe malware during the activation cycle using the command \"checkApps.\" This command\nalready existed on the previous version, but its usage during the activation cycle was not\nmandatory.\n\ncheckApps Command\n\nThe list of anti-virus/anti-malware software that Gustuff blocks as a self-defense mechanism\n\n\n-----\n\nis now also loaded during the activation cycle.\n\nExample of applications is blocks (not full list)\n\nThese changes in the Gustuff activation cycle indicate that the actor decided to lower the\nmalware static analysis footprint by removing the hard-coded lists. Both commands already\nexisted in the communication protocol and could have been used in runtime.\n\n\n-----\n\nCommand                                          Result\n\nDuring the activation cycle, the malware now asks the user to update their credit card\ninformation. The difference is that it does not immediately show a panel for the user to\nprovide the information. Instead, it will wait for the user to do it and — leveraging the Android\nAccessibility API — will harvest it. This method of luring the victim to give up their credit card\ninformation is less obvious, increasing the chances of success, even if it takes longer.\n\nThe communication protocol now has a secondary command execution control. Each\ncommand is issued with a unique ID, which is then used by Gustuff to report on the\ncommand execution state.\n\nCommand execution control\n\n\n-----\n\nThis allows the malicious actor to know exactly in which state the execution is, while before,\nit would only know if the command was received and its result. This new control mechanism\nalso generated the asynchronous command capability. The malware operator can now issue\nasynchronous commands that will receive feedback on its execution while performing other\ntasks — \"uploadAllPhotos\" and \"uploadFile\" commands are two of such commands.\n\nWith these changes, the malicious actor is obtaining better control over the malware while\nreducing its footprint.\n\nThis version of Gustuff has substantial changes in the way it interacts with the device. The\ncommands related to the socks server/proxy have been removed, as have all code related to\nits operation. This functionality allowed the malicious operator to access the device and\nperform actions on the device's UI. We believe this is how the malicious actor would perform\nits malicious activities. We believe that after collecting the credentials, using the webviews,\nthe actor would use this connection to interactively perform actions on the banking\napplications.\n\nThis functionality is now performed using the command \"interactive,\" which will use the\naccessibility API to interact with the UI of the banking applications. This method is less\n\"noisy\" on the network, since it takes advantage of the C2 connection, rather than creating\nnew connections.\n\nThe command \"script\" is also new. This is a very simple command with huge potential.\nGustuff starts a WebChromeClient with JavaScript enabled. Afterward, it adds a JavaScript\ninterface to the webview, which will allow the execution of methods defined in the malware\ncode.\n\n\n-----\n\nJavaScript scripting\n\nBy default, the WebView object already has access to the filesystem, which is not an\nadditional security risk in this context, allows the operator perform all kinds of scripts to\nautomate its tasks, especially when the script also has access to commands from the\napplication.\n\n## Conclusion\n\nThis is an evolving threat, and the actor behind it seems to want to press on, no matter the\nlevel of coverage this campaign gets. Instead, they changed the malware code to have a\nlower detection footprint on static analysis, especially after being unpacked. Although there\nare no changes in the way it conducts the campaign, Gustuff still changed the way it uses\nthe malware to perform its fraudulent activities. The main target continues to be banking and\ncryptocurrency wallets. However, based on the apps list and code changes, it is safe to\nassume that the actor behind it is looking for other uses of the malware.\n\n## Coverage\n\n**Snort**\n\n\n-----\n\nSID: 51908-51922\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\n\nsuited to prevent the execution of the malware used by these threat actors. Exploit\nPrevention present within AMP is designed to protect customers from unknown attacks such\nas this automatically.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), and Meraki MX can detect malicious activity](https://meraki.cisco.com/products/appliances)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\n IP\n\n88.99.174[.]142\n88.99.175[.]152\n\n\n-----\n\n88.99.170[.]43\n88.99.170[.]141\n78.46.201[.]36\n88.99.174[.]140\n\n### Domains\n\ninstagram-shared[.]pw\n\ninstagram-shared[.]store\n\ninstagram-shared[.]info\n\ninstagram-share[.]com\n\nintagram-share[.]com\n\ninstagram-shared[.]net\n\ninstagram-shared[.]com\n\nvideo-hd33[.]site\n\nvideo-hd30[.]site\n\nvideo-hd29[.]site\n\nvideo-hd24[.]site\n\nvideo-hd20[.]site\n\nvideo-hd18[.]site\n\nvideo-hd17[.]site\n\nhd-video5[.]site\n\nhd-video4[.]site\n\nvideo-hosting[.]site\n\nvideo-hd1[.]site\n\nvideo-hd[.]site\n\nhd-video1[.]site\n\nhomevideo641a[.]cf\n\nhomevideo651a[.]cf\n\nhomevideo5-23b[.]ml\n\nhomevideo631a[.]cf\n\nhomevideo611a[.]cf\n\nhomevideo4-23b[.]ml\n\nhomevideo641a[.]ga\n\nhomevideo3-23b[.]ml\n\nhomevideo54-1a[.]ml\n\nvideohosting32-e[.]cf\n\nvideohosting23c[.]cf\n\nvideohosting62-b[.]tk\n\n### Hashes\n\n\n-----\n\n5981f8ec5b35f3891022f1f1cdbf092c56a9b0ac8acbcd20810cc22e7efb5e0b SexyJassica.apk\n03d1a55ce6879d79239db32c2c8e83c4a3e10cb9123d513ce7fd04defb971886 gscptzorx.jar\n3027fbd59b8dd25dcabd21800d8e8ab3222a1ae3e2d268857def4311bb01ea2e gscptzorx.dex\nb13e6d70b07d6127d803d2374ebfb1e66a3b4cfd865cc2eb0e45455401be527e - flash\n65a7d4f9b3549198b008a089d0c8feb30c5409efc52e8a496f503fa262a6e922 - flash2\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-21 - Gustuff return, new features for victims.pdf"
    ],
    "report_names": [
        "2019-10-21 - Gustuff return, new features for victims.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536066,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653786639,
    "ts_modification_date": 1653786639,
    "files": {
        "pdf": "https://archive.orkl.eu/aa53fd85f151bd9df8ab907a21a65f5521b91644.pdf",
        "text": "https://archive.orkl.eu/aa53fd85f151bd9df8ab907a21a65f5521b91644.txt",
        "img": "https://archive.orkl.eu/aa53fd85f151bd9df8ab907a21a65f5521b91644.jpg"
    }
}