{
    "id": "88c18557-6e44-491f-b645-d10f7b61161d",
    "created_at": "2023-01-12T15:04:22.354428Z",
    "updated_at": "2025-03-27T02:14:13.690238Z",
    "deleted_at": null,
    "sha1_hash": "5e70a86527e85d8be670d70a1cb8a99c9da71d6b",
    "title": "2022-06-15 - Attack Graph Emulating the Conti Ransomware Team’s Behaviors",
    "authors": "",
    "file_creation_date": "2022-07-02T23:21:52Z",
    "file_modification_date": "2022-07-02T23:21:52Z",
    "file_size": 1398044,
    "plain_text": "# Attack Graph Emulating the Conti Ransomware Team’s Behaviors\n\n**[attackiq.com/2022/06/15/attack-graph-emulating-the-conti-ransomware-teams-behaviors/](https://attackiq.com/2022/06/15/attack-graph-emulating-the-conti-ransomware-teams-behaviors/)**\n\nJune 16, 2022\n\n**_Sectors targeted: healthcare; indiscriminate_**\n\nModern cybercriminal syndicates are complex organizations. They are often comprised of\nmerged groups, some have subsidiary organizations within them, they perform a diverse set\nof operations, and, in the case of Russia-based cybercriminals, often maintain a shadowy\naffiliation with the Russian government’s intelligence services. Since April 2017, the Russianaligned Conti ransomware-as-a-service (RaaS) operation has been one of the most\naggressive and successful ransomware operations, compromising and extorting over 1,000\n[victims with payouts exceeding $150-180 million USD according to the FBI as of January](https://www.state.gov/reward-offers-for-information-to-bring-conti-ransomware-variant-co-conspirators-to-justice/#:~:text=The%20FBI%20estimates%20that%20as,strain%20of%20ransomware%20ever%20documented.)\n2022, leading them to deem it the costliest ransomware strain ever documented. Other\nsources, however, put their take closer to $2.7B USD, depending on crypto trading price\nvolatility at various times and number of known wallets counted.\n\nOn May 19, 2022, the Conti operation officially disbanded, taking down key infrastructure\nand informing their team leaders that the brand no longer existed. There were indications of\na possible breakup beginning late 2021 after Conti’s acquisition of the TrickBot malware and\noperation team, the plans to swap TrickBot with the stealthier BazarBackdoor malware, and\nthen the ransoming of the San Francisco 49’ers, publicly confirmed hours before the U.S.\nNFL Superbowl on February 13, 2022, but using the smaller BlackByte ransomware\ngroup [as a shell to publicly process the breach on their behalf. Some of their former](https://www.advintel.io/post/hydra-with-three-heads-blackbyte-the-future-of-ransomware-subsidiary-groups)\n[members have already migrated to these smaller ransomware groups](https://thehackernews.com/2022/05/conti-ransomware-gang-shut-down-after.html)\n[like Karakurt and](https://www.cisa.gov/uscert/ncas/alerts/aa22-152a) [BlackByte.](https://unit42.paloaltonetworks.com/blackbyte-ransomware/)\n\nDuring its run, the Conti operation experienced a total of three revenge-based leaks of\nvarious combinations of source code, chat logs and technical manuals from insiders, with the\nlast leak entangled in geopolitics surrounding Russia’s invasion of Ukraine. The second\nleak of source code, tools, post-compromise technical manuals and training manuals on\nAugust 5, 2021, is the one on which AttackIQ’s new attack graph is based due to the fidelity\nof information available from that leak, particularly in the post-compromise technical manuals\nused by the ransomware operators. This attack graph emulates the actor’s full attack life\ncycle to help customers validate their security posture against similar attacks.\n\nDespite its break-up, Conti’s successful post-compromise tactics, techniques, and\nprocedures (TTPs) employed by the group’s operators will live on as these criminal hackers\nsplinter and join new groups, taking their same skills with them and making it vital that\norganizations continue to be prepared to deal with intrusions using these playbooks despite\n\n\n-----\n\ninevitable minor variations. Validating your security program performance against this type of\nattack is crucial in reducing risk by increasing resilience. By using this new attack graph in\nthe AttackIQ Security Optimization Platform, security teams will be able to:\n\n1. Evaluate security control performance against attacks using techniques that have had\n\nsignificant real-world impact.\n2. Assess security posture against the likely tactics used by Conti’s splinter cell groups.\n3. Continuously validate detection and prevention pipelines against activity that leads to\n\ndestructive actions.\n\n**Attack Graph Emulation of Conti Techniques**\n\n\n-----\n\n_Figure 1 – Conti Attack Graph_\n\nConti ransomware operators would gain an initial foothold to victims from various initial\naccess brokers (IABs) such as FIN12. Typically, this would start from spear-phishing\ncampaigns that delivered TrickBot and IcedID. Our attack graph begins after the initial\naccess has been achieved and the Conti actors are about to take hands-on-keyboard control\nof the compromise.\n\n\n-----\n\nThe actors first steps are to explore and learn more information about the initial host that has\nbeen compromised. Conti runs a series of discovery techniques by using native system\ncommands to live off the land and try to not draw additional attention.\n\n_Figure 2 – Discovery_\n\n**[System Information Discovery (T1082): Execute native commands like “systeminfo” or](https://attack.mitre.org/techniques/T1082)**\n“lshw” to learn about the system confirmations.\n\n**[System Owner / User Discovery (T1033): Live off the land by running “whoami” and “users”](https://attack.mitre.org/techniques/T1033)**\nto gain details about the currently available accounts and permission groups.\n\n**[Account Discovery – Local Account (T1087.001): On Microsoft Windows hosts use the](https://attack.mitre.org/techniques/T1087/001/)**\n“net localgroup administrators” command to identify any local administrator accounts.\n\n**[System Network Configuration Discovery (T1016): Run built-in tools and commands to](https://attack.mitre.org/techniques/T1016/)**\nget routing, network adapter, network shares, and connected domain controller information.\n\n**[Remote System Discovery (T1018): Search for other domain computers using the “net](https://attack.mitre.org/techniques/T1018/)**\n[group” command. If the activity is prevented, downloading and leveraging the Adfind utility is](http://www.joeware.net/freetools/tools/adfind/index.htm)\nattempted. Due to licensing and distribution issues, the “Remote System Discovery Using\nAdFind” Scenario will need to be manually configured with a locally uploaded “AdFind”\n[binary. This binary can be found and downloaded here at the “Download” portion of the page.](http://www.joeware.net/freetools/tools/adfind/index.htm)\n\n**[Password Policy Discovery (T1201): Conti will want to understand the local and domain](https://attack.mitre.org/techniques/T1201/)**\npassword requirements to help validate potential stolen or harvested credentials.\n\n**[Network Share Discovery (T1135): The threat actors leverage the Invoke-ShareFinder](https://attack.mitre.org/techniques/T1135/)**\ncmdlet from [Veil-PowerView to identify remote network shares that could contain files of](https://github.com/darkoperator/Veil-PowerView/blob/master/PowerView/functions/Invoke-ShareFinder.ps1)\ninterest.\n\nAfter completing the discovery phase of their attack, Conti will move on to gaining access to\nmore credentials. They use a variety of techniques to gain not only other local accounts but\nremote and service accounts that will allow them to move laterally.\n\n\n-----\n\n_Figure 3 – Credential Access_\n\n**[Steal or Forge Kerberos Tickets – Kerberoasting (T1558.003): Kerberoasting allows an](https://attack.mitre.org/techniques/T1558/003/)**\nattacker to attempt to extract password hashes for accounts using their Service Principal\nName (SPN) ticket. The attack graph first tries using the [Invoke-Kerberoast PowerShell](https://powersploit.readthedocs.io/en/latest/Recon/Invoke-Kerberoast/)\n[cmdlet and if prevented tries using Rubeus.](https://github.com/GhostPack/Rubeus)\n\n**[OS Credential Dumping (T1003): Conti leveraged Mimikatz to dump credentials on](https://attack.mitre.org/techniques/T1003)**\nWindows hosts.\n\n**[OS Credential Dumping – LSASS Memory (T1003.001): The Local Security Authority](https://attack.mitre.org/techniques/T1003/001/)**\nSubsystem Service (LSASS) has credentials in its memory. The process address space is\ndumped to a minidump and then Mimikatz is used to extract credentials.\n\n**[OS Credential Dumping – DCSync (T1003.006): Mimikatz is able to impersonate a Domain](https://attack.mitre.org/techniques/T1003/006/)**\nController and request password with domain replication.\n\n**[Unsecured Credentials – Group Policy Preference (T1552.006): Group Policy Preference](https://attack.mitre.org/techniques/T1552/006/)**\nXML files contain encrypted credentials for creating local accounts or mapping network\ndrives. These files can be collected from domain connected computers and the credentials\nharvested for the local accounts.\n\n\n-----\n\nArmed with additional credentials, the Conti ransomware operators will begin moving laterally\nto identify and find additional targets of interest.\n\n_Figure 4 – Lateral Movement_\n\n**[Pass the Hash (T1550.002): Using the hashed credentials obtained in the previous attack](https://attack.mitre.org/techniques/T1550/002/)**\nphase, they can be used to authentication via NTLM to other enterprise resources.\n\n**[Exploitation of Remote Services (T1210): Using](https://attack.mitre.org/techniques/T1210/)** [ZeroLogon Conti can easily impersonate](https://www.trendmicro.com/en_us/what-is/zerologon.html)\nany domain computer and take control of the domain admin account when used against\nvulnerable domain controllers.\n\n**[Brute Force (T1110): When all else fails, attempt to brute login using RDP to remote](https://attack.mitre.org/techniques/T1110/)**\nsystems with a username and password dictionary.\n\nAfter gaining access to more of the victim’s network the actor is going to want to disable or\ncircumvent security controls to make future actions easier and harder to detect and prevent.\n\n\n-----\n\n_Figure 5 – Defense Evasion_\n\n**[Disable or Modify Tools (T1562.001): The actor uses PowerShell to disable Windows](https://attack.mitre.org/techniques/T1562/001/)**\nDefender.\n\n**[Disable or Modify System Firewall (T1562.004): The local host firewall is configured to](https://attack.mitre.org/techniques/T1562/004/)**\nallow for incoming RDP connections so the actors can move away from interacting with their\nbackdoor and begin using the native Windows functionality.\n\nConti will begin establishing alternative persistence mechanisms across many of the\ncompromised hosts to decrease the likelihood that the victim organization will be able to\nquickly remediate their access. The actor uses a variety of methods and tries alternatives\nuntil successful. These methods are used to maintain access to their backdoors or ensure\nthat the encryption process continues to run even after interruption.\n\n\n-----\n\n_Figure 6 – Persistence_\n\n**[Create Local Account (T1136): Conti will create a new account to side-step any enterprise](https://attack.mitre.org/techniques/T1136/)**\npassword resets for known legitimate accounts.\n\n**[Registry Run Keys (T1547.001): Windows has many registry keys that identify applications](https://attack.mitre.org/techniques/T1547/001/)**\nor commands to be run at startup.\n\n**[Scheduled Task / Job – At (T1053.002): The “at” command is used to create a scheduled](https://attack.mitre.org/techniques/T1053/002/)**\nthat can re-launch Conti’s malware periodically or after a restart.\n\n**[Windows Service (T1543.003): Conti creates new Windows services to re-launch their](https://attack.mitre.org/techniques/T1543/003/)**\nbackdoors after a restart.\n\n**[Event Triggered Execution – Accessibility Features (T1546.008): Set the debugger for](https://attack.mitre.org/techniques/T1546/008/)**\nthe Sticky Keys helper application to launch a command shell when a user accidentally hits\nthe shift key too many times in a row or if the accessibility feature has been enabled.\n\n**[Event Triggered Execution – AppInit DLLs (T1546.010): By creating an AppInitDLL entry](https://attack.mitre.org/techniques/T1546/010/)**\nin the registry, Conti ensures their malicious DLL file is loaded into every process as boot.\n\n**[Windows Management Instrumentation (T1047): WMI can be used to launch an](https://attack.mitre.org/techniques/T1047/)**\nexecutable or command when a common event consumer is trigger.\n\n**[Modify Authentication Process – Password Filter DLL (T1556.002): Microsoft allows for](https://attack.mitre.org/techniques/T1556/002/)**\npassword filters to be configured for domain and local accounts that enable stricter password\npolicies. By installing their own password filter Conti is able to receive the plain text\npasswords for accounts from the Local Security Authority (LSA).\n\n**[Winlogon Helper DLL (T1547.004): Conti configures registry keys that force malicious DLL](https://attack.mitre.org/techniques/T1547/004/)**\nfiles to be loaded with the Winlogon.exe process.\n\n**[Netsh Helper DLL (T1546.007): Netshell (netsh) is a command line tool that facilitates](https://attack.mitre.org/techniques/T1546/007/)**\ninteractions with a system’s network configurations. It can be configured via registry entries\nto load malicious DLL files every time “netsh.exe” is executed.\n\nAt this point Conti has everything they need to complete their goal and begin encrypting the\nhosts.\n\n\n-----\n\n_Figure 7 – Encryption_\n\n**[Ingress Tool Transfer (T1105): Download and save samples of the actor’s Conti](https://attack.mitre.org/techniques/T1105/)**\nransomware malware to disk.\n\n**[Data Encrypted for Impact (T1486): AttackIQ has replicated the functionality used by the](https://attack.mitre.org/techniques/T1486/)**\nConti ransomware to encrypt files on the targeted hosts. This includes the common file\nextensions and encryption methods utilized by the actor.\n\n**Detection and Mitigation Opportunities**\n\nWith so many different techniques being utilized by threat actors, it can be difficult to know\nwhich to prioritize for prevention and detection opportunities. AttackIQ recommends first\nfocusing on the following techniques emulated in the Conti attack graph before moving on to\nthe remaining techniques.\n\n**1. Ransomware Encryption. It should go without saying that as a last resort, preventing**\nyour systems and files from being encrypted should be your number one focus. Ensuring that\nyou have the layered endpoint defenses including Antivirus and EDR solutions is critical.\n\n**1A. Detection Process**\n\nRansomware attacks are best prevented and alerted by your EDR/AV Policies. Typically, a\nconfiguration for ransomware protection is presented and we strongly encourage that it is\nenabled in your security controls. There are three telling signs of ransomware activity in an\nenvironment that you could query for and possibly make preventative detections if your\nsecurity controls allow. Those three are deletion of shadow volumes, suspicious\n**amounts of exfiltrated data, and of course, wide set file encryption.**\n\n**Detecting deletion of shadow volumes:**\n\n**Via vssadmin.exe:**\n```\nProcess Name == (cmd.exe OR powershell.exe)\n\n```\n\n-----\n\n```\nCommand Line CONTAINS ( vssadmin AND Delete Shadows )\n\n```\n**Via vssadmin.exe:**\n```\nProcess Name == powershell.exe\nCommand Line == “Get-WmiObject Win32_Shadowcopy | ForEach-Object\n($_.Delete();)”\n\n```\n**Detecting suspicious Data Exfiltration:**\n\nDetecting exfiltration is well suited for IDS/IPS and DLP solutions. These products should be\nconfigured to identify sensitive files. If sensitive files, or a large amount of web traffic is sent\nto a rare external IP, it should be detected or prevented depending on security policies for the\nsecurity control. Historical NetFlow data logging can also bubble up hosts that are\nexperience uncommon peaks in outgoing traffic.\n\n**Detecting Ransomware-like File Encryption:**\n\nUtilizing an EDR or SIEM/SOAR product can help detect and prevent suspicious file\nencryption related to ransomware attacks. Utilizing these tools to look for excessive file\nmodifications (greater than 1000 on a system) within less than a minute of time is a good\nstarting indicator. To increase the fidelity a bit, you could include file modification file\nextension to popular ransomware extensions such as .conti, .Locky, .Ryuk, etc. If possible,\nwith a SOAR or preventative EDR platform, we recommend setting these detections to kill all\nprocesses involved in creating the alert as it will most likely stop the spread of the\nRansomware.\n\n**1b. Mitigation Policies**\n\n[MITRE recommends the following mitigations for Data Encrypted for Impact (T1486):](https://attack.mitre.org/techniques/T1486/)\n\n[M1040 – Behavior Protection on Endpoint](https://attack.mitre.org/mitigations/M1040/)\n[M1053 – Data Backup](https://attack.mitre.org/mitigations/M1053/)\n\n**2. Common Persistence Mechanisms**\n\n[Similar to our recommendation in the Karakurt Data Extortion blog, being able to stop an](https://attackiq.com/2022/06/03/attack-graph-response-to-us-cert-aa22-152a-karakurt-data-extortion-group/)\nactor from creating additional hooks into your environment is critical in ensuring that their\naccess can be fully removed during your initial remediation processes.\n\n[Focusing on the most common persistence mechanism like Windows Service (T1543.003),](https://attack.mitre.org/techniques/T1543/003/)\n[Registry Run Keys (T1547.001), and Scheduled Tasks (T1053.002) should be your first](https://attack.mitre.org/techniques/T1547/001/)\ntargets for prevention and detection.\n\n**2a. Detection Process**\n\n\n-----\n\n**Detecting Windows Services Persistence:**\n```\nProcess Name == (cmd.exe or powershell.exe)\nCommand Line CONTAINS ((‘sc’ or ‘sc.exe’) AND ‘create’ AND ‘binpath=”<path\nto trusted executable>”’ AND start=”auto”)\n\n```\n**Detecting Registry Run Keys Persistence:**\n\n```\nProcess Name == (cmd.exe or powershell.exe)\n\n```\n```\nUser NOT IN <list of expected reg.exe users>\n\n```\n\nCommand Line CONTAINS((reg or reg.exe) AND (“HKEY_CURRENT_USER” OR\n“KEY_CURRENT_MACHINE”) AND “\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\” AND\n(“run” OR “runonce”))\n\n**Detecting Scheduled Tasks Persistence:**\n```\nProcess Name == (cmd.exe OR powershell.exe)\nCommand Line CONTAINS (“schtasks” AND “/create” AND (“cmd” OR powershell”)\nAND (“.exe” OR “.bat”) AND “/ru system”)\n\n```\n**2b. Mitigation Policies**\n\nMITRE recommends the following mitigations for Create or Modify System Process:\n[Windows Service (T1543.003):](https://attack.mitre.org/techniques/T1543/003/)\n\n**Recommendations for mitigation of Boot or Logon Auto-start Execution: Registry Run**\n**[Keys/Startup Folder (T1547.001):](https://attack.mitre.org/techniques/T1547/001/)**\n\nIt is recommended that only administrators and end users with a specific need be able to run\nadministrative tools such as cmd.exe, powershell.exe, reg.exe, and regedit.exe. Limiting\nthese tools to only authorized users greatly reduce the chance of a compromised end user\nbeing able to modify the registry for persistence.\n\n[MITRE recommends the following mitigations for Scheduled Task/job: At (T1053.002):](https://attack.mitre.org/techniques/T1053/002/)\n\n**Multiple Native Discovery Commands**\n\nOne of the very first things that most actors will do when first gaining access to a\ncompromised host is use the native tools and commands available in the operating system to\nlearn more about the host and its connected network. By using built-in functional the actor\nwill blend in with legitimate user traffic. The trick is to look for the series of different discovery\ncommands being executed in short time windows.\n\n\n-----\n\nMultiple commands in time windows can be an initial suspicious indicator that an actor may\nhave an established a foot hold and can be used to increase the fidelity of future additional\nsuspicious activities that are observed from a single host.\n\n**3a. Detection Process**\n\nWith an EDR or SIEM product, you could easily detect when administrative commands are\nrun by non-authorized / expected users:\n```\nProcess name == (“cmd.exe” OR “powershell.exe”)\nUser NOT IN (<list of expected administrators and power users>)\n\n```\nCommand Line CONTAINS (“systeminfo” OR “whoami” OR “net users” or “net localgroup\nAdministrators” OR “route print” OR “ipconfig /all” OR “arp -a” OR “wmic ntdomain” OR “wmic\nnetuse” OR “wmic nicconfig” OR “Get-ADComputer” OR “net accounts” OR “InvokeShareFinder”)\n\n**3b. Mitigation Policies**\n\nIt is recommended that only administrators and end users with a specific need be able to run\nadministrative tools such as cmd, powershell, net, and wmic, systeminfo, arp, or route.\nLimiting these tools to only authorized users greatly reduces the chance of a compromised\nend user being able to enumerate system and environmental settings.\n\n**Conclusion**\n\nIn summary, this attack graph will evaluate security and incident response processes and\nsupport the improvement of your security control posture against an actor with focused\noperations to encrypt your systems and data. With data generated from continuous testing\nand use of this attack graph, you can focus your teams on achieving key security outcomes,\nadjust your security controls, and work to elevate your total security program effectiveness\nagainst a known and dangerous threat.\n\nAttackIQ stands at the ready to help security teams implement this attack graph and other\naspects of the AttackIQ Security Optimization Platform, including through our co-managed\n[security service, AttackIQ Vanguard.](https://attackiq.com/platform/attackiq-vanguard/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-15 - Attack Graph Emulating the Conti Ransomware Team’s Behaviors.pdf"
    ],
    "report_names": [
        "2022-06-15 - Attack Graph Emulating the Conti Ransomware Team’s Behaviors.pdf"
    ],
    "threat_actors": [
        {
            "id": "a2d3f35f-3b29-4509-bff5-af2638140d39",
            "created_at": "2022-10-25T16:07:23.633982Z",
            "updated_at": "2025-03-27T02:02:09.898653Z",
            "deleted_at": null,
            "main_name": "FIN12",
            "aliases": [],
            "source_name": "ETDA:FIN12",
            "tools": [
                "Agentemis",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "KEGTAP",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535862,
    "ts_updated_at": 1743041653,
    "ts_creation_date": 1656804112,
    "ts_modification_date": 1656804112,
    "files": {
        "pdf": "https://archive.orkl.eu/5e70a86527e85d8be670d70a1cb8a99c9da71d6b.pdf",
        "text": "https://archive.orkl.eu/5e70a86527e85d8be670d70a1cb8a99c9da71d6b.txt",
        "img": "https://archive.orkl.eu/5e70a86527e85d8be670d70a1cb8a99c9da71d6b.jpg"
    }
}