{
    "id": "88e1fdd6-4770-44c3-8bbd-69f93631a78b",
    "created_at": "2023-01-12T15:09:32.561524Z",
    "updated_at": "2025-03-27T02:05:20.027338Z",
    "deleted_at": null,
    "sha1_hash": "8791c6557b1b3bf3da7b85bbe5cc13e4e8f4fffa",
    "title": "2018-04-10 - ‘FakeUpdates’ campaign leverages multiple website platforms",
    "authors": "",
    "file_creation_date": "2022-05-28T19:21:19Z",
    "file_modification_date": "2022-05-28T19:21:19Z",
    "file_size": 1317119,
    "plain_text": "# ‘FakeUpdates’ campaign leverages multiple website platforms\n\n**[blog.malwarebytes.com/threat-analysis/2018/04/fakeupdates-campaign-leverages-multiple-website-platforms/](https://blog.malwarebytes.com/threat-analysis/2018/04/fakeupdates-campaign-leverages-multiple-website-platforms/)**\n\nJérôme Segura April 10, 2018\n\nA malware campaign which seems to have started at least since December 2017 has been\ngaining steam by enrolling a growing number of legitimate but compromised websites. Its\nmodus operandi relies on social engineering users with fake but convincing update\nnotifications.\n\nSimilar techniques were used by a group leveraging malvertising on high traffic websites\nsuch as Yahoo to distribute ad fraud malware. The patterns are also somewhat reminiscent\nof [EITest’s HoeflerText campaign where hacked websites are scrambled and offer a font for](https://blog.malwarebytes.com/cybercrime/2017/04/a-story-of-fonts-by-the-eitest-hoeflertext-campaign/)\ndownload. More recently, there has been a [campaign affecting Magento websites that also](https://blog.sucuri.net/2018/03/github-hosts-lokibot-infostealer.html)\npushes fake updates (for the Flash Player) which delivers the AZORult stealer by abusing\nGitHub for hosting.\n\nToday, we are looking at what we call the ‘FakeUpdates campaign’ and describing its\nintricate filtering and evasion techniques. One of the earliest examples we could find was\n[reported by BroadAnalysis on December 20, 2017. The update file is not an executable but](http://www.broadanalysis.com/2017/12/20/fake-flash-player-update-delivers-net-support-rat/)\nrather a script which is downloaded from DropBox, a legitimate file hosting service, as can be\nseen in the animation below.\n\n\n-----\n\n_Figure 1: A typical redirection to the ‘FakeUpdates’ scheme from a hacked site_\n\nThis campaign affects multiple Content Management Systems (CMS) in somewhat similar\nways. Several of the websites we checked were outdated and therefore vulnerable to\nmalicious code injection. It is possible that attackers used the same techniques to build their\ninventory of compromised sites but we do not have enough information to confirm this theory.\n\n## WordPress and Joomla\n\nBoth WordPress and Joomla sites that were hacked bear the same kind of injection within\ntheir CMS’ JavaScript files.\n\n\n-----\n\n_Figure 2: A Compromised WordPress site pushing a fake Google Chrome update_\n\n_Figure 3: A Compromised Joomla site pushing a fake Mozilla Firefox update_\n\nSome commonly injected files include the jquery.js and caption.js libraries where code is\ntypically appended and can be spotted by doing a comparison with a clean copy of the same\nfile.\n\n\n-----\n\n_Figure 4: Diffing a clean and suspicious copy of the same library_\n\nThe additional blurb of code is responsible for the next chain of events that loads the\nfraudulent layer onto the website you are visiting. The image below shows a beautified\nversion of the code injected in the CMS platforms, whose goal is to call the redirection URL:\n\n\n-----\n\n_Figure 5: Injected code responsible for the redirection_\n\nWe wrote a simple crawler to browse a list of sites and then parsed the results. We were able\nto identify several hundred compromised WordPress and Joomla websites even after a small\niteration through the list. Although we don’t have an exact number of sites that are affected,\nwe surmise that it is in the thousands.\n\n\n-----\n\n_Figure 6: A partial list of compromised sites_\n\n## Squarespace\n\nSquarespace is another popular Content Management System that is also affected by the\n[same campaign. This was pointed out by](https://twitter.com/Ring0x0/status/976613052606046208) [@Ring0x0 and we found a forum post dated](https://twitter.com/Ring0x0/)\nFebruary 28, where a Squarespace user is asking for help, saying “it basically redirected me\n_to a full page “your version of chrome needs updating“”._\n\n\n-----\n\n_Figure 7: A Squarespace user reporting that their sites was tampered with_\n\nSo I login to the admin panel and in the GIT HISTORY it shows that one of my users which\nhas never even logged in before, has sent an upload: site-bundle.js last week, along with\nsome other big list of files {sic}.\n\nWe dug deeper into these compromises and identified a slightly different redirection\nmechanism than the one used on WordPress or Joomla sites. With Squarespace, a blurb of\nJavaScript is injected directly into the site’s homepage instead.\n\n\n-----\n\n_Figure 8: Traffic showing a malicious redirection taking place on a Squarespace site_\n\nIt pulls a source file from query[.]network that in turn retrieves bundle.js from\n_boobahbaby[.]com:_\n\n_Figure 9: The injected code present in hacked Squarespace sites_\n\n_bundle.js contains the same script we described earlier that is used to call the redirection_\nURL:\n\n\n-----\n\n_Figure 10: The same redirection code used in WP and Joomla infections is used here_\n\nAccording to this [PublicWWW query, a little over 900 SquareSpace sites have been injected](https://publicwww.com/websites/%22%2Fjquery%3Ffrm%3Dscript%26se_referrer%22/)\nwith this malicious redirection code.\n\n_Figure 11: Identifying other hacked Squarespace sites using a string pattern_\n\n## Redirection URL and filtering\n\nAll CMSes trigger redirection URIs with similar patterns that eventually load the fraudulent\nupdate theme. Based on our tests, the URIs have identifiers that apply to a particular CMS;\nfor example cid=221 is associated with WordPress sites, while cid=208 with Joomla.\n\n\n-----\n\n```\nWordPress\ntrack.positiverefreshment[.]org/s_code.js?cid=221&v=8fdbe4223f0230a93678\ntrack.positiverefreshment.org/s_code.js?cid=225&v=0bbea7365fbb07c7acb3 \ntrack.amishbrand[.]com/s_code.js?cid=205&v=c40bfeff70a8e1abc00f \ntrack.amishbrand.com/s_code.js?cid=228&v=e8bfa92965d1d880bac2 \ntrack.amishbrand[.]com/s_code.js?cid=234&v=59f4ba6c3cd7f37abedc\ntrack.amishbrand[.]com/s_code.js?cid=237&v=7e3403034b8bf0ac23c6\nJoomla\nconnect.clevelandskin[.]com/s_code.js?cid=208&v=e1acdea1ea51b0035267\ntrack.positiverefreshment[.]org/s_code.js?cid=220&v=24eca7c911f5e102e2ba \ntrack.amishbrand[.]com/s_code.js?cid=226&v=4d25aa10a99a45509fa2\nSquareSpace\ntrack.amishbrand[.]com/s_code.js?cid=232&v=47acc84c33bf85c5496d \nOpen Journal Systems\ntrack.positiverefreshment[.]org/s_code.js?cid=223&v=7124cc38a60ff6cb920d\nUnknown CMS\ntrack.positiverefreshment[.]org/s_code.js?cid=211&v=7c6b1d9ec5023db2b7d9 \ntrack.positiverefreshment[.]org/s_code.js?cid=227&v=a414ad4ad38395fc3c3b\n\n```\nThere are other interesting artifacts on this infrastructure, such as an ad rotator:\n```\ntrack.positiverefreshment.net:81/adrotator/banner.js?cid=100\n\n```\nBut if we focus on the redirection code itself, we notice that potential victims are fingerprinted\nand the ultimate redirection to the FakeUpdates template is conditional, in particular with only\none hit per single IP address. The last JavaScript is responsible for creating the iframe URL\nto that next sequence.\n\n\n-----\n\n_Figure 12: Fingerprinting, cookie verification and iframe redirection are performed here_\n\n## FakeUpdates theme\n\nThere are templates for the Chrome, Firefox and Internet Explorer browsers, the latter\ngetting a bogus Flash Player update instead.\n\n_Figure 13: Attackers are targeting browsers with professional looking templates_\n\nThe decoy pages are hosted on compromised hosts via sub-domains using URIs with very\nshort life spans. Some of those domains have a live (and legitimate website) whereas others\nare simply parked:\n\n\n-----\n\nLegitimate (shadowed) domain:\n```\nhttps://pask.spgolfshoes[.]com/95b40f61578eed04ff464c5055990abbupdate{trimmed}\n\n```\n_Figure 14: This property’s credentials have most likely been stolen and used to register a_\n_malicious subdomain_\n\nParked domain:\n```\nhttp://zlsk.redneckonize[.]com/wordpress/article.php?f=445327&g={trimmed}\n\n```\n\n-----\n\n_Figure 15: Parked domains can hide ulterior motives_\n\n## Final infection chain and payloads\n\nThe infection starts with the fake update disguised as a JavaScript file retrieved from the\nDropbox file hosting service. The link to Dropbox, which is updated at regular intervals, is\nobfuscated inside of the the first web session belonging to the fake theme.\n\n_Figure 16: the fileURL variable contains the Dropbox URL_\n\nThis JavaScript is heavily obfuscated to make static analysis very difficult and also to hide\nsome crucial fingerprinting that is designed to evade virtual machines and sandboxes.\n\n\n-----\n\n_Figure 17: The malicious JavaScript downloaded from DropBox_\n\n[According to this very good and detailed analysis of the JS file, this is because step2 of the](https://www.fireeye.com/blog/threat-research/2018/04/fake-software-update-abuses-netsupport-remote-access-tool.html)\nvictim’s profiling uses WScript.Network and WMI to collect system information (BIOS,\nmanufacturer, architecture, MAC address, processes, etc) and eventually makes the decision\nto continue with the payload or end the script without delivering it.\n\nA failed infection will only contain 2 callbacks to the C2 server:\n\n\n-----\n\n_Figure 18: A host that is not a genuine machine was detected and infection aborted_\n\nWhile a successful infection will contain 3 callbacks to the C2 server (including the payload):\n\n\n-----\n\n_Figure 19: When all checks pass, the user is served the payload_\n\nThe encoded payload stream is decoded by wscript.exe and a malicious binary\n(Chrome_71.1.43.exe in this case), dropped in the %temp% folder. That file was digitally\nsigned and also employed various evasion techniques (such as an immediate reboot) to\ndefeat sandboxes.\n\n\n-----\n\n_Figure 20: A digitally signed file is no guarantee for safety_\n\nUpon examination, we determined that this is the Chtonic banking malware, a variant of\nZeusVM. Once the system has restarted, Chtonic retrieves a hefty configuration file\nfrom 94.100.18[.]6/3.bin.\n\nIn a second replay attempt, we got the NetSupport Remote Access Tool, a commercial RAT\n[instead. Its installation and configuration were already well covered in this blog. Once again,](https://www.fireeye.com/blog/threat-research/2018/04/fake-software-update-abuses-netsupport-remote-access-tool.html)\nwe noticed the heavy use of obfuscation throughout the delivery of this program that can be\nused for malicious purposes (file transfer, remote Desktop, etc.).\n\n\n-----\n\n_Figure 21: Traffic from the RAT infection, showing its backend server_\n\n## Conclusion\n\nThis campaign relies on a delivery mechanism that leverages social engineering and abuses\na legitimate file hosting service. The ‘bait’ file consists of a script rather than a malicious\nexecutable, giving the attackers the flexibility to develop interesting obfuscation and\nfingerprinting techniques.\n\nCompromised websites were abused to not only redirect users but also to host the fake\nupdates scheme, making their owners unwitting participants in a malware campaign. This is\nwhy it is so important to keep Content Management Systems up to date, as well as use good\nsecurity hygiene when it comes to authentication.\n\n\n-----\n\n[Malwarebytes blocks the domains and servers used in this attack, as well as the final](https://www.malwarebytes.com/)\npayload.\n\n## Indicators of compromise\n\n**Redirection infrastructure:**\n```\n23.152.0[.]118\n84.200.84[.]236\n185.243.112[.]38\n185.77.129.11\neventsbysteph[.]com\nquery[.]network\nconnect.clevelandskin[.]net\nconnect.clevelandskin[.]org\ntrack.amishbrand[.]com\ntrack.positiverefreshment[.]org\nlink.easycounter210[.]com\nclick.clickanalytics208[.]com\n\n```\n**C2**\n```\nmy.gobiox[.]com\nlogin3.kimbrelelectric[.]com (thanks @nao_sec)\n\n```\n**Dropped binaries:**\n\n**Chtonic**\n```\n6f3b0068793b277f1d948e11fe1a1d1c1aa78600712ec91cd0c0e83ed2f4cf1f\n94.100.18[.]6/3.bin\n\n```\n**NetSupport RAT**\n```\n4d24b359176389301c14a92607b5c26b8490c41e7e3a2abbc87510d1376f4a87\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-04-10 - ‘FakeUpdates’ campaign leverages multiple website platforms.pdf"
    ],
    "report_names": [
        "2018-04-10 - ‘FakeUpdates’ campaign leverages multiple website platforms.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536172,
    "ts_updated_at": 1743041120,
    "ts_creation_date": 1653765679,
    "ts_modification_date": 1653765679,
    "files": {
        "pdf": "https://archive.orkl.eu/8791c6557b1b3bf3da7b85bbe5cc13e4e8f4fffa.pdf",
        "text": "https://archive.orkl.eu/8791c6557b1b3bf3da7b85bbe5cc13e4e8f4fffa.txt",
        "img": "https://archive.orkl.eu/8791c6557b1b3bf3da7b85bbe5cc13e4e8f4fffa.jpg"
    }
}