{
    "id": "88eeb7d8-bc2a-488e-863b-09fc90770a09",
    "created_at": "2023-01-12T15:06:16.243483Z",
    "updated_at": "2025-03-27T02:16:26.252914Z",
    "deleted_at": null,
    "sha1_hash": "cf2dcec98c0011fbe5aa0ba6fab58c45b02cbd99",
    "title": "2020-07-22 - Lockscreen Ransomware Phishing Leads To Google Play Card Scam",
    "authors": "",
    "file_creation_date": "2022-05-28T17:11:01Z",
    "file_modification_date": "2022-05-28T17:11:01Z",
    "file_size": 1643049,
    "plain_text": "# Lockscreen Ransomware Phishing Leads To Google Play Card Scam\n\n**trustwave.com/en-us/resources/blogs/spiderlabs-blog/lockscreen-ransomware-phishing-leads-to-google-play-card-**\nscam/\n\nLoading...\n\nBlogs & Stories\n\n## SpiderLabs Blog\n\nAttracting more than a half-million annual readers, this is the security community's go-to\ndestination for technical breakdowns of the latest threats, critical vulnerability disclosures\nand cutting-edge research.\n\nEmail scammers always seem to invent new ways of trickery to gain cash from their victims.\nWe recently came across a case where the scammer reused some existing scripts to phish\nand scam - copy and paste style. With a bit of modification, the script works like\nransomware, without the hassle of having to compile a portable executable. This screen\nlocker ransomware variant locks the user's screen and demand a ransom rather than the\ntypical file encryption style ransomware. The ransom demanded in this case was in the form\nof Google Play Cards.\n\n\n-----\n\nBelow is an overview of the process from the email hyperlinks, file downloads, to how these\nfiles are installed and work in the victim’s computer.\n\n_Figure 1. From Scripts to Scams_\n\nThe scam starts with an email. Recently, have seen an email spam campaign pretending to\nbe an important update for your computer. The email \"From:\" address is:\nhelp@supportwindows followed by some digits.\n\nIn the first email sample, the hyperlink provided will directly download a batch file,\n**WindowsUpdate.bat**\n\n\n-----\n\n_Figure 2. An email written in French, and translated in English, asking the user to update its_\n_computer._\n\nIn the second email sample, the hyperlink uses a short URL service that leads to a\nWordPress website.\n\n_Figure 3. Emails implying that a Windows OS License is expired._\n\n\n-----\n\nShould the victim click the hyperlink provided by the second email sample will redirect to the\nWordPress web page below:\n\n_Figure 4. The WordPress website posing as Windows Support._\n\nClicking the ‘Microsoft’ image will download WindowsUpdate.bat and hitting the ‘Download\nNow’ button downloads the key.rar archive file. Should the victim decide to open the\ndownloaded archive file, they will see two script files. Files named as License1.bat and\n**License2.vbs.**\n\n\n-----\n\n_Figure 5. The keys to scamming_\n\nIn the first email sample, the hyperlink provided will download the WindowsUpdate.bat.\nThe file in the archive, License1.bat is the same as the WindowsUpdate.bat. This is a\nmodified script from an old one that was uploaded in pastebin.com way back in 2017. The\n[script can be viewed here](https://pastebin.com/e4nctHsV)\n\n_Figure 6. Side by side comparison of the modified(Left Pane) and the original(Right Pane)_\n_script_\n\nThe batch file serves as the installation file. Running this command batch file will drop\nanother VBS and two batch files in the User Startup Folder. These scripts will automatically\nbe executed when the computer starts.\n\n\n-----\n\n_Figure 7. Dropping files in User Startup folder yields the auto-run technique_\n\nThe file from archive License2.vbs and the created file startup1.vbs are the same. This\nscript will open a Microsoft Internet Explorer browser on full screen mode, hiding the\naddress, menu and status bar and navigate to hxxp://whoawareness[.]com/?page_id=93.\n\n_Figure 8. It is like pressing F11 button in the keyboard. That is the trick._\n\nEither the computer boots up and startup1.vbs is triggered, or License2.vbs is executed\nfrom the key.rar archive. The victim is now tricked into thinking that their computer is\n‘blocked’.\n\n\n-----\n\n_Figure 9. Works a bit like a ransom note._\n\nAnd a notification appears:\n\n_Figure 10. Message box appears, contact email provided._\n\nFurther down, the web page asks you to purchase a Google Play Store Card worth 100\nEuros to activate a new license for your computer and provides a video on how to scratch\noff this card. The scammers list and provide a cellphone screenshot of stores where you\ncan buy these cards.\n\n\n-----\n\n_Figure 11. How to scratch the purchased card._\n\n\n-----\n\n_Figure 12. List of retail stores where you can purchase the Google Play Card._\n\nFinally, the scammers ask you to fill out the form with your personal information together\nwith the Google Play Card Code.\n\n\n-----\n\n_Figure 13. Phishing and Scam_\n\nWith a Google Play balance, you can buy Apps, Books, Movies, Music, Newsstand, and\nSubscriptions that are offered in Google Play Store. The other remaining two files created\nin the User Startup Folder:\n\n**startup1.bat – Since this script was reused and modified, it is intended to change each**\ninternet browsers home page for Microsoft Internet Explorer and Mozilla Firefox by\nmodifying the registry. Both of the URLs listed in the script were already inaccessible at the\ntime of analysis.\n\n**startup2.bat – Terminates Windows Explorer.**\n\n\n-----\n\n_Figure 14. startup1.bat file adds new registries to change the home page following Internet_\n_Browser Programs_\n\n_Figure 15. startup2.bat file terminates the process Windows Explorer.exe_\n\nAs we were going to publish this, we noticed the WordPress site at whoawareness.com had\nchanged. It is now using scare tactics, especially noticeable when your audio volume is on\nhigh. It has an image of the detected threats in your machine, where the window structure is\nevidently from Windows XP. Then there are two message boxes, a fake system alert, and\nthe other a phishing form that asks you to key in your username and password.\n\n\n-----\n\n_Figure 16. Another lockscreen image replaced the landing site from the tinyurl hosted_\n_redirection._\n\n_Figure 17. The alarming audio sound with voice over informing that your machine is infected_\n\n**Mitigation and Clean Up Procedures**\n\nFollow the steps below to clean up the process running, all dropped files, and any modified\nregistry entries.\n\n1. Open Task Manager, lookup for the process ‘wscript.exe’, right click mouse button,\nselect ‘End Task’\n\n2. Press F11 in the keyboard. This will exit the Full Screen mode of the IE Browser, then\nclose the Browser.\n\n3. Go to Run command or press Windows key + R Key at the same time, type\n‘shell:startup’. This will show the User Startup folder. Delete the following files listed below:\n\n\n-----\n\n4. Open Registry Editor.\n\nFind the following keys in their respective location:\n\nDelete these keys and subkeys tied to it.\n\nFind the following key in their respective location:\n\nYou can change the value of the key Start Page from your original home page or simply\ndelete this subkey\n\n\n-----\n\n5. If you have Mozilla Firefox browser installed in your system, navigate to the folder\nlocation below and open the pref.js file in a Text Editor.\n\nIn the Text Editor lookup this line and delete it, then save the file:\n\nRemember, updates for your computer never really arrive from email notifications, they just\npop-up around your task bar waiting for you to click, install and restart. And if your Microsoft\nWindows Activation License is invalid, a text will appear on the right-hand bottom of your\ndesktop window. Simply avoid or ignore these amateurish unsolicited emails that alert you\nthat you need an update.\n\n### IOCs\n\n**URLS:**\n\nhxxp://whoawareness[.]com\n\nhxxp://tinyurl[.]com/whoawareness\n\nhxxp://whoawareness[.]com/?page_id=93\n\nhxxp://whoawareness[.]com/WindowsUpdate.bat\n\nhxxp://whoawareness[.]com/?smd_process_download=1&download_id=82\n\n**Files/Scripts:**\n\nFileName: key.rar\n\nMD5: fb2efa0a781d7911556737768814f4ee\n\nSHA1: 2ddb6a50937364386ddeffcf5bd2dfb53cf49d5\n\nFileName: License2.vbs / startup1.vbs\n\nMD5: 3df65471e9741d55084780b92719834f\n\nSHA1: d32b802d542138ddb5f812d06077215dd82cbd98\n\n\n-----\n\nFileName: License1.bat / WindowsUpdate.bat\nMD5: 955bd1ee3b36e899fa441aaa29c7f985\nSHA1: d5e30fbc7f9e7976be8c77682c0ae15fd08ad8dc\n\nFileName: startup1.bat\nMD5: f76e9acabae09d12c1221e56603c754d\nSHA1: 094007daaa2854bf22f6fd2750caa33ce97fbcc3\n\nFileName: startup2.bat\nMD5: 2b7ff12f582c1137396461671dc229f7\nSHA1: 9558fde1521e01f61fab82b51ce5be3162917e61\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-22 - Lockscreen Ransomware Phishing Leads To Google Play Card Scam.pdf"
    ],
    "report_names": [
        "2020-07-22 - Lockscreen Ransomware Phishing Leads To Google Play Card Scam.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535976,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653757861,
    "ts_modification_date": 1653757861,
    "files": {
        "pdf": "https://archive.orkl.eu/cf2dcec98c0011fbe5aa0ba6fab58c45b02cbd99.pdf",
        "text": "https://archive.orkl.eu/cf2dcec98c0011fbe5aa0ba6fab58c45b02cbd99.txt",
        "img": "https://archive.orkl.eu/cf2dcec98c0011fbe5aa0ba6fab58c45b02cbd99.jpg"
    }
}