{
    "id": "8912396f-b1b8-47e1-ab42-a7d33d745134",
    "created_at": "2022-10-25T16:48:16.623379Z",
    "updated_at": "2025-03-27T02:05:49.264828Z",
    "deleted_at": null,
    "sha1_hash": "b8cfc9011a9d899e62b0f7711cd30305f351d75c",
    "title": "",
    "authors": "",
    "file_creation_date": "2016-06-14T08:39:17Z",
    "file_modification_date": "2016-06-14T08:39:17Z",
    "file_size": 528045,
    "plain_text": "## This “Windows PowerShell Logging Cheat Sheet” is intended to help you get started setting up basic and necessary PowerShell (Windows Management Framework) command and command line logging. This list includes some very common items that should be enabled, configured, gathered and harvested for any Log Management program. Start with these settings and add to it as you understand better what is in your logs and what you need.\n\n\nDEFINITIONS::\n\nENABLE: Things you must do to enable logging to start collecting and keeping events.\n\nCONFIGURE: Configuration that is needed to refine what events you will collect.\n\nGATHER: Tools/Utilities that you can use locally on the system to set or gather log related information – AuditPol,\nWEvtUtil, Find, etc.\n\nHARVEST: Events that you would want to harvest into some centralized Event log management solution like syslog,\nSIEM, Splunk, etc.\n\nRESOURCES: Places to get information on PowerShell Logging\n\n    - PS 2,3,4 Command Line Logging - http://technet.microsoft.com/en-us/library/hh847796.aspx\n\n    - PowerShell Transcript information - https://technet.microsoft.com/en-us/library/hh849687.aspx\n\n    - PS 4 - https://www.fireeye.com/blog/threat-research/2016/02/greater_visibilityt.html\n\n    - PS 4 & 5 - https://blogs.msdn.microsoft.com/powershell/2015/06/09/powershell-the-blue-team - KEY for PS 5\n\n    - https://www.blackhat.com/docs/us-14/materials/us-14-Kazanciyan-Investigating-Powershell-Attacks-WP.pdf\n\n    - http://learn-powershell.net/2014/08/26/more-new-stuff-in-powershell-v5-extra-powershell-auditing\n\n    - http://www.redblue.team/2016/01/powershell-traceless-threat-and-howto.html?showComment=1464099315089#c3589963557794199352\n\n     - https://www.carbonblack.com/wp-content/uploads/2016/04/Cb-Powershell-Deep-Dive-A-United-Threat-Research-Report-1.pdf\n\n\nINFORMATION::\n\n1. Why Enable and Configure PowerShell logging? PowerShell, or its new official name, the “Windows Management\n\nFramework” is the future way Microsoft will have us administer Windows. The Command line as we know it is going\naway and PowerShell will be taking over. Why is this important? PowerShell provides access to the .NET Framework\nwhich provides access to API calls that attackers can take advantage of and exploit and avoid Anti-Virus and other\nsecurity controls in the process. PowerShell can be used to exploit a system with little noise or indicators in the logs\nunless properly enabled and configured to gather the PowerShell execution details. If you do not start enabling\nPowerShell logging options mentioned in this cheat sheet, attackers will be able to utilize and exploit your systems and\ndo it quietly without additional file drops or noise generated by traditional malware and attacks. It is crucial to begin\nproperly logging PowerShell to avoid this growing exploitation option. To understand what kind of PowerShell\nexploitation is available and being used, follow the following projects:\n\n  - PowerSploit, PowerShell Empire, PowerTools, MetaSploit, Social Engineering Toolkit (SET) and PoshSec\n\n\n-----\n\nINFORMATIONAL – SECURITY WARNING:\n\n1. The ability to bypass your PowerShell controls is a concern and why it is crucial to alert on these bypass attempts as an indication\n\nthat you are being attacked. If this behavior is occurring normally in your environment, work with your people to fix the issue,\nremove, and prohibit it from happening. Fortunately, if you follow the “Windows Logging Cheat Sheet” and enable “Process\n**_Creation” and the “Command Line Logging” registry tweak, you will see Event ID 4688 where the “Process Command Line” shows_**\nthe command executing the PowerShell bypass in many, if not most cases.\n2. Execution Policy Bypass: The Execution Policy that you set can be bypassed by anyone with malicious intent. Alert on\n\nthe execution of the following:\n\na. –ExecutionPolicy bypass   and/or\nb. –ExecutionPolicy unrestricted\n3. Profile Bypass: The profile(s) you set to configure PowerShell when each session is launched can also be bypassed.\n\nAlert on the execution of the following:\n\na. –noprofile\n4. These commands are often joined in malicious activity and can be in any form of the following:\n\na. powershell.exe -executionpolicy bypass –noprofile –windowstyle hidden –file malicious.ps1\nb. powershell.exe -NonInteractive -WindowStyle Hidden -Ex bypass –File “malicious.ps1\"\nc. powershell.exe –e ZQBjAGgAbwAgACcAWQBvAHUAIABhAHIAZQAgAHAAdwBuAGUAZAAhACcA   (encoded)\n\n\nENABLE::\n\n1. LOCAL LOG SIZE: Increase the size of your local PowerShell logs. Don’t worry, you have plenty of disk space, CPU is not\n\nan issue with today’s systems.\n\na. Applications and Services Logs – ‘Windows PowerShell’ log set to 500,000KB or larger\nb. Applications and Services Logs / Microsoft-Windows – ‘PowerShell/Operational’ log set to 500,000KB or larger\n2. LOCAL SECURITY POLICY: No settings needed\n3. GROUP POLICY: You can control all the PowerShell settings in Group Policy\n\n  - ExecutionPolicy – must be set to RemoteSigned if using a default profile (profile.ps1)\n\n  - ScriptBlock – Capture PowerShell execution details Event ID 4104 on PowerShell 5 Win 7, 2008 Server or later\n\n  - ModuleLoad - Capture PowerShell execution details Event ID 4104 on PowerShell 5 Win 7, 2008 Server or later\n\n  - Log script block execution start / stop events – Do NOT set, generates a lot of noise and too many log entries\n4. REGISTRY SETTINGS:\n\n  - HKCU/HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell\",\"ExecutionPolicy\"\n\n`o` RemoteSigned\n\n  - HKCU/HKLM\\SOFTWARE\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell\",\"Path\"\n\n  - HKCU/HKLM \\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell\\\n\n`o` ModuleLogging, REG_DWORD, EnableModuleLogging, 1 PowerShell 5\n`o` ScriptBlockLogging, REG_DWORD, EnableScriptBlockLogging, 1 PowerShell 5\n`o` ScriptBlockLogging, REG_DWORD, EnableScriptBlockInvocationLogging, 1 PowerShell 5\n\n         - This is VERY noisy, do not set in most environments, or seriously test first (4105 & 4106)\n`o` Transcription, REG_DWORD, EnableInvocationHeader, 1 PowerShell 5\n`o` Transcription, REG_DWORD, EnableTranscripting, 1 PowerShell 5\n`o` Transcription, REG_SZ, OutputDirectory (Enter Path) PowerShell 5\n\n\n-----\n\nCONFIGURE::\n\n1. PowerShell Transcript: For PowerShell versions 2, 3, 4 & 5. You can record a PowerShell transcript of everything\n\nentered during a PowerShell session using a default profile. Transcripts will be recorded in one or more files\ndepending on your settings. To make transcripts work for every user opening a PowerShell session, add it to the\nDefault Profile (profile.ps1). Make sure the location of the transcript file is writeable by all users. It can be stored on\na file share or local location, avoid using the default location in the Users directory to avoid easy guessing by\nattackers. This feature does not create any Windows log entries, but provides another avenue to capture command\nline execution.\n\na. Start-transcript -path \"<some_drive>:\\<some_location>\\PowerShell_transcript.txt\" -force -noClobber –append\nb. Set whether you want to append the file, overwrite, etc.\nc. Be sure to rotate the logs if you do not overwrite\n\nd. The default location for the transaction logs are: $Home\\My Documents\\PowerShell_transcript.<time-stamp>.txt\n\n2. You may also Start and Stop the transcripts as needed within your scripts with Start-Transcript or Stop-Transcript\n\n\nCONFIGURE::For all versions of Windows\n\n1. WEvtUtil: Use this utility to configure your log settings or configure them in Group Policy\n\na. WevtUtil gl \"Windows PowerShell\" – List settings of the PowerShell Log\nb. WevtUtil sl \"Windows PowerShell\" /ms:512000000 – Set the PowerShell Log size to the number of bytes\nc. WevtUtil sl \"Windows PowerShell\" /rt:false – Overwrite as needed\nd. WevtUtil gl \"Microsoft-Windows-PowerShell/Operational\" – List settings of the PowerShell Log\ne. WevtUtil sl \" Microsoft-Windows-PowerShell/Operational \" /ms:512000000\nf. WevtUtil sl \" Microsoft-Windows-PowerShell/Operational \" /rt:false – Overwrite as needed\n2. For more history in your logs, consider making the log size 1GB\n\n\nCONFIGURE: For PowerShell 2, 3 and 4 (does NOT apply to PowerShell 5):\n\n1. Default Profile: In order to capture the command line of a Windows PowerShell session for all users on the system,\n\nyou will need to create a default profile. Create a file named ‘profile.ps1’ and save it to the following location:\n\n  - C:\\Windows\\System32\\WindowsPowerShell\\v1.0     (yes, it is always 1.0 for any version of PowerShell)\nWith the following variable values:\n\na. $LogCommandHealthEvent = $true Command Line Details\nb. $LogCommandLifecycleEvent = $true Command Line Details\nc. $LogPipelineExecutionDetails = $true Module Loading (within scripts)\nd. $PSVersionTable.PSVersion Shows the version of PowerShell installed\nEvery time a PowerShell session is launched, the commands entered in PowerShell will be recorded in the “Windows\n**_PowerShell” log. Be sure to watch ALL profile locations for new or modified profile.ps1 used for persistence._**\n\n\nNOT ALL POWERSHELL LOGGING IS EQUAL:\n\nPowerShell version 2 thru 4 on Windows 7 and 2008 Server is different in logging options and behavior than\nWindows 8.1, 10 and Server 2012. Options were added to PowerShell 4 and especially 5 that retired many things\nfound in PS version 2 thru 4. So be aware of the settings you are using on what OS and PowerShell version.\n\n\n-----\n\nCONFIGURE::\n\n1. PowerShell Versions and OS: The ability to perform advanced logging of PowerShell is limited to certain operating\n\nsystems and the versions of PowerShell used. Basic PowerShell logging is available for all versions of Windows 7,\nServer 2008 and above, but advanced auditing is limited to PowerShell 4 and 5. The following lists the OS, log(s), and\nEvent ID’s for each operating system and PowerShell version to monitor.\n\n  - Windows 7 and Server 2008 and above:\n\n`o` PowerShell version 2 thru 4, “Windows PowerShell” log – Event ID’s 400, 500, 501 and 800\n\n  - Windows 8.1 and Server 2012 and above:\n\n`o` PowerShell version 3 and 4, “Windows PowerShell” log - Event ID’s 400, 500, 501 and 800\n`o` “Microsoft-Windows-PowerShell/Operational” log – Event ID 4104\n\n  - Windows 7 and Server 2008 and above:\n\n`o` PowerShell version 5, “Windows PowerShell” log - Event ID’s 200, 400, 500 and 501\n`o` “Microsoft-Windows-PowerShell/Operational” log – Event ID 4104\n\n**_Note: There are other 4105 & 4106 events, but they are of little value to security monitoring_**\n\n\nCONFIGURE::\n\n1. REGISTRY AUDIT: To help you catch malicious activity trying to alter your PowerShell configuration, audit the\n\nregistry where these settings are stored. Open Regedit and select the registry keys you want to monitor for\nchanges.\n\na. Right-Click a Key – Permissions – Advanced – Auditing – Add – EVERYONE – (check names), OK.\nb. Apply onto – THIS KEY AND SUBKEYS (or what you want)\nc. Select ‘Set Value’, ‘Create Subkey’, ‘Create Link’, ‘Delete’, ‘Write DAC’ & ‘Write Owner’ to start\n2. POWERSHELL KEYS TO AUDIT:\n\na. HKCU & HKLM\\SOFTWARE\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell\n\ni. ExecutionPolicy\nb. HKLM\\SYSTEM\\CurrentControlSet\\services\\eventlog\\Windows PowerShell\n\ni. MaxSize\nii. Retention\nc. HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell\\\n\ni. All subkeys and values\n\n\nGATHER::\n\n1. Reg.exe: Use this utility to query the registry and check the settings\n\na. **_Changes to Services Keys_**\n\ni. reg query \"HKLM\\System\\CurrentControlSet\\Services\\eventlog\\Windows PowerShell\"\nb. **_Changes to PowerShell Policy_**\n\ni. reg query \"HKLM\\Software\\Microsoft\\PowerShell\\1\\ShellIds\\Microsoft.PowerShell\"\nc. Query a value of a Key\n\ni. reg query “HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows\\PowerShell”\n\n\n-----\n\nGATHER::\n\n1. WEvtUtil: Use this utility to query your logs\n\na. WevtUtil qe “Windows PowerShell” – query the Security Log for events\n\ni. Lots of flags here so read help “WevtUtil -?”\nii. /c:5 = Read 5 events\niii. /rd:true = newest events first\niv. /f:text = format text, also can do XML\nb. **_PowerShell executed - WevtUtil qe “Windows PowerShell” /q:\"*[System[(EventID=501)]]\" /c:5 /rd:true_**\n\n/f:text >Parsed\\%computername%_PS_Cmds_Executed_Win7.log\n2. Filtering Log Results: Use this method to filter lines within the logs\n\na. **_PowerShellCommand Name executed - WevtUtil qe “Windows PowerShell” /q:\"*[System[(EventID=500)]]\"_**\n\n/c:5 /rd:true /f:text | find /I “CommandName”\nb. **_PowerShellCommand Line executed - WevtUtil qe “Windows PowerShell” /q:\"*[System[(EventID=500)]]\"_**\n\n/c:5 /rd:true /f:text | find /I “CommandLine”\nc. **_PowerShellCommand Line for Cmdlet and Scripts executed - WevtUtil qe \"Windows PowerShell\"_**\n\n/q:\"*[System[(EventID=501)]]\" /c:1000 /rd:true /f:text | findstr \"Logged CommandLine Cmdlet Script\"\n3. For PowerShell 4 and 5 Event ID 4104. These logs are large in content\n\na. **_Anything that is a “Get-“ call - WevtUtil qe \"Microsoft-Windows-PowerShell/Operational\"_**\n\n/q:\"*[System[(EventID=4104)]]\" /c:1000 /rd:true /f:text | findstr /i \"Get-\"\nb. **_Anything that is an “iex“ (invoke execution) call - WevtUtil qe \"Microsoft-Windows-_**\n\nPowerShell/Operational\" /q:\"*[System[(EventID=4104)]]\" /c:1000 /rd:true /f:text | findstr /i \"iex\"\n4. Get-EventLog: Use this PowerShell module to query your logs. There too many options to list here, but here a\n\ncouple to get you started.\n\na. get-eventlog -logname “Windows PowerShell” -computername <your_systemname>\nb. get-eventlog -logname \"Windows PowerShell\" -computername <your_systemname> | where {$_.eventID -eq 400}\n\n**_Note: For EventID 400, look for HostApplication to see what executable called PowerShell._**\n\n\nHARVEST::\n\n1. LOG CLEAR: Watch for log clear messages\n\na. 104 – SYSTEM Log – The “Windows PowerShell”\n\nor “PowerShell Operational” log was cleared\n\n\nHARVEST::\n\n1. REGISTRY: Monitor certain Keys for Add, Changes and\n\nDeletes. Setting auditing on the Specific keys is required\n(See the “Windows Registry Auditing Cheat Sheet”).\n\na. 4657 – SECURITY log – A Registry value was\n\nmodified\n\n\nHARVEST::\n\n1. PROCESSES: Watch for a Process to start and call\n\nother processes\n\na. 4688 – SECURITY Log – “New Process Name”\n\n(powershell.exe), look for Creator Process ID\nto link what process launched what other\nprocesses\nb. 4688 – SECURITY Log – What “Process\n\n**_Command Line” was executed for any_**\n‘powershell.exe’ events\nc. Filter out normal events for your\n\nenvironment\n\n\n-----\n\nHARVEST::\n\n1. FIREWALL: Windows Filtering Platform - Watch for Inbound and Outbound connections – Requires Windows Firewall to be\n\n**_enabled_**\n\na. This is the noisiest of all Events. Generating easily 9,000 - 10,000 events per hour per system\nb. Storage is required to utilize this event\nc. 5156 – Message=The Windows Filtering Platform has permitted a connection. Look for:\n\ni. Direction:, Source Address:, Source Port:, Destination Address: & Destination Port:\nii. Specifically items where the ‘Application Name’ is PowerShell.exe\n\n\n`HARVEST:\n\nPOWERSHELL EXPLOITATION: Monitoring PowerShell is much different than other logging due to what needs to be enabled and\nconfigured and what is logged and how PowerShell uses DLL’s and uses API calls. You have to look for combination of suspicious calls\nto detect malicious behavior. Event ID 4104 will be your best bet to catch malicious activity in PS 5 or use Event ID 500 and 800 in PS\n4 and lower and of course what initially executed on the command line with Event ID 4688 New Process Creation with Process\nCommand Line enabled in all versions of Windows.\n\n1. Monitor for these Dll’s being called by an executable other than PowerShell.exe or PowerShell_ISE.exe\n\na. System.Management.Automation.Dll or System.Management.Automation.ni.Dll\nb. System.Reflection.Dll\n2. Monitor for calls to WMI, they are not necessarily malicious, but could indicate WMI is being used in an attack\n\na. Invoke-WMIMethod\nb. Get-WMIObject\n3. In order to detect PowerShell DLL’s being called by something other than PowerShell.exe or PowerShell_ISE.exe, you should\n\nconsider adding one of the following services to Windows to gather more intelligence:\n\na. Sysmon – Sysinternals utility to record additional information about what Processes called what DLL’s monitor all Images loading the\nPowerShell DLL’s “System.Management.Automation.Dll”, “System.Management.Automation.ni.Dll” or “System.Reflection.Dll”\n\ni. Event ID 7 ImageLoaded in the “Microsoft-Windows-Sysmon/Operational” log\nii. https://technet.microsoft.com/en-us/sysinternals/sysmon\nb. Windows Logging Service (WLS) – A replacement syslog agent that records additional information like the modules\n\nloaded by a process.\n\ni. https://digirati82.com/wls-information/\nii. http://energy.gov/sites/prod/files/cioprod/documents/Splunkified_-_the_Next_Evolution_of_Log_Analysis_\n_Green_and_McCord.pdf\n\n\nMONITOR::\n\n1. PROFILES: Locations that profile.ps1 can be stored should be monitored for new profiles or changes since these can be\n\nused for malicious persistence.\n\na. AllUsersAllHosts - %windir%\\System32\\WindowsPowerShell\\v1.0\\profile.ps1\nb. AllUsersAllHosts (WoW64) - %windir%\\SysWOW64\\WindowsPowerShell\\v1.0\\profile.ps1\nc. AllUsersCurrentHost - %windir%\\System32\\WindowsPowerShell\\v1.0\\Microsoft.PowerShell_profile.ps1\nd. AllUsersCurrentHost (ISE) - %windir%\\System32\\WindowsPowerShell\\v1.0\\Microsoft.PowerShellISE_profile.ps1\ne. AllUsersCurrentHost (WoW64) – %windir%\\SysWOW64\\WindowsPowerShell\\v1.0\\Microsoft.PowerShell_profile.ps1\nf. AllUsersCurrentHost (ISE - WoW64) - %windir%\\SysWOW64\\WindowsPowerShell\\v1.0\\Microsoft.PowerShellISE_profile.ps1\ng. CurrentUserAllHosts - %homedrive%%homepath%\\[My ]Documents\\profile.ps1\nh. CurrentUserCurrentHost - %homedrive%%homepath%\\[My ]Documents\\Microsoft.PowerShell_profile.ps1\ni. CurrentUserCurrentHost (ISE) - %homedrive%%homepath%\\[My ]Documents\\Microsoft.PowerShellISE_profile.ps1\n\n\n-----\n\nMONITOR::\n\n1. POWERSHELL MODULES: The following is a list of PowerShell module calls that you should monitor for executing using\n\neither Sysmon, WLS or the enhanced module logging of PowerShell. This is by no means a complete list.\n\nAny “Set-“, “Get-“, “Invoke-“, “Out-”, “Write-“ and all PowerShell arguments can be shortened like “iex”, “ex”, etc so be\ncareful and look for these too. Then filter out your normal modules and look for malicious ones such as:\n\n  - Set-ExecutionPolicy, Set-MasterBootRecord\n\n  - Get-WMIObject, Get-GPPPassword, Get-Keystrokes, Get-TimedScreenshot, Get-VaultCredential, GetServiceUnquoted, Get-ServiceEXEPerms, Get-ServicePerms, Get-RegAlwaysInstallElevated, Get-RegAutoLogon,\nGet-UnattendedInstallFiles, Get-Webconfig, Get-ApplicationHost, Get-PassHashes, Get-LsaSecret, GetInformation, Get-PSADForestInfo, Get-KerberosPolicy, Get-PSADForestKRBTGTInfo, Get-PSADForestInfo, GetKerberosPolicy\n\n  - Invoke-Command, Invoke-Expression, iex, Invoke-Shellcode, Invoke--Shellcode, Invoke-ShellcodeMSIL, InvokeMimikatzWDigestDowngrade, Invoke-NinjaCopy, Invoke-CredentialInjection, Invoke-TokenManipulation, InvokeCallbackIEX, Invoke-PSInject, Invoke-DllEncode, Invoke-ServiceUserAdd, Invoke-ServiceCMD, Invoke-ServiceStart,\nInvoke-ServiceStop, Invoke-ServiceEnable, Invoke-ServiceDisable, Invoke-FindDLLHijack, Invoke-FindPathHijack,\nInvoke-AllChecks, Invoke-MassCommand, Invoke-MassMimikatz, Invoke-MassSearch, Invoke-MassTemplate,\nInvoke-MassTokens, Invoke-ADSBackdoor, Invoke-CredentialsPhish, Invoke-BruteForce, Invoke-PowerShellIcmp,\nInvoke-PowerShellUdp, Invoke-PsGcatAgent, Invoke-PoshRatHttps, Invoke-PowerShellTcp, Invoke-PoshRatHttp,\nInvoke-PowerShellWmi, Invoke-PSGcat, Invoke-Encode, Invoke-Decode, Invoke-CreateCertificate, InvokeNetworkRelay,\n\n  - EncodedCommand, New-ElevatedPersistenceOption, wsman, Enter-PSSession, DownloadString, DownloadFile\n\n  - Out-Word, Out-Excel, Out-Java, Out-Shortcut, Out-CHM, Out-HTA, Out-Minidump, HTTP-Backdoor, FindAVSignature, DllInjection, ReflectivePEInjection, Base64, System.Reflection, System.Management\n\n  - Restore-ServiceEXE, Add-ScrnSaveBackdoor, Gupt-Backdoor, Execute-OnTime, DNS_TXT_Pwnage, WriteUserAddServiceBinary, Write-CMDServiceBinary, Write-UserAddMSI, Write-ServiceEXE, Write-ServiceEXECMD,\n\n  - Enable-DuplicateToken, Remove-Update, Execute-DNSTXT-Code, Download-Execute-PS, Execute-CommandMSSQL, Download_Execute, Copy-VSS, Check-VM, Create-MultipleSessions, Run-EXEonRemote, Port-Scan,\nRemove-PoshRat, TexttoEXE, Base64ToString, StringtoBase64, Do-Exfiltration, Parse_Keys, Add-Exfiltration, AddPersistence, Remove-Persistence, Find-PSServiceAccounts, Discover-PSMSSQLServers, DiscoverPSMSExchangeServers, Discover-PSInterestingServices, Discover-PSMSExchangeServers, DiscoverPSInterestingServices\n\n  - Mimikatz, powercat, powersploit, PowershellEmpire, Payload, GetProcAddress,\n\n  - And any other commands found in any PowerShell exploit kits\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "http://www.malwarearchaeology.com/s/Windows-PowerShell-Logging-Cheat-Sheet-ver-June-2016-v2.pdf"
    ],
    "report_names": [
        "Windows-PowerShell-Logging-Cheat-Sheet-ver-June-2016-v2.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041149,
    "ts_creation_date": 1465893557,
    "ts_modification_date": 1465893557,
    "files": {
        "pdf": "https://archive.orkl.eu/b8cfc9011a9d899e62b0f7711cd30305f351d75c.pdf",
        "text": "https://archive.orkl.eu/b8cfc9011a9d899e62b0f7711cd30305f351d75c.txt",
        "img": "https://archive.orkl.eu/b8cfc9011a9d899e62b0f7711cd30305f351d75c.jpg"
    }
}