{
    "id": "89173f71-d734-4af1-a49b-52de6c12763d",
    "created_at": "2022-10-25T16:48:13.521909Z",
    "updated_at": "2025-03-27T02:13:33.702294Z",
    "deleted_at": null,
    "sha1_hash": "395d694e53af9f7d880ea552184d73da10113932",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-07-10T08:36:26Z",
    "file_modification_date": "2019-07-10T08:36:26Z",
    "file_size": 350539,
    "plain_text": "# Sea Turtle keeps on swimming, finds new victims, DNS hijacking techniques\n\n**[blog.talosintelligence.com/2019/07/sea-turtle-keeps-on-swimming.html](https://blog.talosintelligence.com/2019/07/sea-turtle-keeps-on-swimming.html)**\n\n_By_ _[Danny Adamitis with contributions from](https://twitter.com/dadamitis)_ _[Paul Rascagneres.](https://twitter.com/r00tbsd)_\n\n## Executive summary\n\nAfter several months of activity, the actors behind the \"Sea Turtle\" DNS hijacking\ncampaign are not slowing down. Cisco Talos recently discovered new details that\nsuggest they regrouped after we published our initial findings and coverage and are\nredoubling their efforts with new infrastructure. While many actors will slow down once\nthey are discovered, this group appears to be unusually brazen, and will be unlikely to\nbe deterred going forward.\n\nAdditionally, we discovered a new DNS hijacking technique that we assess with\nmoderate confidence is connected to the actors behind Sea Turtle. This new technique\nis similar in that the threat actors compromise the name server records and respond to\nDNS requests with falsified A records. This new technique has only been observed in a\nfew highly targeted operations. We also identified a new wave of victims, including a\ncountry code top-level domain (ccTLD) registry, which manages the DNS records for\nevery domain uses that particular country code, that access was used to then\ncompromise additional government entities. Unfortunately, unless there are significant\nchanges made to better secure DNS, these sorts of attacks are going to remain\nprevalent.\n\n## New DNS hijacking technique\n\n\n-----\n\nTalos now has moderate confidence that the threat actors behind Sea Turtle have been\nusing another DNS hijacking technique. This new technique has been used very\nsparingly, and thus far have only identified two entities that were targeted in 2018,\nthough we believe there are likely more.\n\nThis new technique once again involved modifying the target domain's name server\nrecords to point legitimate users to the actor-controlled server. In this case, the actorcontrolled name server and the hijacked hostnames would both resolve to the same IP\naddress for a short period of time, typically less than 24 hours. In both observed cases,\none of the hijacked hostnames would reference an email service and the threat actors\nwould presumably harvest user credentials. One aspect of this technique that makes it\nextremely difficult to track is that the actor-controlled name servers were not used across\nmultiple targets — meaning that every entity hijacked with this technique had its own\ndedicated name server hostname and its own dedicated IP address. Whereas previously\nreported name server domains such as ns1[.]intersecdns[.]com were used to target\nmultiple organizations.\n\nIn one case, a private organization primarily used a third-party service as their\nauthoritative name server. Then, for a three-hour window in January 2018, their name\nserver records were changed to a name server hostname that mimicked a slightly\ndifferent version of the organization's name. During that three-hour window, the actorcontrolled IP address hosted three hostnames, the two actor-controlled name servers\nand the webmail hostname. This would allow the threat actors to perform a man-in-themiddle (MitM) attack, as outlined in our previous post, and harvest credentials. This\ntechnique was also observed against a government organizations in the Middle East and\nNorth African region.\n\n## Continued activity against ccTLD\n\nThe Institute of Computer Science of the Foundation for Research and Technology Hellas (ICS-Forth), the ccTLD for Greece, acknowledged on its [public website that its](https://techblog.gr/internet/kyvernoepithesi-ypesti-to-mitroo-onomaton-internet-katalixi-gr-el/)\nnetwork had been compromised on April 19, 2019. Based on Cisco telemetry, we\ndetermined that the actors behind the Sea Turtle campaign had access to the ICS-Forth\nnetwork.\n\nCisco telemetry confirmed that the actors behind Sea Turtle maintained access to the\nICS-Forth network from an operational command and control (C2) node. Our telemetry\nindicates that the actors maintained access in the ICS-Forth network through at least\nApril 24, five days after the statement was publicly released. Upon analysis of this\noperational C2 node, we determined that it was also used to access an organization in\nSyria that was previously redirected using the actor-controlled name server\nns1[.]intersecdns[.]com. This indicates that the same threat actors were behind both\noperations.\n\nWe also saw evidence that the threat actors researched the open-source tool PHPProxy. Notably, this particular C2 node searched for both blog.talosintelligence.com and\nncsc.gov.uk, presumably to view Talos' previous reports on DNS hijacking and this DNS\nhijacking advisory from the United Kingdom's National Cyber Security Centre.\n\n\n-----\n\n## New actor-controlled nameserver\n\nWe recently discovered a new actor-controlled nameserver, rootdnservers[.]com, that\nexhibited similar behavior patterns as name servers previously utilized as part of the Sea\nTurtle campaign. The domain rootdnservers[.]com was registered on April 5, 2019\nthrough the registrar NameCheap. The new actor-controlled name server\nrootdnservers[.]com was utilized to perform DNS hijacking against three government\nentities that all used .gr, the Greek ccTLD. It's likely that these hijackings were performed\nthrough the access the threat actors obtained in the ICS-Forth network. Below is a table\nshowing the three most recent actor-controlled name servers that we have associated\nwith this activity and their current operational status.\n\n**Hostnames** **IP addresses** **Operational Status**\n\nns1[.]rootdnservers[.]com. 45[.]32[.]100[.]62 Active\n\nns2[.]rootdnservers[.]com. 45[.]32[.]100[.]62 Active\n\nns1[.]intersecdns[.]com 95[.]179[.]150[.]101 Inactive\n\nns2[.]intersecdns[.]com 95[.]179[.]150[.]101 Inactive\n\n## New IP addresses associated with man-in-the-middle activity\n\nBy identifying the targeted domains, we were able to identify the hijacked hostnames\nand the corresponding actor-controlled MitM nodes. The threat actors, again employing\npreviously documented tradecraft, by performing a \"certificate impersonation\" technique.\nThis is where the threat actors procure an SSL certificate for the targeted hostname from\na different SSL provider. Below is a table showing the dates and associated IP\naddresses.\n\n**Date** **IP address**\n\nApril 13, 2019 95[.]179[.]131[.]225\n\nApril 16, 2019 95[.]179[.]131[.]225\n\nApril 11, 2019 95[.]179[.]131[.]225\n\nApril 11, 2019 140[.]82[.]58[.]253\n\nApril 10, 2019 95[.]179[.]156[.]61\n\n## Updated victimology\n\n\n-----\n\nSince our initial report, Sea Turtle has continued to compromise a number of different\nentities to fulfill their requirements. We have identified some of the new primary targets\nas:\n\nGovernment organizations\nEnergy companies\nThink tanks\nInternational non-governmental organizations\nAt least one airport\n\nIn terms of secondary targets, we have seen very similar targets as those previously\nreported, such as telecommunications providers, internet service providers and one\nregistry.\n\n## Coverage and mitigations\n\nIn order to best protect against this type of attack, we compiled a list of potential actions.\nWe have included additional security recommendations, that were highlighted by Bill\nWoodcock during his [presentations on DNS/IMAP attacks.](https://www.youtube.com/watch?v=oNF6TE75mzg)\n\nWe recommend implementing multi-factor authentication, such as DUO, to secure\nthe management of your organization's DNS records at your registrar, and to\nconnect remotely to your corporate network via a Virtual Private Network (VPN).\nTalos suggests a registry lock service on your domain names, which will require\nthe registrar to provide an out-of-band confirmation before the registry will process\nany changes to an organization's DNS record.\nDNSSEC sign your domains, either in-house, or using a DNS service provider\nwhich performs DNSSEC key-management services.\nDNSSEC validate all DNS lookups in your recursive resolver, either using in-house\nnameservers, or a service like Cisco Umbrella / OpenDNS.\nMake Internet Message Access Protocol (IMAP) email servers accessible only\nfrom your corporate LAN and to users who have already authenticated over a\nVPN.\nIf you suspect you were targeted by this type of activity, we recommend instituting\na network-wide password reset, preferably from a computer on a trusted network.\n\n\n-----\n\nLastly, network administrators can monitor passive DNS record on their domains,\nto check for abnormalities.\n\n## Indicators of compromise\n\n**IP address** **Characterization** **Date Range**\n\n185[.]64[.]105[.]100 Operational Node March - April 2019\n\n178[.]17[.]167[.]51 Operational Node June 2019\n\n95[.]179[.]131[.]225 Mitm Node April 2019\n\n140[.]82[.]58[.]253 Mitm Node April 2019\n\n95[.]179[.]156[.]61 Mitm Node April 2019\n\n196[.]29[.]187[.]100 Mitm Node December 2018\n\n188[.]226[.]192[.]35 Mitm Node January 2018\n\nns1[.]rootdnservers[.]com Actor-controlled nameserver April 2019\n\nns2[.]rootdnservers[.]com Actor-controlled nameserver April 2019\n\n45[.]32[.]100[.]62 Hosted malicious nameserver April 2019\n\nns1[.]intersecdns[.]com Actor-controlled nameserver February - April\n2019\n\nns2[.]intersecdns[.]com Actor-controlled nameserver February - April\n2019\n\n95[.]179[.]150[.]101 Hosted malicious nameserver February - July 2019\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.09.SeaTurtle_swimming/Sea%20Turtle%20keeps%20on%20swimming%2C%20finds%20new%20victims%2C%20DNS%20hijacking%20techniques.pdf"
    ],
    "report_names": [
        "Sea Turtle keeps on swimming, finds new victims, DNS hijacking techniques"
    ],
    "threat_actors": [
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716493,
    "ts_updated_at": 1743041613,
    "ts_creation_date": 1562747786,
    "ts_modification_date": 1562747786,
    "files": {
        "pdf": "https://archive.orkl.eu/395d694e53af9f7d880ea552184d73da10113932.pdf",
        "text": "https://archive.orkl.eu/395d694e53af9f7d880ea552184d73da10113932.txt",
        "img": "https://archive.orkl.eu/395d694e53af9f7d880ea552184d73da10113932.jpg"
    }
}