{
    "id": "89527d0d-e895-414c-a579-8fdd1669bc1c",
    "created_at": "2023-01-12T15:06:35.701072Z",
    "updated_at": "2025-03-27T02:08:41.033406Z",
    "deleted_at": null,
    "sha1_hash": "17175aa39ce807018794bef777db2224b040bebe",
    "title": "2021-11-13 - QAKBOT Loader Returns With New Techniques and Tools",
    "authors": "",
    "file_creation_date": "2022-05-28T03:49:03Z",
    "file_modification_date": "2022-05-28T03:49:03Z",
    "file_size": 434192,
    "plain_text": "# QAKBOT Loader Returns With New Techniques and Tools\n\n**[trendmicro.com/en_us/research/21/k/qakbot-loader-returns-with-new-techniques-and-tools.html](https://www.trendmicro.com/en_us/research/21/k/qakbot-loader-returns-with-new-techniques-and-tools.html)**\n\nNovember 13, 2021\n\n[QAKBOT is a prevalent information-stealing malware that was first discovered in 2007. In](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/web-attack/80/qakbot-a-prevalent-infostealing-malware)\nrecent years, its detection has become a precursor to many critical and widespread\nransomware attacks. It has been identified as a key \"malware installation-as-a-service\"\nbotnet that enables many of today’s campaigns.\n\nToward the end of September 2021, we noted that QAKBOT operators resumed email spam\noperations after an almost three-month hiatus. Specifically, we saw that the malware\ndistributor “TR” was sending malicious spam leading victims to SquirrelWaffle (another\nmalware loader) and QAKBOT. In early October, the same [“TR” distributor was reportedly](https://twitter.com/1ZRR4H/status/1444837996855967745?s=20)\nconducting brute-force attacks on Internet Message Access Protocol (IMAP) services, and\nthere is also [speculation from security researchers that “TR” uses ProxyLogon to acquire](https://twitter.com/GossiTheDog/status/1455204386834206729?s=20)\ncredentials for the attacks.\n\n[The actors using QAKBOT are leveraging hijacked email threads in their spam runs, a highly](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/further-emotet-evolution-operators-hijacking-existing-email-threads-to-deliver-malware)\neffective tactic that was used by groups such as Emotet in the past (hijacking an email\nthread means reviving an old thread with replies containing malware). Compromising IMAP\nservices and email service providers (ESPs), or hijacking email threads allows attackers to\nleverage the trust a potential victim has in people they have corresponded with before, and it\nalso allows for the impersonation of a compromised organization. Indeed, intended targets\nwill be much more likely to open emails from a recognized sender.\n\n[Unlike the waves of QAKBOT that we observed in the weeks leading up to its June 2021](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/qakbot-resurges-spreads-through-vbs-files)\nbreak, this most recent campaign uses Visual Basic for Applications (VBA) macros alongside\nExcel 4.0 macros. In the following, we dive into the tools and techniques of this new edition\nand include a thorough analysis of QAKBOT’s history and previous tactics in our technical\nbrief.\n\nFigure 1. QAKBOT spam campaign activity from May 10, 2021 to October 25, 2021\n\n\n-----\n\nFigure\n\n2. Hijacked email used by QAKBOT\nQAKBOT operators are a key enabler for ransomware attacks. Since 2019, infections have\nled to the eventual deployment of human-operated ransomware families (MegaCortex and\nPwndLocker in 2019, Egregor, and ProLock in 2020, and Sodinokibi/REvil in 2021).\n\nIts reemergence in September is likely a signal of the initial infection of hosts. In the coming\nweeks, the operators might try to monetize some of these infections using ransomware.\nHowever, it is important to note that although QAKBOT activity is generally an initial\ninvestigation of targets by known malicious groups, not all QAKBOT infections will lead to\nserious ransomware incidents.\n\nHow does the newest version of QAKBOT operate with VBA macros?\n\nWhen a victim opens the malicious file in their spam email, an auto_open macro will try to\ncreate a new sheet and set the font color to white. Macros typically execute as soon as the\nvictim opens the document and selects the “Enable Content” button. It reads data embedded\nin a form control “UserForm1”, which is revealed to be the following:\n\nHard-coded QAKBOT payload hosts\nThe urlmon library\n\n\n-----\n\nFigure 3. Data\n\nembedded in the form\nThe macro then assigns the values to cells in “Sheet 5” and evaluates and concatenates the\ncommand to download the QAKBOT DLL from a remote host. The process chain has also\naltered slightly with regsvr32.exe using -silent instead of -s parameter. The DLL download\nURL still uses now() to form the DLL name. The macro then deletes the “Sheet5” when the\ndocument is closed.\n\n\n-----\n\nFigure\n\n\n4. Process chain from the new QAKBOT sample\nFor persistence, QAKBOT uses the same scheduled task as it has in the past:\n\n\n-----\n\nFigure 5. The scheduled task QAKBOT uses for persistence\nSecurity recommendations\n\nThe constant resurgence of new, more sophisticated variants of known malware, as well as\nthe emergence of entirely unknown threats, demands solutions with advanced detection and\nresponse capabilities. Users can protect themselves from new QAKBOT samples and other\n[threats that spread through emails by following some of these best practices:](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\n\nAvoid downloading attachments or selecting embedded links from emails before\nverifying the sender and the content.\nHover the pointer above embedded links to show the link’s target.\nCheck the identity of the sender. Unfamiliar email addresses, mismatched email and\nsender names, and spoofed company emails are some of the signs that the sender has\nmalicious intent.\nIf the email claims to come from a legitimate company, check if they sent it before\ntaking any action.\n\n[Users can also protect systems through managed detection and response (MDR), which](https://www.trendmicro.com/en_nl/business/products/user-protection/sps/endpoint/managed-detection-response.html)\nutilizes advanced artificial intelligence to correlate and prioritize threats, determining if they\nare part of a larger attack. It can detect threats before they are executed, thus preventing\nfurther compromise.\n\n[For more information about the QAKBOT threat, download our technical brief.](https://documents.trendmicro.com/assets/pdf/Technical-Brief---The-Prelude-to-Ransomware-A-Look-into-Current-QAKBOT-Capabilities-and-Activity.pdf)\n\nMalware\n\nQAKBOT operators resumed email spam operations towards the end of September after an\nalmost three-month hiatus. QAKBOT detection has become a precursor to many critical and\nwidespread ransomware attacks. Our report shares some insight into the new techniques\nand tools this threat is using.\n\nBy: Ian Kenefick, Vladimir Kropotov November 13, 2021 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-13 - QAKBOT Loader Returns With New Techniques and Tools.pdf"
    ],
    "report_names": [
        "2021-11-13 - QAKBOT Loader Returns With New Techniques and Tools.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535995,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653709743,
    "ts_modification_date": 1653709743,
    "files": {
        "pdf": "https://archive.orkl.eu/17175aa39ce807018794bef777db2224b040bebe.pdf",
        "text": "https://archive.orkl.eu/17175aa39ce807018794bef777db2224b040bebe.txt",
        "img": "https://archive.orkl.eu/17175aa39ce807018794bef777db2224b040bebe.jpg"
    }
}