{
    "id": "8960c239-3c1f-4337-9ad2-4a5c71528ba7",
    "created_at": "2023-01-12T15:05:38.605171Z",
    "updated_at": "2025-03-27T02:05:59.905005Z",
    "deleted_at": null,
    "sha1_hash": "4b7b23d61379c66c17c2820f9810740fd8743a10",
    "title": "2022-03-16 - Suspected Conti Ransomware Activity in the Auto Manufacturing Sector",
    "authors": "",
    "file_creation_date": "2022-05-28T02:26:54Z",
    "file_modification_date": "2022-05-28T02:26:54Z",
    "file_size": 635540,
    "plain_text": "# Suspected Conti Ransomware Activity in the Auto Manufacturing Sector\n\n**[dragos.com/blog/industry-news/suspected-conti-ransomware-activity-in-the-auto-manufacturing-sector/](https://www.dragos.com/blog/industry-news/suspected-conti-ransomware-activity-in-the-auto-manufacturing-sector/)**\n\nBlog Post\n\n\nMarch 16, 2022\n\n\n-----\n\nBy Josh Hanrahan\n\n03.16.22\n\n\n-----\n\nDragos has observed consistent network communication between Emotet Command and\nControl (C2) servers and numerous auto manufacturing companies. These Emotet servers\nare suspected to be controlled by the Conti ransomware group.\n\nAt this stage, Dragos has not yet observed any confirmed initial access methods being\nutilized and does not have any evidence of ransomware encryption being initiated. The\nobserved communications from the networks are consistent with those commonly\nassociated with established footholds. Dragos observed this activity starting in December\n2021, but it may have begun prior to that. It has been ongoing until March 2022.\n\nIf systems located in levels 2 to 3 of the Purdue Model such as engineer workstations,\nhistorians, or Supervisory Control and Data Acquisition (SCADA) systems suffer a\nransomware infection, the impact on industrial operations can be severe. Additionally, any\nransomware infection occurring on systems in Level 4 of the Purdue model such as Domain\nControllers, File Servers or Web Servers can sever key business processes that industrial\noperations may be reliant upon.\n\n## Key Findings\n\nDragos is observing evidence of multiple automotive manufacturers compromised by\nEmotet, a malware strain and a cybercrime operation, which has precipitated\nransomware events in the past.\n\n\n-----\n\nDragos investigated the Internet Protocol (IP) addresses detailed on twitter by the\nuser @ContiLeaks. This user appears to be someone with potential insider knowledge\nof the Conti ransomware group who is leaking information due to disagreeing with\nConti’s public support of the Russian invasion of Ukraine.\nDragos examined the IP addresses in the tweets and noted copious amounts of\ncommunication to confirmed Emotet C2 nodes.\nDragos observed numerous automotive organizations across North America and\nJapan frequently communicating with the Emotet C2 servers.\n\n### CONTI & EMOTET Adversary Infrastructure\n\nDragos analyzed network telemetry associated with the suspected Conti master C2 server\nand observed frequent communication between it and a subset of IP addresses that are\nEmotet C2 nodes, as shown below.\n\n**Network Indicator** **Description**\n\n_82.202.192[.]66_ SELECTEL-MSK – Emotet C2\n\n_67.205.162[.]68_ Digital Ocean – Emotet C2\n\n_188.241.120[.]42_ BANDWIDTH-AS – Emotet C2\n\n_185.9.18[.]154_ M247 – Suspected Conti master C2 server\n\n_178.128.83[.]165_ Digital Ocean – Emotet & legacy Dridex C2\n\n_162.243.175[.]63_ Digital Ocean – Emotet C2\n\n_159.65.1[.]71_ Digital Ocean – Emotet C2\n\n_134.209.156[.]68_ Digital Ocean – Emotet C2\n\n_159.89.230[.]105_ Digital Ocean – Emotet C2\n\n_45.184.36[.]10_ AS269305 – Emotet C2\n\nCONTI & EMOTET Infrastructure\nDragos further examined network communications between the Emotet C2 nodes and any\nother IP addresses, which subsequently highlighted traffic consistent with C2\ncommunications between potential victims and the Emotet C2 servers. Figure 1 below\nshows our observations.\n\n\n-----\n\nAdversary Infrastructure\n\n### Victimology\n\nAnalysis of the network telemetry from the C2 nodes highlighted continued communication\nto and from automotive related organizations in North America and Japan, including but not\nlimited to:\n\nThree of the world’s top automakers\nA key domestic supplier to one of the world’s top automakers\nAn automotive component manufacturer\n\nNot only did victims exhibit network communication consistent with C2 activity to one IP\naddress, but some victims were communicating with many of the C2 IP addresses. This\nindicates that initial access footholds into these victim’s networks were well established and\nhave multiple backup controllers if some were to go offline.\n\nDragos has contacted the organizations affected and advised them to enact their incident\nresponse playbooks for ransomware events.\n\n### Recommendations from Dragos Experts\n\n\n-----\n\nRansomware can impact critical business functions across both Information Technology (IT)\nenvironments and Operational Technology (OT) environments. If an adversary gains a\nfoothold and systems across the network are encrypted, business and operational\nprocesses can be severely halted, in turn causing a reduction in or cessation of critical\noperations.\n\nDragos advises that IT and OT security staff review the details of this activity in conjunction\nwith their organizations threat modelling and determine any follow-up actions if appropriate.\n\nDragos also advises that the following action items may be helpful in mitigating or detecting\nransomware events against your network:\n\nHunt for ransomware related indicators of compromise on externally facing third-party\nmanaged devices as well as organization managed devices that have logging\navailable.\nMonitor for key Tactics, Techniques and Procedures (TTPs) utilized by ransomware\nadversaries. The following techniques, mapped to MITRE’s ATT&CK for Industrial\nControl Systems (ICS), were observed in this activity: T0885: Command and Control –\nCommonly Used Port.\nMonitor network traffic for TTPs where prevention methods may be missing malicious\nactivity. For example, software misconfiguration of firewalls or web proxies.\nAdditionally, with C2 communication over common ports such as 80 (HTTP) or 443\n(HTTPS), analysis of bytes transferred outwards, abnormal user-agents, or\nconnection initiation at a repeated interval can highlight potential C2 beaconing\nactivity.\nMonitor East-West network traffic for relevant TTPs and assess if the details of the\ntraffic are in line with normal baseline behaviors.\nAssess IT and OT connectivity and exposure: Use best practices to secure sections of\nyour network.\nAssess your network architecture and security controls separately.\nKeep Systems Fully Patched: Patch your IT and OT systems where and when it\nmakes sense to mitigate vulnerabilities.\nRegularly Back up Files to Remote Servers: Restoring your files from a backup is the\nfastest way to regain access to your data.\nUse Security Solutions: Protect your environment using organizational firewalls,\nproxies, web filtering, and mail filtering.\nEnsure networks are properly segmented with separate authentication infrastructure\nfor IT and OT.\nEnsure least privileges and leverage user access control: Implement practices to\nprevent adversary lateral movement and deployment of ransomware in the industrial\nenvironment. Least privilege is the concept and practice of restricting access rights for\nusers, accounts, and computing processes to only the resources required to perform\nroutine, legitimate activities.\n\n\n-----\n\nRevise or create your incident response plan on how to respond to ransomware\nevents.\n\n**References**\n\n### The Dragos 2021 Year in Review\n\nFind proactive, actionable information, and defensive recommendations from the frontline\nteam safeguarding civilization from cyber attacks.\n\n[Prepare Your Cyber Defenses](https://hub.dragos.com/report/2021-year-in-review)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-16 - Suspected Conti Ransomware Activity in the Auto Manufacturing Sector.pdf"
    ],
    "report_names": [
        "2022-03-16 - Suspected Conti Ransomware Activity in the Auto Manufacturing Sector.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535938,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653704814,
    "ts_modification_date": 1653704814,
    "files": {
        "pdf": "https://archive.orkl.eu/4b7b23d61379c66c17c2820f9810740fd8743a10.pdf",
        "text": "https://archive.orkl.eu/4b7b23d61379c66c17c2820f9810740fd8743a10.txt",
        "img": "https://archive.orkl.eu/4b7b23d61379c66c17c2820f9810740fd8743a10.jpg"
    }
}