{
    "id": "8987baaf-70c9-44c2-b06e-1292314cd223",
    "created_at": "2023-01-12T15:10:33.140027Z",
    "updated_at": "2025-03-27T02:05:32.363474Z",
    "deleted_at": null,
    "sha1_hash": "bd4bb7d4655c6dae51559c8723d2373152a977da",
    "title": "2021-12-13 - A Look Into Purple Fox’s Server Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-29T01:37:13Z",
    "file_modification_date": "2022-05-29T01:37:13Z",
    "file_size": 425859,
    "plain_text": "# A Look Into Purple Fox’s Server Infrastructure\n\n**[trendmicro.com/en_us/research/21/l/a-look-into-purple-fox-server-infrastructure.html](https://www.trendmicro.com/en_us/research/21/l/a-look-into-purple-fox-server-infrastructure.html)**\n\n## Introduction\n\n\nDecember 13, 2021\n\n\n[In one of our previous blog entries, we analyzed the Purple Fox botnet by providing an](https://www.trendmicro.com/en_us/research/21/j/purplefox-adds-new-backdoor-that-uses-websockets.html)\noverview of how it worked. In addition, we also examined its initial access techniques and\nsome of its associated backdoors.\n\nIn this research, we shed greater light on the later stages of its infection chain that we have\n[observed via Trend Micro Managed XDR — specifically how it infects SQL databases by](https://www.trendmicro.com/en_us/business/services/managed-xdr.html)\ninserting a malicious SQL CLR assembly to achieve a persistent and stealthier execution. It\nshould be noted that most files used in this attack are not stored on the disk and are either\nexecuted from memory after either being pulled from the command-and-control (C&C) server\nor encrypted, after which these are loaded by another process.\n\nWe also discuss the botnet’s underlying C&C infrastructure and the motivation behind Purple\nFox operators’ choice to target SQL servers in their recent activities.\n\nBy examining Purple Fox’s routines and activities, both with our initial research and the\nsubject matter we cover in this blog post, we hope to help incident responders, security\noperation centers (SOCs), and security researchers find and weed out Purple Fox infections\nin their network.\n\n## Process injection\n\nLet’s begin by analyzing Purple Fox’s process injection routine. The malware first loads its\nvarious components by spawning a suspended svchost.exe (changed to fontdrvhost.exe by\nthe accompanied rootkit) process. It then loads the DLL component in the process address\nspace, then redirects execution to the loaded DLL.\n\n\n-----\n\nFigure 1. Process tree overview\n\n## The C&C server\n\nThe malware has three different ways to communicate with its C&C servers. Each method is\nused at a particular stage of execution for various purposes.\n\n## DNS\n\nThe DNS is used to get a list of C&C IP addresses at the start of each process execution. It\nis also used to renew this list if all servers fail to respond during this stage, or in a later stage\nas we see next. One thing to note is that the IP addresses received by the DNS requests are\nnot the real IP addresses used for the C&C server. Although those received by the DNS\nrequests are encoded, they can be decoded by subtracting a fixed number from the IP\naddress. The following table shows examples of this.\n\nIP address from DNS request Decoded IP address\n\n178[.]195.162.94 216[.]189.159.94:12113\n\n\n-----\n\n79[.]222.214.20 117[.]216.211.20:10669\n\n145[.]68.65.106 183[.]62.62.106:13600\n\n73[.]127.195.228 111[.]121.192.228:14640\n\n53[.]238.137.143 91[.]232.134.143:18372\n\nTable 1. Examples of IP addresses received via DNS requests and the actual decoded IP addresses\n\nThe following are the domains used for the DNS requests:\n\nKew[.]8df[.]us which points to m[.]tet[.]kozow[.]com\nret[.]6bc[.]Us which points to a[.]keb[.]kozow[.]com\n\nThe list of returned IP addresses changes every few minutes or so, in order to cycle through\nthe botnet C&C infrastructure.\n\n## UDP\n\nThe second communication method, User Datagram Protocol (UDP), is used for various\ntypes of messages and includes the building of a cache IP address list that will be used for\nfurther communication. In addition, it is used for pulling configuration for running tools and for\nretrieving the IP:PORT list for the HTTP traffic discussed in the next section.\n\nAfter selecting an IP address from the DNS, it is decoded to the real IP address and a port\nnumber, after which a request is made to pull the cache IP address list. If at any point this\ncache list fails, the malware will return to the DNS to pull a new IP address to build another\ncache IP address list.\n\n## HTTP\n\nTo start performing its routine on the system, the malware pulls encrypted DLLs by issuing a\nGET request in the format http://IP:PORT/xxxx[.]moe, where IP:PORT is selected by a UDP\nmessage and xxxx[.]moe is one of the worker DLLs. These DLLs are saved in a file and are\nloaded by the worker process that decrypts, decompresses, and executes them.\n\n## The Worker DLLs\n\n The SQL Server Scanner [32A7E157.moe]\n\n\n-----\n\nThe first of the worker DLLs is a SQL Server scanner that pulls its core module from\n/3FE8E22C.moe using the HTTP communication described previously. This core module is\ninjected to a new process and the scanner configuration is pulled using UDP communication,\nwhich has the starting public address for scanning.\n\nIt scans local and public IP addresses for SQL Server over port 1433. If it finds an open port,\nit begins a brute-force attack for the SQL Server authentication using the 10 million-strong\nword list.\n\nWhen the malware is authenticated, it executes an SQL script that installs a backdoor\nassembly (evilclr.dll) on the SQL Server database that is used to facilitate executing\ncommands using SQL statements. Using this assembly, PowerShell commands are\nexecuted on the SQL Server to start Purple Fox’s infection chain as discussed in our\nprevious blog entry.\n\nFigure 2. An SQL brute-force request\n\n\n-----\n\nFigure 3. A failed response to the SQL brute-force request\n\n\n-----\n\nFigure 4. A successful response to the SQL brute-force request\n\n\n-----\n\nFigure 5. Executing SQL statements\n\n\n-----\n\nFigure 6. Database before infection\n\n\n-----\n\nFigure 7. Database after infection\n\n## XMR Coinminer [F30DC9EB.moe]\n\nThe second worker DLL is an XMR Coinminer that starts its routine by retrieving the\nconfiguration over UDP. It then begins executing an embedded XMRig binary with the\nconfiguration pulled, making the bot join the mining pool on 108[.]177[.]235[.]90:443.\n\n\n-----\n\nFigure 8. Custom XMRig running in the foreground\n\n## Operating system execution via SQL Server\n\nPurple Fox focuses on SQL servers as its target as opposed to normal computers for the\nformer’s cryptocurrency-mining activities. This is mainly because of the more powerful\nhardware configuration — for both CPU and memory — that the servers would usually have.\nMore specifically for SQL servers, the combination of CPU, memory, and disk factors should\nscale with the database-related operations to avoid bottlenecks in performance.\n\nThese machines normally possess much greater computing power compared to normal\ndesktops, as such servers are usually fitted with hardware such as the Intel Xeon line of\n[CPUs that produces a significantly higher amount of hash-based calculations (hash rates),](https://www.hashrates.com/cpus/)\nmaking a server more advantageous to coinmining compared to a typical desktop computer.\n\nSince SQL databases support different vectors for executing operating system commands\ndirectly, Purple Fox has leveraged the stealthiest method of having a binary inserted in the\nSQL server database that can be executed via TSQL commands. The following interfaces\nare available from the SQL components for the malicious actors to use when targeting an\nSQL server:\n\nMethod Details\n\n\n-----\n\nNET New Process() + UseShellExecute\nSystem.management.automation.powershell\n[Common Language Runtime (CLR) Assemblies](https://www.netspi.com/blog/technical/adversary-simulation/attacking-sql-server-clr-assemblies/)\n\nC++ ShellExecute/ShellExecuteEx\nxp_cmdshell\n\nCOM objects wscript.shell\nshell.application\n\nTable 2. The available interfaces from the SQL components\n\n[Purple Fox opted to go with the .NET method using CLR Assemblies, a group of DLLs that](https://www.netspi.com/blog/technical/adversary-simulation/attacking-sql-server-clr-assemblies/)\ncan be imported into a SQL Server, in its infection chain instead of the more popular\nxp_cmdshell, which is heavily monitored by security analysts. Once the DLLs have been\nimported, they can be linked to stored procedures that can be executed via a TSQL script.\nThe affected versions for this vector start from SQL Server 2008.\n\nThis method, which requires a system administrator role by default, executes as an SQL\nServer service account. By leveraging this interface, an attacker is able to compile a .NET\nassembly DLL and then have it imported into the SQL server. It is also able to have an\nassembly stored in the SQL Server Table, create a procedure that maps to the CLR method,\nand finally, run the procedure.\n\n[The CLR Assemblies method is reported to have been used before by](https://s.tencent.com/research/report/1105.html) groups other than\nPurple Fox, such as MrbMiner and Lemon Duck.\n\n## Infrastructure\n\nThe C&C servers used in the communication schemes that have been described here are\ninfected servers that are part of the botnet used to host the various payloads for Purple Fox.\nWe deduced this via the following facts:\n\nThe C&C servers are SQL Servers themselves.\nThe HTTP server header is [mORMot, which is written in Delphi, the same language](https://synopse.info/fossil/wiki/Synopse+OpenSource)\nused for the various components.\nThere is a large number of servers (1,000+ in just over a week).\n\nBoth initial DNS requests are CNAMEs to subdomains under kozow[.]com, which is a free\ndynamic domain service provided by dynu[.]com. This service can be updated with an API to\nmake it point to different IP addresses — a technique the attacker uses to change the IP\naddress at a regular interval.\n\n## Other notable characteristics\n\n\n-----\n\nUsing our telemetry, we found non-server systems infected with Purple Fox, indicating that\nthere are other possible initial access methods other than the SQL Server brute-force attack\nto spread the malware.\n\n[This activity is similar to the ones seen in Lemon Duck attacks and even shares some](https://blog.talosintelligence.com/2020/10/lemon-duck-brings-cryptocurrency-miners.html)\ntechniques, like the use of PowerSploit for reflective PE loading and implementing the same\nbackdoor, evilclr.dll, for the SQL Server assembly. Both attacks also share the same goal of\nmining Monero.\n\n## Security recommendations\n\nUpon observing any suspicious activities related to the Purple Fox botnet on a SQL server,\nwe recommend the following steps to completely remove all the malicious remnants from the\ninfection.\n\nReview all the SQL Server’s Stored Procedures and Assemblies for any suspicious\nassemblies not recognized by the DBAs. Remove any of these assemblies if detected.\nExecute the following TSQL script to remove the following remnants of malicious CLR\nassemblies that are inserted into the database:\nUSE [master]\nGO\nDROP ASSEMBLY [fscbd]\nGO\nDisable all the unknown accounts on the database server and change all the\npasswords.\nAs a defensive posture, do not publish externally exposed port TCP 1433 to an\nuntrusted zone. In addition, secure the SQL server hosts via a perimeter firewall in a\nDMZ zone with well-protected access policies.\nImplement proper network microsegmentation and network zoning while also applying\na zero trust policy via your network security controls.\nRestrict the traffic to and from SQL servers. These servers have a very specific\nfunction; therefore, they should only be allowed to communicate with other trusted\nhosts. Inbound and outbound internet accessibility should also be controlled.\n\n## Detections and Mitigations\n\n[Trend Micro Vision One™ with Managed XDR focuses on both the early stages of the attack](https://www.trendmicro.com/en_ph/business/products/detection-response.html)\nkill chain (covered in the previous research) and the final payloads intended to do the actual\ndamage, thereby protecting users of this service against the damage caused by the latest\nevolution of this botnet.\n\n\n-----\n\nBoth the Vision One platform and Managed XDR threat experts can correlate the suspicious\nactivities observed from the protected SQL servers. An environment that has any of the\nbehavioral detections found in our Vision One heuristics rules might mean that the SQL\nservers within the environment have already been affected by an attack. This extends even\nto stealthy malware, such as Purple Fox, that does not store majority of its files on the disk.\n\nSince servers have a predictable network footprint and behavior, unusual or\nunexpected network patterns could be a sign of botnet propagation.\nThe same goes for unusual and unexpected SQL server application login failures that\nseem like brute-force attacks . The main propagation method for Purple Fox when\ninfecting SQL servers uses brute-force attacks rather than acting as a worm that\nexploits only the vulnerable services.\nWhen a SQL server starts having unusual traffic related to UDP and TCP, there should\nbe a massive surge in traffic since it scans public IP addresses and the local network.\nThis will create a domino effect within an environment due to most organizations having\nmore than one SQL server, such as standby or backup servers.\nUnusual network traffic patterns and login failures on the SQL server are also a good\nindicator for this threat.\nA sudden and unexpected spike in CPU utilization on the SQL server could also be a\nsign of SQL bottlenecks or an infection with the XMR Coinminer. Furthermore, there\ncould also be unusual amounts of network traffic on the server as it joins the mining\npool.\n\nMalware\n\nBy examining Purple Fox’s routines and activities, both with our initial research and the\nsubject matter we cover in this blog post, we hope to help incident responders, security\noperation centers (SOCs), and security researchers find and weed out Purple Fox infections\nin their network.\n\nBy: Jay Yaneza, Abdelrhman Sharshar, Sherif Magdy December 13, 2021 Read time: (\nwords)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-13 - A Look Into Purple Fox’s Server Infrastructure.pdf"
    ],
    "report_names": [
        "2021-12-13 - A Look Into Purple Fox’s Server Infrastructure.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536233,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1653788233,
    "ts_modification_date": 1653788233,
    "files": {
        "pdf": "https://archive.orkl.eu/bd4bb7d4655c6dae51559c8723d2373152a977da.pdf",
        "text": "https://archive.orkl.eu/bd4bb7d4655c6dae51559c8723d2373152a977da.txt",
        "img": "https://archive.orkl.eu/bd4bb7d4655c6dae51559c8723d2373152a977da.jpg"
    }
}