{
    "id": "89a11a7f-2ef2-40a0-be70-0c6c58732190",
    "created_at": "2023-03-03T02:06:15.792204Z",
    "updated_at": "2025-03-27T02:09:17.937671Z",
    "deleted_at": null,
    "sha1_hash": "cf1cc4399f0a237ea96adddee13916e13f4c3f24",
    "title": "2023-02-24 - Desde Chile con Malware (From Chile with Malware)",
    "authors": "",
    "file_creation_date": "2023-03-01T09:37:27Z",
    "file_modification_date": "2023-03-01T09:37:27Z",
    "file_size": 240401,
    "plain_text": "# Desde Chile con Malware (From Chile with Malware)\n\n**team-cymru.com/post/from-chile-with-malware**\n\nS2 Research Team February 24, 2023\n\nS2 Research Team\n\n5 days ago\n\n5 min read\n\n**Spoiler Alert: They weren't actually from Chile.**\n\n\n-----\n\n## Introduction\n\nThis blog post provides a short update on our ongoing tracking of infrastructure associated\nwith IcedID. We have posted publicly on IcedID on several occasions over the past year, and\nas far back as [May 2021; they remain a persistent threat.](https://www.team-cymru.com/post/tracking-bokbot-icedid-infrastructuremapping-a-vast-and-currently-active-icedid-network)\n\n**To recap...**\n\n_IcedID (also known as BokBot) started life in early 2017 as a banking trojan that later_\n_evolved to include dropper malware capabilities. These capabilities enable IcedID to_\n_download and deploy additional malware such as Cobalt Strike, with infections sometimes_\n_leading to ransomware._\n\nLate last week we identified a ‘new’ IP address connecting to 5.196.196.252; one of the\ncurrently active IcedID BackConnect C2 servers. These connections were made to the same\nremote port, associated with the SOCKS proxy module, which we wrote about in December\n2022.\n\n## Key Findings\n\nIdentification of an IP address geolocated to Chile, used to access various elements of\nthe IcedID infrastructure.\n\nThe Chilean IP resides in a /24 netblock which is also utilized for hosting IcedID Bot C2\ninfrastructure (on separate IPs).\n\nThreat telemetry data shows consistent connections sourced from the Chilean IP, to an\nIP geolocated to the Netherlands which is used to host two IcedID-connected domains.\n\nWeb browsing activity originating from the Chilean IP provides a snapshot into\nsuspected threat actor TTPs. With an apparent interest in DNS and visits to services\nnoted for association with Conti and LockBit ransomware.\n\n## From Chile... Kind Of\n\n\n-----\n\nThe ‘new’ IP address is assigned to Zappie Host, a New Zealand-based VPS provider,\nalthough geolocation data places it in Chile. Zappie Host, and the specific /24 netblock in\nwhich this IP resides (216.73.159.0/24), is regularly used to host IcedID Bot C2\ninfrastructure.\n\nIn our initial assessment of this ‘Chilean’ IP, we noted a gap in activity between 12 December\n2022 and 26 January 2023; interestingly, this matched timelines we had observed in the\ncase of IcedID Bot, Loader, and BackConnect infrastructure.\n\nWe have generally attributed these drops in activity to the festive and new year celebration\nperiod, infrastructure updates, and on occasion an indication of internal issues impacting the\nthreat operators.\n\nFurther, we noted the use of WireGuard VPN to access the Chilean IP; up to 12 December\n2022. When activity returned in January 2023 this changed to OpenVPN. Both WireGuard\nVPN and OpenVPN were noted in our aforementioned investigation into BackConnect,\nhinting at the potential of a common playbook being used across various elements of\ninfrastructure management associated with IcedID.\n\n## Further Ties to IcedID\n\nExamining threat telemetry data for the Chilean IP, we observed connections to the panel\nport of the IcedID Loader Tier 2 server. This server is used to manage the Tier 1 Loader C2s,\nwhich serve the purpose of receiving initial victim communications and delivering the IcedID\n[DLL. We have previously blogged about these first stage Loader C2s.](https://www.team-cymru.com/post/a-visualizza-into-recent-icedid-campaigns)\n\nFurther connections were also observed to 168.100.8.93:443 (assigned to BLNWX BitLaunch), commencing 27 January 2023 and continuing daily until the time of writing.\nDuring this period of activity, we identified two domains resolving to 168.100.8.93, based on\npDNS and certificate data:\n\n\n-----\n\n**neonmilkustaers[.]com - registered 9 November 2022**\n\n**svoykbragudern[.]com - registered 18 November 2022**\n\nBoth domains are typical of current IcedID domain nomenclature. Looking at domain\nregistration data for the above dates, filtered by registrant organization (Tucows) and name\nserver usage (Njalla), we found other domains registered within close temporal proximity:\n\n**trbiriumpa[.]com - registered 9 November 2022**\n\n**whothitheka[.]com - registered 9 November 2022**\n\n**ebothlips[.]com - registered 9 November 2022**\n\n**olifamagaznov[.]com - registered 18 November 2022**\n\nIf these domains look familiar, that’s because they are - and we applaud your attention to\ndetail. All four domains have been utilized for IcedID Loader C2 infrastructure over the past\nthree months, and as recently as last week.\n\nHowever, the standout observation for 168.100.8.93 and therefore the domains hosted on it,\nare the differences in behavior when compared to other IcedID C2 infrastructure. According\nto our threat telemetry data, we do not see the expected victim communications we would\nusually expect for C2 infrastructure, which therefore makes us question the purpose of these\ndomains.\n\nVictim communications with the Loader C2s tend to occur over TCP/80, so the connections\nfrom the Chilean IP appear to be related to another service. One hypothesis we have is that\nthe Chilean IP and by extension 168.100.8.93 may be used for some form of development or\ntesting purpose.\n\n\n-----\n\n**Figure 1: Summary of Chilean IP Threat Telemetry**\n\n## Threat Operator TTPs\n\nIn addition to the connections to IcedID-linked infrastructure, since 26 January 2023 the\nChilean IP has communicated with dozens of other IP addresses over TCP/443 (HTTPS).\n\nBased on our internal pDNS data, combined with OSINT investigations, we were able to\nidentify domains (or define the general purpose) associated with the majority of these\ndestination IP addresses - i.e., the targets of the connections.\n\nMost consisted of websites related to DNS, privacy, and expected threat actor activity such\nas Tox and Tor usage. There were also visits to Yandex IP space, the Russian search engine\npopular in CIS countries.\n\nBelow we have listed some of the sites visited, which by extension provides an insight into\nthe services and tools the suspected threat actor behind the Chilean IP is interested in:\n\n\n-----\n\n**Sape**\n\nRussian-language SEO service\n\n**MegaNerd encrypted DNS**\n\nEncrypted DNS server and anonymized DNS relay\n\n**Njalla**\n\nAnonymous domain name registrar, hosting and\nVPN provider\n\n​Ibksturm\n\nOpen-source DNS and Tor relay operators\n\n**Libredns[.]gr**\n\nPublic encrypted DNS for maintaining secrecy of\nDNS traffic\n\n**Drink**\n\nOpen-source dynamic authoritative DNS server\n\n**WalletConnect**\n\nOpen-source protocol for connecting decentralized\napplications to mobile wallets with QR code\nscanning or deep linking\n\nA few of these sites are particularly pertinent:\n\n\n**Qaz[.]im**\n\nDisposable email / file sharing\nservice\n\n​Libsodium\n\nLibrary for encryption/decryption,\nsignatures, password hashing\n\n**NextDNS**\n\nDNS resolution service with a core\nfocus on encryption and privacy\n\n**Digitalsize**\n\nPublic, non-tracking, non-filtering\nDNS resolver\n\n**DoH & DNSCrypt Server by**\n**alekberg**\n\nOpen-source encrypted DNS\n\n**Send.vis[.]ee**\n\nSecurely share files via command\nline\n\n​Control D\n\nCustomizable DNS service that can\nredirect traffic through a series of\ntransparent proxies\n\n\n**Libsodium, the library which includes features such as encryption, password hashing,**\n[etc., is also utilized in the LockBit ransomware.](https://chuongdong.com/reverse%20engineering/2022/03/19/LockbitRansomware/)\n\n**Njalla is currently IcedID’s domain registrar of choice, so it is somewhat unsurprising**\nthat it appears here.\n\n\n-----\n\n**[Qaz.im appears in the Conti Leaks, and Conti ransomware was often dropped by](https://github.com/west-wind/conti-leaks/blob/main/conti-URL.txt)**\nIcedID. Based on our observations, it appears this service continues to be used; likely\na result of it being hosted in Russian IP space and therefore deemed (rightly or\nwrongly) to be outside the reach of LEA action.\n\n**Sape, the SEO service, is notable given the recent use of malvertising campaigns as**\nan initial delivery mechanism for IcedID.\n\n## Conclusion\n\nTracking the background infrastructure associated with the day-to-day operation of threats\nlike IcedID allows us to not only identify new victim-facing C2 infrastructure, but also to\nilluminate other elements of interest.\n\nIn this blog we identify a Chilean IP, which based on its activities is likely not operated by a\nChilean actor, utilized for the purposes of access / management of IcedID-linked\ninfrastructure. The surrounding activities provide us with an insight into the motivations of this\nactor and highlight some of the services and tools they may be using or investigating.\n\nWe also allude to some techniques which can be used to identify or confirm IcedID domains,\na topic which we are planning further expansion on in the future.\n\nIn the case of IcedID, whilst we find that the operators can change their spots (making all\nleopards jealous), this is often a gradual process which provides us with opportunities for\npattern-of-life, and as a result infrastructure, identification.\n\n## Recommendations\n\nAlthough not used exclusively by IcedID operators to host their C2 infrastructure, we\nwould recommend that defenders take interest in any activity within their networks\ninbound to / outbound from 216.73.159.0/24.\n\n\n-----\n\nBackConnect C2 infrastructure is fairly static, with a life-cycle of approximately 30 days,\nit is therefore viable to block connections to current C2s. We will continue to post\nupdates to this infrastructure on our Twitter feed - [@teamcymru_S2.](https://twitter.com/teamcymru_S2)\n\nUsers of [Pure Signal Recon will be able to track this activity by querying for inbound](https://www.team-cymru.com/cyber-threat-hunting-tools)\nconnections to 168.100.8.93:443 and pivoting from there.\n\n## IOCs\n\nIcedID Bot C2s from 216.73.159.0/24 (Nov 2022 - Feb 2023):\n\n216.73.159.132\n\n216.73.159.134\n\n216.73.159.29\n\n216.73.159.44\n\n216.73.159.60\n\n216.73.159.80\n\nRecently active BackConnect C2s:\n\n135.148.217.85\n\n5.196.196.252\n\n80.66.88.71\n\nIcedID domains (mentioned):\n\nneonmilkustaers[.]com\n\nsvoykbragudern[.]com\n\nolifamagaznov[.]com\n\ntrbiriumpa[.]com\n\nwhothitheka[.]com\n\n\n-----\n\nebothlips[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-24 - Desde Chile con Malware (From Chile with Malware).pdf"
    ],
    "report_names": [
        "2023-02-24 - Desde Chile con Malware (From Chile with Malware).pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1677809175,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1677663447,
    "ts_modification_date": 1677663447,
    "files": {
        "pdf": "https://archive.orkl.eu/cf1cc4399f0a237ea96adddee13916e13f4c3f24.pdf",
        "text": "https://archive.orkl.eu/cf1cc4399f0a237ea96adddee13916e13f4c3f24.txt",
        "img": "https://archive.orkl.eu/cf1cc4399f0a237ea96adddee13916e13f4c3f24.jpg"
    }
}