{
    "id": "89c57dbc-ef60-4126-9269-73788d1388e1",
    "created_at": "2023-01-12T15:08:51.62263Z",
    "updated_at": "2025-03-27T02:05:28.556566Z",
    "deleted_at": null,
    "sha1_hash": "26f6eb6a85645ced79bad7a2713b17e4ca83c0a2",
    "title": "2020-09-24 - Removing Coordinated Inauthentic Behavior",
    "authors": "",
    "file_creation_date": "2022-05-28T01:53:44Z",
    "file_modification_date": "2022-05-28T01:53:44Z",
    "file_size": 7296112,
    "plain_text": "# Removing Coordinated Inauthentic Behavior\n\n**[about.fb.com/news/2020/09/removing-coordinated-inauthentic-behavior-russia/](https://about.fb.com/news/2020/09/removing-coordinated-inauthentic-behavior-russia/)**\n\nApril 7, 2022\n\n**We removed three separate networks for violating our policy against foreign or**\n**government interference which is coordinated inauthentic behavior (CIB) on behalf of**\n**a foreign or government entity. These networks originated in Russia.**\n\nIn each case, the people behind this activity coordinated with one another and used fake\naccounts as a central part of their operations to mislead people about who they are and what\nthey are doing, and that was the basis for our action. When we investigate and remove these\noperations, we focus on behavior rather than content, no matter who’s behind them, what\nthey post, or whether they’re foreign or domestic.\n\nOver the past three years, we’ve shared our findings about over 100 networks of coordinated\ninauthentic behavior we detected and removed from our platforms. Earlier this year, we\nstarted publishing monthly CIB reports where we share information about the networks we\ntake down to make it easier for people to see progress we’re making in one place. In some\n\n\n-----\n\ncases, like today, we also share our findings soon after our enforcement. Today s takedowns\nwill also be included in our September report. You can find more information about our\n[previous CIB enforcement actions here.](https://about.fb.com/news/tag/coordinated-inauthentic-behavior/)\n\nThe networks we’re announcing today targeted many countries around the world and had\nvery limited following globally at the time of disruption. Much of this activity focused on two\nthings: 1) creating fictitious or seemingly independent media entities and personas to engage\nunwitting individuals to amplify their content and 2) driving people to other websites that\n[these operations control. Similarly to the Russia-based network we removed in August, these](https://about.fb.com/news/2020/09/august-2020-cib-report/)\noperations worked across many internet services and attempted to hire contributors and\nseed their stories with news organizations.\n\nWe’ve seen deceptive campaigns target journalists and public figures in the past, including\nas part of hack-and-leak operations. Hack-and-leak — where a bad actor steals sensitive\ninformation, sometimes manipulates it, and then strategically releases it to influence public\ndebate — is one of the threats we’re particularly focused on and concerned about ahead of\nthe November elections in the US. While we have not seen the networks we removed today\nengage in these efforts, or directly target the US 2020 election, they are linked to actors\n[associated with election interference in the US in the past, including those involved in “DC](https://about.fb.com/news/2020/03/february-cib-report/)\nleaks” in 2016. We anticipate that operations like these may attempt to pivot at any time and\nwe will keep vigilant to find and remove them. We will also continue to share our findings\npublicly to provide context for the adversarial trends we see.\n\nThese threats are a whole-of-society challenge, and we’re working with partners across\nindustry to tackle them. We have shared information about our findings with law\nenforcement, policymakers and industry partners. We are making progress rooting out this\nabuse, but as we’ve said before, it’s an ongoing effort. We’re committed to continually\nimproving to stay ahead.\n\n## What We Found\n\n**1. We removed 224 Facebook users, 35 Pages, 18 Groups and 34 Instagram accounts**\n**for violating our policy against** **[foreign or government interference which is](https://newsroom.fb.com/news/2019/10/inauthentic-behavior-policy-update/)**\n**[coordinated inauthentic behavior on behalf of a foreign or government entity. This](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n**activity originated in Russia and focused primarily on Syria and Ukraine, and to a**\n**lesser extent on Turkey, Japan, Armenia, Georgia, Belarus, and Moldova A small**\n**portion of this activity focused on the UK and the US. (Updated on October 12, 2020 at**\n**_6:30PM PT to reflect the latest enforcement numbers.)_**\n\nWe identified several clusters of connected activity that relied on fake accounts — many of\nwhich had been detected and removed by our automated systems. This network appears to\nhave centered around a number of regions including the Far East, Russia’s neighboring\ncountries, and Syria. They used fake accounts to create elaborate fictitious personas across\nmany internet services, posing as journalists to contact news organizations, purporting to be\n\n\n-----\n\nlocals in countries they targeted, and managing Groups and Pages, some of which\nproclaimed to be hacktivist groups. These clusters also focused on driving people to their offplatform sites and other social media platforms where, among other themes, they promoted\ncontent related to past alleged leaks of compromising information. The operation had almost\nno following on our platforms when we removed it.\n\nThe people behind this campaign posted in many languages including English, Ukrainian,\nRussian and Arabic as they tailored their activity to each audience. They frequently posted\nabout news and current events, including the Syrian civil war, Turkish domestic politics,\ngeopolitical issues in the Asia-Pacific region, NATO, the war in Ukraine, and politics in the\nBaltics, Georgia, Armenia, Ukraine, Russia, Belarus, and the US.\n\nWe identified this activity as part of our investigation into suspected coordinated inauthentic\n[behavior connected to the networks we had removed in August 2018 and](https://about.fb.com/news/2018/08/more-coordinated-inauthentic-behavior/) [February 2020.](https://about.fb.com/news/2020/03/february-cib-report/)\nAlthough the people behind this operation took steps to conceal their identities and\ncoordination, our investigation connected these clusters to the Russian military including\nmilitary intelligence services.\n\n_Presence on Facebook and Instagram: 224 Facebook accounts, 35 Pages, 18 Groups_\nand 34 Instagram accounts (Updated on October 12, 2020 at 6:30PM PT to reflect\n**_the latest enforcement numbers.)_**\n_Followers: About 8,500 accounts followed one or more of these Pages, about 9,500_\naccounts joined one or more of these Groups, and around 7,500 people followed one\nor more of these Instagram accounts\n_Advertising: About $60 in spending for ads on Facebook paid for in US dollars and_\nrubles.\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\nTranslation:\n\nImage title: Disputed Kuril Islands\n\nCaption: #Russia #Japan #Kuril islands\n\n#Shinzō_Abe\n\n#SecondWorldWar #islands #claims Bad historical memory\n\n\n-----\n\n-----\n\n-----\n\n**2. We also removed one Page, five Facebook accounts, one Group and three**\n**Instagram accounts for** **[foreign or government interference which is](https://newsroom.fb.com/news/2019/10/inauthentic-behavior-policy-update/)** **coordinated**\n**inauthentic behavior on behalf of a foreign or government entity. This small network**\n**originated in Russia and focused primarily on Turkey and Europe, and also on the**\n**United States.**\n\n\n-----\n\nThis operation relied on fake accounts — some of which had been already detected and\nremoved by our automated systems — to manage their Page and their Group, and to drive\npeople to their site purporting to be an independent think-tank based primarily in Turkey.\nThese accounts posed as locals based in Turkey, Canada and the US. They also recruited\npeople to write for their website. This network had almost no following on our platforms when\nwe removed it.\n\nThe people behind this activity posted off-platform articles primarily in English and Turkish\nabout global news and current events relevant to the countries they targeted, including local\nelections; geopolitical conspiracies; presidential and parliamentary elections in Hong Kong,\nSpain, the UK, and the US; social and racial injustice; police brutality; the coronavirus\npandemic; criticism of US sanctions in the Middle East, US foreign policy, and US allies\nincluding Israel; and politics in Venezuela.\n\nWe began this investigation based on information from the FBI about this network’s offplatform activity. Our internal investigation enabled us to find the full scope of this network on\nFacebook. Although the people behind this activity attempted to conceal their identity and\ncoordination, our investigation found links to individuals associated with past activity by the\nRussian Internet Research Agency (IRA).\n\n_Presence on Facebook and Instagram: 5 Facebook accounts, 1 Pages, 1 Group and 3_\nInstagram accounts\n_Followers: About 4,900 accounts followed this Page, 1 account joined this Group and_\nabout 5,600 people followed one of more of these Instagram accounts.\n_Advertising: Around $4,800 in spending for ads on Facebook paid for in euros and_\nrubles.\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\nTranslation: Travel limit brought in #China’s #Hubey state due to #coronavirus has been\nremoved. #Sinciang #Uyghur Autonomous Region schools are open again as no more cases\nare seen. #COVID19 #Qingfeipaidutang\n\n\n-----\n\n-----\n\n**3. We also removed 23 Facebook accounts, 7 Pages, and 3 Instagram accounts for**\n**[foreign or government interference which is](https://newsroom.fb.com/news/2019/10/inauthentic-behavior-policy-update/)** **[coordinated inauthentic behavior on](https://newsroom.fb.com/news/2018/12/inside-feed-coordinated-inauthentic-behavior/)**\n**behalf of a foreign or government entity. This network originated in Russia and**\n**focused on global audiences, Russia’s neighboring countries including Belarus.**\n**_(Updated on October 12, 2020 at 6:30PM PT to reflect the latest enforcement_**\n**_numbers.)_**\n\nWe identified several clusters of connected activity that used a combination of authentic and\nfake accounts — some of which had been already disabled by our automated detection\nsystems — to create fictitious personas, post and comment on content, manage Pages,\namplify their content, and drive people to off-platform sites posing as independent journals.\nThese fake personas posed as editors and researchers to solicit articles for these websites.\n\n\n-----\n\nThis network posted primarily in Russian and English about news and current events,\nincluding protests and elections in Belarus, Russian and Ukrainian politics, geopolitical\nconspiracies, Russia-NATO relations, Russia’s relations with neighboring countries, and\ncriticism of US foreign policy, socio-economic issues in the US, and US political candidates\non both sides of the political spectrum.\n\nWe found this activity as a result of our investigation into the suspected coordinated\n[inauthentic behavior linked to our previous enforcement in July 2019. Although the people](https://about.fb.com/news/2019/07/removing-cib-thailand-russia-ukraine-honduras/)\nbehind this activity attempted to conceal their identities and coordination, our investigation\nfound links to individuals in Russia, including those associated with Russian intelligence\nservices.\n\n_Presence on Facebook and Instagram: 23 Facebook accounts, 7 Pages, and 3_\nInstagram accounts. (Updated on October 12, 2020 at 6:30PM PT to reflect the\n**_latest enforcement numbers.)_**\n_Followers: About 60,000 accounts followed one or more of these Pages and around_\n2,000 people followed one or more of these Instagram accounts. (Updated on\n**_October 12, 2020 at 6:30PM PT to reflect the latest numbers.)_**\n_Advertising: About $13,000 in spending for ads on Facebook and Instagram paid for_\nprimarily in rubles. (Updated on October 12, 2020 at 6:30PM PT to reflect the latest\n**_numbers.)_**\n\nBelow is a sample of the content posted by some of these Pages and accounts:\n\n\n-----\n\n-----\n\nTranslation:\nPage title: Strategic Culture foundation\nCaption: The indigenous population of European countries is aging and extinct, and Muslim\nfamilies are common, and this is fueled by the continuous influx of immigrants from the East\n\n\n-----\n\ncountries.\n\nTranslation:\nPage title: Strategic Culture foundation\nCaption: The West is trying to drag Belarus, probably not perfect, but overall stable, on the\nsame path that Ukraine, Syria, Libya and the former Yugoslavia are walking.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-24 - Removing Coordinated Inauthentic Behavior.pdf"
    ],
    "report_names": [
        "2020-09-24 - Removing Coordinated Inauthentic Behavior.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536131,
    "ts_updated_at": 1743041128,
    "ts_creation_date": 1653702824,
    "ts_modification_date": 1653702824,
    "files": {
        "pdf": "https://archive.orkl.eu/26f6eb6a85645ced79bad7a2713b17e4ca83c0a2.pdf",
        "text": "https://archive.orkl.eu/26f6eb6a85645ced79bad7a2713b17e4ca83c0a2.txt",
        "img": "https://archive.orkl.eu/26f6eb6a85645ced79bad7a2713b17e4ca83c0a2.jpg"
    }
}