{
    "id": "89d94352-6d43-472a-8255-e5c252565bb9",
    "created_at": "2023-01-12T15:07:43.923673Z",
    "updated_at": "2025-03-27T02:16:25.860883Z",
    "deleted_at": null,
    "sha1_hash": "ee4a06548f76f6250eb82ad919688b7d09c8859d",
    "title": "2021-07-29 - MeteorExpress - Mysterious Wiper Paralyzes Iranian Trains with Epic Troll",
    "authors": "",
    "file_creation_date": "2022-05-28T02:15:49Z",
    "file_modification_date": "2022-05-28T02:15:49Z",
    "file_size": 2673239,
    "plain_text": "# MeteorExpress | Mysterious Wiper Paralyzes Iranian Trains with Epic Troll\n\n**[labs.sentinelone.com/meteorexpress-mysterious-wiper-paralyzes-iranian-trains-with-epic-troll/](https://labs.sentinelone.com/meteorexpress-mysterious-wiper-paralyzes-iranian-trains-with-epic-troll/)**\n\nJuan Andrés Guerrero-Saade\n\n## Executive Summary\n\nOn July 9th, 2021 a wiper attack paralyzed the Iranian train system.\nThe attackers taunted the Iranian government as hacked displays instructed\npassengers to direct their complaints to the phone number of the Iranian Supreme\nLeader Khamenei’s office.\nSentinelLabs researchers were able to reconstruct the majority of the attack chain,\nwhich includes an interesting never-before-seen wiper.\nOPSEC mistakes let us know that the attackers refer to this wiper as ‘Meteor’,\nprompting us to name the campaign MeteorExpress.\nAt this time, we have not been able to tie this activity to a previously identified threat\ngroup nor to additional attacks. However, the artifacts suggest that this wiper was\ndeveloped in the past three years and was designed for reuse.\nTo encourage further discovery of this new threat actor, we are providing indicators as\nwell as hunting YARA rules for fellow security researchers.\n\n## Introduction\n\n\n-----\n\nOn July 9th, 2021 reports began to surface of a wiper attack disrupting service for the Iranian\nrailway system. The attack included epic level trolling as reports suggest that train schedule\ndisplays cited “long delay[s] because of cyberattack” along with instructions to contact\n‘64411’ –the number for the office of Supreme Leader Ali Khamenei.\n\nIran\n\n[International (Twitter)](https://twitter.com/IranIntl_En/status/1413574416953401344)\nEarly reporting did not pick up much steam as it’s not uncommon for Iranian authorities to\nvaguely point the finger towards cyber attacks only to retract the claims later. But it doesn’t\nhurt to check.\n\n[We would like to acknowledge security researcher Anton Cherepanov who pointed out an](https://twitter.com/cherepanov74/status/1416643609131114497?s=20)\n[early analysis (Farsi) by an Iranian antivirus company. Despite a lack of specific indicators of](https://threats.amnpardaz.com/malware/trojan-win32-breakwin/)\ncompromise, we were able to recover most of the attack components described in the post\nalong with additional components they had missed. Behind this outlandish tale of stopped\ntrains and glib trolls, we found the fingerprints of an unfamiliar attacker.\n\n\n-----\n\n## The Attack Chain\n\nMeteorExpress Attack Chain\nThough early reports did not include technical specifics, we were able to reconstruct most of\nthe attack components relying on a combination of factors – early analysis by Padvish\nsecurity researchers as well as a recovered attacker artifact that included a longer list of\ncomponent names. The attackers abused Group Policy to distribute a cab file to conduct\ntheir attack.\n\nThe overall toolkit consists of a combination of batch files orchestrating different components\ndropped from RAR archives. The archives decompressed with an attacker supplied copy of\nRar.exe coupled with the password ‘hackemall’. The wiper components are split by\nfunctionality: Meteor encrypts the filesystem based on an encrypted configuration, `nti.exe`\ncorrupts the MBR, and `mssetup.exe locks the system.`\n\nWhile we were able to recover a surprising amount of files for a wiper attack, some have\neluded us. The MBR corrupter, `nti.exe, is most notable among those missing`\ncomponents as Padvish researchers noted that the sectors overwritten by this component\nare the same as those overwritten by NotPetya. Until we are able to find this file, we can’t\ncorroborate their finding.\n\nThe following is a breakdown of the central components of this attack.\n\n## The Batch Files\n\n\n-----\n\nThe majority of the attack is orchestrated via a set of batch files nested alongside their\nrespective components and chained together in successive execution.\n\nThe following is a short description of the main functionality of these batch files.\n\nsetup.bat\n```\nsetup.bat is the first component executed via group policy. Interestingly, it deletes a\n\n```\nscheduled task called ‘AnalyzeAll’ under the Windows Power Efficiency Diagnostics\ndirectory. At this time, we haven’t been able to identify this task. This batch file is responsible\nfor copying the initial components via a CAB file in a network share within the Iranian\nrailways network. The CAB file is expanded and update.bat is executed with the parameters\n‘hackemall’, relevant paths, and the Meteor wiper executable (env.exe).\n\n\n-----\n\nenvxp.bat\n```\nenvxp.bat appears to be a simpler alternative version of setup.bat. As the name suggests,\n\n```\nperhaps it’s intended for Windows XP.\n```\nupdate.bat is a well written batch script that takes care of placing the remaining files and\n\n```\ndirecting the remainder of the execution flow by calling the successive batch scripts. It takes\nthree arguments: the password for the rar archives, the working directory, and the location of\nthe payload. If the first two parameters are empty, it’ll exit smoothly. In the absence of a\npayload, the script attempts to run `msapp.exe . That component is listed in the Padvish`\nsecurity writeup but the execution flow via setup.bat points to `env.exe as the intended`\npayload. We’ll delve into this component below.\n\nupdate.bat’s makeshift mutex\nThe script checks for a hardcoded ‘lock_file’ under `C:WindowsTemp__lock6423900.dat .`\nThe file serves as a makeshift mutex to avoid double execution and could double as a\nvaccine to avoid infection during development.\n\n\n-----\n\nupdate.bat directing the execution flow to subsequent batch files\nThe batch file uses its own copy of WinRAR to decompress additional components from\nthree additional archives ( programs.rar, `bcd.rar,` `ms.rar ) using the same Pokemon-`\nthemed password, “hackemall” (Hack ’Em All). With each RAR archive, `update.bat calls a`\nsubsequent batch archive before deleting the respective archive. The developers are very\ncareful about cleaning up their components as soon as they’re used.\n\nAt this point the execution begins to bifurcate into other scripts. The first one is `cache.bat,`\nwhich focuses on clearing obstacles and preparing the ground for subsequent elements with\nthe use of PowerShell.\n\ncache.bat disabling network adapters and checking for Kaspersky antivirus\n```\ncache.bat performs three main functions. First, it will disconnect the infected device from\n\n```\nthe network. Then it checks to see if Kaspersky antivirus is installed on the machine, in which\ncase it’ll exit.\n\n\n-----\n\ncache.bat creating Windows Defender exclusions for attack components\nFinally, `cache.bat will create Windows Defender exclusions for all of its components,`\neffectively clearing the way for a successful infection without impediments. This script proved\nparticularly valuable for us in rebuilding the entire attack chain as it lists most of the attack\ncomponents giving us a threat hunting shopping list of sorts. It’s worth noting that this is the\nonly batch script we’ve recovered that embeds PowerShell.\n\nSubsequently, `update.bat calls` `bcd.bat, which serves two functions: rendering the`\nmachine unbootable and cleaning up event logs.\n\nbcd.bat script overwrites boot.ini\nIn order to disable the machine’s ability to boot up, `bcd.bat creates an alternative boot.ini`\nfile that points the bootloader to impossibly high disk and partition numbers (10000000) and\noverwrites the system’s copy of `boot.ini . The script then uses the native` `bcdedit`\ncommand to list boot option identifiers and deletes each.\n\nbcd.bat clears event logs\n\n\n-----\n\nThe attackers then use the native `wevtutil command to clear Security, System, and`\nApplication event logs. And finally, it abuses a legitimate SysInternals tool called `Sync (the`\nequivalent of the native UNIX `sync() ) to manually flush the cache of filesystem data to`\ndisk.\n```\nupdate.bat will then call msrun.bat, passing the Meteor wiper executable as a\n\n```\nparameter. That script will in turn set the stage for its execution.\n\nmsrun.bat preparing to execute the Meteor wiper\n```\nmsrun.bat moves several components into place including a screen locker\n\n```\n( mssetup.exe ) and the encrypted configuration for the Meteor wiper ( msconf.conf ). The\nscript also moves four additional files: `mscap.bmp,` `mscap.jpg,` `mssetup.reg,`\n```\nmsuser.reg . At the time of writing, we were unable to recover the .reg files and have no\n\n```\nindication of what role they play. The image files are the background images that will replace\nthe wallpaper on locked machines.\n\n\n-----\n\nmscap.jpg lockscreen image\nThe same script then creates a scheduled task called `mstask set to execute the Meteor`\nwiper at five minutes to midnight.\n\n\n-----\n\nupdate.bat calls the wiper and screen locker\nThe final portion of update.bat checks whether `mssetup.exe and the Meteor wiper are`\nrunning, taking appropriate actions like exiting the script or restarting the machine as\nnecessary.\n\n## A Wiper Triad\n\n\n-----\n\nThere s a strange level of fragmentation to the overall toolkit. Batch files spawn other batch\nfiles, different rar archives contain intermingled executables, and even the intended action is\nseparated into three payloads: Meteor wipes the filesystem, `mssetup.exe locks the user`\nout, and `nti.exe presumably corrupts the MBR. We have been able to identify two out of`\nthree components and detail their inner workings below.\n\nInternal naming convention visible\n\nwithin the wiper binary\nThe main payload of this convoluted attack chain is an executable dropped under `env.exe`\nor `msapp.exe . Internally, the coders refer to it as ‘Meteor’. While this particular instance of`\nMeteor suffers from a crippling OPSEC failure (the inclusion of verbose debug strings\npresumably intended for internal testing), it’s an externally configurable wiper with an\nextensive set of features.\n```\nSHA256\n2aa6e42cb33ec3c132ffce425a92dfdb5e29d8ac112631aec068c8a78314d49b\nSHA1\n86e4f73c384d84b6ecd5ad9d7658c1cc575b54df\nMD5\n04633656756847a79c7a2a02d62e5522\nCompilation Timestamp\n2021-01-17 18:59:25\nFirst Submission\n2021-07-12 06:01:11\nSize\n587KB\nITW names\nenv.exe / msapp.exe\n\n```\nThe Meteor wiper is executed as a scheduled task, called `mstask and set to run at five`\nminutes to midnight. It’s supplied with a single argument, an encrypted JSON configuration\nfile, `msconf.conf`\n(68e95a3ccde3ea22b8eb8adcf0ad53c7993b2ea5316948e31d9eadd11b5151d7), that holds\nvalues for corresponding keys contained in cleartext within the binary:\n\n\n-----\n\n```\nstate_path\nlog_encryption_key\nprocesses_to_kill\nprocess_termination_timeout\nlog_server_port\nlocker_background_image_jpg_path\nauto_logon_path\nlocker_background_image_bmp_path\nstate_encryption_key\nlog_server_ip\nlog_file_path\npaths_to_wipe\nwiping_stage_logger_interval\nlocker_installer_path\nlocker_exe_path\nlocker_registry_settings_files\nlocker_password_hash\nusers_password\ncleanup_scheduled_task_name\nself_scheduled_task_name\ncleanup_script_path\nis_alive_loop_interval\n\n```\nAt its most basic functionality, the Meteor wiper takes a set of paths from the encrypted\nconfig and walks these paths, wiping files. It also makes sure to delete shadow copies and\nremoves the machine from the domain to avoid means of quick remediation. The wiper\nincludes a wealth of additional functionality, most of which isn’t used in this particular attack,\nincluding:\n\nChanging passwords for all users\nDisabling screensavers\nProcess termination based on a list of target processes\nInstalling a screen locker\nDisabling recovery mode\nChanging boot policy error handling\nCreating scheduled tasks\nLogging off local sessions\nChanging lock screen images for different Windows versions (XP, 7, 10)\nCreating processes and executing commands\n\n\n-----\n\nMeteor wiper attempts two different methods to remove victim machine from Domain\nThe developers resort to multiple redundant methods to accomplish each of their objectives.\nFor example, Meteor will attempt to remove the machine from the domain via WinApi\nfunctions. If that fails it will then attempt to do the same via an equivalent WMI command.\n\nTaking a step back to evaluate the development of Meteor and what it might tell us about the\nthreat group involved, we must note that the composition of this binary is beset by\ncontradictory practices.\n\nFirst, the code is rife with sanity checks, error checking, and redundancy in accomplishing its\ngoals. However, the operators clearly made a major mistake in compiling a binary with a\nwealth of debug strings meant for internal testing. The latter is an indication that despite\nwhatever advanced practices the developers have in their arsenal, they lack a robust\ndeployment pipeline that ensures such mistakes do not happen. Moreover, note that this\nsample was compiled six months before its deployment and the mistake was not caught.\n\nLock My PC 4\n\nembedded within Meteor\n\n\n-----\n\nSecondly, the code is a bizarre amalgam of custom code that wraps open-source\n[components (cpp-httplib v0.2) and practically ancient abused software (FSProLabs’ Lock My](https://github.com/yhirose/cpp-httplib)\nPC 4). While that might suggest that the Meteor wiper was built to be disposable, or meant\nfor a single operation, that’s juxtaposed with an externally configurable design that allows\nefficient reuse for different operations. Many of the available keys are not instantiated in this\noperation, like the ability to kill specific processes. Additionally, that external configuration is\nencrypted, presumably to limit analysis, but all of the configurable keys are hardcoded in\nplaintext within the main binary.\n\nMeteor overwrites boot.ini with the same template as bcd.bat\nTaking a step back to look at the entire toolkit deployed in this operation, there are also some\noverlaps between the functionality contained within Meteor and that of other components\nexecuted beforehand that suggest some operational segmentation between developers of\ndifferent components and the operators themselves. Functionality carried out with batch\nscripts is also embedded within Meteor such as disabling network adapters and corrupting\nboot.ini. The wiper also includes a commercial screen locker and yet this functionality is\nredundantly instantiated through a separate binary, `mssetup.exe .`\n\nThe externally configurable nature of the wiper entails that it wasn’t created for this particular\noperation. However, at the time of writing, we’ve been unable to find other attacks or variants\nof the Meteor wiper. For that reason, we are supplying a very broad (but well tested) hunting\nYARA rule below.\n\n## ‘mssetup.exe’ Screenlocker\n\nmssetup.exe’s WinMain()\n\nfunction\nThe MeteorExpress operators drop a standalone screenlocker. Despite a wealth of C++\ntemplate and exception handling code, `mssetup.exe is simple. Most of its functionality is`\npictured above. It blocks user input before creating a Window that fills the entire screen. If an\nimage is available at the hardcoded path `C:tempmscap.bmp (dropped by the` `msrun.bat`\nscript), then it’ll use this image to fill the screen. Otherwise, it’ll draw a black rectangle. It’ll\n\n\n-----\n\nthen disable the cursor and effectively lock the user out entirely. It s worth noting that though\nthis binary was clearly developed by the same production pipeline, it doesn’t include any of\nthe verbose debug strings nor overt logging functionality.\n```\nSHA256\n074bcc51b77d8e35b96ed444dc479b2878bf61bf7b07e4d7bd4cf136cc3c0dce\nSHA1\ne55cee8b49f80e957b52976b2da6379e329466a3\nMD5\n9a49102f53291a644bd14c8202d8fbe3\nCompilation Timestamp\n2021-01-17 18:59:28\nFirst Submission\n2021-07-12 06:04:15\nSize\n85KB\nITW names\nmssetup.exe\n\n## A Missing MBR Corruptor\n\n```\nFinally, the Padvish security blog makes reference to an additional executable, `nti.exe,`\nthat serves as an MBR corruptor. We’ve been unable to recover this at this time and suspect\nthat the incident responders were unable to recover it themselves as their analysis centers\non the corrupted MBRs rather than the binary.\n\nDescription of nti.exe Google translated from Farsi\nOne interesting claim in the Padvish blog is that the manner in which `nti.exe corrupts the`\nMBR is by overwriting the same sectors as the infamous NotPetya. While one’s first instinct\nmight be to assume that the NotPetya operators were involved or that this is an attempt at a\nfalse flag operation, it’s important to remember that NotPetya’s MBR corrupting scheme was\nmostly [cribbed from the original Petya used for criminal operations. An additional](https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html)\ninconsistency from the Padvish blog is their claim that `update.bat runs` `nti.exe . While`\nthey’re likely referring to a different version in their possession, our copy of update.bat makes\nno overt reference to nti.exe.\n\n\n-----\n\n## Conclusion\n\nConflict in cyberspace is overpopulated with increasingly brazen threat actors. Behind the\nartistry of this epic troll lies an uncomfortable reality where a previously unknown threat actor\nis willing to leverage wiper malware against public railways systems. The attacker is an\nintermediate level player whose different operational components sharply oscillate from\nclunky and rudimentary to slick and well-developed.\n\nOn the one hand, we have a new externally-configurable wiper packed full of interesting\ncapabilities, involving a mature development process, and redundant means to accomplish\ntheir goals. Even their batch scripts include extensive error checking, a feature seldom\nencountered with deployment scripts. Their attack is designed to cripple the victim’s systems,\nleaving no recourse to simple remediation via domain administration or recovery of shadow\ncopies.\n\nOn the other hand, we see an adversary that doesn’t yet have a handle on their deployment\npipeline, using a sample of their malware that contains extensive debug features and burning\nfunctionality irrelevant to this particular operation. There’s feature redundancy between\ndifferent attack components that suggests an uncoordinated division of responsibilities\nacross teams. And files are dispensed in a clunky, verbose, and disorganized manner\nunbecoming of advanced attackers.\n\nWe cannot yet make out the shape of this adversary across the fog. Perhaps it’s an\nunscrupulous mercenary group. Or the latent effects of external training coming to bear on a\nregion’s nascent operators. At this time, any form of attribution is pure speculation and\nthreatens to oversimplify a raging conflict between multiple countries with vested interests,\nmeans, and motive.\n\nBehind this epic troll/stunning provocation there’s a lot more to uncover in getting to know the\nactor behind MeteorExpress. We should keep in mind that the attackers were already familiar\nwith the general setup of their target, features of the domain controller, and the target’s\nchoice of backup system (Veeam). That implies a reconnaissance phase that flew entirely\nunder the radar and a wealth of espionage tooling that we’ve yet to uncover.\n\nHappy Hunting.\n\n## Indicators of Compromise\n\n[IoCs and Yara hunting rules available on SentinelLabs GitHub.](https://github.com/SentineLabs/meteor-express)\n\n## References\n\n\n-----\n\nhttps://www.timesofisrael.com/hack-causes-chaos-on-iran-trains-posts-supreme-leadersnumber-for-complaints/\nhttps://www.voanews.com/middle-east/voa-news-iran/hackers-disrupt-irans-rail-service-fakedelay-messages\nhttps://www.reuters.com/world/middle-east/hackers-breach-iran-rail-network-disrupt-service2021-07-09/\n[https://twitter.com/cherepanov74/status/1416643609131114497?s=20](https://twitter.com/cherepanov74/status/1416643609131114497?s=20)\n[https://threats.amnpardaz.com/malware/trojan-win32-breakwin/](https://threats.amnpardaz.com/malware/trojan-win32-breakwin/)\n[https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html](https://www.malwaretech.com/2017/06/petya-ransomware-attack-whats-known.html)\nhttps://www.reuters.com/article/us-emirates-tech-israel/uae-target-of-cyber-attacks-afterisrael-deal-official-says-idUSKBN28G0BW\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-29 - MeteorExpress - Mysterious Wiper Paralyzes Iranian Trains with Epic Troll.pdf"
    ],
    "report_names": [
        "2021-07-29 - MeteorExpress - Mysterious Wiper Paralyzes Iranian Trains with Epic Troll.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536063,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653704149,
    "ts_modification_date": 1653704149,
    "files": {
        "pdf": "https://archive.orkl.eu/ee4a06548f76f6250eb82ad919688b7d09c8859d.pdf",
        "text": "https://archive.orkl.eu/ee4a06548f76f6250eb82ad919688b7d09c8859d.txt",
        "img": "https://archive.orkl.eu/ee4a06548f76f6250eb82ad919688b7d09c8859d.jpg"
    }
}