{
    "id": "8a0b95a4-4898-47f9-a39c-0515f6dae877",
    "created_at": "2023-01-12T15:10:54.826947Z",
    "updated_at": "2025-03-27T02:05:45.917341Z",
    "deleted_at": null,
    "sha1_hash": "14854e2c708734402e8a373f154ea899fdcecff9",
    "title": "2019-06-24 - GandCrab Threat Actors Retire...Maybe",
    "authors": "",
    "file_creation_date": "2022-05-28T19:02:57Z",
    "file_modification_date": "2022-05-28T19:02:57Z",
    "file_size": 231067,
    "plain_text": "# GandCrab Threat Actors Retire...Maybe\n\n**[fortinet.com/blog/threat-research/gandcrab-threat-actors-retire.html](https://www.fortinet.com/blog/threat-research/gandcrab-threat-actors-retire.html)**\n\nJune 24, 2019\n\nIn a surprising announcement two weeks ago, the threat group behind the malware operation\nGandCrab announced that they had shut down their operations. Until that point, GandCrab\nhad been one of the most active malware campaigns of the past year, both in terms of\ndistribution and rapid development. FortiGuard Labs has covered their progress in a series of\n[articles, as well as in a presentation at AVAR2018.](https://fortiguard.com/events/2744/avar2018-the-gandcrab-mentality)\n\nIn an announcement as novel and cavalier as the threat actors themselves – reflecting their\npublic persona since they first surfaced – they have now made a grand exit by thanking their\naffiliates and detailing their earnings.\n\nThey claim that their Ransom-as-a-Service (RaaS) operation had a total of $2 billion in\nearnings. In a pay scheme of 60%-40% (70%-30% in some cases), giving the larger\npercentage of the payments to their affiliates, they claim that they personally earned $150\nmillion from their operations.\n\nFigure 1: GandCrab announces retirement (image from twitter: @CryptoInsane)\n\n## Arrival on the Ransomware Scene\n\n\n-----\n\n[GandCrab first appeared on exploit.in, a Russian hacking forum, on January 28, 2018, at a](https://exploit.in/)\ntime when file-encrypting malware distribution was seemingly declining. Despite this,\nGandCrab was able to make a significant impact, infecting more than 50,000 victims in just\ntheir first month of operation.\n\nThey were also notable at the time because they were the first criminal organization to only\naccept DASH cryptocurrency as ransom payment, although they later decided to accept\nother cryptocurrencies. They also hosted their C2s using the .BIT TLD using a centralized\nDNS server (a.dnspod.com), which nominally claimed to mirror the namespace of Namecoin.\nWhile .BIT is commonly associated with the NameCoin organization for their decentralized\n[DNS project, GandCrab’s association with NameCoin was later debunked by the](https://www.namecoin.org/2018/01/30/recent-reports-ransomware-using-namecoin-missing-real-story.html)\norganization.\n\nFigure 2: GandCrab’s advertisement post in the Russian forum exploit.in (image from twitter:\n@CryptoInsane)\n\n## Aggressive Distribution\n\nGandCrab’s aggressive distribution network was built through its affiliate program and\n[partnerships with other services, such as the binary crypter NTCrypt, along with other actors](https://www.zdnet.com/article/gandcrab-ransomware-teams-up-with-crypter-service/)\nwith expertise in distribution through RDP and VNC. At first, they only targeted western\ncountries, primarily in Latin America. Later, they expanded to partnering with malware\n[distributors in China and South Korea, with our detection of a spam campaign delivering a](https://www.fortinet.com/blog/threat-research/venuslocker-delivering-rotten-easter-eggs-in-south-korea.html)\nGandCrab payload targeting South Korea as recently as last April.\n\n## An Unusual But Probably Effective Marketing Tactic\n\nDue to the rapid development of GandCrab, FortiGuard Labs as well as other security\nresearchers have been actively monitoring changes between releases. In addition to new\nfeatures, these have also included public stunts through novelty messages that the threat\nactors embedded to their binaries as a way to taunt researchers and security organizations.\nThis approach created noise, which may have made them arguably one of the most covered\nand talked about Ransomware families of the past year. This unusual strategy demonstrated\nan almost unprecedented level of criminal bravado, and even a sense of invincibility, since\nthey were able to release public announcements that messed with the security community\nwithout any repercussions.\n\nFigure 3: Messages embedded by threat actors to taunt researchers and organizations\n\nIn another unusual marketing tactic, GandCrab actors also used reports from security\ncompanies to promote the success of their service, while mocking their adversaries.\n\nFigure 4: GandCrab advertisement using reports from security companies as their signature\n\n\n-----\n\n## Agile Development\n\nPart of GandCrab’s success was due to their use of an agile development approach that\nenabled rapid releases of new versions. This was best described in our article on the\n[development of GandCrab v4.x. A detailed discussion of the full timeline of GandCrab](https://www.fortinet.com/blog/threat-research/a-chronology-of-gandcrab-v4-x.html)\n[development can also be found in our AVAR2018: GandCrab Mentality presentation.](https://fortiguard.com/events/2744/avar2018-the-gandcrab-mentality)\n\nFigure 5: GandCrab v4.0-v4.4 timeline\n\n## Bugs, Breaches, and GandCrab’s Demise\n\nUsing this agile development approach enabled them to successfully evade detection by\nmany security companies. A good example of this is when Ahnlab released a vaccine tool to\nprevent the malware from executing in a system by creating a file that the malware checked\nbefore performing its encryption routine. This started a tit-for-tat between the two, which even\nled to the threat actors disclosing a Denial-of-Service attack POC against one of Ahnlab’s\nproducts. This was also discussed in our article on the GandCrab v4.x timeline.\n\nHowever, GandCrab was no exception to the drawbacks of using a fast-paced development\napproach, as bugs and loopholes began to be discovered in distributed versions. For\ninstance, in the very early versions of the malware they were using hardcoded RC4 keys to\nencrypt their outbound traffic that also contained the private keys, which would have enabled\nto the decryption of the victim’s ransomed files. Another simple but serious slip-up was when\nthey failed to set a flag when generating their RSA keys. This led to a copy of the private key\n[being stored locally on the victim’s system. We also discussed a bug that we found when](https://www.fortinet.com/blog/threat-research/gandcrab-v3-accidentally-locks-systems-with-new--change-wallpape.html)\nthey first added the feature that changed the wallpaper of their victims. However, they quickly\nfixed these mistakes in the next release.\n\nBut perhaps their biggest mishap – one that we believe led to their eventual demise – were\nbreaches to their server-side infrastructure, which led to leaks of the private keys of victims.\nA month after their operation began, BitDefender, in collaboration with Europol, released a\nfree decryption tool for victims of GandCrab v1. At the time, there was very limited\ninformation as to how they were able to do this – at least until the ransomware perpetrators\nthemselves announced that their payment page has been compromised, which we suspect\nled to the creation of the decryption tool.\n\nFigure 6: GandCrab posts about the breach to their payment page\n\nWe believe that similar breaches eventually led to the subsequent release of the decryption\ntool used to decrypt files encrypted by new versions of the malware. In fact, just two weeks\nafter GandCrab’s retirement announcement, BitDefender released a new version of a\n[decryption tool that supports the latest (v5.2) version of the malware.](https://labs.bitdefender.com/2019/06/good-riddance-gandcrab-were-still-fixing-the-mess-you-left-behind/)\n\n## Solution\n\n\n-----\n\nFortiGuard customers are protected by the following:\n\nLatest versions of GandCrab are detected by our specific and heuristic detections\nFortiSandbox rates the GandCrab’s behavior as high risk\n\n## Conclusion\n\nGandCrab was a Ransomware-as-a-Service malware managed by a criminal organization\nknown to be confident and vocal, while running a rapidly evolving ransomware campaign.\nThrough their aggressive, albeit unusual, marketing strategies and constant recruitment of\naffiliates, they were able to globally distribute a high volume of their malware.\n\nHowever, through a recent forum post, the GandCrab team has now publicly announced the\nend of a little more than a year of ransomware operations, citing staggering profit figures.\nHowever, considering how witty and novel this threat group has been throughout the course\nof their campaign, it wouldn’t be a surprise if this retirement announcement was just another\nof their many public stunts. If there’s one thing that sets these threat actors apart from other\ngroups, it is that they are unpredictable; so there is always the possibility that they might resurface in one form or another. In the meantime, FortiGuard Labs will continue to monitor for\nany new activities from this group.\n\n-= FortiGuard Lion Team =\n_[Learn more about FortiGuard Labs and the FortiGuard Security Services portfolio.](https://www.fortinet.com/fortiguard/threat-intelligence/threat-research.html?utm_source=nreleaseblog&utm_campaign=2018-q2-fortiguardlabs-cta)_ _Sign_\n_up for our weekly FortiGuard Threat Brief._\n\n_[Read about the FortiGuard Security Rating Service, which provides security audits and best](https://www.fortinet.com/support-and-training/support-services/fortiguard-security-subscriptions/security-rating.html?utm_source=blog&utm_campaign=2018-blog-security-rating-service)_\n_practices._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-06-24 - GandCrab Threat Actors Retire...Maybe.pdf"
    ],
    "report_names": [
        "2019-06-24 - GandCrab Threat Actors Retire...Maybe.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536254,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653764577,
    "ts_modification_date": 1653764577,
    "files": {
        "pdf": "https://archive.orkl.eu/14854e2c708734402e8a373f154ea899fdcecff9.pdf",
        "text": "https://archive.orkl.eu/14854e2c708734402e8a373f154ea899fdcecff9.txt",
        "img": "https://archive.orkl.eu/14854e2c708734402e8a373f154ea899fdcecff9.jpg"
    }
}