{
    "id": "8a2f4598-7af0-4a0f-9471-a00ab3b60330",
    "created_at": "2023-01-12T15:01:11.525353Z",
    "updated_at": "2025-03-27T02:16:03.238028Z",
    "deleted_at": null,
    "sha1_hash": "77dd61bc0fd91d91ca4c13854dba34a9cd66e141",
    "title": "2016-03-25 - ProjectM- Link Found Between Pakistani Actor and Operation Transparent Tribe",
    "authors": "",
    "file_creation_date": "2022-05-28T00:33:24Z",
    "file_modification_date": "2022-05-28T00:33:24Z",
    "file_size": 1155248,
    "plain_text": "# ProjectM: Link Found Between Pakistani Actor and Operation Transparent Tribe\n\n**[unit42.paloaltonetworks.com/unit42-projectm-link-found-between-pakistani-actor-and-operation-transparent-tribe](https://unit42.paloaltonetworks.com/unit42-projectm-link-found-between-pakistani-actor-and-operation-transparent-tribe)**\n\nRobert Falcone, Simon Conant March 25, 2016\n\nBy [Robert Falcone and](https://unit42.paloaltonetworks.com/author/robertfalcone/) [Simon Conant](https://unit42.paloaltonetworks.com/author/simon-conant/)\n\nMarch 25, 2016 at 10:00 AM\n\n[Category: Threat Prevention,](https://unit42.paloaltonetworks.com/category/threat-prevention-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit42/)\n\nTags: [Operation C-Major,](https://unit42.paloaltonetworks.com/tag/operation-c-major/) [Operation Transparent Tribe,](https://unit42.paloaltonetworks.com/tag/operation-transparent-tribe/) [ProjectM,](https://unit42.paloaltonetworks.com/tag/projectm/) [Trojan](https://unit42.paloaltonetworks.com/tag/trojan/)\n\n_Be the first to receive the latest news, cyber threat intelligence and research from Unit 42._\n[Subscribe Now.](https://www.paloaltonetworks.com/threat-research)\n\nUnit 42 is currently researching an attack campaign that targets government and military\n[personnel of India. This attack appears to overlap with the Operation Transparent Tribe and](https://www.proofpoint.com/tw/threat-insight/post/Operation-Transparent-Tribe)\n[Operation C-Major campaigns that targeted Indian embassies in Saudi Arabia and](http://documents.trendmicro.com/assets/pdf/indian-military-personnel-targeted-by-information-theft-campaign-cmajor.pdf)\nKazakhstan, as well as the Indian military.\n\nWe are tracking the group of actors involved in this campaign as ‘ProjectM.’ During our\nresearch, we found a linkage between the infrastructure used by ProjectM and an individual\nfrom Pakistan. We cannot definitively confirm this individual is involved with this attack\ncampaign, but the evidence that we will discuss in this blog post suggests that it is highly\nlikely that this individual has some involvement with the threat group.\n\nThis blog post highlights the trail of evidence individuals leave on the Internet when they are\nnot careful about disguising their identity. All of the information collected about this actor is\npublic and accessible through open source research.\n\n### Overview of Transparent Tribe\n\nThe ProjectM actors rely on both spear-phishing emails and watering hole sites to deliver a\nvariety of different tools to target the Indian government and military. ProjectM actors used a\nblog with a theme related to the Indian military titled “India News Tribe”\n(intribune.blogspot.com) as a watering hole to deliver their payloads. This group also used\nspear-phishing emails with malicious RTF files exploiting CVE-2010-3333 or CVE-20120158, in addition to Excel files that contained malicious macros to download and install their\npayloads as well.\n\n\n-----\n\nThe actors have access to a sizeable toolset of Trojans that they use in their attack\ncampaigns, including custom developed tools called Crimson and Peppy, along with off-theshelf remote administration tools (RATs) and downloaders, such as DarkComet and Bozok.\nAnother interesting part of this campaign is the use of techniques and Trojans often seen in\ncybercrime attacks, such as the use of the Andromeda Trojan as an initial payload in their\n[attacks to download and execute other tools in their toolset. The Operation Transparent Tribe](https://www.proofpoint.com/tw/threat-insight/post/Operation-Transparent-Tribe)\nreport by Darien Huss of Proofpoint provides an excellent analysis of the various tools used\nby this group, including Crimson and Peppy and their associated infrastructure.\n\n### Registration Slip Up\n\nDuring our research, we analyzed the registration information of the Andromeda, Crimson\nand Peppy Trojan command and control domains used by ProjectM. A majority of the\ninfrastructure associated with ProjectM was registered using WHOIS protection services,\nwhich conceals the actual registrant’s information (name, email, etc.) used to register the\ndomain name. However, we discovered that the actors had in all likelihood, inadvertently\nneglected to use WHOIS protection on two domains in their infrastructure that they used to\nhost C2 servers for the Andromeda Trojan.\n\nThe two undisguised domains were “winupdater[.]info” and “ordering-checks[.]com”, which\nwere registered using the email address “mshoaib.yaseen [at] gmail.com”, as seen in Figure\n1. The Andromeda samples used these undisguised domains to deliver Peppy Trojans that\nused the previously observed ProjectM domain “bbmdroid.com” as a C2 server. The email\naddress and information used to register these domains appears to be real and associated\nwith the actor, which differs from most infrastructure used in targeted attacks that use fake\ninformation and a disposable email account during registration. On August 5, 2014, the actor\nseemingly discovered his mistake as the “ordering-checks[.]com” domain was updated with\nWHOIS protection.\n\n\n-----\n\nDomain Name: winupdater.info\nRegistrant ID: CR144993459\n\nRegistrant Name: Xtex Studios\n\nRegistrant Organization: Xtex Studios\n\nRegistrant Street: R-240 Sector 15A\n\nRegistrant City: Karachi\n\nRegistrant State/Province: Sindh\n\nRegistrant Postal Code: 74200\n\nRegistrant Country: PK\n\nRegistrant Phone: +92.3452183117\n\nRegistrant Phone Ext:\n\nRegistrant Fax:\n\nRegistrant Fax Ext:\n\nRegistrant Email:\nmshoaib.yaseen@gmail.com\n\n\nDomain Name: ordering-checks.com\nCreated On: 2014-02-11\n\nExpiration Date: 2015-02-11\n\nRegistrant Name: Muhammad Kamran\n\nRegistrant Street1: R02323 Karachi\n\nRegistrant City: Karachi\n\nRegistrant State/Province: Sindh\n\nRegistrant Postal Code: 74200\n\nRegistrant Country: PK\n\nRegistrant Phone: +92 3452183117\n\nRegistrant Fax: +92 3452183117\n\nRegistrant Email:\nmshoaib.yaseen@gmail.com\n\n\n_Figure 1 WHOIS Information for Two Command and Control Domains without Whois_\n_Protection_\n\n## Who is in ProjectM?\n\nThe Gmail address seen in Figure 1 is directly linked to Facebook, LinkedIn, Google+, and\nSkype accounts. All of the accounts have corroborative biographical content, giving us a\npossible identity of a potential actor, who appears to be a 26-year-old individual from\nKarachi, Pakistan. At this time, we cannot absolutely confirm this individual’s involvement\nwith ProjectM, Operation Transparent Tribe or Operation C-Major campaigns; however,\nstrong evidence was discovered linking this individual’s online presence to entities related to\nthe threat group, which can be seen in the chart in Figure 2. Additionally, content posted to\nthe social networking accounts suggest that the actor has an anti-Indian sentiment, which\nmay be a motivating factor for the actor to participate in such attack campaigns.\n\n\n-----\n\n_Figure 2 Diagram of links between the actor and ProjectM_\n\n### Web Designer by Trade\n\nWe believe the individual associated with the email address “mshoaib.yaseen [at] gmail.com”\nwas at one time and possibly still involved in web design services, as well as revenue\ngenerating efforts using Google AdSense. Interestingly, it appears that the individual reused\nservers and domains set up during web design efforts to host malicious content used in\nattack campaigns as well.\n\nThe web design and technology services company hosted at “apnits[.]4t[.]com” listed the\nphone number \"0345-2183117\" for its chief executive and as its support number. This phone\nnumber is the same as seen in the registration information in Figure 1 without the country\ncode “+92”. We did not find any malicious content on this site; however, we did find content\nthat suggests it was last revised in November 2006.\n\n\n-----\n\nAnother web design company created by the individual was discovered at xtexhosts.com .\nThe phone number “+92.3452183117” was also found in the WHOIS information and was\nregistered using the email “spid3rsoft [at] gmail.com”. We do not have any indication of\nmalicious content hosted on xtexhosts.com, but it appears that the actor created it for Xtex\nStudios, which appears to be another web design company started by the actor.\n\nWe found a third domain, “easternkingsology[.]com,” that contained registration information\nwith the name “Xtex Studios” and the registration email of “mshoaib.yaseen [at] gmail.com”\nuntil the domain expired in December 2015. The “easternkingsology[.]com” domain hosted a\nBozok RAT sample at hxxp://easternkingsology[.]com/det/dllbb.exe (SHA256:\ne4dfcf3db512260e1a4ff414907610d5d5279143fa9ade9219d8691be02e512f), which\nsuggests the threat actor hosted this Trojan on an Xtex Studios related domain for use in a\nProjectM campaign. Figure 3 shows an advertisement of the services provided by Xtex\nStudios using “mshoaib.yaseen [at] gmail.com” and “karachian.gem [at] hotmail.com” for\ncontact purposes.\n\n_Figure 3 Website Advertising Xtex Studios Services Linking Two Email Addresses_\n\n\n-----\n\nWe found the registration phone number and email address for xtexhosts[.]com on an\nadvertisement for another web design company called SPID3R[.]SOFT. The advertisement\nseen in Figure 4 was hosted on “sahirlodhi[.]com”, which was a domain also used by\nProjectM as the download location for a sample of the Crimson tool. At first we hypothesized\nthat sahirlodhi[.]com may have been a compromised site, as it appeared to be the official site\nfor the Pakistani television actor Sahir Lodhi. On May 10, 2008, the domain registration\ninformation was updated to include the registrant email of “mshoaib.yaseen[at]gmail.com”,\nsuggesting the threat actor was involved in the creation of this website. The registration\ninformation for this domain remained the same until May 21, 2014 when it was updated to\ninclude WHOIS privacy protection. We believe that the threat actor still had access to the\nsahirlodhi[.]com webserver and used it to host the payload for ProjectM, further suggesting\nthat the actor reuses domains and servers to host content and payloads unrelated to its\noriginal purpose.\n\n_Figure 4 Advertisement of SPID3R.SOFT Web Design_\n\nIn addition to xtexhosts[.]com, the domain “thefriendsmedia[.]com” was also registered using\nthe email “spid3rsoft[at]gmail.com”. This domain hosts a multimedia website that claims it is\n“Asia’s Biggest Entertainment Portal”. Unit 42 saw this domain hosting several ProjectM\n\n\n-----\n\ntools, including the exact same Andromeda and Peppy samples as those previously\nobserved using bbmdroid[.]com as a C2, which were hosted at “/est/estma.exe” and\n“/est/controller.exe” respectively.\n\nThe “thefriendsmedia[.]com” site makes references to “thefriendsfm[.]com”, which was\noriginally registered in October 2010 using the email “mshoaib.yaseen[at]gmail.com”. On\nMarch 24, 2014, the actor shared a link on his Facebook (figure 5) and Google+ accounts to\nan article hosted on “thefriendsfm[.]com” titled “MOD Assistant Director and Staff Grade NTS\nResults 2014”, which is currently still present on the “thefriendsmedia[.]com” domain. The\npost discusses applying for positions at the Pakistani Ministry of Defense (MOD), but we do\nnot have any conclusive evidence that the actor applied to or is connected in anyway with\nthe MOD.\n\n_Figure 5 Actor's Facebook post to an article regarding jobs in Pakistan's Ministry of Defense_\n\n### Social Media Activity\n\nThe email address “karachian.gem[at]hotmail.com” seen in the advertisement of Xtex\nStudios led to the discovery of the possible identity of an individual that is likely involved with\nProjectM. Unit 42 found the individual’s Google+ profile, seen in Figure 6 and noticed that the\nprofile had several posts that included domains that had hosted payloads or were C2 servers\nassociated with ProjectM, such as:\n\nbbmdroid[.]com (Peppy, Bozok)\nshobitech[.]com (Peppy, DarkComet, Andromeda)\nmustache-styles[.]com (Andromeda)\nmessagerieneuf[.]com (Crimson)\nsahirlodhi[.]com (Crimson)\n\n\n-----\n\n_Figure 6 Possible Actor Involved with ProjectM_\n\nAlso, Facebook and Google+ posts include \"Bind an exe in excel file | Microsoft Excel Exploit\n| ShobiTech\" (Figure 7), which is interesting as ProjectM has used malicious Excel delivery\ndocuments with macros to download and install payloads in its attack campaign.\n\n_Figure 7 - Actor discusses technique seen in campaigns_\n\nThe “shobitech[.]com” domain also appeared in one of the actor’s Facebook accounts. This\nFacebook account provided a great deal of information about the actor, specifically in the\nphotos section. The actor used the shobitech[.]com domain in 2013 to host details of a\ntraining course (Figure 8) that he was conducting on how to monetize YouTube using Google\nAdSense.\n\n\n-----\n\n_Figure 8 Advertisement Associated with a Training Conducted by Actor_\n\nThe photos also show the actor obtained a certificate for completing the “Windows Exploit\nDevelopment Megaprimer” online course hosted on udemy.com and screenshots of the actor\nusing various offensive security tools, such as Metasploit on Kali Linux (Figure 9). The\nOperation Transparent Tribe report suggested that Meterpreter samples were used as\npayloads in the campaign, which is interesting as Meterpreter is part of the Metasploit\nFramework that the individual has had experience with according to the photos uploaded to\nhis Facebook account.\n\n\n-----\n\n_Figure 9 Photo Uploaded to Facebook Account of Individual Using Metasploit_\n\nFurthermore, another Facebook account belonging to this actor points to\n“shoaibyaseen[.]com”, which appears to host this individual’s personal blog. The blog has a\ntotal of twelve posts between February 29, 2016, and March 2, 2016. The topics posted to\nthis blog include network port scanning and data gathering techniques, as well as commands\nto run using Metasploit and Meterpreter to accomplish various tasks to exploit systems and\ncarry out post-exploitation activities. While the use of Meterpreter in Figure 9 and the topics\nin the “shoaibyaseen[.]com” blog in Figure 10 do not directly implicate this individual, it does\nstrongly suggest that he possesses skills that would be valuable to offensive campaigns like\nthose conducted by ProjectM.\n\n\n-----\n\n_Figure 10 Recent posts on the actor's blog with topics including Metasploit and post_\n_exploitation activities_\n\nAnother interesting observation about this actor is that his name shows up in the debug\nsymbol path of several Crimson tools. The actor’s name appears in the debug symbol path of\nsamples of the Crimson downloader and the remote administration tool, suggesting the actor\nmay have been involved with the development of this Trojan. For instance, the following\nshows an example of the actor's name in the debug symbol path of a Crimson downloader\n(SHA256: dc8bd60695070152c94cbeb5f61eca6e4309b8966f1aa9fdc2dd0ab754ad3e4c):\n\n_E:\\Projects\\m_project\\main\\mj shoaib\\Thin_\n_Client\\secure_scan\\secure_scan\\obj\\x86\\Debug\\secure_scan.pdb_\n\n### Actor's Early Blogging\n\nThe email address “karachian.gem[at]hotmail.com” also led us to the individual’s blogger\naccount, which was created in April 2008. The “About Me” section of this blogger account\nstates that this individual lives in Karachi, Pakistan and studied computer science. This\naccount also created several other blogs as well, most of which had little content of interest\nwith the following exceptions:\n\nbbmdroid[.]blogspot[.]com\nindian-attack[.]blogspot[.]com\nFreeowlsofminerva[.]blogspot[.]com\n\n\n-----\n\n_Figure 11 Picture of Individual Associated with Blogger Accounts_\n\nThe first related blog of interest is bbmdroid[.]blogspot[.]com that contains a link to\n“bbmdroid[.]com”, which hosted C2 services for various ProjectM tools. The indianattack[.]blogspot[.]com does not contain any malicious exploit code or payloads, but has a\ntheme of terrorism in India. A blog with a theme related to India closely resembles the India\nNews Tribe (intribune[.]blogspot[.]com) blog that ProjectM used in Operation Transparent\nTribe to deliver Crimson payloads.\n\nThe “freeowlsofminerva[.]blogspot[.]com” blog was created on August 24, 2013, to offer a\nservice for players of the MapleStory MMORPG. The links on the blog point to Excel\nspreadsheets hosted on “microsoftexcel[.]united-host[.]us”, such as:\n\n_hxxp://microsoftexcel[.]united-host[.]us/Downloads/(Bera)%20FM%20Price%20List.xls_\n\nThe blog also includes a link at the bottom of the page to a VirusTotal scan of a file named\n“(Bera) FM Price List.xlsx” that showed that no antivirus vendors detected the file as\nmalicious. We do not have access to the spreadsheets hosted “microsoftexcel[.]unitedhost[.]us” to confirm if they were malicious or not; however, we did observe a DarkComet\npayload (SHA256:\ncc488690ce442e9f98bac651218f4075ca36c355d8cd83f7a9f5230970d24157) hosted on this\nserver at “microsoftexcel[.]united-host[.]us/update.exe”. The fact that a payload was hosted\non this server leads us to believe the inclusion of the link to a VirusTotal analysis is a social\nengineering attempt to increase the likelihood a victim would click the links.\n\n\n-----\n\n_Figure 12 Use of VirusTotal Report to Increase Likelihood of Victim Clicking Links_\n\n## Conclusion\n\nProjectM is a threat group conducting targeted attacks on government and military personnel\nof India. Unit 42 has linked several different domains within ProjectM’s infrastructure to an\nindividual residing in Pakistan. This corresponds with the suspicions of David Sancho and\nFeike Hacquebord at Trend Micro, who documented a likely Pakistani link to the activity in\ntheir [Operation C-Major report.](http://blog.trendmicro.com/trendlabs-security-intelligence/indian-military-personnel-targeted-by-information-theft-campaign/)\n\nAt this time, we cannot elaborate on the extent of this individual’s involvement with the\ntargeted attacks; however, it does appear that the individual was involved with setting up\nsome portion of the infrastructure used by the various payloads delivered in the attack\ncampaign. According to the individual’s social media pages and blogs, it strongly suggests\nhe possesses skills to carry out offensive activities in ProjectM campaigns. Also, the\nindividual’s name appearing within Crimson Trojan samples suggests that he may have been\ninvolved with the creation of the malware as well.\n\nTrend Micro reported finding gigabytes of personal identifiable information (PII) in open\ndirectories on C2 servers related to ProjectM, mostly belonging to Indian Army personnel.\nAlthough such PII might be used for financial gain, we find multiple instances in social media\nand blogs where this actor states anti-Indian sentiments, suggesting he is potentially\npolitically motivated.\n\nWhile knowing the identity and motivations of a possible actor is not necessarily actionable\nfrom a defensive perspective, it does provide a good reminder that people are always behind\nan attack, as it is easy to become fixated solely on the technical aspects of malware and\ninfrastructure.\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-03-25 - ProjectM- Link Found Between Pakistani Actor and Operation Transparent Tribe.pdf"
    ],
    "report_names": [
        "2016-03-25 - ProjectM- Link Found Between Pakistani Actor and Operation Transparent Tribe.pdf"
    ],
    "threat_actors": [
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535671,
    "ts_updated_at": 1743041763,
    "ts_creation_date": 1653698004,
    "ts_modification_date": 1653698004,
    "files": {
        "pdf": "https://archive.orkl.eu/77dd61bc0fd91d91ca4c13854dba34a9cd66e141.pdf",
        "text": "https://archive.orkl.eu/77dd61bc0fd91d91ca4c13854dba34a9cd66e141.txt",
        "img": "https://archive.orkl.eu/77dd61bc0fd91d91ca4c13854dba34a9cd66e141.jpg"
    }
}