{
    "id": "8a414e78-53a2-4960-af24-36c3f04858df",
    "created_at": "2023-01-12T15:08:13.680064Z",
    "updated_at": "2025-03-27T02:16:50.812721Z",
    "deleted_at": null,
    "sha1_hash": "311029232a81cedcb1eb7766e8030e51325abcfb",
    "title": "2017-06-02 - QakBot Banking Trojan Causes Massive Active Directory Lockouts",
    "authors": "",
    "file_creation_date": "2022-05-28T17:07:53Z",
    "file_modification_date": "2022-05-28T17:07:53Z",
    "file_size": 1392250,
    "plain_text": "# QakBot Banking Trojan Causes Massive Active Directory Lockouts\n\n**[securityintelligence.com/qakbot-banking-trojan-causes-massive-active-directory-lockouts/](https://securityintelligence.com/qakbot-banking-trojan-causes-massive-active-directory-lockouts/)**\n\nJune 2, 2017\n\n[Home&nbsp/](https://securityintelligence.com/) [Advanced Threats](https://securityintelligence.com/category/x-force/threats/)\nQakBot Banking Trojan Causes Massive Active Directory Lockouts\n\n\n-----\n\n[Advanced Threats June 2, 2017](https://securityintelligence.com/category/x-force/threats/)\nBy [Mike Oppenheim co-authored by Kevin Zuk,](https://securityintelligence.com/author/michael-oppenheim/) [Matan Meir,](https://securityintelligence.com/author/matan-meir/) [Limor Kessem 10 min read](https://securityintelligence.com/author/limor-kessem/)\n_[Research for this blog was facilitated by X-Force IRIS contributors Mark Yason and](https://securityintelligence.com/author/mark-yason/)_ _Paul_\n_Sabanal._\n\nIBM X-Force Research recently observed a wave of malware-induced Active Directory (AD)\nlockouts across several incident response engagements. The lockouts caused hundreds to\nthousands of AD users to get locked out of their company’s domain in rapid succession,\nleaving employees of the impacted organizations unable to access their endpoints, company\nservers and networked assets.\n\nActive Directory manages users and user access on Microsoft servers, as well as the\npolicies and procedures that enable network access. X-Force researchers associated the\nmass AD lockouts with malicious activity by an existing banking Trojan known as QakBot,\naka PinkSlip.\n\nX-Force Incident Response and Intelligence Services (IRIS) responders, who investigated\nrecent QakBot activity waves, suspect that numerous organizations have suffered and will\ncontinue to suffer from these lockout waves.\n\n## QakBot Back in Business\n\nAccording to X-Force research, QakBot is financial malware known to target businesses to\n[drain their online banking accounts. The malware features worm capabilities to self-replicate](https://securityintelligence.com/unwrapping-the-mystery-did-a-big-slimy-internet-worm-make-hundreds-of-organizations-wannacry/)\nthrough shared drives and removable media. It uses powerful information-stealing features to\nspy on users’ banking activity and eventually defraud them of large sums of money.\n\n\n-----\n\nThough well-known and familiar from previous online fraud attacks, QakBot continually\nevolves. This is the first time IBM X-Force has seen the malware cause AD lockouts in\naffected organizational networks.\n\nAlthough part of QakBot is known to be a worm, it is a banking Trojan in every other sense.\nQakBot is modular, multithread malware whose various components implement online\nbanking credential theft, a backdoor feature, SOCKS proxy, extensive anti-research\ncapabilities and the ability to subvert antivirus (AV) tools. Aside from its evasion techniques,\ngiven admin privileges, QakBot’s current variant can disable security software running on the\nendpoint.\n\nOverall, QakBot’s detection circumvention mechanisms are less common than those used by\nother malware of its class. Upon infecting a new endpoint, the malware uses rapid mutation\nto keep AV systems guessing. It makes minor changes to the malware file to modify it and, in\nother cases, recompiles the entire code to make it appear unrecognizable.\n\n[Read the white paper: Shifting the balance of power with cognitive fraud prevention](https://www-01.ibm.com/marketing/iwm/dre/signup?source=mrs-form-9451&S_PKG=ov54550%20)\n\n## QakBot’s Dropper Run\n\nMuch like other malware of its class, the QakBot Trojan is ushered into infected endpoints\nthrough a dropper. The dropper typically uses delayed execution to evade detection. It lands\non the target endpoint and halts before any further action for 10 to 15 minutes, hoping to\nelude sandboxes that might try to analyze it upon arrival. Next, the dropper opens an\nexplorer.exe instance and injects the QakBot Dynamic Link Libraries (DLL) into that process.\n\nAfter deployment, the dropper corrupts its original file. It uses the ping.exe utility to invoke a\nping command that will repeat six times in a loop:\n\nC:\\Windows\\System32\\cmd.exe” /c ping.exe -n 6 127.0.0.1 & type\n“C:\\Windows\\System32\\autoconv.exe” à “C:\\Users\\UserName\\Desktop\\7a172.exe\n\nWhen the pings are complete, the contents of the original QakBot dropper are overwritten by\nthe legitimate Windows autoconv.exe command. (Autoconv.exe converts file allocation table\n(FAT) and FAT32 volumes to the NTFS file system, leaving existing files and directories intact\nat startup after Autochk runs.) A snippet of QakBot’s JavaScript downloader is shown below:\n\n_Figure 1: QakBot downloader script_\n\nIn the example above, the download locations that would fetch the QakBot payload were\nlightly obfuscated using character codes. The downloader from this sample attempted to\nconnect to the following three update servers:\n\nprojects[.]montgomerytech[.]com\n\n\n-----\n\nn[.]abcwd0.seed.fastsecureservers[.]com\ncss.kbaf.myzen[.]co[.]uk\n\nAt the time we ran the sample, the following download server responded with a large amount\nof ASCII hex, which was the QakBot payload:\nprojects[.]montgomerytech[.]com/TealeafTarget.php.\n\n_Figure 2: QakBot obfuscated payload_\n\nShortly after the payload was received on the infected machine, randomly named copies of\nQakBot were deployed to the system, as was the legitimate autoconv.exe utility.\n\nTo communicate with infected machines via rendezvous domains created on the fly, QakBot\n[uses both a Domain Generation Algorithm (DGA) and a list of hardcoded command-and-](http://resources.infosecinstitute.com/domain-generation-algorithm-dga/#gref)\ncontrol (C&C) servers. The hardcoded C&C servers observed in our sample are included at\nbottom of this article.\n\n## Persistence Mechanisms\n\nQakBot is notorious for its capability to persist on infected machines. This, combined with the\nmalware’s AD lockout capabilities, makes it especially frustrating to detect and remove in\nenterprise environments.\n\nTo keep itself alive after system reboots and removal attempts, QakBot establishes\npersistence mechanisms on the target systems using a Registry runkey and scheduled\ntasks. It creates a “\\CurrentVersion\\Run” registry entry to automatically launch itself after\neach new run of the operating system. An example run key created by the malware was\n“HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\xyhz,” which pointed to\n“C:\\Users\\UserName\\AppData\\Roaming\\Microsoft\\Graroaojr\\graroaoj.exe.”\n\nQakBot adds another layer of persistence and creates recurring, named, scheduled tasks via\n“schtasks.exe” to run itself on timed intervals and ensure that it has not been disabled or\nremoved.\n\n_Figure 3: QakBot Process tree showing schtasks.exe and ping usage._\n\nQakBot typically creates two named scheduled tasks. The first scheduled task periodically\nlaunches QakBot:\n\nC:\\Windows\\system32\\schtasks.exe” /create /tn {1F289CDD-BD80-4732-825C4D2D43DA75AB} /tr\n“\\”C:\\Users\\UserNameUserName\\AppData\\Roaming\\Microsoft\\Graroaojr\\graroaoj.exe\\””\n/sc HOURLY /mo 7 /F\n\n\n-----\n\nThe second scheduled task launches a separate JavaScript based downloader with a .wpl\nextension:\n\nC:\\Windows\\system32\\schtasks.exe” /create /tn {E6AA46C7-AE96-4859-A21C5E01C0866746} /tr “cmd.exe /C \\”start /MIN C:\\Windows\\system32\\cscript.exe\n//E:javascript \\”C:\\Users\\UserName\\AppData\\Local\\Microsoft\\graroaoj.wpl\\”\\”” /sc\nWEEKLY /D TUE /ST 12:00:00 /F\n\n## Resident QakBot’s Active Directory Lockouts\n\nWhile observing QakBot’s effect on the Active Directory domain, X-Force researchers\nwitnessed the malware performing the following three activities:\n\n1. Locking out hundreds to thousands of accounts in quick succession;\n2. Automated logon attempts, which can be launched using accounts that do not exist\n\n(i.e., argo, operator, administrador, user, prof, owner, usuario, admin,\nHP_Administrator, HP_Owner, Compaq_Owner, Compaq_Administrator, etc.); and\n3. Deploying malicious executables to network shares and registering them as a service.\n\n### Guessing User Credentials Until Lockout\n\nTo spread through the affected network, QakBot can move laterally, both automatically and\non demand, by a remote command from its C&C server. To activate that capability, the\nattacker launches the malware’s command “13,” also known as “nbscan” in earlier variants of\nQakBot.\n\nTo access and infect other machines in the network, the malware uses the credentials of the\naffected user and a combination of the same user’s login and domain credentials, if they can\nbe obtained from the domain controller (DC). QakBot may collect the username of the\ninfected machine and use it to attempt to log in to other machines in the domain. If the\nmalware fails to enumerate usernames from the domain controller and the target machine,\nthe malware will use a list of hardcoded usernames instead.\n\n_Figure 4: QakBot’s hardcoded usernames._\n\nTo authenticate itself to the network, the malware will attempt to match usernames with\nvarious passwords. We have observed three password schemes, which may serve to defeat\n[weak or default passwords:](https://securityintelligence.com/its-time-for-users-to-pony-up-and-quit-reusing-passwords/)\n\nThe username equals the password (for example, username = administrator; password\n= administrator).\nThe password is the reversed username (for example, username = administrator;\npassword = rotartsinimda).\n\n\n-----\n\nThe username is tested with various hardcoded passwords in a dictionary attack style.\n\n_Figure 5: QakBot’s hardcoded password strings used in dictionary attack style._\n\nBelow is the assembly of a stack frame to attempt a connection to the IPC$ administrative\nshare of a target machine using a username obtained from a domain controller:\n\n_Figure 6: Attempted connection to the IPC$ administrative share._\n\nIPC$ is part of the common hidden network shares that are accessible only to administrators.\nAttackers may use it in conjunction with administrator-level credentials to remotely access a\nnetworked system over server message block (SMB). Usually, the purpose is to interact with\nsystems using remote procedure calls, transfer files and run transferred binaries through\nremote execution, which could help QakBot run its malicious code.\n\nOnce the malware successfully connects to the IPC$ administrative share of the target\nmachine, it checks to determine whether it can create a service locally. If it can, QakBot\nproceeds to enumerate the network shares of the target machine and then attempts to drop\na copy of itself to one of the shares. Once a copy of the malware is dropped, the malware\ncreates and starts a service in the target machine to execute it.\n\nUnder certain domain configurations, the malware’s dictionary attack for accessing the target\nmachines can result in multiple failed authentication attempts, which eventually trigger an\naccount lockout.\n\n_Figure 7: Accounts lockouts logged._\n\n## Enter Banking Trojan Mode\n\nQakBot’s main purpose is to take over the bank accounts of a business, and possibly those\nof infected employees who browse their online banking at work.\n\nQakBot implements [man-in-the-browser (MitB) functionality that allows injected malicious](https://securityintelligence.com/tricks-of-the-trade-a-deeper-look-into-trickbots-machinations/)\ncode to be inserted into online banking sessions. Instead of keeping them inside its\nconfiguration file, QakBot fetches these malicious scripts on the fly from the domain it\ncontrols, in the following format:\n\nhxxps://[AttackerDomain/wbj/br/content/TargetBankName/TargetBankName.js\n\nThese scripts are commonly referred to as webinjections because they are used to\nmanipulate the visual content that infected users see on their banking websites. The code\nsnippet below, labeled “WIRE” by the author, appears to check whether “To enroll in the” is\nvisible on the wire transfer page of the targeted bank.\n\n\n-----\n\nThis is very typical Trojan behavior, designed to figure out where to start inserting the\nmalicious code to modify the page and match the fraud M.O. the attacker has planned. It’s\neasy to see in this example that QakBot is targeting corporate banking services and aiming\nto reach the “change address” page of the compromised account.\n\n_Figure 8: QakBot webinjections targeting corporate banking accounts._\n\nAnother snippet from the same webinjection script seeks to collect personal information\ndisplayed in the online banking session by querying the document object model (DOM)\nelements of the page with names that are known to house sensitive details, such as date of\nbirth and Social Security number.\n\n_Figure 9: QakBot webinjections harvest victim personally identifiable information (PII)._\n\n### Information Stealing Modules\n\nThe malware’s operators typically use QakBot to piggyback on banking sessions initiated by\nthe user. QakBot’s theft mechanisms allow it to steal information including:\n\nUser keystrokes;\nCached credentials;\nDigital certificates;\nHTTP(S) session authentication data;\nCookies, including authentication tokens and Flash cookies; and\nFTP and POP3 credentials.\n\nOther data typically exfiltrated by QakBot and sent to a criminal-controlled FTP server\ninclude:\n\nSystem information;\nIP address;\nDomain Name System (DNS) name;\nHost name;\nUsername;\nDomain;\nUser privilege;\nOS version;\nNetwork interfaces (address, netmask and status);\nInstalled software;\nCredentials from the endpoint’s protected storage;\nAccount name and webserver credentials;\nConnection type;\nPOP3 username, server and password; and\n\n\n-----\n\nSMTP server and email addresses.\n\n### Typical Online Propagation\n\nQakBot propagation in the wild most often takes place via exploit kits (EKs) and spam\ncampaigns that target employees rather than widespread webmail users. Once inside the\nnetwork, QakBot acts as a worm that can spread through network shares and removable\ndrives.\n\nIn terms of magnitude, researchers reported that a recent QakBot botnet had successfully\nmilitarized over 54,000 infected computers.\n\n### QakBot’s Targets\n\nDiscovered in the wild in 2009, QakBot is historically considered one of the most advanced\nbanking Trojans active in the wild. It is also the first Trojan that was designed to exclusively\ntarget the business banking sector, a vocation to which it has kept true throughout the past\neight years.\n\nIn current QakBot campaigns, the malware is focused on U.S. business banking services,\nincluding treasury, corporate banking and commercial banking. X-Force IRIS responders\nhave seen QakBot attacks in the pharmaceutical and technology sectors.\n\n_Figure 10: Current QakBot configuration by target type (Source: IBM X-Force)._\n\nAccording to X-Force researchers, QakBot’s operators have been upgrading the malware’s\ncode, persistence mechanisms, anti-AV and anti-research capabilities. As the malware\nevolves, it has also been known to target organizations in the health care and education\nsectors.\n\nResearchers believe that a closed, organized cybercrime gang with roots in Eastern Europe\nis responsible for QakBot.\n\n### Global Perspective\n\nFrom a global perspective, QakBot’s focus on the business sector and its periods of inactivity\nleave it at the bottom of the top 10 list of the most active malware families. In the past five\nyears, the group operating QakBot has been in and out of the cybercrime arena, likely in an\nattempt to keep attacks to a minimum and avoid law enforcement attention.\n\n_Figure 11: Top most prevalent financial malware families (Source: IBM X-Force, May 2017_\n_YTD)._\n\n## Mitigating QakBot Infections\n\n\n-----\n\nTo detect threats such as QakBot, banks and service providers should use adaptive malware\ndetection solutions that provide real-time insight into fraudster techniques and address the\nrelentless evolution of the threat landscape.\n\nKeeping QakBot out of employee endpoints starts with cybersecurity awareness, since this\nmalware may come through infected websites or via email attachments. Users can protect\nthemselves and their organizations by practicing browsing hygiene, disabling online ads,\nfiltering macro execution in files that come via email and observing other security best\npractices.\n\nSecurity basics go a long way toward protecting against EK deliveries. It’s critical to keep all\noperating systems up to date across the organization, update frequently used programs and\ndelete those no longer in use. To mitigate QakBot activity on the network, make sure domain\naccounts are configured with the least privilege required to perform job tasks.\n\nOrganizations can also create a random domain admin account for safety purposes and\nensure that it reports directly to the security information and event management (SIEM)\nsystem upon any attempt to use it. A special emergency account can enable security staff to\nrecover service and determine the source when network users are being locked out.\n\nFinally, prevent workstation-to-workstation communications where possible to force malware\nout of the trenches and into areas where central detection systems will pick it up quickly.\n\n## Indicators of Compromise\n\nMalware dropper MD5:\n\n2C5901F06E6211BB7F6D22AB3376C22C\nA1593E2DC521EA8F66BB727B4725EC2C\n\nMalware sample MD5:\n\n8a3ab5d3fa3644ec1829e7825b0a22a3\n08BACFFCC1E4DF896670047790373497\n847BCDB4F5C2EBA96E8943430C4402C8\n\nQakBot’s hardcoded C2 servers:\n\n96[.]67[.]244[.]225:443\n96[.]3[.]92[.]39:443\n173[.]31[.]254[.]105:443\n192[.]158[.]217[.]32:993\n181[.]165[.]242[.]18:443\n90[.]211[.]106[.]62:443\n70[.]97[.]146[.]196:443\n\n\n-----\n\n50[.]124[.]113[.]135:443\n97[.]64[.]195[.]106:993\n47[.]21[.]79[.]34:443\n47[.]21[.]79[.]34:465\n124[.]168[.]105[.]52:2222\n173[.]71[.]99[.]106:993\n73[.]166[.]94[.]110:443\n89[.]43[.]179[.]209:443\n180[.]93[.]148[.]41:443\n68[.]115[.]254[.]146:443\n73[.]166[.]43[.]103:443\n209[.]136[.]9[.]64:443\n76[.]17[.]137[.]223:443\n47[.]21[.]79[.]34:995\n74[.]65[.]227[.]38:443\n24[.]91[.]39[.]131:2222\n74[.]101[.]41[.]97:443\n50[.]134[.]209[.]66:443\n24[.]45[.]150[.]163:443\n24[.]123[.]151[.]58:443\n76[.]8[.]200[.]134:443\n105[.]227[.]251[.]148:443\n132[.]206[.]59[.]132:443\n211[.]27[.]18[.]233:995\n174[.]51[.]185[.]121:465\n24[.]184[.]200[.]177:2222\n96[.]67[.]244[.]225:443\n184[.]90[.]203[.]138:995\n68[.]53[.]54[.]125:443\n98[.]113[.]137[.]220:443\n86[.]27[.]41[.]234:443\n91[.]93[.]4[.]222:443\n\n50[.]101[.]245[.]7:2222\n\n[Read the white paper: Shifting the balance of power with cognitive fraud prevention](https://www-01.ibm.com/marketing/iwm/dre/signup?source=mrs-form-9451&S_PKG=ov54550%20)\n\n[Mike Oppenheim](https://securityintelligence.com/author/michael-oppenheim/)\nGlobal Research Lead on IBM X-Force Incident Response and Intelligence Services (IRIS)\n\nMike Oppenheim has conducted threat intelligence research, technical analysis, and tactical\noperations tracking some of the most prolific and advanced cyber ...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-06-02 - QakBot Banking Trojan Causes Massive Active Directory Lockouts.pdf"
    ],
    "report_names": [
        "2017-06-02 - QakBot Banking Trojan Causes Massive Active Directory Lockouts.pdf"
    ],
    "threat_actors": [
        {
            "id": "3c3ca3f2-9a6a-463e-869c-e9bf02d398d7",
            "created_at": "2022-10-25T16:07:24.59432Z",
            "updated_at": "2025-03-27T02:02:10.29433Z",
            "deleted_at": null,
            "main_name": "Zombie Spider",
            "aliases": [],
            "source_name": "ETDA:Zombie Spider",
            "tools": [
                "Hlux",
                "Kelihos",
                "Waledac"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "adfbe698-24b2-41fc-a701-781fef330b16",
            "created_at": "2024-01-09T02:00:04.17648Z",
            "updated_at": "2025-03-27T02:00:03.274931Z",
            "deleted_at": null,
            "main_name": "GREF",
            "aliases": [],
            "source_name": "MISPGALAXY:GREF",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0a03e7f0-2f75-4153-9c4f-c46d12d3962e",
            "created_at": "2022-10-25T15:50:23.453824Z",
            "updated_at": "2025-03-27T02:00:55.473216Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "Ke3chang",
                "APT15",
                "Vixen Panda",
                "GREF",
                "Playful Dragon",
                "RoyalAPT",
                "Nylon Typhoon"
            ],
            "source_name": "MITRE:Ke3chang",
            "tools": [
                "Okrum",
                "Systeminfo",
                "netstat",
                "spwebmember",
                "Mimikatz",
                "Tasklist",
                "MirageFox",
                "Neoichor",
                "ipconfig"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e312df00-4c6f-44c3-b717-4b72800c7697",
            "created_at": "2023-01-06T13:46:39.03345Z",
            "updated_at": "2025-03-27T02:00:02.982102Z",
            "deleted_at": null,
            "main_name": "ZOMBIE SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:ZOMBIE SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "17b1b76b-16da-4c4f-8b32-f6fede3eda8c",
            "created_at": "2022-10-25T16:07:23.750796Z",
            "updated_at": "2025-03-27T02:02:09.961401Z",
            "deleted_at": null,
            "main_name": "Ke3chang",
            "aliases": [
                "APT 15",
                "BackdoorDiplomacy",
                "Bronze Davenport",
                "Bronze Idlewood",
                "Bronze Palace",
                "CTG-9246",
                "GREF",
                "Ke3chang",
                "Metushy",
                "Nylon Typhoon",
                "Operation Ke3chang",
                "Operation MirageFox",
                "Playful Dragon",
                "Playful Taurus",
                "Red Vulture",
                "Royal APT",
                "Social Network Team",
                "Vixen Panda"
            ],
            "source_name": "ETDA:Ke3chang",
            "tools": [
                "Agentemis",
                "Anserin",
                "BS2005",
                "BleDoor",
                "CarbonSteal",
                "Cobalt Strike",
                "CobaltStrike",
                "DarthPusher",
                "DoubleAgent",
                "EternalBlue",
                "GoldenEagle",
                "Graphican",
                "HenBox",
                "HighNoon",
                "IRAFAU",
                "Ketrican",
                "Ketrum",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MS Exchange Tool",
                "Mebroot",
                "Mimikatz",
                "MirageFox",
                "NBTscan",
                "Okrum",
                "PluginPhantom",
                "PortQry",
                "ProcDump",
                "PsList",
                "Quarian",
                "RbDoor",
                "RibDoor",
                "Royal DNS",
                "RoyalCli",
                "RoyalDNS",
                "SAMRID",
                "SMBTouch",
                "SilkBean",
                "Sinowal",
                "SpyWaller",
                "Theola",
                "TidePool",
                "Torpig",
                "Turian",
                "Winnti",
                "XSLCmd",
                "cobeacon",
                "nbtscan",
                "netcat",
                "spwebmember"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536093,
    "ts_updated_at": 1743041810,
    "ts_creation_date": 1653757673,
    "ts_modification_date": 1653757673,
    "files": {
        "pdf": "https://archive.orkl.eu/311029232a81cedcb1eb7766e8030e51325abcfb.pdf",
        "text": "https://archive.orkl.eu/311029232a81cedcb1eb7766e8030e51325abcfb.txt",
        "img": "https://archive.orkl.eu/311029232a81cedcb1eb7766e8030e51325abcfb.jpg"
    }
}