{
    "id": "8a425c7d-7e79-4975-85d9-537b468b6e78",
    "created_at": "2023-01-12T15:01:56.478338Z",
    "updated_at": "2025-03-27T02:11:43.473381Z",
    "deleted_at": null,
    "sha1_hash": "e29eda7517c7108afe9c930704651909fc5425c3",
    "title": "2019-11-21 - Allied Universal Breached by Maze Ransomware, Stolen Data Leaked",
    "authors": "",
    "file_creation_date": "2022-05-27T01:58:51Z",
    "file_modification_date": "2022-05-27T01:58:51Z",
    "file_size": 1216216,
    "plain_text": "# Allied Universal Breached by Maze Ransomware, Stolen Data Leaked\n\n**[bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/](https://www.bleepingcomputer.com/news/security/allied-universal-breached-by-maze-ransomware-stolen-data-leaked/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nNovember 21, 2019\n10:48 PM\n2\n\nAfter a deadline was missed for receiving a ransom payment, the group behind Maze\nRansomware has published almost 700 MB worth of data and files stolen from security\nstaffing firm Allied Universal. We are told this is only 10% of the total files stolen and the\nrest will be released if a payment is not made.\n\nThis is an unfortunate story and one that BleepingComputer does not enjoy telling, but with\nMaze's actions it is important to be told.\n\nWith this escalated attack, victims now need to not only be concerned about recovering\ntheir encrypted files, but what would happen if their stolen unencrypted files were leaked to\nthe public.\n\n## Maze Ransomware contacts BleepingComputer\n\nMaze is a ransomware infection that been operating for some time, but has become\nincreasingly more active since May 2019. The affiliates of Maze are also becoming more\nknown, with [ProofPoint identifying one as TA2101 after seeing them conduct numerous](https://www.proofpoint.com/us/threat-insight/post/ta2101-plays-government-imposter-distribute-malware-german-italian-and-us)\n[malspam campaigns that impersonate government agencies.](https://www.bleepingcomputer.com/news/security/new-threat-actor-impersonates-govt-agencies-to-deliver-malware/)\n\n\n-----\n\nLast Friday at 6:35 PM EST as I was finishing for the day, I received an email from a known\nemail address utilized by the Maze Ransomware.\n\nThis email was signed from the 'Maze Crew' and was about how they breached a large\nsecurity staffing company named Allied Universal, who employs approximately 200,000\npeople and has revenues of over $7 billion USD.\n\n\"I am writing to you because we have breached Allied Universal security firm (aus.com),\ndownloaded data and executed Maze ransomware in their network.\n\nThey were asked to pay ransom in order to get decryptor and be safe from data leakage,\nwe have also told them that we would write to you about this situation if they dont pay us,\nbecause it is a shame for the security firm to get breached and ransomwared.\n\nWe gave them time to think until this day, but it seems they abandoned payment process.\n\nI uploaded some files from their network as the data breach proofs. If they dont begin\nsending requested money until next Friday we will begin releasing on public everything that\nwe have downloaded from their network before running Maze.\"\n\nIncluded in this email was a small sample of files that were allegedly stolen from Allied\nUniversal. After being reviewed by BleepingComputer, these appeared to be legitimate files\nstolen from the company.\n\n**Sample of stolen Allied Universal files**\nIn further conversations, the Maze actors told us that they encrypted 'a lot' of computers\nand are demanding 300 bitcoins, or approximately $2.3 million USD, to decrypt the entire\nnetwork.\n\nThey went on to tell us that before they encrypt any computer, they always exfiltrate, or\nsteal, a victim's files so it can be used as further leverage to have the victim pay the\nransom.\n\nWhen I asked what assurances the victims have that Maze will actually delete the files, we\nwere told they were not interested in their data, just their money.\n\n\n-----\n\nIt is just a logic. If we disclose it who will believe us? It is not in our interest, it will be silly to\ndisclose as we gain nothing from it. We also delete data because it is not really interesting.\nWe are neither espionage group nor any other type of APT, the data is not interesting for\nus.\"\n\nWhen we contacted Allied Universal to not only get a statement, but to also warn them\nabout the Maze crew's threats, we were told the situation was under investigation.\n\n\"Allied Universal is aware of a situation that may involve unauthorized access to our\nsystems. We take any situation of this nature very seriously. This incident is being\nthoroughly investigated by Allied Universal IT experts who have taken immediate and\nappropriate actions to reinforce existing security measures and to mitigate any potential\nimpact. We also have engaged outside cybersecurity experts to re-verify our system’s\nsecurity. Keeping our company data safe and that of our customers and employees is of\nparamount importance,\" Allied Universal told BleepingComputer in a statement.\n\nFurther attempts to contact Allied were met with them stating that they \"will not be providing\nany additional comment at this time.\"\n\nOver the next couple of days, Maze told us that they continue to have access to the\ncompany's servers and shared a list of file names associated with TLS and email signing\ncertificates.\n\nThey further warned that if Allied Universal did not pay, the Maze actors would conduct a\nspam campaign using Allied's domain name and email certificates.\n\n\"Ask them a question: would they like if next Monday TA2101 impersonate Allied Universal\nin a spam campaign using the next certs? Saving pfx's plaintext password in pw.txt is so\nsecure for a security company. LMAO. I think you should write amazing article about this.\nName it: \"HOWTO: The easiest way for a security company to be f**ked up\"\n\nAfter a lack of negotiation occurring between Maze and Allied Universal, the Maze actors\nmore pointedly indicated that BleepingComputer should publish a story about what was\nhappening.\n\nBleepingComputer did not feel comfortable being used as leverage in their negotiations.\nInstead we decided to wait until either Allied Universal paid the ransom, the company\nissued a public statement, or stolen files were leaked\n\n## Maze releases some of the Allied Universal files\n\nKnowing that tomorrow was Maze's deadline, we were surprised tonight when they posted\nin our forums a description of the breach and a link to almost 700 MB of leaked files.\n\n\n-----\n\nWe have already morning of Friday. Yes, it is friday in asia. Forgot to mention that deadline\nis a friday by our local time, and not US.\"\n\nThis link was for a 7-zip archive containing files related to termination agreements,\ncontracts, medical records, server directory listings, encryption certificates, and exported\nlists of users from their active directory servers.\n\n**More**\n\n**leaked files**\nAs I was not going to allow BleepingComputer to be used to distribute stolen data, I deleted\nthe post from our forums.\n\nIn a later email to us they shared a link to a post on a Russian hacker and malware forum\nthat once again describes the breach and also contains a link to the leaked data. They also\nstated that they will distribute the other 90% of the leaked data to WikiLeaks if an increased\nransom of $3.8 million dollars is not paid.\n\n\n-----\n\n**Post on Russian hacker and malware forum**\nThis increased amount is highly unlikely, as Maze told us that in their negotiations with\nAllied Universal, the company said they would pay no more than $50,000 USD.\n\nNow that the data and breach had been publicly disclosed by the Maze actors, we\ncontacted law enforcement, once again attempted to contact Allied without a response, and\ndecided to write this article.\n\n## What does this mean going forward?\n\nWhile many ransomware developers have threatened to release data if a ransom was not\npaid, this is the first time we know of that it has actually happened and in such as a visible\nmanner.\n\nWith threat actors escalating their attacks to public disclosure of confidential and sensitive\nfiles, victims need to weigh the cost of ransomware payments versus the potential costs of\nsensitive employee and business information or confidential trade secrets being released to\nthe public.\n\nFurthermore, with ransomware actors actively searching through files on a victim's\nmachines in order to further extort their victims, in many cases these attacks should now be\nconsidered data breaches\n\n\n-----\n\nThis leads to an escalated cost of dealing with breach notifications, hiring data breach\nlawyers, and the potential law suits that may follow.\n\nIt is too soon to tell if this tactic will prove fruitful, but this is definitely something we will need\nto keep an eye on going forward.\n\n### Related Articles:\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New RansomHouse group sets up extortion market, adds first victims](https://www.bleepingcomputer.com/news/security/new-ransomhouse-group-sets-up-extortion-market-adds-first-victims/)\n\n[Quantum ransomware seen deployed in rapid network attacks](https://www.bleepingcomputer.com/news/security/quantum-ransomware-seen-deployed-in-rapid-network-attacks/)\n\n[Karakurt revealed as data extortion arm of Conti cybercrime syndicate](https://www.bleepingcomputer.com/news/security/karakurt-revealed-as-data-extortion-arm-of-conti-cybercrime-syndicate/)\n\n[Snap-on discloses data breach claimed by Conti ransomware gang](https://www.bleepingcomputer.com/news/security/snap-on-discloses-data-breach-claimed-by-conti-ransomware-gang/)\n\n[Data Exfiltration](https://www.bleepingcomputer.com/tag/data-exfiltration/)\n[Extortion](https://www.bleepingcomputer.com/tag/extortion/)\n[Maze](https://www.bleepingcomputer.com/tag/maze/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/edenred-payment-solutions-giant-announces-malware-incident/)\n[Next Article](https://www.bleepingcomputer.com/news/security/fbi-warns-of-cyber-attacks-targeting-us-automotive-industry/)\n\n### Comments\n\n\n-----\n\n[Winterland - 2 years ago](https://www.bleepingcomputer.com/forums/u/529407/winterland/)\n\nThere is a lot here to process but as you note at the end \"what does this mean moving\nforward?\" I think it's a serious wake up call for so many businesses & individuals.\nYeah, of old, the malicious parties would come in, encrypt & extort and if you didn't\npay, they would just say \"*$%^ off\" and go away. But now....dumping the information\nout on the Net if you don't pay. That's some next-level s** & certainly not anything I'd\nwant to experience. Thanks for posting the story, as horrifying as it is - always better\nto be in the know.\n\n[Tan_Yongrui - 2 years ago](https://www.bleepingcomputer.com/forums/u/1149413/tan-yongrui/)\n\nYou should know, that Maze Team start with their own website:. They have no fear,\nbecause it is in public access, not only in \"darknet\"!\nWhat does it mean? Someone can do anything they want with our safety and private\ndata?\nNo. I can't accept this. That's why I've created volounter's team to crush them. You\ncan read about it in my Twitter account.\n\n\n-----\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-21 - Allied Universal Breached by Maze Ransomware, Stolen Data Leaked.pdf"
    ],
    "report_names": [
        "2019-11-21 - Allied Universal Breached by Maze Ransomware, Stolen Data Leaked.pdf"
    ],
    "threat_actors": [
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "921cea27-4410-42e4-8c11-7d40ba313225",
            "created_at": "2023-01-06T13:46:39.375789Z",
            "updated_at": "2025-03-27T02:00:03.067286Z",
            "deleted_at": null,
            "main_name": "RansomHouse",
            "aliases": [],
            "source_name": "MISPGALAXY:RansomHouse",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535716,
    "ts_updated_at": 1743041503,
    "ts_creation_date": 1653616731,
    "ts_modification_date": 1653616731,
    "files": {
        "pdf": "https://archive.orkl.eu/e29eda7517c7108afe9c930704651909fc5425c3.pdf",
        "text": "https://archive.orkl.eu/e29eda7517c7108afe9c930704651909fc5425c3.txt",
        "img": "https://archive.orkl.eu/e29eda7517c7108afe9c930704651909fc5425c3.jpg"
    }
}