{
    "id": "8a98cd0e-7293-4f58-b9fa-09e84a2c97e6",
    "created_at": "2023-04-05T02:09:20.885736Z",
    "updated_at": "2025-03-27T02:09:29.86841Z",
    "deleted_at": null,
    "sha1_hash": "742185fef68ba2acf8bf038bc952f5fb0153aaf0",
    "title": "2023-03-06 - Nevada Ransomware- Yet Another Nokayawa Variant Nevada ransomware",
    "authors": "",
    "file_creation_date": "2023-04-03T08:32:51Z",
    "file_modification_date": "2023-04-03T08:32:51Z",
    "file_size": 632756,
    "plain_text": "# Nevada Ransomware: Yet Another Nokayawa Variant\n\n**[zscaler.com/blogs/security-research/nevada-ransomware-yet-another-nokayawa-variant](https://www.zscaler.com/blogs/security-research/nevada-ransomware-yet-another-nokayawa-variant)**\n\n## Key Points\n\n_Nevada ransomware was advertised in criminal forums in December 2022 as part of a_\nnew ransomware-as-a-service affiliate program\nNevada is written in the Rust programming language with support for Linux and 64-bit\nversions of Windows\nZscaler ThreatLabz has identified significant code similarities between Nevada and\n_Nokoyawa ransomware including debug strings, command-line arguments and_\nencryption algorithms\nThe Nokoyawa ransomware codebase has been continuously modified with at least\nfour distinct variants (including Nevada) that have emerged since February 2022\nThe Nokoyawa threat group appears to operate two parallel code branches written in\ndifferent programming languages designed to confuse researchers and evade\ndetection\n\nZscaler ThreatLabz has been tracking the Nokoyawa ransomware family and its\n[predecessors including Karma and](https://www.sentinelone.com/labs/nokoyawa-ransomware-new-karma-nemty-variant-wears-thin-disguise/) [Nemty ransomware. The original version of Nokoyawa](https://www.fortinet.com/blog/threat-research/nokoyawa-variant-catching-up)\nransomware was introduced in February 2022 and written in the C programming language.\nFile encryption utilized asymmetric Elliptic Curve Cryptography (ECC) with Curve\n[SECT233R1 (a.k.a. NIST B-233) using the Tiny-ECDH open source library combined with a](https://github.com/kokke/tiny-ECDH-c)\nper file Salsa20 symmetric key. In September 2022, a Rust-based version of Nokoyawa\nransomware was released. This new version used Salsa20 for symmetric encryption, but\nthe ECC algorithm was replaced with Curve25519. In December 2022, Nevada\nransomware was advertised in criminal forums. ThreatLabz has determined that Nevada\nshares significant code with the Rust-based variant of Nokoyawa. In January 2023,\nThreatLabz also identified another version of Nokoyawa written in C that is similar to the\noriginal version, but uses the same configuration options (passed via the command-line) as\nthe Rust-based Nokoyawa 2.0.\n\nIn this blog, we analyze Nevada ransomware and how it compares to the other versions of\nNokoyawa ransomware. Based on the numerous similarities, the Nokoyawa threat group\nappears to utilize two separate branches for ransomware attacks.\n\n## Technical Analysis\n\n\n-----\n\nThreatLabz has identified at least four distinct versions of Nokoyawa ransomware. For\nclarity, we will use the version numbers 1.0, 1.1, 2.0 and 2.1 (Nevada) based on code\nsimilarities. Table 1 illustrates the similarities and differences between all four versions of\nNokayawa ransomware including Nevada.\n\n\n**Attribute** **Nokoyawa**\n**1.0**\n\n\n**Nokoyawa 1.1** **Nokoyawa 2.0** **Nokoyawa**\n**2.1**\n\n**(Nevada)**\n\n\n**Encryption**\n**algorithms**\n\n\nSECT233R1\n+ Salsa20\n\n\nSECT233R1 +\nSalsa20\n\n\nX25519 +\nSalsa20\n\n\nX25519 +\nSalsa20\n\n\n**Encryption library** Tiny-ECDH Tiny-ECDH x25519_dalek x25519_dalek\n\n\n**Programming**\n**language**\n\n**Encryption**\n**Parameters**\n\n\nC/C++ C/C++ Rust Rust\n\n\nHardcoded Passed via\ncommand-line\n\n\nPassed via\ncommand-line\n\n\nHardcoded\n\n\n**Import Hashing** No Yes No No\n\n**CIS Exclusion** No No Yes Yes\n\n**Architecture** x64 x64 x64 x64\n\n\n**Earliest known**\n**compilation date**\n\n\nFebruary\n2022\n\n\nJanuary 2023 September\n2022\n\n\nJanuary 2023\n\n\nTable 1. Comparison between different versions of Nokoyawa ransomware\n\nThere are a few commonalities between all Nokoyawa variants such as being compiled only\n[for 64-bit versions of Windows and using a relatively obscure method to delete Windows](https://github.com/gtworek/PSBits/tree/master/IOCTL_VOLSNAP_SET_MAX_DIFF_AREA_SIZE)\nShadow Copies. The latter entails calling the function DeviceIoControl (shown in Figure 1)\nwith the undocumented control code parameter\n_IOCTL_VOLSNAP_SET_MAX_DIFF_AREA_SIZE (0x53C028) with a maximum size of 1,_\nwhich causes Windows to delete all shadow copies as a result.\n\n\n-----\n\nFigure 1. Nokoyawa/Nevada code to delete Windows Shadow Copies\n\nAll versions of Nokoyawa support the command-line parameters --file (to encrypt a single\nfile) and --dir (to encrypt a directory). However, Nokoyawa 1.1 and 2.0 require a\nconfiguration to execute the ransomware via the --config command-line parameter. The\nconfiguration parameter is a Base64 encoded JSON object that has the following keys and\nvalues shown in Table 2.\n\n**Key** **Description**\n\n**NOTE_NAME** Ransom note filename\n\n**NOTE_CONTENT** Ransom note content\n\n**EXTENSION** Encrypted file extension (also used as the Salsa20 nonce)\n\n**ECC_PUBLIC** Curve25519 public key\n\n**SKIP_EXTS** File extensions that will not be encrypted\n\n**SKIP_DIRS** Directories that will not be encrypted\n\n**ENCRYPT_NETWORK** Encrypt network shares\n\n\n-----\n\n**DELETE_SHADOW** Delete Windows shadow copies\n\n**LOAD_HIDDEN_DRIVES** Unhide hidden drives and encrypt files\n\nTable 2. Nokoyawa 1.1 and Nokoyawa 2.0 ransomware configuration parameters\n\nNokoyawa 1.1 also has a --safe-mode command-line option to reboot the system into\nWindows safe mode prior to file encryption to maximize the number of files that can be\nencrypted by loading the minimal set of applications, and therefore, minimize the number of\nopen file handles that may interfere with encryption. In addition, Nokoyawa 1.1 is the only\nvariant that obfuscates the Windows API functions that are called during runtime by\nresolving each name via CRC32 hash.\n\nIn Nevada ransomware, the encryption parameters are hardcoded in the binary, but the\nother command-line options are virtually identical to Nokoyawa 1.1 and 2.0 (with the\nexception of a new feature to self-delete the ransomware binary after file encryption is\ncomplete). Nevada also supports a -help command-line argument, which prints the usage\nshown below in Figure 2.\n\nFigure 2. Nevada ransomware command-line help\n\nIn order to reduce the risk of law enforcement actions, Both Nokayawa 2.0 and Nevada\ncheck whether the infected system is located in a former Commonwealth of Independent\nStates (CIS) country. The former calls the Windows API GetSystemDefaultLCID for\n[language IDs (between 1049-1092 or 2073) and the latter calls GetUserDefaultUILanguage](https://learn.microsoft.com/en-us/openspecs/office_standards/ms-oe376/6c085406-a698-4e12-9d4d-c3b0ee3dbc4a)\n(between 1049-1090) to determine the system's locale and language, respectively. Some of\nthese language IDs include countries outside of the CIS countries, which may be to simplify\nthe code by adding a range of values rather than individually checking each value.\n\nNokoyawa 1.0 and Nokoyawa 1.1 share about 39% of the same code, while Nokoyawa 2.0\n[and Nevada share more than 87% of the same code according to BinDiff.](https://www.zynamics.com/bindiff.html)\n\n## Debug Print Statements\n\n\n-----\n\nAnother similarity between Nokoyawa 2.0 and Nevada are debug print statements, which\nare very similar or identical. Figure 3 shows an example for a function that creates a thread\nand prints a debug statement to the console.\n\nFigure 3. Comparison of CreateThread function and debug print statements in Nokoyawa\n2.0 (left) and Nevada (right)\n\nMany strings have also been slightly altered between Nokoyawa 2.0 and Nevada as shown\nin Table 3.\n\n**Nokoyawa 2.0** **Nokoyawa 2.1**\n\n**(Nevada)**\n\nCIS lang detected! Stop working... CIS. STOP!\n\nSuccessfully deleted shadow copies from Shadow copies deleted from\n\nCouldn't create ransom note Failed to create ransom note\n\nCouldn't seek file: Failed to seek file:\n\nCouldn't read file: Failed to read file:\n\nCouldn't write to file: Failed to write file:\n\nCouldn't rename file Failed to rename file\n\nTable 3. Comparison between debug print strings in Nokoyawa 2.0 (left) and Nevada (right)\n\n\n-----\n\n## Encryption Algorithms\n\nNokoyawa 1.0 and 1.1 use the elliptic curve SECT233R1 (NIST B-233) via the Tiny-ECDH\nlibrary to generate a per file Salsa20 key. Nokoyawa 2.0 and Nevada use Curve25519 via\n[the open source x25519_dalek Rust library to derive a Salsa20 encryption key per file. In](https://docs.rs/x25519-dalek/0.2.1/x25519_dalek/)\nNokoyawa 1.1 and 2.0, the file extension (as described in Table 2) is used as the nonce.\nThe original version of Nokoyawa and Nevada ransomware use the hardcoded nonce\nvalues lvcelvce and pmarpmar, respectively.\n\n## Conclusion\n\nZscaler ThreatLabz has identified two parallel versions of Nokoyawa ransomware with\nimplementations in C and Rust. These two branches may be indicative of a source code\nleak, or designed to evade host-based security software and divert attention. In conclusion,\nNevada ransomware appears to be the latest variant of the Rust-based version of\nNokoyawa rather than an entirely new ransomware family.\n\n## Cloud Sandbox Detection\n\nIn addition to sandbox detections, Zscaler’s multilayered cloud security platform detects\nindicators related to Nokoyawa at various levels with the following threat names:\n\n[Win64.Ransom.NOKOYAWA](https://threatlibrary.zscaler.com/threats/53bff672-df71-43ee-8cb6-ce3fb9d810f4)\n\n## Indicators of Compromise\n\n\n-----\n\nSHA256 Description\n\na32b7e40fc353fd2f13307d8bfe1c7c634c8c897b80e72a9872baa9a1da08c46 Nokoyawa\nransomware\n1.0\n\n3339ba53e1f05f91dbe907d187489dbaba6c801f7af6fd06521f3ba8c484ec6c Nokoyawa\nransomware\n1.1\n\n7095beafff5837070a89407c1bf3c6acf8221ed786e0697f6c578d4c3de0efd6 Nokoyawa\nransomware\n2.0\n\n855f411bd0667b650c4f2fd3c9fbb4fa9209cf40b0d655fa9304dcdd956e0808 Nokoyawa\nransomware\n2.1\n\n(Nevada)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-06 - Nevada Ransomware- Yet Another Nokayawa Variant Nevada ransomware.pdf"
    ],
    "report_names": [
        "2023-03-06 - Nevada Ransomware- Yet Another Nokayawa Variant Nevada ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1680660560,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1680510771,
    "ts_modification_date": 1680510771,
    "files": {
        "pdf": "https://archive.orkl.eu/742185fef68ba2acf8bf038bc952f5fb0153aaf0.pdf",
        "text": "https://archive.orkl.eu/742185fef68ba2acf8bf038bc952f5fb0153aaf0.txt",
        "img": "https://archive.orkl.eu/742185fef68ba2acf8bf038bc952f5fb0153aaf0.jpg"
    }
}