{
    "id": "8a9ad290-dfc8-4ce0-b435-b55a7ba11466",
    "created_at": "2023-01-12T15:06:14.058036Z",
    "updated_at": "2025-03-27T02:16:20.900198Z",
    "deleted_at": null,
    "sha1_hash": "1c739f136e774b8f4bf13b42ac271b297c091b27",
    "title": "2017-08-17 - Turla APT actor refreshes KopiLuwak JavaScript backdoor for use in G20-themed attack",
    "authors": "",
    "file_creation_date": "2022-05-28T02:49:23Z",
    "file_modification_date": "2022-05-28T02:49:23Z",
    "file_size": 991865,
    "plain_text": "# Turla APT actor refreshes KopiLuwak JavaScript backdoor for use in G20-themed attack\n\n**[proofpoint.com/us/threat-insight/post/turla-apt-actor-refreshes-kopiluwak-javascript-backdoor-use-g20-themed-attack](https://www.proofpoint.com/us/threat-insight/post/turla-apt-actor-refreshes-kopiluwak-javascript-backdoor-use-g20-themed-attack)**\n\nAugust 17, 2017\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nTurla APT actor refreshes KopiLuwak JavaScript backdoor for use in G20-themed attack\n\n\n-----\n\nAugust 17, 2017 Darien Huss\n\n**Overview**\n\nProofpoint researchers have observed a well-known Russian-speaking APT actor usually\nreferred to as Turla using a new .NET/MSIL dropper for an existing backdoor called\nJS/KopiLuwak. The backdoor has been analyzed previously [11] and is a robust tool\nassociated with this group, likely being used as an early stage reconnaissance tool.\n\nIn this case, the dropper is being delivered with a benign and possibly stolen decoy\ndocument inviting recipients to a G20 task force meeting on the \"Digital Economy\". The\nDigital Economy event is actually scheduled for October of this year in Hamburg, Germany.\nThe dropper first appeared in mid-July, suggesting that this APT activity is potentially\nongoing, with Turla actively targeting G20 participants and/or those with interest in the G20,\nincluding member nations, journalists, and policymakers. This blog provides details on the\ndropper and known information on the infection chain and current related Turla activity.\n\n**Actor Overview**\n\nTurla is a well-documented, long operating APT group that is widely believed to be a Russian\nstate-sponsored organization. Turla is perhaps most notoriously suspected as responsible for\nthe breach of the United States Central Command in 2008 [1]. More recently Turla was\naccused of breaching RUAG, a Swiss technology company, in a public report published by\nGovCERT.ch [2]. Various other Turla frameworks, implants, and campaigns have been\ndetailed extensively by our fellow security organizations and companies [3-10].\n\n**Delivery**\n\nThe delivery of KopiLuwak in this instance is currently unknown as the MSIL dropper has\n[only been observed by Proofpoint researchers on a public malware repository. Assuming this](https://www.proofpoint.com/us/threat-reference/malware)\nvariant of KopiLuwak has been observed in the wild, there are a number of ways it may have\n[been delivered including some of Turla’s previous attack methods such as spear phishing or](https://www.proofpoint.com/us/threat-reference/spear-phishing)\n\n\n-----\n\nvia a [watering hole. Based on the theme of the decoy PDF, it is very possible that the](https://www.proofpoint.com/us/threat-reference/watering-hole)\nintended targets are individuals or organizations that are on or have an interest in G20’s\nDigital Economy Task Force. This could include diplomats, experts in the areas of interest\nrelated to the Digital Economy Task Force, or possibly even journalists.\n\n**Analysis**\n\nThe earliest step in any possible attack(s) involving this variant of KopiLuwak of which\nProofpoint researchers are currently aware begin with the MSIL dropper. The basic chain of\nevents upon execution of the MSIL dropper include dropping and executing both a PDF\ndecoy and a Javascript (JS) dropper. As explained in further detail below, the JS dropper\nultimately installs a JS decryptor onto an infected machine that will then finally decrypt and\nexecute the actual KopiLuwak backdoor in memory only (Fig. 1).\n\n_Figure 1: Diagram showing execution beginning with the MSIL dropper_\n\nAs Proofpoint has not yet observed this attack in the wild it is likely that there is an additional\ncomponent that leads to the execution of the MSIL payload. This may include a malicious\ndocument, compressed package attached to an e-mail, or perhaps it could be delivered via a\nwatering hole attack.\n\nThe KopiLuwak MSIL dropper is straightforward and contains absolutely no obfuscation or\nanti-analysis. Internally the MSIL dropper is called Runer.exe and also contains a PDB string:\n“c:\\LocalDisc_D\\MyProjects\\Runer\\Runer\\obj\\Release\\Runer.pdb”. The Stage1 JS and PDF\ndecoy are both stored in plaintext in the dropper and are simply written to %APPDATA% then\nexecuted (Fig. 2).\n\n\n-----\n\n_Figure 2: MSIL dropper writing both the Stage1 JS and decoy PDF then executing both_\n\nBoth of the dropped files have hardcoded names: the JS is named Scr.js while the PDF is\nnamed Save the Date G20 Digital Economy Taskforce 23 24 October.pdf. The decoy in this\ncase is an invitation to save the date for a meeting of the G20’s Digital Economy Taskforce\n(Fig. 3) in Hamburg, Germany.\n\n_Figure 3: PDF decoy with a “Save the Date” invitation for a G20 Digital Economy Taskforce_\n_meeting_\n\nAs far as we are aware, this document is not publicly available and so may indicate that an\nentity with access to the invitation was already compromised. Alternatively, the document\nmay have been legitimately obtained from a recipient.\n\nProofpoint researchers ascertain with medium confidence that the document is legitimate\nand not fabricated. One piece of evidence suggesting that the document could be authentic\nis that in the document’s exif metadata, the creator tool is listed as “BE.D4.113.1” (Fig. 4)\n\n\n-----\n\nwhich matches another PDF document that appears to have been scanned and is hosted on\nthe Bundesministerium für Wirtschaft und Energie website (Fig. 5).\n\n_Figure 4: Exif metadata from the decoy PDF_\n\n_Figure 5: Exif metadata from the PDF hosted on bmwi[.]de_\n\nBMWi, which translates to Federal Ministry for Economic Affairs and Energy, is the\norganization from which the decoy document supposedly originated. Both documents were\nalso supposedly created on a KONICA MINOLTA bizhub C284e according to their exif\nmetadata.\n\n_Scr.js Analysis_\n\nScr.js is essentially a dropper for the actual backdoor in addition to running all the necessary\ncommands to fingerprint the infected system and set up persistence. Scr.js first creates a\nscheduled task named PolicyConverter for persistence. This scheduled task should execute\nshortly after being created and is then scheduled to run every 10 minutes. The scheduled\ntask is executed with the following parameters: “appidpolicyconverter.js FileTypeXML\n_gwVAj83JsiqTz5fG”. Similar to the older KopiLuwak variant, the second parameter is used as_\nan RC4 key to decrypt the encrypted JS backdoor code contained in appidpolicyconverter.js.\n\nNext, Scr.js decodes a large base64 blob containing the JS backdoor decryptor and saves it\nto the following location: “C:\\Users\\[executing\n_user]\\AppData\\Roaming\\Microsoft\\Protect\\appidpolicyconverter.js”_\n\n\n-----\n\nLastly, Scr.js executes various commands to fingerprint details about the infected system. In\nthe older variant of KopiLuwak, these commands were executed directly from the backdoor\nJS. Now, however, they have been moved to the dropper. Despite moving the machine\nfingerprinting code to the dropper, all of the commands are the same as in the older sample\n(and executed in the same order) except for the following three additions:\n\ndir “%programfiles%\\Kaspersky Lab”\ndir “%programfiles(x86)%\\Kaspersky Lab”\ntracert www.google.com\n\nInterestingly the only anti-virus company that is specifically fingerprinted is Kaspersky, which\nwas possibly added as a result of their public analysis of this backdoor. The output from the\ncommands are saved to the following location: “%appdata%\\Microsoft\\Protect\\~~.tmp”\n\n_appidpolicyconverter.js Analysis_\n\nThe appidpolicyconverter.js script contains a large string that is first base64-decoded then\nRC4-decrypted using the supplied parameter as a key (“gwVAj83JsiqTz5fG”) from the\nexecuted task. Once the KopiLuwak backdoor code is successfully decrypted, it is then\nexecuted with eval().\n\nThe decrypted code functions similarly to the original KopiLuwak discussed by Kaspersky\nwith some slight changes. The backdoor still communicates with what appear to be two\ncompromised, legitimate websites using HTTP POST requests (Fig. 6).\n\n_Figure 6: Hardcoded legitimate, compromised command and control servers_\n\nDiffering from the older sample, the HTTP User-Agent is now hardcoded and no longer\ncontains a component unique to each infected machine.\n\nEach HTTP POST request sent to the command and control (C&C) will contain information in\nits client body. The plaintext content is first preceded with a hardcoded key\n“Prc1MHxF_VB0ht7S”. Next, the key is followed by a separator string “ridid”. Next, the\nhardcoded key “Prc1MHxF_VB0ht7S” is used to encode the infected system’s OS installation\ndate (Fig. 7).\n\n\n-----\n\n_Figure 7: Retrieving the OS installation date_\n\nIf any additional information is being sent to the C&C it will then be appended after the\nencoded installation date. Finally, the data is encrypted with RC4 using a hardcoded key:\n“01a8cbd328df18fd49965d68e2879433” and then quoted (Fig. 8).\n\n_Figure 8: HTTP POST to KopiLuwak C2_\n\nResponses from the command and control are also encrypted using RC4 and the same key.\nAfter responses from the C&C are decrypted, they are compared to a list of supported\ncommands. This newer variant of KopiLuwak has several different supported command\nkeywords, including one additional command, giving a total of five commands versus the old\nvariant’s four (Table 1).\n\n**Command** **Description**\n\nexit Send the content infected system’s fingerprint info stored in ~~.tmp and exit\n\nupld Exfiltrate content from provided filename (from C2) to C2. Max exfiltrated file\nsize is <= 1048576 bytes (1MB)\n\n\n-----\n\ninst Two options for this command:\n\n-execute provided JS using eval, send contents of ~~.tmp to C2, delete\n~~.tmp\n\n-save provided content to a file in %Appdata%\\Microsoft\\Protect\\a3q4d.[ext],\nexecute the file, sleep for a random amount of time, delete the file, send the\ncontents of ~~.tmp to C2, and delete ~~.tmp\n\nwait Exit the script. The scheduled task would execute the backdoor again in ~10\nminutes\n\ndwld Saves the provided content with provided extension to\n%Appdata%\\Microsoft\\Protect\\D8chd.[ext]. If successful sends success\nmessage to C2.\n\n_Table 1: KopiLuwak supported commands and descriptions_\n\nThe newer variant of KopiLuwak is now capable of exfiltrating files to the C&C as well as\ndownloading files and saving them to the infected machine. Although these capabilities could\nhave been accomplished in the previous variant by executing arbitrary commands, they are\nnow implemented with their own dedicated commands. Despite the added capabilities, we\nstill agree with Kaspersky that this backdoor is likely used as an initial reconnaissance tool\nand would probably be used as a staging point to deploy one of Turla’s more fully featured\nimplants. We also believe this backdoor will continue to be used in the future as suggested\nby the continued development of the backdoor itself as well as the new delivery\nmechanisms.\n\n**Conclusion**\n\nBecause the samples were obtained from a public malware repository and we have not yet\nobserved them in the wild, the full scope and impact of the attack (or, possibly, a pending\nattack) cannot be fully assessed. However, for PCs running the .NET framework (which\nincludes most modern Windows operating systems), the potential impact is high:\n\nThe JavaScript dropper profiles the victim’s system, establishes persistence, and\ninstalls the KopiLuwak backdoor.\nKopiLuwak is a robust tool capable of exfiltrating data, downloading additional\npayloads, and executing arbitrary commands provided by the actor(s)\n\nThe high profile of potentially targeted individuals associated with the G20 and early\nreconnaissance nature of the tools involved bear further watching. We have notified CERTBund of this activity.\n\n\n-----\n\nWe will continue to track the activities associated both with this actor and these new tools\nand update this blog as details emerge.\n\n**References**\n\n[1] [https://en.wikipedia.org/wiki/2008_cyberattack_on_United_States](https://en.wikipedia.org/wiki/2008_cyberattack_on_United_States)\n\n[2] [https://www.govcert.admin.ch/blog/22/technical-report-about-the-ruag-espionage-case](https://www.govcert.admin.ch/blog/22/technical-report-about-the-ruag-espionage-case)\n\n[3] [https://securelist.com/the-epic-turla-operation/65545/](https://securelist.com/the-epic-turla-operation/65545/)\n\n[4] [https://securelist.com/satellite-turla-apt-command-and-control-in-the-sky/72081/](https://securelist.com/satellite-turla-apt-command-and-control-in-the-sky/72081/)\n\n[5] [https://www2.fireeye.com/rs/848-DID-242/images/rpt-witchcoven.pdf](https://www2.fireeye.com/rs/848-DID-242/images/rpt-witchcoven.pdf)\n\n[6]\nhttps://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/w\naterbug-attack-group.pdf\n\n[7] https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stagebackdoor/\n\n[8] https://www.welivesecurity.com/2017/06/06/turlas-watering-hole-campaign-updatedfirefox-extension-abusing-instagram/\n\n[9] https://www.gdatasoftware.com/blog/2014/11/23937-the-uroburos-case-newsophisticated-rat-identified\n\n[10] [https://www.gdatasoftware.com/blog/2015/01/23926-analysis-of-project-cobra](https://www.gdatasoftware.com/blog/2015/01/23926-analysis-of-project-cobra)\n\n[11] [https://securelist.com/kopiluwak-a-new-javascript-payload-from-turla/77429/](https://securelist.com/kopiluwak-a-new-javascript-payload-from-turla/77429/)\n\n**Indicators of Compromise (IOCs)**\n\n_KopiLuwak MSIL Dropper_\n\n7481e87023604e7534d02339540ddd9565273dd51c13d7677b9b4c9623f0440b\n\n_KopiLuwak JS Dropper “Scr.js”_\n\n1c76a66a670a6f69b4fea25ca0ba4885eca9e1b85a2afbab61da3b4a6d52ae19\n\n_KopiLuwak JavaScript Decryptor “appidpolicyconverter.js”_\n\n5698c92fb8fe7ded0ff940c75979f44734650e4f2c852bdb4cbc9d46e7993185\n\n_Benign PDF Decoy “Save the Date G20 Digital Economy Taskforce 23 24 October.pdf”_\n\n\n-----\n\nc978da455018a73ddbc9e1d2bf8c208ad3ec2e622850f68ef6b0aae939e5d2ab\n\n_KopiLuwak C&C_\n\nhxxp://www[.]huluwa[.]uk/wp-content/plugins/woocommerce/includes/class-wc-log.php\n\nhxxp://tresor-rare[.]com[.]hk/wp-content/plugins/wordpress-seo/vendor/xrstf/composerphp52/lib/xrstf/Composer52/LogsLoader.php\n\n**ET and ETPRO Suricata/Snort Coverage**\n\n2827574,ETPRO TROJAN Turla JS/KopiLuwak CnC Beacon M1\n\n2827575,ETPRO TROJAN Turla JS/KopiLuwak CnC Beacon M2\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-17 - Turla APT actor refreshes KopiLuwak JavaScript backdoor for use in G20-themed attack.pdf"
    ],
    "report_names": [
        "2017-08-17 - Turla APT actor refreshes KopiLuwak JavaScript backdoor for use in G20-themed attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535974,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653706163,
    "ts_modification_date": 1653706163,
    "files": {
        "pdf": "https://archive.orkl.eu/1c739f136e774b8f4bf13b42ac271b297c091b27.pdf",
        "text": "https://archive.orkl.eu/1c739f136e774b8f4bf13b42ac271b297c091b27.txt",
        "img": "https://archive.orkl.eu/1c739f136e774b8f4bf13b42ac271b297c091b27.jpg"
    }
}