{
    "id": "8a9efe4c-5638-459f-963d-777ab59bd1a4",
    "created_at": "2023-01-12T15:02:56.397943Z",
    "updated_at": "2025-03-27T02:15:59.314492Z",
    "deleted_at": null,
    "sha1_hash": "6aa232ca1544fb0a4662a11bea540b158b810a71",
    "title": "2022-03-24 - Ransomware Threat Report 2022",
    "authors": "",
    "file_creation_date": "2022-03-23T17:49:33Z",
    "file_modification_date": "2022-03-23T17:49:37Z",
    "file_size": 1710716,
    "plain_text": "# RANSOMWARE\n## THREAT REPORT\n\n####  2022\n\n\n-----\n\n**TABLE OF CONTENTS**\n\n###### Foreword 3\n\n Executive Summary  4\n\n 01 Ransomware 101 6\n\n 02 The Ransomware Landscape  8\n\n 03 Ransomware Group Behavior  13\n\n 04 Insights from Ransomware Leak Sites 23\n\n 05 Ransomware in Cloud Environments 29\n\n 06 Costs of Ransomware 31\n\n 07 Conclusion and Recommendations 32\n\n Want to Be Prepared for a Ransomware Attack? 37\n\n Methodology  38\n\n About Palo Alto Networks 39\n\n About Unit 42 39\n\n\n-----\n\n##### Foreword\n\nRansomware attacks commanded headlines around the world in 2021, and show no\n\nsigns of slowing down. In fact, cybercriminals are doubling down by finding additional\n\nways to extort victims in conjunction with ransomware. Double extortion first took off in\n\n2020 with the rise of dark web leak sites that cybercriminals used to identify ransomware\n\nvictims and threaten to leak sensitive corporate data. In 2021, ransomware gangs took\n\nthese tactics to a new level, popularizing multi-extortion techniques designed to heighten\n\nthe cost and immediacy of the threat. For example, we’ve seen gangs make threatening\n\nphone calls to employees and customers and launch denial of service (DoS) attacks to\n\nshut down a victim’s website in an effort to incentivize payments.\n\nIn 2021, we also saw ransomware-as-a-service (RaaS) operators grow. RaaS operators\n\noffer a wide array of easy-to-use tools and services that make launching ransomware\n\nattacks almost as simple as using an online auction site. These operators have been\n\nmaking investments during these past few years to optimize their businesses – they have\n\nperfected their malware, developed marketing strategies to recruit more affiliates, and\n\neven built up technical support operations to help victims get back online once they pay\n\ntheir ransoms.\n\nAll these innovations have made it harder for organizations to defend against\n\nransomware, forcing some to make the hefty sorts of payments that are documented in\n\nthis report. The average ransom demand on cases worked by Unit 42 consultants last year\n\nclimbed 144% to $2.2 million, while the average payment rose 78% percent to $541,010.\n\nAs these ransomware gangs and RaaS operators find new ways to remove technical\n\nbarriers and up the ante, ransomware will continue to challenge organizations of all sizes\n\nin 2022. As a result, ransomware has become one of the top threats in cybersecurity and a\n\nfocus area for Palo Alto Networks. This report provides the latest insights on established\n\nand emerging ransomware groups, payment trends, and security best practices. I hope\n\nthese insights will help you better understand and manage the threat to your organization.\n\n### Ryan Olson\n\n**Ryan Olson**\nVP of Threat Intelligence,\nUnit 42, Palo Alto Networks\n\n\n-----\n\n-----\n\n**EXECUTIVE SUMMARY**\n\nThe tactics employed by these cybercriminals\n\nmirror the growing sophistication and\n\nmaturity of the ransomware landscape.\n\n**In 2021 we increasingly saw:**\n\nMulti-extortion techniques where\n\nattackers not only encrypt the\n\nfiles of an organization, but also\n\nname and shame the victims and/\n\nor threaten to launch additional\n\nattacks (e.g., distributed denial\n\nof service, known as DDoS) to\n\nencourage victims to pay more\n\nquickly. In 2021, the names and\n\nproof of compromise for 2,566\n\nvictims were publicly posted on\n\nransomware leak sites, marking an\n\n85% increase compared to 2020.\n\nExtremely prolific ransomware\nas-a-service (RaaS) business\n\nmodels, which offer “startup kits”\n\nand “support services” to would\nbe cybercriminals, significantly\n\nlowering the technical barrier\n\nto entry and accelerating the\n\nspeed with which attacks can be\n\nintroduced and spread.\n\nRapid weaponization of\n\nvulnerabilities. For example,\n\nmajor ransomware gangs quickly\n\nexploited CVE-2021-44228,\n\n[commonly referred to as Log4Shell.](https://unit42.paloaltonetworks.com/apache-log4j-vulnerability-cve-2021-44228/)\n\nIt is highly likely that as long as\n\norganizations fail to patch known\n\ncritical vulnerabilities, attackers will\n\nexploit them to their advantage.\n\n\n-----\n\n##### 01 | Ransomware 101\n\n###### Ransomware comes in many varieties.\n\nDifferent ransomware groups are known for the types of attacks they launch – the\n\nfiles, methods, tactics, and notes they use – and the targets they go after. Recent\n\nheadlines have been dominated by ransomware gangs such as Conti and REvil. These\n\ngroups actively recruit affiliates (cybercriminals) to carry out their attacks. Sometimes,\n\nransomware groups maintain an online presence, such as a leak site, “support” site,\n\nand/or social media profile to help them with their affiliate recruitment and overall\n\nsuccess rates.\n\n**Ransomware is a type of malware used by cybercriminals for financial**\n\n**gain. It is delivered in the same way any type of malware makes its**\n\nway onto victim systems. For example, attackers will exploit known\n\nvulnerabilities, take advantage of systems that have already been\n\ncompromised, and/or use social engineering tactics, such as phishing\n\nemails that attempt to trick users into downloading infected files or\n\nclicking on malicious links, to get a foothold into an organization that they\n\ncan use to carry out their attack.\n\n**Once in, the ransomware will take over the victim’s files or systems and**\n\n**encrypt key information to render it unusable to the organization.**\n\nThe attacker will demand a ransom be paid in exchange for a decryption\n\nkey, which will presumably return the files to their original state.\n\n\n-----\n\n**01 | RANSOMWARE 101**\n\nTypically, a ransom note is installed on a victim’s system at\n\nthe same time the files/systems are encrypted. The note will\n\ninclude information on the ransomware gang’s demands;\n\nit will detail the amount of the ransom demand, a deadline\n\nfor payment (sometimes including a discounted offer for\n\nearly payment), and instructions on how to reach and pay\n\nthe group demanding the ransom, providing details on the\n\ncryptocurrency wallet or other wiring information the victim\n\nwill need to complete the transaction. Occasionally, groups\n\ninclude more colorful information in their notes, such as\n\ncritiques of the victim organization’s security posture or offers\n\nto help secure the victim in the future – for a price.\n\nSometimes, a group will offer victims a way to test the\n\ndecryption key on certain files or provide other forms of\n\nproof that the attack is real and dangerous ­— e.g., posting a\n\nsampling of data on the ransomware gang’s leak site. In recent\n\nyears, the definition of ransomware has been extended to\n\ninclude double or multi-extortion attacks, which combine\n\nadditional threats and tactics, on top of holding a victim’s\n\ndata hostage.\n\nThese tactics pressure victims to pay the ransom fast and in\n\nfull, as well as make it so that offline backups aren’t sufficient\n\nfor organizations. It used to be that if organizations had\n\n(and tested) offline backups, it was enough to recover from\n\na ransomware attack. With multi-extortion, those backups\n\ncan’t prevent all the negative effects that ransomware groups\n\ncan leverage.\n\n\n**Double extortion is the practice**\n\nof exfiltrating data during a\n\nransomware attack that is used to\n\nblackmail victims into paying. The\n\nidea is victims won’t want their\n\ninformation posted on a leak site\n\n(typically hosted on the dark web) or\n\nput up for sale through other illicit\n\nforums, so they will be incentivized\n\nto conclude the incident as fast as\n\npossible. Multi-extortion includes\n\neven more pressure tactics, such\n\nas launching distributed denial\nof-service (DDoS) attacks that\n\nshut down public-facing websites\n\nbelonging to targeted organizations.\n\n\n-----\n\n##### 02 | The Ransomware\n Landscape\n\nAfter analyzing ransomware activity in 2021 and comparing it to the activity of the past\n\nseveral years, we have seen some recurring techniques and tactics that attackers rely\n\non, as well as some emerging trends that are shaping the ransomware landscape. The\n\nfollowing are the observations that you need to be mindful of — both old and new —\n\nwhen building strategies to bolster your defense.\n\n###### How Ransomware Actors Behave\n\n Attackers Take Shortcuts\n\nUsing an initial access broker, who sells ready access to corporate networks\n\nto anyone who will pay for it, is becoming standard for many ransomware\n\ngangs. While many in the cybercrime world want this kind of access,\n\nransomware operators are particularly interested because it saves their\n\naffiliates a lot of effort and time. The cooperation is very profitable for both\n\nthe ransomware operators and the access brokers. It also enables less\n\nsophisticated threat actors, who lack the skills to find an unobtrusive way\n\ninto a network, to quickly and easily carry out attacks by simply dropping\n\nransomware into an already compromised environment. Organizations\n\nshould remain vigilant and do all they can to uncover attackers hiding in their\n\nenvironment, looking for lateral movement and dormant executable files that\n\ncould indicate the presence of an attack foothold.\n\n###### Attackers Will Use Any Tricks They Can\n\nAttackers are increasingly using anonymized services, which makes it more\n\ndifficult for security researchers and law enforcement to track activities\n\nand identify indicators of compromise (IoCs) that can be used for network\n\ndefenses. Tor, short for The Onion Router, and other anonymous services are\n\nvery popular with ransomware groups and will likely continue to be a critical part\n\nof their tactics to make it as hard as possible to defend against their attacks.\n\n\n-----\n\n**02 | THE RANSOMWARE LANDSCAPE**\n\n###### Attackers Are Innovative\n\nRansomware threat actors continue to invest in their own tooling to\n\nkeep compromising victims, developing new and updated ransomware\n\nvariants for use as standalone malware or alongside commodity\n\nmalware. More ransomware groups are developing variants to target\n\nadditional operating systems, such as Linux (e.g., HelloKitty), or\n\nleveraging highly customizable programming languages, such as Rust\n\n(e.g., BlackCat), to create attacks more easily. It is clear that adversaries\n\nwill continue to create new variants and build out their capabilities\n\nto target all kinds of systems, which will widen the scope of possible\n\nvictims in the process. Organizations need to do the same with defenses,\n\nadapting and adding capabilities to minimize the attack surface.\n\n###### Three Ransomware Trends to Know for 2022\n\n 1 Victim Shaming Is on the Rise\n\nIncreasingly, ransomware gangs are using multi-extortion techniques in\n\n##### 35\n\nan effort to strong arm the victim organization to pay the ransom demand.\n\n**NEW**\n\nThey not only encrypt an organization’s files, but also leverage leak sites **RANSOMWARE**\n\n**GANGS IN 2021**\n\nand threaten follow-on attacks (e.g., DDoS) to incentivize a swift payout.\n\nReleasing samples of the victim’s stolen/compromised data on the dark\n\nweb or their gang’s leak site is a way for the perpetrator to prove they have\n\nthe information and the threat is serious – they may even include details\n\non the total amount of data they have – to name and shame the victims **2,566**\n\ninto payment. These tactics prevent offline backups from stopping all the **VICTIMS PUBLICLY**\n\nnegative effects of a ransomware attack. **POSTED ON LEAK**\n\n**SITES IN 2021**\n\nMulti-extortion techniques were less than a year old heading into 2020,\n\nbut exploded in popularity last year. At least 35 new ransomware gangs,\n\nsuch as Black Matter, Hive, and Grief emerged and threatened to expose\n\n[data or utilized leak sites in 2021. Suncrypt and a new player, BlackCat,](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/)\n\n##### 85%\n\nbegan executing triple extortion attacks, siphoning a victim’s data\n\n**INCREASE IN**\n\nbefore deploying their ransomware and then threatening to release the **VICTIMS COMPARED**\n\n**TO 2020**\n\ninformation and launch a DDoS attack if the ransom was not paid. In 2021,\n\nthe names and proof of compromise for 2,566 victims were publicly posted\n\n\n-----\n\n**02 | THE RANSOMWARE LANDSCAPE**\n\non ransomware leak sites, marking an 85%\n\nincrease compared to 2020. Be prepared to\n\nsee more multi-extortion attack tactics in 2022\n\nand beyond.\n\n###### Ransomware-as-a-Service Is Quickly\n 2\n Lowering the Technical Bar\n\nRansomware has proven to be an effective\n\nmechanism for cybercriminals to hit it big,\n\nin terms of both payouts and notoriety. This\n\nhas led to an evolution of the ransomware\n\n[scene with “entrepreneurial” threat actors](https://www.paloaltonetworks.com/blog/2021/10/ransomware-as-a-service/)\n\nlooking to capitalize on a growing number\n\nof cybercriminals who want in. These\n\nentrepreneurs have started offering RaaS. This\n\nis a business for criminals, by criminals, with\n\nagreements that set the terms for providing\n\nactual ransomware to affiliates, often in\n\nexchange for monthly fees or a percentage of\n\nransoms paid. RaaS makes carrying out attacks\n\nthat much easier, lowering the barrier to entry\n\nand expanding the reach of ransomware. We\n\nare actively tracking at least 56 active RaaS\n\ngroups, some of whom have been operating\n\nsince 2020. Due to the success of these groups,\n\nwe expect activity of this type to continue\n\nto grow.\n\n###### Attackers Are Making Increasing Use\n\n 3\n of Zero-Days\n\n[Ransomware attacks often leverage a wide](https://heimdalsecurity.com/blog/experts-make-out-a-list-of-vulnerabilities-abused-by-ransomware-groups/)\n\n[variety of vulnerabilities as an initial vector of](https://heimdalsecurity.com/blog/experts-make-out-a-list-of-vulnerabilities-abused-by-ransomware-groups/)\n\ncompromise. In 2021, we observed at least 42\n\nvulnerabilities across different technologies\n\nbeing used by ransomware operators.\n\n\n###### 2\n\n\n-----\n\n**02 | THE RANSOMWARE LANDSCAPE**\n\n**Figure 2: Microsoft Exchange Server vulnerabilities timeline**\n\n\nJan. 5\n2021\n\n**Orange Tsai**\nreported a pre-auth\nRCE chain to an\nunnamed vendor\n\n\nJan. 6 - Feb. 2 Mar. 2 Ongoing\n2021 2021\n\n\n**Volexity & Dubex**\nidentify and report active\nexploitation to Microsoft\n\n\n**Microsoft**\nreleased security updates\nto address 4x CVE’s actively\nbeing exploited by Hafium\n\n\n**Hafnium & other groups**\nengage in mass exploitation\nto capitalize on the\nrace condition\n\n\n-----\n\n**02 | THE RANSOMWARE LANDSCAPE**\n\n\n**Figure 3: Log4j timeline**\n\n\nNov. 24\n2021\n\n**Vulnerability**\n**Reported**\n\nVulnerability privately\nreported to Apache\n\n\nDec. 9\n2021\n\n**Exploits**\n**in the Wild**\n\nA remote code\nexecution (RCE)\nvulnerability in\nApache log4j 2\nwas identified being\nexploited in the wild.\n\n\nDec. 10\n2021\n\n**CVE Alert**\n**Published**\n\nNIST published CVE\nAlert with CVSS of 10\n(critical).\n\n\nDec. 6-16\n2021\n\n**Updates**\n**Released**\n\nApached releases\nupdates 2.15.0, 2.15.1,\n2.16.0 and 2.17.0\n(which removes\nLookups)\n\n\nDec.\n2021...\n\n**Attackers Scan for**\n**Vulnerable Systems**\n\nWidespread scanning,\ncoinminers, botnets,\nnation states, access\nbrokers associated\nwith ransomware\ngroups, Ransomware\n\n\nAs long as vulnerabilities are available (unpatched), attackers will take advantage of them to\n\nfurther their objectives. It’s important to keep in mind that attackers may also take advantage of\n\nvulnerabilities in third-party software or attack supply chain elements, which can introduce risks\n\n[for many organizations down the line. We saw this with REvil in the Kaseya attacks.](https://unit42.paloaltonetworks.com/revil-threat-actors/)\n\nOrganizations may have previously grown used to taking time between the disclosure of a\n\nvulnerability and patching it, but while it’s still necessary to perform due diligence on a patch,\n\nattackers’ ability to scan the internet in search of vulnerable systems means it’s more important\n\nthan ever to shorten the time it takes to patch. Organizations need to ramp up patch management\n\nand orchestration to try to close these known holes as soon as possible.\n\n\n-----\n\n##### 03 | Ransomware\n Group Behavior\n\nIn 2021, we saw the emergence of many new ransomware gangs, as well as\n\nthe re-emergence of a number of established players who had gone quiet\n\nfor a period of time. Most of these ransomware groups proceeded to be\n\nvery active, increasingly employing multi-extortion tactics to improve the\n\nlikelihood of a payout.\n\n**Figure 4: Most active ransomware variant in 2021 –**\n\nUnit 42 incident response data\n\nConti 15.5%\n\nREvil/Sodinokibi 7.1%\n\nHello Kitty 4.8%\n\nPhobos 4.8%\n\nSuncrypt 4.8%\n\nAvaddon 3.6%\n\nBlackMatter 3.6%\n\nCring 3.6%\n\nLockbit 3.6%\n\nLockbit 2.0 3.6%\n\nHive 2.4%\n\nMedusaLocker 2.4%\n\npysa 2.4%\n\nRobinhood 2.4%\n\n\n###### Most Active\n Ransomware Groups\n\nConti was by far the most\n\nactive of the ransomware\n\ngroups among the incident\n\nresponse cases handled by\n\nUnit 42 in 2021, making\n\nup 15.5% of ransomware\n\nactivity; REvil/Sodinokibi\n\nwas the second at 7.1%,\n\nfollowed by Hello Kitty and\n\nPhobos at 4.8% each.\n\n##### 15.5%\n\n**CONTI**\n\n##### 7.1%\n\n**REVIL/SODINOKIBI**\n\n##### 4.8%\n\n**PHOBOS**\n\n##### 4.8%\n\n**HELLO KITTY**\n\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n###### Conti\n\n[As noted, Conti was the most active ransomware group among the incidents](https://unit42.paloaltonetworks.com/conti-ransomware-gang/)\n\nhandled by Unit 42 in 2021. They impacted large victims asking for very high\n\nransom demands. We first observed them in March with an initial ransom\n\namount of $50,000. This was the lowest request reported during the year\n\nfor this group. They quickly and significantly increased their demands,\n\naveraging around $1.78 million for the year – their top initial payment request\n\nwas $3 million. Given their initial (only observed) ransom demand in 2020\n\nwas $187,114, it is fair to say they have been quickly growing in numbers and\n\nconfidence.\n\n**Conti stands out as one of the most ruthless ransomware gangs since their**\n\n**emergence in 2020. They operate without a “code of honor” that some other**\n\nthreat actors claim to observe when it comes to targeting vital or particularly\n\nvulnerable victims. Conti carries out attacks against hospitals, emergency\n\nservices, and law enforcement agencies, using double extortion techniques\n\nto shame victims into paying a ransom. From leak site data, which includes\n\nvictims beyond those handled by our incident response team, we found that\n\nConti has leaked the information of more than 600 organizations since 2020.\n\n##### 600+\n\n**ORGANIZATIONS**\n**AFFECTED SINCE**\n**2020** **HOSPITALS** **EMERGENCY SERVICES** **LAW ENFORCEMENT**\n\nConti is also opportunistic, exploiting known vulnerabilities as an initial vector\n\nof compromise. In 2021, they used CVE-2021-34473, CVE-2021-34523, and\n\nCVE-2021-31207 (ProxyShell) in their ransomware attacks, and then started\n\nsuccessfully exploiting CVE-2021-44228, known as Log4Shell, in December,\n\nas a way to move laterally across internal devices.\n\nIn February 2022, a large amount of data associated with Conti was leaked,\n\nincluding internal chat messages, screenshots, and raw data files. Much of the\n\ninformation was originally in Russian. Here we show screenshots of translated\n\nversions of some of what was leaked – providing a view into how Conti\n\noperates when conversing with their victims.\n\n\n###### Conti stands out\n as one of the most\n ruthless ransomware gangs since their\n emergence in 2020.\n\n##### $118,114\n\n**2020 INITIAL**\n**(ONLY OBSERVED)**\n**RANSOM DEMAND**\n\n##### $50K\n\n**MARCH 2021 INITIAL**\n**RANSOM DEMAND**\n\n##### $1.78M\n\n**AVERAGE 2021**\n**RANSOM DEMAND**\n\n##### $3M\n\n**TOP 2021 REQUEST**\n\n\n-----\n\n**Figure 5: Translation of**\nConti communications,\nNovember 2021\n\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n###### REvil - also known as Sodinokibi\n\nREvil/Sodinokibi was the second most active ransomware group during 2021,\n\ndropping slightly from being the most active in 2020. From our 2021 incident\n\nresponse data, they averaged an initial ransom demand of approximately $2.2\n\nmillion. This was significantly higher than what was observed during 2020, when\n\ntheir average ransom demand was $488,928.52. In 2020, their top initial ransom\n\ndemand was $3 million; in 2021 their highest demand was $5.4 million.\n\n[The operator behind this ransomware, PINCHY SPIDER, switched its GandCrab](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/7/)\n\n[operations to REvil/Sodinokibi in mid-2019. This was probably due to recent arrests](https://unit42.paloaltonetworks.com/ransomware-threat-assessments/7/)\n\n[of affiliates suspected of about 7,000 infections. The switch, however, did nothing](https://www.zdnet.com/article/ransomware-suspected-revil-ransomware-affiliates-arrested/#:~:text=Romanian%20authorities%20have%20arrested%20two,European%20law%20enforcement%20agency%20Europol)\n\n[to lower their profile; in fact, thanks to the Kaseya VSA and other big headline](https://unit42.paloaltonetworks.com/revil-threat-actors/)\n\n[attacks, they are one of the world’s most notorious ransomware operators.](https://unit42.paloaltonetworks.com/revil-threat-actors/)\n\n\n##### $3M\n\n**TOP DEMAND**\n\n##### $5.4M\n\n\n**2020**\n\n**2021**\n\n\n##### $489K\n\n**AVERAGE INITIAL**\n**RANSOM DEMAND**\n\n##### $2.2M\n\n**AVERAGE INITIAL**\n**RANSOM DEMAND**\n\n\n**REvil/Sodinokibi is also one of the most prominent providers of RaaS, taking a**\n\n**percentage of the negotiated ransom price as their fee. The size of specific ransoms**\n\ndepended on the size of the organization and type of data stolen. Further, when victims\n\nfailed to meet deadlines for making payments via Bitcoin, the attackers often doubled the\n\ndemand. Eventually, they posted stolen data on leak sites if the victim didn’t pay up or\n\nenter into negotiations.\n\n|$5 TOP DEM minent providers of R s their fee. The size of type of data stolen. Fu s via Bitcoin, the attac on leak sites if the vict|.4 AND aaS, spec rthe kers im d|M taki ifci r r, wh ofte idn’t|\n|---|---|---|\n\n\n-----\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n###### AvosLocker\n\n[AvosLocker is RaaS that started operations in late June, using a blue](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\n\nbeetle logo to identify itself in communications with victims and “press\n\nreleases” aimed at recruiting new affiliates. AvosLocker was observed\n\npromoting its RaaS program and looking for affiliates on dark web\n\ndiscussion forums and other forums. Like many of its competitors,\n\nAvosLocker offers technical support to help victims recover after being\n\nattacked with encryption software that the group claims is “fail-proof,”\n\nhas low detection rates, and is capable of handling large files. This\n\nransomware also has an extortion site, which claims to have impacted six\n\norganizations in the following countries: the U.S., the U.K., the U.A.E.,\n\nBelgium, Spain, and Lebanon.\n\n###### Hive Ransomware\n\n[Hive Ransomware is double-extortion ransomware that started](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\n\noperations in June. Since then, Hive has impacted 66 organizations that\n\nare now listed on the group’s extortion site, including a European airline\n\ncompany and three U.S.-based organizations. Hive uses all tools available\n\nin the extortion tool set to create pressure on the victim, including\n\npublishing the date of initial compromise, a countdown, the date the leak\n\nwas actually disclosed on their site, and even providing the option for\n\nvisitors to the leak site to share the disclosed leak on social media.\n\n###### HelloKitty\n\n[HelloKitty is not a new ransomware group – it can be traced back to](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\n\n2020, when it mainly targeted Windows systems. However, in July,\n\nwe observed a Linux variant of HelloKitty targeting VMware’s ESXi\n\nhypervisor, which is widely used in cloud and on-premises data centers.\n\nWe also observed two clusters of activity. Across the observed samples,\n\nsome threat actors preferred to communicate with victims via email, while\n\nothers used the peer-to-peer anonymous instant messenger service,\n\nTorChats. The observed variants impacted five organizations in Italy,\n\nAustralia, Germany, the Netherlands, and the U.S.\n\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n###### LockBit 2.0\n\n[LockBit 2.0 (previously known as ABCD ransomware) changed their](https://unit42.paloaltonetworks.com/emerging-ransomware-groups/)\n\nname to LockBit in July 2021 and launched a slick marketing campaign to\n\nrecruit new affiliates. It appeared to work, since the three-year-old RaaS\n\noperator was linked to some high-profile attacks in 2021 across multiple\n\n[industries. Their success prompted the Federal Bureau of Investigation](https://www.ic3.gov/Media/News/2022/220204.pdf)\n\n[to publish a warning on them in early 2022. The group claims to offer](https://www.ic3.gov/Media/News/2022/220204.pdf)\n\n**the fastest encryption on the ransomware market. To date, there are**\n\n406 victims listed on the group’s leak site, including organizations in the\n\nU.S., Mexico, Belgium, Argentina, Malaysia, Australia, Brazil, Switzerland,\n\nGermany, Italy, Austria, Romania, and the U.K.\n\n###### Mespinoza\n\n[Mespinoza was observed targeting real estate, manufacturing, and](https://unit42.paloaltonetworks.com/gasket-and-magicsocks-tools-install-mespinoza-ransomware/)\n\neducation organizations. Through research and analysis, Unit 42\n\nresearchers have concluded that Mespinoza has a large global reach,\n\nwith victims in the U.S., Canada, South America, Europe, South Africa,\n\nand Australia. Mespinoza uses the remote desktop protocol as an initial\n\n**intrusion vector and exfiltrates files for exposure on leak sites.**\n\n###### eCh0raix\n\n[eCh0raix has been active for about a year targeting Synology network-](https://unit42.paloaltonetworks.com/ech0raix-ransomware-soho/)\n\nattached storage (NAS) and Quality Network Appliance Provider (QNAP)\n\nNAS devices used in small offices and home offices (SOHOs). To date,\n\nthe attacks have resulted in modest payouts. SOHO users are attractive\n\n**to ransomware operators because they typically don’t employ dedicated**\n\n**IT or security professionals, which makes them less prepared to**\n\n**block ransomware attacks. They also offer a potential way into larger**\n\nenterprises, if attackers can use the SOHO NAS devices as a stepping\n\nstone of supply chain attacks on an enterprise.\n\n\n-----\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n**Figure 8: Final ransom paid versus initial ransom requests over $3 million in 2021,**\n\nfor cases in which the victim chose to pay a ransom,\n\naccording to Unit 42 incident response data\n\n**-6%**\n\n-72%\n\n-63%\n\n-69%\n\n-64%\n\n-63%\n\n-50%\n\n-74% -57%\n\n-95% -68%\n\n-77%\n\n-98% -93%\n\n-100%\n\nInitial Ransom Demand Final Ransom Paid Amount Saved\n\n\n$20M\n\n$15M\n\n$10M\n\n$5M\n\n$0\n\n\n-----\n\n**03 | RANSOMWARE GROUP BEHAVIOR**\n\n###### The Rise of Double (and Multi) Extortion Techniques\n\n[Maze popularized the double extortion tactic in 2019, laying the path for future](https://unit42.paloaltonetworks.com/threat-brief-maze-ransomware-activities/)\n\nransomware operators. With double extortion techniques, adversaries demand a\n\nransom and then inform victims that they will publicly expose the stolen data if the\n\nransom is not paid, presumably to incentivize swift payment in full. In 2021, we\n\nobserved 35 new groups emerge using the same extortion model.\n\nWe also started to see ransomware groups apply triple extortion techniques.\n\n[Suncrypt, originally seen in October 2019, was one of the first, along with BlackCat,](https://unit42.paloaltonetworks.com/ransomware-threat-report-highlights/)\n\nto apply these triple extortion tactics. This means that, along with data encryption\n\nand theft, the gang and its affiliates further extort their victims by threatening\n\nto launch a DDoS attack on the organization’s infrastructure or network should\n\nransom demand negotiations fail. If\n\nnegotiations don’t go well, not only do\n\nthey leak victim data, they initiate the\n\nDDoS attacks to render their victims\n\ninoperable, with the hope that the\n\nLV\n\nvictim will contact them to restart Hive\n\nAvosLocker\n\nnegotiations. BABUK LOCKER\n\nPrometheus\nBLACK MATTER\n\nShould triple extortion not pan out, CoomingProject\n\nSpook\n\nSuncrypt is also one of the first, if Grief\n\nnot the first, ransomware group to BlackByte\n\nMAZE Payload.bin\n\nuse multi-extortion. This includes Egregor XING LOCKER\n\nConti Astro Team\n\nescalating to additional tactics, such DoppelPaymer Moses Staff\n\nSodinokibi (REvil) Vice Society\n\nas threatening to expose the breach NetWalker Haron\n\nPysa snatch\n\nto employees, stakeholders, and DarkSide LOCKDATA\n\nthe media. Suncrypt operators have Nefilim SynACK\n\nAvaddon 54BB47H (Sabbath)\n\ngone so far as to leave voicemails for CL0P Bonaci Group\n\nEverest El_Cometa (SynACK)\n\nemployees of victim organizations in Ragnar_Locker Hotarus\n\nSuncrypt Karma\n\nan effort to wear down any remaining Mount Locker N3tw0rm\n\nresistance to their demands. RagnarokAKO QuantumNoname\n\nLockbit 2.0 Entropy\nRansomEXX Vfo\nPay2Key Snatch\n\n**Figure 9: Ransomware families that** Sekhmet AtomSilo\nemerged using the double extortion Ranzy Locker Darkrypt\ntechnique in 2020 versus 2021 based on Cuba ROOK\n\nanalysis of ransomware group leak sites Lorenz RobinHood\n\nNEMTY BlackCat (ALPHV)\n\n2020 2021\n\n|Col1|Col2|2|021|Col5|\n|---|---|---|---|---|\n\n\n-----\n\n##### 04 | Insights from\n Ransomware Leak Sites\n\nIn 2021, names and proof of compromise for 2,566 victims were publicly posted\n\non ransomware leak sites, which marked an 85% increase compared to 2020.\n\nThe following are some key insights we gathered from collating, analyzing, and\n\nenriching the information on these sites.\n\n\n##### 2,566\n\n**VICTIMS PUBLICLY**\n**POSTED ON**\n**LEAK SITES**\n\n**Most active**\n**ransomware groups**\n**leveraging double**\n**extortion techniques**\n\n\n##### 85%\n\n**IN PUBLICLY POSTING**\n**VICTIMS ON LEAK SITES**\n**COMPARED TO 2020**\n\n##### 511 406\n\n**PUBLICLY POSTED**\n**BREACHES BY** **BREACHES BY**\n**CONTI** **LOCKBIT 2.0**\n\n\n###### Conti Is the Most Prolific on Leak Sites\n\nAnalysis of leak sites found that Conti and LockBit 2.0 are the most active ransomware\n\ngroups leveraging double extortion techniques. Conti is the ransomware family with\n\nthe most publicly posted breaches in 2021 with 511, closely followed by LockBit 2.0 at\n\n406, which also has been actively leaking data since their rebrand in July 2021.\n\n|1 40 LY POSTED PUBLICLY HES BY BREACHE LOCKBIT Leak Sites ckBit 2.0 are the most acti es. Conti is the ransomwar h 511, closely followed by a since their rebrand in Jul|6 POS S BY 2.0 ve ra e fam Lock y 202|TED nsom ily w Bit 2. 1.|\n|---|---|---|\n\n\n-----\n\n**04 | INSIGHTS FROM RANSOMWARE LEAK SITES**\n\n**Figure 10: Victim count per ransomware family, 2021**\n\nConti\nLockbit 2.0\nPysa\nAvaddon\nSodinokibi (REvil)\nCL0P\nDarkSide\nLV\nHive\nDoppelPaymer\nAvosLocker\nEverest\nPrometheus\nBABUK LOCKER\nGrief\nBLACK MATTER\nBlackByte\nCoomingProject\nSpook\nCuba\nRansomEXX\nLorenz\nPayload.bin\nRagnarok\nNetWalker\nXING LOCKER\nVice Society\nNefilim\nAstro Team\nRagnar_Locker\nMoses Staff\nSnatch\nHaron\nQuantum\nsnatch\nBlackCat (ALPHV)\n54BB47H (Sabbath)\nMount Locker\nEntropy\nSynACK\nLOCKDATA\nSuncrypt\nROOK\nEl_Cometa (SynACK)\n\nBonaci Group\nHotarus\nNoname\nN3tw0rm\nLockBit\nKarma\nRobinHood\nAtomSilo\nNoname / Vfo\nAtomsilo\nDarkrypt\n\n0 100 200 300 400 500\n\n>100 51-100 21-50 10-20 <10\n\n\n-----\n\n**04 | INSIGHTS FROM RANSOMWARE LEAK SITES**\n\n###### Sectors and Industries Most Heavily Targeted\n\nBased on ransomware leak site data, the Professional and Legal Services industry\n\nwas the most targeted by ransomware breaches in 2021, with more than 1,100\n\nvictims listed on various sites. Following this sector was the Construction industry,\n\nwhich included more than 600 victims.\n\nThese organizations may be prone to cyberattacks because they often run on\n\nsystems with out-of-date software that isn’t easily or regularly updated/patched –\n\nransomware operators can take advantage of these old vulnerabilities to initiate their\n\nexploits. Add in the rapid adoption of IoT, and attackers have a rapidly expanding\n\n[attack surface through which they can deploy their ransomware (e.g., WannaCry).](https://unit42.paloaltonetworks.com/unit42-threat-brief-wanacrypt0r-know/)\n\nAnother reason these industries could be a popular target is that attackers know if\n\nthe victim’s operations are disrupted, it means they can’t provide their products or\n\nservices. Many organizations within these sectors use their own technologies to\n\nprovide their services, if impacted by a ransomware attack, productivity stops and\n\nprocesses slow down, which could impact business and generate significant costs\n\nand damages. Ransomware groups hope the pressure these organizations are under\n\nto meet deadlines and produce deliverables will lead them to quickly pay in full, so\n\nthey can get back up and running as fast as possible.\n\n**Figure 11: Sectors and industries most heavily targeted by ransomware (leak site data)**\n\nProfessional & Legal Services\n\nConstruction\n\nWholesale & Retail\n\nHealthcare\n\nManufacturing\n\nEducation\n\nAgriculture\n\nState & Local Government\n\nReal Estate\n\n0 200 400 600 800 1000 1200\n\n|400 600|800|Col3|1000|Col5|\n|---|---|---|---|---|\n\n\n-----\n\n**04 | INSIGHTS FROM RANSOMWARE LEAK SITES**\n\n###### Regions and Countries\n Most Heavily Targeted\n\nLeak site data indicates the Americas region\n\nwas hit the hardest by ransomware attacks in\n\n2021, followed by EMEA and Asia Pacific.\n\nFigure 12: Regions affected by\nransomware, 2021 (leak site data)\n\n**Figure 13: Top countries impacted by ransomware**\n(based on the number of victim organizations within each country)\n\nUnited States\n\nCanada\n\nUnited Kingdom\n\nFrance\n\nItaly\n\nGermany\n\nAustralia\n\nSpain\n\nBrazil\n\nIndia\n\n0 300 600 900 1200\n\n\nWhen we look for trends by country\n\nrather than region, the United States\n\nwas the most severely impacted by\n\ndata breaches, with U.S. organizations\n\naccounting for 49% of the leak site\n\ndata, followed by Canada and the United\n\nKingdom, accounting for 5% each. Since\n\nmany ransomware threat actors are\n\nhighly financially motivated, they often\n\nfocus on profitable organizations in the\n\nUnited States. That said, ransomware is\n\na global issue; we have observed at least\n\none victim impacted in more than 90\n\ndifferent countries.\n\n##### 49% 5%\n\n**UNITED STATES** **CANADA** **UNITED**\n\n##### [5%]\n\n**KINGDOM**\n\n|Col1|Col2|Col3|Col4|was data acco data Kin ma hig focu Uni a gl one diff 4 UNIT|\n|---|---|---|---|---|\n\n\n-----\n\n**04 | INSIGHTS FROM RANSOMWARE LEAK SITES**\n\n###### The Ebbs and Flows of Ransomware Gangs\n\nThe activity of individual ransomware groups tends to go up and down – a group\n\nthat’s prominent and active one month may seem to disappear altogether the next\n\nmonth. These ransomware groups shut down or go quiet for various reasons. For\n\ninstance, they may be under pressure or scrutiny from law enforcement, sorting out\n\ninternal struggles (between operators and affiliates), or dealing with competition\n\n(e.g., a new RaaS with better rates that incentivize affiliates to switch).\n\nSometimes a group may simply rebrand or re-launch their product.\n\nOperators need people (affiliates) who are willing to use their\n\nransomware – if they can’t sell it, they may try to retool and rebrand. One\n\ninteresting use case is the critical flaw that Emsisoft researchers found\n\nin DarkSide and BlackMatter ransomware, which enabled victims to\n\ndecrypt and recover their files without having to pay a ransom. This cost\n\nthe ransomware groups millions of dollars in ransom payments and is\n\nlikely related to why they went offline. It is presumed they went quietly\n\nto work on a better version (it’s suspected they are the BlackCat group,\n\nwhich suddenly came on the scene and made waves in November 2021,\n\nbut Unit 42 researchers have not yet confirmed this).\n\n\n**Examples of some swings in ransomware group activity seen in 2021:**\n\n- **LockBit successfully pulled off a rebrand last year with their launch of LockBit 2.0.**\nAfter their initial debut in July 2021 they added victims at a very stable rate for a few\nmonths, peaking in September 2021.\n\n- **Avaddon decreased submissions to their sites in early June, and then halted**\noperations altogether mid-June, when they released decryption keys for all of their\n2,934 victims. (It’s worth noting that this activity shows how challenging it is to get\nvisibility into ransomware operations – their site only had 180 victims publicly listed.)\n\n- **REvil/Sodinokibi activity was noticeable throughout the year, but due to their attack**\nagainst Kaseya, they stopped submitting victims after July 2021. The group reemerged in September as displayed on the chart, but went back to being offline for\nthe remainder of the year, most likely as a result of law enforcement action against\nthe group.\n\n- **Pysa re-emerged at the end of the year with lots of activity, after no activity during**\nthe summer of 2021.\n\n- November was a very active month for Conti, LockBit 2.0, and Pysa, with more than 30\nsubmissions into their respective leaksites.\n\n\n-----\n\n**04 | INSIGHTS FROM RANSOMWARE LEAK SITES**\n\n**Figure 14: Snapshot of the ebbs and flows of leak site activity for**\n\nransomware families in 2021\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\nJAN FEB MAR APR MAY JUN JUL AUG SEP OCT NOV\n\nAvaddon Conti Lockbit 2.0 Pysa Sodinokibi (REvil)\n\n\n-----\n\n-----\n\n**05 | RANSOMWARE IN CLOUD ENVIRONMENTS**\n\n###### Securing Cloud APIs through IAM Best Practices\n\nThreat actors seeking to deploy ransomware in the cloud will not be able to simply\n\ninfect more hosts and encrypt the files they find there. Instead, they will use cloud\n\nAPIs to access and encrypt data, which means that organizations will need to\n\nsecure access to those APIs.\n\nThis is one of the ways that following cloud security best practices is key. All API\n\ncommunications require identity and access management (IAM) access keys and\n\nsufficient permissions for the cloud resource the user is trying to interact with.\n\nThreat actors seeking to abuse cloud APIs would have to steal access keys and then\n\ntest their permissions, which means that organizations can defend against this type\n\n[of attack by closely monitoring IAM permissions. First, organizations should check](https://unit42.paloaltonetworks.com/highlight-cloud-threat-report-IAM/)\n\n[for misconfigurations, overly broad permissions, and other weaknesses in IAM](https://unit42.paloaltonetworks.com/iam-misconfigurations/)\n\n[access. Next, organizations should institute procedures to identify exposed IAM](https://unit42.paloaltonetworks.com/iam-roles-compromised-workloads/)\n\n[access keys and continuously monitor IAM access keys to cloud resources.](https://unit42.paloaltonetworks.com/iam-roles-compromised-workloads/)\n\n###### Threat Actors Face Barriers in the Cloud, Which Buys Time for Organizations to Prepare Now\n\nFor now, various barriers will likely slow threat actors seeking to attack\n\norganizations through the cloud. The supported APIs for each cloud service are\n\ndifferent, and each cloud service provider offers a number of different data storage\n\nservices. This doesn’t mean organizations should assume they’re immune to\n\nransomware in the cloud. The time to institute best practices, especially regarding\n\nidentity and access management, is now, so those protections are in place before\n\nthreat actors focus their efforts on deploying ransomware in this manner.\n\nThis can include the use of a Cloud Security Posture Management tool to help\n\nensure the deployment of proper compliance frameworks and perform valid asset\n\ncontrol over cloud environments. A Cloud Infrastructure Entitlement Management\n\ntool can assist with IAM security monitoring. Other tools such as Cloud Code\n\nSecurity and Cloud Workload Protection can be configured automatically to ensure\n\nthat security teams can scale as the cloud scales.\n\n\n-----\n\n##### 06 | Costs of Ransomware\n\nAs ransomware gangs become bolder, they are having a bigger impact on\n\nthe organizations they target. While it is generally advised not to pay the\n\nransom, the prolonged effects of a shutdown can force organizations to\n\nconsider other options to restore operations.\n\nThe long-term effects of a ransomware attack can pose a substantial\n\n[challenge for organizations. A Canadian study found that of the businesses](https://www.paloaltonetworks.ca/resources/research/2021-palo-alto-networks-canada-ransomware-barometer)\n\nhit by ransomware, a majority (58%) of IT decision-makers say their\n\norganization paid the ransom, with 14% saying their organization paid more\n\nthan once.\n\nIn addition to the ransom—whether or not the organization decides to pay\n\nit—there are other ancillary costs that need to be factored into the damage\n\ninflicted by an attack:\n\n- Costs associated with any downtime or disruptions to the business\n\n- The impact of the breach on a company’s brand reputation\n\n- Time spent by IT staff dealing and recovering from the incident\n\n- Legal expenses incurred addressing regulatory and compliance\n\nconsiderations\n\n- Most notably, any data loss that triggers any number of follow-on impacts\n\nThe Canadian study found that, while 41% of businesses hit with a\n\nransomware attack were able to recover in less than a month, 58% took\n\nmore than a month. As more time passed, some businesses were still\n\nworking on recovery – 29% of surveyed businesses attacked by ransomware\n\ntook more than three months, and 9% said it took them more than five to six\n\nmonths to return to normal.\n\nTo minimize the impact of a successful attack or, ideally,\n\nprevent it altogether, preparation is key. This includes ensuring\n\nboth backup systems and proactive defenses are in place to\n\naccelerate an organization’s recovery.\n\n\n##### 58%\n\n**ORGANIZATIONS**\n**PAID THE RANSOM**\n\n##### 14%\n\n**ORGANIZATIONS PAID**\n**MORE THAN ONCE**\n\n**RANSOMWARE ATTACK**\n**RECOVERY TIME**\n\n###### 41%\n\n 20% 20%\n\n 9%\n\n1 MO. 1-3 >3 >5-6\nMOS. MOS. MOS.\n\n|Col1|20% 20% 9%|\n|---|---|\n\n\n-----\n\n##### 07 | Conclusion and\n Recommendations\n\nAs ransomware actor activity continues to rise worldwide, preparation is key to\n\nthwarting attacks. Because double extortion and leak sites are the new normal for\n\nemerging ransomware families, the ante has been raised – it’s no longer just access\n\nto data that’s at stake, as significant as that can be, but also a victim’s reputation\n\nand the trust a customer has in an organization that is on the line. While maintaining\n\ngood cyber hygiene and implementing security awareness training is a foundational\n\nstarting point, Unit 42 makes the following recommendations to help you become\n\nmore resilient against ransomware.\n\n###### 1 Stay Up to Date on the Evolving Threat Landscape\n\nThe ransomware threat landscape will undoubtedly continue to evolve,\n\nas threat actors leverage new creative techniques to stifle business\n\noperations. Keep your security team and key executive stakeholders\n\nbetter informed of the current state of ransomware threats, their potential\n\nimpact to your business, and actionable steps your organization can take to\n\nprevent attacks. This means educating your key C-level stakeholders and\n\nthe board by speaking the language of the business and leveraging threat\n\nbriefings to strategically inform your risk profile and security strategy. You\n\nmust also educate your technical security team on the latest ransomware\n\nthreats, including attack vectors, TTPs, ransom demands, and top\n\nsafeguards to prevent attacks.\n\n###### 2 Analyze the Business Impact of Losing Critical Data\n\nTo understand the impact of losing access to critical data, you must first\n\ngain full visibility into your assets and understand where critical data\n\nlives, how it’s accessed, and how it’s used across your organization. We\n\nrecommend completing a data mapping exercise, ensuring that access\n\nto confidential information is on a need-to-know basis. Next, conduct\n\n\n###### 2\n\n\n-----\n\n**07 | CONCLUSION AND RECOMMENDATIONS**\n\na business impact analysis to fully understand the risks associated with\n\nnot having access to that data – both from an upstream and downstream\n\nperspective. For example, if you’re a retail organization, what is the\n\ndowntime that is going to occur at your headquarters, in your stores, and\n\nin the supply chain if your point-of-sale system is down and you can’t do\n\nmanual processing?\n\n###### 3 Assess Internal and External Readiness\n\nYou run the increased risk of a successful – and highly damaging –\n\nransomware attack if you don’t consistently assess your security posture.\n\nAssess the most significant ransomware risks ahead of you within the\n\ncontext of your unique combination of people, processes, technology, and\n\ngovernance capabilities. You will also need to look across the business\n\nto identify any third-party elements, partner elements, or supply chain\n\nelements that could introduce risks. With this knowledge, you can\n\nestablish a prioritized mitigation roadmap detailing the requirements to\n\nreach your organization’s security goals aligned with strategic business\n\nobjectives.\n\n###### 4 Review and Test Your Incident Response Plan\n\nPressure test and update your incident response plan on a regular basis\n\nleveraging the latest ransomware threat intelligence to conduct tabletop\n\nexercises and purple team testing simulations. By conducting mock\n\nincident response walkthroughs, you can measure your ability to respond\n\nto a ransomware attack before it happens and evaluate your ability\n\nto counter the tactics, techniques, and procedures used by common\n\nransomware groups. These types of exercises can help you identify gaps\n\nand areas for improvement to help bolster your readiness and strengthen\n\nyour overall cyber defense capabilities to combat ransomware.\n\nAs a part of these exercises, leaders should ensure that decision trees\n\nare formally defined and socialized with key stakeholders to facilitate\n\ndiscussion and buy-in. When a change in stakeholder personnel occurs,\n\nthese decision trees should be revisited and updated as required. Having\n\nthe tough conversations before an incident occurs will save valuable time\n\n\n###### 3\n\n\n-----\n\n**07 | CONCLUSION AND RECOMMENDATIONS**\n\nand enable organizations to focus on what matters most – maintaining\n\ncritical operations and recovering to a state of normalcy.\n\n     - Under what circumstances would you pay a ransom?\n\n      - How would you maintain customer trust if the media was swirling with\n\nrumors and your stock price was sinking?\n\n     - What would happen if your CISO was incapacitated when an incident\n\nwas discovered?\n\n      - Who would you call to stop an active incident from spreading like\n\nwildfire?\n\n###### 5 Implement Zero Trust\n\nZero Trust, a strategic approach to cybersecurity to secure an organization,\n\neliminates implicit trust and continuously validates every stage of digital\n\ninteraction. The Zero Trust Model has become increasingly top of mind\n\nfor executives who need to keep up with digital transformation and adapt\n\nto the ever-changing security landscape. Many organizations still struggle\n\nwith a poorly integrated, loose assembly of point products that do not\n\nalign with the strategic approach expected by board members and C-level\n\nexecutives. Deployed properly, Zero Trust simplifies and unifies risk\n\nmanagement by making security one use case across users, device, source\n\nof connection, or access method.\n\n###### 6 Identify Your Exposed Assets\n\nImplement a system of record to track every asset, system, and service\n\nyou own that is on the public internet. This includes tracking across all\n\nmajor cloud service providers and dynamically leased (commercial and\n\nresidential) Internet Service Provider (ISP) space, using comprehensive\n\nindexing and spanning common, and often misconfigured, port/protocols\n\n(i.e., not limited to the old perspective of only tracking HTTP and HTTPS\n\nwebsites). For example, Remote Desktop Protocol (RDP) is the most\n\npopular initial ransomware attack vector, accounting for the majority of\n\nransomware infections, since attackers can easily uncover this protocol\n\nthanks to working from home now being a common norm. M&A, supply\n\nchain, and IoT also bypass change controls, making them another popular\n\nvector. M&A activity, for example, has reached an all-time high during the\n\nCOVID-19 pandemic, changing the face of networks almost overnight.\n\n\n###### 6\n\n\n-----\n\n**07 | CONCLUSION AND RECOMMENDATIONS**\n\nWhile security teams are doing a good job, it’s no longer sufficient to\n\nprotect a static IP address – infrastructure changes quickly.\n\nAn attack surface management (ASM) platform can provide a complete\n\nand accurate inventory of an organization’s global internet-facing assets\n\nand misconfigurations to continuously discover, evaluate, and mitigate\n\nsecurity issues on an external attack surface, flag risky communications,\n\nevaluate supplier risk, find RDP instances, or assess the security of\n\nacquired companies.\n\n###### 7 Prevent Known and Unknown Threats\n\nTo prevent known threats, you need to stop known exploits, malware, and\n\ncommand-and-control traffic from entering your network. Once those have\n\nbeen stopped, the cost of executing an attack rises and, subsequently,\n\nreduces its likelihood, by forcing attackers to create new malware variants\n\nand launch new exploits against lesser-known vulnerabilities.\n\nYou also need to prevent users from inadvertently downloading a malicious\n\npayload or having their credentials stolen by preventing access to known\n\nmalicious and phishing URLs. Blocking these threats removes them from\n\nthe equation entirely. Once these known threats have been blocked, you\n\nneed to scan for known malware on your SaaS-based applications, as they\n\nare increasingly leveraged to deliver threats. Any identified malware and\n\nexploits from the scan should be blocked. The same should be done for\n\nknown malware and exploits on the endpoint.\n\nOnce the known threats have been blocked, it is imperative to identify and\n\nblock any unknown threats, as attackers continue to deploy new zero\nday exploits and develop new ransomware variants. Identify all traffic on\n\nthe network and block unknown, potentially high-risk traffic (e.g. macros\n\ndownloaded from the internet) at the edge, ensuring you have coverage of\n\nweb and non-web traffic. Next, detect unknown threats in files and URLs.\n\nAs new files are submitted, it is essential to detonate, analyze, and look for\n\nmalicious behavior.\n\nAdditionally, you need to automatically push the protections to different\n\nparts of the security infrastructure as fast as possible in order to prevent\n\nthreats from becoming successful. These protections should include an\n\n\n-----\n\n**07 | CONCLUSION AND RECOMMENDATIONS**\n\nunderstanding of the context of the attacker, malware, campaign, and IoCs\n\nassociated with the attack. Once unknown threats or trends of suspicious\n\nbehavior have been identified and blocked, block unknown malware and\n\nexploits on the endpoint to ensure that all access points are secure.\n\nThe ultimate goal of this process is to turn the unknown into the known\n\nand improve the security posture with new protections at a faster pace\n\nthan attackers can develop their malware and exploits – across the entire\n\nattack lifecycle.\n\n###### 8 Automate Where Possible\n\nConsider implementing tools that support the automated remediation of\n\nevents that leverage pre-made playbooks to respond and recover from\n\nincidents. Incident response (IR), SecOps, and threat intelligence teams\n\ncan save many hours of manual labor trying to piece disparate sources\n\nof information together from multiple tools. Security orchestration,\n\nautomation, and response (SOAR) products can automate the whole\n\nprocess of user investigation, endpoint isolation, notifications,\n\nenrichment, and threat hunting by orchestrating across security\n\ninformation and event management (SIEM), firewalls, endpoint security,\n\nand threat intelligence sources so that response teams can quickly shut\n\ndown the ransomware, minimize the risk of losing data, and limit the\n\nfinancial impact of ransom demands.\n\n###### 9 Secure Cloud Workloads\n\nSecuring cloud workloads for ransomware defense begins with a secure\n\nposture. Ensure that all cloud infrastructure, Kubernetes, and container\n\nimages are securely configured and steps have been taken to minimize\n\nvulnerabilities. Check that standard policies, like encryption, MFA delete,\n\nversioning, and backups that are built into cloud provider offerings, but\n\noff by default, are turned on and properly configured. Check open source\n\npackages and libraries for vulnerabilities that can be patched. Identify\n\nand remove overly permissive or unused IAM entitlements. This is best\n\nchecked throughout the development lifecycle, making sure the code is\n\nsecure before it turns into cloud applications and infrastructure. At runtime,\n\ncheck for known bad and anomalous activities that indicate a compromise.\n\n\n###### 9\n\n\n-----\n\n-----\n\n##### Methodology\n\nThis report is based on data from multiple sources, both internal and\n\nexternal. The objective is to expose threat actors, not their victims, so\n\nall case data has been anonymized and only categorized by topics, such\n\nas industry, geography, and attack vector. The source of specific data\n\nreferenced in the report is noted throughout.\n\n\nInternal data for this report (referenced primarily in Section 2) was anonymized\n\ninformation collected during security consulting and incident response\n\nengagements from clients predominantly based in the U.S. One service that Unit 42\n\nSecurity Consulting performs is ransomware negotiations on behalf of clients. For\n\nthe subset of clients who use this service and elect to pay the ransom, Unit 42 tracks\n\nkey information, including the ransomware variant, initial demand, amount paid,\n\nand whether or not the threat actor provided the decryption utility upon payment\n\nfor the initially agreed-upon amount. Additional data for this report comes from\n\nmanaged threat hunting, product security telemetry, and threat research organically\n\ndeveloped during the course of business.\n\nExternal data (referenced primarily in Section 3) was collated and analyzed from\n\nransomware leak sites to identify ransomware families performing double extortion.\n\nMost of the time these ransomware notes include onion links, which direct victims\n\nto their site – these sites are hosted in a repository and monitored by the team to\n\nunderstand their activity throughout the year. The majority of the sites are publicly\n\navailable and found on the “dark web,” which allows the team to scrape victim\n\nnames, dates, and the sites where the data is hosted. After the data is collected, it\n\nis enriched by the team with the victim’s industry, sector, location, and any other\n\ndetails that can be discerned.\n\nWe recently revised the methodology we use to calculate average ransom demands\n\nand payments. As a result, we’re restating the 2020 average payment to $303,757\n\n(from $312,493 published in the 2021 Ransomware Threat Report).\n\n\n-----\n\n###### About Palo Alto Networks\n\nPalo Alto Networks, the global cybersecurity leader, is shaping the cloud-centric\n\nfuture with technology that is transforming the way people and organizations\n\noperate. Our mission is to be the cybersecurity partner of choice, protecting our\n\ndigital way of life. We help address the world’s greatest security challenges with\n\ncontinuous innovation that seizes the latest breakthroughs in artificial intelligence,\n\nanalytics, automation, and orchestration. By delivering an integrated platform and\n\nempowering a growing ecosystem of partners, we are at the forefront of protecting\n\ntens of thousands of organizations across clouds, networks, and mobile devices.\n\nOur vision is a world where each day is safer and more secure than the one before.\n\n[For more information, visit www.paloaltonetworks.com.](http://www.paloaltonetworks.com)\n\nPalo Alto Networks has shared these findings, including file samples and indicators\n\nof compromise, with our fellow Cyber Threat Alliance members. CTA members use\n\nthis intelligence to rapidly deploy protections to their customers and systematically\n\n[disrupt malicious cyber actors. Visit the Cyber Threat Alliance for more information.](https://cyberthreatalliance.org/)\n\n###### About Unit 42\n\nPalo Alto Networks’ Unit 42 brings together world-renowned threat researchers\n\nwith an elite team of incident responders and security consultants to create\n\nan intelligence-driven, response-ready organization passionate about helping\n\ncustomers more proactively manage cyber risk. With a deeply rooted reputation\n\nfor delivering industry-leading threat intelligence, Unit 42 has expanded its\n\nscope to provide state-of-the-art incident response and cyber risk management\n\nservices. Our consultants serve as your trusted advisor to assess and test your\n\nsecurity controls against the right threats, transform your security strategy\n\nwith a threat-informed approach, and respond to incidents in record time. Visit\n\n[paloaltonetworks.com/unit42.](http://paloaltonetworks.com/unit42)\n\n\n-----\n\n###### Palo Alto Networks Ransomware Capabilities\n\nMany Palo Alto Networks products include comprehensive functionality specific to\n\nstopping ransomware. Learn more about Unit 42’s research into ransomware actors\n\nand the product protections that Palo Alto Networks offers for specific situations on\n\n[the Unit 42 blog.](https://unit42.paloaltonetworks.com/category/ransomware/)\n\n###### Network Security\n\nCloud-delivered security services bring the network effect of thousands of customers\n\nacross various security technologies to coordinate intelligence and provide consistent\n\nprotection across all attack vectors. Deployed across our range of ML-Powered Next\nGeneration Firewalls – hardware PA-Series, software VM-Series and CN-Series, and\n\ncloud-delivered Prisma® Access along with Cloud-Delivered Security Services – our\n\nservices help eliminate coverage gaps. To read in-depth on each product and service,\n\nplease visit the links.\n\n[WildFire® malware prevention service is natively integrated into all Palo](https://www.paloaltonetworks.com/products/secure-the-network/wildfire)\nAlto Networks products and blocks activity associated with known and\nunknown ransomware variants as well as other file-based threats.\n\n[Advanced URL Filtering blocks access to known and new unknown](https://urlfiltering.paloaltonetworks.com/)\nmalicious URLs, preventing a host from reaching out via HTTP to a web\nserver Palo Alto Networks has deemed to host suspicious content/\nmalware.\n\n[Advanced Threat Prevention leverages the firewall's visibility to inspect](https://www.paloaltonetworks.com/network-security/advanced-threat-prevention)\nall traffic and automatically prevent known exploits, malware, and\nspyware regardless of port, protocol, or SSL encryption.\n\n[DNS Security blocks command and control and data exfiltration](https://www.paloaltonetworks.com/network-security/dns-security)\nattempts that specifically exploit the DNS protocol, found in over 85% of\nbreaches, including ransomware.\n\n[IoT Security provides visibility into all IoT, OT, IT, and Bluetooth devices](https://www.paloaltonetworks.com/network-security/iot-security)\n\n###### IoT and recommends least- privilege (Zero Trust) policies, which minimizes\n\nthe risk of an adversary using an unmanaged device as a jumping off\npoint to deliver ransomware or other malicious files.\n\n[Enterprise Data Loss Prevention automatically detects and prevents](https://www.paloaltonetworks.com/enterprise-data-loss-prevention)\nunsafe transfers of sensitive data against corporate policies and\nminimizes overexposure of sensitive data throughout the entire\nenterprise, across remote users, and on cloud applications.\n\n\n-----\n\n[Cortex® XDR™ is the industry’s first extended detection and response platform](https://www.paloaltonetworks.com/cortex/cortex-xdr)\n\nthat integrates data from any source to stop ransomware and countless other\n\ndangerous attacks. The Cortex XDR agent automatically blocks exploits, malware,\n\nand fileless attacks targeting endpoints. Analysts can quickly stop the spread\n\nof ransomware, restrict network activity to and from devices, and update threat\n\nprevention lists like bad domains through tight integration with enforcement\n\npoints. Cortex XDR allows you to:\n\n- Block ransomware attacks at every step in the attack lifecycle with a complete\nendpoint protection stack, including exploit prevention, behavioral threat\nprotection, AI-driven local analysis, and an anti-ransomware module.\n\n- Find stealthy attacks such as lateral movement and exfiltration with cross-data\nanalytics across endpoint, network, cloud, and identity data.\n\n- Quickly investigate incidents with root cause analysis.\n\n- Contain any threat with coordinated and flexible response.\n\n[Cortex XSOAR helps you speed discovery and remediation when ransomware](https://www.paloaltonetworks.com/cortex/cortex-xsoar)\n\nis detected by automating the whole process of user and host data enrichment,\n\nblocking malicious indicators, and isolating/ quarantining infected endpoints\n\nand users.\n\n[Prisma® Cloud is a comprehensive cloud native security platform with the](https://www.paloaltonetworks.com/prisma/cloud)\n\nindustry’s broadest security and compliance coverage – for applications, data,\n\nand the entire cloud native technology stack – throughout the development\n\nlifecycle and across hybrid and multi-cloud deployments. Prisma Cloud’s\n\nintegrated approach enables security operations and DevOps teams to stay agile,\n\ncollaborate effectively, and accelerate cloud native application development and\n\ndeployment securely.\n\n[Cloud Security Posture Management](https://www.paloaltonetworks.com/prisma/cloud/cloud-security-posture-management) – Segments services to prevent lateral\n\nmovement, limiting the impact of a successful breach.\n\n\n-----\n\n[Unit 42 brings together world-renowned threat researchers with an elite team](https://www.paloaltonetworks.com/unit42)\n\nof incident responders and security consultants to create an intelligence-driven,\n\nresponse-ready organization passionate about helping customers more proactively\n\nmanage cyber risk.\n\n[Ransomware Readiness Assessment](https://www.paloaltonetworks.com/ransomware-readiness-assessment) – Using the latest threat intelligence, Unit\n\n42 can help you assess your current state of readiness and develop a ransomware\n\nplaybook to expertly manage ransomware attacks leveraging real-world simulations,\n\ncompromise assessments, and board advisory consulting.\n\n[Incident Response – When your files and applications are inaccessible due to a](https://www.paloaltonetworks.com/unit42/incident-response)\n\nransomware attack, call in our elite Unit 42 incident response team to step in to\n\ninvestigate, contain, and eradicate the threat, so you can restore operations quickly.\n\n\n-----\n\n© 2022 Palo Alto Networks, Inc. Palo Alto Networks is a registered ­trademark of Palo Alto Networks. A list of our trademarks can be found\n[at https://www paloaltonetworks com/company/trademarks html All other marks mentioned herein may be trademarks of their respective](https://www.paloaltonetworks.com/company/trademarks.html)\n\n\n3000 Tannery Way\n\nSanta Clara, CA 95054\n\nMain: +1.408.753.4000\n\nSales: +1.866.320.4788\n\nSupport: +1.866.898.9087\n\nwww.paloaltonetworks.com\n\n© 2022 Palo Alto Networks, Inc. Palo Alto Networks is a registered ­trademark of Palo Alto Networks. A list of our trademarks can be found\n[at https://www paloaltonetworks com/company/trademarks html All other marks mentioned herein may be trademarks of their respective](https://www.paloaltonetworks.com/company/trademarks.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-24 - Ransomware Threat Report 2022.pdf"
    ],
    "report_names": [
        "2022-03-24 - Ransomware Threat Report 2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "527e04ee-7f5f-49aa-8653-f893b43730bd",
            "created_at": "2022-10-25T16:07:24.512541Z",
            "updated_at": "2025-03-27T02:02:10.266333Z",
            "deleted_at": null,
            "main_name": "Moses Staff",
            "aliases": [
                "Abraham's Ax",
                "Cobalt Sapling",
                "DEV-0500",
                "Marigold Sandstorm",
                "Vengeful Kitten",
                "White Dev 95"
            ],
            "source_name": "ETDA:Moses Staff",
            "tools": [
                "DCSrv",
                "DCrSrv",
                "PyDCrypt",
                "StrifeWater",
                "StrifeWater RAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8610b0d9-a6af-4010-818f-28671efc5d5e",
            "created_at": "2023-01-06T13:46:38.897477Z",
            "updated_at": "2025-03-27T02:00:02.945669Z",
            "deleted_at": null,
            "main_name": "PINCHY SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:PINCHY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c84bbd2e-003d-4c43-8a46-d777455db2c7",
            "created_at": "2022-10-25T15:50:23.701006Z",
            "updated_at": "2025-03-27T02:00:55.527357Z",
            "deleted_at": null,
            "main_name": "GOLD SOUTHFIELD",
            "aliases": [
                "GOLD SOUTHFIELD",
                "Pinchy Spider"
            ],
            "source_name": "MITRE:GOLD SOUTHFIELD",
            "tools": [
                "ConnectWise",
                "REvil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "84aa9dbe-e992-4dce-9d80-af3b2de058c0",
            "created_at": "2024-02-02T02:00:04.041676Z",
            "updated_at": "2025-03-27T02:00:03.297502Z",
            "deleted_at": null,
            "main_name": "Vanilla Tempest",
            "aliases": [
                "DEV-0832",
                "Vice Society"
            ],
            "source_name": "MISPGALAXY:Vanilla Tempest",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ba5bc606-8b26-416a-881d-76cdefc6c75c",
            "created_at": "2024-06-04T02:03:07.777739Z",
            "updated_at": "2025-03-27T02:05:17.322164Z",
            "deleted_at": null,
            "main_name": "COBALT SAPLING",
            "aliases": [
                "Moses Staff",
                "Abraham's Ax"
            ],
            "source_name": "Secureworks:COBALT SAPLING",
            "tools": [
                " PyDcrypt",
                " StrifeWater RAT",
                "DCSrv"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "600a0c3b-b595-4d10-b84b-cc2cf89289ac",
            "created_at": "2024-06-19T02:03:08.134296Z",
            "updated_at": "2025-03-27T02:05:17.402638Z",
            "deleted_at": null,
            "main_name": "GOLD VICTOR",
            "aliases": [
                "STAC5279 ",
                "Vanilla Tempest ",
                "Vice Society",
                "DEV-0832 "
            ],
            "source_name": "Secureworks:GOLD VICTOR",
            "tools": [
                " Advanced Port Scanner",
                " HelloKitty ransomware",
                " MEGAsync",
                " Neshta",
                " PAExec",
                " PSexec",
                " PortStarter",
                " SystemBC",
                " Zeppelin ransomware",
                "Advanced IP Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bef06c82-0f51-44ba-8451-049cd4ad8a52",
            "created_at": "2023-01-06T13:46:39.325635Z",
            "updated_at": "2025-03-27T02:00:03.05159Z",
            "deleted_at": null,
            "main_name": "MosesStaff",
            "aliases": [
                "Moses Staff",
                "Marigold Sandstorm",
                "DEV-0500"
            ],
            "source_name": "MISPGALAXY:MosesStaff",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c4d0e4e1-5ad3-4455-8291-ce72a1e09e46",
            "created_at": "2022-10-27T08:27:13.055675Z",
            "updated_at": "2025-03-27T02:00:55.458634Z",
            "deleted_at": null,
            "main_name": "Moses Staff",
            "aliases": [
                "Moses Staff",
                "DEV-0500",
                "Marigold Sandstorm"
            ],
            "source_name": "MITRE:Moses Staff",
            "tools": [
                "PyDCrypt",
                "PsExec",
                "DCSrv",
                "StrifeWater"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9df68733-9bcd-43b1-88f1-24b110fa3d56",
            "created_at": "2022-10-25T16:07:24.051993Z",
            "updated_at": "2025-03-27T02:02:10.091553Z",
            "deleted_at": null,
            "main_name": "Pinchy Spider",
            "aliases": [
                "Gold Garden",
                "Gold Southfield",
                "Pinchy Spider"
            ],
            "source_name": "ETDA:Pinchy Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "GandCrab",
                "GrandCrab",
                "REvil",
                "Sodin",
                "Sodinokibi",
                "VIDAR",
                "Vidar Stealer",
                "certutil",
                "certutil.exe",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535776,
    "ts_updated_at": 1743041759,
    "ts_creation_date": 1648057773,
    "ts_modification_date": 1648057777,
    "files": {
        "pdf": "https://archive.orkl.eu/6aa232ca1544fb0a4662a11bea540b158b810a71.pdf",
        "text": "https://archive.orkl.eu/6aa232ca1544fb0a4662a11bea540b158b810a71.txt",
        "img": "https://archive.orkl.eu/6aa232ca1544fb0a4662a11bea540b158b810a71.jpg"
    }
}