{
    "id": "8ab7d205-bba7-496c-af44-513133d5c823",
    "created_at": "2023-01-12T15:11:00.443367Z",
    "updated_at": "2025-03-27T02:05:23.575746Z",
    "deleted_at": null,
    "sha1_hash": "9425b80ab1b308ab29b70fce44a83de28ee548ce",
    "title": "2021-11-11 - SharkBot- a new generation of Android Trojans is targeting banks in Europe",
    "authors": "",
    "file_creation_date": "2022-05-27T22:51:49Z",
    "file_modification_date": "2022-05-27T22:51:49Z",
    "file_size": 5353699,
    "plain_text": "# SharkBot: a new generation of Android Trojans is targeting banks in Europe\n\n**[cleafy.com/cleafy-labs/sharkbot-a-new-generation-of-android-trojan-is-targeting-banks-in-europe](https://www.cleafy.com/cleafy-labs/sharkbot-a-new-generation-of-android-trojan-is-targeting-banks-in-europe)**\n\nFederico Valentini, Francesco Iubatti\n\n## Download your PDF guide to TeaBot \n\nGet your free copy to your inbox now\n\nDownload PDF Version\n\n## Key Points\n\nAt the end of October 2021, a new Android banking trojan was discovered and\nanalyzed by the Cleafy TIR team. Since we didn't find references to any known\nfamilies, we decided to dub this new family SharkBot.\nThe main goal of SharkBot is to initiate money transfers from the compromised\ndevices via Automatic Transfer Systems (ATS) technique bypassing multi-factor\nauthentication mechanisms (e.g., SCA). These mechanisms are used to enforce users'\nidentity verification and authentication, they are usually combined with behavioural\ndetection techniques to identify suspicious money transfers.\nWe identified a botnet which is currently targeting the UK, Italy, and the US, including\nbanking applications and cryptocurrency exchanges. Given its modularity architecture\nwe don't exclude the existence of botnets with other configurations and targets.\n\n\n-----\n\nOnce SharkBot is successfully installed in the victim s device, attackers can obtain\nsensitive banking information through the abuse of Accessibility Services, such as\ncredentials, personal information, current balance, etc., but also to perform gestures on\nthe infected device.\nAt the time of writing, SharkBot appears to have a very low detection rate by antivirus\nsolutions since multiple anti-analysis techniques have been implemented: string\nobfuscation routine, emulator detection and a domain generation algorithm (DGA) for\nits network communication in addition to the fact that the malware has been written\nfrom scratch.\n**SharkBot implements Overlay attacks to steal login credentials and credit card**\ninformation and it also has capabilities to intercept legitimate banking communications\nsent through SMS.\nAt the time of writing, multiple indicators suggest that SharkBot could be at its early\nstages of development.\n\n## Executive Summary\n\nAt the end of October 2021, a new Android banking trojan appeared on Cleafy's telemetries.\nSince the lack of information and the absence of a proper nomenclature of this malware\nfamily, we decided to dub it SharkBot to better track this family inside our internal Threat\nIntelligence taxonomy.\n\n**SharkBot belongs to a “new” generation of mobile malware, as it is able to perform ATS**\nattacks inside the infected device. This technique has been already seen recently from other\nbanking trojans, such as Gustuff. ATS (Automatic Transfer System) is an advanced attack\ntechnique (fairly new on Android) which enables attackers to auto-fill fields in legitimate\nmobile banking apps and initiate money transfers from the compromised devices. Contrary to\n[TeaBot and](https://www.cleafy.com/cleafy-labs/teabot) [Oscorp/UBEL where a live operator is required to insert and authorize a money](https://www.cleafy.com/cleafy-labs/ubel-oscorp-evolution)\ntransfer, with ATS technique Threat Actors can scale up their operations with minimum user\nintervention. We assume that SharkBot is trying to bypass behavioural detection\ncountermeasures (e.g.,biometrics) put in place by multiple banks and financial services with\nthe abuse of Android Accessibility Services, also bypassing the need of a “new device\nenrollment”.\n\n\n-----\n\nFigure 1 – Example of how SharkBot perform an ATS attack\nMoreover, SharkBot appears to have all the main features of nowadays Android banking\n[trojan achieved by abusing Accessibility Services[1]such as:](https://developer.android.com/reference/android/accessibilityservice/AccessibilityService)\n\nAbility to perform classic Overlay Attacks against multiple applications to steal login\ncredentials and credit card information\nAbility to intercept/hide SMS messages\nEnabling key-logging functionalities\nAbility to obtain full remote control of an Android device (via Accessibility Services)\n\nAt the time of writing, we didn’t notice any samples on Google's official marketplace. The\nmalicious app is installed on the users' devices using both the side-loading technique and\nsocial engineering schemes.\n\nThanks to an in-depth analysis of several samples related to SharkBot, we collected 22\n**different targets including international banks from UK and Italy and 5 different**\n**cryptocurrency services, as shown in the following Figure 2:**\n\n\n-----\n\nFigure 2 – Geographical distribution of banks currently targeted by SharkBot\n\n[1] [https://developer.android.com/reference/android/accessibilityservice/AccessibilityService](https://developer.android.com/reference/android/accessibilityservice/AccessibilityService)\n\n## Technical Analysis – Overview\n\nSharkBot, is a new generation Android banking trojan, discovered by Cleafy Threat\nIntelligence team at the end of October 2021. The name “SharkBot” comes from multiple\nstrings found in its binaries, which contain the word “sharked”.\n\nSharkBot hides itself with common names and icons posing as a legitimate application to the\nvictims, as shown in Figure 3.\n\nFigure 3 – Main names/icons used by SharkBot\nHowever, during its installation, SharkBot immediately tries to enable Accessibility Services\nthat keep being requested persistently with fake pop-ups until the victim accepts.\n\n\n-----\n\nFigure 4 – Installation phases of SharkBot\nOnce the malicious app has been installed, no icon is displayed on the device and SharkBot\nis able to get all the permissions needed (declared inside the AndroidManifest file) thanks to\nthe accessibility services enabled. This is done by clicking instantly on the popup shown to\nthe user.\n\nFigure 5 – Android Permissions of SharkBot\nWith the permissions shown in Figure 5, SharkBot is able to read/send text messages,\nperform overlay attacks and, with the REQUEST_IGNORE_BATTERY_OPTIMIZATIONS\npermission, it is able to bypass Android's doze component and stay connected to the C2\nservers to continue its malicious behavior.\n\nAt the time of writing, Sharkbot seems to be still under development as the very first samples\ntracked down at the end of October use:\n\n[a demo version of the Allatori Java Obfuscation [2] (as shown in Figure 6).](http://www.allatori.com/)\nthe word “example” in the package name\n\n\n-----\n\nthe words test1 and testuk inside the C2 used during the first exchange of\ninformation with malware.\nsome functionalities are not yet available.\n\nFigure 6 – Use of a demo version of the Allatori Java Obfuscation\nSo far, SharkBot has a very low detection rate by antivirus solutions (only 3/62), as shown\nby Figure 7. This means that the malware has been written from scratch, in addition to the\nfact that it uses an external module, downloaded from the C2, containing the ATS core\nfunctionalities and anti-detections technique used to slow down the static and dynamic\nanalysis.\n\nAnalysing the underground hacking forums, we didn’t find any references to this malware.\nThis makes us think that SharkBot is still a private botnet.\n\nFigure 7 – Detection of SharkBot by antivirus solutions\n\n\n-----\n\nFigure 8 – Some information about SharkBot botnet\n\n[2] [http://www.allatori.com/ (*Allatori is a legitimate software)](http://www.allatori.com/)\n\n## Evasion techniques\n\nSharkBot uses different anti-analysis and detection techniques, in particular:\n\nStrings obfuscation, to slow down the static analysis and “hide” all the commands and\nimportant information used by the malware, as shown in Figure 9.\n\nFigure 9 – Example of strings obfuscation\n\n\n-----\n\n**Anti-Emulator. When the malicious application is installed on the device, it checks if**\nthe device is an emulator or a real phone. This technique is usually used to bypass\nsandboxes or common emulators used by researchers during the dynamic analysis.\n**External** **ATS** **module. Once installed, the malware downloads an additional module**\nfrom the C2. The external module is a “.jar” file that contains all the functionality used to\nperform the ATS attacks. We analyze this module in the paragraph “SharkBot - ATS\n(Automatic Transfer System) module”.\n**Hide the icon app. Once installed, SharkBot hides the icon of the app from the device**\nscreen.\n**Anti-delete. Like other malware, SharkBot uses the Accessibility Services to avoid that**\nthe user uninstalls the malicious application from the settings options.\n**Encrypted communication. All the communication between the malware and C2 are**\nencrypted and encoded with Base64. In addition to this, SharkBot uses a Domain\nGenerator Algorithm (DGA).\n\nFigure 10 – SharkBot DGA method\n\n## SharkBot “classical” features\n\nAlthough SharkBot has an ATS module, it also has some common features present in other\nbanking trojan, in particular:\n\nThe capability to read and hide SMS received from the infected user (sending them to\nthe threat actor C2 server). This feature is mostly used by threat actors to get the 2FA\nsent by the bank via text messages.\nThe “now famous” overlay attack used to steal login credentials and credit card data.\nThis feature is used by SharkBot to obtain the login credentials of the targeted\nbanks/crypto app, to perform the ATS attack to the next step.\n\n\n-----\n\nFigure 11 – Example of overlay attack performed by SharkBot\n\n## SharkBot – ATS (Automatic Transfer System) module\n\nAndroid’s Accessibility Service has been historically abused by multiple banking trojans (e.g.,\n[TeaBot,](https://www.cleafy.com/cleafy-labs/teabot) [Oscorp/UBEL) for conducting multiple malicious actions in the infected device.](https://www.cleafy.com/cleafy-labs/ubel-oscorp-evolution)\nSharkBot, similar to Gustuff, is able to abuse Accessibility Service enabling ATS attacks\ninside the infected device.\n\nATS (Automatic Transfer System) attacks enable TA to auto-fill fields in legitimate mobile\nbanking apps and initiate money transfers from the compromised devices to a money mule\nnetwork controlled by TA or other affiliates. This makes it possible to scale up their\noperations with minimum user intervention.\n\nFor a bank perspective, mobile ATS attacks are very hard to identify and handle since\ntypically:\n\nThey don't require a “new device enrollment” phase which drastically reduces their\nfootprint.\nThey are able to bypass any 2FA mechanism used by banking applications (e.g. SMSbased, push-based, etc.).\nAs all the actions are performed by the trusted user, ATS attacks are able to bypass\nBehavioral detection mechanisms, including Behavioral biometrics.\n\n\n-----\n\nIllegitimate wire transfers are inserted and authorized on the victim device itself, which\ntypically is considered “trusted” by banks.\n\nOnce a victim has granted accessibility permissions, all the contents shown in the device\nscreen can be intercepted and manipulated by SharkBot. Those capabilities are gained\n[through Android AccessibilityEvents which are events that are sent by Android OS when](https://developer.android.com/reference/android/view/accessibility/AccessibilityEvent)\nsomething notable happens in the user interface. In fact, the main purpose of an accessibility\n[event is to communicate changes in the UI to an AccessibilityService.](https://developer.android.com/reference/android/accessibilityservice/AccessibilityService)\n\nSharkBot appears to have interest only on a specific subset of accessibility events, which are\nthe following:\n\nFigure 12 – AccessibilityEvent types intercepted by SharkBot\nWe can group all the accessibility events intercepted by SharkBot as follows:\n\n\n**TYPE_VIEW_CLICKED**\n**TYPE_VIEW_SELECTED**\n**TYPE_VIEW_TEXT_CHANGE**\n**TYPE_VIEW_TEXT_SELECTION_CHANGE**\n\n\n**fired when a button is clicked, an item**\n**is selected or when text changes are**\n**detected.**\n\n\n-----\n\n**TYPE_VIEW_CLICKED**\n**TYPE_VIEW_SELECTED**\n**TYPE_VIEW_TEXT_CHANGE**\n**TYPE_VIEW_TEXT_SELECTION_CHANGE**\n\nTYPE_WINDOW_STATE_CHANGED\nTYPE_WINDOW_CONTENT_CHANGED\nCONTENT_CHANGE_TYPE_TEXT\n\nTYPE_NOTIFICATION_STATE_CHANGED\nTYPE_ANNOUNCEMENT\n\n\n**fired when a button is clicked, an item**\n**is selected or when text changes are**\n**detected.**\n\nfired when a visually distinct section of the\nuser interface is detected, for example\nwhen a new Activity has been launch (e.g\nnavigating to a different page of the same\napplication, or switching applications).\n\nfired when a new notification appears on\nthe device or when an application makes\nannouncements.\n\n\nSharkBot has already implemented various functions which are been used for parsing all the\ndata extracted from the UI, save them into a JSON format and exfiltrate them to the designed\nC2 server:\n\nFigure 13 – Retrieve and save data extracted from the intercepted Accessibility events\nTA can also passively logs all the exfiltrated information from each infected device and\nenriching them with detailed information useful for a further ATS attack, such as account\nbalance(s), enabled 2FA/SCA/MFA mechanisms, cash-out availability (e.g. SEPA, Instant\npayments), etc.\n\nOnce the ATS attack is remotely requested by TA, SharkBot will start interacting with the\ninfected device and auto-fill fields in legitimate mobile banking apps and initiate money\ntransfers. During this phase TA can also interact with the targeted application simulating\ngestures and clicks, if required.\n\n\n-----\n\nFigure 14 – Auto-fill fields in legitimate mobile banking app during ATS attack\n\n## Conclusion\n\nWith the discover of SharkBot we have shown new evidence about how mobile malwares\nare quickly finding new ways to perform fraud, trying to bypass behavioural detection\ncountermeasures put in place by multiple banks and financial services during the last years.\n\nLike the evolution of workstation malwares occurred in the past years, also in the mobile field\nwe are seeing a rapid evolution towards more sophisticated patterns like ATS attacks.\n\nAppendix 1: SharkBot commands\n\nThe following table summarize the list of all the commands found in SharkBot during the\ntechnical analysis:\n\n**Command** **Description**\n\nupdateLib Not implemented\n\nupdateSQL Update configuration data stored on a local database\n\nupdateConfig Update the configuration file, containing the C2 url and the targets\n\nuninstallApp Delete an app installed on the infected device\n\nchangeSmsAdmin Change the default SMS app manager\n\n\n-----\n\n**Command** **Description**\n\nsendInject Receive Overlay attacks payloads from C2\n\nupdateTimeKnock Update timestamp bot\n\nsendPush Not implemented\n\nunlockPhone Set a specific variable during ATS attack\n\nats Enable ATS attacks\n\noverlay Enable Overlay attacks\n\nenableKeyLogger Get keylogging steps during ATS attack\n\nunlockPhone1 Check if the device has a PIN, pattern or password setted up.\n\noverlay2 Enable Overlay attacks\n\nopenPackage Open an arbitrary Android application\n\ndoze Bypass Android “doze” feature for enabling network communication in\nthe background\n\nstopAll Reset ATS routine\n\nAppendix 2: IOCs\n\n\nApp Name\n\n\nMedia Player HD\n\n\nPackage Name com.pycdvgljmfgh3hgp8jo72giu.omflsx1q2g\n\nMD5 f7dfd4eb1b1c6ba338d56761b3975618\n\nC2 sharkedtest1[.]xyz\n\nsharkedtestuk[.]xyz\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-11 - SharkBot- a new generation of Android Trojans is targeting banks in Europe.pdf"
    ],
    "report_names": [
        "2021-11-11 - SharkBot- a new generation of Android Trojans is targeting banks in Europe.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536260,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1653691909,
    "ts_modification_date": 1653691909,
    "files": {
        "pdf": "https://archive.orkl.eu/9425b80ab1b308ab29b70fce44a83de28ee548ce.pdf",
        "text": "https://archive.orkl.eu/9425b80ab1b308ab29b70fce44a83de28ee548ce.txt",
        "img": "https://archive.orkl.eu/9425b80ab1b308ab29b70fce44a83de28ee548ce.jpg"
    }
}