{
    "id": "8aba1d20-f373-42f3-bed1-e878bf932308",
    "created_at": "2023-01-12T15:07:50.514569Z",
    "updated_at": "2025-03-27T02:05:27.576879Z",
    "deleted_at": null,
    "sha1_hash": "517fd6ee1e47c53ea3542161436685a6d4d02ceb",
    "title": "2021-05-11 - Recommendations Following the Colonial Pipeline Cyber Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:30Z",
    "file_modification_date": "2022-05-28T02:43:30Z",
    "file_size": 767168,
    "plain_text": "# Recommendations Following the Colonial Pipeline Cyber Attack\n\n**[dragos.com/blog/industry-news/recommendations-following-the-colonial-pipeline-cyber-attack/](https://www.dragos.com/blog/industry-news/recommendations-following-the-colonial-pipeline-cyber-attack/)**\n\nMay 11, 2021\n\nBlog Post\n\n\n-----\n\n-----\n\nBy Mike Hoffman, Dr. Tom Winston\n\n05.11.21\n\nOn May 7th, public reporting emerged about Colonial Pipeline operations being impacted by\na ransomware incident in their IT environment, and then operators temporarily halted OT\noperations as a precaution. Like any pipeline, Dragos would expect Colonial Pipeline to\nhave so many dependencies between their control and SCADA systems into their business\nsystems that it becomes hard to reasonably delineate and separate. With this in mind, out\nof an abundance of caution, halting operations becomes the safest choice.\n\n\n-----\n\nColonial Pipeline is a midstream Oil and Natural Gas (ONG) pipeline and storage company\nbased in Alpharetta, Georgia, USA that transfers refined petroleum products between\ndownstream refining facilities to storage sites and handling transfer from upstream\nproduction sites to downstream refining facilities for a large majority of the United States.\n\nThis blog is intended to share what is known about this event, offer a perspective of what\nsubsystems can be found and what operations occur within pipelines to those unfamiliar,\nand offer recommendations to asset owners based on similar ransomware cases Dragos\nhas worked in OT networks, including from the same group, DarkSide.\n\n## DarkSide and Ransomware Outlook\n\nOn Sunday, May 9th Dragos released an intel report to our customers that assessed with\nhigh confidence that the DarkSide ransomware group was responsible for the IT\ncompromise. During the past year, various manufacturing industries have reported similar\nincidents and have attributed them to other ransomware groups such as REvil, and CL0P.\nThe recent pattern of ransomware incidents encrypts filesystems and steals either\nconfidential information or Personally Identifiable Information (PII) from the organizations\nand threatens to post the information on dedicated leak sites (DLS) unless the ransom is\npaid in a timely manner. During the past year, Dragos has observed several instances of\nthis happening in multiple industrial sectors, including against the major vendor and asset\noperator, Honeywell. No industry has been immune to this with numerous cases taking\nplace in manufacturing as well as electric power sectors. However, the Colonial Pipeline\nevent is the most disruptive incident Dragos has witnessed on US energy infrastructure\nfrom cyber intrusions.\n\nDarkSide, and many other ransomware groups, are opportunistic. They find soft targets,\nevaluate if they are a strong candidate to ransom, and then they attack.\n\nUnfortunately, this applies to many industrial companies. These groups rely on weak\npasswords via unsecured internet exposed services such as Remote Desktop Protocol or\nexploits against a vulnerable version of common internet-facing devices. Numerous\nvulnerabilities have been released over the past year for these types of devices to include\n**Pulse Connect Secure, Fortinet FortiOS, and Accellion FTA devices. Once initial access**\nis achieved, they quickly bring in tools focused on gaining Domain Administrator access to\nenable them to then deliver their ransomware. Dragos response teams have observed this\ninitial access to the deployment of ransomware ranging widely with ransomware delivered\nas quickly as 24 hours from initial access while in other cases several months before the\ngroup deploys their ransomware payload. In our incident response cases and assessments,\nDragos often finds shared credential management between IT and OT networks such as\nconnected Domain Controllers as a mechanism to impact OT.\n\n## How a Strong Architecture Can Support Response Efforts\n\n\n-----\n\nAlthough this attack was carried out on the Enterprise network, it brings to light the highly\ninterconnected nature of OT operations that businesses must consider. Many organizations\nfeel they have highly segmented OT networks to include their industrial control systems\n(ICS). However, in Dragos’s assessments and cases, we find this to not be the case. It is\ncommon to hear about pending IT-OT convergence, but in reality, much of that convergence\ntook place a decade ago, and the preventative controls, such as segmentation, that the\norganizations had in place have atrophied over time through misconfigurations, additional\ndevices, or just the nature of needing increased connectivity for the business. What the\nindustry is experiencing now is the digital transformation of our infrastructure, which is\nresulting in hyper-connectivity not only to the corporate IT networks but also personnel,\nvendors, integrators, original equipment manufacturers, and cloud resources.\n\nResponding to ransomware attacks in the OT environment is even more challenging due to\nthe overall lack of network monitoring and host-and-network based logging. At a minimum,\ncrown jewels, which are the most critical assets in operational systems, should be actively\nmonitored. When preventative measures fail or atrophy over time, asset owners and\noperators are often at the mercy of discovering the incident only after the malware has\nexecuted and run its course, encrypting systems and taking them offline. Unfortunately,\nduring incident response engagements, Dragos has found that many companies have little\nvisibility into the operations and production networks. This slows down incident response\nand removes options from the company on what they can do to blunt the incident. Those\norganizations that are proactive and develop consistent insights using frameworks such as\nthe [collection management framework are able to know what the most relevant logs are,](https://www.dragos.com/blog/industry-news/building-a-collection-management-framework-for-industrial-control-systems/)\nwhere they are stored, and how long they are available. These simple types of actions\nrapidly increase the ability to respond to incidents. Often in incident response cases, almost\nnothing is available.\n\nComplete segmentation is often impractical, but a defensible architecture can still be\nmaintained that significantly reduces risk and makes the response more effective. As shown\nin Figure 1 below, SCADA systems should be architected in such a way as to provide\ncommunications segmentation and disconnection points in case of an attack. Limit what\nprotocols communicate through this segmentation, as ransomware groups will use\nprotocols such as remote desktop (RDP), windows file sharing (SMB), and Active Directory\nauthentication (NTLM) to move from one zone into another.\n\nWith network monitoring and visibility in place, a defender could view malicious traffic\ncoming into the DMZ and begin changing the environment or disconnecting the systems\nfrom the outside world. Next, defenders will want to ensure monitoring is taking place down\nin the SCADA server to identify changes to outstation communications or at the application\nserver to identify if configurations or modifications are occurring. Project files at the\nEngineering Workstation (EWS) are also a valued target that needs monitoring, protection,\nand offline backups as they often contain programs and configurations of the SCADA itself\nor those of remote PLC and RTU devices.\n\n\n-----\n\nContinuing this example, if remote polling and operational visualizations systems are\ncompromised, the next isolation point is around the communications out to remote pipeline\npump and metering stations. Isolating here ensures local systems are kept operational, and\ncontrol is still possible. If we made it to this point, remote teams would be activated and sent\nto the remote locations. This is difficult to achieve in a reduced workforce setting common\namong highly automated environments. Each of these scenarios needs to be discussed and\ndocumented in OT incident response plans and regularly exercised.\n\nAgain, this is a best-case response scenario with many fallback options. Many of our\nresponses are instead based on loosely segmented networks or networks with no\nsegmentation at all.\n\n\n-----\n\nFigure 1: Common Pipeline SCADA Architecture\n\n## Perspective on Pipelines\n\nPipelines are critical to the entire energy supply chain, ranging from bringing raw crude oil\nand other products to refineries and plants to provide final product delivery to end-users and\ncustomers. Raw or final product delivery occurs through a complex pipe network from the\nproduct source to its destination. Storage capacity for products is limited at refineries and\nchemical plants. Additionally, distribution terminal tank storage also provides the limited\n\n\n-----\n\ncapacity needed for swings in customer demand or short-term outages. However, when a\npipeline disruption happens, the cascading effects can be witnessed with operational plants\ncurtailing production as feed tank levels drop and finished product tank levels rise to\nmaximum capacity, ultimately resulting in plants shutting down. Terminals supply tanks are\ndrained of their limited resources and are no longer able to supply customer demand. This\neffect is ultimately played out with escalating fuel prices or complete fuel outages, disrupting\ntransportation and societal norms.\n\nPipeline systems comprise pumping stations, storage facilities, supply and delivery stations,\ncustody transfer metering, and a vast array of interconnected piping. These systems span\nlarge geographic areas and comprise local control and partial autonomous control at these\npumping and valve stations with Supervisory Control and Data Acquisition (SCADA) system\nto provide remote monitoring and control across the entire pipeline network. Apart from\ninternal operations, pipelines are interconnected to product suppliers’ control systems to\nbegin and end product transfer activities. Plant Distributed Control Systems (DCS) interact\nwith pipeline pump and valve stations to enable or disable product flow and share\ninformation of process variables around product flow rates, temperatures, pressures, and\nproduct quality measurements.\n\nThe interconnectivity does not end with control systems. Pipeline operations depend on\nexternal IT systems for issuance and product transfer orders, measurement corrections,\nand invoicing. Business systems, such as SAP and others, are often highly integrated\nbetween pipeline operations to serve the business and financial part of the functions.\nProduct orders flow from these IT systems to the SCADA systems to begin movement and\nbatch operations. Final product transfer data is sent back to the IT systems for product\nmeasurement correction, inventory management, invoicing, and historization.\n\nAlthough these IT and OT systems are independent from a systems standpoint, they are\nhighly dependent on the overall business operations. Therefore, “segment and disconnect\nOT” may not be a straightforward response approach to ensure OT operations during an\nincident. The pipeline can still operate without the IT counterpart but is severely impacted\nwhen that IT system is taken down from a ransomware event, such as has happened at\nColonial Pipeline. With OT digital transformation, connectivity from IT to OT is far more\ncommon for most ICS asset owners and operators. Dragos has observed the atrophying of\nprevention controls from assessments and incident response actions. This, coupled with a\nlack of visibility and monitoring of assets, affects ICS asset owners and operator’s ability to\nhave an effective response to incidents and not detecting early IT-based warning signs of\ncompromise.\n\n## Summary of Recommendations\n\n\n-----\n\nReview existing segmentation and preventative controls that may have atrophied over\ntime; achieving ICS network monitoring and visibility will allow consistent validation of\nthe preventive controls and make them more robust. Incorporate network monitoring\nacross the internal OT networks to provide continual visibility into these cross IT/OT\nconnections. Ingress/Egress monitoring is important, but due to the nature of ICS, it is\nvital to achieve “East-West” traffic analysis.\nIdentify shared systems or infrastructure on the IT side that could allow an adversarial\ngroup to pivot and deploy Ransomware to the OT side. This includes shared Active\nDirectory between IT/OT or potentially insecure protocols, such as SMB, FTP, RDP,\nVNC, with direct IT/OT access.\nReview dataflows of critical business system applications reliant on OT\ncommunications and document them. This may include historians, SAP, or other\nEnterprise Resource Planning (ERP) systems. Ensure they are understood, risk\nassessed and included in both the business continuity and disaster recovery plans.\nEngage firms with OT/ICS incident response experience if internal resources are not\ntrained or readily available. Ensure that Incident Response (IR) plans are current, and\nconduct Table Top Exercises (TTX) to rehearse those plans that include both IT and\nOT staff.\nEnsure backups are being performed across critical OT systems, such as data\nhistorians, SCADA servers, and their databases. This also includes PLC/RTU project\nfiles, which may be absent from conventional backup systems. Periodically test the\nbackups and ensure there is an offline copy in the event that an online system\nbecomes encrypted from ransomware.\n\n[If you’ve read our recently released Year In Review you’ll find many commonalities- our top](https://www.dragos.com/year-in-review/)\n5 recommendations from 2020 all are highly relevant to this activity. Finally, realize your IT\nand Security staff are usually already under-invested. Picking up a whole new mission set\nwith focus (OT) requires additional resources. Elevate the conversation in your\norganizations and invest in your people to enable your business.\n\n## Securing Remote Access for Pipeline Systems\n\nWith SCADA systems, remote operations are just part of “normal operations.” However,\nremote access into SCADA workstations and servers from enterprise systems or the\ninternet is a significantly different discussion. Simply firewalling off the SCADA is not the\nright answer. Remote access from untrusted networks into critical OT networks requires\nneeds careful consideration to ensure usability needs and remote workforce requirements\nare not providing a wide-open path for adversary groups. Dragos has written a blog\n[focusing on secure remote access titled A Matter of Trust: Remote Access for ICS. That](https://www.dragos.com/blog/industry-news/a-matter-of-trust-remote-access-for-ics/)\nblog is still very relevant in light of increased remote operations and engineering\nrequirements of today’s workforce, and the recommendations still apply:\n\n\n-----\n\nEngineering and OT teams should evaluate what systems should leverage remote\naccess.\nRemote access requirements should be determined, including what IP addresses,\ncommunication types, and processes can be monitored. All others should be disabled\nby default. Validate your external exposure of IT and OT systems using tools such as\nShodan.\nUser-initiated access should require multi-factor authentication from the Internet to a\nDMZ with a dedicated jump host for ICS-specific communications. This system should\nleverage its own identity and access management system.\nFrom the DMZ, after authentication, user-initiated remote access should follow a\ntrusted path to the OT system—where the user will authenticate again, this time using\nthe local identity and access management solution.\nAll remote access communications should be centrally logged and monitored. Various\ndetection techniques should be implemented on remote access systems, such as\nlooking for brute force attempts or specific exploits for known vulnerabilities.\n\n## What’s Next?\n\nAll signs point to an opportunistic attack across IT systems, disrupting a significant portion\nof infrastructure. Our infrastructure is increasingly connected with a growing gap in our\nvisibility to both understand and defend it.\n\nAs a community we have a long road ahead of us. Many pointed questions will be asked by\nmedia and policymakers over the coming weeks and months. We must focus not just on\nprotecting our infrastructure but also on assuming those protections will fail. And we also\nmust educate our peers, policymakers, and local communities.\n\nLearn more about ransomware and extortion activities impacting ICS/OT.\n\n[Get the free report](https://www.dragos.com/resource/ransomware-in-ics-environments/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-11 - Recommendations Following the Colonial Pipeline Cyber Attack.pdf"
    ],
    "report_names": [
        "2021-05-11 - Recommendations Following the Colonial Pipeline Cyber Attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536070,
    "ts_updated_at": 1743041127,
    "ts_creation_date": 1653705810,
    "ts_modification_date": 1653705810,
    "files": {
        "pdf": "https://archive.orkl.eu/517fd6ee1e47c53ea3542161436685a6d4d02ceb.pdf",
        "text": "https://archive.orkl.eu/517fd6ee1e47c53ea3542161436685a6d4d02ceb.txt",
        "img": "https://archive.orkl.eu/517fd6ee1e47c53ea3542161436685a6d4d02ceb.jpg"
    }
}