{
    "id": "8abbaa71-951d-4775-97ff-0120acbb8fb9",
    "created_at": "2023-01-12T15:01:36.815317Z",
    "updated_at": "2025-03-27T02:08:41.302137Z",
    "deleted_at": null,
    "sha1_hash": "578616f9ec6aedfb4cb69345c5da612ad517a00f",
    "title": "2021-04-23 - Analysis of the CardingMafia March 2021 data breach",
    "authors": "",
    "file_creation_date": "2022-05-28T17:38:25Z",
    "file_modification_date": "2022-05-28T17:38:25Z",
    "file_size": 1524669,
    "plain_text": "# Analysis of the CardingMafia March 2021 data breach\n\n**[xorl.wordpress.com/2021/04/23/analysis-of-the-cardingmafia-march-2021-data-breach/](https://xorl.wordpress.com/2021/04/23/analysis-of-the-cardingmafia-march-2021-data-breach/)**\n\nApril 23, 2021\n\n[leave a comment »](https://xorl.wordpress.com/2021/04/23/analysis-of-the-cardingmafia-march-2021-data-breach/#respond)\n\nOne relatively large carding forum, the CardingMafia, was breached and their data were\n[shared in darkweb channels in late March 2021. I got a hold of this data set and found some](https://www.vice.com/en/article/v7m9jx/credit-card-hacking-forum-gets-hacked-exposing-300000-hackers-accounts)\ninteresting information. Of course, I cannot share PII or other sensitive material in a public\nblog post, but I can share some of the more generic analysis to hopefully provide better\ninsights in this underground carding community, and the overall darkweb carding\ncommunities.\n\nFirst of all, CardingMafia was both a “shopp” and an English-speaking forum. This means\nCardingMafia members were able to have forum discussions on topics of interest but there\nwas also a section of the website where members could buy and/or sell stolen digital goods\n(compromised accounts, cardholder data, etc.)\n\nThe data leak that happened in March 2021 was from the “user” table of the SQL server of\nthe forum. In total, there were 297,076 accounts with various details such as username, IP\naddress, creation time, hashed password, email, status, likes, etc. This is the dataset I’m\nusing for this blog post.\n\nAs always, this is a personal research. I’m neither a lawyer nor I’m talking on behalf of my\nemployer. This is 100% personal threat research to enrich some of my personal threat\nintelligence cases and projects.\n\n\n-----\n\nThe top 100 IP addresses with the highest amount of user accounts in CardingMafia are\nshown below. Each of those IP addresses had anything from 180 to over 13,000 unique\nforum accounts associated with it.\n\nAlthough some were automated accounts (probably from darkweb scraping bots), it appears\nthat many legitimate users were also using those services to hide their real IP addresses\n(proxies, VPNs, hosted jumphosts, etc.)\n\n\n-----\n\nFrom those top 100 IP addresses you can see that the vast majority were coming from the\nUS (29%), France (14%) and Ukraine (12%). Again, this doesn’t necessarily mean that the\nforum users were actually from these countries, but that they were using services from those\ncountries to access the forum.\n\n\n-----\n\nTo have a more holistic view, the following geo-heatmap is based on all of the 297,076 IP\n**addresses. It’s worth noting here that in reality there were only 56,685 unique IP addresses**\nthat were used to open CardingMafia forum accounts.\n\nWith this bigger picture view, we get a better understanding of likely the real countries of the\nforum members since many of them were connecting directly from ISPs. The United States\nis probably skewed due to the amount of cloud services and proxies, but the rest should be\ncloser to reality.\n\nTo make this clearer, below you can find the top 20 countries along with the amount of\nCardingMafia accounts based on geolocation data of the IP addresses recorded with each of\nthe CardingMafia forum accounts.\n\n1. USA (19393 accounts)\n2. Germany (2553 accounts)\n3. United Kingdom (2479 accounts)\n4. Russia (1841 accounts)\n5. China (1781 accounts)\n6. France (1632 accounts)\n7. Indonesia (1559 accounts)\n8. Netherlands (1458 accounts)\n9. Canada (1410 accounts)\n10. Ghana (1384 accounts)\n\n11. Australia (1138 accounts)\n12. India (1042 accounts)\n\n\n-----\n\n13. Ukraine (1016 accounts)\n14. Nigeria (992 accounts)\n15. Brazil (705 accounts)\n16. Spain (663 accounts)\n17. Japan (647 accounts)\n18. Hong Kong (586 accounts)\n19. Vietnam (572 accounts)\n20. Singapore (560 accounts)\n\nSince the United States is the top one in all of the above statistics (although it’s mainly due to\nthe amount of cloud and proxy services based in the US), here is a similar geo-heatmap per\nUS state.\n\nAnd the top 5 states with the highest amount of CardingMafia accounts created from IP\naddresses geolocated in there were the following:\n\n1. California (3189 accounts)\n2. New York (1771 accounts)\n3. Florida (1721 accounts)\n4. Texas (1302 accounts)\n5. Illinois (823 accounts)\n\nThe email addresses used by the CardingMafia members also provide some interesting\ninsights. For example, there were 294,887 unique email addresses. To avoid clutter, I picked\nthe top 20 email service providers used for those accounts and you can see them here.\n\n\n-----\n\nUnsurprisingly, GMail.com is the top one with 51.7%, followed by Yahoo.com (13.4%) and\nHotmail.com (6.3%).\n\nThere is something else which is interesting though. There were some email addresses from\ncorporate accounts which again, could be benign but it it could also be an insider threat. I will\nnot list those here but it was everything from small businesses to large multi-national\ncorporations across various industries.\n\nSomething else which is notable is that only a tiny percentage of the forum members were\nusing privacy-focused email service providers. For example, using the top 5 list from\nCyberNews we have:\n\n1. ProtonMail: 3155 accounts (1.07% of the total accounts)\n2. Tutanota: 375 accounts (0.13% of the total accounts)\n3. Zoho Mail: 60 accounts (0.02% of the total accounts)\n4. Thexyz: 0 accounts\n5. Startmail: 4 accounts (0.000014% of the total accounts)\n\nI want to highlight this since we keep on hearing how cyber-criminals are very\nprivacy-/anonymous-aware by many government officials, but the above is a clear indication\nthat the vast majority (over 97%) of the members of a relatively large cyber-criminal forum\nwere using unencrypted email providers.\n\nThe above is also supported by breaking down the type of connections used for the creation\nof each of those accounts. Based on the enriched IP addresses described earlier, here are\nthe connectivity types.\n\n\n-----\n\n**Suggestions for threat intelligence production**\n\nI didn’t want this blog post to be just a selection of statistics for a carding forum, so here are\nsome suggestions for turning this data breach into actionable intelligence. There are other\nuse cases too in the more generic threat research space, but I tried to keep it limited to\nactionable threat intelligence suggestions.\n\nCheck if any accounts where created with your domain name(s) as it could be benign\n(curious employees, threat researchers, etc.) but it could also be an insider threat.\n\nIf you are an email service provider, use the dataset to find out which of your users\nhave been using your services to host and/or access cyber-criminal content. Again, it\ncould be benign (threat research, law enforcement, etc.) but it could also lead you to\nsome real cyber-criminals.\n\nIf you are a hosting provider, use the IP dataset to find out which of your customers\nhave been using your services to host and/or access cyber-criminal content. Again, it\ncould be benign (threat research, law enforcement, etc.) but it could also lead you to\nsome real cyber-criminals.\n\nIf you are a national CERT (or similar entity) use this dataset filtering on your ASNs and\nTLDs to better understand the threat landscape of your country and potentially even\nuncover some cyber-criminal activity.\n\nIf you are working on de-anonymization or tracking of a cyber-criminal use this dataset\nfor enrichment and pivot searching (e.g. emails, hashed passwords, IP addresses).\n\nCheck if any accounts were created from your IP address ranges (there are some\noriginating from corporate networks). That could be anything from a curious individual,\nto a threat researcher or even an insider threat.\n\n\n-----\n\nYou can use the email addresses of the CardingMafia members to identify and profile\nhigh-risk individuals/customers you might have. For example, if you are a payments\nplatform and you have CardingMafia members with accounts on your platform it might\nworth some proactive fraud investigation.\n\nWritten by xorl\n\nApril 23, 2021 at 18:17\n\n[Posted in threat intelligence](https://xorl.wordpress.com/category/threat-intelligence/)\n\n## Leave a Reply\n\nFill in your details below or click an icon to log in:\n\nYou are commenting using your WordPress.com account. ( Log Out / Change )\n\nYou are commenting using your Twitter account. ( Log Out / Change )\n\nFYou are commenting using your Facebook account. ( Log Out / Change )\n\nCancel\nConnecting to %s\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-23 - Analysis of the CardingMafia March 2021 data breach.pdf"
    ],
    "report_names": [
        "2021-04-23 - Analysis of the CardingMafia March 2021 data breach.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535696,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653759505,
    "ts_modification_date": 1653759505,
    "files": {
        "pdf": "https://archive.orkl.eu/578616f9ec6aedfb4cb69345c5da612ad517a00f.pdf",
        "text": "https://archive.orkl.eu/578616f9ec6aedfb4cb69345c5da612ad517a00f.txt",
        "img": "https://archive.orkl.eu/578616f9ec6aedfb4cb69345c5da612ad517a00f.jpg"
    }
}