{
    "id": "8b107a1d-6482-4732-89bf-cda9a73bcbac",
    "created_at": "2023-01-12T15:05:45.357725Z",
    "updated_at": "2025-03-27T02:08:16.789296Z",
    "deleted_at": null,
    "sha1_hash": "66f53d7c27b63a525294d80a05158564cfc21e09",
    "title": "2018-06-18 - Joshua Adam Schulte Charged with the Unauthorized Disclosure of Classified Information and Other Offenses Relating to the Theft of Classified Material from the Central Intelligence Agency",
    "authors": "",
    "file_creation_date": "2022-05-28T03:38:46Z",
    "file_modification_date": "2022-05-28T03:38:46Z",
    "file_size": 75975,
    "plain_text": "# Joshua Adam Schulte Charged with the Unauthorized Disclosure of Classified Information and Other Offenses Relating to the Theft of Classified Material from the Central Intelligence Agency\n\n**[justice.gov/opa/pr/joshua-adam-schulte-charged-unauthorized-disclosure-classified-information-and-other-offenses](https://www.justice.gov/opa/pr/joshua-adam-schulte-charged-unauthorized-disclosure-classified-information-and-other-offenses)**\n\nJune 18, 2018\n\nDepartment of Justice\n\nOffice of Public Affairs\n\nFOR IMMEDIATE RELEASE\n\nMonday, June 18, 2018\n\nJohn C. Demers, Assistant Attorney General for National Security, Geoffrey S. Berman,\nUnited States Attorney for the Southern District of New York, and William F. Sweeney Jr.,\nAssistant Director-in-Charge of the New York Field Office of the Federal Bureau of\nInvestigation (“FBI”), announced today that Joshua Adam Schulte was charged in a 13-count\nSuperseding Indictment (the “Indictment”) in connection with his alleged theft of classified\nnational defense information from the Central Intelligence Agency (“CIA”) and the\ntransmission of that material to an organization that purports to publicly disseminate\nclassified, sensitive, and confidential information (“Organization-1”). The Indictment also\ncharges Schulte with the receipt, possession, and transportation of child pornography, as\nwell as criminal copyright infringement. Schulte, who is presently detained on the child\npornography charges, will be arraigned by U.S. District Judge Paul A. Crotty.\n\n“Leaks of classified information pose a danger to the security of all Americans,” said\nAssistant Attorney General Demers. “It adds insult to injury when, as alleged here, the leaks\ncome from former government officials in whom Americans placed their sacred trust The\n\n\n-----\n\nNational Security Division, alongside our partners in the Intelligence Community, will not\nwaver in our commitment to pursue and hold accountable these officials, and I commend all\nthose at the Department of Justice and the FBI who have worked diligently to investigate this\nmatter and bring these charges.”\n\n\"Joshua Schulte, a former employee of the CIA, allegedly used his access at the agency to\ntransmit classified material to an outside organization,” said Manhattan U.S. Attorney\nGeoffrey S. Berman. “During the course of this investigation, federal agents also discovered\nalleged child pornography in Schulte’s New York City residence. We and our law\nenforcement partners are committed to protecting national security information and ensuring\nthat those trusted to handle it honor their important responsibilities. Unlawful disclosure of\nclassified intelligence can pose a grave threat to our national security, potentially\nendangering the safety of Americans.”\n\n“As alleged, Schulte utterly betrayed this nation and downright violated his victims. As an\nemployee of the CIA, Schulte took an oath to protect this country, but he blatantly\nendangered it by the transmission of Classified Information.” said Assistant Director-inCharge William F. Sweeney, Jr. “To further endanger those around him, Schulte allegedly\nreceived, possessed, and transmitted thousands of child pornographic photos and videos. In\nan effort to protect this nation against crimes such as these, the FBI's Counterintelligence\nDivision in New York will continue to keep our mission at the forefront of our investigations in\nprotecting the American public.\"\n\nAccording to the Indictment, other court filings, and statements made during court\nproceedings:\n\nOn March 7, 2017, Organization-1 released on the Internet classified national defense\nmaterial belonging to the CIA (the “Classified Information”). In 2016, Schulte, who was then\nemployed by the CIA, stole the Classified Information from a computer network at the CIA\nand later transmitted it to Organization-1. Schulte also intentionally caused damage without\nauthorization to a CIA computer system by granting himself unauthorized access to the\nsystem, deleting records of his activities, and denying others access to the system. Schulte\nsubsequently made material false statements to FBI agents concerning his conduct at the\nCIA.\n\nSchulte was previously arrested on August 24, 2017, on charges relating to his receipt,\npossession, and transportation of approximately ten thousand images and videos of child\npornography. In March 2017, members of the FBI had searched Schulte’s residence in New\nYork, New York, pursuant to a search warrant and recovered, among other things, multiple\ncomputers, servers, and other portable electronic storage devices, including Schulte’s\npersonal desktop computer (the “Personal Computer”). On the Personal Computer, FBI\nagents found an encrypted container (the “Encrypted Container”), which held over 10,000\nimages and videos of child pornography. The Encrypted Container with the child\npornography files was identified by FBI computer scientists beneath three layers of password\n\n\n-----\n\nprotection on the Personal Computer. Each layer, including the Encrypted Container, was\nunlocked using passwords previously used by Schulte on one of his cellphones. Moreover,\nFBI agents identified Internet chat logs in which Schulte and others discussed their receipt\nand distribution of child pornography. FBI agents also identified a series of Google searches\nconducted by Schulte in which he searched the Internet for child pornography.\n\nSchulte, 29, of New York, New York, is charged with one count each of (i) illegal gathering of\nnational defense information, (ii) illegal transmission of lawfully possessed national defense\ninformation, (iii) illegal transmission of unlawfully possessed national defense information,\n(iv) unauthorized access to a computer to obtain classified information, (v) theft of\nGovernment property, (vi) unauthorized access of a computer to obtain information from a\nDepartment or Agency of the United States, (vii) causing transmission of a harmful computer\nprogram, information, code, or command, (viii) making material false statements to\nrepresentatives of the FBI, (ix) obstruction of justice, (x) receipt of child pornography, (xi)\npossession of child pornography, (xii) transportation of child pornography, and (xiii) copyright\ninfringement. A chart containing the charges and maximum penalties is below. The\nmaximum potential sentences in this case are prescribed by Congress and are provided here\nfor informational purposes only, as any sentencing of the defendant will be determined by the\njudge.\n\nMr. Berman praised the outstanding investigative efforts of the FBI.\n\nThe prosecution of this case is being handled by the Office’s Terrorism and International\nNarcotics Unit. Assistant U.S. Attorneys Sidhardha Kamaraju and Matthew Laroche are in\ncharge of the prosecution, with assistance from Trial Attorney Scott McCulloch of the\nNational Security Division’s Counterintelligence and Export Control Section.\nComponent(s):\n\n[National Security Division (NSD)](https://www.justice.gov/nsd)\nPress Release Number:\n\n18 - 806\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-06-18 - Joshua Adam Schulte Charged with the Unauthorized Disclosure of Classified Information and Other Offenses Relating to the Theft of Classified Material from the Central Intelligence Agency.pdf"
    ],
    "report_names": [
        "2018-06-18 - Joshua Adam Schulte Charged with the Unauthorized Disclosure of Classified Information and Other Offenses Relating to the Theft of Classified Material from the Central Intelligence Agency.pdf"
    ],
    "threat_actors": [
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535945,
    "ts_updated_at": 1743041296,
    "ts_creation_date": 1653709126,
    "ts_modification_date": 1653709126,
    "files": {
        "pdf": "https://archive.orkl.eu/66f53d7c27b63a525294d80a05158564cfc21e09.pdf",
        "text": "https://archive.orkl.eu/66f53d7c27b63a525294d80a05158564cfc21e09.txt",
        "img": "https://archive.orkl.eu/66f53d7c27b63a525294d80a05158564cfc21e09.jpg"
    }
}