{
    "id": "8b3372a7-a54c-4c94-aa44-8599b0d3e4cf",
    "created_at": "2023-01-12T15:10:52.900328Z",
    "updated_at": "2025-03-27T02:05:54.698061Z",
    "deleted_at": null,
    "sha1_hash": "12a74f2397a206e5828932b2f3b064ea652825ca",
    "title": "2020-05-28 - The Masked SYNger- Investigating a Traffic Phenomenon",
    "authors": "",
    "file_creation_date": "2022-05-27T21:29:44Z",
    "file_modification_date": "2022-05-27T21:29:44Z",
    "file_size": 1403712,
    "plain_text": "# The Masked SYNger: Investigating a Traffic Phenomenon\n\n**[blog.rapid7.com/2020/05/28/the-masked-synger-investigating-a-traffic-phenomenon/](https://blog.rapid7.com/2020/05/28/the-masked-synger-investigating-a-traffic-phenomenon/)**\n\nmatthew berninger May 28, 2020\n\n_Last updated at Wed, 16 Dec 2020 17:23:45 GMT_\n\nAt the beginning of 2020, Rapid7 and other researchers began noticing increased scanning\nactivity against a variety of TCP ports. Through our daily monitoring of connections to our\n[Heisenberg honeynet, as well as discussions with other community members such as](https://www.rapid7.com/research/project-heisenberg/)\nAndrew Morris of GreyNoise, we felt confident that we were seeing something new—\ncertainly not part of our “normal” traffic to the honeypots. The first public mention of this\n[activity was actually on Jan. 3, when @Andrew__Morris tweeted:](https://twitter.com/Andrew___Morris/status/1213190796364713984)\n\n\n-----\n\nOver the following weeks, we noticed strange behavior on some ports like TCP 123, but had\n[not noticed a continued phenomenon until March. On March 5, Greynoise again confirmed](https://twitter.com/Andrew___Morris/status/1235665240681050126)\nthat they were also seeing the same sustained behavior we had seen in January and\nFebruary.\n\nOnce March hit, we were seeing consistently high numbers of unique IP addresses\nconnecting to our honeypots. Primarily, we observed incredibly high volumes of SYN\nscanning activity against these TCP ports:\n\n21 (FTP)\n22 (SSH)\n23 (Telnet)\n25 (SMTP)\n[53 (DNS, more commonly seen on UDP RFC5966)](https://tools.ietf.org/html/rfc5966)\n80 (HTTP)\n110 (POP3)\n[123 (NTP, more commonly seen on UDP RFC5905)](https://tools.ietf.org/html/rfc5905)\n443 (HTTPS)\n\nThe graph below shows the pattern of activity, namely the sharp spikes and sustained\nincrease in the number of distinct IP addresses seen scanning these ports every day.\n\n\n-----\n\nWe have also seen the same activity against these ports, which later dropped off in April.\n\n110 (POP3)\n123 (NTP)\n3389 (RDP)\n5060 (SIP)\n7547 (TR-069)\n8080 (HTTP-alt)\n\nWe suspect that other ports have been included on certain days, but they have not been as\nconsistently uniform in their source IP volume. Some of these are ports you might expect,\nsuch as 3389 or 1433, but also included less common ports such as 5060, 111, and 17.\n\n\n-----\n\nIt is important to note the sheer numbers here. While honeypot traffic analysis is no stranger\nto large numbers, the daily scale of unique IPs for this specific traffic is in the hundreds of\nthousands. The IPs seen are mostly different every one or two days, so it is not even the\nsame million or so source IPs involved the whole time. All told, we estimate that the activity\nwe have seen between January and May 2020 involves more than 100 million unique IP\naddresses (insert Dr. Evil meme). For comparison, the [largest botnets in history are](https://blog.eccouncil.org/9-of-the-biggest-botnet-attacks-of-the-21st-century/)\nestimated to be in the range of 1 million to 10 million hosts.\n\n[This is one of the reasons we believe this activity to be spoofed—not in fact actually coming](https://en.wikipedia.org/wiki/IP_address_spoofing)\nfrom these supposed sources. If this activity truly represented nodes under control by a\nsingle entity, the sheer number of IP addresses involved would be the largest botnet ever\ncreated by several orders of magnitude.\n\nAlso of note is that while the total number of connections is similarly staggering and generally\nfollows the same pattern, it does not follow the source IP pattern exactly. Nor is it uniform\nbetween ports the same way distinct IPs were. This likely means two things:\n\n1. Some spoofed IPs “send” more traffic than others (much more on this later). If each\n\nspoofed IP sent the same number of packets, connections would simply be a multiple\nof the number of distinct IPs.\n2. Packet numbers are not evenly distributed among ports, even among spoofed IPs.\n\nOtherwise, the lines below would be more parallel to one another.\n\nSo, in summary, we have a historic number of spoofed “sender” IP addresses sending a\nhistoric amount of traffic on common ports. Also of note is that these are all TCP ports,\nincluding ports 53 and 123 where UDP would be a more common protocol. The next step\nwas to look at the traffic and see if these connections had anything in common.\n\n\n-----\n\n## What makes this traffic unique?\n\nFurthering our theory of spoofing, in every case we have examined, across multiple ports,\nthese scans never establish a full TCP handshake, typically sending only SYN packets. An\nexample is below, filtered on just the spoofed “source” IP, which we have redacted.\n\nIn our dataset, we generally find these connections have the following characteristics:\n\nFrame Length is always 54.\nTTL values are variable and sometimes do not make much sense. They’re either very\nlow, or very high, and do not seem to fit typical TTL values for normal operating\nsystems. Packets with the exact same source and same destinations, sent milliseconds\napart, will very often have varying TTL values.\nNotably, the “TCP Options” field is empty. This is uncharacteristic of normal TCP traffic,\nand is a strong indicator of synthetic traffic.\nWindow size is generally 5840 or 29200.\n\nThere are other strange idiosyncrasies with the traffic. For example, SYN packets will often\nreuse source port numbers, sometimes using non-ethereal source ports like 21 or 22. There\nare some rare instances where the packets contain SYN and PSH flags, or the RST flag.\nHowever, a handshake is never completed. It is, of course, possible that some of these\nidiosyncrasies are from unrelated activity, but it is difficult to tell, given the scale of the\nactivity, exactly which IPs are involved and which are not. After all, this very confusion may in\nfact be the purpose of the activity.\n\n## Where is this pretending to come from?\n\nGrouping by Country Code (while also realizing the sources were certainly spoofed), we get\nthese results for the top 10 “source” countries:\n\n\n-----\n\nThese results are not very surprising, since many of these nations contain large hosting\ninfrastructure and would be expected in most lists of top internet traffic. Perhaps the actors\nhere are simply sampling spoofed IPs from the public internet. If they were, then the\ndistribution of source IPs in this traffic would roughly mirror global IP allocation. However, the\ndistribution of the top 100 source country codes seen in spoofed traffic does not match global\nIP allocation.\n\nWhereas the Global IPv4 allocation is highly concentrated on the left—the U.S. is allocated\nroughly 34% (bar was cut off for scale)—the spoofing activity is disproportionately high\namong “smaller” players. This indicates that the purported “sources” of the spoofed traffic\nlikely do not follow a random selection from IPv4 address allocation—rather, there is\nsomething more manual behind which source IPs are used\n\n\n-----\n\n## Sender IP analysis\n\nAs mentioned earlier, the number of packets sent varies wildly by source IP. Many source IPs\nsend one and only one packet, while others send hundreds of thousands. Below, we will\nexamine the breakdown of source IPs and various ways we are identifying anomalies.\n\nWe pulled every IP address that had appeared hitting our honeypots on these ports, then\nbuilt features for each IP in the activity. These features included:\n\n**First Seen: First seen from January 2020 until now**\n**Last Seen: Within the same period**\n**Duration: Delta in days between First and Last Seen**\n**Number of Days: The number of distinct days during that time, when the IP appeared**\nas a source of spoofed SYN scans to our honeynet.\n**Connections: Total number of connections from the IP to our honeynet over 2020 so**\nfar.\n\nThe first thing we wanted to look for was an idea of turnover.\n\nThe above graph shows the timing of when IPs first appear in the traffic. As you can see,\nmuch of the traffic on any given day is performed by IPs participating for the first time.\n\nAdditionally, we can look at the total number of days that an IP is used in this activity.\n\n\n-----\n\nNote that the y axis is on a log scale, so the vast majority of spoofed source IPs appear only\none or two days total. Let’s also look at the Duration—the total days elapsed between First\nSeen and Last Seen:\n\nAs you can see, not surprisingly, the vast majority of IPs are only seen for one day, with a net\nduration of zero.\n\nHowever, it is interesting that there are still a fair number of IPs in the long tails here—those\nthat appear on multiple days, or whose appearances are many days apart, or both.\n\nYou may have also noticed an interesting anomaly in the decreasing durations:\n\n\n-----\n\nWhere we would expect the “day interval” to simply count up from 0 (only appeared one day)\nto 1,2,3, etc., we see this cluster of IPs for which the Duration is between 72–74 days.\nFurther down, we see a grouping of 52 and 53 day intervals. When do these IPs first appear\nand last appear?\n\nOnce we filtered on that data, we got consistent appearance of a couple very specific dates:\n\nThis indicates a very specific interval of appearance for the IPs seen on Jan. 3 and Jan. 4.\nEven though there is another spike of activity at the end of January, we do not see those IPs\nthen. In fact we don’t see them again until until March 15.\n\n\n-----\n\nRepeating this analysis a couple of times gives us a few intervals of reappearance:\n\nJan. 3, 4 → March 15,16,17\n\nJan 3,4 → April 14, 15\n\nJan. 31, Feb. 1 → March 24 and 25\n\nMarch 15,16,17 → April 30 to May 2nd\n\nThis further indicates manual operation of some extent—this activity is neither purely random\nnor evenly distributed. While we cannot prove intent or motivation for these intervals, they\nare not the same length, nor do they involve the same number of addresses each time.\nThere is some reuse for each large spike, with decreasing overlaps over time. This likely\nindicates some degree of human tinkering on the back end.\n\n## The signal and the noise\n\nFinally, while most of the activity involves IP addresses used for one or two days, there are a\nsmall minority of IPs issuing huge numbers of requests, and appear on many days—but,\nimportantly, not all days. It is possible that these IPs serve a specific purpose or that the\ntraffic they send is in some ways different in nature than the rest of the traffic.\n\n\n-----\n\nFor this analysis, we focused only on traffic sent to TCP port 25 (typically used for SMTP),\nwhich resulted in the ‘S1’ conn_state, and took place between (and including) the months of\nJanuary and May 2020. Focusing on a single port removed noise and reduced the dataset to\nsomething that could more easily be examined and iterated on. The same analysis should be\ndone for other common ports seen in this traffic.\n\nFor every IP address in the data, we built a profile, including first seen, last seen, number of\ndays total, the ‘duration’ between the first and last date, and other stats like ‘day density’ (the\nfraction of the duration taken by days seen). For example, an IP seen on only two days, but\nthose days are a month apart, would have a much lower ‘density’ than an IP seen on two\nconsecutive days.\n\nHere is the breakdown by duration and number of days:\n\nAs you can see, the vast majority of IPs exist near the bottom, each a small number (1–2) of\ndays total. However, some of the IPs with 2–5 days have long durations—that is, the few\ndays they appear are very spread out. Lastly, there are very few IPs with a large number of\ndays total, over a long period of time. Let’s factor in total number of connections as well\n[(apologies for my 3D graphing skills, I’m no @hrbrmstr):](https://blog.rapid7.com/author/bob-rudis/)\n\nHere, we can definitely spot one outlying spoofed source IP, the red dot near the top.\n\n\n-----\n\nUsing this approach, we are building shorter lists of interesting IP addresses to perform\ndeeper analysis to find differences in the content. While we have been able to spot these\nanomalies, thus far, traffic from these “top talkers” has not substantially differed from the\nother packet profiles noted above. It is of course possible that the anomalies we see are\nstrange artifacts of routing, misconfiguration, or some other factor unrelated to intent.\n\n## So what? Speculation and wildly unfounded theories\n\nFrustratingly, we cannot point to an existing threat that we can say with any likelihood is\nresponsible for this activity. Additionally, given our available evidence, this does not appear to\ncurrently pose a threat to organizations. Most organizations with basic network security will\nsimply block this type of traffic. Furthermore, the traffic is not concentrated enough on any\nsingle destination to be considered a large-scale DoS attack. So, why is it happening? Here,\nwe can only offer speculative theories. Caution: these theories can provide new investigative\ndirections, but in the end, only consistent evidence matters.\n\n### Cover for collection\n\nGiven the likely spoofed nature of the traffic, the originating party would only receive\nresponse data if they were in a position to collect the responses. Therefore, an actor would\nneed to have some other listening capability to collect this spoofed traffic for scanning\ninformation. It is possible that some of the traffic is not spoofed and could hide in the noise,\nsuch that the actor would receive the responses from traffic sent by their actual\ninfrastructure. So, either the actor has the ability to intercept responses, or this traffic could\nbe providing a cover for actual scanning activity. However, this theory has holes. While May\n2020 does seem an auspicious time to gain information about rapidly changing internet\nexposure, many other data sources already exist that could provide this information.\nFurthermore, why draw attention to SYN scanning by doing so much of it?\n\n\n-----\n\n### Poisoning threat intel\n\nIt is possible that this could be an effort to “poison” automated threat intel feeds by suddenly\ninundating them with millions of IP addresses purportedly performing scanning. In\ninvestigating some of these spoofed sources, we have seen them appear on recently\nupdated blacklists and threat intel feeds. This is possible, but the scale of the activity is large\nenough to be unnecessary for this goal.\n\n### Testing\n\nMuch of what we have outlined above looks like potential testing. An initial spike occurs in\nJanuary, followed by a lull in activity and then another “test” at the end of January. Later,\nsustained traffic occurs, with small tweaks appearing here and there. An actor with interest in\ndeploying TCP spoofing for more destructive purposes could simply be testing their\ncapability. The broad spread of distinct spoofed IPs does not create denial-of-service (DoS)\nconditions now, but that could change. It is possible that this is someone testing or\ndemonstrating capability.\n\n## Recent activity and next steps\n\nOn April 30, May 1, and May 2 2020, we saw the highest levels of connections from this\nactivity, followed by a sharp drop-off. Activity spiked again around May 8, but it has\ndisappeared since then. Now that we have some rough signatures for what the traffic looks\nlike, we are able to detect these spikes as they occur. Additionally, while it is impossible to\nconfirm, we have seen some traffic which looks similar to this dating as far back as 2017,\nthough not nearly at the levels seen this year.\n\n\n-----\n\nFinally, a caveat: Our visibility through Heisenberg is by definition limited to our honeypots.\nWhile other organizations have corroborated these trends, we do not have a large amount of\ndetails on traffic being sent elsewhere.\n\nThe above theories are illustrative of what might be the intention here, but we do not\ncurrently have solid evidence to support a most probable theory, or eliminate others.\nAdditionally, at the time of writing, we have no evidence to confirm that this presents an\nexigent threat. The simple fact is we do not know why this is happening, only that we are\nseeing it, it is new and strange, and other organizations have corroborated these trends.\nGiven the unprecedented scope and volume, we felt it was worth publishing our research to\nbegin a discussion among researchers, and hopefully understand this better.\n\n_Many thanks to Andrew Morris of GreyNoise and others in the community for providing_\n_information and feedback on this research._\n\n## Never miss a blog\n\nGet the latest stories, expertise, and news about security today.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-28 - The Masked SYNger- Investigating a Traffic Phenomenon.pdf"
    ],
    "report_names": [
        "2020-05-28 - The Masked SYNger- Investigating a Traffic Phenomenon.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536252,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653686984,
    "ts_modification_date": 1653686984,
    "files": {
        "pdf": "https://archive.orkl.eu/12a74f2397a206e5828932b2f3b064ea652825ca.pdf",
        "text": "https://archive.orkl.eu/12a74f2397a206e5828932b2f3b064ea652825ca.txt",
        "img": "https://archive.orkl.eu/12a74f2397a206e5828932b2f3b064ea652825ca.jpg"
    }
}