{
    "id": "8b6e745c-3ce1-46d8-a0c0-786f48d74ecc",
    "created_at": "2023-01-12T15:04:32.386133Z",
    "updated_at": "2025-03-27T02:05:29.985784Z",
    "deleted_at": null,
    "sha1_hash": "82d3ea289d34de2e010f860b80608c978ae0fe18",
    "title": "2022-10-13 - Ransomware Roundup- Royal Ransomware",
    "authors": "",
    "file_creation_date": "2022-11-28T18:55:27Z",
    "file_modification_date": "2022-11-28T18:55:27Z",
    "file_size": 306278,
    "plain_text": "# Ransomware Roundup: Royal Ransomware\n\n**[fortinet.com/blog/threat-research/ransomware-roundup-royal-ransomware](https://www.fortinet.com/blog/threat-research/ransomware-roundup-royal-ransomware)**\n\nOctober 13, 2022\n\nOn a bi-weekly basis, FortiGuard Labs gathers data on ransomware variants of interest that\nhave been gaining traction within our datasets and the OSINT community. The Ransomware\nRoundup report aims to provide readers with brief insights into the evolving ransomware\nlandscape and the Fortinet solutions that protect against those variants.\n\nThis latest edition of the Ransomware Roundup covers Royal ransomware.\n\n**Affected platforms: Microsoft Windows**\n\n**Impacted parties: Microsoft Windows Users**\n\n**Impact: Encrypts files on the compromised machine and demands ransom for file decryption**\n\n**Severity level: High**\n\n## Royal Ransomware\n\n\n-----\n\nRoyal is a reasonably new operation, having been around since at least the start of 2022.\nThe object of the group and its malware is typical: gain access to a victim’s environment,\nencrypt their data, and extort a ransom to return access to any files touched.\n\nThere does not appear to be a single stated infection vector. Instead, infection appears to\ndepend on the individual victim.\n\nThe group hints in its ransom note that it means to employ the “double extortion” tactic of\nthreatening to release data captured from the victim in addition to putting a victim’s data out\nof reach via encryption unless a ransom is paid. This however has yet to be definitively\nproven.\n\nIn what appears to be a bit of tongue-in-cheek, the group suggests that its actions are a\n“pentesting service” and that it will provide the victim with a “security review.”\n\nFigure 1: Royal ransom note.\n\nThe ransomware itself is a 64-bit Windows executable written in C++.\n\nIt is launched via command line, suggesting that it is designed to be run via an operator after\naccess to an environment is provided through another method.\n\nThere are two arguments that need to be passed to kick the encryption process off. “-path”\ndetermines what is to be encrypted, whether a single directory or an entire drive. “-id”\nappears to be how the group identifies its victims. This can be any 32-character string, as\nshown in Figure 2.\n\nFigure 2: Executing Royal.\n\nRegardless of whether either of these arguments are provided, the malware goes ahead and\ndeletes the volume shadow copy off the system.\n\nFigure 3: Royal deleting the volume shadow copy.\n\nInterestingly, it appears that there is a third argument flag in the code that was either\nabandoned or provides functionality to a feature not yet implemented, “-ep”.\n\nFigure 4: All Royal command line arguments, including the unused “-ep” argument.\n\nRoyal appears to use the OpenSSL library to encrypt files to the AES standard. Encrypted\nfiles are renamed and given a “.royal” file extension.\n\nFigure 5: Files encrypted by Royal.\n\n\n-----\n\nInterestingly, it appears that a file may not be entirely encrypted in all circumstances. For\nexample, a PDF used in a FortiGuard Labs test system showed some recognizable items\nafter encryption.\n\nFigure 6: Partially encrypted PDF file.\n\nAs shown in the ransom note in Figure 1, victims will be provided an ID and a unique Tor\npage to visit to contact the group about payment.\n\nFigure 7: Royal Tor landing page.\n\nA Tor landing page exists. However, it simply suggests viewing the readme file generated by\nthe encryption process. It also offers a non-interactive contact form to message the group if\nsomeone decided to do so.\n\nFigure 8: Tor landing page contact form.\n\n## Fortinet Protection\n\nFortinet customers are already protected from these malware variants through FortiGuard’s,\nAntiVirus, FortiMail, FortiClient, and FortiEDR services, as follows:\n\nFortiGuard Labs detects the known Royal ransomware variants with the following AV\nsignature:\n\nW32/PossibleThreat\n\n## IOCs\n\n2598e8adb87976abe48f0eba4bbb9a7cb69439e0c133b21aee3845dfccf3fb8f\n9db958bc5b4a21340ceeeb8c36873aa6bd02a460e688de56ccbba945384b1926\n\n## FortiGuard Labs Guidance\n\nDue to the ease of disruption, damage to daily operations, potential impact to an\norganization's reputation, and the unwanted destruction or release of personally identifiable\ninformation (PII), etc., it is vital to keep all AV and IPS signatures up to date.\n\nSince the majority of ransomware is delivered via phishing, organizations should consider\nleveraging Fortinet solutions designed to train users to understand and detect phishing\nthreats:\n\nThe [FortiPhish Phishing Simulation Service uses real-world simulations to help organizations](https://www.fortinet.com/products/phishing-simulation)\ntest user awareness and vigilance to phishing threats and to train and reinforce proper\npractices when users encounter targeted phishing attacks.\n\n\n-----\n\nOur FREE [NSE training:](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute) [NSE 1 – Information Security Awareness includes a module on](https://training.fortinet.com/local/staticpage/view.php?page=nse_1&utm_source=blog&utm_campaign=nse-1)\ninternet threats designed to help end users learn how to identify and protect themselves from\nvarious types of phishing attacks and can be easily added to internal training programs.\n\nTo effectively deal with the evolving and rapidly expanding risk of ransomware, organizations\nwill need to make foundational changes to the frequency, location, and security of their data\nbackups. When coupled with digital supply chain compromise and a workforce\ntelecommuting into the network, there is a real risk that attacks can come from anywhere.\n[Cloud-based security solutions, such as SASE, to protect off-network devices; advanced](https://www.fortinet.com/resources/cyberglossary/sase?utm_source=blog&utm_campaign=sase)\nendpoint security, such as [EDR (endpoint detection and response) solutions that can disrupt](https://www.fortinet.com/products/endpoint-security/fortiedr.html?utm_source=blog&utm_campaign=fortiedr)\n[malware mid-attack; and Zero Trust Access and network segmentation strategies that restrict](https://www.fortinet.com/solutions/enterprise-midsize-business/network-access.html?utm_source=blog&utm_campaign=zero-trust-network-access)\naccess to applications and resources based on policy and context, should all be investigated\nto minimize risk and to reduce the impact of a successful ransomware attack.\n\n[As part of the industry's leading fully integrated Security Fabric, delivering native synergy and](https://www.fortinet.com/solutions/enterprise-midsize-business/security-fabric.html?utm_source=blog&utm_medium=blog&utm_campaign=security+fabric)\nautomation across your security ecosystem, Fortinet also provides an extensive portfolio of\ntechnology and human-based as-a-service offerings. These services are powered by our\nglobal FortiGuard team of seasoned cybersecurity experts.\n\n## Best Practices include Not Paying a Ransom\n\n[Organizations such as CISA, NCSC, the FBI, and HHS caution ransomware victims against](https://www.fbi.gov/scams-and-safety/common-scams-and-crimes/ransomware)\npaying a ransom partly because payment does not guarantee that files will be recovered.\nAccording to a U.S. Department of Treasury's Office of Foreign Assets Control (OFAC)\nadvisory, ransom payments may also embolden adversaries to target additional\norganizations, encourage other criminal actors to distribute ransomware, and/or fund illicit\nactivities that could potentially be illegal. For organizations and individuals affected by\n[ransomware, the FBI has a Ransomware Complaint page where victims can submit samples](https://www.ic3.gov/Home/Ransomware)\nof ransomware activity via their Internet Crimes Complaint Center (IC3).\n\n## How Fortinet Can Help\n\nFortiGuard Labs’ [Emergency Incident Response Service provides rapid and effective](https://www.fortinet.com/support/support-services/fortiguard-security-subscriptions/incident-response)\nresponse when an incident is detected. And our Incident Readiness Subscription\nService provides tools and guidance to help you better prepare for a cyber incident through\nreadiness assessments, IR playbook development, and IR playbook testing (tabletop\nexercises).\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_medium=blog&utm_campaign=fglabs)_\n_[and the FortiGuard AI-powered security services portfolio.](https://www.fortinet.com/solutions/enterprise-midsize-business/security-as-a-service/fortiguard-subscriptions?utm_source=blog&utm_medium=blog&utm_campaign=services)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-10-13 - Ransomware Roundup- Royal Ransomware.pdf"
    ],
    "report_names": [
        "2022-10-13 - Ransomware Roundup- Royal Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535872,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1669661727,
    "ts_modification_date": 1669661727,
    "files": {
        "pdf": "https://archive.orkl.eu/82d3ea289d34de2e010f860b80608c978ae0fe18.pdf",
        "text": "https://archive.orkl.eu/82d3ea289d34de2e010f860b80608c978ae0fe18.txt",
        "img": "https://archive.orkl.eu/82d3ea289d34de2e010f860b80608c978ae0fe18.jpg"
    }
}