{
    "id": "8b772a1d-0076-43c7-a7ee-b74fbaf31fd8",
    "created_at": "2023-01-12T15:05:54.0586Z",
    "updated_at": "2025-03-27T02:09:29.761181Z",
    "deleted_at": null,
    "sha1_hash": "587f887668cba3cbc32e2da585b1ad7d6425e535",
    "title": "2017-04-13 - Stuxnet drivers- detailed analysis",
    "authors": "",
    "file_creation_date": "2022-05-27T21:13:51Z",
    "file_modification_date": "2022-05-27T21:13:51Z",
    "file_size": 419812,
    "plain_text": "# Stuxnet drivers: detailed analysis\n\n**[artemonsecurity.blogspot.de/2017/04/stuxnet-drivers-detailed-analysis.html](http://artemonsecurity.blogspot.de/2017/04/stuxnet-drivers-detailed-analysis.html)**\n\nThere has passed already a lot of time since the publication of various detailed researches\n[about Stuxnet and its components. All top AV vendors wrote own comprehensive papers,](https://en.wikipedia.org/wiki/Stuxnet)\nwhich reveal major information about destructive Stuxnet features. Some information about\n[Stuxnet rootkits were published by Kaspersky here, Symantec](https://securelist.com/analysis/publications/36462/stuxnetduqu-the-evolution-of-drivers/) [here, ESET](https://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/w32_stuxnet_dossier.pdf) [here. However,](https://www.esetnod32.ru/company/viruslab/analytics/doc/Stuxnet_Under_the_Microscope.pdf)\nthe published information is not complete, because each of these documents covers only a\nspecific sample of the rootkit and describes some of its functions. For example, Kaspersky\nanalysis tries to summarize information about known Stuxnet drivers, but it doesn't contain\nany technical info about it. Another mentioned report from ESET contains information about\ntwo Stuxnet drivers, but this is not sufficient for complete summarizing.\n\nFirst of all, it is need to be clear that from point of view of undocumented Windows kernel\nexploration, there are no something really interesting in Stuxnet drivers. I mean nothing\n[interesting comparing with such advanced & sophisticated \"civilian\" rootkits like ZeroAccess](http://www.kernelmode.info/forum/viewtopic.php?f=16&t=23)\nor [TDL4. These instances can be deeply embedded into a system, bypassing anti-rootkits](http://www.kernelmode.info/forum/viewtopic.php?f=16&t=19)\nand deceive low-level disk access tools. In contrast to them, authors of Stuxnet rootkits do\nnot use such deep persistence into a compromised system. This analysis tries to summarize\ntechnical information about Stuxnet drivers.\n\nAs a starting point of our research, we can take already published information about Stuxnet\n[drivers by Kaspersky. Their analysis Stuxnet/Duqu: The Evolution of Drivers summarizes](https://securelist.com/analysis/publications/36462/stuxnetduqu-the-evolution-of-drivers/)\nsome information about drivers that have been used by Stuxnet authors in cyber attacks.\n\n**Driver 1**\n\nFile name: MRxCls.sys\n\nSHA256: 817a7f28a0787509c2973ce9ae85a95beb979e30b7b08e64c66d88372aa3da86\n\nFile size: 19840 bytes\n\nSigned: No\n\n\n-----\n\nTimestamp: 2009-01-01 18:53:25\nDevice object name: \\Device\\MRxClsDvX\nMain purpose: code injection\nAV detection ratio: 53/61\n\nFirst driver contains sensitive text information such as rootkit device name and path to its\nservice into registry as encrypted data. After starting, the driver performs decryption of this\ndata and we can extract it. Note that name of rootkit service is almost matches its device\nobject name. First dword of decrypted data is also interesting, because it stores some flags,\nwhich have an impact on driver behaviour. For example, first bit of this dword restricts the\nwork of rootkit code into Windows safe mode, while second is used as anti-debug trick. If\nsecond bit and ntoskrnl!KdDebuggerEnabled are active, the driver will not load.\n\nDecrypted rootkit data also stores name of registry value (Data) that is used by the rootkit to\ndetermining what files should be injected into processes. So, these decrypted data are\nstored in the next sequence.\n\n\\REGISTRY\\MACHINE\\SYSTEM\\CurrentControlSet\\Services\\MRxCls\nData\n\\Device\\MRxClsDvX\n\nAs driver is registered by Stuxnet with \"boot\" loading type, it can't perform whole initialization\nin DriverEntry, because neither NT kernel nor file system is ready to perform requests from\nclients. So, it calls API IoRegisterDriverReinitialization and delays own initialization.\nAfter ReInitialize rootkit function gets control, it checks Windows NT version and fills some\ndynamic imports. It also doing some preparatory operations and\ncalls PsSetLoadImageNotifyRoutine for registering own handler on load image. This handler\nwill response for code injection into processes. Below you can see scheme of rootkit\ninitialization\n\n\n-----\n\nThe driver registers following IRP handlers.\n\nIRP_MJ_CREATE\nIRP_MJ_CLOSE\nIRP_MJ_DEVICE_CONTROL (fnDispatchIrpMjDeviceControl)\n\nIf you are not familiar with Windows NT drivers development, it is worth to note that any\ndriver that allows to open handles on its device, registers, at least, two IRP handlers:\nIRP_MJ_CREATE for supporting operations ZwCreateFile and IRP_MJ_CLOSE\nfor ZwClose. Our driver supports ZwDeviceIoControl interface, that's why it registers\nIRP_MJ_DEVICE_CONTROL handler.\n\nHandler fnDispatchIrpMjDeviceControl serves only for one purpose: to call undocumented\nWindows NT function ZwProtectVirtualMemory. Client should send to driver special IOCTL\ncode 0x223800 for that (DeviceIoControl) and provide a special prearranged structure with\nparameters for API call. The driver uses buffered I/O.\n\n\n-----\n\nAs we know, function ZwProtectVirtualMemory is not exported by the Windows kernel and\nthis is another task which authors of MRXCLS.sys have been solved. For example, in case\nof Windows 2000, they try to find function signature with analysis of executable sections of\nntoskrnl image. This signature you can see below.\n\nAuthors are trying to enumerate all useful ntoskrnl sections and for each of it call special\nfunction that performs searching ZwAllocateVirtualMemory by signatures on Windows 2000\nor little harder on Windows XP.\n\nMain purpose of this Stuxnet rootkit is code injection. As we can see from its code, the driver\ntries to read configuration data of injection either from registry parameter Data, either from\n\n\n-----\n\nfile, if its name is present into malware sample. In analyzed sample, name of configuration\nfile is absent. Injection configuration data is prepared by user mode part of malware. Injection\nmechanism was perfectly described by ESET in their paper. The driver performs injection\ninto process in two phases: first phase is preparatory and second is major.\n\nOn second phase it tries to read content of file, decrypts it and injects it into process address\nspace. File names for injection are stored into configuration file or registry parameter Data.\n\nAs we can see from the code analysis, authors have developed rootkit for injection malicious\ncode into processes. Data for injection is prepared by Stuxnet user mode code. The driver\nregisters handler for image load notify and performs injection into two phases. It also\nsupports one IOCTL command for changing protection for virtual memory pages of process\nwith help of ZwProtectVirtualMemory. For finding this unexported and undocumented\nfunction into ntoskrnl, it uses raw bytes search based on special signatures.\n\n**Driver 2**\n\nFile name: Mrxnet.sys\n\nSHA256: 0d8c2bcb575378f6a88d17b5f6ce70e794a264cdc8556c8e812f0b5f9c709198\n\nFile size: 17400 bytes\n\nSigned: Yes\n\nTimestamp: 2010-01-25 14:39:24\n\nDevice object name: none\n\nMain purpose: malicious files hiding\n\n\n-----\n\nAV detection ratio: 51/61\n\nUnlike first driver MRXCLS.sys, authors of Mrxnet.sys don't perform anti-analysis checks in\nthe start function of driver. Mrxnet.sys is a FS filter driver that controls some file operations.\nThe rootkit tries to hide some file types by controlling IRP_MJ_DIRECTORY_CONTROL\nrequest and removes information about it from buffer.\n\nThe rootkit initialization steps.\n\nAs we can see from code, the driver plays with two types of devices: firstly its own CDO\n(Control Device Object) that represents FS filter and secondly devices that were created to\nfilter files related operations on specific volumes. In case of CDO, the rootkit dispatches\nwidely known request IRP_MJ_FILE_SYSTEM_CONTROL and\noperation IRP_MN_MOUNT_VOLUME. This operation is used by Windows kernel in case of\nmounting new volume into a system. After got this request, the rootkit creates new device\nobject, registers completion routine and attaches device to newly mounted device. This\nmethod allows for driver to monitor appearance in a system new volumes, for example,\nvolume of removable drive.\n\n\n-----\n\nAs you can see from the picture above, the driver also calls IoRegisterFsRegistrationChange\nI/O manager API for registering its handler that Windows kernel will call each time, when new\nfile system driver CDO is registered into a system. In this handler, the driver creates new\ndevice and attaches it to passed CDO or removes device in case of file system driver\ndeletion.\n\nMajor purpose of Mrxnet.sys driver is hiding Stuxnet malicious files. Windows kernel\nprovides ZwQueryDirectoryFile API for requesting information about files in directory. This\nAPI function calls driver handler of IRP_MJ_DIRECTORY_CONTROL operation. So, the\nrootkit registers own IRP_MJ_DIRECTORY_CONTROL handler and sets completion routine\nwhen such request is passed through handler. In this completion routine it analyzes buffer\nwith data and checks file names in it. It erases from buffer files with extension .LNK and\n.TMP. It also imposes additional restrictions on hiding. For example, in case of .LNK file, its\nsize should be equal 0x104B.\n\n\n-----\n\nIt should be noted that such technique of files hiding were described in famous book\n\"Rootkits: Subverting the Windows kernel\" by Hoglund, Butler.\n\n**Driver 3**\n\nFile name: Jmidebs.sys\n\nSHA256: 63e6b8136058d7a06dfff4034b4ab17a261cdf398e63868a601f77ddd1b32802\n\nFile size: 25552 bytes\n\nSigned: Yes\n\nTimestamp: 2010-07-14 09:05:36\n\nDevice object name: \\Device\\{3093983-109232-29291}\n\nMain purpose: code injection\n\nAV detection ratio: 50/61\n\nThis driver is pretty similar to MRxCls.sys and serves only for code injection into\nprocesses. The following properties distinguish it from original MRxCls.sys.\n\nNew device object name - \\Device\\{3093983-109232-29291}\nNew registry service name - jmidebs\nNew registry service parameter name (injection data) - IDE\nNew IOCTL code for reading (caching) configuration data\nNew constants in decryption routine.\n\n\n-----\n\nDecrypted strings.\n\n\\REGISTRY\\MACHINE\\SYSTEM\\CurrentControlSet\\Services\\jmidebs\nIDE\n\\Device\\{3093983-109232-29291}\n\nThe rootkit contains additional IOCTL function, which specializes in caching configuration\ndata. This data are used for injection malicious Stuxnet code.\n\n\n-----\n\n**Driver 4**\n\nFile name: MRxCls.sys\n\nSHA256: 1635ec04f069ccc8331d01fdf31132a4bc8f6fd3830ac94739df95ee093c555c\n\nFile size: 26616 bytes\n\nSigned: Yes\n\nTimestamp: 2009-01-01 18:53:25\n\nDevice object name: \\Device\\MRxClsDvX\n\nMain purpose: code injection\n\nAV detection ratio: 50/61\n\nThis sample is identical to driver 1, but signed with digital certificate. Both samples have\nidentical timestamp value in PE header and identical code inside.\n\n**Conclusion**\n\nAs we can see from the analysis, authors of Stuxnet Ring 0 part were interested in code\ninjection and malicious files hiding. Driver MRxCls.sys has two instances, one unsigned and\nanother with digital signature. Both drivers are identical and contain same compilation date.\nDriver Jmidebs.sys was compiled later than these two and I can call it \"MRxCls.sys v2\",\nbecause it contains some differences inside, but serves for same purpose. Driver Mrxnet.sys\nis a typical legacy FS filter driver that is used by attackers for hiding files in Windows.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-13 - Stuxnet drivers- detailed analysis.pdf"
    ],
    "report_names": [
        "2017-04-13 - Stuxnet drivers- detailed analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535954,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653686031,
    "ts_modification_date": 1653686031,
    "files": {
        "pdf": "https://archive.orkl.eu/587f887668cba3cbc32e2da585b1ad7d6425e535.pdf",
        "text": "https://archive.orkl.eu/587f887668cba3cbc32e2da585b1ad7d6425e535.txt",
        "img": "https://archive.orkl.eu/587f887668cba3cbc32e2da585b1ad7d6425e535.jpg"
    }
}