{
    "id": "8ba24700-5c32-4ce9-824f-516e173fd740",
    "created_at": "2023-01-12T15:01:11.860903Z",
    "updated_at": "2025-03-27T02:08:41.420413Z",
    "deleted_at": null,
    "sha1_hash": "d9bb42b491c2b2dcad2189cd7e645f6ce445a6e3",
    "title": "2018-07-18 - The Evolution of Emotet- From Banking Trojan to Threat Distributor",
    "authors": "",
    "file_creation_date": "2022-05-28T21:57:03Z",
    "file_modification_date": "2022-05-28T21:57:03Z",
    "file_size": 756129,
    "plain_text": "# The Evolution of Emotet: From Banking Trojan to Threat Distributor\n\n**[symantec.com/blogs/threat-intelligence/evolution-emotet-trojan-distributor](https://www.symantec.com/blogs/threat-intelligence/evolution-emotet-trojan-distributor)**\n\nThreat Hunter TeamSymantec\n\n## Evidence indicates that Mealybug, the threat group behind Emotet, has evolved from maintaining its own custom banking Trojan to operating as a distributor of threats for other groups.\n\nMealybug is a cyber crime actor that has been active since at least 2014. It is identified by its\n[use of its custom malware, Trojan.Emotet. It appears to have changed its business model in](https://www.symantec.com/security-center/writeup/2017-071312-0253-99)\nrecent times, evolving from targeting banking customers in Europe to using its infrastructure\nto act as a global packing and delivery service for other threat actors.\n\nBecause it can self-propagate, Emotet presents a particular challenge for organizations.\nNetwork worms have been experiencing a kind of renaissance, with notable examples like\n[WannaCry (Ransom.Wannacry) and Petya/NotPetya (Ransom.Petya). Network spreading](https://www.symantec.com/security-center/writeup/2017-051310-3522-99)\nalso means that victims can become infected without ever clicking on a malicious link or\n\n\n-----\n\ndownloading a malicious attachment. Once on a computer, Emotet downloads and executes\na spreader module that contains a password list that it uses to attempt to brute force access\nto other machines on the same network.\n\n\"Group behind #Emotet Trojan start global packing, delivery service for other threat actors\nhttps://symc.ly/2KHADCx\"\n[Click to Tweet](https://twitter.com/intent/tweet?text=Group%20behind%20%23Emotet%20Trojan%20start%20global%20packing,%20delivery%20service%20for%20other%20threat%20actors%20https://symc.ly/2KHADCx&via=threatintel&hashtags=undefined)\nEmotet’s method of self-propagation—brute forcing passwords—has additional potential to\ncause major headaches for organizations as it may result in multiple failed login attempts,\nwhich can lead to users becoming locked out of their network accounts. This has the knockon effect of increased calls to IT helpdesks and general loss of productivity. This was a\n[hallmark of the notorious Conficker (W32.Downadup) threat and, 10 years later, threats](https://www.symantec.com/security-center/writeup/2008-112203-2408-99)\ncontinue to cause similar problems.\n\nAs well as brute forcing passwords, Emotet can also spread to additional computers using a\nspam module that it installs on infected victim machines. This module generates emails that\nuse standard social engineering techniques and typically contain subject lines including\nwords such as “Invoice”. Some subject lines include the name of the person whose email\naccount has been compromised, to make it seem less like a spam email. The emails typically\ncontain a malicious link or attachment which if launched will result in them becoming infected\nwith Trojan.Emotet.\n\nMost recently, Mealybug appears to have expanded its operations to primarily become a\ndistributor of threats for other attack groups.\n\n## Emotet becomes a global threat\n\nWhen Mealybug was first identified in 2014 it was using Emotet to spread banking Trojans,\nand was focused on targeting banking customers in Germany. At the time, Mealybug was\n[using Trojan.Emotet as the loader portion of W32.Cridex.B, a rewritten version of the Cridex](https://www.symantec.com/security-center/writeup/2014-062313-0453-99)\nbanking Trojan. In 2015, Mealybug started targeting Swiss banking customers as well and\nevolved Emotet into more modular malware. The new version of Emotet had separate\nmodules for its loader, banking data theft, email login theft, distributed denial of service\n(DDoS) attacks, and malicious spam.\n\nMealybug has primarily been engaged in using Emotet for the delivery of banking Trojans,\n[and in 2017 it was the first group to deliver the IcedID (Trojan.IcedID) banking Trojan.](https://www.symantec.com/security-center/writeup/2018-041715-3639-99)\n[However, also in 2017, it was observed delivering the Trojan.Trickybot and](https://www.symantec.com/security-center/writeup/2016-101811-2408-99)\n[Ransom.UmbreCrypt ransomware. Mealybug has developed its capabilities over the years](https://www.symantec.com/security-center/writeup/2016-021519-3303-99)\nand now appears to offer an “end-to-end” service for delivery of threats. It delivers the\nthreats, obfuscates them to reduce the chances of detection, and provides a spreader\nmodule that allows the threats to self-propagate.\n\n\n-----\n\nEmotet gets an initial foothold on a victim machine or network by sending an email\ncontaining either a malicious link that leads to a downloader document or that has a\nmalicious document attached. Anti-analysis tactics have been present in Emotet since at\nleast 2015 and, in 2018, Emotet’s payload consists of a packed file containing the main\ncomponent and an anti-analysis module. The anti-analysis module performs multiple checks\nto ensure it is not being run on a malware research machine, then loads the main\ncomponent. Either PowerShell or JavaScript is used to download the Trojan, which delivers a\npacked payload file to the victim machine. Once on a machine, the latest version of Emotet:\n\n1. Moves itself to its preferred directory\n2. Creates a LNK file pointing to itself in the start-up folder\n3. Collects victim machine information and sends it to the C&C server\n\nIt can then download any new payloads from the C&C server, and execute them. Emotet can\ndownload an updated version of itself, or any other threat. Existing versions of Emotet\ndownload modules from the C&C server that include:\n\n**Banking module: This module intercepts network traffic from the browser to steal**\nbanking details entered by the user. This is what gave Trojan.Emotet its reputation as a\nbanking Trojan.\n**Email client infostealer module:This module steals email credentials from email**\nclient software.\n**Browser infostealer module: This module steals information such as browsing history**\nand saved passwords.\n**PST infostealer module: This module reads through Outlook’s message archives and**\nextracts the sender names and email addresses of the messages, presumably to use\nfor spamming.\n\nAccording to Symantec telemetry for the first half of 2018, its focus now is mainly on\ntargets in the U.S.\n\nAll information stolen by these modules is sent to the C&C server. Emotet also has a DDoS\nmodule that can add the infected machine to a botnet to carry out DDoS attacks.\n\n\n-----\n\nFigure 1. Trojan.Emotet primarily focusing on targets in the U.S.\nEmotet’s geographic targets have also increased significantly over the years. After a\nrelatively quiet period since 2015, detections of Emotet surged in the second half of 2017,\nand in that year Mealybug’s targets included victims in Canada, China, the UK, and Mexico.\nHowever, according to Symantec telemetry for the first half of 2018, its focus now is mainly\non targets in the U.S.\n\nFigure 2. Trojan.Emotet detections by\n\ngeographical region\n\n\n-----\n\n## Qakbot\n\n[Since February 2018, Emotet has been used to spread W32.Qakbot, a family of banking](https://www.symantec.com/security-center/writeup/2009-050707-0639-99)\nTrojans known for behaving like network worms.\n\nLike Emotet, Qakbot can self-propagate. Qakbot attempts brute force access to spread\n[across networks and also uses “living-off-the-land” tools to propagate. It uses PowerShell to](https://www.symantec.com/connect/blogs/attackers-are-increasingly-living-land)\n[download and run Mimikatz (Hacktool.Mimikatz), an open-source credential stealing tool that](https://www.symantec.com/security-center/writeup/2012-042615-3731-99)\nallows attackers to move rapidly across a network once they have established an initial\nfoothold.\n\nThe fact that both Emotet and Qakbot have self-spreading capabilities mean that once these\nthreats get onto your network they can spread aggressively. The fact that both attempt brute\nforce access to spread across networks also increases the risk of users being locked out of\ntheir devices. A spike in Qakbot detections in February 2018 indicates that “doublespreading” of the threat was taking place, meaning that Mealybug was using Emotet to\nspread Qakbot across networks, while Qakbot was simultaneously using its own selfspreading capabilities. The account lockout scenario is a very real danger, and a potential\nmajor headache for organizations.\n\nFigure 3. W32.Qakbot detections January 1 to May 28, 2018\nSymantec analysis shows that Emotet and Qakbot are packed with the same packer, but\nthere are multiple factors that suggest Mealybug is only providing Emotet as a delivery\nservice for the actors behind Qakbot, and is not controlling the Trojan.\n\nThere does not appear to be any overlap between the C&C infrastructure of the two Trojans,\nand analysis also revealed differences in the code of their main components and in their antidebugging techniques.\n\nMealybug using two different spreading mechanisms is also surprising because, as\nmentioned above, both Trojans attempting to brute force passwords could trigger account\nlockouts and stop the Trojans from spreading. It is unlikely Mealybug would use the two\n\n\n-----\n\ndifferent spreading techniques if it was controlling both Trojans. For these reasons we\nbelieve Emotet and Qakbot are controlled by two separate groups, and that Mealybug is\noffering Emotet as a delivery mechanism for other threats.\n\n## Talking ‘bout an evolution\n\nMealybug seems to have found its niche as a provider of delivery services for other threats.\nThe main component of Trojan.Emotet functions as a loader, and can theoretically support\nany payload. While it is still primarily known for distributing banking Trojans, it can in theory\nspread any threat, and there have been reports of it distributing the Ransom.UmbreCrypt\nransomware. Mealybug presumably makes its money by taking a cut of the profits made by\nthe threat actors who use its services. From what we can see, Mealybug appears to be\noperating for more than one attack group at a time, so we have no evidence that it offers\nitself as an “exclusive” distributor. In November 2017, Mealybug was observed delivering the\nTrojan.Trickybot and W32.Qakbot threats simultaneously onto the same machine in a few\ninstances, and in one case within a few minutes.\n\nMealybug’s shift from distributing its own banking Trojan to a relatively small number of\ntargets, to acting primarily as a global distributor of other groups’ threats is interesting, and\n[backs up an observation we made in the ISTR that threat actors are evolving and refining](http://go.symantec.com/istr)\ntheir techniques and business model to maximize profits. In the ISTR we outlined how some\nthreat actors appeared to be turning to coin mining as it became hugely profitable due to the\nrise in the value of cryptocurrencies. It appears Mealybug has decided that it can best\nmaximize its returns through taking a role as distributor.\n\nIt may be that Mealybug was finding it harder to make money exclusively from banking\nTrojans so it had to change its approach. The growth in popularity and use by banks of twofactor authentication (2FA) has made it more difficult to compromise accounts by stealing\ncredentials, and awareness and protection has improved as online banking has matured.\n\n## Challenges for organizations\n\nMealybug activity presents a number of challenges for organizations, including:\n\nIts worm-like capabilities mean it can spread rapidly across organizations.\nEmotet’s network-spreading capabilities mean that computers can become infected\nwithout any user interaction.\nBrute forcing passwords increases the chances of users being locked out of their\nmachines in victim organizations, causing headaches for IT teams and affecting\nproductivity.\n\n## Best practices\n\n\n-----\n\nEmphasize multiple, overlapping, and mutually supportive defensive systems to guard\nagainst single point failures in any specific technology or protection method. This\nincludes deployment of endpoint, email, and web gateway protection technologies as\nwell as firewalls and vulnerability assessment solutions. Always keep these security\nsolutions up-to-date with the latest protection capabilities.\n[Employ two-factor authentication (such as Symantec VIP) to provide an additional layer](https://vip.symantec.com/)\nof security and prevent any stolen or cracked credentials from being used by attackers.\nEducate employees and urge them to exercise caution around emails from unfamiliar\nsources and around opening attachments that haven’t been solicited.\nRequire everyone in your organization to have long, complex passwords that are\nchanged frequently. Encourage users to avoid reusing the same passwords on multiple\nwebsites, and sharing passwords with others should be forbidden.\n\n## Protection\n\nSymantec has had protection for Mealybug attacks since the initial identification of the\ngroup’s activities in 2014 and blocks such activities at every level of Mealybug’s attack chain.\n\n**Detections by stage**\n\n**Email:**\n\n[Symantec Email Security products block malicious emails associated with Emotet.](https://www.symantec.com/products/email-security-cloud)\n\n**Embedded link stage:**\n\n[Web Attack: Emotet Download 2](https://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=30546)\n\n**Macro downloader stage:**\n\nW97M.Downloader!g20\n\n**Main module file stage:**\n\n[W32.Emotet.B](https://www.symantec.com/security-center/writeup/2017-080307-1748-99)\n[Trojan.Emotet](https://www.symantec.com/security-center/writeup/2017-071312-0253-99)\nTrojan.Emotet!g1\nTrojan.Emotet!g2\nTrojan.Emotet!g3\nTrojan.Emotet!gen4\nTrojan.Emotet!g5\n\n**Main module loaded stage:**\n\nTrojan.Emotet!gm\n\n\n-----\n\n**C&C communication stage:**\n\n[System Infected: Trojan.Emotet Activity 3](https://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=30172)\nSystem Infected: Emotet Activity 2\n[System Infected: Trojan.Emotet Activity 4](https://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=30767)\n\n**Spam and stealer and spreader module stage:**\n\nRansom.Crypto!im\n\n**Emotet spreader infection stage:**\n\n[SONAR.SuspPE!gen39](https://www.symantec.com/security-center/writeup/2018-011802-4849-99)\nSONAR.Heur.RGC!g571\n\n**Targeted Attack Analytics**\n\nSymantec’s new [Targeted Attack Analytics (TAA), available in our ATP Product can](https://www.symantec.com/about/newsroom/press-releases/2018/symantec_0415_01)\ndetect attacks where an executable spreads to multiple machines across a network via\ncredential theft, brute forcing, or an exploit. TAA detects Emotet’s malicious activity due to\npatterns in its spreading behavior. In particular, TAA will detect when files are dropped by\nEmotet’s spreader module on multiple machines in an organization.\n\n**Threat intelligence**\n\n[Customers of the DeepSight Intelligence Managed Adversary and Threat Intelligence (MATI)](https://www.symantec.com/services/cyber-security-services/deepsight-intelligence/adversary)\nservice have received multiple reports on Emotet. These reports detail methods of detecting\nand thwarting activities of the group that leverages this Trojan.\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to\ninvestigate targeted attacks, drive enhanced protection in Symantec products, and offer\nanalysis that helps customers respond to attacks.\n\n\n-----\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-07-18 - The Evolution of Emotet- From Banking Trojan to Threat Distributor.pdf"
    ],
    "report_names": [
        "2018-07-18 - The Evolution of Emotet- From Banking Trojan to Threat Distributor.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535671,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653775023,
    "ts_modification_date": 1653775023,
    "files": {
        "pdf": "https://archive.orkl.eu/d9bb42b491c2b2dcad2189cd7e645f6ce445a6e3.pdf",
        "text": "https://archive.orkl.eu/d9bb42b491c2b2dcad2189cd7e645f6ce445a6e3.txt",
        "img": "https://archive.orkl.eu/d9bb42b491c2b2dcad2189cd7e645f6ce445a6e3.jpg"
    }
}