{
    "id": "8bb3e776-c182-426c-88a1-b9d9b6e2e5fb",
    "created_at": "2022-10-25T16:48:10.662504Z",
    "updated_at": "2025-03-27T02:13:47.809126Z",
    "deleted_at": null,
    "sha1_hash": "a073f4374c7bea6c357c1293a78ef426ed2b5037",
    "title": "An Analysis of Buer Loader",
    "authors": "",
    "file_creation_date": "2021-11-05T19:51:45Z",
    "file_modification_date": "2021-11-05T19:51:45Z",
    "file_size": 1360789,
    "plain_text": "# An Analysis of Buer Loader\n\n##### Trend Micro Research\n\n\n-----\n\n### Overview\n\nBuer Loader, detected by Trend Micro as Trojan.Win32.BUERLOADER, was first observed when it was\nadvertised as a modular loader in August 2019. Since then, Buer Loader has continued its activity and\nshown signs of further development. Buer Loader's main function is to download and execute additional\npayloads. It can be used in compromised networks to distribute secondary payloads.\n\nWhen it first entered the underground market, it was deliberately priced lower than Smoke Loader and\nAmadey, which were its direct competitors. This was an indication that the threat actors behind its\ndistribution wanted to release a competitive product. As of this writing, we have identified one actor as its\ndistributor with many different operators using the service. Although the loader was competitively priced —\nat one point even poised to compete with Emotet[1] — from our observations, its popularity has not reached\nthat of competitors like BazarLoader.\n\nHowever, Buer Loader is still worth monitoring because of its continuing development and activity, such as\nits involvement in targeted ransomware attacks. The loader is known to be used to deploy Cobalt Strike,\nWizard Spider (aka TrickBot) payloads, as well as payloads of other well-known ransomware, such as\nRyuk.\n\nRecent updates of this loader are also worth reviewing. Originally, Buer Loader was written in C with a\ncontrol panel written in .NET,[2] but a newer version was observed in the second quarter of 2021, notably\nrewritten in Rust. This Rust variant of Buer Loader, also known as RustyBuer, is the main focus of this\nanalysis. We also take note of this variant’s use of signed XLL files in our analysis.\n\nTo get a better understanding of Buer Loader and its activities, we first give a timeline of its iterations and\noverall capabilities. As previously mentioned, Buer Loader dates back to August 2019, and has since then\nbeen updated and used in different campaigns.\n\n#### A Timeline of Noteworthy Buer Loader Events\n\nAs this table shows, Buer Loader gained popularity in 2020 after its initial inception. More importantly,\ndevelopments in 2021 indicate that Buer Loader will continue to be active in the near future.\n\n**Date** **Event**\nAug 2019 - A threat actor advertises \"Modular Buer Loader.\"[3]\n\n          - The loader uses emails with Word attachments containing macros to download\nthe next stage.\n\n          - Screenshots used as advertisements indicate that the loader was in development\nat the beginning of 2019 (as discussed further in the section titled, “Buer Loader\nControl Panel”).\nOct 2019 - The loader is used as part of a malvertising campaign in Australia using Fallout\n\nEK. It dropped the KPOT stealer, Amadey, and Smoke Loader.[4]\nSep 2020 - The loader gained popularity and is considered an alternative to Emotet for\ndistributing Ryuk. Buer and Ryuk are found to be using the same shellcode loader\nto execute the unpacked malware code in memory.[5]\nOct 2020 - The loader moves away from Google Docs and begins using Constant Contact.[6]\nMay 2021 - A new strain dubbed “RustyBuer” is observed written in RUST.[7]\nJul 2021 - It is observed that a signed XLL file delivers Buer Loader.[8]\n\nTable 1. Buer Loader's activity timeline\n\n|Date|Event|\n|---|---|\n|Aug 2019|• A threat actor advertises \"Modular Buer Loader.\"3 • The loader uses emails with Word attachments containing macros to download the next stage. • Screenshots used as advertisements indicate that the loader was in development at the beginning of 2019 (as discussed further in the section titled, “Buer Loader Control Panel”).|\n|Oct 2019|• The loader is used as part of a malvertising campaign in Australia using Fallout EK. It dropped the KPOT stealer, Amadey, and Smoke Loader.4|\n|Sep 2020|• The loader gained popularity and is considered an alternative to Emotet for distributing Ryuk. Buer and Ryuk are found to be using the same shellcode loader to execute the unpacked malware code in memory.5|\n|Oct 2020|• The loader moves away from Google Docs and begins using Constant Contact.6|\n|May 2021|• A new strain dubbed “RustyBuer” is observed written in RUST.7|\n|Jul 2021|• It is observed that a signed XLL file delivers Buer Loader.8|\n\n\n-----\n\n#### Buer Loader Capabilities\n\nThe primary capability of Buer Loader is to deploy a payload to infected machines with a variety of download\nand execution options, which can be customized via a user-friendly control panel. We list down these\ncapabilities in the following table.\n\n**Capability** **Impact**\nGeotargeting/System profiling Geotargeting allows an actor to ensure that Commonwealth of\nIndependent States (CIS) countries are not targeted, likely as an\neffort to avoid drawing the attention of local law enforcement.\nSystem profiling, meanwhile, helps the actor ensure that the\npayload is crafted for maximum impact.\nCommand-and-control (C&C) Base64-encoded C2 POST requests are used to send back system\ncommunication via HTTPS POST information that facilitates system profiling.\n\nA JSON object is returned by an actor in the beacon response,\nwhich contains the configuration for how a payload will be\ndownloaded and executed.\nSupport for multiple architectures This works on Windows 7 x86/x64 and Windows 10 x86/x64\nPanel can be expanded to Docker This releases notes to make a reference to suggest that the control\npanel can be integrated into a Docker host. It is currently unknown\nif this is an owned host or compromised host.\nSupport for self updates The JSON response beacon contains a file hash that can be used\nto check for updates.\nTable 2. List of Buer Loader capabilities and their impacts\n\nWe give a more detailed analysis of Buer Loader in a later section and list down the various campaigns it\nhas been a part of.\n\n#### Buer Loader Activity Summary\n\nWe begin by summarizing Buer Loader’s activities, from its release in August 2019 to its most recent\niteration in the second quarter of 2021. We also break down the regions that saw the greatest number of\nBuer Loader detections and the industries in which it is often detected based on our data.\n\nBased on our Trend Micro™ Smart Protection Network™ (SPN) detections, we can see that Buer Loader\nhad the most active detections in India, followed by Israel. The top 10 countries where we detected the\nmost activity from Buer Loader can be seen in Figure 1.\n\n|Capability|Impact|\n|---|---|\n|Geotargeting/System profiling|Geotargeting allows an actor to ensure that Commonwealth of Independent States (CIS) countries are not targeted, likely as an effort to avoid drawing the attention of local law enforcement. System profiling, meanwhile, helps the actor ensure that the payload is crafted for maximum impact.|\n|Command-and-control (C&C) communication via HTTPS POST|Base64-encoded C2 POST requests are used to send back system information that facilitates system profiling. A JSON object is returned by an actor in the beacon response, which contains the configuration for how a payload will be downloaded and executed.|\n|Support for multiple architectures|This works on Windows 7 x86/x64 and Windows 10 x86/x64|\n|Panel can be expanded to Docker|This releases notes to make a reference to suggest that the control panel can be integrated into a Docker host. It is currently unknown if this is an owned host or compromised host.|\n|Support for self updates|The JSON response beacon contains a file hash that can be used to check for updates.|\n\n\n-----\n\nFigure 1. Trend Micro Smart Protection Network global detections from January 2019 to November 1,\n\n2021.\n\nBased on our detections, the healthcare, banking, and telecommunications industries saw the most\ndetections of Buer Loader.\n\nFigure 2. Trend Micro Smart Protection Network detections broken down by industry from January 2019\n\nto November 1, 2021\n\n\n-----\n\n### Malware Analysis\n\nBuer Loader has had several variations over the years, notably its use of Covid-19-related topics as a cover\nfor its malicious files, but it typically follows the stages described in Figure 3. In this section, we detail how\nBuer Loader works based on the more recent Rust version of the malware.\n\nFigure 3. The Buer loader kill chain\n\n#### Buer Loader Arrival\n\nAs mentioned earlier, Buer Loader has undergone several variations over the years. This can be seen in\nits arrival method, which has changed every year since it was first discovered.\n\nFigure 4. Variations in Buer Loader’s arrival\n\n\n-----\n\nA notable aspect of Buer Loader’s arrival is its use of malicious Microsoft Word and Microsoft Excel\ndocuments containing an embedded VBA macro that creates a process via WMI. This leads to a Base64encoded command that is executed by PowerShell.\n\nFigure 5. Sample malicious Excel document used by Buer Loader\n\nOlevba, a script for parsing OLE and OpenXML files, helps create the analysis table as seen in Figure 6.\nThe analysis shows AutoExec macro and PowerShell commands; the macro function itself is obfuscated\nusing Hex-encoded strings that must be concatenated, reordered, and decoded.\n\n\n-----\n\nFigure 6. Analysis table from olevba\n\nIt can be observed in the following VB script that “YNC_Status_ZDUZD” is passed as an argument to\ncomplete the PowerShell command.\n\nFigure 7. Function for executing the encoded PowerShell command\n\nWe reproduced this activity in a lab environment, and we confirmed that Behavior Monitoring terminates\nthe process before the command can be executed. The process chain seen in Figure 8 is taken from an\nexecution profile on the Trend Micro Vision One™ console.\n\n\n-----\n\nFigure 8. Execution profile for Buer Loader’s malicious document on the Trend Micro Vision One console\n\nFurther inspection of the command being executed by cmd.exe shows the full base64 command. The\nBehavior Monitoring process termination is triggered by PolicyId: FLS.ISB.4037T.\n\nFigure 9. Base64-encoded PowerShell command\n\nThe decoded command shows the creation of a web request to retrieve Buer Loader from softersyu[.]com.\nThe “IO.MemoryStream” triggers the Behavior Monitoring termination of “cmd.exe.” The loader is then\nsaved to \\ProgramData\\, and the process is started.\n\nFigure 10. The decoded command\n\n\n-----\n\n#### Buer Loader Installation\n\nAs for Buer Loader’s installation, the beacon response can be configured to use one of two options provided\nto the operator for achieving persistence. These options are to either use a shortcut (LNK) that runs on\nstartup or create a RunOnce registry key.\n\n##### Anti-Analysis / Anti-Sandbox Routines\n\nBuer Loader also uses code obfuscation techniques (call, push, ret) that are used to make analysis more\ndifficult. Additionally, the loader makes use of several time-based evasion techniques:\n\n  - Reading the Windows installation date\n\n  - Querying the system time\n\n  - Using long sleep periods to make dynamic analysis difficult\n\nFigure 11. Use of the Sleep function to hinder dynamic analysis\n\nThere are potential dummy code loops in its code, which could be an attempt to further delay analysis.\nThe loader enumerates processes or threads by making use of the Windows API functions\nCreateToolhelp32Snapshot and ProcessInformation.\n\nOnce the processes have been enumerated, the malware proceeds to check for sandboxes and analysis\ntools. The GetProcessHeap and IsDebuggerPresent functions are used to detect if the malware is being\ndebugged.\n\nFigure 12. Function to check if the executable is being debugged\n\n##### System Information Discovery\n\nAs mentioned earlier, the loader uses several time-based evasion techniques. To do this, it would need to\ngather information on the infected system. Buer Loader’s code reveals several of the functionalities that\nwould allow it to get information on the system.\n\n\n-----\n\nOne such functionality is to query local or system time, or GetSystemTimeAsFileTime as seen in Figure\n13.\n\nFigure 13. GetSystemTimeAsFileTime used to query the system time\n\nAnother functionality that this loader contains is to enumerate processes or threads and query a list of all\nrunning processes by using CreateToolhelp32Snapshot and ProcessInformation.\n\nThe loader is designed to behave differently if executed on a Russian or Kazak computer as seen with\nthe help of NtQueryDefaultLocale@NTDLL.DLL in Figure 14.\n\nFigure 14. Checking if the system is located in a CIS country\n\nThe loader contains functions for attempting to detect sandboxes and other analysis tools using the\nfollowing process names, modules, or functions:\n\n  - VBOXSERVICE.EXE\n\n  - VBOXTRAY.EXE\n\n  - VMTOOLSD.EXE\n\n  - VMWARETRAY.EXE\n\n  - VMWAREUSER.EXE\n\n  - VGAUTHSERVICE.EXE\n\n  - VMACTHLP.EXE\n\n  - VMSRVC.EXE\n\n  - VMUSRVC.EXE\n\n  - PRL_CC.EXE\n\n  - PRL_TOOLS.EXE\n\n  - XENSERVICE.EXE\n\n  - QEMU-GA.EXE\n\n  - WINDANR.EXE\n\n\n-----\n\nA Rust crate (hxxps://github[.]com/libcala/whoami) is used to retrieve system information that is to be sent\nin an HTTP POST request to the C&C.\n\nFigure 15. Use of Rust crate to determine system information\n\n#### Signed XLL File for Buer Loader Delivery\n\nOne of the notable changes made by Buer Loader was the purchase of Sectigo OV Code Signing\ncertificates. This allowed for a new delivery mechanism, observed as the use of a signed XLL file, to deliver\nBuer Loader. The value of signed certificates for the loader is that they can mislead personnel tasked to\ndefend the system.\n\nFigure 16. XLL version of Buer Loader that is digitally signed\n\nChecking the certificate information shows that the certificate is issued to the owner of khorum[.]ru. A whois\nlookup reveals that the domain was registered shortly after the certificates appeared for sale on the\nexploit[.]im forum.\n\n\n-----\n\nFigure 17. Whois information for khorum[.]ru\n\nThe certificate issued by Sectigo RSA Code Signing certificate authority (CA) was originally issued for one\nyear but has been revoked by the issuer.\n\nFigure 18. The revoked Sectigo certificate\n\n#### Buer Loader Control Panel\n\nMuch information can also be garnered from Buer Loader’s control panel, which incorporates several\nfeatures that allow the operator to easily monitor statistics in real time. The screenshots from this section\n(Figures 19 to 22) were provided by the threat actor to advertise the loader. From an investigator’s\nstandpoint, these images give us insight into the operation.\n\n\n-----\n\nAn interesting observation is that although the loader was first advertised in August 2019, activity on its\ncontrol panel was dated December 2018. Therefore, this image of the control panel is more than likely a\ntest environment for the actor. The tabs seen at the very top of Figure 19 translate to statistics, tasks, and\nfiles. The panel, meanwhile, highlights the number of machines that are online, infected, or no longer calling\nback to the C&C server.\n\nFigure 19. The Buer Loader control panel[9]\n\nAlthough the screenshots are for an earlier version, it is likely that the functionality has not changed\nsignificantly. The reason for this assumption is that when Buer Loader was rewritten in Rust, it was still a\ncopy of its C version to maintain compatibility with the C&C infrastructure and the control panel.\n\nFigure 20 shows the tasks tab that contains a task manager for tracking the ongoing deployment of\npayloads. It also includes the ability to add updates for the payloads.\n\nFigure 20. Buer Loader control panel showing its task manager[10]\n\n\n-----\n\nFigure 21 shows the Files tab, which is where the payloads are managed. Payloads can be uploaded here\nfor deployment. It also tracks the number of hosts that have downloaded a particular payload.\n\nFigure 21. Buer Loader control panel showing its file management[11]\n\nThe control panel gives the operator the ability to customize options for tasks as shown here. It also allows\nthe operator to decide on the following options:\n\n  - Architecture\n\n  - Administrator rights (admin/user)\n\n  - Number of CPU cores required\n\n  - File name\n\n  - Quantity (option to limit the number of executions)\n\n  - Execution method (MemLoad/CreateProcess/ShellExecute)\n\n  - Command-line argument\n\n  - Method of persistence\n\n\n-----\n\nFigure 22. Buer Loader control panel showing its payload configuration[12]\n\nAs can be seen in these screenshots, the control panel looks to be very user-friendly and organized. To\ninvestigators, this gives an overview of the capabilities of Buer Loader and the ways that it can be\ncustomized.\n\n#### Variant Written in Rust\n\nAside from the use of signed certificates, a relatively well-known change in Buer Loader was the shift to the\nRust programming language, as it had previously been written in C. There are several possible reasons for\nthis shift.\n\nOne possible reason is that Rust is becoming a popular alternative to C. This increased popularity can be\nattributed to its efficiency, since it is low-level enough to maximize performance and run faster than C. Rust\ncan also efficiently combine multiple functions or libraries.\n\nAnother possible reason for the shift is that it is an attempt to make detections based on C obsolete. No\nsignificant changes were done to the loader when it was rewritten from C to Rust, which means it maintained\ncompatibility with the existing Buer C&C infrastructure. This could indicate that the shift to Rust was an\nattempt to make detections of its C version obsolete, or more simply to indicate a change in personnel\nbehind the development of the loader.\n\n\n-----\n\n### 2021 Campaigns Using Buer Loader \n\nIn a campaign involving Buer Loader, the operator sets up a domain to facilitate C&C as part of the\ncampaign’s service. For investigators, this makes it easier to track campaigns involving Buer Loader, since\ndifferent operators will be using one domain at a time. Customers or other threat actors of this service\ntherefore have the option to move to a new domain, but this would come at an additional cost.\n\nAside from being rewritten in Rust, another notable aspect of 2021 campaigns that used Buer Loader was\ntheir use of DHL and Covid-19 as a cover for their email and malicious file attachments, which were either\nWord or Excel files. The threat actors tried to make the emails appear as legitimate as possible to convince\nusers to enable macros, as noted in the section discussing the arrival stage of Buer Loader.\n\nInitially, Buer Loader used DHL as a cover, eventually mixing in Covid-19-related topics, before shifting to\nCovid-19 entirely. Figure 23 is an example of an email that uses both DHL and Covid-19 as a cover for its\nmalicious content.\n\nFigure 23. The DHL-themed lure with a reference to Covid-19\n\n\n-----\n\nWe list down examples of 2021 campaigns that involved Buer Loader and their indicators in Table 3.\n\n**Date** **Indicator** **Indicator**\nAug 2021 RustyBuer - 2b093ef5eef05f81d6b69c61951091a399ccf6dbc42df822c40f351\n46a04523c\nC2 server        - cerionetya[.]com\nC2 server IP        - 104[.]248[.]244[.]25\n\n                 - 161[.]35[.]155[.]123\n\nAug 2021 RustyBuer - 3c509e24ce23d756ebb4225fc3e7091abbb6a1b617f32557e5f4d\n8d9f594416c\nC2 server        - Bostauherde[.]com\nC2 server IP        - 207[.]154[.]216[.]70\n\nAug 2021 RustyBuer - 5f6bbd8a228200f32915edd97f2762734b7e45fb24a3cf01ac8380\n90e7e4d45e\nC2 server        - Awmelisers[.]com\nC2 server IP        - 142[.]93[.]102[.]244\n\nJul 2021 RustyBuer - 5f6bbd8a228200f32915edd97f2762734b7e45fb24a3cf01ac8380\n90e7e4d45e\nC2 server        - Awmelisers[.]com\nC2 server IP        - 142[.]93[.]102[.]244\n\nJul 2021 RustyBuer - 001405ded84e227092bafe165117888d423719d7d75554025ec4\n10d1d6558925\nC2 server        - seryanjek[.]com\nC2 server IP        - 161[.]35[.]210[.]224\n\nApr 2021 RustyBuer - edc3b5f8d45d7a1cceee144e57fc5ddfaf8c0c7407a1514d2f3bab4\nf3c9f18b8\nC2 server        - Vesupyny[.]com\nC2 server IP        - 161[.]35[.]21[.]48\n\n                 - 167[.]99[.]202[.]172\nTable 3. A summary of Buer Loader campaigns and related indicators\n\n### Buer Loader Infrastructure and C&C Analysis\n\nWith respect to infrastructure, the C&C functionality for Buer Loader is handled by HTTPS POST requests.\nThese requests contain encrypted system information from the infected machine. These are also padded\nout with randomly generated text. The requests use the following to encrypt or encode the information:[13]\n\n  - Base64\n\n  - Hex encoding\n\n  - RC4 encryption\n\n|Date|Indicator|Indicator|\n|---|---|---|\n|Aug 2021|RustyBuer|• 2b093ef5eef05f81d6b69c61951091a399ccf6dbc42df822c40f351 46a04523c|\n||C2 server|• cerionetya[.]com|\n||C2 server IP|• 104[.]248[.]244[.]25 • 161[.]35[.]155[.]123|\n||||\n|Aug 2021|RustyBuer|• 3c509e24ce23d756ebb4225fc3e7091abbb6a1b617f32557e5f4d 8d9f594416c|\n||C2 server|• Bostauherde[.]com|\n||C2 server IP|• 207[.]154[.]216[.]70|\n||||\n|Aug 2021|RustyBuer|• 5f6bbd8a228200f32915edd97f2762734b7e45fb24a3cf01ac8380 90e7e4d45e|\n||C2 server|• Awmelisers[.]com|\n||C2 server IP|• 142[.]93[.]102[.]244|\n||||\n|Jul 2021|RustyBuer|• 5f6bbd8a228200f32915edd97f2762734b7e45fb24a3cf01ac8380 90e7e4d45e|\n||C2 server|• Awmelisers[.]com|\n||C2 server IP|• 142[.]93[.]102[.]244|\n||||\n|Jul 2021|RustyBuer|• 001405ded84e227092bafe165117888d423719d7d75554025ec4 10d1d6558925|\n||C2 server|• seryanjek[.]com|\n||C2 server IP|• 161[.]35[.]210[.]224|\n||||\n|Apr 2021|RustyBuer|• edc3b5f8d45d7a1cceee144e57fc5ddfaf8c0c7407a1514d2f3bab4 f3c9f18b8|\n||C2 server|• Vesupyny[.]com|\n||C2 server IP|• 161[.]35[.]21[.]48 • 167[.]99[.]202[.]172|\n\n\n-----\n\nAn example of the POST request can be seen in Figure 23. We can see that there are chunks of data that\nare delimited by “=” and that contain random strings appended with the “&” at the end. The number of\ncharacters of randomly generated text varies from six to eight characters. Once the random characters are\nremoved, the string can be decoded using an RC4 key.\n\nFigure 23. POST request containing system information\n\nThe following is an example of a decoded string:\n\n299bc0beffe830d0871f8f6d7cadb40117208ea59f59cadd08b220b903f4e31c|e3b0c44298fc1c149afbf4c8\n996fb92427ae41e4649b934ca495991b7852b855|Windows 7 Ultimate|x64|4|Admin|[Computer\nName]|133/238|[AD Domain]|[User Name]|1\n\nThe piped string contains digests of system parameters and the loader itself. The piped string is broken\ndown in the next table.\n\n**Information sent to C&C** **Note**\n\nBot ID SHA256 of system parameters\n\nSHA256 of loader\n\nWindows version Used in control panel\n\nArchitecture Used in control panel\n\nNumber of processors Used in control panel\n\nUser privileges Possibly to identify opportunities for access as a service (AaaS)\n\nComputer name Used in control panel\n\nSpace used/total space\n\nActive Directory (AD) Domain\n\nUsername\n\nTable 4. HTTPS POST information\n\n|Information sent to C&C|Note|\n|---|---|\n|Bot ID|SHA256 of system parameters|\n|SHA256 of loader||\n|Windows version|Used in control panel|\n|Architecture|Used in control panel|\n|Number of processors|Used in control panel|\n|User privileges|Possibly to identify opportunities for access as a service (AaaS)|\n|Computer name|Used in control panel|\n|Space used/total space||\n|Active Directory (AD) Domain||\n|Username||\n\n\n-----\n\n|JSON object|Note|\n|---|---|\n|Type|Option to update itself or download and execute|\n|Options • Hash • x64 • FileType • AssemblyType • AccessToken • External|Hash used for checking updates AccessToken used to download the payload External – Payload from C&C or another URL|\n|Method|Execution method to be employed|\n|Parameters|Command-line arguments|\n|pathToDrop|Specify path where the payload will download to|\n|Autorun|Used to specify persistence via a RunOnce registry key|\n|Modules|Future prebuilt modules advertised|\n|Timeout|Possible debug function|\n\n\nTable 5. JSON response beacon\n\n## The future of Buer Loader\n\nChanges from Microsoft might influence the future of Buer Loader. The company’s announcement that\nExcel 4.0 VBA macros will be disabled by default could greatly make an impact on Buer Loader’s execution\nphase, as is the case for most malware families in general. We expect the threat actors behind Buer Loader\nto move from using VBA macros to another method of executing the loader. Our monitoring of discussions\nwith regard to the VBA macros being disabled on underground forums seems to show that threat actors will\nfocus on users themselves as the main vulnerability.\n\n## Tactics and Techniques\n\n#### Mitre ATT&CK\n\n\n-----\n\n## References\n\n1 Sean Gallagher. (Oct. 28, 2020). Sophos. “Hacks for sale: inside the Buer Loader malware-as-a-service.”\n[Accessed on Oct. 25, 2021, at https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n[loader-malware-as-a-service/.](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n\n2 CISOMAG. (Dec. 9, 2019). CISOMAG. “Buer, a New Loader Discovered in Several Malware Campaigns.”\nAccessed on Oct. 28, 2021, at [https://cisomag.eccouncil.org/buer-loader-a-rising-superstar-of-the-dark-](https://cisomag.eccouncil.org/buer-loader-a-rising-superstar-of-the-dark-web/)\n[web/.](https://cisomag.eccouncil.org/buer-loader-a-rising-superstar-of-the-dark-web/)\n\n3 Viktor Okorokov and Nikita Rostovcev. (Aug. 5, 2021). Group-IB. “Prometheus TDS.” Accessed on Oct.\n[14, 2021, at https://blog.group-ib.com/prometheus-tds.](https://blog.group-ib.com/prometheus-tds)\n\n4 Kelsey Merriman, Dennis Schwarz, Kafeince, and Axel F. (Dec. 4, 2019). Proofpoint. “Buer, a new loader\nemerges in the underground marketplace.” Accessed on Oct. 14, 2021, at\n[https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace.](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\n\n5 Sean Gallagher. (Oct. 28, 2020). Sophos. “Hacks for sale: inside the Buer Loader malware-as-a-service.”\n[Accessed on Oct. 25, 2021, at https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n[loader-malware-as-a-service/.](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n\n6 Sean Gallagher. (Oct. 28, 2020). Sophos. “Hacks for sale: inside the Buer Loader malware-as-a-service.”\n[Accessed on Oct. 25, 2021, at https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n[loader-malware-as-a-service/.](https://news.sophos.com/en-us/2020/10/28/hacks-for-sale-inside-the-buer-loader-malware-as-a-service/)\n\n7 Kelsey Merriman, Bryan Campbell, Selena Larson, and the Proofpoint Threat research team. (May 3,\n2021). Proofpoint. “New Variant of Buer Loader Written in Rust.” Accessed on Oct. 25, 2021, at\n[https://www.proofpoint.com/us/blog/threat-insight/new-variant-buer-loader-written-rust.](https://www.proofpoint.com/us/blog/threat-insight/new-variant-buer-loader-written-rust)\n\n8 Val Saengphaibul and Fred Gutierrez. (July 19, 2021). Fortinet. “Signed, Sealed, and Delivered – Signed\nXLL File Delivers Buer Loader.” Accessed on Oct. 25, 2021, at [https://www.fortinet.com/blog/threat-](https://www.fortinet.com/blog/threat-research/signed-sealed-and-delivered-signed-xll-file-delivers-buer-loader)\n[research/signed-sealed-and-delivered-signed-xll-file-delivers-buer-loader.](https://www.fortinet.com/blog/threat-research/signed-sealed-and-delivered-signed-xll-file-delivers-buer-loader)\n\n9 Kelsey Merriman, Dennis Schwarz, Kafeince, and Axel F. (Dec. 4, 2019). Proofpoint. “Buer, a new loader\nemerges in the underground marketplace.” Accessed on Oct. 14, 2021, at\n[https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace.](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\n\n10 Kelsey Merriman, Dennis Schwarz, Kafeince, and Axel F. (Dec. 4, 2019). Proofpoint. “Buer, a new loader\nemerges in the underground marketplace.” Accessed on Oct. 14, 2021, at\n[https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace.](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\n\n11 Kelsey Merriman, Dennis Schwarz, Kafeince, and Axel F. (Dec. 4, 2019). Proofpoint. “Buer, a new loader\nemerges in the underground marketplace.” Accessed on Oct. 14, 2021, at\n[https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace.](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\n\n12 Kelsey Merriman, Dennis Schwarz, Kafeince, and Axel F. (Dec. 4, 2019). Proofpoint. “Buer, a new loader\nemerges in the underground marketplace.” Accessed on Oct. 14, 2021, at\n[https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace.](https://www.proofpoint.com/us/threat-insight/post/buer-new-loader-emerges-underground-marketplace)\n\n13 Kelsey Merriman, Bryan Campbell, Selena Larson, and the Proofpoint Threat research team. (May 3,\n2021). _Proofpoint. “New Variant of Buer Loader Written in Rust.” Accessed on Oct. 25, 2021, at_\n[https://www.proofpoint.com/us/blog/threat-insight/new-variant-buer-loader-written-rust.](https://www.proofpoint.com/us/blog/threat-insight/new-variant-buer-loader-written-rust)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.trendmicro.com/content/dam/trendmicro/global/en/research/21/k/a-review-and-analysis-of-2021-buer-loader-campaigns/TechnicalBrief-An-Analysis-of-Buer-Loader.pdf"
    ],
    "report_names": [
        "TechnicalBrief-An-Analysis-of-Buer-Loader.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041627,
    "ts_creation_date": 1636141905,
    "ts_modification_date": 1636141905,
    "files": {
        "pdf": "https://archive.orkl.eu/a073f4374c7bea6c357c1293a78ef426ed2b5037.pdf",
        "text": "https://archive.orkl.eu/a073f4374c7bea6c357c1293a78ef426ed2b5037.txt",
        "img": "https://archive.orkl.eu/a073f4374c7bea6c357c1293a78ef426ed2b5037.jpg"
    }
}