{
    "id": "8c04c92a-d762-4b6d-8e00-d033b207145b",
    "created_at": "2023-01-12T15:02:38.58127Z",
    "updated_at": "2025-03-27T02:16:58.118813Z",
    "deleted_at": null,
    "sha1_hash": "00040d8ff9d5f4016d5393b0f312b3b1b9bc16fd",
    "title": "2017-08-15 - Secrets of Cobalt",
    "authors": "",
    "file_creation_date": "2022-05-28T15:46:22Z",
    "file_modification_date": "2022-05-28T15:46:22Z",
    "file_size": 1446010,
    "plain_text": "# Secrets of Cobalt\n\n**group-ib.com/blog/cobalt**\n\n15.08.2017\n\nHow Cobalt hackers bypass your defenses\n\n\n-----\n\nVESTA MATVEEVA\n\n**Chief Specialist in Digital Forensics**\n\n**at Group-IB**\n\nIn June 2016, the first attack conducted by the Cobalt group was tracked at a large Russian\nbank, where hackers attempted to steal money from ATMs. The attackers infiltrated the\nbank's network, gained control over it, compromised the domain administrator's account, and\nreached the ATM control server.\n\n\n-----\n\nThe Bank s Information Security team detected traces of malicious programs and suspicious\nconnections to the server. In order to stop further unauthorized access, the entire bank was\nblocked from accessing the Internet. This turned out to be the best solution, as the Cobalt\ngroup set up a controlled botnet in the bank's network which was very difficult to track and\neven harder to stop.\n\nThe day after the attack, Group-IB experts came to the bank's central office and began\nsearching for the source of the attack; ascertaining the stages of its development, causes,\nand consequences; analyzing the malicious programs; and restoring the chain of events. The\ncomputers that were involved in the attack were then examined.\n\nGroup-IB forensic specialists immediately understood that they faced a new approach to\ntargeted attacks on banks. They were not wrong. The June incident was a \"test\" of a new\nattack technique that the attackers would begin using in July in the CIS, Europe, and Asia.\nFor example, over $2m USD was stolen from 34 ATMs operated by the First Bank, one of\n[Taiwan's largest banks. In october 2016 Group-IB published the report about the Cobalt](https://www.group-ib.com/cobalt.html)\ngroup. Now, a year later, this group is continuing to attack banks, which is reported monthly\nby Group-IB's Threat Intelligence team.\n\nInitially the Cobalt group focused on jackpotting ATMs: they launched a program that sent\ncommands directly to the dispenser to issue cash. Then the group shifted to other systems in\nthe bank including card processing, payment systems, SWIFT. Once gaining access to such\nsystems, attackers studied how payments and other financial transactions are conducted to\nrepeat them. That said, the services, such as payment processing systems or SWIFT are not\nactually hacked or the 'weak point'. The actual vulnerability is the bank and the protection\nmethods against such advanced attacks.\n\nThe Cobalt group's attacks are always executed according to the same template. The basic\nprinciples of targeted attacks on financial institutions have not changed since 2013 when the\nAnunak, Corkow, Buhtrap, and Lurk groups began conducting the first attacks on Russian\nbanks. The only thing that has changed is the tools. Attack stages are shown in fig. 1.\n\n\n-----\n\n_Fig. 1 The Cobalt group's stages of attack_\n\nCurrently, the Cobalt group is attacking large financial organizations around the world, that's\nwhy it makes sense to talk about the techniques used by this group to conceal their traces in\nthe network and circumvent security measures.\n\nNetwork penetration\n\nIn all cases investigated by Group-IB, the Cobalt group used a set of spear phishing emails\nto gain initial access to the corporate infrastructure. The attackers use mail servers to carry\nout mass mailing of phishing messages containing attachments to employees of the\norganization of interest. Message subjects and attachment names are written in such a way\nthat the employees want to open them (fig. 2).\n\n\n-----\n\nFig. 2 Examples of message subjects and attachment names\n\nThe mailing is carried out on a mass scale: in any organization, messages are usually sent to\nbetween 10 and 40 employees. However, some of the email addresses belong to employees\nthat no longer work at the organization, which means that the Cobalt group likely uses out-ofdate mailing lists. Each message contains an attachment that loads the payload – part of\nCobalt Strike software – to the computer's operating memory.\n\nIn order to make this download possible, attackers have tried several different formats of\nattachments and emails, as their primary task is to bypass mail filters, protection measures,\nand the company's security policy. First archives with .exe and .scr executables were used\nas an attachment (fig. 3).\n\n\n-----\n\n_Fig. 3 Example of a message with an executable attachment (.exe)_\n\nThe archive is password-protected in order to bypass anti-virus scans, security systems, and\nmail filters. However, when there is use of a security policy that prohibits the transfer of\nencrypted archives, such an email message may be blocked, so the attackers would send\n.doc files that contain exploits for Microsoft Office (fig. 4).\n\n\n-----\n\n_Fig. 4 The attackers would send .doc files that contain exploits for Microsoft Office._\n\nThis scheme assumes the presence of a vulnerable version of software. Companies can\nprotect themselves by updating all software they use in a timely fashion. Of course, the risk\nof zero-day vulnerabilities remains, but we have not yet seen their use in these types of\nattacks. For organizations that perform timely updates of their systems and adhere to strict\nsecurity policies, the Cobalt group employs another method to deliver malicious code\nthrough emails with Word documents containing a malicious macro. When opening the\ndocument, the user must click on the \"Enable content\" button, which enables macros (fig. 5).\n\n_Fig. 5 Example of an email message with a Word document, which, when opened, requires_\n_the user to click on the \"Enable content\" button to enable a malicious macro._\n\nOne of Cobalt's tasks when crafting spear-phishing emails is to conceal the sender. In events\nwhere of a simple substitution of the sender's field, the majority of mail servers block these\nmessages. Therefore, the Cobalt group registered domains are similar to real ones (for\nexample, diebold.pw), and configured their email server to distribute acting as these\nlegitimate domains (fig. 6).\n\n\n-----\n\n_Fig. 6 Example of a message sent by attackers from a domain whose name is similar to the_\n_name of a real domain ._\n\nAs soon as the attachment is launched and the malicious code is executed, the Cobalt Strike\npayload is loaded in the memory. This tool is used for penetration testing, which means that\nit isn't available only to cyber-fraudsters. This software provides a full set of functions for\nmanaging a downloaded module, and accordingly, an infected computer. This set includes a\nkeylogger, screenshots, remote access via VNC, injections into processes, the ability to\nbypass the UAC security system, the Mimikatz tool, which is used to compromise access\ncredentials for Windows OS accounts, the ability to scan open ports on an organization's\ncomputers, etc.\n\nRunning in RAM\n\nCobalt Strike modules aren't stored in the file system; their executable code can only be\nfound in RAM. By default, the code runs in the context of rundll32.exe process, but can be\ninjected into any process, for example, to increase the rights and number of privileges. In\n\n\n-----\n\naddition, Cobalt Strike enables users not to expose a fragment of memory allocated in the\ncontext of another process, the RWX (Read, Write, Execute) attributes, which often reveal\ninjected code. Finally, not all anti-virus tools can scan RAM.\n\nProvision of the malware survivability\n\nThe Cobalt group uses different methods to ensure malware survivability on corporate\nnetworks. The goal is to set the startup path to the executable file or program code,\nlaunching it with the powershell.exe shell command to access the Internet resource specified\nin the code in order to download and install Cobalt Strike module. In this way, the payload\nitself is not saved in the system, but rather is reloaded each time. Another bonus of this\nmethod is that a different payload can be loaded each time.\n\nStartup is ensured only on several machines that have access to the Internet. As a response,\nthe following startup methods have been recorded: through a service, startup registry keys,\nand Windows OS tasks, by replacing the legitimate executable software files prescribed in\nstartup with the executable file of the attackers. From our experience, the Cobalt group uses\na new method to provide its survivability in every attack. The danger of OS tasks is that their\nstartup can be delayed. Even if the network is not infected now, in a month the\ncorresponding task may work, and the payload will get into the organization's computers.\n\n_Fig. 7 Registry keys for startup_\n\n\n-----\n\nBypassing anti-virus tools\n\nUsually in spear-phishing emails, no exploits or any executable modules are detected by\nanti-virus tools (this has been the case with all active groups). The attackers try to\nreassemble the loaded modules in order to bypass the signature analysis of anti-virus tools.\nCobalt Strike provides the ability to use the Artifact Kit framework for these purposes and\neven modify it, as it is distributed in the source code. Aside from that, startup is performed by\nloading Cobalt Strike into the main memory without saving to the file system. Additional\nmeans of circumventing anti-virus tools include the use of exploits to increase the level of\nrights and privileges, bypassing UAC, and injecting code into trusted processes.\n\nBypassing network security\n\nCobalt Strike allows users to install two types of modules: HTTP/HTTPS/DNS modules and\nSMB modules. The former module is installed on a system that has access to the Internet\nand provides interaction with the C&C server using HTTP/HTTPS/DNS protocols. After the\nemail message sent by the attackers is opened, such a module is downloaded to the system.\nAnother module is installed even in systems that do not have Internet access, as, using SMB\nprotocol (which is typically used within a local network), the SMB module is controlled via\ninfected computers running the HTTP/HTTPS/DNS module.\n\nTo circumvent intrusion detection and prevention systems, as well as firewalls and proxy\nservers with signature rules aimed at detecting requests of a certain type, the Cobalt Strike\nmodules generate communication profiles using the HTTP protocol: the value of the\nprotocol's service header and query parameters are given, the data can be forwarded as\nheader value, as the value of the parameter sent with the URI, as part of the URI, and sent in\nthe body of HTTP message. When interacting with the C&C server, the data (executable\nfiles, commands, and the outputs of those commands) is encrypted. For interaction on\nHTTPS protocol, HTTP protocol profiles may be used with an indicated SSL certificate, but\nfor data exchange on the DNS protocol, it requires DNS A, AAAA, and TXT records. In this\ncase, one may separately specify the interaction intervals between the C&C server and the\nmodule on the infected computer.\n\nThe Cobalt Strike module can use several profiles and switch between data exchange\nmethods on command from the C&C server without the need to update the module. The\naddresses of the C&C servers change from the moment the intruders penetrate the\ncompany's network until the moment the money is stolen, thus avoiding blacklists of IP\naddresses or domain names. In this way, a controlled botnet is created within the\norganization that has access to any computer, even those that do not have access to the\nInternet.\n\n\n-----\n\n_Fig.8 Cobalt Strike infrastructure_\n\nNetwork distribution\n\nTo run malicious programs on other computers on the network, including Cobalt Strike\nmodules, the following methods are used, which are provided by Microsoft products for\nadmin accounts to:\n\n- Create a service on another computer to run the program code, start the service, and\ndelete it. As for the command line, a program code is written and passed to the input of the\npowershell.exe command interpreter;\n\n- Connect to a shared directory (C$, ADMIN$) on another computer, copy the module to it,\ncreate the service, run it to start the module, and then delete the service; delete the module.\n\n- Connect to another computer using PsExec.exe (the remote access program is included in\nthe Microsoft SysInternals suite), copy the module, and run it; delete the module.\n\n- Connect to another computer via RDP, copy the module, and run it; delete the module.\n\nAfter creation, the services are deleted. Remote access via RDP and using PsExec is typical\nfor network administrators. Therefore, traces of programs that operate only in RAM are\ndifficult to detect in a timely manner. Usually OS logs and memory dump can help. More\ndetailed information can be obtained during an advanced security audit and by periodically\nmaking backup copies of these logs.\n\n\n-----\n\nUse of standard tools\n\nCobalt Strike is publicly accessible, and can be downloaded in order to learn and create\ndetection rules on the network. Aside from that, to work within an organization, the Cobalt\ngroup uses standard tools, including:\n\n- remote connection via the RDP protocol (built-in capability of the OS);\n\n- remote connection using PsЕxec;\n\n- remote connection using TeamViewer, which allows a user to preserve remote access in\ncase control using the Cobalt Strike module is lost;\n\n- network scanning using the SoftPerfect Network Scanner program;\n\n- secure connection using the Plink program.\n\nTo prevent this threat, the company should configure filter rules to detect the abovementioned tools on the corporate network. TeamViewer calls can be controlled by rules on\nthe firewall, proxy server, etc.\nConclusion\n\nAfter infecting one computer on an organization's network, the Cobalt group analyzes the\nprograms used on it and search for critical servers and the computers from which they are\naccessed. Financial organizations usually spend a lot of money on information security and\nconsider their isolated subnets to be safe. However, all of these subnets are controlled by\npeople, and there is practically always access to a secure subnet from an unsecured one,\neven if it's just from one computer with a unique account. This is exactly what attackers will\nbe looking for. As we know from our experience, it takes from 2 weeks to 1.5 months to gain\naccess to critical infrastructure.\n\nThis means that bank's information security specialists have, on average, one month to\nidentify attackers on a network. Anti-virus solutions do not help, the only thing that can\nprotect your company is knowledge of how, who, and with what tools hackers are attacking.\nThat's why, it is critical to update software in a timely manner and study reports from Threat\nIntelligence specialists that provide indicators of compromise and modern hacking\ntechniques.\n\n[Specifically for the BISA](https://bis-expert.ru/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-15 - Secrets of Cobalt.pdf"
    ],
    "report_names": [
        "2017-08-15 - Secrets of Cobalt.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3b046db2-f60e-49ae-8e16-0cf82a4be6fb",
            "created_at": "2022-10-25T16:07:23.427162Z",
            "updated_at": "2025-03-27T02:02:09.79482Z",
            "deleted_at": null,
            "main_name": "Buhtrap",
            "aliases": [
                "Buhtrap",
                "Operation TwoBee",
                "Ratopak Spider",
                "UAC-0008"
            ],
            "source_name": "ETDA:Buhtrap",
            "tools": [
                "AmmyyRAT",
                "Buhtrap",
                "CottonCastle",
                "FlawedAmmyy",
                "NSIS",
                "Niteris EK",
                "Nullsoft Scriptable Install System",
                "Ratopak"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a58aedbc-e89f-4e0c-8147-c6406a616cfa",
            "created_at": "2022-10-25T16:07:23.494355Z",
            "updated_at": "2025-03-27T02:02:09.831373Z",
            "deleted_at": null,
            "main_name": "Corkow",
            "aliases": [
                "Corkow",
                "Metel"
            ],
            "source_name": "ETDA:Corkow",
            "tools": [
                "Corkow",
                "Metel"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dcba8e2b-93e0-4d6e-a15f-5c44faebc3b1",
            "created_at": "2022-10-25T16:07:23.816991Z",
            "updated_at": "2025-03-27T02:02:09.991944Z",
            "deleted_at": null,
            "main_name": "Lurk",
            "aliases": [],
            "source_name": "ETDA:Lurk",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "475ea823-9e47-4098-b235-0900bc1a5362",
            "created_at": "2022-10-25T16:07:24.506596Z",
            "updated_at": "2025-03-27T02:02:10.263346Z",
            "deleted_at": null,
            "main_name": "Lunar Spider",
            "aliases": [
                "Gold SwathMore"
            ],
            "source_name": "ETDA:Lunar Spider",
            "tools": [
                "BokBot",
                "IceID",
                "IcedID",
                "NeverQuest",
                "Vawtrak",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "01d569b1-f089-4a8f-8396-85078b93da26",
            "created_at": "2023-01-06T13:46:38.411615Z",
            "updated_at": "2025-03-27T02:00:02.826863Z",
            "deleted_at": null,
            "main_name": "BuhTrap",
            "aliases": [],
            "source_name": "MISPGALAXY:BuhTrap",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c2385aea-d30b-4dbc-844d-fef465cf3ea9",
            "created_at": "2023-01-06T13:46:38.916521Z",
            "updated_at": "2025-03-27T02:00:02.950071Z",
            "deleted_at": null,
            "main_name": "LUNAR SPIDER",
            "aliases": [
                "GOLD SWATHMORE"
            ],
            "source_name": "MISPGALAXY:LUNAR SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535758,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1653752782,
    "ts_modification_date": 1653752782,
    "files": {
        "pdf": "https://archive.orkl.eu/00040d8ff9d5f4016d5393b0f312b3b1b9bc16fd.pdf",
        "text": "https://archive.orkl.eu/00040d8ff9d5f4016d5393b0f312b3b1b9bc16fd.txt",
        "img": "https://archive.orkl.eu/00040d8ff9d5f4016d5393b0f312b3b1b9bc16fd.jpg"
    }
}