{
    "id": "8c0b7855-c281-4b76-b10a-6bee58cb7ce6",
    "created_at": "2023-05-06T02:08:49.87497Z",
    "updated_at": "2025-03-27T02:05:44.758372Z",
    "deleted_at": null,
    "sha1_hash": "8dd9c8eca3bb3e7fb0263960d5cc7e96c74ea76e",
    "title": "2023-03-30 - Elastic users protected from SUDDENICON’s supply chain attack",
    "authors": "",
    "file_creation_date": "2023-05-05T01:44:55Z",
    "file_modification_date": "2023-05-05T01:44:55Z",
    "file_size": 1362633,
    "plain_text": "# Elastic users protected from SUDDENICON’s supply chain attack\n\n**[elastic.co/security-labs/elastic-users-protected-from-suddenicon-supply-chain-attack](https://www.elastic.co/security-labs/elastic-users-protected-from-suddenicon-supply-chain-attack)**\n\n_Elastic alert telemetry has observed protection events related to the supply chain attacks_\n_targeting the 3CXDesktopApp update process._\n\nBy\n\nDaniel Stepanic,\n\nRemco Sprooten,\n\nJoe Desimone,\n\nSamir Bousseaden,\n\nDevon Kerr\n\n30 March 2023\nEnglish\n\n## Key takeaways\n\n\n-----\n\nElastic users are protected from supply chain attacks targeting the 3CX users\nHow the execution flow operates is actively being investigated by Elastic Security\nLabs and other research teams\nIrrespective of the anti-malware technology you are using, shellcode and process\ninjection alerts for 3CX should not be added to exception lists\n\n## Preamble\n\nOn March 29, 2023, CrowdStrike reported a potential supply-chain compromise affecting\n[3CX VOIP softphone users as detailed in a Reddit post. Elastic Security Labs continues to](https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/)\nmonitor telemetry for evidence of threat activity and will provide updates as more evidence\nbecomes available. The earliest period of potentially malicious activity is currently\n[understood to be on or around March 22, 2023 as reported by Todyl.](https://www.todyl.com/blog/post/threat-advisory-3cx-softphone-telephony-campaign)\n\n[3CX states it is used by over 600,000 companies and over 12,000,000 users, so Elastic](https://www.3cx.com/company/customers/)\nSecurity Labs is releasing a triage analysis to assist 3CX customers in the initial detection\nof SUDDENICON, with follow-on malware and intrusion analysis to be released at a later\ndate.\n\nIn this informational update, Elastic Security Labs provides the following:\n\nPotential malicious domains associated with malware activity\nFile hashes for 3CX Windows and MacOS clients which may be impacted\nElastic queries and prebuilt protections which may be relevant to this activity\nYARA rules to identify the SUDDENICON malware\n\n## SUDDENICON triage analysis\n\n[The 3CXDesktopApp installer MSI appears to contain malicious code which waits seven](https://www.virustotal.com/gui/file/aa124a4b4df12b34e74ee7f6c683b2ebec4ce9a8edcf9be345823b4fdcf5d868)\n[days post-installation before downloading additional files from GitHub and communicating](https://github.com/IconStorages/images)\nwith malicious command-and-control domains. The client application writes ffmpeg.dll and\n**d3dcompiler_47.dll to disk, the latter of which contains a payload we refer to as**\nSUDDENICON. Both libraries in our sampling appear to have been backdoored. It should\nbe noted that ffmpeg.dll and d3dcompiler_47.dll are both legitimate file names and rules\nshould not be created on them alone.\n\n\n-----\n\nffmpeg.dll referencing the d3dcompiler_47.dll file\nThe ffmpeg.dll binary extracts SUDDENICON from d3dcompiler_47.dll by seeking the\nFEEDFACE byte sequence and decrypting using a static RC4 key (3jB(2bsG#@c7). The\nresulting payload is then loaded in memory as the second-stage payload. A shellcode stub\nprepended to the payload used to map it into memory shares similarities with APPLEJEUS\n[loader stubs, which have been associated with DPRK. Upon successfully executing, this](https://www.cisa.gov/news-events/cybersecurity-advisories/aa21-048a)\nshellcode stub writes a new file (manifest) to disk with a timestamp 7 days in the future,\nused to implement a timer after which the malware connects to the C2 infrastructure.\n\nffmpeg.dll\n\nloading the d3dcompiler_47.dll file\nC2 domains are retrieved by downloading and base64-decoding the trailing bytes appended\n[to icon files staged in the IconStorages Github repository (this repository has been removed](https://github.com/IconStorages)\nby Github). This repo was created by GitHub ID 120072117 on December 8, 2022, and\nmost recently updated on March 16, 2023. After initially connecting to an active C2 server,\nthe malware performs a POST containing a machine identifier. It then downloads and\ndecrypts a new executable.\n\nSUDDENICON downloading a new executable\n\nInitial analysis of the new executable appears to be an information stealer. We’ll release an\nupdate once the analysis has been completed.\n\n\n-----\n\nThe CEO of 3CX has [recommended uninstalling the software; a small number of](https://www.3cx.com/community/threads/3cx-desktopapp-security-alert.119951/)\n[community forum posts outline how security tooling is reacting to potential malware](https://www.3cx.com/community/forums)\n[behaviors, and CrowdStrike and](https://www.crowdstrike.com/blog/crowdstrike-detects-and-prevents-active-intrusion-campaign-targeting-3cxdesktopapp-customers/) [SentinelOne have published initial information. It appears](https://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-software-supply-chain-attack/)\nlikely that the threat was able to introduce adversary-created malicious software via update\nchannels, overwriting otherwise benign components of the 3CXDesktopApp. Users may\n[accidentally self-infect, as well.](https://orionnet.3cx.us/Electron/download/win32/3CXDesktopApp-18.12.416-full.nupkg)\n\n## Detection logic\n\n### Prevention\n\nMemory Threat Detection Alert: Shellcode injection\n[Windows.Trojan.SuddenIcon](https://github.com/elastic/protections-artifacts/blob/main/yara/rules/Windows_Trojan_SuddenIcon.yar)\n\nMemory Threat Detection Alert: Shellcode injection\n\n### Hunting queries\n\n\n-----\n\nThe events for both KQL and EQL are provided with the Elastic Agent using the Elastic\nDefend integration. Hunting queries could return high signals or false positives. These\nqueries are used to identify potentially suspicious behavior, but an investigation is required\nto validate the findings.\n\n**KQL queries**\n\nThe following KQL query can be used to identify 3CX-signed software performing name\nresolution of raw.githubusercontent.com, where malicious applications related to this threat\nhave been staged:\n```\nprocess.name : \"3CXDesktopApp.exe\" and dns.question.name :\n\"raw.githubusercontent.com\"\n\n```\nThe following KQL query can be used to identify several host-based indicators of this\nactivity:\n```\ndll.hash.sha256 :\n\"7986bbaee8940da11ce089383521ab420c443ab7b15ed42aed91fd31ce833896\" or\ndll.hash.sha256 : \n\"c485674ee63ec8d4e8fde9800788175a8b02d3f9416d0e763360fff7f8eb4e02\"\n\n```\n**EQL queries**\n\nUsing the Timeline section of the Security Solution in Kibana under the “Correlation” tab,\nyou can use the below EQL queries to hunt for behaviors similar\n\nThe following EQL query can be used to profile 3CX software and child software:\n```\nany where process.code_signature.subject_name == \"3CX Ltd\" or\nprocess.parent.code_signature.subject_name == \"3CX Ltd\"\n\n```\nThe following EQL query can be used to identify 3CX-signed software performing name\nresolution of raw.githubusercontent.com, where malicious applications related to this threat\nhave been staged:\n```\nnetwork where process.code_signature.subject_name == \"3CX Ltd\" and dns.question.name\n== “raw.githubusercontent.com”\n\n```\nThe following EQL query can be used to identify files written by the 3CXDesktopApp client:\n```\nfile where event.type == \"creation\" and (host.os.type == \"windows\" and file.path :\n\"*:\\\\Users\\\\*\\\\AppData\\\\Local\\\\Programs\\\\C3XDesktopApp\\\\app\\\\*\" and file.name :\n(\"manifest\")) or (host.os.type == \"macos\" and file.path : \"*/Library/Application\nSupport/3CX Desktop App/\" and file.name : (\"UpdateAgent\", \".main_storage\",\n\".session-lock\")\n\n```\nThe following EQL query can be used to identify several host-based indicators of this\nactivity:\n\n\n-----\n\n```\nsequence by host.name, process.entity_id\n[process where process.code_signature.subject_name:\"3CX Ltd\"]\n[library where\ndll.hash.sha256:\"c485674ee63ec8d4e8fde9800788175a8b02d3f9416d0e763360fff7f8eb4e02\",\"7\n[network where dns.question.name:\"raw.githubusercontent.com\"]\n\n```\nThe following EQL query can be used to identify this activity if the DLL is updated:\n```\nlibrary where process.code_signature.subject_name : \"3CX Ltd\" and not\ndll.code_signature.trusted == true and not startswith~(dll.name, process.name) and\n/* DLL loaded from the process.executable directory */ endswith~(substring(dll.path,\n0, length(dll.path) - (length(dll.name) + 1)), substring(process.executable, 0,\nlength(process.executable) - (length(process.name) + 1)))\n\n```\n**YARA**\n\n[Elastic Security Labs has released two YARA signatures for the malicious shellcode, which](https://github.com/elastic/protections-artifacts/blob/main/yara/rules/Windows_Trojan_SuddenIcon.yar)\nwe refer to as SUDDENICON.\n\n## Defensive recommendations\n\nElastic Endgame and Elastic Endpoint customers with shellcode protections enabled in\nprevention mode blocked the execution of SUDDENICON, though any compromised client\nsoftware may need to be removed. Due to the delayed shellcode retrieval and injection,\n3CXDesktopApp users may not see alerts until the sleep interval passes (approximately 7\ndays). Customers who are using shellcode protections in detect-only mode should enable\nprevention to mitigate the risk of infection. Do not create exceptions for these alerts.\n\nEnabling the Memory threat protection feature in Prevent mode\n\n\n-----\n\n## Indicators\n\n### Potentially malicious domains\n\nBold domains indicate that they were observed in our analysis.\n\nakamaicontainer[.]com\nakamaitechcloudservices[.]com\n**azuredeploystore[.]com**\nazureonlinecloud[.]com\nazureonlinestorage[.]com\ndunamistrd[.]com\nglcloudservice[.]com\njournalide[.]org\n**msedgepackageinfo[.]com**\nmsstorageazure[.]com\n**msstorageboxes[.]com**\n**officeaddons[.]com**\n**officestoragebox[.]com**\npbxcloudeservices[.]com\npbxphonenetwork[.]com\npbxsources[.]com\nqwepoi123098[.]com\nsbmsa[.]wiki\n**sourceslabs[.]com**\n**visualstudiofactory[.]com**\n**Zacharryblogs[.]com**\n\n### Potentially impacted 3CXDesktopApp versions and hashes\n\nClient hash:\n**dde03348075512796241389dfea5560c20a3d2a2eac95c894e7bbed5e85a0acc**\n\nOS: Windows\n\nInstaller hash:\n\n**aa124a4b4df12b34e74ee7f6c683b2ebec4ce9a8edcf9be345823b4fdcf5d868**\n\nInstaller filename: 3cxdesktopapp-18.12.407.msi\n\nClient hash:\n**fad482ded2e25ce9e1dd3d3ecc3227af714bdfbbde04347dbc1b21d6a3670405**\n\nOS: Windows\n\nInstaller hash:\n\n**59e1edf4d82fae4978e97512b0331b7eb21dd4b838b850ba46794d9c7a2c0983**\n\nInstaller filename: 3cxdesktopapp-18.12.416.msi\n\n\n-----\n\nClient hash:\n**92005051ae314d61074ed94a52e76b1c3e21e7f0e8c1d1fdd497a006ce45fa61**\n\nOS: macOS\nInstaller hash:\n\n**5407cda7d3a75e7b1e030b1f33337a56f293578ffa8b3ae19c671051ed314290**\n\nInstaller filename: 3CXDesktopApp-18.11.1213.dmg\n\nClient hash:\n**b86c695822013483fa4e2dfdf712c5ee777d7b99cbad8c2fa2274b133481eadb**\n\nOS: macOS\nInstaller hash:\n\n**e6bbc33815b9f20b0cf832d7401dd893fbc467c800728b5891336706da0dbcec**\n\nInstaller filename: 3cxdesktopapp-latest.dmg\n\n## Related content\n\nSee all top stories\n\n### Unpacking ICEDID\n\n\n-----\n\nICEDID is known to pack its payloads using custom file formats and a custom encryption\nscheme. We are releasing a set of tools to automate the unpacking process and help\nanalysts and the community respond to ICEDID.\n\n### Elastic Security Labs discovers the LOBSHOT malware\n\nElastic Security Labs is naming a new malware family, LOBSHOT. LOBSHOT propagates\nand infiltrates targeted networks through Google Ads and hVNC sessions to deploy\nbackdoors masquerading as legitimate application installers.\n\n\n-----\n\n### Elastic publishes 2023 Global Threat Report Spring Edition\n\nThis week, we’re publishing a new version of this report that’s online and interactive, which\nincludes additional data covering the remainder of 2022, written using Elastic technologies.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-30 - Elastic users protected from SUDDENICON’s supply chain attack.pdf"
    ],
    "report_names": [
        "2023-03-30 - Elastic users protected from SUDDENICON’s supply chain attack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1683338929,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1683251095,
    "ts_modification_date": 1683251095,
    "files": {
        "pdf": "https://archive.orkl.eu/8dd9c8eca3bb3e7fb0263960d5cc7e96c74ea76e.pdf",
        "text": "https://archive.orkl.eu/8dd9c8eca3bb3e7fb0263960d5cc7e96c74ea76e.txt",
        "img": "https://archive.orkl.eu/8dd9c8eca3bb3e7fb0263960d5cc7e96c74ea76e.jpg"
    }
}