{
    "id": "8c1e90c8-6dcd-4176-8614-2c84e0c8fb94",
    "created_at": "2023-01-12T15:06:20.534454Z",
    "updated_at": "2025-03-27T02:05:54.233056Z",
    "deleted_at": null,
    "sha1_hash": "3b75b369c53e4328474b1d5d1ac70afc531be12d",
    "title": "2020-08-10 - Anomali Threat Research Releases First Public Analysis of Smaug Ransomware as a Service",
    "authors": "",
    "file_creation_date": "2022-05-28T03:49:22Z",
    "file_modification_date": "2022-05-28T03:49:22Z",
    "file_size": 2356631,
    "plain_text": "# Anomali Threat Research Releases First Public Analysis of Smaug Ransomware as a Service\n\n**[anomali.com/blog/anomali-threat-research-releases-first-public-analysis-of-smaug-ransomware-as-a-service](https://www.anomali.com/blog/anomali-threat-research-releases-first-public-analysis-of-smaug-ransomware-as-a-service)**\n\nResearch | August 10, 2020\n\nby Anomali Threat Research\n\n\n-----\n\n_Authored by: Joakim Kennedy and Rory Gould_\n\nAnomali ThreatStream customers can find Indicators of Compromise (IOCs), signatures,\n[and more information about this threat here.](https://ui.threatstream.com/tip/942687)\n\n## Introduction\n\nThreat actors and cybercriminals that don’t have the ability to develop their own\nransomware for malicious campaigns can turn to the Smaug Ransomware as a Service\n(RaaS) offering, which is available via a Dark Web Onion site. At least two threat actors are\noperating the site, providing ransomware that can be used to target Windows, macOS, and\nLinux machines. The site is built with ease of use in mind. To launch an attack, threat actors\nsimply need to sign up, create a campaign, and then start distributing the malware. The site\nalso handles decryption key purchasing and tracking for victims.\n\n## Threat Actor\n\nThe Smaug RaaS appears to be operated by one to two threat actors that are both active\non the criminal underground. One of the threat actor’s online handles on the forums has\nbeen identified. The second operator still is unknown.\n\n### Forum Activity\n\nOn May 5, 2020, an actor named corinda posted on the ‘Exploit.in’ forum advertising a new\nRaaS dubbed ‘Smaug.’ The post (figure 1.) showcased Smaug’s features and included\nscreenshots of the Smaug UI, this is detailed in the Panel section below. The post also\ndirected users as to how they could avail of the service: contacting smaug\n\n-----\n\nransomware@protonmail.com with a registration fee of 0.2 BTC (appx $1,900 (USD) at time\nof posting) and subsequent service fees of 20%. The actor was willing to waive the\nregistration fee for the first five users who could demonstrate their skills with the product;\nthis was likely to garner reputation on the forum given that corinda’s reputation score was\nzero.\n\n**Corinda continued to interact with posters before the topic was locked by a forum admin on**\nMay 14, as corinda had not deposited money on the forum. There has been no subsequent\nactivity from corinda and the profile has not been active since June 6.\n\n**_Figure 1 - Initial Smaug offering on Exploit.in_**\n\n### Account History\n\n**Corinda’s Exploit account was created on May 17, 2019 as a paid registration (paid**\nregistrations are completely anonymous and do not link to other accounts on ‘friendly\nforums’), and remained dormant until Oct. 2019. On Oct. 6, 2019 corinda created their first\npost:\n\n_‘I look for front end dev. Must be able to design professional websites_\n\n_Must be able to show previous work or prove skills otherwise_\n\n_Fulent english mandatory_\n\n_Budget $2000 in BTC_\n\n_PM for details’_\n\nThe only reply to the topic was from corinda three days later on 10/9:\n\n\n-----\n\n_I am still looking. Do not be shy_\n\nThese posts were recovered through Sixgill as the original topic has since been deleted and\nis no longer available on the forum.\n\n## Smaug Panel\n\nSmaug developers shared screenshots of the product on their Onion site, it offers some\ninsight as to how the product is to be used.\n\n### Registration\n\nThe site offers a registration form replete with captcha. Upon completion, users are directed\nto pay 0.2 BTC to a specified Bitcoin wallet. The actor claims that accounts will be activated\nwithin 10 minutes of payment after the payment has received six confirmations.\n\n\n-----\n\n**_Figure 2 - Registration form_**\n\n### Dashboard\n\n**Create Campaign**\n\nAfter successful registration, the user is taken to the Smaug dashboard, which appears as a\nclean, utilitarian UI with clear directions. From this page, a user can create campaigns with\ncustom ransom messages and expiration dates; Smaug also allows users to distinguish\nbetween ‘Regular’ and ‘Company’ campaigns. A ‘Regular’ campaign will necessitate a\ndecryption key for every victim infected, while a ‘Company’ campaign will allow a single key\nto decrypt all computers affected by the campaign.\n\n\n-----\n\n**_Figure 3 - Campaign creation_**\n\nAfter the expiration date set by the user has passed, the campaign will expire and the\nvictims can no longer recover their files.\n\n**Manage Campaign**\n\nWith a campaign created, a user can download the relevant payload for the system(s) they\nare attempting to infect; Mac, Linux and Windows are all available. The dashboard also will\nkeep track of how many systems have been infected, this is done through allowing a victim\none free decryption of a single file, this is then recorded and updates the dashboard. The\ninterface allows the user to track the campaign dates and profits they have accumulated.\n\n**_Figure 4 - Campaign management_**\n\n\n-----\n\n### Fund Withdrawal\n\nOnce a victim has paid the ransom, the user is able to navigate to the ‘Withdrawal’ page.\nThis dashboard will present the user with their current balance (the 20% fee has been\nautomatically withheld) and number of payments made to them. From here, the user simply\ncreates a withdrawal to a specified BTC wallet and removes the funds.\n\n**_Figure 5 - Fund overview_**\n\n### Support\n\nThe Smaug developers claim to run a support service to assist with bugs and other issues.\nThey also claim to take feature requests, they will create them for a fee or incorporate them\nfor free if enough users request it.\n\n**_Figure 6 - Support service_**\n\n### Settings\n\nThe settings page is bare-boned and allows for users to change passwords.\n\n\n-----\n\n**_Figure 7 - Settings page_**\n\n## The Ransomware\n\nThe Smaug ransomware is written in Go (Golang). Anomali Threat Research has identified\nsamples targeting both Windows and Linux machines. The malware has a relative simple\ndesign implemented in about 300 lines of code. Its source code structure is shown in Figure\n8 below. The malware creates a unique key for each machine that is used to encrypt the\nfiles. The key is encrypted by the threat actor's RSA public key which means the machine\nkey can only be encrypted by a threat actor's private key. The ransomware is designed to\nrun completely offline without the requirement of a network connection.\n\n**_Figure 8 - Extracted source code structure from a malware sample._**\n\n\n-----\n\nGo binaries do not include a compilation timestamp. Consequently, it is difficult to gauge the\nage of a sample. The analyzed sample was compiled by version 1.14.2 of the official Go\ncompiler. This compiler was released on April 8, 2020 and was uploaded to a public\nmalware repository on May 31, 2020. At the time of it being uploaded to the public\nrepository, approximately 11% of the antivirus engines detected it as malicious. The earliest\nsample was uploaded on May 11, 2020 and was only detected by one antivirus engine,\nwhile the Linux sample was uploaded on May 19, 2020 and as of this writing date is not\ndetected by any engines.\n\n### Key Generation\n\nSmaug generates a unique encryption key for each infected machine. First, the malware\ngets a timestamp of the current time. The Unix time in nanoseconds of this timestamp is\nused to set the global seed for the “math/rand” package in the standard library for Go.[1]\nThis action has no effect on the randomness as the malware. after this action, generates a\n32 byte slice of randomness via the call to “crypt/rand.Read”.[2] This function on Windows\nuses the “CryptGenRandom” API to generate the random data. The random data is\nencrypted with the threat actor’s 2048 bit key using RSA Optimal Asymmetric Encryption\nPadding (OAEP).\n\n\n### File Encryption\n\nThe malware uses a pair of “goroutines“ for each disk partition for the encryption of files. A\ngoroutine is Go’s implementation of coroutines for concurrency. The first routine scans the\npartition for all files and compares the file extension against the list of extensions shown in\nFigure 9 below. If the file has an extension that is in the list, the file is added to a list of files\nto be encrypted.\n```\n*.3fr *.accdb *.aes *.ai *.ARC *.arw *.asc *.asf *.asm *.asp *.avi\n*.backup *.bak *.bat *.bay *.bmp *.brd *.c *.cdr *.cer *.cgm *.class *.cmd\n*.cpp *.cr2 *.crt *.crw *.csr *.CSV *.dbf *.dch *.dcr *.der *.dif *.dip\n*.djv *.djvu *.dng *.doc *.DOC *.docb *.docm *.docx *.dot *.DOT *.dotm\n*.dotx *.dwg *.dxf *.dxg *.eps *.erf *.fla *.flv *.frm *.gif *.go *.gpg\n*.gz *.h *.html *.hwp *.ibd *.indd *.jar *.java *.jpe *.jpeg *.jpegm *.jpg\n*.kdc *.key *.lay *.lay6 *.ldf *.max *.mdb *.mdf *.mef *.mid *.mkv *.mml\n*.mov *.mpeg *.mpg *.mrw *.ms11 *.MYD *.MYI *.nef *.NEF *.nrw *.odb *.odg\n*.odm *.odp *.ods *.odt *.orf *.otg *.otp *.ots *.ott *.p12 *.p7b *.p7c\n*.PAQ *.pas *.pdd *.pdf *.pef *.pem *.pfx *.php *.png *.pot *.potm *.potx\n*.ppam *.pps *.ppsm *.ppsx *.ppt *.PPT *.pptm *.pptx *.psd *.pst *.ptx *.py\n*.qcow2 *.r3d *.raf *.rar *.raw *.rb *.rtf *.RTF *.rw2 *.rwl *.sch *\n(Security copy) *.sldm *.sldx *.slk *.sql *.sqlite3 *.SQLITE3 *.sqlitedb\n*.SQLITEDB *.srf *.srw *.stc *.std *.sti *.stw *.svg *.swf *.sxc *.sxd\n*.sxi *.sxm *.sxw *.tar *.tar.bz2 *.tbk *.tgz *.tif *.tiff *.txt *.uop\n\n```\n\n-----\n\n```\n .uot .vbs .vdi .vmdk .vmx .vob .wav .wb2 .wks .wma .wmv .wpd\n*.wps *.xlc *.xlk *.xlm *.xls *.XLS *.xlsb *.xlsm *.xlsx *.xlt *.xltm\n*.xltx *.xlw *.xml *.zip\n\n```\n**_Figure 9 - List of file extensions the malware uses to determine if the file should be_**\n_encrypted or not._\n\nThe second routine encrypts all the files in the list identified by the other routine. Each file is\nencrypted with AES in CBC mode. Figure 10 below shows the setup of the encryption\nhandler for each file. A new AES cipher handler is constructed, an Initialization Vector (IV) is\ngenerated by reading 16 bytes from “crypt/rand”, before a CBC handler is created.\n\n\n-----\n\n**_Figure 10 - Screenshot of the routine creating the encryption handler. The files are_**\n_encrypted with AES in CBC mode. The last four instructions create a 4k buffer that is used_\n_to encrypt the file 4k bytes at the time._\n\n\n-----\n\nThe files are encrypted 4k bytes at a time. If the file is smaller or the read returns less than\n4k, the malware adds padding to the end of the file to make the total bytes a multiple of 16\nbytes as required by AES. The padding format used is PKCS#7. The encrypted blocks are\nwritten to a new file that has the original filename with an unique identifier added to the end\nof the filename. The original file is removed after the file has been encrypted.\n\nThe ransomware writes the ransom note in all the folders with encrypted files. In Figure 11\nbelow, the logic for writing the note is shown. In the analyzed sample, the ransom note’s\nname is “HACKED.txt”.\n\n**_Figure 11 - Logic for writing the ransom note to the disk._**\n\nThe ransom note is stored in the binary as a Base64 encoded string. Figure 12 shows the\ndecoded ransom note.\n```\nYour files have been encrypted using military grade encryption. They can\nnever be accessed again without buying a decryption key. You can buy the\ndecryption key at\nhttp://smaugrwmaystthfxp72tlmdbrzlwdp2pxtpvtzvhkv5ppg3difiwonad.onion. To\naccess the site you need Tor Browser.\n\n```\n**_Figure 12 - Base64 decoded ransom note stored in the analyzed sample._**\n\n## Analysis\n\nThe marked difference in quality of English between corinda’s contracting post and the\nSmaug offering would indicate two different authors. The original post was likely created by\nthe core individual(s) who were developing Smaug, whilst the Smaug offering post was\n\n\n-----\n\nlikely created by a fluent English-speaking contractor.\n\nThe spelling and grammar mistakes present in the initial post and the need for a fluent\nEnglish-speaking front end dev would indicate that this actor does not come from an\nEnglish-speaking country. Corinda specified that targeting Commonwealth of Independent\nStates (CIS) countires was forbidden and would result in a ban from the service. However,\nthis does not necessarily indicate that the actor’s location is in a CIS state as “Exploit.in” is\na Russian language cybercrime site that bans the targeting of CIS countries. It is worth\nnoting that on the Smaug Onion site a screenshot of a ransomware message is presented\n(Figure 13) with Mandarin characters predominantly displayed.\n\n**_Figure 13 - Mandarin characters visible on ransom note_**\n\n**Corinda’s offer of Smaug did not appear to gain much traction on the forum leading to a**\nfollow up discount of a 15-day trial to reputable forum members, likely to boost reputation.\nThe only subsequent activity on the thread was other users asking if anyone could vouch\nfor the legitimacy of the product. After ten days (5/14/20), a forum admin locked the thread\nand requested that corinda deposit $8,000 to the forum’s escrow account, this is a\ncommon practice to protect forum members from exit scams. Corinda did not comply and\nthe thread has remained inactive since, however, the contact details are still available for\nusers to purchase Smaug from corinda. Due to a lack of history, interactions and feedback,\nwe cannot corroborate corinda’s claim and rate it as unreliable.\n\nThe Smaug ransomware is relatively-simple compared to other active ransomware. For\nexample, it lacks the functionality of stopping running processes which are used by\nransomware to release file locks, allowing for encryption of locked files. It also does not\ndelete backups and shadow copy files on Windows. This flaw will make it possible to\n\n\n-----\n\nrecover the encrypted files from the shadow copy if the service is enabled. The simplicity of\nthe malware allows the author to target multiple operating systems from the same code\nbase. The Windows and Linux samples have been compiled from the same source code\nwith no modifications, except the shim-layers provided by Go’s standard library.\n\n## Conclusion\n\nSmaug is a RaaS that makes it easy for threat actors to use ransomware to achieve\nobjectives. The ransomware can run on all the three major operating systems that opens up\nthe potential for broader targeting. The actual ransomware is relatively simple compared to\ncommon ransomware currently being used by other threat actors. The malware’s only\nfunctionality is the encryption of files. Threatstream Enterprise users can find Indicators of\nCompromise (IOCs), signature, and more information about this threat here.\n\n## How Anomali Helps\n\nAnomali Threat Research provides actionable threat intelligence that helps customers,\npartners, and the security community to detect and mitigate the most serious threats to their\norganizations. The team frequently publishes threat research in the form of white papers,\nblogs, and bulletins that are made available to the security community, general public, and\nnews organizations. Intelligence and bulletins about threat actors and related Indicators of\nCompromise (IOCs) are integrated directly into Anomali customers’ security infrastructures\nto enable faster and more automated detection, blocking, and response. For more\ninformation on how Anomali customers gain integrated access to threat research, visit:\n[https://www.anomali.com/products.](https://www.anomali.com/products)\n\n## Mitre ATT&CK\n\nT1486 - Data Encrypted for Impact\n\n## Endnotes\n\n1. “rand package · pkg.go.dev”, accessed July 7, 2020, https://pkg.go.dev/math/rand?\n\ntab=doc#Seed\n2. “rand package · pkg.go.dev”, accessed July 7, 2020, https://pkg.go.dev/crypto/rand?\n\ntab=doc#Read\n\n\n-----\n\nTopics: Research\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-10 - Anomali Threat Research Releases First Public Analysis of Smaug Ransomware as a Service.pdf"
    ],
    "report_names": [
        "2020-08-10 - Anomali Threat Research Releases First Public Analysis of Smaug Ransomware as a Service.pdf"
    ],
    "threat_actors": [
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535980,
    "ts_updated_at": 1743041154,
    "ts_creation_date": 1653709762,
    "ts_modification_date": 1653709762,
    "files": {
        "pdf": "https://archive.orkl.eu/3b75b369c53e4328474b1d5d1ac70afc531be12d.pdf",
        "text": "https://archive.orkl.eu/3b75b369c53e4328474b1d5d1ac70afc531be12d.txt",
        "img": "https://archive.orkl.eu/3b75b369c53e4328474b1d5d1ac70afc531be12d.jpg"
    }
}