{
    "id": "8cce368b-afc8-4f2f-b9aa-24e2c4fc16b7",
    "created_at": "2023-01-12T15:04:30.222606Z",
    "updated_at": "2025-03-27T02:09:18.168008Z",
    "deleted_at": null,
    "sha1_hash": "1a600e599c6e71b1f372516d7184c915e65045b9",
    "title": "2021-10-04 - Atom Silo ransomware actors use Confluence exploit, DLL side-load for stealthy attack",
    "authors": "",
    "file_creation_date": "2022-05-28T01:22:56Z",
    "file_modification_date": "2022-05-28T01:22:56Z",
    "file_size": 432218,
    "plain_text": "# Atom Silo ransomware actors use Confluence exploit, DLL side-load for stealthy attack\n\n**news.sophos.com/en-us/2021/10/04/atom-silo-ransomware-actors-use-confluence-exploit-dll-side-load-for-stealthy-**\nattack/\n\nOctober 4, 2021\n\nSophos’ MTR Rapid Response team recently investigated a ransomware attack by a recently\nemerged threat actor group called Atom Silo. The sophisticated attack, which took place over\ntwo days, was made possible by an earlier initial access leveraging a recently revealed\nvulnerability in Atlassian’s Confluence collaboration software.\n\n[While the ransomware itself is virtually identical to LockFile, the intrusion that made the](https://news.sophos.com/en-us/2021/08/27/lockfile-ransomwares-box-of-tricks-intermittent-encryption-and-evasion/)\nransomware attack possible made use of several novel techniques that made it extremely\ndifficult to investigate, including the side-loading of malicious dynamic-link libraries tailored to\ndisrupt endpoint protection software.\n\nThe incident offers evidence of how dangerous publicly disclosed security vulnerabilities in\nInternet-facing software packages can be when left unpatched even for a relatively short\nperiod. Concurrent with the ransomware attack, Sophos responders found that the\nConfluence vulnerability had also been exploited by a crypto miner.\n\nThe investigation by the Rapid Response team offered us an opportunity to perform the first\nin-depth look at the tools, techniques and practices of the Atom Silo group. The actors\ndeploying the ransomware used well-worn techniques in new ways, and made significant\nefforts to evade detection prior to launching the ransomware.\n\n## Compromise and lateral movement\n\n\n-----\n\nThe first stage of the intrusion took place on September 13, 11 days before the ransomware\nattack unfolded. The intruder (either the Atom Silo actors themselves, an affiliate or an initial\naccess broker) gained initial access through a Confluence server via an Object-Graph\nNavigation Language (OGNL) injection attack. This code injection on the Confluence server\nprovided a backdoor, via which the attacker was able to drop and execute files for another,\nstealthy backdoor.\n\nThe payload dropped for the second backdoor consisted of three files. One of them was a\nlegitimate, signed executable from a third-party software provider that is vulnerable to an\nunsigned DLL sideload attack.\n\n[Update, May 2, 2022: We disclosed this vulnerability to McAfee in October 2021; after\nacknowledging the submission, we received no further information from McAfee. The\nexecutable, named mfeann.exe (SHA256:\n07bbd8a80b5377723b13dbb40a01ca44cbc203369f5e5652a25b448e27ca108c) is a\ncomponent of McAfee VirusScan Enterprise responsible for scan event creation and logging.\nThe file was previously reported to VirusTotal by other parties as being connected to\nmalware detections dating back as far as 2017.]\n\nThe malicious DLL spoofs a library required by the executable and is placed in the same\nfolder on the targeted server as the vulnerable .exe. This attack technique, known as DLL\n[search order hijacking (ATT&CK T1574.001), is a well-worn technique recently observed in](https://attack.mitre.org/techniques/T1574/001/)\nLockFile ransomware attacks leveraging the ProxyShell vulnerability.\n\nThe DLL’s main role is decrypting and loading the backdoor from the third file, mfc.ini. The\nloaded code then connects to one of several stored hostnames (in this case,\nupdate.ajaxrenew[.]com) over TCP/IP port 80. The code appears similar to that of a Cobalt\nStrike Beacon. Once loaded, the backdoor allowed for remote execution of Windows shell\ncommands through the Windows Management Interface (WMI), in the style of SecureAuth\nCorp.’s WMIexec penetration testing tool.\n\nFrom this point, the intruder began lateral movement. Within five hours, they had\ncompromised several additional servers. Using a single compromised administrative\naccount, the attackers copied and executed the backdoor binaries using WMI.\n\nAt least some of the work was done using a self-deleting Windows batch file named\n**howtorun.bat. The backdoor files were copied and launched on each additional server; in at**\nleast one case, the backdoor was then installed on the targeted servers as a service named\n“WindowsUpdate,” executed using the vulnerable legitimate executable, to provide\npersistence. But otherwise, backdoors were executed directly from WMI.\n\nOn the third day of the intrusion, via a batch file named logs.bat, the intruder did some\nadditional discovery, fetching information from the security logs to check for user logons and\nlogoffs, account lockouts, the assignment of special privileges to a logon, and use of\n\n\n-----\n\nsensitive privileges. They also collected more information about the local network,\ncompressing it into a zipped file for exfiltration.\n\nDuring this time, the unrelated coin miner malware was implanted by another actor using the\nConfluence vulnerability.\n\n## Exfiltration and effect\n\nOn September 24, the ransomware actors began their own discovery and exfiltration efforts,\nchecking the local volumes attached to an important server and then checking its history of\nRemote Desktop sessions. Using RDP, the ransomware gang then went hands-on-keyboard,\ndropping and executing the RClone utility to copy data off the server to a Dropbox account\nfrom several directories. The process was repeated on another server.\n\nSoon after the exfiltration was complete, the intruders connected to the domain controller\nand dropped their all-in-one attack executable. There were two variants of the attack\nexecutable used in the attack; both executables carry the following files packed as\nresources:\n\nautoupdate.exe (the ransomware, detected as Troj/Ransom-GKL).\n[autologin.exe, a Kernel Driver Utility hacktool (detected by Sophos as ATK/KDUtil-A).](https://github.com/hfiref0x/KDU)\nautologin.sys, a driver targeting Sophos services, including the file scanning service\n(now detected as Troj/KillAV-IT).\ndrv64.dll, a Kernel Driver Utility hacktool database (detected by Sophos as ATK/KDUtilA), previously reported as part of a LockFile ransomware attack using the PetitPotam\nexploit.\n\nThe attackers used autologin.exe to “map” the autologin.sys driver to the kernel, using the\ndatabase of vulnerable drivers to find an available exploit. Once loaded, autologin.sys was\nable to bypass protections against shutting down endpoint protection services.\n\nThe attack executables performed a search for all the domain controllers on a network. They\nthen push the four payload files to the \\netlogon folder of each domain server, and create a\nbatch file (autologin.bat or autologin1.bat, in this case). The main difference between the two\nis how that batch file is deployed — the first used in the attack (named FuckGPO.exe in this\ncase) created a scheduled task XML file to carry out the attack, while the second (2.exe)\ncreates a service that establishes persistence. The first version is executed on the domain\ncontroller; the second is launched as a service called “Update” on all domain-connected\nsystems via a Global Policy Object.\n\nThe batch file executed the kernel driver to disrupt endopoint protection, and then launched\nthe ransomware.While the attack file triggered alerts when dropped on the domain server,\nthe ransomware actors used the kernel hacktool to disable Sophos’ file scanning service.\nThis generated an alert as well, but further detection and quarantining of files was disabled.\n\n\n-----\n\nIntercept X s CryptoGuard detected the ransomware, but the attackers then subsequently\nused the secondary attack executable, dropped into the Desktop folder, to disrupt the\nprotection and again launch the ransomware with an updated GPO.\n\nThe ransomware executable itself connected to a remote URL\n(hxxp://139[.]180[.]184[.]147:45532/fake.php), and started encrypting files in a similar fashion\nto LockFile, adding a .ATOMSILO extension to encrypted files. The ransomware dropped a\nransom note formatted in HTML, with instructions on how to contact Atom Silo’s operators.\n\nThe Atom Silo ransom note.\n\n\n-----\n\nThe Atom Silo “blog.” The group has “rules” similar to DarkSide and BlackMatter.\nAll communications with the operators are over email through an account on atomsilo.com.\nThat domain is registered through NameSilo LLC; the mail server is hosted in Hong Kong by\nthe hosting provider Dataplugs.\n\n## The patch pacing problem\n\nThe initial point of compromise in this attack was a vulnerability that was only public for about\nthree weeks at the time. For many organizations, keeping up with the pace of patching can\nbe a challenge in the best of times—and the effects of lock-down and other recent stressors\naffecting staff availability are only making keeping up with patches more difficult.\n\nRansomware operators and other malware developers are becoming very adept at taking\nadvantage of these gaps, jumping on published proof of concept exploits for newly-revealed\nvulnerabilities and weaponizing them rapidly to profit off them—as demonstrated by the\nevidence of two separate threat actors finding and exploiting the vulnerable Confluence\nserver involved in this incident. If the ransomware attack had not been discovered, the\ncryptocurrency miner on the server may have gone undiscovered.\n\nTo reduce the threat, organizations need to both ensure that they have robust ransomware\nand malware protection in place, and are vigilant about emerging vulnerabilities on Internetfacing software products they operate on their networks. Shifting some products to vendor\n\n-----\n\nhosted software-as-a-service may mitigate some of these risks, as vendors typically patch\nvulnerabilities in their own deployments of software faster than they can be deployed by onpremises customers, but this is not a panacea.\n\nAdditionally, abuse of legitimate but vulnerable software components through DLL sideloading and other methods has long been a technique used by attackers with a wide range of\ncapabilities, and it has filtered down to the affiliates of ransomware operators and other\ncybercriminals. While abuse of some of these legitimate, signed components is well-enough\nknown to defend against, the supply of alternative vulnerable executables is likely deep.\nSpotting legitimate executables that exist outside of the context of the products they are\nsupposed to be part of requires vigilance—and vulnerability disclosure by the vendors they\ncome from.\n\nUnder these conditions, organizations’ best defenses include full deployment of malware\nprotection on servers and endpoint devices, and that products are monitored to catch attacks\nthat trigger detections or alerts before an attacker with administrative access can defeat\nprotections. (Sophos products, including Intercept X, provide a number of protections against\nthese types of attacks.) Organizations are also encouraged to have effective data backup\npractices and business continuity plans, regardless of their size, to ensure that they can\nsurvive attacks that leverage rapidly exploited vulnerabilities such as those revealed in\nConfluence and Microsoft Exchange this year.\n\n[A list of indicators of compromise for this attack is available on the SophosLabs Github page.](https://github.com/sophoslabs/IoCs/blob/master/ransomware_atomsilo.csv)\n\n## SophosLabs would like to acknowledge Bill Kearny of Sophos MTR’s Rapid Response team, and\n\nKrisztián Diriczi, Kajal Katiyar, Chaitanya Ghorpade and Rahil Shah of SophosLabs for their\ncontributions to this report.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-04 - Atom Silo ransomware actors use Confluence exploit, DLL side-load for stealthy attack.pdf"
    ],
    "report_names": [
        "2021-10-04 - Atom Silo ransomware actors use Confluence exploit, DLL side-load for stealthy attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535870,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653700976,
    "ts_modification_date": 1653700976,
    "files": {
        "pdf": "https://archive.orkl.eu/1a600e599c6e71b1f372516d7184c915e65045b9.pdf",
        "text": "https://archive.orkl.eu/1a600e599c6e71b1f372516d7184c915e65045b9.txt",
        "img": "https://archive.orkl.eu/1a600e599c6e71b1f372516d7184c915e65045b9.jpg"
    }
}