{
    "id": "8cd7915a-81df-4f0e-b7ab-54bf68ef34da",
    "created_at": "2023-01-12T15:04:11.729632Z",
    "updated_at": "2025-03-27T02:08:41.201567Z",
    "deleted_at": null,
    "sha1_hash": "e902ef9722f40bf32f7b4e2cb0b9ee6a48bd90fe",
    "title": "2018-02-02 - Break Out Of The Tinynuke Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T17:31:01Z",
    "file_modification_date": "2022-05-28T17:31:01Z",
    "file_size": 2726044,
    "plain_text": "# Break Out Of The Tinynuke Malware\n\n**bitsighttech.com/blog/break-out-of-the-tinynuke-botnet**\n\nWritten by Tiago Pereira February 02, 2018 Share Facebook Twitter LinkedIn\n\n[BitSight](https://www.bitsighttech.com/blogs?field_topics_target_id=86)\n\n**New Tinynuke variant with a DGA in the wild**\n\n## Summary\n\nTinynuke, or Nukebot malware, is a trojan able to perform man in the browser attacks against\nmodern web browsers and equipped with the most common features needed by a bank\ntrojan (e.g. Webinjects, Socks proxy, VNC, Remote command execution). This malware was\nin the spotlight in 2017 after the complete bot source code was leaked in March by someone\nclaiming to be the author of the malware.\n\nThe leaked source contained a fully working bot, builder and botnet control panel and, as we\nhave seen in past, leaks of working malware usually lead to that malware being used\nincreasingly and new variants and adaptations of it start to emerge.\n\nWe at Bitsight constantly monitor the internet for new threats that may affect the security of\norganizations worldwide. A few months ago we first noticed an unknown DGA showing up in\nour network traffic analysis system that we could not identify. After some research we\nmanaged to identify the malware behind it, and found a malware operation targeting users in\n\n\n-----\n\nthe United Kingdom and Canada using a new variant of Tinynuke with some improvements,\nsuch as the use of a DGA (Domain Generation Algorithm) for it’s command and control\nchannel or asymmetric cryptography for C2 authentication.\n\n## Malware distribution\n\nThe malware is being distributed through fake websites (fake product website or fake blogs)\npromoted through social networking and advertising, that contain links to malicious software\ninstallers.\n\nThe following is an example of one of these websites being used to distribute a trojanized pdf\nreader software installer.\n\nAnother interesting example is a fake cryptocurrency security advice blog that was set-up to\nmake available a set of fake installers of known tools that can be used to make a PC more\nsecure. This fake blog was reported to be promoted through facebook advertising by a user\nwho found it suspicious. He wrote about it on his blog (see references). The following image\nshows this website:\n\n\n-----\n\nThe software installers contain both the trojan and a legitimate software installer and are, in\nmost cases, digitally signed by a company called “AGM 1980 Limited” with a valid certificate\nsigned by Comodo CA.\n\nOnce the user executes the fake installer:\n\nRequests administrative privileges to continue with the installation;\nPerforms several checks to verify if it is running on a sandboxed environment (e.g.\nnumber of CPU’s, Installed RAM, Virtualization software);\nIf the installer is running on a sandbox it proceeds with the legitimate tool installer and\ndoes not install the malware;\nIf the installer is not on a sandbox it installs the malware and then proceeds with the\nlegitimate installer;\n\nAfter the trojan is installed and running, the user’s system is compromised and it’s data at\nrisk.\n\n## Affected countries\n\nIn order to gather some data about the geographies targeted by the malware we have\nsinkholed it’s DGA domains and observed that there are currently at least 2 different botnets,\neach using a different TLD on the DGA and each targeting users in a specific country. In\nparticular, one botnet seems to be targeting users in Canada and other users in the United\nKingdom.\n\n\n-----\n\n## Webinjects and targets\n\nLooking at the webinject configuration we found that besides a few test injects there were\nalso specific injects for two targets. Amazon and Lloyds bank, as shown in the following\nexcerpt (the full webinjects are listed in the IOC’s section):\n\n\n-----\n\nThese injects include additional javascript from domains that were registered using the same\nemail address that was used to register the hardcoded domains and the active DGA\ndomains, indicating that these are possibly being developed by the same person or group.\n\nIt is also worth noting that besides these two webinjects, the normal bot behaviour is to\ncollect HTTP POST request data on IE, Firefox and Chrome for all hosts not listed in the\nfg_blacklist object in the config. The following blacklist was found active:\n\n## Malware variant\n\nThe malware is mostly the same as the TinyNuke bot that was leaked. However, there are\nsome new features, of which the following are the most relevant:\n\n**DGA**\nPerhaps the most interesting modification is the introduction of a DGA. This DGA increases\nthe resiliency of the botnet against takedown requests and is triggered when the hardcoded\nC2 is unreachable.\n\nIts implementation is very simple, it consists of the md5 of a number concatenated with the\ncurrent day. The following is an example implementation of the DGA in python:\n\n\n-----\n\n**C2 authentication using public RSA key**\nThe bot uses asymmetric cryptography to authenticate the C2, as a measure to prevent\nbotnet takeover. To do this, the malware:\n\nGenerates a random 8 byte long string and calculates it’s md5 value;\nEncrypts this value using the C2 RSA Public key that is hard coded on the bot;\nChecks if the md5 of the send value is present in the response to the ping command;\nIf it is, the malware stores this C2 as the active C2 in a global variable and\ncommunicates with it directly on further interactions;\n\nThe following public key was found in use:\n\n\n-----\n\n**C2 Proxy layer**\nThe bot has been modified to support what appears to be a proxy layer between the C2 and\nthe infected bots. The HTTP requests now have the following format:\n\n**Sandbox/malware analysis detection**\nThe new version includes a few self protection features not present in the leaked source.\nThese are the same that exist in the fake software installers used to drop the malware:\n\nCheck for sandbox related usernames by looking for the strings:\n\nCheck physical memory on the device is higher than 1Gb;\nCheck if the system has more than one CPU;\nCheck if the Sleep command is being bypassed by calling Sleep and checking if the\nprocess actually sleeps;\nCheck for VMWare tools registry keys;\nCheck for VirtualBox guest additions files;\nCheck if the user is connected through remote desktop;\n\n## Conclusion\n\nThis is an interesting evolution on the TinyNuke malware family and we will continue to\nmonitor this threat as it progresses.\n\n## References\n\n[https://securingtomorrow.mcafee.com/business/tinynuke-may-ticking-time-bomb/](https://securingtomorrow.mcafee.com/business/tinynuke-may-ticking-time-bomb/)\nhttps://securelist.com/the-nukebot-banking-trojan-from-rough-drafts-to-realthreats/78957/\nhttps://krebsonsecurity.com/2017/04/self-proclaimed-nuclear-bot-author-weighs-u-sjob-offer/\nhttps://securityintelligence.com/the-nukebot-trojan-a-bruised-ego-and-a-surprisingsource-code-leak/\n\n\n-----\n\nhttps://rootvideochannel.blogspot.pt/2017/12/suspicious-websitecryptocurrencysecuri.html\n\n## IOC\n\ne2a3bf38387c751bcb971f0234a7a89f74f2b7c807bf6503b4b58fcfbaafa1d6\n\n## Get the Weekly Cybersecurity Newsletter\n\nSubscribe to get security news and industry ratings updates in your inbox.\n\nRead more\nBy checking this box, I consent to sharing this information with BitSight Technologies,\nInc. to receive email and phone communications for sales and marketing purposes as\n[described in our privacy policy. I understand I may unsubscribe at any time.](https://www.bitsight.com/privacy-policy)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-02-02 - Break Out Of The Tinynuke Malware.pdf"
    ],
    "report_names": [
        "2018-02-02 - Break Out Of The Tinynuke Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535851,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653759061,
    "ts_modification_date": 1653759061,
    "files": {
        "pdf": "https://archive.orkl.eu/e902ef9722f40bf32f7b4e2cb0b9ee6a48bd90fe.pdf",
        "text": "https://archive.orkl.eu/e902ef9722f40bf32f7b4e2cb0b9ee6a48bd90fe.txt",
        "img": "https://archive.orkl.eu/e902ef9722f40bf32f7b4e2cb0b9ee6a48bd90fe.jpg"
    }
}