{
    "id": "8cecf7ba-4eec-4f9f-a4ae-be29f8ec465b",
    "created_at": "2023-01-12T15:10:56.861047Z",
    "updated_at": "2025-03-27T02:10:07.499674Z",
    "deleted_at": null,
    "sha1_hash": "3f8941d4b8be7c6ec70f7d86fc7bbb1745af82f2",
    "title": "2015-07-05 - Spy Tech Company 'Hacking Team' Gets Hacked",
    "authors": "",
    "file_creation_date": "2022-05-28T00:46:19Z",
    "file_modification_date": "2022-05-28T00:46:19Z",
    "file_size": 286818,
    "plain_text": "# Spy Tech Company 'Hacking Team' Gets Hacked\n\n**[vice.com/en_us/article/gvye3m/spy-tech-company-hacking-team-gets-hacked](https://www.vice.com/en_us/article/gvye3m/spy-tech-company-hacking-team-gets-hacked)**\n\nSometimes even the cops get robbed.\n\nThe controversial Italian surveillance company Hacking Team, which sells spyware to\ngovernments all around the world, including agencies in Ethiopia, Morocco, the United Arab\nEmirates, as well as the US [Drug Enforcement Administration, appears to have been](http://motherboard.vice.com/read/the-dea-has-been-secretly-buying-hacking-tools-from-an-italian-company)\nseriously hacked.\n\nHackers have made 500 GB of client files, contracts, financial documents, and internal\nemails, some as recent as 2015, publicly available for download.\n\nHacking Team's spokesperson Eric Rabe did not immediately respond to Motherboard's calls\nand email asking for verification that the hacked information is legitimate. Without\nconfirmation from the company itself, it's difficult to know what percentage of the files are real\n—however, based on the sheer size of the breach and the information in the files, the hack\nappears to be authentic.\n\nWhat's more, the unknown hackers announced their feat through Hacking Team's own\nTwitter account.\n\n\n-----\n\nThe hackers composed the tweets as if they were written by Hacking Team. \"Since we have\nnothing to hide, we're publishing all our e-mails, files, and source code,\" the hackers wrote in\na tweet, which included the link to around 500 Gb of files.\n\nThe hackers also started tweeting a few samples of internal emails from the company. One\nof the screenshots shows an email dated 2014 from Hacking Team's founder and CEO David\nVincenzetti to another employee. In the email, titled \"Yet another Citizen Lab attack,\"\nVincenzetti links to a report from the online digital rights research center Citizen Lab, at the\n[University of Toronto's Munk School of Global Affairs, which has exposed numerous](http://www.slate.com/blogs/future_tense/2012/08/20/moroccan_website_mamfakinch_targeted_by_government_grade_spyware_from_hacking_team_.html) [cases of](http://motherboard.vice.com/read/ethiopia-allegedly-used-spyware-against-us-based-journalists-again)\nabuse from Hacking Team's clients.\n\n[Hacking Team has never revealed a list of its clients, and has always and repeatedly denied](http://t.co/qEW59NdYuy)\nselling to sketchy governments, arguing that it has an internal procedure to address human\nrights concerns about prospective customers.\n\nThe email about Citizen Lab is filed in a folder called \"Anti HT activists.\" Claudio Guarnieri, a\nsecurity researcher who has investigated Hacking Team along with others at the Citizen Lab,\nwas quick to point this out.\n\nInteresting, we fall under the\n\n[ClaudioJuly 6, 2015](https://twitter.com/botherder/statuses/617871283972390912)\n\nIt's unclear exactly how much the hackers got their hands on, but judging from the size of the\nfiles, it's certainly a large collection of internal files. A source who asked to speak\nanonymously due to the sensitivity of the issue, told me that based on the file names and\nfolders in the leak, the hackers who hit Hacking Team \"got everything.\"\n\n[A few hours after the initial hack, a list of alleged Hacking Team customers was posted on](http://pastebin.com/MP8zpQ26)\nPastebin. The list includes past and current customers. Among the most notable, there are a\nfew that were previously unknown, such as the FBI, Chile, Australia, Spain, and Iraq, among\n\n\n-----\n\nothers.\n\nWe reached out to the hackers via direct message on Twitter, asking if they could comment.\nTheir initial response, \"sure, we got such good publicity from your last story!\" referred to\n[Motherboard's report from April, which revealed that the DEA had secretly purchased](http://motherboard.vice.com/read/the-dea-has-been-secretly-buying-hacking-tools-from-an-italian-company)\nHacking Team's software for $2.4 million.\n\nThe hacker, or hackers, however, declined to comment for now.\n\nMany security researchers and human rights activists reacted to the hack with sarcasm.\n\nBest Transparency Report Ever, [Christopher SoghoianJuly 6, 2015](https://www.vice.com/p)\n\n[Looks like Kenn WhiteJuly 6, 2015](https://www.vice.com/p)\n\nWe also reached out to Vincenzetti, asking for his comments and reactions, and will update\nwhen and if we hear back. (In the past, Vincenzetti [wrote on a mailing list that \"[Motherboard]](http://motherboard.vice.com/read/hacking-team-founder-hey-fbi-we-can-help-you-crack-the-dark-web)\nnever reports on Hacking Team without smug editorial comment,\" so we're not holding out\nour breath.)\n\nThe breach on Hacking Team comes almost a year after another surveillance tech company,\nthe competing FinFisher, was [hacked in a similar way, with a hacker leaking 40 Gb of internal](http://motherboard.vice.com/read/a-hacker-claims-to-have-leaked-40gb-of-docs-on-government-spy-tool-finfisher)\nfiles.\n\nFinFisher, like Hacking Team, sells surveillance software to law enforcement agencies\nacross the world. Their software, once surreptitiously installed on a target's cell phone or\ncomputer, can be used to monitor the target's communications, such as phone calls, text\nmessages, Skype calls, or emails. Operators can also turn on the target's webcam and\nexfiltrate files from the infected device.\n\nIn one alleged internal email leaked today, Hacking Team's Vincenzetti gloated over\nFinFisher's hack, writing that \"a wannabe competitor of ours has been severely hacked.\"\n\nIt seems that Hacking Team has suffered the same fate.\n\n_This story has been updated to include information about the list of Hacking Team_\n_customers, and to add a comment from a source on the extent of the damage._\n\n## ORIGINAL REPORTING ON EVERYTHING THAT MATTERS IN YOUR INBOX.\n\nBy signing up, you agree to the [Terms of Use and](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/terms-of-use.html) [Privacy Policy & to receive electronic](https://vice-web-statics-cdn.vice.com/privacy-policy/en_us/page/privacy-policy.html)\ncommunications from Vice Media Group, which may include marketing promotions,\nadvertisements and sponsored content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-07-05 - Spy Tech Company 'Hacking Team' Gets Hacked.pdf"
    ],
    "report_names": [
        "2015-07-05 - Spy Tech Company 'Hacking Team' Gets Hacked.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536256,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1653698779,
    "ts_modification_date": 1653698779,
    "files": {
        "pdf": "https://archive.orkl.eu/3f8941d4b8be7c6ec70f7d86fc7bbb1745af82f2.pdf",
        "text": "https://archive.orkl.eu/3f8941d4b8be7c6ec70f7d86fc7bbb1745af82f2.txt",
        "img": "https://archive.orkl.eu/3f8941d4b8be7c6ec70f7d86fc7bbb1745af82f2.jpg"
    }
}