{
    "id": "8cf31851-ebb3-4479-b5a8-9804ef8f9baa",
    "created_at": "2022-10-25T16:48:23.490636Z",
    "updated_at": "2025-03-27T02:17:27.725293Z",
    "deleted_at": null,
    "sha1_hash": "4f9469a732dd8c2d32c8a2b017e9378e95e40611",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-12-19T15:39:24Z",
    "file_modification_date": "2018-01-02T10:18:00Z",
    "file_size": 770832,
    "plain_text": "-----\n\n-----\n\n© 2018 Carnegie Endowment for International Peace. All rights reserved.\n\nCarnegie does not take institutional positions on public policy issues; the views represented herein\nare the authors’ own and do not necessarily reflect the views of Carnegie, its staff, or its trustees.\n\nNo part of this publication may be reproduced or transmitted in any form or by any means without\npermission in writing from the Carnegie Endowment. Please direct inquiries to:\n\nCarnegie Endowment for International Peace\nPublications Department\n1779 Massachusetts Avenue NW\nWashington, DC 20036\nP: +1 202 483 7600\nF: +1 202 483 1840\nCarnegieEndowment.org\n\nThis publication can be downloaded at no cost at CarnegieEndowment.org/pubs.\n\n\n-----\n\n# CONTENTS\n\nABOUT THE AUTHORS........................................................................................ v\n\nACKNOWLEDGMENTS....................................................................................... vii\n\nTIMELINE.............................................................................................................. ix\n\nSUMMARY..............................................................................................................1\n\nINTRODUCTION............................................................................................................................. 5\n\n**CHAPTER ONE**\nIRAN: TARGET AND PERPETRATOR...................................................................................9\n\n**CHAPTER TWO**\nIRAN’S CYBER ECOSYSTEM: WHO ARE THE THREAT ACTORS?...................17\n\n**CHAPTER THREE**\nIRAN’S EXTERNAL TARGETS.............................................................................29\n\n**CHAPTER FOUR**\nIRAN’S INTERNAL TARGETS..............................................................................39\n\n\n-----\n\nCONCLUSIONS AND PRESCRIPTIONS.............................................................49\n\nGLOSSARY........................................................................................................... 57\n\nNOTES..................................................................................................................59\n\nCARNEGIE ENDOWMENT FOR INTERNATIONAL PEACE..............................72\n\n\n-----\n\n# ABOUT THE AUTHORS\n\n**COLLIN ANDERSON is a Washington, DC–based researcher focused on cybersecu-**\nrity and internet regulation, with an emphasis on countries that restrict the free flow of\ninformation. Beginning in January 2018, he will be a fellow in the TechCongress Congressional Innovation Fellowship program. Prior to this fellowship, Anderson’s involvements have included working as a researcher at Measurement Lab, producing numerous publications on privacy and security, and advising several organizations focused on\nhuman rights and Iran.\n\n**KARIM SADJADPOUR is a senior fellow at the Carnegie Endowment for Interna-**\ntional Peace, where he focuses on Iran and U.S. foreign policy toward the Middle East.\nHe is also an adjunct professor at Georgetown University’s School of Foreign Service,\nteaching a class on U.S. foreign policy and the Middle East.\n\n\n-----\n\n-----\n\n# ACKNOWLEDGMENTS\n\nThe authors would like to primarily thank Claudio Guarnieri, who was responsible for a\nsignificant amount of the technical analysis that informs this report.\n\nParts of this research were made possible based on the generous access to data provided\nby DomainTools. Similarly, this work was supported by dozens of organizations and\nindividuals in the Iranian human rights community who provided cases and context, including but not limited to Amir Rashidi, Nariman Gharib, Nima Fatemi, Simin Kargar,\nand Farnoosh Hashemian.\n\nIn addition, Tim Maurer, Michele Dunne, Eli Levite, George Perkovich, Jen Psaki, and\nMayss al-Alami at the Carnegie Endowment for International Peace, as well as former\nintern E. Scott Goldstein, provided very helpful feedback on drafts of the report.\n\nLastly, over the course of this research, we have had the fortune of meeting members of\nthe cybersecurity and information technology communities that have acted as advisers\nand provided their expertise. It is immensely gratifying to know that behind the scenes\nof important communications platforms and security companies, there are people who\nhold such concern for the well-being of others in distant countries. These experiences\nhave lent reassurance that the internet might continue to provide opportunities to at-risk\npopulations against threats to their safety and liberty.\n\n\n-----\n\n-----\n\n# TIMELINE\n\n**JANUARY 1992**\nIran first connects to the internet.\n\n**2000**\nInternet access becomes increasingly common, with hundreds of thousands of Iranians\ngoing online on a regular basis.\n\n**2001**\nThe Supreme Council of the Cultural Revolution issues rules on internet access, including\nmandatory filtering and surveillance of sites considered politically, culturally, and\nreligiously subversive.\n\n**FEBRUARY 2002**\nThe hacking forum Ashiyane is created, serving as a catalyst for Iran’s hacking community\nand later implicated in facilitating the Iranian government’s repression of dissidents.\n\n**APRIL 2003**\nSina Motalebi is arrested, one of the first bloggers in the world arrested for their online\nwritings, commencing a crackdown on internet expression.\n\n\n-----\n\n**JUNE 2005**\nHardliner Mahmoud Ahmadinejad is elected president of Iran, marking a new era of\ndomestic repression and international hostility.\n\n**2007**\nIranian threat actors begin to develop tools and conduct campaigns.\n\n**JUNE 2009**\nThe contested reelection of Mahmoud Ahmadinejad provokes Iran’s largest popular\nuprising since 1979, known as the Green Movement.\n\n**DECEMBER 2009**\nThe Iranian Cyber Army defaces Twitter—taking it offline for several hours—in response\nto the Green Movement.\n\n**SEPTEMBER 2011**\nAn Iranian hacker breaches Dutch security firm DigiNotar, allowing the Iranian\ngovernment to spy on Gmail users in Iran. This remains one of the largest security\nbreaches in the history of the internet.\n\n**APRIL 2012**\nIranian oil infrastructure is targeted by sabotage malware agents Flame and Wiper.\n\n**JUNE 2012**\n_New York Times reporter David Sanger makes public the details of Operation Olympic_\nGames. One of the most sophisticated cyber attacks in history, the operation was begun by\nthe United States and Israel in 2007 to covertly sabotage Iran’s nuclear infrastructure.\n\n**JULY 2012**\nThe Madi malware agent, the first Iranian-attributed espionage cyber campaign,\nis disclosed.\n\n**AUGUST 2012**\nSaudi Aramco, the world’s largest oil company, has data destroyed by the malware\nagent Shamoon.\n\n\n-----\n\n**SEPTEMBER 2012**\nThe first denial-of-service attacks against U.S. banks in what is known as\nOperation Ababil.\n\n**JUNE 2013**\nPragmatic cleric Hassan Rouhani is elected president of Iran, with the promise of\nimproving Iran’s economy by resolving the nuclear standoff.\n\n**NOVEMBER 2013**\nAnnouncement of nuclear negotiations between the United States, China, Russia, UK,\nFrance, and Germany and Iran, resulting in an interim agreement.\n\n**JULY 2015**\nThe nuclear deal is finalized, known as the Joint Comprehensive Plan of Action.\n\n**NOVEMBER 2016–JANUARY 2017**\nCyber attacks against Saudi Arabia are renewed in Shamoon 2.\n\n\n-----\n\n-----\n\n# SUMMARY\n\nIncidents involving Iran have been among the most sophisticated, costly, and consequential attacks in the history of the internet. The four-decade-long U.S.-Iran cold war has\nincreasingly moved into cyberspace, and Tehran has been among the leading targets of\nuniquely invasive and destructive cyber operations by the United States and its allies. At\nthe same time, Tehran has become increasingly adept at conducting cyber espionage and\ndisruptive attacks against opponents at home and abroad, ranging from Iranian civil society organizations to governmental and commercial institutions in Israel, Saudi Arabia,\nand the United States.\n\n## IRAN’S CYBER THREAT ENVIRONMENT\n\n- Offensive cyber operations have become a core tool of Iranian statecraft, providing\nTehran less risky opportunities to gather information and retaliate against perceived\nenemies at home and abroad.\n\n- Just as Iran uses proxies to project its regional power, Tehran often masks its cyber\noperations using proxies to maintain plausible deniability. Yet there are clear indications that such operations are conducted by Iranians and frequently can be linked\nto the country’s security apparatus, namely the Ministry of Intelligence and Islamic\nRevolutionary Guard Corps.\n\n\n-----\n\n- Iran’s cyber capabilities appear to be indigenously developed, arising from local\nuniversities and hacking communities. This ecosystem is unique, involving diverse\nstate-aligned operators with differing capabilities and affiliations. Over the decade\nthat Iranians have been engaged in cyber operations, threat actors seemingly arise\nfrom nowhere and operate in a dedicated manner until their campaigns dissipate,\noften due to their discovery by researchers.\n\n- Though Iran is generally perceived as a third-tier cyber power—lacking the capabilities of China, Russia, and the United States—it has effectively exploited the lack of\npreparedness of targets inside and outside Iran. Just as Russia’s compromise of Democratic Party institutions during the 2016 U.S. presidential election demonstrated that\ninformation warfare can be conducted through basic tactics, Iran’s simple means have\nexacted sometimes enormous political and financial costs on unsuspecting adversaries.\n\n- The same Iranian actors responsible for espionage against the private sector also conduct surveillance of human rights defenders. These attacks on Iranian civil society often foreshadow the tactics and tools that will be employed against other targets and\nbetter describe the risks posed by Iranian cyberwarfare.\n\n- Through technical forensics of cyber attacks, researchers documenting these campaigns can provide a unique window into the worldview and capabilities of Iran’s\nsecurity services and how it responds to a rapidly changing technological and geopolitical environment.\n\n## U.S. RESPONSES GOING FORWARD\n\n- While Iran does not have a public strategic policy with respect to cyberspace, its history demonstrates a rationale for when and why it will engage in attacks. Iran uses\nits capabilities in response to domestic and international events. As conflict between\nTehran and Washington subsided after the 2015 nuclear deal, so too did the cycle of\ndisruptive attacks. However, Iran’s decisionmaking process is obscured and its cyber\ncapabilities are not controlled by the presidency, as evident in cases of intragovernmental hacking.\n\n- The United States is reliant on an inadequately guarded cyberspace and should\nanticipate that future conflicts, online or offline, could trigger cyber attacks on U.S.\ninfrastructure. The first priority should be to extend efforts to protect infrastructure\nand the public, including increased collaboration with regional partners and nongovernmental organizations targeted by Iran.\n\n\n-----\n\n- Narrowly targeted sanctions could be used to deter foreign countries or other actors\nfrom providing assistance to Iranian offensive cyber operations. Such restrictions should\nstill prioritize allowing Iranian society wide access to the internet and information technologies, to mitigate the regime’s ability to control information and communications.\n\n- The United States has pursued a name and shame strategy against Iranian threat actors, and should continue to do so. The Justice Department has issued indictments\nagainst Iranians implicated in disruptive campaigns and has successfully obtained the\nextradition from a third country of a hacker involved in the theft of military secrets.\nBecause of the small operational footprint of the groups, targeted sanctions or legal\nproceedings are more symbolic than disruptive. These indictments may at least chill\nparticipation by talented individuals who wish to travel or emigrate.\n\n- Iran continues to pursue its interests through cyber operations, engaging in attacks\nagainst its regional opponents and espionage against other foreign governments. A\nbetter understanding of the history and strategic rationale of Iran’s cyber activities is\ncritical to assessing Washington’s broader cyberwarfare posture against adversaries,\nand prudent U.S. responses to future cyber threats from Iran and elsewhere.\n\n\n-----\n\n-----\n\n# INTRODUCTION\n\nCyberspace has become the newest frontier in the four-decade-long U.S.-Iran cold war.\nPerhaps more than any government in the world, the Islamic Republic of Iran has been\nthe target of uniquely destructive cyber attacks by the United States and its allies. At the\nsame time, groups associated with Iran’s security forces—namely the Islamic Revolutionary Guard Corps (IRGC) and Ministry of Intelligence—have become increasingly\nadept at conducting their own offensive cyber operations. The targets of such operations\ninclude Iranian government critics at home and abroad, corporations, and nongovernmental organizations, as well as the economic, defense, and diplomatic institutions of\ncountries including Germany, Israel, Saudi Arabia, and the United States.\n\nThe Iranian government has provided conflicting public accounts of its offensive cyber\noperations, touting its capabilities while denying responsibility for attacks attributed to\nit. Consistent with its use of proxy groups to assert its regional power, Tehran frequently\nmasks its involvement in such operations using cutouts (intermediaries) to avoid attribution and provide it plausible deniability. Despite these denials, it is clear Iran has invested\nin indigenous cyber capabilities for both defensive and offensive purposes, and is willing\nto use them in the event of conflict.\n\nTehran’s offensive cyber capabilities are relatively unsophisticated compared to states like\nChina, Russia, and the United States. While the Iranian hacking scene emerged in the early\n2000s, there is little evidence of state-aligned cyber activities before 2007. This comparatively late start and underinvestment in part accounts for its lower capacity. Yet Moscow’s\ncompromise of Democratic Party institutions and political operatives during the 2016 U.S.\n\n\n-----\n\nelection demonstrated that information warfare can be conducted through basic tactics.\nIran has similarly preyed upon the lack of sophistication or preparedness of vulnerable targets both inside and outside Iran, including Saudi oil companies, Middle Eastern governments, and U.S. banks. Though these operations have often caused great financial damage,\nthe methods used to destroy data or disrupt access were relatively simple.\n\n\nIran has demonstrated how militarily weaker countries can use offensive cyber operations\nto contend with more advanced adversaries. Tehran’s operations against foreign interests\nhave been mostly espionage and sabotage campaigns against soft targets in rival countries, rather than economic theft. Disruptive and destructive attacks have repeatedly been\nused by Tehran to signal its ability to impose\nretaliatory costs on its adversaries. Overall,\n\n## Iran has demonstrated how these disruptive incidents appear to have been\n\nrestrained based on strategic calculations, and\n\n## militarily weaker countries \n\nlimited to tit-for-tat exchanges within the\n\n## can use offensive cyber \n\nsame domain during times of conflict.\n\n## operations to contend with \n\nThat said, most victims of Iranian cyber\n\n## more advanced adversaries.\n\noperations are in Iran or the large Iranian\ndiaspora—the so-called internal enemies that\nTehran’s leadership fears. The early and effective adoption of the internet and social media by regime opponents and critics has fed\nthe perception of Tehran’s hardliners that foreign powers are conspiring to subvert the\nIslamic Republic through new technologies. But the targets of Tehran’s digital surveillance include not only human rights defenders and perceived enemies of the state but\nalso apolitical cultural institutions and even Iranian government agencies. Digital espionage and disruptive attacks against government critics have demonstrated to the Iranian\npublic that its online activities are not outside the reach of the state.\n\nThis report provides a historical analysis of the activities and observed capabilities of\nIranian threat actors who perform offensive cyber operations, most likely on behalf of\nthe Islamic Republic. For purposes of maintaining a consistent terminology, the cyber\nactivities covered in this report are framed in terms of “offensive cyber operations,” which\nin the U.S. Department of Defense’s words are actions “intended to project power by\nthe application of force in or through cyberspace,”[1] or through distinguishing the intended effects (such as disruption, exfiltration, or destruction). This narrows the scope of\nresearch to intelligence and other offensive actions, rather than the full realm of Iranian\ngovernment attempts to build influence online or control information.\n\nHackers working in coordination on cyber operations are described as “threat actors,”\n\n\n-----\n\nalthough groups can have a single member and their composition can change over time.\nThe terms “state-sponsored” or “state-aligned” are used throughout this report to reflect\nthe direct relationship between the attackers and the Iranian government that is accounted for throughout the operations.[2]\n\nForensic artifacts and other records collected from cybersecurity research provide unprecedented insight into the security and intelligence priorities of the Iranian regime.\nThe true intent of an attacker is not always evident in an intrusion. The compromise of a\nsystem for espionage or reconnaissance can later provide an electronic foothold used for\nsabotage. While Tehran has conducted highly visible attacks against rivals during times\nof conflict, the decade-long history of Iranian cyber operations reveals that the primary\nreason for such campaigns appears to be espionage.\n\nIran has been the target of espionage and destructive coercive measures launched by foreign states, including not only the United States and Israel but also Canada, France, Russia, and the UK. These attacks further motivated Tehran to develop indigenous defensive\nand offensive cyber capabilities as well as a credible retaliatory threat. These exchanges are\ndirectly correlated to Iran’s domestic and geopolitical climate, which has been reflected in\nthe reduction of disruptive attacks since the signing of the 2015 nuclear deal, formally known as the\nJoint Comprehensive Plan of Action (JCPOA). **While Tehran has conducted**\n\n## highly visible attacks against\n\nThe primary source of data used in this report is\ndocumentation collected from attacks against a **rivals during times of conflict,**\nvariety of nongovernmental organizations (NGOs) **the decade-long history of**\nand other targets, both inside Iran and abroad.\n\n## Iranian cyber operations\n\nForensic investigation techniques provide a broader\n\n## reveals that the primary\n\nperspective on the range of activities of threat actors,\nhelping to identify specific participants and their **reason for such campaigns**\npotential connections to Iranian governmental enti- **appears to be espionage.**\nties. For example, the “sinkholing” of malware—the\ninterception of communications through the redirection of domain names—provides insight into both the perpetrators and the victims of\nsuch campaigns. In other cases, the lack of professionalism by Iranian groups has led to\nthe disclosure of names, aliases, and email addresses of their members in malware code\nand domain registration records.\n\n\nThis first-hand research complements numerous reports—based also on primary source\nmaterial—published by cybersecurity companies on specific Iran-related incidents or\nthreat actors. These publications provide alternative insights into Iran’s targeting of other\nsectors outside the authors’ immediate perspective, such as defense companies and gov\n\n-----\n\nernments. An index of these reports will be made available online.[3] Interviews with targets of Iranian campaigns—including activists and scholars based in Iran and abroad—\nhelp elucidate Tehran’s motivations and place the attacks in a broader context. Interviews\nwith cybersecurity professionals similarly provide background on larger industry trends.\n\nThe intent of this report is to strengthen policy discussions of Iran’s cyber operations by\nincreasing public knowledge about the nature of such activities. Since cybersecurity research is typically limited to disclosures of specific threat actors or incidents, such publications do not provide insight into larger motivations and observable trends. This report\ndiffers in that it considers the historical patterns and the broader context of Iranian cyber\noperations, particularly their relationship to changing political conditions. It also emphasizes the overlap between Iranian campaigns conducted against foreign government\ninstitutions and/or corporate entities and those directed against human rights and civil\nsociety organizations, commonly neglected stakeholders in cybersecurity policy debates.\n\nA better understanding of the history and strategic rationale of Iran’s offensive cyber\noperations must inform U.S. strategy toward Iran and future U.S. responses to Iran’s actions. This is especially true given the United States is reliant on an inadequately guarded\ncyberspace and should anticipate that future U.S. cyber attacks against Iranian targets\ncould trigger retaliatory attacks on U.S. infrastructure. Iran’s recent history suggests such\nan outcome.\n\n\n-----\n\n**CHAPTER ONE**\n\n# IRAN: TARGET AND PERPETRATOR\n\nSince the first publications on Iranian cyber activities in the summer of 2012—disclosing\na malware agent named Madi—cybersecurity companies and Western government agencies have routinely documented intrusions, disruptions, and other malicious activities\noriginating from Iran.[4] Yet aside from attacks that sought to subvert foreign infrastructure, these reports have rarely provided context about Tehran’s offensive cyber operations\nand the motivations for attacks.\n\nTehran’s perspective is shaped by the many attacks that have targeted its own infrastructure. Since Iran’s covert nuclear facilities were exposed by an opposition group in 2002,\nnumerous foreign actors have staged intrusion operations that sought to gain access to\nIran’s nuclear facilities, economic infrastructure, military apparatus, and governmental\ninstitutions, for both espionage and sabotage.[5]\n\nIndeed, the most prominent example of modern cyberwarfare was the sustained campaign of sabotage—unprecedented in its sophistication and preparation—carried out by\nthe United States and Israel against Iran’s nuclear facilities. In what was known as Operation Olympic Games, the malware agent Stuxnet was used to sabotage components of\nthe Natanz uranium enrichment facility, resulting in the destruction of over 1,000 centrifuges and setting back Iran’s nuclear progress by more than a year. This marked one of\nthe first known uses of offensive cyber operations as a coercive measure between states.[6]\n\nWhile Stuxnet was solely intended to degrade Iran’s nuclear program, other campaigns\nsought to sabotage the country’s financial and oil infrastructure. In May 2012, a consor\n\n-----\n\ntium of researchers disclosed another destructive operation against Iran.[7] Malware agents\nknown as Wiper and Flame, successors to Stuxnet, had been discovered when Iran’s Ministry of Petroleum and the National Iranian Oil Company computers were disabled, their\nhard drives overwritten in a unilateral operation reportedly conducted by Israel.[8]\n\nCoercive cyber operations targeting Iran continued following Operation Olympic\nGames. In June 2012, amid stalled nuclear negotiations between Iran and international\npowers, Tehran’s minister of intelligence claimed the country’s nuclear facilities were\nsubject to another “massive cyber attack.”[9] Later that year, Iran alleged additional disruptive operations targeting its Central Bank, Ministry of Culture, and drilling platforms\noperated by the Iranian Offshore Oil Company.[10]\n\nIn addition to sabotage, foreign intelligence agencies have continually targeted Iranian\ninfrastructure for purposes of espionage, a fact made public to Iran through the intelligence disclosures of Edward Snowden. A former U.S. National Security Agency (NSA)\nworker, Snowden leaked a presentation on a tool known as Boundless Informant showing Iran to be one of the most highly surveilled countries in the world: billions of Iranian\ninternet and telephone records have been collected by the intelligence agencies of the\nUnited States and its partners. In fact, Iran is so frequently surveilled that a Canadian\nespionage operation targeting Iran once stumbled across a French-run intelligence operation that had compromised the very same network.[11]\n\n## HOW IRAN EMBRACED CYBER REPRESSION\n\nIran’s Supreme Leader Ayatollah Ali Khamenei has long believed Washington aspires to\noverthrow the Islamic Republic by instigating mass mobilization along the lines of the\n1989 Velvet Revolution that toppled the Communist regime in Czechoslovakia.[12] Following similar logic, Iran’s first cyber operations were motivated by fears that the internet\nfacilitated external threats to regime stability. Tehran often labels the online dissent of its\ncitizenry as cyberwarfare orchestrated by its enemies, namely the United States, to subvert\nthe Islamic Republic. Western government support for unrestricted internet access and\nPersian-language satellite television stations—such as BBC Persian TV—are perceived as\nkey elements of this strategy. The advent of social media sites, such as Facebook and Twitter, and messaging apps, such as Telegram, are especially threatening given they challenge\nthe Iranian government’s long-standing monopoly over media and communications.\n\nKhamenei’s greatest concerns were realized when the June 2009 contested reelection of\nhardline president Mahmoud Ahmadinejad—amid widespread allegations of fraud—provoked Iran’s largest popular uprisings since the country’s 1979 revolution. It was also a\n\n\n-----\n\npivotal moment in the Iranian government’s embrace of offensive cyber capabilities, as\nthis mass mobilization—known as the Green Movement—became one of the first known\ntargets of the regime’s operations. The online contest between the opposition, using the\ninternet to coordinate political resistance, and the government, attempting to repress mobilization, set the stage for future conflicts, including those with foreign powers.\n\nSoon after an estimated 2 million Iranians protested in Tehran on June 15, 2009, supporters of the Green Movement began to battle the government over control of information.[13] When the authorities expelled foreign media, interfered with mobile phone\nnetworks, and arrested prominent critics, the internet became a primary channel for\ncoordination amid the chaos. In response, the\nU.S. Congress, then U.S. president Barack\nObama’s administration, and American tech- **An Iranian hacker breached**\nnology companies sought to maintain Iranian **the Dutch security company**\nusers’ access.[14]\n\n## DigiNotar to fraudulently issue\n\nDuring the Green Movement, pro-regime **encryption certificates that**\nhackers engaged in a multipronged strategy **allowed Tehran to spy on all**\nof intrusions, disruption of websites, and\n\n## domestic Gmail users, one of the\n\nnetwork surveillance. Between December\n\n## largest security breaches in the\n\n2009 and June 2013, a group calling itself the\nIranian Cyber Army defaced websites associ- **history of the internet.**\nated with Iran’s political opposition, Israeli\nbusinesses, independent Persian-language media, and social media platforms, posting pro-government messages. When human rights\nactivists and opposition leaders called for street protests, critical websites were subject to\na deluge of malicious internet traffic to disrupt access, known as distributed denial-ofservice (DDoS) attacks.[15] Government critics were spied on with malware posing as information on upcoming protest plans and public scandals.[16] An Iranian hacker breached\nthe Dutch security company DigiNotar to fraudulently issue encryption certificates that\nallowed Tehran to spy on all domestic Gmail users, one of the largest security breaches in\nthe history of the internet.[17]\n\n\nUltimately, the brutality, surveillance, and censorship exercised by the security forces\ndebilitated the Green Movement, and by 2011 public protests had subsided. Security\nagencies had adapted to the modern digital environment, with interrogations by the\nIRGC including an intimate review of an arrestee’s personal life based on printed copies of his or her online communications and social media. An IRGC chief later said that\nsuppressing the demonstrations required widespread arrests, massive repression, and cutting off means of mass communication, such as cellphones and the internet.[18] The Green\n\n\n-----\n\nMovement demonstrated to the Islamic Republic that the internet could be used as an\ninstrument of mass mobilization and posed an effective challenge to the regime’s longheld information monopoly.\n\nThe tactics, tools, and threat actors that arose during this domestic challenge to regime\nstability would foreshadow the cyber posture of Iran toward a wider set of internal and\nforeign threats. A recurrent theme since the outset of Iran’s cyber operations is that Iranian campaigns do not maintain clear boundaries between operations directed against its\ninternal opposition and those directed against foreign adversaries.[19] The same infrastructure and tools used by Iranian threat actors for campaigns against the American defense\nindustry are also used to target Persian-language women’s development programs; the\nsame malware used in destructive attacks against Saudi government institutions had been\npreviously used for surveillance against members of the Green Movement opposition.\n\n## IRAN’S OFFENSIVE CYBER CAPABILITIES\n\n\nCyber operations have provided Tehran less risky opportunities to gather information\nand retaliate against perceived enemies at home and abroad. Before information communication technologies were widely available, the Iranian government’s foreign intelligence operations centered chiefly on recruiting agents to spy on and assassinate political\ndissidents or the diplomats of rivals. These operations usually resulted in international\nembarrassment when the attackers were caught and condemnation when they succeeded.\nCompared to clandestine in-country operations,\noffensive cyber capabilities provide stronger de\n## Over the past decade, offensive\n\nniability and have thus far been less likely to lead\n\n## cyber operations have become to retaliation upon discovery. a core tool of Iranian statecraft,\n\nOver the past decade, offensive cyber opera\n## for the purposes of espionage, tions have become a core tool of Iranian state- signaling, and coercion. craft, for the purposes of espionage, signaling,\n\nand coercion. Accounts of Iran’s offensive cyber\noperations follow a consistent pattern across\ncampaigns and among different threat actors. Operations focus on well-defined sets of\ntargets and are less sophisticated than the campaigns of state-sponsored threat actors\nin other countries—to credibly signal threats and create deterrence requires assured\nrepeatability, a capability that Tehran generally still lacks.\n\nMoreover, the level of professionalization, preparation, and investment necessary to\nconduct an operation like Operation Olympic Games remains far outside the capacity of\n\n\n-----\n\nIranian threat actors. Unlike the cyber operations of the United States and Israel, which\nare conducted by professional intelligence services supported by billion dollar budgets,\nIran’s offensive and defensive capabilities are disorganized and modestly funded.[20] Thus,\nwhile Iran frequently turns to disruptive attacks to apply pressure, it faces a ceiling of\ncapability and opportunity in its ability to threaten opponents. Tehran’s clandestine human intelligence gathering in foreign countries, particularly outside the Middle East, is\nof similarly low sophistication.\n\nTehran rarely claims responsibility for offensive cyber operations attributed to it, including those espousing support for the Islamic Republic, and has made contradictory\nstatements on its cyber posture. Iranian authorities have a history of embellishing the\ncountry’s military capacity, including for cyber operations. In responding to a series\nof disruptions of its own infrastructure in October 2012, then minister of intelligence\nHeidar Moslehi asserted that “the Islamic Republic is so powerful in the cyber space that\n\n[even] leaders of the arrogant powers admit and acknowledge our country’s successes.”[21]\nHowever, IRGC commander Mohsen Kazemeini also claimed that the IRGC’s cyberwarfare division was not tasked with conducting offensive operations.[22] Official rhetoric\nalso appears to conflate the state’s effort to push online propaganda with offensive cyber\ncapabilities, leading to claims of tens of thousands of cyber warriors.\n\nIran has used reports of destructive incidents to portray itself as a victim of foreign aggression, deflect attention away from its own actions, and boast of its ability to neutralize\npotential attacks. When accused by the United States of having conducted a disruptive\nattack against American banks, Iran’s Deputy Foreign Minister Hossein Jaberi Ansar responded that “the U.S. government, which put millions of innocent people at the risk of\nan environmental disaster through cyber attacks against Iran’s peaceful nuclear facilities,\nis not in a position to level accusations against the citizens of other countries, including\nthose of Iran, without substantiated evidence.”[23] Iranian officials appealed to international institutions for relief after the country had been affected by the malware agents Flame\nand Wiper, a move that aligned with its calls for greater United Nations (UN) control\nover the internet.[24]\n\nIn public statements, Iran has often emphasized its defensive capabilities, announcing in\n2015 that its Cyber Attacks Emergency Center had successfully managed to thwart U.S.\ncyber attacks against the country’s industrial infrastructure.[25] Iranian military officials\nregularly announce new defense products developed by domestic contractors, the most\nprominent example being the antivirus software Padvish.[26] Despite these claims, Iran has\nshown little success in fostering a mature cybersecurity industry and lags behind both\ndeveloped economies and key regional rivals in terms of investing in defense or formulating national policies to secure critical infrastructure.\n\n\n-----\n\nWhile the Iranian government has committed tens of millions of dollars to cybersecurity\nin recent years, the scale of these investments pales in comparison to the billions spent\nannually by the U.S. government or the hundreds of millions spent individually by American\n\n## Iran is generally perceived banks.[27] Were Iran to focus on improving its de- as a third-tier cyber power, fensive capabilities, it would still face significant\n\nconstraints related to sanctions, bureaucratic\n\n## lacking an advanced indigenous\n\ninefficiency, and a deficit of specialized expertise.\n\n## cybersecurity apparatus capable\n\nGiven the sophistication shown by its adversar\n## of carrying out sophisticated ies, assertions about the quick detection and operations like China, Israel, remediation of foreign intrusions into Iranian\n\nnetworks should be viewed skeptically, a defen\n## Russia, and the United States. \n\nsive posture that is unlikely to change.\n\nDespite its confident claims, Iran is generally\nperceived as a third-tier cyber power, lacking an advanced indigenous cybersecurity\napparatus capable of carrying out sophisticated operations like China, Israel, Russia,\nand the United States.[28] While technical sophistication does not impede Iranians from\nconducting successful cyber operations, those actions reflect a disorganization and lack of\nprofessionalism that runs contrary to what would be expected of a state actor and limits\ntheir capabilities. Tehran’s political and economic isolation has further constrained it\nfrom acquiring technology and expertise from foreign governments or companies, and\nlittle evidence exists that would indicate substantial cooperation with other nations in the\ndevelopment of its offensive cyber capabilities.\n\n## THE DIFFERENCE BETWEEN ESPIONAGE AND SABOTAGE\n\nMedia accounts of cyber operations often paint incidents with a broad brush, labeling all\nintrusions as attacks regardless of whether the outcome was destructive.[29] Offensive cyber\noperations, however, can be more accurately labeled according to their intent and impact,\ndistinguishing espionage and sabotage. Iranian actors have both engaged in intrusions\nto extract information from foreign networks (espionage, information gathering) and\nperformed destructive actions to punish or coerce adversaries (sabotage), with a gray area\nin the middle related to signaling and other motivations. Understanding this difference is\nimportant in assessing Tehran’s strategy and the legality of its operations.\n\nInternational law differentiates activities that are legal, though not desirable, from those\nthat are illegal and could prompt dangerous escalation.[30] Just as international law differ\n\n-----\n\nentiates traditional espionage from coercion or violence, these same principles also apply\nto cyber espionage. Legal scholars have asserted that “mere intrusion into another State’s\nsystems does not violate the non-intervention principle.”[31]\n\nIndeed, given the growing number of nations with offensive cyber capabilities, espionage\nand information gathering through cyber operations has increasingly become accepted\nas an international norm.[32] While the United States naturally denounces Tehran’s targeting of State Department employees, for example, such incidents mirror similar espionage\noperations against Iranian diplomats by U.S. and other Western intelligence agencies.[33]\n\nInternational law experts have provided frameworks for determining what constitutes an\n“armed attack” in cyberspace, based on severity, invasiveness, directness, and other factors. Such frameworks also reinforce the importance of terminology, differentiating, for\nexample, espionage against the Navy Marine Corps Intranet from a destructive incident\nsuch as Iran’s attack on Saudi Arabia’s and the world’s largest oil company, Saudi Aramco.[34] Relatedly, scholars have noted that Iran’s use of proxies in offensive cyber operations\ndoes not absolve the government of legal obligations or repercussions for their outcome,\nbased in part on international case law from the 1979 Iranian hostage crisis.[35]\n\nConsistent evaluation of the legality of Iranian cyber operations provides clearer public\nbenchmarks for assessing when Iran violates internationally respected principles and engages in illegitimate behavior. As Tehran continues to conduct offensive cyber operations,\nit is important for policymakers to assess the intent, scope, and legality of Iran’s actions\nbefore considering counter responses.\n\n\n-----\n\n-----\n\n**CHAPTER TWO**\n\n# IRAN’S CYBER ECOSYSTEM:  WHO ARE THE THREAT ACTORS?\n\nThe Islamic Republic of Iran is unique in that its most powerful officials—namely Supreme Leader Khamenei and the Islamic Revolutionary Guard Corps—are inaccessible,\nwhile its most accessible officials—including Foreign Minister Javad Zarif—are far less\npowerful. Iran’s offensive cyber activities are almost exclusively overseen by the IRGC—\nlikely without the oversight of the country’s publicly “elected” officials—and composed\nof a scattered set of independent contractors who mix security work, criminal fraud, and\nmore banal software development. While the relationships between proxies and governments can range from passive support to complete control, Iran’s indigenous threat actors\nmaintain an arm’s-length relationship to the state, with certain operations orchestrated to\nmeet the needs of the government.[36]\n\nAfter successfully suppressing the 2009 Green Movement and first detecting the Stuxnet\nattack in 2010, Iranian threat actors conducted sustained campaigns against domestic\nand foreign adversaries. These indigenous operations appear to be performed by small\ngroups of individuals that have varying levels of technology experience with no more\nthan ten people per team. These campaigns and the resources produced by the groups\nrange from rudimentary to relatively professional, but most actors still face a low capacity ceiling.[37 ]\n\nThough U.S. officials and some cybersecurity companies have speculated that Tehran has\nreceived technical assistance from countries like Russia and North Korea, the level of sophistication is commensurate with the established practices of amateur hacking communities inside Iran.[38] While Iranians have demonstrated talents in social engineering and\n\n\n-----\n\nembedding themselves in compromised networks, this alone is not indicative of external\ntraining or technological transfers.\n\nOn several occasions, Iranian threat actors have used off-the-shelf or pirated versions of\nprofessional penetration testing tools to conduct campaigns, but there is little indication\nof Tehran acquiring exploits or malware from foreign governments. Iran has acquired\nhardware for internet surveillance from Chinese telecommunication firms and maintains\ncooperative agreements with Russia on cybersecurity; however, these relationships differ\nfrom providing Tehran with offensive cyber capabilities.[39] No publicly documented or\nprivately observed attack has demonstrated the use of tools or resources that are beyond\nthe capacity of Iranian threat actors.\n\nIn principle, the tools and tactics used in cyber operations are subject to an exposure risk.\nUnlike conventional weapons, malware attacks or other cyber activities lose their effectiveness when discovered and when their functionality and infrastructure is documented.\nDescribing a missile does not provide effective countermeasures, but describing malware\ncan provide antivirus companies and system administrators the ability to protect systems.\nState-aligned threat actors will likely not employ the most sophisticated tools and strategies available to them unless the target is well protected and worth potentially exposing\ntradecraft to compromise. However, unlike in other countries, there are not observed\nexamples from Iranian threat actors of escalation into more sophisticated attacks against\nhardened targets.[40]\n\nIranian threat actors conduct campaigns with established toolkits that sometimes last for\nyears and ensnare hundreds of targets. However, the fluid nature and decentralization\nof these groups make them relatively difficult to track. Malware that is publicly attributed to Tehran is often abandoned immediately on exposure, and identifiable members\nappear to change groups over time. Some groups seem to split up, have members move\nelsewhere, or even collaborate, further blurring lines.[41] For example, while an IRGCaffiliated group labeled Rocket Kitten was the most active operator for a two-year period\n(2014–2016), attracting press attention as Iran’s premiere threat, it has since faded into\nquiescence, eclipsed by the actor Oilrig.[42]\n\nDespite their substantial financial impact, Tehran’s disruptive operations against foreign\ntargets have been technically simple. The compromise of a small number of IT personnel\nenabled the destruction of data on computers maintained by Saudi Aramco, eventually\nresulting in hundreds of millions of dollars in damage.[43] In only a few campaigns have\nIranian threat actors shown the professionalism and sophistication approaching that\nexpected of a nation-state actor; in one such case, the operation could be tied directly to\nthe Ministry of Intelligence (Magic Kitten, discussed later).[44]\n\n\n-----\n\nSuccess can often be attributed to security failures and to poor protection of infrastructure on the part of the victim, alongside opportunistic targeting and patience by the attacker. The defacement of Voice of America’s websites by the Iranian Cyber Army, one of\nthe first disruptive attacks by Iran against the United States, was accomplished through\nsocial engineering the news agency’s domain name service provider.[45] Other basic security\nfailures gave Iranians a toehold in the networks of Las Vegas Sands Corp. after its owner,\nSheldon Adelson, advocated military force against Iran.[46] Symantec, an American cybersecurity company, noted that the perpetrators of a recent Saudi-focused campaign had\ninvested a “significant amount of preparatory work for the operation,” but the custom\nmalware was described by Russian cybersecurity firm Kaspersky as “generally of low quality” partially derived from open-source toolkits.[47]\n\nSimilarly, a major attack on the American financial sector—known as Operation\nAbabil—which caused hundreds of millions of dollars in damage, was described as one of\nthe largest DDoS attacks known at the time. Yet it took only a few young Iranian computer experts, breaching thousands of websites that were running vulnerable software, to\npool enough bandwidth to overwhelm the infrastructure of banks and cause unpredicted\nsoftware failures.[48] Thus, while Iranian threat actors have limited capacity, through basic\ntradecraft and persistence they can still be effective at espionage and sabotage.\n\nThe overall sophistication and dedication observed in such campaigns has not significantly changed in the decade that Iran has engaged in offensive cyber operations—the attacks\ndocumented against Las Vegas Sands Corp. in 2014 are comparable to those used against\nSaudi Arabia in renewed hostilities over the course of 2016-2017. Indeed, many research\ndisclosures cover groups that have been active for several years, using the same malware\nwith only incremental changes over the course of time.\n\nWhile sophistication alone can be a superficial metric of posed threat, Iranian operations do not demonstrate the common technical precautions taken by other nation-state\nactors (such as obfuscating malware), and, even with strong social engineering capabilities, attacks are often betrayed by a lack of investment in nontechnical resources (such\nas fluency in English or personal tailoring of messages).[49] These resource constraints also\naccount for why Iranians are more effective at compromising dissidents—Iranian threat\nactors understand their target’s context and language, as opposed to when they are tasked\nwith European languages or other cultures. Iran shows little indication of becoming a\nfirst-tier cyber power in the foreseeable future unless it begins to further organize its\noperations and invest in professionalism.\n\n\n-----\n\n## MAGIC KITTEN\n\nIn January 2015, the German news outlet Der Spiegel released previously unpublished documents on cyber espionage conducted by American intelligence\nagencies.[50] One of them revealed an NSA tactic labeled “fourth party collection,”\nwhich is the practice of breaking into the command and control infrastructure\nof foreign-state-sponsored hackers to look over their shoulders. The presentation\ndescribes a real-life example of acquiring intelligence and stealing victims from a\ngroup code-named VOYEUR by the NSA, otherwise known as Magic Kitten.\n\nMagic Kitten appears to be among the oldest and most elaborate threat actors\noriginating in Iran. It is also distinct from other groups because of its apparent\nrelationship with the Iranian Ministry of Intelligence rather than the IRGC.\nHowever, Magic Kitten’s activities mirror those of other groups, with the primary targets being Iranians inside Iran and Tehran’s regional rivals. The earliest\nobserved samples of Magic Kitten’s custom malware agent dates to 2007, well\nbefore other known malware apparently originated, and the threat actor continues to be active.\n\nMagic Kitten appears to exercise the most mature tradecraft of Iran-based threat\nactors. It has opportunistically compromised dozens of websites at random\n(including those of an Indian hospital, an Italian architect, and a well-known\nCanadian comedian) to create a relay network to hide its operations. Such attention to tradecraft appears elsewhere in Magic Kitten’s operations, including in\nthe design of malware, which is modular in nature.\n\nMagic Kitten has not been observed using sophisticated exploits and instead appears to rely on social engineering and other common tactics to deceive users. In\nthe case of the journalist Vahid Pour Ostad, the malware was sent by his former\nMinistry of Intelligence interrogator with a threat attached and relied on private\nrecords that would have been available only to government actors. This coordination represents both independent confirmation of the NSA’s attribution and\nan extreme example of the strategies employed by Magic Kitten. Other samples\nof the malware agent appear to have been delivered posing as Turkish asylum\nforums for Syrian refugees.\n\n\n-----\n\nThe NSA presentation also provides a window on Magic Kitten’s targets up to\nMay 2011, portraying an operation focused on North America, Europe, and the\nMiddle East. These campaigns continued through the June 2013 presidential\nelection of Hassan Rouhani, provoking a blogpost from Google about related\nattacks.[51] As the election approached, exposed logs showed the daily capture\nof dozens of accounts connected to Iranian cultural and media figures, graduate students, and social activists (including individuals that would later join the\nRouhani administration). Magic Kitten continued to target Iranians after the\nelection, attempting to unmask pseudonymous internet users by baiting them\nwith content on women’s rights and the security establishment.\n\nLike other Iranian operations, Magic Kitten maintains a strong secondary interest in conducting espionage against regional targets and international foreign\npolicy institutions. CrowdStrike, another American cybersecurity company,\naccounts for part of this focus on “international corporations, mainly in the\ntechnology sector” and other political targets.[52] An NSA slide with a victim map\nportrays a broad-reaching operation targeting nearly every country in the Middle\nEast. Sinkhole data collected from expired domains previously used as relays and\nother fallback infrastructure suggest that Magic Kitten, or the malware agent\nused, continues to actively compromise individuals in Germany, Indonesia, Iraq,\nLebanon, the Netherlands, Palestine, Pakistan, Qatar, Sweden, Switzerland,\nThailand, and the United Arab Emirates. Notably, compromised individuals in\nIraq were also typically in Iraqi Kurdistan, mirroring a common pattern with\nother threat actors.\n\nA diagram within the NSA presentation suggests that the malware agent employed by Magic Kitten was also used at the time by Iran’s Shia Lebanese proxy\nHezbollah, under independent infrastructure. While Hezbollah has been known\nto maintain its own offensive cyber operations and engage in intelligence sharing\nwith Iran, there has been little prior evidence of direct sharing of tools.[53]\n\n\n-----\n\n## UNDERSTANDING IRANIAN GOVERNMENT  INVOLVEMENT AND ATTRIBUTION\n\n\nIt is often difficult to determine the origins and perpetrators of Iranian offensive cyber\noperations, as these campaigns may disappear as quickly as they appear. Public exposure often leads them to change tactics and abandon tools, making tracking even more\ndifficult. The history of cyber operations targeting Iranians and originating from Iran is\npopulated by groups that arise out of nowhere and conduct campaigns for ambiguous\nreasons over a finite time span, then disappear. This unusually frenetic character conspicuously differentiates the Iranian hacking ecosystem from that found elsewhere, particularly those\n\n## The history of cyber tied to state actors in advanced countries. operations targeting Iranians\n\nThe amateur hackers connected to the Iranian\n\n## and originating from Iran is defacement community have long been politi- populated by groups that arise cally engaged and have often vandalized foreign\n\nsites for ostensibly nationalistic reasons.[54] In one\n\n## out of nowhere and conduct\n\nof the first international incidents attributed\n\n## campaigns for ambiguous\n\nto Iran, domestic hacking groups in mid-2008\n\n## reasons over a finite time span,\n\nexchanged tit-for-tat defacements with competi\n## then disappear. tors in neighboring Arab countries after the of\nficial sites of Grand Ayatollah Ali al-Sistani were\nvandalized with anti-Shia content by an Emirati\nhacker. Such defacement activities can often evolve into state-affiliated activities: one of\nthe participants in the anti-Sunni website-defacement campaign in 2008 was later linked\nto the Iranian Cyber Army. This transition from patriotic hackers to state-aligned threat\nactors, and the ambiguity between civic nationalism and state involvement, mirrors the\napparent development of cyber communities in China and elsewhere.[55]\n\nIn only two incidents have Iranian government entities taken direct credit for the defacement of political opposition sites, both attributed to branches of the Revolutionary\nGuard. The first case was the March 2010 takedown of sites connected to the organization Human Rights Activists in Iran, which was alleged to be training cadres to mobilize\nagainst the regime like the Velvet Revolution. The attack relied on the arrest of a website\nadministrator inside the country rather than on complicated tactics. The arrests and\ndestruction of data had a lasting impact on the organization by instilling fear in members\nand giving rise to rumors about collaboration with the government.\n\nThe second government-initiated campaign, carried out during a Shia holiday in December 2013, led to the defacement of nine human rights and independent media websites\n\n\n-----\n\nwith a Quranic verse in Arabic and Persian. The IRGC’s Public Relations Department\nannounced that the operation had been conducted by the Revolutionary Guard’s Kerman Branch and claimed that the defaced websites had been established by the country’s\nenemies and supported by internal seditionists.\n\nIn most cases, Iran uses cutout or proxy organizations, allowing it to keep some distance\nfrom the disruptive incidents and propagandistic defacements. These cutouts represent\nthemselves as patriotic Iranians or pan-Islamic movements acting independently in\ndefense of the supreme leader, national sovereignty, and religious ideals. Conducting\noffensive cyber operations through covert organizations provides Tehran plausible deniability for any attacks, thereby protecting its claim to victimhood while also allowing the\nstate to signal its intentions to its opponents. These\ntactics are effective: there is still no definitive public\nagreement on who was behind the Yemen Cyber **Conducting offensive cyber**\nArmy’s attacks that led to stolen Saudi Arabian Min- **operations through covert**\nistry of Foreign Affairs documents being published **organizations provides**\nby WikiLeaks, with the consensus split between\n\n## Tehran plausible deniability\n\nIran and Russia.[56] The cutouts tend to develop their\n\n## for any attacks, thereby\n\nown mythology and continue to be treated as active\nthreats past their expiration date, bolstering percep- **protecting its claim to**\ntions of Iran’s capability. **victimhood while also**\n\nNevertheless, a comprehensive study of Iran-linked **allowing the state to signal its**\ncyber operations often reveals Tehran’s hand in **intentions to its opponents.**\nsuch proxies. When the U.S. Justice Department\nunsealed its Operation Ababil indictment in March\n2016, it named two Iranian corporate entities that employed at least seven individuals\nwho had been contracted by the Iranian government.[57] The indictment implicated three\nof the participants as being part of the Sun Army, an Iranian cutout defacement group.\nThe Sun Army followed the typical pattern found with the Iranian Cyber Army and\nother state-aligned defacements, arising out of nowhere to perform targeted political acts\nover a short life span. Its first documented defacements, in February 2010, were of sites\nconnected to now-detained opposition leader Mehdi Karroubi. The vandalism accused\nhim of being a traitor and was timed to blunt planned antigovernment street protests.[58]\n\n\nAs Iran’s cybersecurity landscape has professionalized, some defacement groups have\nsought to convert their infamy into corporate success. Based on the disclosure of personal\ninformation about threat actors, there are indications that those engaged in Iranian offensive cyber operations work within corporate entities (such as IT consultancies) or contractors of Iranian security forces.[59] For example, aspects of the Madi espionage campaign\n\n\n-----\n\nimplicated the Mortal Kombat Underground Security Team, a small Iranian group that\nhas attempted to sell spyware and other hacking tools since at least 2008.[60] The frequent\noverlap of legitimate digital commerce sites and servers used for intrusion campaigns\nis demonstrative of these blurred lines—a company might simultaneously provide web\ndesign services for businesses and hack for the government.[61]\n\n\nThe transition of amateur hackers into contractors for state security agencies is reflected\nin basic qualities and patterns of life found across most threat actors. There are clear indications that the threat actors documented are solely Iranians operating inside Iran, not\ndiaspora Iranians or non-Iranians. At the most basic level, they tend to follow the normal\npatterns of life of office workers, being active during\nthe Iranian workweek (Saturday through Wednesday)\n\n## Iranian threat actors have\n\nand dormant during Iranian holidays, particularly\n\n## often used pornography as the long holiday of Nowruz, the Persian New Year. bait in their spearphishing\n\nDisclosures of aliases and real names, which may be\n\n## campaigns and display an discoverable because of a disregard for operational irreverent sense of humor. security due to insulation from repercussions or a\n\nlack of professionalism, help reveal both the lives and\nthe motivations of Iranian threat actors. While those\nbehind the groups may be nationalists or ideologically aligned with the regime, they do\nnot appear to be enrolled members of the military or security apparatus. These individuals and groups also differ in social and religious predilections; some participants promote\nthe use of narcotics and trade pornography on personal social media, while others are\ndevoutly religious and embed Islamic references in malware code. Iranian threat actors\nhave often used pornography as bait in their spearphishing campaigns and display an\nirreverent sense of humor.\n\n## CRITERIA FOR INDEPENDENT ASSESSMENT  OF STATE INVOLVEMENT\n\nCampaigns conducted against dissidents and others inside Iran provide the most direct\nevidence of government involvement. Whereas it can be difficult to trace the consequences of foreign espionage, for those on the ground the implications are more direct\nand tangible.[62] As a pattern builds between cyber operations and the offline actions of\nsecurity forces, the relationship between both becomes clearer.[63] While these cases of collaboration are discernible in only a few threat actors, the patterns support a broader narrative around the intrusion ecosystem.[64] Indications that Iranians undertaking offensive\ncyber operations are associated with the government include the following:\n\n\n-----\n\n- The campaigns have been conducted based on information that appears to have been\nprovided by security agencies. In certain cases, the campaigns have been carried out in\ncoordination with government employees and in advance of the arrest of the target.\n\n- The targets of such operations align with the sensitivities of the Islamic Republic,\nand certain individuals are targeted repeatedly by multiple threat actors over time.\n\n- Persistent and costly campaigns have been sustained against thousands of targets\nwithout an apparent financial motive and without clear indication of the end use of\nthe data obtained by intrusion.\n\nIn rare cases, potential ties to the government are even disclosed by the participants\nthemselves. A malware developer associated with the Rocket Kitten group, Yaser Balaghi,\nwas identified by name based on a pseudonym found in the malware’s code. In a résumé\nfrom 2013, Balaghi listed past information security projects and a history of conducting\nhacking projects under contract to an otherwise unnamed “cyber-organization.”[65] Balaghi\nis not alone in listing his hacking activities on his résumé; still other pseudonyms embedded in malware code used against Saudi Arabia and internal dissidents can be associated\nwith LinkedIn profiles describing their experience as an “Information Security Researcher” with a “Secret” group.\n\nTo add a complication common in cybersecurity research, it is often difficult to distinguish commonplace electronic fraud from politically motivated disruptions and statesponsored surveillance efforts, especially where the attacks are not sophisticated. In at\nleast one case, Iranians that had staged persistent attempts against U.S. foreign policy\norganizations and two European foreign ministries had also maintained infrastructure\nlinked with commercial banking fraud.[66] In another example, the same social engineering\nskills used by an individual behind the Iranian Cyber Army defacements also proved successful in a career in the commercial theft of domains and PayPal fraud. More recently,\nin an indictment against an Iranian accused of attempting to extort HBO with stolen\ncopies of unreleased television episodes in the summer of 2017, the U.S. Department of\nJustice claimed that the same individual had worked on behalf of the Iranian government\nto target military systems and Israeli infrastructure.[67]\n\nAnalyses of Iranian offensive cyber operations often rest on the country’s strict domestic controls as an indication of endorsement—that the government would not allow\nsomething to happen that it didn’t want to occur. However, Tehran’s controls are not so\nabsolute, and many of the operations could occur surreptitiously given their simplicity.\nCyber activity emanating from Iran could theoretically be conducted without the state’s\nsanction, consent, or even knowledge. Daily, millions of Iranians circumvent censorship\nusing antifiltering tools that allow them to bypass network restrictions and encrypt their\n\n\n-----\n\ncommunications against surveillance. These tools provide space for Iranians to engage\nin actions against the government without persecution, and similarly can conceal cyber\nactivities. Therefore, an Iranian origin does not alone indicate state sponsorship.\n\nNor does the financial damage resulting from an operation, the political implications of\nthe campaign, or the number of targets necessarily directly correlate with the probability\nof government involvement. The destructive operations conducted against Saudi Aramco\nresulted in millions of dollars in damages, yet the malware was unsophisticated and the\nattack did not require significant resources, putting the incident plausibly within reach\nof a sole individual acting without sponsorship. Such straightforward metrics of harm,\nthen, are poorly informative of the degree of governmental involvement in cyber activities originating from Iran.\n\n## GOVERNMENT ENTITIES AND THREAT ACTORS\n\nThe coordinated timing of cyber operations with politically motivated arrests are a strong\nindication of the Iranian government’s direct involvement. Since at least July 2014 a\npattern has emerged: individuals in the custody of the IRGC are forced to provide access to their online accounts and devices, which are then immediately used to conduct\nspearphishing attacks associated with known threat actors.\n\nA vivid example of this coordination is the case of Iranian-American Siamak Namazi, a\nforty-six-year-old Dubai-based energy consultant and previously a scholar at the Woodrow Wilson International Center for Scholars in Washington, DC. In October 2015, he\nwas arrested by Iranian security forces months after having had his passport confiscated\nwhile visiting the country. Within hours of his arrest, Namazi’s Google and Facebook\naccounts initiated conversations with his wide array of foreign policy and media contacts.\nThe intruder, pretending to be Namazi, sent contacts an article about the recent nuclear\ndeal and in poor English solicited edits on the document. This message was accompanied\nby an email directing the target to a fake Google site requiring visitors sign in to their\naccount to view the document, a credential theft attempt connected to Rocket Kitten.\nNumerous individuals were compromised in this campaign, including scholars, U.S.\nState Department employees, and one prominent journalist whose Gmail account—\nwhich included communications with former U.S. secretaries of state, CIA directors, and\nother foreign ministers—was overtaken by the Iranian hackers for nearly two days.[68] This\npattern has been repeated in numerous cases involving other Iranians, dual nationals, and\nforeign nationals detained in Iran.\n\n\n-----\n\nCyber operations have also been documented in preparation for arrests.[69] A prominent\nexample of target selection prior to arrest is the case of Babak Zanjani, an Iranian-Danish\nbusinessman who had been personally sanctioned by the United States and European\nUnion for involvement in Iranian sanctions evasion. After months of claims regarding his\nrole in the embezzlement of oil revenue, a process that included a parliamentary investigation, at the end of December 2013 Zanjani was arrested and subsequently charged with “corruption on\n\n## This overarching trend\n\nearth.”[70] After an opaque judicial process, in March\n2016 he was condemned to death, a sentence the **points to probable**\nMinistry of Justice indicated could be commuted if **relationships between**\nZanjani cooperated in recovering Iran’s foreign assets.\n\n## certain threat actors and\n\nA persistent effort targeted Zanjani’s personal accounts **the intelligence agencies,**\nand business infrastructure in the weeks immediately **a business relationship**\npreceding his arrest. Iranian threat actors sought access\n\n## that has been revealed\n\nto Zanjani’s iCloud services and successfully compro\n## when Iranians have been\n\nmised employees associated with his holding company,\nthe Sorinet Group.[71] These activities indicate that in **indicted by the United**\nadvance of the arrest of Zanjani, the group (Flying **States for hacking.**\nKitten) had acquired access to the confidential information of Sorinet subsidiaries and personnel; however,\nit is not clear whether any material accessed during this time was used in the investigation\nor prosecution of Zanjani. The case of Zanjani reflects a broader trend witnessed with other\ncases; Iranian threat actors frequently pursue online the types of individuals commonly\npersecuted by the Islamic Republic offline.\n\nThe association between Iranian-origin cyber activities and Iran’s intelligence agencies\nis further supported by the fact that the data acquired during such operations is rarely\ndisclosed. The Navy Marine Corps Intranet breach, the Las Vegas Sands Corp. incident,\nand the compromise of State Department employees have all led to the exfiltration of\nsubstantial amounts of highly sensitive information. There is no indication of ulterior\nmotives, such as fraud, extortion, humiliation, or disclosure to the hardline press.[72]\nThe operations required costly infrastructure, including dedicated servers and dozens\nof domain names, in addition to personnel time. The activities must have provided\nsome degree of income to their members, with the primary value being espionage. This\noverarching trend points to probable relationships between certain threat actors and the\nintelligence agencies, a business relationship that has been revealed when Iranians have\nbeen indicted by the United States for hacking.\n\n\n-----\n\n-----\n\n**CHAPTER THREE**\n\n# IRAN’S EXTERNAL TARGETS\n\nGiven Iran’s inability to effectively challenge or deter better-prepared opponents, it has\nemployed opportunistic destructive attacks to demonstrate its ability to retaliate. Particularly in the Middle East, Tehran can implicitly threaten cyber operations against the\npoorly defended economic and infrastructure resources of its opponents in the event of\nhostilities. Indeed, the disclosure of targets and victims of Iran’s regional cyber operations\noften include industries that appear to serve no other purpose than creating beachheads\nin rival countries, such as banks and airports.\n\nThe intended effects of disruptive operations can vary, ranging from intimidation to\ndestruction for foreign targets, and from embarrassment to existential harm for domestic\nopponents. The targeting or compromise of systems can alone be sufficient to communicate Tehran’s willingness and capability to inflict damage on opponents. This echoes Iran’s\noccasional threat to close the Strait of Hormuz—through which nearly 60 percent of the\nworld’s oil supply passes on any given day—during times of crisis. Given the opacity of\nthe Iranian government, however, the intended messages and expectations being signaled\nfrom Tehran can be easily misinterpreted, risking unintended conflict or escalation.\n\nSuch destructive attacks are rare, however, compared to Iran’s espionage campaigns\nagainst foreign governmental and economic institutions. Increasingly these campaigns\nform not only the basis of retaliation during conflict but also an essential crisis response\nmechanism for handling emerging threats. For example, days after a September 2015\nstampede killed over 450 Iranians attending the Hajj pilgrimage, domain names impersonating the Saudi government and Hajj Ministry were registered by known Iranian\n\n\n-----\n\nthreat actors.[73] As relations and communications rapidly deteriorated between the two\ncountries, particularly over the fate of a missing diplomat, cyber espionage became an\ninformation gathering tool for Tehran.\n\nSaudi Arabia aside, Denmark, Germany, Israel, and the United States are among the\ncountries that have publicly disclosed espionage attempts by Iranian groups against their\ngovernment, military, or scientific institutions.[74] Tehran also targets neighboring countries throughout the Middle East. Despite the various threat actors that operate on behalf\nof the Iranian government, their behavior patterns—including whom they target—are\ngenerally consistent over time.\n\n## THE UNITED STATES AND EUROPE\n\nIn September 2012, a group calling itself the Izz ad-Din al-Qassam Cyber Fighters announced it had begun a campaign of DDoS attacks against the U.S. financial sector. Prior to the campaign, the culprits had exploited vulnerabilities in the software of thousands\nof websites in order to create an attack platform under their control. With this army of servers located\n\n## An NSA briefing document within well-connected hosting companies, the at\ntackers could deluge their targets with high volumes\n\n## also made clear the\n\nof malicious traffic. In the first phases of Operation\n\n## motivation for Operation\n\nAbabil, the group targeted the U.S. banking infra\n## Ababil: “[Signals intelligence] structure. Unprepared for such a volume of traffic indicates that these attacks (the U.S. Federal Bureau of Investigation stated the are in retaliation to Western highest rate observed approached 140 gigabits per\n\nsecond, three times the capacity of the banks at the\n\n## activities against Iran’s\n\ntime), the victims’ databases and systems crashed\n\n## nuclear sector and that\n\nfrom the dramatic increase in requests.\n\n## senior officials in the Iranian\n\nSubsequent phases of the campaign were less ef\n## government are aware of\n\nfective as the financial sector steadily improved its\n\n## these attacks.” defenses. By the fourth attempted attack, in July\n\n2013, little visible impact resulted. Still, by the\nFBI’s account, Operation Ababil locked hundreds\nof thousands of banking customers out of accounts for long periods of time and resulted\nin tens of millions of dollars in costs to remediate. An NSA briefing document also made\nclear the motivation for Operation Ababil: “[Signals intelligence] indicates that these\nattacks are in retaliation to Western activities against Iran’s nuclear sector and that senior\nofficials in the Iranian government are aware of these attacks.”[75]\n\n\n-----\n\nOperation Ababil remains the most destructive Iranian attack on the United States.\nWhile the International Atomic Energy Agency (IAEA) alleged that Tehran had electronically surveilled and tampered with the devices of visiting nuclear inspectors in 2011,\nlittle had been known about Iranian cyber espionage prior to 2012.[76] That summer provided the first public indication that Iranian threat actors had staged campaigns to spy\non rivals.[77] The Madi malware campaign was reported to have compromised up to 800\nvictims over the course of a year. The countries and\nentities targeted were a harbinger of future Iranian\ncyber operations, including oil companies, U.S. **Iranians attempted to**\nthink tanks, government agencies, engineering firms,\n\n## compromise the personal\n\nfinancial institutions, and academia.\n\n## email accounts of members of\n\nSeveral Western countries have provided evidence of **the American team during the**\nIranian cyber operations in indictments and security\n\n## nuclear negotiations.\n\nreports. In addition to Operation Ababil, Iranians\nwere alleged to have gained access to the unclassified\nNavy Marine Corps Intranet, a system used to store\nunclassified information and communications, for several months starting in August\n2013.[78] In the 2016 edition of an annual Ministry of Interior security assessment, the\nGerman government cited Iran as a new source of cyber espionage against the country,\na disclosure that aligned with reports that the Bundestag had been affected by a malware\noperation that targeted visitors of the Israeli newspaper Jerusalem Post.[79]\n\nOverall, however, cases of successful Iranian intrusions into American and European\ngovernmental infrastructure are rare, particularly highly secured, classified networks.\nGovernment agencies are typically hardened beyond the capability of Iranian threat actors to penetrate them. Consequently, Iranians have sought softer U.S. targets, launching\nspearphishing attempts on the personal email and social media accounts of U.S. government employees. While personal accounts are less likely to contain classified government\ninformation, they are also less likely to be properly secured, and often contain useful\ninformation such as private material and traces of professional communications.\n\nFor example, Iranians attempted to compromise the personal email accounts of members of the American team during the nuclear negotiations.[80] Similarly, after the 2016\nU.S. presidential election, Iranian threat actors focused on former Obama staff, Republican members of Congress, supporters of Donald Trump’s campaign, conservative\nmedia organizations, and nominees for political appointments in an apparent attempt\nto acquire intelligence on the new administration.[81] More recently these spearphishing\ncampaigns have targeted critics of Iran in the U.S. Congress while new sanctions have\nbeen under consideration.\n\n\n-----\n\nTehran tends to target the foreign government personnel and agencies that focus on Iran,\nnamely those in the United States or Europe who work on Iran policy or within Persianlanguage media, including Voice of America television and Radio Farda. Iranian threat\nactors have used the compromised accounts of prominent Iranian-Americans, international businessmen, and other dual nationals arrested by the IRGC to impersonate them\nand target the private email accounts of U.S. State Department personnel connected to\nIran policy.\n\nIn contrast to the release of private emails by WikiLeaks during the 2016 U.S. election, which leveraged stolen emails for information warfare, Tehran’s compromise of\nState Department employees’ emails did not lead to visible sabotage or the disclosure of\nembarrassing material. While there have been dozens of attempts to target a wide array of\nAmerican politicians and government employees, these intrusions were mostly opportunistic attempts that did not appear to escalate into more sophisticated operations.\n\nFollowing the 2015 nuclear agreement, the incidence of covert action and retaliatory attacks between Washington and Tehran decreased. Reports of disruptive cyber operations\nagainst U.S. and Iranian infrastructure diminished, as Tehran focused more on domestic\npolitical opponents and regional adversaries, such as Israel and Saudi Arabia. Just as Operation Olympic Games provided Washington the ability to coerce Iran without direct\nmilitary intervention, Tehran now engages in offensive cyber operations to project its\nregional power.\n\n## SAUDI ARABIA\n\nNo other country appears to have been the subject of as many offensive cyber operations from Iranian state-sponsored threat actors as Saudi Arabia. The two countries are\nethnic (Arab vs. Persian), sectarian (Sunni vs. Shia), and above all geopolitical rivals,\non opposing ends of bloody proxy wars in Iraq, Syria, and Yemen and fierce political battles in Bahrain and Lebanon. Relations between\nTehran and Riyadh have often been tense since the 1979\n\n## Saudi political and\n\nIslamic Revolution, and formal diplomatic ties have been\n\n## economic institutions\n\nsuspended intermittently due to political disputes. Most\n\n## have been compromised\n\nrecently, in January 2016, Saudi Arabia closed its Tehran\n\n## by Tehran for purposes embassy after it was ransacked by an Iranian-government- of both espionage  sanctioned mob. and disruption. Since the start of Iran’s cyber operations, Saudi political and\n\neconomic institutions have been compromised by Tehran\n\n\n-----\n\nfor purposes of both espionage and disruption. In various reports on Iranian malware\nand credential theft campaigns—attempts to acquire passwords or account recovery\ninformation—Saudi Arabia has been one of the most common sources of victims and\ntargets. This pattern reflects the two countries’ profound geopolitical and ideological disputes (intent), and Saudi Arabia’s continued vulnerabilities in cyberspace (opportunity).\n\nIran’s August 15, 2012, attack on Saudi Aramco during the Muslim Eid holiday (and a\nsimilar attack against Qatar’s RasGas Company two weeks later) is a prime example of\nhow Iran uses offensive cyber operations to retaliate against foreign adversaries. As covert\nactions by foreign actors targeted Iran’s nuclear and oil\ninfrastructure, previously unknown groups began staging disruptive attacks against economic infrastructure in **Shamoon’s message**\nSaudi Arabia and the United States, portraying them- **appeared clear: Iran**\nselves as independent hacktivists motivated by national\n## may not always be able\n\nism and Islamic values.\n\n## to defend itself against\n\nTo avoid attribution, retaliatory acts were conducted **more advanced cyber**\nusing cutouts that provided them plausible deniability.\n\n## capabilities, but it can\n\nIn the Shamoon attack, known by the name given to the\n\n## impose substantial\n\nmalware, tens of thousands of Saudi Aramco computers\nwere compromised, causing tens to hundreds of mil- **retaliatory costs against**\nlions of dollars in damage. One group, self-identified as **U.S. allies.**\nthe Cutting Sword of Justice, claimed responsibility for\nthe attack, which overwrote the hard drives of Aramco\ncomputers with the image of a burning American flag, causing embarrassment to the\ncompany. Unlike the cyber operations conducted against Iran by foreign entities, the\nretaliatory attacks carried out by Tehran sought maximum visibility.\n\n\nInitial analysis of the incident found that Shamoon was likely inspired by the Wiper malware that had targeted Iran in April 2012, given both destroyed stored data as a method of\nsabotage. Tehran was potentially motivated by retaliation for cyber operations against its\noil production infrastructure. Shamoon’s message appeared clear: Iran may not always be\nable to defend itself against more advanced cyber capabilities, but it can impose substantial\nretaliatory costs against U.S. allies.\n\nThe tit-for-tat cycle of covert destructive attacks and symbolic retaliation seen with\nShamoon and Ababil reflects Iranian security tactics witnessed in offline hostilities.\nBetween 2010 and 2012, for example, several Iranian nuclear scientists were assassinated\nunder mysterious circumstances, allegedly by the United States or Israel.[82] In apparent\nretaliation, Tehran attempted, unsuccessfully, to assassinate Israeli officials in unexpected\nplaces like Georgia, India, and Thailand. This cycle, a recurrent theme in Iran’s covert\n\n\n-----\n\nactions, showed Tehran’s ability to learn from attacks and retaliate in a similar fashion,\nproviding a potential framework for understanding its signaling and motivations in conducting disruptive cyber operations.[83]\n\nCompared to Iran’s other adversaries (namely the United States and Israel), Saudi governmental and economic institutions have yet to sufficiently implement systems and protocols\nto increase national cybersecurity. Iranian actors have targeted a broad range of economic,\nmilitary, and political institutions in Saudi Arabia—including Saudi Aramco and its foreign\npartners, the King Faisal Foundation, the Ministries of Commerce and Foreign Affairs,\nthe Saudi Stock Exchange, and even Saudi Arabian human rights advocates. Researchers\nhave documented multiple cases in which Saudi companies and organizations were compromised, in one event leading to the exfiltration of vast sums of archival proprietary data\nspanning multiple years from one industrial development corporation.[84]\n\nWeak Saudi cyber defenses have not only made the country vulnerable to Iranian coercion but also made Riyadh a soft target for Tehran’s retaliation against destructive cyber\noperations performed by third countries. If Iran cannot cause significant damage to\nthe United States during times of conflict, then damaging the economic institutions of\nAmerican allies will suffice.\n\nThe campaign of coercive pressure continues as well: the Saudi Ministry of Defense and\nother networks sustained DDoS attacks at the same time as the attack on the embassy.[85]\nWhen the Shamoon malware agent used in the Aramco incident reappeared in an\nupdated form (labeled as Shamoon 2 by researchers) from November 2016 to January\n2017, it destroyed databases and files belonging to both the government and private\nsector, including the General Authority of Civil Aviation, the Ministry of Labor, the\nSaudi Central Bank, and natural resource extraction companies.[86] Shamoon 2 contained\nreferences to Yemen and overwrote the victims’ hard drives with an image of the drowned\nSyrian refugee child Alan Kurdi, once again signaling the attacks were retaliation for\nSaudi policies in Syria and Yemen.[87]\n\n## ISRAEL\n\nOne of the consistent pillars in Iran’s foreign policy has been opposition to Israel’s\nexistence and support for anti-Israeli militant groups, such as Hezbollah, Hamas, and\nPalestinian Islamic Jihad. Despite this, however, Tehran has been far less successful in\ncyber operations targeting Israeli institutions for disruption and espionage. The documents used as bait in the Madi operation were commonly written in Hebrew or referenced Israeli security policies, and researchers have documented fifty-four compromised\nentities in Israel during that campaign.[88] During the conflict between Israel and Gaza\n\n\n-----\n\nin the summer of 2014, known as Operation Protective Edge, authorities claimed that\nthe Israel Defense Forces’ infrastructure was targeted by DDoS attacks launched by a\nwide range of belligerents, including Tehran.[89] These DDoS attacks would align with the\nknown capabilities of Iranian threat actors, including the tactics used against the United\nStates and dissidents.\n\nDespite a history of DDoS attacks and defacements of Israeli websites, Tehran’s ability\nto inflict major costs on Israel through cyber operations has thus far been limited and\nperhaps diminishing.[90] Given the sophistication of Israel’s cyber defense, Tehran has been\nforced to focus mainly on soft targets, for narrow espionage opportunities and the potential disruption of civilian resources in the event of conflict.\n\nIranian targeting of Israelis, like U.S. nationals, emphasizes individuals focused on Iran\nand regional policies. Tehran has engaged in spearphishing attempts against academic\ninstitutions, national security officials, diplomats, members of the Knesset, and Israeli\naerospace companies. Similarly, Iranian actors have commonly created malicious domains that have emulated those owned by the American Israel Public Affairs Committee\n(AIPAC) and have targeted employees of both liberal and conservative Jewish organizations in the United States and elsewhere.\n\nWhile Iran has had some success in compromising smaller civilian institutions, it has not\nvisibly attempted to use these breaches coercively. The lack of immediate weaponization\nof breaches is demonstrative of how strategic calculations shape outcomes. The destruction of banking information or medical data over nonexistential challenges to the Islamic\nRepublic is perhaps not worth inviting retaliation from Israel (a threat that Saudi Arabia\nlacks). Tehran’s desire for signaling a credible retaliatory threat against Israel through offensive cyber operations may also be sufficiently served by the mere compromise of such\ninstitutions. Cyber capabilities have certainly not altered the power dynamics between\nIran and Israel, and the difference in technical capacities likely shapes Iran’s posture\ntoward its adversary.\n\n## REGIONAL ALLIES AND ADVERSARIES\n\nWhile Tehran’s disruptive cyber operations in the region have primarily targeted Saudi\nArabia, multiple Iranian threat actors have been observed targeting nearly every Middle\nEastern, North African, and bordering country. For example, Magic Kitten successfully\ncompromised victims across the Middle East and South Asia.[91] This pattern has been\nrepeated during Madi and subsequent operations up to the present.\n\n\n-----\n\nCyber espionage has provided Tehran further insights about its often politically unstable\nneighbors. Iranian threat actors have shown a recurrent interest in the infrastructure\nof neighboring countries, including Afghanistan’s National Radio, Ministry of Education, and government network.[92] Other indicators also suggest an interest in Pakistan’s\nand Afghanistan’s security and defense organizations.[93] Fictitious social media profiles\nand spearphishing campaigns have commonly targeted Iraqis, notably engineers within\ntelecommunications networks and political elites. Iranian groups have also maintained an\nextremely active interest in the political institutions of Iraqi Kurdistan.[94]\n\nIn addition, multiple Iranian threat actors have engaged in spearphishing attempts\nagainst dozens of individuals affiliated with human rights organizations, political movements, and independent media outlets in Yemen, where Tehran is engaged in a proxy war\nwith Saudi Arabia.[95] The Israeli cybersecurity company ClearSky found that 11 percent\nof the targets of one Iranian credential theft campaign (Rocket Kitten) in 2015 were\nconnected to Yemen. These operations specifically support Iran’s position in the Yemeni\nconflict, with recent attempts targeting prominent critics of the Houthis, the Shia Muslim group that Iran has been supporting in the country’s civil war.\n\nIranian actors have also reportedly targeted Syrian opponents of President Bashar alAssad’s regime in limited cases, including exiled Syrian dissidents.[96] There has been speculation that Iran has also supported the offensive cyber\noperations of its traditional allies Syria and Hezbollah,\n\n## While there are credible notably after Syrian dissidents became the target of indications that Tehran has sustained malware campaigns starting in 2012. Yet\n\nthere is only limited evidence of technical cooperation,\n\n## provided Syria traditional\n\nand little reason why either would be dependent on\n\n## electronic warfare equipment,\n\nIran for capabilities.\n\n## the Assad regime apparently\n\nWhile there are credible indications that Tehran has\n\n## didn’t require extensive help\n\nprovided Syria traditional electronic warfare equipment,\n\n## with developing offensive the Assad regime apparently didn’t require extensive cyber capabilities. help with developing offensive cyber capabilities. An\n\nindigenous ecosystem of hackers organized by Assad’s\nrelatives has proven effective at targeting the regime’s\nopponents from early into the civil war. Small groups of hackers in Syria have typically used\nspyware that is popular among Arab hacking communities against opponents of Assad.\nConversely, while little is known about Hezbollah’s offensive cyber capabilities, in one 2015\nreport that described their malware and operations, the Lebanese group had seemingly\noutpaced its Iranian patron.[97]\n\n\n-----\n\nThe lack of external evidence of cooperation does not preclude other coordinated efforts\nor intelligence sharing, but basic cyber operations are easier than electronic warfare—such\nas signal jamming, radar collection, and signal location—or other military domains that\nrequire a defense industrial base.[98] None of the known capabilities or incidents involved\nspecialized knowledge that required external support, and all have independent profiles on\nhow their operations are conducted. Iranians have not used the same commodity spyware\nas Syrian groups, suggesting that pro-Assad groups owe more to local hacking scenes than\nother states. Moreover, Iran’s lack of cooperation with allies or friendly foreign powers may\nreflect other factors influencing decisions to share resources. Allies still spy on allies: Iran\ncould also want to withhold its toolkit to provide some oversight in contentious situations,\nsuch as monitoring the stability and loyalty of the Assad regime.\n\n## COMMERCIAL TARGETS\n\nUnlike China, Iran has limited use for commercial espionage given its lack of an industrial production sector that could utilize stolen intellectual property. Iran’s industrial\nespionage activities serve to boost its commodities industries and military technological\nprowess rather than its domestic manufacturing sector. Nor has Iran attempted to offset\nthe impact of economic sanctions through large-scale financial crime, as North Korea appears to do.[99] Based on public reports and directly observed campaigns, the commercial\nentities targeted by Iranian threat actors typically fall into four categories:\n\n- Aerospace and civil aviation\n\n- Defense industrial base and security sector\n\n- Natural resources and extractive industries\n\n- Telecommunications firms\n\nEvidence of Iran’s interest in the theft of defense secrets comes from several cybersecurity\nreports, observed incidents, and U.S. indictments. Nima Golestaneh, an Iranian national\nextradited to the United States from Turkey, pleaded guilty to supporting the October\n2012 hack of Vermont-based defense company Arrow Tech Associates in an operation to\nacquire copies of their weapon system simulations to sell the software to Iranian government and military entities.[100] This would prove to be a harbinger of later efforts.\n\nIn early 2014, in parallel to targeting Iranian women’s development programs and others,\none threat actor (Flying Kitten) impersonated a website for an aerospace systems conference to spread malware to defense contractors, a tactic still used against the industry\n\n\n-----\n\ntoday. Another Iranian threat actor over the course of 2015 to 2016 repeatedly created\nphony corporate websites for Oshkosh Corporation, an American defense company, to\ncapture credentials from its private internal business network, and continued to target\naviation companies, including jet engine manufacturers and satellite companies. Reports\nof attempts of military espionage by Iranian threat actors are extremely common and\ninclude a broad set of industries, most notably aerospace technologies.\n\nYet these operations appear to have had limited success. Given their involvement in the\ndefense industry, coupled with related concerns about Chinese industrial espionage,\ncompanies like Oshkosh prioritized information security in ways that NGOs have not.\nConsequently, while there is indication that employees are commonly targeted, even\ncompromised, reports of the theft of highly sensitive defense secrets by Iran are rare.\n\nThe targeting of defense companies is also motivated by regional politics rather than\nsolely theft of military technologies. Several defense industry companies targeted by Iranian threat actors, including Oshkosh Corporation, are substantially involved in providing security and military assistance to Saudi Arabia and other Gulf states. Many of the\nAmerican companies—including Oshkosh Corporation—that were designated by the\nIranian Ministry of Foreign Affairs in March 2017 under retaliatory human rights sanctions for their involvement with the Israeli military have also been targeted by Iranian\ncyber operations.[101]\n\nAs in other areas, it is difficult to derive intent purely from who was targeted or impersonated. In certain cases, it appears Iranian threat actors have compromised Middle\nEast–based information technology consultants in pursuit of the governments or businesses who are their clients. These operations often target company employees based in\nthe Middle East, potentially to acquire information on the military capabilities of rivals\nor access to other targets (such as supply-chain attacks). One more recent campaign\nmasquerading as Boeing and Northrop Grumman appeared focused on Saudi Arabia’s\nmilitary and commercial aviation sectors.[102]\n\nSimilarly, Iran’s targeting of telecommunications firms, banks, and civil aviation companies could provide them a foothold in critical infrastructure, one that could potentially\ncause substantial economic harm and even endanger lives. Thus far, however, Tehran appears to have used such targeting for reconnaissance purposes, mirroring other countries’\ncyber activities.[103] However, there are legitimate reasons to be concerned that Tehran’s\nintention in targeting critical infrastructure is to hold social and economic assets in adversarial countries at risk in the event it needs to escalate or retaliate during conflict.\n\n\n-----\n\n**CHAPTER FOUR**\n\n# IRAN’S INTERNAL TARGETS\n\nThe history of Iranian offensive cyber operations has demonstrated that the same threat\nactors responsible for espionage against the private sector engage in surveillance of human rights defenders, and with considerably more success, given the latter’s resource\nconstraints. Through the lens of such attacks, the relationship between Iran-originated\ncyber activities and the government as well as the motivations for such operations are\nmade clearer. These communities foreshadow the tactics and tools that will be employed\nagainst other targets, and increased information will enable more effective education and\nmitigation strategies.\n\nWhile the internet has afforded Tehran’s security agencies new possibilities for surveilling\nand intercepting the communications of its citizens, concurrent information technologies also limit the reach of the state. Iran was one of the first countries in the Middle East\nto connect to the internet, and as a result over half of the population was frequently using the internet as of March 2017.[104] Iranian internet users have been quick to embrace\nsocial media and chat applications in large numbers as forums where there are more\nsocial freedoms.\n\nAs Iranian citizens have moved their communications to internet platforms hosted outside Iran and protected their communications from eavesdropping by using encryption,\nthey have also evaded the more traditional means by which Iranian law enforcement and\nintelligence agencies perform surveillance.[105] Whereas local hosting providers and social\nmedia could be compelled to remove content and disclose account ownership information, platforms hosted outside Iran are beyond the direct reach of the state.\n\n\n-----\n\nThe Iranian government has sought to compel foreign firms to comply with requests for\nuser data, without great success.[106] Domestic alternatives to foreign services, supported\nby the state under its national internet plan, have failed to attract significant adoption\n(Iranian officials themselves tend to use communication tools and social media applications developed in the United States).[107] Moreover, millions in the Iranian diaspora—\nmany of whom left Iran because of state repression—live in countries with no security\ncooperation agreement with Tehran and are less inclined to communicate over insecure\nIranian platforms. As a result, in contrast to the first two decades after the revolution,\nIranians’ communications and personal activities are increasingly out of the state’s reach.\nThis dynamic has fundamentally altered the nature of state controls.\n\nThe Iranian government has struggled to respond to the challenges posed by the internet\nto the state’s information and communication monopoly. Among their first responses\nwas mandatory content filtering, which entailed blocking access to any sites considered\npornographic, antireligious, or politically subversive. With the increased availability of\ncircumvention tools, however, filtering became less effective. Subsequently, basic offensive cyber operations, such as disrupting adversarial sites during the Green Movement,\ngave the regime the ability to reassert some control over information flows and project\nthe illusion of the Islamic Republic’s dominance over the internet.\n\nIranian cyber operations are highly adaptable as the online platforms and tools used by\nthe public change. For example, after Iranians shifted to Telegram because of its unfiltered public chat feature and security claims, so too did the attention of Iranian threat\nactors. Alongside credential theft operations targeting Telegram users, one threat actor\nappears to have gone as far as mapping all the Telegram accounts connected with Iranian\ntelephone numbers. This information-gathering operation had deeper ties to efforts to\ntarget the chat application’s users and aligned with recurrent arrests of administrators\nfrom critical Telegram groups. This learning process is repeated elsewhere, including for\nmobile phones and Macintosh computers.[108]\n\n**Across discrete sets of threat actors and different periods of time, state-aligned offen-**\n**sive cyber operations routinely focus on similar classes of targets, primarily:**\n\n**1. Government officials**\n\n**2. Reformist politicians**\n\n**3. Media professionals**\n\n**4. Religious minorities**\n\n**5. Cultural figures**\n\n**6. Opposition groups, terrorist organizations, and ethnic separatist movements**\n\n\n-----\n\n## GOVERNMENT OFFICIALS\n\nNumerous Iranian threat actors have sought to compromise members of Hassan Rouhani’s government, the administration of former president Mahmoud Ahmadinejad, and\nthe state’s bureaucratic institutions. The operations target not only government officials\nbut also their relatives, including a sustained campaign directed against Rouhani’s immediate and extended family (particularly his brother and adviser, Hossein Fereydoun).[109]\nMagic Kitten, the earliest known threat actor, from the outset engaged in intrusions of\nthe Islamic Republic of Iran Broadcasting state television network and the Center for\nStrategic Research, the think tank research arm within the Iranian government’s Expediency Council that was headed by Rouhani at the time.\n\nCampaigns targeting the Iranian government are ongoing. The targeting of members of\ngovernment—individuals that have already been vetted by the regime—reflects the importance of cyber surveillance as a tool of the hardline security establishment to monitor\npotential rivals for power and accrue sensitive information about people’s lives that could\npotentially be used for blackmail or humiliation.\n\nThe Iranian Ministry of Foreign Affairs provides the most prominent and visible example\nof intergovernmental spying. Iranian diplomats have been frequent targets of spearphishing attempts conducted by IRGC-affiliated threat actors since the beginning of the\nRouhani administration. These activities align with accusations in the hardline press that\nthe nuclear deal betrayed Iranian interests.[110] The hacking attempts also mirror a history\nof arrests and pressure brought to bear on members of the diplomatic service accused of\nspying, including the August 2016 detention of Abdolrasoul Dorri-Esfahani, who served\non Iran’s nuclear negotiating team for the JCPOA.[111] Whereas diplomacy requires interacting with officials from foreign governments and external experts, these contacts can\nquickly be portrayed as engaging in espionage for foreign powers.\n\nWhile Foreign Minister Javad Zarif and other figures have been the targets of social\nmedia defacements and threats, the campaigns conducted by the indigenous threat actors\noutlined in this report differ in their intent from simple hacktivism or vandalism. The\nobjective is the collection of personal information from private accounts on international platforms and the monitoring of intimate political and professional networks of\ngovernment officials.[112] These tactics include the typical credential theft attempts against\npersonal email accounts seen elsewhere; however, special effort has been made to compromise government officials and their family members through elaborate deception\nand by using privileged resources.[113] Once compromised, those accounts have been then\nturned on their diplomatic contacts and peers. Zarif, and other senior diplomats, have\nbeen repeatedly impersonated and targeted by different IRGC-affiliated threat actors, as\nearly as 2013 and as recently as February 2017.[114]\n\n\n-----\n\nThe diplomatic core is not the only target of intragovernmental spying: several cabinet\nofficials of the Rouhani administration have had their personal email accounts targeted\nand compromised.[115] The cyber operations conducted by Iranian threat actors have\nextended beyond immediate members of government to target members of the Shia\nreligious establishment, which undergirds the state’s ideology and political affairs. Campaigns have compromised multiple individuals located in Qom, the center of Iranian\nreligious matters, including hosts within the Center for Services of Islamic Seminaries\nand Islamic Propagation Office of Qom.\n\n## REFORMIST POLITICIANS\n\nThe accounts of Iranian reformers are a primary target for Iranian threat actors. Though\nreformers profess loyalty to the revolution and the Islamic Republic, they favor less state\nintervention in society and a less confrontational foreign policy, prioritizing the country’s\nnational interests before revolutionary ideology. Consequently, they have been increasingly\npurged from Iranian politics and there is a media and travel ban against their most prominent leader, former president Mohammad Khatami (who served from 1997 to 2005).[116]\n\nAfter the Green Movement, associates of the former reformist presidential candidates\nMehdi Karroubi and Mir-Hossein Mousavi were aggressively targeted by the regime\nto try and stifle their activities, even those who had fled under threat of prosecution.\nUnwilling to allow a repeat of the Green Movement, the regime tightened information\ncontrols in the run-up to the 2013 presidential election of Hassan Rouhani. Access to\npopular anticensorship tools was cut off, and internet speeds were throttled until after\nthe election results were announced.[117] During this time, several Iranian actors began to\nconcurrently target the accounts of Iranian political dissidents.[118] Offline, the families of\ninternational Persian-language media employees were harassed, and reporters inside Iran\nwere subject to censorship or arrest.[119]\n\nOne of the first known cases of politically motivated hacking in Iran was when the blog\nof Mohammad-Ali Abtahi, the former vice minister of the Ministry of Culture and\nIslamic Guidance under Khatami, was defaced after he wrote about the arrest of bloggers\nin 2005.[120] Since then, Abtahi has been repeatedly targeted and impersonated by different Iranian threat actors in credential theft and social engineering operations.[121] Abtahi’s\nexperience is emblematic of such group’s priority on reformists. Public figures in the reformist movement from all different segments of society and politics have been targeted.\nNot only the overtly repressed activists connected to Khatami, Karroubi, and Mousavi\nbut former government officials, religious scholars, politicians, and professors.\n\n\n-----\n\nThe cyber operations against reformists have been broad, successful, and frequent. One\nthreat actor maintained access to a computer used by a reformist cleric and a deputy at a\nprominent Iranian university for months, watching him conduct political operations and\nmedia interviews.[122] Similarly, in December 2015 the Facebook account of Gholam Ali\nRajaee, a political activist close to former president Akbar Hashemi Rafsanjani, was used\nto spearphish the accounts of journalists and others.[123]\nThe previous year, that same threat actor, Rocket Kitten, had also successfully compromised a number of **The cyber operations**\nformer parliament members and other reformists in **against reformists have**\nthe diaspora, some of whom were later arrested.\n\n## been broad, successful, \n\nYoung activists mobilizing for reformists were targeted **and frequent.**\nwith malware and credential theft operations in the\nlead up to the February 2016 parliamentary election,\nparticularly those connected to female candidates. The targeting often aligns with offline\npressure from the IRGC and Intelligence Ministry: when the office of one reformist close\nto Rouhani was raided in May 2017, he was targeted in repeated spearphishing attempts.\nDespite the ascent of moderates to more positions of power, reformists remain a primary\ntarget of the government’s cyber capabilities.\n\n## MEDIA PROFESSIONALS\n\nIranian cyber operations have repeatedly focused on journalists working with reformist\nmedia outlets and international satellite broadcasters that fall immediately outside the\nstrict state-sanctioned narratives. Multiple Iranian threat actors conducted numerous\ncredential theft attempts, using fake service notifications, against Iran-based foreign correspondents and Iranian journalists working for prominent publications such as Shargh\nand the Iranian Labor News Agency. Similarly, freelance reporters inside Iran are frequently compromised through fictitious personas that send them malware purporting to\nbe news content. These campaigns have often targeted publications that would later be\nclosed and journalists who would be detained by Iranian security forces. These incidents\nare also often timed with elections, normally periods when the government has more aggressively prosecuted journalists.\n\nThe case of Jason Rezaian, the Washington Post’s former correspondent in Iran, is illustrative of state-aligned threat actors’ focus on foreign press working in Iran. Before his arrest\non July 22, 2014, and eighteen-month imprisonment by the IRGC, Rezaian had been\nthe target of concerted intrusion efforts by Flying Kitten. The threat actor attempted to\n\n\n-----\n\ncompromise Rezaian’s Hotmail and Gmail accounts on multiple occasions through credential theft attempts launched from fictitious security addresses; these attempts warned\nof spam being sent from the account and of other hacking threats. The emails were not\nthemselves technically sophisticated, as the English used in the messages was poor and\nthe approach was amateurish. However, the behavior in these incidents was unique in\nthat Rezaian’s accounts were singled out from a small set of targets several months prior\nto his arrest.\n\n## RELIGIOUS MINORITIES\n\nIranian religious minorities are obvious targets of the Iranian security forces, most\nnotably adherents of the highly persecuted Baha’i faith, who have long been accused of\npromoting conspiracies against the Islamic government.[124] With the widespread adoption\nof the internet, the Baha’i leadership, based mostly in the United States and Haifa, Israel,\nenjoyed new organizational and communication opportunities otherwise denied to them\noffline. Those same technologies, however, also gave the Iranian state new capabilities for\nintelligence gathering and propaganda dissemination against the Baha’i.\n\nIn April 2014, the Gmail account of a former director of external affairs for the U.S. Baha’i\norganization was accessed from inside Iran. The director had a history of international\nadvocacy on behalf of the Baha’i Assembly that included testifying before Congress on the\nstatus of religious minorities in Iran. This made her a\nnatural target for Iran. Fictitious LinkedIn and social\n\n## The ongoing targeting of the media profiles previously employed against the U.S. de\nfense industry, including one claiming to be former UN\n\n## Baha’i and the defacement\n\nambassador John Bolton, were used to target the Baha’i\n\n## of their sites underscores\n\ndirector with credential theft attempts posing as reports\n\n## the Iranian regime’s concern on religious persecution. with organizations it\n\nProminent members of the faith, including the di\n## perceives as subversive.\n\naspora relatives of imprisoned Baha’i leaders in Iran,\ncontinue to be subjected to sustained cyber operations. Similarly, cutout groups as recently as February\n2017 defaced Baha’i sites with pro-regime propaganda coinciding with events such as\nthe anniversary of the Islamic Revolution. The ongoing targeting of the Baha’i and the\ndefacement of their sites underscores the Iranian regime’s concern with organizations it\nperceives as subversive and its use of disruptive attacks to buttress the ideological agenda\nof the state.\n\n\n-----\n\nThe religious targets of Iranian cyber operations have not been limited to aggressively\nmarginalized groups such as the Baha’is but also include recognized religious communities such as Christians, Jews, Zoroastrians, and Sunni Muslims. In one example, a\nmainstream Jewish community leader in Tehran was compromised through malware and\nsurveilled as he went about coordinating events and managing a local religious publication. Still other spearphishing campaigns have routinely targeted evangelical Christian\nconverts, atheists, or new age religious sects. More broadly, a malware campaign posing\nas information on the persecution of Christian converts was sent to human rights organizations, and fictitious profiles have posed as religious minorities to infiltrate evangelical\nPersian-language networks.[125]\n\n## CULTURAL FIGURES\n\nIran-originating spearphishing campaigns have also targeted Iranian cultural figures—including artists, musicians, comedians, cartoonists, and satirists—regardless of whether\nthey reside in Iran or abroad.\n\nThese campaigns have included the targeting and compromise of social media and email\naccounts for the Germany-based musician Shahin Najafi, multiple pop stars that left Iran\nafter the Islamic Revolution, a Persian-Israeli singer, and an Iranian-born female metal\nmusician based in the United States, among others. There have also been intrusions into\ndevices and accounts associated with less prominent underground artists inside Iran and\nnetworks of fictitious social network profiles connected with Iranian death metal rock\nbands and hip-hop groups. These themes of targeting famous pop musicians and their\nstaff—both inside Iran and abroad—are recurrent and do not focus solely on individuals\ncritical of the establishment.\n\nIranian security forces have publicly acknowledged their operations to identify individuals\ninvolved in “immoral behavior” online. In January 2016, several Iranian fashion models\npopular on social media were arrested for their activities online and forced to delete their\naccounts, an effort labeled by the IRGC as Operation Spider. At the same time, the arrests\nof employees of the foreign-based AAA Music television channel led to their social media\naccounts being defaced with a message, purportedly from the Ministry of Intelligence,\nabout the illegality of the network. In interviews with and public statements by those\nrounded up in Operation Spider, these individuals were commonly operating openly, and\nthe defacements were conducted after they were forced to hand over passwords.\n\nOperation Spider was not the first of its kind: the activities of Flying Kitten suggest an\nearlier interest in surveillance of the Iranian fashion industry.[126] In early 2014, the threat\n\n\n-----\n\nactor compromised the computer of a social media model that was popular for portraying a fashionable lifestyle without wearing the state-mandated hijab.[127] After the intrusion she retreated offline, stopped logging on to modeling sites, and deleted her Facebook\naccount. Her image was also appropriated for further operations against other communities. The opaque nature of campaigns such as Operation Spider obscures how Iranian\nauthorities track down people like online models. However, incidents such as the Flying\nKitten compromise and the infiltration of LGBT-support networks and sex worker social\nmedia communities by others suggest a relationship between both efforts.\n\n## OPPOSITION GROUPS, TERRORIST ORGANIZATIONS,  AND ETHNIC SEPARATIST MOVEMENTS\n\nDespite its labeling of civil dissent as a threat to national security, Iran does face real\nthreats of terrorism and organized crime from nonstate actors, evidenced by the self-proclaimed Islamic State’s June 2017 attacks on its parliament and the mausoleum of former\nIranian supreme leader Ayatollah Ruhollah Khomeini. While documentation of Iranian\ncyber operations by international researchers has typically assumed that all domestic\ntargets of intrusion campaigns are political dissidents, a small portion of these campaigns\nfocus on areas in which law enforcement hacking has become internationally normalized,\nchiefly in the collection of evidence and intelligence on violent terrorist activities and\nfinancial crime.\n\nFor instance, Iranian threat actors have actively sought to compromise the digital operations of Sunni jihadi movements through credential theft, malware, and other intrusions.[128] To compromise Islamist organizations, Iranian actors have leveraged bait documents and messages in Persian and Arabic and posed as media organizations such as Al\nJazeera and Al Arabiya. Flying Kitten attempted to spread malware by posting comments\non Al Arabiya’s Facebook page purporting to promote jihadism. These intelligence efforts\nhave targeted jihadi groups across the Middle East and North Africa, Pakistan, and Afghanistan, including the Islamic State and al-Qaeda, while focusing on Iraqi and Persianlanguage groups.[129]\n\nSecurity-related cyber operations extend as well to fringe political organizations that have\npreviously engaged in hostilities against the Islamic Republic.[130] Iranian threat actors\nhave successfully compromised individuals affiliated with front groups for Mojahedin-e\nKhalq (MeK) opposition group, including the Iranian American Society of Texas and\nthe Simay Azadi television station. These intrusions provided access to private Facebook\ndiscussion groups and intra-organizational planning for MeK rallies, Telegram channels,\n\n\n-----\n\nand MeK television programming. Given the MeK’s past disclosures on Iran’s nuclear\nprogram, which the organization has claimed were conducted through an in-country\nnetwork of collaborators, these activities also constitute a counterespionage program.\n\nIranian threat actors also maintain a significant focus on disenfranchised ethnic minorities advocating for greater autonomy. One recurrent target has been Baluchi groups, a\nSunni Muslim population located in both Iran and Pakistan. The news outlets and social\nmedia accounts of Baluchi militant organizations, such as Jundallah, have repeatedly\nbeen targeted by Tehran. These operations include breaching multiple Jundallah affiliated sites as early as July 2010 to push malware to their visitors, a “watering hole attack”\ndesigned to surveil violent separatists that would be of interest to Iranian security agencies.[131] In other cases, from a different threat actor, Jundallah was targeted using malware\nhosted on domains purporting to be related to the Free Syrian Army and sent in emails\nclaiming to provide documentation of attacks against the IRGC.\n\nTehran has also devoted considerable resources to cyber operations targeting Kurdish organizations inside **The internet has increased**\nIran and abroad. Malware samples from April 2015 **the Iranian government’s**\ntargeted the Free Life Party of Kurdistan (PJAK), a\n\n## opportunities for\n\nmilitant Iranian faction of the Marxist-Leninist Kurd\n## surveillance and repression\n\nistan Workers’ Party (PKK).[132] The same threat actor\nappears to have successfully compromised a Kurdish **against foreign-based**\nsatellite television station, Newroz TV, aligned with **operations.**\nthe PKK. Newroz TV was also compromised by the\nFlying Kitten malware in 2014, indicating an overlap\nnot only in the threat actors’ mandates but also in their exact targets. Still other groups\nhave used fictitious LinkedIn profiles to connect to representatives of the Kurdistan\nRegional Government in Iraq. Judging from computer names and other indicators, many\nmore of those compromised by Iranian malware were in Iran’s Kurdistan province, while\nothers were found in Iraqi Kurdistan, or among the Kurdish population in Europe.\n\n### CIVIL SOCIETY\n\nThe internet has facilitated communication and organization between Iranians and\nforeign and diaspora organizations, but it has also increased the Iranian government’s opportunities for surveillance and repression against foreign-based operations.\n\nThough many foreign civil society organizations have been the subject of sustained attempts at infiltration and disruption by Iran, few appear to have incurred attacks of such\npersistence and aggression as those against the Eurasia Foundation, an NGO in Washing\n\n-----\n\nton, DC, that conducts development programs in former Soviet countries, the Middle\nEast, and China. As part of its Iran-focused social development programs, the Eurasia\nFoundation in October 2009 launched the Khorshid School of Entrepreneurship, which\npromoted women’s entrepreneurship through distance learning courses and the creation\nof professional networking opportunities.\n\nEurasia Foundation’s programs and organizational history connect closely with Khamenei’s fears of a Velvet Revolution. It would later launch several more online Persianlanguage programs covering a range of issues, from social entrepreneurship to family law.\nThe first intrusion attempt occurred shortly after an article was published in the hardline\nIranian newspaper Kayhan in February 2014. It accused the Eurasia Foundation of engaging in social engineering by establishing networks of women and teachers to foment\ngrassroots economic, political, and social pressure on the regime—all under the direction\nof the U.S. Agency for International Development and the U.S. State Department. Ten\ndays after the article appeared, Flying Kitten began its spearphishing campaign against\nthe Eurasia Foundation. For the next two years, the Eurasia Foundation would continue\nto be the target of malware, credential theft, and social engineering by diverse threat actors with diverse strategies.[133]\n\nThe campaign against the Eurasia Foundation is emblematic of Iran’s long and ongoing history of cyber operations against U.S.-based NGOs. U.S. think tanks have been a\nfocus of interest, with targets such as the American Enterprise Institute and the Council\non Foreign Relations singled out by multiple Iranian threat actors. The same Iranians\nthat targeted the Eurasia Foundation in December 2015 also impersonated the network\nadministrators at multiple Washington, DC, foreign policy institutions critical of the\nIranian government to compromise employees.\n\nNor are these efforts directed only at Iran’s detractors. Organizations advocating improved relations with Iran or nonpolitical researchers have been routinely targeted—the\ncommon denominator appears to be simply a policy interest in Iranian affairs.\n\n\n-----\n\n# CONCLUSIONS AND PRESCRIPTIONS\n\nWhile Iran’s offensive cyber operations have required modest resources to develop, they\nhave allowed Tehran to project itself as an emerging cyber power able to cause significant\nharm to its adversaries. The country’s security establishment has used these resources to\nsignal to domestic and international audiences its ability to confront political subversion\nand retaliate against attacks on its infrastructure. These actions have brought international attention to Iran as a considerable force, perhaps beyond its actual capabilities, but\nhave been ambiguous enough to allow Tehran to portray itself as a victim of the coercive\nmeasures of foreign states.\n\nAs judged from evidence of coordination between security agency actions and observed\ncyber operations, the campaigns of Iranian threat actors almost certainly have a direct relationship with government entities, specifically the Islamic Revolutionary Guard Corps\nand the Ministry of Intelligence. Given this alignment and collaboration, Iranian threat\nactors are described here as state-sponsored. However, since the threat actors are commonly private contractors in small security companies, these relationships are sometimes\nnebulous and the operators are not integrated into the state’s forces.[134]\n\nIranian cyber operations often reflect law enforcement behavior normalized by other\ncountries in response to advancing information technologies, such as the hacking of\ndevices to wiretap encrypted internet communications. International standards forums\nand telecommunication equipment vendors have legitimized the expectation of lawful\ninterception of communications, and the Iranian government faces similar challenges of\nproviding domestic security against terrorist organizations and crime that other coun\n\n-----\n\ntries encounter. These interests are expressed frequently in campaigns, which include the\ndocumentation of persistent targeting of militant organizations—both domestic and\nregional—that are hostile to the Iranian government, including Baluchi separatists and\nthe Islamic State.\n\nWith the exception of Saudi Arabia, Iran appears to have had little success in compromising hardened government institutions or well protected organizations. After two\ndecades of cyber crime, governments and private corporations have developed security\npolicies and maintain collaborative relationships with external security organizations (for\nexample, computer emergency readiness teams, or CERTs) that allow them to defend\nagainst attacks. In the office environment, companies can provide dedicated technical\nresources, exercise centralized control over devices, offer user education, and install protective network equipment that reduces risk. Such resources enable the private sector and\ngovernments to respond to threats and improve awareness collectively as a community.\n\nPrivate threat intelligences companies and governmental agencies, such as the FBI’s Cyber\nWatch (CyWatch), provide corporations with regular reports on common security risks,\nincluding information on the attacker’s documented tools and infrastructure. The FBI has\nproduced industry notifications on Iranian intrusion activities based on reports sourced\nfrom the private sector, and U.S. government entities have identified Iranian malware\nthrough information supplied from threat intelligence companies. When multiple computers in the Voice of America’s Persian service were infected by Iranian malware named Infy,\nthe agent’s origin was identified by network administrators through a private report generated by a threat intelligence company that was made available to the agency.[135]\n\nSuch resources are not readily available to individuals—especially those residing in\nIran—who find themselves alone and unprepared when targeted by even the most\nunsophisticated threat actors. While American banks quickly invested in countermeasures that limited the effectiveness of subsequent DDoS attempts in Operation Ababil,\nPersian-language social media platforms and media organizations subject to the same\nattacks commonly turned off services rather than pay thousands of dollars in bandwidth costs.[136] One FBI notice sent to the private sector even documented fictitious\nprofiles that were also used to target the Baha’i community.[137] However, the FBI and\ncybersecurity companies do not commonly notify at-risk communities of threats to\ntheir safety and privacy. This divergence and exclusion represents the differences in\nopportunities afforded to nongovernmental and noncorporate targets of state-aligned\nthreat actors.\n\nThe increased attention to user security by information technology companies in recent years has directly benefited the targets of Iran. Persian-language digital literacy and\n\n\n-----\n\ninformation security education programs have been developed through foreign assistance\nto cater to at-risk audiences, teaching concepts such as password management and how\nto recognize social engineering. Widely available account features such as two-factor\nauthentication, which requires a user to provide a code sent through text message or an\napplication to log into accounts, have demonstrably made it more difficult for Iranians\nto conduct credential theft. Private companies, such as Google and Cloudflare, as well as\ngovernment funders, have supported DDoS-mitigation services that provide civil society\norganizations with enterprise-level defense resources to protect against such attacks at no\ncost, leading to a marked decrease in their frequency.\n\nAs a result, a well-educated user with two-factor authentication and an iOS device is a\nmore difficult target for Iranian threat actors to compromise. However, while technological options for protecting accounts and devices have improved in recent years, in the end\nthe biggest vulnerability remains the user.\n\nAttempts to forecast the future of Iranian cyber operations are constrained by the secrecy\non the part of the Iranian state about its activities and an uncertain geopolitical climate.\nLike most countries, Tehran does not appear to have a clear doctrine as to when it will\nengage in disruptive operations and retaliate in cyberspace. Nor is it likely to. In line\nwith its asymmetric strategies in traditional warfare, Tehran has often benefited from\nambiguity. This may explain why it denies operations attributed to it, as well as why it\ndid not immediately incorporate threat actors into the military apparatus.\n\nHaving been the target of sustained cyber espionage and destructive attacks, Iran is\nbound to seek the same capabilities used against it. These capabilities provide Tehran opportunities to impose costs during potential hostilities. While Iran may not appear able to perform synchronized multistage attacks wherever it would like, **Having been the target of**\nit can repeatedly hammer away at soft targets in cam\n## sustained cyber espionage\n\npaigns of attribution. Renewed hostilities between\n\n## and destructive attacks, Iran\n\nIran and the United States could be expected to\n\n## is bound to seek the same\n\ninvolve the targeting of vulnerable economic, civilian, and governmental services with data destruction, **capabilities used against it.**\nDDoS, and other disruptive attacks. Under current\nperceptions of Iranian offensive cyber capabilities, it\nis unclear that it would be prepared and able to launch attacks against the power grid or\nindustrial control systems, such as those conducted against Ukraine.[138] Instead, attacks\nwould follow the path of least resistance—targeting state and local governments rather\nthan federal infrastructure, or unprepared sectors that have not been previously targeted\nsuch as transportation and logistics rather than the financial services. Attempts by one\n\n\n-----\n\nIranian to meddle with a local New York dam and other reports about the compromise\nof state agencies are demonstrative of the abundance of opportunities for Iran to retaliate\nagainst the United States.[139]\n\nMoreover, although Iran has been described as a rational actor, it is not unitary, as the\noverlapping operations and intragovernmental surveillance conducted by the Ministry of\nIntelligence and IRGC demonstrate.[140] The motivations, coordination, and authorization\nof Iranian state-aligned campaigns may differ from the policy position of other branches\nof government, and the use of offensive cyber capabilities is less visible to observers than\nthe mobilization of troops. Iran’s security apparatus can easily conduct hostilities in cyberspace without the consent or awareness of the rest of the government.\n\nDisruptive activities conducted by Iranian threat actors have decreased overall since the\ninterim nuclear deal signed in November 2013—known as the Joint Plan of Action\nframework. The rhetoric of government and military officials has also evolved over time.\nIn recent years, particularly under the Rouhani administration, fewer blusterous statements have been made regarding Iran’s cyber operations.[141] While Tehran is less likely to\nengage in disruption of American or European infrastructure amid current circumstances, it has engaged in cyber espionage and will continue to do so. The perceived success of\nprevious campaigns has solidified the principle of offensive cyber operations as an effective means for Iran to continue to conduct espionage and surveillance against regional\nadversaries and political opponents.\n\nYet Iran will continue to be limited by resource constraints for the foreseeable future.\nTehran has rarely appeared able to conduct large-scale exfiltration of classified business\nand government data, differing, for example, from Chinese efforts to steal Boeing’s industrial secrets or extensive databases from the U.S. Office of Personnel Management.[142]\nWhat’s more, the threshold of difficulty for compromising such targets will increase over\ntime, and it is unclear whether Iranian capabilities will improve proportionally.\n\nIran’s massive brain drain, with many of its brightest engineers leaving for political and\neconomic reasons, imposes further constraints on the development of its cyber capabilities. Iran’s minister of science, research and technology estimated that 150,000 highly\ntalented people emigrate from Iran every year, a $150 billion annual economic loss.[143]\nWhen Iranian engineers leave for Silicon Valley and Europe, the country’s capacity for\neffective offensive and defensive cyber operations goes with them.\n\nIn the absence of a historical comparison of Iranian cyber operations, new incidents or\nthe rise of new groups is often incorrectly perceived as a dramatic improvement to capacity. Despite systemic challenges stemming from bureaucratic dysfunction and underinvestment in cybersecurity, Iran has the potential to foster more effective operations.\n\n\n-----\n\nAttempts by the government, universities, and the private sector to create a professional\ncybersecurity community, such as hosting Capture the Flag tournaments, will inevitably\nresult in a deeper talent pool. Observing other nation-state actors provides a set of benchmarks that can be a reliable indicator of improvement or change in posture, including:\n\n- coordination of threat actors, more consistent improvement to domestically produced malware, and the development of purpose-built tools that could suggest the\nconsolidation of capability, specialization of personnel, and even incorporation into\nthe state;\n\n- investments in operational security, ranging from reducing the exposure of information on operators to increased investment in concealment (such as Magic Kitten’s\nrelay network);\n\n- improvements in background research and foreign language abilities within operations, such as more personalization of social engineering attempts, that would reflect\nthe inclusion of nontechnical support staff; and\n\n- execution of operations that include zero-day exploits or target core infrastructure\n(for example, compromising network devices, routing protocol hijacks, and telecommunications signaling manipulation), suggesting more investment in resources for\nsystemic cyber operations.\n\nDespite Iran’s current lack of technical sophistication, simple means can still be effective\nat imposing political and economic costs, as evidenced by Russia’s successful compromise\nand subsequent leaking of the internal communications of Democratic Party institutions\nand operatives before the 2016 U.S. election. Some of the most damaging materials used\nin the operation came via a simple breach of a Gmail account, an opportunity available\nto anyone. This also reinforces the challenge of discerning intent—what initially appears\nas espionage can later turn into an attack.[144]\n\nGiven Iran’s dispersed ecosystem of threat actors, deterring Tehran from engaging in\noffensive cyber operations is as challenging as other efforts to address security issues\ninvolving the country. Cyber activities are less likely to lead to regional destabilization\nthan are offline Iranian threats, and historically, Tehran’s disruptive attacks against nonIranian targets have been retaliation during hostilities rather than instigation toward\nnew conflicts. To maintain credibility at a time when Western surveillance activities\nare publicly exposed through leaked confidential documents, effective policy responses\nneed to differentiate espionage or signaling from sabotage or the infringement of human\nrights, actions that violate international norms. It is also important to recognize that\nIranian offensive cyber operations do not require technology transfers or the support of\nother states. Members of Iranian threat actors—primarily low-level software developers\n\n\n-----\n\nworking within a small number of companies—will continue to be tough to identify,\nprosecute, and punish.\n\nNaming and shaming may chill participation in state-aligned operations, especially\namong talented individuals looking to travel outside the country or study abroad.\nHowever, it is unclear whether those publicly identified with Operation Ababil or other\ncampaigns have changed their involvement after being outed. Moreover, the loosely\nconnected and small groups are not cost-effective targets for retaliatory cyber operations.\nIn the end, Iran maintains a large enough pool of sufficiently capable programmers to\nconduct basic campaigns. Therefore, while exposing Iranian cyber operations and operators may degrade and delay the development of better cyber capabilities, it will not fully\ndeter Iran.\n\n## POLICY APPROACHES TO IRAN’S CYBER THREAT\n\nThis leaves a select number of policy options, primarily (1) utilizing existing frameworks\nfor targeted sanctions or indictments, (2) improving information sharing on threats\nacross communities, and (3) supporting initiatives to improve information security.\n\nThe comprehensive sanctions regime against Iran is unlikely to substantially interfere\nwith its development of offensive cyber capabilities. Iranians commonly use servers\noutside the country, typically hosted on networks in Europe and Russia that provide\nservice to other cyber crime networks (bulletproof hosting) or registered using false\ninformation.[145] Since the resources necessary to improve capacity are organizational and\nprofessional development rather than computers or\ninfrastructure, there are few technological items or\n\n## The U.S. Treasury\n\nservices that could potentially be deterred. Further\n## Department’s Office of\n\nmore, overly broad sanctions regimes that attempt to\n\n## Foreign Assets Control constrain malicious cyber activities would be more maintains targeted likely to have substantial collateral damage on the\n\nfree flow of information to Iran, as Iranian civil soci\n## programs that can be\n\nety has widely argued.\n\n## brought to bear against international entities that Where sanctions are appropriate, the U.S. Treasury\n\nDepartment’s Office of Foreign Assets Control\n\n## augment Iran’s capacity\n\nmaintains targeted programs that can be brought\n\n## for surveillance against\n\nto bear against international entities that augment\n\n## its population. Iran’s capacity for surveillance against its population\n\n(Executive Order 13606[146]) and those responsible for\n\n\n-----\n\ncyber operations against American infrastructure (Executive Order 13694).[147] Sanctions\nand other financial mechanisms could be used to deter foreign countries or other actors\nfrom providing support to Iranian offensive cyber operations. Executive Order 13606\noffers an example in its authority to designate any entity, whether in Iran or elsewhere,\nthat has facilitated the Iranian government in its “computer and network disruption,\nmonitoring, and tracking.” While the order focuses on human rights, similar language\ncould focus on Tehran’s attacks against critical infrastructure and espionage. The narrowly\ntailored extension of these authorities could help ensure that Iran’s cyber operations do\nnot benefit from technology transfers or foreign assistance as Tehran expands its security\nand commercial ties, especially to countries such as Russia and China.\n\nAdditionally, the Justice Department has issued indictments against Iranians implicated\nin disruptive campaigns (the same individuals allegedly responsible for Operation Ababil\nwere also designated under Executive Order 13694) and has successfully obtained the\nextradition from a third country of a hacker involved in the theft of military secrets.[148]\nBecause of the small operational footprint of the groups, targeted sanctions or legal proceedings are more symbolic than disruptive, but few other opportunities exist to impose\nconsequences on individuals who participate in operations.\n\nGiven the level of rudimentary nature of its cyber operations, a purely political or legal\nresponse that is focused solely on deterring Iran would be ineffective toward addressing\nnational cybersecurity risks. Any system that can be breached by Iranian groups is equally\nsusceptible to others with similar sets of motivations, notably North Korea and Hamas.\nAn effective policy response to the threats posed by Iran must focus on securing critical\ninfrastructure overall.\n\nInformation sharing has been one of the most common strategies pursued by the United\nStates, Europe, and the private sector to reduce the effectiveness of Iranian cyber operations. After the Aramco attack, the United States used its superiority in monitoring and\nattributing Iranian activities to strengthen intelligence relationships with its Arab allies\nin the Persian Gulf.[149] This is an immensely valuable resource that should be extended\nwhere possible, and further support can be provided to regional allies. Similarly, the FBI\nhas provided notifications to and facilitated information sharing with the private sector\non specific Iranian campaigns. These efforts can be expanded to include more partners\nand to provide data to civil society organizations.\n\nUnlike traditional security issues, private individuals are more exposed to cyber operations owing to the transnational and virtual nature of threats. This brings in more\nstakeholders, and increases the burden on individuals to protect themselves from crime\nand espionage. Responsibility to protect those users rests equally on the private sector\nand governments. Fortunately, internet platforms and communications services, like\n\n\n-----\n\nFacebook and Google, have played a positive role in providing the tools to help individuals defend against attacks—even going so far as notifying users when they have been\ntargeted by state-aligned campaigns, including those from Iran. These initiatives raise the\nbar for attackers and should be seen within tech companies as a core obligation of keeping at-risk users safe.\n\nDiscussions about securing dissidents would be incomplete without highlighting the\npioneering role of the United States government and European development agencies\nin providing secure communications tools to activists—often referred to as the Internet\nFreedom agenda. Government funding has provided early stage investment for researchers and developers to produce prototypes and deployable products to protect activists and\ncivil society that would not be the focus of the private sector. A significant proportion, if\nnot majority, of Iranians that bypass the censorship regime do so using safe and reliable\ntools funded by the State Department and Broadcasting Board of Governors. Both have\nalso supported the development of encryption tools such as Signal that have even been\nadopted by tech companies within their own messaging applications, demonstrating the\nimportance of Internet Freedom as a public-private cooperation.\n\nThe United States and European Union should continue to promote programs and\nnorms on internet access and cybersecurity that prioritize the free and secure flow of\ninformation against challenges from countries such as Iran, China, and Russia. Aside\nfrom funding for civil society, this includes promotion of democratic values within\ninternet governance frameworks, such as the Internet Corporation for Assigned Names\nand Numbers (ICANN) and the International Telecommunications Union (ITU). This\nalso highlights the importance of domestic policy on Internet Freedom efforts: proposals\nto weaken information security products such as encrypted messaging applications would\nharm individuals in countries where rule of law is weak and backdoor access in communications networks is commonly repurposed for repression.\n\nAs the history of Iranian offensive cyber operations demonstrates, the same actors\nresponsible for espionage against the private sector engage in surveillance of human\nrights defenders, and with considerably more success, owing to the targets’ resource\nconstraints. These at-risk communities provide a canary for the tactics and tools that\nwill be employed against other targets, and increased information exchange will enable\nmore effective education and mitigation strategies for all. Policymakers have long understood that the changes that will lead Iran to be a productive member of the international\ncommunity will come from within. The safety and security of the Iranian civil society\norganizations and democratic voices targeted by government cyber operations should\nbe recognized and protected as the critical stakeholders within cybersecurity and foreign\npolicy discussions that they are.\n\n\n-----\n\n# GLOSSARY\n\n**Campaign: A set of activities carried out by threat actors for some particular purpose.**\n\n**Credential theft: The process of stealing credentials associated with online platforms,**\nsuch as passwords or account recovery information.\n\n**Distributed denial-of-service (DDoS): An attempt to make an online service unavail-**\nable by overwhelming it with traffic from multiple sources.\n\n**Offensive cyber operations: Cyberspace operations intended to project power by the**\napplication of force in or through cyberspace.\n\n**Sinkhole: Redirection of malicious internet traffic so that it can be captured and ana-**\nlyzed by security researchers.\n\n**Spearphishing: A targeted attack that uses a deceptive email to trick the recipient into**\nperforming some kind of dangerous action for the adversary.\n\n**Supply chain attack: The strategic compromise of a particular entity, such as a vendor,**\nwith the intent to indirectly compromise another, primary target, such as the vendor’s\nclients.\n\n**Threat actor: An individual or group involved in malicious cyber activity.**\n\n**Watering hole attack: The compromise of a selected website in order to stage intrusion**\nattempts through malware to the visitors of the site.\n\n\n-----\n\n-----\n\n# NOTES\n\n1 “Department of Defense Dictionary of Military and Associated Terms,” Federation of American\nScientists, amended February 15, 2016, https://fas.org/irp/doddir/dod/jp1_02.pdf.\n2 The authors cannot identify under what level of authority the attacks are authorized and whether Iran\nwill professionalize such operations under state security forces. However, they can say with high\nconfidence that such activities are coordinated with the Iranian government. See Jason Healey, “Beyond\nAttribution: Seeking National Responsibility for Cyber Attacks,” Atlantic Council, February 22, 2012,\nhttp://www.atlanticcouncil.org/publications/issue-briefs/beyond-attribution-seeking-nationalresponsibility-in-cyberspace.\n3 This material will posted on “Iran Threats,” Github, https://iranthreats.github.io.\n4 GReAT, “The Madi Campaign – Part I,” SecureList, July 17, 2012, https://securelist.com/blog/\nincidents/33693/the-madi-campaign-part-i-5.\n5 David E. Sanger, “Obama Order Sped Up Wave of Cyberattacks Against Iran,” New York Times, June 1,\n2012, http://www.nytimes.com/2012/06/01/world/middleeast/obama-ordered-wave-of-cyberattacksagainst-iran.html.\n6 The preparation for Operation Olympic Games was substantial. Intelligence agencies in the United\nStates and Israel obtained confidential information about the specific configuration of the centrifuge\ncontrollers in Natanz, built a test environment based on comparable hardware seized from Libya, and\nthen deployed the malware agent through human assets inside Iran to reach computers disconnected\nfrom the internet. These operations were sustained over years. Later versions of Stuxnet exploited several\npreviously unknown vulnerabilities and sought to strategically infect other computers in Iran in the\nevent that they were connected to the Natanz systems.\n7 Iran’s National Computer Emergency Response Team, Kaspersky Lab, and CrySyS Lab.\n8 Ellen Nakashima, Greg Miller, and Julie Tate, “U.S., Israel Developed Flame Computer Virus to Slow\nIranian Nuclear Efforts, Officials Say,” Washington Post, June 19, 2012, https://www.washingtonpost\n.com/world/national-security/us-israel-developed-computer-virus-to-slow-iranian-nuclear-effortsofficials-say/2012/06/19/gJQA6xBPoV_story.html.\n\n\n-----\n\n9 “Iran Says Detected ‘Massive Cyber Attack:’ State TV,” Reuters, June 21, 2012, https://www.reuters\n.com/article/us-iran-cyber-nuclear/iran-says-detected-massive-cyber-attack-state-tv-idUSBRE85K1EA20120621.\n10 “Iran ‘Fends Off New Stuxnet Cyber Attack,’” BBC News, December 25, 2012, http://www.bbc.com/\nnews/world-middle-east-20842113.\n11 Communications Security Establishment Canada, “SNOWGLOBE: From Discovery to Attribution,”\naccessed December 4, 2017, a presentation discussing the French malware otherwise known as Babar,\navailable at http://www.spiegel.de/media/media-35683.pdf.\n12 Karim Sadjadpour, “Reading Khamenei: The World View of Iran’s Most Powerful Leader,” Carnegie\nEndowment for International Peace, March 10, 2008, http://carnegieendowment.org/files/sadjadpour_\niran_final2.pdf.\n13 “15 June 2009 – Tehran – Iran – Protest continued – Protesters Are Going to Freedom (Azadi Sq),”\nYouTube video, 1:02, posted by “saeidkermanshah,” June 15, 2009, https://www.youtube.com/\nwatch?v=9_hr7G4At84.\n14 A common example of this collaboration is when Twitter had planned to conduct maintenance after the\nJune 2009 election. The State Department requested that the company delay the downtime in consideration of the protests. See Sue Pleming, “U.S. State Department Speaks to Twitter Over Iran,” Reuters,\nJune 16, 2009, http://www.reuters.com/article/us-iran-election-twitter-usa-idUSWBT01137420090616. More aggressively, in an opinion piece in the Wall Street Journal, a former\nunder secretary of state and an assistant secretary of defense advocated for increased funding for\ncommunications tools and foreign broadcasting efforts with the express intent to “undermine the\nregime in Tehran.” See James K. Glassman and Michael Doran, “The Soft Power Solution in Iran,” Wall\n_Street Journal, January 21, 2010, http://www.wsj.com/articles/SB100014240527487045410045750113_\n94258630242.\n15 The day before the March 2012 Iranian parliamentary elections, employees of the BBC were unable to\naccess their email owing to a DDoS attack attributed to Iran. The Mujahedin-e Khalq has also claimed\nthat when its former encampment in Iraq, Camp Liberty, was attacked in February 2013, its websites\nwere subjected to a sustained DDoS attack designed to interfere with reporting. “Cyber-attack on BBC\nLeads to Suspicion of Iran’s Involvement,” BBC News, March 14, 2012, www.bbc.com/news\n/technology-17365416.\n16 One document used as bait in the malware campaign appears to be a secret letter from the Ministry of\nIntelligence to members of the religious establishment in Qom concerning the protests over subsidies.\nAnother displayed maps in Tehran describing protest routes toward Azadi Square, mirroring the\nactivities on the ground. The malware agent would arise again over time in attempts to compromise the\nAmerican defense industrial base in May 2014, and again in the Shamoon 2 attacks.\n17 _Black Tulip: Report of the Investigation Into the DigiNotar Certificate Authority breach (Delft: Fox-IT BV,_\n2012), https://www.rijksoverheid.nl/binaries/rijksoverheid/documenten/rapporten/2012/08/13/\nblack-tulip-update/black-tulip-update.pdf. In a confidential document on its own ability to monitor\nsecure traffic, the UK Government Communications Headquarters (GCHQ) provides an account of\nthe DigiNotar event, discovered in the course of its own espionage on Iran. GCHQ asserts that an\nIranian intelligence agency added a specific rule in an internet router that forced Google’s traffic\nthrough an alternative route inside the country. “Profiling SSL and Attributing Private Networks,”\nGCHQ, December 28, 2014, https://edwardsnowden.com/2015/01/07/profiling-ssl-and- attributingprivate- networks/.\n18 Akbar Ganji, “Iran’s Green Movement Five Years Later – ‘Defeated’ But Ultimately Victorious,”\nHuffington Post, accessed December 4, 2017, https://www.huffingtonpost.com/akbar-ganji/iran-greenmovement-five-years_b_5470078.html.\n\n\n-----\n\n19 The most conspicuous and potentially only counterexample could be Oilrig, which across a multiple\nyear history appears primarily focused on foreign targets and has not been publicly linked to attacks\nagainst Iranians.\n20 Figures for both the United States and Iran are kept secret, however, a leaked intelligence budget for the\n2013 provides some insight into how cyber operations are funded. Barton Gellman and Ellen Nakashima, “U.S. Spy Agencies Mounted 231 Offensive Cyber-Operations in 2011, Documents Show,”\n_Washington Post, August 30, 2013, https://www.washingtonpost.com/world/national-security/us-spy-_\nagencies-mounted-231-offensive-cyber-operations-in-2011-documents-show/2013/08/30/d090a6ae119e-11e3-b4cb-fd7ce041d814_story.html.\n21 “Minister: Iran Faces 500 Daily Cyber Attacks,” Khabar Online, November 10, 2012, http://english\n.khabaronline.ir/detail/183007.\n22 “We just want to monitor (enemies’) cultural and social moves in cyber,” quoted in “IRGC to Set Up\nDivision to Defend Iran Against Cyber Threats,” Sahar TV, October 16, 2012, http://english.sahartv.ir/\nnews/irgc-to-set-up-division-to-defend-iran-against-cyber-threats-1638.\n23 “Statement by Foreign Ministry Spokesman for Indictment of US Justice Department Against Seven\nIranian Citizens,” Iranian Ministry of Foreign Affairs, March 26, 2016, http://mfa.gov.ir/index.aspx?fke\nyid=&siteid=1&pageid=2122&newsview=385735.\n24 Alexander Gostev, “What Is Flame Malware?,” Kaspersky Lab, accessed December 5, 2017, https://\nwww.kaspersky.com/flame.\n25 “US Cyber Attack on Iranian Oil Ministry Foiled,” FARS News Agency, May 26, 2015, http://\nen.farsnews.com/print.aspx?nn=13940305001092.\n26 “Iran Unveils 12 Cyber Products,” FARS News Agency, December 14, 2013, http://en.farsnews.com/\nnewstext.aspx?nn=13920923001322.\n27 “Iranian Internet Infrastructure and Policy Report: Special Edition – The Rouhani Review (2013–15),”\nSmall Media, 2015, https://smallmedia.org.uk/sites/default/files/u8/IIIP_Feb15.pdf; Office of the Press\nSecretary, “Fact Sheet: Cybersecurity National Action Plan,” White House, press release, February 9,\n2016, https://obamawhitehouse.archives.gov/the-press-office/2016/02/09/fact-sheet-cybersecuritynational-action-plan; and Steve Morgan, “Bank of America’s Unlimited Cybersecurity Budget Sums Up\nSpending Plans in a War Against Hackers,” Forbes, January 27, 2016, https://www.forbes.com/sites/\nstevemorgan/2016/01/27/bank-of-americas-unlimited-cybersecurity-budget-sums-up-spending-plansin-a-war-against-hackers/#694de941264c.\n28 Barbara Slavin and Jason Healey, “Iran: How a Third Tier Cyber Power Can Still Threaten the United\nStates,” Atlantic Council, July 29, 2013, http://www.atlanticcouncil.org/publications/issue-briefs/\niran-how-a-third-tier-cyber-power-can-still-threaten-the-united-states.\n29 Recent espionage incidents targeting U.S. State Department employees have been described in the press\nas “attacks” that sought to “jab at the United States and its neighbors without provoking a military\nresponse.” Despite the implication of aggression, the incident appeared to be motivated for espionage.\nDavid E. Sanger and Nicole Perlroth, “Iranian Hackers Attack State Dept. via Social Media Accounts,”\n_New York Times, November 24, 2015, http://www.nytimes.com/2015/11/25/world/middleeast/_\niran-hackers-cyberespionage-state-department-social-media.html.\n30 Michael N. Schmitt, “Cyber Operations and the Jus Ad Bellum Revisited,” Villanova Law Review\n(December 2011): 569–605.\n31 Michael N. Schmitt, Tallinn Manual on the International Law Applicable to Cyber Warfare (Cambridge:\nCambridge University Press, 2013). U.S. officials have acknowledged that international law applies to\nactions in cyberspace as well. Patrick Tucker, “NSA Chief: Rules of War Apply to Cyberwar, Too,”\nDefense One, April 20, 2015, http://www.defenseone.com/technology/2015/04/nsa-chief-rules-warapply-cyberwar-too/110572/.\n\n\n-----\n\n32 Carmen-Cristina Cîrlig, “Cyber Defence in the EU: Preparing for Cyber Warfare?,” briefing, European\nParliament, October 2014, http://www.europarl.europa.eu/EPRS/EPRS-Briefing-542143-Cyberdefence-in-the-EU-FINAL.pdf.\n33 As has been documented in intelligence material leaked by Edward Snowden: “Iran – Current Topics,\nInteraction With GCHQ,” Intercept, February 10, 2015, https://theintercept.com/\ndocument/2015/02/10/iran-current-topics-interaction-gchq/.\n34 International law also differentiates interference, nonviolent operations such as propaganda, and\npsychological operations, so long as they are not sufficiently coercive. Schmitt, “Cyber Operations and\nthe Jus Ad Bellum Revisited.”\n35 Tim Maurer, Cyber Mercenaries: The State, Hackers, and Power (Cambridge: Cambridge University Press,\n2018).\n36 Ibid.\n37 The tools and resources developed by Tehran have been almost uniformly described by outside\ninvestigators as unsophisticated, particularly in comparison with malware produced by other state and\nnonstate actors. The information security company Mandiant affirmed this observation in a 2014\nreport: “Mandiant’s observations of suspected Iranian actors have not provided any indication that they\npossess the range of tools or capabilities that are hallmarks of a capable, full-scope cyber actor. They rely\non publicly available tools and capitalize solely on Web-based vulnerabilities—constraints that suggest\nthese cyber actors have relatively limited capabilities.” See: Mandiant, “M-Trends 2014 Annual Threat\nReport: Beyond the Breach by Mandiant, a FireEye Company,” accessed December 5, 2017, https://\nwww2.fireeye.com/fireeye-mandiant-m-trends-report.\n38 For example, former representative Peter Hoekstra speculated at a U.S. House hearing that Iran’s\nadvances in cyberwarfare came from the “cooperation they have with Russia.” Other former and current\nofficials have commented, often on background, that Russia was a potential partner in warfare. For the\nsubcommittee hearing on Iran’s support terrorism worldwide, see the following: “Iran’s Support for\nTerrorism Worldwide,” Foreign Affairs Committee, March 4, 2014, https://foreignaffairs.house.gov/\nhearing/joint-subcommittee-hearing-irans-support-for-terrorism-worldwide/. Elsewhere, claims have\nbeen made by lesser known cybersecurity companies, but these analyses have been flawed and not well\naccepted. For more on these flawed analyses, see: Collin Anderson, “Bears and Kittens, and Startup\nCybersecurity Companies,” Medium, May 18, 2017, https://medium.com/@collina/bears-and-kittensand-startup-cybersecurity-companies-5c8e037ea75c.\n39 Steve Stecklow, “Exclusive: Huawei Partner Offered U.S. Tech to Iran,” Reuters, October 25, 2012,\nhttp://www.reuters.com/article/us-huawei-iran/exclusive-huawei-partner-offered-u-s-tech-to-iran-idUSBRE89O0E520121025; and “Iran and Russia Announce Plans for Cyber Security Cooperation,”\nYouTube video, 2:03, posted by “PressTV News Videos,” March 15, 2017, https://www.youtube.com/\nwatch?v=NaCukjiECWM.\n40 This could be either indicative of the ceiling of Iran’s capabilities or reflective of Iran not facing the sort\nof existential threat that would provoke it to use any latent resources in its arsenal. The former appears\nmore likely.\n41 Rocket Kitten and Flying Kitten are examples of how the line demarcating intrusion groups is not\nalways clear. The structural similarities of certain intrusion tools and the reuse of lesser known infrastructure indicate that parts of Flying Kitten and Rocket Kitten may have had a common heritage,\nincluding common members and shared tools; see: Collin Anderson, “Flying Kitten to Rocket Kitten, A\nCase of Ambiguity and Shared Code,” Iran Threats, December 5, 2017, https://iranthreats.github.io/\nresources/attribution-flying-rocket-kitten/. In the Shamoon 2 campaign, McAfee attributed unusual\nerrors to the “involvement of different groups/individuals with different skills, whereas in 2012 we\nbelieve one group was responsible for the attack.” See: Christiaan Beek and Raj Samani, “The State of\n\n\n-----\n\nShamoon: Same Actor, Different Lines,” McAfee, April 25, 2017, https://securingtomorrow.mcafee\n.com/executive-perspectives/state-shamoon-actor-different-lines/.\n42 The authors associate Rocket Kitten with the IRGC due to its involvement in post-arrest hacking. For\nmore on Rocket Kitten, see: “Rocket Kitten 2 – Follow-Up on Iran Originated Cyber-Attacks,”\n_ClearSky Cybersecurity (blog), September 1, 2015, http://www.clearskysec.com/rocket-kitten-2. For_\nmore on Oilrig, see: Robert Falcone and Bryan Lee, “The OilRig Campaign: Attacks on Saudi Arabian\nOrganizations Deliver Helminth Backdoor,” Palo Alto Networks, March 26, 2016, https://\nresearchcenter.paloaltonetworks.com/2016/05/the-oilrig-campaign-attacks-on-saudi-arabianorganizations-deliver-helminth-backdoor/.\n43 Reportedly, the attacker found sensitive passwords saved in a file named “Administrator Passwords.”\nSee: Sam Jones, “Cyber Warfare: Iran Opens a New Front,” Financial Times, April 26, 2016, http://app\n.ft.com/cms/s/15e1acf0-0a47-11e6-b0f1-61f222853ff3.html?sectionid=companies. No official numbers\nhave been provided on the economic loss, and in its annual review report for the year, Aramco\ndownplayed the impact of the attack. “Shaping Tomorrow: 2012 Annual Review,” Saudi Aramco, April\n10, 2013, http://www.saudiaramco.com/en/home/news-media/publications/corporate-reports/\nannual-review-2012.html.\n44 The caveat attending this statement is that it is possible more incidents and actors have yet to be\ndisclosed.\n45 Based on a Freedom of Information Act request by the authors to the Broadcasting Board of Governors\non cybersecurity incidents related to Iran, which returned details of the attack, involving compromising\nthe VOA’s account through impersonation with falsified documents sent through a fax.\n46 The intruders were able to find a weakness in a web development server for the Bethlehem, Pennsylvania, location, and doing so then gave them access to the internal corporate network. Benjamin Elgin\nand Michael Riley, “Nuke Remark Stirred Hack on Sands Casinos That Foreshadowed Sony,” Bloom_berg, December 10, 2014, http://www.bloomberg.com/news/articles/2014-12-11/nuke-remark-stirred-_\nhack-on-sands-casinos-that-foreshadowed-sony.\n47 Symantec Security Response, “Shamoon: Back From the Dead and Destructive as Ever,” Symantec\n_Connect (blog), November 30, 2016, https://www.symantec.com/connect/blogs/shamoon-back-dead-_\nand-destructive-ever; “From Shamoon to StoneDrill: Wipers Attacking Saudi Organizations and\nBeyond,” Kaspersky Lab, July 3, 2017, https://securelist.com/files/2017/03/Report_Shamoon_StoneDrill_final.pdf.\n48 ITSec Team, one of the companies cited in the indictment, has a known track record as the developer of\na web penetration testing product (Havij Pro), and is attributed in a number of vulnerability disclosures\nand tools for controlling remote systems that have been made available to security researchers. The\ninfrastructure used in the attacks even remains publicly exposed to the internet years after its use.\n49 Seth Hardy, et al., “Targeted Threat Index: Characterizing and Quantifying Politically-Motivated\nTargeted Malware,” 23rd USENIX Security Symposium (2014): 527–41, https://www.usenix.org/\nnode/184440.\n50 Jacob Appelbaum, Aaron Gibson, Claudio Guarnieri, et al., “NSA Preps America for Future Battle,”\n_Der Spiegel, January 17, 2015, http://www.spiegel.de/international/world/new-snowden-docs-indicate-_\nscope-of-nsa-preparations-for-cyber-battle-a-1013409.html.\n51 Curiously, when Google disclosed the spearphishing campaigns that Magic Kitten was involved in, it\nnoted to the New York Times that there was a relationship between the operation and the DigiNotar\nincident. Nicole Perlroth, “Google Says It Has Uncovered Iranian Spy Campaign,” Bits (blog), New York\n_Times, June 12, 2013, https://bits.blogs.nytimes.com/2013/06/12/google-says-it-has-uncovered-iranian-_\nspy-campaign/.\n\n\n-----\n\n52 “CrowdStrike Global Threat Report: 2013 Year in Review,” CrowdStrike, January 2014, https://\nscadahacker.com/library/Documents/Threat_Intelligence/CrowdStrike%20-%20Global%20Threat%20\nReport%202013.pdf.\n53 The lack of clarity in the slides is also compounded by the age of the document and could reflect an\narrangement that is no longer in effect. However, within observations of activity, there does appear to be\na clustering of victims, with some samples of the malware agent specifically used to compromise\nLebanese and Qatari victims, but not Iranians or other targets of exclusive interest to Iran.\n54 Members of the infamous Ashiyane hacking community and others commonly broke into Arabic media\nand U.S. government sites with political messages, such as protesting alternative names for the Persian\nGulf, Western perceptions of Islam, nuclear rights, the administration of George W. Bush, and the\ncrimes of other countries—often in broken English and always bearing attribution. In a few cases these\ncampaigns were sustained over longer periods of time and were intended to make a point, especially\nwhen it came to Israeli and Saudi targets. “Al Khaleej Newspaper Website Hacked,” Gulf News, March\n7, 2017, http://gulfnews.com/news/uae/general/al-khaleej-newspaper-website-hacked-1.106195;\nZone-H mirror page, “fdfhome.gsfc.nasa.gov hacked. Notified by Mafia Hacking Team,” archived on\nMay 26, 2005, http://www.zone-h.org/mirror/id/7494752; Zone-H mirror page, “lvis.gsfc.nasa.gov\nhacked. Notified by Ashiyane Digital Security Team,” archived on August 11, 2005, http://www.zone-h\n.org/mirror/id/2757516; Zone-H mirror page, “technology.jpl.nasa.gov hacked. Notified by hamid,”\narchived on December 28, 2005, http://www.zone-h.org/mirror/id/3183620.\n55 Aspects of this can be found in the individuals documented in Dan McWhorter, “APT1: Exposing One\nof China’s Cyber Espionage Units,” Mandiant, 2013, https://www.fireeye.com/content/dam/\nfireeye-www/services/pdfs/mandiant-apt1-report.pdf.\n56 Sheera Frenkel, “Meet the Mysterious New Hacker Army Freaking Out the Middle East,” BuzzFeed\nNews, June 24, 2015, https://www.buzzfeed.com/sheerafrenkel/who-is-the-yemen-cyber-army; and\nBrian Bartholomew and Juan Andres Guerrero-Saade, “Wave Your False Flags! Deception Tactics\nMuddying Attribution in Targeted Attacks,” Virus Bulletin Conference (October 2016): 1–11, https://\ncdn.securelist.com/files/2016/10/Bartholomew-GuerreroSaade-VB2016.pdf.\n57 In its indictment, it even went as far as claiming that one individual had received relief from mandatory\nmilitary service in return for participation. United States of America v. Ahmad Fathi et al., unsealed\nMarch 24, 2016, https://www.justice.gov/opa/file/834996/download. The attribution for the campaigns\nand indication of the American intelligence community’s early attribution of the participants are\nevident in screenshots from a presentation on the NSA’s CyberCOP program from April 2013, which\ndescribes the scale of the DDoS attacks and the infrastructure behind the botnet in its later phases of\noperation. See: “CyberCOP,” presentation, CyberCOP Product Manager, April 11, 2013, http://www\n.ndr.de/ratgeber/verbraucher/cybercop100.pdf.\n58 Zone-H mirror page, “www.karroubi.ir hacked. Notified by Sun Army,” archived on February 17, 2010,\nhttp://www.zone-h.org/mirror/id/10269967.\n59 Florian Egloff, “Cybersecurity and the Age of Privateering: A Historical Analogy,” Cyber Studies\nProgram Working Paper no. 1 (Oxford: University of Oxford, March 2015), http://www.politics.ox.ac\n.uk/materials/centres/cyber-studies/Working_Paper_No.1_Egloff.pdf.\n60 Richard Barger, “There’s Something About Mahdi,” Threat Connect, July 23, 2012, https://www\n.threatconnect.com/blog/there-is-something-about-mahdi/; and “Summary of Mortalkombat.com,”\nWayback Machine Internet Archive, accessed September 17, 2017, https://web-beta.archive.org/\nweb/20080415000000*/m0rtalkombat.com.\n61 Flying Kitten has also established Pars Security (Pars Pardazesh Hafez Shiraz). The FBI had made similar\nallegations not only for the culprits of Operation Ababil, companies named Mersad and ITSecTeam,\nbut also in the Arrow Tech Associates theft. The FBI’s indictment claims that two other individuals\n\n\n-----\n\nformed a company, Andisheh Vesal Middle East Company, to steal software on behalf of the Iranian\ngovernment. United States of America v. Mohammed Saeed Ajily and Mohammed Reza Rezakhah,\nunsealed July 17, 2017, https://www.justice.gov/opa/press-release/file/982106/download.\n62 For those on the ground the threats posed are more complex and multifaceted. For example, Iranian\ntelecommunications firms appear to have cooperated with the government in order to provide access to\nthe recovery and two-factor authentication codes sent by text. These then allowed access to Google,\nTelegram, and other accounts on foreign platforms.\n63 The most significant counterevidence of state-alignment is that when the Infy group was disclosed by\nPalo Alto in May 2016, the domains used in the communications of the malware were filtered by the\ncensorship apparatus, blocking access to those victims. There are explanations for this action that would\nnot conflict with the theory that Infy was acting on behalf of the government, including that the\ncensorship was intended to hide evidence of the operation from the Iranian public.\n64 Specifically, we observed direct interactions between the Iranian state and the groups Charming Kitten,\nFlying Kitten, Magic Kitten, and Rocket Kitten. More tenuous links exist for Infy based on this criteria.\n65 “Rocket Kitten: A Campaign With 9 Lives,” Check Point Software Technologies Ltd., November 9,\n2015, https://blog.checkpoint.com/wp-content/uploads/2015/11/rocket-kitten-report.pdf.\n66 The incident was orchestrated by a threat actor who had registered domains under cmprus1394[@]\nmail[.]ru and teymurov1984[@]gmail[.]com, which impacts a vast network of espionage and criminal\nactivity.\n67 _United States of America v. Behzad Mesri, a/k/a “Skote Vahshat,” unsealed November 21, 2017, https://_\nwww.justice.gov/usao-sdny/press-release/file/1013001/download.\n68 Robin Wright, “An American Hostage in Iran – Again,” New Yorker, October 30, 2015, http://www\n.newyorker.com/news/news-desk/an-american-hostage-in-iran-again.\n69 A dual national who had previously worked with a foreign broadcaster was arrested two weeks after his\nemail was also compromised after a phishing attempt. According to one account, the attacker attempted\nto extract a ransom to keep the victim’s private information, which was ignored. Then, after the arrest,\nthe accounts were again used to target others.\n70 “Iranian Billionaire Babak Zanjani Sentenced to Death,” BBC News, March 6, 2016, http://www.bbc\n.com/news/world-middle-east-35739377.\n71 These intrusions reflected a studied understanding of Sorinet’s operations and included names such as\n“Baharak Zanjani” that appear on the corporate registrations of the company’s subsidiaries but are\nbelieved to be false identities. See article in Farsi, Young Journalists Club, February 2, 2013, http://\nwww.yjc.ir/fa/news/4744029/%D9%85%D8%A7%D8%AC%D8%B1%D8%A7%DB%8C-%D8%\nAE%D9%88%D8%A7%D9%87%D8%B1%D8%A7%D9%86%D8%AC%D8%B9%D9%84%DB%8C-%D8%A8%D8%A7%D8%A8%DA%A9-%D8%B2%D9\n%86%D8%AC%D8%A7%D9%86%DB%8C.\n72 Iranian security and intelligence agencies have however frequently used blackmail and humiliation to\nintimidate or coerce individuals, including BBC Persian journalists. It is possible that material compromised through intrusions has been used for political manipulation, as this would be difficult to observe\nwithout acknowledgement from the victim. For examples of blackmail threats, see: Elise Knutsen,\n“Iranian Agents Blackmailed BBC Reporter With ‘Naked Photos’ Threats,” Arab News, November 19,\n2017, http://www.arabnews.com/node/1195681/media.\n73 Based on monitoring of known registration information used by Charming Kitten, suspicious domains\ninclude saudi-government[.]com and saudi-haj[.]com.\n74 “Verfassungsschutzbericht 2015” (in German), German Ministry of the Interior, June 2016, https://\nwww.verfassungsschutz.de/de/download-manager/_vsbericht-2015.pdf; “Phishing uden fangst:\nUdenrigsministeriet under angreb” (in Danish), Center for Cybersikkerhed, Ministry of Defense,\n\n\n-----\n\nJanuary 2016, https://fe-ddis.dk/cfcs/CFCSDocuments/Phishing%20uden%20fangst.pdf; and\n“Security Warning-Shamoon 2,” CERT.sa, accessed December 5, 2017, http://www.cert.gov.sa/index\n.php?option=com_content&task=view&id=714&Itemid=0.\n75 U.S. National Security Agency, “Iran – Current Topics, Interaction With GCHQ,” Intercept, written\nJanuary 8, 2007, published February 10, 2015, https://theintercept.com/document/2015/02/10/\niran-current-topics-interaction-gchq/.\n76 David Crawford, “U.N. Probes Iran Hacking of Inspectors,” Wall Street Journal, May 19, 2011, http://\nwww.wsj.com/articles/SB10001424052748704281504576331450055868830. The IAEA would later\nbe targeted by an Iranian hacktivist group, calling itself Parastoo, in November 2012, when a web server\nwas compromised, and the information on its employees was posted online, with the implied threat of\nanother Aramco attack. For Parastoo’s statement, see http://cryptome.org/2012/11/parastoo-hacks-iae\na.htm.\n77 First disclosed by Kaspersky Lab and Seculert in July 2012; see “The Madi Campaign – Part I,”\nSecureList. While researchers noted the religious implications of the inclusion of the word “mahdi.txt”\nin the malware’s operations, other versions appeared to include other Persian names and words such as\n“otahare.” It seems more likely that the inclusion was not meant as a religious declaration.\n78 Later attributed by Cylance as Operation Cleaver. Unnamed U.S. government officials had characterized the breach as “carried out by hackers working directly for Iran’s government or by a group acting\nwith the approval of Iranian leaders,” see: “U.S. Says Iran Hacked Navy Computers,” Wall Street\n_Journal, September 27, 2013,https://www.wsj.com/articles/us-says-iran-hacked-navy_\n-computers-1380314771.\n79 ClearSky, “Jerusalem Post and Other Israeli Websites Compromised by Iranian Threat Agent CopyKitten,” ClearSky Cybersecurity (blog), March 30, 2017, http://www.clearskysec.com/copykitten-jpost/; and\n“Brief Summary, 2016 Report on the Protection of the Constitution: Facts and Trends,” German\nMinistry of the Interior, 2016, https://www.verfassungsschutz.de/embed/annual-report-2016-summary\n.pdf.\n80 Hillary R. Clinton investigation records, https://vault.fbi.gov/hillary-r.-clinton. See in particular\nDocument 3, an FBI Interview from February 3, 2016.\n81 Direct observation of the targets of the Charming Kitten group. The email addresses and names of those\ntargeted in these campaigns appear to have been sourced from the Podesta emails released by\nWikiLeaks.\n82 Alan Cowell, “Blast Kills Physics Professor in Tehran,” New York Times, January 12, 2010, http://www\n.nytimes.com/2010/01/13/world/middleeast/13iran.html; and Dan Raviv and Yossi Melman,\n_Spies Against Armageddon: Inside Israel’s Secret Wars (BookBaby, 2014)._\n83 The attempted bombings occurred February 13, 2012, one month after the assassination of Mostafa\nAhmadi Roshan (on January 11, 2012) and four years after the death of Imad Mughniyah (on February\n12, 2008).\n84 First hand observation of the activities of the Charming Kitten group, similar to the successful\noperation described in the Operation Cleaver report by Cylance.\n85 “Top Daily DDoS Attacks Worldwide: Saudi Arabia,” Digital Attack Map, January 2, 2016, http://\nwww.digitalattackmap.com/#anim=1&color=0&country=SA&list=1&time=16802.6&view=map.\n86 “From Shamoon to StoneDrill,” Kaspersky Lab.\n87 “‘Sophisticated’ and ‘Genius’ Shamoon 2.0 Malware Analysis,” Coding and Security, December 3,\n2016, https://www.codeandsec.com/Sophisticated-CyberWeapon-Shamoon-2-Malware-Analysis.\n88 Symantec Security Response, “The Madi Attacks: Series of Social Engineering Campaign,” Symantec\n_Connect (blog), July 17, 2012, https://www.symantec.com/connect/blogs/madi-attacks-series-social-_\nengineering-campaigns.\n\n\n-----\n\n89 Kirk Soluk, “DDoS and Geopolitics – Attack Analysis in the Context of the Israeli-Hamas Conflict,”\nArbor Networks, August 5, 2014, https://www.arbornetworks.com/blog/asert/ddos-and-geopoliticsattack-analysis-in-the-context-of-the-israeli-hamas-conflict/.\n90 Although one Israeli intelligence official has stated that “they are not the state of the art, they are not the\nstrongest superpower in the cyber dimension, but they are getting better and better,” disclosing that Iran\ncontinues to attempt to compromise Israeli systems. Ari Rabinovitch, Tova Cohen, and Dan Pleck,\n“Iran’s Hacking Ability Improving: Israeli General,” Reuters, October 31, 2017, https://www.reuters\n.com/article/us-cyber-summit-padan/irans-hacking-ability-improving-israeli-general-idUSKBN1D02O0.\n91 U.S. National Security Agency, “(U) Fourth Party Opportunities: I Drink Your Milkshake,” Der Speigel,\npublished January 17, 2015, http://www.spiegel.de/media/media-35684.pdf.\n92 Directly collected indicators from a sinkhole of malware associated with the Infy group.\n93 For example, in Check Point’s Rocket Kitten report, included in the group’s infrastruture were domains\nmirroring the Afghan Ministry of Defense. Similar domains and targets can be found later that are\nconnected to the same group.\n94 Directly collected indicators from the Infy group; discussed further in relation to Iran’s targeting of\nethnical minority groups.\n95 Directly collected indicators from the Flying Kitten group. The recipients of these spearphishing\ncampaigns included a wide range of journalists and political groups, such as the Coordination Council\nof Yemen Revolution Youth, Yemen Center for Human Rights, Social and Democracy Forum of Yemen,\nand Yemen Parliamentarians Against Corruption. The leaked NSA slide indicates that Magic Kitten also\nbreached Yemeni computers, but the nature of the targets is unclear, and the document predates the\nonset of the civil war in Yemen.\n96 “Group5: Syria and the Iranian Connection,” Citizen Lab, August 2, 2016, https://citizenlab\n.org/2016/08/group5-syria/.\n97 “Volatile Cedar: Threat Intelligence and Research,” Check Point Software Technologies Ltd., March 30,\n2015, https://www.checkpoint.com/downloads/volatile-cedar-technical-report.pdf.\n98 One striking and related claim made in November 2017 was that the Iranian threat actor Oilrig had\ncompromised Lebanese politicians in order to run an information operation in support of Hezbollah in\nthe 2018 general election. See: Patrick Saint-Paul, “Téhéran sponsor d’un piratage massif contre le\ngouvernement d’Hariri” (in French), Le Figaro, November 26, 2017, http://www.lefigaro.fr/\ninternational/2017/11/26/01003-20171126ARTFIG00124-teheran-sponsor-d-un-piratage-massifcontre-le-gouvernement-d-hariri.php.\n99 Michael Corkery and Matthew Goldstein, “North Korea Said to Be Target of Inquiry Over $81 Million\nCyberheist,” New York Times, March 22, 2017, https://www.nytimes.com/2017/03/22/business/\ndealbook/north-korea-said-to-be-target-of-inquiry-over-81-million-cyberheist.html?mcubz=0; “Lazarus\nUnder the Hood,” Kaspersky Lab, April 3, 2017, https://securelist.com/files/2017/04/Lazarus_Under_\nThe_Hood_PDF_final.pdf.\n100 United States of America v. Mohammed Saeed Ajily and Mohammed Reza Rezakhah.\n101 “Iran Sanctions 15 U.S. Firms, Citing Human Rights Abuses and Israel Ties,” Reuters, March 26, 2017,\nhttp://www.reuters.com/article/us-iran-usa-sanctions-idUSKBN16X0DL.\n102 Jaqueline O’Leary, Josiah Kimble, Kelli Vanderlee, and Nalani Fraser, “Insights Into Iranian Cyber\nEspionage: APT33 Targets Aerospace and Energy Sectors and Has Ties to Destructive Malware,”\nFireEye, September 20, 2017, https://www.fireeye.com/blog/threat-research/2017/09/apt33-insightsinto-iranian-cyber-espionage.html.\n103 Ryan Gallagher, “The Inside Story of How British Spies Hacked Belgium’s Largest Telco,” Intercept,\nDecember 13, 2014, https://theintercept.com/2014/12/13/belgacom-hack-gchq-inside-story/.\n\n\n-----\n\n104 “Iran Telecoms, Internet Report 2016-2017,” Financial Tribune, April 26, 2017, https://\nfinancialtribune.com/articles/economy-sci-tech/63062/iran-telecoms-internet-report-2016-17.\n105 For example, the mobile chat applications and voice over internet protocol (VOIP) services, such as\nViber, Skype, and Telegram, that became popular replacements for standard telephony and text\nmessaging bypass the lawful interception capacities traditionally embedded in phone systems.\n106 One significant example is Telegram, which has reached over 40 million users in Iran as of 2017. As a\nresult of its use of encryption, it is not susceptible to the filtering of specific content or keywords. While\nboth Iranian authorities and Telegram have never been fully forthcoming about their relationship, it is\nclear that the former has attempted to incentivize and threaten Telegram into complying with requests\nfor the removal of content—including briefly blocking the service in October 2015. While it appears\nthat Telegram does take down pro–Islamic State content, it has not thus far complied with other\nrequests.\n107 Collin Anderson, “How Iran Is Building Its Censorship-Friendly Domestic Internet,” Backchannel\n(blog), Wired, September 23, 2016, backchannel.com/how-iran-is-building-its-censorship-friendlydomestic-internet-11db69aae96d.\n108 Joseph Menn and Yeganeh Torbati, “Exclusive: Hackers Accessed Telegram Messaging Accounts in\nIran—Researchers,” Reuters, August 2, 2016, http://www.reuters.com/article/us-iran-cyber-telegramexclusive-idUSKCN10D1AM.\n109 Fereydoun has been the target of a corruption investigation, which has been perceived as an attempt to\nundermine Rouhani. Regardless of the legitimacy of these claims, the attempts against Fereydoun began\nearly in Rouhani’s first term and targeted his family. This extended into impersonating Zarif to target\nFereydoun and vice versa. The long-term focus suggests the targeting was related to politics rather than\nthe criminal investigation.\n110 Aresu Eqbali, “Back Home, Iran’s Leader Tries to Sell Nuclear Deal,” Wall Street Journal, July 16, 2015,\nhttp://www.wsj.com/articles/back-home-irans-leader-tries-to-sell-nuclear-deal-1437081590.\n111 Aresu Eqbali and Asa Fitch, “Iran Accuses Man Involved in Nuclear Deal Negotiations of Spying,” Wall\n_Street Journal, August 28, 2016, https://www.wsj.com/articles/iran-accuses-man-involved-in-nuclear-_\ndeal-negotiations-of-spying-1472416462.\n112 Hanif Kashani, “Zarif, Attacked But Unscathed,” Iran Wire, September 17, 2013, https://en.iranwire\n.com/features/2665/.\n113 Such as the use of mobile phone interception to capture login credentials for Telegram and Google\naccounts. In other cases, elaborate ruses appeared to be set up based on private political information in\norder to convince the target to run malware.\n114 Based on data acquired through forensic investigations of Flying Kitten and Charming Kitten’s\ncredential theft campaigns.\n115 On April 19, 2016, the Google and Facebook accounts of Shahindokht Molaverdi, at that time Iran’s\nvice president for Women and Family Affairs, were compromised by Rocket Kitten in order to conduct\na spearphishing campaign against women’s rights activists.\n116 The ban was imposed in February 2015. “Rouhani and Judiciary Clash Over Ban on Publishing Images\nof Former President Khatami,” Center for Human Rights in Iran, December 21, 2015, https://www\n.iranhumanrights.org/2015/12/khatami-media-ban-and-etelaat-newspaper/.\n117 Collin Anderson, “Dimming the Internet: Detecting Throttling as a Mechanism of Censorship in Iran,”\narXiv.org, June 18, 2013, http://arxiv.org/abs/1306.4361.\n118 Specifically, Flying Kitten, Infy, and Magic Kitten.\n119 “Iran Accelerates Crackdown on Media and Dissidents Prior to Election,” International Campaign for\nHuman Rights in Iran, June 10, 2013, https://www.iranhumanrights.org/2013/06/iran_election/.\n\n\n-----\n\n120 Parthisan, “Abtahi’s Blog Was Hacked for Revealing Torture Details,” Persian Students in the UnitedKingdom, January 2, 2005, hosted by Internet Archive, https://web.archive.org/web/20050123083526/\nhttp://www.persianstudents.org/archives/001269.html.\n121 Based on observation of the Rocket Kitten’s social engineering attempts against foreign human rights\nactivists that appeared to use a breached account belonging to Abtahi.\n122 Based on data acquired from a malware command and control server found through forensic investigation of Flying Kitten activity.\n123 Gholam Ali Rajaee, “Warning!” (in Farsi), December 27, 2015, http://www.gholamalirajaee.blogfa.\ncom/post/1152/%D9%87%D8%B4%D8%AF%D8%A7%D8%B1.\n124 “Iran: Baha’is Educating Their Youth Is a ‘Conspiracy’ Against the State,” Baha’i World News Service,\nJuly 27, 2011, http://news.bahai.org/story/843. In response to this persecution, the Baha’i community\nhas become particularly adept at using the internet for international advocacy and countering exclusion,\nincluding offering online distance learning classes from the Baha’i Institute for Higher Education.\n125 The Infy malware agent, as directly observed in January 2016.\n126 Shima Shahrabi, “Iran’s New Criminals: Fashion Models,” Iran Wire, February 2, 2016, https://\nen.iranwire.com/features/7058.\n127 Based on data acquired from a malware command and control server found through forensic investigation of Flying Kitten activity.\n128 FireEye (through its iSIGHT Partners) has also noted that threat actors focused on the Islamic State as\nthe militant group was expanding its territory across Iraq, an interest expressed by the threat actors well\nbefore 2015. David E. Sanger and Nicole Perlroth, “Iranian Hackers Attack State Dept. via Social\nMedia Accounts,” New York Times, November 24, 2015, http://www.nytimes.com/2015/11/25/world/\nmiddleeast/iran-hackers-cyberespionage-state-department-social-media.html.\n129 In one case a shared computer in Erbil, Iraq, used by a Kurdish supporter of a Jordanian jihadi figure\nwas compromised through the malware, which was delivered as personal pictures sent by a fictitious\nfemale social network profile. The same group maintained phishing sites with hard-coded references to\nFacebook pages associated with the Islamic State’s “Ministry of Information,” Tunisian Islamic Awakening, Lashkar-e-Khorasan (Pakistan), and al-Qaeda affiliates, among other Islamist movements. This\ntargeting was broad, but more effort was spent on Persian-language or Iran-oriented actors, targeting\nFacebook pages as small as one with five members and one public post, a “Salafe Kurdistan” page.\n130 The operations reflect old rivalries from the Islamic Revolution being played out, as Flying Kitten\nsought access to accounts and sites associated with Marxist-Leninist Fedaian and other Communist\nparties as well.\n131 Some of the first observed operations of the Infy group targeted Taftaan News Agency and the Jonbesh­e\nMoqavemat­e Mardomi­e Iran separatist group, and compromised computers in the province of Sistan\nand Balochistan over the course of several years. Shortly after the suspected time of intrusion, at least\none of the affected blogs warned its visitors that an old email address connected to the site had been\ncompromised by Iranian intelligence agencies. The following day the administrators closed the site,\nclaiming technical issues.\n132 Several Infy malware samples had names such as “pjak.pps” and other references to Marxist ideologies\n(such as “kargar.pps,” or “worker”).\n133 For example, current and former employees of the organization, both with the Iran Program and\ngeneral operations staff, have been engaged by several fictitious personas on LinkedIn and Facebook,\nincluding the persona “Victoria Roberts,” the LinkedIn profile name described earlier as connecting\npredominantly with defense companies. The existing networks of these profiles reflect a specific interest\nin the American foreign policy establishment, international development programs, and the defense\nindustrial base.\n\n\n-----\n\n134 Healey defines “state-integrated” as the “national government integrates third-party attackers and\ngovernment cyber forces, with common command and control.” This still allows for informal coordination with external parties so long as the government remains in control. While Iranian threat actors\nreceive tasking from the government, there is little indication that any of them are formal members of\nthe security forces.\n135 Based on a Freedom of Information Act request by the authors to the Broadcasting Board of Governors\non cybersecurity incidents related to Iran.\n136 David M. Faris and Babak Rahimi, eds., Social Media in Iran: Politics and Society After _2009 (Albany,_\nNY: SUNY Press, 2015).\n137 An FBI notice sent to private industry on May 29, 2014, described a similar set of personas that\nexpanded on the iSIGHT Partners’ (now FireEye) Operation Newscaster report that was released a few\ndays prior. While iSIGHT Partners identified fourteen accounts of American or European background,\nthe FBI provided a list of fifty-six unique personas, of which fifteen had family names that appeared to\nbe Persian and had not been identified in the previous report. The accounts identified by the FBI have\nbeen since deleted, but appeared to have been Iran-focused. Federal Bureau of Investigation, “FBI\nNotification: Malicious Cyber Actors Targeting U.S. Government Networks and Employees,” Public\nIntelligence, June 23, 2014, https://publicintelligence.net/fbi-cyber-targeting-gov-networks/.\n138 John Hultquist, “Sandworm Team and the Ukrainian Power Authority Attacks,” Threat Research (blog),\nFireEye, January 7, 2016, https://www.fireeye.com/blog/threat-research/2016/01/ukraine-and-sandworm-team.html.\n139 “A Dam, Small and Unsung, Is Caught Up in an Iranian Hacking Case,” New York Times, March 25,\n2015, https://www.nytimes.com/2016/03/26/nyregion/rye-brook-dam-caught-in-computer-hackingcase.html. FireEye (which owns Mandiant) has described multiple cases of “Iran-based network\nreconnaissance activity,” including unauthorized intrusions into several U.S. state government agencies.\n“FireEye Releases Annual Mandiant Threat Report on Advanced Targeted Attacks,” FireEye, April 10,\n2014, http://investors.fireeye.com/releasedetail.cfm?ReleaseID=839454.\n140 Alex Vatanka, “The Iranian Industrial Complex: How the Revolutionary Guards Foil Peace,” Foreign\n_Affairs, October 17, 2016, https://www.foreignaffairs.com/articles/iran/2016-10-17/iranian-industrial-_\ncomplex.\n141 For example, when Iranian state–aligned media have covered such issues in recent years, it has typically\nbeen through republishing English-language reports without substantial further comment or by\nreporting on denials by the government, such as when Mashregh News covered Citizen Lab’s August\n2015 “London Calling” report and took issue with claims about attribution.\n142 Adam Segal, “Why China Hacks the World,” Christian Science Monitor, January 31, 2016, http://www\n.csmonitor.com/World/Asia-Pacific/2016/0131/Why-China-hacks-the-world.\n143 “Iran Loses $150 Billion a Year Due to Brain Drain,” MEHR News Agency, January 8, 2014, http://\nen.mehrnews.com/news/101558/Iran-loses-150-billion-a-year-due-to-brain-drain.\n144 Secure Works Counter Threat Unit, “ThreatGroup-4127 Targets Hillary Clinton Presidential Campaign,” Secureworks.com, June 16, 2016, https://www.secureworks.com/research/threat-group4127-targets-hillary-clinton-presidential-campaign.\n145 The compromises of several certificate authorities by “ComodoHacker,” the individual responsible for\nthe DigiNotar breach, appear to have used a stolen Israeli credit card for registering domains used in the\nattack.\n146 Office of the Press Secretary, “Executive Order: Blocking the Property and Suspending Entry Into the\nUnited States of Certain Persons With Respect to Grave Human Rights Abuses by the Governments of\nIran and Syria via Information Technology,” White House, news release, April 23, 2012, https:/\n/www.treasury.gov/resource-center/sanctions/Programs/Documents/2012iran_syria_eo.pdf.\n\n\n-----\n\n147 “Sanctions Related to Significant Cyber-Enabled Malicious Activities,” U.S. Department of the\nTreasury, last modified August 9, 2017, https://www.treasury.gov/resource-center/sanctions/Programs/\npages/cyber.aspx.\n148 Members of Iranian threat actors do travel to countries that the United States has successfully received\nextraditions from.\n149 Cory Bennett, “White House Pledges Cyber Cooperation With Gulf Leaders,” Hill, May 14, 2015,\nhttp://thehill.com/policy/cybersecurity/242162-white-house-pledges-cyber-cooperation-with-gulfstates; and Ellen Nakashima, “As Cyberwarfare Heats Up, Allies Turn to U.S. Companies for Expertise,”\n_Washington Post, November 22, 2012, https://www.washingtonpost.com/world/national-security/_\nas-cyberwarfare-heats-up-allies-turn-to-us-companies-for-expertise/2012/11/22/a14f764c-192c-11e2bd10-5ff056538b7c_story.html?utm_term=.63ff1d99cfba.\n\n\n-----\n\n# CARNEGIE ENDOWMENT  FOR INTERNATIONAL PEACE\n\n**THE CARNEGIE ENDOWMENT FOR INTERNATIONAL PEACE**\nis a unique global network of policy research centers in Russia, China, Europe, the Middle\nEast, India, and the United States. Our mission, dating back more than a century, is to\nadvance the cause of peace through analysis and development of fresh policy ideas and\ndirect engagement and collaboration with decisionmakers in government, business, and\ncivil society. Working together, our centers bring the inestimable benefit of multiple\nnational viewpoints to bilateral, regional, and global issues.\n\n**THE CARNEGIE MIDDLE EAST PROGRAM combines in-depth local**\nknowledge with incisive comparative analysis to examine economic, sociopolitical, and\nstrategic interests in the Arab world. Through detailed country studies and the exploration\nof key cross-cutting themes, the Carnegie Middle East Program, in coordination with the\nCarnegie Middle East Center, provides analysis and recommendations in both English and\nArabic that are deeply informed by knowledge and views from the region. The Carnegie\nMiddle East Program has special expertise in political reform and Islamist participation in\npluralistic politics throughout the region.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.01.04.Iran_Cyber_Threat_Carnegie/Iran_Cyber_Final_Full_v2.pdf"
    ],
    "report_names": [
        "Iran_Cyber_Final_Full_v2"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e575ba5a-702c-4a64-9bda-c4b1061210e5",
            "created_at": "2022-10-25T16:07:23.245788Z",
            "updated_at": "2025-03-27T02:02:09.999902Z",
            "deleted_at": null,
            "main_name": "Magic Kitten",
            "aliases": [],
            "source_name": "ETDA:Magic Kitten",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf0704ab-99e4-44d7-96d9-3cba91339229",
            "created_at": "2022-10-25T15:50:23.485375Z",
            "updated_at": "2025-03-27T02:00:55.482473Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [
                "Group5"
            ],
            "source_name": "MITRE:Group5",
            "tools": [
                "njRAT",
                "NanoCore"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9aa9b489-a297-4dbd-8601-8fc0370201a6",
            "created_at": "2022-10-25T16:07:23.696796Z",
            "updated_at": "2025-03-27T02:02:09.928416Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [],
            "source_name": "ETDA:Group5",
            "tools": [
                "Atros2.CKPN",
                "Bladabindi",
                "DroidJack",
                "Jorik",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "59c9f31b-e032-44b9-bf3b-4f2cb3d17e39",
            "created_at": "2022-10-25T16:07:23.734244Z",
            "updated_at": "2025-03-27T02:02:09.952685Z",
            "deleted_at": null,
            "main_name": "Infy",
            "aliases": [
                "APT-C-07",
                "Infy",
                "Operation Mermaid",
                "Prince of Persia"
            ],
            "source_name": "ETDA:Infy",
            "tools": [
                "Foudre",
                "Infy",
                "Tonnerre"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b07fec96-80cd-4d92-aa52-a26a0b25b7c2",
            "created_at": "2022-10-25T16:07:23.826594Z",
            "updated_at": "2025-03-27T02:02:09.994638Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [
                "Mahdi"
            ],
            "source_name": "ETDA:Madi",
            "tools": [
                "Madi"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d7c5a1bf-85c9-4d2f-bdbd-1455f5f2ae65",
            "created_at": "2022-10-25T16:07:23.978074Z",
            "updated_at": "2025-03-27T02:02:10.059972Z",
            "deleted_at": null,
            "main_name": "Operation Olympic Games",
            "aliases": [
                "GOSSIPGIRL"
            ],
            "source_name": "ETDA:Operation Olympic Games",
            "tools": [
                "Stuxnet",
                "W32.Stuxnet"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e7c75c6-097f-4d80-8c98-73485fe2a729",
            "created_at": "2022-10-25T16:07:24.386715Z",
            "updated_at": "2025-03-27T02:02:10.203847Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Dancing Salome",
                "DeftTorero"
            ],
            "source_name": "ETDA:Volatile Cedar",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Adminer",
                "DirBuster",
                "GoBuster",
                "JuicyPotato",
                "RottenPotato",
                "SharPyShell"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bb08058c-a744-4129-aa80-10aa34ed8766",
            "created_at": "2022-10-25T16:07:24.474826Z",
            "updated_at": "2025-03-27T02:02:10.245391Z",
            "deleted_at": null,
            "main_name": "Cyber fighters of Izz Ad-Din Al Qassam",
            "aliases": [
                "Cyber fighters of Izz Ad-Din Al Qassam",
                "Fraternal Jackal",
                "QCF",
                "Qassam Cyber Fighters"
            ],
            "source_name": "ETDA:Cyber fighters of Izz Ad-Din Al Qassam",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9663cdbf-646e-4579-881a-a8ebc3aabf63",
            "created_at": "2023-01-06T13:46:38.360862Z",
            "updated_at": "2025-03-27T02:00:02.814167Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "ITsecTeam"
            ],
            "source_name": "MISPGALAXY:Cutting Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "efeeab6a-219e-4a45-9b2f-9f77c647ffd2",
            "created_at": "2023-01-06T13:46:38.370366Z",
            "updated_at": "2025-03-27T02:00:02.816514Z",
            "deleted_at": null,
            "main_name": "Magic Kitten",
            "aliases": [
                "Group 42"
            ],
            "source_name": "MISPGALAXY:Magic Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "322a0ef1-136b-400e-89d0-0d62ee2bd319",
            "created_at": "2023-01-06T13:46:38.662109Z",
            "updated_at": "2025-03-27T02:00:02.885938Z",
            "deleted_at": null,
            "main_name": "Madi",
            "aliases": [],
            "source_name": "MISPGALAXY:Madi",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "094d8210-4c64-4457-ad97-a94fc7af7630",
            "created_at": "2023-01-06T13:46:38.98103Z",
            "updated_at": "2025-03-27T02:00:02.968603Z",
            "deleted_at": null,
            "main_name": "Group5",
            "aliases": [
                "G0043"
            ],
            "source_name": "MISPGALAXY:Group5",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "49f1ada0-181f-4e89-a449-e6bc13c8c6b1",
            "created_at": "2022-10-25T15:50:23.561511Z",
            "updated_at": "2025-03-27T02:00:55.499988Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Threat Group 2889",
                "TG-2889"
            ],
            "source_name": "MITRE:Cleaver",
            "tools": [
                "Net Crawler",
                "PsExec",
                "TinyZBot",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bc5c22a8-29eb-4a87-acd6-4817060e80f2",
            "created_at": "2022-10-25T15:50:23.658256Z",
            "updated_at": "2025-03-27T02:00:55.514297Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Volatile Cedar",
                "Lebanese Cedar"
            ],
            "source_name": "MITRE:Volatile Cedar",
            "tools": [
                "Caterpillar WebShell"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dabb6779-f72e-40ca-90b7-1810ef08654d",
            "created_at": "2022-10-25T15:50:23.463113Z",
            "updated_at": "2025-03-27T02:00:55.47619Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "APT1",
                "Comment Crew",
                "Comment Group",
                "Comment Panda"
            ],
            "source_name": "MITRE:APT1",
            "tools": [
                "Seasalt",
                "ipconfig",
                "Cachedump",
                "PsExec",
                "GLOOXMAIL",
                "Lslsass",
                "PoisonIvy",
                "WEBC2",
                "Mimikatz",
                "gsecdump",
                "Pass-The-Hash Toolkit",
                "Tasklist",
                "xCmd",
                "pwdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e09a7338-fb16-4e39-b579-c3bfc3140c47",
            "created_at": "2022-10-25T16:07:24.207294Z",
            "updated_at": "2025-03-27T02:02:10.140203Z",
            "deleted_at": null,
            "main_name": "Snowglobe",
            "aliases": [
                "ATK 8",
                "Animal Farm",
                "SIG20",
                "Snowglobe"
            ],
            "source_name": "ETDA:Snowglobe",
            "tools": [
                "Babar",
                "Casper",
                "Chocopop",
                "Dino",
                "EvilBunny",
                "Nbot",
                "TFC",
                "Tafacalou"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f763fd1f-f697-40eb-a082-df6fd3d13cb1",
            "created_at": "2023-01-06T13:46:38.561288Z",
            "updated_at": "2025-03-27T02:00:02.861874Z",
            "deleted_at": null,
            "main_name": "Infy",
            "aliases": [
                "Operation Mermaid",
                "Prince of Persia",
                "Foudre"
            ],
            "source_name": "MISPGALAXY:Infy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "217c588a-5896-4335-b9ec-a516ae2f9a7e",
            "created_at": "2022-10-25T16:07:23.513775Z",
            "updated_at": "2025-03-27T02:02:09.838687Z",
            "deleted_at": null,
            "main_name": "Cutting Kitten",
            "aliases": [
                "Cutting Kitten",
                "Operation Cleaver",
                "TG-2889"
            ],
            "source_name": "ETDA:Cutting Kitten",
            "tools": [
                "CsExt",
                "DistTrack",
                "IvizTech",
                "Jasus",
                "KAgent",
                "Logger Module",
                "MANGOPUNCH",
                "MPK",
                "MPKBot",
                "Net Crawler",
                "NetC",
                "PVZ-In",
                "PVZ-Out",
                "Pupy",
                "PupyRAT",
                "PvzOut",
                "Shamoon",
                "SynFlooder",
                "SysKit",
                "TinyZBot",
                "WndTest",
                "pupy",
                "zhCat",
                "zhMimikatz"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "548a4081-aa8f-4e2a-bcb3-0c9dfa61944f",
            "created_at": "2023-01-06T13:46:38.443779Z",
            "updated_at": "2025-03-27T02:00:02.835042Z",
            "deleted_at": null,
            "main_name": "SNOWGLOBE",
            "aliases": [
                "Snowglobe",
                "ATK8",
                "Animal Farm"
            ],
            "source_name": "MISPGALAXY:SNOWGLOBE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "17b152bc-6f7e-463c-8b4c-a4844caea6df",
            "created_at": "2023-01-06T13:46:38.498795Z",
            "updated_at": "2025-03-27T02:00:02.849085Z",
            "deleted_at": null,
            "main_name": "Volatile Cedar",
            "aliases": [
                "Lebanese Cedar",
                "DeftTorero"
            ],
            "source_name": "MISPGALAXY:Volatile Cedar",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716503,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1513697964,
    "ts_modification_date": 1514888280,
    "files": {
        "pdf": "https://archive.orkl.eu/4f9469a732dd8c2d32c8a2b017e9378e95e40611.pdf",
        "text": "https://archive.orkl.eu/4f9469a732dd8c2d32c8a2b017e9378e95e40611.txt",
        "img": "https://archive.orkl.eu/4f9469a732dd8c2d32c8a2b017e9378e95e40611.jpg"
    }
}