{
    "id": "8d465eb7-dbb2-4e37-b8b9-9d229f6d8e8f",
    "created_at": "2023-01-12T15:04:28.328252Z",
    "updated_at": "2025-03-27T02:09:18.514629Z",
    "deleted_at": null,
    "sha1_hash": "ff446ed408d7abe50b0472afdbfd45dd5a73de6e",
    "title": "2022-05-27 - BAZARLOADER- Analysing The Main Loader",
    "authors": "",
    "file_creation_date": "2022-06-01T12:23:14Z",
    "file_modification_date": "2022-06-01T12:23:14Z",
    "file_size": 2708324,
    "plain_text": "# BAZARLOADER: Analysing The Main Loader\n\n**0ffset.net/reverse-engineering/analysing-the-main-bazarloader/**\n\n[Chuong Dong](https://www.0ffset.net/author/chuong-dong/)\n27th May 2022\nNo Comments\n\n\nMay 27, 2022\n\n\nThis post is a follow up on the last one on BAZARLOADER. If you’re interested in how to unpack the initial stages of this malware, you can\ncheck it out [here.](https://www.0ffset.net/reverse-engineering/bazarloader-iso-file-infection/)\n\nIn this post, we’ll cover the final stage of this loader, which has the capability to download and executes remote payloads such as Cobalt Strike\n[and Conti ransomware. To follow along, you can grab the sample as well as the PCAP files for it on Malware-Traffic-Analysis.net.](https://www.malware-traffic-analysis.net/2022/02/07/index.html)\n\n## Step 1: Checking System Languages\n\nSimilar to a lot of malware, BAZARLOADER manually checks the system’s languages to avoid executing on machines in Russia and nearby\ncountries.\n\nIt calls GetSystemDefaultLangID to retrieve the system’s default language and GetKeyboardLayoutList to iterate through the system’s\nkeyboard layouts.\n\n\n-----\n\nFor each of these languages, the malware checks if it’s valid using a bitmask.\n\nIf the language identifier is greater than 0x43 or less than 0x18, it’s treated as valid and BAZARLOADER proceeds with its execution.\n\nIf it’s in the range between 0x18 and 0x43, the difference between the language identifier and 0x18 is used as the index of the bit to be\nchecked in the bitmask.\n\nThe bitmask that BAZARLOADER uses is 0xD8080190C03, which is 11011000000010000000000110010000110000000011 in binary. The first\nbit in the bitmask is checked if the language ID is 0x18. The second bit is checked if the language ID is 0x19, and so on…\n\nBelow is the list of all languages from the bitmask that the malware avoids.\n```\nRomanian, Russian, Ukrainian, Belarusian, Tajik, Armenian, Azerbaijani, Georgian, Kazakh, Kyrgyz, Turkmen, Uzbek\n\n## Step 2: Run-Once Mutex\n\n```\nTo check for multiple running instances of itself, BAZARLOADER first extracts the subauthority of a SID from its process. It does this by calling\n**GetTokenInformation to retrieve the process’s token integrity level and calling GetSidSubAuthorityCount and GetSidSubAuthority to**\naccess the subauthority of a SID.\n\n\n-----\n\nIf the SID’s subauthority is SECURITY_MANDATORY_SYSTEM_RID or SECURITY_MANDATORY_PROTECTED_PROCESS_RID,\nBAZARLOADER checks if the mutex “{b837ef4f-10ee-4821-ac76-2331eb32a23f}” is currently owned by any other process by calling\n**CreateMutexA.**\n\nIf it is, the malware terminates itself. However, there is a small bug with the condition to check if the mutex object exists, which assumes it fails\nto open the mutex when it actually succeeds.\n\nAfter this, the malware resolves the string “{0caa6ebb-cf78-4b01-9b0b-51032c9120ce}” and tries to create a mutex with that name.\n\n\n-----\n\nIf this mutex object already exists, the malware also terminates itself.\n\nIf the SID’s subauthority is not SECURITY_MANDATORY_SYSTEM_RID or SECURITY_MANDATORY_PROTECTED_PROCESS_RID,\nBAZARLOADER still uses these two mutex names but adds the string “Global\\” in front of them. This checks for the mutexes in the global\nnamespace instead of the per-session namespace, which allows the malware to check if it has instances running in other users’ sessions.\n\n## Step 4: Generating Random Internet Traffic\n\nTo generate Internet activities to hide its communication with C2 servers, BAZARLOADER first calls InternetOpenA to initialize the use of\n**WinINet functions with the following string as the HTTP user agent.**\n```\nMozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like Gecko\n\n```\nThe malware then spawns a thread to periodically connect to random URLs and generate noises to hide the main C2 traffic by utilizing the\nfollowing structure.\n```\nstruct random_internet_thread_struct\n{\n  HINTERNET internet_sess_handle;\n  HANDLE thread_handle;\n  random_internet_thread_struct *self;\n  LPCRITICAL_SECTION critical_section;\n  __int64 padding[4];\n  int creation_flag;\n};\n\n```\nFirst, BAZARLOADER calls InitializeCriticalSection to initialize the structure’s critical section object, which is later used to protect accesses\nto the creation flag field.\n\n\n-----\n\nNext, it sets the self field to point to the structure, the creation_flag field to TRUE, andcalls CreateThread to spawn a thread to perform these\nrandom Internet operations. If it fails to create a thread, the creation_flag field is set to FALSE.\n\nThe thread first tries to obtain ownership of the critical section object and check if the creation flag is enabled. If it is, the malware resolves the\nfollowing URLs as stack strings.\n```\nhttps://google.com/api/get\nhttps://yahoo.com/api/get\nhttps://amazon.com/api/get\nhttps://bing.com/api/get\n\n```\n\n-----\n\nNext, the thread enters an infinite loop to start generating the traffic noises. For random number generation, BAZARLOADER uses different\nfunctions that call the Windows API BCryptGenRandom to generate a set number of random bytes.\n\nIt randomly chooses one of the 4 URLs listed above, randomly generates the URL path segments for that, and combines the two to build the\nfull URL.\n\nTo generate the path segments, the function takes in the minimum and maximum numbers of path segments to generate and the minimum and\nmaximum length for each path segment.\n\nIt generates a count for the path segments randomly in the given range. For each of the segments, the malware randomly generates a string\nwith a random length in the given range that contains numbers and uppercase/lowercase letters.\n\n\n-----\n\nFinally, the malware calls InternetOpenURLA to establish a connection with the generated URL. It calls HTTPQueryInfoA with the\n**HTTP_QUERY_CONTENT_LENGTH flag to retrieve the content’s length, allocates a buffer with that size, and calls InternetReadFile to read**\ndata from that URL.\n\nThis is done repeatedly until C2 communication and payload injection are finished, which generates a lot of noise to mask the main traffic\ncoming to and from C2 servers.\n\n## Step 4: Cryptographic Structure Population\n\nBAZARLOADER mainly uses the following structure for communication with C2 servers. The fields of the structure will be explained as we go\nalong analyzing the code.\n\n\n-----\n\n```\n{\n  C2_connection_struct C2_connection_struct;\n  HINTERNET C2_request_handle;\n  HINTERNET C2_temp_request_handle;\n  crypto_struct crypto_struct;\n  SYSTEMTIME curr_system_time;\n  char *datetime_string;\n  _QWORD datetime_string_hash;\n  unsigned int *datetime_string_hash_len;\n  opennic_server_struct opennic_DNS_server_struct;\n  string_struct_list C2_addr_list;\n};\n\n```\nFirst, it populates the crypto_struct field in the main structure. This structure contains cryptographic handles that are later used to decrypt\nexecutables being sent from C2 servers.\n\nThe structure can be reconstructed as below.\n```\nstruct crypto_struct\n{\n  BCRYPT_ALG_HANDLE RSA_algo_handle;\n  BCRYPT_ALG_HANDLE SHA384_algo_handle;\n  BCRYPT_KEY_HANDLE RSA_public_key_handle;\n  BCRYPT_KEY_HANDLE RSA_private_key_handle;\n  DWORD RSA_public_block_length;\n  DWORD RSA_private_block_length;\n};\n\n```\nThe malware resolves the strings “RSA” and “SHA384” and calls BCryptOpenAlgorithmProvider to retrieve handles for these two\nalgorithms. The handles are stored in the corresponding fields in the crypto_struct structure.\n\nNext, it resolves its hard-coded RSA public and private key blobs in memory to import their corresponding key handles.\n\n\n-----\n\nFor each blob, the malware resolves one of the strings “RSAFULLPRIVATEBLOB” or “RSAPUBLICBLOB” and uses it to specify the blob’s\ntype when calling BCryptImportKeyPair to import the corresponding key handle.\n\nFinally, it calls BCryptGetProperty to retrieve the length of the RSA public and private cipher blocks. With this structure fully populated,\nBAZARLOADER can now perform RSA encryption/decryption as well as SHA384 hashing.\n\n## Step 5: C2 Connection Through Raw IP Addresses\n\nPrior to communicating with C2 servers, BAZARLOADER first resolves a list of raw IP addresses and writes them into the C2_addr_list field in\nthe main structure.\n\nThis field is a structure representing a list of string structures, both of which can be reconstructed as below.\n\n\n-----\n\n```\n{\n  char *buffer;\n  char *length;\n  char *max_length;\n};\nstruct string_struct_list\n{\n  string_struct *list_ptr;\n  __int64 count;\n  __int64 max_count;\n};\n\n```\nBelow is the list of all IP addresses for the C2 servers used in this sample.\n```\nhttps://5[.]182[.]207[.]28:443\nhttps://80[.]71[.]158[.]42:443\nhttps://198[.]252[.]108[.]16:443\nhttps://84[.]32[.]188[.]136:443\n\n```\nFor each of these addresses, the malware attempts to communicate with the corresponding server and download the next stage executable.\n\nTo establish a connection, it populates the following structure.\n```\nstruct C2_connection_struct\n{\n  URL_COMPONENTSA C2_URL_components;\n  HINTERNET connection_handle;\n  __int64 connection_last_error;\n};\n\n```\nThe malware calls InternetCrackUrlA to retrieve the C2’s URL components and InternetConnectA to connect to the server.\n\n\n-----\n\nThis connection structure’s fields are then copied into the main structure’s C2_connection_struct. Here, I’m not entirely sure why they don’t\njust populate the main structure directly instead.\n\nSimilarly, BAZARLOADER populates the structure below to create an HTTP request to C2. The request’s object name and HTTP verb are\nresolved to be “/data/service” and “GET”.\n```\nstruct C2_request_struct\n{\n  HINTERNET request_handle;\n  __int64 request_error;\n};\n\n```\n\n-----\n\nThe request’s HTTP version is resolved to be “HTTP/1.1”, and BAZARLOADER calls HttpOpenRequestA to create this request for the C2\nserver using the connection handle retrieved above.\n\nIt also calls InternetSetOptionA to set the timeout for receiving a response and sending the request to 300 seconds and the timeout for\nconnecting to C2s to 120 seconds.\n\nBAZARLOADER then generates the HTTP header to be appended to the request. It does this by calling GetSystemTime to populate the\n**curr_system_time and the datetime_string field of the main structure with the current date and time.**\n\nIt also generates the SHA384 hash of the datetime string to populate the structure’s datetime_string_hash and datetime_string_hash_len\nfields.\n\n\n-----\n\nNext, BAZARLOADER signs the generated hash with its RSA private by calling BCryptSignHash and uses this hash signature to randomly\ngenerate the HTTP header.\n\nBelow is the form of the random HTTP header.\n\nBAZARLOADER’s HTTP Header\nDate: Tue, 17 May 2022 20:18:27 GMT\n\nCookie:\nCGIC=YKK%2BIFrld%2FC5FqKj%2Fq1F9a06T0WgC4cOvCqqo3cfsyww1EwAb2TNFWqy8wBcDtObrgkjKtmIBSnsD%2Bmn2eR6MzQeUvHqOBJ\n\nX-Tag:\nf1DOF2QJkbCTJAUqiSLclK%2BsRkiAFHGmQusq2an%2FAud1WpfWVK%2F6gpLmtEQ38e65ILH8bHOzUd51lMpkh2xmHI5WpDJHgCtz5Q%2F%\n\nVary:\nx564msS%2Bd%2BIrc97apj6SftcyuZTeoDUdyeLRN7n%2BkEJYVoJYAeuxpHT1XhTQ%2FywsKB7tZuNCJpid2qbr5DtOphE9Yvu2MfVTPH7nuK3y\n\nVar:\nwG852ANm2aHtGTrbsFHawff1eBZc9MnnPFOLEWeX3o7Ulc0fSj1qhaw%2BFlqpKs6ABhhs4opIe%2Bs%2BKqhT5G3jw9xRH%2FxeEYysL5AYbH\n\n\n-----\n\nWith the generated HTTP header and the request handle, BAZARLOADER calls HttpSendRequestA to send the request to the C2 server and\ncalls HttpQueryInfoA to retrieve the status code.\n\nIf the status code is not HTTP_STATUS_OK, the malware moves on to another C2 address.\n\nIf the status code is HTTP_STATUS_OK, BAZARLOADER calls InternetQueryDataAvailable to determine the size of data to read, allocates\nthe memory buffer according to the size, and calls InternetReadFile to read the next-stage payload until everything is written into memory.\n\n\n-----\n\nFinally, the malware decrypts the payload with its RSA public key by calling BCryptDecrypt and checks to make sure the payload’s size is\ngreater than 64 bytes and that it contains an MZ header.\n\n## Step 6: C2 Connection Through Custom URLs\n\nIf BAZARLOADER fails to download the next stage executable from the IP addresses listed above, it attempts to resolve custom C2 domains\nusing [OpenNIC, a user-owned DNS community service.](https://www.opennic.org/)\n\nTo begin querying OpenNIC’s API, the malware first resolves the URL “api.opennicproject.org” and calls InternetConnectA to establish a\nconnection to the site.\n\n\n-----\n\nNext, it calls HttpOpenRequestA to create a GET request handle with the object name “/geoip/?bare&ipv=4&wl=all&res=8” and send the\nrequest using HttpSendRequestA.\n\n[By examining OpenNIC’s APIs, we can break down this object name to see what BAZARLOADER is requesting. The “bare” parameter](https://wiki.opennic.org/api/geoip)\nrequests to only list the DNS server IP address, the “ipv” parameter requests to only list IPv4 servers, the “wl” parameter requests to only list\nwhitelisted servers, and the “res” parameter requests to list 8 servers only.\n\nTo test this, we can simply paste the path below to a browser of our choosing.\n```\napi.opennicproject.org/geoip/?bare&ipv=4&wl=all&res=8\n\n```\nThe malware then enters a loop to call InternetQueryDataAvailable and InternetReadFile to read the 8 OpenNIC’s DNS servers into\nmemory.\n\n\n-----\n\nFor each DNS server IP address, BAZARLOADER parses it from string to int and populates the opennic_server_struct field in the main\nstructure. Below is the structure used to store OpenNIC IP addresses.\n```\nstruct opennic_server_struct\n{\n  _QWORD init_server_count;\n  HINTERNET opennic_internet_handle;\n  DWORD opennic_server_IP_list[7];\n  _BYTE gap2C[28];\n  _QWORD server_count;\n};\n\n```\n\n-----\n\nFinally, the malware decodes the following custom C2 domains, attempts to resolve them using the DNS servers, and downloads the nextstage executable.\n```\nreddew28c[.]bazar\nbluehail[.]bazar\nwhitestorm9p[.]bazar\n\n```\nFor each of these custom domains, BAZARLOADER calls DnsQuery_A to query a DNS Resource Record from OpenNIC’s servers to resolve\nthe C2 server’s IP address.\n\n\n-----\n\nte c ec g t e add ess s a d, t e a a e t es co ect g to t a d equests to do oad t e e t stage e ecutab e s a to at\nwe have seen in the previous step.\n\n## Step 5: Injection Through Process Hollowing\n\nAfter successfully downloading the next stage executable, BAZARLOADER begins the injection functionality to launch it from another process.\n\nFor this functionality, BAZARLOADER populates the following structure.\n```\nstruct injection_struct\n{\n  HANDLE browser_proc_handle;\n  PVOID full_exec_command;\n  PVOID thread_curr_directory;\n  PVOID browser_environment_struct;\n  STARTUPINFOA thread_startup_info;\n  LPPROC_THREAD_ATTRIBUTE_LIST proc_thread_attr_list;\n};\n\n```\nFirst, it checks if its process is elevated with admin privileges. It calls GetCurrentProcess and OpenProcessToken to retrieve its own process\ntoken handle and GetTokenInformation to get the token’s elevation information.\n\n\n-----\n\nIf the process is not elevated, it resolves the following processes’ names and tries to populate the injection structure’s fields.\n```\nchrome.exe\nfirefox.exe\nmsedge.exe\n\n```\nFor each process name, the malware enumerates the process’s snapshot to retrieve its ID and calls OpenProcess to get its handle.\n\nTo populate the full_exec_command and thread_curr_directory fields which contain the process’s command line and full path,\nBAZARLOADER first extracts the process parameters from the Process Environment Block (PEB).\n\nTo access the PEB, the malware calls NtQueryInformationProcess to retrieve the PEB’s adress and calls ReadProcessMemory to read the\nPEB into memory.\n\n\n-----\n\nNext, it calls ReadProcessMemory to read the process parameters from the process’s memory.\n\nWith the process parameter RTL_USER_PROCESS_PARAMETERS structure, BAZARLOADER reads the process’s command line and full\npath to populate the injection structure.\n\nSimilarly, it also uses the process parameter to access the browser’s environment block and writes it to the injection structure.\n\n\n-----\n\nIf BAZARLOADER has admin privilege, instead of a browser’s process, it tries to populate the injection structure with a svchost.exe process\nfrom the following command line.\n```\n\\\\system32\\\\svchost.exe -k unistackSvcGroup\n\n```\nNext, using the injection struct, the malware calls CreateProcessA to create the target process in the suspended state to perform process\nhollowing.\n\n\n-----\n\n[We won’t dive too deep into this process hollowing implementation, since it’s almost the exact same implementation as seen here.](https://github.com/m0n0ph1/Process-Hollowing)\n\nWe can quickly spot that process hollowing is taking place through the Windows APIs being called. NtUnmapViewOfSection is called to\nunmap and carve out the parent’s memory. VirtualAllocEx and WriteProcessMemory are then called to allocate virtual memory in the\nparent’s process and write the malicious payload into it.\n\n\n-----\n\nWe can also see that the malware iterates through the parent’s section header to find the “.reloc” section and performs relocation on the\ninjected image in memory.\n\nFinally, BAZARLOADER calls SetThreadContext to set the new entry point for the parent process and calls ResumeThread to resume the\nparent’s process again, which will execute the injected executable.\n\n\n-----\n\nAnd with that, we have analyzed how BAZARLOADER downloads a remote executable and executes it using process hollowing! If you have\n[any questions regarding the analysis, feel free to reach out to me via Twitter.](https://twitter.com/cPeterr)\n\n### Leave a Reply\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-27 - BAZARLOADER- Analysing The Main Loader.pdf"
    ],
    "report_names": [
        "2022-05-27 - BAZARLOADER- Analysing The Main Loader.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535868,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1654086194,
    "ts_modification_date": 1654086194,
    "files": {
        "pdf": "https://archive.orkl.eu/ff446ed408d7abe50b0472afdbfd45dd5a73de6e.pdf",
        "text": "https://archive.orkl.eu/ff446ed408d7abe50b0472afdbfd45dd5a73de6e.txt",
        "img": "https://archive.orkl.eu/ff446ed408d7abe50b0472afdbfd45dd5a73de6e.jpg"
    }
}