{
    "id": "8d4efdd3-1285-4d53-b00f-91d40bd2686f",
    "created_at": "2023-01-12T15:09:31.484944Z",
    "updated_at": "2025-03-27T02:05:33.481695Z",
    "deleted_at": null,
    "sha1_hash": "fda688585ef458c9259dc062fc7abc681279827e",
    "title": "2017-03-13 - Moving Target Defense Blog",
    "authors": "",
    "file_creation_date": "2022-05-28T16:14:11Z",
    "file_modification_date": "2022-05-28T16:14:11Z",
    "file_size": 1696765,
    "plain_text": "# Andromeda’s Five Star Custom Packer – Hackers’ Tactics Analyzed\n\n**blog.morphisec.com/andromeda-tactics-analyzed**\n\nPosted by [Roy Moshailov on March 13, 2017](https://blog.morphisec.com/author/roy-moshailov)\nFind me on:\n[Twitter](https://twitter.com/RoyXmos)\n\n[Tweet](https://twitter.com/share)\n\n\n-----\n\nPacker-based malware is malware which is modified in the runtime memory using different\nand sophisticated compression techniques. Such malware is hard to detect by known\nmalware scanners and anti-virus solutions. In addition, it is a cheap way for hackers to\nrecreate new signatures for the same malware on the fly simply by changing the\nencryption/packing method. Packers themselves are not malware; attackers use this tactic to\nobfuscate the code’s real intention.\n\nFor security solutions to be effective, they will need to augment their solutions with inmemory capabilities in order to monitor/hook the behavior of the malware after unpacking is\ncompleted.\n\nThis document describes a sophisticated Andromeda/Gamarue Custom Packer. Andromeda\nfirst appeared in 2011 and still remains popular. As the Andromeda attack chain has been\n[described previously, this analysis focuses on the packer and deobfuscation, which happens](http://resources.infosecinstitute.com/andromeda-bot-analysis/#article)\nbefore the malware downloads or executes its next stage malicious payload. The recent\nversion of the custom packer we obtained (originating June 2016), has noteworthy and\ninnovative functionality.\n\n**Does Morphisec stop this attack? Of course, even these new tricks can’t get past**\n**Morphisec, which prevents this attack before it can drop its load.**\n\n## Technical Analysis\n\n### Andromeda/Gamarue Custom Packer\n\n\n-----\n\nNowadays most malware employs anti-analysis techniques to make their code harder to\nanalyze by security researchers. Just like legitimate software developers protect their\nproprietary work, hackers use obfuscation techniques to protect their code from being\nreverse-engineered or debugged.\n\nThe malware sample in our analysis is packed by a custom packer. To be able to get to the\nactual code, we first need to unpack it.\n\n**How can you recognize a packed malware?**\n\nThe sample usually comes with a resource section (in this example RC data contains\nsome encrypted content).\nTypically, the compressed file is very large.\nBy looking at the import table – It might have only a few imports and many times these\ninclude LoadLibrary and/or GetModuleHandleW as those functions are used for the\ninitial unpacking procedure.\nNo readable static strings as the strings are encrypted.\nHigh entropy in sections for higher efficiency of information storage.\nA large portion of the code is inside the .data section (although there are newer\nversions with code inside text).\nThe program has abnormal section sizes, such as .data and .rsrc sections. The\n_RawDataSize is lower than VirtualSize and usually also the section names themselves_\nmay indicate a particular packer.\n\n**How to unpack?**\n\nIn forensic analysis, there are different ways to handle the unpacking process. While there\nare automatic tools for different popular packers, it is more difficult to handle custom packers,\nwhich require some manual work and a deeper knowledge of the different anti-debugging\nobstacles. Moreover, custom packers usually also involve stripping off multiple packing\nlayers.\n\n### The Packer - Detailed\n\nLooking at Andromeda’s top-layer packer, we start by noticing an interesting, relatively high\nentropy in one of the sections (e.g. entropy of .rsrc is 7.376) which gives us the first\nindication that it is a packer.\n\nDetermining a point in time for which we know the malicious code was already unpacked, we\nidentify the use of ws2_32.dll (responsible for communication API). This means we can\nassume that the malicious code will start communication after it is unpacked. This is of high\nprobability for downloaders or C&C based malware.\n\n\n-----\n\nAs shown in the image below, there are two unnamed modules with RWE (read write\nexecute) access rights – those are indicators for the unpacked executable shellcode (the\ncode will write and execute from the same location).\n\nAdditionally, we can see now strings which are typical to Andromeda.\n\nIt is noticeable that those modules are still not a PE file (do not start with PE header) – those\nare executable shellcodes.\n\n\n-----\n\nWe also notice that the code starting from the entry point of the executable was modified,\nwhich reminds us of Process Hollowing/ RunPE techniques.\n\n\n-----\n\nRunPE techniques are designed to evade AV mitigation methods.\n\nHere are RunPE characteristics, as described in an Andromeda Bot Analysis by Infosec\nInstitute:\n\nUnpack or decrypt the original EXE file in memory.\nCall CreateProcess on a target EXE using the CREATE_SUSPENDED flag. This maps\nthe executable into memory and it’s ready to execute, but the entry point hasn’t\nexecuted yet.\nNext, Call GetThreadContext on the main thread of the newly created process. The\nreturned thread context will have the state of all general-purpose registers. The EBX\nregister holds a pointer to the Process Environment Block (PEB), and the EAX register\nholds a pointer to the entry point of the innocent application. In the PEB structure, at an\noffset of eight bytes, is the base address of the process image.\nCall NtUnmapViewOfSection to unmap and free up the virtual address space used by\nthe new process.\nCall VirtualAllocEx to re-allocate the memory in the process’ address space to the\ncorrect size (the size of the new EXE).\nCall WriteProcessMemory to write the PE headers and each section of the new EXE\n(unpacked in Step 1) to the virtual address location they expect to be (calling\nVirtualProtextEx to set the protection flags that each section needs).\nThe loader writes the new base address into the PEB and calls SetThreadContext to\npoint EAX to the new entry point.\n\n\n-----\n\nFinally, the loader resumes the main thread of the target process with ResumeThread\nand the windows PE loader will do its magic. The executable is now mapped into\nmemory without ever touching the disk.\n\nAlso in our case, the packer decrypts the executable memory space and replaces previously\nencrypted memory with the functional code. The packer also updates the entry point to the\nnew functional code start.\n\nForensic analysts will usually stop at this stage and dump the first layer decrypted code for\nfurther static analysis using different tools like IDA.\n\nBased on the resemblance to RunPE methodology, we will execute the malware again,\nalthough now we set a breakpoint on VirtualAlloc functions (used to allocate memory). Other\nsimilar functions are VirtualAlloc, VirtualAllocEx, or ZwAllocateVirtualMemory – also part of\nthe Process Hollowing/RunPE method) called to reserve some RWX memory.\n\nWe get the VirtualAlloc function from PEB->Kernel32.EAT\n\n\n-----\n\nAfter identifying the RWE buffer address, we set a memory breakpoint on write to this buffer \n- the written code is actually the unpacker/decode function.\n\n\n-----\n\nAfter the unpacking function finishes execution, its execution is redirected to the first\nshellcode:\n\n\n-----\n\nEAX address shellcode start = 0x003D0000\n\nFrom inside the shellcode, VirtualAlloc is called again. We set a memory breakpoint on write\nto the new buffer one more time, get a new PE and are redirected to a second shellcode, the\nunpacked PE.\n\nFrom this stage on, we get the regular Andromeda Loader which is described in detail by the\nAvast Threat Intelligence Team.\n\n## Conclusion\n\nThis article describes a single custom packer for Andromeda, one of the most popular\nmalware delivery frameworks.\n\nPackers are a major concern for current security solutions. Packers allow attackers to\npenetrate network solutions, file scanning solutions and, in many cases, behavior or AI\nbased solutions.\n\nThe use of custom packers will only increase, as will the need for in-memory solutions that\ncan block these types of attacks.\n\nA number of popular sandbox dynamic scanning services have some basic in-memory\ndefenses, however these impose severe performance penalties. Moreover, they frequently\nare not even effective as many packers, such as in our case, include techniques to identify\n\n\n-----\n\nsandbox environments. Morphisec s [Moving Target Defense based technology wins the](https://www.morphisec.com/products/?__hstc=182053752.1b163c3a4dd03affa5bab3a75da22fc8.1578295878507.1583307015582.1583313278178.17&__hssc=182053752.70.1583313278178&__hsfp=3981430878)\nmalware packer battle without monitoring, hooking or using any other methods that affect\n[endpoint performance.](https://www.morphisec.com/products/advanced-endpoint-threat-protection)\n\n### Hash: 7b45c0141cca16fc14d4c81c653d4f22eb282cbbc4f913c9e830acf6e9d12b86\n\n## Resources\n\n[http://resources.infosecinstitute.com/andromeda-bot-analysis/#article](http://resources.infosecinstitute.com/andromeda-bot-analysis/#article)\n\n[http://www.iosrjournals.org/iosr-jce/papers/Vol16-issue1/Version-1/L016117177.pdf](http://www.iosrjournals.org/iosr-jce/papers/Vol16-issue1/Version-1/L016117177.pdf)\n\nhttps://www.botconf.eu/wp-content/uploads/2015/12/OK-P07-Jose-Esparza-Travelling-to-thefar-side-of-Andromeda-2.pdf\n\n[Contact SalesInquire via Azure](http://10.10.0.46/mailto:sales@morphisec.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-13 - Moving Target Defense Blog.pdf"
    ],
    "report_names": [
        "2017-03-13 - Moving Target Defense Blog.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536171,
    "ts_updated_at": 1743041133,
    "ts_creation_date": 1653754451,
    "ts_modification_date": 1653754451,
    "files": {
        "pdf": "https://archive.orkl.eu/fda688585ef458c9259dc062fc7abc681279827e.pdf",
        "text": "https://archive.orkl.eu/fda688585ef458c9259dc062fc7abc681279827e.txt",
        "img": "https://archive.orkl.eu/fda688585ef458c9259dc062fc7abc681279827e.jpg"
    }
}