{
    "id": "8d64f78c-bb18-4301-8a51-65c3a1ec08b5",
    "created_at": "2023-01-12T15:00:58.864354Z",
    "updated_at": "2025-03-27T02:09:18.105034Z",
    "deleted_at": null,
    "sha1_hash": "45fb071371d6657e7e957fb2a15c7c5e87bda7ec",
    "title": "2022-07-14 - GootLoader, From SEO Poisoning to Multi-Stage Downloader",
    "authors": "",
    "file_creation_date": "2022-08-18T03:21:16Z",
    "file_modification_date": "2022-08-18T03:21:16Z",
    "file_size": 6082863,
    "plain_text": "# GootLoader, From SEO Poisoning to Multi-Stage Downloader\n\n**[blogs.blackberry.com/en/2022/07/gootloader-from-seo-poisoning-to-multi-stage-downloader](https://blogs.blackberry.com/en/2022/07/gootloader-from-seo-poisoning-to-multi-stage-downloader)**\n\nThe BlackBerry Research & Intelligence Team\n\nGootLoader is watching and learning.\n\nFor some time, security researchers used an open-source tool to successfully decode the malware’s early-stage indicators of compromise\n(IoCs). But after spotting the workaround in some recently published research, the threat group shifted its tactics, hoping to dive back into\ndeep cover. A new variant of GootLoader’s initial stager malware has since been spotted, which is designed to defy this decoding by breaking\nthe once-effective open-source tooling.\n\nAfter a few months of inactivity, the malicious multi-stage downloader is now sprouting up again, used as an initial access vector for\n[unleashing a variety of malware campaigns. One such campaign was recently observed deploying Cobalt Strike Beacons as its intended](https://blogs.blackberry.com/en/2021/11/all-your-beacon-are-belong-to-us-new-blackberry-book-cracks-code-of-cobalt-strike-threat-actors)\npayload.\n\nThe threat group behind the malware has also been known to apply search engine optimization (SEO) techniques to place its Trojanized\npages front-and-center in internet browser search results.\n\n### Operating System\n\n Risk & Impact\n\n GootLoader Malware Technical Analysis\n\n\n-----\n\nGoot oade s a u t staged Ja aSc pt a a e pac age t at as bee t e d s ce ate 0 0 sto ca y, t s t eat as d opped t e\ninfostealing malware “GootKit,” from which its name is derived. Over time, the threat actors behind it have diversified their selection of\npayloads to include a wider variety of threats, including ransomware.\n\nThe threat group has also been known to use search results as a primary method of infection. To do this, the actors poison online internet\nforums with various links that point to a ZIP file archive, which contains the initial stage of the malware.\n\nOnce the victim’s machine has been infected, the malware will attempt to download additional stages of its attack chain. In this multi-stage\nloading technique, each stage (called a “Stager”) performs part of the functionality of the whole payload, rather than having a single payload\nthat does everything. The malware splits its functionality to remain as stealthy as possible, and in this case, it further complicates detection by\nloading its components in memory to avoid saving them to disk on the victim’s machine.\n\n### SEO Poisoning as a Cybercrime Tactic\n\nThe technique known as “search poisoning” - or SEO poisoning - is used by many cybercriminals and threat groups as a form of distribution\nfor their illicit tools and malware. By optimizing a compromised website to appear higher on internet search engine results, attackers lure\nvictims who are more likely to see and trust search results with a higher ranking.\n\nThis method of attack requires the threat group to generate fake, Trojanized websites, that are intended to “borrow” the reputation of a\nlegitimate website. Most often, GootLoader has targeted online internet forums for popular niche topics.\n\nThe malicious link is typically included in a post that is interjected into a thread created by the threat actors. The bogus message thread\naddresses the expected discussion topic, so readers will be more easily fooled into clicking and downloading the lure document.\n\nTypically, these forums are set up by the threat actor. These fake forums contain a fake user who posts seeking information, and then an\nadministrator of the forum responds to this post, to supply the specified document.\n\nThis conversation is completed with the fake requestor thanking the fake admin for supplying the “correct file.” But the entirety of this\ninteraction is fabricated to lend the appearance of legitimacy to the provided file.\n\n_Figure 1: Trojanized forum hosting GootLoader_\n\nThe threat actors behind GootLoader often rely on compromising pre-existing websites to host their malware, because it allows them to\ndecentralize the download link and hosting of the initial stage loader. This distributed approach adds an extra level of complexity to the\nmalware, as it is difficult for defenders to mitigate all potential infection vectors where this malware has been hosted.\n\n### GootLoader Malware Stager 1\n\nAs the process flow for the malware’s initial stage (Stager 1) is rather complex, let’s take a brief look at an overview of its activities before\nexamining them in more detail.\n\nThe victim executes the Trojanized copy of jQuery, thinking it’s a legitimate document they have downloaded.\nThe code within is largely legitimate jQuery code (293KB) with a difference of only 6KB, which is the malicious code of GootLoader.\nThis code is heavily obfuscated and appears almost random; however, it can be carved from the Trojanized jQuery code.\nOn execution, this Trojanized code decodes various command-and-control (C2) URLs that it will reach out to, to download the second\nstage (Stager 2) of the malware.\nThe final goal of Stager 1 is to execute the downloaded Stager 2 to continue its attack chain.\n\n\n-----\n\nt t e e desc bed ea e t s post, e d Stage o t e a a e s co po e t o Goot oade s a Ja aSc pt e t at\ncontains approximately 10,000 lines of code. The name used for the file within the archive is aligned with the ZIP file as seen in Figure 2, so\nthe victim will continue downloading and double-click on the Trojanized file to execute it.\n\n_Figure 2: GootLoader Stager 1 example_\n\n### Trojanized Code Hiding With Popular jQuery Library\n\nAt first glance, Stager 1 appears to be a legitimate version of the popular JavaScript library “jQuery 3.60.0,” as seen in Figure 3. This is\nanother deceptive tactic to make the malware appear benign to the victim.\n\n_Figure 3: GootLoader Stager 1 opening code_\n\nAs noted above, GootLoader’s Stager 1 has seen a very recent change to its code structure, which shows the threat’s developers are keeping\na close eye on the tools used to analyze it. During our investigations, BlackBerry researchers uncovered that, while the functions of Stager 1\nhave not been redesigned they have been shuffled around in order to break open source tooling that was previously developed to assist in\n\n\n-----\n\ndecod g a a e\n\nA comparison between the newer and older files (as shown in Figure 4) indicates that most of the functions have been scattered to different\nlocations, and have been given different, random variable names.\n\n_Figure 4: File comparison between Stager 1 in May 2022, and Stager 1 in June 2022_\n\nIt’s also worthwhile comparing the malicious JavaScript file with a legitimate jQuery file downloaded from https://code.jquery.com/jquery3.6.0.js (see Figure 5).\n\n_Figure 5: File comparison between jQuery library and GootLoader Stager 1_\n\nThe malicious file contains extra functions and calls not found in the legitimate file, despite its smaller file size. Also, the legitimate file has “try\nand catch” use cases, while the malicious file has these checks commented out, as seen below in Figure 6.\n\n_Figure 6: Comparison of legitimate jQuery (left) and GootLoader Stager 1 code_\n\nAs seen in Figure 7, extracting the relevant code from jQuery will reveal the malicious code added to the library.\n\n\n-----\n\n_Figure 7: Extracted code from GootLoader Stager 1 code (posted May 2022)_\n\n### Decoding Stager 1\n\nAs mentioned previously, older samples of GootLoader could historically be decoded using a widely known tool that is available here:\n[https://github.com/hpthreatresearch/tools/blob/main/gootloader/decode.py](https://github.com/hpthreatresearch/tools/blob/main/gootloader/decode.py)\n\nUsing this tool, one could code and extract the malicious IoCs of Stager 1, as seen in Figure 8. However, with more recent samples, this task\nhas required a lot more manual interaction. After manual decoding, the decrypted code contains URLs and a domain list.\n\n\n-----\n\n_Figure 8: IOCs of May 2022 GootLoader Stager 1 example_\n\nOn execution, Stager 1 checks for internet connectivity and attempts to contact GootLoader’s C2 server. The malware will attempt to create a\nGET Request from the victim’s device to the C2 to download the second stage of the malware.\n\nIf this is unsuccessful, the threat attempts to terminate itself, as shown in Figure 9.\n\n_Figure 9: Stager 1 decode_\n\n### GootLoader Malware Stager 2\n\nLike Stager 1, Stager 2 of GootLoader is an obfuscated JavaScript file containing numerous components, as seen in Figure 10. The goal of\nthis malware stage is to successfully deploy the intended payload(s) onto the victim’s device without a payload file ever touching the disk.\n\n_Figure 10: Example of GootLoader Stager 2_\n\n\n-----\n\nGoot oade ac e es t s e ess e ecut o a sc pt e e ece t e s o s o Goot oade te t o e bedded pay oads to t e o o g\ntwo registry keys:\n\nSOFTWARE\\Microsoft\\Phone\\%Username%\nSOFTWARE\\Microsoft\\Phone\\%Username%0\n\nTo write payloads to these registry keys, GootLoader takes its two encoded variables containing the two payloads, and it truncates them into\nblobs of 4,000 characters each.\n\nTo better understand this script, let’s manually decode it to give a clearer picture of its actions and true intensions, starting with Figure 11.\n\n_Figure 11: Beautified view of Stager 2 JavaScript_\n\nThe aforementioned blobs will be used by PowerShell later in the malware execution chain, to be decoded and run in memory. To accomplish\nthis, GootLoader uses scheduled tasks to read the payloads that it has placed inside these registry keys, as shown in Figure 12.\n\n_Figure 12: Registry Keys and values added by a GootLoader attack_\n\n\n-----\n\nte t e t o pay oads o Goot oade a e bee t u cated a d d st buted t t e ct s eg st y eys, t e a a e atte pt to\nreflectively load the payload it has placed in the %Admin%0 (ryxav) key.\n\nThis first payload is a .NET DLL called “PowerShell.DLL” that contains a function named “Test()”, which is used to decode the second\npayload.\n\nThe PowerShell commands shown in Figure 13 are an attempt to maintain persistence for the malware via a scheduled task to load and run\nthe payload. This task is also used to load the payload found in %Admin%0 (ryxav) to initiate the execution of the second payload.\n\n_Figure 13: Initiation and persistence PowerShell commands for GootLoader_\n\nThe first payload, found in PowerShell.DLL, is initially passed through a replace function before being successfully being loaded into memory.\n\nWe can derive this payload before the replace function by looking for the presence of a Windows executable “MZ” header (0x4D5A) as seen\nin Figure 14 below.\n\n_Figure 14: Data of the first payload stored in the registry_\n\nThe file is not obfuscated further when in memory, and it contains the previously noted “Test()” function. This function plays a pivotal role in\ndecoding the second and final payload of GootLoader.\n\n### Powershell.dll\n\nThe first payload of Stager 2 is a small DLL, only 15KB in size. The goal of this first payload is to decode the second and far larger payload.\n\nThe steps involved in this process via the function Test(), also shown in Figure 15, are as follows:\n\nRead the truncated blobs of code located in the SOFTWARE\\Microsoft\\Phone\\%Username% registry key.\nEnumerate all the chunks of code.\nUse a replace sequence to decode data:\n\nThe second payload is encoded with a simple cipher provided with the .NET DLL payload. This function will attempt to replace the\nencoded data using a replace sequence to produce the true second payload.\nDynamically load the DLL into memory:\n\nLike the first payload of Stager 2, the payload itself does not drop its file to disk. Instead, it is loaded into memory and executed once\ndecoded.\n\n\n-----\n\n_Figure 15: Breakdown of Test()_\n\nFor convenience, a cipher table has been carved out of the image above and is displayed below. Though the payloads of GootLoader have\nevolved, this cipher has not changed from one sample or campaign to the next, since its inception.\n\n**Letter** **Converted Hex character** **Letter** **Converted Hex character**\n\n**q** 000 **p** 8\n\n**v** 0 **s** 9\n\n**w** 1 **q** A\n\n**r** 2 **h** B\n\n**t** 3 **j** C\n\n**y** 4 **k** D\n\n**u** 5 **l** E\n\n**i** 6 **z** F\n\n\n-----\n\n**o** 7\n\nThough the second payload can vary, in 2022, GootLoader has most commonly dropped and deployed a Cobalt Strike Beacon. Once\nexecuted, this beacon will attempt to reach out to its Cobalt Strike infrastructure and potentially pull down even more malware or malicious\ntooling.\n\nLike the first payload, this can be manually decoded using the cipher found within the first payload, resulting in another Windows DLL.\n\nThe content of this Cobalt Strike Beacon is obfuscated. However, it can be decoded to reveal the configuration of the beacon, as seen below.\n\n{\n\"beacontype\": [\n\n\"HTTPS\"\n\n],\n\n\"sleeptime\": 60000,\n\n\"jitter\": 0,\n\n\"maxgetsize\": 1048576,\n\n\"spawnto\": \"AAAAAAAAAAAAAAAAAAAAAA==\",\n\n\"license_id\": 1580103824,\n\n\"cfg_caution\": false,\n\n\"kill_date\": null,\n\n\"server\": {\n\n\"hostname\": \"146.70.29.237\",\n\n\"port\": 443,\n\n\"publickey\": \"MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCnCZHWnYFqYB/6gJdkc4MPDTtBJ20nkEAd3tsY4tPKs8MV4yIjJb5Ctlrb\nHjzP1oD/1AQsj6EKlEMFIKtakLx5+VybrMYE+dDdkDteHmVX0AeFyw001FyQVlt1B+OSNPRscKI5sh1L/ZdwnrMy6S6nNbQ5N5hls6k2kgNO5nQ7\nIDAQABAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\n\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA==\"\n\n},\n\n\"host_header\": \"\",\n\n\"useragent_header\": null,\n\n\"http-get\": {\n\n\"uri\": \"/__utm.gif\",\n\n\"verb\": \"GET\",\n\n\"client\": {\n\n\"headers\": null,\n\n\"metadata\": null\n\n},\n\n\"server\": {\n\n\"output\": [\n\n\"print\"\n\n]\n\n}\n\n},\n\n\"http-post\": {\n\n\"uri\": \"/submit.php\",\n\n\"verb\": \"POST\",\n\n\"client\": {\n\n\"headers\": null,\n\n\"id\": null,\n\n\"output\": null\n\n}\n\n},\n\n\"tcp_frame_header\":\n\"AAQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\n\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\n\n\"crypto_scheme\": 0,\n\n\"proxy\": {\n\n\"type\": null,\n\n\"username\": null,\n\n\"password\": null,\n\n\"behavior\": \"Use IE settings\"\n\n},\n\n\"http_post_chunk\": 0,\n\n\"uses_cookies\": true,\n\n\"post-ex\": {\n\n\"spawnto_x86\": \"%windir%\\\\syswow64\\\\rundll32.exe\",\n\n\"spawnto_x64\": \"%windir%\\\\sysnative\\\\rundll32.exe\"\n\n},\n\n\"process-inject\": {\n\n\"allocator\": \"VirtualAllocEx\",\n\n\"execute\": [\n\n\"CreateThread\",\n\n\"SetThreadContext\",\n\n\"CreateRemoteThread\"\n\n\n-----\n\n],\n\"min_alloc\": 0,\n\"startrwx\": true,\n\"stub\": \"IiuPJ9vfuo3dVZ7son6mSA==\",\n\"transform-x86\": null,\n\"transform-x64\": null,\n\"userwx\": true\n},\n\"dns-beacon\": {\n\"dns_idle\": null,\n\"dns_sleep\": null,\n\"maxdns\": null,\n\"beacon\": null,\n\"get_A\": null,\n\"get_AAAA\": null,\n\"get_TXT\": null,\n\"put_metadata\": null,\n\"put_output\": null\n},\n\"pipename\": null,\n\"smb_frame_header\":\n\"AAQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA=\",\n\"stage\": {\n\"cleanup\": false\n},\n\"ssh\": {\n\"hostname\": null,\n\"port\": null,\n\"username\": null,\n\"password\": null,\n\"privatekey\": null\n}\n}\n\n### Conclusion\n\nGootLoader initially rose to notoriety as the sophisticated multi-staged downloader of GootKit malware. Over the years, this dropper has\nbecome more advanced in its payload delivery, and it has diversified its payload capabilities beyond just delivering its namesake malware.\n\nGootLoader has found great success in using SEO poisoning techniques to position links to its malware prominently in internet search results,\nluring in as many unsuspecting victims as possible. Though not directly targeted, the lure documents used to deliver the malware can indicate\nspecific targets, notably (and most recently) legal institutions and property development companies in the United States and Germany.\n\nTo attract these specific audiences, links to Trojanized documents are posted to online forums, to entice people working in specific industries\nwho might be seeking to download niche information.\n\nThe malware still seems to be in active development, with recent changes to its core Stager 1 component now modified to break open-source\ntooling that has been commonly used by the security industry to decode GootLoader’s IoCs.\n\nAnother danger of GootLoader is the diversity of its payload. Though more recent samples have appeared to focus on deploying Cobalt Strike\nBeacons, the malware has been known to deploy banking Trojans and even ransomware.\n\n### GootLoader Mitigation Tips\n\n**URL Analysis: GootLoader preys on victims using SEO-poisoning techniques to host documents containing its initial malicious stages.**\nDetermining if URLs are benign or malicious could play a pivotal role in preventing a victim clicking on a link hosting malware. (MITRE\n[D3FEND™ technique D3-UA)](https://d3fend.mitre.org/technique/d3f:URLAnalysis)\n\n**Decoy File: GootLoader deceives the victim by disguising its initial stage as a free downloadable document on a niche internet forum.**\n[(MITRE D3FEND™ technique D3-DF)](https://d3fend.mitre.org/technique/d3f:DecoyFile)\n\n**Client-Server Payload Profiling: GootLoader is hosted on compromised sites. Determining whether a payload is malicious in advance can**\n[prevent the victim from downloading the malicious lure document onto their device. (MITRE D3FEND™ technique D3-CSPP)](https://d3fend.mitre.org/technique/d3f:Client-serverPayloadProfiling)\n\n**File Hashing: Deploying a hashing detection on a device can be an effective way of blocking/quarantining malware if it appears on a device.**\n[(MITRE D3FEND™ technique D3-FH)](https://d3fend.mitre.org/technique/d3f:FileHashing)\n\n**File Content Rules: Searching the contents of a file via pattern matching like YARA is a strong way of determining if a file is benign or**\n[malicious (MITRE D3FEND™technique D3 FCR)](https://d3fend.mitre.org/technique/d3f:FileContentRules)\n\n\n-----\n\n**Syste** **Co** **gu at o** **e** **ss o s** a g a syste oc ed do to spec c use s cou d p e e t bot t e u g o a c ous es, a d\n[the registry creation of GootLoader. (MITRE D3FEND™ technique D3-SCP)](https://d3fend.mitre.org/technique/d3f:SystemConfigurationPermissions)\n\n**Process Spawn Analysis: Having visibility into spawned processes, like suspicious use of wscript.exe or PowerShell.exe, could give insight**\n[into a malicious threat executing on a victim system. (MITRE D3FEND™ technique D3-PSA)](https://d3fend.mitre.org/technique/d3f:ProcessSpawnAnalysis)\n\n**Network Traffic Filtering: GootLoader attempts to download its Stager payloads and also attempts to reach out to its beaconing C2. Having**\n[visibility and filtering can lead to malicious traffic being intercepted and dropped. (MITRE D3FEND™ techniques D3-NTF and](https://d3fend.mitre.org/technique/d3f:NetworkTrafficFiltering) [D3-UA)](https://d3fend.mitre.org/technique/d3f:URLAnalysis)\n\n### YARA Rule for GootLoader\n\n[The following YARA rule was authored by the BlackBerry Research & Intelligence Team to catch the threat described in this document:](https://blogs.blackberry.com/en/author/the-blackberry-research-and-intelligence-team)\n\nimport \"pe\"\n\nimport \"math\"\n\nimport \"hash\"\n\nrule Mal_Downlaoder_Win32_GootLoader_Cipher_DLL\n\n{\n\nmeta:\n\ndescription = \"Detects Stager 2 of GootLoader .NET payload\"\n\nauthor = \"BlackBerry Threat Research\"\n\ndate = \"2022-06-23\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0) and open to any\nuser or organization, as long as you use it under this license and ensure originator credit in any derivative to The BlackBerry Research &\nIntelligence Team\"\n\nstrings:\n$x0 = \"DynamicDllLoader\"\n\n$x1 = \"powershell\"\n\n$x2 = \"Replace\"\n\n$x3 = \"RegistryKey\"\n\n$x4 = \"OpenSubKey\"\n\n$x5 = \"\\\\Microsoft\\\\Phone\\\\\" wide\n\n$x6 = \"Test\"\n\n$x7 = \"powershell.dll\"\n\n$x8 = \"ReadKey\"\n\n$x9 = \"Invoke\"\n\n$x10 = \"Console\"\n\ncondition:\n\n//PE File\n\nuint16(0) == 0x5a4d and\n\n// DotNet Imports\n\npe.imports(\"mscoree.dll\", \"_CorDllMain\") and\n\n// Original Filename\n\npe.version_info[\"OriginalFilename\"] == \"powershell.dll\" and\n\n// File Version 0.0.0.0\n\npe.version_info[\"FileVersion\"] == \"0.0.0.0\" and\n\n//All Strings\n\nall of ($x*)\n\n}\n\n\n-----\n\nimport \"pe\"\n\nimport \"math\"\n\nimport \"hash\"\n\nrule Mal_Downlaoder_Win32_GootLoader_Stager2\n\n{\n\nmeta:\n\ndescription = \"Detects Stager 2 of GootLoader JavaScript\"\n\nauthor = \"BlackBerry Threat Research\"\n\ndate = \"2022-06-23\"\n\nlicense = \"This Yara rule is provided under the Apache License 2.0 (https://www.apache.org/licenses/LICENSE-2.0) and open to any\nuser or organization, as long as you use it under this license and ensure originator credit in any derivative to The BlackBerry Research &\nIntelligence Team\"\n\nstrings:\n$x0 = {4d 69 22 2b 22 63 72 6f 22 2b 22 73 6f 22 2b 22 66 74 5c 5c 50 68 22 2b 22 6f 6e 22 2b 22 65 5c 5c}\n\n$x1 = {53 68 65 6c 6c 45 78 65 63 75 74 65}\n\n$x2 = {4d 67 41 78 41 44 6b 41 4f 41}\n\n$x3 = {76 61 72}\n\n$x4 = {52 65 67 52 65 61 64}\n\n$x5 = {57 53 63 72 69 70 74 2e 43 72 65 61 74 65 4f 62 6a 65 63 74}\n\n$x6 = {70 6f 77 27 2b 27 65 72 27 2b 27 73 68 27 2b 27 65 6c 6c 2e 65 27 2b 27 78 65}\n\ncondition:\n\n//All Strings\n\nall of ($x*)\n\n}\n\n### Indicators of Compromise (IoCs)\n\n**Stager 1 (ZIP)**\n\n568eeaab68afe15f420fcdc4ac5174dfae9cb1b56b365ddf0951dee35f916dff\n\n**Stager 1 (JavaScript)**\n\n1bc77b013c83b5b075c3d3c403da330178477843fc2d8326d90e495a61fbb01f\n\n**Stager 2 (Post May 2022)**\n\n640d75d1f3ef23a65c5554b1e86281abbc14e62ee878fda119ce0be910526438\n\ne4f452c452695ef4dd61042d77ec9dfa6a803a3ef82878b66b0b08780350efa6\n\n6c4bc6376afa8933e2556c688ec911642bcd86d44120cdd69240f0197fa08b9f\n\n**Payload (Powershell.dll)**\n\nf1b33735dfd1007ce9174fdb0ba17bd4a36eee45fadcda49c71d7e86e3d4a434\n\nf9093510dda650e214fbf48060a645136053ab1525919ead95c63915be06931c\nabd2ce37c207b5d24fe39e56ca6688dda8ce63532400216a13e1735e49b03050\n\n17a02009a19067b34651efe7a5c98ed1d7a110d794cc1ab1af8bd288207b0836\n\n2fcd6a4fd1215facea1fe1a503953e79b7a1cedc4d4320e6ab12461eb45dde30\n\nb7c880252ed3ebf9a11fcdff5186008ee59785c17a68861511fe5116cbe2ab79\n\n15645d983a3a31e1c3cfe651f2ce5613939f221b2ebeee2a1e2f1aa2ecf94c29\n\n338fe8dc488962ca3a44c297cc457999be5ba61d4268e8289b8abd69893447e3\n\n796c5fdd403ea0c247e062b0e206e03cbce62561c00bf0e28b7465125375a996\n\n7c170097ded546d1bbd3d4550e26a4cb3e78629f37469b4c28a97a576be43c03\n\n**Payload (Cobalt Strike Beacon)**\n\n0258da19a8fa78a824bd2b43f36ffbb61cb8f7571971a1360cc2933175f27b4a\n\n**Registry Key Adds**\n\nSOFTWARE\\Microsoft\\Phone\\%Username%\n\nSOFTWARE\\Microsoft\\Phone\\%Username%0\n\n### References\n\n_[https://github.com/hpthreatresearch/tools/blob/main/gootloader/decode.py](https://github.com/hpthreatresearch/tools/blob/main/gootloader/decode.py)_\n\n_[https://redcanary.com/wp-content/uploads/2022/05/Gootloader.pdf](https://redcanary.com/wp-content/uploads/2022/05/Gootloader.pdf)_\n\n_[https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/](https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/)_\n\n_[https://twitter com/GootLoaderSites/status/1524861015812456485?s=20&t=uMZt5e5BHzdZfN7st hPYA](https://twitter.com/GootLoaderSites/status/1524861015812456485?s=20&t=uMZt5e5BHzdZfN7st_hPYA)_\n\n\n-----\n\n### ac e y ss sta ce\n\nIf you’re battling this malware or a similar threat, you’ve come to the right place, regardless of your existing BlackBerry relationship.\n\n[The BlackBerry Incident Response team is made up of world-class consultants dedicated to handling response and containment services for](https://www.blackberry.com/us/en/services/incident-response)\na wide range of incidents, including ransomware and Advanced Persistent Threat (APT) cases.\n\nWe have a global consulting team standing by to assist you, providing around-the-clock support where required, as well as local assistance.\n[Please contact us here: https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incident-response-containment](https://www.blackberry.com/us/en/forms/cylance/handraiser/emergency-incident-response-containment)\n\n### Further Reading\n\n## About The BlackBerry Research & Intelligence Team\n\nThe BlackBerry Research & Intelligence team examines emerging and persistent threats, providing intelligence analysis for the benefit of\ndefenders and the organizations they serve.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-14 - GootLoader, From SEO Poisoning to Multi-Stage Downloader.pdf"
    ],
    "report_names": [
        "2022-07-14 - GootLoader, From SEO Poisoning to Multi-Stage Downloader.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535658,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1660792876,
    "ts_modification_date": 1660792876,
    "files": {
        "pdf": "https://archive.orkl.eu/45fb071371d6657e7e957fb2a15c7c5e87bda7ec.pdf",
        "text": "https://archive.orkl.eu/45fb071371d6657e7e957fb2a15c7c5e87bda7ec.txt",
        "img": "https://archive.orkl.eu/45fb071371d6657e7e957fb2a15c7c5e87bda7ec.jpg"
    }
}