{
    "id": "8d7c86dd-9124-4cd4-91d4-06a28c5fec6c",
    "created_at": "2022-10-25T16:48:17.897484Z",
    "updated_at": "2025-03-27T02:16:57.897021Z",
    "deleted_at": null,
    "sha1_hash": "28daf3ac0fd51cfb17d851fe8469d7f8a620452b",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-04-30T10:30:31Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 448098,
    "plain_text": "Analyse de la Menace et des Risques Modes Opératoires des Attaquants\n\n\n# LE GROUPE CYBERCRIMINEL SILENCE\n\n\n**Date de création** 22/10/2019\n\n**Date de publication** 23/04/2020\n\n**Acteur(s) offensif(s) concerné(s)** Criminalité\n\n**Secteur(s) d’activité concerné(s)** Finance\n\n**Résumé opérationnel** Silence est un groupe de cybercriminels supposément russophone, actif\ndepuis 2016, et ciblant des institutions financières à travers le monde. Depuis ses débuts, leur degré de sophistication s’est accru, de sorte qu’ils utilisent désormais une infrastructure d’attaque qu’ils ont eux-même créé\nafin d’opérer des retraits frauduleux aux distributeurs automatiques de\nbillets.\n\n|Col1|ACRONYME|DÉSIGNATION|DÉFINITION|\n|---|---|---|---|\n|FAITS|(C)|Constaté|Informations vérifiées par l’agence ou des partenaires nationaux.|\n||(NV)|Non vérifiable|Non vérifiable avec les capacités de l’agence.|\n|COMMENTAIRES|(I)|Interprétation|Information déduite des éléments constatés ou non vérifiables à la disposition de l’agence.|\n||(HYP)|Hypothèse|Hypothèse.|\n\n\n-----\n\nLe groupe cybercriminel Silence\n# Sommaire\n\n**1** **Ciblage privilégié de Silence : les banques . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **3**\n\n**2** **Mode opératoire . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **4**\n2.1 Compromission . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n2.2 Propagation . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n2.3 Exécution de l’attaque . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n2.3.1 Accès à l’application de gestion des DAB . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n2.3.2 Accès au système de traitement de cartes bancaires . . . . . . . . . . . . . . . . . . . . . . . . 7\n\n**3** **Liens entre Silence et TA505** . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . **8**\n\n**4** **Conclusion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **8**\n\n**5** **Bibliographie . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .** **9**\n\n23/04/2020 Page 2 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\n## 1 Ciblage privilégié de Silence : les banques\n\nSilence[1] est un groupe de cybercriminels, supposément russophones et indépendants, actif depuis 2016. Il ciblait\nalors en particulier des banques de pays de la CEI (Russie, Biélorussie, Moldavie, Arménie, Kazakhstan, etc.) et\nd’Ukraine, mais a depuis étendu son périmètre à une trentaine de pays en Europe (dont l’Allemagne, la Suisse, le\nRoyaume-Uni et l’Autriche), en Asie (dont Israël, la Turquie, Taïwan, la Malaisie et la Corée du Sud) et en Afrique\n(dont le Ghana et le Kenya) [1].\n\nD’après Group-IB [1, 2], des adresses IP localisées en France auraient communiqué avec l’infrastructure de commande et de contrôle (C2) de Silence en 2019, ce qui était apparemment déjà le cas en 2016 et 2017.\n\nIP Fournisseur Pays Programme Annee\n\n5.39.30.110 OVH France Silence.Downloader 09-2016\n\n54.36.191.97 OVH France Silence.Downloader 10-2017\n\n164.132.228.29 OVH France Silence.Downloader 06-2017\n\n137.74.224.142 OVH France Silence.Downloader 08-2017\n\n92.222.68.32 OVH France Silence.Downloader 04-2017\n\n139.99.156.100 OVH France Exploit 10-2017\n\n149.56.131.140 OVH France Meterpreter 08/10-2017\n\n51.255.200.161 OVH France Exploit CVE-2017-0199 06-2017\n\n109.13.212.72 SFR SA France pakovelli@mail.com 08-2017\n\nL’adresse IP 5.39.30.110 (OVH) a été utilisée comme serveur C2 de Silence.Downloader en septembre 2016. Cette\nadresse IP a été résolue entre août 2012 et juin 2019 par le nom de domaine « cours-a-domicile.fr ». Cependant,\nune résolution DNS observée pendant aussi longtemps peut être le signe que le nom de domaine a été ”abandonné”.\nEn outre, au cas où Silence ait utilisé le C2 pour faire de l’hameçonnage ciblé, cela pourrait indiquer un ciblage\nd’entités francophones. Ainsi, bien que l’ANSSI n’en ait pas eu connaissance, il n’est pas exclu que la France puisse\nêtre ciblée, ou qu’elle l’ait déjà été.\n\nL’une des sources de profit de ce groupe cybercriminel réside dans la manipulation de distributeurs automatiques de\nbillets (DAB), bien qu’ils ne se limitent pas qu’à cette activité, adaptant leurs outils à l’environnement compromis.\nEn effet, alors que lors de ses première attaques, Silence utilisait des outils développés par d’autres cybercriminels[2]\n\nles outils et codes malveillants qu’il utilise actuellement ont majoritairement été développés par ses membres (Silence, Atmosphere, Farse et Cleaner[3]) [2, 1].\n\nGénéralement, après compromission du SI de la victime, le serveur C2 de Silence propage une charge utile contenant plusieurs modules et permettant aux attaquants :\n\n  - soit d’accroître les plafonds de retraits aux DAB, ainsi que les plafonds de découverts des cartes de clients via\nl’intrusion dans le système de traitement de cartes bancaires (card processing) de la banque ;\n\n  - soit de prendre le contrôle des DAB de la banque, via l’intrusion dans son application de gestion des DAB.\n\nDes retraits simultanés sont dans les deux cas réalisés par des mules[4].\n\nEn 2016, le groupe Silence a également cherché à deux reprises à émettre des virements frauduleux depuis le système de transfert interbancaire russe AWS CBR (équivalent russe de Swift) [2].\n\nAu total, de juin 2016 à juin 2019, Silence aurait dérobé environ 4,2 millions de dollars à des banques [1].\n\nLe groupe Silence est apparu particulièrement actif au cours de l’année 2019 et mérite donc une attention particulière. En effet, de septembre 2018 à août 2019, Group-IB décompte déjà 16 campagnes de Silence [1], et au moins\n7 campagnes concluantes :\n\n1FireEye dénomme TEMP.TruthTeller ce qu’il considère être une partie de l’activité de Silence. Pour Crowdstrike, Silence se réfère à Whisper\nSpider.\n2Par exemple, ils utilisaient la porte dérobée Kikothac, développée par un tiers, avant de concevoir leur porte dérobée Silence.MainModule.\n3Cet outil sert à supprimer les traces d’une connexion à distance des attaquants au sein du SI de la victime.\n4Individu qui transfère des fonds d’origine frauduleuse via différents comptes bancaires dans différents pays.\n\n23/04/2020 Page 3 sur 9\n\n|IP|Fournisseur|Pays|Programme|Annee|\n|---|---|---|---|---|\n|5.39.30.110|OVH|France|Silence.Downloader|09-2016|\n|54.36.191.97|OVH|France|Silence.Downloader|10-2017|\n|164.132.228.29|OVH|France|Silence.Downloader|06-2017|\n|137.74.224.142|OVH|France|Silence.Downloader|08-2017|\n|92.222.68.32|OVH|France|Silence.Downloader|04-2017|\n|139.99.156.100|OVH|France|Exploit|10-2017|\n|149.56.131.140|OVH|France|Meterpreter|08/10-2017|\n|51.255.200.161|OVH|France|Exploit CVE-2017-0199|06-2017|\n|109.13.212.72|SFR SA|France|pakovelli@mail.com|08-2017|\n\n\n-----\n\nLe groupe cybercriminel Silence\n\n  - en mai 2018 et février 2019, le groupe Silence a attaqué deux banques indiennes ;\n\n  - en février 2019, il a dérobé à la banque russe Omsk IT Bank environ 400000 dollars ;\n\n  - en mai 2019, il a dérobé à la banque bangladaise Dutch-Bangla Bank environ 3 millions de dollars ;\n\n  - en juin 2019, il a attaqué des banques russes ;\n\n  - en juillet 2019, il a attaqué des banques au Chili, au Costa Rica, en Bulgarie et au Ghana.\n\n## 2 Mode opératoire\n\n### 2.1 Compromission\n\nSilence cible ses victimes au travers de courriels d’hameçonnage usurpant l’image d’institutions financières. Parfois, les courriels proviennent d’adresses légitimes d’employés d’institutions dont le SI a déjà été compromis [3], les\nrendant d’autant plus crédibles.\n\nCes courriels contiennent une pièce jointe malveillante :\n\n  - soit sous la forme d’un document Word contenant une macro ou un exploit ;\n\n  - soit sous la forme d’un fichier ZIP ou RAR contenant un fichier CHM[5] ;\n\n  - soit sous la forme d’un document exploitant les CVE-2017-0199[6] et CVE-2017-11882[7] qui télécharge et exécute\nun fichier HTA contenant un VBScript ;\n\n  - soit sous la forme d’un fichier .lnk[8].\n\nEn guise de phase préparatoire, il arrive également que Silence envoie massivement des milliers de courriels à travers le monde dans le but de mettre à jour sa base de données des adresses courriel actives de ses cibles et d’étendre\nson périmètre géographique d’attaque. Ces courriels contiennent une image ou un lien mais sont dépourvus de\ncharge malveillante [1]. Group-IB a ainsi constaté trois campagnes de ce type visant la Russie, les pays de l’ex-Union\nsoviétique, l’Asie, l’Europe et la Nouvelle-Zélande en 2018.\n\n### 2.2 Propagation\n\nEn cliquant sur la pièce jointe malveillante, la victime déclenche la propagation automatique au sein du système\nd’information (SI) de l’outil d’administration à distance Truebot (ou Silence.Downloader). Ce code malveillant, en\ncommuniquant avec le C2, est utilisé pour propager d’autres charges utiles.\n\nLors de campagnes plus récentes (en mai 2019), Group-IB a identifié la propagation du code malveillant Ivoke en\ntant que première charge utile, plutôt que celle de Truebot [1].\n\nEn outre, Silence utilise parfois un utilitaire proxy, Silence.ProxyBot (Turncard) ou Silence.ProxyBot.net (Fourthstreet), qui forme un proxy entre les machines compromises et le serveur C2, afin de pouvoir atteindre les éléments\nlocaux du réseau compromis qui ne sont pas accessibles à distance.\n\n5Les fichiers CHM sont des fichiers HTML compilés. Lorsqu’un utilisateur Windows ouvre un fichier CHM, Windows lance le programme d’aide\nHTML de Microsoft afin d’afficher le fichier HTML compilé. En modifiant le fichier d’aide légitime pour inclure un contenu malveillant se\ndéclenchant lorsque la documentation est affichée (par exemple lancement d’une commande PowerShell), un attaquant peut compromettre\nun SI.\n6Faille dans Office découverte en mars 2017 permettant de dissimuler des instructions malveillantes dans un document sauvegardé au format\n.RTF.\n7Vulnérabilité d’exécution de code à distance existant dans le logiciel Microsoft Office lorsque celui-ci ne parvient pas à gérer correctement les\nobjets en mémoire, découverte en novembre 2017.\n8Fichier utilisé pour diriger vers un fichier exécutable sous Windows.\n\n23/04/2020 Page 4 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\nFig. 2.1 : Exfiltration d’informations système via un utilitaire proxy\n\nSilence récupère des informations, exfiltre des données ou télécharge des fichiers au sein du SI par le biais d’au\nmoins trois codes malveillants possibles :\n\n  - Slowroll (Silence.Mainmodule) : cette porte dérobée communique directement avec le serveur C2 ou par le\nbiais d’un serveur proxy ;\n\n  - EmpireDNSAgent (EDA) : cet outil, basé sur Empire et sur dnscat2te, est une porte dérobée, distribuée par\nSlowroll, et communiquant avec le serveur C2 par tunnel DNS ;\n\n  - Cardcam[9] : cet utilitaire réalise des captures d’écran ainsi que des enregistrements vidéo du système compromis, afin de permettre aux attaquants de comprendre le fonctionnement de l’entité victime et d’identifier les\nlogiciels qu’elle utilise.\n\n### 2.3 Exécution de l'attaque\n\n#### 2.3.1 Accès à l'application de gestion des DAB\n\nCEN/XFS est un standard avec lequel la majorité des fabricants de DAB (Diebold, Wincor, NCR) sont en conformité. Du fait de l’interprétation variée que ces fabricants avaient de ce standard, il est devenu répandu d’utiliser le\ngestionnaire XFS (XFS manager). C’est un intergiciel (middleware) qui fournit une architecture client-serveur pour\nl’application Windows qui gère les DAB. Il représente donc l’interface entre l’application et le DAB.\n\n9Identifié par Kaspersky en novembre 2017, il est dénommé Cardcam par FireEye.\n\n23/04/2020 Page 5 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\nFig. 2.2 : Interactions avec le DAB\n\n_Commentaire : toute application développée en conformité avec le standard XFS pourrait prendre le contrôle d’un DAB._\n_En effet, le standard XFS unifie le fonctionnement des applications avec tout DAB. Développé en tenant compte de la_\n_logique de ce standard, une application, légitime ou malveillante, est capable d’administrer des objets de bas niveau au_\n_niveau d’un DAB [4]._\n\nTruebot distribue Atmosphere.Dropper dans le SI de la victime. Atmosphere.Dropper repère l’application de gestion des DAB et son processus dont la fonction est de transmettre des commandes aux DAB. Par exemple, pour les\nDAB du fabricant Wincor-Nixdorf, ce processus s’appelle fwmain32.exe.\n\nUne fois le processus repéré, Atmosphere.Dropper ou Atmosphere.Injector (lui-même distribué par Atmosphere.Dropper),\ny injecte la dynamic link library (DLL)[10] Atmosphere. Celle-ci permet à l’attaquant d’activer la charge utile Atmosphere.\n\nFig. 2.3 : Injection de la DLL malveillante au sein du processus légitime de commande aux DAB\n\nUne fois activée, elle permet aux attaquants :\n\n  - d’exécuter une commande pour récupérer des informations sur le contenu des cassettes du DAB ;\n\n  - de contrôler à distance les retraits d’argent, en envoyant une commande au DAB ;\n\n  - ou de contrôler physiquement le DAB, en tapant une combinaison spécifique sur le clavier du DAB.\n\n10Une DLL est une bibliothèque logicielle, contenant du code et des données, dont les fonctions sont chargées en mémoire par un programme\nau besoin lors de son exécution.\n\n23/04/2020 Page 6 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\nFig. 2.4 : Mode opératoire de Silence résultant en des retraits frauduleux aux DAB\n\n_Commentaire : Cette technique de repérage du processus de commande des DAB et d’injection d’une DLL malveillante_\n_n’a semble-t-il pas été inventée par Silence, comme en attestent des éléments en source ouverte, datant de 2009 [5]. En_\n_outre, cette technique n’est pas la seule permettant de compromettre un DAB. Le MOA Lazarus utiliserait par exemple_\n_un code malveillant interceptant les demandes de retraits frauduleuses de leurs mules afin d’autoriser le retrait sans que_\n_l’application légitime de la banque n’en ait eu connaissance._\n\n#### 2.3.2 Accès au système de traitement de cartes bancaires\n\nAfin d’effectuer des retraits frauduleux aux DAB, Silence essaierait parfois d’accéder au système de traitement de\ncartes bancaires (card processing) au sein du SI de la banque victime afin de retirer les plafonds de retrait et de\ndécouvert de cartes bancaires préalablement activées, puis enverrait des mules retirer l’argent.\n\n_Commentaire : Lorsque des attaquants ont accès au système de traitement de carte, l’argent peut être retiré dans n’im-_\n_porte quel DAB de n’importe quelle banque depuis n’importe quel pays. En revanche, lorsque des attaquants compro-_\n_mettent directement l’application de gestion de DAB, les mules doivent se déplacer là où se trouve la banque victime afin_\n_de pouvoir retirer l’argent. Ce fût le cas lors de l’attaque de Silence contre la banque bangladaise DBBL en mai 2019 [6]._\n\nAfin d’accéder au système de traitement de carte, Silence compromettrait le compte avec privilèges d’un employé\nde la banque victime, en récupérant son mot de passe par le biais de l’outil Farse. Cet outil est une version modifiée\nde Mimikatz (dont le code source est disponible sur Github).\n\nFig. 2.5 : Compromission du système de traitement de carte\n\n23/04/2020 Page 7 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\n_Commentaire : Des exfiltrations de données clients au sein d’entreprises de système de paiement/retrait tels que Mas-_\n_tercard ou Visa peuvent conduire à leur vente sur le Dark Web, et à leur utilisation par des cybercriminels à des fins_\n_de clonage de cartes bancaires. Ces cartes peuvent ensuite servir aux mules lors de retraits frauduleux aux DAB. Par_\n_exemple, l’exfiltration de données dont a été victime MasterCard en août 2019 pourrait avoir servi à de telles fins._\n\n## 3 Liens entre Silence et TA505\n\nD’après Group-IB, Truebot et FlawedAmmyy.Downloader[11] auraient été développés par une même personne russophone. Or, FlawedAmmyy.Downloader aurait été utilisé depuis 2016 au cours de campagnes d’hameçonnage\naussi bien massives que ciblées, dont la plupart serait le fait de TA505 [7, 8, 9]. .\n\n_Commentaire : FlawedAmmyy et Truebot auraient d’ailleurs été développés en 2016, année au cours de laquelle le groupe_\n_Silence a émergé, alors que TA505 était déjà actif depuis 2014._\n\nEnfin, aussi bien TA505 que Silence utilisent parfois des fichiers .lnk en guise de pièce jointe malveillante au sein\nde leurs courriels d’hameçonnage, pour respectivement délivrer FlawedAmmyy.downloader et Truebot. Or l’usage\nde ce format de fichier est rare.\n\nComme évoqué par Group-IB [10], il se pourrait que les liens entre TA505 et Silence soient dus au fait que Silence\nachète des accès aux SI de banques, notamment à TA505. Cet achat d’accès serait corrélé à la baisse d’envois de\ncourriels d’hameçonnage par Silence.\n\nA ce titre, fin 2019, TA505 aurait ouvert l’accès au SI d’au moins une banque en Europe à Silence [11].\n## 4 Conclusion\n\nA ses débuts, Silence commettait des erreurs au cours de ses attaques, et mimait des techniques provenant d’autres\ngroupes. Par exemple, le fait de prendre des captures d’écran des postes infectés des employés de la banque victime\nproviendrait de Carbanak[12]. Aujourd’hui, Silence est l’un des groupes cybercriminels les plus actifs et sophistiqués\ncontre le secteur bancaire.\n\nLes attaques de Silence seraient facilitées par l’absence de conformité PCI DSS[13] des banques victimes. Par exemple,\nune attaque récente de Silence sur la Dutch Bangladesh Bank Limited (DBBL) ayant provoqué le retrait de 3 millions de dollars, a été facilitée par le fait que la DBBL n’appliquait pas la norme PCI DSS, tout comme 95% des\nbanques présentes au Bangladesh, mais aussi comme un certain nombre de banques en Asie. Ces banques sont\npar conséquent des cibles plus propices aux attaques de Silence que les banques européennes, bien que Silence\ns’en prenne depuis le second semestre 2018 à des banques de tous horizons, Europe incluse. Cet élargissement du\npérimètre d’attaque de Silence est concomitant à sa montée en compétence.\n\n11FlawedAmmyy est un outil d’accès à distance (remote access trojan) basé sur la fuite du code source du logiciel légitime Ammyy Admin en\n2016, et contenant un downloader et une charge utile.\n12Le code source de la porte dérobée Carbep, active depuis 2010, a fuité en 2013. De Carbep auraient été dérivés les codes malveillants Anunak et\nCarbanak. Ces deux codes malveillants ont été utilisés de 2013 à 2015 par le groupe communément appelé Carbanak dans le cadre d’attaques\nciblées sur des banques et des systèmes de paiement dans une trentaine de pays afin de dérober plus d’un milliard de dollars.\n13Certification mondiale assurant la sécurité des données (cartes et données bancaires) traitées. Elle s’applique aux différents acteurs de la\nchaîne monétique, et incite à 300 contrôles de sécurité. Être en conformité avec PCI DSS c’est notamment sauvegarder les données de cartes\nbancaires des clients de manière sécurisée, notamment via le chiffrement, le contrôle en continu et les tests de sécurité de l’accès aux données\ndes cartes.\n\n23/04/2020 Page 8 sur 9\n\n\n-----\n\nLe groupe cybercriminel Silence\n\n## 5 Bibliographie\n\n[1] GROUP-IB, “SILENCE 2.0”. In : (août 2019).\n\n[2] GROUP-IB, “Silence : Moving into the Darkside”. In : (sept. 2018).\n\n[3] [REAQTA. Silence Group Targeting Russian Banks via Malicious CHM. 24 jan. 2019. URL : https://reaqta.com/](https://reaqta.com/2019/01/silence-group-targeting-russian-banks/)\n```\n   2019/01/silence-group-targeting-russian-banks/ (visité le 22/10/2019).\n\n```\n[4] KASPERSKY. Le Jackpot des distributeurs automatiques de billets : malwares et autres méthodes d’enrichissement.\n[26 avr. 2016. URL : https://securelist.fr/malware-and-non-malware-ways-for-atm-jackpotting-](https://securelist.fr/malware-and-non-malware-ways-for-atm-jackpotting-extended-cut/64949/)\n```\n   extended-cut/64949/ (visité le 24/12/2019).\n\n```\n[5] NE SCRIE CAIAFA VERDE. Study on ATM Security : Code Injection on Wincor Nixdorf ATMs. 3 juin 2009. URL :\n```\n   http://caiafaverde.blogspot.com/2009/06/study-on-atm-security-code-injection-on.html\n\n```\n(visité le 30/10/2019).\n\n[6] BLEEPING COMPUTER. Silence Group Likely Behind Recent $3M Bangladesh Bank Heist. 3 juil. 2019. URL :\n```\n   https://www.bleepingcomputer.com/news/security/silence-group-likely-behind-recent-3m   bangladesh-bank-heist/ (visité le 03/07/2019).\n\n```\n[7] [TREND MICRO. FlawedAmmyy Malware Information. 31 juil. 2019. URL : https://success.trendmicro.com/](https://success.trendmicro.com/solution/1123301-flawedammyy-malware-information)\n```\n   solution/1123301-flawedammyy-malware-information (visité le 04/11/2019).\n\n```\n[8] [PROOFPOINT. Leaked Ammyy Admin Source Code Turned into Malware. 7 mar. 2018. URL : https://www.](https://www.proofpoint.com/us/threat-insight/post/leaked-ammyy-admin-source-code-turned-malware)\n```\n   proofpoint.com/us/threat-insight/post/leaked-ammyy-admin-source-code-turned-malware (visité\n\n```\nle 04/11/2019).\n\n[9] TRENDMICRO. TA505 At It Again - Variety Is the Spice of ServHelper and FlawedAmmyy. 27 août 2019. URL :\n```\n   https://blog.trendmicro.com/trendlabs-security-intelligence/ta505-at-it-again-variety   is-the-spice-of-servhelper-and-flawedammyy/ (visité le 27/08/2019).\n\n```\n[10] GROUP-IB. Group-IB Presents Its Annual Report on Global Threats to Stability in Cyberspace. 29 nov. 2019. URL :\n```\n   https://www.group-ib.com/media/gib-2019-2020-report/ (visité le 24/12/2019).\n\n```\n[11] GROUP-IB, “New Financially Motivated Attacks in Western Europe Traced to Russian-Speaking Threat Actors”. In : (27 mar. 2020).\n\n23/04/2020 Page 9 sur 9\n\n\n-----",
    "language": "FR",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.cert.ssi.gouv.fr/uploads/CERTFR-2020-CTI-004.pdf"
    ],
    "report_names": [
        "CERTFR-2020-CTI-004.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e8ebcbda-e8df-4a38-a2a6-63b2608ee6f3",
            "created_at": "2023-01-06T13:46:38.88051Z",
            "updated_at": "2025-03-27T02:00:02.94193Z",
            "deleted_at": null,
            "main_name": "Silence group",
            "aliases": [
                "WHISPER SPIDER"
            ],
            "source_name": "MISPGALAXY:Silence group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1588242631,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/28daf3ac0fd51cfb17d851fe8469d7f8a620452b.pdf",
        "text": "https://archive.orkl.eu/28daf3ac0fd51cfb17d851fe8469d7f8a620452b.txt",
        "img": "https://archive.orkl.eu/28daf3ac0fd51cfb17d851fe8469d7f8a620452b.jpg"
    }
}