{
    "id": "8dbbff21-8dab-4380-9520-c1b1e5ba884f",
    "created_at": "2023-01-12T15:09:19.577082Z",
    "updated_at": "2025-03-27T02:17:01.032633Z",
    "deleted_at": null,
    "sha1_hash": "311738fae5c9d0e6adbc7de99358ef137754cca4",
    "title": "2022-09-12 - Security Breaks- TeamTNT’s DockerHub Credentials Leak",
    "authors": "",
    "file_creation_date": "2022-10-02T12:13:32Z",
    "file_modification_date": "2022-10-02T12:13:32Z",
    "file_size": 2243930,
    "plain_text": "# Security Breaks: TeamTNT’s DockerHub Credentials Leak\n\n**[trendmicro.com/en_us/research/22/i/security-breaks-teamtnts-dockerhub-credentials-leak.html](https://www.trendmicro.com/en_us/research/22/i/security-breaks-teamtnts-dockerhub-credentials-leak.html)**\n\nSeptember 12, 2022\n\nContent added to Folio\n\nCloud\n\nOne of our honeypots based on exposed Docker REST APIs showed cybercriminal group\nTeamTNT’s potential attack scenario and leak of container registry credentials for dockerabuse malware. The full version of this research will be presented at the c0c0n XV Hacking\nand Cyber Security Conference in September 2022.\n\nBy: Nitesh Surana\nSeptember 12, 2022\nRead time: ( words)\n\nWe constantly deploy and study our honeypots to get a view of actively exploited\n[vulnerabilities and misconfigurations on platforms and services that pose cloud security risks.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/cloud-security-key-concepts-threats-and-solutions)\n[One of these honeypots is based on exposed Docker REST API for analysis from cloud](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/teamtnt-activities-probed)\n\n\n-----\n\nservices providers and users perspectives. Upon analyzing the samples, we realized and\n[were able to understand the threat actors’ use of container registry features for Docker](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/container)\nmalware and tactics, techniques, and procedures (TTPs).\n\nOur honeypots showed threat actor TeamTNT were leaking credentials from at least two of\ntheir attacker-controlled DockerHub accounts, namely alpineos (with over 150,000 pulls) and\n_sandeep078 (with 200 pulls). We have notified Docker about these accounts._\n\nThe account alpineos was used in exploitation attempts on our honeypots three times, from\nmid-September to early October 2021, and we tracked the deployments’ IP addresses to\ntheir location in Germany. The threat actors were logged in to their accounts on the\nDockerHub registry and probably forgot to log out. Unless a user is not logged out manually,\nthe header “X-Registry-Auth\" stores the credentials.\n\nThese DockerHub profiles were actively used to deploy malicious images containing the\nfollowing:\n\n1. Rootkits\n2. Docker escape kits\n3. XMRig Monero miners\n4. Credential stealers\n5. Kinsing malware\n6. Kubernetes exploit kits\n\nIn July 2021, we [published our research on TeamTNT’s malicious activities and found](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/teamtnt-activities-probed)\n[evidence of the group infiltrating via the Docker API. As a result, we found 26 unique](https://documents.trendmicro.com/assets/white_papers/wp-tracking-the-activities-of-teamTNT.pdf#page=15)\nDockerHub accounts that are either compromised or malicious. Of the two we identified here,\nthe most interesting account for study was the alpineos account, which hosted malicious\ncontainer images with over 150,000 pulls.\n\nContainer registries and Docker daemon\n\nDocker is a container services platform that helps developers follow a write-once-run[anywhere (WORA) practice. It’s simple to use and is favored by developers, as a user can](https://www.docker.com/blog/key-insights-from-stack-overflows-2022-developer-survey/#:~:text=Docker%20is%20the%20%231%20most%20loved%20development%20tool%2C%20and%20remains%20the%20%231%20most%2Dwanted%20tool.)\nwrite services and deploy applications at great speed. Most importantly, Docker works with\nany platform.\n\nContainer registries are storage and distribution platforms for container images, similar to\nhow codes or programs are hosted on repositories like GitHub. With the right authorization\ncontext, one can simply “pull” an image, create a container based on it, and deploy\napplications. Many container registries such as DockerHub, Amazon Elastic Container\nRegistry (ECR), and Alibaba Container Registry, to name a few, host container images.\n\n\n-----\n\nWhen you create a container, the container daemon looks up the image from the container\nregistry by default. In our analysis, we use DockerHub as an example.\n\nFigure 1. A “Hello World”\n\nexample of the Docker daemon (dockerd) pulling the image from Docker Hub\nIf we don’t specify the registry, DockerHub is considered by default. Docker provides a\nfeature for developers to create containers on a remote host when the Docker daemon (on\nthe server) is configured to listen over the TCP port, which is port 2375 by default. This\nmakes remote development and deployment easy for developers as it provides an interface\nto various Docker services like images, containers, networks, and volumes using tools like\ncurl, wget, and docker-cli.\n\nDocker REST API for container creation\n\nConsider a scenario where a new container with an alpine image base (Alpine Linux, a\ndistribution based on musl libc library and BusyBox utilities) is created on remote server\n172[.]31[.]42[.]11 via docker REST API. The remote server has the dockerd exposed over\nTCP port 2375.\n\nFigure 2. Container created based on alpine image on a remote host\n\n\n-----\n\nFigure 3. Network server traffic\nLooking at the server network traffic log, we can see that when a new container is requested\nfor creation on a remote server, this is the sequence that follows:\n\n1. The client pings the target server (packet 2298) to test if the server is accessible.\n2. The server responds with the status code 200 and that it is accessible (packet 2300).\n3. The client requests that the server create a container from an image named “alpine”\n\n(packet 2302).\n4. If the server cannot find the “alpine” image locally, it replies with the status code 404\n\n(packet 2304).\n5. The client requests for the server information from </<version>/info endpoint> (packet\n\n2306).\n6. The server responds to the request with system-wide information (packet 2308).\n\nFigure 4. Showing 404 status code as alpine image is locally unavailable\n\n\n-----\n\nFigure 5. Returning system-wide information\n7.  The client requests the server to create a container from the alpine image. The “latest”\ntag is chosen when no tags are specified.\n\n8.  The server responds with the download progress of the alpine image from DockerHub.\n\nFigure 6. Creating a container from\n\nthe alpine image\n9.  The client requests the server to create a container from the now-downloaded alpine\nimage.\n\nFigure 7. Request to create a container; the server responds with the ID of the newly created\ncontainer\n\n\n-----\n\nNotice the value in the X-Registry-Auth header from Figure 6, where the header is with a\nBase64-encoded string {}. The Docker [documentation in Figure 8 enumerates the](https://docs.docker.com/engine/api/v1.41/#section/Authentication)\nauthentication details:\n\nFigure 8. Docker documentation on registries’ authentication\nIn the said scenario, the client who initiated the creation of the alpine-based container on the\nserver did not log in to the DockerHub registry. Hence, the value of the X-Registry-Auth\nheader is {} encoded in Base64. Using “docker login”, one can authenticate to container\nregistries and securely work on their repository.\n\nShould an authorized user repeat the procedure wherein a legitimate user with a profile of\n“satoshiav0cad0” is logged in using “docker login” and looks at the same header value, the\nheader X-Registry-Auth would now contain the credentials encoded in Base64.\n\nFigure 9. Credentials encoded in Base64\n\nFigure 10. Decoding the credentials from Base64\nThese are the DockerHub credentials of user “satoshiav0cad0”. Upon analysis, the\ncredentials can be seen in the aforementioned header X-Registry-Auth only because the\nclient initiating the request to create a container on a target server had authenticated it to\ntheir DockerHub container registry.\n\n\n-----\n\nAs a legitimate use case, a user might want to authenticate their DockerHub repository to\ncreate containers based on the images in their private repository. But if the user forgets to\nlog out from DockerHub using “docker logout” and creates containers on untrusted hosts with\ndockerd exposed over TCP, the user becomes at risk since their usernames and passwords\nare hard-coded and non-encrypted, not to mention only encoded in Base64.\n\nCredential leak scenarios\n\nIn the first scenario, the victim is logged in to their DockerHub registry. An attacker gains\naccess to the victim’s virtual machine (VM) and tries to create a container on a remote server\nwith the dockerd exposed over TCP. If the image that the container attempts for creation\ndoes not exist, the image is pulled from DockerHub and the header X-Registry-Auth is\npopulated with the Base64-encoded credentials.\n\nFigure 11. Scenario 1: The image pulled from DockerHub contains the Base64-encoded\ncredentials.\nOnce abused, these compromised accounts can be used to view the following information\nand even pivot in the following ways:\n\n1. Associated email and reused credentials. Cybercriminals can check for passwords\n\nbeing reused across different platforms and check for password leaks.\n2. Private repositories and images. These might contain credentials like API keys and\n\nmodify private images with backdoors.\n3. Access tokens. These can be used to maintain persistent access to the account.\n4. Developers’ tools. Pro features (like Teams, Organization, and Build pipelines) can be\n\nused to contaminate the build pipelines based on Docker and lead to supply-chain\nattacks.\n\n\n-----\n\nFrom a different perspective, another attack scenario could involve the attacker s account\nitself, where the cybercriminals are logged in to their own DockerHub registry and their\naccounts leak credentials. While legitimate users might not be concerned about stealing\nthreat actors’ credentials, we analyzed that the procedure in creating a new container is also\napplicable to catching threat actors who might have left their respective accounts logged in.\nThey might then attempt to create a container in the honeypot with an exposed dockerd over\nTCP. Since our honeypot has tcpdump running and captures network traffic as packet\ncapture (PCAP), we can fetch the credentials of the attacker encoded in Base64.\n\nFigure 12. Scenario 2: Attackers’ credentials leaked\nConclusion\n\nDevelopers use containers to aid them in their development and deployments, optimize their\nworkflows, and increase their productivity. Likewise, small gaps such as component\nmisconfigurations have been known to be abused by cybercriminals. Malicious actors can\nperform damaging activities from these openings, like compromising the host for\nunauthorized cryptocurrency mining, exfiltrating sensitive information such as keys and\ncredentials, or — at its worst— controlling victim servers to expand botnet malware usage,\namong other illicit activities. Indeed, cybercriminal groups such as TeamTNT will not stop\nanytime soon for as long as there are components and accounts that can be abused.\n\nBased on our observations, we were able to identify TeamTNT’s accounts because of one of\nthe members’ mistake on three occasions. There are three possible scenarios in which the\nuser could have made this error:\n\n1. The threat actors logged in to their DockerHub account using the credentials of\n\nalpineos.\n2. The threat actors’ machines were self-infected and were not using credential helpers.\n\n\n-----\n\n3. The threat actors didn t log out from their DockerHub account while attacking exposed\n\nDocker REST API servers.\n\nWe found a total of 30 such accounts that were compromised, the credentials for which were\nbeing leaked. The registries for these were DockerHub and Alibaba Cloud Container\nRegistry. While we have acquired this information and have access to the aforementioned\ncredentials that might have been abused by TeamTNT, we did not access these credentials\nunauthorized. We have also informed Docker about these accounts and are working with\nthem to resolve the matter.\n\nOrganizations’ security teams need to be aware that developer security is critical considering\nthis type of compromise around developer-centric tools like Docker have been observed\nbeing abused by threat actors. We advise that teams create policies for access and\ncredential use, as well as generate threat models of their environments. Security teams can\nuse these to educate developers about what can go wrong. Here are some mitigation\npractices for organizations and developers:\n\nWhile creating containers on a remote host via the Docker daemon REST API,\ndevelopers should be aware that DockerHub credentials will also be shared if they are\ncreating images from the specified container registry. They should proceed to do so\nonly when the remote host is trusted.\nWith the rising number of malicious open-source packages targeting user credentials,\nusers should avoid storing credentials in other components such as environment\n[variables. Instead, they must choose tools such as credential stores and helpers.](https://github.com/docker/docker-credential-helpers)\nIf users need to use the Docker Daemon over REST API via internet, it is\n[recommended that they configure the exposed REST API with TLS (Transport Layer](https://docs.docker.com/engine/security/protect-access/)\n[Security) protocol to avoid man-in-the-middle (MiTM) attacks sniffing for credentials.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/infosec-guide-defending-against-man-in-the-middle-attacks)\n\nThe full details of this research will be presented at the c0c0n XV Hacking and Cyber\nSecurity Conference scheduled on Sept. 21 to 24, 2022.\n\nIndicators of Compromise (IOCs)\n\nFor a full list of IOCs, you can visit our blog entries on previous incidents we documented\n[here and](https://www.trendmicro.com/en_us/research/21/k/compromised-docker-hub-accounts-abused-for-cryptomining-linked-t.html) [here.](https://www.trendmicro.com/en_us/research/21/l/more-tools-in-the-arsenal-how-teamtnt-used-compromised-docker-hu.html)\n\nsXpIBdPeKzI9PC2p0SWMpUSM2NSxWzPyXTMLlbXmYa0R20xk\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-12 - Security Breaks- TeamTNT’s DockerHub Credentials Leak.pdf"
    ],
    "report_names": [
        "2022-09-12 - Security Breaks- TeamTNT’s DockerHub Credentials Leak.pdf"
    ],
    "threat_actors": [
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a6c351ea-01f1-4c9b-af75-cfbb3b269ed3",
            "created_at": "2023-01-06T13:46:39.390649Z",
            "updated_at": "2025-03-27T02:00:03.072899Z",
            "deleted_at": null,
            "main_name": "Kinsing",
            "aliases": [
                "Money Libra"
            ],
            "source_name": "MISPGALAXY:Kinsing",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536159,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1664712812,
    "ts_modification_date": 1664712812,
    "files": {
        "pdf": "https://archive.orkl.eu/311738fae5c9d0e6adbc7de99358ef137754cca4.pdf",
        "text": "https://archive.orkl.eu/311738fae5c9d0e6adbc7de99358ef137754cca4.txt",
        "img": "https://archive.orkl.eu/311738fae5c9d0e6adbc7de99358ef137754cca4.jpg"
    }
}