{
    "id": "8de1cc98-c2f7-47b1-9e48-0fbcfea42c8d",
    "created_at": "2023-01-12T15:06:53.385993Z",
    "updated_at": "2025-03-27T02:05:39.5244Z",
    "deleted_at": null,
    "sha1_hash": "2f8816923997246d3d0fe6c9fe22e24876f808b5",
    "title": "2021-01-27 - Arrest, Seizures Tied to Netwalker Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:51Z",
    "file_modification_date": "2022-05-28T04:10:51Z",
    "file_size": 1227073,
    "plain_text": "# Arrest, Seizures Tied to Netwalker Ransomware\n\n**[krebsonsecurity.com/2021/01/arrest-seizures-tied-to-netwalker-ransomware](https://krebsonsecurity.com/2021/01/arrest-seizures-tied-to-netwalker-ransomware)**\n\nU.S. and Bulgarian authorities this week seized the darkweb site used by the NetWalker\nransomware cybercrime group to publish data stolen from its victims. In connection with the\nseizure, a Canadian national suspected of extorting more than $27 million through the\nspreading of NetWalker was charged in a Florida court.\n\nThe victim shaming site maintained by the NetWalker ransomware group, after being seized by\n\nauthorities this week.\n\nNetWalker is a ransomware-as-a-service crimeware product in which affiliates rent access to\nthe continuously updated malware code in exchange for a percentage of any funds extorted\nfrom victims. The crooks behind NetWalker used the now-seized website to publish personal\nand proprietary data stolen from their prey, as part of a public pressure campaign to convince\nvictims to pay up.\n\nNetWalker has been among the most rapacious ransomware strains, hitting at least 305\nvictims from 27 countries — the majority in the United States, according to Chainalysis, a\ncompany that tracks the flow virtual currency payments.\n\n“Chainalysis has traced more than $46 million worth of funds in NetWalker ransoms since it\n[first came on the scene in August 2019,” the company said in a blog post detailing its](https://blog.chainalysis.com/reports/netwalker-ransomware-disruption-arrest)\nassistance with the investigation. “It picked up steam in mid-2020, growing the average\nransom to $65 000 last year up from $18 800 in 2019 ”\n\n\n-----\n\nImage: Chainalysis\n\nIn [a statement on the seizure, the Justice Department said the NetWalker ransomware has](https://www.justice.gov/opa/pr/department-justice-launches-global-action-against-netwalker-ransomware)\nimpacted numerous victims, including companies, municipalities, hospitals, law enforcement,\nemergency services, school districts, colleges, and universities. For example, the University\n[of California, San Francisco paid $1.14 million last summer in exchange for a digital key](https://www.ucsf.edu/news/2020/06/417911/update-it-security-incident-ucsf)\nneeded to unlock files encrypted by the ransomware.\n\n“Attacks have specifically targeted the healthcare sector during the COVID-19 pandemic,\ntaking advantage of the global crisis to extort victims,” the DOJ said.\n\nU.S. prosecutors say one of NetWalker’s top affiliates was Sebastien Vachon-Desjardins,\nof Gatineau, in Ottawa, Canada. An indictment unsealed today in Florida alleges VachonDesjardins obtained at least $27.6 million from the scheme.\n\nThe DOJ’s media advisory doesn’t mention the defendant’s age, but [a 2015 report in the](https://www.ledroit.com/archives/le-gardien-dune-piece-secrete-au-cachot-7d524338f3e3e1afafe0ffa30099572a)\nGatineau local news website ledroit.com suggests this may not be his first offense. According\nto the story, a then-27-year-old Sebastien Vachon-Desjardins was sentenced to more than\nthree years in prison for drug trafficking: He was reportedly found in possession of more than\n50,000 methamphetamine tablets.\n\nThe NetWalker action came on the same day that European authorities announced a\ncoordinated takedown targeting the Emotet crimeware-as-a-service network. Emotet is a\npay-per-install botnet that is used by several distinct cybercrime groups to deploy secondary\n[malware — most notably the ransomware strain Ryuk and](https://krebsonsecurity.com/?s=ryuk&x=0&y=0) [Trickbot, a powerful banking](https://krebsonsecurity.com/?s=trickbot&x=0&y=0)\ntrojan.\n\n\n-----\n\nThe NetWalker ransomware affiliate program kicked off in March 2020, when the\nadministrator of the crimeware project began recruiting people on the dark web. Like many\nother ransomware programs, NetWalker does not permit affiliates to infect systems\nphysically located in Russia or in any other countries that are part of the Commonwealth of\nIndependent States (CIS) — which includes most of the nations in the former Soviet Union.\nThis is a prohibition typically made by cybercrime operations that are coordinated out of\nRussia and/or other CIS nations because it helps minimize the chances that local authorities\nwill investigate their crimes.\n\n[The following advertisement (translated into English by cybersecurity firm Intel 471) was](https://www.intel471.com/)\nposted by the NetWalker affiliate program manager last year to a top cybercrime forum. It\nillustrates the allure of the ransomware affiliate model, which handles everything from\nupdating the malware to slip past the latest antivirus updates, to leasing space on the dark\nweb where affiliates can interact with victims and negotiate payment. The affiliate, on the\nother hand, need only focus on finding new victims.\n\n\n-----\n\nWe are recruiting affiliates for network processing and spamming.\nWe are interested in people whose priority is quality and not quantity.\nWe prefer candidates who can work with large networks and have their own access to\nthem.\nWe are going to recruit a limited number of affiliates and then close the openings until\nthey are available again.\n\nWe offer you prompt and flexible ransomware, a user-friendly admin panel in Tor, an\nautomated service.\n\nEncryption of shared accesses: if several users are logged in to the target computer,\nthe ransomware will infect their mapped drives, as well as network resources where\nthose users are logged in — shared accesses/NAS etc.\n\nPowershell build. Each build is unique, in that the malware is inside the script – it is not\ndownloaded from the internet. This makes bypassing antivirus protection easier,\nincluding Windows Defender (cloud+).\n\nA fully automated blog where the victim’s dumped data is directed. The data is\npublished according to your settings. Instant and automated payouts: initially 20\npercent, no less than 16 percent.\n\nAccessibility of a crypting service to avoid AV detections.\n\nThe ransomware has been in use since September 2019 and proved to be reliable.\nThe files encrypted with it cannot be decrypted.\n\nTargeting Russia or the CIS is prohibited.\n\nYou’ll get all the information about the ransomware as well as terms and conditions\nafter you place an application via PM.\n\nApplication form:\n1) The field you specialize in.\n2) Your experience. What other affiliate programs have you been in and what was your\nprofit?\n3) How many accesses [to networks] do you have? When are you ready to start? How\nmany accesses do you plan on monetizing?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-27 - Arrest, Seizures Tied to Netwalker Ransomware.pdf"
    ],
    "report_names": [
        "2021-01-27 - Arrest, Seizures Tied to Netwalker Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536013,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653711051,
    "ts_modification_date": 1653711051,
    "files": {
        "pdf": "https://archive.orkl.eu/2f8816923997246d3d0fe6c9fe22e24876f808b5.pdf",
        "text": "https://archive.orkl.eu/2f8816923997246d3d0fe6c9fe22e24876f808b5.txt",
        "img": "https://archive.orkl.eu/2f8816923997246d3d0fe6c9fe22e24876f808b5.jpg"
    }
}