{
    "id": "8e4beb0c-2547-4bc8-873e-7ba4684cd58c",
    "created_at": "2023-04-05T02:08:50.819979Z",
    "updated_at": "2025-03-27T02:05:55.576373Z",
    "deleted_at": null,
    "sha1_hash": "2857bb04587fadb64e083f1ae692460e1496b95f",
    "title": "2023-03-13 - Emotet Returns, Now Adopts Binary Padding for Evasion",
    "authors": "",
    "file_creation_date": "2023-04-03T08:27:36Z",
    "file_modification_date": "2023-04-03T08:27:36Z",
    "file_size": 288379,
    "plain_text": "# Emotet Returns, Now Adopts Binary Padding for Evasion\n\n**[trendmicro.com/en_no/research/23/c/emotet-returns-now-adopts-binary-padding-for-evasion.html](https://www.trendmicro.com/en_no/research/23/c/emotet-returns-now-adopts-binary-padding-for-evasion.html)**\n\nMarch 13, 2023\n\n## Overview\n\nFollowing a three-month hiatus, Emotet spam activities resumed in March 2023, when a\nbotnet known as Epoch 4 began delivering malicious documents embedded in Zip files that\nwere attached to the emails.\n\nWe have been tracking the threat actor’s efforts to deploy new command-and-control (C&C)\ninfrastructure, where we detected activity spikes in January and February.\n\n**Date (2023)** **Count**\n\nJanuary 25 2\n\nJanuary 26 9\n\nJanuary 27 10\n\nFebruary 6 6\n\nFebruary 7 24\n\nFebruary 28 1\n\nMarch 1 37\n\nMarch 6 6\n\nMarch 7 9\n\nTable 1. Emotet C&C Server Infrastructure deployments during the early parts of 2023\n\nInfection chain\n\n\n-----\n\nFigure 1. Sample infection chain\nThe threat actors behind Emotet continue to use malicious documents containing macros to\ndeliver the malicious payload. Note that while Microsoft disabled macros from the internet by\ndefault in 2022, the document template employs social engineering techniques to trick users\ninto enabling macros to allow the attack to proceed as intended.\n\nThe threat actors behind these emails have adopted the use of binary padding as an evasion\ntechnique, where both the dropper document and the Emotet DLL files are inflated to 500+\n[megabytes to avoid security solutions. Other similar defense evasion techniques have](https://attack.mitre.org/techniques/T1027/001/)\n[previously been observed being used by other malicious actors.](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ransomware-recap-old-dogs-locky-samsam-hiddentear-learn-new-tricks?utm_source=trendlabs-social&utm_medium=smk&utm_campaign=08-2017-ransomware-recap)\n\n\n-----\n\nFigure 2. Malicious document prompting the user to enable macros\n\nFigure 3. Malicious document with a file size of approximately 500MB\nOnce a user enables macros for the malicious document, it will download a ZIP file will from\none of seven hardcoded and obfuscated URLs (which will be iterated through until the file is\nsuccessfully retrieved):\n\nhxxps://midcoastsupplies.com[.]au/configNQS/Es2oE4GEH7fbZ/\nhxxp://mtp.evotek[.]vn/wp-content/L/\nhxxp://www.189dom[.]com/xue80/C0aJr5tfI5Pvi8m/\nhxxps://esentai-gourmet[.]kz/404/EDt0f/\nhxxp://139.219.4[.]166/wp-includes/XXrRaJtiutdHn7N13/\nhxxps://www.snaptikt[.]com/wp-includes/aM4Cz6wp2K4sfQ/\nhxxps://diasgallery[.]com:443/about/R/\n\n\n-----\n\nThe macro will then check if the response is 200 (indicating a success retrieval of the file). If\nso, it will then check if that file is either a PE File or a Zip file, suggesting that the threat\nactors may adopt alternative file formats to Zip files containing binary padded PE files.\n\nThe macro uses a function that checks the file type of the downloaded payload by examining\nthe first two bytes of the file. It first checks if the first two bytes are equal to the ASCII values\nof \"M\" and \"Z\" (77 and 90, respectively). If so, it returns a value of 1, indicating that the file is\na PE file. On the other hand, if the first two bytes are not equal to \"M\" and \"Z,\" the function\nchecks if they are equal to the ASCII values of \"P\" and \"K\" (80 and 75, respectively). If so, it\nreturns a value of 2, indicating that the file is a Zip file.\n\nThe CopyHere() method of the Shell32.FolderItems object is then used to extract the\ncontents of the Zip file to the destination folder, after which the macro deletes the temporary\nfolder files.\n\nFinally, regsvr32.exe is invoked and the DLL is loaded with the /s switch to silently execute\nthe Emotet payload to infect the endpoint.\n\n## Stealer and spam routines\n\nFor its stealer and spam routines, Emotet will make a copy of certutil.exe (a legitimate\ncommand-line tool) in the temporary directory that starts in a suspended state and then\nhollowed out.\n\nThe malware will then load one of several modules such as NirSoft's Web Browser PassView\nand Mail PassView tools, an Outlook stealer, and a spam module before resuming execution.\nNote that we have not observed any second stage payloads outside of Emotet’s stealer and\nthe spam modules. However, it is possible that payloads (such as backdoors and/or other\ninformation stealers) might be dropped in the future to enable access for other threat actors.\n\n## Evasion techniques\n\nBinary padding is used to inflate file sizes so that they exceed the size limitations imposed by\nanti-malware solutions such as sandboxes and scan engines. In this example, the Emotet\nDLL is padded with 00 bytes in the overlay, inflating the PE file from 616KB to 548.1MB.\n\nFor Emotet, both the dropper document and the PE files use the 00-byte padding technique\nto inflate the file size. Malicious actors use Zip compression to transport the relatively small\nfiles via email and HTTP, before decompression is used to inflate the files to evade security\nsolutions.\n\nFinally, reconnaissance activities are performed either via IP configs or through the affected\nmachine’s system information.\n\n\n-----\n\n## Conclusion and recommendations\n\n[Emotet has been a prolific and resilient threat, even surviving a takedown of its infrastructure](https://www.trendmicro.com/en_us/research/22/e/bruised-but-not-broken--the-resurgence-of-the-emotet-botnet-malw.html)\nin 2021. Given what we’ve seen of Emotet over the years, it would not be surprising to see it\nevolve further in future attacks, employing alternative malware delivery methods, adopting\nnew evasion techniques, and integrating additional second and even third-stage payloads\ninto its routines.\n\nTo avoid getting infected by malicious spam emails, users should be cautious of emails from\nunknown senders or with suspicious subject lines. These types of emails are often paired\nwith social engineering techniques that are designed to get recipients to click on a link or\ndownload an attachment containing malware. Users should also ensure that macros are\ndisabled in Microsoft Office applications and avoid enabling them even when even prompted.\nUsing spam filters can also help automatically filter out suspicious or unwanted emails before\nthey reach the user’s inbox. By following these precautions, both individual users and\norganizations can greatly reduce the risk of getting infected by malicious spam emails.\n\nEndpoint solutions like Trend Micro's [Smart Protection Suites and](https://www.trendmicro.com/us/business/complete-user-protection/index.html) Worry-Free Business\nSecurity solutions offer protection for both users and businesses against threats like Emotet.\nThese solutions come equipped with behavior-monitoring capabilities that enable them to\ndetect malicious files, scripts, and messages. They can also block all related malicious\nURLs. Additionally, the [Trend Micro™ Deep Discovery™ solution includes an email](https://www.trendmicro.com/us/enterprise/security-risk-management/deep-discovery/)\ninspection layer that can identify and protect enterprises from malicious attachments and\nURLs. By leveraging these powerful tools, users and businesses can effectively defend\nthemselves against the damaging effects of Emotet and other similar threats.\n\n## Indicators of compromise\n\n[The indicators of compromise for this entry can be found here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/23/c/emotet-returns-now-adopts-binary-padding-for-evasion/ioc-emotet-returns-adopts-binary-padding-for-evasion.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-13 - Emotet Returns, Now Adopts Binary Padding for Evasion.pdf"
    ],
    "report_names": [
        "2023-03-13 - Emotet Returns, Now Adopts Binary Padding for Evasion.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1680660530,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1680510456,
    "ts_modification_date": 1680510456,
    "files": {
        "pdf": "https://archive.orkl.eu/2857bb04587fadb64e083f1ae692460e1496b95f.pdf",
        "text": "https://archive.orkl.eu/2857bb04587fadb64e083f1ae692460e1496b95f.txt",
        "img": "https://archive.orkl.eu/2857bb04587fadb64e083f1ae692460e1496b95f.jpg"
    }
}