{
    "id": "8e557834-a015-48f8-831e-bda4f57f05a2",
    "created_at": "2023-01-12T15:01:35.034511Z",
    "updated_at": "2025-03-27T02:11:00.500092Z",
    "deleted_at": null,
    "sha1_hash": "2bba10ffe78eba1c578b93c394f23394158a529a",
    "title": "2021-07-15 - Fighting cyberweapons built by private businesses",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:17Z",
    "file_modification_date": "2022-05-28T01:56:17Z",
    "file_size": 173872,
    "plain_text": "# Fighting cyberweapons built by private businesses\n\n**[blogs.microsoft.com/on-the-issues/2021/07/15/cyberweapons-cybersecurity-sourgum-malware/](https://blogs.microsoft.com/on-the-issues/2021/07/15/cyberweapons-cybersecurity-sourgum-malware/)**\n\nJuly 15, 2021\n\nA world where private sector companies manufacture and sell cyberweapons is more\ndangerous for consumers, businesses of all sizes and governments. We take this threat\nseriously and have disrupted the use of certain cyberweapons manufactured and sold by a\ngroup we call Sourgum. The weapons disabled were being used in precision attacks\ntargeting more than 100 victims around the world including politicians, human rights activists,\njournalists, academics, embassy workers and political dissidents. To limit these attacks, we\nfocused on two actions. First, we built protections into our products against the unique\nmalware Sourgum created, and we shared those protections with the security community.\nSecond, we issued a software update that will protect Windows customers from exploits\nSourgum was using to help deliver its malware. We’ve undertaken this work in close\n[collaboration with the Citizen Lab at the University of Toronto’s Munk School.](https://citizenlab.ca/2021/07/hooking-candiru-another-mercenary-spyware-vendor-comes-into-focus/)\n\nWe believe Sourgum is an Israel-based private sector offensive actor or PSOA. Citizen Lab\nhas identified the group as a company called Candiru. Sourgum generally sells\ncyberweapons that enable its customers, often government agencies around the world, to\nhack into their targets’ computers, phones, network infrastructure and internet-connected\ndevices. These agencies then choose who to target and run the actual operations\nthemselves.\n\nWe initially started this work after receiving a tip from Citizen Lab about malware used by\nSourgum. The Microsoft Threat Intelligence Center (MSTIC) and Microsoft Security\nResponse Center (MSRC) spent weeks examining the malware, documenting how it works\n\n\n-----\n\nand building protections that can detect and neutralize it. We named the malware\nDevilsTongue. We’ve built protections against DevilsTongue into our security products, and\nwe’ve shared these protections with others in the security community so they can protect\ntheir customers. Technical information for customers and the security community is available\n[here.](https://www.microsoft.com/security/blog/2021/07/15/protecting-customers-from-a-private-sector-offensive-actor-using-0-day-exploits-and-devilstongue-malware/)\n\nBy examining how Sourgum’s customers were delivering DevilsTongue to victim computers,\nwe saw they were doing so through a chain of exploits that impacted popular browsers and\nour Windows operating system. Earlier this week, we released updates that, when installed,\nprotect Windows customers from two key Sourgum exploits.\n\nThese attacks have largely targeted consumer accounts, indicating Sourgum’s customers\nwere pursuing particular individuals. The protections we issued this week will prevent\nSourgum’s tools from working on computers that are already infected and prevent new\ninfections on updated computers and those running Microsoft Defender Antivirus as well as\nthose using Microsoft Defender for Endpoint.\n\nThis is part of broader legal, technical and advocacy work we’re undertaking to address the\n[dangers caused when PSOAs build and sell weapons. As we’ve previously said, these](https://blogs.microsoft.com/on-the-issues/2020/12/21/cyber-immunity-nso/)\ncompanies increase the risk that weapons fall into the wrong hands and threaten human\n[rights. That’s why, for example, we filed an amicus brief in a legal case brought by WhatsApp](https://blogs.microsoft.com/wp-content/uploads/prod/sites/5/2020/12/NSO-v.-WhatsApp-Amicus-Brief-Microsoft-et-al.-as-filed.pdf)\nagainst another PSOA called NSO Group.\n\nAs we increase our work to identify PSOAs and disrupt the capabilities of their weapons, we\nwill continue to identify them using the names given to trees and shrubs, as we’ve done with\nSourgum. This is similar to how we use elements of the periodic table to name nation-state\nactor groups we have identified.\n\nWe’re grateful to Citizen Lab for sharing the malware that sparked this work and for its offer\nto work with potential victims of these attacks.\n\nTags: [cyberattacks,](https://blogs.microsoft.com/on-the-issues/tag/cyberattacks/) [cybersecurity,](https://blogs.microsoft.com/on-the-issues/tag/cybersecurity-2/) [Microsoft Defender,](https://blogs.microsoft.com/on-the-issues/tag/microsoft-defender/) [Microsoft Threat Intelligence Center,](https://blogs.microsoft.com/on-the-issues/tag/microsoft-threat-intelligence-center/)\n[MSRC](https://blogs.microsoft.com/on-the-issues/tag/msrc/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-15 - Fighting cyberweapons built by private businesses.pdf"
    ],
    "report_names": [
        "2021-07-15 - Fighting cyberweapons built by private businesses.pdf"
    ],
    "threat_actors": [
        {
            "id": "38f8da87-b4ba-474b-83e6-5b04d8fb384b",
            "created_at": "2024-02-02T02:00:04.032871Z",
            "updated_at": "2025-03-27T02:00:03.294203Z",
            "deleted_at": null,
            "main_name": "Caramel Tsunami",
            "aliases": [
                "SOURGUM",
                "Candiru"
            ],
            "source_name": "MISPGALAXY:Caramel Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535695,
    "ts_updated_at": 1743041460,
    "ts_creation_date": 1653702977,
    "ts_modification_date": 1653702977,
    "files": {
        "pdf": "https://archive.orkl.eu/2bba10ffe78eba1c578b93c394f23394158a529a.pdf",
        "text": "https://archive.orkl.eu/2bba10ffe78eba1c578b93c394f23394158a529a.txt",
        "img": "https://archive.orkl.eu/2bba10ffe78eba1c578b93c394f23394158a529a.jpg"
    }
}