{
    "id": "8ea24120-3a7e-4d57-9574-bb0a6c9cd62a",
    "created_at": "2023-01-12T15:05:05.064355Z",
    "updated_at": "2025-03-27T02:06:05.508889Z",
    "deleted_at": null,
    "sha1_hash": "d04777eae670a071279d8b63b6cdb530805978ed",
    "title": "2019-12-15 - Ryuk Ransomware Likely Behind New Orleans Cyberattack",
    "authors": "",
    "file_creation_date": "2022-05-27T01:59:00Z",
    "file_modification_date": "2022-05-27T01:59:00Z",
    "file_size": 461358,
    "plain_text": "# Ryuk Ransomware Likely Behind New Orleans Cyberattack\n\n**[bleepingcomputer.com/news/security/ryuk-ransomware-likely-behind-new-orleans-cyberattack/](https://www.bleepingcomputer.com/news/security/ryuk-ransomware-likely-behind-new-orleans-cyberattack/)**\n\nLawrence Abrams\n\nBy\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nDecember 15, 2019\n03:46 PM\n3\n\nBased on files uploaded to the VirusTotal scanning service, the ransomware attack on the\nCity of New Orleans was likely done by the Ryuk Ransomware threat actors.\n\n[On December 14th, 2019, one day after the City of New Orleans ransomware attack, what](https://www.bleepingcomputer.com/news/security/new-orleans-suffers-ransomware-attack-emergency-services-intact/)\nappear to be memory dumps of suspicious executables were uploaded from an IP address\nfrom the USA to the VirusTotal scanning service.\n\nOne of these memory dumps, which contained numerous references to New Orleans and\n[Ryuk, was later found by Colin Cowie of Red Flare Security and shared with](https://twitter.com/th3_protoCOL)\nBleepingComputer.com.\n\n\n-----\n\nAs memory dumps are a snapshot of the memory being used by an application while it is\nrunning, it can be used to extract useful strings, file names, commands, and other\ninformation that the executable interacted with or executed. This allows memory dumps to\nbe used during cyber attack forensic investigations to learn more about how the attack was\nconducted.\n\nThe memory dump found by Cowie is for an executable named 'yoletby.exe' and contains\nnumerous references to the City of New Orleans including domain names, domain\ncontrollers, internal IP addresses, user names, file shares, and references to the Ryuk\nransomware.\n\nThe Ryuk ransomware strings included in the dump were the HERMES file marker, file\nnames ending with the .ryk extension, and references to the created RyukReadMe.html\nransom notes.\n\n\n-----\n\n**Ryuk**\n\n**and City of New Orleans strings**\nAfter investigating the file further, BleepingComputer found an interesting reference to the\nC:\\Temp\\v2.exe executable that was executed on the machine. It turns out that a memory\n[dump for this file was also uploaded to VirusTotal.](https://www.virustotal.com/gui/file/9db4dbddaa34dc974cc6586495d56ef98d1b19d1401d713ad08656520c671102/detection)\n\n**v2.exe strings**\n\nOf particular interest in the v2.exe memory dump is a string that refers to the New Orleans\nCity Hall.\n\n[After further digging around, BleepingComputer was able to find a v2.exe executable, and](https://www.virustotal.com/gui/file/1b424c3edf0b2e241050345432731cd804b1e273fc3c470d660c66393891cccc/detection)\nafter executing it, was able to confirm that it was the Ryuk ransomware.\n\n\n-----\n\n**Files encrypted by Ryuk after executing v2.exe**\nWhile it is not known if this executable is the one used in the City of New Orleans attack, it\ndoes show that this filename is used in Ryuk attacks and the memory dumps show that a\nfile of that name was used on an attack against the City of New Orleans.\n\nIf the City of New Orleans was indeed encrypted by Ryuk, which by the evidence seems\n[likely, then this is just another victim of Ryuk who has seen increased activity lately.](https://www.bleepingcomputer.com/news/security/ryuk-ransomware-is-making-victims-left-and-right/)\n\nBleepingComputer has contacted the City of New Orleans for confirmation that they were\ninfected with Ryuk, but have not heard back at this time.\n\n## Emotet and Trickbot likely present as well\n\nIf New Orleans was encrypted by Ryuk, there is also a very high chance that the Emotet\nand TrickBot infections are present on the network as well\n\nEmotet is a malware infection that is commonly spread through spam emails that contain\nmalicious attachments. When opened and macros enabled, these attachments will install\nthe Emotet Trojan on the victim's computer.\n\nEmotet will then use that infected computer to spam other computers with malicious\nattachments and also download further malware on the computer.\n\n\n-----\n\nOne of the most common malware installed by Emotet is the TrickBot information-stealing\nTrojan.\n\nWhen executed, TrickBot will connect back to a command and control server where it will\nreceive commands to load various modules that steal information from the computer or\ninstall even further malware.\n\nAfter the TrickBot actors collect all valuable information and data from the computer, it will\n[then open a reverse shell back to the Ryuk actors.](https://www.bleepingcomputer.com/news/security/ryuk-ransomware-partners-with-trickbot-to-gain-access-to-infected-networks/)\n\nFrom there, the Ryuk team will perform reconnaissance of the network, collect admin\npasswords, take over domain controllers, and utilize post-exploitation toolkits such as\nPowerShell Empire.\n\nThis is why all network admins need to realize that if they have been encrypted by Ryuk,\nthere has commonly been a malware presence on their network for quite a while and that\nother data may have been stolen or compromised.\n\n## What does this mean for the City of New Orleans?\n\nIt means that in addition to the Ryuk Ransomware infection, they also have to deal with the\nfact that attackers have been snooping around their data for some time.\n\nThe city will need to be more diligent against targeted phishing attacks, tighten security on\ntheir network, and change passwords.\n\nAlso, as it is unknown what financial information may have been attained by the attackers,\nthe City of New Orleans should contact their banking partners and put new procedures in\nplace regarding how money is transferred.\n\n**Update 12/15/19: Updated article to include how Emotet and Trickbot are usually found**\n[with Ryuk infections. Thx @vagab0ndsec and](https://twitter.com/vagab0ndsec) [@QW5kcmV3.](https://twitter.com/QW5kcmV3)\n\n### Related Articles:\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n[New ‘Cheers’ Linux ransomware targets VMware ESXi servers](https://www.bleepingcomputer.com/news/security/new-cheers-linux-ransomware-targets-vmware-esxi-servers/)\n\n[SpiceJet airline passengers stranded after ransomware attack](https://www.bleepingcomputer.com/news/security/spicejet-airline-passengers-stranded-after-ransomware-attack/)\n\n[US Senate: Govt’s ransomware fight hindered by limited reporting](https://www.bleepingcomputer.com/news/security/us-senate-govt-s-ransomware-fight-hindered-by-limited-reporting/)\n\n[New Orleans](https://www.bleepingcomputer.com/tag/new-orleans/)\n\n\n-----\n\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n[Ryuk](https://www.bleepingcomputer.com/tag/ryuk/)\n\n[Lawrence Abrams](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nLawrence Abrams is the owner and Editor in Chief of BleepingComputer.com. Lawrence's\narea of expertise includes Windows, malware removal, and computer forensics. Lawrence\nAbrams is a co-author of the Winternals Defragmentation, Recovery, and Administration\nField Guide and the technical editor for Rootkits for Dummies.\n\n[Previous Article](https://www.bleepingcomputer.com/news/microsoft/microsoft-pushes-windows-10-autopilot-update-by-mistake-how-to-remove/)\n[Next Article](https://www.bleepingcomputer.com/news/security/high-school-students-find-spy-cams-in-their-hotel-rooms/)\n\n### Comments\n\n[mrpaddy35 - 2 years ago](https://www.bleepingcomputer.com/forums/u/1149218/mrpaddy35/)\n\nHello i want to know if this is actually caused by Ryuk or also how did you even\nanalyze it ?\n\nAlso those dumps you used to analyze belongs to the victim computer of new\noreleans ?\n\n\n-----\n\n[woody188 - 2 years ago](https://www.bleepingcomputer.com/forums/u/1027758/woody188/)\n\nFiles uploaded to VirusTotal are shared with all users unless they are marked private\nby the uploader. This allows many security researchers to download and analyze\nactual malware in the wild. Many times these uploads contain indications of their\norigin. The ones in the article appear to contain domain information that indicate the\norigin of the files was New Orleans.\n\n[Lawrence Abrams - 2 years ago](https://www.bleepingcomputer.com/author/lawrence-abrams/)\n\nYes, the memory dumps clearly indicate that the processes were running on the City\nof New Orleans domain\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-15 - Ryuk Ransomware Likely Behind New Orleans Cyberattack.pdf"
    ],
    "report_names": [
        "2019-12-15 - Ryuk Ransomware Likely Behind New Orleans Cyberattack.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535905,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1653616740,
    "ts_modification_date": 1653616740,
    "files": {
        "pdf": "https://archive.orkl.eu/d04777eae670a071279d8b63b6cdb530805978ed.pdf",
        "text": "https://archive.orkl.eu/d04777eae670a071279d8b63b6cdb530805978ed.txt",
        "img": "https://archive.orkl.eu/d04777eae670a071279d8b63b6cdb530805978ed.jpg"
    }
}