{
    "id": "8eae1b2e-b8ca-4c9c-b943-b20136d421f3",
    "created_at": "2023-01-12T14:59:53.540727Z",
    "updated_at": "2025-03-27T02:13:08.212816Z",
    "deleted_at": null,
    "sha1_hash": "a85f3e3bc7143e3b8c7e302a5f41fab94cea515e",
    "title": "2022-08-11 - “BazarCall” Advisory- Essential Guide to Attack Vector that Revolutionized Data Breaches",
    "authors": "",
    "file_creation_date": "2022-08-18T03:58:41Z",
    "file_modification_date": "2022-08-18T03:58:41Z",
    "file_size": 1641419,
    "plain_text": "# “BazarCall” Advisory: Essential Guide to Attack Vector that Revolutionized Data Breaches\n\n**[advintel.io/post/bazarcall-advisory-the-essential-guide-to-call-back-phishing-attacks-that-revolutionized-the-data](https://www.advintel.io/post/bazarcall-advisory-the-essential-guide-to-call-back-phishing-attacks-that-revolutionized-the-data)**\n\nAdvIntel August 10, 2022\n\nAug 10\n\n5 min read\n\n“BazarCall” style attack, or call back phishing, is an attack vector that utilizes targeted\n[phishing methodology and that first emerged in 2020/2021 as a tool of Ryuk (later rebranded](https://www.advintel.io/post/adversary-dossier-ryuk-ransomware-anatomy-of-an-attack-in-2021)\nConti).\n\n\n-----\n\n-----\n\nThe tool has proven useful and malleable enough to fit an entire lineage of criminal hands.\nCallback phishing tactics have widely proliferated, completely changing the current threat\nlandscape. At the time of this writing, three autonomous threat groups have since adopted\nand independently developed their own targeted phishing tactics derived from the call\n**back phishing methodology:**\n\n1. Silent Ransom\n\n2. Quantum\n\n3. Roy/Zeon\n\nBazarCall is notable for reversing the dynamic of a typical phishing operation with an\nadvanced understanding of social engineering and targeted phishing (otherwise known as\n**[Spearphishing) and for quickly improving and adapting its operational tactics after only a](https://attack.mitre.org/techniques/T1566/001/)**\nthree-month period.\n\n_Infographic detailing the BazarCall process. After splitting from Conti & becoming an_\n_autonomous group, Quantum formed their own version of the BazarCall campaign named_\n_“Jörmungandr”. [Source: AdvIntel]_\n\n\n-----\n\n## How BazarCall Works\n\n**Stage One. The threat actor sends out a legitimate-looking email, notifying the target**\nthat they have subscribed to a service for which payment is automatic. The email gives\na phone number that targets are able to call to cancel their subscription.\n\n**Stage Two. The victim is lured into contacting a special call center. When operators**\nreceive a call, they use a variety of social engineering tactics, to convince victims to\ngive **[remote desktop control, ostensibly to help them cancel their subscription](https://www.zoho.com/assist/)**\nservice.\n\n**Stage Three. Upon accessing the victim’s desktop, a skilled network intruder silently**\nentrenches into the user’s network, weaponizing legitimate tools that were previously\ntypical of Conti’s arsenal. The initial operator remains on the line with the victim,\npretending to assist them with the remote desktop access by continuing to utilize social\nengineering tactics.\n\n**Stage Four. In the final stage of BazarCall, the initiated malware session yields the**\nadversary access as an initial point of entry into the victim’s network. This initial access\nis then used and exploited in order to target an organization’s data.\n\n## How BazarCall Revolutionized the Threat Landscape\n\nThe targeting capabilities of call back phishing have been revolutionary for post-Conti and\nthe larger ransomware community since the operations resurgence:\n\nTraditionally, ransomware has been reactive. Targets are random, decided by which ones\nhappen to fall prey to infection. Hypothetically, a ransomware collective could send out 1,000\nEmotet infections that are able to yield access for just ten organizations. The collective\ncannot afford to pick and choose in regards to their victims’ revenues, jurisdiction, industry,\netc. This cost/benefit ratio was severely limiting the potential of successful ransomware\ndeployment, and therefore potential profit.\n\n\n-----\n\nBazarCall leaders (as previous members of the Conti/TrickBot/Bazar alliance) were also\naware that one of the challenges that led to the downfall of older ransomware groups was\nthe repetitiveness of their attack patterns, which allowed for mitigations to be developed and\nhoned against them as well as eventually leading to earlier and earlier detections.\n\nThis all led to a natural business crisis among ransomware operators as the defenses and\ncompliance became more rigid and effective. Said by a member of Conti during internal\ncommunications:\n\n_“We can’t win the technology war because on this ground we compete with billion-_\n_dollar companies, but we can win the human factor”._\n\nCallback phishing was the tactic that enabled a widespread shift in the approach to\nransomware deployment. This is what made the approach so unique and effective:\n\n1. Instead of automated botnet infections, a targeted selective approach is employed\n\nwhen the victim or victim industry is chosen before the attack campaign begins.\n\n2. Instead of generic Emotet-style spam, a sophisticated phishing campaign is tailored for\n\na specific industry/victim.\n\n3. Instead of chaotic extortion strategies, a conceptualization of how to\n\nweaponize/maximize risk frameworks for the targeted victim is developed.\n\n4. Instead of reliance on the same methodology each time, constant changes are made to\n\nthe campaign’s content- no repetitions.\n\n5. And finally, instead of focusing on data encryption, there is a definitive shift in focus to\n\ndata exfiltration.\n\n## Who Uses BazarCall\n\n\n-----\n\n_Infographic depicting Conti’s splits, mergers, and dissolution into the set of groups now_\n_leveraging call back phishing tactics._\n\nThe callback phishing attack vector is intrinsically embedded into the Conti organizational\ntradition. It was conceptualized during the initial phase of Conti’s operational crisis, between\nDecember 2021 and February 2022, and was actualized during the prime of this crisis in\nFebruary-March 2022.\n\nToday it is used by three separate but connected post-Conti groups:\n\nSilent Ransom\n\n\n-----\n\nQuantum\n\nRoy/Zeon\n\n## Silent Ransom\n\nIn March 2022, call back phishing experts split from Conti and created “Silent Ransom” when\nit became an autonomous group. They were operating for several months, and their tactics\nproved to be a success. Silent Ransom realized they could successfully avoid sanctions,\nregulations, and poor branding associated with the dying Conti.\n\n_AdvIntel graph charting target revenue for Silent Ransom, the progenitor of all current post-_\n_Conti phishing campaigns. Note that the average revenue stays close to the $10 billion USD_\n_revenue mark, which Roy/Zeon has made their target demographic._\n\n\n-----\n\n## Quantum\n\nHowever, this understanding also came for Silent Ransom’s previous bosses - Conti Team\nTwo - the main Conti subdivision, allying with the Russian invasion into Ukraine and\n[responsible for the Costa Rica attack.](https://www.advintel.io/post/anatomy-of-attack-truth-behind-the-costa-rica-government-ransomware-5-day-intrusion)\n\nEnraged by the “betrayal” and subsequent success of their subordinates, the Conti Team\nTwo, at that point rebranded as Quantum, began their own version of call back phishing\noperations. On June 13, 2022, AdvIntel identified the launch of a massive novel operation\ncalled “Jörmungandr”.\n\nIt involved large investments into hiring spammers, OSINT specialists, designers, call center\noperators, and expanding the number of network intruders. As a highly skilled (and most\nlikely government-affiliated) group, Quantum was able to purchase exclusive email datasets\nand manually parse them to identify relevant employees at high-profile companies.\n\n## Roy/Zeon\n\nThe third and the last iteration of the BazarCall group came in late June 20 by Roy/Zeon.\nThis group came from the old-Guard members of Conti’s “Team One” responsible for the\ncreation of Ryuk itself. They demonstrated the best social engineering capabilities of the\nthree groups.\n\nThe “Roy/Zeon” name comes from the use of two lockers, named Zeon and Roy respectively.\n\nAs Conti Team One, this group was responsible for major attacks such as:\n\n**[JVCKenwood hit by Conti ransomware claiming theft of 1.5TB data](https://www.bleepingcomputer.com/news/security/jvckenwood-hit-by-conti-ransomware-claiming-theft-of-15tb-data/)**\n\n\n-----\n\n**[Graff Gets Hit by Ransomware Attack](https://www.nationaljeweler.com/articles/10318-graff-gets-hit-by-ransomware-attack)**\n\nThe group has been extremely selective in its approach and tends to engage in Big Game\n**Hunting (judging by the high average revenue and/or sector and industry value of their**\ntargets).\n\n## Victimology of BazarCall\n\nCallback phishing campaigns have shifted ransomware’s victimology drastically. Compared\n[to pre-Bazar groups such as Avaddon (for example), there are visible changes in the sectors](https://www.advintel.io/post/the-rise-demise-of-multi-million-ransomware-business-empire)\ntargeted.\n\nThe targeted nature of these campaigns substantially increased attacks against Finance,\n**Technology, Legal, and Insurance. These are four priority industries that were listed in**\nalmost all internal manuals, which were shared between ex-Conti members.\n\n\n-----\n\n_For Silent Ransom and Roy/Zeon, there is an evident increase in legal, finance, and_\n_Insurance targeting compared to Avaddon or other non-Bazar groups._\n\n\n-----\n\n## Conclusion\n\nSince its resurgence in March earlier this year, call back phishing has entirely revolutionized\nthe current threat landscape and forced its threat actors to reevaluate and update their\nmethodologies of attack in order to stay on top of the new ransomware food chain.\n\nAlthough the first to begin using this TTP as its primary initial attack vector, Silent Ransom is\nno longer the only threat group utilizing the highly specified phishing operations that they\npioneered. Other threat groups, seeing the success, efficiency, and targeting capabilities of\nthe tactic have begun using reversed phishing campaign as a base and developing the\nattack vector into their own.\n\nThis trend is likely to continue: As threat actors have realized the potentialities of weaponized\nsocial engineering tactics, it is likely that these phishing operations will only continue to\nbecome more elaborate, detailed, and difficult to parse from legitimate communications as\ntime goes on.\n\n*** Request White Paper on BazarCall Deep-Dive Report below:**\n\n\n-----\n\nRequest White Paper\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-11 - “BazarCall” Advisory- Essential Guide to Attack Vector that Revolutionized Data Breaches.pdf"
    ],
    "report_names": [
        "2022-08-11 - “BazarCall” Advisory- Essential Guide to Attack Vector that Revolutionized Data Breaches.pdf"
    ],
    "threat_actors": [
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535593,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1660795121,
    "ts_modification_date": 1660795121,
    "files": {
        "pdf": "https://archive.orkl.eu/a85f3e3bc7143e3b8c7e302a5f41fab94cea515e.pdf",
        "text": "https://archive.orkl.eu/a85f3e3bc7143e3b8c7e302a5f41fab94cea515e.txt",
        "img": "https://archive.orkl.eu/a85f3e3bc7143e3b8c7e302a5f41fab94cea515e.jpg"
    }
}