{
    "id": "8eb36dbc-973e-4bd4-b9c5-8dfb67576002",
    "created_at": "2022-10-25T16:48:22.562974Z",
    "updated_at": "2025-03-27T02:16:25.659379Z",
    "deleted_at": null,
    "sha1_hash": "91c0a6c0cd95b42991ea7981be1bec29974df17f",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-11-13T00:11:49Z",
    "file_modification_date": "2019-11-13T00:11:53Z",
    "file_size": 3954752,
    "plain_text": "# Sophos 2020 Threat Report\n\n## We're covering your blind spots.\n\n#### Challenges the world faces for the coming year, securing data, devices, and people in an increasingly complex environment.\n\n By the SophosLabs research team\n\n\n-----\n\np p\n\n### Contents\n\n##### The complexity of simplicity 3\n\n Ransomware attackers raise the stakes 4\n\nUsing our management tools against us 4\n\nAttacker code appears \"trusted\" while attackers elevate privileges 5\n\nLiving off the land, thriving off the security industry's best tools 5\n\nEfficiency and prioritization give ransomware attackers an edge 7\n\n##### Mobile malware trends: Dirty tricks are lucrative 8\n\nAd money feeds non-malicious scammers 8\n\nFleeceware charges consumers hundreds 9\n\nBank-credential stealers evade Play Store controls 10\n\nHidden Adware 13\n\n##### The growing risks of ignoring \"internet background radiation\" 14\n\nRemote Desktop Protocol in the crosshairs 14\n\nPublic-facing services targeted by increasingly sophisticated automation 16\n\nWhy Wannacry may never totally disappear, and why you should care 16\n\n##### Cloud security: Little missteps lead to big breaches 18\n\nThe biggest problem in the cloud is the cloud itself 18\n\nMisconfiguration drives the majority of incidents 19\n\nLack of visibility further obfuscates situational awareness 20\n\nA hypothetical cloud security breach incident 21\n\n##### Automation-enhanced Active Attacks 23\n\nPatience and stealth: watchwords for attacker success 23\n\nAttacking the backups is now routine 23\n\nLegitimate software as malware – misdirection with benign malware 24\n\nPUAs edge closer to malware, trafficking in exploits 24\n\n##### Machine learning to defeat malware finds itself under attack 25\n\nAttacks against machine learning malware detectors 25\n\nMachine learning on the offensive 26\n\n\"Generative\" models blur the line between human and machine 27\n\n##### Ten years out, machine learning targets our \"wetware\" 28\n\nIncreasing automation for offense and defense 28\n\n“Wetware” attacks 28\n\n\n-----\n\np p\n\n\n## The complexity of simplicity\n\n#### By Joe Levy, Chief Technology Officer, Sophos\n\n\"Cybersecurity\" is a term that encompasses a wide array of protective measures\nacross several domains of specialized knowledge. In other words, security has\na lot of parts. As security practitioners, it's our mission not only to build the\nnew tools needed to arrest threats effectively, but to help make sense of the\nwide-ranging nature of what constitutes security, in 2020 and beyond.\n\nWe need to make sense of the security environment as much for ourselves as for\nthe customers or clients we serve. Better understanding drives better decision\nmaking. Ultimately, this approach to security progresses us towards our goal\nof securing people and the information systems on which they depend.\n\nEvery year, criminals adapt to the best defenses from operators and vendors in\nthe industry. At the same time, defenders must protect systems and processes\nwith new functionality (read: attack surface area) constantly being introduced, and\nwith an ever-increasing global interdependency on these systems' operation.\n\nBut you can't defend against what you can't understand. It isn't always easy to\nvisualize complex attack scenarios, especially given that the resultant cat and\nmouse game between attackers and defenders helps shape future threats. Our\nreport this year reflects both the broader range of the security domains we now\nobserve and defend, and the wider reach of adversaries into new territory.\n\nAs cybersecurity practitioners – whether our role is in operations, research,\ndevelopment, management, support, strategy, or some other function – every\nday presents us with opportunities to better understand and explain the nature\nof cyberattacks. Such an understanding demands precision; explaining it in a\nway that's approachable by the widest possible audience demands accessibility.\nThe best security can do both: protect and educate, defend and inform.\n\nI hope that you find our threat report informative, and that it helps\nyou in whatever role you play defending people and systems.\n\n\n-----\n\np p\n\n\n## Ransomware attackers raise the stakes\n\nRansomware affects an accelerating number of victims with every passing year,\nbut it has an Achilles' heel: encryption is a time consuming process, driven by\nthe processing power of its host machine's CPU. It takes time for suitably strong\nencryption algorithms to securely encrypt the data on whole hard drives. In the\ncase of ransomware, the application is at least as concerned with optimizing its\nattack and evading detection by modern security tools as it is with encrypting.\n\nWith evasion a priority, many ransomware-deploying attackers seem to have\ndeveloped a keen understanding of how network and endpoint security products\ndetect or block malicious activity. Ransomware attacks almost always begin with\nan attempt to thwart security controls, though with varying levels of success.\n\nAttackers have also discovered that these attacks, once perpetrated, have\na greater chance to earn a ransom payment when the attack takes out just\nenough unrecoverable data to make it worth the victim's ransom demand.\n\nWhile the purpose of ransomware is always the same – to hold\nyour documents hostage – it is a lot easier to change a malware’s\nappearance (obfuscate its code) than to change its purpose or behavior.\nModern ransomware relies on obfuscation for its success.\n\nIn addition, ransomware may be compiled for a single victim, protected by\na unique password or run only in a certain timeframe. This further hinders\nboth automated sandbox analysis as well as manual reverse engineering\nby human threat researchers to determine the purpose of the sample.\n\nBut there are other behaviors or traits to ransomware that modern security\nsoftware can zero in on to help determine if an application has or is showing\nmalicious actions. Some traits are hard for attackers to change, like the\nsuccessive encryption of documents. But some traits can be changed\nor added, and this helps ransomware to confuse some anti-ransomware\nprotection. These are just a few of these behavioral trends we've observed.\n\n### Using our management tools against us\n\nAttackers have been seen leveraging stolen credentials for, or exploiting vulnerabilities\nin, remote monitoring and management (RMM) solutions like Kaseya, ScreenConnect,\nand Bomgar. These RMM solutions are typically used by a managed service provider\n(MSP) that remotely manages the customers’ IT infrastructure and/or end user\nsystems. RMM solutions typically run with high privileges and, once breached,\noffer a remote attacker “hands on keyboard” access, resulting in unwanted data\nhostage situations. With this access, they can easily distribute ransomware into\nnetworks from remote, potentially hitting multiple MSP customers at once.\n\n\n-----\n\np p\n\n\nFigure 1: The MegaCortex ransomware killchain uses legitimate system administration apps\nsuch as WMI to distribute the malware as though it were a system update\n\nIt is important to enable multi-factor authentication (MFA) on central\nmanagement tools and leave tamper protection on endpoint protection\nsoftware enabled. Active adversaries may also try to log on to the\ncentral security portal to disable protection across the network.\n\n_Ensure any management accounts or tools use multifactor authentication_\n_to prevent criminals from using them against your organization._\n\n### Attacker code appears \"trusted\" while attackers elevate privileges\n\nWhile it is good practice to give user accounts – and therefore the applications they\nrun – limited access rights, in today’s threat landscape that doesn’t help much.\nEven if the logged-in user has standard limited privileges and permissions, today’s\nransomware may use a user account control (UAC) bypass or exploit a software\nvulnerability like CVE-2018-8453 to elevate privileges. And active adversaries\nthat attack the network interactively will capture an administrative credential to\nmake sure the ransomware encryption is performed using a privileged domain\naccount to meet or exceed file access permissions and maximize success.\n\nAttackers may attempt to minimize detection by digitally code-signing their\nransomware with an Authenticode certificate. When ransomware is properly\ncode-signed, anti-malware or anti-ransomware defenses might not analyze its\ncode as rigorously as they would other executables without signature verification.\nEndpoint protection software may even choose to trust the malicious code.\n\n### Living off the land, thriving off the security industry's best tools\n\nTo automatically distribute ransomware to peer endpoints and servers, adversaries\nleverage a trusted dual-use utility like PsExec from Microsoft Sysinternals. The\nattacker crafts a script that lists the collected targeted machines and incorporates\nthem together with PsExec, a privileged domain account, and the ransomware.\nThis script successively copies and executes the ransomware onto peer machines.\nThis takes less than an hour to complete, depending on the number of machines\ntargeted. By the time the victim spots what’s going, on it is too late, as these\nattacks typically happen in the middle of the night when IT staff is sleeping.\n\n\n-----\n\np p\n\n\nFigure 2: Ransomware has a 30-plus year history as a form of malware\n\nAs an alternative to PsExec, active adversaries have also been seen leveraging a\nlogon and logoff script via a Group Policy Object (GPO) or abusing the Windows\nManagement Interface (WMI) to mass-distribute ransomware inside the network.\n\nSome ransomware abuses Windows PowerShell to hoist in a PowerShell script from\nthe internet, which is set to automatically start the ransomware after several days.\nThis makes the attack appear to come out of nowhere. In this scenario, the actual\nfile encryption attack itself is performed by the trusted Windows POWERSHELL.\nEXE process, making endpoint protection software believe a trusted application\nis modifying the documents. To achieve the same goal, ransomware may inject\nits malicious code into a trusted running process like SVCHOST.EXE or use the\nWindows RUNDLL32.EXE application to encrypt documents from a trusted process.\nThis tactic may thwart some anti-ransomware solutions that do not monitor or\nare configured to ignore encryption activity by default Windows applications.\n\nRansomware may also run from a NTFS Alternate Data Stream (ADS)\nto hide from both victim users and endpoint protection software.\n\n\n-----\n\np p\n\n\n### Efficiency and prioritization give ransomware attackers an edge\n\nTo ensure victims pay the ransom money, ransomware will try to encrypt as many\ndocuments as possible, sometimes even risking, or purposely crippling, the endpoint.\nThese documents can be stored on local fixed and removable drives, as well as on\nmapped remote shared drives. The ransomware might even prioritize certain drives\nor document sizes first to ensure success before being caught by endpoint protection\nsoftware or noticed by victims. For example, ransomware may be programmed to\nencrypt several documents at the same time via multiple threads, prioritize smaller\ndocuments, or even attack documents on mapped remote shared drives first.\n\nFigure 3: A comparison of the behavioral characteristics and patterns exhibited by the ten most harmful ransomware families\n\n\n-----\n\np p\n\n\n## Mobile malware trends: Dirty tricks are lucrative\n\nIn the past year, we've observed a growing variety and variability of the types\nof mobile attacks criminals use to target smartphone owners. The powerful,\npocket-sized computers many of us carry around contain a wealth of personal\nand sensitive information that reveal much about our daily lives. But attackers\nneed not steal that information to reap the financial rewards of an attack.\n\nIncreasingly, we also rely on these devices to secure our most sensitive\naccounts, using two-factor authentication tied to either our SMS text\nmessages, or to \"authenticator\" apps on the mobile phones themselves.\nA number of \"SIMjacking\" attacks in the past year have revealed attackers\ntargeting the weak link between customers and their mobile phone\nproviders using social engineering, which led to several high-profile thefts\nof both cryptocurrency and regular cash from wealthy individuals.\n\nBut malicious software remains the biggest concern, primarily (though not\nexclusively) on the Android platform. To address that, operators of the big software\nmarkets, Apple and Google, scan apps for hints that it may contain code known\nto be used in malicious ways. If the store finds something, that app immediately\nattracts scrutiny by automated defenses built into, for example, the Google\nPlay Store's intake processes. Some app makers, intent on committing crimes,\nhave devised ingenious methods to conceal their apps' true intent from scrutiny\nby Google (or by security researchers). What if you tweak your app to avoid\nscrutiny and still charge vulnerable users, using unscrupulous methods?\n\nCoupled with a fragmented mobile phone ecosystem on the Android side, in which\na large number of device manufacturers infrequently offer the critical Android\noperating system updates these devices need to remain safe, smartphones\nand tablets remain a target-rich environment for a broad range of attacks.\n\n### Ad money feeds non-malicious scammers\n\nAdvertising helps legitimate app developers pay the bills, while providing\nuseful or entertaining apps to consumers. There's nothing inherently wrong\nwith advertising, but over the past year, SophosLabs researchers have\nencountered a number of Android apps whose sole purpose appears to be\nto maximize ad revenue – at the expense of virtually anything else.\n\nTo accomplish this, these unscrupulous developers have employed deception.\nSome publish apps containing what amounts to mostly someone else's plagiarized\napp, lumped in with advertising libraries that aren't part of the original app.\nBecause these apps contain no overtly malicious code, the automation used\nto scan the apps when they are first uploaded to the Play Store reports that\nthey are benign, and allows them to be posted for download by consumers.\n\n\n-----\n\np p\n\n\nFigure 4: A User-Agent string from an Android app reports to an advertiser that a fraudulent ad \"click\" originated from an Apple device\n\nOther developers created original apps that, in addition to their stated functions,\nemploy specially developed instructions that forge \"clicks\" on advertising\ncontent in order to convince advertisers that the app users have been so enticed\nby the ads that appeared in the app. When a user actually taps on an ad, the\nadvertising network pays a premium to the developer whose app presented the\nadvertisement to the user in the first place. The fraudulent clicks guarantee that\nthe advertising affiliate gets paid the premium amount, time and time again.\n\nSome of these deceptive apps reported a falsified User-Agent string\nto the advertisers, making it appear as though the contrived clicks,\nfrom a single Android app on one device, actually originated in dozens\nof different apps on a wide range of devices, including iPhones.\n\nThis fraud not only takes a heavy toll on advertisers, but users find that the apps\nthat engage in this kind of advertising fraud consume monumental amounts of\ndata, even when the phone is in sleep mode. This imposes its own costs, including\nreduced battery life, higher charges for data usage, and reduced performance.\n\n### Fleeceware charges consumers hundreds\n\nThis year, SophosLabs also discovered a group of apps that employ a novel\nbusiness model we've named Fleeceware. The apps earned this name because\nthey exist solely to fleece consumers out of a very large amount of money.\nThe apps themselves don’t engage in what we consider traditional malicious\nactivity. Neither do we consider the apps \"potentially unwanted,\" or PUA, because\nthere isn't any \"potentially\" in the equation: nobody wants to be fleeced.\n\nFleeceware app developers take advantage of the in-app purchasing business\nmodel available within Android's Play Market ecosystem. Users can download\nand use the apps at no charge for a short trial period, but are required to provide\npayment information to the developer at the start of the trial period. If the user\nfails to cancel the trial before it expires, the developer charges users upwards of\n$100 for apps with functions as simple as photo filters or barcode scanners.\n\n\n-----\n\np p\n\n\nFigure 5: One of the Fleeceware apps we reported to Google charged users 215 euros a month after the 72 hour \"free trial\" expired\n\nOf course, many users assume that uninstalling the app ends the trial, but the\ndevelopers require those users to go through a cancellation process. When\nthe trial expires, if the user who downloads and installs one of these apps\nhasn’t both uninstalled the application and informed the developer that they\ndo not wish to continue to use the app, the app developer charges the user –\nsometimes as a monthly \"subscription\" costing more than $200 per month for\nsomething as simple as a tool for turning short videos into animated GIFs.\n\n### Bank-credential stealers evade Play Store controls\n\nBankers – apps designed to steal the credentials for financial institutions\n– have been troubling Android users for a long time. This type of malware\ncontinues to put pressure on Google, who play a cat and mouse game\nto prevent bankers from infiltrating the Play Store. Android bankers have\nevolved over time to evade automated malicious code detection.\n\nBankers seen on the Play Store in 2019 have been, predominantly, downloaders.\nThe apps available through the Play Store have appeared as financerelated applications which download second-stage banker payloads in the\nbackground. Because the malicious code is not present in the file until after\nthe user downloads and installs the app on their device, it is very difficult for\nGoogle's security scanning services to detect and prevent these threats.\n\nBankers have also begun to abuse various app permissions on Android,\nsuch as the Accessibility permission (which is supposed to help users with\ndisabilities). Malicious apps use this permission to grant themselves the\nrights to install a payload, and to monitor actions such as keystrokes on\nvirtual keyboards when users log in to legitimate banking applications.\n\n\n-----\n\np p\n\n\nFigure 6: A sample attack flow, highlighting how an Android banker malware called\nAnubis bypasses Google's malicious code detection in the Play Store\n\nThe Anubis banker Trojan serves as a great case study in obfuscation. For instance,\nnot only does the malware conceal its true intent, but it uses \"out of band\"\nmethods for communicating with its operator(s), such as checking specific social\nmedia accounts on Twitter or Telegram, rather than a more traditional connection\ndirectly to a C2 server. The social media posts appear to the world as if it were\njust a string of Chinese characters, but the reality is much more insidious.\n\nFigure 7: One of the Telegram accounts monitored by an Anubis Trojan\n\n\n-----\n\np p\n\n\nMessages such as these conceal a complex encoding scheme which includes the\nuse of a substitution cipher that swaps characters from the Chinese (simplified)\nalphabet to the Latin alphabet, and then perform further decoding on the output.\n\nFigure 8: How Anubis transforms strings of Chinese glyphs into the URL of a command and control server\n\nTo be fair, Google have brought security improvements with newer versions\nof the Android operating system, but the game of cat and mouse, between\nGoogle's gatekeepers and the crooks, continues. Because not all Android\nusers get regular updates, the fragmentation of the Android OS keeps\nsome users from having the best protection against malware.\n\n\n-----\n\np p\n\n\n### Hidden Adware\n\nFigure 9: A Hiddad app hides its icon after the first time you launch it\n\n\"Hiddad\" is a malware family, the primary aim of which is monetization through\naggressive advertising. It survives by making itself hard to find on the device. The\nmalware conceals itself in order to circumvent uninstallation attempts. The longer\nit remains on the device, the more ad revenue it can generate for its author.\n\nThe malware hides the app's icon in the app tray and launcher, and is\noften coupled with additional layers of deception, such as creating a\nshortcut that does not uninstall the app. Hiddad malware may also give\nitself innocuous names and generic icons in the phone’s settings.\n\nHiddad malware typically takes the form of a legitimate app, such as a QR code\nreader or an image editing app. Its authors often make it available on public\napp stores in order to quickly infect large numbers of devices, thereby quickly\nincreasing the app maker's ad revenue. Some Hiddad apps repeatedly prompt\nusers for a high review rating, or to install additional Hiddad apps, to dramatically\nincrease its popularity and install count within a very short amount of time.\n\nNumerous apps riddled with Hiddad malware have been discovered over the past\nyear. In September 2019 alone, at least 57 Hiddad apps, having a total install count\nof about 15 million unique installations, were discovered on Google Play. SophosLabs\ndiscovers a new set of such apps every few weeks. Many of these apps had managed\nto garner more than a million downloads within a few weeks of appearing in the\nPlay Store. With a low-risk monetization mechanism to generate a constant stream\nof payouts for its authors, Hiddad is a threat to watch out for in the coming year.\n\n\n-----\n\np p\n\n\n## The growing risks of ignoring \"internet background radiation\"\n\nIn the 30 years that have elapsed since the internet became commercialized, the\namount of noise that washes up on the shores of our networks has steadily increased\nin both volume and ferocity. Benign port scans and network probes increasingly are\naccompanied by hostile attack traffic generated by worms and malicious automation.\n\nCollectively, this \"internet background radiation,\" analogous to the cosmic\nbackground radiation that has pervaded the universe since the Big\nBang, accounts for an increasing volume of breaches and compromises\naffecting a wide range of internet-facing services and devices.\n\nFigure 10: In an experiment, Sophos set up honeypot machines in data centers located\naround the world. Some received nearly 600,000 brute-force login attempts\n\nSophosLabs has been documenting how these attacks harm both individual\nconsumers and enterprise network owners alike in the past year. The internet\nas a whole also finds itself with a virtual Sword of Damocles hanging over us all,\nas new wormable exploits like BlueKeep and ongoing attacks using the leaked\nEternalBlue and DoublePulsar exploits pose a threat to the entire internet.\n\n### Remote Desktop Protocol in the crosshairs\n\nAbuse of the Remote Desktop Protocol (RDP), both its hosted service and the client\napplication, have been on the rise in 2019. Following the high-profile attacks against\nRDP by the threat actors behind the SamSam ransomware campaigns in 2018,\nmore attackers have jumped on the RDP bandwagon and continue to pluck these\nlow-hanging fruit to gain a foothold inside of networks targeted for compromise.\n\nMillions of endpoints with RDP exposed to the public internet remain an\nongoing and persistent problem in threat management for enterprises of all\nsizes. Many attackers simply try to brute-force RDP services they find facing\nthe public internet, using lists of common, poor quality passwords.\n\n\n-----\n\np p\n\n\nFigure 11: Over a period of just a one-month, Sophos recorded millions of attempted RDP logins to our honeypots\n\nBut those rudimentary attacks are only part of the problem. Sophos has also observed\nsome attackers choose their targets carefully, perform reconnaissance against\nspecific employees, and target those employees with spear phishing attacks to obtain\nusable credentials they can then leverage to break in to the targeted organizations.\n\nOnce the attackers gain access to a single machine, they may employ\npenetration testing tools such as Mimikatz to sniff for credentials with elevated\nprivileges that are passed across the network. With credentials for someone\nwith Domain Admin privileges in hand, we've observed the attackers use\nthose credentials to spread malware across large portions of the internet\nnetwork all at once, taking advantage of the software management tools\nthat are inherently part of Domain Controller servers in large networks.\n\nAttacks using this methodology have been at the core of some of the largest\nand most painful ransomware incidents we've investigated in the past year,\nwhich is why our ongoing advice to network administrators who manage\nenterprise networks of any size is to do everything possible to prevent\nexposing RDP on internal endpoints to the public-facing internet.\n\n\n-----\n\np p\n\n\n### Public-facing services targeted by increasingly sophisticated automation\n\nRDP is hardly the only foothold attackers seek in the ongoing battle\nwe've been fighting against what we've termed active, automated\nattacks, in which attackers use a combination of self-directed\nautomation and some manual steering to penetrate networks.\n\nFigure 12: Part of an automated script, intended to trigger PowerShell to download and execute another malicious script\n\nIn the past year, we've observed a wide range of internet-facing services come\nunder growing threat as attackers attempt to exploit security vulnerabilities\nand/or perform brute-force attempts to break into database servers, home\nrouters and DSL/cable modems, network-attached storage (NAS) devices,\nVoIP systems, and a range of other \"internet of things\" devices.\n\nOne of the most common attacks we now see originates from networks\nthat have, in the past, been host to botnets such as Mirai, which target\nsome internet-connected devices. These attacks have been growing in both\nvolume and, over time, sophistication as the attackers constantly make small\nrefinements to the scripted attacks, which target database servers.\n\nIn particular, machines hosting older versions of Microsoft's SQL server software\nin its default configuration find themselves under constant attack. These\nRube Goldberg-inspired attacks involve the use of a complex, interwoven set\nof database commands that, when successful, result in the database server\nessentially infecting itself with a growing array of different types of malware.\n\n### Why Wannacry may never totally disappear, and why you should care\n\nWannacry crashed into the world in a fury on May 12, 2017, flooding the\ninternet and infecting businesses, hospitals, and universities in what had been,\nuntil then, an attack of unprecedented speed and scale. The ransomware,\nwhich various sources (including government intelligence agencies) accuse\nthe North Korean government of creating, caused havoc until a few security\nresearchers uncovered an Achilles heel in the malware: a kill switch, which\nwas unintentionally triggered when one of the researchers, Marcus Hutchins,\nregistered a Web domain name that was embedded in Wannacry's binary code.\n\nWannacry's advance suddenly halted, the attack spurred systems administrators\naround the world to install a Microsoft-issued security patch that had been released\nto the public a few months earlier. Ironically, many administrators had refrained\nfrom installing the Windows update out of an abundance of caution, fearful of\ndisruptions the update might have caused. It was that caution that permitted those\nunpatched systems to be infected and then to spread the infection further.\n\n\n-----\n\np p\n\n\nBut Wannacry's kill switch did not end the ransomware's existence. Far from\nit, in fact. Within a few days of the initial attack, unknown individuals had made\nhaphazard modifications to the original ransomware program that bypassed\nthe kill switch domain. But these modified Wannacry binaries also carried with\nthem a new bug: in the course of their rapid spread across the internet, the\nransomware payload – the piece of Wannacry that caused all the damage in the\nfirst place – was itself damaged. The ransomware could no longer encrypt all\nyour files, but it still had the capacity to spread to machines which had not yet\npatched against the vulnerability that allowed it to spread in the first place.\n\nFigure 13: An example of a WannaCry executable with two \"no-operation\" commands instead of a kill switch subroutine\n\nWannacry is still in circulation to this day. In fact, SophosLabs researchers\ncould not help but notice that we receive vast numbers of attempted\ninfection alerts (failures, all) every day. Today we receive more alerts about\nWannacry than any earlier wormable malware family, including Conficker,\nwhich previously held the title for most obnoxiously persistent malware.\n\nThe continued presence of Wannacry detections does call attention to the fact\nthat, out there, on the internet, millions of machines remain unpatched against\na bug that was fixed more than two years ago. In that time, many far more\ndangerous attacks have emerged. If these machines infected with Wannacry are\nstill out there, they're also susceptible to these newer types of attacks as well.\nWannacry's persistence is a cautionary tale and a reminder of the importance\nof keeping every endpoint updated, and installing those updates as quickly as\nfeasible, lest those machines end up the victim of the next worm epidemic.\n\n\n-----\n\np p\n\n\n## Cloud security: Little missteps lead to big breaches\n\nThe past decade has seen the emergence of the cloud as the platform for\nstoring and processing large volumes of data. But along the way, some\nbusinesses have found that pouring all their most precious information\ninto a virtualized data store led to inadvertent, gigantic breaches of that\ndata, sometimes in the most public and damaging ways possible.\n\nMost of what Sophos has always done involves protecting users from attacks\nby malevolent intruders or attackers bent on financial gain or espionage. But\nprotecting data stored in the cloud requires a very different toolset, because\nthe threat model is quite different from those of workstations or servers.\n\nThe very thing that makes the cloud a great platform for computing and business\noperations also creates some of its greatest challenges. And as the pace of those\nchanges to cloud computing platforms quickens, knowing exactly what settings\ncan get you into trouble becomes exponentially more difficult to discern.\n\n### The biggest problem in the cloud is the cloud itself\n\nFlexibility is the name of the game in cloud computing. With very little effort, it's\npossible to toggle on or off resources as needed. This makes it easy for businesses\nto scale up their computing power to suit the needs of their clients or customers.\n\nBut when it comes to securing the cloud, all that flexibility, and the ease with which\na data center operations manager can provision or reconfigure infrastructure, can\ncome back to bite you later, because one false step can lead to an administrator\ninadvertently opening up their entire customer database to exposure.\n\nFigure 14: Maintaining situational awareness of your cloud environment and the consequences\nof configuration changes is key to preventing breaches or leaks\n\nIn addition, the pace of changes within cloud computing platforms\nthemselves can sometimes lead to problems administrators may not\neven be aware of. Off the shelf remote management and administration\ntools, sometimes even those provided by the cloud operators themselves,\nmay contain security vulnerabilities that lead to compromise.\n\n\n-----\n\np p\n\n\nAnd of course, if the right (or wrong) administrator's computer is even briefly\ninfected with credential-stealing malware, it's possible that administrator's API\nkey or cloud computing management credentials will be stolen and leveraged\nto perform further attacks, using the cloud instance managed by the admin.\n\n### Misconfiguration drives the majority of incidents\n\nSophos believes that the vast majority of security incidents involving cloud\ncomputing platforms happen as a result of misconfiguration. This isn't\nusually deliberate. The platforms themselves are so complex, and change so\nfrequently, it's often difficult to understand the ramifications or consequences\nof toggling a specific setting in an Amazon S3 bucket, for example.\n\nFigure 15: Sophos Cloud Optix highlights potential misconfiguration issues with cloud services and virtual appliances\n\nAnd because a single cloud computing administrator can quickly propagate\nconfiguration changes to an organization's entire set of computing\nbuckets, configuration changes that lead to inadvertently exposing\nsensitive data to the world are becoming increasingly common.\n\nLarge data breaches involving misconfigured cloud computing storage are fast\nbecoming a common occurrence. Breaches of this nature have hit companies\nas diverse as Netflix, the automaker Ford, and TD Bank in the past year, when a\ncloud backup provider used by them (and many other companies) inadvertently\nleft a massive storage repository (known as a 'data lake') open to the world.\n\nA security researcher earlier this year serendipitously discovered several\nAmazon S3 buckets belonging to the backup provider. The buckets\ncontained massive repositories of those companies' email archives,\nand entire backups of employees' OneDrive storage accounts.\n\n\n-----\n\np p\n\n\nThe data, which had been in storage since 2014, contained extremely sensitive\nbusiness reports, administrator passwords, and HR documents about employees.\nIt remains unknown whether those backups had been accessed by individuals\nor groups with malevolent intent prior to the discovery by the researchers.\n\nIncidents such as these are becoming more common as companies\ntake to heart the pressing need to keep secure backups of sensitive\ndata, as a hedge against threats such as ransomware.\n\nHaving visibility into the consequences of seemingly-innocuous configuration\nchanges, as well as the ability to monitor for malicious or suspicious\nactivity, are the quickest ways Sophos has found to do the most good.\n\n### Lack of visibility further obfuscates situational awareness\n\nUnfortunately, many cloud computing platform users lack the ability to closely\nmonitor exactly what their machines are doing. Criminals know this, and have\nbeen attacking cloud computing platforms for precisely that reason. The criminals\ncan get away with doing bad things in cloud instance, for a longer time, when the\nowners of those instances can't immediately see that something is amiss.\n\nOne of the most dramatic examples of this is the use of Magecart, a malicious\nbit of Javascript that attackers have been using over the past year to infect the\n\"shopping cart\" pages of online retailers with credential or payment card theft\ncode. Typically, gangs that spread the Magecart code leverage misconfigurations\nin cloud computing instances in order to modify shopping cart Javascript\ncode and then upload those modified scripts back into the cloud computing\ninstance, so that the attack seems to come from within the retailer.\n\nFigure 16: Magecart malware takes the form of a script injected into the payment page on a\nshopping site; the payment card information is redirected to a \"gate\" address\n\n\n-----\n\np p\n\n\nWith Magecart in place, businesses as diverse as Ticketmaster, Cathay Pacific\nAirways, Newegg, and British Airways have discovered after the fact that customer\ndata was being stolen as the customers entered their payment information. The\nbusinesses only discovered the malicious code in place after complaints started\nto come in from customers, who were being alerted of fraudulent activity on their\naccounts after they had used their payment cards on some of these sites.\n\n### A hypothetical cloud security breach incident\n\nFigure 17: A hypothetical cloud security breach scenario\n\n\n-----\n\np p\n\n\nCloud instances can be breached in any number of ways, and for a wide variety of reasons.\nSome criminals continue to try to spread malicious cryptominers even onto major cloud\nplatforms, despite the declining return on investment such schemes deliver, because, after all,\nthe resources required for cryptomining don't belong to the criminal and cost them nothing.\n\nIn our hypothetical scenario, a large company with several software developers uses a\npopular code management platform (the \"code repo,\" or repository) to store the software\nchanges the company's developers are building. The company, however, creates only a\nsingle password for that code management account, and shares it with all the developers.\n\nOne of the developers brings the password home so he can work on a business\nproject, but doesn't realize that his child tried to load a free game onto the home\ncomputer, and the computer is now infected with a credential-stealing malware.\n\nThe malware dutifully scavenges the credentials, shipping them back to its command\nand control server. The criminal operating this bot recognizes the value of the credential,\nthen logs into the admin's cloud computing administration page. Using the administrative\ncredential, the criminal provisions hundreds of new machines on the victim's account,\nhardens them using the cloud computing platform's APIs, installs a cryptominer on\nthem, and leaves them to peg the CPU at 100% for days – all at the victim's expense.\n\nUnfortunately for the victim, they only discover the problem days later, when the\ncloud computing platform sends the victim an alert that they may be spending a lot\nmore than they want to. The criminal finds that while they are no longer collecting\ncryptocurrency from this particular victim, they can invest some of what they've\nalready collected into buying more malware services, and the cycle continues.\n\n\n-----\n\np p\n\n## Automation-enhanced Active Attacks\n\nAttackers are using a combination of automated tools and humans to more\neffectively evade security controls than ever before. In 2019 the MTR Operations\nTeam has observed attackers automating the earlier stages of their attacks to\ngain access and control of the targeted environment and then shift to utilizing\npatient, methodical means to identify and complete their objective.\n\n### Patience and stealth: watchwords for attacker success\n\nAttacker patience and strategic evasion techniques are continuing to improve,\ninteractively attacking endpoints and reducing reliance on less effective fully\nautomated methods. Upon compromise, attackers survey the environment\nutilizing passive and active techniques to create a topology of the environment.\nThis technique provides more stealthy identification of critical targets such as\nadministrative workstations, data custodian endpoints, files, and backup servers.\n\nUsing legitimate administrative tools and other “living off the land” utilities such as ping, nmap,\nnet, and nbtsat, the attacker moves laterally to higher priority assets without being detected\nin time to do anything about it. Administrators who closely monitor logs often pre-filter\nthese motions in Security Information and Event Management (SIEM) tools because, as the\nbehaviors mimic legitimate administrator activities, they generate a lot of false positive alerts.\n\n### Attacking the backups is now routine\n\nDuring an incident involving ransomware, the first question asked is whether it is possible\nto restore to a known good state. Unfortunately, the tactics and procedures utilized to\ncompromise and encrypt servers and endpoints are the same methods that can render\nconnected automated backups unusable. Attackers have realized that when they are able to\ndestroy backups, it results in a higher percentage of victims paying the ransom. Organizations\nrelying on backup and recovery instead of preventive and rapid threat neutralization leave\nthemselves exposed to risk in that they will be unable to recover from ransomware attacks.\n\nFigure 18: The diagram above illustrates how MegaCortex ransomware moves from a foothold machine to domain controllers, and on to workstations\n\n\n-----\n\np p\n\n\n### Legitimate software as malware – misdirection with benign malware\n\nPowerShell and PsExec continue to be stalwart tools for IT administrators\nwhen conducting normal administration activities in their environment.\nUnfortunately, they are also utilized in techniques for persistence, propagation\nof ransomware, and to exfiltrate data. The security challenge is determining\nthe difference between malicious and non-malicious use of these commonly\nutilized administrative tools while conducting the investigation.\n\nDistractions and misdirection have been staples in kinetic and cyber tradecraft. Benign\nmalware is malicious code that has been successfully delivered and executed, but\nwithout detriment. Any and all data (or absence of data) can be useful to an attacker.\n\nWas the payload delivered, executed, successful at a task, able to reach out to a\ncommand and control (c&c) server, remotely updated, and remotely removed?\nThe success (or failure) of each of these states is useful for attack testing, and for\nmisdirection. While creating a lot of detections that are time consuming but nonmalicious, responder behavior can be modified to carry out a successful attack that\nis more quiet and effective without catching the attention of the security team.\n\n### PUAs edge closer to malware, trafficking in exploits\n\nPotentially unwanted applications (PUAs) are interesting as they fade into the\nbackground noise within most security monitoring programs. They are underestimated\nby many practitioners versus the damage caused by traditional malware. The\ndanger of PUAs are that, while they may appear benign and as a result be deprioritized (such as an unwanted browser plug-in), they may be activated and\nutilized as a broker for delivery and execution of malware and fileless attacks. As\nsecurity teams continue to move toward automation, namely use of automated\nplaybooks, it is important not to underestimate the value of understanding the\nattack lifecycle and the techniques that are utilized by advanced attackers.\n\n\n-----\n\np p\n\n\n## Machine learning to defeat malware finds itself under attack\n\n2019 was the year where attacks against machine learning security systems came\ninto their own. From string-stuffing “universal bypass” attacks against machine\nlearning engines to the launching of a static machine learning evasion contest at\nDEF CON, it’s become clear that machine learning is finally on the radar of red teams\nin a serious way. It’s becoming obvious that machine learning systems have their\nown weaknesses, and that (with some technical expertise) they can be evaded in\nways that are analogous to how attackers evade “conventional” malware detection.\n\nBeyond attackers looking for ways to evade machine learning models,\nthere’s also the first signs that machine learning models are being used on\noffense. Deep fakes for voice have been (allegedly) used in a major vishing\nattack already, and with the tools to generate both voice and video fakes\nbecoming more widespread and accessible, it’s a safe bet we’ll see more\nattacks in this vein, making better training and detection tools critical.\n\nMachine learning is also beginning to enable more conventional red team operations\nas well. This year showed one of the first instances of offensive security researchers\nusing machine learning to bypass a commercial spam model in the wild.\n\nFinally, fully automatic text generation has begun to take off. A wide range\nof models, such as Google’s BERT or OpenAI’s GPT-2, can be pre-trained\non a simple language modeling task. This then provides a good foundation\nfor a wide range of language related tasks, from question answering,\nto translation, to simulating old-school text adventure games.\n\nSophos has already explored the application of machine learning to language as a\nway to detect malicious emails and URLs, but once again, using machine learning\nto optimize phishing email click-through rates, or to evade existing business email\ncompromise (BEC) or phishing detection systems (or both at once) seem likely.\n\n### Attacks against machine learning malware detectors\n\nA security data science operation is becoming “table stakes” for serious anti-malware\ncompanies, so it’s no surprise that attacks against machine learning malware\ndetection models are beginning to move from the academic space into the toolkits of\nattackers. Skylight Cyber published an attack against Blackberry/Cylance’s PROTECT\nengine in July, showing how appending a list of strings to the end of any malware could\ntrick PROTECT’s false positive suppression component into whitelisting the malware.\n\nExamining similar techniques, Endgame, MRG Effitas, and VMRay partnered\nto announce a machine learning static evasion contest at the DEF CON AI\nVillage. The goal of the contest was to produce ‘adversarial’ modifications to\nmalware samples that would lead three different (academic) machine learning\nmodels to declare them “benign” without compromising their functionality.\nAt least two winning solutions were posted that achieved perfect results.\nSimilarly to the PROTECT evasion, the machine learning models were evaded\nlargely by appending “benign-looking” data to various parts of the file.\n\n\n-----\n\np p\n\n\nWhile the weaknesses of machine learning malware detectors to adversarial\nattacks have been known within the academic community for a long time, seeing\nthese techniques put into practice within the offensive security community is\nnovel, and highlights the need for multiple layers of protection against attackers.\nRelying on a single approach – signatures or machine learning – leaves users\nvulnerable to evasive approaches. It’s important to note, though, that the\nevasion techniques required by the two different defenses are quite different.\nAttempting to evade signature-based methods quite often is ineffective\nagainst machine learning models, and evading machine learning models\nfrequently does nothing to evade conventional signature based approaches.\n\nBy combining machine learning and signatures intelligently, however, users\nget the best of both worlds: the high specificity and rapid deployment of\nsignatures, with the ability of machine learning to “plug the gaps” and discover\nnovel malware variants that signature based systems frequently miss.\n\n### Machine learning on the offensive\n\nMachine learning tools for defensive purposes are fairly mature at this point.\nHarnessing machine learning for offensive purposes is likely to be another\nsignificant growth area. While machine learning approaches have appeared in\nniche offensive areas such as CAPTCHA solving, more sophisticated applications\nare beginning to appear. Some academic work on using reinforcement\nlearning to automate the process of creating malware that can evade machine\nlearning has seen similar techniques applied in less controlled settings.\n\nSome malware might also be instrumented with lightweight machine learning\nmodels, such as simple classification algorithms in malware “droppers” (small\nprograms whose only job is to download the real malware from a server) to detect\nsandboxes, which complicates analysis or reverse engineering. Finally, at DerbyCon,\noffensive security researchers presented a heretofore theoretical “black box” attack\nagainst ProofPoint’s email protection system, in which they used machine learning\nscores to “clone” the email model and then build adversarial perturbations to emails\ncompletely offline. This attack allowed the researchers to identify ‘hot button’ words\nthat the email classifier keyed in on, and use those words to evade the system.\n\nMachine learning can be used to evade other security measures as well.\nAcademic work on using text-to-speech machine learning models to trick\nspeaker recognition and voice authentication models has already been\nshown to be feasible, and such models have already (allegedly) been used\nto impersonate the voice of a CEO in a “vishing” (voice phishing) scam.\n\nSimilar technology underlies “deepfakes,” which pose a real reputational risk (though\ntheir ability to circumvent technical security measures might be limited). The\nsame publicly available tools that can put YouTube personality PewDiePie into a\nBollywood dance number may conceivably be used to manipulate the stock market.\nWhile some initial efforts are underway to detect such fakes, these attacks are\nparticularly difficult to manage as they exploit “bugs” in people, rather than technical\nvulnerabilities: even if a particular video is flagged as “fake,” it might be reshared\nin a different context and so continue to promote the misleading message.\n\n\n-----\n\np p\n\n\n### \"Generative\" models blur the line between human and machine\n\nA final class of models which has come into its own in 2019 is “purely”\ngenerative models: models that are capable of producing some form of artifact,\nsuch as a photo or a news article, “from scratch” rather than adapting a voice\nrecording to match another person’s voice, or altering existing video.\n\nGenerative Adversarial Networks (GANs) can produce such things as made up\nphotos of people, AirBNB listings, cat pictures, or startup websites. In June, the\nAssociated Press reported that a GAN-generated profile photo was used to lend\nverisimilitude to a LinkedIn profile that was used in an espionage effort.\n\nFearing similar forms of misuse, the OpenAI institute initially refused to release\na model called GPT-2, a powerful model “pre-trained” on a large body of English\ntext. This could be readily adapted to a wide range of tasks, from playing the\nrole of a live game master and making up a “text adventure” as it goes along to\nproducing natural language text samples “primed” by a topic and style, to such\ntasks as question-answering or text summarization. Similar work (using a different\nkind of model) has been proposed to automatically generate comments for\nnews articles. While these kinds of models have not yet been proposed to attack\nhybrid, human/machine learning systems, it seems like a natural next step.\n\n\n-----\n\np p\n\n\n## Ten years out, machine learning targets our \"wetware\"\n\nIn a field that moves as rapidly as machine learning, speculating on what\nthe landscape might look like in as little as two years, let alone ten, is\ndifficult. However, some very broad trends seem likely to be relevant.\n\n### Increasing automation for offense and defense\n\nWe’re seeing the first generation of offensive machine learning tools take form\ntoday. As the cat and mouse game between attackers and defenders continues,\nwe can expect both offensive and defensive tools of increasing sophistication\nand effectiveness to develop rapidly. We should expect to see more sophisticated\ntechniques: from the academic machine learning community such as reinforcement\nlearning finally applied to security problems in earnest and at scale, allowing\nsemi-autonomous systems to make semi- or even fully-autonomous decisions\nin defending networks and endpoints. As the tempo for attacks and defenses\nincreases, driven by automation, human involvement will likely shift to afteraction checking, validation, and critique of the machine learning-driven actions.\n\n### “Wetware” attacks\n\nAs automated content generation continues to advance alongside better\nunderstanding of information operations and human psychology, we can expect\nmachine learning attacks against the human elements of systems to become\nincreasingly prominent. Automated content generation combined with some\ndegree of personalization scales much more effectively than individual-to-individual\nscamming, and lends itself naturally to personalization for and micro-segmentation\nof potential victims. Automated 419 scams, phishing, vhishing, and perhaps even\ndeepfake-enabled video attacks against human elements of systems seem likely,\nand the inherently adversarial method by which they are trained suggests that\nautomated systems will be of limited effectiveness in stopping them. Constructing\nrobust policies and systems to cope with human failures will be required.\n\n\n-----\n\n## Acknowledgments\n\nSophosLabs wishes to thank the following contributors to the 2020 Threat Report:\n\n\nRichard Beckett\n\nKonstantin Berlin\n\nMatthew Boddy\n\nAndrew Brandt\n\nJagadeesh Chandraiah\n\nTimothy Easton\n\nRichard Harang\n\nMatt Gangwer\n\nNikhil Gupta\n\nUnited Kingdom and Worldwide Sales\nTel: +44 (0)8447 671131\nEmail: sales@sophos.com\n\n© Copyright 2019. Sophos Ltd. All rights reserved.\n\n\nPankaj Kohli\n\nEric Kokonas\n\nHajnalka Kópé\n\nMark Loman\n\nPeter Mackenzie\n\nAndy Miller\n\nPaul Murray\n\nFerenc Nagy\n\nLuca Nagy\n\nNorth America Sales\nToll Free: 1-866-866-2802\nEmail: nasales@sophos.com\n\n\nMatt Phillion\n\nJoshua Saxe\n\nSergei Shevchenko\n\nVikas Singh\n\nMark Stockley\n\nRonny Tijink\n\nJ.J. Thompson\n\nXinran Wu\n\nAustralia and New Zealand Sales\nTel: +61 2 9409 9100\nEmail: sales@sophos.com.au\n\n\np p\n\nAsia Sales\nTel: +65 62244168\nEmail: salesasia@sophos.com\n\n\nRegistered in England and Wales No 2096520 The Pentagon Abingdon Science Park Abingdon OX14 3YP UK\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/Sophos/sophoslabs-uncut-2020-threat-report.pdf"
    ],
    "report_names": [
        "sophoslabs-uncut-2020-threat-report"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f7d9b02d-d294-422b-adf7-4b3adfac9d9a",
            "created_at": "2022-10-25T16:07:23.392241Z",
            "updated_at": "2025-03-27T02:02:09.775925Z",
            "deleted_at": null,
            "main_name": "The Big Bang",
            "aliases": [],
            "source_name": "ETDA:The Big Bang",
            "tools": [
                "Micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f276b8a6-73c9-494a-8ab2-13e2f1da4c53",
            "created_at": "2022-10-25T16:07:24.441133Z",
            "updated_at": "2025-03-27T02:02:10.231958Z",
            "deleted_at": null,
            "main_name": "Achilles",
            "aliases": [],
            "source_name": "ETDA:Achilles",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9198aefa-3da6-4605-bb52-923df20a7fce",
            "created_at": "2023-01-06T13:46:38.766848Z",
            "updated_at": "2025-03-27T02:00:02.913269Z",
            "deleted_at": null,
            "main_name": "The Big Bang",
            "aliases": [],
            "source_name": "MISPGALAXY:The Big Bang",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1573603909,
    "ts_modification_date": 1573603913,
    "files": {
        "pdf": "https://archive.orkl.eu/91c0a6c0cd95b42991ea7981be1bec29974df17f.pdf",
        "text": "https://archive.orkl.eu/91c0a6c0cd95b42991ea7981be1bec29974df17f.txt",
        "img": "https://archive.orkl.eu/91c0a6c0cd95b42991ea7981be1bec29974df17f.jpg"
    }
}