{
    "id": "8eb7a0c6-59f2-4190-8e15-0cb73c0e3d35",
    "created_at": "2023-01-12T15:05:27.269937Z",
    "updated_at": "2025-03-27T02:16:26.420666Z",
    "deleted_at": null,
    "sha1_hash": "24a391e993996dd3ded1008267e5230b047c9fe4",
    "title": "2020-12-17 - Credential Stealer Targets US, Canadian Bank Customers",
    "authors": "",
    "file_creation_date": "2022-05-28T19:03:42Z",
    "file_modification_date": "2022-05-28T19:03:42Z",
    "file_size": 2421465,
    "plain_text": "# Credential Stealer Targets US, Canadian Bank Customers\n\n**[trendmicro.com/en_us/research/20/l/stealth-credential-stealer-targets-us-canadian-bank-customers.html](https://www.trendmicro.com/en_us/research/20/l/stealth-credential-stealer-targets-us-canadian-bank-customers.html)**\n\nMalware\n\n\nDecember 17, 2020\n\n\nWe discovered a campaign that distributed a credential stealer, and its main code components are written in AutoHotkey (AHK).\n\nBy: William Gamazo Sanchez, Aliakbar Zahravi December 17, 2020 Read time: ( words)\n\nThreat actors are always looking for a way to execute files on a victim machine and stay undetected. One way involves using a\nscripting language that has no built-in compiler within a victim’s operating system, and which can’t be executed without its\ncompiler or interpreter. Python, AutoIT, and AutoHotkey (AHK) are some examples of such a scripting language. In particular,\nAHK is an open-source scripting language for Windows that aims to provide easy keyboard shortcuts or hotkeys, fast microcreation, and software automation. AHK also allows users to create a “compiled” .EXE with their code in it.\n\nIn mid-December, we discovered a campaign that distributed a credential stealer. We also learned that the main code\ncomponents of this campaign is written in AHK. By tracking the campaign components, we found out that its activity has been\noccurring since early 2020. The malware infection consists of multiple stages that start with a malicious Excel file. In turn, this\nfile contains an AHK script compiler executable, a malicious AHK script file, and a Visual Basic for Applications (VBA) AutoOpen\nmacro. The full attack chain is depicted in Figure 1. Our telemetry tracked the malware’s command-and-control (C&C) servers\nand determined that these come from the US, the Netherlands, and Sweden. We also learned that the malware has been\ntargeting financial institutions in the US and Canada.\n\nThe dropped adb.exe and adb.ahk play critical roles in this infection. The adb.exe is a legitimate portable AHK script compiler,\nand its job is to compile and execute the AHK script at a given path. By default (with no parameter), this executable executes a\nscript with the same name in the same directory. The dropped AHK script is a downloader client that is responsible for achieving\npersistence, profiling victims, and downloading and executing the AHK script on a victim system.\n\nFor persistence, the downloader client creates an autorun link for adb.exe in the startup folder. This portable compiler is used to\ncompile and execute the AHK script. By default (with no passing parameter), this executable executes an AHK script with the\nsame name in the same directory which is in this case adb.ahk.\n\nThe script profiles each user by generating a unique ID for each victim based on the volume serial number of the C drive. The\nmalware then goes through an infinite loop and starts to send an HTTP GET request every five seconds with the generated ID.\nThis ID serves as the request path to its command-and-control (C&C) server to retrieve and execute the AHK script on an\ninfected system.\n\nFor command execution, the malware accepts various AHK scripts for different tasks per victim and executes these using the\nsame C&C URL (instead of implementing all modules in one file and accepting the command to execute them). By doing this,\nthe attacker can decide to upload a specific script to achieve customized tasks for each user or group of users This also\n\n\n-----\n\nprevents the main components from being revealed publicly, specifically to other researchers or to sandboxes. In fact, though we\nnoticed that this attack started as early as the beginning of 2020, still not a single command had been discovered by sandboxes.\nThis suggests that either the attack selects when to actually send the commands to the infected victim machine, or the rapid\nchange of the C&C server has made it difficult to track. So far, we have discovered five C&C servers and only two commands:\n**deletecookies and passwords.**\n\nFigure 1. The attack chain of the malware\nAmong the downloaded components by the downloader client, we observed a stealer written in AHK. This script is responsible\nfor harvesting credentials from various browsers and exfiltrating them to the attacker. It is worth noting that a variant of this\nstealer targets specific websites. Among them are major Canadian banks, as evident in Figure 2.\n\nFigure 2. Customers of Canadian banks are among the targeted credentials for exfiltration.\nAn interesting aspect is that the AHK delivered scripts containing instructions in Russian on how to use the scripts. This\nsuggests that a “hack-for-hire” group is behind the attack chain’s creation. The following sections will describe the details of the\nattack chain shown in Figure 1.\n\nAnalysis of malicious components\n\nIf the user enables the macros to open the Excel file, VBA AutoOpen macro will drop and execute the AHK downloader client\nscript via a portable AHK script compiler.\n\n\n-----\n\nFigure 3. The VBA dropper in the Excel file\nThe dropped portable AHK script compiler, adb.exe, by default executes the AHK script with the same name in the same\ndirectory. In this case, adb.exe automatically detects and executes the adb.ahk script.\n\n\n-----\n\nFigure 4. The AHK downloader script\nAs aforementioned, adb.ahk is a downloader client that is responsible for persistence, profiling victims, and downloading and\nexecuting AHK scripts in a victim system continuously every five seconds. The malware sends an HTTP GET request to its C&C\nserver in order to download and execute the AHK script in an infected machine.\n\nFigure 5. The HTTP GET request that the AHK downloader sends\n\nThe response from the server saves into the file called adb.exe~ (adb.exe~ is in AHK plain-text script; it is not an executable\nfile). The HTTP GET request path in Figure 5 is a victim’s unique ID that has the following format:\n\n**<C Drive volume serial number >-xl2**\n\nIt is important to note that in some other variants “-xl2” is replaced with “-pro”. Before adb.ahk executes the downloaded AHK\nscript(s), it first checks if the specific character (“~”) exists at the very end of the file. If the character is found, then it proceeds\nwith the execution.\n\nMoreover, the malware creates an autorun link to the adb.exe AHK script compiler called “GraphicsPerfSvc.lnk” in the startup\nfolder. As mentioned previously, the compiler, by default, executes an AHK script with the same name and directory.\n\nFigure 6. The last line of a valid stealer\nStealer analysis\n\nOne of the scripts downloaded by the downloader client is a browser credential stealer. In the following section, we look into the\nimplementation, features, and network communication of this malicious script.\n\nUpon successful execution, the malware sends a status log (“passwords: load”) to its C&C server via an HTTP POST request:\n\n\n-----\n\nFigure 7. The malware sends a status\n\nlog.\nAs with adb.ahk, this script also generates a unique ID for its victims based on the volume serial number of the C drive. The\ngenerated unique victim ID is then used to track infections and remains the same at all times for each victim.\n\nThe stealer then attempts to download “sqlite3.dll” on a victim machine. The malware uses this DLL to perform SQL queries\nagainst the SQLite databases within browsers’ app folders.\n\n\n-----\n\nFigure 8. The stealer downloads sqlite3.dll and sends an execution status.\nFrom the above snippet, we can observe that the malware retrieves the volume serial number of the C drive again and searches\nfor two hard-coded serial numbers, 605109072 and 605109072. These two serial numbers have been used for debugging\npurposes and upon exiting, the script displays the SendLog() function argument in the message box. Notably, this debugging\ntechnique has also been seen in various functions in this script.\n\n\n-----\n\nIt is worth noting that the malware author uses the following open source code to handle the SQLite database with AHK.\n\nFigure 9. An open-source SQLite class for AHK\nThe main purpose of this malware is to steal credentials from various browsers such as Microsoft Edge, Google Chrome, Opera,\nFirefox, and Internet Explorer (IE). To achieve this task, the malware uses the following functions:\n\nFigure 10. Stealer\n\nfunctionalities\nThe following charts demonstrate the preceding functions:\n\n\n-----\n\nFigure 11. An overview of the functions that are related to Chrome, Edge, and Opera browsers\n\nFigure 12. An overview of the Firefox stealer function\n\n\n-----\n\nFigure 13. An overview of the IE stealer function\nThe malware identifies the browsers that are installed in a victim machine and reports its findings to its C&C server via SendLog\n() function. If the targeted browser is not installed, the malware labels it as “not_found”:\n\nFigure 14. In this image, the malware\n\nsends “Opera_not_found\" to the C&C server since it has not found Opera among the installed browsers.\nOn the other hand, if the targeted browser is in the victim machine, the malware labels it as “_ok”, as seen in the following\nimage:\n\nFigure 15. Since Chrome is among the\n\ninstalled browsers, the malware sends “Chrome_ok” to the C&C server.\nThe following snippet demonstrates how the malware searches for the login data of Chrome, Edge, and Opera.\n\n\n-----\n\nFigure 16. The malware locates the installed browsers.\nFor the Internet Explorer password stealer, the author borrowed some codes from an open-source IE password information\nstealer and converted them to AHK.\n\n\n-----\n\nFigure 17. The IE stealer\nData exfiltration\n\nFinally, the malware sends the collected credentials from installed browsers on the victim machine to the attacker via an HTTP\nPOST request. It is worth noting that for each browser, the malware attempts to decrypt the credentials and sends these to the\nC&C as plain text.\n\nFigure 18. An example of credential\n\nexfiltration\n\n\n-----\n\nFigure 19. The\n\nexfiltration of credentials\nAnother interesting thing about this campaign is that the downloaded components are very well organized at the code level.\nThese downloaded components also have usage instructions in a comment format for the main functions and variables. This\nbehavior, therefore, could indicate that this code is intended for use not only of its author, but also by others as a service or a\nstandalone instance.\n\nSummary of the routine\n\nThe malware infection consists of multiple stages that start with a malicious Excel file. If the user enables the macros to open\nthe Excel file, VBA AutoOpen macro will then drop and execute the downloader client script via a legitimate portable AHK script\ncompiler. The downloader client is responsible for achieving persistence, profiling victims, and downloading and executing AHK\nscript in a victim system. Instead of receiving commands from the C&C server, the malware downloads and executes the AHK\nscript for different tasks. The downloaded script is a stealer that targets various browsers such as Google Chrome, Opera, Edge,\nand more. The stealer collects and decrypts credentials from browsers and exfiltrates the information to the attacker’s server via\nan HTTP POST request.\n\nIndeed, by using a scripting language that lacks a built-in compiler within a victim’s operating system, loading malicious\ncomponents to achieve various tasks separately, and changing the C&C server frequently, the attacker has been able to hide\ntheir intention from sandboxes.\n\n\n-----\n\nIndicators of compromise (IOCs)\n\nSHA 256 Description Detection\n\n\na1f2606102e59bbc1a6de8912378821e83c32f31f6a402e8f3993ef966746b07 Stealer\nmodule\n\ndd3087a377ee3d1959f6c17b1b13e5972d1783dfd708bd084150e44c30e3af6e\n\nd8483908dc0a18c4b51bfe962279816c910fedbad1961e5c5ed081c250cc5f76\n\n1994f37501d7fc3038129db09babc5ef67d5ab4c93a95b3b59bf2b5ffa1592ff\n\n0078c476753613a78ff9e8f621fd28c1279c0981d519c44212b9d02e5fb4c81c\n\nbed925d7c0af493c9ccd2828d6fdefe6f4255bada51f645a8fffdd67e24b87fd Excel file\n\n27d9eb869eea6c713c6f109eca867844e2feceb0783bda2b78f7a92dffc833f6\n\nIPs Description\n\n93.115.23.48 C&C server\n\n94.103.94.186 C&C server\n\n2.56.215.97 C&C server\n\n199.192.29.202 C&C server\n\n5.39.223.162 C&C server\n\n\nTrojanSpy.AHK.CREDSTEALER.A\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-17 - Credential Stealer Targets US, Canadian Bank Customers.pdf"
    ],
    "report_names": [
        "2020-12-17 - Credential Stealer Targets US, Canadian Bank Customers.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535927,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653764622,
    "ts_modification_date": 1653764622,
    "files": {
        "pdf": "https://archive.orkl.eu/24a391e993996dd3ded1008267e5230b047c9fe4.pdf",
        "text": "https://archive.orkl.eu/24a391e993996dd3ded1008267e5230b047c9fe4.txt",
        "img": "https://archive.orkl.eu/24a391e993996dd3ded1008267e5230b047c9fe4.jpg"
    }
}