{
    "id": "8ed75f53-f800-49f1-84e6-fd0014b03e5a",
    "created_at": "2023-01-12T15:02:22.652106Z",
    "updated_at": "2025-03-27T02:16:26.025931Z",
    "deleted_at": null,
    "sha1_hash": "22ce01519f8dc0e78df8b5678e756936306bf73d",
    "title": "2020-03-26 - Ransomware Maze",
    "authors": "",
    "file_creation_date": "2022-05-28T16:17:01Z",
    "file_modification_date": "2022-05-28T16:17:01Z",
    "file_size": 3192799,
    "plain_text": "# Ransomware Maze\n\n**[mcafee.com/blogs/other-blogs/mcafee-labs/ransomware-maze/](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/ransomware-maze/)**\n\n[Alexandre Mundo](https://www.mcafee.com/blogs/author/alexandre-mundo/)\nMar 26, 2020\n\n29 MIN READ\n\n## EXECUTIVE SUMMARY\n\n\nMarch 26, 2020\n\n\nThe Maze ransomware, previously known in the community as “ChaCha ransomware”, was\ndiscovered on May the 29th 2019 by Jerome Segura[1].\n\n**The main goal of the ransomware is to crypt all files that it can in an infected system and**\nthen demand a ransom to recover the files. However, the most important characteristic of\nMaze is the threat that the malware authors give to the victims that, if they do not pay, they\n**will release the information on the Internet[2].**\n\nThis threat has not been an idle one as the files of one company were indeed released on\nthe Internet. Even though the company sued, the damage was already done. This is a\nbehavior increasingly observed in new ransomware[3], such as Sodinokibi, Nemty, Clop and\nothers.\n\nIt was highlighted last year[4] how ransomware would head in this direction to obtain money\nfrom victims who may be reluctant to pay for decryption.\n\n## TELEMETRY MAP\n\n\n-----\n\nFIGURE 1. MAP OF MAZE INFECTIONS\n\n## INTRODUCTION\n\nOn the 29th of October a campaign distributing the Maze malware to Italian users was\ndetected. Historically, the malware has used different techniques to gain entry, mainly using\nexploits kits, remote desktop connections with weak passwords or via email impersonation\nor, as in the Italian case, via different agencies or companies[5], i.e. the Italian Revenue\nAgency. These emails came with a Word attachment that was using macros to run the\nmalware in the system.\n\nThe exploit kits used most often were Fallout and Spelevo[6].\n\nThe malware is hard programmed with some tricks to prevent reversing of it and to make\nstatic analysis more difficult. This report covers these protections and the behavior of the\nmalware in an infected system.\n\nThe developers have inserted messages to provoke malware researchers, including the\nemail address of Lawrence Abrams, owner of “BleepingComputer”, who they contacted\ndirectly. They are very active on social media sites such as Twitter.\n\n**McAfee protects its customers against the threats that we talk about in this report in**\n**all its products, including personal antivirus, endpoint and gateway.**\n\n## MAZE OVERVIEW\n\n\n-----\n\nThe malware is a binary file of 32 bits, usually packed as an EXE or a DLL file. This report\nfocuses on the EXE file.\n\nFIGURE 2. INFORMATION ABOUT THE MALWARE\n\nMore information about the sample used in this report appears in this table:\n\n## TECHNICAL DETAILS\n\nMaze is a complex piece of malware that uses some tricks to frustrate analysis right from the\nbeginning.\n\nThe malware starts preparing some functions that appear to save memory addresses in\nglobal variables to use later in dynamic calls though it does not actually use these functions\nlater. Whether it is residual code existing in the entry point of the malware or a trick to\nmislead researchers is up for debate.\n\n\n-----\n\nFIGURE 3. SAVE ADDRESS OF FUNCTIONS TO USE LATER IN A DYNAMIC WAY\n\nLater, the malware enters in a big block of trash code that also includes some elements to\ndecrypt strings and important information for later. The malware uses some tricks to detect\ndebuggers at this point.\n\nThe most important of those are:\n\nA big use of the PEB field “IsDebuggerPresent”. This field is a Boolean field that is filled\nfrom Windows with 1 (True) if the application is running inside of a debugger or 0\n(False) if it is not.\n\nFIGURE 4. HIGH USE OF THE “ISDEBUGGERPRESENT” PEB FIELD TO DETERMINE IF\nTHE APPLICATION IS RUNNING IN A DEBUGGER\n\nIf the malware detects a debugger it will remain in an infinite loop without making anything\nwhile wasting system resources.\n\nFIGURE 5. MAZE CATCHES THE DEBUGGER AND REMAINS RUNNING, WASTING\nRESOURCES\n\n\n-----\n\nThe malware gets all processes in the system but ignores the first one (the idle process in\nWindows which is simply a tool to let the user know what percentage of system resources\nare being used). Using the name of each process it makes a custom name with a custom\nalgorithm, along with a hash that is checked against a hardcoded list. If the hash is found in\nthis list the process will be terminated.\n\nFIGURE 6. CHECK OF HASHES FROM CUSTOM NAME OF THE PROCESSES OF THE\nSYSTEM\n\nFor example, the process of the debugger “x32dbg”, is caught at this point:\n\nFIGURE 7. X32DBG PROCESS CAUGHT BY THE MALWARE WITH THE HASH\n\nIt can terminate IDA debugger, x32dbg, OllyDbg and more processes to avoid dynamic\nanalysis, close databases, office programs and security tools.\n\nA partial list of the processes that can be cracked using a dictionary list terminated by the\nmalware is shown below:\n\ndumpcap.exe -> 0x5fb805c5\n\nexcel.exe -> 0x48780528\n\nfiddler.exe -> 0x5e0c05b1\n\nmsaccess.exe -> 0x6a9c05ff\n\nmysqld-nt.exe -> 0x79ec0661\noutlook.exe -> 0x615605dc\n\npipanel.exe -> 0x5fb805c4\n\nprocexp64.exe -> 0x78020640\n\nprocexp.exe -> 0x606805d4\n\nprocmon64.exe -> 0x776e0635\n\n\n-----\n\nprocmon.exe -> 0x600005c9\npython.exe -> 0x55ee0597\ntaskkill.exe -> 0x6c2e0614\nvisio.exe -> 0x49780539\nwinword.exe -> 0x60d805d5\nx32dbg.exe -> 0x5062053b\nx64dbg.exe -> 0x50dc0542\n\nThis short list shows the name of the process to kill and the custom hash from the special\nname generated from the original process name.\n\nFIGURE 8. TERMINATEPROCESS FUNCTION TAKEN FROM THE EXPORT ADDRESS\nTABLE (EAT) OF KERNEL32 AND PASSING THE HASH NAME CHECK\n\nThe malware will kill the process with the function “TerminateProcess” that it gets from the\nEAT (Export Address Table) of the module “kernel32.dll” to increase obfuscation, comparing\nthe name with a custom hash taken from the name in high caps.\n\n\n-----\n\nFIGURE 9. CALL TO TERMINATEPROCESS IN A DYNAMIC WAY TO OBFUSCATE THIS\nCALL\n\nThe malware calls Windows functions in a unique way to aid obfuscation, i.e. getting the first\nprocess in the system to use the function “Process32FirstW”. However, instead of calling it\ndirectly, it puts the parameters needed for the function on the stack, followed by a memory\naddress with a “push” opcode and then makes a direct jump to the Windows function. When\nthe function ends, Windows makes a “ret” opcode then gets the last memory address that\nthe malware pushed inside the stack, returning to this address and continuing the flow. An\nexample of this can be seen in this image:\n\nFIGURE 10. HIGH OBFUSCATION TO TRY TO SLOW ANALYSIS AND MAKE IT MORE\nDIFFICULT\n\nAnother ploy utilized by the malware (depending of the sample) is to get the function\n“DbgUIRemoteBreakin”, using the function “GetProcAddress”, before employing a trick to\navoid having a debugger attach to it in runtime[7].\n\n\n-----\n\nFIGURE 11. GET DBGUIREMOTEBREAKIN USING GETPROCADDRESS TO AVOID\nHAVING A DEBUGGER ATTACK IT\n\nThe trick used here is “VirtualProtect” to give the function memory address of\n“DbgUIRemoteBreakin” permission to write to it:\n\nFIGURE 12. GIVE WRITE PERMISSIONS IN MEMORY\n\nAfter gaining permission, which is granted only for 1 byte, the malware patches this byte with\na 0xC3 value (the opcode of “ret”) and restores the previous permissions with\n“VirtualProtect”, again in the same address and byte, removing the write permission.\n\nFIGURE 13. PATCH THE FUNCTION WITH A RET OPCODE AND RESTORE MEMORY\nPERMISSIONS\n\n\n-----\n\nThis is done to avoid having a debugger attach to it in runtime. This way, when a debugger\nattaches to the process internally, the system calls this function but, instead of creating a\nthread to start the debugging, the “ret” opcode forces the function to return without creating\nit. In brief, it prevents a debugger from being attached correctly. It is done before\nenumerating the system process.\n\nThe malware checks the language of the machine with function\n“GetUserDefaultUILanguage” and saves the value in the stack; it is not checked\nautomatically after the call, but it is important later.\n\nMaze creates a mutex with the name “Global\\x” where x is a special value that is unique per\nmachine. For example, in the next screenshot (some information has been deleted to\nanonymize the machine used for the analysis) is an example of this behavior. It is done to\navoid two or more executions at the same time.\n\nFIGURE 14. CREATION OF A MUTEX TO AVOID DOUBLE EXECUTION. UNIQUE PER\nMACHINE\n\nThe malware, after creating the mutex, makes calls to the function “GetLastError” to check\nagainst two errors:\n\n0x05 -> ERROR_ACCESS_DENIED. If the malware gets this error, it means that the\nmutex already exists in the system but, for some reason, the malware cannot access it\n(perhaps privileges, policies, etcetera).\n0xb7 -> ERROR_ALREADY_EXISTS. If the malware gets this error, it means that the\nmutex already exists in the system and can be accessed.\n\nIf either of the above occur, the malware remains in execution but does not crypt any files in\nthe system or use any resources of the machine. It means that it will appear in the program\nlist using 0% of the processor.\n\n\n-----\n\nThe mutex value changes either per sample or on a periodic basis to avoid the possibility of\nvaccines being made against it. The malware also has a command to avoid the ‘problem’ of\nvaccines which will be explained later.\n\nAfter the mutex, the malware checks the language previously saved in the stack against, for\nexample, language 0x419 (Russian from the Russian Federation, ru-RU[8]).\n\nThe checks are done in an obfuscated way within the jumble of the code that the malware\nhas (in the virtual machine used here the Spanish language of Spain (es-ES) was used; it is\nthe code 0xC0A that appears in the stack in the screenshot):\n\nFIGURE 15. CHECKING THE LANGUAGE AGAINST THE RUSSIAN LANGUAGE FROM\nTHE RUSSIAN FEDERATION\n\nIf the language matches any of those in the list below, the malware will clean the memory\nand exit the main thread without wasting any resources or making any files.\n\n\n-----\n\n0x419 -> ru-RU (Russian from Russian Federation)\n0x422 -> uk-UA (Ukranian from Ukraine)\n0x423 -> be-BY (Belarusian from Belarus)\n0x428 -> tg-Cyrl-TJ (Tajik (Cyrilic from Tajikistan)\n0x42B -> hy-AM (Armenian from Armenia)\n0x42C -> az-Latn-AZ (Azerbaijani (Latin from Azerbaijan))\n0x437 -> ka-GE (Georgian from Georgia)\n0x43F -> kk-KZ (Kazakh from Kazakhastan)\n0x440 -> ky-KG (Kyrgyz from Kyrgyzstan)\n0x442 -> tk-TM (Turkmen from Turkmenistan)\n0x443 -> uz-Latn-UZ (Uzbek (Latin from Uzbekistan))\n0x444 -> tt-RU (Tatar from Russia Federation)\n0x818 -> ro-MD (Romanian from Moldova, NOT Romanian from Romania!)\n0x819 -> ru-MD (Russian from Moldova)\n0x82C -> az-Cyrl-AZ (Azerbaijani (Cyrilic from Azerbaijan))\n0x843 -> uz-Cyrl-UZ (Uzbek (Cyrilic from Uzbekistan))\n0x7C1A -> sr (Serbian)\n0x6C1A -> sr-Cyrl (Serbian in Cyrilic)\n0x1C1A -> sr-Cyrl-BA (Serbian (Cyrilic from Bosnia and Herzegovina))\n0x281A -> sr-Cyrl-RS (Serbian (Cyrilic from Serbia))\n0x81A -> sr-Latn-CS (Serbian (Latin)) (this language code starts from Windows Vista)\n\nThe malware tries to delete the shadow volumes in the system using the “wmic.exe” program\nwith the switches “shadowcopy” and “delete”. Prior to this, the malware gets the function of\n“WoW64DisableWow64FsRedirection” with “GetProcAddress” and uses it to avoid\nredirection by default in 64-bit operating systems and calls it in a dynamic way.\n\nThe malware tries to delete the shadow copies two times, once before crypting the files in\nthe infected system and secondly after crypting them.\n\nThis execution is done with the function “CreateProcessW” but, to increase the level of\nobfuscation, the malware is launched with this command:\n\n\n-----\n\nFIGURE 16. DELETION OF SHADOW COPIES IN THE INFECTED SYSTEM WITH THE\nWMIC COMMAND\n\nAs you can see in the image above, the malware uses a command with the name of folders\nthat do not exist by default in Windows, except “Windows”, “system32” and “wbem”. It enters\nthese folders but then promptly exits them using the command “..”, meaning it returns to the\nprevious folder in the path.\n\nFor example, in the beginning it enters the folders “ydw” and “fdygg” but later returns to the\nroot of the Windows installation unit with two “..” commands that lead to “C:\\” in this case. It\nlater concatenates with the “Windows” folder and continues with the same behavior to finally\nenter into “system32” where it calls the “wmic.exe” program with the switches to delete the\nshadow volumes. This is done to try obfuscating this call, though such suspicious behavior\nmay cause an antivirus program to stop it anyway, but it is proof that the malware coders\nhave skills in programming and a good understanding of Windows behavior.\n\nIt is important to understand that this “path” used in the command with non-existent folders is\nrandom and does not need to use the same number of folders to make the obfuscation.\n\nAfter the deletion process, the malware gets the function\n“Wow64RevertWow64FsRedirection” using the function “GetProcAddress” and calls it in a\ndynamic way to leave the system in the same state as before.\n\n\n-----\n\nFIGURE 17. RECOVER THE FS REDIRECTION IN 64-BIT OPERATING SYSTEMS\n\nMaze affects network resources too, using the functions “WNetOpenEnumW”,\n“WNetEnumResourceW”, “WNetCloseEnum” and “WNetAddConnection2W”.\n\nFIGURE 18. ENUMERATING THE NETWORK RESOURCES OF THE DISK TO CRYPT\nFILES INSIDE OF THEM\n\nThe malware uses two algorithms to crypt the files, ChaCha which is based on the Salsa20\nalgorithm that is symmetric and, for protection, an RSA algorithm that is asymmetric\n\nIn each execution the malware creates a Public BLOB of one RSA key that will be used to\ncrypt the part that holds the information to decrypt the files, and one Private BLOB with an\nRSA key that allows decryption of the information crypted with the public RSA blob created\npreviously.\n\n\n-----\n\nFIGURE 19. EXPORT OF THE RSA PUBLIC KEY BLOB GENERATED IN RUNTIME\n\nFIGURE 20. EXPORT OF THE RSA PRIVATE KEY BLOB GENERATED IN RUNTIME\n\nJust like other ransomware, this malware has an RSA Public BLOB embedded that will be\nimported to protect the RSA private BLOB of the victim. Only the malware developers have\nthe RSA private blob to decrypt their public RSA Blob.\n\n\n-----\n\nFIGURE 21. IMPORT OF THE RSA PUBLIC BLOB FOR THE MALWARE DEVELOPERS\n\nThis key is protected with a crypto using a key of 32 bits and iv of 8 bytes using the function\n“CryptGenRandom” to avoid memory dumps but, later, it will need to be decrypted before\nuse.\n\nAfter this, the malware starts the procedure of crypting the files, searching in units, before\nimporting the RSA public BLOB key generated in runtime. After this, it creates the ransom\nnote prepared for this infected machine in the root folder and then starts looking for folders\nand files to crypt.\n\nFIGURE 22. CREATION OF RANSOM NOTE IN ROOT FOLDER AND LOOKING FOR\nFOLDERS AND FILES\n\nAn example ransom note, with some data anonymized, is shown below:\n\n\n-----\n\nFIGURE 23. EXAMPLE OF A MAZE RANSOM NOTE\n\nThe procedure to crypt the files is easy, with the malware taking the following steps:\n\nCheck the existence of the file with the function “SetFileAttributesW” with the attribute\n“FILE_ATTRIBUTE_ARCHIVE”.\nReserve memory to the file with a call to “Virtual Alloc” for the key and iv.\nOpen the file with read and write permissions with the function “CreateFileW” with the\nflag “OPEN_EXISTING”.\nGet the file size with the function “GetFileSizeEx” (it is important for managing big files,\n“GetFileSize” is not good for bigger files).\nCreate a file mapping with the functions “CreateFileMappingW” and “MapViewOfFile”\nGenerate a random key of 32 bytes with the function “CryptGenRandom”.\nGenerate a random iv of 8 bytes with the function “CryptGenRandom”.\nReserve 264 bytes of memory with the function “VirtualAlloc”.\nGenerate a new random extension for the victim file. Each file has a different extension\nbut does not lose the original extension; the new one is appended to the old one. For\nexample, “1.zip” becomes “1.zip.gthf”.\nCrypt the file with the ChaCha algorithm and the key and iv with the RSA public key\ngenerated in runtime.\nWrite this new block with the key and iv to decrypt at the end of the file.\n\n\n-----\n\nRename the file with the function MoveFileExW . That way it is not possible to use\nforensic tools to recover the files because they use the same sector on the raw disk.\nThe malware does not delete the file using the function “DeleteFileW” and later create\na new one with the crypted data. Instead, all changes are applied in the mapping\ndirectly, in memory, without using a file pointer on the disk to read and write, which\nmakes the process much quicker.\nThe image of the file is unmapped, and handles closed.\nThe process is repeated with new files.\n\nThe list of folders that the malware avoids are:\n\nWindows main directory.\nGames\nTor Browser\nProgramData\ncache2\\entries\nLow\\Content.IE5\nUser Data\\Default\\Cache\nAll Users\nLocal Settings\nAppData\\Local\nProgram Files\n\nThe malware ignores these file extensions:\n\nLNK\nEXE\nSYS\nDLL\n\nThe malware also has a list of filenames that will not be crypted:\n\ninf\nini\nini\ndat\ndb\nbak\ndat.log\ndb\nbin\nDECRYPT-FILES.txt\n\n\n-----\n\nHowever, it does crypt the file ntuser.ini to prevent other ransomwares from crypting it. It\ncreates the ransom note in each folder that it can.\n\nWhen the malware finishes crypting all files it changes the desktop wallpaper to this image:\n\nFIGURE 24. THE MALWARE CHANGES THE DESKTOP WALLPAPER AFTER CRYPTING\nTHE FILES\n\nThe malware tries to make connections to IP addresses that have been crypted in the binary\nto send information about the infected machine, as seen below:\n\nhxxp://91.218.114.4/nwjknpeevx.action?\npw=g1y652l&kyn=21y3vvhh&dvr=5e&us=g25e3582a\n\nhxxp://91.218.114.11/forum/siaib.jspx?v=h&xyna=0vip863&eul=xsn3q0\n\nhxxp://91.218.114.26/view/ticket/pigut.jspx?o=664quo0s&fp=ot52\n\nhxxp://91.218.114.25/xrr.jspx?ygad=r35e2cx&e=6as6ta\n\nhxxp://91.218.114.4/j.php\n\nhxxp://91.218.114.11/payout/view/fa.aspx?y=y&qbx=4&kws=n2&iuy=8k7\n\nhxxp://91.218.114.25/lxh.asp?mtxm=l7&r=836wy5\n\nhxxp://91.218.114.26/signin/ticket/eq.action?x=yk6rr&e=50b&q=327dr5&ofk=065cdp\n\nhxxp://91.218.114.31/signin/rnmnnekca.jsp?kdn=6snl5&e=7a50cx4hyp\n\nhxxp://91.218.114.31/forum/a.aspx?byx=56&bc=62t0h&u=75w6n6&sot=2v0l761or6\n\n\n-----\n\nhxxp://91.218.114.32/withdrawal/checkout/l.do?nuny=qj6&sdv=45g2boyf5q&dnr=rh8lk31ed\n\nhxxp://91.218.114.77/task/bxfbpx.jspx?nq=cge63\n\nhxxp://91.218.114.38/account/payout/ujwkjhoui.shtml\n\nhxxp://91.218.114.37/imrhhjitop.phtml?wto=344dsc84&sp=x&oml=c173s71u&iy=m3u2\n\nhxxp://91.218.114.38/auth/login\n\nhxxp://91.218.114.79/logout/hfwdmugdi.php?upaj=mj7g\n\nhxxp://91.218.114.38/sepa/juel.php?ars=51qse4p3y&xjaq=r5o4t4dp\n\nhxxp://91.218.114.32/fwno.cgi?yd=410&o=y7x5kx371&p=m3361672\n\nhxxp://91.218.114.37/sepa/signout/mjsnm.aspx?\nr=7o47wri&rtew=uu8764ssy&bri=51gxx6k5&opms=72gy0a\n\nhxxp://91.218.114.77/payout/analytics/lrkaaosp.do?y=62h&aq=3jq8k6&v=0svt\n\nhxxp://91.218.114.79/create/dpcwk.php?u=28qy0dpmt&qwbh=k&f=g1ub5ei&ek=3ee\n\nIt is important to take into consideration that the malware forges the POST string to make the\nconnection with a random choice from a list of possible strings such as “forum”, “php”, “view”,\netc., to make detection harder with IPS or other filters on the network.\n\nThe IP addresses are detected as from the Russian Federation but that does not prove that\nthe malware came from this country; it could be deliberate misdirection but, with the\nlanguage checks of CIS countries, it certainly appears possible.\n\nThe use of IP addresses instead of domain names is to avoid DNS resolutions that can be\naltered or redirected to a loopback, for example using the “host” file in Windows. This makes\nthe trace of IPs more complicated and avoids having the connection blocked.\n\nThe malware uses this agent to make the connection, but it can change between samples:\n\n\n-----\n\nFIGURE 25. AGENT USED TO MAKE CONNECTIONS TO THE C2C IP ADDRESSES\n\nFrom a memory dump we can extract the IPs used by these connections, as well as a\ncurious string that talks about Lawrence Abrams, the admin of the web site\n“bleepingcomputer” who was contacted directly by the developers. It is not known why they\nincluded this email address because it has no relation to the ransom note and is not used\nanywhere else. Perhaps it is a means of mocking the administrator of a site that frequently\nreports on ransomware?\n\nFIGURE 26. C2C IP ADDRESSES EXTRACTED FROM THE MEMORY\n\nThe connections to the C2C IP addresses, in a pcap using Wireshark, can be seen perfectly:\n\n\n-----\n\nFIGURE 27. CONNECTION IN PCAP WITH THE C2C IP ADDRESSES\n\nMaze has some strings in memory that are interesting and something that may be worth\nfurther analysis in the future:\n\nFIGURE 28. CURIOUS STRING FOR FUTURE INVESTIGATION\n\nThe webpage for making the payment requested in the ransom note gives a price and\nverifies that all is correct.\n\n\n-----\n\nFIGURE 29. MAZE PAYMENT WEBPAGE AFTER DECRYPTING THE RANSOM NOTE\n\nMaze has a chat function to contact the operators and receive information about how to\nobtain the cryptocurrency required to make payment.\n\nOf course, as with many types of ransomware, there is an offer to decrypt three images for\nfree and that service has been verified as working:\n\nFIGURE 30. FREE DECRYPTION WORKS SO THE MALWARE SAMPLE IS CORRECT\n\n## SWITCHES\n\nThe malware has some switches that can be used in the command line to launch. These\nswitches can either disable some elements or enable logging.\n\nThe switches are:\n\n\n-----\n\n–nomutex -> This switch prevents checking the mutex so that it can run more than one\ninstance on the same machine. It can also be used to avoid vaccines that are made\nbefore the malware creates the mutex name in the machine.\n–noshares -> With this switch the malware will not crypt network shares, only the local\nmachine.\n–path x -> Where x is a full path. In this case the malware will crypt all files in all folders\nstarting from this path unless they are blacklisted names, extensions or folder names.\nThis is useful for the malware developers to attack a special path instead of losing time\ngoing after a full machine and it makes the attack more targeted.\n–logging -> If this switch is enabled the malware will log all the steps it makes. Useful to\nthe malware developers in debug environments, or in the attack phase to know that all\nwas ok, step by step. Here is a small example of this information:\n\nFIGURE 31. EXAMPLE OF THE INFORMATION THAT THE MALWARE CAN GIVE WITH\nTHE LOG SWITCH\n\n## OTHER SAMPLES\n\nIn January 2020 a new version of the malware appeared with a special text dedicated to\nsome researchers in the security field. The malware developers appear to have chosen\nthose individuals to be provocative and make fun of them.\n\nThe sample was discovered by malwrhunterteam[9] on the 28th of January 2020. The\nsample has some differences when compared with the previous one that was analyzed in\nthis report. Those differences will be covered later via another sample that was found by\nLuca Nagy[10] on the 30th of January 2020.\n\nThe most important thing here is that the developers appear to have carefully selected the\nresearchers and waited for them to answer as a psychological trick, and it worked, because\nall of them replied, trolling the malware developers over the version of their malware\ndetected on the 28th.\n\nHere is one response from a malware developer to this trolling that contains some interesting\nfacts:\n\n\n-----\n\nFIGURE 32. RESPONSE FROM A MALWARE DEVELOPER\n\nIt is not known if one person is behind the malware or not. It is curious that they said “I”\ninstead of “we” twice in their answer. So, perhaps it was written by one person for\ntrolling purposes, or perhaps the developer of the malware really is only one person (or\nthey want researchers to think that is the case).\nAnother important fact in the note is the talk about the tools used by one of the\nresearchers for regular malware analysis. Why are they mentioning regular malware\nanalysis? Is it because they are reversing malware themselves for fun or could it be\ntheir day job? Could it be that perhaps the developer is a researcher (because of the\nway that they talk with others and provoke them)? Secondly, malware analysis is\nmentioned more than once and, thirdly, they said that they made an IDAPython script\nto remove all obfuscated code that the malware has (the ransomware may have got the\nname ‘Maze’ because of how analysis of it is like walking through a labyrinth). So, it\nmay be either a researcher who knows IDAPro very well or is an advanced developer\n(and the obfuscated code in Maze is very well done) or perhaps it is a developer that\nhas another job in normal life besides the creation of malware? Of course, these are\njust possibilities, not facts.\nThe malware developer achieved their goal with this interaction as their target audience\nsaw the answer and talked about their malware, as noted in the final line of their\nresponse “ …but you need to know that we love you researchers without you our job\nalso would be fuc**** boring as hell”.\n\nIt is curious that here they said “we” instead of “I” as before but perhaps they were talking\nabout all malware development?\n\nThe differences that these samples have are:\n\nUsually comes as a DLL instead of an EXE file. It does not run on Windows operating\nsystems older than Vista as this makes analysis harder. By using the malware as a\nDLL, they can inject this module into a target process more easily than if they use an\nEXE sample of the malware.\nInstead of deleting the “Shadow Volumes” the developers instead use WMIC with the\nspecial trick of the path as mentioned earlier, using WMIC classes to control the\nShadow Volumes. An example of this use can be seen in the next image.\n\n\n-----\n\nFIGURE 33. USING WMIC CLASSES IF NEEDED TO GET THE SHADOW VOLUMES\n\nEach sample of the malware uses different strings as PDB to send messages or to make the\nsample unique, for example:\n\nC:\\somerandomsh**\\sh**\\obama.pdb\nC:\\kill\\yourself\\<nickname>\\chinese\\idio*.pdb\n\n(In these examples some things were removed or changed to remove sensitive information\nin the report).\n\nThe new samples discovered in January 2020 make these connections to the C2 (or try to\nmake them):\n\n\n-----\n\nFIGURE 34. CONNECTIONS TO C2 IP OF THE NEW SAMPLES\n\nAs we can see, they are the same IPs as seen in the previous versions of the malware.\n\nThe samples’ compile dates are from the 24th of January 2020 (the first version with the\nstrings that provoked the researchers) to the 28th of January 2020 (the version with the\nanswers to the researchers), meaning they were made on the same day the responses to\nthe previous version were published on Twitter.\n\nAnother interesting fact from the later sample is that, besides it saying that the language\ncode used to program it was Korean, the IPs where it connects belong to the Russian\nFederation as before, as can be seen in the next two images.\n\n\n-----\n\nFIGURE 35. LANGUAGE CODE “USED” IN THE PACKER SAMPLE, NOT THE MALWARE\n\n\n-----\n\nFIGURE 36. ALL C2 DOMAINS BELONG TO THE RUSSIAN FEDERATION\n\nIt is impossible to know the truth, but this could be a trick to try misleading researchers into\nthinking that the malware comes from some country when in truth it originates in another. It is\nknown that malware developers often check the language on potential victim’s machines to\navoid the CIS countries, so we can guess that the check for the “Korean” language was a\ntrick designed to mislead, but it is impossible to know that for sure. Of course, the “Korean”\nlanguage can be changed manually, or it could be a Korean packer, but it is impossible to\nsay with certainty.\n\n## CONCLUSION\n\nMaze is a ransomware created by skilled developers. It uses a lot of tricks to make analysis\nvery complex by disabling disassemblers and using pseudocode plugins.\n\nIt poses a big problem to individuals and enterprises that do not pay as the developers\nthreaten to release the information if they do not receive payment and they do indeed keep\ntheir word on that. More and more ransomwares are exhibiting the same behavior and we\nexpect to see more of it this year and perhaps further into the future too.\n\nThe malware developers are active on social media sites, such as Twitter, and they are\nfamiliar with the work of malware researchers. They also know how to provoke them\nperfectly and they like to play cat and the mouse with them.\n\nWe recommend making periodic backups of files and keeping them isolated off the network\nand having an always updated antivirus in place. The latest software patch should also be\napplied. Remote Desktop Connections that are not needed should be avoided.\n\nAvoid suspicious emails and do not open attachments that come from anyone that you do\nnot know. The same goes for links in emails and, even if they come from a known source,\ncheck with the sender if you have any doubts. Also, disable macros in Office programs and\nnever enable them unless it is essential to do so.\n\n## COVERAGE\n\nMcAfee protects against this threat in all its products, including personal antivirus, endpoint\nand gateway.\n\nThe names that it can have are:\n\nRansom-Maze!<hash>\n\n## YARA RULE\n\n**rule maze_unpacked {**\n\n\n-----\n\n**meta:**\n\n**description = “Rule to detect unpacked Maze samples”**\n\n**author = “Marc Rivero | McAfee ATR Team”**\n\n**strings:**\n\n**$opcode_sequence = { 5589e583ec208b450c8b4d08c745fc00 }**\n\n**$opcode_sequence_2 = { 5589e553575683e4f883ec28c7042400 }**\n\n**$opcode_sequence_3 = { 5589e55dc3662e0f1f84000000000090 }**\n\n**$opcode_sequence_4 = { 5589e553575683e4f081ec600200008b }**\n\n**$opcode_sequence_5 = { 5589e553575683e4f081ecc00000000f }**\n\n**$opcode_sequence_6 = { 5589e583ec208b45108b4d0c8b550883 }**\n\n**$opcode_sequence_7 = { 5589e5575683ec388b45108b4d0c8b55 }**\n\n**$opcode_sequence_8 = { 5589e5575683e4f883ec088b45088b48 }**\n\n**$opcode_sequence_9 = { 558b6c241468997a41000f84bdc50000 }**\n\n**$opcode_sequence_10 = { 5589e553575683e4f883ec588b5d088b }**\n\n**$opcode_sequence_11 = { 5589e553575683e4f083ec408a42048b }**\n\n**$opcode_sequence_12 = { 5589e583ec188b4508837d08008945fc }**\n\n**$opcode_sequence_13 = { 5589e553575683e4f8b8d05b0000687f }**\n\n**$opcode_sequence_14 = { 5589e5508b450831c98945fc89c883c4 }**\n\n**$opcode_sequence_15 = { 5589e553575683e4f883ec708b5d0889 }**\n\n**$opcode_sequence_16 = { 5589e583ec308b45088b4d08894df883 }**\n\n**$opcode_sequence_17 = { 5589e553575683e4f881ec18030000f2 }**\n\n**$opcode_sequence_18 = { 5589e583ec188b45088b4d08894df48b }**\n\n**$opcode_sequence_19 = { 5589e583ec2056be74c14400566a0068 }**\n\n**$opcode_sequence_20 = { 5589e553575683e4f081ec900000008b }**\n\n**$opcode_sequence_21 = { 5589e583e4f083ec208b4d108b450c0f }**\n\n\n-----\n\n**$opcode_sequence_22 = { 5589e55383e4f883ec108b4d0c8b4508 }**\n\n**$opcode_sequence_23 = { 558b8e150409133f03fd08f81b0c4f22 }**\n\n**$opcode_sequence_24 = { 5589e553575683e4f883ec7031f68379 }**\n\n**$opcode_sequence_25 = { 5589e553575683e4f881ec3001000089 }**\n\n**$opcode_sequence_26 = { 5589e553575683e4f881ece00000000f }**\n\n**$opcode_sequence_27 = { 558b589608361d1943a57d0ba6492beb }**\n\n**$opcode_sequence_28 = { 5589e553575683e4f883ec1089ce6a00 }**\n\n**$opcode_sequence_29 = { 5589e5575683e4f883ec688b75088b7d }**\n\n**$opcode_sequence_30 = { 5589e553575683e4f883ec386a006a00 }**\n\n**$opcode_sequence_31 = { 558b7c240868dca8440057683d484300 }**\n\n**$opcode_sequence_32 = { 5589e55683e4f881ec2801000089ce8d }**\n\n**$opcode_sequence_33 = { 5589e583ec188b450831c98b5508c704 }**\n\n**$opcode_sequence_34 = { 5589e583ec308b450c8b4d088b55088b }**\n\n**$opcode_sequence_35 = { 5589e583ec348b450831c983c1188b55 }**\n\n**$opcode_sequence_36 = { 5589e553575683e4f881ec78040000f2 }**\n\n**$opcode_sequence_37 = { 5589e583ec108b4508837d08008945f8 }**\n\n**$opcode_sequence_38 = { 5589e583ec348b4508837d08008945dc }**\n\n**$opcode_sequence_39 = { 5589e55683ec548b45088b4d08894df0 }**\n\n**$opcode_sequence_40 = { 558bec5de9a48efeffe9ef8efeffcccc }**\n\n**$opcode_sequence_41 = { 5589e553575683ec108b45108b4d0c8b }**\n\n**$opcode_sequence_42 = { 5589e5575683ec348b4508c745f40100 }**\n\n**$opcode_sequence_43 = { 558bec8325a0c345000083ec1c5333db }**\n\n**$opcode_sequence_44 = { 5589e553575683e4f083ec208b750c0f }**\n\n**$opcode_sequence_45 = { 5589e583ec348b450c8b4d088b55088b }**\n\n**$opcode_sequence_46 = { 558b6fd8d843ef516154e2526781aecd }**\n\n\n-----\n\n**condition:**\n\n**( uint16(0) == 0x5a4d) and 38 of them**\n\n**}**\n\n## IOCs\n\n**Network**\n\nDomain     mazedecrypt.top\n\nIP           91.218.114.11\n\nIP           91.218.114.25\n\nIP           91.218.114.26\n\nIP           91.218.114.31\n\nIP           91.218.114.32\n\nIP           91.218.114.37\n\nIP           91.218.114.38\n\nIP           91.218.114.4\n\nIP           91.218.114.77\n\nIP           91.218.114.79\n\n## MITRE ATT&CK COVERAGE\n\nCommonlyUsedPort\nStandardApplicationLayerProtocol\nSecuritySoftwareDiscovery\n\n\n-----\n\nSystemTimeDiscovery\nCommandLineInterface\nDataEncrypted\nDataEncryptedForImpact\nQuery registry\nHooking\n\n[1] https://twitter.com/jeromesegura/status/1133767240686288896\n\n[2] https://www.bleepingcomputer.com/news/security/maze-ransomware-demands-6-millionransom-from-southwire/\n\n[3] https://www.bleepingcomputer.com/news/security/nemty-ransomware-to-start-leakingnon-paying-victims-data/\n\n[4] https://twitter.com/McAfee_Labs/status/1206651980086685696\n\n[5] https://www.bleepingcomputer.com/news/security/new-threat-actor-impersonates-govtagencies-to-deliver-malware/\n\n[6] https://securityintelligence.com/news/spelevo-ek-exploits-flash-player-vulnerability-todeliver-maze-ransomware/\n\n[7] https://github.com/revsic/AntiDebugging\n\n[8] https://ss64.com/locale.html\n\n[9] https://twitter.com/malwrhunterteam/status/1222253947332841472\n\n[10] https://twitter.com/luca_nagy_/status/1222819371644522500\n\n[Alexandre Mundo](https://www.mcafee.com/blogs/author/alexandre-mundo/)\nAlexandre Mundo, Senior Malware Analyst is part of Mcafee's Advanced Threat Research\nteam. He reverses the new threads in advanced attacks and make research of them in a\ndaily basis....\n\n### More from McAfee Labs\n\n[Crypto Scammers Exploit: Elon Musk Speaks on Cryptocurrency](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/crypto-scammers-exploit-talk-on-cryptocurrency/%20)\n\nBy Oliver Devane Update: In the past 24 hours (from time of publication) McAfee has\nidentified 15...\n\nMay 05, 2022 |  4 MIN READ\n\n[Instagram Credentials Stealer: Disguised as Mod App](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/instagram-credentials-stealer-disguised-as-mod-app/%20)\n\n\n-----\n\nAuthored by Dexter Shin McAfee s Mobile Research Team introduced a new Android\nmalware targeting Instagram users who...\n\nMay 03, 2022 |  4 MIN READ\n\n[Instagram Credentials Stealers: Free Followers or Free Likes](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/instagram-credentials-stealers-free-followers-or-free-likes/%20)\n\nAuthored by Dexter Shin Instagram has become a platform with over a billion monthly active\nusers. Many...\n\nMay 03, 2022 |  6 MIN READ\n\n[Scammers are Exploiting Ukraine Donations](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/scammers-are-exploiting-ukraine-donations/%20)\n\nAuthored by Vallabh Chole and Oliver Devane Scammers are very quick at reacting to\ncurrent events, so...\n\nApr 01, 2022 |  7 MIN READ\n\n[Imposter Netflix Chrome Extension Dupes 100k Users](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/imposter-netflix-chrome-extension-dupes-100k-users/%20)\n\nAuthored by Oliver Devane, Vallabh Chole, and Aayush Tyagi McAfee has recently\nobserved several malicious Chrome Extensions...\n\nMar 10, 2022 |  8 MIN READ\n\n\n-----\n\n[Why Am I Getting All These Notifications on my Phone?](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/why-am-i-getting-all-these-notifications-on-my-phone/%20)\n\nAuthored by Oliver Devane and Vallabh Chole  Notifications on Chrome and Edge, both\ndesktop browsers, are commonplace,...\n\nFeb 25, 2022 |  5 MIN READ\n\n[Emotet’s Uncommon Approach of Masking IP Addresses](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/emotets-uncommon-approach-of-masking-ip-addresses/%20)\n\nIn a recent campaign of Emotet, McAfee Researchers observed a change in techniques. The\nEmotet maldoc was...\n\nFeb 04, 2022 |  4 MIN READ\n\n[HANCITOR DOC drops via CLIPBOARD](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/hancitor-doc-drops-via-clipboard/%20)\n\nHancitor, a loader that provides Malware as a Service, has been observed distributing\nmalware such as FickerStealer,...\n\nDec 13, 2021 |  6 MIN READ\n\n\n-----\n\n[‘Tis the Season for Scams](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/tis-the-season-for-scams/%20)\n\n‘Tis the Season for Scams\n\nNov 29, 2021 |  18 MIN READ\n\n[The Newest Malicious Actor: “Squirrelwaffle” Malicious Doc.](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/the-newest-malicious-actor-squirrelwaffle-malicious-doc/%20)\n\nAuthored By Kiran Raj Due to their widespread use, Office Documents are commonly used\nby Malicious actors...\n\nNov 10, 2021 |  4 MIN READ\n\n[Social Network Account Stealers Hidden in Android Gaming Hacking Tool](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/social-networks-account-stealer-hidden-in-android-gaming-hacking-tool/%20)\n\nAuthored by: Wenfeng Yu McAfee Mobile Research team recently discovered a new piece of\nmalware that specifically...\n\nOct 19, 2021 |  6 MIN READ\n\n\n-----\n\n[Malicious PowerPoint Documents on the Rise](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/malicious-powerpoint-documents-on-the-rise/%20)\n\nAuthored by Anuradha M McAfee Labs have observed a new phishing campaign that utilizes\nmacro capabilities available...\n\nSep 21, 2021 |  6 MIN READ\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-26 - Ransomware Maze.pdf"
    ],
    "report_names": [
        "2020-03-26 - Ransomware Maze.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535742,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653754621,
    "ts_modification_date": 1653754621,
    "files": {
        "pdf": "https://archive.orkl.eu/22ce01519f8dc0e78df8b5678e756936306bf73d.pdf",
        "text": "https://archive.orkl.eu/22ce01519f8dc0e78df8b5678e756936306bf73d.txt",
        "img": "https://archive.orkl.eu/22ce01519f8dc0e78df8b5678e756936306bf73d.jpg"
    }
}