{
    "id": "8edcf41e-31d5-4aa4-8675-e19e77f8e1ce",
    "created_at": "2023-01-12T15:06:03.179751Z",
    "updated_at": "2025-03-27T02:06:13.827319Z",
    "deleted_at": null,
    "sha1_hash": "10d29167582e65e77b0de8dd5e57486b4be4a897",
    "title": "2022-04-11 - Fakecalls- a talking Trojan",
    "authors": "",
    "file_creation_date": "2022-05-28T01:55:40Z",
    "file_modification_date": "2022-05-28T01:55:40Z",
    "file_size": 1036888,
    "plain_text": "# Fakecalls: a talking Trojan\n\n**kaspersky.com/blog/fakecalls-banking-trojan/44072/**\n\nandroid\n\nA Trojan that masquerades as a banking app and imitates phone conversations with bank\nemployees.\n\n[Igor Golovin](https://www.kaspersky.com/blog/author/igorgolovin/)\n\nApril 11, 2022\n\nCybercriminals are always coming up with ever more sophisticated malware. Last year, for\nexample, saw the appearance of an unusual banking Trojan called Fakecalls. Besides the\nusual spying features, it has an interesting ability to “talk” with the victim in the guise of a\nbank employee. There is little information about Fakecalls online, so we decided to shed\nsome light on its capabilities.\n\n\n-----\n\n## Trojan in disguise\n\nFakecalls mimics the mobile apps of popular Korean banks, among them KB (Kookmin\nBank) and KakaoBank. Curiously, in addition to the usual logos, the Trojan’s creators display\nthe support numbers of the respective banks on the Fakecalls screen. These phone numbers\nappear to be real — the number 1599-3333, for instance, can be found on the main page of\nthe KakaoBank official website.\n\nThe Trojan imitates the KB (left) and KakaoBank (right) banking apps\n\nWhen installed, the Trojan immediately requests a whole host of permissions, including\naccess to contacts, microphone and camera, geolocation, call handling, and so on.\n\n## Calling the bank\n\nUnlike other banking Trojans, Fakecalls can imitate phone conversations with customer\nsupport. If the victim calls the bank’s hotline, the Trojan discreetly breaks the connection and\nopens its own fake call screen instead of the regular calling app. The call appears to be\nnormal but in fact the attackers are now in control\n\n\n-----\n\nThe only thing that might give away the Trojan at this stage is the fake call screen. Fakecalls\nhas only one interface language: Korean. This means that if another system language is\nselected on the phone — say, English — the victim will likely smell a rat.\n\nAfter the call is intercepted, there are two possible scenarios. In the first, Fakecalls connects\nthe victim directly with the cybercriminals, since the app has permission to make outgoing\ncalls. In the second, the Trojan plays prerecorded audio imitating the standard greeting from\nthe bank.\n\n\n-----\n\nFakecalls code fragment that plays prerecorded audio during an outgoing call\n\nSo that the Trojan maintains a realistic dialogue with the victim, the cybercriminals have\nrecorded several phrases (in Korean) typically uttered by voicemail or call-center employees.\nFor example, the victim might hear something like this: “Hello. Thank you for calling\nKakaoBank. Our call center is currently receiving an unusually large volume of calls. A\nconsultant will speak to you as soon as possible. <...> To improve the quality of the service,\nyour conversation will be recorded.” Or: “Welcome to Kookmin Bank. Your conversation will\nbe recorded. We will now connect you with an operator.”\n\nAfter that, the attackers, under the guise of a bank employee, can try to coax payment data\nor other confidential information out of the victim.\n\n\n-----\n\nBesides outgoing calls, Fakecalls can spoof incoming calls as well. When the cybercriminals\nwant to contact the victim, the Trojan displays its own screen over the system one. As a\nresult, the user sees not the real number used by the cybercriminals, but the one shown by\nthe Trojan, such as the phone number of the bank’s support service.\n\n## Spyware toolkit\n\nIn addition to mimicking telephone customer support, Fakecalls has features more typical of\nbanking Trojans. For example, at the attackers’ command, the malware can turn on the\nvictim’s phone’s microphone and send recordings from it to their server, as well as secretly\nbroadcast audio and video from the phone in real time.\n\nThat’s not all. Remember the permissions the Trojan asked for during installation? The\ncybercriminals can use them to determine the device’s location, copy the contacts list or files\n(including photos and videos) from the phone to their server, and access the call and text\nmessage history.\n\nThese permissions allow the malware not only to spy on the user, but to control their device\nto a certain extent, giving the Trojan the ability to drop incoming calls and delete them from\nthe history. This allows the scammers, among other things, to block and hide real calls from\nbanks.\n\nKaspersky solutions detect this malware with the verdict TrojanBanker.AndroidOS.Fakecalls, and safeguards the device.\n\n## How to stay protected\n\nTo prevent your personal data and money from falling into cybercriminal hands, follow these\nsimple tips:\n\nDownload apps only from official stores and do not allow installations from unknown\nsources. Official stores run checks on all programs, and even if malware still sneaks in,\nit usually gets promptly removed.\nPay attention to [what permissions apps ask for and whether they really need them.](https://www.kaspersky.com/blog/android-8-permissions-guide/23981/)\nDon’t be afraid to deny permissions, especially potentially dangerous ones like access\nto calls, text messages, accessibility and so on.\nNever give confidential information over the phone. Real bank employees will never\nask for your online banking login credentials, PIN, card security code or confirmation\ncodes from text messages. If in doubt, go to the bank’s official website and find out\nwhat employees can and cannot ask about.\nInstall a [robust solution that protects all your devices from banking Trojans and other](https://www.kaspersky.com/internet-security?icid=gl_kdailyplacehold_acq_ona_smm__onl_b2c_kasperskydaily_wpplaceholder____kismd___)\nmalware.\n\n[android](https://www.kaspersky.com/blog/tag/android/)\n\n\n-----\n\n[banking trojans](https://www.kaspersky.com/blog/tag/banking-trojans/)\n[mobile devices](https://www.kaspersky.com/blog/tag/mobile-devices/)\n[permissions](https://www.kaspersky.com/blog/tag/permissions/)\n\nShare article\n\nRelated\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-11 - Fakecalls- a talking Trojan.pdf"
    ],
    "report_names": [
        "2022-04-11 - Fakecalls- a talking Trojan.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535963,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1653702940,
    "ts_modification_date": 1653702940,
    "files": {
        "pdf": "https://archive.orkl.eu/10d29167582e65e77b0de8dd5e57486b4be4a897.pdf",
        "text": "https://archive.orkl.eu/10d29167582e65e77b0de8dd5e57486b4be4a897.txt",
        "img": "https://archive.orkl.eu/10d29167582e65e77b0de8dd5e57486b4be4a897.jpg"
    }
}