{
    "id": "8ee238bd-85e3-4872-9e50-e588e7b84d34",
    "created_at": "2023-01-12T15:00:50.188151Z",
    "updated_at": "2025-03-27T02:05:21.614737Z",
    "deleted_at": null,
    "sha1_hash": "6bed0fff71113d9ac9629fa4255461a211e14eac",
    "title": "2021-08-10 - Fast Insights for a Microsoft-Signed Netfilter Rootkit",
    "authors": "",
    "file_creation_date": "2022-05-28T15:12:47Z",
    "file_modification_date": "2022-05-28T15:12:47Z",
    "file_size": 4080498,
    "plain_text": "# Fast Insights for a Microsoft-Signed Netfilter Rootkit\n\n**[intezer.com/blog/malware-analysis/fast-insights-for-a-microsoft-signed-netfilter-rootkit/](https://www.intezer.com/blog/malware-analysis/fast-insights-for-a-microsoft-signed-netfilter-rootkit/)**\n\nAugust 10, 2021\n\nWritten by Giancarlo Lezama - 10 August 2021\n\n### Get Free Account\n\nJoin Now\n\n## Automate malware analysis of Netfilter rootkit and other advanced threats. Obtain deep insights without long, manual effort.\n\n[News broke in June about a malicious Netfilter rootkit signed by Microsoft. This was](https://www.gdatasoftware.com/blog/microsoft-signed-a-malicious-netfilter-rootkit)\nsignificant in that Windows machines only run drivers with valid signatures. Since drivers\ncan obtain the maximum level of permissions on a machine, they are gold for any threat\nactor who can obtain such access.\n\n\n-----\n\nThanks to malware analysts like Karsten Hahn, additional samples of this malware dating\nback to March were uncovered, along with details on how they operate. Let’s look at the\n[genetic analysis of these samples to see how you can quickly identify them as Netfilter](https://analyze.intezer.com/families/51348050-105b-400a-84e1-18d80e8852c8)\nrootkit, as well as understand their capabilities and obtain similar artifacts despite the valid\nsignature.\n\nThe Netfilter rootkit was found in a driver signed by Microsoft. This rare technique bypasses\ndefenses, such as Antivirus tools, by making the file appear legitimate, despite the fact that\nit is tampered with malicious code. Obfuscated strings were also found in this file, which is\nvery uncommon for a legitimate file. When the file is executed, other URLs can be\nidentified, each with a specific purpose, including redirecting infected endpoints to other IP\naddresses; for self-updating the malware and receiving the valid root certificate.\n\nDetection of malware with valid signatures is challenging. Since these samples are signed\nlegitimately by Microsoft, even Antivirus software can be fooled into trusting them. An\nanalyst could try investigating the abnormal network connections made to the URLs during\nexecution. The URLs might be useful for this variant but there is no way of telling what\nchanges could be made to URLs in future malware variants, or whether the external server\nthe rootkit connects to is hidden from network detection tools through methods such as\nDynDNS or proxies. Not to mention, how do you know the full extent of the capabilities in\nthe driver? Once a rootkit is executed, it will totally own a machine with maximum\npermissions, hiding its activities from even endpoint detection solutions.\n\nLet’s take a look at the [analysis of the Netfilter Dropper sample referenced in the](https://analyze.intezer.com/files/d64f906376f21677d0585e93dae8b36248f94be7091b01fd1d4381916a326afe)\naforementioned article.\n\n\n-----\n\nWith Intezer Analyze you can analyze malware threats in seconds, with every tool you need\nto do so in one place: genetic code analysis, sandboxing, memory analysis and static\n_analysis._\n\nThe original file is classified as Netfilter rootkit, where an analysis of the code finds that the\nfile shares 41 code genes, or about 81% of its code (click Show common code), with\npreviously identified Netfilter rootkit samples. It is clear that although the uploaded dropper\nhas a valid signature, the code itself is identified as malicious and belongs to the Netfilter\nrootkit.\n\nSometimes, an analysis isn’t always this easy. Files can be obfuscated by being packed,\nencoded, or delivered in the form of installers. For this reason, Intezer also has the ability to\nstatically extract relevant files packed in the original file, as well as dynamically execute the\noriginal file in order to see how it executes. In this particular analysis, the driver is\nembedded in the dropper, which gets dropped onto the disk during execution in the\nsandbox.\n\n\n-----\n\nWith Intezer Analyze you don’t get a blackbox. Instead, you can see exactly in which\nmalware samples the malicious Netfilter rootkit code of the dropper (as well as the dropped\nfiles) have been seen before.\n\n\n-----\n\nIntezer s sandboxing capabilities capture what the file did during execution within the\ncontext of the MITRE ATT&CK® framework. This provides an immediate sense of what\nsuspicious or malicious activity the file is capable of in order to help you assess the risk.\nThe highest risk behavior found in this file is the ability to persist on an endpoint by making\nadjustments to the Windows Registry.\n\nAnother interesting behavior is the resulting network activity from the file’s execution,\nproviding us with network IoCs for this file. These network IoCs, along with the file’s IoCs\nuncovered when the file was executed or via static extraction, make up the full list of IoCs\nshown in a separate tab for ease of access.\n\nThe network IoCs are identical to the ones provided in the GData article, each with a\ndistinct purpose as mentioned.\n\n\n-----\n\nTo summarize, there is a lot of information related to the investigation of this malware that\ncan be easily extracted through genetic code analysis and other fundamental techniques\nwith Intezer ‘s [malware analysis tool.](https://www.intezer.com/intezer-analyze/)\n\nConsider that most malware must evolve into new variants in order to evade detection but\ntheir code mostly remains the same. Behavioral analysis and signatures can be evaded by\nadvanced malware like this Netfilter rootkit, but the code doesn’t lie.\n\nIntezer Analyze covers every malware-related incident. Scan files, live machines, memory\n[dumps and URLs (coming soon) to get fast verdicts, TTPs, IoCs and more. Sign up for free](http://analyze.intezer.com/)\nand start with 50 file uploads per month.\n\n**Giancarlo Lezama**\nGiancarlo is an experienced cybersecurity solutions architect. He has helped demonstrate,\narchitect, and deploy security solutions for organizations across various industries.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-10 - Fast Insights for a Microsoft-Signed Netfilter Rootkit.pdf"
    ],
    "report_names": [
        "2021-08-10 - Fast Insights for a Microsoft-Signed Netfilter Rootkit.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535650,
    "ts_updated_at": 1743041121,
    "ts_creation_date": 1653750767,
    "ts_modification_date": 1653750767,
    "files": {
        "pdf": "https://archive.orkl.eu/6bed0fff71113d9ac9629fa4255461a211e14eac.pdf",
        "text": "https://archive.orkl.eu/6bed0fff71113d9ac9629fa4255461a211e14eac.txt",
        "img": "https://archive.orkl.eu/6bed0fff71113d9ac9629fa4255461a211e14eac.jpg"
    }
}