{
    "id": "8f01a3d4-61fe-43a6-a6d8-39e676b4a88d",
    "created_at": "2023-01-12T15:02:00.373549Z",
    "updated_at": "2025-03-27T02:09:29.134615Z",
    "deleted_at": null,
    "sha1_hash": "420d92c854fd9b2e27918fa26e16c4c7a200dbea",
    "title": "2021-02-03 - Findings From Our Ongoing Investigations",
    "authors": "",
    "file_creation_date": "2022-05-28T17:54:01Z",
    "file_modification_date": "2022-05-28T17:54:01Z",
    "file_size": 193882,
    "plain_text": "# Findings From Our Ongoing Investigations\n\n**[orangematter.solarwinds.com/2021/02/03/findings-from-our-ongoing-investigations/](https://orangematter.solarwinds.com/2021/02/03/findings-from-our-ongoing-investigations/)**\n\nFebruary 3, 2021\n\nSolarWinds was one of a growing number of targets of a highly sophisticated, broad, and\ncoordinated nation-state cyber operation that compromised multiple software and hardware\ncompanies. Along with our partners in industry and government, we believe other additional\nattack vectors unrelated to SolarWinds will continue to come to light over the coming weeks.\nThis nation-state operation was a broad-based attack on the IT infrastructure on which we all\nrely. According to the Cybersecurity and Infrastructure Security Agency (CISA), other\ncompanies were compromised before the impacted versions of the Orion Platform were\ndeployed to customers last year. Given its breadth, CISA’s acting director, Brandon Wales,\ntold the _[Wall Street Journal recently that “this campaign should not be thought of as the](https://www.wsj.com/articles/suspected-russian-hack-extends-far-beyond-solarwinds-software-investigators-say-11611921601)_\nSolarWinds campaign.” We’ve committed to sharing what we learn from this experience and\ncontinuing to fortify our systems as we work closely with our customers to protect their\nsystems. This operation, however, highlights the need for enhanced collaboration within the\nindustry to collectively improve how we prevent, manage, and remediate these kinds of\nthreats and operations in the future. It also underscores the need for deeper public and\nprivate partnerships to create a more secure environment for everyone. As SolarWinds\ncontinues collaborating with private experts, law enforcement, and government agencies to\ninvestigate the attacks, we’re exploring several potential theories about how the threat actors\nwere able to enter and access our environment, and what actions the threat actors took once\ninside. Together with our third-party forensic investigators, we’re pursuing numerous theories\nbut currently believe the most likely attack vectors came through a compromise of\n\n\n-----\n\ncredentials and/or access through a third-party application via an at the time zero-day\nvulnerability. Investigations are still ongoing and given the sophistication of these attacks and\nthe actions taken by the threat actors to manipulate our environment and remove evidence of\ntheir activities, combined with the large volumes of log and other data to analyze, our\ninvestigations will be ongoing for at least several more weeks, and possibly months. As we\n[previously shared, FireEye contacted us December 12, 2020 regarding malicious code that](https://orangematter.solarwinds.com/2020/12/17/solarwinds-update-on-security-vulnerability/)\nwas identified in the SolarWinds Orion Platform. Additionally, Microsoft notified us December\n13, 2020 about a compromise related to our Office 365 environment. We’ve analyzed data\nfrom multiple systems and logs, including from our Office 365 and Azure tenants, along with\nlogs from SolarWinds Security Event Manager, and our build environment platforms. As\npreviously reported, this analysis has determined threat actors gained unauthorized access\nto our environment and conducted reconnaissance prior to the trial conducted on our Orion\nPlatform software build in October 2019. We have not yet determined the exact date that the\nthreat actors first gained unauthorized access to our environments. While we’ve confirmed\nsuspicious activity related to our Office 365 environment, our investigation has not identified\na specific vulnerability in Office 365 that would have allowed the threat actor to enter our\nenvironment through Office 365. We’ve confirmed that a SolarWinds email account was\ncompromised and used to programmatically access accounts of targeted SolarWinds\npersonnel in business and technical roles. By compromising credentials of SolarWinds\nemployees, the threat actors were able to gain access to and exploit our Orion development\nenvironment. Research community investigations have highlighted these nation-state\noperators displayed determination, patience, extremely high operational security (OpSec),\nand advanced tactics, techniques, and procedures (TTPs). As part of our commitment to\nensuring the industry has a more complete understanding of the increasingly sophisticated\nand organized threats, we’re sharing these examples that come from the cybersecurity\nresearch community and our investigations:\n\nVariation and/or disabling of audit logs, timestamps, and other security measures;\nManipulation of software builds through reusable automated processes and\ndeployment of novel, sophisticated malware to effect exploitation and malicious goals;\nModification through laundering of legitimate code from malicious code injection\n(SUNSPOT) and monitoring of disk space and activities before executing or creating\nfiles;\nDeletion of files and programs following use to avoid forensic discovery and\nmasquerading of file names and activity to mimic legitimate applications and files;\nVariation of file names and other indicators across victims and within environments and\nactive reconnaissance of victim environments and users for indicia of detection; and\nAutomated dormancy periods of two weeks or more prior to activation, utilization of\nservers outside the monitoring authority of U.S. intelligence.\n\nWe are committed to sharing information openly in order to help the industry guard against\nsimilar attacks in the future and create safer environments for customers. For instance, given\nthat software development and build processes are generally quite common throughout the\nindustry, we promptly shared information about the novel malicious code injector\n\n\n-----\n\n(SUNSPOT) we found so that other companies could check their software build\nenvironments and make any updates necessary to protect themselves. We published these\ndetails about the build manipulation activity in our January 11 [blog post. Our partner](https://orangematter.solarwinds.com/2021/01/11/new-findings-from-our-investigation-of-sunburst/)\n[CrowdStrike also published additional details related to this activity in a blog post published](https://www.crowdstrike.com/blog/sunspot-malware-technical-analysis/)\nthe same day. We continue to put a priority on our investigations to ensure we fully\nunderstand all elements of this sophisticated attack and can share our learnings with our\ncustomers and the broader community. We firmly believe the best way for the industry to\nprepare for and prevent attacks of these types in the future is to communicate openly and\nwork together. *********************************************************************** This Blog Post\n_contains “forward-looking” statements, which are subject to the safe harbor provisions of the_\n_Private Securities Litigation Reform Act of 1995, as well as statements regarding_\n_SolarWinds’ investigation into the recent SUBURST attack, the high-level timeline provided_\n_above and the company’s findings to date, SolarWinds’ understanding of the nature, source_\n_and duration of the attack and SolarWinds’ plans to further investigate the attack, ensure our_\n_products and internal systems are secure and provide information regarding its findings. The_\n_information in this Blog Post is based on management's beliefs and assumptions and on_\n_information currently available to management, which may change as SolarWinds continues_\n_to address the vulnerability in its products, investigate the SUNBURST attack and related_\n_matters and as new or different information is discovered about these matters or generally._\n_Forward-looking statements include all statements that are not historical facts and may be_\n_identified by terms such as \"aim,\" \"anticipate,\" \"believe,\" \"can,\" \"could,\" \"seek,\" \"should,\"_\n_\"feel,\" \"expect,\" \"will,\" \"would,\" \"plan,\" \"intend,\" \"estimate,\" \"continue,\" \"may,\" or similar_\n_expressions and the negatives of those terms. Forward-looking statements involve known_\n_and unknown risks, uncertainties and other factors that may cause actual results,_\n_performance or achievements to be materially different from any future results, performance_\n_or achievements expressed or implied by the forward-looking statements. Factors that could_\n_cause or contribute to such differences include, but are not limited to, (a) the discovery of_\n_new or different information regarding the SUNBURST attack and related security incidents_\n_or of additional vulnerabilities within, or attacks on, SolarWinds’ products, services and_\n_systems, (b) the possibility that SolarWinds’ mitigation and remediation efforts with respect to_\n_the SUNBURST attack and related security incidents may not be successful, (c) the_\n_possibility that customer, personnel or other data was exfiltrated as a result of the_\n_SUNBURST attack and related security incidents, (d) numerous financial, legal, reputational_\n_and other risks to SolarWinds related to the SUNBURST attack and related security_\n_incidents, including risks that the incidents may result in the loss, compromise or corruption_\n_of data, loss of business, severe reputational damage adversely affecting customer or_\n_vendor relationships and investor confidence, U.S. or foreign regulatory investigations and_\n_enforcement actions, litigation, indemnity obligations, damages for contractual breach,_\n_penalties for violation of applicable laws or regulations, significant costs for remediation and_\n_the incurrence of other liabilities, (e) risks that SolarWinds’ insurance coverage, including_\n_coverage relating to certain security and privacy damages and claim expenses, may not be_\n_available or sufficient to compensate for all liabilities SolarWinds incurs related to these_\n\n\n-----\n\n_matters, (f) the possibility that SolarWinds steps to secure its internal environment, improve_\n_its product development environment and ensure the security and integrity of the software_\n_that it delivers to customers may not be successful or sufficient to protect against threat_\n_actors or cyberattacks and (g) such other risks and uncertainties described more fully in_\n_documents filed with or furnished to the U.S. Securities and Exchange Commission by_\n_SolarWinds, including the risk factors discussed in SolarWinds’ Annual Report on Form 10-K_\n_for the period ended December 31, 2019 filed on February 24, 2020, its Quarterly Report on_\n_Form 10-Q for the quarter ended March 31, 2020 filed on May 8, 2020, its Quarterly Report_\n_on Form 10-Q for the quarter ended June 30, 2020 filed on August 10, 2020 and its Quarterly_\n_Report on Form 10-Q for the quarter ended September 30, 2020 filed on November 5, 2020._\n_All information provided in this Blog Post is as of the date hereof and SolarWinds undertakes_\n_no duty to update this information except as required by law._\n\nSudhakar Ramakrishna\n\nSudhakar Ramakrishna joined SolarWinds as President and Chief Executive Officer in\nJanuary 2021. He is a global technology leader with nearly 25 years of experience…\n\n[Read more](https://orangematter.solarwinds.com/author/sudhakar-ramakrishna/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-03 - Findings From Our Ongoing Investigations.pdf"
    ],
    "report_names": [
        "2021-02-03 - Findings From Our Ongoing Investigations.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8a33d3ac-14ba-441c-92c1-39975e9e1a73",
            "created_at": "2023-01-06T13:46:39.195689Z",
            "updated_at": "2025-03-27T02:00:03.01861Z",
            "deleted_at": null,
            "main_name": "Ghostwriter",
            "aliases": [
                "PUSHCHA",
                "Storm-0257",
                "DEV-0257",
                "UAC-0057",
                "UNC1151",
                "TA445"
            ],
            "source_name": "MISPGALAXY:Ghostwriter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "119c8bea-816e-4799-942b-ff375026671e",
            "created_at": "2022-10-25T16:07:23.957309Z",
            "updated_at": "2025-03-27T02:02:10.048343Z",
            "deleted_at": null,
            "main_name": "Operation Ghostwriter",
            "aliases": [
                "DEV-0257",
                "Operation Asylum Ambuscade",
                "PUSHCHA",
                "Storm-0257",
                "TA445",
                "UAC-0051",
                "UAC-0057",
                "UNC1151"
            ],
            "source_name": "ETDA:Operation Ghostwriter",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "HALFSHELL",
                "Impacket",
                "RADIOSTAR",
                "VIDEOKILLER",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535720,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653760441,
    "ts_modification_date": 1653760441,
    "files": {
        "pdf": "https://archive.orkl.eu/420d92c854fd9b2e27918fa26e16c4c7a200dbea.pdf",
        "text": "https://archive.orkl.eu/420d92c854fd9b2e27918fa26e16c4c7a200dbea.txt",
        "img": "https://archive.orkl.eu/420d92c854fd9b2e27918fa26e16c4c7a200dbea.jpg"
    }
}