{
    "id": "8f18e1d7-60ed-4c85-ac93-f92a577a1c66",
    "created_at": "2023-01-12T15:04:41.626077Z",
    "updated_at": "2025-03-27T02:16:28.830357Z",
    "deleted_at": null,
    "sha1_hash": "5cb9e250f30955fa97dc5fafde1238350ebb57b9",
    "title": "2020-03-31 - Storm Cloud Unleashed- Tibetan Focus of Highly Targeted Fake Flash Campaign",
    "authors": "",
    "file_creation_date": "2022-05-28T18:08:17Z",
    "file_modification_date": "2022-05-28T18:08:17Z",
    "file_size": 1477835,
    "plain_text": "# Storm Cloud Unleashed: Tibetan Focus of Highly Targeted Fake Flash Campaign\n\n**[volexity.com/blog/2020/03/31/storm-cloud-unleashed-tibetan-community-focus-of-highly-targeted-fake-flash-campaign/](https://www.volexity.com/blog/2020/03/31/storm-cloud-unleashed-tibetan-community-focus-of-highly-targeted-fake-flash-campaign/)**\n\nMarch 31, 2020\n\nby Volexity Threat Research\n\nBeginning in May 2019, Volexity started tracking a new series of strategic web compromises that\nhave been used in highly targeted attacks against Tibetan individuals and organizations by a\nChinese advanced persistent threat (APT) actor it tracks as Storm Cloud. While this threat\nactivity appears to have started in mid-2019, Storm Cloud has been observed targeting Tibetan\norganizations since at least 2018. The attacks were launched at a very limited subset of visitors to\nover two dozen different Tibetan websites that Storm Cloud had managed to compromise.\n[Kaspersky has noted they uncovered similar targeted attacks dating back to mid-2019.](https://securelist.com/holy-water-ongoing-targeted-water-holing-attack-in-asia/96311/)\n\nUnlike strategic web compromises of the past, this attack activity did not rely on or use exploits.\nInstead, the attackers relied on enticing targeted users to install an \"update to Adobe Flash\" by\nway of a JavaScript overlay on top of the legitimate compromised websites. While there is no\nrelation between the activities and those of OceanLotus, this type of attack is similar to how\n[OceanLotus was observed launching targeted attacks.](https://www.volexity.com/blog/2017/11/06/oceanlotus-blossoms-mass-digital-surveillance-and-exploitation-of-asean-nations-the-media-human-rights-and-civil-society/)\n\n## Delivery Overview\n\n\n-----\n\nFor the attack to begin, an unsuspecting user must first visit one of the compromised sites that\nhas been put into operation by Storm Cloud. These attacks involve adding a new piece of\nJavaScript to the infected sites with an innocuous looking name, for example “jquery-min.js”. The\nfilename used varied between different compromised sites.\n\nThis sample of code is obfuscated using a library called “sojson.v4” which is also used by\n[legitimate developers to protect their intellectual property; you can find the obfuscator here. This](https://www.sojson.com/charEncode.html)\ninitial obfuscated code is recognizable due to its opening text:\n\n_Figure 1 . An example of the initial JavaScript loaded on compromised pages._\n\nThe purpose of this first script in the chain is to identify if the user in question should receive the\nsecond piece of JavaScript. The internal IP address is retrieved based on the well-documented\nWebRTC trick, while the external IP address is retrieved using api.ipify.org. This information is\nthen sent to an attacker-owned server used solely for this purpose, which will respond with a\nsuccess or fail. A helper script to de-obfuscate these scripts is provided in Appendix B.\n\nSuccess is denoted by a response of “t” from the server. If this response is given then a\nsecondary piece of JavaScript is loaded. The logic described above is shown in Figure 2.\n\n\n-----\n\n_Figure 2. A beautified version of the initial script shows the logic that decides whether to load the_\n_next JavaScript file._\n\n## Convincing Users to Install the Payload\n\n[The next sample of JavaScript uses sojson.v5, this time using the v5 encryption mechanism,](https://www.sojson.com/jsobfuscator.html)\nidentifiable by appearance as shown in Figure 3.\n\n_Figure 3. The secondary JavaScript which delivers the payload is encrypted with sojson.v5._\n\nSojson.v5 RC4 encrypts strings using a unique key for each string. These strings can be decoded\non a per-script basis in a programmatic way to understand the overall workflow of the code. Since\nthis campaign does not use any exploits, the purpose of the second stage code is to convince\nusers to install the malware by altering the web page to show a popup or otherwise manipulating\nthe visited page to alert the user to update Adobe Flash Player. In order to create these popups,\n[Storm Cloud installed SweetAlerts on each of the webservers they compromised.](https://sweetalert.js.org/)\n\nSince the first time Volexity observed this chain in May 2019, the code that creates this download\ndialogue has evolved from iteration to iteration. In the earliest versions, the attackers had a fairly\nbasic way of displaying and showing the message. Over time, this code evolved to support\nmultiple browsers, including mobile devices, with customized messages according to the browser\nused. Despite the support of mobile devices in the code, Volexity has only identified delivery of\nWindows payloads for this particular aspect of the campaign. A comparison of earlier and later\nversions of the splash screens presented are given in Figure 4.\n\n\n-----\n\n_Figure 4. Examples of splash screens presented to users visiting compromised sites in order to_\n_convince them to download and install malware._\n\n\n-----\n\nFor most of the campaign, the attackers used GitHub to host the malicious Flash installer.\nSpecifically, Volexity has observed the following repositories used to host binaries:\n\ngithub.com/AdobeFlash32/ (this repository has since been removed from GitHub)\ngithub.com/AlexanderHilton/\n\nIt's unclear what the rationale for using GitHub was; however, for a user who isn’t familiar with\nGitHub, a quick search for “GitHub” may help convince them that the download is authentic. After\nthe main GitHub account was in use, the attackers switched to hosting their payloads on various\nDynamic DNS hosts from changeip.com to host their payloads (these are given in Appendix A).\n\nIn addition to hosting payloads for this campaign, the AlexanderHilton repository also contains a\ncertificate related to Indian telecommunications company BSNL; Volexity does not have any\nfurther insight as to the use or origin of this certificate.\n\n## Payloads\n\nOver time, Volexity was able to observe a wide variety of payloads distributed using the\nmechanism described above, with the attackers frequently changing the malware they used.\n\nBelow are some of the payloads seen from the live campaigns, and the frequency with which they\nhave been observed:\n\n### SIMPLE DOWNLOADERS\n\n**# Samples** 7\n\n**First Seen:** 2019-05-05\n\n**Last Seen:** 2020-01-20\n\n\n**Example**\n**Hash:**\n\n\nb658a0b0b5cce77ce073d857498a474044657daec50c3c246f661f3790a28b13\n\n\nOn a number of occasions, the attackers employed simple downloaders compiled as NSIS scripts,\nwritten in GoLang or compiled with Py2Exe. The sole objective of these downloaders is to\ndownload and execute a further payload from a remote C2. As such, they are not worth\ndescribing in detail. In some cases, the payload downloaded was GOSLU which is described\nlater.\n\n### PLUGDAT\n\n**# Samples:** 1\n\n**First Seen:** 2019-06-19\n\n**Last Seen:** 2019-06-19\n\n\n-----\n\n**Example**\n**Hash:**\n\n\nec377ad3defd360c7c7f9c4f4d94188739bdb8ad82b2ea7d94725c68dc2838d9\n\n\nThis is a plugin-based backdoor written in C++.\n\nThe malware performs an initial check to see if the infected machine is already infected (based on\nthe mutex 'Fourhdsjfhakj'). The malware also performs initial checks to determine if the infected\nsystem is a client, a Windows server that is not a domain controller, or a Windows server that is a\ndomain controller. In addition to the system type, the system's hostname and exact Windows\nversion, including the build number, are also collected.\n\nIt connects to a pre-configured C2 to download a plugin which it expects to return an encoded PE\nfile which is decoded by the malware. The decoded PE file should be a DLL file with exports\nmatching the following names:\n\nregistPlugin\nRecvData\nGetPluginID\nVersion\n\nAssuming this is the case, the malware will then call the \"registPlugin\" export on the downloaded\nPE file. The downloaded file will never be saved to disk and may exist only in memory (assuming\nthe plugin itself does not save itself to disk).\n\nVolexity has not been able to recover any plugins at present.\n\n### STITCH\n\n**# Samples:** 7\n\n**First Seen:** 2019-06-24\n\n**Last Seen:** 2019-11-06\n\n\n**Example**\n**Hash:**\n\n\n2e8a34aa4e887ba413735d3ece7863921eaabdc5a494ff6354fb551f26dc561b\n\n\n[Stitch is a Python-based malware which is available on GitHub. The attackers likely use this as a](https://github.com/nathanlopez/Stitch)\n“throwaway” backdoor which they replace with something custom after identifying a victim of\ninterest. Despite its availability on GitHub, this malware is not frequently used in the wild, and\nmost of the samples available on VirusTotal appear to relate to this campaign based on\ninfrastructure analysis.\n\n### GOSLU\n\n**# Samples:** 2\n\n\n-----\n\n**First Seen:** 2020-01-19\n\n**Last Seen:** 2020-01-19\n\n**Example Hash:** 6501f16cfda78112c02fd6cc467b65adc0ef1415977e9a90c3ae3ab34f30cc29\n\nGOSLU is a malware family written in GoLang which uses Google Drive for command and control,\nand it supports a number of commands. Volexity has observed versions for both Windows and\nLinux, but only Windows versions were observed as being dropped by the web compromises. The\nLinux variant has been observed in conjunction with implants dropped on servers by Storm Cloud\npost-compromise.\n\nThe backdoor starts with an initalization routine that gets the OS version info (\"ver\" on Windows,\n\"uname -a\" on Linux) and the MAC address. The MAC address is base64 encoded and then the\nMD5 hash is taken of that value. This MD5 is used as the base name of a series of files the\nbackdoor uses. The files are written to the appropriate temporary directory on the system\n(typically /tmp or C:\\WINDOWS\\Temp). The three files created are:\n\n<hash>-lk.txt -- host info\n<hash>-cs.txt -- commands\n<hash>-rf.txt -- results\n\nThe content within these files is the base64-encoded output of 3DES ECB data using a key stored\nin the backdoor. The encrypted data in the host info file is the hostname, IP address, MAC\naddress, OS version info, and a timestamp of the last time this was updated. The core of the C2\nused by GOSLU is wrapped around Google Drive using the Go Google Drive library\nat [https://github.com/gdrive-org/gdrive. Some information the backdoor needs to authenticate to](https://github.com/gdrive-org/gdrive)\nGDrive is hard coded in the file, including the refresh-token, client_id, and client_secret.\n\nAfter initialization, GOSLU enters a loop. At a high level, during every pass, this loop does the\nfollowing:\n\nUpload its info (lk.txt) file (main_upload_info) as a form of C2 checkin\nCheck for a command (main_command_check) by searching for a cs.txt file\nUpload the results of any commands (main_upload_result) in an rf.txt file\nSleep\n\nIn main_upload_info, the data in the lk.txt file is updated and uploaded to GDrive.\nThen, main_command_check will look for a cs.txt file and download it. When checking for files on\nGDrive, it will execute a GDrive API query like \"name contains '<hash>.cs.txt'\".\nIn main_upload_result, it will first read in the cs.txt file, then look for what command was given.\nSome commands observed include:\n\nget - download a file from GDrive\nput - upload a file to GDrive\ngettime/settime - get or set the main loop sleep interval\ncd - change directory\n\n\n-----\n\ngdos - execute a GDrive command; there is a main_gdrive_handle function that\ncorresponds to the GDrive commands available at https://github.com/gdriveorg/gdrive/blob/master/gdrive.go\ndos - execute a system command\ndosnw - execute a system command without waiting\ndownexec - download a file and execute it\n\nAs an example, an encrypted cs.txt file might contain the command:\n\ndos taskkill /im process.exe /f\n\nAnd the subsequent rf.txt file would decrypt to\n\nSUCCESS: The process \"process.exe\" with PID 12346 has been terminated.\n\nVolexity has observed this malware in use in other incidents and currently suspects this tool is\nspecific to Storm Cloud at this time.\n\n### BRAINDAMAGE\n\n**# Samples:** 1\n\n**First Seen:** 2020-03-11\n\n**Last Seen:** 2020-03-11\n\n**Example Hash:** c0af38f02e845866ce14f28b894a866ba1d02b5faaef2b310eeb9b84b8b2846e\n\n[BrainDamage is another Python-based malware family which is available on GitHub. It supports a](https://github.com/mehulj94/BrainDamage)\nwide range of functionality natively but in the same vein as STITCH, i.e., it is used as a throwaway\nbackdoor.\n\nIn addition to these families, there are others which appear to be related based on infrastructure\nanalysis. For brevity, and since Volexity has not observed these as being delivered in this way,\nthey have not been included in this write-up.\n\n## Possible Related APK Campaign\n\nWhile investigating related attack infrastructure, Volexity identified some files which indicate that\nsome aspect of this campaign, or at least the same attackers, have supported for delivery and\ninstallation of malware on Android operating systems.\n\nSpecifically, three files submitted to VirusTotal indicate this may be the case. The relationship\nbetween these and the wider infrastructure is briefly shown in Figure 5:\n\n\n-----\n\n_Figure 5. APKs that appear related to the delivery of Windows malware._\n\n[All three APKs appear to be variants of the paid-for Android RAT known as 'SpyNote':](https://www.spynote.us/)\n\n**SHA256** **App name**\n\n657ca139a76e46b88fa86b4b4160de0abe0278342c83d11b10108cb1ba5c130d Media Player\n\nece28cae02345069e6b6c2346aaac0eeafa308b3840420f669070ef01b591ae7 \na3dadf5414471cb8e0395b81889af5e660a0c151d65fa078a5bf80373aa81b8f TibTermAssistant\n\nWhile the timings do not exactly overlap with the related Windows malware using the same IP\naddress for C2, the nature of the third application in the table (which imitates the Tibetan\nDictionary app “TibTerm”) indicates that these are likely also related to this campaign.\n\n## Conclusion\n\nThe Tibetan community, both within and outside of China, is under constant digital surveillance as\nthey seek to gain an upper hand against those seeking the formation of an independent Tibet.\n[This issue has been highlighted by CitizenLab on multiple occasions. The nature of this campaign](https://citizenlab.ca/2019/09/poison-carp-tibetan-groups-targeted-with-1-click-mobile-exploits/)\nmay seem basic, but the resources to continuously update infrastructure, write new malware, and\n\n\n-----\n\nmaintain these attacks across more than one platform should not be understated. It is a glimpse\ninto the gap in resources between those seeking to identify and prevent these attacks, and those\nconducting them.\n\n## Appendix A - IOCs\n\n**Observed Files**\n\n1261f67286c3edc49e415c9e9773e876867dd0755fce8d3637fb343e11206e0c\n\nad505cbc942a0a0b71f2bc2508250464c648b436cf2c762899e385971c955519\n\n3a1bb3e88c4dfeccb02481f656802431fc387a6952911e19e030d6ccef6c181f\n\n3288208b5c3372a2f0ef20f54fd52378177bb29a036fcf0166e64327380448c4\n\n97e0589348f6dbcf9eb59d8011aaf87fe97fa735f372abfc225d168cb296376a\n\n5652e83af9a36c985139f4b35d8162a4764bdeb00c5af573fa9e736c7fb1f90a\n\n6df5ddf7d4bd5fb57ee8588447f8565a9591bdd7a113c638d52f7e767998c747\n\n56857be1565973640f14e8c0ad0358d80081c94761b92dab21eb212d619c7737\n\n263a01c7d5cde9c14865b707e78cfd87bac18251eeef0201df04d5d8f4329798\n\n3858e141537485aefd8bb563553c725f4bb9beba64c7ee81d87ec7e2cff9eddb\n\n11e5100db6b36d1c78f535bc75544640846834d019551f52c61d71629ce8eef6\n\n00012d71558fea9429a305e8dda7d0720deeaf84ae4d432dff6441befa64033f\n\n6fba0c7c74e6f9092f5ecc78064e6a158392df32a4134ef99ec399ea4e771f4b\n\nfab653516b446cfc5bbb8c5f44dd20006d43101b4afba27a8fc655ba6d2f48b1\n\n8ddeeba82364e2629264b1d71693d8a42006e0c7d012ab5d2256ff027b2f5f75\n\na6f6091d67c3f2434e523745384fc09c5b53b3265b8c8ddf3dd1390c95152e12\n\nf7540f46f5dc5f55793c3c7130024591bbd4d8cae679f8816b17b8b655c9b796\n\n0033c7c2b7542bad0fbce198bee704f6b97010a820b5e8cb86574e8e400f7d81\n\ne026cb5d1f6472ff56648cb3e48257ef449713d6331023ae1f3b29863a4680a4\n\nb658a0b0b5cce77ce073d857498a474044657daec50c3c246f661f3790a28b13\n\n215c79344c1b7c761edd2026914dfee10cbefed6271da35c64db1699a0212493\n\nfc9c8d1b051e5db41a44f77d597c3981c88de987b85b8bb258229eeb73cc0f43\n\nc5ddd77d147246d53684d9eb5bd5b6734af12e2f790847b73b7ed716dce407b4\n\n\n-----\n\n5862862ce64b0b396384786ca7340dbf30030ec6ee8d54af6b5f1af21b492b97\n\n1f8bac00e4f611d0feec7255eeb88038460000002a0a0fe7c4ac0ee9a1b9f79c\n\n61fbeedeed65e5e86948594dc26e44cb5163f543204e39b55010e9159082cf62\n\n2e8a34aa4e887ba413735d3ece7863921eaabdc5a494ff6354fb551f26dc561b\n\n9846498c53c4f528edc173da2f70938ea93de4b8615c97ee040f36d356a15eee\n\nf15d95bb81860bccb6676c91752cc2feae3d0cc6c8f7959684c30c8b2c1d0768\n\n1d9ca05b3d4eef1034991cc4f020852f563e25b541bf5cb40db11b01c49231d1\n\nc7dae984195717c76a9b221081b9c9a20de8d20b55b68add647ee34685b93fb9\n\n88f6af2559db239dc975212dd58b4eb633db5068a5d558126675c1058ffd25dd\n\nec377ad3defd360c7c7f9c4f4d94188739bdb8ad82b2ea7d94725c68dc2838d9\n\nf0e5e95e6bdc5b2f47ba20709a97244cdebd63117bcf82c15e613b5856e8e41d\n\n**Network IOCs**\n\n199.247.3.4\n\n95.179.171.173\n\n45.32.154.111\n\n45.63.114.152\n\n207.148.117.159\n\n45.32.118.198\n\nroot20system20macosxdriver.serveusers.com\n\nairjaldinet.ml\n\nubntrooters.serveuser.com\n\nsystem0_update04driver_roots.dynamic-dns.net\n\nsys_andriod20_designer.dynamic-dns.net\n\nloginwebmailnic.dynssl.com\n\nctmail.dns-dns.com\n\nadobeflash31_install.ddns.info\n\ngetadobeflashdownloader.proxydns.com\n\n\n-----\n\nwindows-report.com\n\nbrowserservice.zzux.com\n\n## Appendix B - Helper Script to decode sojson_v4 JavaScript\n\n\n-----\n\n# use this on a .js file with so_jsonv4 encoded content\nimport sys, re, subprocess, os\n\ndef recursive_walk_directory(target_dir):\n'''\ninput:\ntarget_dir (str) : A path to the directory you want to walk\n\noutput:\nfiles (list) : A list of files in that directory\n'''\nfiles = []\nfor d, s, file_list in os.walk(target_dir):\nfor f in file_list:\nfiles.append(os.path.join(d,f))\nreturn files\n\n# https://github.com/beautify-web/js-beautify\n\nimport jsbeautifier\n\nif os.path.isfile(sys.argv[1]):\nfiles = [sys.argv[1]]\nelse:\ntmp_files = recursive_walk_directory(sys.argv[1])\nfiles = []\nfor fil in tmp_files:\nif fil.endswith(\".js\"):\nfiles.append(fil)\nprint(\"Found {0} files with .js extensions to try and parse\".format(len(files)))\n\nfor f in files:\nwith open(f, 'r') as infile:\ndata = infile.read()\n\npattern = re.compile(\"\\]\\(null,.*\\['\",)\nmatches = pattern.findall(data)\nif len(matches) < 1:\nprint(\"File: {0} does not match delivery kit\".format(f))\ncontinue\n\nfor match in matches:\nmatch_data = match[8:-3] # these are the characters from the match that correspond to the\nstring we need to decode\ncontinue\n\n\n-----\n\nchar_code_array = []\nthis_element = \"\"\n\nfor char in match_data:\ntry:\na = int(char)\nthis_element += char\nexcept:\nchar_code_array.append(this_element)\nthis_element = \"\"\n\nout = f + '.decoded'\nprint(\"Writing output to: {0}\".format(out))\nout_data = \"\"\nprint(len(char_code_array))\nfor cc in char_code_array:\nout_data += chr(int(cc))\nout_data = jsbeautifier.beautify(out_data)\nwith open(out, 'w') as outfile:\noutfile.write(out_data)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-31 - Storm Cloud Unleashed- Tibetan Focus of Highly Targeted Fake Flash Campaign.pdf"
    ],
    "report_names": [
        "2020-03-31 - Storm Cloud Unleashed- Tibetan Focus of Highly Targeted Fake Flash Campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "33eef76c-a6fa-4855-a77e-9a1e92fe8474",
            "created_at": "2023-11-21T02:00:07.393519Z",
            "updated_at": "2025-03-27T02:00:03.250084Z",
            "deleted_at": null,
            "main_name": "Storm Cloud",
            "aliases": [],
            "source_name": "MISPGALAXY:Storm Cloud",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "870f6f62-84f5-48ca-a18e-cf2902cd6924",
            "created_at": "2022-10-25T15:50:23.303818Z",
            "updated_at": "2025-03-27T02:00:55.435309Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "APT32",
                "SeaLotus",
                "OceanLotus",
                "APT-C-00",
                "Canvas Cyclone"
            ],
            "source_name": "MITRE:APT32",
            "tools": [
                "Mimikatz",
                "ipconfig",
                "Kerrdown",
                "Cobalt Strike",
                "SOUNDBITE",
                "OSX_OCEANLOTUS.D",
                "KOMPROGO",
                "netsh",
                "RotaJakiro",
                "PHOREAL",
                "Arp",
                "Denis",
                "Goopy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "af509bbb-8d18-4903-a9bd-9e94099c6b30",
            "created_at": "2023-01-06T13:46:38.585525Z",
            "updated_at": "2025-03-27T02:00:02.866727Z",
            "deleted_at": null,
            "main_name": "APT32",
            "aliases": [
                "TIN WOODLAWN",
                "OceanLotus Group",
                "OceanLotus",
                "Sea Lotus",
                "G0050",
                "Cobalt Kitty",
                "SeaLotus",
                "ATK17",
                "Ocean Lotus",
                "Ocean Buffalo",
                "POND LOACH",
                "Canvas Cyclone",
                "APT-C-00",
                "APT-32",
                "APT 32"
            ],
            "source_name": "MISPGALAXY:APT32",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d2a5c949-7ae0-4610-8bb8-047ab03b1574",
            "created_at": "2022-10-25T16:07:24.064197Z",
            "updated_at": "2025-03-27T02:02:10.096487Z",
            "deleted_at": null,
            "main_name": "Poison Carp",
            "aliases": [
                "Earth Empusa",
                "Evil Eye",
                "EvilBamboo",
                "Poison Carp",
                "Red Dev 16"
            ],
            "source_name": "ETDA:Poison Carp",
            "tools": [
                "ActionSpy",
                "AxeSpy",
                "BADSIGNAL",
                "BADSOLAR",
                "BadBazaar",
                "IRONSQUIRREL",
                "IceCube",
                "MOONSHINE",
                "PoisonCarp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f1518ac1-4710-4dd1-a422-e3801e4806cb",
            "created_at": "2024-05-01T02:03:08.147856Z",
            "updated_at": "2025-03-27T02:05:17.421275Z",
            "deleted_at": null,
            "main_name": "TIN WOODLAWN",
            "aliases": [
                "Cobalt Kitty",
                "OceanLotus",
                "WOODLAWN ",
                "APT32 "
            ],
            "source_name": "Secureworks:TIN WOODLAWN",
            "tools": [
                " Denis",
                " Goopy",
                " JEShell",
                " KerrDown",
                " Mimikatz",
                " Ratsnif",
                " Remy",
                " Rizzo",
                " RolandRAT",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "52973e5f-9656-4b60-b7f8-457e32ac4bbe",
            "created_at": "2023-01-06T13:46:39.056888Z",
            "updated_at": "2025-03-27T02:00:02.986693Z",
            "deleted_at": null,
            "main_name": "POISON CARP",
            "aliases": [
                "Evil Eye",
                "Red Dev 16",
                "Earth Empusa"
            ],
            "source_name": "MISPGALAXY:POISON CARP",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "19ac84cc-bb2d-4e0c-ace0-5a7659d89ac7",
            "created_at": "2022-10-25T16:07:23.422755Z",
            "updated_at": "2025-03-27T02:02:09.791931Z",
            "deleted_at": null,
            "main_name": "Bronze Highland",
            "aliases": [
                "Daggerfly",
                "Evasive Panda",
                "Storm Cloud",
                "StormBamboo",
                "TAG-102",
                "TAG-112"
            ],
            "source_name": "ETDA:Bronze Highland",
            "tools": [
                "Agentemis",
                "CDDS",
                "CloudScout",
                "Cobalt Strike",
                "CobaltStrike",
                "DazzleSpy",
                "KsRemote",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "MacMa",
                "Macma",
                "MgBot",
                "Mgmbot",
                "NetMM",
                "Nightdoor",
                "POCOSTICK",
                "RELOADEXT",
                "Suzafk",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2439ad53-39cc-4fff-8fdf-4028d65803c0",
            "created_at": "2022-10-25T16:07:23.353204Z",
            "updated_at": "2025-03-27T02:02:09.749502Z",
            "deleted_at": null,
            "main_name": "APT 32",
            "aliases": [
                "APT 32",
                "APT-C-00",
                "APT-LY-100",
                "ATK 17",
                "Lotus Bane",
                "Ocean Buffalo",
                "OceanLotus",
                "Operation Cobalt Kitty",
                "Operation PhantomLance",
                "Pond Loach",
                "SeaLotus",
                "SectorF01",
                "Tin Woodlawn"
            ],
            "source_name": "ETDA:APT 32",
            "tools": [
                "Agentemis",
                "Android.Backdoor.736.origin",
                "AtNow",
                "Backdoor.MacOS.OCEANLOTUS.F",
                "BadCake",
                "CACTUSTORCH",
                "CamCapture Plugin",
                "CinaRAT",
                "Cobalt Strike",
                "CobaltStrike",
                "Cuegoe",
                "DKMC",
                "Denis",
                "Goopy",
                "HiddenLotus",
                "KOMPROGO",
                "KerrDown",
                "METALJACK",
                "MSFvenom",
                "Mimikatz",
                "Nishang",
                "OSX_OCEANLOTUS.D",
                "OceanLotus",
                "PHOREAL",
                "PWNDROID1",
                "PhantomLance",
                "PowerSploit",
                "Quasar RAT",
                "QuasarRAT",
                "RatSnif",
                "Remy",
                "Remy RAT",
                "Rizzo",
                "Roland",
                "Roland RAT",
                "SOUNDBITE",
                "Salgorea",
                "Splinter RAT",
                "Terracotta VPN",
                "Yggdrasil",
                "cobeacon",
                "denesRAT",
                "fingerprintjs2"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535881,
    "ts_updated_at": 1743041788,
    "ts_creation_date": 1653761297,
    "ts_modification_date": 1653761297,
    "files": {
        "pdf": "https://archive.orkl.eu/5cb9e250f30955fa97dc5fafde1238350ebb57b9.pdf",
        "text": "https://archive.orkl.eu/5cb9e250f30955fa97dc5fafde1238350ebb57b9.txt",
        "img": "https://archive.orkl.eu/5cb9e250f30955fa97dc5fafde1238350ebb57b9.jpg"
    }
}