{
    "id": "8f4e5eb3-61e4-4a48-8319-8533dae8234d",
    "created_at": "2023-01-12T14:58:56.320414Z",
    "updated_at": "2025-03-27T02:13:16.666148Z",
    "deleted_at": null,
    "sha1_hash": "1be4dc974233dc5a828fdf168de7f3b66883c078",
    "title": "2020-08-28 - Gozi- The Malware with a Thousand Faces",
    "authors": "",
    "file_creation_date": "2022-05-28T18:09:34Z",
    "file_modification_date": "2022-05-28T18:09:34Z",
    "file_size": 1165691,
    "plain_text": "# Gozi: The Malware with a Thousand Faces\n\n**research.checkpoint.com/2020/gozi-the-malware-with-a-thousand-faces/**\n\nAugust 28, 2020\n\n## Introduction\n\n\nAugust 28, 2020\n\n\nMost of the time, the relationship between cybercrime campaigns and malware strains is simple. Some malware strains, like the gone-butnot-forgotten GandCrab, are intimately tied to a single actor, who is using the malware directly or distributing it via an affiliate program. Other\nstrains, like the open-source Quasar RAT, are “public domain” malware; they’ve remained the same for so long and been used as a Lego\npiece so repeatedly that it’d be a fundamental error to try and attribute them to an actor, a campaign, a victim or a time-frame.\n\nIt’s comforting to think of malware in the above terms alone. Malware strains are then neatly mapped to actors (or at worst, actor-affiliate\npyramids), who we feel comfortable reasoning about; and any malware not neatly mapped to an actor is just a depersonalized tool, which\ncarries no dramatic baggage of its own that researchers need to keep track of.\n\nAlas, reality is more complicated than that. Some strains of malware fall into a gray area. There is no single actor in control of the malicious\ncodebase or the binaries, but there is no universal proliferation of the malware as a standard tool, either. No one is there to call all the shots,\nbut there are many unrelated people each calling some of the shots, putting each branch of the malware in a state of constant divergent\nevolution. This is the strange and headache-inducing world of malware that has had its source code leaked, and it’s not only the concern of\nresearchers and analysts; the confusion and fragmentation that result have serious downstream effects for end users. A researcher flapping\nhis hands in confusion somewhere in China can result, a few weeks later, in a hurricane of ransomware infections in the Caribbean, and a\nvery angry manager being told “yes, we did have the MalBot family covered, but you see, this Malbot is not exactly that Malbot… look, it’s\ncomplicated”.\n\nIn this article we’ll make sense out of one of the worst offenders in the category of divergent evolution malware: Gozi.\n\n## A Brief Genealogy of Gozi\n\nToday, people know Gozi is a malware heavyweight that boasts an array of complicated features, on which we’ll elaborate below, and a very\nwide reach. One Gozi flavor alone, Dreambot, at one point had 450,000 victims under its sway; when monitoring another flavor, which is\ncurrently active, we can see thousands of new unfortunate victims a week registered at the malicious C&C panels. Consider that a single\nvictim can be monetized to the tune of hundreds of dollars, and you’ll quickly come to the conclusion that in total Gozi has been frighteningly\nlucrative, even compared to the already lucrative cybercrime market.\n\n\n-----\n\nNaturally, Gozi wasn t always such a juggernaut. Originally, it was a simple banking Trojan even more primitive in some aspects than the\nfirst version of ZeuS, due to its notable lack of web injection functionality. [A fascinating 2014 piece by PhishLabs provides an intimate](https://info.phishlabs.com/blog/the-unrelenting-evolution-of-vawtrak)\nperspective on the early days of Gozi:\n\nNikita Kuzmin, a 25-year-old Russian national [..] worked on coding spyware and Remote Access Trojans (RATs). He borrowed source\ncode from existing families popular at the time [..] UrSnif (developed by Alexey Ivanov, “subbsta”), and botnet C2/management functions\nand backend code from Nuclear Grabber [..] Kuzmin worked closely with the [malware author] superstars of those days: Corpse, Vladislav\nHorohorin (BadB), the Vasiliy Gorshkov and Alexey Ivanov team (Suidroot, Eliga, XTZ, Skylack, Kotenok). He had known some of them\nsince the ShadowCrew days. He was younger than most of his peers, at the time posting that he was looking forward to getting his\n\n[motorcycle license] and hoping to soon be making enough money for a brand-new, “real” motorcycle [..] Despite his young age, he was\ntrusted, respected for his practical technical skills and coding talent, and also known for his enthusiasm for the idea that Internet fraud,\nespecially against Western targets, was a legitimate profession with better pay and perks than working for local computer and software\nretail outlets, university labs, and ISPs. [..] Kuzmin had access to the source code for several crimeware kits with overlapping state-of-theart capabilities, each kit doing something exceptionally clever in one key area compared to the others. [He and the HangUP team] created\na repository under version control for a crimeware kit codebase incorporating all of these best features – this is what became known as\nGozi. The HangUP team was a nationalistic group with a common following of “cyberfacism,” shared Russian and Nazi imagery, and an\noverarching theme to wage financial warfare on Western interests through the use of the Internet to commit fraud.\n\n[For its first year, Gozi operated undetected; It was a 2007 expose by SecureWorks which brought this strain of malware to public attention,](https://www.secureworks.com/research/gozi)\ncomplete with a rundown of its internal composition and of the shape of the underlying financial operation. From its humble beginnings, Gozi\n— Similarly to Emotet — grew into a multi-module, multi-purpose malicious platform, and many of the modern derivatives of Kuzmin’s\noriginal work are still being actively used in malicious campaigns as of 2020. That’s 14 years of activity — several times the average lifespan\nof a malware brand.\n\nThis is not a coincidence. In all probability, the longevity of Gozi can be traced back to a single unfortunate incident.\n\nFor three more years past its 2007 public debut, Gozi was a classic malicious campaign — a single codebase kept to a tightly closed group\nof cybercriminals. Then, in 2010, the sources for this first version of Gozi leaked (this version was called Gozi CRM — that stands for\n“Customer Relationship Management”, namely the management of your banking credentials into a state where cybercriminals possess\n[them). Other actors took the code and ran with it, creating two new versions: Gozi Prinimalka (which went on to merge with Pony and](https://securityintelligence.com/project-blitzkrieg-how-to-block-the-planned-prinimalka-gozi-trojan-attack/)\nbecome [Neverquest) and Gozi “ISFB” (the meaning of which has apparently been lost to time). These early mutations alone already](https://securityintelligence.com/neverquest-gang-takes-leave-is-it-the-end-of-the-quest/)\ndisrupted the industry’s ability to keep track of Gozi. One vendor dubbed ISFB as “Gozi2”; others called it “Ursnif” or “Snifula”, after that piece\nof early-2000s spyware that the original Gozi CRM borrowed code from. Several other vendors started referring to the malware as “Rovnix”,\nafter a packer that was commonly used to obfuscate its binaries.\n\nWe know that “ISFB” is the proper name for this derivative of Gozi, as the internal binary strings contain references to the “ISFB project”. The\noriginal act of dubbing the malware “Ursnif” tied back to a long and proud tradition of arbitrary malware-naming that went back at least to the\nMichelangelo Virus of 1991, thus named by onlookers because it would trigger on a specific date that was coincidentally that artist’s birthday.\nThere’s nothing inherently wrong with that, but the many monikers and misconceptions surrounding the fledgling Gozi family tree sowed\nconfusion and created fractures in the sphere of knowledge surrounding the malware. “Rovnix” and “Snifula” thankfully fell out of fashion in\nthe nomenclature, but “Ursnif” stuck. In fact, it stuck so well that even in 2020, a full two decades past the publication of Ivanov’s original tool,\nthe name “Ursnif” — artifact of a long-bygone era — is still often used as a collective synonym for modern incarnations of Gozi.\n\nSeveral years later, the source code of ISFB leaked. Sources are conflicted on the exact timing here; most evidence places this second leak\nin 2015, but some sources claim it happened as early as 2013 (this confusion may be due to the existence of several leaks that happened\nsome time apart from each other). One of the resulting branches went on to merge with Nymaim, where it was used as the core code for the\n[two malware families’ hybrid child, GozNym. Yet another branch became Dreambot, which heavily relied on code from the original 2010](https://securityintelligence.com/meet-goznym-the-banking-malware-offspring-of-gozi-isfb-and-nymaim/)\nCRM leak, tweaked ISFB’s check-in format and added support for C&C communication over TOR network. Another branch spawned many\nsuccessful campaigns but did not attain a common name, leaving us no choice but to name it ourselves – “Goziat”, after its operators’ affinity\nfor the Austrian .at top level domain (the name beat out “Schnitzel Gozi”, but just barely).\n\nWhen second-wave Gozi had been around for long enough, some actors felt that the market was ripe for a new major version — leading to\nthe birth of Goziv3 (RM3 loader), ISFB3, and Gozi2RM3(IAP 2.0). Each of these introduced its own tweaks to the malware’s obfuscation\nmechanism, control flow and C&C communication scheme. In particular, these “third-wave Gozi” campaigns boasted new features such as\nsigned binaries, HTTPS communication and a tiered 2-stage client registration process (which we’ll elaborate on below).\n\nBy this point it should become apparent to you that these people never bothered to set up a proper regulatory body to handle naming for the\nvarious branches of Gozi. Given the considerable migraine that we experienced internalizing all the above, maybe this is less of a bug and\nmore of a feature.\n\n\n-----\n\n**Figure 0: Timeline and influences of**\n\nGozi variants.\n\n## The Core Gozi Experience\n\nWe’ve emphasized the divergent evolution of Gozi so much that you might have come to expect each variant to do its own thing, and for the\nmalware behavior to be so different from one variant to the next that their common origin is barely noticeable. In fact, the opposite is true: if\nyou’re not familiar with Gozi’s garden of forking strains, it’s pretty easy to mistake one variant for the other, especially when doing black-box\nbehavioral analysis.\n\nBelow we list some behaviors which are common to most, if not all, Gozi strains.\n\nStrings are contained, in encrypted form, in the binary’s .bss section. The decryption process makes use of a “key” string which is a\nstring-formatted compilation timestamp (e.g. April 20 2019).\n\n\n-----\n\n**Figure 1: String Decryption Process**\n\nA man-in-the-browser attack steals the victim’s credentials for a list of pre-configured websites (typically banks, but this is set at the\ncampaign level and is not a feature of the malware per se). In ISFB and its derivatives, web injects were introduced — these modify\nwebsites to include input fields that weren’t there before, such as bank PIN number, in order to entice the victim into providing that\ninformation.\nA specific C&C check-in format, which appears either in the request header or body. A typical example is\nsoft=%u&version=%u&user=%08x%08x%08x%08x&server=%u&id=%u&crc=%x, though there is slight variation in the parameters\nused and their order.\n\nAn elaborate scheme used to obfuscate the C&C check-in. This in particular is effectively a constant among variants — we’ve seen no\ntweaks introduced to it anywhere. The obfuscation works as follows:\n\nEncrypt the check-in using a built-in symmetric key (earlier variants used RC6, newer variants use Serpent; both are niche\nencryption schemes)\nEncode using base64 encoding\nEscape non-alphanumeric characters with the homebrew escape character “_”. For example, “+” becomes _2B.\nRandomly intersperse the result with slash characters (“/”) .\n\n\n-----\n\n**Figure 2: Obfuscation Scheme**\n\nA separation at the process level between the malware module that performs the man-in-the-browser attack and the module that\nmakes the actual decisions as to what to inject and where, where the latter is injected into explorer.exe. The two processes\ncommunicate using a named pipe, though some of the malware’s run-time information is kept globally accessible in the registry (for\ninstance, the CRC value of the last task list received from the C&C server).\nA gamut of standard information stealing features such as key-logging, e-mail, ftp accounts, IM data and certificate grabbing, as well as\nscreen video capture. These are augmented with support for optional DLL-format plugins, which the C&C server can instruct the\ninfected machine to download and execute at runtime.\nUse of a rather cumbersome format, called “joined resources”, for various kinds of hardcoded information. The type of hardcoded\ninformation isn’t written in plain English, either, and is denoted by a CRC32 tag. These have been known to vary.\n\n**[Figure 3: Sample map of CRC to resource name (credit: Maciej Kotowicz)](https://journal.cecyf.fr/ojs/index.php/cybin/article/view/15)**\n\n\n-----\n\nVariants use the same elements and the same format for storing web injects\n\n**@ID@ -> bot id (victim host identity)**\n**@GROUP@ -> group id (group id of the bot)**\n**@RANDSTR@ -> random string**\n[@[email protected] -> targeted financial institutions](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n[@[email protected] -> configuration](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n[@[email protected] -> video to record once the victim visit the page of interest](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n[@[email protected] -> connect SOCKS server](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n[@[email protected] -> connect VNC](https://research.checkpoint.com/cdn-cgi/l/email-protection)\n\n## Spotlight on Choice Gozi Strains\n\n Goziat\n\nThis flavor of Gozi appears to have debuted several years following the ISFB leak. Its most distinguishing feature compared to other variants\nis a quirk in its C&C check-in; most other Gozi versions emulate an HTTP get request for an image, and therefore end with some variation of\n/images/ followed by a long and unwieldy BASE64 blob that’s topped off by a .gif or .jpeg file extension. This obfuscation is somewhat tricky\nfor security solutions to deal with, but not impossible — which is probably why goziat instead uses a different resource directory instead of\n“images”, which can be configured during the malware’s build process. Since goziat does not bother with the ruse of its check-in being a\nlegitimate request for an image, it also abandons the “image file extensions as encoded requests” trick, as popularized by Dreambot and\nreplicated by many other variants. Instead, it uses a straightforward action=<action> request format.\n\nA small number of researchers dubbed this variant LOLSnif, after its “Living Off the Land” (making use of pre-installed Windows utilities such\nas mshta.exe and powershell.exe). Instead of the more state-of-the-art geofencing on the server side, this variant has a built-in client-side\ncheck for the System default UI language.\n\n**Figure 4: System UI language check used for geofencing**\n\nWhile there appear to be several different campaigns making use of Goziat, these tend to use domains with an .at top-level domain (hence\nthe name we chose for this variant). This, along with some overlap in IP addresses and even the subdomains being used, collectively hint at\nsome commonality at the campaign operation level. These campaigns tend to hang on to the same domains and IP addresses for a\nrelatively long time, which may not be the best choice opsec-wise. The following table lists some of the campaigns we and other vendors\nhave been able to track that have made use of this specific version of Gozi.\n\n\n**Group ID** **Serpent Key(s)** **Resource**\n**Directory**\n\n\n**Target** **Domain examples**\n**/notes**\n\n\n**General Notes**\n\n\n-----\n\n100020003000 W7fx3j0lFvOxT2kFU7yKaYwFde7YtppY api1 Italy pipen.at Laurela.atcalag.at Spam campaign that\ndisseminated\npassword-protected\narchives hosted on\nGoogle drive and\nfirefox send. The\narchives (usually with\nthe password 7777)\ncontained a heavily\nobfuscated\nJavaScript file named\npresentation_????.js,\nwhich in turn dropped\na DLL launched via a\nregsvr32.exe -s\ncommand.\nFirst-stage domains\nlive for a long time,\nbut lately the serpent\nkey changes\nfrequently.\n\n\n1000 F1cl1tAcbPsStUtM rpc USAEurope\nIndia\nRussia\n\n\ndicin.at\nkartop.at\n\nevama.at\nmobipot.at\n\n\n1000 K2u7G0lE4u1VoS0V\nNf6lU8d5X0i1Wr7V\n\n\nwpapi USA\nCanada\nItaly\n\n\n20001500 Gwe9HMygngWe8kPKTEJopj7WLDojJKx4 webstore sorna.at\n[Rivier.atexplik.at](https://community.riskiq.com/search/api11.explik.at)\n\n\nApparently defunct\nsince 2018, possibly\nbefore. Distributed by\nmalspam, as well as\nthe GrandSoft exploit\nkit. A certain\ncommon domain\nsuggests that the\nactor behind this\ncampaign may have\nalso experimented\nwith deploying\nDreamBot to attack\ntargets in Japan.\n\nSeems to have taken\noff around March\n2018. Crafted spam\n[apparently sent by](https://securityaffairs.co/wordpress/78672/breaking-news/dissecting-ursnif-dhl-campaign.html)\nDHL, used to lure\nvictims to Grandsoft\nExploit Kit landing\npage.\n\nStarted in the end of\n2018. Dropped by\nHancitor, which\nswitched to\ndistribution also via\nCOVID-19 themed\nemails in early 2020.\nBased on shared\ndomains, this actor\nseems to have also\nrun some campaigns\nusing Hancitor\nloader, EvilPony and\nCobaltStrike.\n\nSeems to have\nstarted in 2018;\ndistributed via\nQuantLoader,\nGrandSoft exploit kit\nand Hancitor\nmalspam.\n\n\n40005000 Ni8wR0zp1Ak5FoOW\nXio4U7r3MlO7FwcQ\n\n\nwpx Italy deepmoler.cn\neromov.at\n\n\n-----\n\n**Figure 5: malicious file hosted at Firefox Send**\nApart from the domains listed above, each campaign also supported TOR domains.\n\n**Api1: 6buzj3jmnvrak4lh.onion, g4xp7aanksu6qgci.onion, l35sr5h5jl7xrh2q.onion**\n**Rpc: v6ekxns6ldq5uai3.onion, uaoyiluezum43ect.onion, tjiqtwzewnkbqxmh.onion**\n**Wpapi: 4fsq3wnmms6xqybt.onion, em2eddryi6ptkcnh.onion, nap7zb4gtnzwmxsv.onion, t7yz3cihrrzalznq.onion**\n**Webstore: vo5vuw5tdkqetax4.onion, zq4aggr2i6hmklgd.onion**\n**Wpx: pzgxy5elkuywloqc.onion, q7nxkpgras35dwxk.onion, rbhqdxwdwrlp67g6.onion, jesteoq7glp3cpkf.onion**\n\n## Gozi2RM3 / Gozi IAP2.0\n\nThis version of Gozi doesn’t introduce any C&C communication tweaks (as opposed to other third-wave Gozi, which we will discuss later);\nbased on the communication and the binary metadata, one might easily mistake it for other version 2 variants. The most salient difference\nbetween Gozi2RM3 and earlier-generation Gozi is at the campaign infrastructure level, which implements a thorough vetting process.\n\nThe C&C infrastructure of a Gozi2RM3 campaign is subdivided into 2 stages, where the address of a stage-1 C&C is hardcoded into the\ninitial binary that infects the victim. The stage-1 C&C is pre-configured with an ISP/geolocation deny list which is used to pre-filter\nconnections suspected to be curious researchers rather than true victims. In some cases, even when these checks are passed, the victim\nmust prove themselves a good victim by continually sending data; only then the second-stage server will consider pushing the campaign’s\nmain payload and sending the true configuration.\n\nThis devious design choice is a deserved entry on our List of Reasons We Thank The Lord Every Day that Malware Authors Never Learn\nfrom Each Other’s Achievements. Thankfully, there is at least a default serpent encryption key for C2 communications\n(10291029JSJUYNHG) that many campaigns never bothered to modify.\n\nWhile these differences in infrastructure are the main ones, there are also some differences in functionality. There’s the C&C panel, which\nmakes us believe that this variant is probably up for sale somewhere.\n\n\n-----\n\n**Figure 6: Gozi2RM3 C&C web panel**\nThere’s also a more terse URI format string (no os, size, hash). The protocol for specifying what resource is requested from the C&C is the\n“feign request for image” protocol, taken directly from dreambot.\n\n**Figure 7: Bogus image requests and their meaning; used in Dreambot and some**\n\nother variants (credit: [Maciej Kotowicz)](https://journal.cecyf.fr/ojs/index.php/cybin/article/view/15)\nThere appears to be a connection between Goziat actors and Gozi2RM3 actors. Both variants changed the way they decrypt payloads by\nadding another step of encryption — the malicious server’s public RSA key is further encrypted with a serpent key, which itself is only\nassembled at runtime. The fact both these variants changed their flow in the same way, and in such a short time-frame, seems to imply that\nthey either voluntarily share code or one of the groups is really vigilant about imitating the other.\n\nThe following table lists some of the campaigns we have been able to track that have made use of this specific version of Gozi. This is just a\nshortlist of recently-alive campaigns among a very long list of long-dead ones. Some commonalities between the campaigns suggest that the\nnumber of active actors using Gozi2RM3 might be smaller than appears at first sight.\n\n\n**Group ID** **Serpent Key(s)** **Target** **Domain examples**\n\n**/notes**\n\n\n**General Notes**\n\n\n3xxx (varies) 10291029JSJUYNHG USA\n\nCanada\n\nGermany,\nAustralia,\nItaly\n\n\nTLD of drop site is .cab Campaign consistently used first-stage\ndroppers named info_date.doc, distributed\nusing reply-chain hijacking. Tenuous\nconnection to Valak malware via use of the\nsame dropper.\n\n\n44444343\n\n205x\n\n\n10291029JSJUYUON\n\n21291029JSJUXMPP\n\n\nItaly bizzznez.com\n\nConsaltin.orgredflash.org\n\n\nDistributed via standard malspam (also seen\nby Cutwail), at some times COVID-19 themed\nor pretending to be from DHL. Focused\nspecifically on stealing credentials of Italian\nbank customers.\n\nDistributed via Excel files with hidden sheets.\nconnected to 3xxx campaign. Probably the\nsame actor.\n\nDistributed through exploit kits (RIGEK,\nGrandSoftEK, FallOutEK) Seems to have\ntaken off around November 2019\n\nSeen distributed through spam and docs with\nmacros. For example, doc impersonating to\nbe Hubata Cernoska (big shop in Czech). The\nweb injection configuration is very similar to\n21291029JSJUXMPP.\n\n\n89897979989893938182 10291029JSJUYNHG Italy Sub domains gstat[.] and\nline[.]\n\n\n5555400040105600 78347829JSDUKLHG USA\n\nJapan\n\n416x 10291029JSJUYNHG Czech,\nUSA,\nItaly\n\n\nTLD is .today, .website\nand .space\n\n_lokoloppo4.com,_\n_38.132.124.193_\n\n\n-----\n\n**Figure 8: Assortment of malicious documents used to spread Gozi2RM3**\n\nFor educational purposes, we include the configuration for intercepted and hidden URLs used by one of the campaigns (group id 4444,\nserpent key 21291029JSJUXMPP) in Appendix B .\n\n## Goziv3 RM3\n\nThis variant has been in the wild since at least the summer of 2017. A lot of the code from ISFB is still there, but a lot is also different. The\ngroup behind this variant is pretty sophisticated and makes a decent effort to stay under the radar while attacking mostly Australia, Italy and\nthe USA.\n\nThere are some salient technical differences between this variant and second-wave Gozi:\n\n1. RM3 loader uses a unique file format that is called “PX format”. Every dll is loaded using a homebrew loader for this format. A tool for\n\n[processing PX format files can be found here.](https://github.com/hasherezade/funky_malware_formats/tree/master/isfb_parser)\n\n1. The Joined Resources (“JJ”) struct has been discarded in favor of a “WD” struct which has a different format. Also, the struct is not kept\n\nright after the PE headers as previously, but instead in the security directory.\n\n**Figure 9: Goziv3 RM3 WD struct**\n\n1. This variant makes use of a word list that is kept in one of the WD structs for pseudorandom generation of registry key names. This\n\nmakes detection of this variant by registry key IOCs more difficult than that of previous variants.\n\n\n-----\n\n**Figure 10: Goziv3 RM3 data kept in randomly-named registry entries**\n\n1. This variant uses forfiles.exe in order to execute a powershell script that loads shellcode into memory and then executes that shellcode\n\nusing APC injection. By adding the forfiles executable during the infection chain, this variant can evade detection mechanisms which\nsearch for persistence of more known script engines such as PowerShell and mshta.\n\n1. Probably the difference that will jump out at an analyst first is the tweak to the communication method. While the obfuscation scheme\n\nfor the C&C check-in remains the same one globally used in Gozi variants, in this variant it is put in the request body instead of the URI\n(which becomes just “index.htm”). Also, the plain check-in has a slightly different format:\n```\n{rand1}={rand2}&type={type}&soft={soft}&version={version}&user={user}&group={group}&id={id}&arc={arc}&crc={crc}&uptime={uptime}\n\n```\nWhile these technical differences do exist, as with Gozi2 RM3, the group behind this variant seem to have focused their innovation on ways\nto prevent researchers from interacting with the C2 and obtaining payloads. They do so by restricting the payload delivery on the server side\n– when clients try to connect to a C2 server, they are geolocated and rejected if the location does not match the targeted region of the\ncurrent campaign. More importantly, the first-stage C2 stays online for a very short period of time — just long enough to serve a large\nnumber of victims and disappear before being subjected to unwelcome analysis. Gozi3 RM3 is usually distributed by spam emails that carry\nan obfuscated VGS file, or an xls4.0 macro, as an attachment. At least since 2017, This variant of Gozi has been known to be bundled with a\n[popular loader also used by some Emotet and Dridex campaigns.](https://blog.trendmicro.com/trendlabs-security-intelligence/ursnif-emotet-dridex-and-bitpaymer-gangs-linked-by-a-similar-loader/)\n\n\n-----\n\n**Figure 11: Goziv3 RM3 malspam and attached maldoc**\n\nThe top-level domain of the C&C servers is typically .xyz, and the samples are typically signed with Verisign (in practice, this means that\nwhen a victim runs these samples they have to click ‘OK’ on one less dialogue box that warns them that maybe they shouldn’t execute\nrandom files handed to them by strangers on the internet).\n\nThe people behind this operation seem to value their work-life balance — the campaigns are somewhat far-between, and are inactive on\n[weekends. You can read here about a possible connection to the “Evil Corp” group.The lack of variance in all the above characteristics seem](https://blog.fox-it.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/)\nto suggest that this Gozi variant is mainly in use by a single actor.\n\n## Legacy Gozi\n\nThese are Gozi variants that seem to have fallen out of use. The groups pushing them have either moved on to more modern malware, or\nmoved on from the malware business entirely.\n\n## Dreambot\n\nThis branch of the leaked ISFB sources was first spotted shortly after the ISFB leak (many sources say 2014, some say 2015). It remained in\nactive development for quite a while and added many new features; most important among those were Tor-hosted command and control\nservers, a keylogging capability, the ability to steal browser cookies and data from email clients, a screenshotting feature, the ability to record\na victim’s screen and a VNC remote access feature. Dreambot had a Cybercrime-as-a-Service (CaaS) monetary model, and was available to\nany aspiring cybercriminal for the right price.\n\nMany of these features were unique even among newer variants, but ultimately Dreambot was a product of the second-wave Gozi era. To\nevade prying eyes, it relied on C2 check-ins imitating a GET request for an image — a trick that drastically lost its value once it became\ncommon knowledge, and could not compete with the sophisticated stealth operation best practices of third-wave Gozi such as the signed\n[binaries and tiered C2 model. After a long and fruitful run, in March of 2020 Dreambot seems to have finally gone silent.](https://medium.com/csis-techblog/the-end-of-dreambot-a-loved-piece-of-gozi-24cc9bfc8122)\n\n**Figure 12: Dreambot C&C web panel**\n\n## Saigon\n\nThis fork of Goziv3 RM3 was [identified by FireEye in September 2019. It introduced various changes to base Goziv3 RM3, among them:](https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html)\n\nNew arguments to the C2 check-in. Noticeable among those was knock, which encoded a number of seconds that the client would wait\nbetween making subsequent requests.\n\n\n-----\n\nThe SERPENT encryption is used in the ECB mode of operation, instead of CBC. In actual cryptography this would be considered a\ndowngrade, but the general rule is that no one ever really runs cryptanalysis on malware communications anyway, and this is just one\nglorified obfuscation scheme replaced with another.\nNo interspersed random slashes when obfuscating the encrypted C2 check-in.\nNo use of the PX format.\n\nAs can be seen, most of the changes seem to be focused on removing features, making the malware simpler and reverting to something\nmore closely resembling second-wave Gozi.\n\n## ISFB3 / Ursnif-A\n\nThis variant saw a very limited and precise use, attacking Japanese victims during 2018-2019. Due to a commonality in its distribution\nmethod, it has been speculated to be tied to threat actor TA544. As typical for Gozi in general, it was distributed by malspam (specifically\nthrough Cutwail) carrying attached office documents, and used geolocation to keep out any requests outside its targets (typically customers\nof domestic Japanese banks). The spam would often carry the Bebloh downloader, which would only then fetch the actual Gozi.\n\n**Figure 13:**\n\nISFB3 maldoc, targeted at Japanese bank customers\nThe name “ISFB3” is derived from an explicit pdb path in the malicious binaries — c:\\isfb3\\x64\\Release\\client.pdb — but while the digit “3” is\nin the title, this isn’t third-wave Gozi. The mock image-retrieving GET request is still there, and no ground-breaking features that prevent\nresearch of the campaign are present. An array of minor technical differences set this variant apart from other strains: “J1” used as a magic\nprefix in the joined resources (this is a throwback to early versions of Dreambot), some changes to the operation of its information stealing\n[modules, as well as a few tweaks in its methods for persistence and evasion (see here and](https://www.cybereason.com/blog/new-ursnif-variant-targets-japan-packed-with-new-features) [here).](https://jsac.jpcert.or.jp/archive/2020/pdf/JSAC2020_5_sajo-takeda-niwa_en.pdf)\n\n## Conclusion\n\nWhen we deal with malware, we often stand on the shoulders of giants. Vendor consensus will quickly tell us the name of the malware we\nare dealing with, and if it doesn’t, some Google searching for unique-seeming indicators will quickly show us the hard-won insights of\nresearchers who have gone before us and had to deal with the exact same malware. Once we know the malware’s true name, we then have\npower over it. We can write signatures, hunt for more samples, and use our exacting knowledge to protect potential victims.\n\nMalware with a very fragmented ecosystem, such as Gozi, throws a monkey wrench into all of that. Grant that you’ve gotten hold of a\nmalicious sample or a campaign, and after some quick sleuthing you’ve determined that you are dealing with “Gozi”, or “ISFB” or “Ursnif”,\nwhich are all the same but somehow also different. You then have to contend with a list of variants, all referred to interchangeably by those\nnames, all with subtly different communication methods, behavioral patterns and campaign infrastructures. What are you going to do now?\nFor basic triage work, it’s fine to say “this is Gozi, a banker that evolved into a malicious content delivery platform”. But for anything that gets\nmore technical, these subtle differences are a recipe for a headache. If your scope is *all* the Gozi versions, you are going to have a very\nb d ti\n\n\n-----\n\nThere appears to be no easy fix for this issue. The sun rises in the east, the sea rushes to shore, cybercriminals create new malware and\nresearchers confabulate new names for it. All we can do is produce very delayed reviews, such as this one, that try to inject some order into\nthe overarching chaos. Other than that, we can take solace in the fact that these incidents of multiple-branch malware are few and far\nbetween, since cybercriminals have no financial motive to share malicious code, and they usually know better than to make it public. When\nGozi-style fragmentation occurs, it’s usually because of a leak. So we would like to conclude with a plea to cybercriminals: secure your\ncodebases, for all our sakes!\n\n## 6. Special Thanks\n\n[We would like to deeply thank Benoît Ancel of CSIS Security Group. This article would have not been possible without his detailed technical](https://benkow.cc/)\ninput on the subject of Gozi’s long, branching and confusing history.\n\n## IOCs\n\n**Goziat**\n\n**First loader:**\n\ncb4f92bf9fef3708e7aeba5d8994a0502952d06374c8a83ff2c1ee0b7e603d35\n\n**Main loader:**\n\n21a03d9c845e446cb96eba7c93aa6403b8a9aaa744801e77468bf73c0507d028\n\n**Main worker:**\n\nc486d8579308999b7d9f8cbb6de33b7a3976b9db5b98c06b7744adf5d5d11caf\n\n**Gozi2RM3**\n\n**First loader:**\n\n644482a0851ff6f801e1e9afea1eee19e4f4de72b28895de9e3a4e43dd48ff1e\n\nC8456d507da3484d2151f051f439b2de13174be9f72f4f1f03abf52885adca1a\n\nb1ce263fb1945ae153e4c111fdfe0bd3d26cd09381ee21cf82ff5b115ad8ca77\n\n**Main loader:**\n\nc2ee9cf24f0bddb07914503dbae35c4497d66f9ca01ea65108ef40ff13cbec02\n\n6fa79786607c16fbf5f86d5978ad5c60d32e055946dc6d9d6d78310b1f7cc918\n\n**Main worker:**\n\n81734690442c224cf104fba0db8bacabdf3dc347bba3da3415a92de587df6d82\n\nb78390654db57946d3d551f9a34a488a726a0e7890746019b7313eddb74a9372\n\n**Gozi v3/ RM3**\n\n**First loader:**\n\n41e52cec2091e4451beadad93c5f693d5a008cf56eaf160f9fa4d577b1d707f6\n\n5548507963e58e7c89e406452a4c00823db72b26c96cfcf7ed82799dacaf48d7\n\n**Main loader(as PE):**\n\na353dfb1b5eb69808244356cf9a784181c53eea2cb3f254749fa19c307c30cfc\n\n**Second stage Dlls (as PEs):**\n\n8a2dace2a6fbd650b3e079f20f3886dd595044dbd4cb6bbab16023182f8d17af\n\n495351fb739029a95a2bad9e80da3e6207b9bbd218c5c1d35f7e8eb0a090c04f\n\n979048ab6e71c9589bb204e3017e72dfb8fe8d0b088fbccfa7e0b5791be89c68\n\n87058836bd1c2c7a428ae4a3b4729035dab25795fe4da55b3f5793cc115c611a\n\n\n-----\n\n**Dreambot**\n\n52cb2bd9724270b3efe575894112d0a866734856a3257ddcfb24308e42861f6a\n\nee8a404264b4d3144bc37ef7118da24c77dd15b20d38250badbf53140f7c1d2a\n\n2d5c9af9419bfb08e1066b41f2d2daba93024fb6201ac079e0ec474c424d21ff\n\n0ed9d5dcdc2ea4b90f056071feaec0463c3563eb89b67533741f079a22c7a1e7\n\nf2556099982b2b1ebea7443c863b8b205b6683112624f46393454e430e69aed5\n\n**Saigon**\n\n8ded07a67e779b3d67f362a9591cce225a7198d2b86ec28bbc3e4ee9249da8a5\n\n431f83b1af8ab7754615adaef11f1d10201edfef4fc525811c2fcda7605b5f2e\n\n628cad1433ba2573f5d9fdc6d6ac2c7bd49a8def34e077dbbbffe31fb6b81dc9\n\n**Isfb3**\n\n**First loader:**\n\ncacc1c3af8ad58b992c707bdf36ec1bd5f039dd80780ad2978cb142ccfe714d6\n\n8d7ffebb0774e0dfe9d85f175cd5e1800dfd757bb5fbc4565a8f8a173e739ea5\n\n**Client DLL:**\n\nf3182febadb7a9cc0d43621bd9909688f9b0f7720d87673970be1c81249e208a\n\n8e707c3afeaff2602615307988668ff8d2a3be20e5e41f34c6eb33c8deb6ceea\n\n**Appendix A**\n\n**Yara rules**\n```\nrule goziv3: trojan {\n  meta:\n    module = \"goziv3\"\n  strings:\n    $dec_bss = {D3 C0 83 F3 01 89 02 83 C2 04 FF 4C 24 0C}\n    $gen_serpent = {33 44 24 04 33 44 24 08 C2 08 00}\n  condition:\n    ($dec_bss and $gen_serpent) and (uint16(0) == 0x5A4D or uint16(0) == 0x5850 )\n}\nrule Gozi_JJ_struct: trojan {\n  meta:\n    module = \"Gozi_JJ_struct\"\n  strings:\n    $jj = \"JJ\" ascii\n    $pe_file = \"This program cannot be run in DOS mode\" ascii\n    $bss = \".bss\" ascii\n  condition:\n     #jj >= 2 and (for all i in (1,2) : (@jj[i] < 0x400 and @jj[i] > 0x200)) and (@jj[2] - @jj[1] == 0x14) and ($pe_file in\n(0..1000)) and ($bss in (0..1000))\n}\n\n```\n**Appendix B**\n\n**Targeted (intercepted) websites**\n\n*amazon.*\n\n*paypal.*\n\n*sella.it*\n\n*clienti.chebanca.it*\n\n*ibk.nexi.it/ibk/web*\n\n*nowbanking.credit-agricole.it*\n\n\n-----\n\nbanklinknet2.cariparma.it\n\n*banklinknet2.carispezia.it*\n\n*corporate.friuladria.it*\n\n*nowbankingcorporate.cariparma.it*\n\n*nowbankingcorporate.friuladria.it*\n\n*banking4you.it*\n\n*fideuramonline.it/script/ServiceLogin/ib/login*\n\n*paco.cabel.it*\n\n*icbp.seceti.it/contrattobpercbi*\n\n*cbi.bpergroup.net/ibk/*\n\n*scrigno.popso.it/*\n\n*idp-bpiol.poste.it*\n\n*banking.bnl.it*\n\n*unicredit.it/it/privati.html*\n\n*unicredit.it/wps/myportal/retail*\n\n*online-smallbusiness.unicredit.it*\n\n*digital.mps.it/pri/login/*\n\n*digital.mps.it/pri/pr/*\n\n*icb.mps.it*\n\n*icb.mps.it*\n\n*aziendaonline.mps.it*\n\n*intesasanpaolo.com*\n\n*homebanking.bpergroup.net*\n\n*inbiz.intesasanpaolo.com*\n\n*carigeonline.gruppocarige.it/wps*\n\n*gruppocarige.it/wps*\n\n*ibbweb.tecmarket.it/*\n\n*ib.mps.it*\n\n*ib.cbibanking.it*\n\n*bancagenerali.it/pib*\n\n*qweb.quercia.com/deutschebank*\n\n*dbonline.italy.db.com/portalserver/dbiPortal/*\n\n*poste.it*\n\n*ubibanca.com*\n\n*finecobank.com*\n\n*ihb*.cedacri.it*\n\n*bancopostaimpresaonline poste it*\n\n\n-----\n\nbusiness.bnl.it\n\n*creval.it/bancaperta*\n\n*csebo.it/webcontoc*\n\n*inbank.it*\n\n*core*.cedacri.it*\n\n*banking-imprese.credem.it*\n\n*mybanking.credem.it*\n\n*credem.it*\n\n*relaxbanking.it*\n\n**Blocked websites**\n\n*sucmetrics.unicredit.it/*\n\n*dc.services.visualstudio.com/*\n\n*.gdatasecurity.de/*\n\n*.kaspersky.*\n\n*lo.v.liveperson.net/api/js/*IwZTMyMDUwZGJkNzk3NThl*\n\n*lo.v.liveperson.net/api/js/*VhMjk2MGQxMjlhM2FjYjc4*\n\n*nowbanking.credit-agricole.it/API/Core/erro*\n\n*.banking4you.it/mobile*\n\n*.bancagenerali.it/mobile*\n\n*my.unipolbanca.it/hb/RUEI/*\n\n*cdn.chebanca.net/js/afp_obf.j*\n\n*webchat.credem.it/*\n\n*secure.credem.it/*\n\n*.credem.it/*supporto-e-sicurezz*\n\n*.credem.it/*contatti*\n\n*m.credem.it/*\n\n*cache.inbank.it/*\n\n*cdn.inbank.it/*\n\n*col.eum-appdynamics.com/eumcollector/beacons/browser/*\n\n*m.intesasanpaolo.com/*\n\n*.relaxbanking.it/relaxbanking/sso.LoginMobil*\n\n*m.unicredit.it/*\n\n*m.mail.tim.it/*\n\n*fideuramonline.it/script/ServiceLogin/ib/login*\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-28 - Gozi- The Malware with a Thousand Faces.pdf"
    ],
    "report_names": [
        "2020-08-28 - Gozi- The Malware with a Thousand Faces.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b753c6a8-a83d-47bc-829d-45e56136eb7d",
            "created_at": "2023-01-06T13:46:38.97802Z",
            "updated_at": "2025-03-27T02:00:02.967861Z",
            "deleted_at": null,
            "main_name": "GozNym",
            "aliases": [],
            "source_name": "MISPGALAXY:GozNym",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c91f7778-69aa-45fa-be0e-4ee33daf8fbd",
            "created_at": "2023-01-06T13:46:39.110148Z",
            "updated_at": "2025-03-27T02:00:02.998873Z",
            "deleted_at": null,
            "main_name": "NARWHAL SPIDER",
            "aliases": [
                "GOLD ESSEX",
                "TA544"
            ],
            "source_name": "MISPGALAXY:NARWHAL SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1f679d2e-c5c9-49e9-b854-2eca06a870e4",
            "created_at": "2022-10-25T16:07:24.453427Z",
            "updated_at": "2025-03-27T02:02:10.237233Z",
            "deleted_at": null,
            "main_name": "Bamboo Spider",
            "aliases": [
                "Bamboo Spider",
                "TA544"
            ],
            "source_name": "ETDA:Bamboo Spider",
            "tools": [
                "AndroKINS",
                "Bebloh",
                "Chthonic",
                "DELoader",
                "Dofoil",
                "GozNym",
                "Gozi ISFB",
                "ISFB",
                "Nymaim",
                "PandaBanker",
                "Pandemyia",
                "Sharik",
                "Shiotob",
                "Smoke Loader",
                "SmokeLoader",
                "Terdot",
                "URLZone",
                "XSphinx",
                "ZLoader",
                "Zeus OpenSSL",
                "Zeus Panda",
                "Zeus Sphinx",
                "ZeusPanda",
                "nymain"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535536,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653761374,
    "ts_modification_date": 1653761374,
    "files": {
        "pdf": "https://archive.orkl.eu/1be4dc974233dc5a828fdf168de7f3b66883c078.pdf",
        "text": "https://archive.orkl.eu/1be4dc974233dc5a828fdf168de7f3b66883c078.txt",
        "img": "https://archive.orkl.eu/1be4dc974233dc5a828fdf168de7f3b66883c078.jpg"
    }
}