{
    "id": "8f7768e0-aae7-4759-b833-7ba13eae139c",
    "created_at": "2023-01-12T15:04:08.415535Z",
    "updated_at": "2025-03-27T02:14:12.235629Z",
    "deleted_at": null,
    "sha1_hash": "f556053a82d28af092e09a36cccfa0d0101eebb4",
    "title": "2020-10-16 - WIZARD SPIDER Update- Resilient, Reactive and Resolute",
    "authors": "",
    "file_creation_date": "2022-05-28T22:07:29Z",
    "file_modification_date": "2022-05-28T22:07:29Z",
    "file_size": 1615193,
    "plain_text": "# Wizard Spider Modifies and Expands Toolset [Adversary Update]\n\n**crowdstrike.com/blog/wizard-spider-adversary-update/**\n\nThe CrowdStrike Intel Team October 16, 2020\n\n[WIZARD SPIDER is an established, high-profile and sophisticated eCrime group, originally](https://www.crowdstrike.com/blog/sin-ful-spiders-wizard-spider-and-lunar-spider-sharing-the-same-web/)\n[known for the creation and operation of the TrickBot banking malware. This Russia-based](https://www.crowdstrike.com/cybersecurity-101/malware/trickbot/)\neCrime group originally began deploying TrickBot for the purpose of conducting financial\nfraud in 2016, but has since evolved into a highly capable group with a diverse and potent\n[arsenal, including Ryuk, Conti and BazarLoader. Their toolset covers the entirety of the kill](https://www.crowdstrike.com/blog/big-game-hunting-with-ryuk-another-lucrative-targeted-ransomware/)\n[chain, from delivery to post-exploitation tools and big game hunting (BGH) ransomware,](https://www.crowdstrike.com/blog/big-game-hunting-the-evolution-of-indrik-spider-from-dridex-wire-fraud-to-bitpaymer-targeted-ransomware/)\nenabling them to conduct a wide range of criminal activities against enterprise environments.\n\nWIZARD SPIDER has developed their tools over a number of years, and they continue to\nevolve the tactics, techniques and procedures (TTPs) needed to monetize their criminal\noperations in an efficient and effective manner.\n\nOver recent months, WIZARD SPIDER has demonstrated their resilience and dedication to\n[criminal operations by operating multiple ransomware families with differing modi operandi,](https://www.crowdstrike.com/epp-101/what-is-ransomware/)\nusing TrickBot and BazarLoader to infiltrate victim environments and reacting to attempts to\nstop them in their tracks. The group has made significant improvements to their arsenal\n\n\n-----\n\nrecently and has both developed new tools and modified existing ones. The key observations\ncovered below are based on CrowdStrike® Intelligence analysis of BazarLoader, Conti and\nRyuk operations.\n\n## TrickBot\n\nTrickBot has remained a primary tool for WIZARD SPIDER and has grown to infect upward\nof one million systems worldwide. TrickBot has played an integral part in enabling BGH\noperations and poses a severe threat across all sectors and geographies. This has made\nWIZARD SPIDER’s TrickBot malware an extremely prevalent and widely tracked target.\n\nOn September 21 and 22, 2020, CrowdStrike Intelligence observed a non-standard\nconfiguration file being distributed to victims infected with TrickBot. The configuration files\ninstructed infected hosts to communicate with the command-and-control (C2) server address\n```\n0.0.0.1 on TCP port 1 . This action resulted in an unknown number of bots being\n\n```\nisolated from the TrickBot network and unreachable through the standard C2 channel.\n\nThis week, widespread public reporting has attributed this disruption attempt against TrickBot\nto multiple cybersecurity vendors. The operation against the TrickBot network was\norchestrated to take down the botnet, thus reducing BGH infections by WIZARD SPIDER’s\nRyuk and Conti ransomware families, with an ultimate goal of protecting the forthcoming U.S.\nelections from ransomware operations.\n\nSince the disruption operation began on September 21, 2020, we have observed a definite\nimpact on the TrickBot network, with almost 10,000 unique downloads of the non-standard\nconfiguration identified. However, in spite of this, TrickBot activity has returned to its usual\nrapid pace, and the impact of the disruption operation was manifested as a short-term\nsetback for WIZARD SPIDER.\n\n\n-----\n\nFigure 1. TrickBot Activity Tracking (July 1 to October 14, 2020) (click image to enlarge)\n\n[In a timely turn of events following a short break, MUMMY SPIDER’s Emotet malware has](https://www.crowdstrike.com/blog/meet-crowdstrikes-adversary-of-the-month-for-february-mummy-spider/)\nresumed spamming activity this week, and we have since observed MUMMY SPIDER\ndeploying TrickBot to Emotet-infected hosts. Downloaded TrickBot samples since October 14\nhave used group tags prefixed with `mor — for example,` `mor131 . This is very likely an`\nattempt by TrickBot to replenish their victim base to offset any losses they may have\nexperienced as a result of the takedown attempt.\n\n### BazarLoader Takes to the Stage\n\nIn addition to the continuation of TrickBot activity, WIZARD SPIDER has increased their use\nof the initial access tool BazarLoader, which is now being distributed in spam operations and\nused as an additional infection vector to enable WIZARD SPIDER’s post-exploitation activity.\nNewly identified BazarLoader spam runs consist of emails containing a link to a Google Docs\nfile (Figure 2). The Google Docs file commonly contains a link to the BazarLoader payload\nhosted on an external site.\n\n\n-----\n\nFigure 2. Example BazarLoader Google Docs File (click image to enlarge)\n\nThe spam emails are often business-related, with themes that reference purported phone\ncalls, meetings, customer complaints or employment termination. An example email is\nprovided in Figure 3.\n\nFigure 3. BazarLoader Spam Email with Google Docs Link (click image to enlarge)\n\nBazarLoader (aka Kegtap) consists of a loader and a backdoor component. The loader is\nresponsible for installing and executing the backdoor element. The latest version of the\nloader contains a large amount of string and code obfuscation, and it has been observed\n\n\n-----\n\nutilizing a novel technique of mimicking legitimate software for persistence. CrowdStrike\ntechnical analysis has specifically revealed the loader mimicking communications software\nsuch as Softphone.\n\nThe backdoor component is capable of executing arbitrary payloads, batch and PowerShell\nscripts, exfiltrating files from a victim, and terminating running processes. In addition to the\nbackdoor component, we have observed WIZARD SPIDER deploying and utilizing the\n_CobaltStrike post-exploitation framework._\n\nIn September 2020, the group distributed a PowerShell version of BazarLoader that contains\nsimilar functionality to that of the executable version and is likely a pursuit to be compatible\nwith their extensive, PowerShell-friendly toolset.\n\n### Ryuk’s Return\n\nSince September 2018, WIZARD SPIDER’s Ryuk ransomware has been the group’s most\nlucrative operation for siphoning money from its victims through extortion. The U.S. Federal\nBureau of Investigation (FBI) has estimated that victims have paid over USD $61 million to\nrecover files encrypted by Ryuk. In March 2020, WIZARD SPIDER ceased deploying Ryuk\nuntil mid-September.\n\nFrom March to September 2020, WIZARD SPIDER did not cease operating but instead\nswitched to Conti ransomware. We first observed Conti being deployed in June 2020. It is\nunknown why WIZARD SPIDER paused operating Ryuk, but it is likely they took a break\nfrom their operations to reorganize and reevaluate their methodologies. It is also currently\nunclear how WIZARD SPIDER intends to use both Conti and Ryuk. It is possible that Conti\nand Ryuk may continue to be used simultaneously by WIZARD SPIDER, with either one\nbeing deployed depending on particular characteristics of the victim organization. What is\nclear is that WIZARD SPIDER is now running multiple ransomware operations.\n\nFrom a code perspective, little has changed between Ryuk binaries compiled in March and\nthose compiled in September. The functionality has remained overall static since introducing\nfeatures for targeting hosts on a local area network (LAN). The most notable change to Ryuk\nis the introduction of code obfuscation. The code obfuscations appear to be designed to slow\ndown the reverse engineering process by using anti-disassembly and code transformation\nobfuscation techniques.\n\nThese obfuscation techniques are not as advanced as those observed in Conti and\nBazarLoader. This is likely due to the age of the Ryuk code base and build process, which\ndates back to the end of 2018. Conti and BazarLoader are newer WIZARD SPIDER projects\nwith obfuscation likely part of the build process. Ryuk’s code obfuscation appears to be\nmacro-based, with macros inserted at the start of a function or in-line.\n\n### Conti: New, Developing, Persistent\n\n\n-----\n\nWIZARD SPIDER operations were notably reduced and sporadic during the first half of 2020,\nbut recent months have seen a resurgence of WIZARD SPIDER activity and the introduction\n[of Conti ransomware. In August 2020, the actor began using a data leak site (DLS) for Conti.](https://www.crowdstrike.com/blog/double-trouble-ransomware-data-leak-extortion-part-1/)\nConti has been continually improved by WIZARD SPIDER and has already been used to\ncompromise over 120 victim networks, with stolen data listed on the Conti DLS. Conti victims\nspan multiple sectors and geographies, the vast majority of which are based in North\nAmerica and Europe (Figure 4). This opportunistic targeting is indicative of WIZARD SPIDER\nand wider ransomware operations.\n\nFigure 4. Conti Ransomware Victims by Sector and Geography (click image to enlarge)\n\nConti has been under active development throughout WIZARD SPIDER’s deployment of the\nransomware in BGH campaigns. Additional features, obfuscation techniques and code\nchanges are integrated on an almost weekly basis. In August 2020, Conti’s technique shifted\nfrom fully encrypting files with AES-256 to a more strategic and efficient approach of\nselectively encrypting files with the ChaCha stream cipher. Conti’s host discovery and\nnetwork share targeting functionality has also continued to evolve and is now comparable to\nthat of Ryuk’s.\n\n\n-----\n\nWIZARD SPIDER s ongoing development of Conti is equally focused on the evasion of\ntraditional, signature-based antivirus software and to hinder malware analysis efforts. Conti’s\nutilization of compiler-based obfuscation techniques, such as ADVobfuscator, provide code\nobfuscation when the ransomware’s source code is built. Portions of Conti’s source code are\nrestructured or rewritten regularly with the intention of avoiding detection and disrupting\nautomated malware analysis systems.\n\n## Outlook\n\nThe ultimate goal of the disruption operation against the TrickBot network was to impact and\nprevent ransomware infections — however, Ryuk and Conti continue to be used in BGH\ncampaigns against organizations across multiple sectors and geographies. Over a dozen\nconfirmed WIZARD SPIDER ransomware cases have been identified since the disruption\nbegan. While the valiant efforts of the cybersecurity teams involved in this complex operation\nundoubtedly had a short-term impact on WIZARD SPIDER’s TrickBot network, the response\nby the criminal actors has been swift, effective and efficient. TrickBot activity continues at a\nprogressive rate, BazarLoader is increasing in prevalence, and BGH ransomware operations\nproceed as normal with Ryuk and Conti.\n\nWIZARD SPIDER, with its diverse and effective toolset, has proven to be a highly capable\nadversary and continues to be resilient, reactive and resolute as they continue to run their\nformidable criminal enterprise. The resilience of advanced criminal threat actors like\nWIZARD SPIDER make it increasingly important that we, as an industry, continue to fight\nback. Any attempt to increase the cost for the criminals contributes to a more secure\ncyberspace.\n\nThe CrowdStrike Falcon® endpoint protection platform detects and prevents against Ryuk.\nFor Falcon endpoint customers, prevention settings should be set at a minimum to the\nfollowing:\n\nNext-Gen Antivirus: Cloud/Sensor Machine Learning: Set “Prevention” slider to\n“Aggressive”\nMalware Protection: Execution Blocking: Toggle “Prevent Suspicious Processes” to\n“Enabled”\nAdd any hashes to your custom blocklist for added protection\n\n**_This blog was written by CrowdStrike Intelligence analysts Adam Podlosky, Alexander_**\n**_Hanel, Brendon Feeley and Sean Wilson._**\n\n**Additional Resources**\n\n_[Download: CrowdStrike 2020 Global Threat Report.](https://www.crowdstrike.com/resources/reports/2020-crowdstrike-global-threat-report/)_\n_To learn more about how to incorporate intelligence on threat actors into your security_\n_strategy, visit the_ _[Falcon X™ Threat Intelligence page.](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)_\n\n\n-----\n\n_Learn more about the powerful, cloud-native CrowdStrike Falcon® platform by visiting_\n_the product webpage._\n_[Get a full-featured free trial of CrowdStrike Falcon Prevent™ and learn how true next-](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_gen AV performs against today’s most sophisticated threats._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-16 - WIZARD SPIDER Update- Resilient, Reactive and Resolute.pdf"
    ],
    "report_names": [
        "2020-10-16 - WIZARD SPIDER Update- Resilient, Reactive and Resolute.pdf"
    ],
    "threat_actors": [
        {
            "id": "e8e18067-f64b-4e54-9493-6d450b7d40df",
            "created_at": "2022-10-25T16:07:24.515213Z",
            "updated_at": "2025-03-27T02:02:10.267637Z",
            "deleted_at": null,
            "main_name": "Mummy Spider",
            "aliases": [
                "ATK 104",
                "Gold Crestwood",
                "Mummy Spider",
                "TA542"
            ],
            "source_name": "ETDA:Mummy Spider",
            "tools": [
                "Emotet",
                "Geodo",
                "Heodo"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "475ea823-9e47-4098-b235-0900bc1a5362",
            "created_at": "2022-10-25T16:07:24.506596Z",
            "updated_at": "2025-03-27T02:02:10.263346Z",
            "deleted_at": null,
            "main_name": "Lunar Spider",
            "aliases": [
                "Gold SwathMore"
            ],
            "source_name": "ETDA:Lunar Spider",
            "tools": [
                "BokBot",
                "IceID",
                "IcedID",
                "NeverQuest",
                "Vawtrak",
                "grabnew"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c2385aea-d30b-4dbc-844d-fef465cf3ea9",
            "created_at": "2023-01-06T13:46:38.916521Z",
            "updated_at": "2025-03-27T02:00:02.950071Z",
            "deleted_at": null,
            "main_name": "LUNAR SPIDER",
            "aliases": [
                "GOLD SWATHMORE"
            ],
            "source_name": "MISPGALAXY:LUNAR SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d706edf6-cb86-4611-99e1-4b464e9dc5b9",
            "created_at": "2023-01-06T13:46:38.839083Z",
            "updated_at": "2025-03-27T02:00:02.93205Z",
            "deleted_at": null,
            "main_name": "INDRIK SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:INDRIK SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "506404b2-82fb-4b7e-b40d-57c2e9b59f40",
            "created_at": "2023-01-06T13:46:38.870883Z",
            "updated_at": "2025-03-27T02:00:02.939775Z",
            "deleted_at": null,
            "main_name": "MUMMY SPIDER",
            "aliases": [
                "TA542",
                "GOLD CRESTWOOD"
            ],
            "source_name": "MISPGALAXY:MUMMY SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bc119938-a79c-4e5f-9d4d-dc96835dfe2e",
            "created_at": "2024-06-04T02:03:07.799286Z",
            "updated_at": "2025-03-27T02:05:17.337094Z",
            "deleted_at": null,
            "main_name": "GOLD BLACKBURN",
            "aliases": [
                "Periwinkle Tempest ",
                "Wizard Spider ",
                "ITG23 "
            ],
            "source_name": "Secureworks:GOLD BLACKBURN",
            "tools": [
                " Buer Loader",
                " Dyre",
                " Team9",
                " TrickBot",
                "BazarLoader"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2ac83159-1d9d-4db4-a176-97be6b7b07c9",
            "created_at": "2024-06-19T02:03:08.024653Z",
            "updated_at": "2025-03-27T02:05:17.348806Z",
            "deleted_at": null,
            "main_name": "GOLD CRESTWOOD",
            "aliases": [
                "TA542 ",
                "Mummy Spider "
            ],
            "source_name": "Secureworks:GOLD CRESTWOOD",
            "tools": [
                "Emotet"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "7cfe3bc9-7a6c-4ee1-a635-5ea7b947147f",
            "created_at": "2024-06-19T02:03:08.122318Z",
            "updated_at": "2025-03-27T02:05:17.398805Z",
            "deleted_at": null,
            "main_name": "GOLD SWATHMORE",
            "aliases": [
                "Lunar Spider "
            ],
            "source_name": "Secureworks:GOLD SWATHMORE",
            "tools": [
                " GlobeImposter",
                " Gozi",
                " Gozi Trojan",
                " IcedID",
                " Latrodectus",
                " TrickBot",
                " TrickBot",
                "Cobalt Strike"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535848,
    "ts_updated_at": 1743041652,
    "ts_creation_date": 1653775649,
    "ts_modification_date": 1653775649,
    "files": {
        "pdf": "https://archive.orkl.eu/f556053a82d28af092e09a36cccfa0d0101eebb4.pdf",
        "text": "https://archive.orkl.eu/f556053a82d28af092e09a36cccfa0d0101eebb4.txt",
        "img": "https://archive.orkl.eu/f556053a82d28af092e09a36cccfa0d0101eebb4.jpg"
    }
}