{
    "id": "8fa63c45-c7f1-4116-9f7b-34952eaaac2b",
    "created_at": "2023-01-12T15:01:47.879721Z",
    "updated_at": "2025-03-27T02:15:35.667844Z",
    "deleted_at": null,
    "sha1_hash": "a0d8921422b526d0143a65fbaf4e9dccaa6ebcc0",
    "title": "2022-04-21 - Prynt Stealer Spotted In The Wild",
    "authors": "",
    "file_creation_date": "2022-05-27T23:07:07Z",
    "file_modification_date": "2022-05-27T23:07:07Z",
    "file_size": 4120729,
    "plain_text": "# Prynt Stealer Spotted In the Wild\n\n**[blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/](https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/)**\n\n## A New Info Stealer Performing Clipper And Keylogger Activities\n\n\nApril 21, 2022\n\n\nCyble research labs discovered a new Infostealer named Prynt Stealer. The stealer is new on the\ncybercrime forums and comes with various capabilities. Along with stealing the victim’s data, this stealer\ncan also perform financial thefts using a clipper and keylogging operations. Additionally, it can target 30+\nChromium-based browsers, 5+ Firefox-based browsers, and a range of VPN, FTP, Messaging, and\nGaming apps. Furthermore, a builder may customize the functionality of this stealer.\n\n\n-----\n\nFigure 1: Post on cybercrime marketplace\nThe developer of the stealer recently claimed the recent versions of the stealer to be FUD (Fully\nUndetectable), as shown in Figure 2. We could also spot a few stealer logs available for free on the\nTelegram channel.\n\nFigure 2: Details from Telegram\n\nThe embedded binary contains hardcoded strings which are encrypted using AES256 and Rijndael\nencryption algorithm. Prynt Stealer is a .Net-based malware. Figure 3 shows the file details.\n\n\n-----\n\nFigure 3: File details\n\n## Technical Analysis\n\nThe sample (SHA 256: 1283c477e094db7af7d912ba115c77c96223208c03841768378a10d1819422f2)\nhas an obfuscated binary stored as a string, as shown in Figure 4.\n\nFigure 4: Obfuscated binary\nThe binary is encoded using the rot13 cipher. ROT13 (rotate by 13 places) replaces a letter with one after\n13 positions from the current letter. The rot13 algorithm is applied on a Base64 encoded binary in this\nsample. The malware rather than dropping the payload executes it directly in the memory using\n_AppDomain.CurrentDomain.Load() method._\n\n\n-----\n\nFigure 5: Binary decoding process\nThe malware uses ServicePointManager class to establish an encrypted channel to interact with the\nserver. There are a few hardcoded strings encrypted using the AES256 algorithm. All these strings are\ndecrypted by calling Settings.aes256. _Decrypt() method is assigned back to the same variables, as shown_\nin the Figure below.\n\nFigure 6: Decrypts hardcoded strings\nAfter this, the malware creates a hidden directory in the AppData folder, which will be named using the\nMD5 hash value The Figure below shows the part of code in malware for creating and hiding a directory\n\n\n-----\n\nFigure 7: Creates a hidden directory\nThen a subfolder is created inside the parent directory created above and is named using the format\n“username@computername_culture.” Malware will also create other folders inside this folder, such as\nBrowsers, Grabber, etc. These folders will be used for saving the stolen data from respective sources.\n\nThe malware then identifies all the logical drives present in the victim’s system using the DriveInfo() class\nand checks for the presence of removable devices. Next, the malware adds the drive’s name and path to\nits target list for stealing data. After identifying the drive details, the malware steals the files from the\ntargeted directories, as shown in Figure 8. The malware uses a multithreading approach for stealing the\nfiles fast from the victims’ machines. Prynt Stealer only steals the files whose size is less than 5120 bytes\nand should have the following extensions:\n\nDocument: pdf, rtf, doc, docx, xls, xlsx, ppt, pptx, indd, txt, json.\n\nDatabase: db, db3, db4, kdb, kdbx, sql, sqlite, mdf, mdb, dsk, dbf, wallet, ini.\n\nSource Code: c, cs, cpp, asm, sh, py, pyw, html, css, php, go, js, rb, pl, swift, java, kt, kts, ino.\n\nImage: jpg, jpeg, png, bmp, psd, svg, ai.\n\nFigure 8: Steal files\n\n\n-----\n\n## Browsers\n\nAfter stealing files from the victim’s system, Prynt Stealer steals data from browsers.\n\nTargeted browsers include:\n\nChromium-based browsers\nMS Edge\nFirefox-based browsers\n\n**Chromium-based browsers:**\n\nIt first creates a folder named “Browsers” and then checks for the Browsers directories (refer to the Figure\nbelow) in the “AppData” folder using Directory.Exists() method. If it returns true, the malware starts stealing\ndata from the respective location. The stealer can target nearly all chromium-based browsers, as can be\nseen in the Figure below. The Chromium browsers use multiple .sqlite files for storing users’ data.\n\nFigure\n\n9: Targeted chromium-based browsers\nIt steals the master key from the “Local Sate” file, which is used for decrypting the sensitive information\nstored in the browsers.\n\n\n-----\n\nThe malware steals Credit Cards, Passwords, Cookies, Autofill, History, Downloads, and Bookmarks data\nfrom browsers, and saves the stolen data in respective text files created under the\n“Browsers\\Browser_Name\\” directory.\n\nFiles targeted by malware for stealing data:\n\nWeb Data (for Autofill data)\nLogin Data (for Login Credentials)\nHistory (for search history)\nCookies (for browser Cookies)\n\nFigure 10: Steals data from chromium-based browsers\nWhile stealing the data from browsers, the malware also checks if keywords belonging to services such as\nBanking, Cryptocurrency, and Porn are present in the browser data using ScanData() method. The Figure\nbelow shows the services for which malware runs string search operations.\n\n\n-----\n\nFigure 11: Checks for specific services\n**MS Edge Browsers:**\n\nThe malware first checks for the directory “\\AppData\\Local\\Microsoft\\Edge\\User Data,” which helps identify\nif an edge browser is installed on the victim’s system. After this, it enumerates all the files in the system\nand checks if the “Login Data” file is present. If so, then it steals the data from the browser, as can be seen\nin the Figure below. Finally, the ScanData() method is used again to steal the data from the Edge browser\n\n\n-----\n\nFigure 12: Steals data from MS Edge browser\n**Firefox-based browsers:**\n\nPrynt stealer targets eight Firefox-based browsers which can be seen in Figure 13.\n\nFigure 13: Targeted\n\nFirefox-based browsers\nThe malware only proceeds to steal data if the Profile folder is present under the\n“AppData\\Browser_name” directory. Firefox Browser uses this folder for saving user data. The malware\ncopies the “logins.json” file from the “Profile” folder to the initially created folder for saving stolen data. The\n“Logins.json” file is used for storing the Firefox login credentials. Following files are targeted by malware\nfor stealing data, present under the “Profile” folder:\n\nPlaces.sqlite (for Bookmarks and History)\ncookies.sqlite (for browser cookies)\nlogins.json (for Login Credentials)\n\n\n-----\n\nFigure 14: Steals data from Firefox-based browsers\n\n## Messaging Applications\n\nAfter stealing data from browsers, the malware targets the following messaging applications:\n\nDiscord\nPidgin\nTelegram\n\nThe malware first creates a folder names Messenger which will be used for saving data from these\napplications.\n\n### Discord:\n\nAfter this, the malware checks for Discord tokens. It first searches for the following directories:\n\n_Discord\\\\Local Storage\\\\leveldb_\n_discordptb\\\\Local Storage\\\\leveldb_\n_Discord Canary\\\\leveldb_\n\nIt only proceeds if the above directory exists. If directories are present, malware checks for files ending\nwith .ldb or .log and extracts Discord tokens from them using regular expression. Then it creates a folder\nnamed “Discord” and will write the stolen tokens to “Tokens.txt.”\n\n\n-----\n\nFigure 15: Steals\n\nDiscord tokens\n\n### Pidgin:\n\nPidgin is a chat program that lets you log in to accounts on multiple chat networks simultaneously. It is\ncompatible with the following chat networks: Jabber/XMPP, Bonjour, Gadu-Gadu, IRC, Novell GroupWise\nMessenger, Lotus Sametime, SILC, SIMPLE, and Zephyr.\n\nThe malware first identifies if “.purple\\\\accounts.xml” is present in the AppData folder. This file stores the\nPidgin login credentials. It steals the Login credentials and Protocol details and saves them into the\naccounts.txt file for exfiltration.\n\nFigure 16: Steals data from Pidgin\n\n### Telegram:\n\n\n-----\n\nThe malware calls Process.GetProcessByName() method for getting the running process name and path\nin the victims’ machine. The malware then checks if the Telegram string is present in the retrieved path.\nFinally, it gets the Telegram directory and steals data from there if it is present—the malware targets “tdata”\nfolder for stealing telegram sessions.\n\nFigure 17: Steals telegram sessions\n\n## Gaming Applications\n\nPrynt Stealer targets the following gaming applications:\n\nSteam\nMinecraft\nUplay\n\n### Steam:\n\nThe malware identifies the Steam installation path by checking the registry key value at\n“HKEY_LOCAL_MACHINE\\Software\\Valve\\Steam.” After this action, it enumerates the subkey present\nunder “HKEY_LOCAL_MACHINE\\Software\\Valve\\Steam\\Apps” to get details of the application, as can be\nseen in the Figure below. The malware also targets the steam’s SSFN file, known as the authorization file,\nand copies it for exfiltration.\n\nFigure 18: Steals data from steam\n\n\n-----\n\n### Uplay:\n\nThe malware looks for “Ubisoft Game Launcher” in the AppData folder, and if this folder is present, it\ncopies all the files in it for exfiltration.\n\nFigure 19: Steals data from Uplay\n\n### Minecraft:\n\nFor Minecraft, the stealer checks if the “.minecraft” folder is present under the AppData directory. If it is\npresent, it creates a folder named “Minecraft” under the “Gaming” folder to save the stolen data.\n\nThis stealer copies “launcher_profiles.json”, “servers.dat” and screenshots to “Minecraft ” folder for\nexfiltration. It also extracts mods and version details and saves them to respective text files created in\n“Minecraft” folder.\n\nFigure\n\n20: Steals data from Minecraft\n\n\n-----\n\n## Crypto Wallets\n\nThe malware targets the following crypto wallets:\n\nZcash, Armory, Bytecoin, Jaxx, Ethereum, AtomicWallet, Guarda, and Coinomi.\n\nIt creates a folder named “Wallets” and then enumerates a list of hardcoded wallets for identifying the\ncrypto wallet used by the victim.\n\nStealer queries registry for identifying the location of Blockchains such as Litecoin, Dash, and Bitcoin as\nshown in Figure below. It obtains the path from registry data “strDataDir” in the\n_HKEY_CURRENT_USER\\Software\\Blockchain_name\\ Blockchain_name-Qt registry key._\n\nFigure 21: Steals data from Crypto wallets\n\n## FTP Applications\n\nPrynt stealer targets FileZilla, a free and open-source, cross-platform FTP application. It steals the data\nfrom “sitemanager.xml” and “recentservers.xml” and stores the data in the “Hosts.txt” file under the\n“FileZilla” folder for exfiltration.\n\nFigure 22: Steals data from FileZilla\n\n## VPN\n\n\n-----\n\nPrynt Stealer targets the following VPN applications:\n\nOpenVPN\nPorotonVPN\nNordVPN\n\nIt copies the configuration file of ProtonVPN, OpenVPN and steals the user credentials from NordVPN\nconfiguration file.\n\nFigure 23: Steals data from VPN’s configuration file\n\n## Directory tree\n\nAfter this action, the malware creates a folder named “Directories” and then obtains the structure of a\ndirectory and writes them to text files, as shown in the Figure below. The directories targeted by malware\ninclude the one targeted initially for copying data.\n\n\n-----\n\nFigure\n\n24: Obtains the directory tree\n\n## System Information\n\nIt creates a folder named “System” in which it will store the solen information regarding running processes,\nnetwork details, and victim’s system screenshot, etc.\n\n**Process Details:**\n\nPrynt stealer uses Process.GetProcesses() method to identify all the running processes in the victim’s\nsystem and write them to the “Process.txt” file in the format:\n\nProcess name\nProcess ID\nExecutable path\n\nAfter this action, it gets the active windows using the process.MainWindowTitle() method and write the data\ninto the “Windows.txt” file in the format:\n\nProcess name\n\n\n-----\n\nProcess ID\nExecutable path\n\nFigure 25: Extract details of current processes\n\n### Screenshot:\n\nNow it takes a screenshot of the victim’s system and saves it as a “Desktop.jpg” file:\n\nFigure 26: Takes Screenshot\n\n### Network Information:\n\nThe stealer also extracts the network credentials using the command “chcp 65001 && netsh wlan show\n_profile” and saves them into the “Savednetworks.txt” file. After this, using the command “/C chcp 65001_\n_&& netsh wlan show networks mode=bssid” it obtains the list of available networks and saves them into the_\n“ScanningNetworks.txt” file.\n\n\n-----\n\nFigure 27: Steals save network credentials and identify the available network\n\n### Windows Product Key:\n\nIt steals the windows product key from the\n“HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion,” decodes it, and then saves it\nto the “ProductKey.txt file.”\n\nFigure 28: Steal Windows product key\n\n## Data exfiltration:\n\nThe malware creates a list and adds the overview of stolen data to it, as shown in the Figure below. Then it\nsends a chat message using the Telegram bot.\n\nFor identifying the public IP, it sends a request to hxxp[:]//icanhazip[.]com\n\n\n-----\n\nFor identifying the geolocation, it sends a request to hxxps[:]//api.mylnikov.org/geolocation/wifi?\nv=1.1&bssid=\n\nFigure 29:\n\nCreates an overview of stolen data\nThe malware compresses the folder where the stolen data is saved and exfiltrates it to the telegram bot.\nFurthermore, it uses a secure network connection for exfiltrating the stolen data to the remote server.\n\n\n-----\n\nFigure 30: Decrypted network traffic\n\n## Other Capabilities\n\nOur analysis found that specific modules in the sample are not executed by the malware, including the\nAnti-analysis, Keylogger, and Clipper. Threat Actors (TAs) also provide a builder for this stealer, which can\nbe customized to control these functionalities. Taking the case of anti-analysis, it’s working on the\nhardcoded string present in malware. The Figure below shows the method responsible for executing antianalysis functionalities. Similarly, other processes also depend on these hard-coded strings.\n\nFigure 31: Anti-analysis\n\n### Clipper:\n\nThe Figure below shows the list in which TAs can store their crypto addresses. These entries are not\npopulated, highlighting the fact that TA might not have opted for this functionality in the builder.\n\n\n-----\n\nFigure 32: Clipper\n\n### Keylogger:\n\nThis stealer enables the keylogging feature only if the hardcoded specific applications are running in the\nsystem. The stolen data will be saved in “logs\\keylogger” folder.\n\nFigure 33: Keylogger module\n\n## Conclusion\n\n\n-----\n\nPrynt Stealer is a recent Infostealer strain. It has a ton of capabilities. Though there are pretty popular\nstealers in the cybercrime marketplaces, TAs do adopt new toolkits which aid them in updating their\nTactics, Techniques, and Procedures. These types of malware provide an easy way for TAs to get into the\ncorporate networks, as breaking into a network is not everyone’s cup of tea.\n\n## Our Recommendations:\n\nAvoid downloading pirated software from warez/torrent websites. The “Hack Tool” present on sites\nsuch as YouTube, torrent sites, etc., mainly contains such malware.\nUse strong passwords and enforce multi-factor authentication wherever possible.\nTurn on the automatic software update feature on your computer, mobile, and other connected\ndevices.\nUse a reputed anti-virus and internet security software package on your connected devices, including\nPC, laptop, and mobile.\n\nRefrain from opening untrusted links and email attachments without first verifying their authenticity.\nEducate employees in terms of protecting themselves from threats like phishing’s/untrusted URLs.\nBlock URLs that could be used to spread the malware, e.g., Torrent/Warez.\nMonitor the beacon on the network level to block data exfiltration by malware or TAs.\nEnable Data Loss Prevention (DLP) Solution on the employees’ systems.\n\n## MITRE ATT&CK® Techniques \n\n**Tactic** **Technique ID** **Technique Name**\n\n**Execution** [T1204](https://attack.mitre.org/techniques/T1204/) User Execution\n\n**Defense Evasion** [T1497.001](https://attack.mitre.org/techniques/T1497/001/) Virtualization/Sandbox Evasion: System Checks\n\n\n**Credential Access** [T1555](https://attack.mitre.org/techniques/T1555/)\n[T1539](https://attack.mitre.org/techniques/T1539/)\n[T1552](https://attack.mitre.org/techniques/T1552/)\n[T1528](https://attack.mitre.org/techniques/T1528/)\n\n\nCredentials from Password Stores\nSteal Web Session Cookie\nUnsecured Credentials\nSteal Application Access Token\n\n\n**Collection** [T1113](https://attack.mitre.org/techniques/T1113/) Screen Capture\n\n\n**Discovery** [T1087](https://attack.mitre.org/techniques/T1087/)\n[T1518](https://attack.mitre.org/techniques/T1518/)\n[T1057](https://attack.mitre.org/techniques/T1057/)\n[T1124](https://attack.mitre.org/techniques/T1124/)\n[T1007](https://attack.mitre.org/techniques/T1007/)\n[T1614](https://attack.mitre.org/techniques/T1614/)\n\n\nAccount Discovery\nSoftware Discovery\nProcess Discovery\nSystem Time Discovery\nSystem Service Discovery\nSystem Location Discovery\n\n\n**Command and Control** [T1071](https://attack.mitre.org/techniques/T1071/) Application Layer Protocol\n\n\n**Exfiltration** [T1041](https://attack.mitre.org/techniques/T1041/)\n[T1567](https://attack.mitre.org/techniques/T1567/)\n\n\nExfiltration Over C2 Channel\nExfiltration Over Web Service\n\n\n## Indicators of Compromise (IoCs): \n\n**Indicators** **Indicator**\n**type**\n\n\n**Description**\n\n\n-----\n\nab913c26832cd6e038625e30ebd38ec2\n\n719873f61eeb769493ac17d61603a6023a3db6dd\n\n1283c477e094db7af7d912ba115c77c96223208c03841768378a10d1819422f2\n\n0b75113f8a78dcc1dea18d0e9aabc10a\n\n269e61eed692911c3a886a108374e2a6d155c8d1\n808385d902d8472046e5899237e965d8087da09d623149ba38b3814659689906\n\n661842995f7fdd2e61667dbc2f019ff3\n\n1a638a81b9135340bc7d1f5e7eae5f3f06667a42\n\n4569670aca0cc480903b07c7026544e7e15b3f293e7c1533273c90153c46cc87\n\n\n**MD5**\n\n**SHA1**\n**SHA256**\n\n**MD5**\n\n**SHA1**\n**SHA256**\n\n**MD5**\n\n**SHA1**\n**SHA256**\n\n\nMalicious\nbinary\n\nMalicious\nbinary\n\nMalicious\nbinary\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-21 - Prynt Stealer Spotted In The Wild.pdf"
    ],
    "report_names": [
        "2022-04-21 - Prynt Stealer Spotted In The Wild.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535707,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653692827,
    "ts_modification_date": 1653692827,
    "files": {
        "pdf": "https://archive.orkl.eu/a0d8921422b526d0143a65fbaf4e9dccaa6ebcc0.pdf",
        "text": "https://archive.orkl.eu/a0d8921422b526d0143a65fbaf4e9dccaa6ebcc0.txt",
        "img": "https://archive.orkl.eu/a0d8921422b526d0143a65fbaf4e9dccaa6ebcc0.jpg"
    }
}