{
    "id": "8fbb7704-68d2-4742-9ebc-299756e23631",
    "created_at": "2023-01-12T15:10:18.816503Z",
    "updated_at": "2025-03-27T02:05:25.140165Z",
    "deleted_at": null,
    "sha1_hash": "751c3f9a5457577d3a3b4b731447c5f83ba48f2d",
    "title": "2022-08-16 - Cleartext Shenanigans- Gifting User Passwords to Adversaries With NPPSPY",
    "authors": "",
    "file_creation_date": "2022-10-02T12:01:00Z",
    "file_modification_date": "2022-10-02T12:01:00Z",
    "file_size": 4297883,
    "plain_text": "# Cleartext Shenanigans: Gifting User Passwords to Adversaries With NPPSPY\n\n**[huntress.com/blog/cleartext-shenanigans-gifting-user-passwords-to-adversaries-with-nppspy](https://www.huntress.com/blog/cleartext-shenanigans-gifting-user-passwords-to-adversaries-with-nppspy)**\n\nWhile investigating an intrusion, Huntress stumbled on something rather fascinating to do\nwith adversarial credential gathering.\n\nThreat actors are often retrospectively gathering credentials by dumping what’s already on\nthe system (like Mimikatz). Some tools, like Responder, let the threat actor listen networkwide and pick up some hashes that are whizzing around the Active Directory.\n\nBut it isn’t too common that we at Huntress see threat actors proactively manipulate a\nsystem not just to gather credentials, but to gather cleartext passwords*. Normally, we only\nsee this proactive effort via [UseLogonCredential registry manipulation.](https://www.csoonline.com/article/3438824/how-to-detect-and-halt-credential-theft-via-windows-wdigest.html)\n\nAnd yet, while investigating a recent intrusion, we found an unusual technique to steal\ncleartext creds.\n\nA threat actor had gained access to a complex network, dwelled in dark corners of the\n[environment, and then deployed Grzegorz Tworek's](https://twitter.com/0gtweet) [NPPSPY technique to ‘man in the](https://github.com/gtworek/PSBits/tree/master/PasswordStealing/NPPSpy)\n**middle’ the user logon process, and squirrel away the user’s name and password in an**\n**unassuming file.**\n\n\n-----\n\nIt seems that the community has documented this NPPSPY technique in theory, but so far it\nseems like no one has documented when they have encountered it maliciously deployed in\n**the** **wild.**\n\nIn this article, let’s have a look at when the Huntress team encountered this technique IRL.\n\n## What Does NPPSPY Do?\n\nBefore we go into the details of this tradecraft, I recorded a short video of how this technique\nworks. The TLDR here: it’s possible to man-in-the-middle the login process and save a\nuser’s password cleartext into a file on the file system:\n\n[I am simplifying the technique because I am a simpleton from Grzegorz’s notes [1,](https://www.youtube.com/watch?v=ggY3srD9dYs) [2] and](https://twitter.com/0gtweet/status/1465282548494487554?s=20&t=Hp4bI4d0cIuZGtl8Ulm0TQ)\n[Microsoft documentation. Many have already written about this technique and incorporated it](https://www.scip.ch/en/?labs.20220217)\n[into security frameworks, like Atomic Red’s suite of tests, so I won’t dwell too much on the](https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003/T1003.md#atomic-test-2---credential-dumping-with-nppspy)\ngranularity of this explanation.\n\nWhen you sit down to sign onto your machine and type in your password to authenticate, a\nbunch of different things are done on the back end with your credentials: hashing, checking,\nflying back and forth to a domain controller, etc.\n\nThe conversation between Winlogon and Local Security Authority Subsystem Service\n(LSASS) is most relevant for our instance. Winlogon is both the graphical user interface that\nwe use to put our credentials in, as well as the conversational partner with LSASS for letting\nyou sign in.\n\nIt’s more of a challenge to mess with LSASS to try and gather credentials, and so the\nNPPSPY technique takes the path of least resistance by focusing on Winlogon.\n\nWhen you give your password to Winlogon, it opens up an (RPC) channel to a mpnotify.exe\nand sends it over the password. Mpnotify then goes and tells some DLLs what’s up with this\ncredential.\n\nNPPSPY comes alive here. Mpnotify is maliciously told about a new adversarial network\nprovider to consider. This network provider is attacker-controlled and comes with a\nbackdoored DLL the adversary has created. This slippery DLL simply listens for this clear\ntext credential exchange from winlogon down to mpnotify and then saves this clear text\ncredential exchange.\n\n\n-----\n\n## What Did We Find in the Wild?\n\nLet me take you back to the case.\n\n[During this intrusion, the Godparents of DFIR, Jamie Levy and](https://twitter.com/gleeda) [Harlan Carvey, used their](https://twitter.com/keydet89)\nforensic wizardry to point the team to find and give some attention to a\n‘C:\\Windows\\System32\\lsass.dll’. They had identified that this had been associated with a\ncompromised account and advised us to go and determine what it was.\n\nNow, we’re all good noodles on the ThreatOps team, and if a Big Boss gives an order, you\nbet we’ll go get it DONE. We got the DLL, dissected it, hypothesized it was NPPSPY and\nthen deployed it in our local lab to verify this theory.\n\n\n-----\n\nAfter having tested locally, we then looked at the compromised system. Very satisfyingly, we\ncould account for the exact techniques the threat actor had leveraged.\n\nThe network provider in this instance was named logincontroll (typo intentional)\nIt occupied HKLM\\SYSTEM\\CurrentControlSet\\Control\\NetworkProvider\\Order and\ncreated value logincontrol\nAnd then pointed logincontroll with the path C:\\Windows\\System32\\lsass.dll at\nregistry\n**HKLM\\SYSTEM\\CurrentControlSet\\Services\\logincontroll\\NetworkProvider**\n\n\n-----\n\nBelow are screenshots from the compromised system:\n\nIn our lab and then on the compromised host, we identified that\n**C:\\Windows\\Temp\\tmpCQOF.tmp was the hardcoded file that the threat actor had**\ndesignated to listen and record the credentials as Username -> Password:\n\nNow I can’t show you what was in that file on the compromised system—only what was recreated in our testing environment. But trust me, seeing a tonne of cleartext usernames and\npasswords was WILD.\n\n## Outstanding Oddities\n\n\n-----\n\nYou know, something always interesting with investigations is that even when you reach one\nconclusion, there is always one thread out of place, waiting for you to pull, unravel and get\nfurther lost in the sauce.\n\nWe identified this tradecraft on a compromised Exchange server.\n\nRemember C:\\Windows\\Temp\\tmpCQOF.tmp, the file that kept a record of the cleartext\ncreds? Evidence suggested that email addresses and their corresponding clear text\n**_passwords made it into the dump._**\n\nThis was me upon that realization. Now, keeping in mind that I am a mere mindless\nmarmoset, I get easily confused. How did backdooring the local login process end up\nrounding up the email addresses and passwords for users authenticating to gather their\nemails, from this Exchange machine?\n\nTo try and wrap my head around what the evidence was showing, we sought counsel with\n[Huntress’ Researcher Tech Lead and Leader of the Council of the Wise, Dave Kleinatland](https://twitter.com/davekleinatland)\n🧙.\n\nDave agreed it was odd, but suggested\n\n\n-----\n\nExchange-related authentications CAN be swept up in NPPSPY s net for catching\ncleartext credentials in transit… If you're capturing creds on an Exchange box, you're\ndoing well.\n\nThis suggests that for NPPSPY, there are under-documented benefits to targeting specific\nservers in an Active Directory. We saw the evidence firsthand that hitting an Exchange box\nalso gathered the clear text creds for users just trying to access their emails.\n\n## Investigating and Defending\n\nA worry we had when putting this blog together is that by shining the spotlight on an\ninteresting, lesser deployed offensive security technique, Huntress would be partially\nresponsible for a spike in near future usage.\n\nAs such, we wanted to spend some time on how defenders can investigate and detect this.\n\nFor my red team colleagues, some places advise how to deploy NPPSPY. The default DLL\nthat Grzegorz kindly provides will get flagged by Defender, but Grzegorz’s kindness knows\nno bounds, and he provides the C code to compile it yourself.\n\n### Checking Live Systems\n\nGrzegorz [provides this script to look at the Network Providers and their associated DLL file](https://github.com/gtworek/PSBits/blob/master/PasswordStealing/NPPSpy/Get-NetworkProviders.ps1)\npaths.\n\nFrom a registry point of view, it’s a ‘service’, but it is not really a service and thus cannot be\ndetected as such. In the screenshot below, you can see NPPSPY comparison to the other\nlegitimate ones ‘logincontroll’ is relatively light on signatures, version numbers, or\ndescriptions. But it is considered trivial for threat actors to add many of these, so don’t rely\non the absence of these for detection.\n\n\n-----\n\n### Forensics\n\nLike a lot of things in infosec, Harlan seems to have already had all bases covered, no\nmatter how novel the technique.\n\n[By leveraging the services plugin for RegRipper v3.0, we will see the very suspicious service](https://github.com/keydet89/RegRipper3.0)\nname we have already identified with our threat actor’s implementation of NPPSPY.\n\n### Monitoring and Detecting\n\n\n-----\n\nThe file name that records the cleartext credentials is hardcoded from the source, and\ntherefore we do not have detection opportunities here.\n\nAlthough the NPPSPY docs advise dropping the DLL in C:\\windows\\System32, you don’t\nhave to. The example below demonstrates how an adversary can drop the required DLL\n**in any directory, like C:\\windows\\temp. Therefore, we do not have detection opportunities**\nhere for any required directories.\n\nThis NPPSPY technique is noisy. And detecting this is possible with various security\nmonitoring tools that monitor the processes and commands being run on a machine. You\n[could use Sysmon as a free option. At Huntress, we have our Process Insights listener that](https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon)\nmakes parent-child process lineage easy to follow.\n\n\n-----\n\nThere are several detection opportunities for NPPSPY, as adversaries have to\n\nBe a privileged user\nCreate and manipulate a number of registry entries\nBring a DLL on disk\nAnd then write clear text creds to a file somewhere\n\n[Elastic has a rule query for this kind of network provider manipulation. They assign it a](https://www.elastic.co/guide/en/security/current/network-logon-provider-registry-modification.html)\nseverity medium... personally, I’d assign this kind of activity to be a super nuclear critical...\nbut that’s just me.\n\n### IOCs and Behavior\n\n[OS Credential Dumping - ATT&CK T1003](https://attack.mitre.org/techniques/T1003/)\n**Values under HKLM\\SYSTEM\\CurrentControlSet\\Control\\NetworkProvider\\Order**\n\nFor our case: logincontroll\nUnexplained entries in HKLM\\SYSTEM\\CurrentControlSet\\Services\\\n**<here>\\NetworkProvider**\n\nFor our case: logincontroll\nUnexplained DLLS in folders (very difficult to detect)\n\nFor our case: `C:\\windows\\system32\\lsass.dll`\nFiles being continually written too (essentially impossible to detect this IMO)\n\nFor our case: `C:\\Windows\\Temp\\tmpCQOF.tmp`\n\n### Remediating\n\nTo remediate and eradicate this wickedness, we tested furiously with our virtual machine\nsnapshots.\n\nDeleting only C:\\windows\\system32\\<attacker.dll> stops the credential file being\nwritten to\nDeleting only the key HKLM:\\SYSTEM\\CurrentControlSet\\Services\\<Attacker\n**provider name>\\NetworkProvider stops the credential file being written to**\n\nTherefore deleting both the attacker-controlled DLL and the registry entry will stop the\ncleartext credential gathering activity for sure.\n\nBelow is an extract of the report the partner received from us, which allowed one-click\nautomatic remediations to undo the ensnarement NPPSPY had placed the machine under.\n\n\n-----\n\n## So, the Bad Actors Won?\n\nSome may point the blame at security researchers in these instances. It’s easy to assume\nthat because they create techniques and share proofs of concept, that they are the root of\nevil in the cybercriminal ecosystem.\n\nThis couldn’t be further from the truth. The problem is not offensive security research. The\nproblem is cybercriminals.\n\nWhile this technique was cooked up by a security researcher, the threat actor could have\nleveraged a whole plethora of other malicious techniques to achieve their goals—this was\njust one of them, albeit a spicy one.\n\nOffensive security research helps us defenders stay sharp, and motivate us to constantly\nimprove our tradecraft. Those attackers got in somehow, and there are always lessons to\nlearn about hardening defenses and imposing cost on dipsh*t adversaries.\n\nTechniques like NPPSPY have probably been deployed in the wild before. From what we can\ntell, Huntress seems to be the first at sharing and documenting its IRL usage by threat\nactors. Offensive tools do not remain elusive and mysterious for long once the defensive\ncommunity gives them some attention.\n\nWe hope this article is a small contribution that helps the community fight back and conjure\nbetter defenses! And speaking of conjuring, digital forensics, Jamie Levy and Harlan Carvey,\nyou won't want to miss the September 2022 episode of Tradecraft Tuesday.\n\n\n-----\n\n- • •\n\n### Addendum: cleartext vs. plaintext\n\n*I consulted NIST docs to conclude what NPPSPY is. A rough overview is that cleartext\nmeans un-encrypted text, whereas plaintext is the text involved in a more complicated\ncryptographic exchange.\n\nOf course, if a password is about to be input into a cryptographic authentication like one\ndoes for a Windows login, wouldn’t that make it plaintext? Potentially. But NPPSPY\nseemingly takes place before cryptography really gets involved, and therefore it seems more\nappropriate to weigh in on the side of cleartext.\n\n[If anyone has any strong feelings otherwise, please @ me on Twitter.](https://twitter.com/Purp1eW0lf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-16 - Cleartext Shenanigans- Gifting User Passwords to Adversaries With NPPSPY.pdf"
    ],
    "report_names": [
        "2022-08-16 - Cleartext Shenanigans- Gifting User Passwords to Adversaries With NPPSPY.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536218,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1664712060,
    "ts_modification_date": 1664712060,
    "files": {
        "pdf": "https://archive.orkl.eu/751c3f9a5457577d3a3b4b731447c5f83ba48f2d.pdf",
        "text": "https://archive.orkl.eu/751c3f9a5457577d3a3b4b731447c5f83ba48f2d.txt",
        "img": "https://archive.orkl.eu/751c3f9a5457577d3a3b4b731447c5f83ba48f2d.jpg"
    }
}