{
    "id": "8fcc0a3d-9c3f-4b13-82e5-7f41a7261961",
    "created_at": "2023-01-12T15:09:57.595339Z",
    "updated_at": "2025-03-27T02:14:05.958889Z",
    "deleted_at": null,
    "sha1_hash": "7c99918a6075cdb0fc1ee6f3c12e925fdba115a4",
    "title": "2022-12-22 - Custom-Branded Ransomware- The Vice Society Group and the Threat of Outsourced Development",
    "authors": "",
    "file_creation_date": "2022-12-29T00:39:39Z",
    "file_modification_date": "2022-12-29T00:39:39Z",
    "file_size": 1848906,
    "plain_text": "# Custom-Branded Ransomware: The Vice Society Group and the Threat of Outsourced Development\n\n**[sentinelone.com/labs/custom-branded-ransomware-the-vice-society-group-and-the-threat-of-outsourced-development/](https://www.sentinelone.com/labs/custom-branded-ransomware-the-vice-society-group-and-the-threat-of-outsourced-development/)**\n\nAntonio Cocomazzi\n\n## Executive Summary\n\nThe Vice Society group has adopted a new custom-branded ransomware payload in recent\nintrusions\nThis ransomware variant, dubbed “PolyVice”, implements a robust encryption scheme, using\nNTRUEncrypt and ChaCha20-Poly1305 algorithms\nWe assess it is likely that the group behind the custom-branded ransomware for Vice Society is also\nselling similar payloads to other groups\n\n## Background\n\n[First identified in June 2021, Vice Society is a well-resourced ransomware group that has successfully](https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/)\n[breached various types of organizations. Using the classic double extortion technique, they set about](https://www.sentinelone.com/blog/ransoms-without-ransomware-data-corruption-and-other-new-tactics-in-cyber-extortion/)\nmaximizing financial gain with purely opportunistic targeting. In recent months, Vice Society has\nexpanded its target selection strategy to include additional sensitive sectors.\n\nThe TTPs are nothing new. They include initial network access through compromised credentials,\n[exploitation of known vulnerabilities (e.g., PrintNightmare), internal network reconnaissance, abuse of](https://www.sentinelone.com/blog/printnightmare-latest-patch-almost-puts-microsoft-vulnerability-to-bed/)\nlegitimate tools (aka COTS and [LOLBins), commodity backdoors, and data exfiltration.](https://www.sentinelone.com/blog/how-do-attackers-use-lolbins-in-fileless-attacks/)\n\nRather than using or developing their own locker payload, Vice Society operators have deployed third[party ransomware in their intrusions, including HelloKitty, Five Hands, and Zeppelin.](https://www.sentinelone.com/labs/hellokitty-ransomware-lacks-stealth-but-still-strikes-home/)\n\n\n-----\n\n## Vice Society Ransomware and Links to Other Ransomware Variants\n\nIn a recent intrusion, we identified a ransomware deployment that appended the file extension\n```\n.ViceSociety to all encrypted files in addition to dropping ransom notes with the file name “AllYFilesAE”\n\n```\nin each encrypted directory.\n\nOur initial analysis suggested the ransomware, which we dubbed “PolyVice”, was in the early stages of\ndevelopment. The presence of debugging messages suggested that the Vice Society group may be\ndeveloping their own ransomware implementation.\n\n[Zeppelin ransomware, previously seen used by the group, was recently found to implement a weak](https://www.bleepingcomputer.com/news/security/researchers-secretly-helped-decrypt-zeppelin-ransomware-for-2-years/)\nencryption scheme that allows for decryption of locked files, potentially motivating the group to adopt a\nnew locker.\n\nHowever, further investigation showed that a decryptor related to the PolyVice variant first appeared in\nthe wild on July 13, 2022, indicating that the locker could not have been in the early stages of\ndevelopment and that a “release” version existed prior to the group’s use of Zeppelin and other\nransomware variants.\n\nOur analysis suggests that Vice Society has used a toolkit overpopulated with different ransomware\nstrains and variants.\n\nWe identified significant overlap in the encryption implementation observed in the “RedAlert”\n[ransomware, a Linux locker variant targeting VMware ESXi servers, suggesting that both variants](https://www.esentire.com/blog/esentire-threat-intelligence-malware-analysis-redalert)\nwere developed by the same group of individuals.\n\nAccording to [Microsoft, Vice Society adopted the RedAlert variant in late September 2022. We](https://www.microsoft.com/en-us/security/blog/2022/10/25/dev-0832-vice-society-opportunistic-ransomware-campaigns-impacting-us-education-sector/)\nhaven’t been able to confirm if a RedAlert Windows variant payload existed in the wild at the time,\nor if the Windows variant we track as PolyVice has any relation with it.\n\nFurther investigation also revealed that the codebase used to build the Vice Society Windows payload\nhas been used to build custom-branded payloads for other threat groups, including the “Chily” and\n“SunnyDay” ransomware.\n\nCode similarities between Vice Society and Chily Ransomware\n\n\n-----\n\nCode similarities between Vice Society and SunnyDay Ransomware\nThese numbers provide clear evidence that the code is maintained by the same developers.\n\nThe Vice Society branded payload has 100% matched functions compared to the Chily branded\npayload, indicating that the executable codebase is identical.\n\nThe SunnyDay branded payload is an older version of the codebase that has a 100% match on 410\nfunctions and is missing an additional 37 net new functions implemented in the Vice Society\ncodebase.\n\nThe real difference is in the intended use of the code exemplified by the data section, where all of the\nransomware campaign details are stored, such as the encrypted file extension, ransom note file name,\nhardcoded master key, ransom note content, and wallpaper text.\n\nData section comparison Vice Society (above) Chily Ransomware (below)\n\n\n-----\n\nWe assess it s likely that a previously unknown developer or group of developers with specialized\nexpertise in ransomware development is selling custom-branded ransomware payloads to multiple\ngroups. The details embedded in these payloads make it highly unlikely that Vice Society, SunnyDay, and\nChily ransomware are operated by the same group.\n\nThe delivery method for this “Locker as a Service” is unclear, but the code design suggests the\nransomware developer provides a builder that enables buyers to independently generate any number of\nlockers/decryptors by binary patching a template payload. This allows buyers to customize their\nransomware without revealing any source code. Unlike other known RaaS builders, buyers can generate\nbranded payloads, enabling them to run their own RaaS programs.\n\n## Analyzing PolyVice | Initialization of the NTRU Asymmetric Keys\n\nPolyVice ransomware is a 64-bit Windows binary compiled with MinGW (SHA1:\n```\nc8e7ecbbe78a26bea813eeed6801a0ac9d1eacac)\n\n```\nPolyVice implements a hybrid encryption scheme that combines asymmetric and symmetric encryption to\nsecurely encrypt files.\n\n[For asymmetric encryption, it uses an open source implementation of the](https://github.com/tbuktu/libntru) [NTRUEncrypt algorithm, which](https://en.wikipedia.org/wiki/NTRUEncrypt)\n[is known to be quantum-resistant. For symmetric encryption, it uses an open source implementation of](https://github.com/grigorig/chachapoly)\nthe [ChaCha20-Poly1305 algorithm, a stream cipher with message authentication, a 256-bit key and 96-bit](https://en.wikipedia.org/wiki/ChaCha20-Poly1305)\nnonce.\n\nIn the initialization phase, it imports a hardcoded NTRU Public Key generated offline with the provider\nEES587EP1 (192 bits strength):\n\nCode to import the hardcoded master NTRU public key\nSubsequently, a new random NTRU key pair is generated on the victim system at runtime with the\nprovider EES401EP2 (112 bits strength):\n\n\n-----\n\nNTRU key pairs runtime initialization\nThe newly generated NTRU key pair is unique to each execution and tied to the victim system. This is the\nkey that will be used for encrypting the ChaCha20-Poly1305 symmetric keys.\n\nIn order to protect the generated NTRU private key, the ransomware encrypts it through the\n```\nntru_encrypt function with the hardcoded NTRU public key (also referred as the master public key):\n\n```\nCode to protect the NTRU private key\nThe encrypted NTRU private key of the system generated at runtime is stored in a configuration blob. The\nconfiguration blob is contained within a custom data structure “CustomConfigBlog”:\n\nCustomConfigBlog data structure definition\n\nMoreover, in the configuration blob is stored the random NTRU public key generated on the system:\n\nCode to export the NTRU public key generated at runtime\nThe configuration blob is stored in a global variable, allowing it to be retrieved during the symmetric\nencryption preparation stage. Once the initialization of the NTRU keys is complete, the malware proceeds\nto implement a method for parallelizing the encryption routine across multiple workers. This speeds up\nthe encryption process and makes it more efficient.\n\n## Parallelizing Encryption\n\n\n-----\n\nThe PolyVice locker utilizes a multi-threading approach to parallelize the encryption of the files.\n\n[This is achieved through the CreateThread function to spawn multiple workers and the synchronization](https://learn.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-createthread)\n[with the main thread occurs with a WaitForMultipleObject call.](https://learn.microsoft.com/en-us/windows/win32/api/synchapi/nf-synchapi-waitformultipleobjects)\n\nIn order to exchange data between the main thread and the worker threads, it uses an I/O Completion\n[Port, a helper function exposed through the Win32 API call CreateIoCompletionPort that provides an](https://learn.microsoft.com/en-us/windows/win32/fileio/createiocompletionport)\nefficient way to manage concurrent asynchronous I/O requests through a queue.\n\nMore specifically, PolyVice uses the following data structure to exchange data between the main thread\nand the workers:\n\n_CustomCompletionPortStruct data structure definition_\n\n## Worker Threads\n\nThe worker threads are in charge of the symmetric encryption of the files content. Each thread constantly\npolls for an I/O completion packet from the global I/O completion port. The packet received from\n[GetQueuedCompletionStatus contains a data structure CustomCompletionPortStruct that is expected to](https://learn.microsoft.com/en-us/windows/win32/api/ioapiset/nf-ioapiset-getqueuedcompletionstatus)\nbe populated by the main thread in the symmetric encryption preparation stage. All the required data to\nperform the file encryption are contained in this data structure.\n\nEach worker thread implements all of the operations to read the file content, perform the ChaCha20Poly1305 encryption, writing the encrypted blocks back to the file and append the file footer:\n\n\n-----\n\nWorker threads code\nThis payload, like many modern ransomware variants, employs optimization techniques in its encryption\nroutine to improve speed. These optimization efforts often involve additional care in the reading and\nwriting of file chunks.\n\nThe manner in which these optimizations are carried out is determined by specific parameters set in the\n```\nCustomCompletionPortStruct data structure, which is passed to the completion port by the main thread\n\n```\nduring the symmetric encryption preparation stage. The core element that dictates the use of these\noptimization techniques is the size of the file.\n\nThe two functions for reading and writing the file content are shown below:\n\n\n-----\n\nFile blocks Read (left) / Write (right) logics\nDue to the compiler optimizations, the code flow of the two functions looks twisted. The code logic can be\nsummarized (with file sizes rounded for the sake of simplicity) as follows:\n\nFiles smaller than 5MB are fully encrypted.\nFiles with a size between 5MB and 100MB are partially encrypted:\n\nA total of 5MB of content is encrypted by splitting them into 2 chunks of 2.5MB. First chunk\nfrom the top and the second chunk from the bottom of the file.\nFiles bigger than 100MB are partially encrypted:\n\nA total of 25MB of content is encrypted in intermittent mode split into 10 chunks of 2.5MB\ndistributed every 10% of the file size.\n\nThe final step in the encryption process is the addition of a file footer to each encrypted file. This is an\nessential step because the file footer contains the necessary information to decrypt the file that can be\nunlocked only by the master private key holder (usually the attacker).\n\nThe following data structure is appended as file footer to each encrypted file:\n\n_CustomFileFooter data structure_\n\ndefinition\n\n## Main Thread Functionality\n\nOnce the main thread has completed the setup of all worker threads running in the background, the\nransomware proceeds to the file enumeration stage. If no arguments are provided to the process\ncommand line, the ransomware will execute its default behavior.\n\n\n-----\n\nThis involves the enumeration of all local and remote drives, including network shares:\n\nMain\n\nthread file enumeration routine\nFor each discovered drive, the function EnumAndEncryptFilesFromPath (pseudo name) is invoked with\n[the root path as its input parameter. This function uses the Win32 API calls FindFirstFile and](https://learn.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-findfirstfilew) [FindNextFile](https://learn.microsoft.com/en-us/windows/win32/api/fileapi/nf-fileapi-findnextfilew)\nto retrieve the paths of all files from all directories and subdirectories within the starting path.\n\nWhen a new file is discovered, the symmetric encryption preparation stage is invoked through the\nfunction PrepareFileForSymmetricEncryption (pseudo name), and the ransom note is copied into the\nenumerated directory:\n\nCode for EnumAndEncryptFilesFromPath function\nThe PrepareFileForSymmetricEncryption function is used for the symmetric encryption preparation\nstage:\n\n\n-----\n\nCode for PrepareFileForSymmetricEncryption function\nThe function sets up the CustomCompletionPortStruct data structure with the information needed for\nsymmetric encryption of the file. It then generates and stores a new ChaChaPoly symmetric key and\nnonce in the data structure. It is important to note that this initialization is performed for each file to be\nencrypted, ensuring that each file has a unique symmetric key. The ChaChaPoly symmetric key and\nnonce are then encrypted using the NTRU public key generated at runtime on the victim system. Once\nthis is done, the file is ready for encryption and all the required data is set up in the data structure.\n\n[The main thread sends the data structure to the completion port via PostQueuedCompletionStatus,](https://learn.microsoft.com/en-us/windows/win32/fileio/postqueuedcompletionstatus)\nwhere it will be retrieved by one of the worker threads that is currently available for processing.\n\nAfter enumerating all the files and sending them to the worker threads, the main thread will use the\n[WaitForMultipleObjects function to wait until all worker threads have completed their symmetric](https://learn.microsoft.com/en-us/windows/win32/api/synchapi/nf-synchapi-waitformultipleobjects)\nencryption tasks.\n\nThe strong encryption scheme and emphasis on performance optimization suggest that the ransomware\nwas likely developed by an experienced developer or team of developers who are familiar with\nransomware development.\n\n## Conclusion\n\nThe Vice Society group has established itself as a highly-resourced and capable threat actor, capable of\nsuccessfully carrying out ransom attacks against large environments and with connections within the\ncriminal underground.\n\nThe adoption of the PolyVice Ransomware variant has further strengthened their ransomware\ncampaigns, enabling them to quickly and effectively encrypt victims’ data using a robust encryption\nscheme.\n\nThe [ransomware ecosystem is constantly evolving, with the trend of hyperspecialization and outsourcing](https://www.sentinelone.com/blog/ransoms-without-ransomware-data-corruption-and-other-new-tactics-in-cyber-extortion/)\ncontinuously growing. These groups are focusing on specific skill sets and offering them as a service to\nother groups, effectively mimicking traditional “professional services” and lowering barriers to entry for\nless capable groups.\n\n\n-----\n\nThis trend towards specialization and outsourcing presents a significant threat to organizations as it\nenables the proliferation of sophisticated ransomware attacks. It is crucial for organizations to be aware of\nthis trend and take steps to protect themselves against these increasingly sophisticated threats.\n\n## Indicators of Compromise\n\n**Type** **Value** **Note**\n\nSHA1 c8e7ecbbe78a26bea813eeed6801a0ac9d1eacac “Vice\nSociety”\nbranded\nransomware\npayload\n(PolyVice)\n\nSHA1 342c3be7cb4bae9c8476e578ac580b5325342941 “Vice\nSociety”\nbranded\nransomware\npayload\n(PolyVice)\n\nSHA256 f366e079116a11c618edcb3e8bf24bcd2ffe3f72a6776981bf1af7381e504d61 “Vice\nSociety”\nbranded\nransomware\npayload\n(PolyVice)\n\nSHA1 da6a7e9d39f6a9c802bbd1ce60909de2b6e2a2aa “RedAlert”\nbranded\nransomware\nlinux variant\n\nSHA256 039e1765de1cdec65ad5e49266ab794f8e5642adb0bdeb78d8c0b77e8b34ae09 “RedAlert”\nbranded\nransomware\nlinux variant\n\nSHA1 2b3fea431f342c7b8bcff4b89715002e44d662c7 “SunnyDay”\nbranded\nransomware\npayload\n\nSHA256 7b379458349f338d22093bb634b60b867d7fd1873cbd7c65c445f08e73cbb1f6 “SunnyDay”\nbranded\nransomware\npayload\n\nSHA1 6cfb5b4a68100678d95270e3d188572a30abd568 “Chily”\nbranded\nransomware\npayload\n\n\n-----\n\nSHA256 4dabb914b8a29506e1eced1d0467c34107767f10fdefa08c40112b2e6fc32e41 “Chily”\nbranded\nransomware\npayload\n\nSHA1 a0f58562085246f6b544b7e24dc78c17ce7ed5ad NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\nSHA256 9d9e949ecd72d7a7c4ae9deae4c035dcae826260ff3b6e8a156240e28d7dbfef NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\nSHA1 0abc350662b81a7c81aed0676ffc70ac75c1a495 NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\nSHA256 326a159fc2e7f29ca1a4c9a64d45b76a4a072bc39ba864c49d804229c5f6d796 NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\nSHA1 3105d6651f724ac90ff5cf667a600c36b0386272 NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\nSHA256 8c8cb887b081e0d92856fb68a7df0dabf0b26ed8f0a6c8ed22d785e596ce87f4 NTRUChaChaPoly\n(PolyVice)\nransomware\ndecryptor\n\n\nFile\nextension\n\nFile\nextension\n\nFile\nname\n\n\n.ViceSociety Vice Society\nfile\nextension\nappended to\nencrypted\nfiles\n\n.v-society Vice Society\nfile\nextension\nappended to\nencrypted\nfiles\n\nAllYFilesAE Vice Society\nransom note\nfile name\n\n\n-----\n\nFile\nname\n\nEmail\naddress\n\nEmail\naddress\n\nEmail\naddress\n\nEmail\naddress\n\nEmail\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\nTor\naddress\n\n\nALL YOUR FILES ARE ENCRYPTED!!! Vice Society\nransom note\nfile name\n\n[[email protected][.]org](https://www.sentinelone.com/cdn-cgi/l/email-protection) Vice Society\nmain email\n\n[[email protected][.]org](https://www.sentinelone.com/cdn-cgi/l/email-protection) Vice Society\nalternative\nemail\n\n[[email protected][.]org](https://www.sentinelone.com/cdn-cgi/l/email-protection) Vice Society\nalternative\nemail\n\n[[email protected][.]org](https://www.sentinelone.com/cdn-cgi/l/email-protection) Vice Society\nalternative\nemail\n\n[[email protected][.]org](https://www.sentinelone.com/cdn-cgi/l/email-protection) Vice Society\nalternative\nemail\n\nvsociethok6sbprvevl4dlwbqrzyhxcxaqpvcqt5belwvsuxaxsutyad[.]onion Vice Society\nmain tor\nwebsite\n\nvsocietyjynbgmz4n4lietzmqrg2tab4roxwd2c2btufdwxi6v2pptyd[.]onion Vice Society\nmirror tor\nwebsite\n\nssq4zimieeanazkzc5ld4v5hdibi2nzwzdibfh5n5w4pw5mcik76lzyd[.]onion Vice Society\nmirror tor\nwebsite\n\nwmp2rvrkecyx72i3x7ejhyd3yr6fn5uqo7wfus7cz7qnwr6uzhcbrwad[.]onion Vice Society\nmirror tor\nwebsite\n\nml3mjpuhnmse4kjij7ggupenw34755y4uj7t742qf7jg5impt5ulhkid[.]onion Vice Society\nmirror tor\nwebsite\n\nfuckcisanet5nzv4d766izugxhnqqgiyllzfynyb4whzbqhzjojbn7id[.]onion Vice Society\nmirror tor\nwebsite\n\nfuckfbrlvtibsdw5rxtfjxtog6dfgpz62ewoc2rpor2s6zd5nog4zxad[.]onion Vice Society\nmirror tor\nwebsite\n\nwjdgz3btk257obba7aekowz7ylm33zb6hu4aetxc3bypfajixzvx4iad[.]onion RedAlert tor\nwebsite\n\n\n## Yara Hunting Rules\n\n\n-----\n\n```\n u e _ _ a so a e_ ceSoc ety {\n meta:\n\n  author = \"Antonio Cocomazzi @ SentinelOne\"\n\n  description = \"Detect a custom branded version of Vice Society ransomware\"\n\n  date = \"2022-11-28\"\n\n  reference = \"https://www.sentinelone.com/labs/custom-branded-ransomware-the-vice-societygroup-and-the-threat-of-outsourced-development\"\n\n  hash = \"c8e7ecbbe78a26bea813eeed6801a0ac9d1eacac\"\n\n strings:\n\n  $code1 = {4? 8B ?? 28 00 02 00 }\n\n  $code2 = {4? C7 ?? 18 03 02 00 A3 00 00 00}\n\n  $code3 = {(48|49) 8D 8? 58 00 02 00}\n\n  $code4 = {(48|49) 8D 9? E8 02 02 00}\n\n  $code5 = {(48|4C) 89 ?? 24 38}\n\n  $code6 = {4? 8B ?? F8 02 02 00}\n\n  $code7 = {C7 44 24 48 01 00 00 00}\n\n  $string1 = \"vsociet\" nocase wide ascii\n\n condition:\n\n  uint16(0) == 0x5A4D and all of them\n\n}\n\nrule MAL_Win_Ransomware_PolyVice {\n\n meta:\n\n  author = \"Antonio Cocomazzi @ SentinelOne\"\n\n  description = \"Detect a windows ransomware variant tracked as PolyVice adopted by multiple\nthreat actors\"\n\n  date = \"2022-11-28\"\n\n  reference = \"https://www.sentinelone.com/labs/custom-branded-ransomware-the-vice-societygroup-and-the-threat-of-outsourced-development\"\n\n  hash1 = \"c8e7ecbbe78a26bea813eeed6801a0ac9d1eacac\"\n\n  hash2 = \"6cfb5b4a68100678d95270e3d188572a30abd568\"\n\n  hash3 = \"2b3fea431f342c7b8bcff4b89715002e44d662c7\"\n\n strings:\n\n  $code1 = {4? 8B ?? 28 00 02 00 }\n\n  $code2 = {4? C7 ?? 18 03 02 00 A3 00 00 00}\n\n  $code3 = {(48|49) 8D 8? 58 00 02 00}\n\n  $code4 = {(48|49) 8D 9? E8 02 02 00}\n\n  $code5 = {(48|4C) 89 ?? 24 38}\n\n  $code6 = {4? 8B ?? F8 02 02 00}\n\n  $code7 = {C7 44 24 48 01 00 00 00}\n\n condition:\n\n  uint16(0) == 0x5A4D and all of them\n\n}\n\n```\n\n-----\n\n```\n u e _ _ a so a e_ ed e t {\n meta:\n\n  author = \"Antonio Cocomazzi @ SentinelOne\"\n\n  description = \"Detect a linux ransomware variant dubbed as RedAlert\"\n\n  date = \"2022-11-28\"\n\n  reference = \"https://www.sentinelone.com/labs/custom-branded-ransomware-the-vice-societygroup-and-the-threat-of-outsourced-development\"\n\n  hash = \"da6a7e9d39f6a9c802bbd1ce60909de2b6e2a2aa\"\n\n strings:\n\n  $code1 = {BA 48 00 00 00 BE [4] BF [4] E8 [4] BA 48 00 00 00 BE [4] BF [4] E8}\n\n  $code2 = {BF [4] 66 [6] 6B 06 E8}\n\n  $code3 = {B9 02 00 00 00 [0-12] BE 14 00 00 00 BF}\n\n  $code4 = {49 81 FE 00 00 50 00 [0-12] 0F}\n\n  $code5 = {49 81 FE 00 00 40 06 [0-12] 0F}\n\n condition:\n\n  uint32(0) == 0x464c457f and all of them\n\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-12-22 - Custom-Branded Ransomware- The Vice Society Group and the Threat of Outsourced Development.pdf"
    ],
    "report_names": [
        "2022-12-22 - Custom-Branded Ransomware- The Vice Society Group and the Threat of Outsourced Development.pdf"
    ],
    "threat_actors": [
        {
            "id": "84aa9dbe-e992-4dce-9d80-af3b2de058c0",
            "created_at": "2024-02-02T02:00:04.041676Z",
            "updated_at": "2025-03-27T02:00:03.297502Z",
            "deleted_at": null,
            "main_name": "Vanilla Tempest",
            "aliases": [
                "DEV-0832",
                "Vice Society"
            ],
            "source_name": "MISPGALAXY:Vanilla Tempest",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "600a0c3b-b595-4d10-b84b-cc2cf89289ac",
            "created_at": "2024-06-19T02:03:08.134296Z",
            "updated_at": "2025-03-27T02:05:17.402638Z",
            "deleted_at": null,
            "main_name": "GOLD VICTOR",
            "aliases": [
                "STAC5279 ",
                "Vanilla Tempest ",
                "Vice Society",
                "DEV-0832 "
            ],
            "source_name": "Secureworks:GOLD VICTOR",
            "tools": [
                " Advanced Port Scanner",
                " HelloKitty ransomware",
                " MEGAsync",
                " Neshta",
                " PAExec",
                " PSexec",
                " PortStarter",
                " SystemBC",
                " Zeppelin ransomware",
                "Advanced IP Scanner"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536197,
    "ts_updated_at": 1743041645,
    "ts_creation_date": 1672274379,
    "ts_modification_date": 1672274379,
    "files": {
        "pdf": "https://archive.orkl.eu/7c99918a6075cdb0fc1ee6f3c12e925fdba115a4.pdf",
        "text": "https://archive.orkl.eu/7c99918a6075cdb0fc1ee6f3c12e925fdba115a4.txt",
        "img": "https://archive.orkl.eu/7c99918a6075cdb0fc1ee6f3c12e925fdba115a4.jpg"
    }
}