{
    "id": "8fe88097-88f5-4b5a-a0dd-2ba6966aa939",
    "created_at": "2023-01-12T15:05:31.482547Z",
    "updated_at": "2025-03-27T02:08:36.14432Z",
    "deleted_at": null,
    "sha1_hash": "f567170cc9aac54d570e9288effff8dbc8b6ee5b",
    "title": "2016-10-25 - TrickBot Banker Insights",
    "authors": "",
    "file_creation_date": "2011-02-10T11:33:14Z",
    "file_modification_date": "2011-02-16T12:38:35Z",
    "file_size": 1803944,
    "plain_text": "-----\n\n**Bureau of Justice Assistance**\n**U.S. Department of Justice**\n\nThis project was supported by Grant No. 2009-BE-BX-K042 awarded by the Bureau of Justice Assistance. The Bureau\nof Justice Assistance is a component of the Office of Justice Programs, which also includes the Bureau of Justice\nStatistics, the National Institute of Justice, the Office of Juvenile Justice and Delinquency Prevention, the SMART\nOffice, and the Office for Victims of Crime. Points of view or opinions in this document are those of the author and do\nnot represent the official position or policies of the United States Department of Justice. The National White Collar\nCrime Center (NW3C) is the copyright owner of this document. This information may not be used or reproduced in\nany form without the express written permission of NW3C. This publication is also available for download in PDF\nformat at www.nw3c.org or www.ic3.gov. NW3C[TM], IC3[® ]and ICSIS[TM ]are trademarks of NW3C, Inc. and may not be\nused without written permission.\n\n\n-----\n\n### Table of Contents\n\nExecutive Summary…………………………………………………………………………………………………………………………..4\nHistory……………………………………………………………………………………………………………………………………………...5\nCutting-Edge Approach To Fighting Internet Crime………………………………………………………………………….. 5\nInternet Crime Trends………………………………………………………………………………………………………………………. 6\nInternet Crime Working Group…………………………………………………………………………………………………………..6\nGeneral IC3 Filing Information………………………………………………………………………………………………………….7\nPublic Education - Top Five Questions Emailed to IC3……………………………………………………………………….8\nComplaint Characteristics……………………………………………………………………………………………………………….. 9\nComplainant-Perpetrator Demographics………………………………………………………………………………………….. 9\nComplainant Demographics…………………………………………………………………………………………………………….. 9\nPerpetrator Demographics…………………………………………………………………………………………………………….... 9\nSuccess Stories……………………………………………………………………………………………………………………………….. 12\nNot So Free Samples……………………………………………………………………………………………………………………………………………………….12\nFraud on the Wire…………………………………………………………………………………………………………………………………………………………...12\nFalse Advertisement………………………………………………………………………………………………………………………………………………………..12\nInternational Assistance…………………………………………………………………………………………………………………………………………………..12\nIC3 Scam Alerts of 2010…………………………………………………………………………………………………………………..13\nMystery/Secret Shopper Schemes…………………………………………………………………………………………………………………………………..13\nNew Twist on Counterfeit Check Schemes Targeting U.S. Law Firms…………………………………………………………………………………..13\nNational Center for Disaster Fraud to Coordinate Haitian and Chilean Fraud Complaints…………………………………………………....14\nRental and Real Estate Scams………………………………………………………………………………………………………………………………………...15\nFraudulent Telephone Calls Allowing Fraudsters Access to Consumer Financial and Brokerage Accounts…………………………...15\nClaims of Being Stranded Swindle Consumers Out of Thousands Dollars…………………………………………………………………………..15\nFraudulent Notifications Deceive Consumers Out of Thousands of Dollars…………………………………………………………………………16\nTelephone Collection Scams Related to Delinquent Payday Loans……………………………………………………………………………………..16\nConclusion………………………………………………………………………………………………………………………………………..17\nAppendix I: Definitions of Complaint Types………………………………………………………………………………………. 18\nAppendix II: Complainant/Perpetrator Statistics ……………………………………………………………………………...20\n\nList of Tables\nTable 1: ICSIS Statistics…………………………………………………………………………………………………………………………………….............. 6\nTable 2: IC3.gov Statistics……………………………………………………………………………………………………………………………………............6\nTable 3: Top 10 Crime Types…………………………………………………………………………………………………………………………………………….9\nTable 4: Top 10 Crime Types (Referred Complaints)…………………………………………………………………………………………………………..9\nTable 5: Perpetrators from Same State as Complainant…………………………………………………………………………………………………….9\nTable 6: Top 10 Complainant States per 100,000 Population…………………………………………………………………………………………...10\nTable 7: Complaint Categories and Subcategories………………………………………………………………………………………………………....... 18\nTable 8: Complainant Statistics by State……………………………………………………………………………………………………………………….....20\nTable 9: Perpetrator Statistics by State………………………………………………………………………………………………………………………….... 21\nTable 10: Complainants per 100,000 Population………………………………………………………………………………………………………………22\nTable 11: Perpetrators per 100,000 Population………………………………………………………………………………………………………………..23\n\nList of Figures\nFigure 1: Complainant Demographic by Age……………………………………………………………………………………………………………………..6\nFigure 2: Yearly Comparison of Complaints Received Via the IC3 Website………………………………………………………………………….7\nFigure 3: Yearly Number of Referrals………………………………………………………………………………………………………………………………..7\n\nList of Maps\nMap 1: Geographic Distribution of Cases………………………………………………………………………………………………………………………….5\nMap 2: Top 10 States by Count: Individual Complainants………………………………………………………………………………………………….10\nMap 3: Top 10 Countries by Count: Individual Complainants……………………………………………………………………………………………..10\n\n\n-----\n\n#### 2010 Internet Crime Report\n# 1\n\n##### Executive Summary\n\nNow in its tenth year, the Internet Crime Complaint Center (IC3) has become a vital resource\nfor victims of online crime and for law enforcement investigating and prosecuting offenders.\n\nIn 2010, IC3 received the second-highest number of complaints since its inception. IC3 also\nreached a major milestone this year when it received its two-millionth complaint. On average,\nIC3 receives and processes 25,000 complaints per month.\n\nIC3 is more than a repository for victim complaints. It serves as a conduit for law enforcement to\nshare information and pursue cases that often span jurisdictional boundaries. IC3 was founded in\n2000 as a joint effort between the National White Collar Crime Center (NW3C)/Bureau of Justice\nAssistance (BJA) and the Federal Bureau of Investigation (FBI). That partnership leveraged the\nresources necessary to aid law enforcement in every aspect of an Internet fraud complaint.\n\nThe most common victim complaints in 2010 were non-delivery of payment/merchandise,\nscams impersonating the FBI (hereafter “FBI-related scams”) and identity theft. Victims of these\ncrimes reported losing hundreds of millions of dollars.\n\nThrough a number of technological advancements, IC3 has streamlined the way it processes\nand refers victim complaints to law enforcement. In 2004, IC3 developed Automatch, an\nautomated internal complaint grouping and analytical search tool. The design of Automatch\nis based on an assessment of the IC3 partnership aimed at defining a joint workflow for the\nproject partners with different service requirements. IC3 IT staff continually review and update\nAutomatch to meet the needs of analysts who build cases for law enforcement worldwide\ngathering all related information based on commonalities in the IC3 data. In 2009, NW3C\ndeveloped the state-of-the-art Internet Complaint Search and Investigation System (ICSIS),\nwhich fosters seamless collaboration among law enforcement from multiple jurisdictions.\nExpert IC3 analysts also provide key analytical and case support.\n\nThe 2010 Internet Crime Report demonstrates how pervasive online crime has become, affecting\npeople in all demographic groups. The report provides specific details about various crimes,\ntheir victims and the perpetrators. It also shows how IC3 continually adapts its methods to meet\nthe needs of the public and law enforcement.\n\n\n# 1\n\n\n-----\n\n##### History\n\nThe Internet Fraud Complaint Center (IFCC), a\npartnership between NW3C/BJA and the FBI, was\nestablished on May 8, 2000. The IFCC changed its name\nto IC3 in 2003 to reflect its expanded mission in the\nfight against cyber crime.\n\nIn May 2010, IC3 marked its 10th anniversary. By early\nNovember, IC3 had received two million complaints.\nIC3 received 303,809 complaints in 2010, averaging\n25,317 per month (by comparison, the IFCC received\n20,014 complaints in its first six months).\n\nCanada, the United Kingdom and Germany have used\nIC3 as the model for similar cyber crime centers. IC3’s\npublic awareness efforts range from teaching children\nhow to protect themselves online to showing senior\ncitizens how to avoid identity theft. Also, IC3 provides\npresentations to local, national and international law\nenforcement and to key industrial leaders.\n\n##### Cutting-Edge Approach To Fighting Internet Crime\n\nIn 2010, IC3 added the remote access feature to the\nIC3.net database tools. This feature gives all FBI\npersonnel the ability to perform searches and case\ndevelopment work. With this system and last year’s\nlaunch of ICSIS, IC3 has dramatically expanded the\ncapacity and scope of services offered. The combined\npower of these two high-tech tools aid law enforcement\nin identifying and prosecuting cyber crime.\n\nLaw enforcement can set complaint thresholds\nfor their jurisdictions within the Complaint\nManagement System (CMS) so agencies can have\nreal-time information of crimes occurring within their\n\nMap 1:\n\nAK\n\nMountain\n11.53%\n\nWA MT ND\n\nSD\n\nOR ID\n\nWY\n\nNE\n\nNV UT CO KS\n\nCA\n\nWest OK\n\n19.21% AZ NM\n\nTX\n\nHI\n\nAmerican Somoa\n\n\njurisdictions. For example, if the New York City Police\nDepartment requests to receive only those complaints\nwith a specified dollar loss, IC3 analysts can comply\nwith that request. The system automates approximately\n40 percent of the complaints it receives, allowing\nanalysts to process more complaints.\n\nIn addition to allowing all law enforcement – local,\nstate, and federal agencies—to search, analyze, and\ncompile information, ICSIS also allows these users to\ncommunicate and share information. Users can export\ncase information to other software programs to create\nlink charts and presentations.\n\nIC3 analysts are available to compile data to give\nlaw enforcement a more detailed case. Analysts and\ninvestigators have the ability to develop case leads with\nmultiple victims and jurisdictions, often involving\nthe same perpetrator. The case analysis in multijurisdictional collaboration allows law enforcement\naccess to new levels of information, which they can\nthen use to build stronger cases.\n\nIC3 tracks cases after they are referred to law\nenforcement. Referred cases are given a disposition\ncode based on the direction law enforcement intends\nto take. This gives analysts the chance to measure the\nrelative success of a case.\n\nIC3 analysts prepared 1,420 cases (representing 42,808\ncomplaints). Law enforcement prepared 698 cases\n(representing 4,015 complaints). In addition, law\nenforcement requested FBI assistance on 598 Internet\ncrime matters. Of the referrals prepared by the FBI\nanalysts, 122 open investigations were reported, which\nresulted in 31 arrests, 6 convictions, 17 grand jury\nsubpoenas, and 55 search/seizure warrants.\n\nGeographic Distribution of Cases\n\nMidwest\n\n5.23%\n\nGreat Lakes\n\n10.78%\n\nMN Northeast11.95% ME\n\nWI VT\n\nMI NY NH\n\nIA MA\n\nCT\n\nPA RI\n\nIL IN OH NJ\n\nMO WV DE\n\nKY VA MD Mid-Atlantic\n\n15.05%\n\nTN NC DC\n\nAR\n\nSC\n\nMS AL GA Southeast\n\nLA 18.68%\n\nPuerto Rico\nU.S. Virgin Islands\n\nFL\n\nS th C t l\n\n\nGeographic Distribution of Cases\n\nGreat Lakes\n\n10.78%\n\nWI\n\nMI\n\n\nMountain Midwest\n11.53% 5.23%\n\nND\n\nMN\n\nSD\n\nWY\n\nIA\n\nNE\n\n\nNortheast\n\n11.95% ME\n\nVT\n\nNY NH\n\nMA\nCT\n\nRI\n\nNJ\n\nDE\n\nMD Mid-Atlantic\n\n15.05%\n\nDC\n\n\nPA\n\nIL IN OH\n\nWV\n\nKY VA\n\nTN NC\n\nSC\n\nMS AL GA Southeast\n\n18.68%\n\nPuerto Rico\n\nFL\n\n\nHI\n\nAmerican Somoa\n\n\n-----\n\nOf the 303,809 complaints received in 2010, IC3 referred\n121,710 to law enforcement. IC3 auto-referred 82,372\nof these complaints to 1,629 law enforcement agencies.\nIC3 referred 2,597 child pornography complaints to the\nNational Center for Missing and Exploited Children.\nAnalysts also referred 1,970 urgent complaints containing\nthreats of bodily harm to local law enforcement agencies.\nAdditionally, Automatch attached 235,275 of the new\ncomplaints to 44,101 pre-existing groupings.\n\nAll complaints received at IC3 are used for intelligence\nreports, informational purposes and to identify emerging\ntrends. Those complaints revealing a reported dollar loss\nor other victimization are referred to law enforcement.\n\nTable 1: ICSIS Statistics\n\nCategory Number\n\nUsers 2,472\nNew Users 862\nSearches Performed 82,304\nComplaint Views 886,556\nAgencies Receiving Auto-Referrals 1,629\n\nTable 2: IC3.gov Statistics\n\nCategory Number\n\nVisits 26,967,461\nPDF Downloads 1,170,169\n\n##### Internet Crime Trends\n\nThe IC3 experienced substantial growth in complaints,\nreferrals, and dollar loss claims since 2000. In\nparticular, there has been a significant increase in\nreferrals in the two-year period since CMS and ICSIS\nwere implemented in early 2009.\n\nHistorically, auction fraud has been the leading\ncomplaint reported by victims, with a high of 71.2\npercent of all referrals in 2004. However, in 2010,\nauction fraud represents slightly more than 10 percent of\nreferrals. This demonstrates the growing diversification\nof crimes related to the Internet. The steady decline in the\ntotal number of complaints and referrals of auction fraud\nover the last several years has altered the top complaint\n\n\ncategories. The reason for this reduction is unknown.\nHowever, a possible explanation is that complaint levels\nare normalizing as businesses and consumers discover\nand implement ways to make previously uncharted areas\nof online commerce safer and more reliable.\n\nFigure 1: Complainant Demographic by Age\n\nUnder 20\n\n3.2%\n\nOver 60\n\n13.6% 20 - 29\n\n18.8%\n\n50 - 59\n\n22.1%\n\n30 - 39\n\n20.2%\n\n40 - 49\n\n22.1%\n\nThe age of those reporting crimes to IC3 is becoming\nmore evenly distributed. Early in IC3’s history, the 30-39\nage group represented the largest complainant reporting\npool. Today, complainants 40-59 years old represent the\ntwo largest groups reporting crimes to IC3. However,\nhistoric trends indicate a continuing shift toward those in\nthe 50-59 and 60-and-over category, which will further\nflatten the overall distribution of complainants. Those in\nthe 60-and-over category account for the most dramatic\nrise in complaints over the entire 10 years.\n\nThe gender gap in crime reporting has dramatically\nnarrowed. Early in IC3’s history, men reported crime\nat a ratio of more than 2.5 to 1 over women. Today,\nmen and women report crimes almost equally. In many\nstates, a slightly higher proportion of women than\nmen report crimes to IC3. The narrowed reporting gap\nbetween the sexes has significantly impacted the dollar\nloss between men and women over the last 10 years.\nDuring the course of IC3’s early history, men reported\na loss of more than $2.00 for every $1.00 reported by a\nwoman. According to the 2010 data, men now report a\nloss of $1.25 for every $1.00 reported by a woman.\n\n|Category|Number|\n|---|---|\n|Users|2,472|\n|New Users|862|\n|Searches Performed|82,304|\n|Complaint Views|886,556|\n|Agencies Receiving Auto-Referrals|1,629|\n\n|Category|Number|\n|---|---|\n|Visits|26,967,461|\n|PDF Downloads|1,170,169|\n\n\n###### Internet Crime Working Group\n\n\nThe Internet Crime Working Group (ICWG) is a\ncollaboration with IC3 analysts and the National CyberForensics and Training Alliance (NCFTA). ICWG uses\nemail to exchange critical unclassified data related to cyber\ni t lli t h d i t lli t\n\n\nThere were 259 items discussed among ICWG members in\n2010. Of those, 101 items resulted in information sent to law\nenforcement, and 81 items sent to industry representatives.\nThe ICWG recovered and reported 3,530 unique credit card\nb d 92 S i l S i b d d l d 73 i\n\n\n-----\n\n##### General IC3 Filing Information\n\nComplaints are submitted to IC3 at www.ic3.gov.\nThe information is reviewed, categorized and, when\nappropriate, referred to local, state or federal law\nenforcement.\n\n\nAll complaints are accessible to law enforcement and are\nused in trend analysis. These complaints help provide\na basis for future outreach events and educational\nawareness programs.\n\n\n350,000\n\n300,000\n\n250,000\n\n200,000\n\n150,000\n\n100,000\n\n50,000\n\n0\n\n###### 150,000\n\n 120,000\n\n 90,000\n\n 60,000\n\n 30,000\n\n 0\n\n\nFigure 2: Yearly Comparison of Complaints Received Via the IC3 Website\n\n336,655\n\n303,809\n\n275,284\n\n231,493\n207,449 207,492 206,884\n\n124,515\n\n75,064\n50,412\n\n16,838\n\n2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 201020102\n\nFigure 3: Yearly Number of Referrals\n\n146,663\n\n121,710\n\n103,959\n96,731\n90,008\n86,279\n\n70,553 72,940\n\n48,252\n\n4,810\n\n###### 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010\n\n\n146,663\n\n###### 2009\n\n\n121,710\n\n###### 2010\n\n\n103,959\n\n###### 2004\n\n\n90,008\n\n###### 2007\n\n\n86,279\n\n###### 2006\n\n\n207,492\n\n2006\n\n\n70,553\n\n###### 2003\n\n\n48,252\n\n###### 2002\n\n\n75,064\n\n2002\n\n\n-----\n\n##### Public Education - Top Five Questions Emailed to IC3\n\n**Q: I filed a complaint with IC3. When will I be**\n**updated with the status of an investigation?**\n\n**A: After you file a complaint with IC3, the**\ninformation is reviewed by an analyst and forwarded\nto all law enforcement and regulatory agencies with\njurisdiction. IC3 does not conduct investigations and\nis not able to provide the status of filed complaints.\nInvestigation and prosecution is done at the discretion\nof law enforcement.\n\nThe IC3 online complaint form asks victims a number of detailed\nquestions. That information will help investigators with the case.\n\n**Q: I received an email asking for my bank account**\n**information so that money could be transferred from**\n**another country. Should I file a complaint with IC3?**\n\n**A: Yes, even if you have not lost money. In your**\ncomplaint, be sure to include as much information as\npossible (names, email addresses, mailing addresses,\n\n\netc.). Be sure to copy and paste the entire email,\nincluding the header information, in the complaint.\nFor more information, please go to www.ic3.gov and\nclick on Internet Crime Prevention Tips or Internet\nCrime Schemes. Additionally, to learn more about\nInternet schemes and ways to protect yourself, please\nvisit www.lookstoogoodtobetrue.com.\n\n**Q: I think that I have been defrauded of money or**\n**goods. Can I file a complaint with IC3?**\n\n**A: Yes, include as much information as possible.**\n\n**Q: I have evidence that supports my complaint**\n**information. Can I send it to IC3?**\n\n**A: IC3 does not collect evidence regarding complaints.**\nWhile you may include information in our electronic\ncomplaint form, you should consider keeping all\noriginal documents in a secure location. In the event\nthat law enforcement opens an investigation, they may\nrequest the information directly from you.\n\n**Q: Am I going to get my money back from my loss?**\n\n**A: Some states have victim assistance provisions that**\nallow restoration of loss occurring from Internet crime,\nbut that is fairly rare. When complaints are filed at IC3,\nthey are referred to law enforcement with jurisdiction.\nProcedures and protocol vary across the country, but\ntypically the case would be assigned to an investigator.\nIn nearly all instances, recovery of your loss is\ncontingent on a perpetrator being identified, tried and\nconvicted. To learn more about victim services in your\narea, contact your state attorney general’s office or your\nlocal prosecutor’s office.\n\n\n-----\n\n##### Complaint Characteristics\n\nDuring 2010, the non-delivery of payment or\nmerchandise was the most reported offense, followed by\nFBI-related scams and identity theft.\n\nTable 3: Top 10 Crime Types\n\nType Percent\n\n1. Non-delivery Payment/Merchandise 14.4%\n2. FBI-Related Scams 13.2%\n3. Identity Theft 9.8%\n4. Computer Crimes 9.1%\n5. Miscellaneous Fraud 8.6%\n6. Advance Fee Fraud 7.6%\n7. Spam 6.9%\n8. Auction Fraud 5.9%\n9. Credit Card Fraud 5.3%\n10. Overpayment Fraud 5.3%\n\nIC3 primarily refers complaints with claims of dollar\nlosses (dollar loss claims). Other complaints, which may\nrepresent a comparatively large percentage of complaints\nreceived, do not contain dollar loss claims, but are\nintended only to alert IC3 of the scam. For a more\ndetailed explanation of complaint categories used by IC3,\nrefer to Appendix I.\n\nTable 4: Top 10 Crime Types\n(Referred Complaints)\n\nType Percent\n\n1. Non-delivery Payment/Merchandise 21.1%\n2. Identity Theft 16.6%\n3. Auction Fraud 10.1%\n4. Credit Card Fraud 9.3%\n5. Miscellaneous Fraud 7.7%\n6. Computer Crimes 6.1%\n7. Advance Fee Fraud 4.1%\n8. Spam 4.0%\n9. Overpayment Fraud 3.6%\n10. FBI-Related Scams 3.4%\n\nComplaint category statistics may not always produce\nan accurate picture. They are based on complainant\nperception. However, the CMS was designed to mitigate\na certain degree of subjectivity, allowing complaint\ncategorization to be reported more consistently.\n\n\n##### Complainant-Perpetrator Demographics\n\nInvestigating and prosecuting cyber crime is unique\nbecause the victim and perpetrator can be separated\nby a few blocks or thousands of miles. Successful\ninvestigations often require the cooperation of multiple\nagencies to resolve cases. Table 5 highlights this truly\nborderless phenomenon. A minority of perpetrators\nreside in the same state as the complainants. This\nunderscores the national and global nature of Internet\ncrime and the need for multi-jurisdictional cooperation\nto combat it.\n\nTable 5: Perpetrators from Same State as\nComplainant\n\nType Percent\n\n1. California 39.1%\n\n2. Florida 30.9%\n3. New York 29.4%\n4. Washington 27.4%\n5. Massachusetts 27.1%\n6. Texas 25.4%\n7. Arizona 24.6%\n8. Oregon 23.0%\n9. Illinois 22.3%\n10. District of Columbia 21.8%\n\n##### Complainant Demographics\n\nMost complainants were in the U.S., male, between 40\nand 59 and a resident of California, Florida, Texas or New\nYork. Most foreign complainants were from Canada, the\nUnited Kingdom, Australia or India (see Map 3).\n\nMen reported greater dollar losses than women (at a\nratio of $1.25 to every $1.00). Individuals 60-and-over\nreported higher median amounts of loss than other\nage groups.\n\n|Type|Percent|\n|---|---|\n|1. Non-delivery Payment/Merchandise|14.4%|\n|2. FBI-Related Scams|13.2%|\n|3. Identity Theft|9.8%|\n|4. Computer Crimes|9.1%|\n|5. Miscellaneous Fraud|8.6%|\n|6. Advance Fee Fraud|7.6%|\n|7. Spam|6.9%|\n|8. Auction Fraud|5.9%|\n|9. Credit Card Fraud|5.3%|\n|10. Overpayment Fraud|5.3%|\n\n|Type|Percent|\n|---|---|\n|1. California|39.1%|\n|2. Florida|30.9%|\n|3. New York|29.4%|\n|4. Washington|27.4%|\n|5. Massachusetts|27.1%|\n|6. Texas|25.4%|\n|7. Arizona|24.6%|\n|8. Oregon|23.0%|\n|9. Illinois|22.3%|\n|10. District of Columbia|21.8%|\n\n|Type|Percent|\n|---|---|\n|1. Non-delivery Payment/Merchandise|21.1%|\n|2. Identity Theft|16.6%|\n|3. Auction Fraud|10.1%|\n|4. Credit Card Fraud|9.3%|\n|5. Miscellaneous Fraud|7.7%|\n|6. Computer Crimes|6.1%|\n|7. Advance Fee Fraud|4.1%|\n|8. Spam|4.0%|\n|9. Overpayment Fraud|3.6%|\n|10. FBI-Related Scams|3.4%|\n\n\n-----\n\nTable 6: Top 10 State Complainant\nRates per 100,000 Population\n\n\nMap 2: Top 10 States by Count:\nIndividual Complainants (Numbered by Rank)\n\n\n1. California 13.7%\n2. Florida 7.9%\n3. Texas 7.3%\n4. New York 5.8%\n5. New Jersey 4.3%\n\n\n6. Pennsylvania 3.6%\n7. Illinois 3.3%\n8. Virginia 3.0%\n9. Ohio 2.9%\n10. Washington 2.9%\n\n|State|Per 100,000 Population|\n|---|---|\n|1. Alaska|566.57|\n|2. Colorado|134.99|\n|3. District of Columbia|129.29|\n|4. New Jersey|122.86|\n|5. Nevada|119.19|\n|6. Maryland|117.29|\n|7. Washington|108.06|\n|8. Florida|105.72|\n|9. Arizona|104.27|\n|10. Virginia|93.76|\n\n\nMap 3: Top 10 Countries by Count: Individual Complainants (Numbered by Rank)\n\n\n1. United States 91.2%\n2. Canada 1.5%\n3. United Kingdom 1.0%\n4. Australia 0.7%\n5. India 0.5%\n\n\n6. South Africa 0.2%\n7. Germany 0.2%\n8. Mexico 0.2%\n9. France 0.2%\n10. Philippines 0.2%\n\n\n-----\n\n##### Perpetrator Demographics\n\nIn instances where perpetrator information was\nprovided, nearly 75 percent were men and more than\nhalf resided in California, Florida, New York, Texas,\nthe District of Columbia or Washington (see Map 4).\n\n\nThe highest numbers of perpetrators outside the U.S.\nwere from the United Kingdom, Nigeria, and Canada\n(see Map 5). Refer to Appendix II for more information\nabout perpetrator statistics by state.\n\n\nMap 4: Top 10 States by Count:\nIndividual Perpetrators (Numbered by Rank)\n\n\n1. California 15.8%\n2. Florida 9.8%\n3. New York 8.5%\n4. Texas 6.9%\n5. District of Columbia 5.1%\n\n\n6. Washington 4.0%\n7. Georgia 3.9%\n8. Illinois 3.1%\n9. Pennsylvania 2.6%\n10. Arizona 2.6%\n\n\nMap 5: Top 10 Countries by Count: Individual Perpetrators (Numbered by Rank)\n\n\n1. United States 65.9%\n2. United Kingdom 10.4%\n3. Nigeria 5.8%\n4 China 3 1%\n\n\n6. Malaysia 0.8%\n7. Spain 0.8%\n8. Ghana 0.7%\n9 Cameroon 0 6%\n\n\n-----\n\n##### Success Stories\n\n_“This is excellent. We’ve already identified several good_\n_leads based on the information you were able to extract._\n_Thanks so much for taking the time to help.”_\nSpecial Agent W. Blake Cook, U.S. State Department, after\nreceiving information on a case from an IC3 analyst.\n\nIC3 does its part to ensure that victims of online\ncrime are heard by giving their complaints to the\nproper authorities and providing law enforcement\nwith valuable information related to the case. While\nanalysts don’t always see the outcome of their work,\nthe evolution of IC3’s complaint-handling process has\nresulted in analysts working more closely with law\nenforcement, which in turn produces better feedback.\n\nNot So Free Samples\n\nIn the one case, a company offered free trial samples\nof products to victims who paid for the shipping\nand handling with a credit card. The company then\nmade unauthorized purchases on the cards. A total\nof 372 complaints were lodged against the company,\nwith reported losses totaling more than $53,000. An\nIC3 analyst noticed the high volume of complaints\nand used open-and closed-source analysis to build a\ncase. From there, he referred it to relevant local law\nenforcement, which opened a joint investigation with\nthe state Attorney General, who remains in constant\ncontact with the IC3 analyst for assistance and updated\ncomplaint data.\n\nFraud on the Wire\n\nA case involving wire transfer fraud involved more\nthan 1,000 complaints, totaling nearly $3 million in\nreported losses. An IC3 analyst assisted state and local\nofficials with the investigation. The state issued 15\nsubpoenas and reviewed more than 115 surveillance\nvideos from one specific wire transfer company with\noffices throughout the state. This case could take\nseveral years to reach a full conclusion, but a state law\nenforcement official acknowledged that IC3 has been “a\ngreat resource” in producing needed information for his\nteam. “IC3 is a terrific asset in our fight against major\norganized fraud schemes and an invaluable ally to law\nenforcement,” the state official said.\n\n\nFalse Advertisement\n\nA marketing company promotes its customers’ websites\nthrough television and online ads. However, the victims\nare often left empty-handed with no advertisement\nof their business, and the company stops any form of\ncommunication with them. IC3 originally sent this case\nto the federal officials of relevant jurisdiction with 15\ncomplaints that reported losses of more than $130,000. Based\non the conversation between the IC3 analyst and federal law\nenforcement, this case has exploded in scope. The number\nof victims reached the hundreds, and reported losses totaled\nmore than $20 million. Federal law enforcement continues\nto investigate this case and regularly contacts IC3 for further\ncomplaints and information.\n\nInternational Assistance\n\nIn April 2010, Romanian National Police charged\n70 people for their roles in an organized crime\ngroup engaged in Internet fraud. In one of the\ncountry’s largest-ever police actions, over 700 law\nenforcement officers conducted arrests and searches\nat 103 locations, while at the same time, police in the\nCzech Republic searched 10 locations and arrested 11\nRomanian nationals.\n\nIn an 18-month period, Romanian police and\nprosecutors conducted more than 500 wiretaps and\nidentified over 1,200 victims, approximately half of\nthem Americans. The total loss was over $2 million.\n\nThe FBI Legal Attache in Bucharest and the Romanian\nThreat Focus Cell Cyber Task Force, including IC3,\nplayed a vital role in assisting the Romanian police in\ngathering evidence for their investigations of the subjects.\n\nIC3 identified additional victims subjects. IC3 used\nvictim-provided information such as subject addresses,\nemail addresses, telephone numbers, and fax numbers\nto make initial investigative connections, which the\nRomanian National police developed further.\n\nIC3 provided more than 600 victim complaints for a total\nof $2.7 million in reported losses, and assisted, along\nwith multiple FBI Field Offices, in obtaining more than\n100 signed Romanian police affidavits from victims.\n\n\n-----\n\n##### IC3 Scam Alerts of 2010\n\n###### Mystery/Secret Shopper Schemes\nSource: IC3\nDate: January 14, 2010\n\nIC3 has been alerted to an increase in employment\nschemes pertaining to mystery/secret shopper positions.\nMany retail and service corporations hire evaluators\nto perform secret or random checks on themselves or\ntheir competitors, and fraudsters are capitalizing on this\nemployment opportunity.\n\nVictims have reported to IC3 they were contacted via\ne-mail and U.S. mail to apply to be a mystery shopper.\nApplicants are asked to send a resume and are purportedly\nsubject to an extensive background check before being\naccepted as a mystery shopper. The employees are sent\na check with instructions to shop at a specified retailer\nfor a specific length of time and spend a specific amount\non merchandise from the store. The employees receive\ninstructions to take note of the store’s environment, color,\npayment procedures, gift items, and shopping/carrier bags\nand report back to the employer. The second evaluation\nis the ease and accuracy of wiring money from the retail\nlocation. The money to be wired is also included in the\ncheck sent to the employee. The remaining balance is the\nemployee’s payment for the completion of the assignment.\nAfter merchandise is purchased and money is wired, the\nemployees are advised by the bank the check cashed was\ncounterfeit, and they are responsible for the money lost in\naddition to bank fees incurred.\n\nIn other versions of the scheme, applicants are\nrequested to provide bank account information to have\nmoney directly deposited into their accounts. The\nfraudster then has acquired access to these victims’\naccounts and can withdraw money, which makes the\napplicant a victim of Identity Theft.\n\nTips\nHere are some tips you can use to avoid becoming\na victim of employment schemes associated with\nmystery/secret shopping:\n\n   - Do not respond to unsolicited (spam) e-mail.\n\n   - Do not click on links contained within an\nunsolicited e-mail.\n\n   - Be cautious of e-mail claiming to contain pictures\nin attached files, as the files may contain viruses.\nOnly open attachments from known senders.\nll h f bl\n\n\n\n   - Avoid filling out forms contained in e-mail\nmessages that ask for personal information.\n\n   - Always compare the link in the e-mail to the\nlink you are actually directed to and determine if\nthey match and will lead you to a legitimate site.\n\n   - There are legitimate mystery/secret shopper\nprograms available. Research the legitimacy on\ncompanies hiring mystery shoppers. Legitimate\ncompanies will not charge an application fee\nand will accept applications on-line.\n\n   - No legitimate mystery/secret shopper program\nwill send payment in advance and ask the\nemployee to send a portion of it back.\n\nIndividuals who believe they have information\npertaining to mystery/secret shopper schemes are\nencouraged to file a complaint at www.ic3.gov.\n\n###### New Twist on Counterfeit Check Schemes Targeting U.S. Law Firms\nSource: IC3\nDate: January 21, 2010\n\nThe FBI continues to receive reports of counterfeit\ncheck scheme targeting U.S. law firms. As previously\nreported, scammers send e-mails to lawyers, claiming\nto be overseas and seeking legal representation to\ncollect delinquent payments from third parties in\nthe U.S. The law firm receives a retainer agreement,\ninvoices reflecting the amount owed, and a check\npayable to the law firm. The firm is instructed to extract\nthe retainer fee, including any other fees associated with\nthe transaction, and wire the remaining funds to banks\nin Korea, China, Ireland, or Canada. By the time the\ncheck is determined to be counterfeit, the funds have\nalready been wired overseas.\n\nIn a new twist, the fraudulent client seeking legal\nrepresentation is an ex-wife “on assignment” in an Asian\ncountry, and she claims to be pursuing a collection of\ndivorce settlement monies from her ex-husband in the\nU.S. The law firm agrees to represent the ex-wife, sends\nan e-mail to the ex-husband, and receives a “certified”\ncheck for the settlement via delivery service. The ex-wife\ninstructs the firm to wire the funds, less the retainer fee,\nto an overseas bank account. When the scam is executed\nsuccessfully, the law firm wires the money before\ndiscovering the check is counterfeit.\n\nAll Internet users need to be cautious when they receive\nunsolicited e-mails. Law firms are advised to conduct\nh d d l bl b f\n\n\n-----\n\nbusiness solely via e-mail, particularly those parties\nclaiming to reside overseas.\n\nPlease view an additional public service announcement\nposted to the IC3 Web site regarding a similar Asian\nExtortion Scheme located at the following link, http://\nwww.ic3.gov/media/2009/090610.aspx. Individuals\nwho receive information pertaining to counterfeit check\nschemes are encouraged to file a complaint at www.ic3.gov.\n\n###### National Center for Disaster Fraud to Coordinate Haitian and Chilean Fraud Complaints\nSource: U.S. Department of Justice\nFBI\nDate: March 10, 2010\n\nShortly after the earthquake in Haiti last January, the\nFBI and the National Center for Disaster Fraud (NCDF)\nestablished a telephone hotline to report suspected\nfraud associated with relief efforts. That number,\n(866) 720-5721, was initially staffed for the purpose\nof reporting suspected scams being perpetrated by\ncriminals in the aftermath of the Haitian earthquake.\nSince then with the recent earthquake in Chile our\nefforts have expanded to identify similar fraud activity\ncoming out of that disaster. Therefore the public is\nencouraged to call this same number (866) 720-5721\nto report suspected fraud from either disaster. The\ntelephone line is staffed by a live operator 24 hours a\nday, seven days a week. Additionally, e-mail information\ncan be directly sent to disaster@leo.gov.\n\nThe National Center for Disaster Fraud was originally\nestablished by the Department of Justice to investigate,\nprosecute, and deter fraud in the wake of Hurricane\nKatrina, when billions of dollars in federal disaster relief\npoured into the Gulf Coast Region. Now, its mission has\nexpanded to include suspected fraud from any natural\nor manmade disaster. More than 20 federal agencies,\nincluding the FBI, participate in the NCDF, allowing\nthe center to act as a centralized clearinghouse of\ninformation related to Haitian or Chilean Relief Fraud.\n\nThe FBI continues to remind the public to apply a\ncritical eye and do their due diligence before giving\ncontributions to anyone soliciting donations on behalf\nof Haitian or Chilean victims. Solicitations can originate\nfrom e-mails, websites, door-to-door collections,\nmailings and telephone calls, and similar methods.\nTherefore, before making a donation of any kind,\nconsumers should adhere to certain guidelines, including\nthe following:\n\n\ncontained within those messages because they\nmay contain computer viruses.\n\n - Be skeptical of individuals representing\nthemselves as surviving victims or officials asking\nfor donations via e-mail or social networking sites.\n\n - Beware of organizations with copy-cat names\nsimilar to but not exactly the same as those of\nreputable charities.\n\n - Rather than following a purported link to a\nwebsite, verify the legitimacy of non-profit\norganizations by utilizing various Internet-based\nresources that may assist in confirming the group’s\nexistence and its non-profit status.\n\n - Be cautious of e-mails that claim to show pictures\nof the disaster areas in attached files, because the\nfiles may contain viruses. Only open attachments\nfrom known senders.\n\n - To ensure contributions are received and used for\nintended purposes, make contributions directly to\nknown organizations rather than relying on others\nto make the donation on your behalf.\n\n - Do not be pressured into making contributions, as\nreputable charities do not use such tactics.\n\n - Do not give your personal or financial information\nto anyone who solicits contributions. Providing\nsuch information may compromise your identity\nand make you vulnerable to identity theft.\n\n - Avoid cash donations if possible. Pay by debit or\ncredit card, or write a check directly to the charity.\nDo not make checks payable to individuals.\n\n - Legitimate charities do not normally solicit\ndonations via money transfer services.\n\n - Most legitimate charities websites end in .org\nrather than .com.\n\n  - There are scams targeting Haitian immigrants and\ntheir families offering assistance in getting family\nmembers and friends out of Haiti. These individuals\ncharge a fee and then claim they will provide the\nnecessary immigration paperwork or an airline\nticket for disaster victims to leave Haiti. For official\ninformation pertaining to immigration from Haiti to\nthe U.S., visit the U.S. Citizenship and Immigration\nServices (USCIS) website at www.USCIS.gov.\n\nIf you believe you have been a victim of fraud from\na person or an organization soliciting relief funds on\nbehalf of Haitian or Chilean earthquake victims, contact\nthe National Center for Disaster Fraud at (866) 720\n\n-----\n\nYou can also report suspicious e-mail solicitations\nor fraudulent websites to the FBI’s Internet Crime\nComplaint Center at www.ic3.gov.\n\n###### Rental and Real Estate Scams\nSource: IC3\nDate: March 11, 2010\n\nIndividuals need to be cautious when posting rental\nproperties and real estate on-line. IC3 continues to\nreceive numerous complaints from individuals who have\nfallen victim to scams involving rentals of apartments\nand houses, as well as postings of real estate on-line.\n\nRental scams occur when the victim has rental property\nadvertised and is contacted by an interested party. Once\nthe rental price is agreed-upon, the scammer forwards a\ncheck for the deposit on the rental property to the victim.\nThe check is to cover housing expenses and is, either\nwritten in excess of the amount required, with the scammer\nasking for the remainder to be remitted back, or the check\nis written for the correct amount, but the scammer backs\nout of the rental agreement and asks for a refund. Since the\nbanks do not usually place a hold on the funds, the victim\nhas immediate access to them and believes the check has\ncleared. In the end, the check is found to be counterfeit and\nthe victim is held responsible by the bank for all losses.\n\nAnother type of scam involves real estate that is posted\nvia classified advertisement websites. The scammer\nduplicates postings from legitimate real estate websites\nand reposts these ads, after altering them. Often, the\nscammers use the broker’s real name to create a fake\nemail, which gives the fraud more legitimacy. When\nthe victim sends an email through the classified\nadvertisement website inquiring about the home, they\nreceive a response from someone claiming to be the\nowner. The “owner” claims he and his wife are currently\non missionary work in a foreign country. Therefore, he\nneeds someone to rent their home while they are away.\nIf the victim is interested in renting the home, they are\nasked to send money to the owner in the foreign country.\n\nIf you have been a victim of Internet crime, please file a\ncomplaint at http://www.ic3.gov/.\n\n###### Fraudulent Telephone Calls Allowing Fraudsters Access to Consumer Financial and Brokerage Accounts\nSource: IC3\nDate: June 21, 2010\n\nTh FBI N k Di i i l d i\n\n\nThe FBI determined fraudsters compromised victim\naccounts and contacted financial institutions to change\nthe victim profile information (i.e., email addresses,\ntelephone numbers and bank account numbers).\n\nThe TDoS attacks used automated dialing programs\nand multiple accounts to overwhelm victims’ cell\nphones and land lines with thousands of calls. When\nvictims answered the calls they heard dead air (nothing\non the other end), an innocuous recorded message,\nadvertisement, or a telephone sex menu. Calls were\ntypically short in duration but so numerous that victims\nchanged their phone numbers to terminate the attack.\n\nThese TDoS attacks were used as a diversion to prevent\nfinancial and brokerage institutions from verifying victim\naccount changes and transactions. Fraudsters were\nafforded adequate time to transfer funds from victim\nbrokerage and financial online accounts.\n\nProtection from TDoS attacks and other types of fraud\nrequires consumers to be vigilant and proactive. In\nNewark’s Public Service Announcement (PSA), they\nrecommend consumers protect themselves by:\n\n   - Implement security measures for all financial\naccounts by placing fraud alerts with the major\ncredit bureaus if you believe they were targeted by\na TDOS attack or other forms of fraud.\n\n   - Use strong passwords for all financial accounts\nand change them regularly.\n\n   - Obtain and review your annual credit report for\nfraudulent activity.\n\nIf you were a target of a TDoS attack, immediately contact\nyour financial institutions, notify your telephone provider,\nand promptly report it to IC3 website at: www.ic3.gov.\nThe IC3 complaint database links complaints to assist in\nreferrals to the appropriate law enforcement agency for\ncase consideration. The complaint information is also used\nto identity emerging trends and patterns.\n\nTo learn more about the FBI’s role in addressing these\nattacks please refer to the FBI Newark Division, PSA dated\nMay 11, 2010, located at: http://newark.fbi.gov/press.htm.\n\n###### Claims of Being Stranded Swindle Consumers Out of Thousands of Dollars\nSource: IC3\nDate: July 2, 2010\n\nIC3 continues to receive reports of individuals’ e-mail\ni l t ki t b i i d d\n\n\n-----\n\nout of thousands of dollars. Portraying to be the victim,\nthe hacker uses the victim’s account to send a notice\nto their contacts. The notice claims the victim is in\nimmediate need of money due to being robbed of their\ncredit cards, passport, money, and cell phone; leaving\nthem stranded in London or some other location. Some\nclaim they only have a few days to pay their hotel bill\nand promise to reimburse upon their return home. A\nsense of urgency to help their friend/contact may cause\nthe recipient to fail to validate the claim, increasing the\nlikelihood of them falling for this scam.\n\nIf you receive a similar notice and are not sure it is a\nscam, you should always verify the information before\nsending any money.\n\nIf you have been a victim of this type of scam or any other\nCyber crime, you can report it to the IC3 website at: www.\nic3.gov. The IC3 complaint database links complaints\nfor potential referral to the appropriate law enforcement\nagency for case consideration. Complaint information is\nalso used to identity emerging trends and patterns.\n\n###### Fraudulent Notifications Deceive Consumers Out of Thousands of Dollars\nSource: IC3\nDate: November 8, 2010\n\nIC3 continues to receive reports of letters and emails\nbeing distributed as part of a prize sweepstakes or\nlottery scheme. The scheme uses fraudulent checks\nbearing the logos of various financial institutions.\n\nIndividuals are informed they won a sweepstakes or\nlottery and will receive a lump sum payout if they pay\ntaxes and processing fees upfront. The communication\ndirects individuals to call a telephone number to\nsecure their unclaimed prize, and receive instructions\nfor paying the upfront taxes and fees. A fraudulent\ncheck is enclosed with the letter, or sent after the\ninitial call, in the amount of the supposed taxes. The\ninstructions inform the individual to cash the check\nand wire the proceeds, in order to receive the payout.\nFollowing these instructions leaves the victim liable\nfor the amount of the counterfeit check, plus any\nadditional fees charged by their bank. Recipients of the\ncommunication may fall victim to the scheme due to\nthe allure of easy money and the apparent legitimacy of\nthe check. The alleged cash prizes and locations of the\nfinancial institutions vary.\n\nIf you receive a similar notice you should always verify\n\n\nTips to avoid being scammed:\n\n- A federal statute prohibits mailing lottery tickets,\nadvertisements, or payments to purchase tickets in a\nforeign lottery.\n\n- Be leery if you do not remember entering a lottery\nor sweepstakes.\n\n- Beware of lotteries or sweepstakes that charge a fee\nprior to delivery of your prize.\n\n- Be wary of demands to send additional money to be\neligible for future winnings.\n\nIf you have been a victim of this type of scam or any\nother cyber crime, you can report it to the IC3 website\nat: www.ic3.gov. The IC3 complaint database links\ncomplaints for potential referral to law enforcement for\ncase consideration. Complaint information is also used\nto identify emerging trends and patterns to alert the\npublic to new criminal schemes.\n\n###### Telephone Collection Scams Related to Delinquent Payday Loans\nSource: IC3\nDate: December 1, 2010\n\nIC3 receives a high volume of complaints from victims\nof payday loan telephone collection scams. In these\nscams, a caller claims that the victim is delinquent in\na payday loan and must repay the loan to avoid legal\nconsequences. The callers purport to be representatives\nof the FBI, Federal Legislative Department, various\nlaw firms, or other legitimate-sounding agencies. They\nclaim to be collecting debts for companies such as\nUnited Cash Advance, U.S. Cash Advance, U.S. Cash\nNet, and other internet check cashing services.\n\nOne of the most insidious aspects of this scam is\nthat the callers have accurate information about the\nvictims, including social security numbers, dates of\nbirth, addresses, employer information, bank account\nnumbers, names and telephone numbers of relatives and\nfriends. The method by which the fraudsters obtained\nthe personal information is unclear, but victims often\nrelay that they had completed online applications for\nother loans or credit cards before the calls began.\n\nThe fraudsters relentlessly call the victim’s home,\ncell phone, and place of employment. They refuse to\nprovide to the victims any details of the alleged payday\nloans and become abusive when questioned. The callers\nthreaten victims with legal actions, arrests, and in\nsome cases physical violence if they refuse to pay. In\n\n\n-----\n\nSome fraudsters instruct victims to fax a statement\nagreeing to pay a certain dollar amount, on a specific\ndate, via prepaid visa card. The statement further\ndeclares that the victim would never dispute the debt.\n\nTHESE TELEPHONE CALLS ARE AN ATTEMPT TO\nOBTAIN PAYMENT BY INSTILLING FEAR IN THE\nVICTIMS. DO NOT FOLLOW THE INSTUCTIONS\nOF THE CALLER.\n\nIf you receive telephone calls such as these, you should:\n\n- Contact your banking institutions;\n\n- Contact the three major credit bureaus and request\nan alert be put on your file;\n\n- Contact your local law enforcement agencies if you\nfeel you are in immediate danger;\n\n- File a complaint at www.ic3.gov.\n\n\n##### Conclusion\n\nAs the 2010 Internet Crime Report shows, the effects\nof online crime cut across all demographic groups\nand span the globe. IC3 has demonstrated its ability to\nadapt to the ever-changing landscape of Internet crime\nby providing the latest technological tools to assist law\nenforcement in bringing perpetrators to justice.\n\nThe combined power of IC3’s CMS, ICSIS and Automatch\nstreamlines the way complaints are processed and\nreferred.\n\nThe expert analysis IC3 provides to law enforcement\nfosters greater collaboration between investigators in\nmultiple jurisdictions.\n\nAs this report demonstrates, cyber criminals have\nbecome more creative in devising ways to separate\nInternet users from their money. IC3 has evolved\nto keep pace with emerging trends and technology,\nbecoming an indispensible asset to victims of online\ncrime and to law enforcement.\n\n\n-----\n\n##### Appendix I\n\n###### Definitions of Complaint Types\n\n**•** **Non-Delivery Payment/Merchandise**\n**(non-auction) – Purchaser did not receive items**\npurchased, or seller did not receive payment for\nitems sold.\n\n**•** **FBI-Related Scams – Scams in which a criminal**\nposes as the FBI to defraud victims.\n\n**•** **Identity Theft – Unauthorized use of victim’s**\npersonally identifying information to commit\nfraud or other crimes.\n\n**•** **Computer Crimes –1) Crimes that target**\ncomputer networks or devices directly or 2)\ncrimes facilitated by computer networks or\ndevices.\n\n**•** **Miscellaneous Fraud – Variety of scams meant**\nto defraud the public, such as work-at-home\nscams, fraudulent sweepstakes and contests, and\nother fraudulent schemes.\n\n###### Table 7 - Complaint Categories and Subcategories\n\n\n\n**•** **Advance Fee Fraud – Criminals convince victims**\nto pay a fee to receive something of value, but\ndo not deliver anything of value to the victim.\n\n**•** **Spam – Mass-produced, unsolicited bulk**\nmessages.\n\n**•** **Auction Fraud – Fraudulent transactions that**\noccur in the context of an online auction site.\n\n**•** **Credit Card Fraud – Fraudulent, unauthorized**\ncharging of goods and services to a victim’s\ncredit card.\n\n**•** **Overpayment Fraud – An incident in which**\nthe complainant receives an invalid monetary\ninstrument with instructions to deposit it in a bank\naccount and to send excess funds or a percentage\nof the deposited money back to the sender.\n\n\nAdvance Fee Fraud\nAuction Fraud\n\nAuction Fraud - Consumer Complaint\nAuction Fraud - Fake\nAuction Fraud - Forged or Counterfeit Payment\nAuction Fraud - Fraudulent Refund\nAuction Fraud - Insufficient Funds\nAuction Fraud - No Such Account\nAuction Fraud - Non-Delivery\nAuction Fraud - Non-Payment\nAuction Fraud - Other\nAuction Fraud - Payment Fraud - Other\nAuction Fraud - Stolen\nAuction Fraud - Stolen Payment\n\n\n-----\n\nOther Threatening Behavior\nThreat\nCyber-Stalking/Forum Abuse\nInvestment Fraud\n\nInvestment Fraud\nPyramid Schemes\n\n\nTerrorist Funding\nTerrorist Information\nTerrorist Recruiting\n\n\n-----\n\n##### Appendix II\n\n Complainant/Perpetrator Statistics\n\n###### Table 8: Complainant Statistics by State*\n\nRank State Percent Rank State Percent\n\n1 California 13.7% 27 South Carolina 1.2%\n2 Florida 7.9% 28 Louisiana 1.1%\n3 Texas 7.3% 29 Connecticut 1.0%\n4 New York 5.8% 30 Kentucky 1.0%\n5 New Jersey 4.3% 31 Oklahoma 0.9%\n6 Pennsylvania 3.6% 32 Utah 0.9%\n7 Illinois 3.3% 33 Kansas 0.8%\n8 Virginia 3.0% 34 Arkansas 0.7%\n9 Ohio 2.9% 35 New Mexico 0.7%\n10 Washington 2.9% 36 Iowa 0.6%\n11 Michigan 2.7% 37 Mississippi 0.5%\n12 Colorado 2.7% 38 West Virginia 0.5%\n13 Maryland 2.7% 39 Idaho 0.5%\n14 Arizona 2.6% 40 New Hampshire 0.5%\n15 Georgia 2.6% 41 Hawaii 0.4%\n16 North Carolina 2.5% 42 Maine 0.4%\n17 Tennessee 1.9% 43 Nebraska 0.4%\n18 Massachusetts 1.9% 44 Montana 0.3%\n19 Indiana 1.8% 45 District of Columbia 0.3%\n20 Missouri 1.6% 46 Rhode Island 0.3%\n21 Alaska 1.6% 47 Delaware 0.3%\n22 Oregon 1.4% 48 Vermont 0.2%\n23 Wisconsin 1.4% 49 Wyoming 0.2%\n24 Minnesota 1.4% 50 South Dakota 0.2%\n25 Alabama 1.3% 51 North Dakota 0.1%\n26 Nevada 1.3%\n\n_*Numbers shown are the percentage of total individual complainants within the United States, in which the state is_\n_known._\n\n_(Please note that percentages contained in the table above do not add up to 100 percent. The table above only_\n_represents statistics from 50 states and the District of Columbia. The table above does not represent statistics from_\n_other U.S. territories or Canada.)_\n\n|Rank|State|Percent|Rank|State|Percent|\n|---|---|---|---|---|---|\n|1|California|13.7%|27|South Carolina|1.2%|\n|2|Florida|7.9%|28|Louisiana|1.1%|\n|3|Texas|7.3%|29|Connecticut|1.0%|\n|4|New York|5.8%|30|Kentucky|1.0%|\n|5|New Jersey|4.3%|31|Oklahoma|0.9%|\n|6|Pennsylvania|3.6%|32|Utah|0.9%|\n|7|Illinois|3.3%|33|Kansas|0.8%|\n|8|Virginia|3.0%|34|Arkansas|0.7%|\n|9|Ohio|2.9%|35|New Mexico|0.7%|\n|10|Washington|2.9%|36|Iowa|0.6%|\n|11|Michigan|2.7%|37|Mississippi|0.5%|\n|12|Colorado|2.7%|38|West Virginia|0.5%|\n|13|Maryland|2.7%|39|Idaho|0.5%|\n|14|Arizona|2.6%|40|New Hampshire|0.5%|\n|15|Georgia|2.6%|41|Hawaii|0.4%|\n|16|North Carolina|2.5%|42|Maine|0.4%|\n|17|Tennessee|1.9%|43|Nebraska|0.4%|\n|18|Massachusetts|1.9%|44|Montana|0.3%|\n|19|Indiana|1.8%|45|District of Columbia|0.3%|\n|20|Missouri|1.6%|46|Rhode Island|0.3%|\n|21|Alaska|1.6%|47|Delaware|0.3%|\n|22|Oregon|1.4%|48|Vermont|0.2%|\n|23|Wisconsin|1.4%|49|Wyoming|0.2%|\n|24|Minnesota|1.4%|50|South Dakota|0.2%|\n|25|Alabama|1.3%|51|North Dakota|0.1%|\n|26|Nevada|1.3%||||\n\n\n-----\n\n###### Table 9: Perpetrator Statistics by State*\n\nRank State Percent Rank State Percent\n\n1 California 15.8% 27 South Carolina 0.9%\n2 Florida 9.8% 28 Montana 0.9%\n3 New York 8.5% 29 Alabama 0.9%\n4 Texas 6.9% 30 Wisconsin 0.8%\n5 District of Columbia 5.1% 31 Louisiana 0.8%\n6 Washington 4.0% 32 Kentucky 0.7%\n7 Georgia 3.9% 33 Oklahoma 0.7%\n8 Illinois 3.1% 34 Nebraska 0.6%\n9 Pennsylvania 2.6% 35 Kansas 0.6%\n10 Arizona 2.6% 36 Maine 0.5%\n11 New Jersey 2.4% 37 Delaware 0.5%\n12 Ohio 2.3% 38 Alaska 0.5%\n13 Michigan 2.2% 39 Arkansas 0.4%\n14 Nevada 2.2% 40 Iowa 0.4%\n15 North Carolina 2.1% 41 Mississippi 0.3%\n16 Virginia 1.9% 42 New Mexico 0.3%\n17 Colorado 1.8% 43 Hawaii 0.3%\n18 Maryland 1.7% 44 Idaho 0.3%\n19 Massachusetts 1.6% 45 Rhode Island 0.3%\n20 Tennessee 1.4% 46 West Virginia 0.3%\n21 Indiana 1.4% 47 New Hampshire 0.3%\n22 Minnesota 1.1% 48 North Dakota 0.2%\n23 Missouri 1.0% 49 Wyoming 0.2%\n24 Utah 1.0% 50 South Dakota 0.1%\n25 Oregon 1.0% 51 Vermont 0.1%\n26 Connecticut 0.9%\n\n_*Numbers shown are the percentage of total individual perpetrators within the United States, in which the state is_\n_known._\n\n_(Please note that percentages contained in the table above do not total 100 percent. The table above only_\n_represents statistics from 50 states and the District of Columbia. The table above does not represent statistics from_\n_other U.S. territories or Canada. The District of Columbia’s numbers may be inflated by the number of FBI-related_\n_scams, in which complainants believe the incident has taken place in D.C., even though often the perpetrator is not_\n_based there.)_\n\n|Rank|State|Percent|Rank|State|Percent|\n|---|---|---|---|---|---|\n|1|California|15.8%|27|South Carolina|0.9%|\n|2|Florida|9.8%|28|Montana|0.9%|\n|3|New York|8.5%|29|Alabama|0.9%|\n|4|Texas|6.9%|30|Wisconsin|0.8%|\n|5|District of Columbia|5.1%|31|Louisiana|0.8%|\n|6|Washington|4.0%|32|Kentucky|0.7%|\n|7|Georgia|3.9%|33|Oklahoma|0.7%|\n|8|Illinois|3.1%|34|Nebraska|0.6%|\n|9|Pennsylvania|2.6%|35|Kansas|0.6%|\n|10|Arizona|2.6%|36|Maine|0.5%|\n|11|New Jersey|2.4%|37|Delaware|0.5%|\n|12|Ohio|2.3%|38|Alaska|0.5%|\n|13|Michigan|2.2%|39|Arkansas|0.4%|\n|14|Nevada|2.2%|40|Iowa|0.4%|\n|15|North Carolina|2.1%|41|Mississippi|0.3%|\n|16|Virginia|1.9%|42|New Mexico|0.3%|\n|17|Colorado|1.8%|43|Hawaii|0.3%|\n|18|Maryland|1.7%|44|Idaho|0.3%|\n|19|Massachusetts|1.6%|45|Rhode Island|0.3%|\n|20|Tennessee|1.4%|46|West Virginia|0.3%|\n|21|Indiana|1.4%|47|New Hampshire|0.3%|\n|22|Minnesota|1.1%|48|North Dakota|0.2%|\n|23|Missouri|1.0%|49|Wyoming|0.2%|\n|24|Utah|1.0%|50|South Dakota|0.1%|\n|25|Oregon|1.0%|51|Vermont|0.1%|\n|26|Connecticut|0.9%||||\n\n\n-----\n\n###### Table 10: Complainants per 100,000 Population*\n\nRank State Per 1,000\n\n1 Alaska 566.57\n2 Colorado 134.99\n3 District of Columbia 129.29\n4 New Jersey 122.86\n5 Nevada 119.19\n6 Maryland 117.29\n7 Washington 108.06\n8 Florida 105.72\n9 Arizona 104.27\n10 Virginia 93.76\n11 California 92.89\n12 Oregon 92.63\n13 New Hampshire 87.96\n14 Utah 86.14\n15 Montana 85.20\n16 Wyoming 84.45\n17 Vermont 84.37\n18 Hawaii 82.77\n19 New Mexico 81.24\n20 Idaho 79.48\n21 Delaware 78.29\n22 Tennessee 76.83\n23 New York 75.80\n24 Massachusetts 74.16\n25 Maine 73.39\n26 Kansas 73.14\n\n_*Based on 2010 Census figures_\n\n|Rank|State|Per 1,000|Rank|State|Per 1,000|\n|---|---|---|---|---|---|\n|1|Alaska|566.57|27|Texas|73.01|\n|2|Colorado|134.99|28|Indiana|71.94|\n|3|District of Columbia|129.29|29|Pennsylvania|71.64|\n|4|New Jersey|122.86|30|Connecticut|71.37|\n|5|Nevada|119.19|31|Alabama|70.54|\n|6|Maryland|117.29|32|Missouri|69.42|\n|7|Washington|108.06|33|Michigan|68.69|\n|8|Florida|105.72|34|West Virginia|67.99|\n|9|Arizona|104.27|35|Georgia|67.74|\n|10|Virginia|93.76|36|Rhode Island|67.64|\n|11|California|92.89|37|North Carolina|67.15|\n|12|Oregon|92.63|38|Illinois|65.70|\n|13|New Hampshire|87.96|39|South Carolina|65.31|\n|14|Utah|86.14|40|Minnesota|65.31|\n|15|Montana|85.20|41|Oklahoma|63.81|\n|16|Wyoming|84.45|42|Ohio|63.31|\n|17|Vermont|84.37|43|Arkansas|62.45|\n|18|Hawaii|82.77|44|Wisconsin|61 .29|\n|19|New Mexico|81.24|45|Louisiana|59.24|\n|20|Idaho|79.48|46|Kentucky|57.49|\n|21|Delaware|78.29|47|Nebraska|52.56|\n|22|Tennessee|76.83|48|Iowa|50.71|\n|23|New York|75.80|49|North Dakota|48.76|\n|24|Massachusetts|74.16|50|South Dakota|47.28|\n|25|Maine|73.39|51|Mississippi|44.24|\n|26|Kansas|73.14||||\n\n\n-----\n\n###### Table 11: Perpetrators per 100,000 Population*\n\nRank State Per 1,000 Rank State Per 1,000\n\n1 District of Columbia 833.43 27 Virginia 22.88\n2 Montana 87.62 28 Vermont 22.21\n3 Nevada 79.28 29 North Carolina 21.83\n4 Alaska 68.42 30 Michigan 21.70\n5 Washington 58.71 31 Tennessee 21.43\n6 Delaware 54.45 32 Minnesota 21.30\n7 Florida 51.25 33 Indiana 20.60\n8 New York 43.51 34 Pennsylvania 20.37\n9 California 41.86 35 Ohio 19.42\n10 Arizona 40.15 36 Idaho 19.39\n11 Georgia 39.32 37 Kansas 19.17\n12 Maine 38.54 38 South Carolina 18.96\n13 Utah 36.65 39 New Hampshire 18.99\n14 Colorado 35.73 40 Alabama 18.01\n15 North Dakota 34.49 41 Louisiana 17.93\n16 Nebraska 30.77 42 South Dakota 17.56\n17 Wyoming 29.09 43 Oklahoma 17.16\n18 Maryland 28.56 44 Missouri 17.04\n19 Rhode Island 27.93 45 New Mexico 16.02\n20 Texas 27.16 46 Kentucky 15.73\n21 New Jersey 26.42 47 West Virginia 15.43\n22 Oregon 25.84 48 Arkansas 14.84\n23 Connecticut 24.56 49 Wisconsin 14.29\n24 Massachusetts 24.08 50 Iowa 12.53\n25 Illinois 23.64 51 Mississippi 11.18\n26 Hawaii 23.52\n\n_*Based on 2010 Census figures_\n\n_(The District of Columbia’s numbers may be inflated by the number of FBI-related scams, in which complainants_\n_believe the incident has taken place in D.C., even though often the perpetrator is not based there.)_\n\n|Rank|State|Per 1,000|Rank|State|Per 1,000|\n|---|---|---|---|---|---|\n|1|District of Columbia|833.43|27|Virginia|22.88|\n|2|Montana|87.62|28|Vermont|22.21|\n|3|Nevada|79.28|29|North Carolina|21.83|\n|4|Alaska|68.42|30|Michigan|21.70|\n|5|Washington|58.71|31|Tennessee|21.43|\n|6|Delaware|54.45|32|Minnesota|21.30|\n|7|Florida|51.25|33|Indiana|20.60|\n|8|New York|43.51|34|Pennsylvania|20.37|\n|9|California|41.86|35|Ohio|19.42|\n|10|Arizona|40.15|36|Idaho|19.39|\n|11|Georgia|39.32|37|Kansas|19.17|\n|12|Maine|38.54|38|South Carolina|18.96|\n|13|Utah|36.65|39|New Hampshire|18.99|\n|14|Colorado|35.73|40|Alabama|18.01|\n|15|North Dakota|34.49|41|Louisiana|17.93|\n|16|Nebraska|30.77|42|South Dakota|17.56|\n|17|Wyoming|29.09|43|Oklahoma|17.16|\n|18|Maryland|28.56|44|Missouri|17.04|\n|19|Rhode Island|27.93|45|New Mexico|16.02|\n|20|Texas|27.16|46|Kentucky|15.73|\n|21|New Jersey|26.42|47|West Virginia|15.43|\n|22|Oregon|25.84|48|Arkansas|14.84|\n|23|Connecticut|24.56|49|Wisconsin|14.29|\n|24|Massachusetts|24.08|50|Iowa|12.53|\n|25|Illinois|23.64|51|Mississippi|11.18|\n|26|Hawaii|23.52||||\n\n\n-----\n\n## i 3\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/IC3 - Internet Crime Report - 2010.pdf"
    ],
    "report_names": [
        "IC3 - Internet Crime Report - 2010.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535931,
    "ts_updated_at": 1743041316,
    "ts_creation_date": 1297337594,
    "ts_modification_date": 1297859915,
    "files": {
        "pdf": "https://archive.orkl.eu/f567170cc9aac54d570e9288effff8dbc8b6ee5b.pdf",
        "text": "https://archive.orkl.eu/f567170cc9aac54d570e9288effff8dbc8b6ee5b.txt",
        "img": "https://archive.orkl.eu/f567170cc9aac54d570e9288effff8dbc8b6ee5b.jpg"
    }
}