{
    "id": "900495cc-046c-450d-a450-0fff130f8ca4",
    "created_at": "2023-01-12T15:03:46.725288Z",
    "updated_at": "2025-03-27T02:05:35.018206Z",
    "deleted_at": null,
    "sha1_hash": "0445d5f7b52ed5daf07c9e68dd3fd1d56cf5b4e8",
    "title": "2021-05-25 - Evolution of JSWorm ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:36:27Z",
    "file_modification_date": "2022-05-28T19:36:27Z",
    "file_size": 4163337,
    "plain_text": "# Evolution of JSWorm ransomware\n\n**securelist.com/evolution-of-jsworm-ransomware/102428/**\n\nAuthors\n\nFedor Sinitsyn\n\n[Yanis Zinchenko](https://securelist.com/author/yaniszinchenko/)\n\n## Introduction\n\nOver the past few years, the ransomware threat landscape has been gradually changing. We\nhave been witness to a paradigm shift. From the massive outbreaks of 2017, such as\n[WannaCry,](https://securelist.com/wannacry-faq-what-you-need-to-know-today/78411/) [NotPetya, and](https://securelist.com/expetrpetyanotpetya-is-a-wiper-not-ransomware/78902/) [Bad Rabbit, a lot of ransomware actors have moved to the covert](https://securelist.com/bad-rabbit-ransomware/82851/)\nbut highly profitable tactic of “big-game hunting”. News of ransomware causing an outage of\nsome global corporation’s services has now become commonplace.\n\nIn some cases, this global trend is just a reflection of the continuous life cycle of threats: old\nransomware families shut down and new ones appear and pursue new targets. However,\nthere are times when a single ransomware family has evolved from a mass-scale operation\n\n\n-----\n\nto a highly targeted threat – all in the span of two years. In this post we want to talk about\none of those families, named JSWorm.\n\n## Chronology\n\n**JSWorm ransomware was discovered in 2019 and since then different variants have gained**\nnotoriety under various names such as Nemty, Nefilim, Offwhite and several others.\n\nSeveral versions were released as part of each “rebranded” variant that altered different\naspects of the code, renamed file extensions, cryptographic schemes and encryption keys.\n\nIn the diagram below we present some of the names used by this Trojan along with the dates\nthe corresponding variant was actively distributed in the wild (ITW) (not the date it was first\nencountered). We should note that this list is not comprehensive, but it marks the main\nmilestones in the evolution of JSWorm.\n\nTogether with name changes, the developers of this ransomware have also been reworking\ntheir code and trying different approaches to distribution.\n\nAt some point in 2020 the developers even changed the programming language from C++ to\nGolang, completely rewriting the code from scratch. However, the similarity in the\ncryptographic scheme, ransom notes and use of the same data leak website address led us\nto believe it’s the same campaign.\n\nThe original version of the malware, as well as some of the subsequent “rebrandings”, e.g.,\nNemty, were advertised on an underground forum by a poster with the username jsworm.\n\n\n-----\n\n**_Forum advertisement for an early JSWorm variant_**\n\n## Distribution methods\n\nFrom its creation in 2019 until the first half of 2020, JSWorm was offered as a public RaaS\nand was observed propagating via:\n\nRIG exploit kit\nTrik botnet\nFake payment websites\nSpam campaigns\n\nFrom the first half of 2020, the public RaaS was closed and the operators switched to biggame hunting. There is evidence of an initial breach via exploitation of vulnerable server-side\nsoftware (Citrix ADC) and unsecure RDP access.\n\n## Technical details\n\n\n-----\n\nWe will describe some notable variants of the JSWorm family encountered during the history\nof this malware. We won’t attempt to cover all the discovered variants of this malware as they\nare too numerous. The dates indicate the approximate period when the corresponding\nvariant was observed ITW.\n\n### May 2019: JSWorm\n\nMD5: [a20156344fc4832ecc1b914f7de1a922](https://opentip.kaspersky.com/a20156344fc4832ecc1b914f7de1a922/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nThis sample is one of the earliest discovered variants of JSWorm ransomware and, unlike its\nsuccessors, it doesn’t contain an internal version number. The sample is developed in C++\nand compiled in MS Visual Studio.\n\nBesides file encryption, it performs actions such as stopping a number of running processes\nand services to maximize the number of files available for encryption. In addition, it deletes\nall system backups, shadow copies, disables the system recovery mode, and clears event\nlogs.\n\n**Cryptographic scheme**\n\nThe files are encrypted using a custom modification of a Blowfish cipher with a 256-bit key.\nThe key is generated at the beginning of the program execution and based on concatenation\nof the strings: user name, device MAC address and volume serial number (example values\nin the comments).\n\n**_Key generation process_**\n\nThen a string referred to by the ransom notes as “JSWORM PUBLIC KEY” is generated. In\nfact, asymmetric cryptography is not used here and using the word “public” makes no sense\nin this context. What the ransomware developer is calling “JSWORM PUBLIC KEY” is in fact\nthe aforementioned Blowfish key XOR-ed with the string “KCQKCQKCQKCQ” and encoded\nin Base64.\n\n\n-----\n\n**_XOR with the “KCQKCQKCQKCQ” key_**\n\nBelow is an example of key calculation, with the serial number and MAC address values\nchosen for illustration purposes:\n\nBlowfish key: “53385773534FE:ED:00:DE:AF:00user”\nPublic key after XOR: “5xpi~tfxvb\\x05\\x14q\\x06\\x15qsaq\\x07\\x14q\\x02\\x17qsa>049”\nPublic key after conversion to Base64:\n“NXhwaX50Znh2Yn8FFHEGFXFzYXEHFHECF3FzYT4wNDk=”\n\nA custom version of Blowfish is used for encryption of the content of each of the victim’s files.\nNo more than 100,000 bytes are encrypted, probably to speed up encryption of large files.\nThe encrypted data is written over the original.\n\nThe developers changed the internal implementation of the Blowfish cipher, which resulted in\nit being incompatible with standard implementations, probably in an attempt to make\ndecryption more difficult for researchers.\n\nAfter encrypting the contents of a file, the program renames it. An additional extension “.\n\n[ID-…][mail@domain.tld].JSWORM” is added to the filename.\n\n**Encryption flaws**\n\n\n-----\n\nThe malware essentially saves the key that can be used for decryption in the ransom notes.\nBase64-decoding and un-xoring it is trivial, and the victim’s data can be saved without paying\nthe ransom. Even if the ransom note is for some reason lost, the key can be easily\nregenerated on the infected machine.\n\n### July 2019: JSWorm 4.0.3\n\nMD5: [5444336139b1b9df54e390b73349a168](https://opentip.kaspersky.com/5444336139b1b9df54e390b73349a168/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nAn improved and updated version of JSWorm that attempts to fix flaws found in the previous\nvariants.\n\nThis sample contains a language check of the infected machine. This is most likely intended\nto prevent encryption of data on systems where the following languages are used: RU\n(Russian), BE (Belarusian), UZ (Uzbek), KY (Kyrgyz), TG (Tajik), TK (Turkmen), KK\n(Kazakh), UK (Ukrainian).\n\n**_Determining the user’s language_**\n\nHowever, likely due to an error, this version of ransomware only encrypts files if the system\nlanguage is Russian. If we look closely at the conditions above, we can see that the first\ncondition is ‘!=’ (‘not equal’). This makes the Trojan execute the code branch that exits\nwithout encryption on systems systems where the language is not Russian. If the condition\nwas ‘==’, the other branch would have been taken, resulting in what was probably the\noriginally intended behavior of the Trojan.\n\nThe ransom note in this variant is implemented as an HTA file named <ID>-DECRYPT.hta,\nwhere <ID> is the unique victim ID assigned by the malware. The HTA file is launched upon\ncompletion of the file encryption and also added to the autorun via registry:\n\nreg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run /v “zapiska” /d\n“C:\\Users\\user\\JSWRM-DECRYPT.hta”\n\n\n-----\n\nreg add HKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run /v zapiska /d\n“C:\\Users\\user\\JSWRM-DECRYPT.hta”\n\n**_Ransom note of JSWorm 4.0.3_**\n\n**Cryptographic scheme**\n\nThis version of JSWorm uses the WinAPI implementation of RSA and a custom\nimplementation of AES to encrypt files. JSWorm generates two random values of 128 bits\n(IV) and 256 bits (key) that are limited to the characters: a…z, A…Z, and 0…9. The RSA\npublic key is embedded inside the ransomware:\n\n\n-----\n\n**_RSA public key used in JSWorm 4.0.3_**\n\nUsing this key, JSWorm encrypts the AES key and initialization vector (IV) and encodes them\ninto Base64:\n\n**_WinAPI RSA encryption in JSWorm 4.0.3_**\n\nAfterwards, this value is added to the ransomware note <ID>-DECRYPT.hta, but the value\nitself is not displayed visually because it is located inside the file as an HTML comment.\n\n\n-----\n\n**_Values inside the .hta ransom note file_**\n\nIn order to make decryption attempts more difficult for researchers, the malware developers\nimplemented a custom variant of the AES block cipher which is incompatible with the\nstandard algorithm. The contents of the victim’s files are encrypted by this cipher with the key\nand IV described above.\n\nFor optimization, like before, only the first 160,000 bytes are encrypted in large files. After\nencryption, an additional extension is appended to the filename, which is familiar to us from\nthe previous sample: “<filename>.[ID-NQH1J49][doctorSune@protonmail.com].JSWRM”.\n\n**Encryption flaws**\n\nIn this variant of JSWorm the developers tried to fix the flaws found by researchers in\nprevious versions. However, decryption without payment was still possible. The\npseudorandom number generator used to generate the key and IV is not cryptographically\nsecure and it allows researchers to restore the key and IV by attacking the generation\nalgorithm. Knowing these values, they can decrypt the victims’ data.\n\n### August 2019: Nemty 1.4\n\nMD5: [1780f3a86beceb242aa81afecf6d1c01](https://opentip.kaspersky.com/1780f3a86beceb242aa81afecf6d1c01/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nThe code change between JSWorm and Nemty is significant. Based on our analysis, the\nmalware developers may have rewritten their Trojan from scratch, possibly to prevent\nsuccessful decryption attempts that allowed victims of several earlier variants of JSWorm to\nrestore their data without paying.\n\nThis sample is also developed in C++ and compiled in MS Visual Studio. It implements a\nminor anti-analysis trick consisting of a string obfuscation algorithm. The strings (e.g.,\nransom note name and contents, RSA public key, payment URL, etc.) are encrypted by the\n\n\n-----\n\nRC4 stream cipher with a hardcoded key **fuckav and encoded in Base64.**\n\n**_Ransom note of Nemty 1.4_**\n\nUpon launch, the sample will gather the information about storage devices attached to the\ninfected machine, get its external IP address by an HTTP request to http://api.ipify.org,\ndetermine the victim’s country by requesting data from http://api.db-ip.com/v2/free/, generate\na pair of RSA-2048 session encryption keys, and combine all the gathered information in a\nJSON structure. This structure is then encrypted by the public RSA key of the threat actors\nand saved at the end of the ransom notes as “NEMTY DECRYPTION KEY”.\n\n\n-----\n\n**_Information gathered prior to being encrypted by RSA_**\n\nSome of the fields of interest in this structure:\n\n**isRU: specifies whether the country of the victim determined by their external IP**\naddress is one of the following: Russia, Belarus, Kazakhstan, Tajikistan, Ukraine\n**version: internal version of the Trojan**\n**CompID: unique ID of the infected machine**\n**FileID: infection ID generated on every malware launch**\n**UserID: ID of the affiliate, hardcoded in the Trojan sample**\n**key: base64-encoded key for file encryption (will be discussed later)**\n**pr_key: base64-encoded private session RSA-2048 key (will be discussed later)**\n\n**Cryptographic scheme**\n\nThe Trojan sample contains the threat actor’s hardcoded RSA-8192 public key, which we will\ncall the master RSA public key.\n\nWhen executed on the victim’s machine, the Trojan also generates a pair of session RSA**2048 keys with the private key addressed above as pr_key. In addition to this, it also**\ngenerates a 256-bit key that will be used with a custom block cipher based on AES\n\n\n-----\n\nThe 256-bit key and pr_key are encrypted by the master RSA public key and saved in the\nransom notes.\n\nWhen encrypting each of the victim’s files, Nemty 1.4 will generate a 128-bit IV and use the\n256-bit key with this IV to encrypt the file contents by a custom AES-based cipher. The IV is\nencrypted by the session public RSA key and appended to the encrypted file.\n\nEach encrypted file is renamed so that it gets an additional extension “._NEMTY_<…>_”\nwhere the skipped part is the infection ID mentioned above as FileID.\n\n**Encryption flaws**\n\nLike some of the earlier variants of JSWorm, the implementation of the cryptographic\nscheme in Nemty 1.4 is not flawless. Decryption of the victims’ files was possible by\nexploiting two weaknesses:\n\n1. The PRNG for the key generation is not secure;\n2. The RSA session key is not removed from the system store.\n\nBy using the first weakness, it’s possible to restore the 256-bit key, while the pr_key can be\nrestored using the second. Once you know the pr_key, you can decrypt the IV and then,\narmed with the 256-bit key and IV, decrypt the victim’s file contents.\n\n**C&C communication**\n\nThe sample downloads the TOR client from https://dist.torproject.org/torbrowser/8.5.4/torwin32-0.4.0.5.zip, extracts it and launches on the infected machine. After waiting for 30\nseconds (obviously deemed by the malware developers to be long enough to connect to the\nTOR network), the Trojan sends information about the infection to its C&C server hardcoded\nin the sample:\n\n1 zjoxyw5mkacojk5ptn2iprkivg5clow72mjkyk5ttubzxprjjnwapkad.onion\n\nNemty 1.4 uses HTTP GET with URI /public/gate?data=\n\nThe information sent to the server is the same as that saved in each ransom note and is\nessentially an encrypted version of the JSON structure discussed above.\n\n**Further versions of Nemty**\n\nThe ‘Nemty’ branding was used until March of 2020. One of the last variants had the internal\nversion 3.1.\n\nIn the few months following the initial creation, several intermediate versions of Nemty were\ndiscovered. The changes include different mutex names and C&C addresses, the added\nability to terminate running processes, stop services and delete shadow copies, improved\n\n\n-----\n\ncryptography that prevented unpaid decryption, changes to the ransom text, and numerous\ntweaks.\n\nAs a side note, the developers of this malware tend to hardcode strings in Russian\n(transliterated) seemingly as a joke or maybe as a way to gain attention from researchers.\nSome of the strings contain profanities that turned out to be quotes from rap songs.\n\n**_Strings in a sample of Nemty 2.4_**\n\n**_Strings in a sample of Nemty 2.6_**\n\n### March 2020: Nefilim\n\nMD5: [5ff20e2b723edb2d0fb27df4fc2c4468](https://opentip.kaspersky.com/5ff20e2b723edb2d0fb27df4fc2c4468/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nAround March 2020, the developers changed the branding of their Trojan to Nefilim. Around\nthe time the first variants of Nefilim started appearing, the distribution model of this family\nchanged. The developers switched from the public RaaS scheme used with the JSWorm and\nNemty variants to private cooperation with affiliates aimed at big-game hunting. The threat\nactors started targeting high-profile victims and manually operating inside the victim’s\nnetwork, exfiltrating confidential data and threatening to leak it to intimidate the victim.\n\nAll auxiliary functionality such as process termination, deletion of shadow copies,\ncommunication with C&C, was removed from the Trojan’s code. The Trojan became a singlepurpose binary used exclusively for file encryption. If any additional actions were deemed\nnecessary, they were carried out by the threat actors manually or with the help of additional\nthird-party tools.\n\nNefilim is developed in C++ and compiled in MS Visual Studio like Nemty, and the code\noverlap between the later versions of Nemty (2+) and Nefilim is very substantial and allows\nus to suggest that the development continued from the same source code.\n\nOne example of the code overlap is that of the string decryption procedures – they are\nidentical with the RC4 key being the only difference.\n\n\n-----\n\n**_Identical string decryption procedures. Left: Nemty 2.6_**\n**_[(141dbb1ff0368bd0359972fb5849832d); right: Nefilim](https://opentip.kaspersky.com/141dbb1ff0368bd0359972fb5849832d/?utm_source=SL&utm_medium=SL&utm_campaign=SL)_**\n\nThe overlap is not limited to string obfuscation – code fragments for various procedures\nmatch throughout the samples, including the key generation and file encryption functions.\n\n**_Code similarity in file encryption procedures. Left: Nemty 2.6_**\n**_(141dbb1ff0368bd0359972fb5849832d); right: Nefilim_**\n\nUnlike Nemty, the Nefilim sample is signed by a digital signature that was valid at the time\nthis malware variant was being actively distributed, but has since been revoked.\n\nUpon launch, the malware checks command line arguments. If there are no arguments, it\nproceeds to search for the victim’s files on all local and remote drives. If an argument is\ngiven, the Trojan checks whether it is an existing directory path. If so, it will encrypt the files\n\n\n-----\n\nin this directory. Otherwise, it will interpret the argument as a file path and attempt to encrypt\nthis file. The command line argument checks may have been added to allow cybercriminals\nto manually choose files for encryption or merely as a debug functionality.\n\n**Cryptographic scheme**\n\nThe Trojan body contains the threat actors’ hardcoded master RSA-2048 public key. When\nprocessing each victim’s file, Nefilim generates a 128-bit key and a 128-bit IV and encrypts\nthe file content by AES in CBC mode. The key and IV are encrypted by the RSA master key\nand saved at the end of the encrypted file.\n\nThe encrypted file is renamed so that it gets the additional extension .NEFILIM.\n\nThe ransom notes are saved as NEFILIM-DECRYPT.txt in the processed directories and\ncontain email addresses to contact the extortionists.\n\n**_Ransom note dropped by Nefilim_**\n\n### April 2020: Offwhite\n\nMD5: [ad25b6af563156765025bf92c32df090](https://opentip.kaspersky.com/ad25b6af563156765025bf92c32df090/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nWith the branding change from Nefilim to Offwhite the code of the malware has been\nfurther trimmed to reduce the resulting binary size. To achieve this, the developers stopped\nusing the STL library and got rid of C++ runtime code that was adding unnecessary bulk.\nOtherwise, it’s still basically the same old Nefilim. In addition to the capabilities we already\ndiscussed in the previous section, one other feature of note has been added to the Trojan\ncode allowing it to generate a wallpaper from the ransom text and save it as “scam.jpg”.\n\n\n-----\n\n**_Wallpaper generated by Offwhite_**\n\n### June 2020: Telegram\n\nMD5: [004f67c79b428da67938dadec0a1e1a4](https://opentip.kaspersky.com/004f67c79b428da67938dadec0a1e1a4/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nThe differences between the Offwhite and Telegram variants of the Trojan are minimal. The\ncode is almost identical with the main differences being the encrypted file extension\n(.TELEGRAM), the ransom note name (TELEGRAM-RECOVER.txt), and the fact that the\nnames of imported API functions are not encoded as HEX strings.\n\n### November 2020: Fusion\n\nMD5: [f37cebdff5de994383f34bcef4131cdf](https://opentip.kaspersky.com/f37cebdff5de994383f34bcef4131cdf/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nThis Trojan variant is written in the Go programming language. As we mentioned above,\nprevious variants were developed in C++, which means a complete rewrite from scratch,\npossibly by another developer.\n\nHowever, the similar overall modus operandi of the malware, similar cryptographic scheme,\nmatching ransom notes, and the fact that the binary is signed, suggest this sample is in fact\na new variant of the JSWorm family.\n\n\n-----\n\nWhat s more, the data leak site addresses hardcoded in the Trojan s body are the same\n**as the ones used previously by these threat actors, which is a pretty compelling**\nargument in support of our suggestion that there’s a link between Fusion and its\npredecessors.\n\nAlso, like the previous variants, the Fusion program accepts a command line argument: the\nname of the file to be encrypted (possibly used to debug the ransomware).\n\n**Cryptographic scheme**\n\nThe program generates two 128-bit random numbers (IV and key) that are used to encrypt\nfiles using AES in GCM mode according to the following scheme: if the file is less than\n1.5MB, then the entire file is encrypted; if the file is larger, then sequentially:\n\n320KB of information is encrypted;\n320KB skipped (not encrypted);\nthe next 320KB are encrypted;\nthe next 320KB are skipped;\n…\nand so on until the end of the file.\n\nThis means that if the file is large, half turns out to be encrypted (albeit in alternating blocks).\n\nA master public RSA key is embedded inside the program and used to encrypt the IV and\nkey values. Once encrypted, they are appended to the end of each encrypted file.\n\n**_RSA public key used by Fusion_**\n\nAnd finally, the line “FUSION” is written to the end of the file. The extension “.FUSION” is\nthen appended to the file name. The sample also leaves a note with contacts for\ncommunication (FUSION-README.txt):\n\n\n-----\n\n**_Ransom note dropped by Fusion_**\n\n### January 2021: Milihpen\n\nMD5: [e226e6ee60a4ad9fc8eec41da750dd66](https://opentip.kaspersky.com/e226e6ee60a4ad9fc8eec41da750dd66/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nWith the Milihpen variant the actors behind the JSWorm family have once again completely\nreworked the code of the malware, or perhaps hired another developer to implement it from\nscratch. This sample is once again developed in C++ (like Nefilim and previous variants) and\nnot Golang (like Fusion).\n\nDespite this, the main functionality, execution flow, crypto scheme and data leak site\naddresses are preserved. In addition, the Trojan name reveals a connection to one of the\nprevious malware variants – it’s the word “Nephilim” written backwards.\n\nThe Trojan now logs all its actions to console, probably making it more convenient for the\nmalware operator to control the infection process.\n\n\n-----\n\n**_Console logging of Milihpen_**\n\nAs with previous variants, the malware sample is signed by a digital certificate. Upon launch,\nMilihpen parses the configuration data hardcoded in the Trojan’s body. This configuration\nstructure is stored in JSON format and contains the following fields:\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n\n{\n\n//mutex name\n\n\"mutex\": \"MILIHPEN\",\n\n//encrypted file extension\n\n\"ext\": \"MILIHPEN\",\n\n//ransom note name part\n\n\"nt_name\": \"-INSTRUCT.txt\",\n\n//master RSA public key (base64-encoded), redacted\n\n\"pub\": \"UlNB...Bnum9ew==\",\n\n//ransom note text (base64-encoded), redacted\n\n\"nt_content\": \"VHdvIHRoa...wuY29t\",\n\n//skipped file extensions\n\n\"whiteext\": [\".exe\", \".dll\", \".lnk\", \".url\", \".log\", \".cab\", \".cmd\", \".bat\", \".dll\", \".msi\", \".mp3\",\n\".mp4\", \".pif\", \".ini\"],\n\n//skipped directory names\n\n\"whitedir\": [\"windows\", \"programdata\", \"program files\", \"program files (x86)\",\n\"appdata\", \"$recycle.bin\", \"all users\", \".\", \"..\", \"rsa\"],\n\n//dynamically imported API function names\n\n\"winapi\": [\"MessageBoxA\", \"MessageBoxW\", \"BCryptOpenAlgorithmProvider\",\n\"BCryptGenRandom\", \"BCryptImportKeyPair\", \"BCryptEncrypt\"]\n\n}\n\n\n-----\n\nAfter parsing the values from the configuration, Milihpen creates a mutex, parses command\nline arguments and proceeds to operate with the same logic as Nefilim and more recent\nJSWorm variants. If a command line argument is provided, the Trojan checks whether it’s a\ndirectory path. If so, it will encrypt files inside it; otherwise, it will interpret it as a file path and\ntry to encrypt it. If no argument is given, the Trojan searches all local and remote drives for\nthe victim’s files.\n\n**_Configuration JSON structure in the Milihpen sample_**\n\n**Cryptographic scheme**\n\nAs with other aspects, Milihpen closely mimics the high-level logic of previous variants\nstarting with Nefilim and its successors. Code analysis shows, however, that the\nimplementation has been completely rewritten.\n\nTo encrypt the files, Milihpen uses the same algorithms: AES in CBC mode and RSA. The\nAES key and IV are also 128-bit and are saved after encryption by the master public RSA\nkey at the end of the encrypted file.\n\n\n-----\n\nFor random number generation and RSA encryption, unlike its predecessors, Milihpen uses\nfunctions from BCrypt API which is a part of the Cryptography Next Generation (CNG) API\nthat was introduced in Windows Vista. This doesn’t provide any significant advantages to\nMilihpen, but it’s a notable characteristic as BCrypt API is not commonly used in cryptoransomware nowadays.\n\nThe encrypted files are renamed with an additional extension .MILIHPEN and the ransom\nnotes are saved as MILIHPEN-INSTRUCT.txt.\n\nThe ransom note contains similar text to previous variants of this family as well as the same\ndata leak site addresses.\n\n**_Ransom note dropped by Milihpen_**\n\n### February 2021: Gangbang\n\nMD5: [173ab5a59490ea2f66fe37c5e20e05b8](https://opentip.kaspersky.com/173ab5a59490ea2f66fe37c5e20e05b8/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n\n-----\n\nThe Gangbang variant is identical to Milihpen and is currently the most recently discovered\nstrain of this ransomware family. The only notable difference is the fact that the configuration\nstructure is now encrypted by AES with a hardcoded key and IV instead of being in plaintext\nlike in Milihpen. Additionally, in contrast with previous versions, the digital signature on this\nsample is invalid.\n\n**_Configuration of the Gangbang sample (redacted)_**\n\n## Data leak site\n\nIn the spring of 2020, the actors behind JSWorm family switched to big-game hunting and\nstarted their own website where they could publish confidential data stolen from their victims.\n\nAt the time of writing, the website is still operational and contains posts about more than a\nhundred organizations that fell victim to this malware.\n\n\n-----\n\n**_Page about the threat actors’ terms_**\n\nThe ‘contact’ page lists email addresses currently used by the threat actors for negotiations.\n\n\n-----\n\n**_Page with contact email addresses_**\n\nFor some victims there are also individual pages where some of the data stolen from them\ncan be downloaded.\n\n\n-----\n\n**_Stolen data download page_**\n\n\n-----\n\n## Victims\n\nBased on our KSN telemetry, we created a chart illustrating the geographical distribution of\nJSWorm ransomware attacks.\n\n_[Geography of JSWorm victims according to KSN (download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2021/05/24123501/01-en-jsworm-diagrams.png)_\n\n**Top 10 countries attacked by JSWorm according to KSN statistics**\n\n**Country** **%***\n\n1 China 21.39%\n\n2 United States of America 7.96%\n\n3 Vietnam 7.46%\n\n4 Mexico 6.97%\n\n5 Russian Federation 6.47%\n\n6 Brazil 5.47%\n\n7 India 5.47%\n\n8 Germany 4.98%\n\n9 France 4.48%\n\n10 Republic of Korea 2.99%\n\n_* Unique users attacked by JSWorm ransomware family in the country as a percentage of all_\n_users who encountered JSWorm ransomware_\n\nWe also analyzed the data about victims posted by the threat actors themselves on their\ndata leak site. Based on this data, we created a chart illustrating the distribution of JSWorm\nvictims by industry.\n\n_Distribution of JSWorm victims by industry according to the data leak site of the threat actors_\n_[(download)](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2021/05/24123527/02-en-jsworm-diagrams.png)_\n\nAccording to the victim list published by the threat actors, two-fifths (41%) of JSWorm attacks\nwere targeted against companies in the Engineering and Manufacturing category. Energy\nand Utilities (10%), Finance (10%), Professional and Consumer Services (10%),\nTransportation (7%), and Healthcare (7%) were also at the top of their list.\n\n## Conclusion\n\n\n-----\n\nThe JSWorm family has already been evolving for two years and during this time it has\nchanged distribution models and the Trojan has undergone several complete\nredevelopments. Since its initial emergence in 2019, it has turned from a typical mass-scale\nransomware threat affecting mostly individual users into a typical big-game hunting\nransomware threat attacking high-profile targets and demanding massive ransom payments.\n\nAs with other targeted ransomware threats of today, the key to preventing JSWorm infection\nincidents is a complex approach to securing an organization’s network. Any weakness may\nbecome an entry point for the threat actors, be it a vulnerable version of server-side\nsoftware, an employee clicking a malicious link, a weak password for remote control\nsystems, and so on.\n\nTo boost defenses against big-game hunting ransomware, we recommend carrying out a\nsecurity audit of your network in order to find and proactively fix any security flaws.\n\nOther recommendations for maximizing security of your organization:\n\nDo not expose remote desktop services (such as RDP) to public networks unless\nabsolutely necessary and always use strong passwords for them.\nMake sure commercial VPN solutions and other server-side software are always up to\ndate as exploitation of this type of software is a common infection vector for\nransomware. Always keep client-side applications up to date as well.\nFocus your defense strategy on detecting lateral movements and data exfiltration to the\ninternet. Pay special attention to the outgoing traffic to detect cybercriminal\nconnections. Back up data regularly. Make sure you can quickly access it in an\n[emergency when needed. Use the latest Threat Intelligence information to stay aware](https://www.kaspersky.com/enterprise-security/threat-intelligence)\nof actual TTPs used by threat actors.\n[Use solutions like Kaspersky Endpoint Detection and Response and the](https://www.kaspersky.com/enterprise-security/endpoint-detection-response-edr) Kaspersky\nManaged Detection and Response service to help identify and stop an attack at the\nearly stages, before the attackers achieve their ultimate goals.\nTo protect the corporate environment, educate your employees. Dedicated training\ncourses can help, such as those provided in the Kaspersky Automated Security\nAwareness Platform.\nUse a reliable endpoint security solution, such as Kaspersky Endpoint Security for\nBusiness that is powered by exploit prevention, behavior detection and a remediation\nengine that is able to roll back malicious actions. KESB also has self-defense\nmechanisms that can prevent its removal by cybercriminals.\n\n## IoC\n\nJSWorm (early variant)\n\nMD5: [a20156344fc4832ecc1b914f7de1a922](https://opentip.kaspersky.com/a20156344fc4832ecc1b914f7de1a922/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n\n-----\n\nJSWorm 4.0.3\nMD5: [5444336139b1b9df54e390b73349a168](https://opentip.kaspersky.com/5444336139b1b9df54e390b73349a168/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nNemty 1.4\nMD5: [1780f3a86beceb242aa81afecf6d1c01](https://opentip.kaspersky.com/1780f3a86beceb242aa81afecf6d1c01/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nNefilim\nMD5: [5ff20e2b723edb2d0fb27df4fc2c4468](https://opentip.kaspersky.com/5ff20e2b723edb2d0fb27df4fc2c4468/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nOffwhite\nMD5: [ad25b6af563156765025bf92c32df090](https://opentip.kaspersky.com/ad25b6af563156765025bf92c32df090/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nTelegram\nMD5: [004f67c79b428da67938dadec0a1e1a4](https://opentip.kaspersky.com/004f67c79b428da67938dadec0a1e1a4/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nFusion\nMD5: [f37cebdff5de994383f34bcef4131cdf](https://opentip.kaspersky.com/f37cebdff5de994383f34bcef4131cdf/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nMilihpen\nMD5: [e226e6ee60a4ad9fc8eec41da750dd66](https://opentip.kaspersky.com/e226e6ee60a4ad9fc8eec41da750dd66/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\nGangbang\nMD5: [173ab5a59490ea2f66fe37c5e20e05b8](https://opentip.kaspersky.com/173ab5a59490ea2f66fe37c5e20e05b8/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[Data Encryption](https://securelist.com/tag/data-encryption/)\n[Data theft](https://securelist.com/tag/data-theft/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[RaaS](https://securelist.com/tag/raas/)\n[Ransomware](https://securelist.com/tag/ransomware/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\nFedor Sinitsyn\n\n[Yanis Zinchenko](https://securelist.com/author/yaniszinchenko/)\n\n\n-----\n\nEvolution of JSWorm ransomware\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-25 - Evolution of JSWorm ransomware.pdf"
    ],
    "report_names": [
        "2021-05-25 - Evolution of JSWorm ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535826,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653766587,
    "ts_modification_date": 1653766587,
    "files": {
        "pdf": "https://archive.orkl.eu/0445d5f7b52ed5daf07c9e68dd3fd1d56cf5b4e8.pdf",
        "text": "https://archive.orkl.eu/0445d5f7b52ed5daf07c9e68dd3fd1d56cf5b4e8.txt",
        "img": "https://archive.orkl.eu/0445d5f7b52ed5daf07c9e68dd3fd1d56cf5b4e8.jpg"
    }
}