{
    "id": "90761dba-b0a0-4ff9-a05e-634b683f9230",
    "created_at": "2022-10-25T16:48:19.651626Z",
    "updated_at": "2025-03-27T02:09:55.02544Z",
    "deleted_at": null,
    "sha1_hash": "b57a4e25e79fe50e72ebbec7480a56bbb3f25e9d",
    "title": "Kaspersky Systems Management",
    "authors": "",
    "file_creation_date": "2017-08-15T19:32:32Z",
    "file_modification_date": "2017-08-15T19:32:32Z",
    "file_size": 237481,
    "plain_text": "# ShadowPad: popular server management software hit in supply chain attack\n\n## Part 2: Technical Details\n\n\n-----\n\nShadowPad is a modular cyber-attack platform that attackers deploy in victim networks to\ngain flexible remote control capabilities. The platform is designed to run in two stages. The\nfirst stage is a shellcode that was embedded in a legitimate nssock2.dll used by Xshell,\nXmanager and other software packages produced by NetSarang. This stage is responsible\nfor connecting to “validation” command and control (C&C) servers and getting configuration\ninformation including the location of the real C&C server, which may be unique per victim.\nThe second stage acts as an orchestrator for five main modules responsible for C&C\ncommunication, working with the DNS protocol, loading and injecting additional plugins into\nthe memory of other processes.\nAll actual payloads are received from the real C&C as plugins and can perform different\ntypes of data exfiltration.\n\n## NSSOCK2.DLL - the compromised library\n```\n    SHA256   462a02a8094e833fd456baf0a6d4e18bb7dab1a9f74d5f163a8334921a4ffde8\n    MD5     97363d50a279492fda14cbab53429e75\n    Compiled  2017.07.13 01:23:01 (GMT), 11.0\n    Type    I386 Windows GUI DLL\n    Size    180432\n    Internal name nssock2.dll\n\n```\nThe main loader is built into the original \"nssock2.dll\", which is digitally signed. The malicious\ncode is triggered from one of the object autoinitializations that are automatically called by the\nC runtime code. It decrypts a binary blob with a function similar to “rand” and directly starts\nits execution.\n\nThe blob is a self-loading executable converted into shellcode. It starts with a loader that\nprocesses a proprietary PE-like formatted blob, loads the code and data section by section,\nresolves imported API functions, relocates the code and then calls the entrypoint as DllMain.\n\nEach self-loading shellcode contains a timestamp field that appears to be equal to UNIX\ntimestamps.\n\n## Shellcode in NSSOCK2.DLL\n```\n    Size    77824\n    Type    shellcode, binary reconstructed from a proprietary format \n\n### 1 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\n```\n    Timestamp 2017.05.26 07:00:23 (GMT)\n\n```\nThe binary object is produced from a compiled Windows DLL file. The entrypoint of the blob\nstarts with a standard Microsoft Visual Studio DllMain code stub. All strings are encrypted\nwith a custom randomisation function and each string starts with a 2-byte decryption key. It\nmaintains a configuration block in the Windows registry using one of the following locations:\n\n**HKCU\\SOFTWARE\\%d**\nor\n**HKLM\\SOFTWARE\\%d,**\n\nwhere %d is a signed integer produced from the system drive's serial number xor-ed with\n0xD592FC92. The block is stored in a value named \"Data\" and is 552 bytes long. It contains\na unique user id (generated GUID), 8 byte decryption key for the second stage, first\nexecution time, execution counter. It generates a hostname for accessing its C&C server\nusing a DGA (domain generation algorithm) based on the current month and year in the .com\ntop level domain. The request to the C&C is sent through the DNS extracted from the\nnetwork adapter settings or to hardcoded DNS servers IPs : 8.8.8.8, 8.8.4.4, 4.2.2.1, 4.2.2.2.\n\nAs of August 2017, the following domain name was used: nylalobghyhirgh.com\nAt the time of analysis the domain was registered with the following WHOIS information:\n```\n    Domain Name: NYLALOBGHYHIRGH.COM                           \n    Registry Domain ID: 2146218329_DOMAIN_COM-VRSN                    \n    Registrar WHOIS Server: whois.namesilo.com                      \n    Registrar URL: http://www.namesilo.com                        \n    Updated Date: 2017-07-24T06:41:22Z                          \n    Creation Date: 2017-07-24T06:41:22Z                         \n    Registry Expiry Date: 2018-07-24T06:41:22Z                      \n    Registrar: NameSilo, LLC                               \n    Registrar IANA ID: 1479                               \n    Registrar Abuse Contact Email: abuse@namesilo.com                  \n    Registrar Abuse Contact Phone: +1.4805240066                     \n    Domain Status: clientTransferProhibited\n    https://icann.org/epp#clientTransferProhibited                    \n    Name Server: NS1.QHOSTER.NET                             \n    Name Server: NS2.QHOSTER.NET                             \n    Name Server: NS3.QHOSTER.NET                             \n    Name Server: NS4.QHOSTER.NET                             \n    DNSSEC: unsigned            \n\n```\nDNS requests are sent every 8 hours. The request buffer presented to the C&C server\ncontains the following data:\n```\n    Value        Description\n    -----------------------------------    00 00      encryption key\n\n### 2 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\n```\n    52 4F 4F 44     'DOOR', magic value\n    6 bytes     GUID       \n    2 bytes     iteration counter\n    1 byte      year's least significant byte + 0x30\n    1 byte      month\n    1 byte      day\n    *        hostname\n    *        domain name\n    *        user name\n\n```\nThe request buffer is encrypted with custom XOR-based encryption algorithm. Then, the\nencrypted buffer is converted to a readable string of latin characters by adding each half of\nthe byte to ‘a’ and ‘j’ characters correspondingly.\nThe first character is encoded by adding the 'a' character to the number of non-dot\ncharacters in the DGA domain name. This string is split in a series of subdomains of 50-63\nbytes long split by dots and then prepended to the DGA-generated hostname name.\n\nThe resulting request packet querying a *.....*.%DGA-domain%.com is sent to all the DNS\nservers available and Google DNS servers.\n\nThe DNS packet wrapping the request buffer starts with the following fields:\n```\n    Value       Description\n    -----------------------------------    2 bytes     Random request ID\n    01 00      Opcode (recursive request)\n    00 01      Number of queries: 1\n    00 00      Number of answers: 0\n    00 00      Number of name server records: 0\n    00 00      Number of authoritative response records: 0\n    *        Encoded data represented as a hostname\n    00 10      Query type: TXT\n    00 01      Query class: IN\n\n```\nThe module waits for a response from any DNS server until timed out or some data is\nreceived. The DNS packet is checked to conform to the following format:\n```\n    Value        Description\n    -----------------------------------    ?? ??      ID\n    xx x0      No error\n    xx xx      Number of queries\n    xx xx      Number of answers\n    xx xx      Number of name server records\n    00 00      Number of authoritative response records\n\n### 3 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\n```\n    --query-    *        Encoded data in the query record, first char + 'a'\n    is number of stray bytes at the end, all the rest encoded as two\n    latin characters starting from 'a', 'j'\n    00 10      Query type: TXT\n    00 01      Query class: IN\n    --response-    C0 0C      Name: backwards link to the query record\n    00 10      Query type: TXT\n    00 01      Query class: IN\n    00 01 xx xx   TTL\n    xx xx      Record length\n    *        Encoded response from the C2 server. Data format is\n    the same as for the query part.\n\n```\nThe response string is decrypted using the first two bytes of the response packet as a key.\nThe data format follows:\n```\n    xx xx      encryption key\n    -- after decryption -    52 4F 4F 44    'DOOR', magic value\n    2 bytes     iteration counter\n    1 byte      status : 1 - ready to decrypt the payload, 2 - stop\n    operation\n    4 bytes     part of decryption key\n    4 bytes     part of decryption key\n    4 bytes     length of additional data\n    *        additional data\n\n```\nThe module copies information received from the C&C server to its configuration storage and\nupdates the corresponding registry key.\nOnce a proper decryption key is read from the registry or from the DNS response it is used to\ndecipher the second encrypted shellcode (“stage 2”). It is then called directly passing the\n'additional data' string received from the C&C as an argument to the shellcode.\n\n### 4 ShadowPad, part 2: Technical Details\nAugust 2017\n\n\n-----\n\n## Second stage shellcode in “NSSOCK2.DLL”\n```\n    Size    54288\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 07:00:13 (GMT)\n\n```\nThe shellcode was produced from a Windows DLL file. The entrypoint of the blob starts with\nstandard MSVC DllMain code. The format of the blob is the same as in the \"Shellcode in\nNSSOCK2.DLL\".\nThe DllMain function differs from the standard C/C++ implementation. Besides standard\n“fdwReason” parameter values it also processes custom ones: 100, 101, 102, 103, 104.\n\n\"Reason\" codes 102-104 are used to implement a custom plugin API.\n\nCode 100 : plugin initialization\nCode 101 : plugin deinitialization\nCode 102 : return the plugin's numeric identifier 100 in the lpReserved parameter\nCode 103 : allocate a string for the plugin's name i.e. \"Root\" and return the value in the\nlpReserved parameter\nCode 104 : return a pointer to plugin's function table in a DWORD pointed by the\n“lpReserved” parameter\n\nDuring DLL initialization the module allocates memory for internal structures and sets up its\nfunction table. Then, it uses the pointer to its own image as a plugin and initializes the plugin\ninfrastructure.\nThe plugin is started by calling sequentially its entrypoint (DllMain) with “Reason” parameters\n100, 102, 104 and copying the data returned in a structure describing the plugin. Once the\nplugin returns no error during initialization it is added to the plugin list.\n\nDepending on the mode of operation, it can then proceed with the plugin orchestrator, either\nin a separate thread or inline - that is specified by the parameter provided by the C&C.\n\n### 5 ShadowPad, part 2: Technical Details\nAugust 2017\n\n\n-----\n\n### Module / plugin orchestration\n\nThe image contains five encrypted blobs structured in the same way as the second stage\nblob. They are decrypted with a XOR-based algorithm, decompressed with QuickLZ and\nloaded in memory. Then they are initialized and added to the list of plugins in the same way\nas the \"Root\" plugin.\nEach plugin has a name and a numeric identifier (ID):\n```\n    ID  Name\n    ------------    100 Root (the second stage shellcode itself)\n    101 Plugins\n    102 Config\n    103 Install\n    104 Online\n    203 DNS\n\n```\nThen the module searches for the plugin with ID 103 (“Install”) and calls its second function.\nThe process is terminated if the plugin is not available. The module remains in memory as\nthe \"Root\" plugin and provides various facilities for the other plugins via the exported function\ntable.\n\n## Modules\n\n### “Install” module\n```\n    Size    7877\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 06:59:46 (GMT)\n\n```\nStarts by adjusting process privileges, then invokes the “Config” plugin's function\n\"LoadConfig\"\nIf there are no additional parameter from the C&C it continues to the main thread, otherwise\nit injects into a newly created process and continues from there.\n\nCreates mutex \"Global\\%16-48 random latin characters%\"\n\nThe module continues by invoking the modules “Plugins” and “Online”.\n\n### “Plugins” module\n```\n    Size    7119\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 06:59:07 (GMT)\n\n 6 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\nThis plugin provides API for other modules and does not initiate any actions without external\nintervention.\nStarts a registry monitoring thread waiting for changes in its registry key and loads any new\nplugins available in the registry Virtual File System (VFS).\nThe registry location is :\n\n**HKLM\\HKCU\\SOFTWARE\\Microsoft\\%5-12 random characters%**\n\nEvery value found in the key is decrypted and checked if it is a valid plugin and then loaded\nand initialized using the API from the \"Root” module.\n\nAlso, the plugin provides an API for reading, writing and deleting arbitrary registry values.\nThis also allows for the writing of new plugin images to the registry VFS by command from\nthe C&C server.\n\n### “Config” module\n```\n    Size    6574\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 06:59:16 (GMT)\n\n```\nThis module maintains a configuration block of data of a fixed size of 2136 bytes. The block\nconsists of a fixed size header and a string pool populated sequentially and referenced from\nthe fixed header. When invoked for the first time during the current session it initializes with a\ndefault configuration. The default C&C server URL may be overwritten with the one provided\nfrom the the packet used to activate the second stage shellcode, if present.\n\nThe configuration string pool starts from offset 0x58 and holds several string parameters.\nEach string is encrypted with a random 2-byte key using a proprietary algorithm based on\nXOR and an in-house rand() function. The encryption algorithm is the same for all string\nconstants used in all of the components of the malware.\n```\n    Offset Size  Value\n    -------------------------    000   2  Offset of the string constant \"HD\"\n    002   2  Offset of the string constant \"HD\"\n    010   2  Offset of the executable path used for injection\n    018   2  Offset of the C&C server URL\n    040   4  IP address \"8.8.8.8\"\n    044   4  IP address \"8.8.4.4\"\n    048   4  IP address \"4.2.2.1\"\n    04C   4  IP address \"4.2.2.2\"\n    050   4  Constant 0x708 - sleep interval, equal to 1800\n    seconds or 30 minutes\n    058   *  String pool:\n\n### 7 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\n```\n    \"HD\" String constant\n    \"HD\" String constant\n    *   C&C server URL, default value: \"dns://www.notped.com\", or the\n    one provided by the server to the \"Shellcode in NSSOCK2.DLL\" code.\n    \"%windir%\\system32\\svchost.exe\" Path to the executable used as a\n    host for injection\n\n```\nThe configuration block is prepended with a service header, compressed and encrypted\nusing a function provided by the \"Root\" plugin and then written to a file. The resulting size of\nthe file is 2156 bytes.\n\nService header format:\n```\n    Offset Size Value\n    ---------------------------------    000 4  00 00 00 00\n    004 4  12 34 56 78\n    008 4  00 00 00 00\n    00C 4  00 00 08 58 // Size of the configuration block in bytes\n    010 4  * // Unused\n\n```\nThe exact location of the configuration file depends on the system volume's serial number\nand is generated according to the following format:\n\n**_%ALLUSERSPROFILE%\\%random 3-8 latin characters%\\%random 3-8 latin_**\n**_characters%\\%random 3-8 latin characters%\\%random 3-8 latin characters%_**\n\nThe file is always overwritten every time the plugin is initialized.\n\n### “Online” module\n```\n    Size    15803\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 06:59:21 (GMT)\n\n```\nHandles overall communication with the C&C server and dispatches the commands to other\nplugins.\n\nMaintains a registry key : HKLM\\HKCU\\SOFTWARE\\%random 3-8 latin characters%\ncontaining a 24-byte record of system time and number of tries.\n\nProcesses the list of C&C URLs from the configuration block (up to 16 URLs). Depending on\nthe protocol specified in the URL it selects one of the plugins for handling communication\nwith the C&C server.\n```\n    Protocol Plugin ID\n    ------------------\n### 8 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\n```\n    TCP   200\n    HTTP  201\n    HTTPS  204\n    UDP   202\n    DNS   203\n    SSL   205\n    URL   built in, DGA-based HTTP client\n\n```\nIt maintains a connection using one of the plugins, starting the connection with an initial\npacket and getting and executing commands and sending result packets back. The data\nreceived back is either a shutdown message or a packet of data containing a plugin ID and\nadditional data for the command.\n\nIn case of the \"URL\" protocol, it uses a built-in HTTP client to resolve the actual C&C server\nURL from an intermediary C&C server. It uses its own DGA based on the day of the month,\nrange (1-10, 11-20, >20) to generate the name of the intermediary C&C server.\nThe actual name of the server is based on a mask specified in the configuration data, i.e.\nprefix%DGA-generated part%suffix, and the location of the suffix is marked with a '@' char.\n\nDepending on the URL scheme specified in the mask it selects FTP, HTTP or HTTPS\nprotocol to send the request to the intermediary server and either sends a \"GET\" request or\nfetches a file from FTP.\nOnce it has received a response the module looks for a string framed with '$' characters. The\nstring is then decoded into a binary buffer by subtracting 'a' characters and concatenating\neach pair into one byte. Then the buffer is decrypted using an algorithm that is used for string\nencryption in the rest of the code. The resulting decrypted buffer is expected to be the actual\nURL of the C&C to use then.\n\nThe module may also provide basic information about the system when requested by the\nC&C server:\n\n         - current date and time\n\n         - memory status\n\n         - CPU frequency\n\n         - amount of free disk space\n\n         - video mode\n\n         - system locale\n\n         - PID of the malicious process\n\n         - OS version\n\n         - domain name\n\n         - user name\n\n### “DNS” module\n```\n    Size    10982\n    Type    shellcode, binary reconstructed from a proprietary format \n    Timestamp 2017.05.26 06:58:11 (GMT)\n\n 9 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----\n\nHandles all C&C communication based on the DNS protocol.\n\nSends and receives DNS TXT records messages in the same way as the \"Shellcode in\nNSSOCK2\". However, the encoded payload is decrypted using a different in-house algorithm\nand the format of the response buffer is different:\n```\n    Offset Size Value\n    ------------------    000 2  Encryption key\n    -- after decryption -    002 2  Packet type(0,1,3)\n    004 2  packet id1 (of the server's response)\n    006 2  packet id2 (of the packet server is responding to, ACK)\n\n```\nInitial packet, type 0:\n```\n    Offset Size Value\n    ------------------    000 2  Encryption key\n    002 2  00 00\n    004 2  packet id 1\n    006 2  packet id 2\n    008 16 GUID\n\n```\nPacket type 1 - data:\n```\n    Offset Size Value\n    ------------------    000 2  Encryption key\n    002 2  00 01\n    004 2  packet id 1\n    006 2  packet id 2\n    008 *  payload\n\n```\nPacket type 3 - shutdown message:\n```\n    Offset Size Value\n    ------------------    000 2  Encryption key\n    002 2  00 03\n    004 2  packet id 1\n    006 2  packet id 2\n\n### 10 ShadowPad, part 2: Technical Details\n```\nAugust 2017\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2017/08/07172148/ShadowPad_technical_description_PDF.pdf"
    ],
    "report_names": [
        "ShadowPad_technical_description_PDF.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f5bf6853-3f6e-452c-a7b7-8f81c9a27476",
            "created_at": "2023-01-06T13:46:38.677391Z",
            "updated_at": "2025-03-27T02:00:02.889755Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "MISPGALAXY:Careto",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041395,
    "ts_creation_date": 1502825552,
    "ts_modification_date": 1502825552,
    "files": {
        "pdf": "https://archive.orkl.eu/b57a4e25e79fe50e72ebbec7480a56bbb3f25e9d.pdf",
        "text": "https://archive.orkl.eu/b57a4e25e79fe50e72ebbec7480a56bbb3f25e9d.txt",
        "img": "https://archive.orkl.eu/b57a4e25e79fe50e72ebbec7480a56bbb3f25e9d.jpg"
    }
}