{
    "id": "909fe691-389b-4678-8c57-95c9803d92c7",
    "created_at": "2022-10-25T16:48:16.755856Z",
    "updated_at": "2025-03-27T02:16:44.336617Z",
    "deleted_at": null,
    "sha1_hash": "836d38706da0649008cfec7363adb8afdd865e65",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-08-04T02:29:24Z",
    "file_modification_date": "2021-08-04T02:29:24Z",
    "file_size": 716293,
    "plain_text": "# APT31 new dropper. Target destinations: Mongolia, Russia, the U.S., and elsewhere\n\n**ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/apt31-new-attacks**\n\nPublished on 3 August 2021\n\n## Introduction\n\n[PT Expert Security Center (PT ESC) specialists regularly track the activity of hacker groups and the emergence of new information security threats (threat intelligence). During such monitoring in April 2021, a mailing list with](https://www.ptsecurity.com/ru-ru/services/esc/)\npreviously unknown malicious content was sent to Mongolia. Some of the files found during the study had rather interesting names (\"хавсралт.scr\" [\"havsralt.scr\"] (mong. attachment),\n\"Информация_Рб_июнь_2021_года_2021062826109.exe\") and, as the study showed, they contained a remote access trojan (RAT). Similar attacks were subsequently identified in Russia, Belarus, Canada, and the United\nStates. According to PT ESC threat intelligence analysts, from January to July 2021, approximately 10 attacks were carried out using the discovered malware samples. A detailed analysis of malware samples, data on the paths\non which working directories and registry keys were located, techniques and mechanisms used by the attackers (from the injection of malicious code to the logical blocks and structures used) helped correlate this malware with\nthe activity of the APT31 group.\n\nThis group, also known as Judgment Panda (CrowdStrike) and Zirconium (Microsoft), has been active since at least 2016. The group is presumed to be of Chinese origin, providing data to the Chinese government and stateowned enterprises to achieve political, economic, and military advantages. Cyberespionage is of key interest. The attackers' targets include the government sector, aerospace and defense enterprises, as well as international\n[financial companies and the high-tech sector. In different years, the group's victims have included the government of Finland and, it is presumed, the governments of Norway and Germany too. The group also attacked](https://therecord.media/finland-pins-parliament-hack-on-chinese-hacking-group-apt31/)\n[organizations and individuals close to U.S. presidential candidates during the 2020 campaign. Recent attacks on companies in France, involving the hacking of home and office routers, have also been linked with the group.](https://www.cert.ssi.gouv.fr/ioc/CERTFR-2021-IOC-003/)\n\nIn this article, we will study the malware created by the group, focus in more detail on the types of droppers discovered and the tricks used by its developers. We will also present the criteria on the basis of which the attacks\nwere attributed.\n\n## Analysis of malicious content\n\n### Dropper\n\nThe main objective of the dropper, the appearance of the main function of which is shown in Figure 1, is the creation of two files on the infected computer: a malicious library and an application vulnerable to DLL Sideloading\n(this application is then launched). Both files are always created over the same path: C:\\ProgramData\\Apacha. In the absence of this directory, it is created and the process is restarted.\n\n\n-----\n\nFigure 1. Overview of the dropper's basic function\n\nAt the second stage, the application launched by the dropper loads the malicious library and calls one of its functions. It is noteworthy that MSVCR100.dll was chosen as the name of the malicious library in all cases. A library\nwith an identical name is included in Visual C ++ for Microsoft Visual Studio. It is available on almost all PCs, but in a legitimate case it is located in the System32 folder (Figure 2). Moreover, the size of the malicious library is\nmuch smaller than the legitimate one.\n\nFigure 2. Parameters of the legitimate MSVCR100.dll\n\nIt is also worth noting the trick of the malware developers: by way of exports, the library contains names that can be found in the legitimate MSVCR100.dll. Without a doubt, this was done to make the malicious library as\nidentical to the original version as possible.\n\n\n-----\n\nFigure 3. Part of the exports of malicious MSVCR100.dll\n\nHowever, the number of exports in the malicious sample is much smaller, and most of them are ExitProcess calls.\n\nBelow is an example of a call to a malicious function from the created library. After the call, control is transferred to the malicious code. Note that the names of malicious functions were most often those used during the regular\nloading of applications.\n\nFigure 4. Calling a malicious function inside a legitimate application\n\nDuring the analysis of malware samples, PT ESC specialists detected different versions of droppers that contain the same set of functions. The main difference is the name of the directory in which the files contained in the\ndropper will be created However in all the instances studied the directories found in C:\\ProgramData\\ were used\n\n\n-----\n\nThe version of the dropper that downloads all files from the control server is worthy of particular note. Let's take a closer look. At the first stage, the presence of a working directory is also checked, after which connection is\nmade to the control server and the necessary data is downloaded from it.\n\nFigure 5. Checking for a directory\n\nCommunication with the server is not encrypted in any way, nor is the control server's address inside the malware. Downloaded files are written to the created working directory.\n\nFigure 6. Creating files in the working directory\n\nFigure 7 displays the code sections responsible for downloading all files from the server (the last reviewed case), while Figure 8 displays the code for loading the main library (first instance).\n\n\n-----\n\nFigure 7. Downloading files from C2\n\n\n-----\n\nFigure 8. Downloading a malicious library from C2\n\nExamining the open directories of control servers revealed unencrypted libraries (Figure 9).\n\n\n-----\n\nFigure 9. Encrypted and unencrypted libraries on the server\n\nIt is also worth noting that in some cases, particularly during attacks on Mongolia, the dropper was signed with a valid digital signature (Figure 10). PT ESC experts believe that this signature was most likely stolen.\n\nFigure 10. Valid digital signature of a dropper\n\n### Malicious library\n\nExecution commences with receipt of a list of launched processes. That said, this has no impact on anything and is not used anywhere. The library then checks for the presence of the file\nC:\\\\ProgramData\\\\Apacha\\\\ssvagent.dll. This is the encrypted main load downloaded from the server. If this file does not exist, then the address of the control server from which the download will be performed is decrypted.\n\nIn fact, this is a 5-byte XOR with a key built into the library. Inside the binary file, the key is stored in the form xmmword with the constant 9000000090000000900000009h (the fifth byte is added to the memory by the\nmalware itself using the direct address). In fact, encryption is performed with byte 0x9. After decrypting the C2 address, it connects to the control server and downloads the encrypted payload from it. Then the received data is\nsaved in the file C:\\\\ProgramData\\\\Apacha\\\\ssvagent.dll, and the legitimate application ssvagent.exe is restarted. The main part of the described functions is presented in Figure 11.\n\n\n-----\n\nFigure 11. Decrypting the C2 address, loading and launching a new instance of ssvagent.exe\n\nIf the payload has been loaded earlier, it is checked for an application that is already running. To do this, a mutex named ssvagent is created; if it has been created, the application ends.\n\nThe library then writes the legitimate ssvagent.exe to startup via the registry, as shown in Figure 12.\n\nFigure 12. Persistence via registry key\n\nAfter this, the file downloaded from the server is decrypted using a XOR operation with a 5-byte key. (The algorithm and key shown in Figure 10 differ from those used when decrypting the address of the control server.) Just as\nwhen decrypting the address of the control server, the key is stored in the form xmmword and is a constant: 1100000033000000060000000Eh. The fifth byte is identical in all cases; its value is 0x12.\n\n\n-----\n\nFigure 13. Decryption code of the main library\n\nAfter this, the decrypted data is placed in the application memory, and control is transferred to it.\n\n### Payload\n\nThe main library starts its execution by creating a package that will be sent to the server. Officially, the package is created from three parts:\n\n1. Main heading\n2. Hash\n3. Encrypted data\n\nThe main heading has the following structure:\n```\ntypedef struct _MAIN_HEADER\n\n{\n\nDWORD sizeOfPacket;//excluding the field itself\n\nDWORD const_1;\n\nDWORD const_2;\n\n} MAIN_HEADER, *PMAIN_HEADER;\n\n\n```\nThe values of const_1 and const_2 are identical and remain unchanged from package to package (unit value equalized to 4 bytes value).\n\nTo generate a hash, which is preceded by the main heading, the malware obtains the MAC address and PC name (the result of executing GetComputerNameExW). These values are concatenated (without using any separators),\nafter which an MD5 hash is taken from the resulting value, which is then converted into a string. An example of hash generation is presented in Figure 14.\n\nFigure 14. Example of hash generation\n\nThe third part of the package is then formed. The structure describing it is presented below:\n\n\n-----\n\n```\ntypedef struct _FIRST_PACKET\n\n{\n\nchar pcName[]; //result of GetComputerNameExW\n\nBYTE splitByte_0x09;\n\nchar userName[]; // result of GetUserNameW\nBYTE splitByte_0x09;\n\nchar hostIp[];\n\nBYTE splitByte_0x09;\n\nchar decrStr_1[2];\n\nBYTE splitByte_0x2E;\n\nchar decrStr_2[1];\n\nBYTE splitByte_0x2E;\n\nchar decrStr_3[5];\n\nBYTE splitByte_0x2E;\n\nchar decrStr_4[2];\n\nBYTE splitByte_0x2E;\n\nchar osVersion_inverted[2];\n\nBYTE splitByte_0x09;\n\nchar version[3];\n\nBYTE splitByte_0x09;\n\nchar macAddr[];\n\nBYTE splitByte_0x09;\n\n} _FIRST_PACKET, *_FIRST_PACKET;\n\n```\nEach field is separated from the other by a value of 0x09; some fields are separated by a value of 0x2E.\n\nFigure 15. An example of a generated package\n\nHeading fields decrStr_1 through decrStr_4 are not generated by the malware and are not collected on the infected computer. All values are encrypted inside the malware. Each value is decrypted separately and is added to the\nheading. The decrStr_4 field depends on the bitness of the operating system, which ultimately leads to different offsets of the encrypted data transferred to the decryption function (Figure 17) as an argument.\n\nThe format of a complete generated package is presented below. The main heading is highlighted in green; the hash, in red; the encrypted data, in yellow.\n\nFigure 16. Encrypted package with all headings\n\n\n-----\n\nFigure 17. Decrypting data from a specific position within a binary file\n\nThe generated package is encrypted with RC-4 with the key 0x16CCA81F, which is embedded in the encrypted data and sent to the server. After this, malware waits for commands from the server.\n\nLet's take a look at the list of commands that the malware implements:\n\n0x3: get information on mapped drives.\n0x4: perform file search.\n0x5: create a process, communication through the pipe.\n0xA: create a process via ShellExecute.\n0xC: create a new stream with a file download from the server.\n0x6, 0x7, 0x8, 0x9 (identical): search for a file or perform the necessary operation via SHFileOperationW (copy file, move file, rename file, delete file).\n0xB: create a directory.\n0xD: create a new stream, sending the file to the server.\n0x11: self-delete.\n\nIt is noteworthy that some of them duplicate each other's functions, and some are identical in terms of code implementation. This is most likely connected with the fact that the potential malware version is 1.0. This assumption\nis based on the value embedded in the code and contained in the network packages.\n\nThe code for processing the last command is particularly intriguing: all the created files and registry keys are deleted using a bat-file.\n\n\n-----\n\nFigure 18. Code for removing all components\n\n## Attribution\n\n[During their investigation, PT ESC specialists found a Secureworks report describing the APT31 DropboxAES RAT trojan. Analysis of the detected malware instances allows us to assert that the group is also behind the attack](https://www.secureworks.com/research/dropboxaes-remote-access-trojan)\nwe studied. Numerous overlaps were found in functionality, techniques and mechanisms used, starting with the injection of malicious code (up to the names of the libraries used) and ending with logical blocks and structures\nused inside the program code. The paths along which the malware working directories are located and the registry keys through which the persistence mechanism and their identity to the working directories are provided are\nalso identical. In addition, the command handlers executed by the malware proved to be extremely similar, while the self-delete mechanism is identical.\n\nThe main difference between this version of the malware and that reviewed by Secureworks lies in the communication of the main load with the control server. In the cases studied, there was a custom communication protocol\nthat Dropbox does not use to exchange data.\n\n## Network infrastructure\n\nThe detected malware samples, including the encrypted ones, revealed no overlaps between them in the network infrastructure. Nevertheless, in several cases, the payload accessed nodes other than those from which it was\ndownloaded.\n\n\n-----\n\nFigure 19. Identified servers\n\nIn one of the latest malware samples, an interesting domain inst.rsnet-devel[.]com was identified, which imitates the domain of federal government bodies and government bodies of constituent entities of the Russian\nFederation for a segment of the Internet. This might indicate an attack on government organizations in the Russian Federation.\n\n**Authors: Denis Kuvshinov, Daniil Koloskov, PT ESC**\n\n## Conclusion\n\nIn the study PT ESC specialists analyzed new versions of the malware used by APT31 in attacks from January to July this year. The revealed similarities with earlier versions of malicious samples described by researchers, such\nas in 2020, suggest that the group is expanding the geography of its interests to countries where its growing activity can be detected, Russia in particular. We believe that further instances will be revealed soon of this group\nbeing used in attacks, including against Russia, along with other tools that might be identified by code correspondence or network infrastructure.\n\n### IOCs\n\nFile MD5 SHA-1 SHA-256\n\n\n-----\n\n**Dropper**\n\njconsole.exe 3f5ea95a5076b473cf8218170e820784 765bd2fd32318a4cb9e4658194fe0fb5d94568e0 33f136069d7c3a030b2e0738a5ee80d442dee1a202f6937121fa4e92a775fead\n\n - db1673a1e8316287cb940725bb6caa68 6a358afdd2c59f0bbfc7b1982ae6b0a782399923 2affdebbaa4f0cfa64e5c42e70d78665ef9ccb2c731c5fe07582ccdfdc05b0cc\n\n - 2798b66475cf0794e9b868d656defca7 0c3e0a5553cc29049fd8c5fc3a1af3ae6c0c298e 002dc9f6823ad8d3de23bcb5e41bcefd895df573ed3d89e0821243aa9b7bb4a8\n\n - 626270d5bf16eb2c4dda2d9f6e0c4ef9 f585917fdb89b9dc849621676376b0b1e6b348fa 2b495829b8b3319f98e22f35d7bd48c4dea1b9bafe80749d628da99fede6d694\n\nnews.exe 56450799fe4e44d7c5aff84d173760e8 10037b4533df13983a75d74dcea32dc73665700c 679955ff2a97ea11a181ae60c775eff78fadd767bc641ca0d1cff86a26df8ac8\n\n - d919fed03ec53654be59e15525c1448f 9db9fe7b04bc5b2fc10f78da3891eb30c19a48b6 efdbb19fb65bcf5c4a8feb3eab784682d01f3e75f711674e4d469d4dfe4a21f3\n\nхавсралт.scr d22670ab9b13de79e442100f56985032 6e7540fa001fc992d2050b97ea17686d34863740 78cc364e761701455bdc4bce100c2836566e662b87b5c28251c178eba2e9ce7e\n\npresident_email.exe 8e744f7b07484afcf87c454c6292e944 da845d8219d3315c02f84c27094965d02cdaa76c 5d0872d07c6837dbc3bfa85fd8f79da3d83d7bb7504a6de7305833090b214f2c\n\nИнформация_Рб_июнь_2021_года_2021062826109.exe 49bca397674f67e4c069068b596cab3e d13d6d683855f5a547b96b6e2365c6f49a899d62 874b946b674715c580e7b379e9597e48c85c04cca3a2790d943f56600b575d2f\n\n**Malicious library**\n\nMSVCR100.dll 8cefaa146178f5c3a297a7895cd3d1fc 81779c94dbe2887ff1ff0fd4c15ee0c373bd0b40 c15a475f8324fdfcd959ffc40bcbee655cbdc5ab9cbda0caf59d63700989766f\n\nMSVCR100.dll 326024bc9222ebec281ec53ca5598cc1 5c25b93ebcedafcff0c85bcde2a0857ca72dc73e 0229404a146bb43ebc6d25d2145b493e950b2f92483be1b964f4f1c90ec6cf70\n\nMSVCR100.dll 6f3047277719e2351ce14a54a39f7b15 7de335e005b0766268df918e7e3b64f4b3521c1e 640128a35efc0ad83fe5b1461090f1b869c7a6ed0a8a661be403359d48a78085\n\n### Network indicators\n\ngitcloudcache[.]com\n\nedgecloudc[.]com\n\napi[.]hostupoeui[.]com\n\napi[.]flushcdn[.]com\n\nconst[.]be-government[.]com\n\ndrmtake[.]tk\n\ninst[.]rsnet-devel[.]com\n\n20[.]11[.]11[.]67\n\n### Network signature\n\nAs a result of researching the format of the complete generated packet, Positive Technologies experts managed to develop rules for detecting this threat in network traffic. You can download the free redistributable rules from\n[our repository at https://github.com/ptresearch/AttackDetection/tree/master/APT31](https://github.com/ptresearch/AttackDetection/tree/master/APT31)\n\n### MITRE\n\n**ID** **Name** **Description**\n\n\n-----\n\n**Resource Development**\n\nT1587.001 Malware APT31 develops malware and malware components that can be used during targeting\n\nT1587.002 Develop Capabilities: Code Signing Certificates APT31 uses code signing to sign their malware and tools\n\n**Initial Access**\n\nT1566 Phishing APT31 sends phishing messages to gain access to victim systems\n\n**Execution**\n\nT1204.002 User Execution: Malicious File APT31 relies upon a user open a malicious file to get it executed\n\nT1059.003 Command and Scripting Interpreter: Windows Command Shell APT31 uses the Windows command shell for command execution\n\nT1106 Native API APT31 directly interacts with the native OS application programming interface (API) to execute behaviors\n\n**Persistence**\n\nT1547.001 Boot or Logon Autostart Execution: Registry Run Keys / Startup Folder APT31 achieves persistence by adding a program to a Registry run key\n\nT1574 Hijack Execution Flow: DLL Search Order Hijacking APT31 executes their own malicious payloads by hijacking the way operating systems run programs\n\n**Defense Evasion**\n\nT1036 Masquerading APT31 manipulates features of their artifacts to make them appear legitimate to users\n\nT1140 Deobfuscate/Decode Files or Information APT31 uses mechanisms to decode or deobfuscate information\n\nT1027 Obfuscated Files or Information APT31 uses encryption to make it difficult to detect or analyze an executable file\n\nT1112 Modify Registry APT31 APT31 team uses the Windows registry for persistence\n\n**Discovery**\n\nT1082 System Information Discovery APT31 obtains detailed information about the operating system\n\n**Collection**\n\nT1005 Data from Local System APT31 uses backdoor functionality to exfiltrate any file on the infected machine\n\n**Command and Control**\n\nT1001 Data Obfuscation APT31 obfuscates command and control traffic to make it more difficult to detect\n\nT1521 Standard Cryptographic Protocol APT31 uses data hiding in C&C with RC4\n\nT1043 Commonly Used Port APT31 uses ports 80 and 443 for communication\n\nT1071.001 Application Layer Protocol: Web Protocols APT31 uses HTTP and HTTPS protocols to communicate with control servers\n\n**Exfiltration**\n\n\n-----\n\nT1020 Automated Exfiltration APT31 uses automatic exfiltration of stolen files\n\nT1041 Exfiltration Over C2 Channel APT31 uses C&C channel to exfiltrate data\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.08.03.APT31_new_dropper/APT31%20new%20dropper.%20Target%20destinations_%20Mongolia%2C%20Russia%2C%20the%20U.S.%2C%20and%20elsewhere.pdf"
    ],
    "report_names": [
        "APT31 new dropper. Target destinations_ Mongolia, Russia, the U.S., and elsewhere"
    ],
    "threat_actors": [
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1628044164,
    "ts_modification_date": 1628044164,
    "files": {
        "pdf": "https://archive.orkl.eu/836d38706da0649008cfec7363adb8afdd865e65.pdf",
        "text": "https://archive.orkl.eu/836d38706da0649008cfec7363adb8afdd865e65.txt",
        "img": "https://archive.orkl.eu/836d38706da0649008cfec7363adb8afdd865e65.jpg"
    }
}