{
    "id": "90d2a94f-844a-41a5-9ea3-35e251f590fb",
    "created_at": "2023-01-12T15:10:07.178333Z",
    "updated_at": "2025-03-27T02:09:30.318616Z",
    "deleted_at": null,
    "sha1_hash": "f006928520cff8822f7834bc9917e7370d61bec2",
    "title": "2022-09-21 - Rewards plus- Fake mobile banking rewards apps lure users to install info-stealing RAT on Android devices",
    "authors": "",
    "file_creation_date": "2022-10-02T12:22:29Z",
    "file_modification_date": "2022-10-02T12:22:29Z",
    "file_size": 2509221,
    "plain_text": "# Rewards plus: Fake mobile banking rewards apps lure users to install info-stealing RAT on Android devices\n\n**microsoft.com/security/blog/2022/09/21/rewards-plus-fake-mobile-banking-rewards-apps-lure-users-to-install-info-stealing-rat-on-android-**\ndevices/\n\nSeptember 21, 2022\n\nOur analysis of a recent version of a previously reported info-stealing Android malware, delivered through an\nongoing SMS campaign, demonstrates the continuous evolution of mobile threats. Masquerading as a\nbanking rewards app, this new version has additional remote access trojan (RAT) capabilities, is more\nobfuscated, and is currently being used to target customers of Indian banks. The SMS campaign sends out\nmessages containing a link that points to the info-stealing Android malware. The malware’s RAT capabilities\nallow the attacker to intercept important device notifications such as incoming messages, an apparent effort\nto catch two-factor authentication (2FA) messages often used by banking and financial institutions. The\nmalware’s ability to steal all SMS messages is also concerning since the data stolen can be used to further\nsteal users’ sensitive info like 2FA messages for email accounts and other personally identifiable information\n(PII).\n\n\n-----\n\n_Figure 1. Typical SMS campaign attack flow_\nOur investigation of this new Android malware version started from our receipt of an SMS message\ncontaining a malicious link that led us to the download of a fake banking rewards app. The fake app,\ndetected as TrojanSpy:AndroidOS/Banker.O, used a different bank name and logo compared to a similar\n[malware reported in 2021. Moreover, we found that this fake app’s command and control (C2) server is](https://blog.cyble.com/2021/12/27/spyware-targeting-customers-of-top-indian-banks/)\nrelated to 75 other malicious APKs based on open-source intelligence. Some of the malicious APKs also use\nthe same Indian bank’s logo as the fake app that we investigated, which could indicate that the actors are\ncontinuously generating new versions to keep the campaign going.\n\nThis blog details our analysis of the recent version’s capabilities. We strongly advise users never to click on\nunknown links received in SMS messages, emails, or messaging apps. We also recommend seeking your\nbank’s support or advice on digital options for your bank. Further, ensure that your banking apps are\ndownloaded from official app stores to avoid installing malware.\n\n## Observed activity\n\n### What the user sees\n\nWe have seen other campaigns targeting Indian banks’ customers based on the following app names:\n\nAxisbank_rewards.apk\nIcici_points.apk\nIcici_rewards.apk\nSBI_rewards.apk\n\nOur investigation focused on icici_rewards.apk (package name: com.example.test_app), which presents\nitself as ICICI Rewards. The SMS campaign sends out messages containing a malicious link that leads to\ninstalling a malicious APK on a target’s mobile device. To lure users into accessing the link, the SMS claims\nthat the user is being notified to claim a reward from a known Indian bank.\n\n\n-----\n\n_Figure 2. The text message with a malicious_\n\n_link sent to users_\nUpon user interaction, it displays a splash screen with the bank logo and proceeds to ask the user to enable\nspecific permissions for the app.\n\n\n-----\n\n_Figures 3 and 4. App installed on the Android device. The app asks users to enable permissions on text_\n_messaging and contacts, to name a few_\nThe fake app asks for credit card information upon being granted all permissions. This should raise users’\nsuspicions on the app’s motive as apps typically ask for sensitive information only through user-driven\ntransactions like paying for purchases.\n\nThe app displays another fake screen with further instructions to add to its legitimacy once users supply the\ninformation needed.\n\n\n-----\n\n_Figures 5 and 6. A fake page where the app asks users to provide information, and the resulting message_\n_once data is added_\n\n### What happens in the background\n\nAnalyzing the XML file AndroidManifest further identifies the entry points of the malware along with the\npermissions requested. It also defines services that can run in the background without user interaction. The\napp uses the following permissions:\n\n_READ_PHONE_STATE_\n_ACCESS_NETWORK_STATE_\n_READ_SMS_\n_RECEIVE_SMS_\n_READ_CALL_LOG_\n_FOREGROUND_SERVICE_\n_MODIFY_AUDIO_SETTINGS_\n_READ_CONTACTS_\n_RECEIVE_BOOT_COMPLETED_\n_WAKE_LOCK_\n\n\n-----\n\nThe malware uses MainActivity, AutoStartService, and RestartBroadCastReceiverAndroid functions to carry\nout most of its routines. These three functions interact to ensure all the malware’s routines are up and\nrunning and allow the app to remain persistent on the mobile device.\n\n**MainActivity**\n\n_MainActivity, also called the launcher activity, is defined under com.example.test_app.MainActivity. It is_\nlaunched first after installation to display the fake app’s ICICI splash screen. This launcher activity then calls\n_OnCreate() method to check the device’s internet connectivity and record the timestamp of the malware’s_\ninstallation, and Permission_Activity to launch permission requests. Once the permissions are granted,\n_Permission_Activity further calls AutoStartService and login_kotak._\n\n_Figure 7. Actions under MainActivity_\nThe class login_kotak is responsible for stealing the user’s card information. It shows the fake credit card\ninput page (Figure 5) and temporarily stores the information in the device while waiting for commands from\nthe attacker.\n\n\n-----\n\n_Figure 8. login_kotak class steals card information and other personally identifiable information (PII)_\n\n**AutoStartService**\n\n_AutoStartService, themain handler of the malware, functions based on the commands it receives. The_\nhandler provides the malware with the following capabilities:\n\n**Enforcing its RAT commands**\n\nThis malware’s new version adds several RAT capabilities that expands its information stealing. It enables\nthe malware to add call log uploading, SMS message and calls interception, and card blocking checks.\n\n\n-----\n\n_Figure 9. Code comparison of 2021 (left) and 2022 (right) samples_\nThese commands are described below.\n\nCommand Name Description\n\nall_sms_received Flags to enable/disable SMS upload\n\nall_call_received Flags to enable/disable call log upload\n\nsilent Put the mobile device on silent\n\nblock Checks if the user’s card is blocked\n\nsms_filter Filters SMS based on strings (defaults to “ICICI”)\n\nonline Checks if the user has an active internet connection\n\n\n-----\n\nforce_online Uploads received SMS messages to the C2 server\n\nis_online Checks if the device is connected to the C2 server\n\nforce_calls Uploads call logs to the C2 server\n\nThe silent command, which the malware uses to keep the remote attacker’s SMS sending activities\nundetected, stands out from the list of commands. Many banking apps require two-factor authentication\n(2FA), often sent through SMS messages. This malware enabling an infected device’s silent mode allows\nattackers to catch 2FA messages undetected, further facilitating information theft.\n\n_Figure 10. This code is responsible_\n\n_for turning the mobile device’s silent mode on_\n\n**Encryption and decryption of SMS messages**\n\nIn addition to encrypting all data it sends to the attacker, the malware also encrypts the SMS commands it\nreceives from the attacker. The malware decrypts the commands through its decryption and decoding\nmodules. The malware uses a combination of Base64 encoding/decoding and AES encryption/decryption\nmethods.\n\n\n-----\n\n_Figure 11. The_\n\n_malware’s encoding and decoding modules, as seen in its code_\n\n**Stealing SMS messages**\n\nThe malware steals all SMS messages from the mobile device’s inbox. It collects all received, sent, read,\nand even unread messages. Collecting all SMS messages might allow attackers to use the data to expand\ntheir stealing range, especially if any messages contain other sensitive information such as SMS-based 2FA\nfor email accounts, one’s personal identification like the Aadhar card commonly used in India, or other\nfinancial-related information.\n\n_Figure 12._\n\n_Code used to steal all SMS messages_\n\n**Uploading all call logs**\n\nThe malware also uploads call logs stored on the mobile device. This data may be used for the attacker’s\nsurveillance purposes.\n\n\n-----\n\n_Figure 13. The malware code for stealing call logs_\n\n**Communicating with its C2**\n\n[This malware uses the open-source library socket.io to communicate with its C2 server.](https://socket.io/)\n\n_Figure 14. Code showing the_\n\n_malware’s C2 server connection_\n\n### RestartBroadCastReceiver\n\nThe malware also uses the Android component RestartBroadcastReceiver, which functions based on the\ntype of events received by the mobile device. This receiver launches a job scheduler named JobService,\nwhich eventually calls AutoStartService in the background. The receiver reacts when the device is restarted,\nif the device is connected to or disconnected from charging, when the device’s battery status changes, and\nchanges in the device’s Wi-Fi state. _RestartBroadcastReceiver ensures that the main command handler_\n_AutoStartService is always up and running._\n\n\n-----\n\n_Figure 15. How the Receiver starts AutoStartService_\n\n## Mitigating the fake app’s unwanted extras\n\nThis malware’s continuing evolution highlights the need to protect mobile devices. Its wider SMS stealing\ncapabilities might allow attackers to the stolen data to further steal from a user’s other banking apps. Its\nability to intercept one-time passwords (OTPs) sent over SMS thwarts the protections provided by banks’\ntwo-factor authentication mechanisms, which users and institutions rely on to keep their transactions safe. Its\nuse of various banking and financial organizations’ logos could also attract more targets in the future.\n\nApp installation on Android is relatively easy due to the operating system’s open nature. However, this\nopenness is often abused by attackers for their gain. Apart from exercising utmost care when clicking on\nlinks in messages and installing apps, we recommend that users follow these steps to protect their devices\nfrom fake apps and malware:\n\nDownload and install applications only from official app stores.\nAndroid device users can keep the Unknown sources option disabled to stop app installation from\nunknown sources.\n[Use mobile solutions such as Microsoft Defender for Endpoint on Android to detect malicious](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/microsoft-defender-endpoint-android)\napplications.\n\n## Appendix\n\n### Indicators of compromise\n\n**Indicator** **Type** **Description**\n\n\n734048bfa55f48a05326dc01295617d932954c02527b8cb0c446234e1a2ac0f7 SHA256\n\n\nda4e28acdadfa2924ae0001d9cfbec8c8cc8fd2480236b0da6e9bc7509c921bd\n\n\nSHA256\n\n\nicici_rewards.apk\n\nicici_rewards.apk\n\n\n-----\n\n65d5dea69a514bfc17cba435eccfc3028ff64923fbc825ff8411ed69b9137070 SHA256\n\n\n3efd7a760a17366693a987548e799b29a3a4bdd42bfc8aa0ff45ac560a67e963\n\n\nSHA256\n\n\nicici_rewards.apk\n\nicici_rewards.apk\n(first reported by\n[MalwareHunterTeam)](https://twitter.com/malwrhunterteam/status/1517787583648268288)\n\n\nhxxps://server4554ic[.]herokuapp[.]com/ URL C2 server\n\n### MITRE ATT&CK techniques\n\n\n**Execution** **Persistence** **Defense**\n**Evasion**\n\n\n**Collection** **Command**\n**& Control**\n\n\nT1417\nInput\ncapture\n\nT1636\n[Protected](http://attack.mitre.org/techniques/T1636)\nUser Data\n\n\n**Exfiltration** **Impact**\n\n\nT1603\n[Scheduled](http://attack.mitre.org/techniques/T1603)\n\nTask/Job\n\n\nT1624\nEvent\nTriggered\nExecution\n\nT1603\nScheduled\nTask/Job\n\n\nT1406\n[Obfuscated](http://attack.mitre.org/techniques/T1406)\nfiles/information\n\n\n**Credential**\n**Access**\n\nT1417\n[Input](http://attack.mitre.org/techniques/T1417)\ncapture\n\n\nT1437\nApplication\nLayer\nProtocol\n\nT1521\n[Encrypted](http://attack.mitre.org/techniques/T1521)\nChannel\n\n\nT1646\nExfiltration\nOver C2\nChannel\n\n\nT1582\n[SMS](http://attack.mitre.org/techniques/T1582)\nControl\n\n\n**_Shivang Desai, Abhishek Pustakala, and Harshita Tripathi_**\n\n_Microsoft 365 Defender Research Team_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-21 - Rewards plus- Fake mobile banking rewards apps lure users to install info-stealing RAT on Android devices.pdf"
    ],
    "report_names": [
        "2022-09-21 - Rewards plus- Fake mobile banking rewards apps lure users to install info-stealing RAT on Android devices.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536207,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1664713349,
    "ts_modification_date": 1664713349,
    "files": {
        "pdf": "https://archive.orkl.eu/f006928520cff8822f7834bc9917e7370d61bec2.pdf",
        "text": "https://archive.orkl.eu/f006928520cff8822f7834bc9917e7370d61bec2.txt",
        "img": "https://archive.orkl.eu/f006928520cff8822f7834bc9917e7370d61bec2.jpg"
    }
}