{
    "id": "912ff15d-81b4-4e46-814a-3e1396a31731",
    "created_at": "2023-04-05T02:09:50.451213Z",
    "updated_at": "2025-03-27T02:16:47.15793Z",
    "deleted_at": null,
    "sha1_hash": "6654a5811b00cac10749dd6881f73239881d4674",
    "title": "2023-03-02 - MQsTTang- Mustang Panda’s latest backdoor treads new ground with Qt and MQTT",
    "authors": "",
    "file_creation_date": "2023-04-03T08:25:05Z",
    "file_modification_date": "2023-04-03T08:25:05Z",
    "file_size": 547828,
    "plain_text": "# MQsTTang: Mustang Panda’s latest backdoor treads new ground with Qt and MQTT\n\n**[welivesecurity.com/2023/03/02/mqsttang-mustang-panda-latest-backdoor-treads-new-ground-qt-mqtt/](https://www.welivesecurity.com/2023/03/02/mqsttang-mustang-panda-latest-backdoor-treads-new-ground-qt-mqtt/)**\n\nMarch 2, 2023\n\nESET researchers tease apart MQsTTang, a new backdoor used by Mustang Panda, which communicates via the MQTT\nprotocol\n\n[Alexandre Côté Cyr](https://www.welivesecurity.com/author/acotecyr/)\n2 Mar 2023 - 11:30AM\n\nESET researchers tease apart MQsTTang, a new backdoor used by Mustang Panda, which communicates via the MQTT\nprotocol\n\nESET researchers have analyzed MQsTTang, a new custom backdoor that we attribute to the Mustang Panda APT group.\nThis backdoor is part of an ongoing campaign that we can trace back to early January 2023. Unlike most of the group’s\nmalware, MQsTTang doesn’t seem to be based on existing families or publicly available projects.\n\n[Mustang Panda is known for its customized Korplug variants (also dubbed PlugX) and elaborate loading chains. In a](https://www.welivesecurity.com/2022/03/23/mustang-panda-hodur-old-tricks-new-korplug-variant/)\ndeparture from the group’s usual tactics, MQsTTang has only a single stage and doesn’t use any obfuscation techniques.\n\n## Victimology\n\nWe have seen unknown entities in Bulgaria and Australia in our telemetry. We also have information indicating that this\ncampaign is targeting a governmental institution in Taiwan. However, due to the nature of the decoy filenames used, we\nbelieve that political and governmental organizations in Europe and Asia are also being targeted. This would also be in line\n[with the targeting of the group’s other recent campaigns. As documented by fellow researchers at Proofpoint, Mustang](https://www.proofpoint.com/us/blog/threat-insight/good-bad-and-web-bug-ta416-increases-operational-tempo-against-european)\nPanda has been known to target European governmental entities since at least 2020 and has increased its activity in Europe\neven further, since Russia’s invasion of Ukraine. Figure 1 shows our view of the targeting for this campaign.\n\n\n-----\n\n_Figure 1. Map showing known and suspected targets of MQsTTang_\n\n## Attribution\n\nWe attribute this new backdoor and the campaign to Mustang Panda with high confidence based on the following indicators.\n\nWe found archives containing samples of MQsTTang in two GitHub repositories belonging to the user YanNaingOo0072022.\nAnother GitHub repository of the same user was used in a previous Mustang Panda campaign described by Avast in a\n[December 2022 blogpost.](https://decoded.avast.io/threatintel/apt-treasure-trove-avast-suspects-chinese-apt-group-mustang-panda-is-collecting-data-from-burmese-government-agencies-and-opposition-groups/)\n\nOne of the servers used in the current campaign was running a publicly accessible anonymous FTP server that seems to be\nused to stage tools and payloads. In the /pub/god directory of this server there are multiple Korplug loaders, archives, and\ntools that were used in previous Mustang Panda campaigns. This is the same directory that was used by the stager\ndescribed in the aforementioned Avast blogpost. This server also had a /pub/gd directory, which was another path used in\nthat campaign.\n\nSome of the infrastructure used in this campaign also matches the network fingerprint of previously known Mustang Panda\nservers.\n\n## Technical analysis\n\nMQsTTang is a barebones backdoor that allows the attacker to execute arbitrary commands on a victim’s machine and get\n[the output. Even so, it does present some interesting characteristics. Chief among these is its use of the MQTT protocol for](https://mqtt.org/)\nC&C communication. MQTT is typically used for communication between IoT devices and controllers, and the protocol hasn’t\nbeen used in many publicly documented malware families. One such example is Chrysaor, also known as Pegasus for\nAndroid. From an attacker’s perspective, one of MQTT’s benefits is that it hides the rest of their infrastructure behind a\nbroker. Thus, the compromised machine never communicates directly with the C&C server. As seen in Figure 2, this\n\n\n-----\n\n[capability is achieved by using the open source QMQTT library. This library depends on the Qt framework, a large part of](https://github.com/emqx/qmqtt)\nwhich is statically linked in the malware. Using the Qt framework for malware development is also fairly uncommon.\n[Lazarus’s MagicRAT is one of the rare recently documented examples.](https://blog.talosintelligence.com/lazarus-magicrat/)\n\n_Figure 2. RTTI showing classes from the QMQTT library_\n\nMQsTTang is distributed in RAR archives which only contain a single executable. These executables usually have names\nrelated to Diplomacy and passports such as:\n\nCVs Amb Officer PASSPORT Ministry Of Foreign Affairs.exe\nDocuments members of delegation diplomatic from Germany.Exe\nPDF_Passport and CVs of diplomatic members from Tokyo of JAPAN.eXE\nNote No.18-NG-23 from Embassy of Japan.exe\n\nThese archives are hosted on a web server with no associated domain name. This fact, along with the filenames, leads us to\nbelieve that the malware is spread via spearphishing.\n\nSo far, we have only observed a few samples. Besides variations in some constants and hardcoded strings, the samples are\nremarkably similar. The only notable change is the addition of some anti-analysis techniques in the latest versions. The first\nof these consists of using the CreateToolhelp32Snapshot Windows API function to iterate through running processes and\nlook for the following known debuggers and monitoring tools.\n\ncheatengine-x86_64.exe\nollydbg.exe\nida.exe\nida64.exe\nradare2.exe\nx64dbg.exe\nprocmon.exe\nprocmon64.exe\nprocexp.exe\nprocesshacker.exe\npestudio.exe\nsystracerx32.exe\nfiddler.exe\n\n\n-----\n\ntcpview.exe\n\nNote that, while the malware is a 32-bit executable, it only checks for the presence of x64dbg and not its 32-bit counterpart,\nx32dbg.\n\nThe second technique uses the FindWindowW Windows API to look for the following Window Classes and Titles used by\nknown analysis tools:\n\nPROCMON_WINDOW_CLASS\nOLLYDBG\nWinDbgFrameClass\nOllyDbg – [CPU]\nImmunity Debugger – [CPU]\n\nWhen executed directly, the malware will launch a copy of itself with 1 as a command line argument. This is repeated by the\nnew process, with the argument being incremented by 1 on every run. When this argument hits specific values, certain tasks\nwill be executed. Note that the exact values vary between samples; the ones mentioned below correspond to the sample\nwith SHA-1 02D95E0C369B08248BFFAAC8607BBA119D83B95B. However, the tasks themselves and the order in which\nthey are executed is constant.\n\nFigure 3 shows an overview of this behavior along with the tasks that are executed when the malware is first run.\n\n_Figure 3. Execution graph showing the subprocesses and executed tasks_\n\nTable 1 contains a list of the tasks and the value at which each of them is executed. We will describe them in further detail in\nthe upcoming paragraphs.\n\n_Table 1. Tasks executed by the backdoor_\n\n**Task number** **Argument value** **Task description**\n\n1 **5** Start C&C communication.\n\n2 **9** Create copy and launch.\n\n3 **32** Create persistence copy.\n\n4 **119** Establish persistence.\n\n\n-----\n\n**Task number** **Argument value** **Task description**\n\n5 **148** Stop recursive execution.\n\nIf any analysis tool or debugger is detected using the techniques we described previously, the behavior of task 1 is altered\nand tasks 2, 3, and 4 are skipped entirely.\n\n### Task 1: C&C communication\n\nAs was previously mentioned, MQsTTang communicates with its C&C server over the MQTT protocol. All observed samples\nuse 3.228.54.173 as broker. This server is a public broker operated by EMQX, who also happen to be the maintainers of the\nQMQTT library. This could be a way to make the network traffic seem legitimate and to hide Mustang Panda’s own\ninfrastructure. Using this public broker also provides resiliency; the service is unlikely to be taken down because of its many\nlegitimate users and, even if the current C&C servers are banned or taken down, Mustang Panda could spin up new ones\nand use the same MQTT topics without disrupting MQsTTang’s operation.\n\nHowever, this campaign could also be a test case by Mustang Panda before deciding whether to invest the time and\nresources to set up their own broker. This is supported by the low number of samples we’ve observed and the very simple\nnature of MQsTTang.\n\nAs shown in Figure 4, the malware and C&C server use two MQTT topics for their communication. The first one, iot/server2,\nis used for communication from the client to the server. The second one is used for communication from the server to the\nclient. It follows the format iot/v2/<Unique ID> where <Unique ID> is generated by taking the last 8 bytes, in hex form, of a\nUUID. If any analysis tool is detected, server2 and v2 are respectively replaced with server0 and v0. This is likely in order to\navoid tipping off defenders by entirely aborting the malware’s execution early.\n\n_Figure 4. Simplified network graph of the communication between the backdoor and C&C server_\n\nAll communication between the server and the client uses the same encoding scheme. The MQTT message’s payload is a\nJSON object with a single attribute named msg. To generate the value of this attribute, the actual content is first base64\nencoded, then XORed with the hardcoded string nasa, and base64 encoded again. We will describe the exact format of\nthese payloads in the relevant sections.\n\n\n-----\n\nUpon first connecting to the broker, the malware subscribes to its unique topic. Then, and every 30 seconds thereafter, the\nclient publishes a KeepAlive message to the server’s topic. The content of this message is a JSON object with the following\nformat:\n\n\n1\n\n2\n\n3\n\n4\n\n\n{\n\n\"Alive\": \"<malware’s uptime in minutes>\",\n\n\"c_topic\": \"<client’s unique topic>\"\n\n}\n\n\nWhen the server wants to issue a command, it publishes a message to the client’s unique topic. The plaintext content of this\nmessage is simply the command to be executed. As shown in Figure 5, the client executes the received command using\nQProcess::startCommand from the Qt framework. The output, obtained using QProcess::readAllStandardOutput, is then sent\nback in a JSON object with the following format:\n\n\n1\n\n2\n\n3\n\n4\n\n\n{\n\n\"c_topic\": \"<client’s unique topic>\",\n\n\"ret\": \"<Command output>\"\n\n}\n\n_Figure 5. Execution of received commands using the QProcess class_\n\n\nSince only the content of standard output is sent back, the server will not receive errors or warnings. From the server’s point\nof view, a failed command is thus indistinguishable from a command that simply produces no output unless some sort of\nredirection is performed.\n\n### Tasks 2 and 3: Copying the malware\n\nThe second and third tasks are fairly similar to each other. They copy the malware’s executable to a hardcoded path;\nc:\\users\\public\\vdump.exe and c:\\users\\public\\vcall.exe respectively. The filenames used are different for each sample, but\nthey are always located in the C:\\users\\public directory.\n\nIn the second task, the newly created copy is then launched with the command line argument 97.\n\n### Task 4: Establishing persistence\n\nPersistence is established by the fourth task, which creates a new value qvlc set to c:\\users\\public\\vcall.exe under the\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run registry key. This will cause the malware to be executed on startup.\n\nWhen MQsTTang is executed on startup as c:\\users\\public\\vcall.exe, only the C&C communication task is executed.\n\n## Conclusion\n\nThe Mustang Panda campaign described in this article is ongoing as of this writing. The victimology is unclear, but the decoy\nfilenames are in line with the group’s other campaigns that target European political entities.\n\nThis new MQsTTang backdoor provides a kind of remote shell without any of the bells and whistles associated with the\ngroup’s other malware families. However, it shows that Mustang Panda is exploring new technology stacks for its tools. It\nremains to be seen whether this backdoor will become a recurring part of the group’s arsenal, but it is one more example of\nthe group’s fast development and deployment cycle.\n\n\n-----\n\n_ESET Research offers private APT intelligence reports and data feeds. For any inquiries about this service, visit the ESET_\n_Threat Intelligence page._\n\n## IoCs\n\n### Files\n\n**SHA-1** **Filename** **Detection** **Description**\n\nA1C660D31518C8AFAA6973714DE30F3D576B68FC CVs Amb.rar Win32/Agent.AFBI RAR archive used to\ndistribute MQsTTang\nbackdoor.\n\n\n430C2EF474C7710345B410F49DF853BDEAFBDD78 CVs Amb Officer\nPASSPORT Ministry\nOf Foreign\nAffairs.exe\n\n\nWin32/Agent.AFBI MQsTTang\nbackdoor.\n\n\nF1A8BF83A410B99EF0E7FDF7BA02B543B9F0E66C Documents.rar Win32/Agent.AFBI RAR archive used to\ndistribute MQsTTang\nbackdoor.\n\n\n02D95E0C369B08248BFFAAC8607BBA119D83B95B PDF_Passport and\nCVs of diplomatic\nmembers from\nTokyo of JAPAN.eXE\n\n0EA5D10399524C189A197A847B8108AA8070F1B1 Documents\nmembers of\ndelegation\ndiplomatic from\nGermany.Exe\n\n\nWin32/Agent.AFBI MQsTTang\nbackdoor.\n\nWin32/Agent.AFBI MQsTTang\nbackdoor.\n\n\n982CCAF1CB84F6E44E9296C7A1DDE2CE6A09D7BB Documents.rar Win32/Agent.AFBI RAR archive used to\ndistribute MQsTTang\nbackdoor.\n\n\n740C8492DDA786E2231A46BFC422A2720DB0279A 23 from Embassy of\nJapan.exe\n\n\nWin32/Agent.AFBI MQsTTang\nbackdoor.\n\n\nAB01E099872A094DC779890171A11764DE8B4360 BoomerangLib.dll Win32/Korplug.TH Known Mustang\nPanda Korplug\nloader.\n\n61A2D34625706F17221C1110D36A435438BC0665 breakpad.dll Win32/Korplug.UB Known Mustang\nPanda Korplug\nloader.\n\n30277F3284BCEEF0ADC5E9D45B66897FA8828BFD coreclr.dll Win32/Agent.ADMW Known Mustang\nPanda Korplug\nloader.\n\nBEE0B741142A9C392E05E0443AAE1FA41EF512D6 HPCustPartUI.dll Win32/Korplug.UB Known Mustang\nPanda Korplug\nloader.\n\nF6F3343F64536BF98DE7E287A7419352BF94EB93 HPCustPartUI.dll Win32/Korplug.UB Known Mustang\nPanda Korplug\nloader.\n\nF848C4F3B9D7F3FE1DB3847370F8EEFAA9BF60F1 libcef.dll Win32/Korplug.TX Known Mustang\nPanda Korplug\nloader.\n\n### Network\n\n\n-----\n\n**IPIP** **DomainDomain** **Hosting providerHosting provider** **First seenFirst seen** **DetailsDetails**\n\n3.228.54.173 broker.emqx.io Amazon.com, Inc. 2020-03-26 Legitimate public MQTT broker.\n\n80.85.156[.]151 N/A Chelyabinsk-Signal LLC 2023-01-05 MQsTTang delivery server.\n\n80.85.157[.]3 N/A Chelyabinsk-Signal LLC 2023-01-16 MQsTTang delivery server.\n\n185.144.31[.]86 N/A Abuse-C Role 2023-01-22 MQsTTang delivery server.\n\n### Github repositories\n\nhttps://raw.githubusercontent[.]com/YanNaingOo0072022/14/main/Documents.rar\nhttps://raw.githubusercontent[.]com/YanNaingOo0072022/ee/main/CVs Amb.rar\n\n## MITRE ATT&CK techniques\n\n[This table was built using version 12 of the MITRE ATT&CK framework.](https://attack.mitre.org/resources/versions/)\n\n**Tactic** **ID** **Name** **Description**\n\n\nResource\nDevelopment\n\n\n[T1583.003](https://attack.mitre.org/versions/v12/techniques/T1583/003) Acquire Infrastructure: Virtual Private\nServer\n\n\nSome servers used in the campaign are on\nshared hosting.\n\n\n[T1583.004](https://attack.mitre.org/versions/v12/techniques/T1583/004) Acquire\nInfrastructure:\nServer\n\n[T1587.001](https://attack.mitre.org/versions/v12/techniques/T1587/001) Develop\nCapabilities:\nMalware\n\n[T1588.002](https://attack.mitre.org/versions/v12/techniques/T1588/002) Obtain\nCapabilities: Tool\n\n[T1608.001](https://attack.mitre.org/versions/v12/techniques/T1608/001) Stage\nCapabilities:\nUpload Malware\n\n[T1608.002](https://attack.mitre.org/versions/v12/techniques/T1608/002) Stage\nCapabilities:\nUpload Tool\n\n\nSome servers used in the campaign\nseem to be exclusive to Mustang\nPanda.\n\nMQsTTang is a custom backdoor,\nprobably developed by Mustang\nPanda.\n\nMultiple legitimate and open- source\ntools, including psexec, ps, curl, and\nplink, were found on the staging server.\n\nMQsTTang was uploaded to the web\nserver for distribution.\n\nMultiple tools were uploaded to an FTP\nserver.\n\n\nInitial Access [T1566.002](https://attack.mitre.org/versions/v12/techniques/T1566/002) Phishing: Spearphishing Link MQsTTang is distributed via spearphishing\nlinks to a malicious file on an attackercontrolled web server.\n\nExecution [T1106](https://attack.mitre.org/versions/v12/techniques/T1106) Native API MQsTTang uses the QProcess class from\nthe Qt framework to execute commands.\n\n\n[T1204.002](https://attack.mitre.org/versions/v12/techniques/T1204/002) User Execution:\nMalicious File\n\n\nMQsTTang relies on the user to\nexecute the downloaded malicious file.\n\n\nPersistence [T1547.001](https://attack.mitre.org/versions/v12/techniques/T1547/001) Boot or Logon Autostart Execution:\nRegistry Run Keys / Startup Folder\n\n\nDefense\nEvasion\n\n\n[T1036.004](https://attack.mitre.org/versions/v12/techniques/T1036/004) Masquerading: Masquerade Task or\nService\n\n\nMQsTTang persists by creating a registry\nRun key.\n\nIn most samples, the registry key is created\nwith the name qvlc. This matches the name\nof a legitimate executable used by VLC.\n\n\n[T1036.005](https://attack.mitre.org/versions/v12/techniques/T1036/005) Masquerading:\nMatch Legitimate\nName or\nLocation\n\n\nWhen creating copies, MQsTTang uses\nfilenames of legitimate programs.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1480](https://attack.mitre.org/versions/v12/techniques/T1480/) Execution\nGuardrails\n\n[T1622](https://attack.mitre.org/versions/v12/techniques/T1622) Debugger\nEvasion\n\n\nMQsTTang checks the paths it is\nexecuted from to determine which\ntasks to execute.\n\nMQsTTang detects running debuggers\nand alters its behavior if any are found\nto be present.\n\n\nCommand\nand Control\n\n\n[T1071](https://attack.mitre.org/versions/v12/techniques/T1071) Application Layer Protocol MQsTTang communicates with its C&C\nserver using the MQTT protocol.\n\n\n[T1102.002](https://attack.mitre.org/versions/v12/techniques/T1102/002) Web Service:\nBidirectional\nCommunication\n\n[T1132.001](https://attack.mitre.org/versions/v12/techniques/T1132/001) Data Encoding:\nStandard\nEncoding\n\n[T1573.001](https://attack.mitre.org/versions/v12/techniques/T1573/001) Encrypted\nChannel:\nSymmetric\nCryptography\n\n\nMQsTTang uses a legitimate public\nMQTT broker.\n\nThe content of the messages between\nthe malware and server is base64\nencoded.\n\nThe content of the messages between\nthe malware and server is encrypted\nusing a repeating XOR key.\n\n\nExfiltration [T1041](https://attack.mitre.org/versions/v12/techniques/T1041) Exfiltration Over C2 Channel The output of executed commands is sent\nback to the server using the same protocol.\n\n2 Mar 2023 - 11:30AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-02 - MQsTTang- Mustang Panda’s latest backdoor treads new ground with Qt and MQTT.pdf"
    ],
    "report_names": [
        "2023-03-02 - MQsTTang- Mustang Panda’s latest backdoor treads new ground with Qt and MQTT.pdf"
    ],
    "threat_actors": [
        {
            "id": "b5449533-0ff1-4048-999d-7d4bfd8e6da6",
            "created_at": "2022-10-25T16:07:24.114365Z",
            "updated_at": "2025-03-27T02:02:10.111256Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [
                "Operation Dianxun",
                "TA416"
            ],
            "source_name": "ETDA:RedDelta",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Chymine",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1691c25f-1aa4-4168-8ce2-7aa8f23246e7",
            "created_at": "2024-06-04T02:03:07.724221Z",
            "updated_at": "2025-03-27T02:05:17.284601Z",
            "deleted_at": null,
            "main_name": "BRONZE PRESIDENT",
            "aliases": [
                "Mustang Panda ",
                "Red Lich ",
                "Temp.Hex ",
                "HoneyMyte "
            ],
            "source_name": "Secureworks:BRONZE PRESIDENT",
            "tools": [
                " Cobalt Strike",
                " ORat",
                " PlugX",
                " RCSession",
                "China Chopper"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1680660590,
    "ts_updated_at": 1743041807,
    "ts_creation_date": 1680510305,
    "ts_modification_date": 1680510305,
    "files": {
        "pdf": "https://archive.orkl.eu/6654a5811b00cac10749dd6881f73239881d4674.pdf",
        "text": "https://archive.orkl.eu/6654a5811b00cac10749dd6881f73239881d4674.txt",
        "img": "https://archive.orkl.eu/6654a5811b00cac10749dd6881f73239881d4674.jpg"
    }
}