{
    "id": "9138c3c6-bfbb-4a8f-84dc-531632aefcb9",
    "created_at": "2022-10-25T16:48:14.487692Z",
    "updated_at": "2025-03-27T02:14:39.163095Z",
    "deleted_at": null,
    "sha1_hash": "279f5467a697ab8ea2ecc9a896ac005b7f525721",
    "title": "GreyEnergy: Updated arsenal of one of the most dangerous threat actors",
    "authors": "",
    "file_creation_date": "2018-10-22T01:15:01Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 198778,
    "plain_text": "# GreyEnergy: Updated arsenal of one of the most dangerous threat actors\n\n**[welivesecurity.com/2018/10/17/greyenergy-updated-arsenal-dangerous-threat-actors/](https://www.welivesecurity.com/2018/10/17/greyenergy-updated-arsenal-dangerous-threat-actors/)**\n\nOctober 17, 2018\n\nESET research reveals a successor to the infamous BlackEnergy APT group targeting\ncritical infrastructure, quite possibly in preparation for damaging attacks\n\nRecent ESET research has uncovered details of the successor of the BlackEnergy APT\ngroup, whose main toolset was last seen in December 2015 during the first-ever blackout\ncaused by a cyberattack. Around the time of that breakthrough incident, when around\n230,000 people were left without electricity, we started detecting another malware\nframework and named it GreyEnergy. It has since been used to attack energy companies\nand other high-value targets in Ukraine and Poland for the past three years.\n\nIt is important to note that when we describe ‘APT groups’, we’re making connections\nbased on technical indicators such as code similarities, shared C&C infrastructure,\nmalware execution chains, and so on. We’re typically not directly involved in the\ninvestigation and identification of the individuals writing the malware and/or deploying it,\nand the interpersonal relations between them. Furthermore, the term ‘APT group’ is very\nloosely defined, and often used merely to cluster the abovementioned malware indicators.\nThis is also one of the reasons why we refrain from speculation with regard to attributing\nattacks to nation states and such.\n\nWe have already extensively documented the threat actors’ transition towards TeleBots in\n[cyberattacks on high-value targets in the Ukrainian financial sector](https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/), the supply-chain\n[attacks against Ukraine and in an analysis of TeleBots’ cunning backdoor. All from the](https://www.welivesecurity.com/2017/07/04/analysis-of-telebots-cunning-backdoor/)\ngroup most notable for the NotPetya ransomware outbreak. At the same time, we have\nalso been keeping a close eye on GreyEnergy – a subgroup operating in parallel, but with\nsomewhat different motivations and targeting.\n\nAlthough ESET telemetry data shows GreyEnergy malware activity over the last three\nyears, this APT group has not been documented until now. This is probably due to the fact\nthat those activities haven’t been destructive in nature, unlike the numerous TeleBots\nransomware campaigns (not only NotPetya), the BlackEnergy-enabled power grid attack,\n[and the Industroyer-caused blackout – which we have linked to these groups for the first](https://www.welivesecurity.com/2017/06/12/industroyer-biggest-threat-industrial-control-systems-since-stuxnet/)\ntime last week. Instead, the threat actors behind GreyEnergy have tried to stay under the\nradar, focusing on espionage and reconnaissance, quite possibly in preparation of future\ncybersabotage attacks or laying the groundwork for an operation run by some other APT\ngroup.\n\nGreyEnergy’s malware framework bears many similarities to BlackEnergy, as outlined\nbelow. It is similarly modular in construction, so its functionality is dependent on the\nparticular combination of modules its operator uploads to each of the targeted victim\nsystems. The modules that we have observed were used for espionage and\n\n\n-----\n\nspecifically target Industrial Control Systems (ICS). We have, however, observed that the\nGreyEnergy operators have been strategically targeting ICS control workstations running\nSCADA software and servers, which tend to be mission-critical systems never meant to go\noffline except for periodic maintenance.\n\n## Links to BlackEnergy and TeleBots\n\nSome of the reasons ESET researchers consider BlackEnergy and GreyEnergy related are\nlisted below:\n\nThe appearance of GreyEnergy in the wild coincides with the disappearance of\nBlackEnergy.\nAt least one of the victims targeted by GreyEnergy had been targeted by BlackEnergy\nin the past. Both subgroups share an interest in the energy sector and critical\ninfrastructure. Both have had victims primarily in Ukraine, with Poland ranking\nsecond.\nThere are strong architectural similarities between the malware frameworks. Both\nare modular, and both employ a “mini”, or light, backdoor deployed before admin\nrights are obtained and the full version is deployed.\nAll remote C&C servers used by the GreyEnergy malware were active Tor relays. This\nhas also been the case with BlackEnergy and Industroyer. We hypothesize that this\nis an operational security technique used by the group so that the operators can\nconnect to these servers in a covert manner.\n\nCompared to BlackEnergy, GreyEnergy is a more modern toolkit with an even greater focus\non stealth. One basic stealth technique – employed by both families – is to push only\nselected modules to selected targets, and only when needed. On top of that, some\nGreyEnergy modules are partially encrypted using AES-256 and some remain fileless –\nrunning only in memory – with the intention of hindering analysis and detection. To cover\ntheir tracks, typically, GreyEnergy’s operators securely wipe the malware components from\nthe victims’ hard drives.\n\nIn addition to the outlined similarities with BlackEnergy, we have observed another link\nbetween GreyEnergy and the TeleBots subgroup. In December 2016, we noticed an\ninstance of GreyEnergy deploying an early version of the TeleBots’ NotPetya worm – half a\nyear before it was altered, improved, and deployed in the most damaging ransomware\noutbreak in history. There is significant code reuse between this ransomware component\nand the GreyEnergy core module. We call this early version “Moonraker Petya”, based on\nthe malware writers’ choice of filename – most likely a reference to the James Bond\nmovie. It didn’t feature the infamous EternalBlue spreading mechanism, as it had not been\nleaked at that time.\n\n\n-----\n\n## GreyEnergy Tactics, Techniques and Procedures\n\nWe have observed two distinct infection vectors: “traditional” spearphishing, and the\ncompromise of public-facing web servers. When such a vulnerable web server was hosted\ninternally and connected to the rest of a targeted organization’s network, the attacker\nwould attempt to move laterally to other workstations. This technique is used not only as a\nprimary infection vector but also as a backup reinfection vector.\n\nThe attackers typically deploy internal C&C proxies within the victims’ networks. Such\nproxy C&Cs redirect requests from infected nodes inside the network to an external C&C\nserver on the internet. This is another stealth tactic, as it is less suspicious to a defender\nto see that multiple computers are “talking” to an internal server, rather than a remote one.\n\nA very curious observation – one that is also indicative of the group’s targeting – is that\nsome of the GreyEnergy samples we detected were signed with a certificate from\nAdvantech, a Taiwanese manufacturer of industrial and IoT hardware. These were most\n[likely stolen from the company, just as in the case of Stuxnet and a recent Plead malware](https://www.welivesecurity.com/2010/07/19/win32stuxnet-signed-binaries/)\ncampaign.\n\nThe GreyEnergy operators also employ common external tools in their arsenal, such as\nMimikatz, PsExec, WinExe, Nmap, and a custom port scanner.\n\nFor a detailed analysis of the GreyEnergy toolset and operations refer to our white paper\n[GreyEnergy: A successor to BlackEnergy. A full list of Indicators of Compromise (IoCs)](https://www.welivesecurity.com/wp-content/uploads/2018/10/ESET_GreyEnergy.pdf)\n[and samples can be found on GitHub. For any inquiries, or to make sample submissions](https://github.com/eset/malware-ioc/tree/master/greyenergy)\n[related to the subject, please contact us at: threatintel@eset.com.](mailto:threatintel@eset.com)\n\nFor more information about how to protect yourself you can [visit our website and find out](https://www.eset.com/int/greyenergy-exposed/)\nmore about GreyEnergy.\n\n[Anton Cherepanov and Robert Lipovsky 17 Oct 2018 - 11:55AM](https://www.welivesecurity.com/author/acherepanov/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.10.17.GreyEnergy/blog_GreyEnergy_Updated.pdf"
    ],
    "report_names": [
        "blog_GreyEnergy_Updated"
    ],
    "threat_actors": [
        {
            "id": "4d9cdc7f-72d6-4e17-89d8-f6323bfcaebb",
            "created_at": "2023-01-06T13:46:38.82716Z",
            "updated_at": "2025-03-27T02:00:02.928984Z",
            "deleted_at": null,
            "main_name": "GreyEnergy",
            "aliases": [],
            "source_name": "MISPGALAXY:GreyEnergy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716494,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1540170901,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/279f5467a697ab8ea2ecc9a896ac005b7f525721.pdf",
        "text": "https://archive.orkl.eu/279f5467a697ab8ea2ecc9a896ac005b7f525721.txt",
        "img": "https://archive.orkl.eu/279f5467a697ab8ea2ecc9a896ac005b7f525721.jpg"
    }
}