{
    "id": "9157ed7d-6ea8-4a22-a66f-bffb2f5b0712",
    "created_at": "2023-01-12T15:00:22.38222Z",
    "updated_at": "2025-03-27T02:05:30.024596Z",
    "deleted_at": null,
    "sha1_hash": "50fa2cf2f2325ea046e25bed24acf498e8b6ced9",
    "title": "2022-08-02 - SolidBit Ransomware Enters the RaaS Scene and Takes Aim at Gamers and Social Media Users With New Variant",
    "authors": "",
    "file_creation_date": "2022-08-18T03:55:26Z",
    "file_modification_date": "2022-08-18T03:55:26Z",
    "file_size": 2480846,
    "plain_text": "# SolidBit Ransomware Enters the RaaS Scene and Takes Aim at Gamers and Social Media Users With New Variant\n\n**[trendmicro.com/en_us/research/22/h/solidbit-ransomware-enters-the-raas-scene-and-takes-aim-at-gamer.html](https://www.trendmicro.com/en_us/research/22/h/solidbit-ransomware-enters-the-raas-scene-and-takes-aim-at-gamer.html)**\n\nAugust 2, 2022\n\nThis blog entry offers a technical analysis of a new SolidBit variant that is posing as different\napplications to lure gamers and social media users. The SolidBit ransomware group appears to be\nplanning to expand its operations through these fraudulent apps and its recruitment of\nransomware-as-a-service affiliates.\n\nBy: Nathaniel Morales, Ivan Nicole Chavez, Monte de Jesus, Lala Manly, Nathaniel Gregory\nRagasa\nAugust 02, 2022\nRead time: ( words)\n\n[Trend Micro researchers recently analyzed a sample of a new SolidBit ransomware variant that](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware)\ntargets users of popular video games and social media platforms. The malware was uploaded to\nGitHub, where it is disguised as different applications, including a League of Legends account\nchecker tool (Figure 1) and an Instagram follower bot, to lure in victims.\n\nThe League of Legends account checker on GitHub (Figures 2 and 3) is bundled with a file that\ncontains instructions on how to use the tool (Figure 4), but that is the extent of the pretense: It has\nno graphic user interface (GUI) or any other behavior related to its supposed function. When an\nunsuspecting victim runs the application, it automatically executes malicious PowerShell codes\nthat drop the ransomware. Another file that comes with the ransomware is named “Source code,”\nbut this seems to be different from the compiled binary.\n\nFigure 1. The icon of one of the malicious applications, named \"Rust LoL\n\nAccounts Checker\"\n\n\n-----\n\nFigure 2. The SolidBit ransomware variant masquerading as a League of Legends account\nchecker tool on GitHub\n\nFigure 3.\n\nDetails about the fraudulent League of Legends account checker posted on Github\n\nFigure 4. One of the files bundled with SolidBit’s fraudulent League of Legends account checker\non GitHub\n\n\n-----\n\nAmong the files bundled with the account checker, we also found an executable file named Rust\n_LoL Accounts Checker.exe (Figure 5) protected by Safengine Shielden, which obfuscates samples_\nand applications to make reverse engineering and analysis more difficult. When this file is\nexecuted, an error window appears and claims that debugging tools have been detected (Figure\n6), which may be one of the malware’s anti-virtualization and anti-debugging capabilities.\n\nFigure 5. File\n\nproperties of Rust LoL Accounts Checker.exe found using Detect It Easy\n\nFigure 6. A pop-up window that appears when Rust LoL Accounts Checker.exe is executed\nIf users click on this executable file, it will drop and execute Lol Checker x64.exe, which runs the\nmalicious PowerShell codes that drop and execute the SolidBit ransomware. After pivoting the\nbinary file in VirusTotal and AnyRun, we found that Rust LoL Accounts Checker.exe downloads\nand executes Lol Checker x64.exe using the following command:\n\n_cmd /c start \"\" %TEMP%\\LoL Checker x64.exe_\n\nWhen Lol Checker x64.exe is executed, it will begin disabling Windows Defender’s scheduled\nscans and any real-time scanning of the following folders and file extensions:\n\n%UserProfile%\n\n\n-----\n\n%AppData%,\n%Temp%,\n%SystemRoot%,\n%HomeDrive%,\n%SystemDrive%\n.exe\n.dll\n\nThe file disables these scans by using the following PowerShell command:\n\n_cmd /c powershell -Command \"Add-MpPreference -ExclusionPath_\n_@($env:UserProfile,$env:AppData,$env:Temp,$env:SystemRoot,$env:HomeDrive,$env:SystemDrive)_\n_-Force\" & powershell -Command \"Add-MpPreference -ExclusionExtension @('exe','dll') -Force\" &_\n_exit;_\n\nAfter successfully disabling Windows Defender from scanning these directories, the file will drop\nand execute the file Runtime64.exe, which we analyzed as the SolidBit ransomware, using the\nfollowing command prompt:\n\n_cmd /c start \"\" %TEMP%\\Runtime64.exe_\n\nRansomware analysis of SolidBit’s new variant\n\nThis new version of SolidBit ransomware is a .NET compiled binary (Figure 7). After opening\n_Runtime64.exe using the debugger and .NET assembly editor DnSpy, we found that this file was_\nobfuscated. We used a .NET deobfuscator and unpacker tool called de4dot to make the strings\nreadable (Figure 8).\n\nFigure 7.\n\nProperties of the binary using Detect It Easy Tool\n\n\n-----\n\nFigure 8. A comparison of the file before (left) and after (right) it was deobfuscated using de4dot\nThe ransomware creates a mutex and will terminate if another copy of itself is found already\nrunning on the machine (Figure 9).\n\nFigure 9.\n\nThe mutex created by SolidBit ransomware\nIt will also create a registry key to a directory named\n“Software\\Microsoft\\Windows\\CurrentVersion\\Run” with the value “UpdateTask” as its autostart\nmechanism (Figure 10).\n\nFigure 10. The registry key for SolidBit’s autostart mechanism\nPrior to encryption, the ransomware will check if the directory is in the root path and avoids the\nfollowing files and directories, as shown in Figure 11:\n\n\\\\ProgramData\n$Recycle.Bin\nAMD\nappdata\\\\local\nappdata\\\\locallow\nautorun.inf\nboot.ini\nboot.ini\nbootfont.bin\nbootmgfw.efi\nbootsect.bak\n\n\n-----\n\ndesktop.ini\nDocuments and Settings\niconcache.db\nIntel\nMSOCache\nntuser.dat\nntuser.dat.log\nntuser.ini\nNVIDIA\nPerfLogs\nProgramData\nProgram Files\nProgram Files (x86)\nthumbs.db\nusers\\\\all users\nWindows\nWindows.old\n\nFigure 11.\n\nSolidBit ransomware checking for files to be avoided\nThis SolidBit variant uses 256-bit Advanced Encryption Standard (AES) encryption to encrypt the\nfiles in its victim’s computer (Figure 12). A key that is appended in the encrypted files’ content\n(Figure 13) will act as SolidBit’s infection marker. The key came from a hard-coded string from the\n\n\n-----\n\nbinary that was encrypted via Rivest-Shamir-Adleman (RSA) encryption and was encoded to Base\n64. The ransomware will also append the .SolidBit file extension to the encrypted files and\nchanges their file icons (Figure 14). Its encryption routine only encrypts files with specific file\nextensions.\n\nFigure\n\n12. SolidBit ransomware’s encryption routine\n\nFigure 13. The encrypted\n\ncontent of the file\n\nFigure 14. A file encrypted by SolidBit ransomware\n\n\n-----\n\nThis SolidBit variant will also terminate multiple services, delete any shadow copies (Figure 15)\nand backup catalogs (Figure 16), and delete 42 services in the victim’s computer.\n\nFigure 15. SolidBit’s deletion of shadow copies\n\nFigure 16. SolidBit’s deletion of the backup catalog\nIt will also drop a file, RESTORE-MY-FILES.txt, that contains instructions on how a victim can pay\nthe ransom to every directory (Figure 17) and shows a pop-up window on the victim’s machine\n(Figure 18).\n\nFigure 17. Dropped ransom note by SolidBit ransomware\n\n\n-----\n\nFigure\n\n18. The pop-up window that SolidBit ransomware shows on the victim’s screen\nSolidBit as a LockBit imitator\n\n[SolidBit has been suspected of being a LockBit ransomware copycat, as the two share similarities](https://medium.com/s2wblog/two-copycats-of-lockbit-ransomware-solidbit-and-crypton-7257fb069b16)\nin their chat support sites’ formatting (Figure 19) and the file names of their ransom note (Figure\n20).\n\nFigure 19. Similarities between the chat support sites of LockBit (left) and SolidBit (right)\n\n\n-----\n\nFigure 20. The ransom notes of LockBit (left) and SolidBit (right)\nHowever, SolidBit ransomware is compiled using .NET and is actually a variant of Yashma\n[ransomware, also known as Chaos (Figure 21). It's possible that SolidBit’s ransomware actors are](https://www.trendmicro.com/en_us/research/21/h/chaos-ransomware-a-dangerous-proof-of-concept.html)\n[currently working with the original developer of Yashma ransomware and likely modified some](https://medium.com/s2wblog/two-copycats-of-lockbit-ransomware-solidbit-and-crypton-7257fb069b16)\nfeatures from the Chaos builder, later rebranding it as SolidBit (Figure 22).\n\nFigure\n\n21. The functions of SolidBit ransomware (left) and Yashma ransomware (right)\n\n\n-----\n\nFigure 22. SolidBit ransomware (left) and Yashma ransomware (right) checks files in a targeted\nsystem’s directories\nThe new SolidBit sample is larger than its predecessors at 5.56 MB, compared to the 159 KB of\nearlier SolidBit variants. Its use of a fake League of Legends Account Checker application to drop\nits ransomware payload is a new technique in its arsenal.\n\nSolidBit posing as social media tools\n\nIn addition to the fraudulent League of Legends account checker application, the aforementioned\nGitHub account has uploaded this new SolidBit variant disguised as other legitimate applications\nnamed “Social Hacker” (Figure 23) and “Instagram Follower Bot” (Figure 24). However, the\naccount has been taken down at the time of this writing.\n\n\n-----\n\nFigure 23. File properties of the\n\nnew SolidBit ransomware variant disguised as an application named Social Hacker\n\n\n-----\n\nFigure 24. File properties of the\n\nnew SolidBit ransomware variant disguised as an application called Instagram Follower Bot\nBoth these malicious applications display an error message when executed on a virtual machine\n(Figure 25). They exhibit the same behavior as the fake League of Legends account checker,\nwherein they drop and execute an executable that will, in turn, drop and execute the SolidBit\nransomware payload (Figure 26).\n\nFigure 25. The error message\n\nshown when the Social Hacker and Instagram Follower Bot applications are run on a virtual\nmachine\n\n\n-----\n\nFigure 26. The execution flow\n\nof the three malicious applications that contain the new SolidBit variant\nSolidBit as ransomware-as-a-service\n\nThe malicious actors behind SolidBit aren’t just turning to malicious apps as a means of spreading\n[the ransomware. A researcher found that the SolidBit ransomware group also posted a job](https://medium.com/s2wblog/two-copycats-of-lockbit-ransomware-solidbit-and-crypton-7257fb069b16)\nadvertisement on an underground forum on June 29 to recruit potential affiliates for their\n[ransomware-as-a-service (RaaS) activities. These affiliates, who are tasked with penetrating a](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware-as-a-service-raas)\nvictim’s system and distributing SolidBit, stand to gain 80% of the ransomware payout as a\ncommission.\n\nFending off ransomware attacks\n\nThe malware authors behind SolidBit ransomware appear to be gearing up to expand their\noperations through recruiting ransomware-as-a-service partners who will facilitate a wider scale of\ninfection, on top of the distribution approach of their newly found variant. The large commission\npercentage that SolidBit’s authors offer is likely to attract other opportunistic threat actors, so we\nanticipate more activity from this ransomware group in the near future.\n\nWhile it is not new for ransomware to disguise itself as a legitimate program or a tool as a social\nengineering lure, SolidBit’s new variant targets games and applications with a large user base. This\nallows SolidBit’s ransomware actors to cast a wide net of potential victims, and users who are may\nnot be well-versed in security hygiene, such as children or teenagers, could fall victim to fraudulent\n[applications and tools, as was the case in previous Minecraft and Roblox malware infections.](https://www.bleepingcomputer.com/news/security/gamers-face-waves-of-booby-trapped-game-cheats-that-steal-login-credentials/)\n\nEnd users and organizations alike can mitigate the risk of ransomware infection by following these\nsecurity best practices:\n\nEnable multifactor authentication (MFA) to prevent attackers from performing lateral\nmovement inside a network.\n[Adhere to the 3-2-1 rule when backing up important files. This involves creating three backup](https://www.trendmicro.com/vinfo/us/security/news/virtualization-and-cloud/best-practices-backing-up-data)\ncopies on two different file formats, with one of the copies stored in a separate location.\n[Patch and update systems regularly. It’s important to keep one’s operating system and](https://www.trendmicro.com/vinfo/us/security/news/vulnerabilities-and-exploits/virtual-patching-patch-those-vulnerabilities-before-they-can-be-exploited)\napplications up to date, which will prevent malicious actors from exploiting any software\nvulnerabilities.\n\nOrganizations can also benefit from security solutions that offer multilayered detection and\n[response such as Trend Micro Vision One™, which has multilayered protection and behavior](https://www.trendmicro.com/en_us/business/products/detection-response.html)\ndetection capabilities that help block suspicious behavior and tools before ransomware can do any\n\n\n-----\n\ndamage. [Trend Micro Apex One](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html) also provides next-level automated threat detection and\nresponse to protect endpoints against advanced issues, like fileless threats and ransomware.\n\nIndicators of compromise (IOCs)\n\nView the full list of IOCs [here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/solidbit-ransomware-enters-the-raas-scene-and-takes-aim-at-gamers-and-social-media-users-with-new-variant-/IOCs-SolidBit-Ransomware-Enters-the-RaaS-Scene-and-Takes-Aim-at-Gamers-and-Social-Media-Users-With-New-Variant%20.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-02 - SolidBit Ransomware Enters the RaaS Scene and Takes Aim at Gamers and Social Media Users With New Variant.pdf"
    ],
    "report_names": [
        "2022-08-02 - SolidBit Ransomware Enters the RaaS Scene and Takes Aim at Gamers and Social Media Users With New Variant.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535622,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1660794926,
    "ts_modification_date": 1660794926,
    "files": {
        "pdf": "https://archive.orkl.eu/50fa2cf2f2325ea046e25bed24acf498e8b6ced9.pdf",
        "text": "https://archive.orkl.eu/50fa2cf2f2325ea046e25bed24acf498e8b6ced9.txt",
        "img": "https://archive.orkl.eu/50fa2cf2f2325ea046e25bed24acf498e8b6ced9.jpg"
    }
}