{
    "id": "915d222e-bb8d-4e6a-a027-58982a0403f4",
    "created_at": "2023-01-12T15:10:54.636027Z",
    "updated_at": "2025-03-27T02:05:19.32867Z",
    "deleted_at": null,
    "sha1_hash": "7689fa9d055f86e89632892ef4cabf560093a662",
    "title": "2021-03-02 - Ploutus is back, targeting Itautec ATMs in Latin America",
    "authors": "",
    "file_creation_date": "2022-05-27T23:23:18Z",
    "file_modification_date": "2022-05-27T23:23:18Z",
    "file_size": 3840892,
    "plain_text": "# Ploutus is back, targeting Itautec ATMs in Latin America\n\n**[metabaseq.com/recursos/ploutus-is-back-targeting-itautec-atms-in-latin-america](https://www.metabaseq.com/recursos/ploutus-is-back-targeting-itautec-atms-in-latin-america)**\n\nPloutus, one of the most sophisticated ATM malware families worldwide, is back with a new\n[variant focused on Latin America. Discovered for the first time in 2013, Ploutus enables](https://www.securityweek.com/new-malware-found-infecting-atms-mexico)\ncriminals to empty ATMs by taking advantage of ATM XFS middleware vulnerabilities via an\nexternally connected device. Since its first discovery, Ploutus has evolved to target various\nXFS middleware types, focusing on banks across Mexico and Latin America. Previously,\nresearchers have discovered the following variants and associated target middleware:\n\n\n-----\n\nOcelot, the Offensive Security research team of Metabase Q, identified a new variant of\nPloutus in Latin America. This variant, dubbed Ploutus-I, controls ATMs from the Brazilian\nvendor Itautec. Itautec has been connected to other major ATM players over the years. In\n2013, the Japanese manufacturer, OKI, partnered with Itautec to enter the Brazilian market;\n[subsequently, NCR acquired OKI's IT services and selected software in Brazil in 2019.](https://www.ncr.com/news/newsroom/news-releases/company/ncr-and-oki-announce-definitive-acquisition-agreement-for-key-assets-in-brazil)\n\nThroughout this blog, we will describe the details of this new variant. We will cover the\ninfection methodology, AV bypass technique, obfuscation layers, malware interaction with the\ncrooks, and the XFS control to dispense the money on demand.\n\n### Ploutus-I heist operation overview\n\n\n-----\n\n### Ploutus-I Installation\n\nAt the beginning of the heist, the mule extracts the hard disk from the ATM. The binaries and\nartifacts (seen below) are copied to the path C:\\itautec. Because this path is whitelisted by\nthe Antivirus, the binaries and artifacts can bypass detection.\n\nPersistence is gained by adding the malware path to the Userinit registry key (see Figure 2),\nwhich lists the programs run by Winlogon when a user logs in to the system.\n\nThis path is found here:\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\\\n\nFigure 2. Registry key used for persistence\nThe Ploutus-I executable is shown as \"Itautec Protection Agent,\" with a compilation time of\nApril 17, 2020.\n\n\n-----\n\nFigure 3. Fake description of Ploutus-I\n\n### Deobfuscating Ploutus-I\n\nEvery new variant of Ploutus is harder to deobfuscate, and this last version is not the\nexception. This section is highly technical but essential to share for researchers to improve\nawareness and ATM security in the future. If you are not interested in the technical details,\nplease skip to the next section.\n\nPloutus-I has always been written in .NET Framework as a method of further obfuscation to\navoid signature-based detection and to make the reverse engineering task very challenging.\n\nBefore getting into the deobfuscation details, it is imperative to understand how the execution\nof .NET managed code(C#, F#, etc.) occurs in memory. For a more detailed explanation, we\n[recommend reading Phrack. For this blog, a minimalistic flow is shown in Figure 4.](http://www.phrack.org/papers/dotnet_instrumentation.html)\n\nIn a glimpse, what Ploutus-I obfuscator (Reactor) does is obfuscate the MSIL Managed Code\n[so that the source code cannot be displayed by DnSpy Debugger & Decompiler tool. At](https://github.com/dnSpy/dnSpy)\nruntime, the malicious code is deobfuscated by the malware and then passed to the Just-InTime (JIT) Compiler to create the native code that ends up been executed by the CPU. How\ncan we recover the source code and understand the inner workings of the malware? Keep\nreading.\n\n\n-----\n\nBy opening the assembly file Itautec.exe (see Figure 5), we can immediately see the\nstructure of the old variant Ploutus-D. Later in our discovery, we realized that the criminals\nbehind Ploutus-D just added support to control Itautec/OKI XFS Middleware.\n\nFigure 5. The same template of the previous variant used\n\n\n-----\n\nFigure 6. All Functions and Class names generated with random names\n\n\n-----\n\nFigure 7. No code available inside the functions\n\n### Deobfuscation strategy\n\n\n-----\n\nBefore digging into the deobfuscation strategy, it is crucial to understand how Reactor\nobfuscator hides the malicious code in memory. We can explain this obfuscation by looking at\nFigure 8, where:\n\nWhen a specific MSIL Code Function (let's say the Ploutus-I Keyboard one) is called,\nJIT is going to call getJIT to get the address of the compileMethod to compile it into\nNative Code\n\nHowever, Ploutus-I already installed a hook in memory redirecting that address to its\nown malicious one. It then deobfuscates the function and finally calls the original\ncompileMethod to proceed with normal execution.\n\nIt is worth mentioning that this process is performed at the memory and only for the function\nbeen called at that moment, explaining why there is no visibility of functions in DnSpy.\n\nWith this context, our strategy is to set a breakpoint in the original compileMethod in memory,\nto pivot from there into identifying the function of Ploutus-I controlling the deobfuscation\nprocess.\n\nFor this, we need to switch to a more advanced tool, the Windbg debugger, with its SOS.dll\nextension to deal with .NET Managed code.\n\nYou can see in Figure 9 that we set a breakpoint at function getJit() (exported by clrjit.dll)\nbecause it returns a VTable (array of pointers) where the first value is the address of the\ncompileMethod!\n\n\n-----\n\nFigure 9. Identifying compileMethod address\nOnce we set a breakpoint at compileMethod(at 0x6e1e3700) and let the malware run, we can\nsee in Figure 10 when the breakpoint hits. We then use the !CLRStack command to see the\nstack trace of managed code, and voila! We found the malicious method that redirects the\nexecution when compileMethod is called:\n\nGQa2qrta795LeasM25.vlIg50mEXlJEDAGw36.GyQV7V7HyQ()\n\nFigure 10. Identifying the malicious method that hooks compileMethod\nIt is essential to mention that each class's static constructor (.cctor) in the malware code uses\nthis function. This function usage makes sense because, as previously mentioned, every\nmethod is going to be deobfuscated in memory before getting compile into native code for\nexecution.\n\n\n-----\n\nUnfortunately, we are not there yet. In previous versions of Ploutus, the above function would\ncontain the deobfuscation code for us to dump. However, when looking at the function (see\nFigure 11) in DnSpy, we realized we entered a vast obfuscated function with hundreds of\nswitch cases, spaghetti code, death code, and other tricks, which make it impossible to\ndebug.\n\nFigure 11. Obfuscated function GyQV7V7HyQ()\nWe keep digging into the new function. Based on previous versions of Ploutus, we expected\nsome keylogging to be running in the background. Based on prior discoveries, we pressed\nsome F keys and eventually got a new hit at compileMethod (see Figure 12). When we\nlooked at the stack trace, we identified the function that contained the deobfuscated MSIL\nCode that was about to call compileMethod to get executed!\n\n\n-----\n\nGQa2qrta795LeasM25.vlIg50mEXlJEDAGw36.NvQ34uZt895nxEhi2FIr()\n\nFigure 12. Identifying the function that contains the deobfuscated MSIL Code\nBy accessing that function, as shown in Figure 13, the deobfuscated MSIL code is passed to\nthe original compileMethod function (line 35). This process is described further in the Phrack\narticle (referenced above). As a result, we receive the second parameter, the\nCORINFO_METHOD_INFO structure, where we can get the address where the MSIL Code\nis located and its size (highlighted in yellow):\n\n\n-----\n\nWith this information, we can either dump the MSIL Code from memory via DnSpy or directly\nin Windbg, and we are all set! An excellent tool written by @s4tan deobfuscating a previous\nvariant of Ploutus.\n\nFigure 13. Call to the original compileMethod function\nNow, let’s compare the results by looking at the function Launcher.KeyBoard::RealStart()\nbefore deobfuscation. We can see it is empty in Figure 14.\n\nFigure 14. Functions before been deobfuscated\nAnd then, after the magic happens, we can see in Figure 15, the deobfuscated MSIL Code\nready to be analyzed!\n\n\n-----\n\nFigure 15. Function after been deobfuscated\n\n### Understanding Ploutus-I Inner workings\n\nWith the MSIL Code in our hands, we can understand what is going on with this new variant.\nThe primary function we focused on is Launcher.KeyBoard::RealStart() since it triggers all the\nactions executed by the malware. It implements a keylogger (already seen before) to\nintercept all keys and numbers entered by the mule via an external keyboard. It is essential to\nmention that this variant was successfully executed in the Windows 7 and Windows 10\nversions.\n\nPloutus-I encrypts all its strings. When needing one of them, the malware will call the\ninstruction ldc.14.s passing an offset as an argument that will be the pointer into a Unicode\nbyte array decrypted from the resources section at runtime pointing to the plaintext value. For\nexample, in Figure 16, the instruction \"ldc.14.s 0x9f0\", goes to the offset 0x9f0 and returns\nthe string \"F8F1F1\". You can see all the strings extracted in the Appendix A section at the\nend.\n\n\n-----\n\nFigure 16. Malware validating F keys entered\nFollowing this process, we were able to identify the combinations to trigger specific actions to\nPloutus-I, as shown in Figure 17.\n\nFigure 17: Sequence of keys to execute specific actions\nSome functions are from the previous version of Ploutus, but still work in this variant. As an\nexample, PrintScreen.Windows() that once the correct combination is received, the screen at\nFigure 18 is displayed.\n\n\n-----\n\nFigure 18. Window displayed by Ploutus-I\nOnce the combination \"F8F1F2F3F4\" is entered by the criminals, the\nLauncher.Launch::LaunchClient() is called as seen at Figure 19.\n\nFigure 19. Call to LaunchClient function\nThen inside Launch.LaunchClient() function, we can see the offset 0x218 is used to decrypt a\nstring which ended up being “GG.exe” that eventually is able to control the XFS middleware\nin the ATM (see Figure 20).\n\n\n-----\n\nFigure 20. GG.exe string is decrypted\nFinally the binary gets executed but fails in our system since no DLLs are present. See\nFigure 21.\n\nFigure 21. GG.exe gets executed\n\n### Controlling XFS to dispense the money\n\nThe binary GG.exe and XFSGG.dll are used to interface with Itautec/OKI XFS Middleware.\nWhen examining the properties of GG.exe, it is described as \"JIG NMD\" as seen in Figure\n22. This resembles a legitimate Itautec tool used to test the functionality of the Dispenser.\nWhile it is not novel that criminals utilize ATM maintenance tools for malicious purposes, it is\ninteresting that the criminals behind Ploutus did not follow the same methodology to control\nthe XFS middleware directly. This suggests that the group behind Ploutus-I may not be the\nsame group that created prior variants.\n\nFigure 22. Itautec Maintenance tool\nAdditionally of note, the tool is written in Portuguese. In Figure 23, some extracts of the\nstrings in the binary are visible.\n\n\n-----\n\nFigure 23. Tool written in Portuguese\nGG.exe opens a session with the Dispenser by using its logical name as\n“NDC_CASH_DISPENSER” in order to request information via code number 310 and action\n“WFS_INF_CDM_CONF” as shown in Figure 24.\n\n\n-----\n\nFigure 24. GG.exe asking for Dispenser Status\nOnce the session opens, GG.exe reads data from the Dispenser via\n\"WFS_CMD_CDM_READ_DATA\" action, typically to get the total number of notes (bills)\navailable and denomination. See Figure 25.\n\nFigure 25: Gathering information from the Dispenser\nIn the next step, Ploutus-I requests an activation code, similar to a software license. This\ncode enables criminals to limit the number of times the mules can use Ploutus-I to once a\nday. If the code is correct, it's \"show me the money\" time! In this stage, the XFS command\n\"WFS_CMD_CDM_PRESENT\" instructs the Dispenser to present the requested bills to the\nmule (see Figure 26).\n\n\n-----\n\nFigure 26. “Show me the money”time!\nAs expected, the criminals know the exact ATM version they are targeting and its physical\ncapabilities. As a result, in every round of attacks, the malware requested the maximum\namount of bills to retrieve. In this case, the maximum number is 70, starting from the cassette\nwith the highest denomination, to equal $35,000 MXN (~$1677 USD) per round. All the\ndispensing activity is stored in the log in: C:\\itautec\\exe\\LibraryLog.txt. See Figure 27.\n\nFigure 27. Malware cashing out\nAlso, Ploutus creates a SQLite Database at\nc:\\Users\\%USERNAME%\\AppData\\Roaming\\NewLog, showing the dispensing related\nactivities. See Figure 28.\n\n\n-----\n\nFigure 28. Dispensing Activity Logging\n\n### Recommendations\n\nPeriodic check of AV whitelist folders to make sure they are up to date and do not have\nmalicious paths added\n\nAutomatic updates for all the software running in the ATM if possible\n\nUp-to-date AV signatures\n\nA proper implementation of hard disk encryption, but it is critical to do it correctly. An\nincomplete implementation can allow an attack to sniff the Volume keys from TPM to\nCPU over SPI/I2C bus, among other flaws.\n\nNext-generation centrally managed end-to-end encrypted cameras with tampering\ndetection, motion alerts and facial detection\n\nPeriodic ATM Penetration Testing to identify vulnerabilities and countermeasures at\nHardware, Middleware, Firmware and Software level\n\nMake sure your provider generates of Indicators of Attack(IOA) and Indicators of\nCompromise (IOCs) during this exercise to improve the detection and monitoring of\nthese attacks\n\n\n-----\n\nSet alerts on specific events inside the Journal, AV, EventLog or XFS log to detect and\nrespond to these attacks in a timely manner\n\nMake sure your provider understands the format of the Journal of your ATM and can\nrecommend what type of events to monitor.\n\n### Who we are\n\n[Ocelot, by Metabase Q, is the leading Offensive Security team in Latin America. This elite](https://www.metabaseq.com/https://www.metabaseq.com/en/solutions/research)\nteam of researchers represents the best of the best, partnered together to transform\ncybersecurity in the region. Ocelot threat intelligence, research, and offensive skills power\nMetabase Q's cybersecurity managed solutions.\n\nOur Advanced ATM Penetration testing covers logic and physical attacks. We test ATMs with\ncustomized malware like Ploutus and others, as well as perform multiple physical attacks in\nthe Dispenser, including Endoscope, TPM sniffing, DMA Attacks, TRF, CMOS Shock, etc., to\nprovide a real assessment experience.\n\nDo you know how your systems would perform with ransomware or other advanced attacks?\nDue to our reverse engineering capabilities, we track and dissect APTs to replicate their TTPs\nin our customers' environment. As a result, we are able to simulate advanced attacks and\nmeasure your security controls' effectiveness and investment\n\nDo you have devices? IoT/ICS? We can assess them as well, from Hardware, Boot Loader,\nMiddleware, Firmware all the way to Application level\n\nWe wrote the first secure code guideline for BASE24 to find vulnerabilities at the Switch or\nBank BASE24/CONNEX to identify payment authorization bypass and PCI violations.\n\n[Please reach out at contact@metabaseq.com](http://10.10.0.46/mailto:contact@metabaseq.com)\n\n**Indicators of Compromise:**\n\nPaths:\n\nC:\\itautec\\exe\\*\n\nC:\\itautec\\exe\\LibraryLog.txt\n\nc:\\Users\\<user>\\AppData\\Roaming\\NewLog\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\\UserInit\n\n\n-----\n\n### Appendix A\n\n**Decrypted strings**\n\nIEBOLDP6\n\nC:\\Diebold\\EDC\\edclocal.dat2\n\n[Launcher Client] Request\n\n[LauncherSysApp] Request\n\nCMD.exe /C wmic os where Primary='TRUE'\n\nreboot [Launcher]\n\nTaskKill.exe /F /IM\n\nGG.exe /F /IM\n\nNDCPlus.exe /F /IM\n\nwinvnc.exe /F /IM\n\nMSXFSEXE.exe /F /IM\n\nCajaExpress.exe\n\nGG.exe\n\nC:\\NDC+\\Lib\\MsXfsExe\n\nC:\\NDC+\\Bin$\n\n[Launcher Client] Admin /C\n\nTaskKill /F /IM\n\nXFSConsole.exe /C\n\nSTART XFSConsole.exe /C\n\nTaskKill /F /IM\n\nNewAge.exe /C\n\nSTART NewAge.exe P /C\n\n\"C:\\Program Files\\Diebold\\AgilisStartup\\AgilisShellStart.exe\"\n\n\n-----\n\n[Launcher] Start\n\nAgilisT:\\Program Files\\NCR APTRA\\SSS Runtime\n\nCoren:\\Program Files\\NCR APTRA\\SSS Runtime Core\\ulSysApp.exe\n\n[LauncherSysApp]\n\n\"C:\\Probase\\ProDevice\\BIN\\ProDeviceStart.bat\"\n\nC:\\Probase\\ProDevice\\BIN8 /C\n\nSTART Delete.bat & pause /C\n\nCMD.exe\n\n[Launcher] Start\n\nCMD procexp.exe\n\nC:\\ProgramFiles\\Diebold\\AMI\\Diagnostics\\bin\\Diebold.Ami.Diagnostics.Diagnostics.exe\n\nC:\\Program Files\\Diebold\\AMI\\Diagnostics\\bin$ /C\n\nSTART Main.exe /F /IM\n\nCMD.exe\n\n[Launcher] Start\n\nEND /F /IM\n\nWscript.exe /F /IM script.exe /F /IM vpncli.exe\n\nDIEBOLDJ[Launcher Client]\n\nInicio Directo BootH\n\n[Launcher Client]\n\nInicio Directo EPP\n\nLauncherStart\n\nLoading Wait\n\nPress[Esc] to Continue\n\nSoftware\\Microsoft\\Windows NT\\CurrentVersion\\winlogon\n\n\n-----\n\n/C net localgroup administrators /add\n\n[Launcher]\n\nUserPermision Done\n\nDone\n\n[LauncherConfig:]\n\nService: >[LauncherConfig:]\n\nLaunch Menu: <[LauncherConfig:]\n\nLaunch App: <[LauncherConfig:]\n\nLaunchDate: 6[LauncherConfig:]\n\nTimeOut: 8[LauncherConfig:]\n\nReadFile: B[LauncherConfig:]\n\nExternalDrive: 2[LauncherConfig:]\n\nPatch:\n\nReset.txt\n\n[Launcher] Windows 7 Detected\n\ninstall /c\n\nC:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\InstallUtil.exe: & net start DIEBOLDP &\npause\n\ninstallonly\n\n& pauseuninstall /c\n\nC:\\Windows\\Microsoft.NET\\Framework\\v2.0.50727\\InstallUtil.exe/u\n\ntest\n\n[Launcher] Starting App Mode Detect Windows 7.B[Launcher]\n\nStarting Service Mode.:[Launcher]\n\nStarting App Mode.Launcher\n\n\n-----\n\n43246 4354\n\n5204167231340092\n\nCopyData:\n\n$Config\n\nRead\n\nStart\n\nFile Exist.\n\nFile Open.\n\nRead End.\n\nError.\n\nConfig New File.\n\nAgilis.log\n\nConfig New File\n\nClose.\n\nConfigCopy:\n\nN.bin\n\nPloutos\n\nLog.txt\n\nDiebold Event\n\nLogTSYSTEM\\CurrentControlSet\\Services\\DIEBOLDP\n\nTypej\n\nSOFTWARE\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\n\nUserinit /C REG\nADD\"HKEY_LOCAL_MACHINE\\Software\\Microsoft\\WindowsNT\\CurrentVersion\\Winlogon\" /v\nUserinit /t REG_SZ /d \"\" /f\n\ncmd.exe\n\n\n-----\n\nAbrir\n\nArial\n\nBlack\n\nCerrar\n\nReiniciar\n\n\\\\.\\DISPLAY1\n\nTEST OK\n\nDISPLAY2\n\nEND OK\n\nCould not impersonate the elevated user.\n\nLogonUser returned error code {0}.\n\nLoad\n\nVer archivo adjuntoButton Text\n\n### Sigue leyendo\n\nPara descargar el archivo y seguir leyendo, por favor danos la siguiente información.\n\nAl menos Nombre de pila y un apellido\n\nPor favor utilice su e-mail de trabajo\n\nGracias, haga click abajo para ver el archivo.\n\nDescargar\nAlgo salió mal, por favor intente de nuevo.\n\n### Keep reading\n\nTo download this file and keep reading, please fill out the following form.\n\nAt least First and Last Name\n\nPlease use your work e-mail\n\nThank you, click below to view the file.\n\n\n-----\n\nDOwnload\nOops! Something went wrong while submitting the form. Please try again.\n\n## Related\n\n Relacionado\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-02 - Ploutus is back, targeting Itautec ATMs in Latin America.pdf"
    ],
    "report_names": [
        "2021-03-02 - Ploutus is back, targeting Itautec ATMs in Latin America.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536254,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653693798,
    "ts_modification_date": 1653693798,
    "files": {
        "pdf": "https://archive.orkl.eu/7689fa9d055f86e89632892ef4cabf560093a662.pdf",
        "text": "https://archive.orkl.eu/7689fa9d055f86e89632892ef4cabf560093a662.txt",
        "img": "https://archive.orkl.eu/7689fa9d055f86e89632892ef4cabf560093a662.jpg"
    }
}