{
    "id": "917e50d5-9637-4e42-8bfb-ba9f0cfbc1f3",
    "created_at": "2023-01-12T15:04:32.752286Z",
    "updated_at": "2025-03-27T02:16:26.058646Z",
    "deleted_at": null,
    "sha1_hash": "c46df311de72e16c30f335838420b36effec2a33",
    "title": "2022-08-16 - BugDrop- the first malware trying to circumvent Google's security Controls",
    "authors": "",
    "file_creation_date": "2022-12-29T00:26:47Z",
    "file_modification_date": "2022-12-29T00:26:47Z",
    "file_size": 2486924,
    "plain_text": "# BugDrop: the first malware trying to circumvent Google's security Controls\n\n**[threatfabric.com/blogs/bugdrop-new-dropper-bypassing-google-security-measures.html](https://www.threatfabric.com/blogs/bugdrop-new-dropper-bypassing-google-security-measures.html)**\n\nresearch\n\n16 August 2022\n\n\n-----\n\n## Intro\n\nBetween 2020 and 2021, the Android malware epidemic took over the banking threat landscape. Families like\nAnatsa and Cabassous spread to thousands of victims by international SMiShing campaigns, coupled with various\nkinds of web phishing pages to trick users into downloading malicious APKs.\n\nIn 2022, this trend was confirmed, with a heavy switch in distribution techniques in favour of droppers, Android\napplications whose sole purpose is to bypass security measures used in official market places like Google Play\n**Store, and deploy they payload, which is usually an Android banking trojan.**\n\nAndroid Droppers are becoming the most reliable and preferred way to deploy malware on victim’s devices.\nGoogle has taken action to restrict the amount of privileges that sideloaded applications can obtain starting from\n[Android 13, but, as we covered in our last blog, this solution seems to not be enough to stop criminals from](https://www.threatfabric.com/blogs/h1-2022-mobile-threat-landscape.html)\ndownloading and enabling all the necessary privileges and permissions on their malware.\n\nRecently, ThreatFabric’s predictions became true, when we discovered an in-development dropper, which we\nnamed BugDrop, that criminals have been working on to circumvent this security feature that will become part\nof the next release of the mobile OS from Mountain View.\n\nOnce finished, this product would become another weapon in criminal’s already dangerous arsenal, potentially\nrendering Google’s solution obsolete even before its deployment.\n\n## Context\n\nRecently, in their daily monitoring of Android malware activity, our researchers noticed something unusual in the\nlatest sample of the malware family Xenomorph.\n\n\n-----\n\nThis malware family has been resurfacing in the last couple of months with a few campaigns, mostly appearing on\nGoogle Play Store. These new campaigns feature a new and improved version of Xenomorph, which added RAT\ncapabilities thanks to the addition of a handful of, as they are named in the code itself, “Runtime modules”. These\nmodules give the malware the capability of performing gestures, touches, and much more on an infected device.\n\nWhat sparked our researchers’ curiosity was the presence, among the targets returned by the C2, of a Russian\napplication. Usually it is very rare for banking malware to target CIS countries, mostly due some sort of twisted\ncode of honor among criminals from that region. For this reason ThreatFabric decided to investigate further.\n\nIn the case of Xenomorph, after installation, the bot will always request overlays from the C2, which will send back\nan encrypted JSON configuration, with the URLs where the overlays are hosted. Below you can see the decrypted\nresult returned from the server, together with the overlay itself.\n\nAs you can see, the highlighted overlay is the one corresponding to the Russian organization. However, the\noverlay itself corresponds to a famous Spanish institution.\nWhat was very interesting and started a more detailed\ninvestigation, was the fact that the server hosting this specific overlay was different from the one hosting all the\nothers. We simply tried to connect to the server, and were welcomed with a nice open folder.\n\n## The “Hadoken Security” Group\n\nBefore analyzing the content of this folder, it is worth mentioning where it is hosted. The main domain redirects to\nthe following page, containing a post, apparently posted on the 31st of May 2022.\n\nIn this post, which seems to be a self-advertisement message, the “Hadoken Security” group claims the\n[ownership of multiple malware families, including the Android Banking trojan Xenomorph and the Dropper](https://www.threatfabric.com/blogs/xenomorph-a-newly-hatched-banking-trojan.html)\n[Gymdrop, and unfortunately even uses ThreatFabric own blogs as reference:](https://www.threatfabric.com/blogs/deceive-the-heavens-to-cross-the-sea.html)\n\n\n-----\n\nComing back to the investigation, the open folder contained a few different interesting files. In addition to the\npreviously mentioned Spanish overlay, and another overlay targeting Gmail, three APKs were available for\ndownload. Two of these were different Xenomorph samples belonging to two different campaigns (the “Task\nScheduler” campaign and the “Android Settings” campaign).\n\nHowever, the third APK sample, which poses as a QR code reader, looked different from the others. Based on\nXenomorph known Modus Operandi, our best guess was for this to be a dropper, likely of the Gymdrop family,\nwhich has been previously associated with this Banking malware and to the Threat Actor group behind it.\n\n## BugDrop: A Dropper Trying to Bypass Google Security\n\nThe application poses as a QR code reader, much like many other droppers that ThreatFabric has seen and\nreported over the past couple of years.\n\nIt is interesting to see that in one of the fake activity used by the dropper, specifically the one that should be used\nto send messages via the social messaging app WhatsApp, the default country code is set up to be +92,\ncorresponding to Pakistan. This information could give an indication of the possible target area for the future of\nthis dropper, but currently we do not possess enough information to substantiate this claim.\n\n\n-----\n\nOnce started, the application immediately requests the Accessibility Services access to the user. This is already\na red flag, as this kind of services grant applications the ability to perform gestures and touches in the user’s\nstead. No QR code reader should require these kind of priviliges. In addition, it bars out the possibility of this\nsample being part of the Gymdrop family, as this dropper family does not rely on Accessibility Services to install\nmalware on victim’s devices.\n\nOnce granted, while showing a loading screen, the dropper initiates a connection with its onion.ws C2, which\nrelies on the TOR protocol, obtaining back its configuration and the URL of the payload to download and install.\nThroughout the course of our investigation, this URL changed from being one of the samples in the open folder, to\nan external URL again referring to QR code scanners functionalities, which used a endpoint very similar to what\nwas used by Gymdrop samples that we observed in the wild in the last few months.\n\n\n-----\n\nThe file downloaded in both cases was still belonging to the Xenomorph family.\n\nThis is where it becomes clear that this dropper and the actors behind it are still in deep development phase. In the\nimage below you can see the error message sent back to the C2 by the bot:\n\nThe clear issue here is that the APK is not requesting the “REQUEST_INSTALL_PACKAGES” permission to the\nOS, without which it is impossible for a application to install anything on the device (even with accessibility\nservices privileges), as it is even pointed out by the error message sent back to the Onion C2 by the bot.\n\n\n-----\n\nA few hours after the discovery of the open folder, criminals noticed the issue, also due to a tweet thread that drew\nthe attention of a few researchers, and blocked the access to the data.\n\n### A page out of Brox tutorial manual\n\nAs it is clear, this dropper-in-development is a new product from the actors behind Xenomorph. Most of its\nmalicious behaviour is contained in a package named com.secpro.androidapkupdater. If this activity name rings\na bell, it is because it is borrowed from as a lesser known malware, named Brox. Brox (also known as\nMasterFred) is a Android malware family that was created and distributed on hacking forums as a mean to teach\nmalware development to criminals. The actors behind it offered a full paid course to teach the basics of malware\ndevelopment, including access to panels and support in the management and abuse of the botnet. This malware\nfamily briefly resurfaced towards the end of 2021, where it was also named MasterFred, but with just a handful of\nsamples.\n\nThis QR code reader seems to be a slightly modified version of the original Brox code, with a just a slightly\ntweaked communication protocol.\n\nIn this case, during the setup, criminals forgot to hide the sign-up page to the panel, which, in good tutorial\nfashion, does not have any specific requirement for access, which allowed us to have a nice view of the panel\nitself, together with some information on the amount of infections for this in-development dropper. We assume that\nthis number is mostly made of testing devices (both from criminals as well as researchers alike).\n\n\n-----\n\nIt is possible that this specific panel is simply automatically set-up from the tutorial code of Brox, as there does not\nseem to be much activity or capabilities enabled from this panel.\n\nThis malware family was known previously as an overlaying Android malware, but had always the capability of\ninstalling other APKs on the device. It seems like this is the primary purpose of the malware when deploying\nXenomorph, while relying on a C2 server structure very similar to the one used by Gymdrop, which is as discussed\nanother product of the Hadoken group.\n\nCurrently we do not see any banking malware activity coming from these samples, despite the fact that they do\nfeature code capable of performing overlay attacks as well.\n\n### A brand new technique to bypass Google’s Security Measures\n\nThe most interesting fact about this new Brox sample is the methodology used to install the APK downloaded from\nthe server. The code is not fully functional, and some of the references seem to be missing, but one string in the\ninstaller function stands out among others. You can find the mentioned function in the following code snippet:\n\n\n-----\n\n```\n     p (, g, )\n     .registers 6\n\ninvoke-direct    Object-><init>()V, p0\n\nconst-string    v0, \"com.example.android.apis.content.SESSION_API_PACKAGE_INSTALLED\"\n\ninvoke-static    h->a(String)String, v0\n\nconst-string    v0, \"~~~\"\n\nconst-string    v1, \"4.Update\"\n\ninvoke-static    Log->d(String, String)I, v0, v1\n\niput-object     p1, p0, g->a:Context\n\niput-object     p2, p0, g->b:String\n\niput-object     p3, p0, g->c:c\n\nnew-instance    p1, StringBuilder\n\ninvoke-direct    StringBuilder-><init>()V, p1\n\nconst-string    p3, \"using url \"\n\ninvoke-virtual   StringBuilder->append(String)StringBuilder, p1, p3\n\ninvoke-virtual   StringBuilder->append(String)StringBuilder, p1, p2\n\ninvoke-virtual   StringBuilder->toString()String, p1\n\nmove-result-object p1\n\ninvoke-static    Log->d(String, String)I, v0, p1\n\nnew-instance    p1, g$b\n\nconst/4       p2, 0\n\ninvoke-direct    g$b-><init>(g, g$a)V, p1, p0, p2\n\nconst/4       p2, 0\n\nnew-array      p2, p2, [Void\n\ninvoke-virtual   AsyncTask->execute([Object)AsyncTask, p1, p2\n\nreturn-void\n\n```\nWhat drew our attention is the presence in the Smali code of the string\n**“com.example.android.apis.content.SESSION_API_PACKAGE_INSTALLED”. This string, which is not present**\nin the original Brox code, corresponds to the action required by intents to create an installation process by session.\n\nIn this context, it is important to remind the new security features of Android 13, which will be released in fall of\n2022.\nWith this new release, Google introduced the “restricted setting” feauture, which blocks sideloaded\napplications from requesting Accessibility Services privileges, limiting this kind of request to applications installed\nwith a session-based API (which is the method usually used by app stores).\n\nWith this in mind, it is clear what criminals are trying to achieve. What is likely happening is that actors are using\nan already built malware, capable of installing new APKs on an infected device, to test a session based installation\nmethod, which would then later be incorporated in a more elaborate and refined dropper.\n\n\n-----\n\nThis is very dangerous, and in line with what ThreatFabric predicted in our previous blog “2022 Mobile Threat\nLandscape update”. When fully implemented, this slight modification would circumvent fully Googles new security\nmeasures, even before they are effectively in place.\n\nConsidering that the Hadoken Group has very kindly adopted our naming for all of their products, we decided to\nname this dropper “BugDrop”, in honor of all the issues that are present in its codebase.\n\n## Conclusion\n\nThe Hadoken group has been active since at least the end of 2021, starting with their dropper product, Gymdrop,\nand in early 2022 they introduced their first Android banking malware, Xenomorph. Both these malware families\nhave been proven to be high threats to banking institutions and banking customers alike, the first being used by\nmultiple malware families as a mean of distribution, while the second being a very advanced Banking trojan with\nOn-Device Fraud capabilities.\n\nWith the completion and resolution of all the issues currently present in BugDrop, criminals will have another\nefficient weapon in the war against security teams and banking institutions, defeating solutions that are currently\nbeing adopted by Google, which are clearly not sufficient to deter criminals.\n\nThreatFabric expects the Hadoken group to continue working on this dropper family, or more generally to develop\nand start distributing a dropper family abusing the Session driven installation, to bypass Google new Security\nfeatures.\n\n## ThreatFabric Fraud Risk Suite\n\nWith our Fraud Risk Suite we are helping financial institutions to gain visibility on fraud attempts by mobile\n(banking) malware. If you would like to know more about how we use our fraud detection SDK to detect any type\n[of fraud on mobile devices, feel free to reach out to sales@threatfabric.com.](mailto://sales@threatfabric.com)\n\n## Appendix\n\n\n-----\n\n### Xenomorph Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\n\nAndroid\nSecurity\nService\n\nTask\nScheduler\n\n\ndeceva.lgmihi.wtcozl ab345951a3e673aec99f80d39fa8f9cdb0d1ac07e0322dae3497c237f7b37277\n\nwyrkpv.slyffg.berykl 65c655663b9bd756864591a605ab935e52e5295735cb8d31d16e1a6bc2c19c28\n\n\n### Gymdrop Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\n\nGym and\nFitness\nTrainer\n\nDocument\nScanner\n\n\ncom.gym.trainer.jeux 30ee6f4ea71958c2b8d3c98a73408979f8179159acccc01b6fd53ccb20579b6b\n\ncom.portus.docscan 3484a3e8743d65510de60b7bc91ee87da57573e22294fc36f731b3e1096adf15\n\n\n### BugDrop Samples\n\n**App**\n**name** **Package name** **SHA-256**\n\n\nanother\nQRScan\n\nanother\nQRScan\n\n\nhdkjvi.looawt.fpfzys 214a576b46241bdf76bb4dbeacc7a456905eacd345fc515e0b38d6976c271168\n\nhdkjvi.looawt.fpfzys 367ae87d74c4d45aec595bdccee83a2d38b8ceb71956c902716141f163987c8a\n\n\n### Brox Samples\n\n**App name** **Package name** **SHA-256**\n\nMaster master.com 1284d9e44fa5ac5b645c26c5e941cc392d77ab24ebfa91948688ce769ff71667\n\nTest com.test.com 8d9facf6319339cfaf0de3e2da5727bd25a933b34b5f0b0029459d6d7e22689a\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-16 - BugDrop- the first malware trying to circumvent Google's security Controls.pdf"
    ],
    "report_names": [
        "2022-08-16 - BugDrop- the first malware trying to circumvent Google's security Controls.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535872,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1672273607,
    "ts_modification_date": 1672273607,
    "files": {
        "pdf": "https://archive.orkl.eu/c46df311de72e16c30f335838420b36effec2a33.pdf",
        "text": "https://archive.orkl.eu/c46df311de72e16c30f335838420b36effec2a33.txt",
        "img": "https://archive.orkl.eu/c46df311de72e16c30f335838420b36effec2a33.jpg"
    }
}