{
    "id": "918afdc9-6d83-4f67-b5d3-8d228e492445",
    "created_at": "2023-01-12T15:06:32.218629Z",
    "updated_at": "2025-03-27T02:06:01.375063Z",
    "deleted_at": null,
    "sha1_hash": "5004596b68c199ab20b5f0eb28b00d6c1dea28b4",
    "title": "2021-06-17 - Etterforskningen av datanettverksoperasjonen mot statsforvalterembeter henlegges",
    "authors": "",
    "file_creation_date": "2022-05-28T19:26:57Z",
    "file_modification_date": "2022-05-28T19:26:57Z",
    "file_size": 322276,
    "plain_text": "# Etterforskningen av datanettverksoperasjonen mot statsforvalterembeter henlegges\n\n**pst.no/alle-artikler/pressemeldinger/etterforskningen-av-datanettverksoperasjonen-mot-fylkesmannsembetene-er-**\navsluttet\n\n[17. JUN 2021 Dafina Shala Tema](https://pst.no/alle-artikler/?FilterByValues=1)\n\n**Sentrale funn i etterforskningen**\n\nEtterforskningen har avdekket at aktøren har lyktes med å skaffe seg administratorrettigheter som har gitt tilgang til sentraliserte datasystemer som benyttes av alle\nstatsforvalterembetene i landet.\n\nAktøren lyktes også med å overføre noe data fra embetenes systemer. Det er ikke gjort\nsikre tekniske funn av hvilke opplysninger som ble overført, men etterforskningen viser at\ndet sannsynligvis var brukernavn og passord knyttet til ansatte i ulike statsforvalterembeter.\n\nEtterforskningen har ikke avdekket forhold som tilsier at aktøren skaffet seg tilgang til\nsikkerhetsgraderte opplysninger ved de aktuelle embetene.\n\nDet at det anses som sannsynlig at det var brukernavn og passord knyttet til\nstatsforvalterembetene som ble overført, innebærer at aktøren kan ha lagt til rette for å\nsenere kunne samle inn hemmelige opplysninger fra embetene som for eksempel gjelder\n[forsvars-, sikkerhets- og beredskapsmessige forhold, jf. straffeloven § 121. Det foreligger](https://lovdata.no/lov/2005-05-20-28/%C2%A7121)\nimidlertid ikke bevismessig grunnlag for å slå fast at noen faktisk har samlet inn slike\nopplysninger. Det er heller ikke forhold som tilsier at aktøren har hentet ut personsensitive\nopplysninger knyttet til borgere. Det er ikke mulig å trekke en sikker konklusjon om motivet\nbak ugjerningen.\n\n**Hvem kan stå bak handlingen?**\n\n\n-----\n\nEtterforskningen har ikke gitt grunnlag for å konstatere hvilken aktør som står bak.\nOpplysningene om de metoder og teknikker som er blitt benyttet, sannsynliggjør imidlertid\nat det dreier seg om en avansert og profesjonell aktør.\n\nLikhet i modus, som gjelder bruk av skadevare, verktøy og digital infrastruktur, gjør at det\nanses som sannsynlig at samme aktør står bak nettverksoperasjonen mot\nstatsforvalterembetene og Visma AS.\n\nEtterforskningen har ikke avdekket tilstrekkelige opplysninger til at det kan fastslås at det\n[foreligger et fullbyrdet brudd på straffeloven § 121. Det kan dreie seg om et forsøk på](https://lovdata.no/lov/2005-05-20-28/%C2%A7121)\novertredelse av bestemmelsen eller en forberedende handling til senere overtredelse, men\ndet er ikke mulig å si noe sikkert om hva som var aktørens motiv med handlingen. Det er\nheller ikke grunnlag for å konstatere hvem som står bak handlingen. Saken henlegges\nderfor på grunn av mangel på bevis.\n\nPåtalemyndigheten i PST vurderte ut fra opplysningene at det forelå rimelig grunn til å\niverksette etterforskning for å undersøke hvorvidt det forelå overtredelse av straffeloven §\n121. Straffebudet rammer ulovlig etterretningsvirksomhet som kan skade grunnleggende\nnasjonale interesser som gjelder blant annet forsvars-, sikkerhets- og beredskapsmessige\nforhold. Embetene ivaretar en rekke sentrale oppgaver, herunder relatert til forsvars-,\nsikkerhets og beredskapsmessige forhold. Embetene forvalter også en mengde\npersonsensitivt materiale.\n\nFormålet med etterforskningen har vært å avklare om det foreligger et brudd på straffeloven\n[§ 121, hvilken aktør som eventuelt står bak, og om noen kan holdes ansvarlig i henhold til](https://lovdata.no/lov/2005-05-20-28/%C2%A7121)\nnorsk straffelov.\n\nDet norske dataprogramvareselskapet Visma AS ble også utsatt for en nettverksoperasjon\nsommeren 2018. Etterforskningen har i noen grad også rettet seg mot denne\nnettverksoperasjonen, da flere forhold tilsier at det kan være samme aktør som står bak de\nto operasjonene. Det sentrale fokuset i etterforskningen har imidlertid vært\nnettverksangrepet mot statsforvalterembetene.\n\n\n-----",
    "language": "DA",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-17 - Etterforskningen av datanettverksoperasjonen mot statsforvalterembeter henlegges.pdf"
    ],
    "report_names": [
        "2021-06-17 - Etterforskningen av datanettverksoperasjonen mot statsforvalterembeter henlegges.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535992,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653766017,
    "ts_modification_date": 1653766017,
    "files": {
        "pdf": "https://archive.orkl.eu/5004596b68c199ab20b5f0eb28b00d6c1dea28b4.pdf",
        "text": "https://archive.orkl.eu/5004596b68c199ab20b5f0eb28b00d6c1dea28b4.txt",
        "img": "https://archive.orkl.eu/5004596b68c199ab20b5f0eb28b00d6c1dea28b4.jpg"
    }
}