{
    "id": "91a8ea6e-7e91-49ef-a2ad-d2c0a2c45127",
    "created_at": "2023-01-12T15:10:54.245899Z",
    "updated_at": "2025-03-27T02:05:50.456484Z",
    "deleted_at": null,
    "sha1_hash": "a6bd314577075385df889438b885e1c486748405",
    "title": "2021-01-14 - Real-Time Phishing Kit Targets Brazilian Central Bank",
    "authors": "",
    "file_creation_date": "2022-05-28T05:11:54Z",
    "file_modification_date": "2022-05-28T05:11:54Z",
    "file_size": 1567761,
    "plain_text": "# Sucuri Blog\n\n**[blog.sucuri.net/2021/01/real-time-phishing-kit-targets-brazilian-central-bank.html](https://blog.sucuri.net/2021/01/real-time-phishing-kit-targets-brazilian-central-bank.html)**\n\nLuke Leal January 14, 2021\n\nWe recently found an interesting phishing kit on a compromised website that has QR code\ncapabilities, along with the ability to control the phishing page in real time. What our\ninvestigation revealed was that attackers were leveraging PIX, a new payment method\ncreated by the Brazilian Central Bank.\n\n## Features & Context for PIX\n\nPIX was created and introduced to replace Brazil’s old and deprecated transfer methods\nTED and DOC. PIX’s new functionalities made it significantly cheaper and faster for\ntransactions to be completed, allowing transfers to be conducted any time of the day,\nincluding weekends — functionality not available in the older, deprecated methods.\n\nMarketed as easier and faster than TED or DOC, PIX allows Brazilian users to pay for items\nby scanning a QR code. It also includes lower processing rates for merchants in comparison\nto traditional payment card methods.\n\nTo pay with PIX, one of the following must be provided: scan the recipient’s QR code or\nknow the person’s key, which can be their cell number, social security number, email or\na random key.\n\n\n-----\n\n## Phishing Kit Details\n\nThe phishing kit targets Banco Itau Empresas (business) customers that use Itaú Internet\n**_Banking._**\n\nThis is important, because it comes with increased security requirements like:\n\nDownload the application in the case of the Itaú App on the computer or Guardião\n**30 horas**\n\nUnlock / enable the application and Itoken Itaú\n\nRegister a six- to eight-digit electronic password to be used both when accessing\n**the application, website or Itaú customer service phones**\n\nWhen targeting these types of accounts, the biggest hurdle for the attacker is that a special\napplication must be installed and authenticated prior to log in.\n\nSo, how does the attacker convince the victim to enter their banking account information\noutside of the Guardião 30 horas special security application?\n\n## Phishing Lure\n\n\n-----\n\nTo convince the victim, the attacker uses a fake diagnostics page that pretends to check if\nthe victim has the Itaú app installed for secure access to their banking account. It then alerts\nthe victim that their Itaú app is out of date and must be updated to the latest version.\n\n**Google translated to English.**\nOnce the victim clicks the blue Update button, they are redirected to a second page\ndesigned to mimic the legitimate banking login page.\n\n## Attacker Real-time Control Capabilities\n\nThe most notable part of this phishing kit is that it grants the attacker real-time control over\n[the phishing page’s actions. This is accomplished through PHP sessions — whenever the](https://www.w3schools.com/php/php_sessions.asp)\nvictim is on the page, requests are submitted every five seconds.\n\n[These continuously generated requests use AJAX (asynchronous JavaScript) which allow](https://en.wikipedia.org/wiki/Ajax_(programming))\nthe phishing page to receive a response from the attacker’s phishing kit (opera.php). The\nresponse from the kit to the generated AJAX request contains JSON encoded data which\nchanges the phishing page’s actions asynchronously, meaning no page reload is necessary\nfrom the victim\n\n\n-----\n\nNaturally, there will be some time between the input of sensitive data and the phishing page\nreceiving its next action.To provide a less suspicious experience, the phishing page shows\nthe bank’s standardized loading GIF image to appear as if it’s loading something — in reality,\nit’s just waiting for the attacker to tell the phishing page what to load.\n\n**The fake “carregando” loading screen waiting for attacker’s command.**\nThis is also reflected on the attacker’s phishing panel. The text AGUARDANDO (translates\nto “waiting for”) is displayed next to the victim’s IP address whenever the fake “carregando”\nloading screen is being shown on their browser:\n\n**Panel shows a localhost IPv6 address (::1) along with a session number ([317596]).**\n\n## Phishing Behavior: Login Credentials\n\nI’ve included a GIF split screen below to demonstrate the behavior and experience for both\nthe victim and the attacker.\n\n\n-----\n\nOn the left browser, I act as a victim on the phishing page. On the right, you can see the\nattacker’s viewpoint.\n\nAs seen in this GIF, the victim first inputs their Banco Itaú login data (agencia and conta\n**_corrente), which are two separate numbers located on their banking payment card._**\n\nAfterwards, the fake “carregando” loading page (loaded in English) is shown to the victim —\nbut, on the attacker’s side they can now see the victim’s login inputs agencia and conta\n**_corrente. They then instruct the phishing page to ask the victim for the Senha Electronica_**\n(electronic password).\n\n## Phishing Behavior: Passwords & QR Codes\n\nThe Senha Electronica (electronic password) is a six-digit PIN-style password that allows\naccess, query, and transaction authentication for Itaú Electronic channels (internet, mobile\nand telephone). In addition to this password, the kit allows the attacker to request other\nsensitive information including the associated cellular phone number, iToken, owner’s\n**name — as well as a QR code.**\n\nUnfortunately, the file responsible for generating the QR code — qrcode.php — had already\nbeen deleted so we could nott fully replicate it, but Itaú’s support page provides more\ncontext about its purpose:\n\n\n-----\n\n**I already have iToken on my cell phone and I want to unlock the Itaú app on my**\n**computer. How do I do that?**\n\nFirst, download the Itaú Empresas app on your computer and choose the app on your\nphone as a way to unlock it. Then, click on “generate QRCode”.\n\nNow, open the app on your phone and, without accessing your account, click on the\n“iToken” icon. Then, go to the QRCode tab and point the phone’s camera at the code that\nwas generated on the computer. Your phone will display a six-digit code. Now just type\nthese numbers on the computer and confirm. Ready! You can now use the app on your\ncomputer.\n\nThis feature essentially allows the attacker to use any stolen credentials to request a QR\ncode from Itaú. Once the QR code is obtained, they can send it to the victim via the phishing\nkit for them to scan with their phone’s Itaú app. This generates a code that the victim types\nand sends to the attacker, who can then enter it on Itaú’s legitimate website as if they were\nthe account owner.\n\n## Phishing Panel Features\n\n\n-----\n\n**Attacker’s view of the phishing panel.**\nThe attacker’s phishing panel contains all of the options that are needed to carry out this\nphishing attack, categorizing the stolen data by IP addresses.\n\nThe attacker has the option to allow or block IPs, as well as submit commands to the\nselected victims phishing page through HTML buttons. For example, the Apelido button is\nused to request the victim’s nickname. The Inicio button starts/resets the victim’s PHP\nsession. If this isn’t button isn’t activated by the attacker, then the victim will stay at whatever\naction was last used on the phishing page — even if they refresh it.\n\n## HTML Page Reveals Payment Requests\n\nIn addition to the phishing kit, we also located a file named pagamentos.html which\ncontained some interesting information.\n\n\n-----\n\nWhen pressed, the PagSeguro button loads a new tab with a shortened URL pag.ae (not a\nmalicious website) used to send invoices to request payment from others. This invoice is\nrequesting payment of $14,997.72 Brazilian reals for online consulting and marketing\nservices, approximately $2,830.08 USD at the time of writing.\n\n\n-----\n\nI’m not sure if the attacker tricks the phishing victim into paying this invoice or if the attacker\nlogs into the victim’s banking account and pays it that way. There wasn’t any code\nreferencing this file, so it’s hard to say exactly how it was leveraged.\n\nWhat is certain, however, is that these types of phishing campaigns can have serious\nimplications for victims — and website owners. Phishing is typically challenging to detect\nbecause malicious pages are often hidden deep within file directories. Unless you happen to\nidentify the exact URL of the malicious page, it can be tough to identify if your site was\nhacked.\n\nOne trick to detecting malicious behavior is to use Google Search Console, which may notify\nyou about phishing and other security issues. File integrity monitoring and server-side\nscanners can also help identify any indicators of compromise in your website’s environment.\n\nIf you think your website is hosting malicious content or phishing pages and you need a hand\n[tackling the infection, we can help.](https://sucuri.net/website-malware-removal/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-14 - Real-Time Phishing Kit Targets Brazilian Central Bank.pdf"
    ],
    "report_names": [
        "2021-01-14 - Real-Time Phishing Kit Targets Brazilian Central Bank.pdf"
    ],
    "threat_actors": [
        {
            "id": "8a3bd03a-f69b-455b-b88b-3842a3528bfd",
            "created_at": "2022-10-25T16:07:24.178007Z",
            "updated_at": "2025-03-27T02:02:10.132529Z",
            "deleted_at": null,
            "main_name": "SharpPanda",
            "aliases": [
                "Sharp Dragon",
                "SharpPanda"
            ],
            "source_name": "ETDA:SharpPanda",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "RoyalRoad",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536254,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653714714,
    "ts_modification_date": 1653714714,
    "files": {
        "pdf": "https://archive.orkl.eu/a6bd314577075385df889438b885e1c486748405.pdf",
        "text": "https://archive.orkl.eu/a6bd314577075385df889438b885e1c486748405.txt",
        "img": "https://archive.orkl.eu/a6bd314577075385df889438b885e1c486748405.jpg"
    }
}