{
    "id": "91b04251-44ac-4437-b97f-1081691475c7",
    "created_at": "2023-01-12T15:01:37.246385Z",
    "updated_at": "2025-03-27T02:12:03.976167Z",
    "deleted_at": null,
    "sha1_hash": "033d6c97f0f7353fe91aacd455fecafb09536478",
    "title": "2021-03-02 - Operation Exchange Marauder- Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities",
    "authors": "",
    "file_creation_date": "2022-05-28T02:14:20Z",
    "file_modification_date": "2022-05-28T02:14:20Z",
    "file_size": 822850,
    "plain_text": "# Operation Exchange Marauder: Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities\n\n**[volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/](https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/)**\n\nMarch 2, 2021\n\nby Josh Grunzweig, Matthew Meltzer, Sean Koessel, Steven Adair, Thomas Lancaster\n\n**[UPDATE]** **March 8, 2021 – Since original publication of this blog, Volexity has now observed**\n**that cyber espionage operations using the SSRF vulnerability CVE-2021-26855 started**\n**occurring on January 3, 2021, three days earlier than initially posted.**\n\n**_Volexity is seeing active in-the-wild exploitation of multiple Microsoft Exchange_**\n**_vulnerabilities used to steal e-mail and compromise networks. These attacks appear to have_**\n**_started as early as January 6, 2021._**\n\nIn January 2021, through its Network Security Monitoring service, Volexity detected anomalous\nactivity from two of its customers' Microsoft Exchange servers. Volexity identified a large amount of\ndata being sent to IP addresses it believed were not tied to legitimate users. A closer inspection of\nthe IIS logs from the Exchange servers revealed rather alarming results. The logs showed inbound\nPOST requests to valid files associated with images, JavaScript, cascading style sheets, and fonts\nused by Outlook Web Access (OWA). It was initially suspected the servers might be backdoored\nand that webshells were being executed through a malicious HTTP module or ISAPI filter. As a\nresult, Volexity started its incident response efforts and acquired system memory (RAM) and other\ndisk artifacts to initiate a forensics investigation. This investigation revealed that the servers were\nnot backdoored and uncovered a zero-day exploit being used in the wild.\n\n\n-----\n\nThrough its analysis of system memory, Volexity determined the attacker was exploiting a zero-day\n[server-side request forgery (SSRF) vulnerability in Microsoft Exchange (CVE-2021-26855). The](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-26855)\nattacker was using the vulnerability to steal the full contents of several user mailboxes. This\nvulnerability is remotely exploitable and does not require authentication of any kind, nor does it\nrequire any special knowledge or access to a target environment. The attacker only needs to know\nthe server running Exchange and the account from which they want to extract e-mail.\n\nAdditionally, Volexity is providing alternative mitigations that may be used by defenders to assist in\nsecuring their Microsoft Exchange instances. This vulnerability has been confirmed to exist within\nthe latest version of Exchange 2016 on a fully patched Windows Server 2016 server. Volexity also\nconfirmed the vulnerability exists in Exchange 2019 but has not tested against a fully patched\nversion, although it believes they are vulnerable. It should also be noted that is vulnerability does\nnot appear to impact Office 365.\n\nFollowing the discovery of CVE-2021-26855, Volexity continued to monitor the threat actor and work\nwith additional impacted organizations. During the course of multiple incident response efforts,\nVolexity identified that the attacker had managed to chain the SSRF vulnerability with another that\n[allows remote code execution (RCE) on the targeted Exchange servers (CVE-2021-27065). In all](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-27065)\ncases of RCE, Volexity has observed the attacker writing webshells (ASPX files) to disk and\nconducting further operations to dump credentials, add user accounts, steal copies of the Active\nDirectory database (NTDS.DIT), and move laterally to other systems and environments.\nA patch addressing both of these vulnerabilities is expected imminently.\n\n## Authentication Bypass Vulnerability\n\nWhile Volexity cannot currently provide full technical details of the exploit and will not be sharing\nproof-of-concept exploit code, it is still possible to provide useful details surrounding the\nvulnerability’s exploitation and possible mitigations. Volexity observed the attacker focused on\ngetting a list of e-mails from a targeted mailbox and downloading them. Based on these\nobservations, it was possible for Volexity to further improve and automate attacks in a lab\nenvironment.\n\nThere are two methods to download e-mail with this vulnerability, depending on the way that\nMicrosoft Exchange has been configured. In corporate environments it is common that multiple\nExchange servers will be set up. This is often done for load balancing, availability, and resource\nsplitting purposes. While it is less common, it is also possible to run all Exchange functionality on a\nsingle server.\n\nIn the case where a single server is being used to provide the Exchange service, Volexity believes\nthe attacker must know the targeted user’s domain security identifier (SID) in order to access their\nmailbox. This is a static value and is not considered something secret. However, it is not something\nthat is trivially obtained by someone without access to systems within a specific organization.\n\nIn a multiple server configuration, where the servers are configured in a Database Availability Group\n(DAG), Volexity has proven an attacker does not need to acquire a user’s domain SID to access\ntheir mailbox. The only information required is the e-mail address of the user they wish to target.\n\n\n-----\n\nIn order to exploit this vulnerability, the attacker must also identify the fully qualified domain name\n(FQDN) of the internal Exchange server(s). Using a series of requests, Volexity determined that this\ninformation could be extracted by an attacker with only initial knowledge of the external IP address\nor domain name of a publicly accessible Exchange server. After this information is obtained, the\nattacker can generate and send a specially crafted HTTP POST request to the Exchange server\nwith an XML SOAP payload to the Exchange Web Services (EWS) API endpoint. This SOAP\nrequest, using specially crafted cookies, bypasses authentication and ultimately executes the\nunderlying request specified in the XML, allowing an attacker to perform any operation on the users’\nmailbox.\n\nVolexity has observed this attack conducted via OWA. The exploit involved specially crafted POST\nrequests being sent to a valid static resources that does not require authentication. Specifically,\nVolexity has observed POST requests targeting files found on the following web directory:\n```\n/owa/auth/Current/themes/resources/\n\n```\nThis folder contains image, font, and cascading style sheet files. Using any of these files for the\nPOST request appears to allow the exploit to proceed. If a file such as /owa/auth/logon.aspx or\nsimply a folder such as /owa/auth/ were to be used, the exploit will not work.\n\n## Authentication Bypass Exploit Demonstration\n\nThe video below demonstrates the vulnerability being exploited in a lab environment:\n\n_Figure 1. Video demonstrating the authentication bypass vulnerability at work in a lab environment._\n\nIn the video demonstration, the following SOAP XML payload is used to retrieve the identifiers of\neach email in Alice’s inbox:\n\n\n-----\n\n_Figure 2. XML payload used to pull email identifiers from Alice s inbox without authentication._\n\nThen, the following payload is used to pull down each individual email:\n\n_Figure 3. Payload used to retrieve individual emails without authentication._\n\n## Remote Code Execution Vulnerability\n\nAs mentioned in the introduction to this post, a remote code execution (RCE) exploit was also\nobserved in use against multiple organizations. This RCE appears to reside within the use of the\n[Set-OabVirtualDirectory ExchangePowerShell cmdlet. Evidence of this activity can be seen in](https://docs.microsoft.com/en-us/powershell/module/exchange/set-oabvirtualdirectory?view=exchange-ps)\nExchange's ECP Server logs. A snippet with the exploit removed is shown below.\n\n;'S:CMD=Set-OabVirtualDirectory.ExternalUrl=''<removed>\"\n\nIIS logs for the server would show an entry similar to what is shown below; however, this URL path\nmay be used for items not associated with this exploit or activity.\n\n/ecp/DDI/DDIService.svc/SetObject\n\nIn this case, this simple backdoor, which Volexity has named SIMPLESEESHARP, was then used to\ndrop a larger webshell, named SPORTSBALL, on affected systems. Further, Volexity has observed\nnumerous other webshells in use, such as China Chopper variants and ASPXSPY.\n\n## POST Exploitation Activity\n\nWhile the attackers appear to have initially flown largely under the radar by simply stealing e-mails,\nthey recently pivoted to launching exploits to gain a foothold. From Volexity's perspective, this\nexploitation appears to involve multiple operators using a wide variety of tools and methods for\ndumping credentials, moving laterally, and further backdooring systems. Below is a summary of the\ndifferent methods and tools Volexity has observed thus far:\n\n\n-----\n\nMethod/Tool Purpose\n\n\nrundll32\nC:\\windows\\system32\\comsvcs.dll\nMiniDump lsass.dmp\n\n\nDump process memory of lsass.exe to obtain credentials\n\n\nPsExec Windows Sysinternals tool used to execute commands on\nremote systems\n\nProcDump Windows Sysinternals tool to dump process memory\n\nWinRar Command Line Utility Used archive data exfiltration\n\nWebshells (ASPX and PHP) Used to allow command execution or network proxying via\nexternal websites\n\nDomain Account User Addition Leveraged by attackers to add their own user account and\ngrant it privileges to provide access in the future\n\n## Indicators of Compromise\n\n### Authentication Bypass Indicators\n\nIn Volexity’s observations of authentication bypass attacks being performed in the wild, files such as\nthe following were the targets of HTTP POST requests:\n\n/owa/auth/Current/themes/resources/logon.css\n\n/owa/auth/Current/themes/resources/owafont_ja.css\n\n/owa/auth/Current/themes/resources/lgnbotl.gif\n\n/owa/auth/Current/themes/resources/owafont_ko.css\n\n/owa/auth/Current/themes/resources/SegoeUI-SemiBold.eot\n\n/owa/auth/Current/themes/resources/SegoeUI-SemiLight.ttf\n\n/owa/auth/Current/themes/resources/lgnbotl.gif\n\n### Remote Code Execution Indicators\n\nTo identify possible historical activity related to the remote code execution exploit, organizations can\nsearch their ECP Server logs for the following string (or similar).\n```\n   S:CMD=Set-OabVirtualDirectory.ExternalUrl='\n\n```\nECP Server logs are typically located at <exchange install path>\\Logging\\ECP\\Server\\\n\n### Webshell Indicators\n\nFurther, Volexity has observed indicators that are consistent with web server breaches that can be\nused to look on disk and in web logs for access to or the presence of ASPX files at the following\npaths:\n\n\n-----\n\n\\inetpub\\wwwroot\\aspnet_client\\ (any .aspx file under this folder or sub folders)\n\n\\<exchange install path>\\FrontEnd\\HttpProxy\\ecp\\auth\\ (any file besides TimeoutLogoff.aspx)\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\ (any file or modified file that is not\npart of a standard install)\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\Current\\<any aspx file in this folder or\nsubfolders>\n\\<exchange install path>\\FrontEnd\\HttpProxy\\owa\\auth\\<folder with version number>\\<any\naspx file in this folder or subfolders>\n\nIt should be noted that Volexity has observed the attacker adding webshell code to otherwise\nlegitimate ASPX files in an attempt to blend in and hide from defenders.\n\n### Web Log User-Agents\n\nThere are also a handful of User-Agent that may be useful for responders to look for when\nexamining their web logs. These are not necessarily indicative of compromise, but should be used\nto determine if further investigation.\n\nVolexity observed the following non-standard User-Agents associated with POST requests to the\nfiles found under folders within /owa/auth/Current.\n\nDuckDuckBot/1.0;+(+http://duckduckgo.com/duckduckbot.html)\n\nfacebookexternalhit/1.1+(+http://www.facebook.com/externalhit_uatext.php)\n\nMozilla/5.0+(compatible;+Baiduspider/2.0;++http://www.baidu.com/search/spider.html)\n\nMozilla/5.0+(compatible;+Bingbot/2.0;++http://www.bing.com/bingbot.htm)\n\nMozilla/5.0+(compatible;+Googlebot/2.1;++http://www.google.com/bot.html\n\nMozilla/5.0+(compatible;+Konqueror/3.5;+Linux)+KHTML/3.5.5+(like+Gecko)+(ExabotThumbnails)\n\nMozilla/5.0+(compatible;+Yahoo!+Slurp;+http://help.yahoo.com/help/us/ysearch/slurp)\n\nMozilla/5.0+(compatible;+YandexBot/3.0;++http://yandex.com/bots)\n\nMozilla/5.0+(X11;+Linux+x86_64)+AppleWebKit/537.36+\n(KHTML,+like+Gecko)+Chrome/51.0.2704.103+Safari/537.36\n\nVolexity observed the following User-Agents in conjunction with exploitation to /ecp/ URLs.\n\nExchangeServicesClient/0.0.0.0\n\npython-requests/2.19.1\n\npython-requests/2.25.1\n\nFurther other notable User-Agent entries tied to tools used for post-exploitation access to\nwebshells.\n\nantSword/v2.1\n\nGooglebot/2.1+(+http://www.googlebot.com/bot.html)\n\nMozilla/5.0+(compatible;+Baiduspider/2.0;++http://www.baidu.com/search/spider.html)\n\n\n-----\n\n### Additional Auth Bypass and RCE Indicators\n\nTo identify possible historical activity relating to the authentication bypass and RCE activity, IIS logs\nfrom Exchange servers can be examined for the following:\n\nPOST /owa/auth/Current/\n\nPOST /ecp/default.flt\n\nPOST /ecp/main.css\n\nPOST /ecp/<single char>.js\n\nNote that the presence of log entries with POST requests under these directories does not\nguarantee an Exchange server has been exploited. However, its presence should warrant further\ninvestigation.\n\nYara signatures for non trivial webshells deployed by attackers following successful exploitation may\nbe found in the Appendix of this post.\n\n### Network Indicators - Attacker IPs\n\nVolexity has observed numerous IP addresses leveraged by the attackers to exploit the\nvulnerabilities described in this blog. These IP addresses are tied to VPS servers and VPN\nservices. Volexity has also observed the attackers using Tor, but has made attempts to remove\nthose entries from the list below.\n\n103.77.192.219\n\n104.140.114.110\n\n104.250.191.110\n\n108.61.246.56\n\n149.28.14.163\n\n157.230.221.198\n\n167.99.168.251\n\n185.250.151.72\n\n192.81.208.169\n\n203.160.69.66\n\n211.56.98.146\n\n5.254.43.18\n\n80.92.205.81\n\n## Conclusion\n\nHighly skilled attackers continue to innovate in order to bypass defenses and gain access to their\ntargets, all in support of their mission and goals. These particular vulnerabilities in Microsoft\nExchange are no exception. These attackers are conducting novel attacks to bypass authentication,\nincluding two-factor authentication, allowing them to access e-mail accounts of interest within\ntargeted organizations and remotely execute code on vulnerable Microsoft Exchange servers.\n\n\n-----\n\nDue to the ongoing observed exploitation of the discussed vulnerabilities, Volexity urges\norganizations to immediately apply the available patches or temporarily disabling external access to\nMicrosoft Exchange until a patch can be applied.\n\n## Need Assistance?\n\nIf you have concerns that your servers or networks may have been compromised from this\n[vulnerability, please reach out to the Volexity team and we can help you make a determination if](https://www.volexity.com/company/contact/)\nfurther investigation is warranted.\n\n## Appendix\n\nrule webshell_aspx_simpleseesharp : Webshell Unclassified\n{\n\nmeta:\n\n[author= \"[email protected]\"](https://www.volexity.com/cdn-cgi/l/email-protection)\ndate= \"2021-03-01\"\ndescription= \"A simple ASPX Webshell that allows an attacker to write further files to disk.\"\nhash= \"893cd3583b49cb706b3e55ecb2ed0757b977a21f5c72e041392d1256f31166e2\"\n\nstrings:\n\n$header= \"<%@ Page Language=\\\"C#\\\" %>\"\n$body= \"<% HttpPostedFile thisFile = Request.Files[0];thisFile.SaveAs(Path.Combine\"\n\ncondition:\n\n$header at 0 and\n$body and\nfilesize < 1KB\n\n}\n\n\n-----\n\nrule webshell_aspx_reGeorgTunnel : Webshell Commodity\n{\nmeta:\n[author= \"[email protected]\"](https://www.volexity.com/cdn-cgi/l/email-protection)\ndate= \"2021-03-01\"\ndescription= \"variation on reGeorgtunnel\"\nhash= \"406b680edc9a1bb0e2c7c451c56904857848b5f15570401450b73b232ff38928\"\nreference= \"https://github.com/sensepost/reGeorg/blob/master/tunnel.aspx\"\nstrings:\n$s1= \"System.Net.Sockets\"\n$s2=\n\"System.Text.Encoding.Default.GetString(Convert.FromBase64String(StrTr(Request.Headers.Get\"\n$t1 = \".Split('|')\"\n$t2= \"Request.Headers.Get\"\n$t3= \".Substring(\"\n$t4= \"new Socket(\"\n$t5= \"IPAddress ip;\"\ncondition:\nall of ($s*) or\nall of ($t*)\n}\n\n\n-----\n\nrule webshell_aspx_sportsball : Webshell\n{\n\nmeta:\n\n[author= \"[email protected]\"](https://www.volexity.com/cdn-cgi/l/email-protection)\ndate= \"2021-03-01\"\ndescription= \"The SPORTSBALL webshell allows attackers to upload files or execute\ncommands on the system.\"\nhash= \"2fa06333188795110bba14a482020699a96f76fb1ceb80cbfa2df9d3008b5b0a\"\n\nstrings:\n\n$uniq1= \"HttpCookie newcook = new HttpCookie(\\\"fqrspt\\\",\nHttpContext.Current.Request.Form\"\n$uniq2= \"ZN2aDAB4rXsszEvCLrzgcvQ4oi5J1TuiRULlQbYwldE=\"\n\n$var1= \"Result.InnerText = string.Empty;\"\n$var2= \"newcook.Expires = DateTime.Now.AddDays(\"\n$var3= \"System.Diagnostics.Process process = new System.Diagnostics.Process()\"\n$var4= \"process.StandardInput.WriteLine(HttpContext.Current.Request.Form[\\\"\"\n$var5= \"else if (!string.IsNullOrEmpty(HttpContext.Current.Request.Form[\\\"\"\n$var6= \"<input type=\\\"submit\\\" value=\\\"Upload\\\" />\"\n\ncondition:\n\nany of ($uniq*) or\nall of ($var*)\n\n}\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-02 - Operation Exchange Marauder- Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities.pdf"
    ],
    "report_names": [
        "2021-03-02 - Operation Exchange Marauder- Active Exploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities.pdf"
    ],
    "threat_actors": [
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535697,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653704060,
    "ts_modification_date": 1653704060,
    "files": {
        "pdf": "https://archive.orkl.eu/033d6c97f0f7353fe91aacd455fecafb09536478.pdf",
        "text": "https://archive.orkl.eu/033d6c97f0f7353fe91aacd455fecafb09536478.txt",
        "img": "https://archive.orkl.eu/033d6c97f0f7353fe91aacd455fecafb09536478.jpg"
    }
}