{
    "id": "91d9bc4f-bc52-4eaf-807d-909f10a7c12d",
    "created_at": "2023-01-12T15:00:39.128934Z",
    "updated_at": "2025-03-27T02:05:44.698608Z",
    "deleted_at": null,
    "sha1_hash": "707f81750c856ee92f6e8f0941d56a7069a9b289",
    "title": "2020-08-21 - Wireshark Tutorial- Decrypting HTTPS Traffic",
    "authors": "",
    "file_creation_date": "2022-05-28T00:21:34Z",
    "file_modification_date": "2022-05-28T00:21:34Z",
    "file_size": 15256969,
    "plain_text": "# Wireshark Tutorial: Decrypting HTTPS Traffic\n\n**[unit42.paloaltonetworks.com/wireshark-tutorial-decrypting-https-traffic/](https://unit42.paloaltonetworks.com/wireshark-tutorial-decrypting-https-traffic/)**\n\nBrad Duncan August 21, 2020\n\nBy [Brad Duncan](https://unit42.paloaltonetworks.com/author/bduncan/)\n\nAugust 21, 2020 at 6:00 AM\n\n[Category: Tutorial,](https://unit42.paloaltonetworks.com/category/tutorial/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Wireshark,](https://unit42.paloaltonetworks.com/tag/wireshark/) [Wireshark Tutorial](https://unit42.paloaltonetworks.com/tag/wireshark-tutorial/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/wireshark-tutorial-decrypting-https-traffic/)\n\n## Executive Summary\n\nThis tutorial is designed for security professionals who investigate suspicious network activity\nand review packet captures (pcaps) of the traffic. The instructions assume you are familiar\nwith [Wireshark, and it focuses on Wireshark version 3.x.](https://www.wireshark.org/)\n\nWhen reviewing suspicious network activity, we often run across encrypted traffic. Why?\nBecause most websites use the Hypertext Transfer Protocol Secure (HTTPS) protocol. But\nlike most websites, various types of malware also use HTTPS. When reviewing pcaps from\nmalware activity, it’s very helpful to know what’s contained within post-infection traffic.\n\n\n-----\n\nThis Wireshark tutorial describes how to decrypt HTTPS traffic from a pcap in Wireshark.\nDecryption is possible with a text-based log containing encryption key data captured when\nthe pcap was originally recorded. With this key log file, we can decrypt HTTPS activity in a\npcap and review its contents.\n\n[Today, we will examine HTTPS activity from a Dridex malware infection.](https://en.wikipedia.org/wiki/Dridex)\n\nNote: Our instructions assume you have customized your Wireshark column display as\n[previously described in “Customizing Wireshark – Changing Your Column Display.”.](https://unit42.paloaltonetworks.com/unit42-customizing-wireshark-changing-column-display/)\n\nHere is a Github repository with a ZIP archive containing the pcap and a key log file used for\nthis tutorial.\n\n**Warning: The pcap used for this tutorial contains Windows-based malware. There is a risk of**\ninfection if using a Windows computer. We recommend you review this pcap in a nonWindows environment like BSD, Linux or macOS if at all possible.\n\n## The Context Behind Encrypted Traffic\n\nIn the mid- to late-1990s, the most common protocol used by websites was Hypertext\nTransfer Protocol (HTTP), which generated unencrypted web traffic. However, as security\nbecame an increasing concern, websites started switching to HTTPS, and now we rarely see\nHTTP traffic from web browsing.\n\nHTTPS is essentially an encrypted communications tunnel containing HTTP traffic. These\ntunnels first used Secure Sockets Layer (SSL) as an encryption protocol. Today most HTTPS\ntraffic uses Transport Layer Security (TLS).\n\n## HTTPS Web Traffic\n\nHTTPS traffic often reveals a domain name. For example, when viewing\nhttps://www.wireshark.org in a web browser, a pcap would show www.wireshark.org as the\n[server name for this traffic when viewed in a customized Wireshark column display.](https://unit42.paloaltonetworks.com/unit42-customizing-wireshark-changing-column-display/)\nUnfortunately, we don’t know other details like the actual URL or data returned from the\nserver. Following the Transmission Control Protocol (TCP) stream from a pcap will not reveal\nthe content of this traffic because it is encrypted.\n\n\n-----\n\nFigure 1. Traffic from HTTPS traffic to www.wireshark.org.\n\n\n-----\n\nFigure 2. TCP stream of HTTPS traffic to and from server at www.wireshark.org.\n\n## Encryption Key Log File\n\nAn encryption key log is a text file. An example is shown in Figure 3.\n\nFigure 3. The key log file used in this tutorial.\nThese logs are created using a Man in the Middle (MitM) technique when the pcap is\noriginally recorded. If no such file was created when the pcap was recorded, you cannot\ndecrypt HTTPS traffic in that pcap.\n\n\n-----\n\n## Example of a Pcap With a Key Log File\n\nA password-protected ZIP archive containing the pcap and its key log file is available at this\nGithub repository. Go to the Github page, click on the ZIP archive entry, then download it as\nshown in Figures 4 and 5. Of note, the pcap contained in this ZIP archive provides access to\na Windows-based malware sample when decrypted with the key log. As always, we\nrecommend you exercise caution and follow steps from this tutorial in a non-Windows\nenvironment.\n\nFigure 4. Github repository with link to ZIP archive used for this tutorial.\n\n\n-----\n\nFigure 5. Downloading the ZIP archive for this tutorial.\nUse infected as the password to extract the pcap and key log file from the ZIP archive. This\nwill provide two files as shown in Figure 6:\n\nWireshark-tutorial-KeysLogFile.txt\nWireshark-tutorial-on-decrypting-HTTPS-SSL-TLS-traffic.pcap\n\nFigure 6. Key log file and pcap for this tutorial.\n\n\n-----\n\n## HTTPS Traffic Without the Key Log File\n\nOpen Wireshark-tutorial-on-decrypting-HTTPS-SSL-TLS-traffic.pcap in Wireshark. Use a\n[basic web filter as described in this previous tutorial about Wireshark filters. Our basic filter](https://unit42.paloaltonetworks.com/using-wireshark-display-filter-expressions/)\nfor Wireshark 3.x is:\n\n(http.request or tls.handshake.type eq 1) and !(ssdp)\n\nThis pcap is from a Dridex malware infection on a Windows 10 host. All web traffic, including\nthe infection activity, is HTTPS. Without the key log file, we cannot see any details of the\ntraffic, just the IP addresses, TCP ports and domain names, as shown in Figure 7.\n\nFigure 7. Viewing the pcap in Wireshark using the basic web filter without any decryption.\n\n## Loading the Key Log File\n\nOpen Wireshark-tutorial-on-decrypting-HTTPS-SSL-TLS-traffic.pcap in Wireshark. Then\nuse the menu path Edit --> Preferences to bring up the Preferences Menu, as shown in\nFigure 8.\n\n\n-----\n\nFigure 8. Getting to the Preferences Menu in Wireshark.\nOn the left side of the Preferences Menu, click on Protocols, as shown in Figure 9.\n\nFigure 9. Selecting Protocols in the Preferences Menu.\nIf you are using Wireshark version 2.x, scroll down until you find SSL and select it. If you are\nusing Wireshark version 3.x, scroll down to TLS and select it. Once you have selected SSL\nor TLS, you should see a line for (Pre)-Master-Secret log filename. Click on the “Browse”\n\n\n-----\n\nbutton and select our key log file named Wireshark-tutorial-KeysLogFile.txt, as shown in\nFigures 10, 11 and 12.\n\nFigure 10. Finding the (Pre)-Master-Secret log filename field under TLS in Wireshark 3.x.\n\nFigure 11. Selecting our key log file for this tutorial.\n\n\n-----\n\nFigure 12. Once the file has been selected as the (Pre)-Master-Secret log filename, click\n“OK.”\n\n## HTTPS Traffic With the Key Log File\n\nOnce you have clicked “OK,” when using the basic filter, your Wireshark column display will\nlist the decrypted HTTP requests under each of the HTTPS lines, as shown in Figure 13.\n\nFigure 13. HTTPS decryption in Wireshark after using the key log file.\nIn this pcap, we now see HTTP requests to microsoft.com and skype.com domains\npreviously hidden in the HTTPS traffic. We also find the following traffic caused by the Dridex\ninfection:\n\nfoodsgoodforliver[.]com - GET /invest 20.dll\n\n\n-----\n\n105711[.]com - POST /docs.php\n\nThe GET request to foodsgoodforliver[.]com returned a DLL file for Dridex. The POST\nrequests to 105711[.]com are command and control (C2) traffic from the Dridex-infected\nWindows host.\n\nWe can review the traffic by following HTTP streams. Right-click on the line to select it, then\nleft-click to bring up a menu to follow the HTTP stream. Figures 14 and 15 show following the\nHTTP stream for the HTTP GET request to foodsgoodforliver[.]com.\n\nFigure 14. Following HTTP stream for the GET request to foodsgoodforliver[.]com.\n\n\n-----\n\nFigure 15. HTTP stream indicates an EXE or DLL returned from the server.\nSince we have the key log file for this traffic, we can now export this malware from the pcap.\nUse the menu path File --> Export Objects --> HTTP to export this file from the pcap, as\nshown in Figure 16.\n\nFigure 16. Exporting the malware binary returned from foodsgoodforliver[.]com.If you are in a\nBSD, Linux or macOS environment, open a terminal window and use the file command to\nconfirm this is a DLL file. Then use shasum -a 256 to get the SHA256 hash of the file, as\n\n\n-----\n\nshown in Figure 17.\n\nFigure 17. Getting the SHA256 hash of this malware in a Linux environment.\n\n**The SHA256 hash of this malware is:**\n\n31cf42b2a7c5c558f44cfc67684cc344c17d4946d3a1e0b2cecb8eb58173cb2f\n\nIf you [search for this hash online, you should find results from at least two publicly available](https://www.google.com/search?q=31cf42b2a7c5c558f44cfc67684cc344c17d4946d3a1e0b2cecb8eb58173cb2f)\nonline sandbox environments.\n\nFinally, we can review C2 traffic from this Dridex infection. Use your basic web filter, then\nfollow an HTTP stream from one of the POST requests to 105711[.]com. An example from\none of the HTTP streams is shown in Figure 18.\n\n\n-----\n\nFigure 18. HTTP stream from one of the Dridex C2 POST requests.\n\n## Conclusion\n\nThis tutorial reviewed how to decrypt HTTPS traffic in a pcap with Wireshark using a key log\ntext file. Without a key log file created when the pcap was originally recorded, you cannot\ndecrypt HTTPS traffic from that pcap in Wireshark.\n\nFor more help with Wireshark, see our previous tutorials:\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-08-21 - Wireshark Tutorial- Decrypting HTTPS Traffic.pdf"
    ],
    "report_names": [
        "2020-08-21 - Wireshark Tutorial- Decrypting HTTPS Traffic.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535639,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653697294,
    "ts_modification_date": 1653697294,
    "files": {
        "pdf": "https://archive.orkl.eu/707f81750c856ee92f6e8f0941d56a7069a9b289.pdf",
        "text": "https://archive.orkl.eu/707f81750c856ee92f6e8f0941d56a7069a9b289.txt",
        "img": "https://archive.orkl.eu/707f81750c856ee92f6e8f0941d56a7069a9b289.jpg"
    }
}