{
    "id": "920b324d-1857-4016-ae07-99cc1209ce5a",
    "created_at": "2023-01-12T15:03:01.759667Z",
    "updated_at": "2025-03-27T02:05:30.282861Z",
    "deleted_at": null,
    "sha1_hash": "2b7d73d8b68782e1a6e66222524a5eb95e15937b",
    "title": "2022-01-25 - TianySpy Malware Uses Smishing Disguised as Message From Telco",
    "authors": "",
    "file_creation_date": "2022-05-28T16:01:55Z",
    "file_modification_date": "2022-05-28T16:01:55Z",
    "file_size": 963560,
    "plain_text": "# TianySpy Malware Uses Smishing Disguised as Message From Telco\n\n**[trendmicro.com/en_us/research/22/a/tianyspy-malware-uses-smishing-disguised-as-message-from-telco.html](https://www.trendmicro.com/en_us/research/22/a/tianyspy-malware-uses-smishing-disguised-as-message-from-telco.html)**\n\nJanuary 25, 2022\n\nMobile\n\nTrend Micro confirmed a new mobile malware infection chain targeting both Android and iPhone devices.\nThe malware might have been designed to steal credentials associated with membership websites of major\nJapanese telecommunication services.\n\nBy: Trend Micro January 25, 2022 Read time: ( words)\n\n_[This blog was first published here: https://blog.trendmicro.co.jp/archives/29322](https://blog.trendmicro.co.jp/archives/29322)_\n\nIt has been some time since SMS or text messaging has become a means to spread mobile malware. In\nSeptember 2021, Trend Micro confirmed a new mobile malware infection chain targeting both Android and\niPhone devices. The chain is triggered by a smishing message that appears to be sent from a\ntelecommunications company. It is surmised that the malware might have been designed to steal\ncredentials associated with membership websites of major Japanese telecommunication services.\n\nThis is the first case confirmed by Trend Micro wherein an iPhone device was the target of a malware\ninfection triggered by smishing, as Android devices have always been the main target in all other cases.\n[This is a noteworthy cyberthreat, considering that the Japan Cybercrime Control Center (JC3) also](https://www.jc3.or.jp/)\n[published a similar alert.](https://www.jc3.or.jp/threats/examples/article-409.html)\n\nFigure 1. Examples of\n\nsmishing message confirmed to be part of a TianySpy campaign\nInfection chain\n\nThis campaign was confirmed as active between September 30 and October 12, 2021. The smishing\nmessage, which was disguised as coming from a telecommunications company, contains a link to a\nmalicious website. In turn, the website contains instructions to install what appears to be security software\nbut is actually malware. Trend Micro confirmed two patterns of the message spread in this campaign:\n\nIn the first pattern, the SMS is sent from a malicious SMS delivery service:\n\n【●●●】お客様がご利用の●アカウントが不正利用の可能性があります。ご確認が必要です。\n\n(In English, this reads as follows: “Unauthorized access to your account detected. Please\nconfirm.”)\n\n\n-----\n\nIn the second pattern, the SMS is potentially sent from devices infected by\n“AndroidOS_KeepSpy.GCL,” an Android malware:\n\n  - ●お客様センターです。ご利用料金のお支払い確認が取れておりません。ご確認が必要です。\n\n(In English, this reads as follows: “Your payment could not be confirmed. Please confirm.”)\n\nIn the first pattern, TianySpy was confirmed to be infected in cases where users accessed the malicious link\nfrom both Android and iPhone devices. In the second pattern, users of Android devices were lured into\naccessing the malicious link, resulting in their devices being infected with KeepSpy. In the same pattern,\nusers of iPhones who accessed the malicious link were infected with the version of TianySpy for their\ndevice.\n\nFigure 2. Malicious site accessed\n\nfrom an Android device\n\nFigure 3.\n\nMalicious site accessed from an iPhone device\nThe configuration profile in an iPhone is a function that can be used to define configuration for various\nfunctions of the device, including the Wi-Fi setting. In this campaign, users were lured into downloading and\ninstalling a malicious configuration profile upon accessing a link in a smishing message sent to their\niPhone. Research from Trend Micro has confirmed that device information, such as the Unique Device\nIdentifier (UDID), is sent to the attacker’s site when the malicious configuration profile is installed.\n\nThe sent UDID is then used in a provisioning profile, which has TianySpy built in. This enables TianySpy to\ninfect an iPhone through Ad Hoc distribution, which is usually used to deploy an application in its\ndevelopment stage.\n\n\n-----\n\nExample of a malicious configuration profile\n\nExample of data transmitted upon installation of configuration profile\n\nmalicious application (.ipa) and provisioning profile\n\n\nFigure 4.\n\nFigure 5.\n\nFigure 6. Example of\n\nFigure 7.\n\n\nContents of embedded mobile provision (UUID stolen from iPhone can be seen as installable device)\nMalware analysis\n\n\n-----\n\nFrom the results of our analysis of TianySpy (Android version), we determined that the malware has the\nfollowing functions:\n\nReading Wi-Fi settings\nFalsifying a legitimate telecommunication company’s site, specifically its usage statement via\nWebView (via Application Web display system for Android)\nInformation stealing through a malicious JavaScript\nSending stolen data by mail\nDisplaying a malicious or fake site\n\nTianySpy first checks Wi-Fi settings and then displays an alert message inducing the user to turn off the\nWi-Fi, if enabled. If the Wi-Fi is disabled, an authentication page (authentication is required prior to\ndisplaying the usage statement page) is shown and credential information and authorized cookies are sent\nto the attacker’s email address. During this process, the Wi-Fi is likely disabled, as the attacker wants to\ncollect credentials over a carrier network.\n\nFigure 8.\n\nDecompiled codes from TianySpy Android version (left) and an alert message shown when Wi-Fi is\nenabled (right)\n\n\n-----\n\nFigure 9. Decompiled codes from TianySpy Android version (encrypted attacker’s email address)\n\nFigure 10. Decrypted attacker’s email\n\naddress\nStop.html, which is enclosed in TianySpy, is displayed upon accessing a legitimate usage statement page.\nStop.html contains contents that make it seem that the site is under maintenance or security enhancement.\nWe believe that the reason behind this is that the attacker wishes to hide the usage statement page.\n\nFigure 11.\n\nStop.html enclosed in the resource of TianySpy Android version\n\n\n-----\n\nFigure 12. Contents of stop.html\n\nThe iPhone version of TianySpy shows many similarities with its Android version, such as holding\nencrypted strings that contain the URL of the website’s usage statement, the attacker’s email address, and\nstop.html. Hence, the iPhone version of TianySpy is highly likely to steal credentials and send them to the\nattacker.\n\nFigure\n\n13. String values included in the iPhone version of TianySpy\n\nFigure 14. String values included in the iPhone version of TianySpy (encrypted email address)\n\n\n-----\n\nFigure 15. Decrypted email address; the\n\nsame email address is seen in the Android version of TianySpy\nRelation with phishing group targeting local banks in Japan\n\n[The Cyber Security Institute at Trend Micro collaborated with JC3 and its members to research and analyze](https://www.trendmicro.com/ja_jp/about/security-activity.html)\n[a phishing group targeting domestic banks in Japan. The results of this collaboration were reported in April](https://www.jc3.or.jp/threats/topics/article-347.html)\n[2021. Trend Micro also reported notable characteristics of BP1 and BP6, the two largest banking phishing](https://blog.trendmicro.co.jp/archives/27635)\ngroups identified in the project.\n\nAs mentioned earlier, some text messages seen in this campaign contained links to lure users into installing\nsecurity software. In reality, however, users would end up unknowingly infecting their device with the\nAndroid malware KeepSpy. It has also been confirmed that when accessed via an iPhone outside of the\nobserved campaign period (September 30 to October 12, 2021), these phishing sites appear as websites\nfor a telecommunication company and are categorized under the BP1 group.\n\nFigure\n\n16. HTML source of a phishing site disguised as the website of a telecommunication company\n\nFigure\n\n17. HTML source of a phishing site disguised as the website of a telecommunication company\nHow to protect yourself from phishing\n\nThis is the first case in Japan where a type of malware that targets iPhones resulted in financial damage.\n\nThis campaign shows that iPhones can indeed be infected by malware once a malicious configuration\nprofile is installed. This case also confirmed that simply accessing a malicious website would not inevitably\ninfect a device with malware. Rather, a user has to complete the process of installing the malware for\ninfection to take place. This means that with enough knowledge and caution, a user can protect their device\nfrom infection.\n\nWe also believe that smishing continues to be part of this loop of attack chains targeting smartphones. In\n[the meantime, JC3 continues to publish alert notifications with regard to the same campaign detailed in this](https://www.jc3.or.jp/threats/examples/article-409.html)\nblog for additional reference.\n\n[More details on smishing and how to protect yourself from such threats can be found in this blog.](https://www.is702.jp/special/3902)\n\n\n-----\n\nIndicators of compromise\n\nSHA256 Trend Micro Detection\n\nb42bdfceb8e7733db22645fee95482dccf5260dcd3ff15ede0de77d2120c3845 AndroidOS_TianySpy.GCL\n\na16878598e0ce5924fa45c09319b48e566f4d935626042ba378f4f1f7b9ad798\n\n5d27cc2e0a8ab987341e8995bf50cc763160cce4191df9a94c4b39b570c0d6a5\n\n73c19a778500c6fb04f60d60527ea76a870590ed9e0f6014cb03419d02ff0457\n\nada8dfe4914f824e5a4a03aec8f135a4544cc0086830f23285dc67d42ec1f29c\n\n839246c1b13d2d9c87907bdd4069ce0aad02e5660cb10fad4a85805e4b81dcea\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-25 - TianySpy Malware Uses Smishing Disguised as Message From Telco.pdf"
    ],
    "report_names": [
        "2022-01-25 - TianySpy Malware Uses Smishing Disguised as Message From Telco.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535781,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653753715,
    "ts_modification_date": 1653753715,
    "files": {
        "pdf": "https://archive.orkl.eu/2b7d73d8b68782e1a6e66222524a5eb95e15937b.pdf",
        "text": "https://archive.orkl.eu/2b7d73d8b68782e1a6e66222524a5eb95e15937b.txt",
        "img": "https://archive.orkl.eu/2b7d73d8b68782e1a6e66222524a5eb95e15937b.jpg"
    }
}