{
    "id": "92295088-c365-4af5-8c4e-2cb869d01857",
    "created_at": "2023-01-12T15:10:22.222455Z",
    "updated_at": "2025-03-27T02:17:05.66554Z",
    "deleted_at": null,
    "sha1_hash": "e3db9a11eca323f003ed2c8339b1e050682b1ad5",
    "title": "2022-03-31 - AcidRain - A Modem Wiper Rains Down on Europe",
    "authors": "",
    "file_creation_date": "2022-05-28T02:15:54Z",
    "file_modification_date": "2022-05-28T02:15:54Z",
    "file_size": 2190514,
    "plain_text": "# AcidRain | A Modem Wiper Rains Down on Europe\n\n**[sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/](https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/)**\n\nJuan Andrés Guerrero-Saade\n\n**[By Juan Andres Guerrero-Saade (@juanandres_gs) and Max van Amerongen](https://twitter.com/juanandres_gs)**\n**[(@maxpl0it)](https://twitter.com/maxpl0it)**\n\n## Executive Summary\n\nOn Thursday, February 24th, 2022, a cyber attack rendered Viasat KA-SAT modems\ninoperable in Ukraine.\nSpillover from this attack rendered 5,800 Enercon wind turbines in Germany unable to\ncommunicate for remote monitoring or control.\nViasat’s statement on Wednesday, March 30th, 2022 provides a somewhat plausible\nbut incomplete description of the attack.\nSentinelLabs researchers discovered new malware that we named ‘AcidRain’.\nAcidRain is an ELF MIPS malware designed to wipe modems and routers.\nWe assess with medium-confidence that there are developmental similarities between\nAcidRain and a VPNFilter stage 3 destructive plugin. In 2018, the FBI and Department\nof Justice attributed the VPNFilter campaign to the Russian government\nAcidRain is the 7th wiper malware associated with the Russian invasion of Ukraine.\n**Update: In a statement disseminated to** [journalists, Viasat confirmed the use of the](https://twitter.com/zackwhittaker/status/1509601023047970820?s=20&t=Y0xOUSXVK1AIbaBGXDsnLQ)\nAcidRain wiper in the February 24th attack against their modems.\n\n\n-----\n\n## Context\n\nThe Russian invasion of Ukraine has included a wealth of cyber operations that have tested\nour collective assumptions about the role that cyber plays in modern warfare. Some\n[commentators have voiced a bizarre disappointment at the ‘lack of cyber’ while those at the](https://www.washingtonpost.com/politics/2022/03/07/putins-invasion-ukraine-didnt-rely-cyber-warfare-heres-why/)\n[coalface are overwhelmed by the abundance of cyber operations accompanying](https://www.nytimes.com/2022/03/18/opinion/cyberwar-ukraine-russia.html)\nconventional warfare. From the beginning of 2022, we have dealt with six different strains of\n[wiper malware targeting Ukraine: WhisperKill, WhisperGate, HermeticWiper, IsaacWiper,](https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/)\nCaddyWiper, and DoubleZero. These attacks are notable on their own. But there’s been an\nelephant in the room by way of the rumored ‘satellite modem hack’. This particular attack\ngoes beyond Ukraine.\n\nWe first became aware of an issue with Viasat KA-SAT routers due to a reported outage of\n5,800 Enercon wind turbines in Germany. To clarify, the wind turbines themselves were not\nrendered inoperable but “remote monitoring and control of the wind turbines” became\nunavailable due to issues with satellite communications. The timing coincided with the\nRussian invasion of Ukraine and suspicions arose that an attempt to take out Ukrainian\nmilitary command-and-control capabilities by hindering satellite connectivity spilled over to\naffect German critical infrastructure. No technical details became available; technical\nspeculation has been rampant.\n\n[On Wednesday, March 30th, 2022, Viasat finally released a statement stating that the attack](https://www.viasat.com/about/newsroom/blog/ka-sat-network-cyber-attack-overview/)\ntook place in two phases: First, a denial of service attack coming from “several SurfBeam2\nand SurfBeam2+ modems and […other on-prem equipment…] physically located within\nUkraine” that temporarily knocked KA-SAT modems offline. Then, the gradual disappearance\nof modems from the Viasat service. The actual service provider is in the midst of a complex\narrangement where Eutalsat provides the service, but it’s administered by an Italian\ncompany called Skylogic as part of a transition plan.\n\n## The Viasat Explanation\n\nAt the time of writing, Viasat has not provided any technical indicators nor an incident\nresponse report. They did provide a general sense of the attack chain with conclusions that\nare difficult to reconcile.\n\nViasat reports that the attackers exploited a misconfigured VPN appliance, gained access to\nthe trust management segment of the KA-SAT network, moved laterally, then used their\naccess to “execute legitimate, targeted management commands on a large number of\nresidential modems simultaneously”. Viasat goes on to add that “these destructive\ncommands overwrote key data in flash memory on the modems, rendering the modems\nunable to access the network, but not permanently unusable”.\n\n\n-----\n\nIt remains unclear how legitimate commands could have such a disruptive effect on the\nmodems. Scalable disruption is more plausibly achieved by pushing an update, script, or\nexecutable. It’s also hard to envision how legitimate commands would enable either the DoS\neffects or render the devices unusable but not permanently bricked.\n\nIn effect, the preliminary Viasat incident report posits the following requirements:\n\n1. Could be pushed via the KA-SAT management segment onto modems en masse\n2. Would overwrite key data in the modem’s flash memory\n3. Render the devices unusable, in need of a factory reset or replacement but not\n\npermanently unusable.\n\nWith those requirements in mind, we postulate an alternative hypothesis: The threat actor\nused the KA-SAT management mechanism in a supply-chain attack to push a wiper\ndesigned for modems and routers. A wiper for this kind of device would overwrite key data in\nthe modem’s flash memory, rendering it inoperable and in need of reflashing or replacing.\n\n[Subsequent to this post being published, Viasat confirmed to journalists that our analysis](https://twitter.com/zackwhittaker/status/1509601166061191171)\nwas consistent with their reports.\n\nViasat told [BleepingComputer that “The analysis in the SentinelLabs report regarding the](https://www.bleepingcomputer.com/news/security/viasat-confirms-satellite-modems-were-wiped-with-acidrain-malware/)\nukrop binary is consistent with the facts in our report – specifically, SentinelLabs identifies the\ndestructive executable that was run on the modems using a legitimate management\ncommand as Viasat previously described”.\n\n## The AcidRain Wiper\n\n\n-----\n\nOn Tuesday, March 15th, 2022, a suspicious upload caught our attention. A MIPS ELF\nbinary was uploaded to VirusTotal from Italy with the name ‘ukrop’. We didn’t know how to\nparse the name accurately. Possible interpretations include a shorthand for “ukr”aine\n“op”eration, the acronym for the Ukrainian Association of Patriots, or a Russian ethnic slur for\n[Ukrainians – ‘Укроп’. Only the incident responders in the Viasat case could say definitively](https://en.wikipedia.org/wiki/Ukrop#:~:text=Ukrop%20(Russian%3A%20%D0%A3%D0%BA%D1%80%D0%BE%D0%BF%3B%20literally,the%20Russian%20word%20for%20Ukrainians.)\nwhether this was in fact the malware used in this particular incident. We posit its use as a\nfitting hypothesis and will describe its functionality, quirky development traits, and possible\noverlaps with previous Russian operations in need of further research.\n\n## Technical Overview\n\n**SHA256** 9b4dfaca873961174ba935fddaf696145afe7bbf5734509f95feb54f3584fd9a\n\n**SHA1** 86906b140b019fdedaaba73948d0c8f96a6b1b42\n\n**MD5** ecbe1b1e30a1f4bffaf1d374014c877f\n\n**Name** ukrop\n\n**Magic** ELF 32-bit MSB executable, MIPS, MIPS-I version 1 (SYSV), statically linked,\nstripped\n\n\n**First**\n**Seen**\n\n\n2022-03-15 15:08:02 UTC\n\n\nAcidRain’s functionality is relatively straightforward and takes a bruteforce attempt that\npossibly signifies that the attackers were either unfamiliar with the particulars of the target\nfirmware or wanted the tool to remain generic and reusable. The binary performs an in-depth\nwipe of the filesystem and various known storage device files. If the code is running as root,\nAcidRain performs an initial recursive overwrite and delete of non-standard files in the\nfilesystem.\n\n\n-----\n\nRecursively delete files in nonstandard folders\nFollowing this, it attempts to destroy the data in the following storage device files:\n\n**Targeted Device(s)** **Description**\n\n/dev/sd* A generic block device\n\n/dev/mtdblock* Flash memory (common in routers and IoT devices)\n\n/dev/block/mtdblock* Another potential way of accessing flash memory\n\n/dev/mtd* The device file for flash memory that supports fileops\n\n/dev/mmcblk* For SD/MMC cards\n\n/dev/block/mmcblk* Another potential way of accessing SD/MMC cards\n\n\n-----\n\n/dev/loop* Virtual block devices\n\nThis wiper iterates over all possible device file identifiers (e.g., mtdblock0 – mtdblock99),\nopens the device file, and either overwrites it with up to 0x40000 bytes of data or (in the case\nof the /dev/mtd* device file) uses the following IOCTLS to erase it: MEMGETINFO,\nMEMUNLOCK, MEMERASE, and MEMWRITEOOB. In order to make sure that these writes\nhave been committed, the developers run an `fsync syscall.`\n\nThe code that generates the malicious data used to overwrite storage\nWhen the overwriting method is used instead of the IOCTLs, it copies from a memory region\ninitialized as an array of 4-byte integers starting at `0xffffffff and decrementing at each`\n[index. This matches what others had seen after the exploit had taken place.](https://twitter.com/reversemode/status/1509467387954962432)\n\n\n-----\n\nSide-by-side comparison of a Surfbeam2 modem pre- and post-attack\nThe code for both erasure methods can be seen below:\n\n\n-----\n\nMechanisms to erase devices: write 0x40000 (left) or use MEM* IOCTLS (right)\nOnce the various wiping processes are complete, the device is rebooted.\n\n\n-----\n\nRedundant attempts to reboot the device\nThis results in the device being rendered inoperable.\n\n## An Interesting Oddity\n\nDespite what the Ukraine invasion has taught us, wiper malware is relatively rare. More so\nwiper malware aimed at routers, modems, or IoT devices. The most notable case is\nVPNFilter, a modular malware aimed at SOHO routers and QNAP storage devices,\n[discovered by Talos. This was followed by an FBI indictment attributing the operation to](https://blog.talosintelligence.com/2018/05/VPNFilter.html)\nRussia (APT28, in particular). More recently, the NSA and CISA attributed VPNFilter to\nSandworm (a different threat actor attributed to the same organization, the Russian GRU) as\nthe U.K.’s National Cyber Security Centre (NCSC) described VPNFilter’s successor, Cyclops\nBlink.\n\n\n-----\n\nVPNFilter included an impressive array of functionality in the form of multi-stage plugins\nselectively deployed to the infected devices. The functionality ranges from credential theft to\nmonitoring Modbus SCADA protocols. Among its many plugins, it also included functionality\n[to wipe and brick devices as well as DDoS a target.](https://blog.talosintelligence.com/2018/09/vpnfilter-part-3.html)\n\nThe reason we bring up the specter of VPNFilter is not because of its superficial similarities\nto AcidRain but rather because of an interesting (but inconclusive) code overlap between a\nspecific VPNFilter plugin and AcidRain.\n\n## VPNFilter Stage 3 Plugin – ‘dstr’\n\n**SHA256** 47f521bd6be19f823bfd3a72d851d6f3440a6c4cc3d940190bdc9b6dd53a83d6\n\n**SHA1** 261d012caa96d3e3b059a98388f743fb8d39fbd5\n\n**MD5** 20ea405d79b4de1b90de54a442952a45\n\n**Description** VPNFilter Stage 3, ‘dstr’ module\n\n**Magic** ELF 32-bit MSB executable, MIPS, MIPS-I version 1 (SYSV), statically linked,\nstripped\n\n**First Seen** 2018-06-06 13:02:56 UTC\n\nAfter the initial discovery of VPNFilter, additional plugins were revealed by researchers\nattempting to understand the massive spread of the botnet and its many intricacies. Among\nthese were previously unknown plugins, including ‘dstr’. As the mangled name suggests, it’s\na ‘destruction’ module meant to supplement stage 2 plugins that lacked the ‘kill’ command\nmeant to wipe the devices.\n\n[This plugin was brought to our attention initially by tlsh fuzzy hashing, a more recent](https://github.com/trendmicro/tlsh)\nmatching library that’s proven far more effective than ssdeep or imphash in identifying similar\nsamples. The similarity was at 55% to AcidRain with no other samples being flagged in the\nVT corpus. This alone is not nearly enough to conclusively judge the two samples as tied,\nbut it did warrant further investigation.\n\nVPNFilter and AcidRain are both notably similar and dissimilar. They’re both MIPS ELF\nbinaries and the bulk of their shared code appears to stem from statically-linked libc. It\nappears that they may also share a compiler, most clearly evidenced by the identical Section\nHeaders Strings Tables.\n\n\n-----\n\nSection Headers Strings Tables for VPNFilter and AcidRain\nAnd there are other development quirks, such as the storing of the previous syscall number\nto a global location before a new syscall. At this time, we can’t judge whether this is a shared\ncompiler optimization or a strange developer quirk.\n\nMore notably, while VPNFilter and AcidRain work in very different ways, both binaries make\nuse of the MEMGETINFO, MEMUNLOCK, and MEMERASE IOCTLS to erase mtd device\nfiles.\n\nOn the left, AcidRain; on the right, VPNFilter\nThere are also notable differences between VPNFilter’s ‘dstr’ plugin and AcidRain. The latter\nappears to be a far sloppier product that doesn’t consistently rise to the coding standards of\nthe former. For example, note the redundant use of process forking and needless repetition\nof operations.\n\n\n-----\n\nThey also appear to serve different purposes, with the VPNFilter plugin targeting specific\ndevices with hardcoded paths, and AcidRain taking more of a “one-binary-fits-all” approach\nto wiping devices. By brute forcing device filenames, the attackers can more readily reuse\nAcidRain against more diverse targets.\n\nWe invite the research community to stress test this developmental overlap and contribute\ntheir own findings.\n\n## Conclusions\n\nAs we consider what’s possibly the most important cyber attack in the ongoing Russian\ninvasion of Ukraine, there are many open questions. Despite Viasat’s statement claiming that\nthere was no supply-chain attack or use of malicious code on the affected routers, we posit\nthe more plausible hypothesis that the attackers deployed AcidRain (and perhaps other\nbinaries and scripts) to these devices in order to conduct their operation.\n\nWhile we cannot definitively tie AcidRain to VPNFilter (or the larger Sandworm threat\ncluster), we note a medium-confidence assessment of non-trivial developmental similarities\nbetween their components and hope the research community will continue to contribute their\nfindings in the spirit of collaboration that has permeated the threat intelligence industry over\nthe past month.\n\n## References\n\n[https://www.wired.com/story/viasat-internet-hack-ukraine-russia/](https://www.wired.com/story/viasat-internet-hack-ukraine-russia/)\n[https://www.cisa.gov/uscert/ncas/alerts/aa22-076a](https://www.cisa.gov/uscert/ncas/alerts/aa22-076a)\nhttps://media.defense.gov/2022/Jan/25/2002927101/-1/-1/0/CSA_PROTECTING_VSAT_CO\nMMUNICATIONS_01252022.PDF\nhttps://www.airforcemag.com/hackers-attacked-satellite-terminals-through-managementnetwork-viasat-officials-say/\nhttps://nps.edu/documents/104517539/104522593/RELIEF12-4_QLR.pdf/9cc03d09-9af4410e-b601-a8bffdae0c30\nhttps://www.reuters.com/business/media-telecom/exclusive-hackers-who-crippled-viasatmodems-ukraine-are-still-active-company-2022-03-30/\n[https://www.viasat.com/about/newsroom/blog/ka-sat-network-cyber-attack-overview/](https://www.viasat.com/about/newsroom/blog/ka-sat-network-cyber-attack-overview/)\n[https://blog.talosintelligence.com/2018/05/VPNFilter.html](https://blog.talosintelligence.com/2018/05/VPNFilter.html)\n[https://blog.talosintelligence.com/2018/06/vpnfilter-update.html?m=1](https://blog.talosintelligence.com/2018/06/vpnfilter-update.html?m=1)\n[https://blog.talosintelligence.com/2018/09/vpnfilter-part-3.html](https://blog.talosintelligence.com/2018/09/vpnfilter-part-3.html)\n[https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf](https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf)\nhttps://www.trendmicro.com/en_us/research/21/a/vpnfilter-two-years-later-routers-stillcompromised-.html\n[https://www.cisa.gov/uscert/ncas/alerts/aa22-054a](https://www.cisa.gov/uscert/ncas/alerts/aa22-054a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-31 - AcidRain - A Modem Wiper Rains Down on Europe.pdf"
    ],
    "report_names": [
        "2022-03-31 - AcidRain - A Modem Wiper Rains Down on Europe.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536222,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653704154,
    "ts_modification_date": 1653704154,
    "files": {
        "pdf": "https://archive.orkl.eu/e3db9a11eca323f003ed2c8339b1e050682b1ad5.pdf",
        "text": "https://archive.orkl.eu/e3db9a11eca323f003ed2c8339b1e050682b1ad5.txt",
        "img": "https://archive.orkl.eu/e3db9a11eca323f003ed2c8339b1e050682b1ad5.jpg"
    }
}