{
    "id": "923a9981-b7ed-40ef-ace0-7a01ddb9f892",
    "created_at": "2023-01-12T15:05:56.59113Z",
    "updated_at": "2025-03-27T02:17:15.031186Z",
    "deleted_at": null,
    "sha1_hash": "e12cf7b6f86868926d6e764d6001943cc3318f73",
    "title": "2022-08-12 - Iron Tiger Compromises Chat Application Mimi, Targets Windows, Mac, and Linux Users",
    "authors": "",
    "file_creation_date": "2022-09-01T10:10:31Z",
    "file_modification_date": "2022-09-01T10:10:31Z",
    "file_size": 707457,
    "plain_text": "# Iron Tiger Compromises Chat Application Mimi, Targets Windows, Mac, and Linux Users\n\n**[trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html](https://www.trendmicro.com/en_us/research/22/h/irontiger-compromises-chat-app-Mimi-targets-windows-mac-linux-users.html)**\n\nAugust 12, 2022\n\nWe found APT group Iron Tiger's malware compromising chat application Mimi’s servers in a\nsupply chain attack.\n\nBy: Daniel Lunghi, Jaromir Horejsi\nAugust 12, 2022\nRead time: ( words)\n\nWe noticed a server hosting both a HyperBro sample and a malicious Mach-O executable\n[named “rshell.” HyperBro is a malware family used by Iron Tiger (also known as Emissary](https://www.trendmicro.com/en_us/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\nPanda, APT27, Bronze Union, and Luckymouse), an advanced persistent threat (APT) group\n[that has been performing cyberespionage for almost a decade, and there have been no](https://www.erai.com/CustomUploads/ca/wp/2015_12_wp_operation_iron_tiger.pdf)\nreports of this group associated with a tool for Mac operating systems (OS). We analyzed the\nMach-O sample and found it to be a new malware family targeting the Mac OS platform. We\nalso eventually found samples compiled for the Linux platform that belongs to the same\nmalware family.\n\n\n-----\n\nWe noticed that a chat application named MiMi retrieved the rshell executable, an app we\n[came across recently while investigating threat actor Earth Berberoka. We noticed Iron Tiger](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/exposing-earth-berberoka-a-multiplatform-apt-campaign-targeting-online-gambling-sites)\ncontrolling the servers hosting the app installers of MiMi, suggesting a supply chain attack.\nFurther investigation showed that MiMi chat installers have been compromised to download\nand install HyperBro samples for the Windows platform and rshell samples for the Mac OS\n[platform. While this was not the first time the technique was used, this latest development](https://www.welivesecurity.com/2020/12/10/luckymouse-ta428-compromise-able-desktop/)\nshows Iron Tiger’s interest in compromising victims using the three major platforms:\nWindows, Linux, and macOS.\n\nInfection vector\n\nMiMi (mimi = 秘密 = secret in Chinese) is an instant messaging application designed\nespecially for Chinese users, with implementations for major desktop and mobile operating\nsystems: Windows, macOS, Android, and iOS. The desktop versions are developed with the\n[help of ElectronJS framework, which is a cross-platform framework based on Node.js,](https://www.electronjs.org/)\nallowing the developers to create applications with HTML, Javascript (JS), and CSS.\n\n[We already came across an abuse of this application during the Earth Berberoka](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/exposing-earth-berberoka-a-multiplatform-apt-campaign-targeting-online-gambling-sites)\ninvestigation. However, compared to Earth Berberoka’s routine wherein the threat actor set\nup a fake website to deliver a malicious chat application, in this instance Iron Tiger\ncompromised the server hosting the legitimate installers for this chat application for a supply\nchain attack. Contrary to the fake website, the links to the mobile versions of the application\nfor Android and iPhone worked. Also, we could not find anything malicious in the latest\nWindows installer.\n\nIn June, we were able to download the macOS installer for the 2.3.2 version of MiMi chat and\nverified it as genuine. After downloading it again later, we found that the installer was\nreplaced with a malicious version retrieving the rshell sample. This was proof that the\nattackers had direct access to the installers‘ host server, and that they were monitoring the\nversions published by the MiMi app developers in order to quickly insert a backdoor.\n\nFigure 1. Downloaded\n\ninstaller before (left) and after (right) malware embedding\nIn this case, we can see that it took an hour and a half for the attackers to modify the\nlegitimate installer and add malicious code to it. For older versions, it took the attackers one\nday to inject its modifications.\n\n\n-----\n\nThe modification occurs in the electron-main.js file, which contains a block of code beginning\n[with “eval(function(p,a,c,k,e,d)”, suggesting we are dealing with Dean Edwards packer.](http://dean.edwards.name/packer/)\n\nFigure 2. Malicious Javascript code inserted into 2.3.2.dmg targeting macOS\n\nFigure 3. Deobfuscated malicious\n\nJavascript code\nOnce deobfuscated, we saw that the inserted code downloads rshell from the IP address\n139[.]180[.]216[.]65 and executes it once run on the macOS platform. The delivered rshell\nmalware is a new family we will discuss in a later section.\n\nAfter looking at previous versions of this installer, we found that the first compromised\nversion was 2.3.0, built on May 26, 2022, while the previous version (2.2.10, published on\nMay 6, 2022) was clean. This led is to our first assumption that Iron Tiger had access to the\nMimi chat developer's backend between the two dates in May.\n\nHowever, a further look at our telemetry revealed older installers that have been\ncompromised, this time aimed at Windows OS. Version 2.2.0 and 2.2.1 (both built on\nNovember 23, 2021), had similar additions to the electron-main.js file.\n\n\n-----\n\nFigure 4. Malicious Javascript code inserted into 2.2.0.exe targeting Windows OS\n\nFigure\n\n5. Deobfuscated malicious JavaScript code from 2.2.0.exe\nWe saw that one executable, one dynamic link library (DLL), and one binary file were being\ndownloaded into the temporary directory before running the executable. This is the typical\nway that this threat actor loads its files, exploiting DLL side-loading vulnerabilities in\nlegitimate and usually signed executables. In this case, the exploited executable belongs to\nthe DESlock+ product, as [described last year when we analyzed another Iron Tiger](https://www.trendmicro.com/en_no/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\ncampaign, using malware HyperBro.\n\nMalware analysis\n\n**rshell**\n\nThe rshell executable is a standard backdoor and implements functions typical of similar\nbackdoors:\n\n\n-----\n\n1. Collect OS information and send it to command and control (C&C) server\n2. Receive commands from the C&C server to execute\n3. Send command execution results back to the C&C\n\nWe found multiple samples of this particular backdoor, with some of them in the Mach-O\nformat (macOS platform), while others were in the ELF format (Linux platform). The oldest\nsample we found was uploaded in June 2021, with the first victim reported in mid-July 2021.\n\nThe OS information collection routine gathers the following information:\n\nGUID: (randomly generated guid, stored in /tmp/guid)\n[computer name: uname (nodename)](https://ss64.com/osx/uname.html)\n[IP addresses: (getifaddrs)](https://man7.org/linux/man-pages/man3/getifaddrs.3.html)\nmessage type: login\n[username: _getpwuid (pw_name)](https://man7.org/linux/man-pages/man3/getpwuid.3p.html)\n[version: uname (release)](https://ss64.com/osx/uname.html)\n\n[Once collected, the backdoor “packs” them into a Binary JSON (BSON) message and sends](https://en.wikipedia.org/wiki/BSON)\nit over TCP to the C&C in clear (unencrypted) form.\n\nFigure 6. Deserialized BSON packet\n\n(and displayed as JSON) with login message containing OS information\nThe message received from the C&C is also in BSON format and contains the following\nfields:\n\nTable 1. Type and subtype of packets received from the C&C\n\n**Type** **Subtype** **Explanation**\n\nCmd Init Start new shell\n\nCmd close Kill shell\n\nCmd data Commands to execute in shell\n\nFile Init List root / directory\n\nFile Dir List directory\n\nFile down Prepare file for downloading\n\n\n-----\n\nFile read Read file (transfer bytes)\n\nFile close Close file\n\nFile upload Prepare file for uploading\n\nFile write Write file (transfer bytes)\n\nFile Del Delete file\n\nThe client also regularly sends a packet of type ‘keepalive’ to the C&C.\n\nRunning the DMG installer on a macOS machine, the user is shown several warnings before\nthe trojanized app is installed and run. At first, Safari web browser asks the user to allow\ndownloads from the given website. After choosing “Allow,” downloading, and executing the\nDMG installer, another warning message about an unverified developer is displayed.\n\nFigure 7. Unverified developer warning with the\n\n“Open” button noticeably missing\nTo override this warning, the user must open “System Preferences” and “Security & Privacy”\ntabs and click on “Open Anyway.”\n\nFigure 8.\n\nSecurity & Privacy tab to allow running apps from unverified developers\nAfterward, one more warning about the unverified developer is displayed. This time,\nhowever, the “Open” button appears in the prompt so the application can finally start.\n\n\n-----\n\nFigure 9. Unverified developer warning with the\n\n“Open” button enabled\nWe confirmed that both the legitimate and the malicious versions of the chat installer were\nunsigned, which means the users of MiMi chat were probably used to all these extra steps to\nfinally install the application despite all the macOS watchguards.\n\n**HyperBro**\n\nThe HyperBro malware family has been around since 2017 and has been extensively\n[analyzed. It was updated in mid-2019, which we described in detail in our Operation](https://unit42.paloaltonetworks.com/emissary-panda-attacks-middle-east-government-sharepoint-servers/)\nDRBControl paper.\n\nThe version used in this campaign is no different from what we already described in our\n[previous Iron Tiger investigation. The only noteworthy element is the Authenticode signature](https://www.trendmicro.com/en_no/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\nof dlpprem32.dll, which is signed by a (now) revoked certificate belonging to “Cheetah Mobile\nInc.” The said company was formerly known as Kingsoft Internet Software Holdings Limited,\n[wherein during our previous investigation on the group, we already found one HyperBro DLL](https://www.trendmicro.com/en_no/research/21/d/iron-tiger-apt-updates-toolkit-with-evolved-sysupdate-malware-va.html)\nsigned by a certificate belonging to Kingsoft.\n\nTargets\n\nWe found 13 different targets while following our sensors‘ data. The only targeted countries\nwere Taiwan and the Philippines: five targets of HyperBro (four in Taiwan and one in the\nPhilippines). Meanwhile, we found eight targets for rshell: six in Taiwan, one in the\nPhilippines and one being in Taiwan and the Philippines\n\n\n-----\n\nWhile we were unable to identify all the targets, these targeting demographics demonstrate a\ngeographical region of interest for Iron Tiger. Among those targets, we could only identify one\nof them: a Taiwanese gaming development company. Interestingly, we found a sample from\nthe Reptile rootkit framework in that same company, as well as network requests to a\nsubdomain that belongs to Earth Berberoka’s infrastructure.\n\nWe also noticed network requests from a Taiwanese IT development company to the\nsubdomain trust[.]veryssl[.]org, and the subdomain center.veryssl[.]org is a C&C for one of\nthe rshell samples we found. This suggests the company could be compromised by the\nsame threat actor.\n\nTimeline\n\nJune 2021: Oldest Linux rshell sample found\nNovember 2021: Threat actor modified version 2.2.0 of Windows MiMi chat installer to\ndownload and execute HyperBro backdoor\nMay 2021: Threat actor modified version 2.3.0 of Mac OS MiMi chat installer to\ndownload and execute “rshell” backdoor\n\nAttribution and conclusion\n\nWe attribute this campaign to Iron Tiger for multiple reasons. First, the dlpprem32.dll file\nlinked to HyperBro shares certain characteristics (specifically imphash, RICH header) with\nprevious samples already attributed to the group. Also, the file names involved in the\ndecoding and loading of HyperBro are similar to those we witnessed during our investigation\nlast year.\n\nSecond, one of the Linux rshell samples used the IP address 45[.]142[.]214[.]193 as its C&C.\nIn 2020, that IP address had a particular reverse DNS: nbaya0u2[.]example[.]com. During\nour [Operation DRBControl investigation, we found a HyperBro sample that had](https://www.trendmicro.com/vinfo/br/security/news/cyber-attacks/operation-drbcontrol-uncovering-a-cyberespionage-campaign-targeting-gambling-companies-in-southeast-asia)\n138[.]124[.]180[.]108 as its C&C. This second IP address had nbaya0u1[.]example[.]com as\nits reverse DNS. However, as the rshell sample was found in 2021, we initially did not find\nthis correlation strong enough to attribute the rshellmalware family to Iron Tiger.\n\nDespite the fact that same state-sponsored threat actors tend to share their malware tools\n(such as gh0st, PlugX, and Shadowpad), this is not the case for HyperBro as far as we know.\nThe fact that we found this malware being used in this campaign is an additional indicator\npointing towards Iron Tiger.\n\nWe also found some links to Earth Berberoka. From one of the victims where we found an\n[rshell sample, we also found a binary belonging to the Reptile rootkit framework, a rootkit](https://github.com/f0rb1dd3n/Reptile)\nidentified as part of the arsenal of Earth Berberoka. We also noticed network\ncommunications from this victim to a subdomain of Earth Berberoka, suggesting it could\nhave been previously compromised by this threat actor. We noticed a different system in the\n\n\n-----\n\nsame situation, as well as the network connections to the subdomain trust[.]veryssl[.]org\ndomain name. One of the rshell samples had center[.]veryssl[.]org as the C&C. Both findings\nsuggest that those victims could be compromised by both threat actors, or that Earth\nBerberoka is actually a subgroup of Iron Tiger. As a reminder, while investigating Earth\n[Berberoka, we found multiple links to Iron Tiger that we detailed in our research.](https://documents.trendmicro.com/assets/white_papers/wp-operation-earth-berberoka.pdf)\n\nIndicators of Compromise (IOCs)\n\n[You will find the list of IOCs here.](https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/iron-tiger-compromises-chat-application-mimi,-targets-windows,-mac,-and-linux-users/IOCs-IronTiger-compromises-chat-application-mimi-targets-windows-mac-linux-users.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-12 - Iron Tiger Compromises Chat Application Mimi, Targets Windows, Mac, and Linux Users.pdf"
    ],
    "report_names": [
        "2022-08-12 - Iron Tiger Compromises Chat Application Mimi, Targets Windows, Mac, and Linux Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "a4aca3ca-9e04-42d1-b037-f7fb3fbab0b1",
            "created_at": "2023-01-06T13:46:39.042499Z",
            "updated_at": "2025-03-27T02:00:02.984002Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Colourful Panda",
                "BRONZE DUDLEY"
            ],
            "source_name": "MISPGALAXY:TA428",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f3b19931-3751-4ece-a235-15b397951dc2",
            "created_at": "2022-10-25T16:07:23.889537Z",
            "updated_at": "2025-03-27T02:02:10.015565Z",
            "deleted_at": null,
            "main_name": "Nazar",
            "aliases": [
                "SIG37"
            ],
            "source_name": "ETDA:Nazar",
            "tools": [
                "Distribute.exe",
                "EYService",
                "GpUpdates.exe",
                "Microolap Packet Sniffer",
                "TCPDUMP for Windows"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "452d2d74-e812-45d6-b0fe-b8a6cc4ebd01",
            "created_at": "2022-10-25T16:07:23.562676Z",
            "updated_at": "2025-03-27T02:02:09.865955Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "ETDA:Earth Berberoka",
            "tools": [
                "Agent.dhwf",
                "AngryRebel",
                "AsyncRAT",
                "CinaRAT",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "Kaba",
                "Korplug",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "PuppetLoader",
                "Quasar RAT",
                "QuasarRAT",
                "RedDelta",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav",
                "Yggdrasil",
                "oRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e3492534-85a6-4c87-a754-5ae4a56d7c8c",
            "created_at": "2022-10-25T15:50:23.819113Z",
            "updated_at": "2025-03-27T02:00:55.552554Z",
            "deleted_at": null,
            "main_name": "Threat Group-3390",
            "aliases": [
                "Threat Group-3390",
                "Earth Smilodon",
                "TG-3390",
                "Emissary Panda",
                "BRONZE UNION",
                "APT27",
                "Iron Tiger",
                "LuckyMouse"
            ],
            "source_name": "MITRE:Threat Group-3390",
            "tools": [
                "Systeminfo",
                "gsecdump",
                "PlugX",
                "ASPXSpy",
                "Cobalt Strike",
                "Mimikatz",
                "Impacket",
                "gh0st RAT",
                "certutil",
                "China Chopper",
                "HTTPBrowser",
                "Tasklist",
                "netstat",
                "SysUpdate",
                "HyperBro",
                "ZxShell",
                "RCSession",
                "ipconfig",
                "Clambling",
                "pwdump",
                "NBTscan",
                "Pandora",
                "Windows Credential Editor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2c980ea7-04c4-4193-8535-52f87e66a96e",
            "created_at": "2024-05-01T02:03:07.994126Z",
            "updated_at": "2025-03-27T02:05:17.293799Z",
            "deleted_at": null,
            "main_name": "BRONZE UNION",
            "aliases": [
                "Budworm ",
                "Emissary Panda ",
                "Iron Tiger ",
                "Lucky Mouse ",
                "TG-3390 ",
                "Temp.Hippo ",
                "APT27 "
            ],
            "source_name": "Secureworks:BRONZE UNION",
            "tools": [
                " ASPXSpy",
                " China Chopper",
                " Enfal",
                " Gh0st RAT",
                " HttpBrowser",
                " Hunter",
                " HyperBro",
                " OwaAuth",
                " PlugX",
                " PoisonIvy",
                " Sysupdate",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c416260c-7ff6-4a74-a5ba-a15f40d3543f",
            "created_at": "2024-05-01T02:03:07.939268Z",
            "updated_at": "2025-03-27T02:05:17.25652Z",
            "deleted_at": null,
            "main_name": "BRONZE DUDLEY",
            "aliases": [
                "Temp.Hex ",
                "Vicious Panda ",
                "TA428 "
            ],
            "source_name": "Secureworks:BRONZE DUDLEY",
            "tools": [
                "PoisonIvy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c63ab035-f9f2-4723-959b-97a7b98b5942",
            "created_at": "2023-01-06T13:46:38.298354Z",
            "updated_at": "2025-03-27T02:00:02.798255Z",
            "deleted_at": null,
            "main_name": "APT27",
            "aliases": [
                "TG-3390",
                "EMISSARY PANDA",
                "TEMP.Hippo",
                "Budworm",
                "Group 35",
                "BRONZE UNION",
                "Lucky Mouse",
                "Iron Taurus",
                "GreedyTaotie",
                "Red Phoenix",
                "ZipToken",
                "Iron Tiger",
                "G0027",
                "Earth Smilodon"
            ],
            "source_name": "MISPGALAXY:APT27",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5c13338b-eaed-429a-9437-f5015aa98276",
            "created_at": "2022-10-25T16:07:23.582715Z",
            "updated_at": "2025-03-27T02:02:09.875151Z",
            "deleted_at": null,
            "main_name": "Emissary Panda",
            "aliases": [
                "APT 27",
                "ATK 15",
                "Bronze Union",
                "Budworm",
                "Earth Smilodon",
                "Emissary Panda",
                "Group 35",
                "Iron Taurus",
                "Iron Tiger",
                "LuckyMouse",
                "Operation DRBControl",
                "Operation Iron Tiger",
                "Operation PZChao",
                "Operation SpoiledLegacy",
                "Operation StealthyTrident",
                "Red Phoenix",
                "TEMP.Hippo",
                "TG-3390",
                "ZipToken"
            ],
            "source_name": "ETDA:Emissary Panda",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "Agent.dhwf",
                "AngryRebel",
                "Antak",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "FOCUSFJORD",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HTTPBrowser",
                "HTran",
                "HUC Packet Transmit Tool",
                "HighShell",
                "HttpBrowser RAT",
                "HttpDump",
                "HyperBro",
                "HyperSSL",
                "HyperShell",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "Moudour",
                "Mydoor",
                "Nishang",
                "OwaAuth",
                "PCRat",
                "PlugX",
                "ProcDump",
                "PsExec",
                "RedDelta",
                "SEASHARPEE",
                "Sensocode",
                "SinoChopper",
                "Sogu",
                "SysUpdate",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Token Control",
                "TokenControl",
                "TwoFace",
                "WCE",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Xamtrav",
                "ZXShell",
                "gsecdump",
                "luckyowa"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e254cf33-e7f5-407b-a8a1-1a856a9f1c71",
            "created_at": "2025-01-21T02:00:03.599871Z",
            "updated_at": "2025-03-27T02:00:03.480307Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation DRBControl",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2664d6f5-f918-4978-87f8-f6afad7402c6",
            "created_at": "2023-01-06T13:46:39.393669Z",
            "updated_at": "2025-03-27T02:00:03.073942Z",
            "deleted_at": null,
            "main_name": "Earth Berberoka",
            "aliases": [
                "GamblingPuppet"
            ],
            "source_name": "MISPGALAXY:Earth Berberoka",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6d2910b0-9fea-46a2-84e6-a043b1e023e4",
            "created_at": "2022-10-25T16:07:23.946958Z",
            "updated_at": "2025-03-27T02:02:10.044112Z",
            "deleted_at": null,
            "main_name": "Operation DRBControl",
            "aliases": [],
            "source_name": "ETDA:Operation DRBControl",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535956,
    "ts_updated_at": 1743041835,
    "ts_creation_date": 1662027031,
    "ts_modification_date": 1662027031,
    "files": {
        "pdf": "https://archive.orkl.eu/e12cf7b6f86868926d6e764d6001943cc3318f73.pdf",
        "text": "https://archive.orkl.eu/e12cf7b6f86868926d6e764d6001943cc3318f73.txt",
        "img": "https://archive.orkl.eu/e12cf7b6f86868926d6e764d6001943cc3318f73.jpg"
    }
}