{
    "id": "9245f84e-62b3-453b-b9bc-09dbc80bed4e",
    "created_at": "2023-01-12T15:03:14.693046Z",
    "updated_at": "2025-03-27T02:14:38.667919Z",
    "deleted_at": null,
    "sha1_hash": "8563064c87eaf5432bd33081bc8d8289834de3e5",
    "title": "2022-04-27 - eSentire Threat Intelligence Malware Analysis- SolarMarker",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:47Z",
    "file_modification_date": "2022-05-29T00:53:47Z",
    "file_size": 4050031,
    "plain_text": "# eSentire Threat Intelligence Malware Analysis: SolarMarker\n\n**esentire.com/blog/esentire-threat-intelligence-malware-analysis-solarmarker**\n\nSince first emerging in 2020, SolarMarker (aka: Jupyter, Polazert, Yellow Cockatoo) remains one of the most successful\nmalware campaigns, relying heavily on social engineering through search engine optimization (SEO). SolarMarker has\nsignificantly developed its capabilities since it first appeared in the wild – from C2 communication that is challenging to\ndecrypt, to obfuscation that slows down malware analysis.\n\nSolarMarker has two major capabilities, it installs a backdoor or an infostealer as soon as the victim runs the payload.\nBoth SolarMarker’s modules can damage organizations as the backdoor can be leveraged by attacker(s) to deploy\nadditional malware or steal sensitive information.\n\n[This malware continues to remain active in the wild and researchers from Morphisec believe that it is the work of](https://blog.morphisec.com/jupyter-infostealer-backdoor-introduction)\nRussian-speaking actor(s). The first admin panel was found hosted on a Russian server Joint Stock company (JSC) \"ERTelecom Holding\". The background image of Jupiter from the admin panel that the researchers reversed originating from\nforums containing Cyrillic.\n\neSentire has observed a significant increase in SolarMarker infections delivered via drive-by downloads.\n\n## Key Takeaways:\n\nSolarMarker achieves persistence by creating a LNK file containing the encrypted backdoor or infostealer under\nStartup. The backdoor/infostealer then gets decrypted and loaded into memory as a PowerShell process.\nThe malware uses MSI (Windows installer package files) and executable (.exe) payloads that are over 200MB in\nsize to evade sandbox analysis. The eSentire Threat Response Unit (TRU) has recently observed that the\nattacker(s) switched to deliver more executable files rather than MSI.\nSolarMarker has the capability to fingerprint users’ browsers to prevent researchers from downloading multiple\npayloads for analysis.\nThe infostealer module includes the function responsible for decrypting DPAPI-protected data including browser\ncredentials and cookies.\nSolarMarker’s backdoor can retrieve additional malicious payloads from C2 channels using the get_file command.\n\n\n-----\n\n## SolarMarker Technical Analysis\n\n### Distribution\n\nThe initial infection occurs with the user visiting a malicious website that is stuffed with keywords to deceive search\nengines to get a higher search ranking (Exhibit 1).\n\n_Exhibit 1: Malicious websites hosting the payload_\n\nAt the time of this analysis, eSentire’s TRU team has observed that the malicious payload is delivered via two methods:\n\n1. Google Groups Pages\n[2. Compromised WordPress webpages (the malicious download lures are uploaded through Formidable with the](https://formidableforms.com/knowledgebase/frm_upload_folder/)\n\nfollowing path \"/wp-content/uploads/formidable/\", which is the default file uploads page)\n\nThe example of the payload distribution via Google Groups Pages is shown in Exhibit 2.\n\n\n-----\n\n_Exhibit 2: Google Groups used to deliver the payload_\n\nWe observed that the attacker(s) did a bulk upload of the payloads (501 files) on August 8, 2021 (Exhibit 3).\n\n_Exhibit 3: 501 payloads were uploaded on the same day (8/8/2021)_\n\nBelow is an example of a compromised WordPress website hosting the payload, the third page contains the keywords\nused for SEO poisoning (Exhibit 4).\n\n_Exhibit 4: Compromised_\n\n_WordPress webpage hosting a payload_\n\nIf a targeted victim clicks on one of the two download options, they will get multiple redirects to different webpages\n(Exhibit 5) hosting the loading icon to make it look as if the webpage is legitimately generating a document for the user to\ndownload (Exhibit 6)\n\n\n-----\n\n_Exhibit 5: Website redirects once the user clicks \"Download\" button_\n\n_page that gets parsed from different URLs_\n\n\n_Exhibit 6: The \"loading\"_\n\n\nThe end-user is presented with the fake Google Drive download page after all the redirects (Exhibits 7-8). The URL for\nthe final download page changes every time the user initiates a new download or clicks on a “Download” button. We have\nobserved that most of the domains used by SolarMarker threat actor(s) are hosted on Freenom.\n\n\n-----\n\n_Exhibit 7: Example of a payload download page (1)_\n\n_Exhibit 8: Example of a payload download page (2)_\n\nFurther analysis by eSentire’s TRU team discovered the obfuscated JavaScript script embedded in the source code of\nthe download page (Exhibit 9). One of the decryption functions has the name “h, u, n, t, e, r”. We were able to find the\nsame [obfuscation technique being reproduced by another security researcher.](https://github.com/nicolauns/hunter-php-javascript-obfuscator)\n\n_Exhibit 9: Obfuscated script found in the source code_\n\nThe de-obfuscated script (Exhibit 10) was responsible for redirecting the user to another URL if there is no interaction\nobserved from the user within a certain amount of time. The redirect URL appends the total number of mouse events\nfrom the end-user after the “udh=” value. The URL appears to be empty from what we have observed.\n\n\n-----\n\n_Exhibit 10: Deobfuscated script_\n\nTRU has observed that the threat actor(s) replaced their Google Drive landing pages with a fake Microsoft page (Exhibit\n11).\n\n_Exhibit 11: Fake Microsoft landing page_\n\nThreat actor(s) used the image from a PDF conversion software advertised on HiAppHere Market as a part of the landing\npage. The next page where the victim will be redirected to download the payload is also embedded within the landing\npage (the embedded URL is different each time the landing page is generated), as seen in Exhibit 12.\n\n\n-----\n\n_Exhibit 12: Landing page source code_\n\nHowever, attempting to download the payload twice from the same browser did not prove to be successful, so we worked\noff the hypothesis that there was a fingerprinting mechanism to prevent researchers from downloading payload samples.\n\nFurther analysis led to an interesting URL used in the iframe (an HTML element that embeds another HTML page within\n[the current one). The embedded URL contains FingerprintJS (browser fingerprinting library) JavaScript snippet that](https://fingerprintjs.com/)\nprovisions a visitor an identifier (Exhibit 13). Every visitor gets a unique visitorID hash value, which is calculated from\nmultiple browsers. The hash is identical for the same browser and the same device whether the user is visiting from\nIncognito (private) mode or not.\n\nAs such, the user is only able to download the payload once from the same browser.\n\n_Exhibit 13: Content of another embedded HTML page_\n\nAfter we made a second attempt to download the payload, we acquired a file masquerading as a PDF and DOCX file\nfilled with gibberish data (Exhibit 14).\n\n\n-----\n\n_Exhibit 14: Downloaded files filled with gibberish data instead of a payload_\n\n### Infection\n\nAt the time of this analysis, the downloaded payloads analyzed are over 200MB in size and come in the form of EXE and\nMSI files. Most sandboxes have size limitations for the uploaded files. eSentire TRU assesses the chances as almost\ncertain that the SolarMarker payloads are compiled in large sizes for sandbox evasion.\n\nThe file we analyzed is a 32-bit executable (262 MB in size). The original name of the file is IOSdyabisytda.exe. We have\nbeen consistently observing that the threat actor(s) are using the same name for initial payloads.\n\nSHA-256: 85fb7076044071a28afb43bec12e4f8ce93525132b2ae512934529f9f09895a5\n\nThe compiled date is November 12, 2021.\n\nThe file is signed by DigiCert to Outer Join Srl. The eSentire TRU team has observed that SolarMarker is leveraging\nDigiCert and SSL.com for digital signatures. The payloads were seen to go under the following signer names:\n\nOOO LEVELAP\nOOO ENDI\nDecapolis Consulting Inc.\nDivertida Creative Limited\nZimmi Consulting Inc.\nWalden Intertech Inc.\n\n[Interestingly, we found another sample on MalwareBazaar attributed to](https://bazaar.abuse.ch/sample/977a8d56d7bbc22e780e85bea06fa4be13c8f9be01515665863cb431fb2e8daa/) [Arkei Stealer using Outer Join Srl for the signer's](https://malpedia.caad.fkie.fraunhofer.de/details/win.arkei_stealer)\nname. Both certificates for SolarMarker and Arkei Stealer were issued by DigiCert and were valid from 8/16/2021 to\n8/13/2022.\n\nUpon execution of the initial payload, the decoy file named with 8 random characters is created from the folder where the\npayload was downloaded to as well as under the path C:\\Users\\*\\AppData\\Roaming\\Free PDF Soulutions. The decoy file\nis disguised as PDF Merge software (Exhibit 15). The infection chain is shown in Exhibit 16.\n\n\n-----\n\nIn the past, we have observed that SolarMarker delivered Classic PDF Editor, Wondershare PDFelement, and PDFsam\nas decoys.\n\n_Exhibit 15: Decoy file (PDF Merge)_\n\n_Exhibit 16: Infection chain_\n\n\n-----\n\n_Exhibit 17: The function responsible for running a malicious PowerShell script_\n\nIt is worth noting that the core functionality lays within the function that runs the PowerShell script shown in Exhibit 17.\n\n1. This command is responsible for converting letters to upper and lower cases.\n2. This command is responsible for creating a directory under %TEMP% folder.\n3. This command is responsible for creating a .LNK file that contains the encrypted backdoor or infostealer under\n\nStartup (persistence mechanism).\n4. This function is responsible for decrypting the SolarMarker backdoor using AES (Advanced Encryption Standard),\n\nalso known as Rijndael.\n5. This command is responsible for registering a file extension key (this is used so the file can be called out from a\n\nPowerShell script later).\n6. This command is responsible for writing the payload content and executing it.\n\nBelow, we will demonstrate how the aforementioned PowerShell script works.\n\nThe payload registers a randomly named extension key under Computer\\HKEY_CLASSES_ROOT\\ (Exhibit 18).\n\n_Exhibit 18: Registering an extension under HKCR_\n\nThe file extension key is pointed to the handler key. The handler key contains the PowerShell command (Exhibit 19)\nresponsible for decrypting the payload located under a randomly named folder under %TEMP% directory (Exhibit 20).\n\n\n-----\n\n_Exhibit 19: PowerShell command to decrypt the payload_\n\n_Exhibit 20: The encrypted payload_\n\nThe threat actor(s) changed their payload encryption and decryption methods to use AES. We have observed\nSolarMarker decrypting the payload using the XOR key in the past (Figure 21).\n\n_Exhibit 21: Previous payload decryption mechanism used by SolarMarker_\n\nAfter the payload is decrypted, the SolarMarker backdoor runs in memory under the powershell.exe process and reaches\nout to the C2 IP 146.70.53.153.\n\nSolarMarker comes in two different modules:\n\nSolarMarker Backdoor\nSolarMarker Infostealer\n\n### SolarMarker Backdoor\n\n\n-----\n\nThus far, eSentire TRU has observed that the majority of SolarMarker deployments result in backdoor deployments as it\nprovides the threat actor(s) with the option to deliver additional payloads. The backdoors are obfuscated with .NET DLLs\n(Dynamic Link Libraries).\n\nIn April 2021, SolarMarker backdoors were relatively easy to spot (Exhibit 22). However, since April, the threat actor(s)\nhave further developed their capabilities to include extra layers of obfuscation to challenge security researchers\nconducting analyses (Exhibit 23).\n\n_Exhibit 22: SolarMarker backdoor observed in April 2021_\n\n_Exhibit 23: SolarMarker backdoor observed most recently (March 2022)_\n\nThe most recent backdoor (SHA-256: eeecc2bd75ec77db22de5c47efe1fbef63c6b310d34bac6e3b049eef7f86c90b) that\nwas compiled on April 4, 2022 came with more obfuscation and a bigger file size (578KB) than the previous backdoor we\nobserved in March 2022 (142KB).\n\nSolarMarker is encrypting all the traffic to C2 Servers using a hard-coded RSA key and a symmetric AES CBC (Cipher\nBlock Chaining) algorithm (Exhibit 24).\n\n\n-----\n\n_Exhibit 24: Encrypted traffic_\n\nThe hard-coded RSA key is obfuscated in the recent sample (Exhibit 25).\n\n_Exhibit 25: Obfuscated RSA key_\n\nThe following are the examples of the hard-coded RSA keys from two recently analyzed samples.\n\n**Sample in March 2022:**\n```\n<RSAKeyValue>\n<Modulus>miX5pqHHoi4bCmFMVXn011knsHqrax4gkkfzIRjmgoY+e3ZoZxGrv0iFR51Pfr2tC+L38rejzLcTQu1af/5gV8axXDvEtQOBcW0nHQE\n</Modulus>\n<Exponent>AQAB</Exponent>\n</RSAKeyValue>\n\n```\n**Sample in April 2022 (de-obfuscated):**\n```\n<RSAKeyValue>\n<Modulus>1Jdz6XZ+pS1/3M6Ckgp80OODMqYyvFp7GY30flJPdAiNnsXg171wHz+rBtU5dHPCiEtHSf/Qh59ocgFPEMKcbsUErt1bmqcRcwr9B6G\n</Modulus>\n<Exponent>AQAB</Exponent>\n</RSAKeyValue>\n\n```\nThe backdoor conducts enumeration of the infected machine, and then exfiltrates the data in a JSON format to the C2\nServer. The following are the examples of the most recent JSONs being sent out to the C2:\n\n\n-----\n\n```\n{ p g,, p,\n10\",\"arch\":\"x64\",\"rights\":\"-\",\"version\":\"MR_3/B\",\"workgroup\":\"? | ?\",\"dns\":0,\"protocol_version\":2}\n{\"action\":\"get_file\",\"hwid\":\"(),\"task_id\":\"(),\"protocol_version\":2}\n{\"action\":\"ping\",\"hwid\":\"98GIWW5X3CY8G90WAAYVL6595WE2H8UQ\",\"pc_name\":\" \",\"os_name\":\"Win\n10\",\"arch\":\"x64\",\"rights\":\"-\",\"version\":\"AP_1/B\",\"workgroup\":\"? | ?\",\"dns\":0,\"protocol_version\":2}\n\n```\nThe collected information includes machine name, OS version, system architecture (x64 or x86), user rights (Admin or\nUsers), workgroup, DNS, and protocol version. In addition, the following can be identified:\n\n**action – commands sent from the C2 channel (e.g., command get_file to retrieve additional payloads from C2)**\n**hwid – a unique victim’s ID**\n**version – version of SolarMarker backdoor**\n**task_id – is likely assigned by the C2 to mark the ID for the specific task**\n\nThe following pattern identifies the status from the C2 (“file” or “idle”). The status file means the C2 is going to send the\npayload to the infected machine that can be either an executable (.exe) or a PowerShell script (.ps1). The additional\npayloads will be written to the %TEMP% folder. The payload also appends a unique base64-encoded hash that is\ndifferent for each communication between the C2 Server and infected machine.\n```\n{\"status\": \"idle\", \"uniq_hash\": \"J3FutDyWOcLByw==\"}\n\n```\nThe command value is used to invoke the fetched PowerShell script from C2 (Exhibit 26).\n\n_Exhibit 26: The function responsible for invoking a PowerShell script via \"command\" value_\n\n### SolarMarker Infostealer\n\nWe can see the crypto wallet stealing capability in the Module.Main class (Exhibit 27).\n\n\n-----\n\n_Exhibit 27: Crypto wallet stealing capability_\n\nThe list of targeted crypto wallets includes:\n\nAtomic\nGuarda\nSimpleOS\nNeon\nWasabi\nMyMonero\nJaxx\nElectrum\nEthereum\nExodus\nGreenAddress\nCoinWallet\nCoinomi\nLedgerLive\nTrinity\nScatter\n\nThe SolarMarker infostealer also has the capability to steal VPN and RDP configurations as well as cookies and browser\ncredentials from Opera, Brave, Microsoft Edge, Mozilla Firefox, and Google Chrome since browsers store passwords and\ncookies in an encrypted form.\n\nUnfortunately, it does not take the infostealer a lot of effort to decrypt the passwords and cookies. Some of the main\nprerequisites needed to decrypt browser credentials and cookies are shown in Exhibit 28.\n\n**[Local State – file that contains the browser’s configuration including encrypted DPAPI (Data Protection API)](https://en.wikipedia.org/wiki/Data_Protection_API)**\nencryption key.\n**Login Data – sqlite3 database that stores user’s encrypted passwords, URLs, and username.**\n**os_crypt and encrypted_key – the DPAPI encryption key extracted from Local State file and base64-decoded.**\n\n[The infostealer then calls the CryptUnprotectData function to decrypt the data.](https://docs.microsoft.com/en-us/windows/win32/api/dpapi/nf-dpapi-cryptunprotectdata)\n\n\n-----\n\n_Exhibit 28: Decryption function for browser credentials and cookies_\n\nThe infostealer fingerprints OS information and sends it to the C2 using the similar pattern as we mentioned before in the\nbackdoor. Communication with C2 channels is also similar with the backdoor using a hard-coded RSA key and symmetric\nAES CBC algorithm.\n\n## How eSentire is Responding\n\nOur Threat Response Unit (TRU) combines threat intelligence obtained from research and security incidents to create\npractical outcomes for our customers. We are taking a full-scale response approach to combat modern cybersecurity\nthreats by deploying countermeasures, such as:\n\nImplementing threat detections and BlueSteel, our machine- learning powered PowerShell classifier, to identify\nmalicious command execution and exploitation attempts and ensure that eSentire has visibility and detections are\nin place across eSentire MDR for Endpoint and Network.\nPerforming global threat hunts for indicators associated with SolarMarker.\n\nOur detection content is supported by investigation runbooks, ensuring our SOC analysts respond rapidly to any intrusion\nattempts related to a known malware Tactics, Techniques, and Procedures (TTPs). In addition, TRU closely monitors the\nthreat landscape and constantly addresses capability gaps and conducts retroactive threat hunts to assess customer\nimpact.\n\n## Recommendations from eSentire’s Threat Response Unit (TRU)\n\nWe recommend implementing the following controls to help secure your organization against the SolarMarker malware:\n\n[Implement a Phishing and Security Awareness Training (PSAT) program that educates the employees about the](https://www.esentire.com/what-we-do/managed-vulnerability-and-risk/technical-testing/security-awareness-training-managed-phishing-training)\nthreat landscape.\n\nTrain users to recognize ‘normal’ file extensions from ‘abnormal’ extensions.\nEncourage your employees to use password managers instead of using the password storage feature\nprovided by web browsers.\nReview eSentire’s blogs and Security Advisories to stay up to date on the latest threats and trends impacting\nthe threat landscape.\nConfirm that all devices are protected by ensuring that anti-virus signatures are up-to-date and using a Next-Gen\nAV (NGAV) or Endpoint Detection and Response (EDR) solution to detect and contain threats.\nEnsure the role-based access control (RBAC) that restricts system access to authorized users is in place.\n\nWhile the TTPs used by adversaries grow in sophistication, so does your organizations defenses. Preventing the various\nattack paths utilized by the modern threat actor requires actively monitoring the threat landscape, developing, and\ndeploying endpoint detection, and the ability to investigate logs & network data during active intrusions.\n\n\n-----\n\neSentire s TRU team is a world class team of threat researchers who develop new detections enriched by original threat\nintelligence and leverage new machine learning models that correlate multi-signal data and automate rapid response to\nadvanced threats.\n\nIf you are not currently engaged with an MDR provider, eSentire MDR can help you reclaim the advantage and put your\nbusiness ahead of disruption.\n\n[Learn what it means to have an elite team of Threat Hunters and Researchers that works for you. Connect with an](https://www.esentire.com/get-started)\neSentire Security Specialist.\n\n## Appendix\n\n### Indicators of Compromise\n\n|Name|Indicators|\n|---|---|\n|C2|37.120.237[.]251|\n|C2|37.120.233[.]92|\n|C2|45.42.201[.]248|\n|C2|92.204.160[.]233|\n|C2|146.70.40[.]236|\n|C2|146.70.53[.]153|\n|C2|146.70.101[.]97|\n|C2|146.70.88[.]119|\n|C2|188.241.83[.]61|\n|C2|86.106.20[.]155|\n|Types-Of-Writs-Texas.exe|85fb7076044071a28afb43bec12e4f8ce93525132b2ae512934529f9f09895a5|\n|Accounting-For-Contract-Cancellation- Fees-Aspe.exe|11543f09c416237d92090cebbefafdb2f03cec72a6f3fdedf8afe3c315181b5a|\n|Mto-Medical-Review-Form.exe|7cc35fbce4b353c541f1ee62366248cc072d1c7ce38b1d5ef5db4a2414f26e08|\n|Ny-Motion-To-Quash-Third-Party- Subpoena.msi|1ed9469724b3ba2891dc0efee29b1de93054601cb44aaf433c2b5860884dfa71|\n|Bullet-Statements-For-Ncoer.msi|57171e869512862baa9e4fd15b18c1d577a31f2ca20b47435f138f989bca2d72|\n|Metlife-Disability-Waiver-Of-Premium- Benefit-Rider.msi|bc7986f0c9f431b839a13a9a0dfa2711f86e9e9afbed9b9b456066602881ba71|\n|Free-Business-Partner-Contract- Template.msi|0adfbce8a09d9f977e5fe90ccefc9612d1d742d980fe8dc889e10a5778592e4d|\n|London-Two-Party-Consent.exe|af0220126a369878bda6f4972d8d7534964dea73142c18e439a439373f67ec21|\n|Tower-Crane-Dismantling-Method- Statement.xe|d7067ecb291c79ccd3a4d745413b85451ca26b92015a45f9ed6e5304ac715299|\n|deimos.dll (SolarMarker backdoor)|586607b7d094e4acb3373d6812e62b870c64d17f18b7c5fd929d4418a61b4f30|\n|deimos.dll (SolarMarker backdoor)|0f0ceeec9f5bca4b257997ed6adf599e8cf5c1c890fb1fa949e6905563152216|\n\n\n-----\n\n|9af342fe404749aa973fcec40fd4ed44.dll (SolarMarker backdoor)|eeecc2bd75ec77db22de5c47efe1fbef63c6b310d34bac6e3b049eef7f86c90b|\n|---|---|\n|e83a74b0-0d5f-45cf-b53f- 6f94e2346951.dll (SolarMarker backdoor observed in August 2021)|0351dc341644bab0fff06d882510255941c9f3eb44dcdd444a54f68fbcd2d62c|\n|7aa897bd-8618-4569-be79- d5ec94156c87.dll (SolarMarker Infostealer)|fb6c91bcf21a2cb7252672c77f85585fdc3ff6f74486a4370d566a75c146a45a|\n\n\n### Yara Rules\n\nThe Yara rule for the malicious DLL and the executable:\n```\nimport \"pe\"\nrule SolarMarker_backdoor {\n  meta:\n    author = \"eSentire TI\"\n    date = \"04/13/2022\"\n    version = \"1.0\"\n  strings:\n    $string1 = \"ezkabsr\" wide fullword nocase\n    $string3 = \"deimos.dll\" wide fullword nocase\n    $string4 = \"solarmarker.dat\" wide fullword nocase\n    $string5 = \"dzkabr\" wide fullword nocase\n    $string6 = \"Invoke\"\n    $string7 = \"set_UseShellExecute\"\n  condition:\n    2 of ($string*) and\n    (uint16(0) == 0x5A4D or uint32(0) == 0x4464c457f)    \n}\nimport \"pe\"\nrule SolarMarker_stealer {\n  meta:\n    author = \"eSentire TI\"\n    date = \"04/13/2022\"\n    version = \"1.0\"\n  strings:\n    $string1 = \"exodus.wallet\" wide fullword nocase\n    $string2 = \"*wallet*.dat\" wide fullword nocase\n    $string3 = \"*.rdp\" wide fullword nocase\n    $string4 = \"default.rdp\" wide fullword nocase\n    $string5 = \"\\\\atomic\\\\Local Storage\\\\leveldb\"\n    $string6 = \"\\\\Login Data\"\n    $string7 = \"uniq_hash\" wide fullword nocase\n  condition:\n    5 of ($string*) and\n    (uint16(0) == 0x5A4D or uint32(0) == 0x4464c457f)    \n}\nimport \"pe\"\nrule SolarMarker_payload {\n  meta:\n    author = \"eSentire TI\"\n    date = \"04/13/2022\"\n    version = \"1.0\"\n  strings:\n    $string1 = \"IOSdyabisytda\" wide fullword nocase\n    $string2 = \"PowerShell\" \n    $string3 = \"Invoke\"\n    $string4 = \"ProcessStartInfo\"\n  condition:\n    3 of ($string*) and\n    (uint16(0) == 0x5A4D or uint32(0) == 0x4464c457f)    \n}\n\n```\n\n-----\n\n### Skip To:\n\nKey Takeaways:\nSolarMarker Technical Analysis\nHow eSentire is Responding\nRecommendations from eSentire’s Threat Response Unit (TRU)\nAppendix\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-27 - eSentire Threat Intelligence Malware Analysis- SolarMarker.pdf"
    ],
    "report_names": [
        "2022-04-27 - eSentire Threat Intelligence Malware Analysis- SolarMarker.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535794,
    "ts_updated_at": 1743041678,
    "ts_creation_date": 1653785627,
    "ts_modification_date": 1653785627,
    "files": {
        "pdf": "https://archive.orkl.eu/8563064c87eaf5432bd33081bc8d8289834de3e5.pdf",
        "text": "https://archive.orkl.eu/8563064c87eaf5432bd33081bc8d8289834de3e5.txt",
        "img": "https://archive.orkl.eu/8563064c87eaf5432bd33081bc8d8289834de3e5.jpg"
    }
}