{
    "id": "92495499-4872-445d-b65c-8ccbd06eb38c",
    "created_at": "2023-04-05T02:10:16.310816Z",
    "updated_at": "2025-03-27T02:11:47.699079Z",
    "deleted_at": null,
    "sha1_hash": "7c388375a3b29c9f1bd95d54ef8a24f2df3c462f",
    "title": "2017-05-31 - Operation Bachosens- A detailed look into a long-running cyber crime campaign",
    "authors": "",
    "file_creation_date": "2023-04-03T08:28:33Z",
    "file_modification_date": "2023-04-03T08:28:33Z",
    "file_size": 461865,
    "plain_text": "# Operation Bachosens: A detailed look into a long-running cyber crime campaign\n\n**[medium.com/threat-intel/cybercrime-investigation-insights-bachosens-e1d6312f6b3a](https://medium.com/threat-intel/cybercrime-investigation-insights-bachosens-e1d6312f6b3a)**\n\nJon DiMaggio April 3, 2018\n\nJon DiMaggio\n\nMay 31, 2017\n\n\n10 min read\n\nA recent investigation into a unique malware attack on an automotive parts supplier in China\nended quite unexpectedly. As well as discovering rarely-used malware techniques, we also\ndiscovered unexpected motivations of the individual who is likely behind the attacks, and the\ngreat lengths he went to for relatively meager gain.\n\n\n-----\n\nIn March 2016, Symantec s automated attack notification systems, which run on our vast\ntelemetry, identified a potentially interesting targeted attack. One of the initial interesting\nattributes of the attack was the small number of organizations and regions targeted. Our\ninitial triage found a custom keylogger, along with two unknown suspicious files.\n\n## Part 1: Following the malware\n\nAnalyzing the unknown samples, we confirmed they were a new backdoor Trojan that\nSymantec now detects as [Trojan.Bachosens. Once the Bachosens malware is dropped on](https://www.symantec.com/security_response/writeup.jsp?docid=2017-022316-1436-99)\nthe victim computer, it creates a number of files which, in this instance, were designed to\nmasquerade as the legitimate Java application on the target’s computer to avoid detection:\n\n_%AppData%\\Java\\jusched.exe_\n\n_%CommonProgramFiles%\\java\\jusched.exe_\n\n_%CommonProgramFiles%\\java\\java update\\jusched.exe_\n\n_%CommonProgramFiles%\\jusched.exe_\n\n_%System%\\_\n\n_%System%\\_\n\n_%System%\\_\n\nTrojan.Bachosens then creates a registry entry so that it remains persistent on the computer\nand runs every time Windows starts:\n\n_HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\”JavaUpdater” =_\n_“[PATH TO MALWARE]\\jusched.exe -v”_\n\nBoth a 32 bit and a 64 bit keylogger were also identified being used in these attacks,\ndepending on the target’s environment. This was our first clue that the attacker was tailoring\ntheir tools and malware specifically for targets’ environments. The keylogger was not\ndropped by the malware, so we suspect it is pushed manually by the attacker to systems of\ninterest after the initial infection.\n\nOnce we had this information, the next step was to uncover the communication protocol of\nthe backdoor. Right away, we discovered the backdoor used a domain generation algorithm\n(DGA). A DGA causes the command and control (C&C) server that the threat communicates\nwith to change depending on the current date. This makes shutting down the attacker’s\ninfrastructure more difficult.\n\n\n-----\n\nSome malware will generate hundreds or thousands of possible C&C domains as part of\ntheir DGA. Oddly, the Bachosens attacker developed his malware to only generate 13\ndomains per year. Only two of the 13 domains are active at any given time: one domain that\nchanges each month, and another that is static for the entire year.\n\nFor the monthly changing domain, Bachosens’ DGA generates a predefined number of\nrandom characters seeded by the current date and pairs them with a free Dynamic DNS\n(DDNS) provided root domain:\n\nFor the yearly domain, Bachosens does the same, but ads .com rather than a static root\ndomain.\n\nOnce we figured out this algorithm, we were able to generate all the domains for 2016 and\n2017.\n\nHowever, even after determining the threat used a DGA, we still had not fully uncovered the\nbackdoor’s C&C protocol. What we discovered next was not only unexpected, but became\nthe catalyst for us to dig further.\n\n## Covert channels\n\nMost backdoors use HTTP or HTTPS for communicating with their C&C servers, but this\nmalware was communicating over DNS, ICMP, and HTTP protocols.\n\nOur analysis showed the attacker actually coded the malware to attempt DNS (domain name\nsystem) communication first, switching to alternative methods only when necessary. DNS is\nthe protocol used to translate domain names (example.com) into IP addresses (127.0.0.1).\nUsing DNS for C&C communication has been documented previously, such techniques were\nseen being used in malware found in the Shadow Brokers leak, but it is rare.\n\nIn this case, the malware sends data encoded within the domain name to the DNS server\nand receives data from the attacker in the DNS response packet. DNS response records can\nprovide multiple IP addresses and Bachosens relies on DNS AAAA response records. An\nAAAA response contains the requested domain’s 128-bit IPv6 address. Instead of a valid\nIPv6 address, the address is encoded data from the attacker. Below is an example of the\nDNS traffic seen in the initial communication:\n\nThe information transmitted in the initial communications from the malware to the DNS\nserver includes an attacker-determined “Infection ID” (decoded below), along with the\ninfection date.\n\nSo, for example, “lok4723peoi8n1c0mk23rtmc91z” is decrypted to\n“0c23ca440908c1e80301020000000000”, which can be decoded into the “infection id” and\ninfection date below:\n\n\n-----\n\n_nonce = 0c_\n\n_cksum = 23ca (verification PASS)_\n\n_infection_id = c1080944_\n\n_infection_year = 2016_\n\n_infection_month = 8_\n\n_infection_day = 8_\n\n_infection_random = 0944_\n\n_sid_relative_identifier = 1000_\n\n_request_kind = 0201_\n\n_padding_size = 0_\n\n_request_sequence = 00000000_\n\nThe DNS server responds back to the malware with a provided “session ID” and an RSAencrypted communication channel is established over the same protocol where the victim’s\nenvironment, including operating system, computer name, and user name, is sent to the\nattacker.\n\nThe malware can perform this handshake and session establishment in a similar manner\nusing DNS A records, DNS TXT records, ICMP Echo packets, and HTTP. After the\ncommunication channel session is established, the attacker has been seen to change\nprotocols. For example, the attacker can instruct the malware to change from DNS to ICMP\nby sending the command “conn icmp <id>”.\n\nWhile DNS is considered a covert method of communication, once we discovered it was\nbeing used we could search for historical DNS request and response records and decode\nthe infection ID associated with each target and the precise infection date. This allowed us to\nbuild an accurate timeline based on the attacker’s own metrics. Through this process we\nwere able to determine the adversary was active and present on the automotive victim’s\nnetwork from December 2016 through February 2017.\n\nThe historic DNS records also confirmed attempted attacks on two other organizations: a\ncommercial airline and an organization involved in the online entertainment industry.\n\nWhile analyzing the malware we also came across an interesting aspect that could provide\nsupport for attribution. Russian strings for data sizes were used. For example, б and гб were\nfound in the binary, which are the Russian equivalents of bytes (B) and gigabytes (GB).\n\n\n-----\n\n## Part 2: Determining attacker motivation\n\nAt this point in the investigation, we had a solid grasp of the malware features, including its\nunique communication protocol. However, the limited and diverse targets of an automotive\nparts supplier, an airline, and an online entertainment organization were puzzling. The\nautomotive parts supplier was especially worrisome in the context of the recent Vault 7 leaks,\nwhich describe automobile hacking by a likely nation state. Understanding the objective of\nthese attacks and who else may be a target was necessary. The following were the likely\nscenarios:\n\n**1. Could this be corporate espionage in which intellectual property is being stolen for the**\nadvantage of a competing firm?\n\n**2. Could this be a financially motivated cyber crime gang with the ability to develop or**\npurchase unique undetected malware?\n\n**3. Could this be a nation-state attacker with a sabotage motivation?**\n\nThrough our reconstructed infection timeline, we were able to see what systems the\nadversary spent the most time on and noticed a reoccurring theme in the targets of interest.\nThe systems in which the attacker spent the most time were automotive technology\ndeveloper systems. Of the developer systems, the primary technology that appeared to be of\ninterest to the attacker involved the development of a very specific automotive diagnostic\ntechnology. This technology is loaded into handheld diagnostic devices and sold to\nautomotive repair shops globally. To protect the victims we are masking the technology and\nproduct name and will refer to it as “Diag-1000” for the remainder of the article.\n\n## Part 3: Attacker infrastructure and IOC ties\n\nIn addition to understanding the attack methods and victim profiles, analyzing the attacker’s\ninfrastructure can provide potential attribution clues. The earliest known Bachosens\nkeylogger from December 2013 did not rely on a DGA to generate the C&C domain but\ninstead connected to the hardcoded domain of “pstars.org”. As seen in the diagram below,\npstars.org used the name servers ns1.oyy[.]name & ns2.oyy[.]name.\n\nAt this point in the investigation, we had more than 70 samples we had analyzed made up of\ntwo versions of the Bachosens Trojan and two versions of the keyloggers. Using internal\nsystems that can find similar malware samples, we were able to then identify another\npreviously unknown sample associated with the attacker. The sample looked like it was\ndeveloped for testing purposes as opposed to actually being used in attacks. The attacker\nmade a mistake in their operational security with this sample, however, as it included a\nhardcoded IP address of 95.153.122.210. This IP address was associated with the domain\ngorkogo77.ddns[.]net, which is also associated with the oyy.name name servers as seen in\nthe diagram below\n\n\n-----\n\nThe AAAA record for oyy.name also led to a variety of other domains that also had similar\nIPs and registration information.\n\nLooking at the registration information for oyy.name and a number of other domains\nassociated with the above domains, we see the name Igor C****** was used, as well as the\ncommon email of “igor.********@gmail.com” and the phone number “+373.7777****”. In\naddition, the addresses were all located in Moldova. While this name may be a pseudonym,\nwe have found it, or variations of it, used consistently across the supporting infrastructure,\nincluding on a linked personal social network page.\n\nNext we looked at the common phone number used and identified a number of domains that\nwere registered with the same registrant phone number, as seen below:\n\nAfter checking the registration information for each of these domains we identified another tie\nto the registrant and Bachosens activity. The domain “funny-penny.com”, seen above with\nthe same phone number as related Bachosens domains, used the street address “str.\nGorkogo 77”, which matches the previously discovered gorkogo77.ddns.net domain used by\nBachosens.\n\nWithin these related domains, only one appears to have an active business. The domain\nsells auto parts online.\n\nFurthermore, this online shop actually has a physical shop in Moldova that matches the\ndomain registration information.\n\nWe now knew the registrant of the infrastructure used to compromise an automotive\ntechnology supplier was also associated with an automotive parts shop in Moldova. But why\nthis automotive technology supplier was compromised wasn’t yet completely clear.\n\nPivoting off the registration information led to a variety of other sites, including Android\napplications developed by the same individual and a GitHub site. The aliases and email\naddresses used on these sites finally led to forum postings with the subjects (translated):\n\n_The [ DIAG-1000 ] (All Android / the IOS)_\n\n_Sale upgrade scan tool [ DIAG-1000 ]_\n\nThese posts were attempting to sell a stolen version of the exact diagnostic technology\nproduced by the victim automotive supplier. After a lengthy investigation, we discovered the\nattacker’s complex efforts appear to have been simply to steal the technology for resale on\nthe black market — a considerable effort for a technology that can be legitimately purchased\nfor around $1,100.\n\n“After a lengthy investigation, we discovered the attacker’s complex efforts appear to\nhave been simply to steal the technology for resale on the black market”\n\n\n-----\n\n## Conclusion\n\nGoing into this investigation, we thought there was a good chance this would be associated\nwith a nation-state attacker based on the regions of the victims, the highly selective targeting,\nand the methods in which the malware used covert channels to communicate and go\nundetected.\n\nThe discovery that all of the attacker’s complex coding was for such small financial gain in\nreselling stolen automotive diagnostic tools was very surprising. The attacks resulted in a\nmeager payout for the attacker, who went through such elaborate means to obtain the\nautomotive diagnostic technology. The legitimate “Diag-1000” is sold new for less than\n$1,100 and the stolen version was being sold for $110.\n\nBased on the Russian strings in the malware infrastructure, Russian characters used for data\nsize suffixes, and the open source traces left by the attacker, we are reasonably confident\nthe attacker is located in Tiraspol, Moldova and is associated with the automotive industry.\n\nThis investigation provided us with a good example as to why analysts cannot make\nassumptions when conducting an investigation and must set a hypothesis, follow the data,\nand prove or disprove that hypothesis based on the facts. The initial facts could have led one\nto believe this was a highly sophisticated operation carried out by a nation state, however, by\nfollowing the evidence and connecting the dots we were able to develop and see the\ncomplete picture of the life cycle of the Bachosens attacks against the victim organizations.\n\n_Check out the Security Response and follow Threat Intel on to keep up-to-date with the latest_\n_happenings in the world of threat intelligence and cybersecurity._\n\n_Like this story? Recommend it by hitting the heart button so others on Medium see it, and_\n_follow Threat Intel on Medium for more great content._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-05-31 - Operation Bachosens- A detailed look into a long-running cyber crime campaign.pdf"
    ],
    "report_names": [
        "2017-05-31 - Operation Bachosens- A detailed look into a long-running cyber crime campaign.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1680660616,
    "ts_updated_at": 1743041507,
    "ts_creation_date": 1680510513,
    "ts_modification_date": 1680510513,
    "files": {
        "pdf": "https://archive.orkl.eu/7c388375a3b29c9f1bd95d54ef8a24f2df3c462f.pdf",
        "text": "https://archive.orkl.eu/7c388375a3b29c9f1bd95d54ef8a24f2df3c462f.txt",
        "img": "https://archive.orkl.eu/7c388375a3b29c9f1bd95d54ef8a24f2df3c462f.jpg"
    }
}