{
    "id": "92830943-8121-47e0-9ae9-91325cfd5b27",
    "created_at": "2023-01-12T14:59:42.074133Z",
    "updated_at": "2025-03-27T02:05:25.047713Z",
    "deleted_at": null,
    "sha1_hash": "76b9b94cf177054ac744f07f913fcc29ffaa0774",
    "title": "2019-02-23 - D-Link DNS-320 NAS Cr1ptT0r Ransomware ARM Dynamic Analysis - QEMU and Raspberry PI VM",
    "authors": "",
    "file_creation_date": "2022-05-28T18:18:16Z",
    "file_modification_date": "2022-05-28T18:18:16Z",
    "file_size": 205756,
    "plain_text": "# D-Link DNS-320 NAS Cr1ptT0r Ransomware ARM Dynamic Analysis - QEMU and Raspberry PI VM\n\n**[resolverblog.blogspot.com/2019/02/d-link-dns-320-nas-cr1ptt0r-ransomware.html](https://resolverblog.blogspot.com/2019/02/d-link-dns-320-nas-cr1ptt0r-ransomware.html)**\n\nHi Everybody,\n\na few days ago I saw a tweet from @Amigo_A_ asking for help about a new ransomware\nwhich was affecting a D-Link 320 NAS.\n\nThe first thought was directed to the historical disabling of dlink to make sufficiently secure\nfirmware and their willingness not to support updates. Those facts made me to think about\nan attack conducted over the net targetting all the devices exposed on internet itself.\n\nApparently was the right hypothesis.\n\nAll the users with D-Link 320XX are nowdays are at very high risk.\n\n**TURN OFF THE DEVICE AND DISCONNECT IT FROM WAN.On** BleepingComputer's\nforum I asked to the affected users to check their own firmwares and trying to grab the\nmalware. Someone did and shared the ELF on VirusTotal.\n\nThanks to Michael Gillespie @demonslay335 I was able to have a copy of that sample.\n\nHash: 9a1de00dbc07271a27cb4806937802007ae5a59433ca858d52678930253f42c1\n\n\n-----\n\n(very few) years ago I had experience on some router exploiting and reversing (Italian ISP\ncompany named Telecom Italia and their ADSL routers), they were based on MIPS with a\nvery good OS (Jungo OpenRG) always trivial to exploit. But this is another story, I'lve spent a\nlot of time on those devices learning some useful stuffs which today apparently become a\ngood knowlege.\n\nSince the fact that this ransomware is stripped (with removed debugging informations!) and\nstatically compiled, the static analysis is very hard to do since the fact that any calls appear\nto be just a sub_XXXXX because of the stripped ELF.\nBecause of this, we have few options to make our life less complicated:\n1) do a dynamic analysis\n2) create IDA pro FLIRT signatures\n\nStarting from the first point we faced a new problem: where to run the ARM malware?\n2 opportunities: the first on a QEMU VM, the second on a D-Link device (of course lol).\nI do not buy D-Link stuffs, so I had only one opportunity: QEMU.\nSince I'm lazy (and the executable is statically linked), I decided to try with my Kali x64 VM\nand qemu-static-arm with -g parameter which enable the gdb debugger.\nI really dont know why, but something go wrong bringing ida pro to crash. LOL 😔\n\nIt was a fail, so I've started to look at a new easy path and I thought about raspberry pi.\nOn Sourceforge there is a nice prebuild, preconfigured QEMU Raspberry emulator:\nhttps://sourceforge.net/projects/rpiqemuwindows/\nOn the run.bat file I've added a parameter to be able in order to upload with FileZilla over sftp\nprotocol the malware and the remote debug server, and then killing the sshd, I've used the\nsame port to connect with IDA. Smart lazyness😀\n\nqemu-system-arm.exe -M versatilepb -cpu arm1176 -hda 2012-07-15-wheezy-raspbian.img **redir tcp:2200::22 -kernel kernel-qemu -m 192 -append \"root=/dev/sda2\"**\n\nStarting again the IDA Pro remote debugging, the following stuffs comes up!!!!! YEAH IT\nWORKS!!!! 😍😍\n\nSo far we know few things about such ransomware which are:\n\n\n-----\n\nin addition, the strings shows up that he also use crypto routines from Libsodium library\nhttps://libsodium.gitbook.io/doc/\n\n\n-----\n\nLike I said before, the - hardest - next step is to create a IDA FLIRT signature, by cross\ncompiling some example from Libsodium repo (hoping that it will use the same functions as\nthe malware), extract the signatures by using FireEye idb2pat tool\nhttps://www.fireeye.com/blog/threat-research/2015/01/flare_ida_pro_script.html to have an\nunderstandable static analysis to MAYBE retrive the private key and decrypt the files, or at\nleast have a reduced keyspace to make possible a brute force attack.\n\nFollow me on Twitter and I'll keep you updated.\nCheers\nRE Solver\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-02-23 - D-Link DNS-320 NAS Cr1ptT0r Ransomware ARM Dynamic Analysis - QEMU and Raspberry PI VM.pdf"
    ],
    "report_names": [
        "2019-02-23 - D-Link DNS-320 NAS Cr1ptT0r Ransomware ARM Dynamic Analysis - QEMU and Raspberry PI VM.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535582,
    "ts_updated_at": 1743041125,
    "ts_creation_date": 1653761896,
    "ts_modification_date": 1653761896,
    "files": {
        "pdf": "https://archive.orkl.eu/76b9b94cf177054ac744f07f913fcc29ffaa0774.pdf",
        "text": "https://archive.orkl.eu/76b9b94cf177054ac744f07f913fcc29ffaa0774.txt",
        "img": "https://archive.orkl.eu/76b9b94cf177054ac744f07f913fcc29ffaa0774.jpg"
    }
}