{
    "id": "928b6753-6473-4061-849a-b9e6b8ea8833",
    "created_at": "2023-01-12T15:04:55.394719Z",
    "updated_at": "2025-03-27T02:06:00.813045Z",
    "deleted_at": null,
    "sha1_hash": "e7f7b4fe9996f22f0616e7a0357807f2b3ec31c1",
    "title": "2011-07-26 - SpyEye Trojan defeating online banking defenses",
    "authors": "",
    "file_creation_date": "2022-05-28T03:56:30Z",
    "file_modification_date": "2022-05-28T03:56:30Z",
    "file_size": 70085,
    "plain_text": "# SpyEye Trojan defeating online banking defenses\n\n**[computerworld.com/article/2509482/spyeye-trojan-defeating-online-banking-defenses.html](https://www.computerworld.com/article/2509482/spyeye-trojan-defeating-online-banking-defenses.html)**\n\nBanks are facing more trouble from SpyEye, a piece of malicious software that steals money\nfrom people's online bank accounts, according to new research from security vendor\nTrusteer.\n\nSpyEye is a particularly nasty piece of malicious software: it can harvest credentials for\nonline accounts and also initiate transactions as a person is logged into their account,\nliterally making it possible to watch their bank balance drop by the second.\n\nIn its latest versions, SpyEye has been modified with new code designed to evade advanced\nsystems banks have put in place to try and block fraudulent transactions, said Mickey\nBoodai, Trusteer's CEO.\n\nBanks are now analyzing how a person uses their site, looking at parameters such as how\nmany pages a person looks at on the site, the amount of time a person spends on a page\nand the time it takes a person to execute a transaction. Other indicators include IP address,\nsuch as if a person who normally logs in from the Miami area suddenly logs in from St.\nPetersburg, Russia.\n\nSpyEye works fast, and can automatically and quickly initiate a transaction much faster than\nan average person manually on the website. That's a key trigger for banks to block a\ntransaction. So SpyEye's authors are now trying to mimic -- albeit in an automated way -how a real person would navigate a website.\n\n\n-----\n\nThey used to pay less attention to the way they execute transactions on the bank s website\nand now they are really trying to show normal user patterns,\" Boodai said. \"\n\nBoodai said he has little idea of how successful SpyEye's new evasion code is, although\nTrusteer does collect intelligence from banks that have distributed its browser security tool,\nRapport, to their customers. Trusteer has also noticed that SpyEye in recent months has\nexpanded the number of financial institutions it is able to target in an increasing number of\ncountries.\n\nNew target countries include Russia, Saudi Arabia, Bahrain, Oman, Venezuela, Belarus,\nUkraine, Moldova, Estonia, Latvia, Finland, Japan, Hong Kong and Peru. What that means is\nthat more criminal groups around the world are purchasing the SpyEye toolkit, Boodai said.\n\nFinancial institutions continue to increase their security spending to protect online\ntransactions, said Avivah Litan, an analyst at Gartner who regularly consults banks on\nsecurity issues.\n\nEven to her, financial institutions are coy about revealing how hard they've been hit, but\n\"everyone refers to Zeus or SpyEye -- some as common as the word 'teller'\" Litan said.\n\nPolice have had some limited successes. In April, a 26-year-old Lithuanian and a 45-year-old\nLatvian were charged with conspiracy to cause unauthorized modifications to computers,\nconspiracy to defraud and concealing proceeds from crime for allegedly using SpyEye. A\nthird, 26-year-old man whose nationality was not revealed was bailed pending further\nquestioning.\n\nSpyEye is actually a botnet with a network of command-and-control servers hosted around\nthe world. As of Tuesday, some 46 command-and-control servers were online, according to\nthe [SpyEye Tracker, a website dedicated to gathering statistics about the malicious software.](https://spyeyetracker.abuse.ch/)\n\nThat is sharply up. In May, there were just 20 or so active servers responding to computers\nthat were infected with SpyEye, said Roman Hüssy, who runs the site.\n\n\"SpyEye is growing quite well,\" he said.\n\n_Send news tips and comments to jeremy_kirk@idg.com_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2011/2011-07-26 - SpyEye Trojan defeating online banking defenses.pdf"
    ],
    "report_names": [
        "2011-07-26 - SpyEye Trojan defeating online banking defenses.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535895,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653710190,
    "ts_modification_date": 1653710190,
    "files": {
        "pdf": "https://archive.orkl.eu/e7f7b4fe9996f22f0616e7a0357807f2b3ec31c1.pdf",
        "text": "https://archive.orkl.eu/e7f7b4fe9996f22f0616e7a0357807f2b3ec31c1.txt",
        "img": "https://archive.orkl.eu/e7f7b4fe9996f22f0616e7a0357807f2b3ec31c1.jpg"
    }
}