{
    "id": "92dcd15f-f79c-46e1-a656-b1bf98d02f5d",
    "created_at": "2023-01-12T15:09:55.936182Z",
    "updated_at": "2025-03-27T02:13:21.373961Z",
    "deleted_at": null,
    "sha1_hash": "da12027541e09fe201aaf8cfc8fa30c6fa7fbf63",
    "title": "2019-10-14 - Threat Actor Profile- TA407, the Silent Librarian",
    "authors": "",
    "file_creation_date": "2022-05-28T22:01:53Z",
    "file_modification_date": "2022-05-28T22:01:53Z",
    "file_size": 2783351,
    "plain_text": "# TA407 Overview (Mabna Institute, Silent Librarian)\n\n**[proofpoint.com/us/threat-insight/post/threat-actor-profile-ta407-silent-librarian](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta407-silent-librarian)**\n\n\nOctober 9, 2019\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nThreat Actor Profile: TA407, the Silent Librarian\n\n\n-----\n\n## Threat Actor Profile: TA407, the Silent Librarian\n\nOctober 14, 2019 The Proofpoint Threat Insight Team\n\n## Overview\n\nIn our September 5, 2019, Threat Insight post, “Seems Phishy: Back To School Lures Target\nUniversity Students and Staff,” we discussed the seasonal uptick of phishing campaigns that\nare directed at university students and staff, usually between June and October of every\n[year. Since our blog post, colleagues at Secureworks have provided further details on one](https://www.secureworks.com/blog/cobalt-dickens-goes-back-to-school-again)\nactor we highlighted, tracked by Proofpoint as TA407, also known as Silent Librarian, Cobalt\nDickens, and Mabna Institute. In this blog, we provide additional insight into the actor and\ntheir evolving TTPs in ongoing, academia and university campaigns.\n\n[Like many educational phishing attacks, campaigns associated with TA407 are typically not](https://www.proofpoint.com/us/threat-reference/phishing)\ngeographically targeted, but rather tied to specific universities, with phishing landing pages\ndeveloped for library and student or faculty access portals. While many of the attacks are\ndirected at schools in the United States, Proofpoint researchers regularly observe campaigns\naffecting universities primarily in North America and Europe.\n\nSilent Librarian is a prolific financially motivated actor operating out of Iran. In early 2018, the\nUS Department of Justice indicted nine members of the cybercrime group for hacking, wire\nfraud, and identity theft. In particular, the group was cited for “obtain[ing] unauthorized\n_access to computer systems, steal[ing] proprietary data from those systems, and sell[ing]_\n_that stolen data to Iranian customers, including the Iranian government and Iranian_\n_universities.”_\n\nThe indictment alleges that between 2013 and 2017, TA407’s activities resulted in the\nfollowing damages:\n\n\n-----\n\nApproximately $3.4 billion worth of intellectual property loss due to unauthorized\naccess\n31.5 terabytes of academic data and IP theft from compromised universities\n7998 university accounts were successfully compromised worldwide\n3768 accounts compromised that belonged to professors at US-based universities\n\nVictims of the scheme included:\n\nApproximately 144 universities in the United States\n176 foreign universities in 21 countries\nFive federal and state government agencies in the United States\n36 private companies in the United States\n11 foreign private companies\nTwo international non-governmental organizations\n\nThe DOJ indictments, however, have had no appreciable effect on the group’s activities and\nuniversity email account compromises are ongoing, building on the success of previous\ncampaigns.\n\n## Mabna Institute Tactics, Techniques, and Procedures\n\nMabna Institute (AKA TA407) primarily targets universities and higher education institutions\nworldwide with low-volume (tens or hundreds of messages), target-specific campaigns.\n[These university phishing campaigns utilize well-crafted social engineering mechanisms](https://www.proofpoint.com/us/corporate-blog/post/cybersecurity-101-what-social-engineering)\nincluding:\n\nStolen university branding\nFake email signatures/credentials/addresses\nUniversity-specific email bodies/portal clones\nThemed subject lines (e.g., “Renewal of loaned items”, “Renew your loaned items”,\n“Renewal of materials”, \"Overdue notice on loaned items\", and \"Library Services\")\n\nSince the beginning of 2019, Proofpoint researchers observed several TA407 campaigns\ndistributing phishing URLs leading to clones of university library login pages. Although TA407\nhas made minor updates to their social engineering techniques and infrastructure, their\nstrategies have been overall rather consistent. Many of these campaigns use the same lures\nwith minor variations in phrasing.\n\nHistorically, the group has employed the use of a series of phishing origin points, abusing\naccess first at one university and then another. TA407 makes extensive use of Freenom\ndomains to host credential phishing landing pages; the group then abuses compromised\naccounts at universities to phish users at other universities, compromising additional\naccounts and spreading from school to school.\n\n\n-----\n\nProofpoint researchers have observed changes in TA407 s tactics, techniques, and\nprocedures (TTPs), particularly in their use of URL shorteners, linking, and abuse of\nlegitimate services and infrastructure. While the group does not always use URL shorteners,\nthese frequently appear in their mix of linking and redirection techniques.\n\nThe following Freenom domains were observed in use by TA407 in September. A complete\nlist of such domains used since January appears in the Appendix.\n\natll[.]tk\nazll[.]tk\ncllt[.]cf\ncllt[.]tk\nfill[.]cf\nitll[.]tk\nllit[.]cf\nlliz[.]cf\nnlll[.]tk\nntil[.]cf\nsitt[.]cf\ntlit[.]cf\nttit[.]cf\nvisc[.]cf\nxill[.]cf\nzlll[.]tk\n\nFigure 1 illustrates the flow of a typical TA407 campaign. Note the abuse of universitycontrolled URL shortening services and compromised email accounts.\n\n\n-----\n\n-----\n\n_Figure 1: Typical attack flow of TA407/Silent Librarian_\n\nProofpoint researchers frequently observe Silent Librarian’s phishing attempts originating\nfrom a university unrelated to their current target using a separate, unrelated university’s\nURL shortening service. This short URL links to a phishing landing page either directly or via\none or more third-party sites that eventually lands the user on a clone of a login portal hosted\non an actor-controlled server.\n\nThe following illustration depicts the attack flow of the actor’s use of phishing links starting at\nany of the redirection phases. Variation between university-based URL shorteners and free\nshorteners represents one of the shifting TTPs observed in Silent Librarian’s recent activity.\n\n_Figure 2: How TA407 utilizes short URL services in its phishing attack redirections._\n\nOver time, Proofpoint researchers have observed TA407 abuse several short URL services\nfor initial redirection to phishing landing pages. These have included the now discontinued\nGoogle URL shortening service, .ir-based short URL services, and .edu URL shorteners. We\nobserved apparent experimentation with university-based URL shorteners prior to the\ndiscontinuation of Google’s goo.gl services. Earlier in 2019, after goo.gl was discontinued,\nabuse of university URL shortening services appeared to increase and has been observed\nas recently as September of 2019.\n\n## Campaign Lure Examples\n\nVery little has changed with TA407’s phishing lures in 2019. Most phish lures are themed\naround library access.\n\n\n-----\n\n_Figure 3: Example of a library access phish lure from TA407_\n\nOver time, Proofpoint researchers have observed slight adjustments in lure verbiage, but\nmost continue to emphasize loss of library access privileges:\n\n\n-----\n\n_Figure 4: Example of how TA407’s lure verbiage has evolved over time_\n\n\n-----\n\n_Figure 5: Basic lure verbiage by TA407. This style has been used for years._\n\nIn many examples, TA407 uses stolen branding from the university being targeted. In the\nfollowing example, we have redacted the image of the signature block using the school logo\nthat was used in the message body.\n\n\n-----\n\n_Figure 6: More evolution in attack verbiage from TA407_\n\nTA407 has demonstrated awareness of close to real-time changes in authentication portal\ntraits, such as weather notification banners, that are sometimes reflected on the landing\npage clones used in their campaigns. The awareness manifests in both the lure wording\nand/or landing page appearance. However, Proofpoint researchers do occasionally observe\nwhat appears to be an outdated clone of a previous version of their target's portal,\nsuggesting either inconsistent updates or coincidental timing of clone updates.\n\n\n-----\n\nFigure 7: Fake university login portal with spoofed display name, stolen branding, and\naccurate weather forecast warning\n\n## Conclusion\n\nLast year’s DOJ indictments had no appreciable effect on curtailing the activities of TA407.\nCampaigns with the apparent intent to compromise user accounts at universities are ongoing\nwith new Freenom domains appearing in September to host phishing pages. Most notably,\n\nTA407 takes advantage of publicized downtime and weather alerts, among other\nevents, to add credibility to the phish, increasing the risk for universities and their\nconstituents.\nIn its attacks, TA407 uses a series of phishing origin points, abusing access first at one\nuniversity and then another for use against new targets. The group then appears to\ncontinue the cycle with a chosen subset of freshly compromised accounts.\nThe changes in URL shorteners, linking and hosting practices described here make\ndetection of TA407’s activities increasingly difficult for defenders and demonstrate the\nadaptability and innovation that have enabled this threat actor to drive billions of dollars\nin losses in terms of intellectual property theft and resale of stolen journal\nsubscriptions.\n\n\n-----\n\nProofpoint recommends that universities remain vigilant against these threats to prevent\nlosses and protect valuable IP and personal information. Implementing two-factor\nauthentication within publicly exposed systems can help mitigate overall attack risk and\nsubstantially increase the level of effort needed by threat actors to compromise university\naccounts.\n\n## Appendix: List of OpenTLD and Freenom domains used by TA407 since January 2019\n\n**Month observed in campaigns** **Domain**\n\nJanuary aill[.]nl\n\ncnen[.]cf\n\neill[.]nl\n\nlibt[.]ga\n\nFebruary aill[.]nl\n\ncnen[.]cf\n\neill[.]nl\n\nlibt[.]ga\n\nMarch aill[.]nl\n\ncnen[.]cf\n\nflil[.]cf\n\nlibt[.]ga\n\nllif[.]cf\n\nllit[.]cf\n\nllli[.]cf\n\nlllt[.]cf\n\n\n-----\n\nApril cill[.]ml\n\ncnen[.]cf\n\ncvve[.]cf\n\neill[.]cf\n\neill[.]ga\n\nflil[.]cf\n\nilll[.]cf\n\nlibdo[.]cf\n\nlibt[.]ga\n\nlllt[.]cf\n\nncce[.]cf\n\nnlib[.]ml\n\nnlll[.]cf\n\nnuec[.]cf\n\nrvna[.]cf\n\nMay azll[.]cf\n\nclll[.]cf\n\ncvve[.]cf\n\nflll[.]cf\n\nlibn[.]gq\n\nlibt[.]ga\n\nssll[.]cf\n\n\n-----\n\nJune blibo[.]ga\n\ncvve[.]cf\n\nelll[.]cf\n\neuve[.]tk\n\nflll[.]cf\n\njlll[.]cf\n\nlibk[.]ga\n\nlibm[.]ga\n\nlibt[.]ga\n\nlibw[.]gq\n\nlllib[.]cf\n\nmlibo[.]ml\n\nnlll[.]cf\n\nnlll[.]tk\n\ntlll[.]cf\n\nJuly cvve[.]cf\n\nelll[.]cf\n\nlibb[.]ga\n\nlibf[.]ga\n\nlibk[.]ga\n\nlibt[.]ga\n\nllii[.]xyz\n\nlzll[.]cf\n\nntll[.]cf\n\nntll[.]tk\n\nvenc[.]cf\n\n\n-----\n\nAugust clll[.]tk\n\ncllt[.]tk\n\nills[.]cf\n\nitll[.]tk\n\nliba[.]gq\n\nlibe[.]cf\n\nlibe[.]ga\n\nlibf[.]ga\n\nlibrt[.]ml\n\nlibver[.]ml\n\nllit[.]cf\n\nllli[.]nl\n\nntll[.]tk\n\nstll[.]tk\n\ntlll[.]tk\n\nttll[.]cf\n\nulll[.]tk\n\nvisc[.]cf\n\nvtll[.]cf\n\n\n-----\n\nSeptember atll[.]tk\n\nazll[.]tk\n\ncllt[.]cf\n\ncllt[.]tk\n\nfill[.]cf\n\nitll[.]tk\n\nllit[.]cf\n\nlliz[.]cf\n\nnlll[.]tk\n\nntil[.]cf\n\nsitt[.]cf\n\ntlit[.]cf\n\nttit[.]cf\n\nvisc[.]cf\n\nxill[.]cf\n\nzlll[.]tk\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-14 - Threat Actor Profile- TA407, the Silent Librarian.pdf"
    ],
    "report_names": [
        "2019-10-14 - Threat Actor Profile- TA407, the Silent Librarian.pdf"
    ],
    "threat_actors": [
        {
            "id": "7ba9e3e3-1cef-4e20-be7e-95f05e8295d7",
            "created_at": "2022-10-25T16:07:23.821494Z",
            "updated_at": "2025-03-27T02:02:09.993311Z",
            "deleted_at": null,
            "main_name": "Mabna Institute",
            "aliases": [
                "Cobalt Dickens",
                "Mabna Institute",
                "Silent Librarian",
                "TA407",
                "TA4900",
                "Yellow Nabu"
            ],
            "source_name": "ETDA:Mabna Institute",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "adc8bb1a-6ded-4b27-8163-8069d5a6d492",
            "created_at": "2022-10-25T15:50:23.566869Z",
            "updated_at": "2025-03-27T02:00:55.500642Z",
            "deleted_at": null,
            "main_name": "Silent Librarian",
            "aliases": [
                "Silent Librarian",
                "TA407",
                "COBALT DICKENS"
            ],
            "source_name": "MITRE:Silent Librarian",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "42e41377-c64c-4be9-87a0-ee903e4b9055",
            "created_at": "2023-01-06T13:46:38.950322Z",
            "updated_at": "2025-03-27T02:00:02.960397Z",
            "deleted_at": null,
            "main_name": "Silent Librarian",
            "aliases": [
                "TA4900",
                "Yellow Nabu",
                "COBALT DICKENS",
                "Mabna Institute",
                "TA407"
            ],
            "source_name": "MISPGALAXY:Silent Librarian",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9cdeb453-5ea0-479a-a09d-64c7f764118c",
            "created_at": "2024-05-01T02:03:08.012411Z",
            "updated_at": "2025-03-27T02:05:17.305083Z",
            "deleted_at": null,
            "main_name": "COBALT DICKENS",
            "aliases": [
                "SilentLibrarian ",
                "TA407 ",
                "Yellow Nabu ",
                "ITG22 "
            ],
            "source_name": "Secureworks:COBALT DICKENS",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536195,
    "ts_updated_at": 1743041601,
    "ts_creation_date": 1653775313,
    "ts_modification_date": 1653775313,
    "files": {
        "pdf": "https://archive.orkl.eu/da12027541e09fe201aaf8cfc8fa30c6fa7fbf63.pdf",
        "text": "https://archive.orkl.eu/da12027541e09fe201aaf8cfc8fa30c6fa7fbf63.txt",
        "img": "https://archive.orkl.eu/da12027541e09fe201aaf8cfc8fa30c6fa7fbf63.jpg"
    }
}