{
    "id": "92e50cb6-c2c1-4cfe-b36d-3996f2dee44a",
    "created_at": "2023-01-12T15:04:59.736609Z",
    "updated_at": "2025-03-27T02:16:26.589468Z",
    "deleted_at": null,
    "sha1_hash": "ecc1f6e0920b96000895624e719937d665f325dd",
    "title": "2021-02-05 - New in Ransomware- Seth-Locker, Babuk Locker, Maoloa, TeslaCrypt, and CobraLocker",
    "authors": "",
    "file_creation_date": "2022-05-27T22:19:13Z",
    "file_modification_date": "2022-05-27T22:19:13Z",
    "file_size": 786955,
    "plain_text": "# New in Ransomware: Seth-Locker, Babuk Locker, Maoloa, TeslaCrypt, and CobraLocker\n\n**trendmicro.com/en_us/research/21/b/new-in-ransomware.html**\n\nFebruary 5, 2021\n\nRansomware\n\nIn this entry, we give an overview of new ransomware discoveries. This includes a new ransomware family dubbed SethLocker, and developments in the variants Babuk Locker, Maoloa, TeslaCrypt, and CobraLocker.\n\nBy: Raphael Centeno, Monte de Jesus, Don Ovid Ladores, Junestherry Salvador, Nikko Tamana, Llalum Victoria February\n05, 2021 Read time: ( words)\n\n[Ransomware is in constant state of development — this is true not only of ransomware families that are big-game hunters or](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware)\nransomware families that have a targeted approach in their campaigns, but also for new ones.\n\nIn this entry, we look into a new ransomware family dubbed Seth-Locker, which was discovered while at large and is still\nunder development. We also enumerate developments in Babuk Locker, Maoloa, and a possible TeslaCrypt variant. Lastly,\nwe note the appearance of a CobraLocker variant that is at large and uses a popular game as a disguise to attract the\nattention of unwitting victims.\n\nNew ransomware Seth-Locker\n\nWe discovered a new ransomware named Seth-Locker at large. An interesting feature of this new ransomware is its\ninclusion a few backdoor routines in its malicious files, together with its ransom routine. These backdoor routines that have\nbeen observed so far are the following:\n\nopen_link for reading content from the command-and-control (C&C) server\ndown_exec for downloading and execute a file\nshell to run a command line shell command\nlocker to run the ransomware routine\nkill to terminate a process or itself\n\nOnce executed, the ransomware follows the typical routine of encrypting files and appending them with the suffix .seth,\nbefore dropping a ransom note.\n\nAs its code contains several rookie mistakes and oversights, we surmise that it is still under development. For example,\nmalware commands are easily visible and repetitions of file extensions to be checked are in its code. Additionally, another\ntell-tale sign that it is still under development is that it lacks sophistication in hiding its routines and techniques. In the future,\nhowever, it would be possible to encounter an improved version of this ransomware.\n\nDevelopments in Babuk Locker\n\n[Babuk Locker is also a new ransomware family and the first enterprise ransomware discovered in 2021. It initially identified](https://www.bleepingcomputer.com/news/security/babuk-locker-is-the-first-new-enterprise-ransomware-of-2021/)\nitself as Vasa Locker in December 2020. Babuk Locker is proving to be a fast-evolving and active ransomware. Early into\n[2021, it had already attacked several companies, utilizing the strategy of threatening to expose stolen information.](https://www.bleepingcomputer.com/news/security/babuk-locker-is-the-first-new-enterprise-ransomware-of-2021/)\n\nEven as a new ransomware-as-a-service (RaaS), its operations follow the methods of known targeted ransomware attacks.\nIts initial access likely involves compromised user accounts, exploitation of vulnerabilities, or malspam. Threat actors then\nmove laterally to make an inventory of the victim’s network and important files since they exfiltrate data as part of their\ndouble extortion method. Afterward, they finally proceed to deploying their ransomware payload. In addition, they eventually\npost the exfiltrated data on a blog or a Tor site that they operate.\n\nBabuk Locker utilizes a ChaCha8 stream cipher for encryption and Elliptic-curve Diffie-Hellman (ECDH) for key generation,\nmaking the recovery of files without gaining access to the private key highly unlikely. Chuong Dong’s [blog gives further](http://chuongdong.com/reverse%20engineering/2021/01/03/BabukRansomware/)\ndetails on how this malware operates.\n\n\n-----\n\nWhat s notable about Babuk Locker is the progression of its attacks and its threat actors use of a Tor site to communicate\nwith their victims. The oldest and first sample that we observed involved sending a typical ransom email to their target.\nMeanwhile, the second variant of the ransomware that we encountered used a Tor site, which showed a screenshot of the\ndata that the threat actors had stolen from their target. Based on this development, we can see how the group behind Babuk\nLocker is making their extortion methods more personalized and aggressive.\n\nCertain aspects of Babuk Locker have similarities with other known ransomware. In particular, the ransom note is striking as\nit matches that used by DarkSide. This is evidenced in Figure 1, which suggests that these two ransomware families could\nbe linked together. With regard to techniques, Babuk Locker also seems to have taken a page out of older ransomware like\nConti, Ryuk, and Ragnar Locker. For example, like these older malware, it terminates processes and services that are\nrelated to applications, back-up software, endpoint security, and servers. Given how effective these known ransomware are,\nit is no surprise that Babuk Locker has mimicked some of their techniques.\n\n\n-----\n\nFigure 1. A Babuk ransom note (top) compared with a DarkSide ransom note (bottom)\nBabuk Locker’s leak site offers more clues. For example, we observed how the leak site has been modified recently to\nannounce that Babuk has now been rebranded to “Babyk.” The site also claims that the group behind the variant is not\nmalicious, and that they aim to expose security issues in organizations.\n\n\n-----\n\nFigure 2. The leak site shows both the rebranding\n\nfrom “Babuk” ransomware to “Babyk” and details about the malware.\nInterestingly, the leak site also lists entities that are excluded from the group’s scope of interest. This list was present before\nthe modification and is the first time that we have observed a ransomware variant showing this kind of discretion.\n\n\n-----\n\nFigure 3. The list of organizations exempted from Babuk’s attacks as posted on their leak site\nBased on its code, the latest sample that we saw is already the third version of Babuk, which involves a more personalized\nransom note that directly addresses the victim organization by name. It is likely that we will see more of this malware in the\nfuture, given the level of activity that we have described.\n\nFigure 4. The Babuk Locker code\n\nshowing that this sample is from the third version of Babuk\nPossible TeslaCrypt disabling system security\n\nThe variant described here arrives through a spam email, which downloads a malicious binary that we detected as the\nransomware TeslaCrypt. While Babuk is new, TeslaCrypt is an older ransomware family. Notably, TeslaCrypt’s key was\nreleased in 2016 so it should now be considered a defunct ransomware; however, a new variant seems to have emerged\n[(detected as Ransom.MSIL.TESLACRYPT.THABGBA). At present, we do not have enough information to say why the](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.TESLACRYPT.THABGBA)\nransomware has made a reappearance. Additionally, we are not ruling out the possibility that the sample is simply a copycat\nversion of TeslaCrypt.\n\n\n-----\n\nWhatever the case might be, a notable feature of this malware is how it downgrades its victim s security. The malware initially\ndisables Windows Defender before terminating a very long list of around 300 other services such as debuggers and securityrelated applications. Authors of this variant seem to be aiming to narrow down the availability of a recovery method for their\nvictim’s system.\n\nFor a ransomware variant, we very rarely see this many security-related processes and applications being closed in a\ncampaign.\n\nFigure 5. A screenshot showing a partial list of security-related applications terminated by the ransomware\nDevelopments for Maoloa\n\n[The Maoloa ransomware was first seen in 2019. It is also one of the malware used in an attack on hospitals in Romania in](https://www.healthcareitnews.com/news/emea/ransomware-hits-romanian-hospitals-disrupts-operations)\n[July 2019. Maoloa has also been linked to the older GlobeImposter ransomware.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/ransomware-recap-crypshed-spoofs-amazon-in-ransomware-campaign)\n\n[A newer sample that we encountered (detected as Ransom.Win32.MAOLOA.THAAHBA) was packaged inside a 7-Zip SFX](http://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.MAOLOA.THAAHBA)\nfile. This variant also used the legitimate tools certutil.exe and Autoit script. All of these additions are evasion tactics that we\nhave not observed in previous variants. The older Maoloa variants that we encountered used a bare, unpackaged, binary.\n\nFigure 6. Execution of\n\nthe SFX file where the Maoloa ransomware is packaged\nOnce executed, the self-extracting archive carrying the Maoloa ransomware payload will drop four files as seen in Figure 6.\n\nAmong these files is the Maoloa ransomware which, once decrypted, will proceed with its encryption routine and dropping of\n[ransom notes. Similar to past variants, this Maoloa sample’s appended extension is “.Globeimposter-Alpha865qqz” despite](https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-july-17th-2020-freshly-squeezed/)\nbelonging to the Maoloa ransomware family and not GlobeImposter’s.\n\n\n-----\n\nFigure 7. Dropping of Maoloa encryption and\n\nransom note components showing GlobeImposter file extensions\nCobraLocker disguised as Among Us\n\n[Finally, part of our notable discoveries is a CobraLocker variant (detected as Ransom.MSIL.COBRALOCKER.B) that was](http://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.COBRALOCKER.B)\nfound at large and that uses the popular game Among Us as a disguise to lure users. The file name used by this\nransomware is “AmongUsHorrorEdition.”\n\nFigure 8. The file name of CobraLocker that disguises itself as a version of Among Us\n\nIf executed, it will run an image in line with the “horror” aspect of the file and will display the text “Do you want to play?” It will\nthen run typical malicious activities, such as terminating cmd.exe, regedit.exe, and Process Hacker, as well as adding\nregistries for persistence.\n\nHow to secure against ransomware?\n\nAs shown by these ransomware families, threat actors will continue to hone their malware to ensure the success of their\ncampaigns, be it by placing heavier pressure on their victims to comply to their demands or simply better disguising their\nmalicious activities to evade detection.\n\nRansomware of the present is undergoing rapid changes that need to be observed and prepared for. Here are\nmeasures that users and organizations can use to protect themselves from ransomware:\n[Create an effective back-up strategy by following the 3-2-1 rule.](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/virtualization-and-cloud/best-practices-backing-up-data)\nAdopt strong passwords throughout the network.\nConsider network segmentation to separate important processes and systems from the wider access network.\nIncrease both your awareness and the awareness of the members of your organization on how ransomware spreads\n(i.e., through spammed emails and attachments)\nMonitor and audit network traffic for any suspicious behaviors or anomalies.\n\nTrend Micro solutions\n\n[Trend Micro solutions such as the Smart Protection Suite and](https://www.trendmicro.com/en_us/business/products/user-protection.html) [Trend Micro™ Worry-Free™](https://www.trendmicro.com/en_us/small-business.html) Business Security Services\n[solutions, which have behavior monitoring capabilities, can protect users and businesses from these types of threats by](https://success.trendmicro.com/solution/1122593-configuring-behavior-monitoring-settings-in-apex-one)\n[detecting malicious files, scripts, and messages as well as blocking all related malicious URLs. Our XGen ™](https://www.trendmicro.com/en_us/business/solutions.html) security provides\n[a cross-generational blend of threat defense techniques against a full range of threats for data centers,](https://www.trendmicro.com/en_us/business/products/hybrid-cloud/security-data-center-virtualization.html) cloud\nenvironments, [networks, and](https://www.trendmicro.com/en_us/business/products/network.html) [endpoints. It infuses high-fidelity](https://www.trendmicro.com/en_us/business/products/user-protection.html) [machine learning (ML) with other detection technologies and](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/machine-learning)\nglobal threat intelligence for comprehensive protection from advanced malware.\n\n\nIndicators of Compromise (IOCs)\n\n\n-----\n\n**Detection name** **SHA-256**\n\n[Ransom.MSIL.COBRALOCKER.AA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.COBRALOCKER.AA) 88d55af8d84c1909e9ccf962e59f71dacf158eb9fd671920a23b7390103bd58f\n\n[Ransom.MSIL.COBRALOCKER.AA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.COBRALOCKER.AA) ec621d94c847976baa8b3ead1bb98c2a0951432ba21181f09fb1c55dcddd98c3\n\n[Ransom.MSIL.COBRALOCKER.B](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.COBRALOCKER.B) ba28a0615626a40254c4e4167e0b3f8bc82bdd83f42b225605c34268c38ef0b5\n\n[Trojan.MSIL.COBRALOCKER.A](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Trojan.MSIL.COBRALOCKER.A) bdcc8754a9f75c2fe1f909af669ac59f25d635139f3634f525e4189db604e3f0\n\n[Trojan.MSIL.COBRALOCKER.A](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Trojan.MSIL.COBRALOCKER.A) ff53667fe3745601d6d04668cd854813f650087be2872876de71d412b70eb0cd\n\n[Ransom.MSIL.TESLACRYPT.THABGBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.MSIL.TESLACRYPT.THABGBA) dcd725c415cebc7df170edf49af18d6f86e76ef75185737de5959405f4aecc56\n\n[Ransom.Win32.BABUK.YEBA-THAAEBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.BABUK.YEBA-THAAEBA) 704a0fa7de19564bc743fb68aa0652e38bf86e8ab694bc079b15f945c85f4320\n\n[Ransom.Win32.BABUK.YEBA-THAAEBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.BABUK.YEBA-THAAEBA) 8140004ff3cf4923c928708505754497e48d26d822a95d63bd2ed54e14f19766\n\n[Ransom.Win32.BABUK.YEBA-THAAEBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.BABUK.YEBA-THAAEBA) afcf265a1dcd9eab5aab270d48aa561e4ddeb71c05e32c857d3b809bb64c0430\n\n[Ransom.Win32.BABUK.YNBA-THABGBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.BABUK.YNBA-THABGBA) 3dda3ee9164d6815a18a2c23651a53c35d52e3a5ad375001ec824cf532c202e6\n\n[Ransom.Win32.BABUK.YNBA-THABGBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.BABUK.YNBA-THABGBA) c5167053129bd4a5542cfef9e739b0443e22e184cb4c0b57c049b448f030cf15\n\n[Ransom.Win32.MAOLOA.THAAHBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win32.MAOLOA.THAAHBA) 94be0c4af61e979ad2064544708807fcdfc4b63115ed885ed0067ece04630a7b\n\n[Ransom.Win64.SETHLOCKER.THABEBAA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Ransom.Win64.SETHLOCKER.THABEBAA) 58c852525bf3bea185db34a79c2c5640c02f8291cdbdbe8dd7c0a9d4682f4b2c\n\n[Trojan.W97M.TESLACRYPT.THABGBA](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Trojan.W97M.TESLACRYPT.THABGBA) c7e40628fb6beb52d9d73a3b3afd1dca5d2335713593b698637e1a47b42bfc71\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-05 - New in Ransomware- Seth-Locker, Babuk Locker, Maoloa, TeslaCrypt, and CobraLocker.pdf"
    ],
    "report_names": [
        "2021-02-05 - New in Ransomware- Seth-Locker, Babuk Locker, Maoloa, TeslaCrypt, and CobraLocker.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535899,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653689953,
    "ts_modification_date": 1653689953,
    "files": {
        "pdf": "https://archive.orkl.eu/ecc1f6e0920b96000895624e719937d665f325dd.pdf",
        "text": "https://archive.orkl.eu/ecc1f6e0920b96000895624e719937d665f325dd.txt",
        "img": "https://archive.orkl.eu/ecc1f6e0920b96000895624e719937d665f325dd.jpg"
    }
}