{
    "id": "92ec9536-28db-4ff2-ba60-f1a80ca8ce95",
    "created_at": "2023-01-12T15:08:48.006143Z",
    "updated_at": "2025-03-27T02:05:31.089756Z",
    "deleted_at": null,
    "sha1_hash": "ba33e2f0dd1062c3ba153600d85c7400aa462cab",
    "title": "2022-09-01 - BianLian Ransomware Gang Gives It a Go!",
    "authors": "",
    "file_creation_date": "2022-11-28T18:53:02Z",
    "file_modification_date": "2022-11-28T18:53:02Z",
    "file_size": 728258,
    "plain_text": "# BianLian Ransomware Gang Gives It a Go!\n\n**redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/**\n\n## Overview\n\nEarlier this year, [redacted] encountered a relatively new ransomware threat actor that called themselves BianLian. We observed the actor\ndeploying custom malware that was written in the Go programming language, which posed some initial, but not insurmountable, reverseengineering challenges.\n\nBianLian used subtle techniques to exploit, enumerate, and move laterally in victim networks to remain undetected and aggressively worked to\ncounter Endpoint Detection & Response (EDR) protections during the encryption phase of their operations. The group has displayed signs of\nbeing new to the practical business aspects of ransomware and associated logistics. Generally they seemed to be experiencing the growing\npains of a group of talented hackers new to this aspect of criminal extortion.\n\nInfrastructure associated with the BianLian group first appeared online in December 2021 and their toolset appears to have been under active\ndevelopment since then. Finally, we have observed the BianLian threat actor tripling their known command and control (C2) infrastructure in\nthe month of August, suggesting a possible increase in the actor’s operational tempo.\n\n## Initial Access\n\nThe BianLian group has successfully targeted the ProxyShell vulnerability chain (CVE-2021-34473, CVE-2021-34523, CVE-2021-31207) to\ngain initial access into victim networks. After exploitation, they deployed either a webshell or a lightweight remote access solution such as\nngrok as the follow-on payload. BianLian has also targeted SonicWall VPN devices for exploitation, another common target for ransomware\ngroups. Finally, while we do not have direct evidence of a successful attack, we have indications that the actor targets servers that provide\nremote network access via solutions such as Remote Desktop, attempting to exploit weak or exposed credentials. We have also observed\ndwell times of up to six weeks from the actor gaining initial access and the actual encryption event.\n\n## Tactics On Target\n\nWith a beachhead established within a network, BianLian have shown themselves to be adept with the Living off the Land (LOL) methodology\nto move laterally, adjusting their operations based on the capabilities and defenses they encountered in the network. For example, they\nleveraged a combination of the Non-Sucking Service Manager nssm.exe and the reverse proxy ngrok.exe to create backdoors on the servers.\nNext, they leveraged RDP, WinRM, WMI, and PowerShell to achieve network profiling and lateral movement. Finally, they deployed their\ncustom backdoor to a subset of compromised hosts to provide additional network access should their primary means be disrupted.\n\nAs BianLian would initially spread throughout a network, hunting for the most valuable data to steal and identify the most critical machines to\nencrypt, they appeared to take steps to minimize observable events. As an example, we have observed the threat actor choosing to avoid\npinging a target and instead utilizing the arp command in network segments where the targeted host would be reachable. In instances where\nping was necessary, the actor was judicious in the use, often sending just a single ping. While it is possible that a network defense solution\ncould be configured in such a way to identify an abnormal ping, it is unlikely most common EDR and network security solutions would identify\nan actor performing targeted network reconnaissance via arp.\n\nOnce the BianLian actor identified a host they wished to access, they most often utilized standard LOL techniques such as net.exe to add\nand/or modify user permissions, netsh.exe to configure host firewall policies, and reg.exe to adjust various registry settings related to remote\ndesktop and security policy enforcement.\n\n### Sample LOL commands observed:\n```\n   \"C:\\Windows\\system32\\net.exe\" localgroup \"Remote Desktop Users\" <similar name to existing admin> /add\n\n```\n```\n\"C:\\Windows\\system32\\netsh.exe\" advfirewall firewall add rule \"name=allow RemoteDesktop\" dir=in protocol=TCP\n\n```\n```\nlocalport=3389 action=allow\n\n```\n```\n   \"C:\\Windows\\system32\\reg.exe\" add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /v\n   fAllowToGetHelp /t REG_DWORD /d 1 /f\n\n```\nEven in the final hours prior to encryption, we observed the actor taking care to avoid detection. In one instance, the actor accessed the victim\nnetwork to seemingly perform last minute network reconnaissance and/or target verification, again sending single pings and arp requests to\nhosts. The actor then disconnected from the network for approximately an hour before returning to begin their ransom attack in earnest.\n\nOnce BianLian made the decision that it was time to encrypt a victims network, they set aside their desire to remain undetected and took a\nmuch more aggressive approach, attacking any network and/or host based defense that impeded their custom encryptor tool.\n\n### Sample commands observed targeting defenses:\n\n**Targeting Windows Defender**\n\n\n-----\n\n```\nC \\ do s\\syste 3 \\ s e e /o e / sab e eatu e / eatu e a e do s e e de / e o e / o esta t\n\n```\n\n**Targeting Windows Antimalware Scan Interface (AMSI)**\n```\n   [Ref].Assembly.GetType(‘System.Management.Automation.AmsiUtils’).GetField(‘amsiInitFailed’,’NonPublic,Static’).SetV\n\n```\n\n**Targeting Sophos**\n```\n   \"C:\\Windows\\system32\\reg.exe\" ADD \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Sophos Endpoint\n   Defense\\TamperProtection\\Config\" /t REG_DWORD /v SAVEnabled /d 0 /f\n   \"C:\\Windows\\system32\\reg.exe\" ADD HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Sophos\\SAVService\\TamperProtection /t\n\n```\n```\nREG_DWORD /v Enabled /d 0 /f\n\n```\n\nIn one instance, BianLian encountered a server that was configured and defended in such a manner the actor was unable to successfully\nexecute their encryptor. To overcome this, the actor installed TightVNC, modified a registry key to enable network access for TightVNC while in\nsafe mode, then booted the server into safe mode. Since most security applications do not execute in safe mode, this enabled partial\nencryption of the server.\n```\n   \"C:\\Windows\\system32\\reg.exe\" copy hklm\\system\\CurrentControlSet\\services\\tvnserver\n   hklm\\system\\CurrentControlSet\\control\\safeboot\\network\\tvnserver /s /f\n\n```\nIn situations where the actor was able to overcome a victim’s defenses, BianLian utilized many of the common techniques observed in a\nmodern ransomware attack such as deleting shadow copy files, deleting backups, as well as distributing and executing their custom encryptor\nvia methods such as RDP, WMI, WinRM, and PowerShell scripts.\n\n### Example Encryption Timeline\n\nIn the hour before attempting the encryption phase of an attack, BianLian leveraged LOL tools to prime the network and targeted machines for\nattack in a less-alerting manner. They created administrator accounts on multiple servers using net.exe and dropped known-good binaries\nsuch as 7zip and winscp to enable last-minute data file exfiltration. When the actor started encryption operations, they moved aggressively and\nwith speed. In 30 minutes, [redacted] witnessed dozens of attempts to encrypt a handful of servers, with each attempt blocked by EDR/AV. The\nactor then spent the next few hours both trying to circumvent security controls and gain access to additional servers that were not initially\ntargeted in an attempt to successfully encrypt the victims files.\n\n**Time**\n**(Duration)** **Event**\n\n\nStart to End\n(4.5 Hours)\n\nStart+1 Hour\n(15 Minutes)\n\nStart+1.25\nHours (45\nMinutes)\n\nStart+2\nHours (30\nMinutes)\n\nStart+2.5\nHours (2\nHours)\n\nStart+2.5\nHours (2\nHours)\n\n\nTraffic flowed externally to several different internal user endpoints throughout the entire encryption phase. The majority of\nmalicious traffic to victim servers for the duration of the incident flowed through these same endpoints.\n\nAccount manipulation via net.exe on multiple servers. Admin accounts enabled and existing admin account passwords\nchanged to hinder any defensive response. Significant account manipulation continued through the event, but was heaviest\nin these 15 minutes.\n\nLOL tools for file exfiltration and remote access dropped to multiple servers and executed.\n\nDozens of attempts to encrypt a handful of different servers.\n\nAttempts to circumvent security controls including EDR.\n\nOver a dozen attempts to encrypt several additional servers that were not included in the initial targeting.\n\n\n### Tools Used and Their Evolution\n\nThe BianLian group has developed a custom tool set consisting of a backdoor and an encryptor, developing both using the Go programming\nlanguage.\n\n**Encryptor**\n\n[As first highlighted by MalwareHunterTeam, BianLian’s custom encryptor was developed in Go. This encryptor also appears to have been](https://twitter.com/malwrhunterteam/status/1557789273595731969)\nunder active development since the BianLian group first came online earlier this year. As the MalwareHunterTeam noted, the samples\nhighlighted in VirusTotal contain apparent versioning information:\n```\n   jack/Projects/project1/crypt27\n\n```\n\n-----\n\n```\njac / ojects/p oject /c ypt 8\n\n```\n\nThe earliest version of the encryption binary we have been able to recover appears to be version 8 and was compiled using Go version 1.18.2:\n```\nSHA256: b60be0b5c6e553e483a9ef9040a9314dd54335de7050fed691a07f299ccb8bc6\n\n```\n\nAs the actor has evolved this encryptor, so has the text used in the ransom note left behind on a victim’s computers. While the file name has\nremained constant, the level of detail and professionalism of the text has improved over time.\n\n**Version 8 ransom note:**\n\n**Version 27/28 ransom note:**\n\nAs was reported by [Cyble, BianLian’s custom encryptor operates on a file extension exclusion model. Once again, we can see that the actor](https://blog.cyble.com/2022/08/18/bianlian-new-ransomware-variant-on-the-rise/)\nhas made adjustments to their binary in that the file types they target as they attempt to ransom victim networks has changed over time.\n\nCompared to Version 27/28, Version 8 of the encryptor would not exclude .lnk files, but would additionally exclude files with the following\nextensions:\n\n\n-----\n\n**Custom Backdoor**\n\nIn addition to the encryptor, BianLian has developed a simple yet effective backdoor that they have deployed on machines within victim\nnetworks, enabling additional means of access. While some actors choose to deploy a full feature remote access tool with a multitude of builtin commands, BianLian’s backdoor is, at the core of it, an efficient mechanism for them to retrieve an arbitrary payload from their C2 servers,\nload it into memory and then execute it.\n\nEach backdoor binary would be configured with a hardcoded IP and Port combination that it will attempt to communicate with. As an example,\nthe binary below will attempt to establish a secure connection to 209.141.54[.]205 on port 5307.\n```\nSHA256: da7a959ae7ea237bb6cd913119a35baa43a68e375f892857f6d77eaa62aabbaf\n\n```\n\nWe have observed BianLian deploy multiple backdoors into a victim network with each backdoor configured to either talk to a unique IP or a\ncommon IP but on different ports. Not only did this IP and port diversity provide the actor with multiple network paths into the victims network,\nbut every binary would have a unique hash, defeating attempts to detect the backdoors via a simple checksum-based rule.\n\n### Infrastructure\n\nIn investigating BianLian’s infrastructure, it appeared the group prefers Linux-based hosts for their C2 servers, but we have also found\nevidence of Windows servers being utilized in their operations. While we do not have enough evidence to confidently identify the C2 software\nthe group is using, we have seen indications that the C2 component is also written in the actors preferred language, Go, which would\npresumably allow them to easily deploy their C2 solution on either OS.\n\nThe number of active C2 nodes has also increased in relative relation to the development of the actor’s toolkit. Based on our research, the\nearliest known C2 server we have identified, 23.94.56[.]154, first appeared online at the end of December 2021 and remained active until early\nAugust of this year. From that initial IP, BianLian appeared to have gradually acquired new C2 servers, occasionally removing an IP, before\nreaching approximately ten active servers by the end of July.\n\nStarting in August, we observed what appeared to be a somewhat troubling explosion in the rate by which BianLian was bringing new C2\nservers online. Throughout the month, BianLian continued to add new C2 nodes to their operational infrastructure, ending the month with\napproximately 30 active IPs, a three-fold increase in just a matter of weeks. While we lack the insight to know the exact cause for this sudden\nexplosion in growth, this may signal that they are ready to increase their operational tempo, though whatever the reason, there is little good\nthat comes from a ransomware operator having more resources available to them.\n\n\n-----\n\n### Victimology\n\nAs is the norm for a group conducting double extortion style ransomware attacks, the BianLian group maintained a leak site where they post\nthe data they have exfiltrated from victim networks. While an unfortunate truth in the ransomware space is that the true number of\norganizations and victims of ransomware attacks will never be known, as of September 1, 2022, the BianLian site has posted details on twenty\nvictim organizations. The threat actor also took the time to categorize the industry vertical of the victims and tagged the corresponding data.\n\nThe victim organizations range from small/medium size businesses to a large multinational company, with the majority of the companies based\nin North America, the UK and Australia.\n\nIn the past, BianLian has occasionally posted teaser information on victim organizations, leaving the victims identities masked, which may\nhave served as an additional pressure mechanism on the victims in an attempt to have them pay the actors ransom demand.\n\nWe also note that this is a small sample size and continued observation will be required before drawing significant conclusions on victimology\nor any possible preference in targeting by BianLian.\n\n### Attribution\n\n\n-----\n\ne t e e s a o g sto y o see g y e a so a e g oups s g o t e as es o de u ct a d/o eb a ded g oups, e do ot a e\nany indications at this time to suggest that is the case with BianLian. For all intents and purposes, the BianLian group appears to represent a\nnew entity in the ransomware ecosystem. Furthermore, we assess that the BianLian actors represent a group of individuals who are very\nskilled in network penetration but are relatively new to the extortion/ransomware business. This hypothesis is based in part on our observations\nof how the BianLian group has managed the business side of a ransomware operation compared to their relative skill level in compromising\nand navigating victim networks.\n\nWhile the actor has proven themselves proficient at compromising a victim network, we have seen the actor:\n\nMistakenly sending data from one victim to another.\nPossessing a relatively stable backdoor toolkit, but have an actively developing encryption tool with an evolving ransom note.\nLong delays in communications with victims.\nThrough the groups own admission on their onion site, the business side of their infrastructure is unreliable.\n\nNote: There is an Android banking trojan that has been referred to by some researchers as BianLian (a.k.a. Hydra.) To date, we have seen no\n[indications that this is related to the BianLian ransomware group. 1](https://www.threatfabric.com/blogs/bianlian_from_rags_to_riches_the_malware_dropper_that_had_a_dream.html) [2](https://cryptax.medium.com/android-bianlian-payload-61febabed00a)\n\n### Recommendations\n\nWhen mitigating the threat posed by ransomware actors, it is essential to use a layered approach. Focus needs to be placed on reducing your\nattack surface to avoid the most common types of exploitation techniques, but also preparing to act quickly and effectively when a compromise\ninevitably happens.\n\n**This includes ensuring you have:**\n\nAn aggressive, prioritized patching regime;\nEmploy multi-factor authentication on every system that allows that as an option;\nVisibility into your network and endpoint devices to quickly identify breaches;\nSecure backups to allow return to business operations as soon as possible;\nA well practiced incident response plan so everyone involved knows their role; and\nAn assessment of your ‘Crown Jewels’ that can be used to both inform your security posture and decide ahead of an incident what data\nyou could afford to have leaked so you can avoid paying the ransom.\n\nIn addition to these strategic recommendations, there are multiple opportunities for behavioral detections in the attack chain leveraged by\nBianLian:\n\n1. Defense Evasion: Svchost not a child of services.exe\n\nBianLian called one of their LOL tools svchost, then launched it via a process other than services.exe.\n2. Defense Evasion: Svchost executing from an unusual path\n\nBianLian called one of their LOL tools svchost.exe, then executed it from a non-standard path.\n3. Defense Evasion: Netsh to modify firewall rules\n\nBianLian leveraged netsh to add a firewall rule to open 3389 to Remote Desktop.\n4. Reconnaissance: Ping -4 -n 1\n\nBianLian used single pings to perform network reconnaissance. This is a false-positive prone alert.\n5. Lateral Movement: Winrm dropping a file via PowerShell\n\nThe binary wsmprovhost.exe is used to mediate the relationship between WinRM and PowerShell. Alerting on file modification by\nwsmprovhost.exe proved a reliable method to detect BianLian dropping malicious files.\n6. Lateral Movement: Unknown Binary Established Connection on 3389\n\nIf leveraging an EDR that classifies binaries as known and unknown and ties network connections to binaries, looking for 3389 in\nuse by unknown binaries can be extremely fruitful. This rule detects BianLian’s custom Go backdoor.\n7. Credential Access: Account manipulation via net.exe\n\n“Net user” is too loud to alert on in most environments, but we recommend alerting on a threshold of “net user” executions. Even a\nthreshold as high as 10 events in 15 minutes would have detected BianLian in the attacks witnessed.\n\n\n-----\n\n8 ecut o U o b a y au c g o e S e\n\nIf leveraging an EDR that classifies binaries as known and unknown, searching for unknown binaries launching PowerShell will\nfrequently detect use of the BianLian backdoor\n9. Defense Evasion: Reg.exe modifying safeboot keys\n\nBianLian added a remote access tool to safeboot keys in order to enable network access for their remote access tool in safeboot.\n\n### Indicators of Compromise\n\n**Backdoors**\n\n001f33dd5ec923afa836bb9e8049958decc152eeb6f6012b1cb635cff03be2a2\n1a1177363be7319e7fb50ac84f69acb633fd51c58f7d2d73a1d5efb5c376f256\n20bab94e6d9c8ed4832ce3b58f9150b16f9e5f40ffdcb747e10366cab5a30352\n36281d02e28dd26a1db37ebe36941fc9eb1748868e96b544f227b3b59de51fea\n3bdcc81931687abac9e6ba4c80d4d596cebb470c80f56213aa29d3da43925537\n50c86fb27bed1962903a5f9d155544e3fdb859ae19e967a10f0bf3a60bb8954f\n5d429e05cede806ecea2e99116cac09558fcc0011095201e66c2e65c42f80fcf\n64065c29b369881ee36314c0d15e442510027186fd9087aec0f63e22a5c6f24c\n6d7009df2fa033f7adc30793ebd5254ef47a803950e31f5c52fa3ead1197599f\n8084eddfdb157edf8b1c0cdf8bf4d4e4aaa332fc871c2892aa4113b5148ac63e\n8592862cd28bcc23cfbcf57c82569c0b74a70cd7ea70dbdee7421f3fafc7ecaf\n86a9b84c6258c99b3c3c5b94a2087bc76a533f6043829ded5d8559e88b97fb2f\n9b7a0117a27dc418fbf851afcd96c25c7ad995d7be7f3d8d888fa26a6e530221\nbb2e9fd9d60f49f0fc2c46f8254e5617d4ec856f40256554087cda727a5f6019\nc0fe7bfb0d1ffeb61fb9cafeeab79ffd1660ff3637798e315ff15d802a3c974e\nc7fe3fc6ffdfc31bc360afe7d5d6887c622e75cc91bc97523c8115b0e0158ad6\ncd17afd9115b2d83e948a1bcabf508f42d0fe7edb56cc62f5cc467c938e45033\nd602562ba7273695df9248a8590b510ccd49fefb97f5c75d485895abba13418d\nda7a959ae7ea237bb6cd913119a35baa43a68e375f892857f6d77eaa62aabbaf\ndda89e9e6c70ff814c65e1748a27b42517690acb12c65c3bbd60ae3ab41e7aca\nde31a4125eb74d0b7cbf2451b40fdb2d66d279a8b8fd42191660b196a9ac468f\nf7a3a8734c004682201b8873691d684985329be3fcdba965f268103a086ebaad\n\n**Encryptors**\n\n1fd07b8d1728e416f897bef4f1471126f9b18ef108eb952f4b75050da22e8e43\nb60be0b5c6e553e483a9ef9040a9314dd54335de7050fed691a07f299ccb8bc6\ncbab4614a2cdd65eb619a4dd0b5e726f0a94483212945f110694098194f77095\neaf5e26c5e73f3db82cd07ea45e4d244ccb3ec3397ab5263a1a74add7bbcb6e2\n\n**Active IPs**\n\n104.225.129[.]86\n104.238.223[.]10\n104.238.223[.]3\n109.248.6[.]207\n13.49.57[.]110\n144.208.127[.]119\n146.0.79[.]9\n157.245.80[.]66\n16.162.137[.]220\n165.22.87[.]199\n172.93.96[.]61\n172.93.96[.]62\n18.130.242[.]71\n185.108.129[.]242\n185.225.69[.]173\n185.56.80[.]28\n185.62.58[.]151\n185.69.53[.]38\n192.145.38[.]242\n192.161.48[.]43\n192.169.6[.]232\n\n\n-----\n\n3 35 5 [ ]8\n45.9.150[.]132\n5.2.79[.]138\n51.68.190[.]20\n54.173.59[.]51\n62.84.112[.]68\n64.52.80[.]120\n66.135.0[.]42\n83.136.180[.]12\n85.13.117[.]213\n85.13.117[.]218\n91.199.209[.]20\n95.179.137[.]20\n\n**Historical IPs**\n\n104.207.155[.]133\n104.238.61[.]153\n146.70.44[.]248\n155.94.160[.]241\n167.88.15[.]98\n172.96.137[.]107\n188.166.81[.]141\n194.26.29[.]131\n194.5.212[.]205\n194.58.119.159\n198.252.108[.]34\n202.66.72[.]7\n208.123.119[.]145\n209.141.54[.]205\n23.227.198[.]243\n23.94.56[.]154\n43.155.116[.]250\n45.144.30[.]139\n45.92.156[.]105\n5.188.6[.]118\n5.230.67[.]2\n85.13.116[.]194\n85.13.117[.]219\n89.22.224[.]3\n\n### IP Context\n\n**Active C2s** **First Seen**\n\n104.225.129[.]86 Late July\n\n104.238.223[.]10 Late July\n\n104.238.223[.]3 Late August\n\n109.248.6[.]207 Late August\n\n13.49.57[.]110 Mid May\n\n144.208.127[.]119 Mid August\n\n146.0.79[.]9 Early February\n\n157.245.80[.]66 Early June\n\n16.162.137[.]220 Mid July\n\n165.22.87[.]199 Late August\n\n172.93.96[.]61 Mid August\n\n172.93.96[.]62 Late August\n\n\n-----\n\n**Active C2s** **First Seen**\n\n18.130.242[.]71 Mid July\n\n185.108.129[.]242 Early August\n\n185.225.69[.]173 Mid August\n\n185.56.80[.]28 Early August\n\n185.62.58[.]151 Mid August\n\n185.69.53[.]38 Late May\n\n192.145.38[.]242 Late August\n\n192.161.48[.]43 Mid August\n\n192.169.6[.]232 Mid August\n\n37.235.54[.]81 Late August\n\n45.9.150[.]132 Early August\n\n5.2.79[.]138 Late August\n\n51.68.190[.]20 Late August\n\n54.173.59[.]51 Mid August\n\n62.84.112[.]68 Mid August\n\n64.52.80[.]120 Early August\n\n66.135.0[.]42 Early April\n\n83.136.180[.]12 Early June\n\n85.13.117[.]213 Late August\n\n85.13.117[.]218 Late August\n\n91.199.209[.]20 Mid July\n\n95.179.137[.]20 Late July\n\n**Historical C2s** **First Seen** **Last Seen**\n\n104.207.155[.]133 Early July Early August\n\n104.238.61[.]153 \n146.70.44[.]248 \n155.94.160[.]241 Late July Early August\n\n167.88.15[.]98 Early August Late August\n\n172.96.137[.]107 Early August Mid August\n\n188.166.81[.]141 Early May Late August\n\n194.26.29[.]131 Early August Late August\n\n194.5.212[.]205 Early August Mid August\n\n194.58.119[.]159 Late May Early June\n\n198.252.108[.]34 \n202.66.72[.]7 Mid August Late August\n\n208.123.119[.]145 Late April Late April\n\n209.141.54[.]205 Early August Mid August\n\n23.227.198[.]243 \n23 94 56[ ]154 Late December Early August\n\n\n-----\n\n**Historical C2s** **First Seen** **Last Seen**\n\n43.155.116[.]250 Mid August Mid August\n\n45.144.30[.]139 Mid April Early June\n\n45.92.156[.]105 \n5.188.6[.]118 Early August Late August\n\n5.230.67[.]2 Early August Late August\n\n85.13.116[.]194 Mid August Late August\n\n85.13.117[.]219 Early August Late August\n\n89.22.224[.]3 Early August Late August\n\n- These IPs were found in instances of BianLian’s backdoor, but we lack visibility on the timeframe(s) when the IPs may have been active.\n\n### Observed Command Lines\n```\n   \"C:\\Windows\\system32\\Dism.exe\" /online /Disable-Feature /FeatureName:Windows-Defender /Remove /NoRestart\n   \"C:\\Windows\\system32\\net.exe\" localgroup \"Remote Desktop Users\" <similar name to existing admin> /add\n   \"C:\\Windows\\system32\\net.exe\" user <legitimate admin account> 3gDZNxtsQ9G029k7D6Ljxe /domain\n   \"C:\\Windows\\system32\\netsh.exe\" advfirewall firewall set rule \"group=remote desktop\" new enable=Yes\n   \"C:\\Windows\\system32\\netsh.exe\" advfirewall firewall add rule \"name=allow RemoteDesktop\" dir=in * protocol=TCP\n\n```\n```\nlocalport=3389 action=allow\n\n```\n```\n\"C:\\Windows\\system32\\reg.exe\" add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal Server\" /* v\nfAllowToGetHelp /t REG_DWORD /d 1 /f\n\"C:\\Windows\\system32\\reg.exe\" add \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Terminal *\nServer\\WinStations\\RDP-Tcp\" /v UserAuthentication /t REG_DWORD /d 0 /f\n\"C:\\Windows\\system32\\reg.exe\" ADD \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Sophos Endpoint *\nDefense\\TamperProtection\\Config\" /t REG_DWORD /v SAVEnabled /d 0 /f\n\"C:\\Windows\\system32\\reg.exe\" ADD \"HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\Sophos Endpoint *\nDefense\\TamperProtection\\Config\" /t REG_DWORD /v SEDEnabled /d 0 /f\n\"C:\\Windows\\system32\\reg.exe\" ADD * HKEY_LOCAL_MACHINE\\SOFTWARE\\WOW6432Node\\Sophos\\SAVService\\TamperProtection\n/t REG_DWORD /v Enabled /d 0 /* f\n\"C:\\Windows\\system32\\reg.exe\" copy hklm\\system\\CurrentControlSet\\services\\tvnserver *\nhklm\\system\\CurrentControlSet\\control\\safeboot\\network\\tvnserver /s /f\n\\cmd.exe /Q /c net user \"Administrator\" /active:yes 1> \\\\127.0.0.1\\C$\\Windows\\Temp\\abjAlC 2>&1\ncmd.exe /Q /c net user \"Administrator\" ChangeMe2morrow! 1> \\\\127.0.0.1\\C$\\Windows\\Temp\\OxNEcz 2>&1\ncmd.exe /Q /c quser 1> \\\\127.0.0.1\\C$\\Windows\\Temp\\VXPrvY 2>&1\n\"C:\\Windows\\system32\\PING.EXE\" -4 -n 1 *\n[Ref].Assembly.GetType(‘System.Management.Automation.AmsiUtils’).GetField(‘amsiInitFailed’,’NonPublic,*\n\n```\n```\nStatic’).SetValue($null,$true)\n\n```\n\n### MITRE ATT&CK Techniques\n\n**ID** **Technique**\n\n[T1190](https://attack.mitre.org/techniques/T1190/) Initial Access: Exploit Public-Facing Application\n\n[T1047](https://attack.mitre.org/techniques/T1047/) Execution: Windows Management Instrumentation\n\n[T1059.001](https://attack.mitre.org/techniques/T1059/001/) Execution: Command and Scripting Interpreter: PowerShell\n\n[T1098](https://attack.mitre.org/techniques/T1098/) Persistence: Account Manipulation\n\n[T1078](https://attack.mitre.org/techniques/T1078/) Persistence: Valid Accounts\n\n[T1562.001](https://attack.mitre.org/techniques/T1562/001/) Defense Evasion: Impair Defenses: Disable or Modify Tools\n\n[T1526.004](https://attack.mitre.org/techniques/T1562/004/) Defense Evasion: Impair Defenses: Disable or Modify System Firewall\n\n[T1036](https://attack.mitre.org/techniques/T1036/) Defense Evasion: Masquerading\n\n[T1112](https://attack.mitre.org/techniques/T1112/) Defense Evasion: Modify Registry\n\n[T1069](https://attack.mitre.org/techniques/T1069/) Discovery: Permission Groups Discovery\n\n\n-----\n\n**ID** **Technique**\n\n[T1018](https://attack.mitre.org/techniques/T1018/) Discovery: Remote System Discovery\n\n[T1021.001](https://attack.mitre.org/techniques/T1021/001/) Lateral Movement: Remote Services: Remote Desktop Protocol\n\n[T1021.005](https://attack.mitre.org/techniques/T1021/005/) Lateral Movement: Remote Services: VNC\n\n[T1021.006](https://attack.mitre.org/techniques/T1021/006/) Lateral Movement: Remote Services: Windows Remote Management\n\n[T1090](https://attack.mitre.org/techniques/T1090/) Command and Control: Proxy\n\n[T1071.001](https://attack.mitre.org/techniques/T1071/001/) Command and Control: Application Layer Protocol: Web Protocol\n\n[T1486](https://attack.mitre.org/techniques/T1486/) Impact: Data Encrypted for Impact\n\n[During our research, we created some tool modifications for the AlphaGolang project to assist other security community researchers in working](https://github.com/SentineLabs/AlphaGolang)\n[on the BianLian malware. The specific update is located here.](https://github.com/SentineLabs/AlphaGolang/pull/3)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-01 - BianLian Ransomware Gang Gives It a Go!.pdf"
    ],
    "report_names": [
        "2022-09-01 - BianLian Ransomware Gang Gives It a Go!.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536128,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1669661582,
    "ts_modification_date": 1669661582,
    "files": {
        "pdf": "https://archive.orkl.eu/ba33e2f0dd1062c3ba153600d85c7400aa462cab.pdf",
        "text": "https://archive.orkl.eu/ba33e2f0dd1062c3ba153600d85c7400aa462cab.txt",
        "img": "https://archive.orkl.eu/ba33e2f0dd1062c3ba153600d85c7400aa462cab.jpg"
    }
}