{
    "id": "937c09cb-a427-43ae-8f1d-b8aa934928d6",
    "created_at": "2023-03-03T02:06:45.091633Z",
    "updated_at": "2025-03-27T02:16:47.148676Z",
    "deleted_at": null,
    "sha1_hash": "c9a05a833497284ec22addec972571673a35be79",
    "title": "2023-02-16 - Three Cases of Cyber Attacks on the Security Service of Ukraine and NATO Allies, Likely by Russian State-Sponsored Gamaredon",
    "authors": "",
    "file_creation_date": "2023-03-01T09:34:31Z",
    "file_modification_date": "2023-03-01T09:34:31Z",
    "file_size": 2117785,
    "plain_text": "# Three Cases of Cyber Attacks on the Security Service of Ukraine and NATO Allies, Likely by Russian State- Sponsored Gamaredon\n\n**blog.eclecticiq.com/three-cases-of-cyber-attacks-on-the-security-service-of-ukraine-and-nato-allies-likely-by-russian-**\nstate-sponsored-gamaredon\n\n### Platform\n\nLearn more about our full-featured intelligence, hunting, and response platform.\n\n### Packages\n\nDiscover the variety of pre-configured packages suited for your diverse use cases.\n\n### Products\n\nExplore our modular product solutions to better protect your environment.\n\n**Services**\n\nGet the most out of your EclecticIQ cybersecurity solutions.\n\n**Academy**\n\nMaster the art of cyber threat intelligence and intelligence-led cyberdefense.\n\n**Ecosystem**\n\nExplore our world-class partners – or learn about our partner program.\n\n**TIP for CTI**\n\nPower your CTI practice with analyst-centric threat intelligence solutions.\n\n**TIP for SOC**\n\nGo beyond the IOC to augment your SOC in defense of your organization.\n\n\n-----\n\n**ER for IT Security**\n\nState-of-the-art threat detection & response protection for endpoints.\n\n**XDR for IT Security\n(coming soon)**\n\nFlexible intelligence-led threat hunting, detection & response cybersecurity.\n\n**Intelligence Center**\n\n**Curated Feeds**\n\n**Hunting Packs\n(coming soon)**\n\n**Endpoint Response**\n\n**[Hunting, Detection and Response\n(coming soon)](https://www.eclecticiq.com/products/hunting-detection-response)**\n\nLearn how EclecticIQ can help you address your specific challenges – by team and by need\n– and improve your overall security posture.\n\n[Solutions overview](https://www.eclecticiq.com/solutions)\n\n**For CTI Teams**\n\n[Provide your CTI team with the automation, performance, flexibility, and integrations needed](https://www.eclecticiq.com/solutions/team/cti)\nto boost your threat hunting capabilities with our range of analyst-centric products and\nservices.\n\n**For SOC Teams**\n\n\n-----\n\nEnable your SOC team to better operationalize threat intelligence for more effective and\n[efficient incident response with our range of analyst-centric management products and](https://www.eclecticiq.com/solutions/team/soc)\nservices.\n\n**For IT SecOps Teams**\n\n[Power your security operations team with upgraded detection & response capabilities to](https://www.eclecticiq.com/solutions/team/secops)\ndefend your digital operating assets with our range of intelligence-led products and services.\n\n**For Situational Awareness**\n\n[Improve your situational awareness and mitigate risk with our collection of analyst-centric](https://www.eclecticiq.com/solutions/need/situational-awareness)\nthreat intelligence products and services.\n\n**For Collaboration & Dissemination**\n\n[Operationalize threat intelligence for more effective and efficient incident response with our](https://www.eclecticiq.com/solutions/need/collaboration-dissemination)\nrange of analyst-centric management products and services.\n\n**For Threat Hunting**\n\n[Raise your threat hunting game to bring asymptomatic threats to light and proactively](https://www.eclecticiq.com/solutions/need/threat-hunting)\nmitigate risk with our collection of analyst-centric threat intelligence products and services.\n\n**For Threat Detection & Response**\n\n[Improve your detection and response coverage and resiliency in the face of relentless](https://www.eclecticiq.com/solutions/need/threat-detection-response)\nattacks with our collection of intelligence-driven endpoint tools.\n\n### Our Ecosystem\n\nAn ecosystem supporting our customers' intelligence-led proactive cybersecurity needs with\ncollaborative partner programs delivering world-class joint solutions.\n\n### Partner Program\n\nPartner with EclecticIQ to bring valuable and innovative security solutions and services to\nend users. Open to all partner types, including technology developers, service providers,\nresellers, and community.\n\n[Become a Partner](https://www.eclecticiq.com/partners/become-partner)\n\n### Our Partnerships\n\n\n-----\n\nWe partner with the world s premier technology and solution providers to support all phases\nof your cybersecurity needs. Explore all our partners' solutions and offerings to build and\nextend your cyber defense ecosystem.\n\n[About Our Partners](https://www.eclecticiq.com/partners)\n\n### Open Source Projects\n\nWe are proud to be an active member in the open source community and to help develop\nand advance progress of security technology. Learn more about contributions or go directly\nto our GitHub page.\n\n[Open Source Projects](https://www.eclecticiq.com/open-source) [EclecticIQ on GitHub](https://github.com/eclecticiq)\n\nEclecticIQ researchers observed multiple weaponized phishing emails probably targeting the\nSecurity Service of Ukraine (SSU), NATO allies like Latvia, and private companies such as\nCulver Aviation.\n\nEclecticIQ Threat Research Team\n –\nFebruary 16, 2023\n\n## Executive Summary\n\n\n-----\n\nEclecticIQ researchers observed multiple weaponized phishing emails probably targeting the\nSecurity Service of Ukraine (SSU), NATO allies like Latvia, and private companies such as\nCulver Aviation - a Ukrainian aviation company. Multiple overlaps between these incidents\nand previous attacks of the Gamaredon APT group (4), such as command and control\ninfrastructures and adversary techniques, helped analysts to highly likely attribute these\nlatest attacks to the Gamaredon group.\n\nThis report describes three distinct cases and adversary tactics, techniques, and procedures\n(TTPs). Analysts examined three different malware delivery techniques used in this\ncampaign, including spear phishing with a TAR attachment that contains a malicious LNK\nfile, a specially crafted Word document that can exploit CVE-2017-0199 to gain code\nexecution without macros, and HTML smuggling.\n\nEclecticIQ researchers continue to actively monitor for activity related to the Gamaredon APT\ngroup. While monitoring this activity, analysts identified multiple key findings:\n\nPhishing emails were being used to deliver malware to the Security Service of Ukraine.\nIn January 2023, EclecticIQ researchers observed English and Latvian-language\nphishing lures probably targeting NATO allies.\nAnalysts assess that Culver Aviation (a Ukrainian aviation company) probably has been\ntargeted by multiple phishing lures containing malicious Word documents that use the\nCVE-2017-0199 vulnerability, which is exploited to execute the malware on victim\nsystems through specially crafted Word documents.\nAccording to open-source reporting, Culver Aviation Company provided multiple\nunmanned aerial vehicles (UAVs) to support Ukrainian troops in the region. This\nsupport highly likely has made the company a target in this latest cyberattack.\nLiving off the Land Binaries (LOLBAS) such as MSHTA.exe were being actively abused\nby a Russian state-sponsored threat actor to download and execute the second stage\nof the malware.\n\n## Case #1: Phishing Emails to Target the Security Service of Ukraine (SSU) \n Malware Execution Flow\n\nOn January 23rd, 2023, EclecticIQ analysts identified a phishing email - addressed to the\nSecurity Service of Ukraine - with an attached archive file (TAR). The TAR folder contained a\nmalicious shortcut (LNK) file.\n\nUpon user click, the LNK file downloads and executes a second-stage malicious HTML\napplication (HTA) from a remote address using MSHTA.exe.\n\n\n-----\n\nThe threat actor appears to be using multiple techniques to limit who can access this URL\noutside of Ukraine. For example, the threat actor uses geo-blocking to limit downloads of this\nmalicious file from other locations and blocks ExpressVPN and NordVPN nodes within\nUkraine. It appears the threat actor is potentially conducting additional filtering to further\ncontrol access to payloads.\n\nFigure 1 – Malware execution flow.\n\nThe Attack Begins with a Phishing Email Campaign\n\nFigure 2 shows a recent phishing email with a malicious attachment probably targeting the\nSecurity Service of Ukraine (SSU). At the bottom of the email is the attached TAR file.\n\nFigure 2 – Example of Phishing email probably targeting SSU.\n\nVictim User Clicks on the Malicious Shortcut (LNK) File\n\nWhen a victim user extracts the TAR file (as seen in figure 3) it contains the malicious LNK\nfile with a Latvian phishing lure.\n\n\n-----\n\nFigure 3 – Content of malicious attachment translated to English from the Ukrainian\nlanguage.\n\nLNKs are Windows shortcut files that can contain malicious code to abuse legitimate tools on\nthe system, the so-called living-off-the-land binaries (LOLBAS or LOLBIN). Figure 4 (below)\nshows that the actor uses MSHTA (a process used by Windows in legitimate purposes to\nexecute HTML applications) to download and execute Microsoft HTML Application (HTA)\nfiles from a remote URL defined inside the Target section of the LNK file.\n\nFigure 4 – Malicious shortcut (LNK) file.\n\nExecution of the Malicious HTA File\n\nIf a victim clicks on the malicious LNK file, it will start to download an HTA file from the\nremote address (hxxp[://]194[.]180[.]174[.]203/23[.]01/mo/baseball[.]DjVu) and execute this\nsecond stage malware via MSHTA.exe. Analysts were unable to retrieve the second stage\npayload due the remote server being offline.\n\n## Case #2: Targeting Culver Aviation via a Phishing Lure to Exploit CVE-2017-0199\n\nOn December 12th, 2022, EclecticIQ researchers identified multiple malicious Word\ndocuments that used Culver Aviation phishing lures. Analysts assess that the chances are\nabout even that threat actor is targeting Culver Aviation Company or other Ukrainian entities\nusing this company’s name. Analysts suspect the threat actor’s interest in Culver Aviation\nprobably stems from that company providing unmanned aerial vehicles (UAV) to Ukrainian\ntroops (11).\n\n\n-----\n\nOne of those Word documents can be seen in figure 5. This Ukrainian-language Word\ndocument contains the name of Culver Aviation’s CEO, corporate email address, and title of\nthe company as a part of the lure.\n\nFigure 5 – Malicious Word document that contains Culver Aviation phishing lure (6).\n\nThe Malicious Word document leverages the exploit CVE-2017-0199 to download and\nexecute remote templates as a second stage of the malware. This exploit can be triggered\nby opening the Word document without any macro involvement.\n\nFigure 6 shows the remote template URL (council7[.]artupora[.]ru), which hosts a malicious\nHTA file that is stored in the Word document. This URL has been attributed to Gamaredon by\nprevious reporting (8).\n\nFigure 6 – Remote template URL inside the Word document.\n\n## Case #3: Latvian (Ministry of Defence) MoD and Probably Other NATO Allies Targeted via an HTML Smuggling Campaign\n\nOn January 18th, 2023, EclecticIQ researchers identified a threat actor group using phishing\nlures in English and Latvian, almost certainly to target the Latvian MoD and probably other\nEnglish-speaking NATO allies.\n\n\n-----\n\nIn this new campaign, an HTML Smuggling technique was actively used for malware delivery\nshown in figure 7. HTML smuggling lets an attacker “smuggle” an encoded malicious script\nwithin a specially crafted HTML attachment or web page. When a target user opens the\nHTML in their web browser, the browser decodes the malicious script, which, in turn,\nassembles the malicious payload on the host device. Instead of having a malicious\nexecutable pass directly through a network, the attacker builds the malware locally behind a\nfirewall.\n\nFigure 7 - HTML Smuggling used to deliver the Malicious LNK file decoyed as PDF file.\n\nThe email in figure 8, impersonated the Ukrainian Ministry of Defence and targeted the\nLatvian Ministry of Defence, the domain name (admou[.]org) was used to send their phishing\nemail.\n\n\n-----\n\nFigure 8 - Phishing email addressed to the Latvian MoD containing HTML file as a malicious\nattachment. (2)\n\nThe infection flow is very similar to case 1 (Security Service of Ukraine). The threat actor\nabuses MSHTA.exe to download an HTA file from the remote URL\n(hxxp[://]194[.]180[.]174[.]158/18[.]01/released[.]rtf.) to retrieve the second stage payload.\n\nFigure 9 - HTML Smuggling used to deliver malicious LNK file (3)\n\n\n-----\n\nFigure 10 shows the content of the LNK file, it uses the same infrastructure (AS 39798 MivoCloud SRL) described in case 1 but with a different IP address to download second\nstage malware.\n\nFigure 10 – Malicious LNK file.\n\nWhen the victim system is successfully infected by this malware, the threat actor can get\npersistence on the system and then proceed with executing their action on objectives.\nEclecticIQ researchers believe that military and related organizations in Ukraine and other\nNATO allies were being targeted by a Russian state-sponsored APT group specifically for\ncollecting intelligence that very likely benefit Russian troops in Ukraine.\n\n## Overlaps Between These Cases and Previous Gamaredon Attacks\n\nThe adversary tactics and techniques such as malware delivery mechanisms, malware\nexecution techniques, and infrastructures share strong similarities with activity attributed to\nGamaredon, originally reported by Palo Alto Networks in December 2022 (4). Palo Alto\n\n\n-----\n\nNetworks linked the activity cluster to Gamaredon - a threat actor that the Ukrainian\ngovernment attributed to Russia's Federal Security Service (FSB). Each of these three\noverlapping techniques is explained below.\n\nVictimology\n\nAccording to the Ukrainian government, this threat group was performing cyber-attacks on\nUkrainian government entities since 2014 (9). Also in 2022, CERT-UA confirmed phishing\nemails were being used to send malicious files to the Latvian government and likely targeting\nother European governments (12).\n\nUpdated HTML Smuggling Technique\n\nGamaredon group commonly uses the HTML smuggling technique for delivering malware\n(9). In this new campaign the threat actors improved the obfuscation routine in the HTML\nsmuggling code (figure 11) to avoid anti-malware scanners and email gateway solutions.\n\nFigure 11– Obfuscation update for HTML smuggling (2).\n\nSecond Stage Malware Execution and Delivery Technique:\n\n\n-----\n\nIn Figure 12, a malware sample uploaded to VirusTotal (5) at 2022-12-01 05:45:19 UTC and\nwas attributed to Gamaredon APT by Unit 42 threat research group (4). The researchers\nnoted that the malware used the (admou[.]org) domain in the attack. In latest cyberattacks\nagainst Latvia, the same domain name was used by threat actor as an email sender (10).\n\nFigure 12 - Malicious LNK file used to download and execute HTA file format by abusing\nmshta.exe\n\nInfrastructure of the Threat Actor:\n\nWhen a user clicks on the LNK file mentioned in Figure 13, it will try to download a malicious\nHTA file from https://admou[.]org/29.11_mou/presented[.]rtf.\n\nURL syntax used in the malware delivery and C2 communications are identical to previous\nattacks researched by Unit 42 at Palo Alto Networks (4).\n\nFigure 13 – Brief example of command-and-control sequence, same system used in this\nlatest attack\n\n\n-----\n\nMost of the threat actor s domains continue to be registered under the Russian Domain\nRegistrar reg[.]ru. To date, no action has been taken to block the malicious infrastructure. It is\nvery likely that the threat actor chooses this infrastructure on Russian soil to avoid being\ndefaced by law enforcement or disruption of their offensive operations by VPS service\nprovider.\n\nThe infrastructure outside of Russia is probably used to avoid geo-blocking during cyberattacks against western countries and it has relied primarily on VPS providers located within\none of 3 autonomous systems (AS), AS14061 (DigitalOcean, LLC), AS 207713 (Global\nInternet Solutions LLC) and AS 39798 (MivoCloud SRL).\n\n## Conclusion\n\nSince 2014, Russian government-backed threat actors have been conducting hybrid\naggression against Ukraine and NATO allies to perform sabotage or cyber espionage attacks\n(9). For that purpose, the capabilities of the existing cyber units have been strengthened and\nthreat actors like Gamaredon are actively involved in organizing and conducting\ncyberattacks.\n\nEclecticIQ researchers identified three different cases, which analysts assess are probably\nattributed to Gamaredon group. In these cases, social engineering was being used to send\nphishing emails that contains specially crafted messages with malicious attachments. Even if\nthis remains the main vector of cyberattacks, analysts observed an increase in evasion\ntechniques used in these three new cases, which could indicate that means the threat actor\nspends more time avoiding detection and staying under the radar.\n\nThe latest military supports from western NATO allies to the Ukrainian army, like the\nconfirmation of the sending Patriot missile system and calls from Latvia on Germany to send\nLeopard tanks to Ukraine (1), highly likely have increased the will to carry out the\ncyberattacks done by Russian state-sponsored APT group Gamaredon. Although there is no\nclear proof that western support prompted cyberattacks, a spokesperson for Latvia’s Ministry\nof Defense confirmed that the latest attack was “most likely” linked to Gamaredon, although\nthe investigation is still ongoing (7).\n\nThe majority of Gamaredon’s domains continue to be registered under the DNS of the\nRussian company called reg[.]ru and to date no action has been taken to block this malicious\ninfrastructure. Chances about even that Gamaredon group choose this infrastructure on\nRussian soil to avoid being defaced by law enforcement or disruption of their offensive\noperations by VPS service provider.\n\nInfrastructure outside of Russia is probably used to avoid geo-blocking during cyber-attacks\nagainst western countries and it has relied primarily on VPS providers located within one of 3\nautonomous systems (AS), AS14061 (DigitalOcean, LLC), AS 207713 (Global Internet\n\n\n-----\n\nSolutions LLC) and AS 39798 (MivoCloud SRL).\n\nEclecticIQ researchers believe that, probably because of the increasing geo-political tension,\nthese kinds of persistent cyberattacks against Ukraine and its allies will continue by evolving\nto become much more evasive than previous attacks.\n\n## Protections and Mitigations\n\nPhishing emails that contain HTML Smuggling files in the attachment are on the rise. To\nprevent these emails, organizations need to use email gateway security solutions capable of\npreventing receiving these kinds of Phishing emails.\n\nThreat Actors are using Living Off the Land Binaries to camouflage their malicious\nactivity and increase the evasiveness against anti malware. Analysts suggest\nimplementing SIEM (Security information and event management) solutions on the\nnetwork to detect these kinds of executions and using application whitelisting like\nMicrosoft’s AppLocker to avoid the executions of LOLBINs like MSHTA.exe.\nPhishing awareness training must be given to coworkers to improve resilience against\nsocial engineering.\nAlways deploy the highest level of protection on your firewall and endpoints. In\nparticular:\n\n   - Ensure the firewall has TLS 1.3 inspection, next-gen IPS, and streaming DPI with\nmachine learning and sandboxing for protection from the latest threats.\n\n   - Ensure endpoints have modern next-gen protection capabilities to guard against\ndownloading malicious files from untrusted sources.\n\n## MITRE ATT&CK\n\nTactic: Technique ATT&CK\nCode\n\nExecution: User Execution Malicious File T1204\n\nExecution: Exploitation for Client Execution T1203\n\nDefense Evasion: Deobfuscate/Decode Files or Information T1140\n\nDefense Evasion: Masquerading Double File Extension T1036.007\n\nDefense Evasion: System Binary Proxy Execution Mshta T1218.005\n\n\n-----\n\nDefense Evasion: HTML Smuggling T1027.006\n\nCommand and Control: Web Protocols T1071.001\n\nInitial Access: Spearphishing Attachment T1566.001\n\n\nPersistence: Boot or Logon Autostart Execution: Registry Run Keys /\nStartup Folder\n\n\nT1547.001\n\n\nPersistence: Scheduled Task T1053.005\n\n[Hunting Resources: Live Queries &](https://github.com/eclecticiq/eiq-community-exchange/blob/main/live_queries/Windows_Q1000-1999/Q1803.sql) [Yara Rules](https://github.com/eclecticiq/eiq-community-exchange/blob/main/yara/Windows_1000-1999/Y1803.yara)\n\n## About EclecticIQ Intelligence & Research Team\n\nEclecticIQ is a global provider of threat intelligence, hunting, and response technology and\n[services. Headquartered in Amsterdam, the EclecticIQ Intelligence & Research Team is](https://www.eclecticiq.com/eclecticiq-intelligence-research-team)\nmade up of experts from Europe and the U.S. with decades of experience in cyber security\nand intelligence in industry and government.\n\nWe would love to hear from you. Please send us your feedback by emailing us\nat [research@eclecticiq.com.](mailto:research@eclecticiq.com)\n\n## You might also be interested in:\n\n[QakBot Malware Used Unpatched Vulnerability to Bypass Windows OS Security Feature](https://blog.eclecticiq.com/qakbot-malware-used-unpatched-vulnerability-to-bypass-windows-os-security-feature)\n\nSecurity Service of Ukraine and NATO Allies Potentially Targeted by Russian StateSponsored Threat Actor\n\nMustang Panda APT Group Uses European Commission-Themed Lure to Deliver PlugX\nMalware\n\n## Appendix\n\n\n-----\n\n## Receive all our latest updates\n\nSubscribe to receive the latest EclecticIQ news, event invites, and Threat Intelligence blog\nposts.\n\n© 2014 – 2023\nEclecticIQ B.V.\nand its affiliates\n\n120) ? false : true\">\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-16 - Three Cases of Cyber Attacks on the Security Service of Ukraine and NATO Allies, Likely by Russian State-Sponsored Gamaredon.pdf"
    ],
    "report_names": [
        "2023-02-16 - Three Cases of Cyber Attacks on the Security Service of Ukraine and NATO Allies, Likely by Russian State-Sponsored Gamaredon.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1691c25f-1aa4-4168-8ce2-7aa8f23246e7",
            "created_at": "2024-06-04T02:03:07.724221Z",
            "updated_at": "2025-03-27T02:05:17.284601Z",
            "deleted_at": null,
            "main_name": "BRONZE PRESIDENT",
            "aliases": [
                "Mustang Panda ",
                "Red Lich ",
                "Temp.Hex ",
                "HoneyMyte "
            ],
            "source_name": "Secureworks:BRONZE PRESIDENT",
            "tools": [
                " Cobalt Strike",
                " ORat",
                " PlugX",
                " RCSession",
                "China Chopper"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b69037ec-2605-4de4-bb32-a20d780a8406",
            "created_at": "2023-01-06T13:46:38.790766Z",
            "updated_at": "2025-03-27T02:00:02.919758Z",
            "deleted_at": null,
            "main_name": "MUSTANG PANDA",
            "aliases": [
                "TEMP.HEX",
                "TA416",
                "TANTALUM",
                "Twill Typhoon",
                "Earth Preta",
                "Stately Taurus",
                "LuminousMoth",
                "Polaris",
                "BRONZE PRESIDENT",
                "HoneyMyte",
                "Red Lich"
            ],
            "source_name": "MISPGALAXY:MUSTANG PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2ee03999-5432-4a65-a850-c543b4fefc3d",
            "created_at": "2022-10-25T16:07:23.882813Z",
            "updated_at": "2025-03-27T02:02:10.0116Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Bronze President",
                "Camaro Dragon",
                "Earth Preta",
                "HoneyMyte",
                "Mustang Panda",
                "Operation SMUGX",
                "Operation SmugX",
                "PKPLUG",
                "Red Lich",
                "Stately Taurus",
                "TEMP.Hex"
            ],
            "source_name": "ETDA:Mustang Panda",
            "tools": [
                "9002 RAT",
                "AdFind",
                "Agent.dhwf",
                "Agentemis",
                "CHINACHOPPER",
                "China Chopper",
                "Chymine",
                "ClaimLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "DCSync",
                "DOPLUGS",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Farseer",
                "Gen:Trojan.Heur.PT",
                "HOMEUNIX",
                "Hdump",
                "HenBox",
                "HidraQ",
                "Hodur",
                "Homux",
                "HopperTick",
                "Hydraq",
                "Impacket",
                "Kaba",
                "Korplug",
                "LadonGo",
                "MQsTTang",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "NBTscan",
                "NetSess",
                "Netview",
                "Orat",
                "POISONPLUG.SHADOW",
                "PUBLOAD",
                "PVE Find AD Users",
                "PlugX",
                "Poison Ivy",
                "PowerView",
                "QMAGENT",
                "RCSession",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TONEINS",
                "TONESHELL",
                "TVT",
                "TeamViewer",
                "Thoper",
                "TinyNote",
                "WispRider",
                "WmiExec",
                "XShellGhost",
                "Xamtrav",
                "Zupdax",
                "cobeacon",
                "nbtscan",
                "nmap",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677809205,
    "ts_updated_at": 1743041807,
    "ts_creation_date": 1677663271,
    "ts_modification_date": 1677663271,
    "files": {
        "pdf": "https://archive.orkl.eu/c9a05a833497284ec22addec972571673a35be79.pdf",
        "text": "https://archive.orkl.eu/c9a05a833497284ec22addec972571673a35be79.txt",
        "img": "https://archive.orkl.eu/c9a05a833497284ec22addec972571673a35be79.jpg"
    }
}