{
    "id": "93cd1270-5ec6-47ae-811c-11d9153afb2c",
    "created_at": "2023-01-12T15:02:22.455299Z",
    "updated_at": "2025-03-27T02:05:40.720445Z",
    "deleted_at": null,
    "sha1_hash": "e344bf0daeef8001e01f8c64ec201515ea285c78",
    "title": "2018-08-06 - Reversing Cerber - RaaS",
    "authors": "",
    "file_creation_date": "2022-05-28T02:33:19Z",
    "file_modification_date": "2022-05-28T02:33:19Z",
    "file_size": 14960769,
    "plain_text": "# Reversing Cerber - RaaS\n\n**[rinseandrepeatanalysis.blogspot.com/2018/08/reversing-cerber-raas.html](https://rinseandrepeatanalysis.blogspot.com/2018/08/reversing-cerber-raas.html)**\n\nJames Haughom\n\nCerber has established itself as one of the most successful ransomware families to date.\nDistributed as Raas (Ransomware as a Service), the malware has retained popularity with\nover 6 known variants.\n\nThe malware is packed with Nullsoft PiMP (plugin Mini Packager) which hides much of the\nmalware's true functionality.\n\n\n-----\n\nAs a whole, the malware's entropy is quite high (6.1), indicating packed code.\n\nThe malware contains an anomalous PE section \".ndata\" which has a virtual size much\nhigher than its physical/raw size. This indicates that there is a good chunk of code that won't\npresent itself until runtime, once the malware is loaded in memory.\n\n\n-----\n\npestudio marks the .text/.code section as highly entropic (6.4), this is where the actual\ncode/instructions are stored in a PE.\n\nI conducted this analysis in a host-only virtual network with a Windows 10 VM routing its\nnetwork traffic to a REMnux VM running fakedns, iNetSim, and Wireshark. The malware\nhappily runs in the VM with security tools running, dropping several files to disk. The number\nof bytes written to the file 'collages.dll' is the same as the virtual size of the '.ndata' section.\n\n\n-----\n\nThe malware then makes a few modifications to the registry. A couple of these modifications\nhave to do with what the user is presented with (Wallpaper), the rest have to do with network\nactivity. This malware (interestingly enough) does not establish persistence, just encrypts\nand exits.\n\nThe malware spawns an instance of itself, which then opens the ransom note\n'_HELP_DECRYPT_N0BR8ST0_.hta'. The filename for this ransom note appears to be\nunique to the system, format is '_HELP_DECRYPT_[A-Z0-9]{8}_.hta' <- simple regex for the\n8 digit alphanumeric string.\n\nLike most ransomware, a ransom note is dropped to the desktop, the Wallpaper is changed,\nand encrypted files are tagged with a weird file extension '.94d4'. Another file extension\nfound during analysis was '.bde6' - this value appears to be randomly generated.\n\n\n-----\n\nThe malware contacts hundreds of hosts over port 6892.\n\n\n-----\n\n-----\n\nThe same UDP packet is sent over and over.\n\nThe first half of the string is the same as the unique string at the end of the provided URL in\nthe ransom note.\n\n\n-----\n\nLET THE REVERSING COMMENCE!!!\n\nThe process tree from behavioral analysis showed the original instance of cerber launching a\nnew cerber, this turned out to be pretty interesting. Notice the sixth value pushed onto the\nstack for the CreateProcess API Call, the value 4 is passed for the dwCreationFlags\nargument. The 4 indicates that this process is created in a suspended state. Do I sense\ncode injection?\n\nThe malware then takes a fairly common path for the injection. Reads memory of the newly\nspawned cerber.exe, the parameter '2F4' is a handle to said cerber.\n\n\n-----\n\nThe malware then hollows out the suspended process through the WinAPI call\n'UnMapViewOfSection'. The parameter '400000' is passed as the base address as to where\nbegin hollowing/unmapping, which is the very beginning/start of the PE.\n\nA buffer is then filled via 'RtlDecompressBuffer', which stores the contents that will be\ninjected into the suspended process. Notice the 'MZ' header, this an executable that will be\ninjected into the target process.\n\n\n-----\n\nThe buffer is then written to the target process via 'WriteProcessMemory'. A pointer to the\nexecutable seen in the dump window is passed as the data to be written. The base address\n'400000', which was the start address of the hollowing, is now passed as the base address\nfor this executable to be written to in the hollowed out process.\n\nTo intercept this executable, I followed the base address in the memory map and then\ndumped it. When attempting to load it into IDA, it is not recognized as a valid PE. Looking at\nthe file in HxD, there are around 32 bytes of noise before the magic bytes of the executable.\n\n\n-----\n\nDeleting up until the 'MZ'/'4D5A' fixes the problem. This looks to be where the true\npayload/ransomware code lies, this is the first time we have seen crypt-related APIs. So\nessentially, the malware uses code injection as a way to unpack itself.\n\nNow that the code has been injected/written, the malware must start a thread of execution to\ninvoke the code. The context of the thread is set via 'SetThreadContext'.\n\n\n-----\n\nAnd finally, the thread is resumed and the code begins executing in the target process.\n\nJust before taking the instruction to allow 'ResumeThread' to execute, I spawned a new\ninstance of x64dbg and attached to the still suspended cerber.exe. I then set breakpoints on\nthread entry and thread start to halt execution once 'ResumeThread' is called. Next, I set\nbreak points on all crypt-related APIs, as well as GetProcAddress, so that I can identify any\nadditional code that may be dynamically loaded. The first function to be dynamically\nresolved via 'GetProcAddress' is 'CryptEncrypt'.\n\nThe next interesting code block was the usage of the API 'CryptStringToBinary'. This API\nconverts a string to an array of bytes. The data to be converted is a very long base64 string.\n\n\n-----\n\nDecoded, the string looks to be a hard-coded Public Key.\n\nThe Public Key Info suggests that this is 'RSA 1.2.840.113549.1.1 - PKCS-1' encryption.\n\n\n-----\n\nNext, the malware creates a directory in the AppData folder where it stores some\nhousekeeping data.\n\nThen a mutex is created. The name of the mutex is resolved dynamically ---- 'shell.\n{FB79CB8E-F0B4-4B09-A183-601B6025EC35}' and is created just before network activity\noccurs ('WSAStartup').\n\n\n-----\n\nA UDP socket is created and will be used to blast that single string to hundreds of IPs.\n\n'sendto' function is included in a loop to contact the external hosts.\n\n\n-----\n\nNext, the encryption commences. Traversing directories via 'FindFirstFile' and\n'FindNextFile'. The malware also looks for network resources to encrypt via\n'WNetOpenEnum'.\n\nOnce encryption completes, the ransom note is opened via 'ShellExecute' with\nparameters 'Open' and '_HELP_DECRYPT_N0BR8ST0_.hta'. This ransom note is far more\nrobust than most. Most ransom notes are a simple text file, this is an .hta that has several\nfunctions, and is apparently quite universally accommodating. The ransom note even has a\nbutton to change the language.\n\n\n-----\n\nAnother interesting code segment is that the .hta file checks the victim's MAC address\nagainst a few MAC addresses associated with VMware and some popular network\ntechnology companies. If there is a match, the URL in the ransom note is updated to\nEnglish. Interesting!\n\nThe most interesting part of this malware to me was how it unpacked itself through code\ninjection and process hollowing. This malware just performs the encryption and then exits, no\npersistence! Most filenames are randomized to evade signature based detection, so regex\nwill be our friends when sweeping for/detecting these artifacts. A Snort rule may be plausible\ndue to the port (6892), but UDP can be noisy. The rule would use PCRE to match the unique\nlong string passed over 6892.\n\nKey Takeaways:\n\n- Encrypts files on disk and in network shares\n\n- Modifies registry\n\n- Drops files on disk\n\n- Performs code injection\n\n- Contacts external hosts\n\nHost-based IOCs:\n\ncerber.exe\n\n2d6ace7910f84eb775272a6590453a0e - md5\n\\AppData\\Local\\Temp\\collages.dll\n\n2A4BF3D01B6C84A2130C110D02C772AC - md5\n\n\n-----\n\n\\AppData\\Local\\Temp\\floppy_disk.png\n\\AppData\\Local\\Temp\\floppy_disk_disabled.png\n\\AppData\\Local\\Temp\\flat.xsl\n\\AppData\\Local\\Temp\\tmpCBD8.bmp\n\\AppData\\Local\\Temp\\0ad3e319\\4f11.tmp\n\\AppData\\Local\\Temp\\0ad3e319\\280c.tmp\n\\AppData\\Local\\Temp\\nshBD76.tmp\\System.dll\n3E6BF00B3AC976122F982AE2AADB1C51 - md5\n\\Desktop\\_HELP_DECRYPT_N0BR8ST0_.hta - Ransom note\n\n\\Desktop\\_HELP_DECRYPT_N0BR8ST0_.jpg - Wallpaper\n\n*.94d4 - file extension tagged onto encrypted files (randomly generated)\n*.bde6 - file extension tagged onto encrypted files (randomly generated)\n*.[a-z0-9]{4} - regex for file extension\nshell.{FB79CB8E-F0B4-4B09-A183-601B6025EC35} - Mutex\n\\Sessions\\1\\BaseNamedObjects\\SM0:6064:168:WilStaging_02 - Based named object\nHKEY_CURRENT_USER\\Control Panel\\Desktop\\WallPaper -REG_SZ C:\\Users\\REM\\AppData\\Local\\Temp\\tmpCBD8.bmp\n\nHard-coded Public Key:\n-----BEGIN PUBLIC KEY----MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvkty5qhqEydR9076Fevp\n0uMP7IZNms1AA7GPQUThMWbYiEYIhBKcT0/nwYrBq0Ogv79K1tta04EHTrXgcAp/\nOJgBhz9N58aewd4yZBm2coeaDGvcGRAc9e72ObFQ/TME/Io7LZ5qXDWzDafI8LA8\nJQmSz0L+/G+LPTWg7kPOpJT7WSkRb9T8w5QgZRJuvvhErHM83kO3ELTH+SoEI53p\n4ENVwfNNEpOpnpOOSKQobtIw56CsQFrhac0sQlOjek/muVluxjiEmc0fszk2WLSn\nqryiMyzaI5DWBDjYKXA1tp2h/ygbkYdFYRbAEqwtLxT2wMfWPQI5OkhTa9tZqD0H\nnQIDAQAB\n-----END PUBLIC KEY----\nNetwork-based IOCs:\n97.15.12.xxx:6892 - UDP\n91.239.24.xxx: 6892 - UDP\nxxx.12.15.97: 6892 - UDP\n\nxxx.24.239.91: 6892 - UDP\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-08-06 - Reversing Cerber - RaaS.pdf"
    ],
    "report_names": [
        "2018-08-06 - Reversing Cerber - RaaS.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535742,
    "ts_updated_at": 1743041140,
    "ts_creation_date": 1653705199,
    "ts_modification_date": 1653705199,
    "files": {
        "pdf": "https://archive.orkl.eu/e344bf0daeef8001e01f8c64ec201515ea285c78.pdf",
        "text": "https://archive.orkl.eu/e344bf0daeef8001e01f8c64ec201515ea285c78.txt",
        "img": "https://archive.orkl.eu/e344bf0daeef8001e01f8c64ec201515ea285c78.jpg"
    }
}