{
    "id": "93d76be3-5249-44a4-a868-27106e3007ba",
    "created_at": "2024-03-14T02:05:33.358155Z",
    "updated_at": "2025-03-27T02:16:44.348258Z",
    "deleted_at": null,
    "sha1_hash": "1e0ba5f2f48df75047dc6969f268758484eada51",
    "title": "China's Digital Colonialism: Espionage and Repression Along the Digital Silk Road",
    "authors": "",
    "file_creation_date": "2021-07-27T09:11:14Z",
    "file_modification_date": "2021-07-27T09:14:16Z",
    "file_size": 1932053,
    "plain_text": "### CYBER\n\n THREAT\n\n ANALYSIS By Insikt Group®\n\n**CHINA**\n\nJuly 27, 2021\n\n# China’s Digital Colonialism: Espionage and Repression \n\n\n-----\n\n2. China’s export of intrusive artificial intelligence\n\n(AI)-enabled technologies and ideologies to\nilliberal regimes around the world enables\nauthoritarianism and systemic oppression and\ndegrades democratic values.\n\n3. Chinese digital dominance poses both a critical\n\ncybersecurity threat to the world and a growing\nthreat to competitors’ markets through the\nassertion of new Chinese-style standards of\ninternet governance.\n\nDigital dominance benefits the Chinese government\n\n_This report profiles the growth of China’s global digital presence and_ in several ways. By building out and controlling access\n_influence through state-sponsored development of digital infrastructure_ to data infrastructure in foreign countries, China is\n_in foreign countries, cyber espionage enablement, and the export of_\n_Chinese surveillance technology. This examination weighs the privacy_ establishing new footholds for the flows of information\n_and security risks associated with Beijing’s growing global influence_ from new markets. And by hosting foreign companies\n_through programs such as the Digital Silk Road Initiative. Data sources_\n_include the Recorded Future Platform, academic papers, government_ and government information in data centers, the Chinese\n_reports, and common open-source tools. The report will be of most_ government has access to valuable intelligence and\n_interest to democratic governments, strategic decision-makers in_\n\nintellectual property (IP) if unchecked by the host\n\n_developing regions such as Latin America, Africa, and South Asia, cyber_\n_defense groups, and corporations hosting data in developing regions._ country. Additionally, China is actively [developing](https://www.uscc.gov/research/chinas-internet-things)\n_Analysis cut-off date: June 22, 2021._ [exploits for the global internet of things (IoT), giving](https://www.uscc.gov/research/chinas-internet-things)\n\nthem an additional layer of access to individual and\n\n#### Executive Summary societal behavior data.\n\nThrough the [Digital Silk Road Initiative (DSR),](https://www.cfr.org/china-digital-silk-road/) As China builds new global internet infrastructure\nannounced in 2015, the People’s Republic of China (PRC) through the Digital Silk Road, it will co-opt billions of\nis building an expansive global data infrastructure and new IoT devices, servers, and foreign resources to\nexporting surveillance technologies to dictators and its cyber arsenal. We posit that Beijing will conduct\nilliberal regimes throughout the developing world, in some extensive influence operations in conjunction with the\ncases trading technology for access to sensitive user development of Chinese-style internet governance in\ndata and facial recognition intelligence. Domestically, [participating Belt and Road Initiative (BRI) countries. If](https://app.recordedfuture.com/live/sc/1xJTq7rD9Pul)\nChina uses this type of technology to assert authority left unchecked by both the rest of the world, China will\nover its citizens, censor the media, quell protests, and reshape internet governance by replacing democratic\nsystematically oppress religious minorities. Now, [over](https://www.brookings.edu/wp-content/uploads/2020/04/FP_20200428_china_surveillance_greitens_v3.pdf) values and standards with authoritarian principles.\n[80 countries are enabled to do the same with Chinese](https://www.brookings.edu/wp-content/uploads/2020/04/FP_20200428_china_surveillance_greitens_v3.pdf)\nsurveillance technology.\n\n#### Key Judgments\n\nMany developing countries are vulnerable to the\n\nChina’s digital colonialism is a growing threat to\n\nexploitation of their data by corporations and powerful\n\ndemocratic values, human rights, and national autonomy,\n\ngovernments due to a lack of direct experience in cyber\n\nespecially in developing regions of the world such as\n\ndefense and an eagerness to catch up with competitors\n\nLatin America and Africa.\n\nthrough rapid digitalization. The 8 case studies in this\nreport serve as examples from Africa, Latin America, and The export of Chinese digital surveillance technology\nSouthwest Asia. This report explores 3 primary concerns to developing and security-vulnerable countries poses\nrelated to China’s digital colonialism: a critical privacy risk to citizens and businesses alike.\n\n1. China’s DSR projects in the least developed China’s development of internet infrastructure in\n\nregions of the world create a power imbalance foreign countries opens avenues for Chinese intelligence\nbetween China and the recipient nations, services abroad and poses a growing risk for cyber\nresulting in a high risk for privacy and espionage intrusion campaigns.\ncybersecurity in those regions.\n\n\n-----\n\nChina’s growing presence and influence in the developing\nworld will pose challenges for democratic institutions and markets\nas it co-opts new alliances through coercion and manipulation.\n\nChina’s intelligence services have unprecedented access to\nforeign user data and vulnerability research through its fused\ncivil-military research ecosystem. China’s dominance in the IoT\nmarket ensures continued access to this data, which can be\nexploited and developed for multiple purposes.\n\nThe CCP will increase influence operations and espionage\noperations globally as the 2022 Winter Olympics in Beijing nears.\nIts focus will be on modeling the benefits of a surveillance\nstate, crushing pro-democracy movements, and managing the\nmessaging around its minority human rights violations in Xinjiang,\nHong Kong, and Tibet.\n\n#### Background\n\nChina’s global digital dominance is developing through a\nprogram called the Digital Silk Road Initiative (DSR), part of the\nmore widely known Belt and Road Initiative (BRI). Launched in\n2015, the DSR is a [private-sector agenda that aims to extend](https://www.cfr.org/china-digital-silk-road/)\nChina’s digital presence abroad, enhancing its commercial and\npolitical influence. The DSR receives heavy support from the\nstate. In its initial stages, Chinese companies have answered\ndemands for digital infrastructure and connectivity in Asia,\nAfrica, and Latin America. Data centers, underwater and\nunderground fiber-optic cable, telecommunications networks,\nsmart education, cloud storage, and online surveillance have\nbeen constructed, creating a backbone for the flow of data to\nand from developing regions.\n\nMirroring its own internal internet controls, China is\npromoting strict global internet regulation by reinventing the\ninternet, enabling nation-states to take control, and replacing\nthe free, open, and decentralized internet infrastructure that\nhas contributed to shaping the digital experience. In September\n[2019, Huawei engineers proposed the “New IP [internet protocol]](https://www.huawei.com/us/industry-insights/innovation/new-ip)\nPlan” to delegates from over 40 countries. Suggesting the current\ninternet as outdated and limited, the engineers presented the\nnew plan: a [top-down design, enabling nation-states to more](https://www.ft.com/content/ba94c2bc-6e27-11ea-9bca-bf503995cd6f)\nefficiently police their digital property and populations.\n\n[The CCP advocates for “cyber sovereignty” (网络主权), the](https://www.cfr.org/blog/how-much-cyber-sovereignty-too-much-cyber-sovereignty)\nsupreme right to govern its own internet, and maintains rigid\ncontrol over the operation and use of its online infrastructure,\nits internet-connected devices, and the online behavior of its\ncitizens. President Xi Jinping is attempting to [revolutionize](http://newamerica.org/cybersecurity-initiative/blog/chinas-strategic-thinking-building-power-cyberspace/)\n[international norms and institutions to accommodate the Chinese](http://newamerica.org/cybersecurity-initiative/blog/chinas-strategic-thinking-building-power-cyberspace/)\nmodel of authoritarian governance while insulating itself from\nglobal accountability.\n\n\nBeijing divides the world into [friends and enemies. Inside](https://securingdemocracy.gmfus.org/friends-and-enemies-a-framework-for-understanding-chinese-political-interference-in-democratic-countries/)\nChina, friends[1] are those who “uphold the leadership of the\n\n[Communist Party] and the socialist cause” through support for its\n[policy agenda. Outside China, the party’s friends are “foreigners](https://www.jstor.org/stable/23732104?seq=1)\nof influence and/or power who assist China’s interests”. Those\nwho publicly question how it chooses to exercise power are\nlabeled enemies, whether they are inside China or abroad. The\nparty has developed[2] a sophisticated set of tools and a body of\ndoctrine to maintain unchallenged power by “uniting friends” and\n“isolating enemies”.\n\nThis divide-and-conquer strategy not only rewards friends\nfor their support but coerces the party’s enemies. Within China,\n[coercive tactics include extralegal detention, limits on public](https://securingdemocracy.gmfus.org/friends-and-enemies-a-framework-for-understanding-chinese-political-interference-in-democratic-countries/)\nspeech, tight control of media messaging and key sectors of the\neconomy, and manipulation of elites by “establishing personal\nand professional costs for opposing the party”. Outside of China,\n[Beijing uses state-sponsored actors to interfere in its enemies’](https://time.com/5334262/chinese-hackers-cambodia-elections-report/)\nforeign elections, [recruit foreign agents for espionage, and](https://www.nytimes.com/2019/08/27/world/asia/china-linkedin-spies.html)\n[disseminate disinformation to isolate its competition.](https://www.atlanticcouncil.org/wp-content/uploads/2020/12/CHINA-ASI-Report-FINAL-1.pdf)\n\n[Publicly, Chinese companies like Huawei claim it would never](https://www.cnbc.com/2019/03/05/huawei-would-have-to-give-data-to-china-government-if-asked-experts.html)\n[turn over user data to Beijing. However, the Cybersecurity Law](https://thediplomat.com/2017/06/chinas-cybersecurity-law-what-you-need-to-know/)\n[of the People’s Republic of China, enacted in 2016, dictates](https://thediplomat.com/2017/06/chinas-cybersecurity-law-what-you-need-to-know/)\nthat local data be stored and provided to the state on demand.\nWhen Beijing identifies intelligence gaps that they cannot fill with\ndata mined domestically, they covertly fill these gaps through\n[cyber espionage operations. Although espionage is a common](https://breakingdefense.com/2020/10/the-5-faces-of-chinese-espionage-the-worlds-first-digital-authoritarian-state/)\nnation-state tactic to inform military and policy decisions, Beijing\n[feeds stolen corporate data and intellectual property to Chinese](https://www.belfercenter.org/publication/confronting-chinas-efforts-steal-defense-information#toc-2-0-0)\ncompanies as well. Its national “Made in China 2025[3]” (MiC2025)\nplan, which aims to transform China from a producer of lowcost goods into a high-tech powerhouse, likely feeds collection\nrequirements into its intelligence community. Financial damages\nfrom Chinese IP theft are [estimated to be as high as $540](https://www.belfercenter.org/publication/confronting-chinas-efforts-steal-defense-information#footnote-099)\nbillion per year. The US Director of National Intelligence (ODNI)\n[calculated that the US alone is losing approximately $400 billion](https://www.whitehouse.gov/wp-content/uploads/2018/03/The-Cost-of-Malicious-Cyber-Activity-to-the-U.S.-Economy.pdf)\n[annually to cyber theft, of which approximately 73% is attributed](https://www.reuters.com/article/usa-china-espionage/top-u-s-officials-to-spotlight-chinese-spy-operations-pursuit-of-american-secrets-idUSL1N28S1B3)\nto Chinese-linked espionage.\n\nTechnological development plays a [leading role in](https://www.researchgate.net/publication/321251274_The_Analysis_of_Role_and_Place_of_Science_and_Technology_in_National_Power)\ndetermining power in our world today. According to the\n[International Telecommunication Union (ITU), globally, only 55%](https://www.itu.int/en/ITU-D/Statistics/Documents/facts/FactsFigures2019.pdf)\nof households have an internet connection. In the developed\nworld, 87% of households are connected, compared with 47%\nin developing nations and just 19% in the least developed\ncountries. These least developed and developing nations are at a\n[significant technological disadvantage and vulnerability to digital](https://longreads.tni.org/digital-colonialism-the-evolution-of-us-empire)\n[colonialism, defined as “the use of digital technology for political,](https://longreads.tni.org/digital-colonialism-the-evolution-of-us-empire)\neconomic, and social domination of another nation or territory”.\n\n1 http://www.cppcc.gov.cn/zxww/2018/12/27/ARTI1545876942660350.shtml\n\n2 http://cpc.people.com.cn/GB/64162/64171/65717/65720/4461190.html\n\n\n-----\n\n_[Figure 1: DSR IT infrastructure projects as of December 2018 (Source: International Institute for Strategic Studies)](https://www.iiss.org/blogs/analysis/2019/01/china-digital-silk-road)_\n\n\nIt encompasses the digitizing of indigenous data without fully\ninformed consent, the theft or exploitation of data, and the use\nof digital tools for influence and power over a subject.\n\nMany transnational technology organizations are expanding\ninternet access to the least developed countries, which\nprovides opportunities for economic growth as well as access\nto healthcare, education, and jobs. However, if done in a way that\nprovides unparalleled benefits and power to the offering party,\nthe process begins to mimic colonialistic behavior of centuries\n[past, creating a digital welfare state. In these circumstances, the](https://www.ohchr.org/EN/Issues/Poverty/Pages/DigitalTechnology.aspx#:~:text=The%20digital%20welfare%20state%20is,%2C%20detect%2C%20target%20and%20punish.)\ncolonizer incentivizes poor or indigenous populations with goods\nand services while imposing their values, ideologies, and norms\nof behavior, as well as extracting and exploiting their personal\n[data. China is fast becoming a “digital dictator”, exploiting foreign](https://www.foreignaffairs.com/articles/china/2020-02-06/digital-dictators)\ndata for profit and corporate gain.\n\n##### China’s Rise to Global Power\n\nChina currently boasts the second largest economy in the\nworld in terms of gross domestic product (GDP), with a GDP of\nover [$13.4 trillion, trailing only behind the US’s GDP of $20.49](https://worldpopulationreview.com/en/countries/countries-by-gdp)\ntrillion. When applying purchasing power parity, factoring in the\n[cost of living and inflation differences, China ranks number one,](https://blogs.worldbank.org/opendata/tracking-gdp-ppp-terms-shows-rapid-rise-china-and-india)\na far cry from where it was just 50 years ago. Its military power\n[ranks third behind the US and Russia by one measure of wartime](https://defsec.net.nz/2020/03/14/how-powerful-china/)\ncapabilities and receives a generous [2021 budget of $209.16](https://www.google.com/url?q=https://www.csis.org/analysis/understanding-chinas-2021-defense-budget&sa=D&source=editors&ust=1624293248239000&usg=AOvVaw283eF3AQgnfn7Ok77mj7qs)\nbillion. With the world’s [largest population at over 1.4 billion](https://www.google.com/url?q=http://www.xinhuanet.com/english/2021-05/12/c_139939402.htm&sa=D&source=editors&ust=1624292570614000&usg=AOvVaw0pMEB_ufRG1O_nBkWqTVp2)\npeople, China has significant human capital through which to\npursue its government’s objectives.\n\n\nSince opening to foreign trade and investment in 1979, China\nhas been one of the fastest growing economies, a pace that the\n[World Bank acknowledged as “the fastest sustained expansion](https://www.everycrsreport.com/reports/RL33534.html#:~:text=the%20global%20economy.-,Since%20opening%20up%20to%20foreign%20trade%20and%20investment%20and%20implementing,sustained%20expansion%20by%20a%20major)\nby a major economy in history”. The CCP enjoys political\nsingularity and direction, aiming all of its resources at continued\ngrowth, sovereignty, and influence. Furthermore, Beijing invests\n[significant resources into overt and covert influence operations,](https://www.atlanticcouncil.org/wp-content/uploads/2020/12/CHINA-ASI-Report-FINAL-1.pdf)\nboth domestically and abroad to protect its reputation and build\nsupport for single-party authoritarianism.\n\nChina creates its own rules and pursues its objectives\nwith little regard for democratic values, global standards, or\n[accountability. Its pursuit of national rejuvenation has created](https://www.culawreview.org/journal/could-china-be-charged-for-the-xinjiang-conflict-exploring-the-applicability-of-international-genocide-law)\nfast success through forced [technology transfer,](https://www.wsj.com/articles/forced-tech-transfers-are-on-the-rise-in-china-european-firms-say-11558344240) [stealing](https://www.fbi.gov/news/speeches/the-threat-posed-by-the-chinese-government-and-the-chinese-communist-party-to-the-economic-and-national-security-of-the-united-states)\n[proprietary information through cyber espionage, limiting](https://www.fbi.gov/news/speeches/the-threat-posed-by-the-chinese-government-and-the-chinese-communist-party-to-the-economic-and-national-security-of-the-united-states)\naccess to its domestic market, and providing state support to\nits homegrown private sector “champions”.\n\n##### The Digital Silk Road Initiative\n\nChina’s DSR [project, which falls under Beijing’s broader](https://www.cfr.org/china-digital-silk-road/)\nBRI, aims to create next-generation digital connectivity across\nthe globe, including through terrestrial and underwater data\ncables, 5G cellular networks, data storage centers, surveillance\nnetworks, and the launch of global satellite navigation systems.\n\n\n-----\n\nDSR-branded infrastructure projects are an avenue for\nBeijing to increase its influence in emerging economies and\ndeveloping countries as well as an opportunity for domestic\ntechnology companies such as Huawei, Alibaba, and Tencent\nto [expand their global business. Through the DSR, China also](https://www.eurasiagroup.net/live-post/digital-silk-road-expanding-china-digital-footprint)\n[provides economic aid, political support, and other welfare to](https://www.cfr.org/china-digital-silk-road/)\nrecipient states.\n\nSince the DSR’s rollout in 2015, China-based companies\nthat initially globalized for purposes of profit have slowly been\n[incorporated into DSR projects. Beijing invests billions of dollars](https://www.forbes.com/sites/wadeshepard/2020/02/28/how-beijing-is-losing-support-for-its-belt-and-road-initiative/)\nof resources to help its domestic [tech champions achieve](https://www.scmp.com/economy/global-economy/article/3094247/xi-jinping-rallies-chinas-tech-champions-rivalry-us)\n[commercial success overseas and is increasingly supporting the](https://merics.org/en/tracker/networking-belt-and-road-future-digital)\nbuildout of digital infrastructures such as fiber-optic cable, 5G\ninfrastructure, satellite data, device production, and applicationlayer software.\n\nBy strengthening other countries’ reliance on Chinese\ninfrastructure and tools, Beijing gains a valuable mechanism for\nlocal political influence. Although this method of exploitation\nis [not exclusive to China, Beijing’s disregard for international](https://longreads.tni.org/digital-colonialism-the-evolution-of-us-empire)\n[norms, its increasingly aggressive foreign policy, and its lack of](https://www.reuters.com/world/china/chinas-wolf-warrior-diplomacy-is-justified-defence-envoy-says-2021-06-17/)\ntransparency raises concerns for the future of global freedom.\n\n##### Technology Empowering Authoritarian Regimes\n\nSocial media-fueled protests have become the most\nsignificant challenge for 21st-century authoritarian regimes.\n[Coups unseated around 9% of the dictatorships that fell between](https://polisci.msu.edu/news-events/news/franz-foreignaffairs.html)\n2001 and 2017. Mass movements led to the collapse of twice as\nmany governments. In addition to movements like the Arab Spring,\n[social media-fueled protests led to the end of dictatorships in](https://www.usip.org/publications/2020/04/amid-coronavirus-online-activism-confronts-digital-authoritarianism)\nBurkina Faso, Georgia, and Kyrgyzstan. The CCP also faces\ndomestic challenges such as [pro-democracy movements and](https://www.bbc.com/news/world-asia-china-55555299)\ncriticism from human rights defenders. To counter these threats\nto its authority, Beijing uses [surveillance technology to track](https://time.com/5735411/china-surveillance-privacy-issues/)\nthe movements and behavior of its citizens, has implemented a\n[social credit system to encourage citizens to conform to laws,](https://merics.org/en/report/chinas-social-credit-system-2021-fragmentation-towards-integration)\nand uses surveillance data to identify and apprehend dissenters,\njournalists, and protesters.\n\nArmed with both experience and tools to counter antigovernment activists, China demonstrates to the world how new\ntechnology can be harnessed to control populations, manipulate\noutcomes, and shift power. Government access to vast networks\nof surveillance cameras, mobile and IoT devices, and private\nservers is a critical threat to privacy. China has stepped in to offer\ninexpensive, comprehensive technology packages to nations\nand regimes that otherwise would not be able to afford them.\n[Furthermore, China teaches governments how to censor, surveil,](https://www.usnews.com/news/best-countries/articles/2018-11-01/china-expands-its-surveillance-model-by-training-other-governments)\nand manage the data that is collected. In 2020, only 43% of\n[the least developed countries had established data and privacy](https://unctad.org/news/data-and-privacy-unprotected-one-third-countries-despite-progress)\n\n\nprotection legislation. The security knowledge gap between\nthe seller (China) and the buyer (recipient government) creates\na dynamic that unknowingly leaves the buyer in a vulnerable\nsecurity posture. Selling this type of technology creates a winwin for China: they get access to private data overseas and\nenable like-minded governments with powerful technical tools,\nthereby developing important alliances.\n\n##### Foreign Footholds for Cyber Espionage\n\nChina is employing both its private and public sectors to\nfacilitate its vision for a new internet and a world more friendly\nto its preferences and policies. Cyber espionage operations\nhave been attributed to Chinese state-sponsored threat actors\nas far back as 2006 and have increased in volume and severity\nsince. These groups have been [discovered in hundreds of](https://securityboulevard.com/2020/12/china-cyber-attacks-the-current-threat-landscape/)\nforeign networks, stealing diverse intellectual properties such\nas diplomatic plans, medical data, and military technology.\nWe have uncovered several Chinese state-sponsored threat\nactivity groups, including [RedDelta,](https://www.recordedfuture.com/reddelta-targets-catholic-organizations/) [RedEcho, and](https://www.recordedfuture.com/redecho-targeting-indian-power-sector/) [RedFoxtrot,](https://www.recordedfuture.com/redfoxtrot-china-pla-targets-bordering-asian-countries/)\nconducting targeted intrusions against foreign governments and\nreligious organizations.\n\nAccording to [Chinese officials, over 6,000 Chinese](https://carnegieendowment.org/2020/05/08/will-china-control-global-internet-via-its-digital-silk-road-pub-81857)\nenterprises and over 10,000 Chinese technology products\nhave penetrated overseas markets. As China builds new global\ninternet infrastructure through the DSR, it will co-opt billions\nof new IoT devices, servers, and foreign resources to its cyber\narsenal, increasing its global stature, market domination, and\ncyber-military superiority. This growth will create new avenues\nand opportunities for cyber intrusions and espionage campaigns.\n\n##### Digital Infrastructure Projects in Undeveloped Countries\n\nChinese companies such as China Telecom, China Unicom,\nChina Mobile, GDS, and 21Vianet dominate the [data center](https://www.datacenterknowledge.com/archives/2017/01/20/here-are-the-10-largest-data-center-providers-in-the-world)\n[market, together making up 15.4% of the global market share.](https://www.datacenterknowledge.com/archives/2017/01/20/here-are-the-10-largest-data-center-providers-in-the-world)\nThe Chinese data center industry is enjoying dramatic growth\nas a result of a few key factors, including state support through\nthe BRI, DSR, and Made in China 2025 plans; foreign demand for\ninexpensive goods; a strategic focus on undeveloped regions;\nand oftentimes coercion to adopt China’s technology. These\nfactors have fueled China’s own economic and military growth.\n\nChina’s greatest tech champion, Huawei, is the leading seller\nof 5G technology and smartphones despite the US decision to ban\nHuawei technology due to security concerns. Huawei signed a\n[$175 million “smart city” contract with Kenya, a cloud data center](https://link.springer.com/article/10.1007/s11036-020-01524-4)\ncontract with [Pakistan, and a 4G high-speed wireless internet](https://www.techjuice.pk/huawei-to-establish-its-first-cloud-center-in-pakistan-ceo-meets-pm-khan/)\ncontract with [Canada. In February 2020,](https://www.reuters.com/article/telecoms-5g-ericsson/ericsson-shares-boosted-after-5g-contract-win-in-canada-beating-huawei-idUSL4N2DG2GE) [Thailand launched](https://www.reuters.com/article/huawei-thailand/thailand-launches-huawei-5g-test-bed-even-as-us-urges-allies-to-bar-chinese-gear-idUSL3N1ZV47W)\nHuawei’s first 5G testbed in Southeast Asia. In April 2019, Huawei\n\n\n-----\n\n[launched its Cloud and AI Innovation Lab in Singapore, intended](https://www.huawei.com/en/news/2019/4/huawei-cloud--ai-innovation-lab-singapore)\n[to align with its “Smart Nation” Initiative.](https://www.smartnation.gov.sg/docs/default-source/default-document-library/smart-nation-strategy_nov2018.pdf?sfvrsn=3f5c2af8_2)\n\nIn 2012, the US House Intelligence Committee labeled\nHuawei a [national security threat and warned that it had](http://www.nytimes.com/2012/10/09/us/us-panel-calls-huawei-and-zte-national-security-threat.html)\nstolen intellectual property through backdoors that allowed\nunauthorized access to sensitive data. [US concerns center](https://www.cfr.org/backgrounder/huawei-chinas-controversial-tech-giant)\n[around the Chinese Cybersecurity Law that the government can](https://thediplomat.com/2017/06/chinas-cybersecurity-law-what-you-need-to-know/)\nuse to subpoena sensitive or proprietary customer data from\nChinese corporations. Other concerns include the fear of hidden\nbackdoors in Huawei technology, which could subsequently\nbe used to attack US internet infrastructure. In 2019, the US\n[Department of Commerce added Huawei to its “Entity List”,](https://www.reuters.com/article/us-usa-china-huaweitech/chinas-huawei-70-affiliates-placed-on-us-trade-blacklist-idUSKCN1SL2W4)\nrestricting it from conducting business with US partners.\n\nRecently, nations such as Australia, Great Britain, and Japan\n[have heeded cybersecurity and espionage warnings from the US,](https://www.wsj.com/articles/at-gathering-of-spy-chiefs-u-s-allies-agreed-to-contain-huawei-11544825652?mod=article_inline)\nbanning Huawei from building their 5G networks. However, many\ndeveloping countries have opted into expansive DSR contracts\nwith Chinese technology companies in trade for inexpensive\ninternet and trade deals. The following case studies outline\nsecurity threats developing countries have faced due to DSR\ndeals with China and how Chinese surveillance technology is\nfurther enabling pervasive privacy concerns.\n\n##### Case Study 1: African Union\n\nIn January 2017, computer scientists at the African\nUnion (AU) headquarters’ IT center in Addis Ababa, Ethiopia,\n[discovered massive amounts of local data being transferred to](https://www.voanews.com/africa/after-allegations-spying-african-union-renews-huawei-alliance)\nunfamiliar servers in Shanghai, China every day between 12 AM\nand 2 AM local time. The AU headquarters building and data\ncenter was donated as “China’s gift to the friends of Africa” in\n2012. The computer systems were delivered turnkey, but with\n[2 digital backdoors, created by design to allow the free flow of](https://www.momoafrica.com/le-monde-report-african-union-spied-china-five-years-china-denies-act/)\nAU’s proprietary communications and production data directly\nto China. This event created a breach of trust between the 2\nparties. Although it was quietly resolved at the highest levels of\nthe AU, it also represented a turning point for IT security in the\nAfrican Union. After the Chinese engineers were dismissed from\ntheir roles with the AU, the AU acquired its own new servers and\ndeclined China’s offer to configure them.\n\n\n_Figure 2: The African Union Conference Center and Office Complex (AUCC), the headquarters of the_\n_African Union, in Addis Ababa, Ethiopia_\n\nThe AU’s data traffic was routed through [Ethio Telecom,](https://www.zte.com.cn/global/about/magazine/zte-technologies/2015/6/en_669/446034.html)\nthe sole public operator in Ethiopia at that time. Ethio Telecom,\na state-owned Ethiopian firm, is also notorious for its cyber\nsurveillance and electronic espionage technology, provided\nby the Chinese company ZTE. Ethio [monitors and controls](https://www.hrw.org/news/2014/04/07/ethiopias-borderless-cyberespionage)\ncommunications, providing intelligence to the government\nto silence dissenters, conduct interrogations, target foreign\ndiplomats, and spy on domestic phone calls without warrants.\n\nIn July 2017, during the AU’s 29th Summit, security inspectors\nalso discovered the conference rooms bugged with microphones,\nsuspected to be Chinese devices, under desks and in the walls.\n[When confronted with this information, AU authorities remarked](https://www.lemonde.fr/afrique/article/2018/01/26/a-addis-abeba-le-siege-de-l-union-africaine-espionne-par-les-chinois_5247521_3212.html)\nthat this was the cost of being “supported [in] the independence\nstruggle on the continent and [being] helped economically”.\n\n##### Case Study 2: Papua New Guinea\n\nIn 2018, Huawei built a data center for the government of\nPapua New Guinea that was later discovered to be critically\n[vulnerable to cyber espionage by design. A report prepared by](https://www.afr.com/companies/telecommunications/huawei-data-centre-built-to-spy-on-png-20200810-p55k7w)\nAustralia’s Department of Foreign Affairs on behalf of Papua\nNew Guinea’s National Cyber Security Centre detailed multiple\nsecurity failures, including outdated encryption software and\nfirewalls and insufficient firewall coverage on core switches,\nmeaning remote access by hackers would be undetected. The\n[$53 million data center, sponsored by the Chinese government,](https://www.datacenterdynamics.com/en/news/australia-huaweis-papua-new-guinea-data-center-security-openly-broken-making-potential-spying-easy/)\nwas meant to host all of Papua New Guinea’s government data,\nbut most departments did not shift to the new center due to a\nlack of funding for maintenance.\n\n\n-----\n\nTo resolve these issues, Papua New Guinea turned\nto Australia for financial assistance. When the Australian\ngovernment investigated the architecture of the data center and\ncommissioned the report, it concluded that a full rebuild would\nbe required to comply with industry standards and requirements,\n[something Huawei adamantly denied. The report also stated that](https://www.wsws.org/en/articles/2020/08/27/pnga-a27.html)\nit was a “deliberate effort by Huawei to deploy lax cybersecurity”.\nAustralia spent $200 million and took actions to block Huawei\nfrom accessing submarine data cables they laid between Papua\nNew Guinea and the Solomon Islands as well as Australia. Huawei\n[has since sold its majority stake in those cables to China-based](https://www.datacenterdynamics.com/en/news/amid-sanctions-huawei-plans-sell-its-submarine-cable-business-hengtong/)\nHengtong Group, Inc.\n\nWith limited cybersecurity training and no counterespionage\ncapabilities, entities like the African Union and Papua New Guinea\nare at critical risk of compromise, accepting “digital welfare”\nfrom China but lacking the ability to sufficiently detect security\nvulnerabilities designed into its hardware and software.\n\n##### Telecommunications Projects in Undeveloped Countries\n\nChinese officials [view the construction of next-generation](https://www.foreign.senate.gov/imo/media/doc/2020%20SFRC%20Minority%20Staff%20Report%20-%20The%20New%20Big%20Brother%20-%20China%20and%20Digital%20Authoritarianism.pdf)\ntelecommunications infrastructure as critical to gaining a role in\ninternet governance discussion on the global stage. The greater\nthe role that Chinese companies play in the development of\nfiber optic systems and mobile communications, the greater the\nrole they will have in setting standards for the world. China has\nalso promoted its concept of internet sovereignty among BRI\nparticipants by teaching strict data governance, restrictive laws,\nand oppressive control.\n\nHuawei has a presence in over 170 countries. The majority\nof current cellular infrastructure in Africa was also built by\nHuawei. Starting in the 1990s, when 2G and 3G networks\nwere built, Huawei [laid the foundation for future technology](https://www.eurasiagroup.net/files/upload/Digital-Silk-Road-Expanding-China-Digital-Footprint-1.pdf)\nat steeply discounted prices. Backed by Chinese government\nloans, Huawei subsidized IT infrastructure throughout Africa,\nanswering demands for more affordable and more available\ntelecommunications infrastructure.\n\nBeijing has positioned itself to dominate technology in all\nemerging markets, including Latin America, Africa, and the IndoPacific. Latin America is an important battleground in which\nChinese companies are building infrastructure and setting\ntechnological standards. China initially focused on [extractive](https://www.cfr.org/report/chinas-belt-and-road-implications-for-the-united-states/findings)\n[sectors and non-digital infrastructure projects, including the](https://www.cfr.org/report/chinas-belt-and-road-implications-for-the-united-states/findings)\nBelt and Road Initiative, which Beijing extended to Latin America\nin [2017. However, Chinese technology companies such as ZTE](https://dialogochino.net/en/infrastructure/36699-coronavirus-reshapes-belt-and-road-in-latin-america/)\nand Huawei also made important breakthroughs in the region.\n[Huawei saw a 21.3% increase in revenue from its Latin America](https://www.huawei.com/-/media/corporate/pdf/annual-report/annual_report2018_en_v2.pdf)\noperations in its initial year operating in the region. Much of\n\n\nthat growth can be attributed to the company’s development\nof telecommunication infrastructure in countries like Mexico,\nVenezuela, and Brazil. From 2002 to 2018, 62% of China’s\n[commercial engagement was through mergers and acquisitions,](https://dialogochino.net/wp/wp-content/uploads/2019/04/Monitor-OFDI-2019english-2.pdf)\nobtaining energy, telecommunications, and infrastructure.\n\nAs of 2019, Huawei was operating in 20 Latin American\ncountries and dominates as the third top cell phone provider in\nMexico, Colombia, Peru, and Central America. Earlier this year,\nchief of US Southern Command Admiral Craig Faller [warned](https://www.mcclatchydc.com/news/nation-world/national/national-security/article249986534.html)\nCongress that China was conducting “medical diplomacy” to\nleverage its vaccine supply to negotiate the entry of Huawei 5G\nand IT infrastructure into Latin American markets.\n\n##### Case Study 3: Brazil\n\nIn January 2021, Brazilian president Jair Bolsonaro [agreed](https://www.reuters.com/article/us-brazil-huawei-tech/brazils-bolsonaro-to-allow-chinas-huawei-in-5g-auctions-newspaper-idUSKBN29L0JM)\nto allow Huawei to bid on building out a 5G network in the\ncountry after initially opposing it just months prior. Previously,\nUS president Donald Trump [pressured President Bolsonaro to](https://www.reuters.com/article/us-huawei-tech-brazil-5g/brazil-may-face-consequences-if-it-gives-huawei-5g-access-says-u-s-ambassador-idUSKCN24U20X)\noppose the adoption of Huawei’s 5G technology in Brazil, but\nBolsonaro faced resistance from both industry and his own\ngovernment, which may have influenced his decision to allow\n[Huawei to make a bid. Of note, China is currently Brazil’s largest](https://www.worldstopexports.com/brazils-top-import-partners/)\n[trading partner, giving China significant influence in decisions](https://www.worldstopexports.com/brazils-top-import-partners/)\nrelated to industry partnerships in the country. Huawei has been\n[present in Brazil for 22 years and has already conducted 5G tests](https://www.reuters.com/article/us-huawei-tech-brazil-5g/huawei-says-u-s-pressure-on-brazil-threatens-long-delays-in-5g-rollout-idUSKBN2482WS)\nwith all the wireless companies in Brazil.\n\nHuawei has been expanding its digital influence in Brazil,\nopening an internet-of-things lab in the state of São Paulo in\npartnership with the Institute of Technology, a research entity\nfounded in 2003 and accredited by the Ministry of Science,\nTechnology, Innovation, and Communication. Huawei also\nsupports an internet-of-things center with Telefónica and a\nseparate partnership with the Pontifical Catholic University of\nRio Grande do Sul on a smart public lighting system.\n\n##### Case Study 4: Uruguay\n\nIn August 2019, the Uruguayan government signed a\n[memorandum of understanding with Huawei to deepen](http://www.xinhuanet.com/english/2019-08/27/c_138342414.htm)\ncooperation on emerging technologies, such as 5G networks,\nartificial intelligence, the internet of things, and cloud computing.\nThe bilateral agreement also expands cooperation in agriculture,\nclean energy, communications, mining, manufacturing, and\nfinance through the Belt and Road Initiative. Former Uruguayan\npresident Tabaré Vázquez developed a strong political alliance\nwith Chinese President Xi Jinping while he was in office and\nhad, since 2016, offered [explicit support to the One-China](https://www.fmprc.gov.cn/mfa_eng/zxxx_662805/t1407320.shtml)\npolicy and backed China’s reunification with Taiwan. President\n[Vázquez also stressed that Uruguay was ready to play a leading](https://agdconsult.com/uruguays-controversial-trade-dealings-with-china/)\n\n\n-----\n\nrole in advancing Latin America-China relations and “enhance\ncoordination on international and regional issues”. Uruguay will\nlikely play an important role in influencing other Latin American\ngovernments toward cooperation with China.\n\n##### Access to the Global Internet of Things\n\nChina poses a grave threat to global privacy and security\nas its state-sponsored surveillance apparatuses are accessing\ninternet-of-things (IoT) data well in excess of accepted\ninternational norms. According to a [study by global market](https://www.business-standard.com/international)\nresearch firm International Data Corporation (IDC), the Chinese\nIoT market will reach $300 billion by 2024, putting it ahead\nof all competition. No other government in the world has this\nlevel of IoT market domination and access to the IoT data of\nforeign consumers. The collection and exploitation of IoT data\nis [regarded by the CCP as an economic and technological](http://www.miit.gov.cn/n1146295/n1146562/n1146650/c3074283/content.html.)\n[“strategic high ground”. The data is fed into a fused civil-military](https://www.uscc.gov/sites/default/files/Research/SOSi_China's%20Internet%20of%20Things.pdf)\n[research ecosystem involving PRC intelligence and military](https://www.uscc.gov/sites/default/files/Research/SOSi_China%27s%20Internet%20of%20Things.pdf)\nactors who will have access to breakthroughs in IoT vulnerability\nresearch. Additionally, China’s increased effort to influence and\nset international IoT standards is a critical part of its ambitious\nstate-directed plan to achieve dominance in the IoT industry.\n\nChinese companies can access IoT data in 5 main ways:\n\n1. At the user level, Chinese companies can access\n\nuser data simply from sales and use of their IoT\n[products, including abusive terms of service and usage](https://www.caixinglobal.com/2021-05-11/internet-security-apps-called-out-for-personal-data-abuse-101709810.html)\nagreements.\n\n2. Device-level access through device manufacturing\n\n[and design vulnerabilities and backdoors open up](https://www.uscc.gov/sites/default/files/Research/SOSi_China%27s%20Internet%20of%20Things.pdf)\nopportunities for outside entities to collect information\nat scale.\n\n3. At the corporate level, Chinese companies can\n\n[acquire foreign IoT companies and the data they have](https://www.uscc.gov/files/000783)\naccumulated through their products, or buy foreign data\nthrough a third-party vendor.\n\n4. The Chinese government can subpoena private data\n\nat will from foreign businesses (in China) through its\n[Cybersecurity Law.](https://web.archive.org/web/20161029174914/http://www.npc.gov.cn/npc/xinwen/lfgz/flca/2015-07/06/content_1940614.htm)\n\n5. Collection of user data, human behavior, and device\n\ninformation from Chinese-made applications used\nworldwide, including social media, games, IoT firmware,\nand business software.\n\n\nUnauthorized access to IoT devices has already resulted\nin [physical consequences, including attacks on industrial](https://www.mdpi.com/2076-3417/10/12/4102/pdf)\nmachinery and power grids around the world. The widespread\nuse of Chinese IoT devices and components suggests that the\naggregate negative consequences of unauthorized access to\nChinese devices may be proportionally larger than for devices\n[from other countries. For example, the 2016 Mirai botnet attack](https://www.theguardian.com/technology/2016/oct/26/ddos-attack-dyn-mirai-botnet)\n[was largely enabled by vulnerable devices produced by Chinese](https://www.computerworld.com/article/3134097/chinese-firm-admits-its-hacked-products-were-behind-fridays-ddos-attack.html)\nmanufacturer Hangzhou Xiongmai Technology. The company\nacknowledged that its DVR and internet-connected cameras were\ncreated with weak default passwords and security vulnerabilities.\n\n#### Digital Repression and the Export of Surveillance Technologies\n\nThe world is facing a deepening [recession in democratic](https://freedomhouse.org/report/freedom-world/2021/democracy-under-siege)\n[freedom for the 15th consecutive year. In 2020, the COVID-19](https://freedomhouse.org/report/freedom-world/2021/democracy-under-siege)\npandemic, economic and physical insecurity, and violent conflict\nshifted the international balance away from democratic values\nand in favor of tyranny. Last year, nearly [75% of the world’s](https://freedomhouse.org/report/freedom-world/2021/democracy-under-siege)\npopulation resided in a country that faced deterioration of\nfreedom. China and [Russia both strengthened anti-democratic](https://www.rferl.org/a/u-s-capitol-chaos-russia-reaction-kremlin-trump-biden/31038013.html)\n[narratives and used the COVID pandemic to criticize the handling](https://abcnews.go.com/Politics/chinas-ambassador-us-slams-trump-covid-19-blame/story?id=72187153)\nof the disease by democratic nations. Beijing countered criticism\n[of its handling of the COVID-19 outbreak with an intense global](https://www.recordedfuture.com/covid-19-chinese-media-influence/)\n[disinformation campaign and domestic censorship. Authoritarian](https://www.recordedfuture.com/covid-19-chinese-media-influence/)\nregimes around the world are evolving to embrace the internet,\nsocial media, and AI to counter their greatest threat — mass antigovernment protests. At least 18 countries are [currently using](https://freedomhouse.org/report/freedom-net/2018/rise-digital-authoritarianism)\nChinese surveillance and censorship technology, and more than\n36 governments have held Chinese-led training on “new media”\nor “information management”.\n\nChina is [exporting digital authoritarianism en masse to](https://www.foreign.senate.gov/imo/media/doc/2020%20SFRC%20Minority%20Staff%20Report%20-%20The%20New%20Big%20Brother%20-%20China%20and%20Digital%20Authoritarianism.pdf)\nreinforce and enhance political repression under the guise of\nbuilding “safe cities” projects that use tracking devices, video\ncameras, and other surveillance technology to enhance law\nenforcement and military capabilities. This activity shows up\npredominantly in the Southern hemisphere, where adoption\nof [authoritarian-style surveillance technologies in the name of](https://freedomhouse.org/report/freedom-net/2018/rise-digital-authoritarianism)\npublic safety will create both repression of human rights and\nprivacy in those countries, and vulnerability of personal data\nto Chinese interception and exploitation. In Africa, for example,\nChina is implementing facial recognition technology and [using](https://qz.com/africa/1287675/china-is-exporting-facial-recognition-to-africa-ensuring-ai-dominance-through-diversity/)\n[the data to advance its capabilities on dark-skinned individuals.](https://qz.com/africa/1287675/china-is-exporting-facial-recognition-to-africa-ensuring-ai-dominance-through-diversity/)\n\n\n-----\n\nWhile this advancement may serve to improve recognition\nof individual faces of all different colors and shapes, [human](https://www.hrw.org/report/2021/04/19/break-their-lineage-break-their-roots/chinas-crimes-against-humanity-targeting)\n[rights groups point out that Chinese surveillance companies](https://www.hrw.org/report/2021/04/19/break-their-lineage-break-their-roots/chinas-crimes-against-humanity-targeting)\nare programming the technology to recognize and categorize\ngroups of minorities for purposes of monitoring, detaining, and\n[repression. These groups, called “sensitive peoples” by Chinese](https://www.nytimes.com/2019/04/14/technology/china-surveillance-artificial-intelligence-racial-profiling.html)\ntechnology company [CloudWalk, include the Uyghur Muslim](https://www.wsj.com/articles/twelve-days-in-xinjiang-how-chinas-surveillance-state-overwhelms-daily-life-1513700355)\npopulation of Xinjiang, of which the CCP is conducting systematic\nand widespread human rights violations.\n\nThis confluence of factors, including the availability of this\ntechnology to repressive regimes, the established use of this\nsurveillance technology for repression of minority groups, and\nthe advancements in grouping individuals by appearance, has\nserious implications for minorities and repressed peoples around\nthe world.\n\n##### Africa\n\nChinese companies are aggressively targeting African\nmarkets with facial recognition surveillance technology under the\nguise of promoting “safe cities”. However, the push into African\nsocieties is concerning because China [aims to advance facial](https://www.nytimes.com/2019/04/14/technology/china-surveillance-artificial-intelligence-racial-profiling.html)\nrecognition capabilities on dark-skinned individuals. According to\nHuman Rights Commissioner Edward Santow, facial recognition\ntechnology is [less accurate when used on people with darker](https://www.abc.net.au/news/2020-02-04/fact-check-facial-recognition-darker-skin/11781192?nw=0)\nskin and presents challenges in diverse societies as dark-skinned\nindividuals could be excessively targeted or excluded from\nsurveillance activities. More accurate differentiation between\ndark-skinned faces has led to increased political targeting of\nindividuals within African countries and could lead to increased\nracist persecution around the world. The Chinese technology\ninfluence in Africa involves several companies:\n\n[• Chinese telecom giant ZTE provides the infrastructure](https://www.hrw.org/report/2014/03/25/they-know-everything-we-do/telecom-and-internet-surveillance-ethiopia)\n\nfor the Ethiopian government to monitor its citizens’\ncommunications.\n\n  - Huawei employees embedded in Zambian cybersecurity\n\n[teams intercepted encrypted communications and used](https://www.wsj.com/articles/huawei-technicians-helped-african-governments-spy-on-political-opponents-11565793017)\ncell data to track political opponents.\n\n[• In 2015, Hikvision opened an office in Johannesburg.](https://www.switchcom.co.za/collections/hikvision)\n\n[Hikvision, a leading provider of surveillance cameras, is](https://www.nytimes.com/2019/04/14/technology/china-surveillance-artificial-intelligence-racial-profiling.html)\nbased in Hangzhou, Xinjiang, the heart of the persecuted\nUyghur population. Hikvision technology is notorious for\n[being vulnerable to cyberattacks.](https://www.csis.org/blogs/technology-policy-blog/hikvision-corporate-governance-and-risks-chinese-technology)\n\nAs of January 2021, [41 African countries have signed](https://green-bri.org/countries-of-the-belt-and-road-initiative-bri/)\nmemorandums of understanding to join China’s Belt and Road\nInitiative. Of those, 13 have acquired advanced surveillance\ncapabilities, and 9 of those — Botswana, Côte d’Ivoire, Ghana,\nKenya, Mauritius, Morocco, South Africa, Uganda, and Zambia —\nare implementing “safe city” systems, all produced by Huawei.\n\n\n_[Figure 3: Huawei projects in Africa, 2019 (Source: Wall Street Journal)](https://www.wsj.com/articles/huawei-technicians-helped-african-governments-spy-on-political-opponents-11565793017)_\n\n[In Africa, 5 countries are direct beneficiaries of Digital Silk](https://www.bloomberg.com/news/articles/2021-01-21/cdc-group-targets-1-billion-of-african-investments-in-2021)\nRoad investments totaling $8.43 billion: Angola, Ethiopia, Nigeria,\nZambia, and Zimbabwe. The following case studies serve as\nexamples of how Chinese surveillance technology is enabling\nauthoritarianism, human rights violations, and diminishing\ndemocratic values throughout the developing world.\n\n##### Case Study 5: Uganda\n\nIn 2018, Uganda’s President Yoweri Museveni ordered his\ncyber-surveillance intelligence unit to intercept encrypted online\ncommunications and cell phone calls of a “popstar turned political\nopponent” named Bobi Wine. According to an investigation by\nthe [Wall Street Journal, when the regime’s intelligence agents](https://www.wsj.com/articles/huawei-technicians-helped-african-governments-spy-on-political-opponents-11565793017)\ntried for days to hack Wine’s WhatsApp and Skype accounts and\nfailed, they requested assistance from Huawei, the top digital\nsupplier in Uganda. Within 2 days, the Huawei engineers were\nallegedly able to successfully breach Wine’s WhatsApp account\nusing spyware. Museveni’s regime then used the access to\nsabotage the opponent’s political rallies and [arrest Wine and](https://apnews.com/article/yoweri-museveni-kampala-elections-bobi-wine-arrests-f8349719f285adbf2660e22fcb72b5e5)\n[hundreds of his supporters.](https://apnews.com/article/yoweri-museveni-kampala-elections-bobi-wine-arrests-f8349719f285adbf2660e22fcb72b5e5)\n\n\n-----\n\nBeijing has been conducting the same activity domestically\n[to monitor, censor, and control its own population for decades](https://cs.stanford.edu/people/eroberts/cs181/projects/2010-11/FreeExpressionVsSocialCohesion/china_policy.html)\n[through its “Great Firewall” and state-sponsored “law](https://www.eff.org/deeplinks/2019/10/chinas-global-reach-surveillance-and-censorship-beyond-great-firewall)\n[enforcement” programs. According to the investigation, Huawei](https://www.eff.org/deeplinks/2019/10/chinas-global-reach-surveillance-and-censorship-beyond-great-firewall)\nemployees not only played a direct role in government efforts\nto intercept the private communications of opponents, but they\n[also encouraged Ugandan security officials to travel to Algeria so](https://www.wsj.com/articles/huawei-technicians-helped-african-governments-spy-on-political-opponents-11565793017)\nthey could study Huawei’s “intelligent video surveillance system”\n[operating in the capital city of Algiers. Uganda later agreed to](https://www.huawei.com/en/news/2016/7/huawei-wins-algeria-houari-boumediene-airport-bid)\nspend [$126 million on a similar facial recognition surveillance](https://www.reuters.com/article/us-uganda-crime/ugandas-cash-strapped-cops-spend-126-million-on-cctv-from-huawei-idUSKCN1V50RF)\nsystem from Huawei.\n\n##### Case Study 6: Zimbabwe\n\nIn March 2018, the government of Zimbabwe agreed to\na [strategic partnership with Guangzhou-based CloudWalk](http://www.globaltimes.cn/content/1097747.shtml)\nTechnology to develop facial recognition programs in the\ncountry. As part of the deal, Zimbabwe agreed to share all facial\nrecognition data from its local databases to CloudWalk for further\nanalysis. Yao Zhiqiang, strategic director of CloudWalk’s research\nand development center, [expressed that “in order to make a](https://www.globaltimes.cn/content/1102797.shtml)\nbreakthrough with [facial recognition] technology, deep learning\nneeds to be exploited”, referring to the AI gaps in analyzing darkskinned faces.\n\nSurveillance tools such as CCTV, AI projects, and facial\nrecognition are also transforming Zimbabwe’s ability to track\ncitizens, political opponents, monitor dissent, counter-protests,\nand consolidate political control. However, Zimbabwe’s\ngovernment remains under [targeted sanctions from the US,](https://home.treasury.gov/policy-issues/financial-sanctions/sanctions-programs-and-country-information/zimbabwe-related-sanctions)\nmeaning there are reputational and legal risks for western\ncompanies attempting to sell sensitive digital equipment to its\n[government. CloudWalk has stepped in to fill that void, directly](https://foreignpolicy.com/2018/07/24/beijings-big-brother-tech-needs-african-faces/)\n[supporting an oppressive government that willingly and violently](https://foreignpolicy.com/2018/07/24/beijings-big-brother-tech-needs-african-faces/)\nsubdues its population. The deal is built on a long relationship\nbetween former President Robert Mugabe’s regime, considered\n[an ideological ally by Beijing. In 2016, Mugabe publicly expressed](http://www.sundaymail.co.zw/social-media-regulation-is-nigh/)\nhis desire to emulate Chinese-style social media censorship. The\ncurrent president, Emmerson Mnangagwa, took office after a\n2017 military coup ousted Mugabe after 37 years of repressive\n[rule, but activists are skeptical of any significant progress being](https://carnegieeurope.eu/2019/10/24/civic-activism-in-post-mugabe-era-pub-80146)\nmade on the human rights front.\n\n##### Latin America\n\n Case Study 7: Venezuela\n\nIn 2008, Venezuelan president Hugo Chávez sent a Justice\nDepartment [envoy to Shenzhen, China to explore the Chinese](https://www.reuters.com/article/us-venezuela-zte-specialreport/special-report-how-zte-helps-venezuela-create-china-style-social-control-idUSKCN1NJ1TT)\nsocial credit system and its national ID card system. During their\nvisit, they were taken to the headquarters of Chinese telecom\n\n\ngiant ZTE Corp., where they learned how China was developing a\nsystem to track social, political, and economic behavior through a\nnational ID card. President Chávez expressed immediate interest\nin the idea but [opted to use a Cuban firm to make millions of](https://www.acton.org/pub/commentary/2020/01/08/china-exports-its-social-credit-system-venezuela)\nID cards for $172 million. When the Venezuelan delegation’s\ntechnical advisor, Anthony Daquin, later [expressed concerns](https://www.reuters.com/investigates/special-report/venezuela-zte/)\nover privacy overreach to the Venezuelan government, he was\ndetained, beaten, and extorted by Venezuelan intelligence\nagents, prompting him to flee the country.\n\nIn 2017, with the Maduro regime in power, Venezuela\n[contracted with ZTE on a $70 million government effort to build](https://www.acton.org/pub/commentary/2020/01/08/china-exports-its-social-credit-system-venezuela)\na national ID card, payment system, and “fatherland database” to\ntrack individuals’ transactions, personal information, and social\n[media accounts. Now, a team of ZTE employees is embedded in](https://www.reuters.com/article/us-venezuela-zte-specialreport/special-report-how-zte-helps-venezuela-create-china-style-social-control-idUSKCN1NJ1TT)\na special unit at Cantv, the Venezuelan state telecommunications\ncompany that manages the database, which is housed on ZTE\nservers. Information retained on Venezuelan citizens through the\nsystem includes PII such as dates of birth, family information,\nemployment and income, property owned, medical history, state\nwelfare benefits received, presence on social media, membership\nof a political party, and voter history.\n\n_[Figure 5: Venezuelan president Nicolas Maduro holding a fatherland ID card (Source: ABC News)](https://www.abc.net.au/news/2018-11-16/nicolas-maduro-shows-off-venezuelan-fatherland-card-1/10504086?nw=0)_\n\nSince the project was initiated, President Maduro has\nupgraded to a larger version of the system, aiming to add 30,000\ncameras and payment applications. Su Qingfeng, the head of\nZTE’s Venezuela unit, confirmed that it has sold the Venezuelan\ngovernment servers to host the system’s data and to host new\nChinese mobile payment applications.\n\n\n-----\n\nDespite protests from concerned citizens and human rights\nactivists, the program is being mandated across the country.\nThe government requires citizens to enroll in order to receive\npublic benefits including health care and pension payments,\nleaving the poorest populations vulnerable to data collection\nand exploitation.\n\nIn 2016, the US Department of Justice determined that ZTE\n[violated its sanctions on Iran by selling American “controlled](https://s3.amazonaws.com/public-inspection.federalregister.gov/2016-05104.pdf)\nitems” to the country as part of a surveillance technology package\n[used to monitor its citizens. As a result, a settlement was made](https://www.nytimes.com/2018/07/13/business/zte-ban-trump.html)\nbetween the Chinese corporation and the US government: pay\na $1 billion penalty, put $400 million in escrow with an American\nbank, overhaul its leadership, and allow a team of compliance\nmonitors to be installed inside the company for 10 years.\n\nOn November 30, 2020, the US Department of the Treasury\n[added the Chinese surveillance company China National](https://home.treasury.gov/news/press-releases/sm1194)\nElectronics Import and Export Corporation (CEIEC) to its list of\nSpecially Designated Nationals and Blocked Persons for its role\nin supporting the “illegitimate Maduro regime” and “undermining\ndemocracy in Venezuela”. The US Treasury stated that CEIEC\nprovided “software, training, and technical expertise to\nVenezuela[n] government entities, which was then used against\nthe people of Venezuela”. The press release detailed that CEIEC\nhas enabled Maduro through technology and training to repress\npolitical dissent, conduct malicious cyber efforts since 2017,\ncensor independent media, and manipulate votes by censoring\nsocial media.\n\n##### Case Study 8: Ecuador’s ECU-911\n\nIn February 2011, Ecuador signed a deal with Chinese tech\ngiants CEIEC and Huawei to install an extensive surveillance\nsystem financed by Chinese loans. Inspired by the 2008 Beijing\n[Olympics, Ecuador purchased over 4,300 surveillance cameras](https://www.nytimes.com/2019/04/24/technology/ecuador-surveillance-cameras-police-government.html)\nto collect footage of citizens and transmit it to intelligence\nservices, calling the project [ECU-911. The](https://www.ecu911.gob.ec/) [surveillance project](https://www.foreign.senate.gov/imo/media/doc/2020%20SFRC%20Minority%20Staff%20Report%20-%20The%20New%20Big%20Brother%20-%20China%20and%20Digital%20Authoritarianism.pdf)\nincludes capabilities to monitor emails and phone calls, as well\nas to bug vehicles with hidden microphones. In order to help\nfacilitate the rollout of ECU-911, Beijing sent [military attachés](https://sv.usembassy.gov/made-in-china-exported-to-the-world/)\nfrom the embassy in Quito to assist in the installation and setup\nof the equipment.\n\nIn exchange for ECU-911, Ecuador agreed to provide one of\nits main exports, oil, to China. However, the deal quickly became\na point of concern for the Ecuadorian government. In exchange\nfor the technology that totaled more than $19 billion, Ecuador\nsigned away large portions of its oil reserves, leaving the country\nin debt to China and in a vulnerable position economically.\nFollowing this deal, Chinese infrastructure projects in the country\nincreased, including the construction of a hydroelectric dam and\n\noil refineries to maximize outputs demanded by China.\n\n\n-----\n\n#### Outlook\n\nChina is playing a direct role in the expansion of authoritarian\nrule around the world. With global democracy in decline for the\n15th consecutive year, it will become increasingly important for\nthe free world to counter China’s influence in the developing\nworld. Illiberal and hybrid regimes throughout Asia, the Middle\nEast, Africa, and Latin America will invest in the next generation\nof Chinese-style autocratic technologies to enable population\ncontrol, surveillance, and censorship. The authoritarian tools that\nBeijing is selling will continue to spread around the globe if liberal\ndemocracies do not cooperate better with developing nations\nand present a cost-effective alternative.\n\nBeijing will continue to dominate the construction and\nmanagement of telecommunications, data, finance, and IoT.\nFurthermore, they will continue to push new technical standards\nfor the next generation of the internet and will leverage their\npolitical and economic influence over “friends” to gain this power.\nEstablished political alliances between China and BRI partner\ncountries such as Uruguay, Zimbabwe, and Venezuela will likely\nplay a part in strengthening partnerships between respective\nneighboring countries and China.\n\nAs the world’s democratic leaders and the G7 step up to\nthis challenge with plans such as the Build Back Better World\n(B3W) initiative, we expect Beijing to increase their efforts\nproportionally, using the entire autocratic toolkit to influence,\ncoerce, and sponsor the adoption of Chinese technology and\nideology throughout the world. As Beijing gains access to\nnew markets and human-driven AI data, it will also improve its\ncapabilities for influence operations in those societies, drawing\nthem closer to China and encouraging a push away from the\nUS and its allies. China is set to host the 2022 Winter Olympics\nin Beijing and will likely use the event as a platform to display\nthe effectiveness of its domestic surveillance and policing.\nLeading up to the Olympics, China will likely crack down on prodemocracy protests and will ramp up its control of the Muslim\nminority population — and the way the media portrays it.\n\n\n-----\n\n#### Recorded Future Threat Activity Group and Malware Taxonomy\n\nRecorded Future’s research group, Insikt, tracks threat\nactors and their activity, focusing on state actors from China,\nIran, Russia, and North Korea, as well as cybercriminals —\nindividuals and groups — from Russia, CIS states, China,\nIran, and Brazil. We emphasize tracking activity groups and\nwhere possible, attributing them to nation state government,\norganizations, or affiliate institutions.\n\nOur coverage includes:\n\n\n**ADVERSARY**\n\n\n\n   - Government organizations and intelligence\nagencies, their associated laboratories, partners,\nindustry collaborators, proxy entities, and\nindividual threat actors\n\n   - Recorded Future-identified, suspected nationstate activity groups, such as RedAlpha,\nRedBravo, Red Delta, and BlueAlpha and many\nother industry established groups\n\n   - Cybercriminal individuals and groups established\nand named by Recorded Future\n\n   - Newly emerging malware, as well as prolific,\npersistent commodity malware\n\nInsikt Group publicly names a new threat activity group\nor campaign, such as RedFoxtrot, when analysts typically\nhave data corresponding to at least three points on the\nDiamond Model of Intrusion Analysis with at least medium\nconfidence. We will occasionally report on significant activity\nusing a temporary activity clustering name such as TAG-21\nwhere the activity is new and significant but doesn't map\nto existing groupings and hasn't yet graduated or merged\ninto an established activity group. We tie this to a threat\nactor only when we can point to a handle, persona, person,\nor organization responsible. We will write about the activity\nas a campaign in the absence of this level of adversary\ndata. We use the most widely used or recognized name for a\nparticular group when the public body of empirical evidence\nis clear the activity corresponds to a known group.\n\nInsikt Group uses a simple color and phonetic alphabet\nnaming convention for new nation-state threat actor groups\nor campaigns. The color generally corresponds to that\nnation’s flag colors, with more color/nation pairings to be\nadded as we identify and attribute new threat actor groups\nassociated with new nations.\n\nFor newly identified cybercriminal groups, Insikt\nGroup uses a naming convention corresponding to the\nGreek alphabet. Where we have identified a criminal entity\nconnected to a particular country, we will use the appropriate\ncountry color, and where that group may be tied to a specific\ngovernment organization, tie it to that entity specifically.\n\nInsikt Group uses mathematical terms when naming\nnewly identified malware.\n\n\n**INFRASTRUCTURE** **CAPABILITY**\n\n**VICTIM**\n\n\n-----\n\nAbout Recorded Future\n\nRecorded Future is the world’s largest provider of intelligence for enterprise\n\nsecurity. By combining persistent and pervasive automated data collection and analytics\n\nwith human analysis, Recorded Future delivers intelligence that is timely, accurate,\n\nand actionable. In a world of ever-increasing chaos and uncertainty, Recorded Future\n\nempowers organizations with the visibility they need to identify and detect threats\n\nfaster; take proactive action to disrupt adversaries; and protect their people, systems,\n\nand assets, so business can be conducted with confidence. Recorded Future is trusted\n\nby more than 1,000 businesses and government organizations around the world.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2021-0727.pdf"
    ],
    "report_names": [
        "cta-2021-0727.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "0fca7692-4a21-482f-a113-9548b49e8531",
            "created_at": "2022-10-25T16:07:24.117599Z",
            "updated_at": "2025-03-27T02:02:10.112146Z",
            "deleted_at": null,
            "main_name": "RedEcho",
            "aliases": [],
            "source_name": "ETDA:RedEcho",
            "tools": [
                "POISONPLUG.SHADOW",
                "ShadowPad Winnti",
                "XShellGhost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b5449533-0ff1-4048-999d-7d4bfd8e6da6",
            "created_at": "2022-10-25T16:07:24.114365Z",
            "updated_at": "2025-03-27T02:02:10.111256Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [
                "Operation Dianxun",
                "TA416"
            ],
            "source_name": "ETDA:RedDelta",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Chymine",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bc91d469-ec69-497b-81d7-068b84501e63",
            "created_at": "2023-01-06T13:46:39.192791Z",
            "updated_at": "2025-03-27T02:00:03.017845Z",
            "deleted_at": null,
            "main_name": "RedEcho",
            "aliases": [],
            "source_name": "MISPGALAXY:RedEcho",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa90ad17-8852-4732-9dba-72ffb64db493",
            "created_at": "2023-07-11T02:00:10.067957Z",
            "updated_at": "2025-03-27T02:00:03.134199Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [],
            "source_name": "MISPGALAXY:RedDelta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9381a9dc-8d8e-453a-9fe5-301136ff0f83",
            "created_at": "2023-01-06T13:46:38.775762Z",
            "updated_at": "2025-03-27T02:00:02.915732Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "MISPGALAXY:RedAlpha",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cc8271a3-471f-4b8c-9da6-7d50f8ccabaa",
            "created_at": "2022-10-25T16:07:24.107066Z",
            "updated_at": "2025-03-27T02:02:10.109521Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "ETDA:RedAlpha",
            "tools": [
                "AngryRebel",
                "Bladabindi",
                "FF-RAT",
                "Farfli",
                "FormerFirstRAT",
                "Gh0st RAT",
                "Ghost RAT",
                "Jorik",
                "Moudour",
                "Mydoor",
                "NetHelp Infostealer",
                "NetHelp Striker",
                "PCRat",
                "RedAlpha",
                "ffrat",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbb1ee4e-bbe9-44de-8f46-8e7fec09f695",
            "created_at": "2022-10-25T16:07:24.120424Z",
            "updated_at": "2025-03-27T02:02:10.112981Z",
            "deleted_at": null,
            "main_name": "RedFoxtrot",
            "aliases": [
                "Moshen Dragon",
                "Nomad Panda",
                "TEMP.Trident"
            ],
            "source_name": "ETDA:RedFoxtrot",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Fucobha",
                "GUNTERS",
                "Gen:Trojan.Heur.PT",
                "Icefog",
                "Impacket",
                "Kaba",
                "Korplug",
                "PCShare",
                "POISONPLUG.SHADOW",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "XShellGhost",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1710381933,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1627377074,
    "ts_modification_date": 1627377256,
    "files": {
        "pdf": "https://archive.orkl.eu/1e0ba5f2f48df75047dc6969f268758484eada51.pdf",
        "text": "https://archive.orkl.eu/1e0ba5f2f48df75047dc6969f268758484eada51.txt",
        "img": "https://archive.orkl.eu/1e0ba5f2f48df75047dc6969f268758484eada51.jpg"
    }
}