{
    "id": "9421038b-0f17-45d7-b5b9-976b7e971566",
    "created_at": "2023-01-12T15:02:34.043553Z",
    "updated_at": "2025-03-27T02:15:38.115807Z",
    "deleted_at": null,
    "sha1_hash": "314171066d2bb7e686f5f1742c1a0b5c308ddd60",
    "title": "2019-08-29 - SectorJ04 Group’s Increased Activity in 2019",
    "authors": "",
    "file_creation_date": "2022-05-28T22:00:53Z",
    "file_modification_date": "2022-05-28T22:00:53Z",
    "file_size": 2236234,
    "plain_text": "# SectorJ04 Group’s Increased Activity in 2019\n\n**[threatrecon.nshc.net/2019/08/29/sectorj04-groups-increased-activity-in-2019/](https://threatrecon.nshc.net/2019/08/29/sectorj04-groups-increased-activity-in-2019/)**\n\n## Abstract\n\nSectorJ04 is a Russian-based cybercrime group that began operating about five years ago\nand conducted hacking activities for financial profit using malware such as banking trojans\nand ransomware against national and industrial sectors located across Europe, North\nAmerica and West Africa.\n\nIn 2019, the SectorJ04 group expanded its hacking activities to cover various industrial\nsectors located across Southeast Asia and East Asia, and is changing the pattern of their\nattacks from targeted attacks to searching for random victims. This report includes details\nrelated to the major hacking targets of the SectorJ04 group in 2019, how those targets were\nhacked, characteristics of their hacking activities this year and recent cases of the SectorJ04\ngroup’s hacking.\n\n## SectorJ04 group activity range and hacking methods\n\nThe SectorJ04 group has maintained the scope of its existing hacking activities while\nexpanding its hacking activities to companies in various industrial sectors located in East\nAsia and Southeast Asia. There was a significant increase in their hacking activities in 2019,\nespecially those targeting South Korea. They mainly utilize spam email to deliver their\nbackdoor to the infected system that can perform additional commands from the attacker’s\nserver.\n\n**Main countries and sectors targeted**\n\nThe SectorJ04 group’s preexisting targets were financial institutions located in countries\nsuch as North America and Europe, or general companies such as retail and manufacturing,\nbut they recently expanded their areas of activity to include the medical, pharmaceutical,\nmedia, energy and manufacturing industries. They do not appear to place much restrictions\non the sectors targeted. The following are the sectors and countries under which SectorJ04\ngroup was found in 2019.\n\n\n-----\n\nFigure 1 SectorJ04 group’s first half activity timeline in 2019\n\n**Targeted Countries**\n\nWe saw SectorJ04 group activity in Germany, Indonesia, the United States, Taiwan, India,\nFrance, Serbia, Ecuador, Argentina, South Korea, Japan, China, Britain, South Africa, Italy,\nHong Kong, Romania, Ukraine, Macedonia, Russia, Switzerland, Senegal, the Philippines,\nUAE, Qatar, Saudi Arabia, Pakistan, Thailand, Bahrain, Turkey, Bulgaria, Bangladesh.\n\nFigure 2 SectorJ04 group targeted countries\n\n**Targeted Industries**\n\nFinancial-related corporate and government departments such as banks and\nexchanges\nRetail business such as shopping malls and social commerce\nEducational institutions such as a universities\nManufacturing companies such as manufactures of electronic products\nMedia companies such as broadcasting and media\n\n\n-----\n\nPharmaceutical and biotechnology-related companies\nA job-seeking company\nEnergy-related companies such as urban gas and wind power generation\n\n**Hacking Techniques**\n\nThe SectorJ04 group mainly utilizes a spear phishing email with MS Word or Excel files\nattached, and the document files downloads the Microsoft Installer (MSI) installation file from\nthe attacker server and uses it to install backdoor on the infected system. As anti-virus\nprograms have recently begun to detect MSI files, in some instances macro scripts contained\nin the malicious documents would install backdoors directly onto infected systems without\nusing MSI files.\n\nFigure 3 Schematic drawing for SectorJ04 group’s hacking method\n\nMalicious documents used for hacking are mainly written as themes related to MS Office,\nand the same themes are often used several times, with only language changes depending\non the victim’s language.\n\nIn addition, the MSI files backdoor used by SectorJ04 mostly had valid digital signatures, and\nmost of their malware were signed just days before they were found.\n\n\n-----\n\nFigure 4 Part of the malicious document execution screen that the SectorJ04 group attaches\nto the spear phishing email\n\nFigure 5 Part of the digital signature found in the executable used for hacking\n\n**Digital signature information found in malware**\n\nVAL TRADEMARK TWO LIMITED\nALLO LTD\nCOME AWAY FILMS LTD\nAWAY PARTNERS LIMITED\nANG APPCONN LIMITED\nSTART ARCHITECTURE LTD\nSLON LTD\nDIGITAL DR\nFIT AND FLEX LIMITED\nDream Body Limited\n\n\n-----\n\nBOOK A TEACHER LTD\nMARK A EVANS LTD\nWAL GRAY LTD\nMISHA LONDON LTD\nSTART ARCHITECTURE LT\nBASS AUTOMOTIVE LIMITE\nFILESWAP GLOBAL LT\nHAB CLUB LT\nET HOMES LT\n\n## Main Malware Used\n\nThe SectorJ04 group mainly used their own backdoor, ServHelper and FlawedAmmyy RAT,\nfor hacking. They also used the Remote Manipulator System (RMS) RAT, a legitimate remote\nmanagement software created in Russia. Backdoors are installed in infected systems and\nthey also distributed email stealers, botnet malware and ransomware through those\nbackdoors.\n\nThey were recently confirmed to use additional backdoor called AdroMut and FlowerPippi,\nwhich is used to install other backdoor such as FlawedAmmyy RAT on behalf of the MSI file,\nor to collect system information and send it to the attacker’s server.\n\n**Malware Types Found Before 2019**\n\n\nRMS RAT\n\nSFX File\n\nUtilize\nconfiguration\nfiles in DAT\nformats\n\n\nInitial\nInfection\nMethod\n\nDownloaded\nby MSI\n\n\nServHelper FlawedAmmyy\nRAT\n\nAn MSI file that is downloaded from a\ndocument file attached to a spear\nphishing email.\n\nNullsoft Installer Encoded\nFlawedAmmyy\nRAT\n\n\nCharacteristic C2 response has certain separator Check for\nAntivirus\nRegister\nAutoPlay with\n“wsus.exe”\n\n**Malware Types Found After 2019**\n\n\n**AdroMut** **FlowerPippi**\n\n\n-----\n\n**Initial Infection**\n**Method**\n\n\nDocument files attached to the spear\nphishing emails\n\n\n**Characteristics** Internal-used strings are decoded into\nAES-256-ECB mode after base64\ndecode.\n\nConfigure infection system information in\nJSON format (encrypted)\n\nLoad into “ComputerDefaults.exe” using\nDLL side loading technique\n\n\nA simpler function than\nhard-coded RC4 key\nAdroMut\n\n\nBackdoor installed in the infected system distributed additional botnet malware, ransomware\nand email stealers. The email stealer collects connection protocol information and account\ninformation, such as SMTP, IMAP, and POP3, which are stored in the registry by Outlook and\nThunderbird mail clients and sends them to the attacker server in a specific format.\n\nFigure 6 Format to send email credentials collected by email stealer\n\nFigure 7 Some of the email stealer codes that access email account information stored in the\nregistry\n\n\n-----\n\nFigure 8 Some of the email stealer codes that access email account information stored in the\nregistry 2\n\nAn email stealer may also have a file collection function to collect email information that is\nrecorded in the metadata of the file corresponding to the hard-coded extension. In addition,\nthe malware eventually creates and executes a batch file for self-delete, removing the\nexecution traces from the infected PC.\n\nFigure 9 Some of the file extensions that the email stealer collects data from\n\nThe SectorJ04 group is believed to collect email accounts stored in infection systems for use\nin subsequent attacks.\n\n## Characteristics of hacking activities of SectorJ04 group in 2019\n\nThe following are the features of the first half of 2019 activities identified through the analysis\nof the SectorJ04 group’s hacking activities.\n\nIncreased hacking activities targeting East and Southeast Asia\nChanges in spam email format and hacking methods\nChanges in targets of hacking from specific organizations and industry groups to large\nnumber of irregular ones\n\nAlthough the SectorJ04 group mainly targeted countries located in Europe or North America,\nit has recently expanded its field of activities to countries located in Southeast Asia and East\nAsia. In particular, the frequency of hacking attacks targeting South Korea has increased,\nand spam emails targeting China were found in May.\n\nThe changes could also be seen in attachments to spam emails used by attackers. Existing\nspam emails used attachments in the form of malicious documents, but attachments with\nHTM and HTML extensions were also found and the text included links to download\nmalicious documents directly.\n\n\n-----\n\nThe SectorJ04 group s initial spam emails had no mail content or only short sentences, but\nthe latest spam emails found were elaborately written and included images. A new type of\nbackdoor called AdroMut and a new malware called FlowerPippi was also found coming from\nSectorJ04.\n\nPrior to 2019, the SectorJ04 group conducted large-scale hacking activities for financial gain\nusing exploit kits on websites to install ransomware, such as Locky and GlobeImporter, along\nwith its banking Trojan, on its victims computers. But after 2019 the group has changed its\nhacking strategy to attack using spam email. In particular, a number of remote control\nmalware are utilized to gain access to resources such as email accounts and system login\ninformation from the infected machine to send more spam emails and distribute their\nmalware.\n\n**Increased hacking activities targeting East and Southeast Asia**\n\nThe hacking activities of SectorJ04 group, which targeted South Korea in the first half of\n2019, have been continuously discovered. The emails found were written in relation to\ninvoice and tax accounting data, and were attached the MS Word or Excel files with\nmalicious macros inserted. Malicious documents written in Korean have the same\ncharacteristics as other language hacking activities under the theme of MS Office.\n\nFigure 10 Spear phishing emails disguised as order sheets\n\nIn June 2019, continuous hacking activities targeting South Korea were found again and\nspam emails were written with various contents, including transaction statements, receipts\nand remittance cards. During that period, a number of spam emails disguised as remittance\ncards of the same type were found.\n\n\n-----\n\nFigure 11 Spear phishing email disguised as a remittance card\n\nThe SectorJ04 group has carried out large-scale hacking activities targeting South Korea,\nwhile also expanding the field of attacks to Southeast Asian countries such as Taiwan and\nthe Philippines. Spam emails and attachments written in Chinese were found in May, and the\nSectorJ04 group at that time targeted industrial sectors such as electronics and\ntelecommunications, international schools and manufacturing.\n\nFigure 12 Spear phishing emails written in Chinese\n\n\n-----\n\nFigure 13 Malicious excel file execution screen written in Chinese\n\n**Changes in spam email format and hacking methods**\n\nIn June, SectorJ04 group conducted hacking using spam emails written in various\nlanguages, including English, Arabic, Korean and Italian, and the emails were written with\nvarious contents, including remittance card, invoice and tax invoice.\nAlong with the existing method of using MS Word or Excel files as attachments, they used\nHTML files to download malicious documents as attachments, or included links to download\nmalicious documents directly in the text.\n\nIn the past, the emails used in attacks had little or no content, but the latest ones use\nelaborated spam emails for hacking, such as using images.\n\n\n-----\n\nFigure 14 Spear phishing email disguised as bank statement\n\nFigure 15 Spear phishing email disguised as a hospital certificate\n\nChanges have also been found in the hacking method of the SectorJ04 group. In addition to\ntheir preexist backdoor, ServHelper and FlawedAmmyy, they have also been confirmed to\nuse the backdoor called AdroMut and FlowerPippi.\n\nAdroMut downloads the malware (ServHelper and FlawedAmmyy RAT) used by the\nSectorJ04 group from the attacker server and simultaneously performs the functions of a\nbackdoor.\n\nFlowerPippi collects infection system information, such as the domain of the infected system,\nproxy settings, administrator rights, and OS version, and performs functions such as\nexecuting commands received, downloading and executing DLL and EXE files.\n\nFigure 16 Encoded Strings on the AdroMut Backdoor\n\n\n-----\n\nFigure 17 RC4 key with hard-coded view from the FlowerPippi back door\n\nThe SectorJ04 group is believed to have developed and used malware that functions as a\ndownloader for the purpose of installing or downloading malware to replace the MSI\ninstallation files that they have used for hacking for more than six months as the detection\nrate of security solutions increased.\n\nFigure 18 Some of the digital certificate information identified in the corresponding hacking\nactivity\n\nThe SectorJ04 group, which has been utilizing the same pattern of infection and the same\nmalware for more than six months, is believed to be attempting to change its infection\nmethods such as downloading malware directly from malicious documents without using MSI\ninstallation files, changing their spam email format and using new types of backdoor.\n\n**Changes in hacking targets from specific organizations and industries to random**\n**ones**\n\n\n-----\n\nUntil 2019, SectorJ04 group had carried out massive website-based hacking activities that\nmainly utilize ransomware and banking trojans for financial profit, and has also been carrying\nout information gathering activities to secure attack resources such as email accounts and\nsystem login information from users since 2019.\nThis allows them to expand their range of targets of hacking activities for financial profit, and\nin this regard, SectorJ04 group has been found to have hacked into a company’s internal\nnetwork by using a spear phishing email targeting executives and employees of certain\nSouth Korean companies around February 2019.\n\nThey eventually hacked the Active Directory (AD) server and took control of the entire\ncorporate internal network, and then distributed the Clop ransomware on the AD server.\nFrom the hacking activity, we also found malware for collecting email information and\n“AmadeyBot”, a botnet malware that which has its source code available in Russia’s\nunderground forums.\n\nFigure 19 Spear phishing email used for hacking activities targeting AD servers in South\nKorea\n\nThey are believed to have continuously attempted to hack into companies in South Korea to\ndistribute Clop ransomware. Attackers used spam emails disguised as being sent by the\nNational Tax Service in May to install FlawedAmmyy RAT in the infected system, during\nwhich the Clop ransomware was found using the same certificate as the FlawedAmmyy RAT\nexecutable file.\n\n\n-----\n\nFigure 20 Spear phishing email disguised as tax bill\n\nThe SectorJ04 group has shown a pattern of hacking activities that have changed from\ntargeted attacks to a large-scale distribution of spam.\n\n## Major Malware Installation Types\n\nThe following describes three types of backdoor infections that are installed from malicious\ndocuments identified in the SectorJ04 group-related hacking cases that occurred during the\nfirst half of 2019.\n\n**Type 1 – Using encoded executable file**\n\nSectorJ04 group carried out intensive hacking on various industrial sectors, including South\nKorea’s media, manufacturing and universities, around February and March 2019. They\nused the spear phishing email to spread malicious Excel or malicious Word files, and\ndownloaded the MSI files from the attacker’s server when the malicious documents were run.\n\nThe MSI file installs a downloader that downloads FlawedAmmyy RAT encoded in the\ninfection system from the attacker server, and the downloaded FlawedAmmyy RAT registers\nan automatic execution under the name “wsus.exe.”\n\nFigure 21 Type of backdoor installation to install encoded executable file Type 1\n\n\n-----\n\nFlawedAmmyy RAT performs remote control functions in the infected system and decodes\nencoded executable files downloaded from the attacker server using certain hard-coded\nstrings. It also has a function to check if a particular process is running to determine whether\ntheir malware should be executed.\n\nFigure 22 “Ammy Admin” string found in FlawedAmmyy RAT\n\nFigure 23 Part of decode code that uses hard-coded strings\n\n**Type 2 – Using NSIS Script**\n\nSectorJ04 group conducted hacking activities targeting financial institutions located in India\nand Hong Kong around April 2019. Malicious documents delivered through the spear\nphishing email downloaded the MSI file, which forwards the NSIS Installer to the infected\nsystem. The NSIS script executes the final payload, ServHelper, in the DLL file format, using\n“rundll32.exe”.\nNote that NSIS (Nullsoft Scriptable Install System) is a script-based installation system for\nWindows and is a lightweight installation system supported by Nullsoft.\n\n\n-----\n\nFigure 24 Backdoor installation type utilizing NSIS Installer Type 2\n\nDecompressing the NSIS installer installed by the MSI file shows that it consists of an NSIS\nscript with an NSI extension, a ServHelper in the DLL file format, and a “ncExec.dll,” the\nnormal DLL required to run the NSIS.\n\nFigure 25 Uncompressed NSIS installer\n\nFigure 26 Part of the NSIS script for running ServHelper in the DLL file format\n\nServHelper performs the function of the backdoor in the infection system and sends specific\ntypes of responses to C2 servers using delimiters such as “key,” “sysid,” and “resp”. Different\ntypes of delimiters are sometimes found depending on malware.\n\nFigure 27 ServHelper Backdoor C2 Communication Code Partial\n\n**Type 3 – Using Self-Extracting File**\n\nSectorJ04 group carried out hacking activities targeting financial institutions located in Italy\nand other countries around May 2019. Malicious documents delivered through the spear\nphishing email pass MSI files to the infection system, and MSI files download the executable\n\n\n-----\n\nself-extracting file (SFX). When the SFX file is executed, another SFX file inside is executed\nand the final payload, RMS RAT, is delivered to the infected system.\n\nFigure 28 Backdoor installation type utilizing SFX executable files Type 3\n\nWithin the first SFX file to be downloaded by the MSI file, there are four files. When\nexecuting an SFX file, it uses a command to change the extension of the SFX file\n(“kernel.dll”) of the DLL extension to EXE and decompress it using a hard-coded password.\nThe files that make up the SFX file vary from malware to malware.\n\nFigure 29 The first SFX file to be downloaded from an MSI file\n\nFigure 30 “i.cmd” for decompression of the second SFX file\n\n\n-----\n\nFour files can be seen in the second SFX file that has been decompressed, and as before,\nrunning “exit.exe”. “exit.exe” executes the same “i.cmd” as before, which executes an RMS\nRAT with the file name “winserv.exe” in the registry. RMS RAT is a legitimate remote\nmanagement software created in Russia, and files with DAT extensions contain configuration\ninformation to run the RMS RAT.\n\nFigure 31 Configuring a second SFX file disguised as a DLL file extension\n\nFigure 32 RMS RAT configuration file with a DAT extension\n\n## SectorJ04 Group Activity in South Korea\n\nThe following is about the activities of the SectorJ04 group found in South Korea in July and\nAugust 2019.\n\n**Hacking activities disguised as electronic tickets by large airlines**\n\nIn late July, SectorJ04 group used FlawedAmmyy RAT to carry out hacking attacks on\ncompanies and universities in sectors such as education, job openings, real estate and\nsemiconductors in South Korea. Spam emails targeting email accounts used in the\n\n\n-----\n\nintegrated mail service of public officials were also found in the hacking activity.\n\nFigure 33 Spam email disguised as electronic tickets\n\nThey used spam emails disguised as those sent by large South Korean airlines and used\nISO-format files as attachments. The group used the same body contents of the email to\ndeliver spam emails to multiple hacking targets.\n\nDecompressing the ISO file attached to the spam email would show an SCR file disguised as\na “.pdf” extension exists, which is a .NET executable file that downloads an MSI file. The ISO\nfiles sometimes contain LNK files, which, like the malware written in .NET, download an MSI\nfiles from a remote location.\n\nFigure 34 A disguised SCR file identified within an ISO file\n\nFigure 35 MSI file downloader written as .NET\n\nFigure 36 Disguised LNK file identified within ISO file\n\n\n-----\n\nThe following valid digital signatures were found in the MSI file downloaded from the attacker\nserver. Other digital signatures were also found issued by “HAB CLUB LT” and “LUK 4\nTRANSPORT LT”.\n\nFigure 37 Digital signature information for MSI files found in hacking activities\n\nFinally, FlawedAmmyy RAT is downloaded from the remote server and the activity uses a\nBase64 encoded Powershell script to determine if the infected system is a PC contained in\nan Active Directory Domain.\n\nFigure 38 Powershell script to determine if a PC belongs to a domain\n\n**Hacking activity using same email content as the past**\n\nIn early August, the SectorJ04 group carried out extensive hacking activities targeting the\nusers around the world, including South Korea, India, Britain, the United States, Germany,\nCanada, Argentina, Bangladesh and Hong Kong.\n\n\n-----\n\nTheir activities were particularly heavy in healthcare-related areas such as healthcare,\npharmaceuticals, biotechnology and healthcare-wage management, as well as energyrelated companies such as gas and wind power. Also, they continued their attacks on\npreexisting hacking target areas such as manufacturing, distribution and retail.\n\nThe contents of the text written in French and English were found in the spam email, and an\nMS Word file with random numbers was used as an attachment. All emails found in the\nhacking activity had the same text content.\n\nFigure 39 Spear phishing emails written in French and English\n\nSpam emails in Korean were also identified in the hacking activity, indicating that the\ncontents of the text of the email used in the hacking activity were reused in June. Attached\nfile is an MS Word file titled “스캔_(random number).doc”.\n\nFigure 40 Spear phishing email targeted to South Korea using the same text used in the past\n\n\n-----\n\nThe MS Word file used as an attachment is disguised as an order confirmation and a goods\nreceipt. Running the macro from the document would allow the downloader with the DLL file\nformat to run using “rundll32.exe”. The downloader downloads FlawedAmmyy RAT from the\nattacker server and runs under the name “rundl32.exe”.\n\nFigure 41 Malicious document execution screen disguised as order confirmation\n\nFigure 42 Malicious document execution screen for Korea language users disguised as a\nreceipt of goods\n\n\n-----\n\nFigure 43 Part of the macro script included in the malicious document\n\nFlawedAmmyy RAT found in the hacking activity showed the existing “Ammyy Admin” string\nbeing modified to “Popss Admin” and created Mutex with “KLGjigjuw4j892358u432i5”. In\naddition, the compile path “c:\\\\123\\\\123\\\\clear\\\\ammyygeneric\\\\target\\\\TrFmFileSys.h” was\nfound inside the file.\n\nFigure 44 Change hard-coded string information in FlawedAmmyy RAT\n\nFigure 45 Mutex generation code using hard-coded string information\n\n\n-----\n\nIn addition to the above mentioned changes in the FlawedAmmyy RAT found in the most\nrecent hacking activity, other changes such as changes in their string decoding were\nidentified.\n\n## Conclusion\n\nThe SectorJ04 group’s range of targets increased sharply in 2019, and they appear to be\nstriving to carry out elaborated attacks while at the same time targeting indiscriminately. They\nare one of the most active cyber crime groups in 2019, and they often modify and tweak their\nhacking methods and perform periodic hacking activities.\n\nThe SectorJ04 group’s hacking activities are expected to continue to increase, and the\nThreatRecon team will continue to monitor the attack activity against the group.\n\n## Indicators of Compromise (IoCs)\n\n[IoCs of the SectorJ04 group included in the report can be found here.](https://github.com/nshc-threatrecon/IoC-List)\n\nMore information about the SectorJ04 group is available to customers of ThreatRecon\nIntelligence Service (RA.global@nshc.net).\n\n## MITRE ATT&CK Techniques\n\nThe following is a list of MITRE ATT&CK Techniques we have observed based on our\nanalysis of these malware.\n\n\n-----\n\n**Initial Access**\nSpearphishing Attachment\nSpearphishing Link\nTrusted Relationship\n\n**Execution**\nCommand-Line Interface\nExecution through API\nExecution through Module Load\nExploitation for Client Execution\nPowerShell\nRundll32\nScheduled Task\nScripting\nService Execution\nUser Execution\nWindows Management Instrumentation\n\n\n-----\n\n**Persistence**\nAccount Manipulation\nNew Service\nRegistry Run Keys / Startup Folder\nScheduled Task\nStartup items\nSystem Firmware\nWindows Management Instrumentation Event Subscription\n\n**Privilege Escalation**\nBypass User Account Control\nNew Service\nScheduled Task\nStartup items\n\n**Defense Evasion**\nBypass User Account Control\nCode Signing\nDisabling Security Tools\nDLL Side-Loading\nExploitation for Defense Evasion\nHidden Window\nModify Registry\nObfuscated Files or Information\nRundll32\nScripting\nSoftware Packing\nVirtualization/Sandbox Evasion\n\n**Credential Access**\nAccount Manipulation\nInput Capture\nInput Prompt\n\n**Discovery**\nAccount Discovery\nFile and Directory Discovery\n\n\n-----\n\nNetwork Service Scanning\nNetwork Share Discovery\nPermission Groups Discovery\nProcess Discovery\nQuery Registry\nRemote System Discovery\nSecurity Software Discovery\nSystem Information Discovery\nSystem Network Configuration Discovery\nSystem Network Connections Discovery\nSystem Owner/User Discovery\nSystem Service Discovery\nVirtualization/Sandbox Evasion\n\n**Lateral Movement**\nRemote Desktop Protocol\nRemote Services\n\n**Collection**\nAutomated Collection\nData from Local System\nEmail Collection\nInput Capture\n\n**Command and Control**\nCommonly Used Port\nCustom Command and Control Protocol\nCustom Cryptographic Protocol\nData Encoding\nRemote Access Tools\nStandard Application Layer Protocol\nStandard Cryptographic Protocol\n\n**Exfiltration**\nAutomated Exfiltration\nData Compressed\n\n\n-----\n\nExfiltration Over Alternative Protocol\nExfiltration Over Command and Control Channel\n\n**Intent**\nData Encrypted for Impact\n\n## References\n\n**KRCERT – Analysis of Attacks on AD Server (2019.04.17)**\n\nhttps://www.krcert.or.kr/data/reportView.do?bulletin_writing_sequence=35006\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-08-29 - SectorJ04 Group’s Increased Activity in 2019.pdf"
    ],
    "report_names": [
        "2019-08-29 - SectorJ04 Group’s Increased Activity in 2019.pdf"
    ],
    "threat_actors": [
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535754,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1653775253,
    "ts_modification_date": 1653775253,
    "files": {
        "pdf": "https://archive.orkl.eu/314171066d2bb7e686f5f1742c1a0b5c308ddd60.pdf",
        "text": "https://archive.orkl.eu/314171066d2bb7e686f5f1742c1a0b5c308ddd60.txt",
        "img": "https://archive.orkl.eu/314171066d2bb7e686f5f1742c1a0b5c308ddd60.jpg"
    }
}