{
    "id": "94505012-00d6-406e-b9b5-0742b105f9fc",
    "created_at": "2022-10-25T16:48:15.121731Z",
    "updated_at": "2025-03-27T02:09:18.286618Z",
    "deleted_at": null,
    "sha1_hash": "e9df98f1a03146c9f736ba911bd25a5e2c02f657",
    "title": "GriefRansomware_Whitepaper",
    "authors": "",
    "file_creation_date": "2022-01-08T15:32:56Z",
    "file_modification_date": "2022-01-10T09:11:53Z",
    "file_size": 4553149,
    "plain_text": "# A Deep Dive into The Grief Ransomware’s Capabilities\n\n### Prepared by:   LIFARS, LLC Date:  12/30/2021\n\n#### 1\n\n\n-----\n\n## EXECUTIVE SUMMARY \n\n\nGrief ransomware is the successor of the DoppelPaymer ransomware, which emerged from the\nBitPaymer ransomware. Grief is deployed in an environment already compromised by Dridex and\nwhere the threat actor performed post-exploitation activities using Cobalt Strike. The ransomware\nis obfuscated and employs anti-analysis techniques that include API hashing, Vectored Exception\nHandling (VEH) manipulation, the Heaven’s Gate technique, encrypt relevant data using RC4.\nGrief runs with specific parameters computed based on the victim's environment and crashes if\nno/incorrect parameters are provided (if you have been a victim of Grief ransomware, please\n[contact us). The malware deletes all Volume Shadow Copies using vssadmin and Diskshadow and](https://lifars.com/contact-us/)\ndisables Microsoft Defender Antivirus. The encrypted files have the “.pay0rgrief” extension, and\nthe malware imports an RSA public key that will be used to encrypt the generated AES file\nencryption keys.\n\n\n-----\n\n## ANALYSIS AND FINDINGS\n\n\nSHA256: 2d1d08fce7156053c017825b722968b3117c9230412f4e7da5f89699ec9913cd\n\nThe DLL file is one of the most challenging malware samples we’ve even analyzed because of the\nmultiple layers of obfuscation, API hashing, Vectored Exception Handling, and relevant strings\ndecrypted at runtime using RC4. We will sequentially explain how we’ve overcome every obstacle\nand what challenges remain.\n\nThe binary has only one export function called “RoonlpvfdRoomvlof”:\n\nFigure 1\n\nThe malware retrieves the path of the executable file of the current process (which in our case is\nrundll32.exe) using the GetModuleFileNameW API:\n\nFigure 2\n\nThe process gets a module handle for a module called “self.exe”:\n\nFigure 3\n\n\n-----\n\nVirtualAlloc is utilized to allocate memory in the address space of the current process (0x1000 =\n**MEM_COMMIT, 0x4 = PAGE_READWRITE):**\n\nFigure 4\n\nThe binary writes a new executable to the newly created memory area and transfers the execution\nflow to a function inside it. The LoadLibraryA routine is used to load multiple DLLs into the address\nspace of the process:\n\nFigure 5\n\nThe GetProcAddress API is utilized to retrieve the address of export functions from multiple DLLs:\n\nFigure 6\n\nThe process changes the protection of the memory area where the malicious DLL resides by\ncalling the VirtualProtect routine (0x4 = PAGE_READWRITE):\n\nFigure 7\n\n\n-----\n\nThe original DLL’s code is modified, and a different DLL file appears in place of it. After the\nmodifications are done, the memory protection is changed again (0x2 = PAGE_READONLY):\n\nFigure 8\n\nThe binary disables the DLL_THREAD_ATTACH and DLL_THREAD_DETACH notifications for\nthe newly created DLL:\n\nFigure 9\n\nThe final DLL represents the last stage of Grief ransomware. It has 5 export functions, however,\nonly one is relevant in our analysis: DllRegisterServer. The other 4 exports jump in the middle of\nother functions, and we believe the threat actor didn’t intend to use any of them:\n\nFigure 10\n\n\n-----\n\nAn important hint which suggests that the file is encrypted/obfuscated is the lack of imports:\nGetCommandLineW, lstrcpyW, CommandLineToArgvW, and RtlComputeCrc32. Grief, like its\npredecessor DoppelPaymer [1], is designed to run only with specific argument(s), otherwise it\nwill crash. The ransomware extracts the arguments using the GetCommandLineW and\nCommandLineToArgvW APIs.\n\nThe malware computes the CRC32 checksum of the last argument, adds 0x1EC6086B to the\nresult, and finally adds the instruction pointer address to this final value (figure 11 is almost\nidentical to the figure presented at [1] regarding the DoppelPaymer Control Flow Obfuscation).\nIf no arguments/incorrect arguments are provided, the ransomware crashes. This action\nrepresents an anti-sandbox technique and a drawback for malware analysis (if you’re not the\nvictim, of course):\n\nFigure 11\n\n\n-----\n\nWe were able to find good insights even without the required arguments, based on the analysis\nof the most complex functions.\n\nThe first anti-analysis technique we present consists of inserting lots of “int 3” (0xCC) instructions\nin the code. This technique is like the one employed by Dridex and explained at [2]. An example\nof such instructions is shown in figure 12:\n\nFigure 12\n\nGrief registers a new customized Exception Handler by calling the\nRtlAddVectoredExceptionHandler API:\n\nFigure 13\n\nThe exception handler displayed in figure 14 expects an exception code as an argument. Whether\nthe exception code is 0xC0000005 (ACCESS_VIOLATION), 0xC00000FD\n(STATUS_STACK_OVERFLOW), and 0xC0000374 (Heap Corruption), the malware kills itself\nby calling the NtTerminateProcess API. If the exception code is 0x80000003\n(EXCEPTION_BREAKPOINT), the function mimics the “call eax” instruction, which means that\ntwo “int 3” instructions can be interpreted as a “call eax” instruction. We’ve patched the binary\nby replacing the “0xCCCC” bytes with “0xFFD0”.\n\n\n-----\n\nFigure 14\n\nGrief implements API hashing in multiple functions. The first argument is the hashed DLL name,\nand the 2nd argument is the hashed API name:\n\nFigure 15\n\nFigure 16\n\n\n-----\n\nA snippet of one of the functions that parse the PEB (Process Environment Block) structure,\nperforms XOR operations, and determines which APIs should be used, is shown below:\n\nFigure 17\n\nThe result of the above operations, which is the address of an API, is stored in the EAX register.\nFor example, figure 18 reveals an API that is used to kill the current process:\n\nFigure 18\n\nCapa [3] has been used to detect any encryption algorithms in our malicious DLL. It has identified\nthe RC4 algorithm in sub_6A996248 based on the structure of the operations:\n\n\n-----\n\nFigure 19\n\nFigure 20\n\nThe CryptAcquireContextW routine is utilized to acquire a handle to a key container within a CSP\n(cryptographic service provider). The arguments are szProvider = \"Microsoft Enhanced RSA and\nAES Cryptographic Provider\", 0x18 = **PROV_RSA_AES,** and 0xF0000000 =\n**CRYPT_VERIFYCONTEXT:**\n\n\n-----\n\nFigure 21\n\nThe function identified above is utilized to decrypt relevant strings using the RC4 algorithm. The\nRC4 key is changing frequently and has 48 bytes. We enumerate a list of decrypted strings and\ntheir explanations according to our analysis and the OSINT.\n\nGrief doesn’t encrypt the files which contain the following strings in their name and also the files\nthat have the following extensions:\n\nFigure 22\n\nThe ransomware doesn’t encrypt the files that are located in the following directories:\n\nFigure 23\n\nThe malware also decrypts a list of environment-variable strings, which will be used as arguments\nfor the ExpandEnvironmentStringsA function:\n\n\n-----\n\nFigure 24\n\nA list of services to be stopped is also decrypted using RC4 (see figure 25). These services might\nlock important files such as databases, and the ransomware wouldn’t be able to encrypt them.\n\nFigure 25\n\nThe binary also decrypts a list of Sophos services that will be stopped:\n\n\n-----\n\nFigure 26\n\nGrief appends the following extension to the file name of the encrypted files:\n\nFigure 27\n\nThe ransom note file name is also decrypted using RC4:\n\nFigure 28\n\nAn RSA public key that is Base64-encoded is decrypted by the process:\n\n\n-----\n\nFigure 29\n\nThe content of the ransom note is also revealed:\n\nFigure 30\n\nThe LegalNoticeCaption and LegalNoticeText registry values will be modified to contain the client’s\nname, a password, and the Dark web link that needs to be accessed in order to communicate\nwith the threat actor. We’ve redacted the company name, however, we’ve confirmed that it was\nlisted on the Grief’s page:\n\nFigure 31\n\n\n-----\n\nFigure 32\n\nThe process also decrypts the Windows Defender Registry Key and the DisableAntiSpyware\nregistry key, which will be utilized to turn off Microsoft Defender Antivirus:\n\nFigure 33\n\nFigure 34\n\nA list of commands that will be used to delete the Volume Shadow Copies is decrypted by the\nransomware:\n\nFigure 35\n\nFigure 36\n\nGrief decrypts even more data using RC4, however, we’ve included the other less relevant strings\nin the appendix for completeness.\n\nThe ransom note called “.iwant2survive.html” is displayed in figure 37:\n\n\n-----\n\nFigure 37\n\nExpandEnvironmentStringsA is utilized to expand an environment-variable string and replace it\nwith the value defined for the current user:\n\nFigure 38\n\nThe malicious process extracts the NetBIOS name of the local computer via a function call to\nGetComputerNameW:\n\nFigure 39\n\nThe binary acquires a handle to a key container within a CSP (cryptographic service provider)\nusing the CryptAcquireContextW API (0x18 = **PROV_RSA_AES,** 0xF0000000 =\n**CRYPT_VERIFYCONTEXT):**\n\n\n-----\n\nFigure 40\n\nThe CryptCreateHash function is used to create a handle to a CSP hash object (0x8003 =\n**CALG_MD5):**\n\nFigure 41\n\nThe binary computes the MD5 hash of the computer name by calling the CryptHashData routine:\n\nFigure 42\n\nThe hash size (16 bytes) is extracted by calling the CryptGetHashParam API (0x4 =\n**HP_HASHSIZE):**\n\nFigure 43\n\nThe hash value is retrieved using the same API (0x2 = HP_HASHVAL):\n\n\n-----\n\nFigure 44\n\nFrom our analysis and the OSINT, one of the parameters that Grief is supposed to run with is “<First 6 chars from the hash value>”. Based on this observation, the parameter changes from\none host to another.\n\nThe binary retrieves the command line string for the current process:\n\nFigure 45\n\nCommandLineToArgvW is utilized to parse the command line string and return an array of pointers\nto the cmd line arguments:\n\nFigure 46\n\nThe malicious process retrieves the path of the executable of the current process via a function\ncall to GetModuleFileNameW:\n\nFigure 47\n\nThe ransomware also computes the MD5 hash of the string “1<Computer Name extracted\nearlier>”:\n\n\n-----\n\nFigure 48\n\nThe file creates an event object using the NtCreateEvent routine (0x1F0003 =\n**EVENT_ALL_ACCESS):**\n\nFigure 49\n\nThe process creates a mutant object by calling the NtCreateMutant function (0x1F0001 =\n**MUTEX_ALL_ACCESS):**\n\nFigure 50\n\nThe malware decodes the Base64-encoded RSA public key using the CryptStringToBinaryA\nfunction (0x1 = CRYPT_STRING_BASE64):\n\nFigure 51\n\n\n-----\n\nFigure 52\n\nGrief decodes a structure of the **X509_PUBLIC_KEY_INFO type by calling the**\nCryptDecodeObject API (0x10001 = **PKCS_7_ASN_ENCODING |** **X509_ASN_ENCODING,**\n0x8 = X509_PUBLIC_KEY_INFO):\n\nFigure 53\n\nFigure 54\n\n\n-----\n\nCryptImportPublicKeyInfo is utilized to convert and import the RSA public key information into\nthe provider (0x10001 = PKCS_7_ASN_ENCODING | X509_ASN_ENCODING):\n\nFigure 55\n\nThe RSA public key is in the ASN.1 format, and a great explanation of this format is presented at\n\n[4]. The public key is used to encrypt the generated AES file encryption keys. We were not able\nto reach the point where the malware encrypts the files due to the lack of the initial parameters.\n\nGrief also implements the Heaven’s Gate technique, which is fully described at [5]. Shortly, the\nprocess running as a 32-bit binary switches to the 64-bit environment and executes some\ninstructions there. As we can see in figure 56, the binary pushes 0x33 (the segment selector) on\nthe stack and calls the next line. The retf instruction is a “far return” and specifies the address\nwhere the execution returns and the segment. The code that starts after the retf instruction\nshould be interpreted as 64-bit and debugged accordingly (for example, using WinDbg because\nx64dbg or the IDA Pro debugger can’t be used to perform the switch).\n\nFigure 56\n\n\n-----\n\n**Deletion of Volume Shadow Copies using vssadmin and Diskshadow. Disable**\n**Microsoft Defender Antivirus**\n\nThe ransomware initializes the COM library for use by the calling thread using the CoInitializeEx\nAPI (0x2 = COINIT_APARTMENTTHREADED):\n\nFigure 57\n\nThe binary calls the CoCreateInstance function in order to create a Group Policy Object with the\nCLSID {EA502722-A23D-11D1-A7D3-0000F87571E3} (0x1 = CLSCTX_INPROC_SERVER):\n\nFigure 58\n\nThe OpenLocalMachineGPO method is used to open the default GPO for the computer and load\nthe registry information (0x1 = GPO_OPEN_LOAD_REGISTRY):\n\nFigure 59\n\nGetRegistryKey is utilized to retrieve a handle to the root of the registry key for the computer\nsection (0x2 = GPO_SECTION_MACHINE):\n\n\n-----\n\nFigure 60\n\nThe malicious binary opens the \"SOFTWARE\\Policies\\Microsoft\\Windows Defender\" registry key\n(0x3 = KEY_QUERY_VALUE | KEY_SET_VALUE):\n\nFigure 61\n\nThe process turns off Microsoft Defender, as well as 3rd-party antivirus software and apps by\nsetting the “DisableAntiSpyware” registry value to 1:\n\nFigure 62\n\nFigure 63\n\nThe Save method is used to save the specified registry policy settings to disk and update the\nrevision number. The parameter called pGuidExtension is set to the GUID {35378eac-683f-11d2a89a-00c04fbbcfa2} and pGuid is set to {3D271CFC-2BC6-4AC2-B633-3BDFF5BDAB2A}:\n\n\n-----\n\nFigure 64\n\nThe GPO object created earlier is deleted using the Delete method:\n\nFigure 65\n\nGrief enumerates the executable files located in the System32 directory using the FindFirstFileExW\nroutine (0x1 = FindExInfoBasic, 0x2 = FIND_FIRST_EX_LARGE_FETCH):\n\nFigure 66\n\nThe process computes a “hash” (4-byte value) of each executable name using a custom function:\n\n\n-----\n\nFigure 67\n\nThe hash value is XOR-ed with 0x84794EF2, and then compared with 0x668B9032 (hard-coded\nvalue). Whether the two values aren’t equal, the malware continues the enumeration by calling\nthe FindNextFileW API:\n\nFigure 68\n\nThe binary is looking for vssadmin.exe. It disables file system redirection for the current thread\nusing Wow64DisableWow64FsRedirection:\n\nFigure 69\n\nThe ransomware deletes all Volume Shadow Copies using vssadmin (0x08000000 =\n**CREATE_NO_WINDOW):**\n\n\n-----\n\nFigure 70\n\nThe process restores file system redirection for the current thread via a function call to\nWow64RevertWow64FsRedirection:\n\nFigure 71\n\nThe process of enumerating the executable files from the System32 folder is repeated one more\ntime, and the XOR-ed result is compared with 0x96164682 (hard-coded value). Based on our\nanalysis, the targeted file is Diskshadow.exe.\n\nCryptGenRandom is utilized to generate 4 random bytes 3 times:\n\nFigure 72\n\nThe binary creates an empty temporary file with a prefix string generated based on the random\nbytes:\n\nFigure 73\n\n\n-----\n\nThe malware retrieves the short path form of the specified path by calling the\nGetShortPathNameW routine:\n\nFigure 74\n\nGrief ransomware opens the newly created file using CreateFileW (0xC0000000 =\n**GENERIC_READ** | **GENERIC_WRITE,** 0x5 = **TRUNCATE_EXISTING,** 0x80 =\n**FILE_ATTRIBUTE_NORMAL):**\n\nFigure 75\n\nThe malware calls the SetFileTime function in order to prevent file operations using the file handle\nfrom modifying the last access time and the last write time (dwLowDateTime and\ndwHighDateTime are set to 0xFFFFFFFF):\n\nFigure 76\n\nThe file is populated with the following content:\n\n\n-----\n\nFigure 77\n\nThe ransomware deletes all Volume Shadow Copies by creating a Diskshadow process and then\nrunning the “delete shadows all” command:\n\nFigure 78\n\nThe malicious file retrieves the share names available on the local computer using the\nNetShareEnum API:\n\nFigure 79\n\n\n-----\n\n## REFERENCES\n\n\n1. [https://www.crowdstrike.com/blog/doppelpaymer-ransomware-and-dridex-2/](https://www.crowdstrike.com/blog/doppelpaymer-ransomware-and-dridex-2/)\n2. [https://cyber-anubis.github.io/malware%20analysis/dridex/](https://cyber-anubis.github.io/malware%20analysis/dridex/)\n3. [https://github.com/mandiant/capa](https://github.com/mandiant/capa)\n4. [https://stackoverflow.com/questions/18039401/how-can-i-transform-between-the-two-](https://stackoverflow.com/questions/18039401/how-can-i-transform-between-the-two-styles-of-public-key-format-one-begin-rsa)\n\n[styles-of-public-key-format-one-begin-rsa](https://stackoverflow.com/questions/18039401/how-can-i-transform-between-the-two-styles-of-public-key-format-one-begin-rsa)\n5. [https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-](https://blog.malwarebytes.com/threat-analysis/2018/01/a-coin-miner-with-a-heavens-gate/)\n\ngate/\n\n\n-----\n\n## APPENDIX\n\n\nThe other strings decrypted using the RC4 algorithm are shown in the following pictures:\n\nFigure 80\n\nFigure 81\n\nFigure 82\n\n\n-----\n\nFigure 83\n\nFigure 84\n\nFigure 85\n\nFigure 86\n\nFigure 87\n\nFigure 88\n\nFigure 89\n\nList of files and file’s extensions to be skipped:\n\n  - svsho*.exe;schre*.bat;V01.lo*;V01.ch*;V01res*.jrs;RacWmi*.sdf;Web*V01.dat;default.r\ndp;NTUSER.DA*;*.lnk;*.ico;*.ini;*.msi;*.chm;*.sys;*.hlf;*.lng;*.inf;*.ttf;*.cmd;*.LNK;*\n.ICO;*.INI;*.MSI;*.CHM;*.SYS;*.HLF;*.LNG;*.INF;*.TTF;*.CMD\n\nList of directories to be skipped:\n\n  - System Volume Information;$RECYCLE.BIN;$Recycle.Bin;WebCache;Caches;VirtualStore\n\n\n-----\n\nList of environment-variable strings:\n\n  - %ProgramData%\\\\Microsoft\\\\Windows\\\\WER\\\\ReportQueue\\\\;%windir%;%temp%;%A\nPPDATA%\\\\Local\\\\VirtualStore\\\\;%HOMEDRIVE%\\\\Documents and Settings\\\\All\nUsers\\\\Application Data\\\\Application Data\\\\;%HOMEDRIVE%\\\\Users\\\\All\nUsers\\\\Application Data\\\\Application Data\\\\;%SystemDrive%\\\\Documents and\nSettings\\\\All Users\\\\Application Data\\\\Application Data\\\\;%SystemDrive%\\\\Users\\\\All\nUsers\\\\Application Data\\\\Application Data\\\\\n\nList of services to be stopped:\n\n  - msolap$*;mssql$*;sqlagent$*;reportserver$*\n\n  - sophos client firewall*;sophos mcs*;sophos web intelligence*;sophospatch*\n\nExtension of encrypted files:\n\n  - .pay0rgrief\n\nGrief’s Dark web site and the impacted client:\n\n  - \"CROMOLOGY SERVICES ... ZOLPAN, you are fu**ed.\" (Redacted)\n\n  - \"DO NOT TOUCH ANYTHING!\\r\\n\\r\\nWhat to do ( password: oN*********\n):\\r\\nhttp[:]//payorgz3j6hs2gj66nk6omfw65atgmqwzxqbbxnqi3bv2mlwgcirunad[.]onion/\ndemand/da597c8432bc4458b9475627fd55eded\\r\\n\\r\\nUSE TOR.\\r\\n\\r\\nP0G_\\r\\n\\r\\n\"\n(Redacted)\n\n\n-----\n\n#### API hashing table\n\n|A169D93E B7303F40 F1E04D0E 14134842 D8FC22B5 C4B669CF 1D4786C2 2CE276DD BD63F85D 589C7CD4 2596A7DB D7509C5D 8EB1B560 22C3F66E 78120C03 ECED49A4 BC8CDE49 A88A7EA6 F5656839 86089CF3 D9DE4146 E66CC345 65C66CA1 AE320B72 F68850CB 1EF9AB7B AF2A8DE9 F246E304 BA71B979 AA297AF9 C0ED06A6 F61D52F9 459F8107 9224D8AB 8F5E891D CA2E3F55 5DCB4A66 D5D107B9 5321A741 1F442F52 99CD5D11 72A2E993 4FCE620F 84A5D7E5 569C7845 A5F904F1 6BBEA486 23820F97 8D254D22 489018E0 7E44617A A160FFA8 BBD6B3B8 2236F20A 4348FE4D E1369068 3E4FB2EF 784487EE 7D5DB015 98B31D0F 9F5CDB 565B4A16 5C52B868 7380D608 58AD2EB 5982AEC6 BBB8F37F 5E116D7D 4D05510D|ExitProcess GetCurrentDirectoryW CreateDirectoryW CreateThread CreateProcessW CreateFileMappingW QueryDosDeviceW MapViewOfFile UnmapViewOfFile GetFileType CreateFileW GetVolumeNameForVolumeMountPointW DeviceIoControl ExpandEnvironmentStringsA GetModuleFileNameW FileTimeToSystemTime SystemTimeToFileTime GetShortPathNameW GetLogicalDrives GetDriveTypeW SetThreadPriority GetDiskFreeSpaceExW SetFileAttributesW MoveFileW MultiByteToWideChar WideCharToMultiByte GetVersionExW GetSystemInfo LocalFree IsWow64Process GetSystemWow64DirectoryW GetSystemDirectoryW GetEnvironmentStringsW GetTempFileNameW GetWindowsDirectoryW GetComputerNameW GetCommandLineW IsBadReadPtr GetThreadId GetProcessId GetCurrentProcessId SearchPathW Wow64DisableWow64FsRedirection Wow64RevertWow64FsRedirection GetLastError SetFileTime SetFilePointer GetFileSize ReadFile WriteFile FlushFileBuffers SetEndOfFile GetFileTime GetFileAttributesExW RemoveDirectoryW DeleteFileW GetHandleInformation QueryFullProcessImageNameW GetProcessTimes GetExitCodeProcess LocalSize GetSystemTime FindClose FindFirstFileExW FindNextFileW SetLastError LoadLibraryA FreeLibrary GetProcAddress|7408F6CF CB74E56B 3440E30C 3FA0503A C094565D 8D388F19 2D504FC7 B1978170 49A2BC02 2478983B 2C39743C 826FDC1D 429ACFE2 5B40E61E D8EFD506 8E1D8F12 53F5694D D4E43A30 DE78F152 6F75B3F1 69836B71 8A2AACA0 7EBEE13C 7F0B03AE 8B6FA607 3373DF6A 2EE029FE F40C812D F66A15F1 9675A67D 5CDDF47 3F1483A7 42132256 26652D0D E8C5D221 518E8878 29DBE130 787BAFBC F2EC9F3E 922CE64F 7DBF48E7 B514674F 9C01B84F D46EE9FF 434A3624 967918CF 62DE91AE 65E4543B 0BCF31C0 53FF883 4266BEEF F5EE9951 A633633A C380FA58 2F9F0714 DD2C7E1F 7809AAC1 71A22286 0B910B2 4D62C13 8631D459|RegDeleteValueA RegSetValueExA RegQueryValueExA RegSetValueExW RegQueryValueExW RegEnumValueA RegCloseKey RegOpenKeyExW RegEnumKeyW RegCreateKeyExW CryptReleaseContext CryptGetHashParam CryptHashData CryptCreateHash CryptAcquireContextW CryptDestroyHash CryptGenRandom CryptEncrypt CryptExportKey CryptGenKey CryptDestroyKey SetSecurityInfo GetSecurityDescriptorSacl ConvertStringSecurityDescriptorToSecurityDescriptorW ControlService OpenServiceW StartServiceCtrlDispatcherW CloseServiceHandle OpenSCManagerW ChangeServiceConfigW StartServiceW QueryServiceConfigW QueryServiceStatus EnumServicesStatusExW SetServiceStatus RegisterServiceCtrlHandlerW GetUserNameW GetSidSubAuthority GetSidSubAuthorityCount GetTokenInformation OpenProcessToken FreeSid ConvertSidToStringSidA EqualSid AllocateAndInitializeSid RegSetKeyValueW CreateProcessAsUserW NetUserEnum NetUserSetInfo NetShareEnum NetApiBufferFree NetShareDel CryptStringToBinaryA CryptDecodeObject CryptImportPublicKeyInfo WTSEnumerateSessionsW WTSQueryUserToken WTSFreeMemory ZwClose RtlExitUserThread GetClassNameW|\n|---|---|---|---|\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://lifars.com/wp-content/uploads/2022/01/GriefRansomware_Whitepaper-2.pdf"
    ],
    "report_names": [
        "GriefRansomware_Whitepaper-2.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1641655976,
    "ts_modification_date": 1641805913,
    "files": {
        "pdf": "https://archive.orkl.eu/e9df98f1a03146c9f736ba911bd25a5e2c02f657.pdf",
        "text": "https://archive.orkl.eu/e9df98f1a03146c9f736ba911bd25a5e2c02f657.txt",
        "img": "https://archive.orkl.eu/e9df98f1a03146c9f736ba911bd25a5e2c02f657.jpg"
    }
}