{
    "id": "948945a5-17a7-4ca7-86bd-bc4bbd51dbfd",
    "created_at": "2023-01-12T15:01:43.491748Z",
    "updated_at": "2025-03-27T02:06:00.16594Z",
    "deleted_at": null,
    "sha1_hash": "b7828a0bd330a71b7ab2429fb457bdf750365f14",
    "title": "2022-08-04 - Top of the Pops- Three common ransomware entry techniques",
    "authors": "",
    "file_creation_date": "2022-09-01T10:14:19Z",
    "file_modification_date": "2022-09-01T10:14:19Z",
    "file_size": 158448,
    "plain_text": "# Top of the Pops: Three common ransomware entry techniques\n\n**[research.nccgroup.com/2022/08/04/top-of-the-pops-three-common-ransomware-entry-techniques](https://research.nccgroup.com/2022/08/04/top-of-the-pops-three-common-ransomware-entry-techniques)**\n\nAugust 4, 2022\n\nby Michael Mathews\n\nRansomware has been a concern for everyone over the past several years because of its\nimpact to organisations with the added pressure of extortion and regulatory involvement.\nHowever, the question always arises as to how we prevent it. Prevention is better than cure\nand hindsight is a virtue. This blog post aims to cover some high-level topics around\nransomware groups, affiliates and their initial entry tactics.\n\nSomething to consider is the fact that ransomware has moved quickly into a Ransomware as\na Service (RaaS) model, whereby affiliates are being provided all the weaponry and\nplaybooks required to carry out their objectives. Given the simplicity of this approach, and the\n\n\n-----\n\nfact that the tactics are repeatable, there are a number of preventative measures that can be\ntaken. Using this, we have devised this blog post to provide a short list of the top initial entry\nmethods observed from the front line whilst responding to incidents over the past 6 months.\n\n## ProxyShell\n\nProxyShell is the collective name used to describe the vulnerabilities, released between April\nand July 2021, affecting Microsoft Exchange. This vulnerability has been covered in detail\nelsewhere [1], therefore for conciseness, they can be summarised as:\n\nACL Bypass (CVE-2021-34473)\nPrivilege Escalation (CVE-2021-34523)\nRemote Code Execution (CVE-2021-31207)\n\nDue to the Exchange infrastructure being externally facing, affiliates cast their nets far and\nwide scanning for victims that have failed to patch and thus begin their attacks by using\nProxyShell as their initial foothold.\n\n### Mitigations\n\nKB5001779\nKB5003435\n\nPatching! Patches were released in May 2021 by Microsoft to mitigate the vulnerabilities in\nthe form of Windows update codes:\n\nMicrosoft Exchange Online or Office365, as more commonly referred to, was not affected.\nSaaS is a well placed alternative and provides a barrier to your on-premises network (with\nappropriate security controls).\n\n## Externally Facing Infrastructure\n\nWhilst we could classify Exchange under this term, it deserved its own spot given it is a firm\nfavourite with ransomware groups (partly due to its success rate). In this category, we will\ncover another favourite, specifically referring to firewalls.\n\nFireWalls and other perimeter security solutions have grown ever more complex and offer a\nwide variety of services outside of allowing and denying network traffic on the perimeter,\nmost notably VPN’s.\n\nA prime example of this is a vulnerability that was exploited in FortiGate devices, CVE-201813379. The vulnerability itself was directory traversal but, it did provide access to sensitive\nfiles which contained plaintext passwords. In turn, you have your recipe for disaster and a\nransomware actors initial entry point. The username and password could be used to\n\n\n-----\n\nauthenticate with the VPN and gives threat actors a foothold on the internal network.\nHowever, this is just one example, on several occasions we have observed firewalls being\ntargeting and successfully leveraged as an entry point into the network.\n\n### Mitigations\n\nOnce again patching, edge network devices are extremely vulnerable given their position\nwithin the network, the precise device you are using to keep threat actors at bay may in fact\nbe the target in the first place. Ensure you have a robust patching policy, and your devices\nare updated frequently.\n\nSecond, multi factor authentication (MFA) is critical to mitigate standard username/passwordbased attacks. Although a vulnerability is exploited to gain access to credentials in this\ninstance, phishing would have had the same impact if VPN credentials were targeted.\n\n## Exposed Remote Desktop (other VDI solutions)\n\nAn old favourite, the GUI interface of RDP. Whilst a great way to connect to a remote device,\nit does not really have a place on the internet. If you are seeing your failed login count hit\nnumbers you cannot easily say, there may be an underlying problem that could be a host\nexposing RDP to the internet.\n\nWhen paired with weak security controls, weak credentials (domain or local), no lockout\npolicy, you are effectively providing a free shot to affiliates to take a gamble and gain access\nto your network. This is most prominent with development environments, setup with default\nsettings, a weak local password and publicly available for ease of use. This is especially\nprevalent in cloud environments where build images inherit several security flaws through\npoor configuration but allow users to stand up infrastructure quickly.\n\n### Mitigations\n\nUse a enterprise VPN solution with MFA configured to access internal resources from remote\nlocations.\n\nTreat development environments with care and ensure build images have appropriate\nsecurity controls and protective monitoring in place.\n\n## Proactive Measures\n\nTaking a proactive stance to ensure the integrity of your network is critical, it is never too late\nto begin to harden your defences or at least verify you are secured. However, if you need\nsupport or help to assess the scale of the issue, we can help:\n\nUnsure if you are affected by any of these vulnerabilities or misconfigurations?\n\n\n-----\n\nYou have identified a host that is vulnerable is requires further investigation?\nConcerned about what is lurking in the wider network?\n\nIf you have been impacted by any of these issues, or currently have an incident and would\nlike support, please contact our Cyber Incident Response Team at +44 161 209 5148 /\ncirt@nccgroup.com\n\n[1] [https://www.ncsc.gov.ie/pdfs/MS_Proxyshell_060921.pdf`](https://www.ncsc.gov.ie/pdfs/MS_Proxyshell_060921.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-04 - Top of the Pops- Three common ransomware entry techniques.pdf"
    ],
    "report_names": [
        "2022-08-04 - Top of the Pops- Three common ransomware entry techniques.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535703,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1662027259,
    "ts_modification_date": 1662027259,
    "files": {
        "pdf": "https://archive.orkl.eu/b7828a0bd330a71b7ab2429fb457bdf750365f14.pdf",
        "text": "https://archive.orkl.eu/b7828a0bd330a71b7ab2429fb457bdf750365f14.txt",
        "img": "https://archive.orkl.eu/b7828a0bd330a71b7ab2429fb457bdf750365f14.jpg"
    }
}