{
    "id": "94a99906-72b2-4ed3-be6d-fe8dfee77029",
    "created_at": "2022-10-25T16:48:12.522655Z",
    "updated_at": "2025-03-27T02:16:01.116603Z",
    "deleted_at": null,
    "sha1_hash": "c0257921c58ae5fa926b4159536bf6a33c476cdc",
    "title": "",
    "authors": "",
    "file_creation_date": "2015-10-08T11:07:55Z",
    "file_modification_date": "2015-10-08T11:29:32Z",
    "file_size": 528783,
    "plain_text": "# 2015: THE MOST PROLIFIC YEAR IN HISTORY FOR OS X\n MALWARE\n\n## After a 10-week analysis, the Bit9 + Carbon Black Threat Research team found that five times more\n OS X malware appeared in 2015 than during the\n previous five years combined.\n\n\n-----\n\n### Threat Research Briefing\n\nIt’s been long believed that Macs have faced significantly less risk of cyber attack than PCs and, until\nrecently, that sentiment has been largely correct. Mac users have been mostly immune from malware\nrelative to their Windows-user counterparts. However, it appears that tide is turning.\n\nThis rise in Mac OS X malware comes after several years of rapid OS X market share gains, with 16.4\npercent of the market now running OS X[1], including expanding deployment in the enterprise. This\nrepresents a growing attack surface for sensitive data, as 45 percent of companies now offer Macs as an\noption to their employees. [2]\n\nIn 2015 we have seen interesting OS X vulnerabilities and malware that have grabbed the security\ncommunity's attention. One example is XcodeGhost, which inserts malicious components into\napplications made with Xcode (Apple's official tool for developing IOS and OS Apps). Additionally, it was\nrecently revealed that OS X El Capitan, which launched in September, contains serious vulnerabilities in\nits Gatekeeper and Keychain features.\n\nEvidence of a more malicious OS X marketplace is clearly compounding. A timeline charting Mac OS X\nmalware prevalence in the market shows a clear upward tick:\n\n1 http://www.computerworld.com/article/2948474/mac-os-x/as-apple-desktop-use-grows-it#### adapts.html\n\n2 http://appleinsider.com/articles/14/03/25/45-of-business-offers-macs-to-employees-77-find#### apple-more-reliable---survey\n\n\n-----\n\nA 10-week analysis conducted by the Bit9 + Carbon Black Research Team validates the unprecedented\ngrowth in OS X malware. With an extensive global reach and a pulse on the expanding threat landscape,\nthe Bit9 + Carbon Black team collected more than 1,400 unique OS X malware samples. Samples were\naggregated from the team’s independent research efforts, open sources, experience from incident\nresponse engagements involving OS X, peer research, black lists, and contagio malware dump, among\nother sources.\n\nAs big-picture trends from the data began to emerge, one data point struck the team as particularly\nnoteworthy: 2015 has been the most prolific year in history for OS X malware.\n\n**In 2015 alone, the research found, the number of OS X malware samples has been five times greater**\n**than in 2010, 2011, 2012, 2013 and 2014 combined.**\n\n\n-----\n\nThe sample size in this analysis is significant enough for even the most optimistic Mac user to realize\nthat OS X security must now be a paramount concern.\n\nBased on the observations in the 10-week analysis, the Bit9 + Carbon Black Threat Research Team\nconfidently expects Mac OS X malware attacks to accelerate in the coming months. As Apple continues\nits growth in both the consumer and enterprise markets, its platforms have become a prime target for\n\nattackers.\n\nSecurity professionals, consumers and enterprise users alike\nshould read the results of this latest analysis as a clarion call\n\n“The Bit9 + Carbon Black Threat for a more comprehensive approach to enterprise security—\nResearch Team confidently expects one that encompasses the right people, processes and\nMac OS X malware attacks to technology that can handle advanced threats against Mac OS\naccelerate in the coming months.” X and other Apple devices.\n\n\n“The Bit9 + Carbon Black Threat\nResearch Team confidently expects\nMac OS X malware attacks to\naccelerate in the coming months.”\n\n\n-----\n\n### Observed Malware Behavior\n\nThe OS X malware analyzed consisted of more than 1,400 unique samples taken from the Bit9 + Carbon\nBlack Threat Research Team’s research engagements, open sources, and from incident response\nengagements involving OS X, peer research, black lists, and contagio malware dump.\n\nWhen looking at OS X malware, research teams cannot utilize common Windows malware analysis tools,\nsuch as process monitor. To compensate for this in their OS X research, the Bit9 + Carbon Black Threat\nResearch Team utilized various custom and prebuilt tools, such as fs_usage, dtrace, and opensnoop to\ninstrument machines for dynamic analysis, in addition to the custom-built Carbon Black sandbox.\n\nBy utilizing the custom-built sandbox, the research team was able to quickly identify common actions\nperformed by malware, such as file creations and network communications. This enabled the team to\nlook at command-and-control infrastructure as well as artifacts left as part of the malware execution.\n\n### UNIX Persistence Mechanisms Not Seen\n\nIn an interesting twist, typical UNIX persistence mechanisms were not frequently seen in the OS X\nmalware analyzed. For example, the team’s analysis found that mechanisms such as adding cron jobs\nand “trojaning” startup locations such as rc.common weren’t typically used; instead, malware authors\nare choosing to use Mac OS X-specific mechanisms.\n\nDuring analysis, the team found that most OS X malware would utilize features of the OS such as\nLaunchDaemons/LaunchAgents, login items and browser plugins. Malware more often resided in userland and leveraged persistence mechanisms that supported this as opposed to attempting to reside in\nkernel-land by writing custom kernel extensions.\n\nIn another twist, it was the team’s expectation that, given OS X’s roots in FreeBSD, adapting Unix/Linux\nmalware would be common. However, based on this 10-week analysis, there does not appear to be\nmuch, if any, Unix-style malware brought over to OS X.\n\nAdditionally, Apple introduced a new load command (LC_MAIN) to define the entry point into the MachO format with the release of OS X 10.8 in 2012. The previous load commands were LC_THREAD and\nLC_UNIXTHREAD. More than 90 percent of the OS X malware we analyzed from 2015 still uses the old\nload command entry point method. In analyzing samples from 2010 through 2015, the research team\ndid not start seeing the new method being used until 2014 and, even then, it was a tiny percentage. This\ntrend leads to a statistical indicator from the research that malware currently uses the old load\ncommand much more than the new load command. Consequently, if a Mach-O file found on a modern\n\n\n-----\n\nMac system uses the old load command, it’s more likely to be malware than a Mach-O file using the new\n\nload command.\n\n### Increased Malware Prevalence,\n\n“Malware authors are not updating their **Less Sophistication**\nmalware to conform to the latest\nspecifications by Apple.” Based on Bit9 + Carbon Black’s analysis, there are\n\nstrong signs that suggest malware authors are\nseizing the opportunity to strike on the OS X\nplatform. The result of this transition is an increased\nprevalence of OS X malware, even if it is not particularly sophisticated.\n\nAs the team noted during its analysis, OS X malware authors aren’t utilizing the Unix philosophy\ncombining \"small, sharp tools\" to achieve the desired results. The malware authors seem to have a more\n“Windows-malware” (i.e. - monolithic) approach to how the malware behaves versus a composability\napproach, which would take advantage of existing legitimate Unix specific OS operations as part of their\ndesign.\n\n### 7 Distinct Persistence Techniques Seen\n\nTrue to form, most OS X malware leverages a persistence technique in order to remain on the targeted\nsystem. While [13 documented persistence techniques](https://www.virusbtn.com/pdf/conference/vb2014/VB2014-Wardle.pdf) have been identified, the Bit9 + Carbon Black\nThreat Research team identified that the vast majority of OS X malware leveraged one of just seven\npersistence techniques to remain active on a system.\n\n1) **LaunchAgents – An OS X-provided way to start programs on a per-user or system-wide basis**\n\n\n“Malware authors are not updating their\nmalware to conform to the latest\nspecifications by Apple.”\n\n\n-----\n\n2) **LaunchDaemons – An OS X-provided way to start programs on a per-user or system-wide basis,**\n\nused interchangeably with LaunchAgents\n3) **Cron job – Cron is a time-based job scheduler in Unix-like computer operating systems. Cron jobs**\n\nare used to run scripts/programs periodically at fixed times, dates or intervals.\n4) **Login items – The method to cause programs to run when a user logs in to an OS X account.**\n5) **Browser plugins – Code that runs in the context of a Web browser. They are known for adding**\n\nadditional functionality to browsers.\n6) **StartupItems – Programs to run upon system startup.**\n7) **Binary infection – When one executable modifies another so when the original executable is run**\n\ncontrol is passed to the malicious code prior to the original code being executed.\n\nWhile the Threat Research Team identified other categories that could be leveraged to gain persistence,\nno malware in the wild has yet been seen or adapted to leverage them. This lack of OS X malware\nbiodiversity currently makes finding persistent malware infections easier than on Windows systems as\nthere are fewer places than need to be checked.\n\nTo aid those wishing to check their infection status, we have collected and outlined several detection\nmechanisms both enterprise security teams and individual consumers can use to gain better visibility\nacross the expanding OS X attack surface.\n\n### Detection Mechanisms / Actions to Take for Enterprises\n\n1 - Since OS X has until recently been largely ignored by malware and only rarely the target of advanced\ncyber attacks, many enterprises have failed to implement the same safeguards and controls on OS X\ndevices as they have for Windows machines. As OS X malware and targeted attacks have increased, this\nsecurity gap has left many organizations exposed and unable to identify or stop infections. This reality\nhas been compounded by the lack of OS X support from many endpoint security vendors and is a\nstrategic vulnerability for organizations with large OS X deployments.\n\nIf your organization is currently running OS X, it may mean that attackers are actively exploiting and\ntargeting your systems. Most infections our sensors see are of the adware variety, however, we have\nnoticed an increase in more sophisticated malware. This risk can be managed and monitored by\ndeploying an enterprise-class, scalable endpoint threat detection and response solution, such as Carbon\nBlack.\n\nOn OS X devices, the Carbon Black agent continually records all process executions, file and system\nmodifications, and attempted and established network connections. It analyzes this data against the\nlatest threat intelligence and behavioral indicators to detect malicious activity. This information is\ncentrally recorded and stored to provide enterprises with a single view from which current and historical\ninfection status, number of devices infected, and impact can be investigated and confirmed within\nseconds. High-risk organizations or systems can gain additional protection by using an application\ncontrol solution, such as the Bit9 Security Platform, which will control the execution of untrusted or\narbitrary code to dramatically reduce the risk of malware infection and halt the malware’s ability to\nexecute in the first place.\n\n\n-----\n\n**2 - osquery is a more comprehensive and enterprise-grade opensource tool maintained by Facebook**\n[(https://osquery.io/). Using osquery you can conduct some monitoring and analysis based upon the](https://osquery.io/)\nfollowing queries.\n\nFor looking at LaunchDaemon, LaunchAgent, startup items, and login malware you can utilize the\nfollowing queries:\n\n  - [select name,program,path FROM launchd;](https://osquery.io/docs/tables/#launchd)\n\n  - [select name,program,path FROM launchd](https://osquery.io/docs/tables/#launchd) where username = ‘root’;\n\n  - select name,linked_against,path from kernel_extensions;\n\n  - select name,path,type,source from from startup_items;\n\n  - select * from preferences where domain = ‘loginwindow’;\n\n  - select * from preferences where domain = ‘loginitems’;\n\n  - select * from crontab\n\nThe picture below is an example of a system infected with the Olyx backdoor that can be seen in the\n[osquery of “select name,program,path FROM launchd”](https://osquery.io/docs/tables/#launchd)\n\nA fair amount of OS X malware also interfaces with the launchd, and to do that they execute the\nlaunchctl command to load/unload daemons and agents. Watching for this type of activity is useful as\nwell. To do this with osquery the queries would be:\n\n  - select * from shell_history where command = “launchctl”;\n\n  - select * from shell_history where command = “/bin/launchctl”;\n\nA majority of the adware would install its own browser extensions. To look at browser extensions you\ncan utilize the following osqueries:\n\n  - select identifier,path from safari_extensions; (mostly adware malware)\n\n  - select identifier,path from chrome_extensions; (mostly adware malware)\n\nThe picture below is an example of a system infected by various pieces of adware\n\n\n-----\n\n### Detection Mechanisms for Consumers\n\nConsumers should ensure they have an antivirus software program installed and that it is running with\nthe latest update. While many OS X antivirus products are only moderately effective, for consumers,\nthis will provide a base-level of protection. There are numerous free options available from companies\nsuch as Avast, MalwareBytes and Sophos.\n\nFor consumers wishing to see if they have already been compromised, the following utilities are\navailable:\n\n**Dynamic Hijack Scanner - a simple utility that will scan your computer for applications that are either**\nsusceptible to dylib hijacking or have been hijacked. (More here: https://objective[see.com/products/dhs.html)](https://objective-see.com/products/dhs.html)\n\n**KnockKnock - uncovers persistently installed software in order to generically reveal such malware.**\n(More here: https://objective-see.com/products/knockknock.html)\n\n\n-----\n\n### Research Methodology\n\nFor 10 weeks the Bit9 + Carbon Black Threat Research Team collected more than 1,400 unique OS X\nmalware samples aggregated from its independent research efforts, open sources, experience from\nincident response engagements involving OS X, peer research, black lists, and contagio malware dumps,\namong other sources. The samples were then analyzed both statically and dynamically in a custom-built\nsandbox. This analysis focused on how OS X malware persists and what file system utilizations it has\nseen. From that research, the team noticed a significant increase in the prevalence of OS X malware,\nwhich was the impetus for this report.\n\n### About Bit9 + Carbon Black\n\nBit9 + Carbon Black is the market leader in Next-Generation Endpoint Security. We have sold more\nlicenses, have more experience, and more customers than any other NGES company because our\nsolution is the most effective way to prevent, detect and respond to advanced threats that target users,\nservers, and fixed-function devices. That’s why more than 60 MSSP and IR leaders, including Dell\nSecureWorks, EY, Optiv and Solutionary, have chosen our technology as a key component of their\nsecurity offerings, and 25 of the Fortune 100 rely on us as a critical element of their advanced threat\ndefense and compliance strategies. By the end of 2015, we expect to achieve $70M+ in annual revenue,\n70 percent growth, 7 million+ software licenses sold, and almost 2,000 customers worldwide. We were\nvoted Best Endpoint Protection by security professionals in the SANS Institute’s Best of 2014 Awards,\nand a 2015 SANS survey found that 68 percent of IR professionals are using or evaluating Carbon Black.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://assets.documentcloud.org/documents/2459197/bit9-carbon-black-threat-research-report-2015.pdf"
    ],
    "report_names": [
        "bit9-carbon-black-threat-research-report-2015.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bbefc37d-475c-4d4d-b80b-7a55f896de82",
            "created_at": "2022-10-25T15:50:23.571783Z",
            "updated_at": "2025-03-27T02:00:55.502112Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "BRONZE BUTLER",
                "REDBALDKNIGHT"
            ],
            "source_name": "MITRE:BRONZE BUTLER",
            "tools": [
                "Mimikatz",
                "build_downer",
                "cmd",
                "ABK",
                "at",
                "BBK",
                "schtasks",
                "down_new",
                "Daserf",
                "ShadowPad",
                "Windows Credential Editor",
                "gsecdump"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041761,
    "ts_creation_date": 1444302475,
    "ts_modification_date": 1444303772,
    "files": {
        "pdf": "https://archive.orkl.eu/c0257921c58ae5fa926b4159536bf6a33c476cdc.pdf",
        "text": "https://archive.orkl.eu/c0257921c58ae5fa926b4159536bf6a33c476cdc.txt",
        "img": "https://archive.orkl.eu/c0257921c58ae5fa926b4159536bf6a33c476cdc.jpg"
    }
}