{
    "id": "9514e073-10b4-44ac-9702-fadc7672df38",
    "created_at": "2023-01-12T14:58:50.039452Z",
    "updated_at": "2025-03-27T02:06:00.062507Z",
    "deleted_at": null,
    "sha1_hash": "c26d505fc2124036eda3d3bd7b57c401c2f0950a",
    "title": "2021-08-23 - Paradise Ransomware- The Builder",
    "authors": "",
    "file_creation_date": "2022-05-28T17:55:10Z",
    "file_modification_date": "2022-05-28T17:55:10Z",
    "file_size": 1968888,
    "plain_text": "# Paradise Ransomware: The Builder\n\n**[marcoramilli.com/2021/08/23/paradise-ransomware-the-builder/](https://marcoramilli.com/2021/08/23/paradise-ransomware-the-builder/)**\n\nView all posts by marcoramilli August 23, 2021\n\nThe ransomware builders remind me old times, where Nukes and Exploiters were freely available\non the underground communities, when few clicks were enough to bypass many AV vendors and\nattackers were activists or single people challenging the system. Nowadays the way the “builders”\nare developed and the way the criminality is abusing them to generate new Malware is a lot more\nsophisticated compared to 20 years ago during the romantic “hacking for fun” era. The impact of\nsuch a Malware in the contemporary society is something that needs high attention since the\ndigitization approaching the entire world. For such a reasons I believe it would be interesting to\nstudy, when possible and when available, how Ransomware Builder have been developed. The\nmain attentions nowadays is on Ransomware binaries rather than on builders, but since “builders”\nare (in a way) more closed to the Malware developer — in fact generated ransomware are very\nsimilar each other because automatically generated by the builder — I believe that studying the\nbuilders would give us a more closed knowledge about the Malware author.\n\n**Light Technical Analysis**\n\nBefore getting into code, it would be useful to remind that Paradise Ransomware was firstly\nlaunched on 2017 through phishing emails containing malicious IQY attachments that downloaded\nand installed the ransomware. The first versions of the ransomware contains flaws that allowed\n\n\n-----\n\n[international researchers to build a free decryption tool (for details HERE) able to recover files from](https://www.bleepingcomputer.com/news/security/paradise-ransomware-decryptor-gets-your-files-back-for-free/)\nthe old version of the Ransomware. After some revisions the Ransomware became strongest by\nadopting RSA encryption which made impossible the decryption without the private key.\n\n[As reported by BleepingComputer (HERE) source code leaked during this (2021) summer on](https://www.bleepingcomputer.com/news/security/paradise-ransomware-source-code-released-on-a-hacking-forum/)\nXSS.IS forum.\n\nForum post with leaked Paradise Ransomware source code\nThe source code is written on .NET, by giving it a chance to run on a local and virtualozed\nenvironment, it runs smoothly and without any issue on a basic version of .NET framework over a\nMicrosoft Visual Studio.\n\n\n-----\n\n[Simple starting Run (img from HERE)](https://www.bleepingcomputer.com/news/security/paradise-ransomware-source-code-released-on-a-hacking-forum/)\nThe leaked source code looks like following the default structure on Microsoft VS. As you might\nappreciate from the following image the leaked folder structure is simple and lean.\n\n\n-----\n\nLeaked\n\nSource Code structure\nAfter a quick and incomplete overview of the code it is possible to appreciate several “quick\nfindings”. While the produced ransomware (Paradise) is something that eventually will get of public\ndomain (since inoculated on victims machines) the attacker would insert a lot of “security check” (in\norder to get harder the analyst life) but the builder is used to be a confidential “piece of code” which\nis hold by affiliate criminal groups and for such a reason the developer ( which works with limited\namount of time – he needs to make economy himself -) is not used to implement checks and\nprecautions used in the final payload. So here they are, quick findings ahead.\n\n**Language: Russian. Over the source code it’s easy to find developer comments, which**\naccording to google, belongs with Russian language.\n\n\n-----\n\nRussian Language over leaked source code\n\n**Username of building computer: MALIKA. Microsoft Visual Studio lets some information**\nregarding the user who compiles the source code into binary. These information are reported\ninto .csproj file used to configure the environment settings for compiling and linking time. The\nfollowing image shows the the username used to compile the project.\n\n\n-----\n\nUsername used to compile the VS Project\n\n**Configurable** **settings: Keys and More. Instead of getting configuration files from external**\nresources the builder (acting as a server) needs to be configured introducing configuration\nstrings directly on the source code. It looks like the builder is made for advanced users only\n(maybe internal usage and not for affiliate?).\n\n\n-----\n\nConfiguration Strings\n\n**Ransomware name: Paradise. Strings and configuration takes the analyst to believe this**\nbuilder is really the Paradise builder even from an inside perspective.\n\n**Paradise email notification**\n\n\n-----\n\nIn memory **name:** `dp_main . Even if you run Paradise Ransomware with different`\nconfiguration name, the system would add a `dp_main in the running environment memory.`\nIndeed the sample count on such a string in order to understand how many parallel processes\nare running\n\nChecking in memory\nBeside the “quick findings” it would be interesting to check used practices and Ransomware\ncharacteristics. One of the first characteristics is in the persistence method. While the “Autorun” is\nquite simple and very abused the Paradise ransomware seems to copy itself in a specific directory\nnamed `DP (under the romantic` `appdata service directory) and looks like it names the Paradise`\nRansomware always in the same way, uncaring about configuration settings. The name is\n```\nDP_Main.exe as showed in the code below.\n\n```\n\n-----\n\nPersistence and Executable Name.\nShadow copies deletion is quite a standard practice for successfully ransomware. Even in this case\nthe action is quite standard, by running the following command in a cmd.exe: `ProcessStartInfo`\n```\npsiOpt = new ProcessStartInfo(@\"cmd.exe\", @\"/C sc delete VSS\");\n\n```\nInteresting and quite characteristic the way Paradise Ransomware does check-in into its command\nand control system. From this function it would be possible to serialize a network detection rule\n(even if would be quite general, so pay attention to false positives in case you are going to\nimplement it ) such as: `/api/Encrypted.php .`\n\nCheck-in function\nOne of the most interesting piece of code (at least in my personal point of view) is in the way the\nsample manage encryption keys. Getting into details, what moves my interest starts from the main\nfunction at line `718 which I report following.`\n\n\n-----\n\nInteresting characteristic: `SavePrivateKey`\nIn other words if in the systems (host) there is no keys, Paradise Ransomware generates them and\nsave both of them on the local machine ! Unfortunately the process to save private keys to HD does\nit well by encrypting them, but … there is still something to do here (bu I’m not going to stress out\nthis pint out). Most interesting for the analysis is the process that uses this Ransomware to deal with\nkeys. The following image shows the function named `SavePrivateKey, which actually does not`\nwhat you aspect to do.\n\n\n-----\n\nSave Private Key\nIn `SavePrivateKey the attacker actually saves a combination between encrypted(private) key and`\npublic RSA key as shown in the previous image. Indeed it then calls a new function named\n```\nSavekeysToFiles which saves them into a unique files called DecryptionInfo.auth . Finally\n\n```\none more interesting characteristic is in the way Paradise encrypts files. A questionable choice by\nMalware author is the ability to encrypt “only” the first 10MB of big files. If the files are smaller it\ndivides file in 117 bytes and loops over them.\n\n\n-----\n\nEncryption Loop\n\n**IoC**\n\nOne-Time\nMonthly\n\n**Make a one-time donation**\n\n**Make a monthly donation**\n\nChoose an amount\n\n$1.00\n$5.00\n$10.00\n$5.00\n$15.00\n$100.00\n\nIf you think this content is helpful, please consider to make a little donation. It would help me in\nbuilding and writing additional contributions to community. By donation you will contribute to\ncommunity as well. Thank you !\n\nIf you think this content is helpful, please consider to make a little donation. It would help me in\nbuilding and writing additional contributions to community. By donation you will contribute to\ncommunity as well. Thank you !\n\n[DonateDonate monthly](https://subscribe.wordpress.com/memberships/?blog=155480246&plan=10519&lang=en_US&pid=10196&redirect=https%3A%2F%2Fmarcoramilli.com%2F2021%2F08%2F23%2Fparadise-ransomware-the-builder)\nFollowing the analyzed files composing the leaked codebase.\n\n**SHA256** **Name**\n\n753f1e353ad0eb75555f81e090a3e89339d96266f5e33e2ada34c9ea655dcee9 AssemblyInfo.cs\n\n\n-----\n\ne375edc127182453ad7ed84ae3abac3759dded7265284af48015a165e439f26c DP_Builder.csproj\n\n0dfb6a940a583432f21ce03634c0e8d6a9030443e391cf44f9581212716d4308 DP_Builder.sln\n\n363a99b2480c11b9431c046d44b323807e9b11bf237cc291dde11151d8b75581 MainForm.cs\n\n5eb2c22d092f3bf2077d7e9128c38c1bc29fd0b06479646c05afb0bf741891dc MainForm.resx\n\nf282d765bb83d76be318a2a982605d06619da2376165ba12cc6ca4e50aa0754d Program.cs\n\na1428e2c84c3420a0481e524e103db7fde84d2107bd02738349c48ee4d6a5353 Resources.cs\n\ne9ae7a5837b34b65608964e7315450a3459e0e01366769b68b904504a55db102 Resources.resx\n\n07958ee0ed74c8e4637d0903d686e66e7bd9e6b89bca0d3df4531d590c848a05 Settings.cs\n\nMain Sourcecode Files\n\n**Conclusions**\n\nEvery code owns specific characteristics, every Malware Author makes decisions and such decision\nreflect in the way they write source code. Analyzing Malware source code lets us the ability to\ncompare style and design patterns. Today in my quick Paradise Ransomware source code analysis\nI highlighted only few of the many characteristics that could be observed by reading someone else’s\ncode. I believe that sharing this information would be useful to everybody working in cyber defense\nsphere.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-23 - Paradise Ransomware- The Builder.pdf"
    ],
    "report_names": [
        "2021-08-23 - Paradise Ransomware- The Builder.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535530,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653760510,
    "ts_modification_date": 1653760510,
    "files": {
        "pdf": "https://archive.orkl.eu/c26d505fc2124036eda3d3bd7b57c401c2f0950a.pdf",
        "text": "https://archive.orkl.eu/c26d505fc2124036eda3d3bd7b57c401c2f0950a.txt",
        "img": "https://archive.orkl.eu/c26d505fc2124036eda3d3bd7b57c401c2f0950a.jpg"
    }
}