{
    "id": "95187f4e-3051-42c9-911c-216041005b8f",
    "created_at": "2023-01-12T15:05:27.075526Z",
    "updated_at": "2025-03-27T02:05:50.812679Z",
    "deleted_at": null,
    "sha1_hash": "a88ee6903d3c218f3ca1ee996504e5ce9860ab08",
    "title": "2017-06-29 - NonPetya- no evidence it was a -smokescreen-",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:31Z",
    "file_modification_date": "2022-05-28T01:59:31Z",
    "file_size": 53885,
    "plain_text": "# NonPetya: no evidence it was a \"smokescreen\"\n\n**[blog.erratasec.com/2017/06/nonpetya-no-evidence-it-was-smokescreen.html](http://blog.erratasec.com/2017/06/nonpetya-no-evidence-it-was-smokescreen.html)**\n\nMany well-regarded experts claim that the not-Petya ransomware wasn't \"ransomware\" at all,\nbut a \"wiper\" whose goal was to destroy files, without any intent at letting victims recover\ntheir files. I want to point out that there is no real evidence of this.\n\nCertainly, things look suspicious. For one thing, it certainly targeted the Ukraine. For another\nthing, it made several mistakes that prevent them from ever decrypting drives. Their email\naccount was shutdown, and it corrupts the boot sector.\n\nBut these things aren't evidence, they are problems. They are things needing explanation,\nnot things that support our preferred conspiracy theory.\n\nThe simplest, Occam's Razor explanation explanation is that they were simple mistakes.\nSuch mistakes are common among ransomware. We think of virus writers as professional\nsoftware developers who thoroughly test their code. Decades of evidence show the opposite,\nthat such software is of poor quality with shockingly bad bugs.\n\nIt's true that effectively, nPetya is a wiper. Matthieu Suiche does [a great job describing one](https://blog.comae.io/petya-2017-is-a-wiper-not-a-ransomware-9ea1d8961d3b)\n[flaw that prevents it working. @hasherezade does a](https://twitter.com/Hasherezade) [great job explaining another flaw. But](https://blog.malwarebytes.com/threat-analysis/2017/06/eternalpetya-lost-salsa20-key/)\nbest explanation isn't that this is intentional. Even if these bugs didn't exist, it'd still be a wiper\nif the perpetrators simply ignored the decryption requests. They need not intentionally make\nthe decryption fail.\n\nThus, the simpler explanation is that it's simply a bug. Ransomware authors test the bits they\ncare about, and test less well the bits they don't. It's quite plausible to believe that just before\nshipping the code, they'd add a few extra features, and forget to regression test the entire\nsuite. I mean, I do that all the time with my code.\n\nSome have pointed to the sophistication of the code as proof that such simple errors are\nunlikely. This isn't true. While it's more sophisticated than WannaCry, it's about average for\nthe current state-of-the-art for ransomware in general. What people think of, such the Petya\nbase, or using PsExec to spread throughout a Windows domain, is already at least a year\nold.\n\nIndeed, the use of PsExec itself is a bit clumsy, when the code for doing the same thing is\nalready public. It's just a few calls to basic Windows networking APIs. A sophisticated virus\nwould do this itself, rather than clumsily use PsExec.\n\nInfamy doesn't mean skill. People keep making the mistake that the more widespread\nsomething is in the news, the more skill, the more of a \"conspiracy\" there must be behind it.\nThis is not true Virus/worm writers often do newsworthy things by accident Indeed the\n\n\n-----\n\nhistory of worms, starting with the Morris Worm, has been things running out of control more\nthan the author's expectations.\n\nWhat makes nPetya newsworthy isn't the EternalBlue exploit or the wiper feature. Instead,\nthe creators got lucky with MeDoc. The software is used by every major organization in the\nUkraine, and at the same time, their website was horribly insecure -- laughably insecure.\nFurthermore, it's autoupdate feature didn't check cryptographic signatures. No hacker can\nplan for this level of widespread incompetence -- it's just extreme luck.\n\nThus, the effect of bumbling around is something that hit the Ukraine pretty hard, but it's not\nnecessarily the intent of the creators. It's like how the Slammer worm hit South Korea pretty\nhard, or how the Witty worm hit the DoD pretty hard. These things look \"targeted\", especially\n[to the victims, but it was by pure chance (provably so, in the case of Witty).](http://blog.erratasec.com/2014/03/witty-worm-no-seed-population-involved.html)\n\nCertainly, MeDoc was targeted. But then, targeting a single organization is the norm for\nransomware. They have to do it that way, giving each target a different Bitcoin address for\npayment. That it then spread to the entire Ukraine, and further, is the sort of thing that\ntypically surprises worm writers.\n\nFinally, there's little reason to believe that there needs to be a \"smokescreen\". Russian\nhackers are targeting the Ukraine all the time. Whether Russian hackers are to blame for\n\"ransomware\" vs. \"wiper\" makes little difference.\n\n**Conclusion**\n\nWe know that Russian hackers are constantly targeting the Ukraine. Therefore, the theory\nthat this was nPetya's goal all along, to destroy Ukraines computers, is a good one.\n\nYet, there's no actual \"evidence\" of this. nPetya's issues are just as easily explained by\nnormal software bugs. The smokescreen isn't needed. The boot record bug isn't needed.\nThe single email address that was shutdown isn't significant, since half of all ransomware\nuses the same technique.\n\nThe experts who disagree with me are really smart/experienced people who you should\ngenerally trust. It's just that I can't see their evidence.\n\n**[Update: I wrote another blogpost about \"survivorship bias\", refuting the claim by many](http://blog.erratasec.com/2017/07/yet-more-reasons-to-disagree-with.html)**\nexperts talking about the sophistication of the spreading feature.\n\n**Update: comment asks \"why is there no Internet spreading code?\". The answer is \"I don't**\nknow\", but unanswerable questions aren't evidence of a conspiracy. \"What aren't there any\nstars in the background?\" isn't proof the moon landings are fake, such because you can't\n\n\n-----\n\nanswer the question. One guess is that you never want ransomware to spread that far, until\nyou've figured out how to get payment from so many people.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-06-29 - NonPetya- no evidence it was a -smokescreen-.pdf"
    ],
    "report_names": [
        "2017-06-29 - NonPetya- no evidence it was a -smokescreen-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535927,
    "ts_updated_at": 1743041150,
    "ts_creation_date": 1653703171,
    "ts_modification_date": 1653703171,
    "files": {
        "pdf": "https://archive.orkl.eu/a88ee6903d3c218f3ca1ee996504e5ce9860ab08.pdf",
        "text": "https://archive.orkl.eu/a88ee6903d3c218f3ca1ee996504e5ce9860ab08.txt",
        "img": "https://archive.orkl.eu/a88ee6903d3c218f3ca1ee996504e5ce9860ab08.jpg"
    }
}