{
    "id": "951b3d26-0047-4dbd-b806-742cb92974b2",
    "created_at": "2023-01-12T15:09:46.772946Z",
    "updated_at": "2025-03-27T02:05:45.780014Z",
    "deleted_at": null,
    "sha1_hash": "caf1557a7407525cc59bffd9f21a16c3a7bcbc7e",
    "title": "2017-06-29 - EternalPetya and the lost Salsa20 key",
    "authors": "",
    "file_creation_date": "2022-05-28T04:56:33Z",
    "file_modification_date": "2022-05-28T04:56:33Z",
    "file_size": 292264,
    "plain_text": "# EternalPetya and the lost Salsa20 key\n\n**[blog.malwarebytes.com/threat-analysis/2017/06/eternalpetya-lost-salsa20-key/](https://blog.malwarebytes.com/threat-analysis/2017/06/eternalpetya-lost-salsa20-key/)**\n\nMalwarebytes Labs June 29, 2017\n\n[We have recently been facing a huge outbreak of a new Petya-like malware armed with an](https://blog.malwarebytes.com/cybercrime/2017/06/petya-esque-ransomware-is-spreading-across-the-world/)\ninfector similar to WannaCry. The research is still in progress, and the full report will be\npublished soon.\n\nIn this post, we will focus on some new important aspects of the current malware. The low[level attack works in the same style as the first Petya, described here. As before, the](https://blog.malwarebytes.com/threat-analysis/2016/04/petya-ransomware/)\nbeginning of the disk is overwritten by the malicious Petya kernel and bootloader. When the\n[malicious kernel is booted, it encrypts the Master File Table with Salsa20 and in this way,](https://en.wikipedia.org/wiki/NTFS#Master_File_Table)\nmakes the disk inaccessible.\n\nThe code from Petya’s kernel didn’t change much, but the new logic implemented in the\nhigh-level part (the Windows executable) caused the change in the malware’s mission. In the\npast, after paying the ransom, the Salsa key from the victim was restored and with its help,\n[the Petya kernel was able to decrypt the Master File Table. Now, the necessary key seems to](https://en.wikipedia.org/wiki/NTFS#Master_File_Table)\nbe lost for eternity. Thus, the malware appears to have only damaging intentions.\n\nLet’s have a look at the implementation and discuss the details.\n\nAnalyzed sample:\n\n\n-----\n\n[71b6a493388e7d0b40c83ce903bc6b04 – the main DLL](https://www.virustotal.com/en/file/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745/analysis/)\n\n[f3471d609077479891218b0f93a77ceb – the low level part (Petya bootloader +](https://virustotal.com/en/file/b5d2ad3c7758f58aa329243af4ce4a906771a1a199210ed0c61f82d47edb3b1d/analysis/1498584989/)\nkernel)\n\n**[UPDATE]** **[A small bug in the Salsa20 implementation has been found. Unfortunately,](https://twitter.com/hasherezade/status/881846324437581824)**\n**it is not significant enough to help restoring the key.**\n\n## How is the disk encrypted?\n\n[The low level attack affecting the Master File Table hasn’t changed since Goldeneye. It is](https://en.wikipedia.org/wiki/NTFS#Master_File_Table)\nexecuted by the Petya kernel.\n\nThe [Salsa20 algorithm that was implemented incorrectly in the early versions of Petya and](https://en.wikipedia.org/wiki/Salsa20)\n[caused it to be cracked has been fixed in version 3 (read more here). Now it looks almost the](https://blog.malwarebytes.com/threat-analysis/2016/07/third-time-unlucky-improved-petya-is-out/)\nsame as in Goldeneye (that was the 4th step in the evolution) and it does not seem to have\n[any significant bugs. Thus, once the data is encrypted, having the valid key is the only way to](https://twitter.com/hasherezade/status/881855440275070981)\nrestore it.\n\nHere’s a comparison of the changes in the code between the current version and the\nGoldeneye one.\n\n\n-----\n\nLooking inside the code, we can see that the significant changes have been made only to the\nelements responsible for displaying the screen with information.\n\n\n-----\n\nAnother subtle, yet interesting change is in the Salsa20 key expansion function. Although the\nSalsa20 algorithm itself was not altered, there is one keyword that got changed in\ncomparison to the original version. This is the fragment of the current sample’s code:\n\n\n-----\n\nAnd this is a corresponding fragment from Goldeneye:\n\n[Instead of the keyword typical for Salsa20 (“expand32-byte k“) we’ve got something custom:](https://github.com/alexwebr/salsa20/blob/master/salsa20.c#L121)\n“-1nvald s3ct-id” (that can be interpreted as: “invalid sector id”). As we confirmed, the change\nof this keyword does not affect the strength of the crypto. However, it may be treated as a\nmessage about the real intentions of the attackers.\n\n## How is the Salsa key generated?\n\n\n-----\n\nGenerating the Salsa key and the nonce, as before, is done by the PE file (in the higher level\nof the infector), inside the function that is preparing the stub to be written on the disk\nbeginning.\n\nIn all versions of Petya, a secure random generator was used. We can find it in the current\nversion as well—it uses CryptGenRandom.\n\n\n-----\n\nThe generated Salsa key and nonce are stored in the dedicated sector for further use by the\nkernel during encryption.\n\nExample of the stored data:\n\nThe byte at the offset 0x4000 is the flag: 0 means that the disk is not encrypted yet, 1 means\nencrypted.\n\nFrom the offset 0x4001, the Salsa20 key starts. It is 32 bytes long. After that, at offset\n0x4021 there is the random Salsa20 nonce.\n\n\n-----\n\n## What happens with the Salsa key after the encryption?\n\nAfter being read and used for the encrypting algorithm, the stored Salsa key is erased from\nthe disk. You can see the comparison of the disk image before and after the encryption\nphase.\n\nAs you can see, after use the key is erased.\n\n## What is the relationship between the victim ID and the Salsa key?\n\nIn the previous versions of Petya, the victim ID was, in fact, the victim’s Salsa20 key,\nencrypted with the attacker’s public key and converted to Base58 string. So, although the\nSalsa key is erased from the disk, a backup was still there, accessible only to the attackers,\nwho had the private key to decrypt it.\n\nNow, it is no longer true. The victim ID is generated randomly, BEFORE the random Salsa\nkey is even made. So, in the current version, the relationship of the Salsa key and the victim\nID is none. The victim ID is just trash. You can see the process of generating it on the video.\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/LS0nWpRfVs8\n\nAfter the reboot from the infected disk, we can confirm that the random string generated\nbefore Salsa key and nonce is the same as the one displayed on the screen as the victim ID\n(“personal installation key”):\n\n## Conclusion\n\n\n-----\n\nAccording to our current knowledge, the malware is intentionally corrupt in a way that the\nSalsa key was never meant to be restored. Nevertheless, it is still effective in making people\npay ransom. We have observed that new payments are being made to the bitcoin account.\nYou can see the link to the bitcoin address here:\n[https://blockchain.info/address/1Mz7153HMuxXTuR2R1t78mGSdzaAtNbBWX](https://blockchain.info/address/1Mz7153HMuxXTuR2R1t78mGSdzaAtNbBWX)\n\nIf you are a victim of this malware and you are thinking about paying the ransom, we warn\nyou: Don’t do this. It is a scam and you will most probably never get your data back.\n\nWe will keep you posted with the updates about our findings.\n\n## Appendix\n\n[Microsoft’s report about the new version of Petya](https://blogs.technet.microsoft.com/mmpc/2017/06/27/new-ransomware-old-techniques-petya-adds-worm-capabilities/)\n\nAbout the original version (Goldeneye):\n\n[Goldeneye Ransomware – the Petya/Mischa combo rebranded](https://blog.malwarebytes.com/threat-analysis/2016/12/goldeneye-ransomware-the-petyamischa-combo-rebranded/)\n\nThis video cannot be displayed because your Functional Cookies are currently disabled.\n[To enable them, please visit our privacy policy and search for the Cookies section. Select](https://www.malwarebytes.com/privacy/#how-we-collect-information)\n_“Click Here” to open the Privacy Preference Center and select “Functional Cookies” in the_\nmenu. You can switch the tab back to “Active” or disable by moving the tab to “Inactive.”\nClick “Save Settings.”\n\n_This was a guest post written by Hasherezade, an independent researcher and programmer_\n_with a strong interest in InfoSec. She loves going in details about malware and sharing threat_\n_[information with the community. Check her out on Twitter @hasherezade and her personal](https://twitter.com/hasherezade)_\n_[blog: https://hshrzd.wordpress.com.](https://hshrzd.wordpress.com/)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-06-29 - EternalPetya and the lost Salsa20 key.pdf"
    ],
    "report_names": [
        "2017-06-29 - EternalPetya and the lost Salsa20 key.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536186,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653713793,
    "ts_modification_date": 1653713793,
    "files": {
        "pdf": "https://archive.orkl.eu/caf1557a7407525cc59bffd9f21a16c3a7bcbc7e.pdf",
        "text": "https://archive.orkl.eu/caf1557a7407525cc59bffd9f21a16c3a7bcbc7e.txt",
        "img": "https://archive.orkl.eu/caf1557a7407525cc59bffd9f21a16c3a7bcbc7e.jpg"
    }
}