{
    "id": "9521f233-f2d4-4070-9a14-3c70a8178946",
    "created_at": "2022-10-25T16:48:25.098785Z",
    "updated_at": "2025-03-27T02:09:30.234021Z",
    "deleted_at": null,
    "sha1_hash": "e14eca4829dd80072ee2e2bdb1e5c5abadc118d7",
    "title": "Microsoft Word - [1] Complaint.docx",
    "authors": "",
    "file_creation_date": "2021-12-01T16:36:34Z",
    "file_modification_date": "2021-12-01T16:36:34Z",
    "file_size": 1903458,
    "plain_text": "**UNITED STATES DISTRICT COURT**\n**FOR THE SOUTHERN DISTRICT OF NEW YORK**\n\nGOOGLE LLC,\n\n_Plaintiff,_\n\n\nv.\n\nDMITRY STAROVIKOV;\nALEXANDER FILIPPOV;\nand Does 1-15,\n\n_Defendants._\n\n\nCivil Action No.\n\n**FILED UNDER SEAL**\n\n\n**COMPLAINT FOR DAMAGES AND INJUNCTIVE RELIEF**\n\n\n-----\n\nPlaintiff Google LLC (“Google”) for its Complaint against the Defendants listed\n\nbelow alleges as follows:\n\n**INTRODUCTION**\n\n1. Defendants are Russian cybercriminals who have silently infiltrated\n\nmore than a million computers and other devices around the globe to create a\n\nnetwork—the Glupteba “botnet”—to use for illicit purposes, including the theft and\n\nunauthorized use of Google users’ login and account information. Defendants use the\n\nGlupteba botnet to further a range of cybercrimes and to conceal criminal conduct.\n\nAnd at any moment, the power of the Glupteba botnet could be leveraged for use in a\n\npowerful ransomware[1] or distributed denial-of-service (“DDoS”) attack.[2]\n\n2. The Glupteba botnet is distinguished from conventional botnets in its\n\ntechnical sophistication: unlike other botnets, the Glupteba botnet leverages\n\nblockchain technology to protect itself from disruption.\n\n3. Defendants Dmitry Starovikov, Alexander Filippov, and other unknown\n\nindividuals work in concert to grow, control, and profit from the Glupteba botnet.\n\nDefendants and their criminal enterprise (hereinafter referred to as the “Glupteba\n\nEnterprise” or the “Enterprise”) represent a modern technological and borderless\n\nincarnation of organized crime. The Glupteba Enterprise operates through a network\n\n1 Ransomware is an increasingly common type of malicious software (“malware”) that\nis designed to block access to all or part of a computer system until a sum of money\nis paid.\n\n2 A DDoS attack occurs when multiple internet-connected devices are directed to\ncollectively overwhelm the bandwidth of a particular website or system for the\npurpose of taking that website or system offline.\n\n\n-----\n\nof individuals and organizations that, together, engage in and profit from a pattern\n\nof criminal racketeering conduct.\n\n4. The Glupteba Enterprise uses its illicit access to devices infected with\n\nGlupteba malware to further numerous criminal schemes, including:\n\na. **Stolen Accounts Scheme:** Stealing personal account information\n\n(including Google and other account login information) from infected\n\ndevices and selling to third parties access and use of the stolen accounts\n\nthrough virtual machines preloaded with those accounts;\n\nb. **Credit Card Fraud Scheme:** Selling credit cards for fraudulent\n\npurchases from Google. These credit cards pass technical authorization\n\nchecks but have insufficient funds to pay for the services or goods purchased\n\nfor use in connection with the Stolen Accounts Scheme, resulting in the\n\npurchase of ads or services from Google (and other web-based companies)\n\nfor which payment is not made;\n\nc. **Disruptive Ad Scheme: Selling the placement of disruptive ads (e.g., pop-**\n\nup ads in videos) on infected devices whose victim owners are unwitting to\n\nthe scheme;\n\nd. **Proxy Scheme: Selling unauthorized access to victims’ infected devices**\n\nfor use as “residential proxies,” which, unbeknownst to the victims, are\n\nexploited by cybercriminals to conceal their location and internet protocol\n\n(“IP”) address while committing other crimes;\n\n\n-----\n\ne. **Cryptojacking Scheme:** Hijacking (or “cryptojacking”) the computing\n\npower of infected devices to generate cryptocurrency for the Glupteba\n\nEnterprise’s financial gain.\n\n5. The Glupteba Enterprise is responsible for causing significant harm to\n\nGoogle, Google users, the owners of infected devices, and countless other entities and\n\nindividuals.\n\n6. The Glupteba Enterprise causes financial harm to Google, interferes\n\nwith Google’s relationships with its users (and potential users), harms Google’s\n\nreputation, impairs the value of Google’s trademarks, and forces Google to devote\n\nsubstantial resources to combat the Enterprise’s harmful activity.\n\n7. Google brings this action under the Racketeer Influenced and Corrupt\n\nOrganizations Act (“RICO”), Computer Fraud and Abuse Act, Electronic\n\nCommunications Privacy Act, Lanham Act, and New York law, against Defendants’\n\ncriminal enterprise to disrupt the Glupteba botnet, to prevent it from causing further\n\nharm, and to recover damages.\n\n**PARTIES**\n\n**Plaintiff**\n\n8. Plaintiff Google LLC (“Google”) is a Delaware limited liability company\n\nwith its principal place of business at 1600 Amphitheatre Parkway in Mountain View,\n\nCalifornia.\n\n9. Google is a leading technology company that offers a wide variety of\n\nservices to organize the world’s information and make it universally accessible and\n\nuseful. Its search engine, accessible at www.google.com, is the largest, most effective,\n\n\n-----\n\nand widely used internet search service in the world. Gmail, a free email service used\n\nby more than 1.5 billion people worldwide, includes a variety of revolutionary and\n\ninnovative features, including an industry-leading two full gigabytes of email storage;\n\nemail message threading; fast, precise search of emails using an integrated Google\n\nsearch engine; and freedom from pop-up or irrelevant advertising. Google also offers\n\nYouTube, an online video sharing platform that millions of people use to share and\n\nwatch videos each day.\n\n10. Google operates numerous products, platforms, and services, several of\n\nwhich are core to its business and relevant here:\n\na. **Android: Android is an operating system that is designed to run on**\n\nmobile devices, such as smartphones or tablets.\n\nb. **Chrome: Chrome is a web browser that runs on various operating**\n\nsystems, including on personal computers, smartphones, and tablets.\n\nc. **Gmail: Gmail is an email service that is hosted on Google’s servers.**\n\nd. **Google Drive: Google Drive is a file storage service that allows users**\n\nto host and share files in various formats on Google’s servers. These\n\nfiles can be created, accessed, and edited remotely.\n\ne. **Google Search: Google Search is an internet-based search engine that**\n\nallows users to search for publicly accessible documents and websites\n\nindexed by Google’s servers.\n\nf. **Google Workspace: Google Workspace is a cloud-based suite of**\n\nproductivity and collaboration tools for businesses. This service\n\n\n-----\n\nprovides businesses with custom email accounts with integrated\n\ncollaboration tools, including Gmail, Google Calendar, Google Meet,\n\nGoogle Chat, Google Drive, Google Docs, Google Sheets, Google Slides,\n\nGoogle Forms, and Google Sites.\n\ng. **YouTube: YouTube is an online video sharing platform.**\n\nh. **Google Ads: Google Ads is an online advertising platform through**\n\nwhich advertisers can publish advertisements on various Google\n\nplatforms including, for example, Google Search and YouTube.\n\n11. Google strives to provide its users worldwide with safe and secure\n\nplatforms. Google has therefore invested substantial resources to identify,\n\nunderstand, and ultimately disrupt harmful malware such as the Glupteba botnet.\n\n12. Google supports its businesses in part through revenue generated by its\n\nmany advertising products, all geared toward delivering relevant ads and providing\n\nconsumers with useful commercial information. Google’s broad suite of advertising\n\nand analytics tools help millions of companies grow their businesses every day.\n\n13. Google constantly invests in and improves its advertising programs.\n\nToday, Google Ads is a world-class ad technology platform for advertisers, agencies,\n\nand publishers to power their digital marketing or monetization. A core focus of the\n\nproduct is serving relevant ads at the right time in a non-intrusive manner, and\n\nensuring advertisers have effective tools to target and measure the effectiveness of\n\ntheir ad campaigns.\n\n\n-----\n\n14. Google has allocated, and continues to allocate, substantial resources to\n\nrestricting fraudulent ads and protecting users on the web. These include, among\n\nother things, filtering out invalid traffic, removing bad actors and billions of improper\n\nads from Google systems every year, and closely monitoring the sites, apps, and\n\nvideos where ads appear to ensure that ads do not fund bad content.[3]\n\n**Defendants**\n\n15. The defendants listed in paragraphs 16 and 17 are individuals who have\n\nconspired to engage in a pattern of racketeering activity. They each have participated\n\nin the operation or management of the Glupteba Enterprise and have engaged in\n\ncriminal acts causing harm to Google and countless others.\n\n16. Defendant Dmitry Starovikov is an individual who resides in Russia.\n\n17. Defendant Alexander Filippov is an individual who resides in Russia.\n\n18. Plaintiff does not know the true names and capacities of the Doe\n\nDefendants sued as Does 1 through 15, and therefore sues these defendants by such\n\nfictitious names. Each of the Doe defendants is responsible in some manner for the\n\nconduct alleged, having agreed to become part of the Glupteba Enterprise.\n\n3 In 2020, Google disabled 1.7 million advertiser accounts and removed roughly 3.1\nbillion ads for violating its policies, including 867 million ads that abused the ad\nnetwork by attempting to evade Google’s detection systems and lure users off Google’s\nplatforms with an aim to defraud them. Scott Spencer, Our Annual Ads Safety\nReport, Google Ads & Commerce Blog (Mar. 17, 2021),\nhttps://blog.google/products/ads-commerce/ads-safety-report-2020.\n\n\n-----\n\n**JURISDICTION AND VENUE**\n\n19. This Court has federal-question jurisdiction over Google’s claims under\n\nRICO, the Computer Fraud and Abuse Act, the Electronic Communications Privacy\n\nAct, and the Lanham Act under 28 U.S.C. § 1331. This Court also has jurisdiction\n\nover the Lanham Act and related state and common law unfair competition claims\n\nunder 28 U.S.C. § 1338, and 15 U.S.C. § 1121. This Court has supplemental\n\njurisdiction over the state-law claims under 28 U.S.C. § 1367.\n\n20. Defendants are subject to personal jurisdiction in this district, and the\n\nexercise of jurisdiction over Defendants is proper pursuant to 18 U.S.C. § 1965 and\n\nN.Y. C.P.L.R. §§ 301 and 302. Defendants have transacted business and engaged in\n\ntortious conduct in the United States and in New York which gives rise in part to\n\nGoogle’s claims. Defendants also have engaged in intentional, wrongful, illegal,\n\nand/or tortious acts, the effects of which Defendants knew and intended would be felt\n\nin the United States and New York. Among other things, Defendants have\n\nintentionally caused Glupteba malware to be downloaded on victims’ machines in this\n\ndistrict, in New York, and throughout the United States; have intentionally directed\n\nvictims’ machines in this district, in New York, and throughout the United States to\n\nparticipate in intentional, wrongful, illegal, and/or tortious acts; and have directed\n\nmultiple forms of communication to co-conspirators in the United States for the\n\npurpose of planning and carrying out their conspiracy and fraud. Defendants were\n\naware of the effects in the United States and New York of those acts; the activities of\n\ntheir co-conspirators and agents were to the benefit of Defendants; and their co\n\n-----\n\nconspirators and agents were working at the direction, under the control, at the\n\nrequest, and/or on behalf of Defendants in committing those acts.\n\n21. Venue is proper in this judicial district under 28 U.S.C. § 1391(c)\n\nbecause Defendants are not residents of the United States and may be sued in any\n\njudicial district. Venue is also proper in this judicial district under 28 U.S.C.\n\n§ 1391(b) and 18 U.S.C. § 1965 because a substantial part of the events or omissions\n\ngiving rise to Google’s claims occurred in this judicial district, because a substantial\n\npart of the property that is the subject of Google’s claims is situated in this judicial\n\ndistrict, because a substantial part of the harm caused by Defendants has occurred\n\nin this judicial district, and because Defendants transact their affairs in this judicial\n\ndistrict. Defendants engage in conduct availing themselves of the privilege of\n\nconducting business in New York, and utilize instrumentalities located in this judicial\n\ndistrict to carry out acts alleged herein.\n\n22. Defendants have affirmatively directed actions at New York and the\n\nSouthern District of New York by directing their activities, including theft of funds,\n\nhardware, and information, at individual computer users located in the Southern\n\nDistrict of New York. Defendants have directed malicious computer code at the\n\ncomputers of individual users located in New York and the Southern District of New\n\nYork. Defendants have attempted to and, in fact, have infected such user computers\n\nwith malicious computer code.\n\n\n-----\n\n**FACTUAL ALLEGATIONS**\n\n**_Botnets_**\n\n23. Most botnets spread through a simple malware download. “Malware” is\n\n“malicious software” that is generally designed to damage, destroy, disrupt, or steal\n\ndata from a computer system.\n\n24. Most users of a computer or other device install malware inadvertently.\n\nFor example, the user is encouraged to click on a link, interact with an online\n\nadvertisement, or open an attachment to an email, and unknowingly triggers the\n\ndownload and installation of the malware on the user’s device. In colloquial terms,\n\nthe device is then infected with a computer virus.\n\n25. A “bot” (short for “robot”) is a computer or device that is infected by\n\nmalware and that can be tasked to conduct specific activities.\n\n26. A “botnet” is a network of internet-connected devices (bots), each of\n\nwhich are infected by malware. The botnet is controlled by “command-and-control”\n\n(“C2”) servers, which can instruct the devices comprising the botnet to perform any\n\nnumber of disruptive or even criminal tasks. The C2 servers typically are controlled\n\nremotely by individual operators, referred to as “bot controllers.”\n\n27. The botnet’s computing power grows with each new device that is\n\ninfected. Thus, depending on the volume of devices comprising the botnet, the bot\n\ncontrollers can marshal an astonishing amount of computing power to commit\n\ncybercrimes. For example, botnets can be used to orchestrate DDoS attacks, in which\n\nnumerous computers (without the owners’ knowledge) simultaneously send requests\n\n\n-----\n\nto a single website or resource. The attack can overwhelm the target, rendering the\n\nwebsite or other internet-based service unusable.\n\n28. Botnets also can be programmed to steal personal information, financial\n\ninformation, usernames, and passwords from infected devices. They can send emails\n\nwithout the owner of the infected device’s knowledge or consent. They can “proxy” or\n\n“relay” internet communications to mask the location of bad actors, thereby\n\nconcealing and facilitating criminal conduct. They can send additional malware to\n\ninfect other computers. And they can act as a vector to spread ransomware or\n\npropaganda, including to interfere with elections or influence public policy. In other\n\nwords, botnets are both powerful and flexible tools to commit cybercrimes.\n\n**_The Glupteba Botnet_**\n\n29. Cybersecurity experts first noticed Glupteba malware in 2011, when it\n\nwas primarily associated with a spam campaign. In recent years, however, the spread\n\nof Glupteba malware has increased substantially and the botnet has become\n\nmarkedly more dangerous. Google estimates that it has infected more than one\n\nmillion computers and other devices.\n\n30. In the summer of 2020, Google determined that Glupteba malware was\n\nbeing disseminated on numerous third-party software download sites, online movie\n\nstreaming sites, and video downloader sites, often advertised as “free downloads.”\n\n31. Glupteba malware masquerades as free, downloadable software, videos,\n\nor movies (“freeware”) and infects a device when a user clicks on a link to the\n\n\n-----\n\nfreeware. For example, users who click on a link looking to download a free game\n\ninstead unknowingly download and install Glupteba malware.\n\n32. The Glupteba Enterprise and its agents distribute these links through\n\npay-per-install arrangements by which the Enterprise pays its agents for each\n\nsuccessful installation of the malware. The Enterprise and its agents abuse well\nestablished and famous trademarks in order to capture consumers’ attention and\n\ntrick them into believing that the trademarks represent trusted brands. These abuse\n\ncampaigns are frequently short-lived and quickly change from one entity to another,\n\nso that the Enterprise stays ahead of trademark owners’ ongoing efforts to stop\n\ninfringement and abuse.\n\n33. For example, as reflected in the image below, the Glupteba Enterprise\n\nunlawfully leveraged a well-known Google mark—YouTube—to help disseminate\n\nGlupteba malware. At the website located at “video-youtube-get.ru,” users were\n\ndeceived, in part due to the use of “youtube” in the domain name and on the landing\n\npage, into believing they were downloading a YouTube video. When users clicked on\n\nthe link to download the video, they unknowingly downloaded and installed Glupteba\n\nmalware on their devices.\n\n\n-----\n\n34. When an unsuspecting victim clicks on one of Glupteba-hosting links,\n\nthe malware is delivered to the victim’s device via “droppers.” Droppers are a type of\n\nTrojan horse virus: they appear as a legitimate application to the user, but once\n\ndownloaded, they deliver malware to the user’s device.\n\n35. Glupteba is a modular malware, meaning that it installs new modules\n\nwith different functionality over time as instructed by the Glupteba Enterprise.\n\n36. The Glupteba botnet uses various domain names[4] that point to IP\n\naddresses that host two different types of servers—content delivery network (“CDN”)\n\nservers and C2 servers—to download and execute the modules. These domain names\n\n4 The domain name is a “pointer” to an IP address where a server is hosted.\n\n\n-----\n\nare hard-coded in the malware and can be refreshed through backdoor functions[5] or\n\nby querying the blockchain, explained infra at paragraphs 41 to 50. Appendix A\n\nlists the known domains[6] and IP addresses used by the Glupteba Enterprise, as well\n\nas the registrars[7] for each domain.\n\n37. Once the Glupteba malware’s main dropper component is installed on a\n\ndevice, the botnet delivers additional modules to that device. Modules are then\n\nexecuted as instructed by the C2 server, which is operated by the Glupteba\n\nEnterprise.\n\n38. The first executed module acts as a scout to detect the security system\n\nin place on the computer (or other device), so that the Glupteba malware can evade\n\ndetection by the device’s owner and antivirus software. It manipulates the owner’s\n\noperating system by hiding the malware’s existence and preventing it from revealing\n\nitself on an infected device’s security logs. The module is designed to circumvent\n\ncybersecurity detection tools, anti-virus software, and system monitoring programs,\n\nincluding security software featured in popular operating systems.\n\n39. The Glupteba Enterprise then uses various other modules to execute its\n\ncriminal schemes, explained infra at paragraphs 51 to 88.\n\n5 Backdoor functions are covert methods of bypassing normal authentication or\nencryption in an internet-connected device.\n\n6 **Appendix A includes domains used for C2 and CDN server communication and**\noperation, as well as domains used for distribution of the Glupteba malware and\ndomains used for the Enterprise’s criminal schemes.\n\n7 Registrars obtain domain rights for their customers from registry services that are\nresponsible for managing domains.\n\n\n-----\n\n40. Once the modules are downloaded to the infected device via the CDN\n\nserver, the C2 server communicates commands to the infected device to control it and\n\nutilize those modules. For example, the C2 server could activate the “steal credentials\n\n_from this device” module or the “use this device for_ _cryptocurrencies_ _mining” module,_\n\ndepending on the Glupteba Enterprise’s plans for the infected device.\n\n**_The Glupteba Botnet Leverages Blockchain Technology_**\n\n41. Unlike conventional botnets, the Glupteba botnet leverages the\n\nblockchain technology used in certain cryptocurrency transactions to protect critical\n\nlines of communication between the C2 servers and the botnet that they direct.\n\n42. Cryptocurrency is a digitized data currency, rather than a physical\n\ncurrency like a coin or a dollar bill, that uses advanced cryptography to secure\n\ntransactions. A particularly well-known form of cryptocurrency is called Bitcoin.\n\nMany cryptocurrencies, including Bitcoin, use blockchain technology as a public,\n\ndistributed ledger to record cryptocurrency transactions. Each time a transaction\n\noccurs, a new entry or “block” of information is created. These blocks are then joined\n\ntogether in a “chain.”\n\n43. Critically, no administrator has control of the cryptocurrency\n\ntransaction information recorded in the blockchain. The transaction information is\n\npermanently recorded and, in many cases, viewable to anyone.\n\n44. People own cryptocurrencies, such as Bitcoin, through digital “wallets,”\n\nwhich are software-based digital payment services or applications that interface with\n\nthe blockchain. Wallets interface with a cryptocurrency’s blockchain and store the\n\n\n-----\n\npublic and private “keys” used to send and receive cryptocurrency. A public key, or\n\n“address,” is akin to a bank account number, and a private key is akin to a PIN or\n\npassword that allows a user the ability to access and transfer value associated with\n\nthe public address and the private key. To conduct transactions on a blockchain, an\n\nindividual must use the public address and the corresponding private key.\n\n45. The blockchain, which is run by the decentralized network for a\n\nparticular cryptocurrency, contains the historical records of every transaction in that\n\ncurrency (the “blocks”). On the Bitcoin blockchain, the public addresses of those\n\nengaging in Bitcoin transactions are recorded, but the identities of the individuals or\n\nentities behind those public addresses are not.\n\n46. A conventional botnet does not use blockchain to maintain lines of\n\ncommunication between C2 servers and infected devices. Rather, in a conventional\n\nbotnet, infected devices are programmed to look for pre-determined domain addresses\n\nthat point to the C2 server. The instructions to locate those domains are hard-coded\n\nin the malware. If the predetermined domains are shut down (by law enforcement or\n\nothers), the infected devices can no longer receive instructions from the C2 servers\n\nand therefore can no longer be operated by the bot controller. For that reason,\n\nconventional botnet operators may utilize thousands of “disposable” domains (using\n\ndomain generation algorithms) to defend against law enforcement action to disrupt\n\nthe botnet.\n\n47. Unlike conventional botnets, the Glupteba botnet does not rely solely on\n\npredetermined domains to ensure its survival. Instead, when the botnet’s C2 server\n\n\n-----\n\nis interrupted, Glupteba malware is hard-coded to “search” the public Bitcoin\n\nblockchain for transactions involving three specific Bitcoin addresses that are\n\ncontrolled by the Glupteba Enterprise. From time to time, the Glupteba Enterprise\n\nexecutes transactions in those addresses, and as part of those transactions, the\n\nGlupteba Enterprise leaves in the blockchain the location of the domain for a back\nup C2 Server.\n\n48. The Glupteba Enterprise provides the C2 server information in an\n\nencrypted code in a transaction-specific message field on the Bitcoin blockchain. The\n\nmessage field is used to communicate messages or data from one Bitcoin address to\n\nanother, similar to a check memo line, or the payment note in a digital payment\n\napplication like Google Pay (e.g., “for groceries”). The domain is either sent as a\n\nstandalone, valueless data transmission, or accompanies a transaction in which funds\n\nare exchanged.\n\n49. Thus, whenever a C2 server is taken offline, Glupteba malware is\n\nprogrammed to locate a replacement C2 server by querying the public blockchain,\n\nidentifying transactions that involve the addresses controlled by the Glupteba\n\nEnterprise, and then decrypting the encrypted code contained in the message field of\n\nthe relevant transaction in order to identify the back-up C2 server.\n\n50. The Glupteba Enterprise’s use of blockchain technology to reinforce its\n\nC2 servers means the Glupteba botnet is particularly difficult to disrupt. Unlike\n\nconventional botnets, which may lose control of infected devices when a C2 server is\n\nshut down, the Glupteba botnet can continue to communicate instructions to its\n\n\n-----\n\ninfected devices even where domains for C2 servers are taken down, because the\n\nmalware in the infected devices instructs the devices to identify a new C2 server by\n\nquerying the blockchain. Thus, the Glupteba botnet cannot be eradicated entirely\n\nwithout neutralizing its blockchain-based infrastructure.\n\n**_Criminal Schemes Perpetrated by the Glupteba Enterprise_**\n\n51. The Glupteba Enterprise carries out several criminal schemes and\n\nfacilitates the criminal schemes of others through its operation of the Glupteba\n\nbotnet.\n\n52. Each criminal scheme generates profits for the Glupteba Enterprise\n\nthrough illegal services. These schemes include: (1) stealing credentials of Google\n\naccounts (and other accounts) from infected devices and using that stolen account\n\ninformation for the Glupteba Enterprise’s benefit, including by selling access to the\n\nstolen account to third parties through virtual machines preloaded with those\n\naccounts, minimizing the likelihood the account owners will detect the scheme, (2)\n\nselling credit cards to third parties to facilitate the fraudulent purchase of Google ads\n\n(and other Google services) that are never paid for, (3) selling the placement of\n\ndisruptive ads on Glupteba-infected mobile devices, (4) selling proxy connections to\n\ninfected devices, and (5) exploiting the processing power of infected devices to “mine”\n\ncryptocurrency.\n\n53. **Stolen Accounts Scheme.** The Glupteba Enterprise harvests data\n\nthat is maintained in internet browsers on infected devices, including data from\n\nGoogle Chrome and Google Ads. The stolen data includes confidential information\n\nbelonging to the legitimate owner of the device, such as login credentials (usernames\n\n\n-----\n\nand passwords), URL history, and authentication permissions (cookies). This stolen\n\ninformation is used in numerous ways to benefit the Glupteba Enterprise.\n\n54. One way that the Glupteba Enterprise benefits from this stolen\n\ninformation is through the sale of access to stolen Google and similar accounts. The\n\nGlupteba Enterprise uses a website called “Dont.farm” to sell access to users’\n\naccounts with Google and other online platforms.\n\n55. The Enterprise loads stolen credentials and cookies of the stolen\n\naccounts on virtual machines. A virtual machine is similar to a physical computer,\n\nbut the operating system of the virtual machine is contained within another\n\ncomputing environment, typically on a cloud computing platform.\n\n56. Like typical computers, the Glupteba Enterprise’s virtual machines\n\nhave a web browser. In the open browser, the Glupteba Enterprise enters a username\n\nand password for a Google account (or other account) that Glupteba malware has\n\nstolen. Dont.farm’s customers pay the Glupteba Enterprise in exchange for the\n\nability to access a browser that is already logged into a victim’s stolen Google account.\n\nOnce granted access to the account, the Dont.farm customer has free rein to use that\n\naccount however they desire, including buying advertisements and launching\n\nfraudulent ad campaigns, all without the true account owner’s knowledge or\n\nauthorization. According to Dont.farm’s website, customers can obtain access to\n\n“accounts of any country in the world.”\n\n57. Dont.farm confesses that it is selling access to other people’s accounts\n\nfor Google and other technology company products and services.\n\n\n-----\n\n58. The Dont.farm website provides a manual instructing its users how to\n\nexploit accounts while minimizing the risk of discovery by the account owner or a\n\ntechnology platform like Google.\n\n\n-----\n\n59. For example, Dont.farm customers are instructed to archive emails from\n\n“google.com” and “ads-reply@google.com” so that any alert emails from Google to the\n\ntrue owner of the account will not be noticed. Dont.farm customers also are\n\ninstructed to turn off account notifications for Google AdWords and YouTube services\n\nso that the true owner of the account will not be notified of any changes made to their\n\naccount.\n\n60. Dont.farm also provides other tips to its customers to help them avoid\n\ndetection by Google. For example, they advise customers not to increase advertising\n\nbudgets by more than 30 percent, and that any domains used for advertisements\n\nshould be at least two weeks old, if not significantly older.\n\n\n-----\n\n61. According to the Dont.farm website, it has been in operation since 2019\n\nand has over 200 employees. Dont.farm has sold access to hundreds of thousands of\n\nstolen accounts—including Google accounts—since its inception.\n\n62. In response to a public comment accusing Dont.farm of illegal activity,\n\nDont.farm attempted to distinguish its criminal conduct—selling authorized access\n\nto accounts—from the act of selling stolen username and passwords.\n\n63. This is a distinction without a difference: while it is illegal to sell stolen\n\nusernames and passwords, it is likewise illegal to sell unauthorized access to a stolen\n\naccount.\n\n64. Dont.farm is marketed as a means by which to conduct “efficient”\n\nadvertisement campaigns, but, in reality, it is simply a vehicle for bad actors to\n\ncommit commercialized ad fraud. Once criminal customers are logged in to the\n\nvictim’s account through Dont.farm, they can use the account to disseminate and/or\n\npurchase advertising. Cybercriminals often use this form of advertising to phish\n\ncredentials, such as financial information or other personal information, from buyers\n\n\n-----\n\nof their “products.” These bad actors may potentially use these accounts to conduct\n\nother fraudulent schemes as well.\n\n65. With regard to the Stolen Accounts Scheme, Google specifically found\n\nthe following through its investigation:\n\na. Google identified a Gmail account sold by Dont.farm that was created in\n\n2016. It did not initiate use of Google Ads until five years later, on April\n\n21, 2021. On that same day, the account was logged into after four failed\n\npassword attempts from an IP address in Germany, a location atypical\n\nof prior account logins. The very next day, on April 22, 2021, the account\n\nhad logins from IP addresses tied to the United States and Iran. Review\n\nof these logins showed they occurred from a variety of device and\n\nbrowser types. In addition, a review of the Gmail settings on the account\n\nindicated it had established a filter to send all emails from\n\n“@google.com” to trash, consistent with the aforementioned instructions\n\nfrom Dont.farm.\n\nb. Google identified a Gmail account sold by Dont.farm that was created in\n\n2018. It did not initiate use of Google Ads until three years later, on\n\nMarch 30, 2021. On that same day, the account was logged into from a\n\nnew device. Google’s review determined that the Gmail settings on the\n\naccount indicated it had established filters to send all emails from ads\naccount-noreply@google[.]com and from google[.]com to trash, consistent\n\nwith Dont.farm’s instructions. Additionally, Google observed a series of\n\n\n-----\n\nfailed login attempts for this account in early July 2021 from IP\n\naddresses associated with numerous countries, such as Vietnam, Italy,\n\nBrazil, Ecuador, Iraq, Czechia, Bangladesh, and the United States.\n\nc. Google identified a Gmail account sold by Dont.farm that was created in\n\n2019. It did not initiate use of Google Ads until two years later, on\n\nMarch 24, 2021. On that same day, the account was logged into from a\n\nWindows device in the United Kingdom, a device and location atypical\n\nof other logins, including another login that occurred that same day. The\n\nGmail settings on the account indicated it had established filters to send\n\nall emails from ads-account-noreply@google[.]com and google[.]com to\n\ntrash, consistent with Dont.farm’s instructions.\n\n66. **Credit Card Fraud Scheme. Often, third parties and potentially bad**\n\nactors seek access to Google Ads accounts or similar advertising accounts to buy\n\nadvertisements to display to Google users or other audiences. As reflected in images\n\nfrom the Dont.farm website excerpted below, one of the features of Dont.farm is that\n\nit offers “packages” that include not only access to stolen accounts, but also the use of\n\ncredit cards from a website called Extracard.net to purchase ads. Customers of\n\nDont.farm pay a fee for use of credit cards through Extracard.net; they use the card\n\nto purchase Google ads or other Google services (while logged in through stolen\n\naccount information), but neither Extracard.net, nor the Dont.farm customer pay\n\nGoogle for the ads or services purchased.\n\n\n-----\n\n-----\n\n67. Specifically, the scheme leverages an advance credit Google provides to\n\nGoogle Ads account holders when an account holder places a credit card on file with\n\ntheir account. The account holder can spend up to the credit amount before Google\n\ncharges the credit card on file. When account holders place legitimate credit cards\n\non file, Google can collect the charges when it runs the credit card.\n\n68. Extracard.net provides access to credit card numbers that are associated\n\nwith a Russian bank. These credit card numbers appear legitimate, but when Google\n\nseeks to charge credit cards issued by Extracard.net, the charged amount is not fully\n\npaid. By taking advantage of the advance credit system, customers of Google Ads\n\nwith Extracard.net credit cards on file have been able to “purchase” and execute ad\n\ncampaigns without paying for them, causing monetary loss to Google. Additionally,\n\nmany of the ad campaigns purchased with Extracard.net credit cards have been\n\nmalicious or fraudulent.\n\n69. The Glupteba Enterprise sells these credit cards through Extracard.net\n\nnot just for use on its stolen Google accounts, but for the customer to use however\n\nthey see fit. Thus, it is likely Google is not the only victim of this criminal scheme.\n\n70. The Glupteba Enterprise directs and profits from this criminal scheme\n\nand operates the corporate entities responsible for executing the scheme. Prestige\nMedia LLC, a Delaware corporation owned and operated by the Glupteba Enterprise,\n\nowns QIP.ru, which claims responsibility for the creation and operation of\n\nExtracard.net. See infra paragraph 111.\n\n\n-----\n\n71. With regard to the Credit Card Fraud Scheme, Google specifically found\n\nthe following through its investigation:\n\na. The Google Ads accounts associated with a particular Gmail account\n\npurchased ads using a credit card consistent with credit cards from\n\nExtracard.net. Both Ads accounts were suspended for ad cloaking, a\n\ntechnique used to defraud online advertisers and trick internet users to\n\nview malicious sites, often with the purpose of compromising their\n\ndevices. Upon review, the Ads accounts were found to be running ads\n\nwhich redirected to a cryptocurrency investment scam. Moreover, a\n\nreview of that Gmail account indicated it had logins from IP addresses\n\nassociated with AWMProxy.net.\n\nb. The Google Ads account associated with a particular Gmail account\n\nsigned up for Google AdWords using a credit card consistent with credit\n\ncards from Extracard.net. The Ads account was suspended for payment\n\nfraud because it ran ads worth $410.89 Australian Dollars in mid\nSeptember 2021, for which Google never received payment. This\n\naccount was created just two weeks before it began using Google\n\nAdWords and it used VPN IP addresses for logging in, suggesting that\n\nthe user purposefully masked its identity and likely created the account\n\nin order to undertake fraudulent ad activity using the Extracard.net\n\ncredit card.\n\n\n-----\n\nc. The Google Ads account associated with a particular Gmail account\n\nsigned up for Google AdWords using a credit card consistent with credit\n\ncards from Extracard.net. The account was suspended for payment\n\nfraud because it ran ads worth approximately 2800 EUR between June\n\n4, 2021 and June 18, 2021, for which Google was only partially paid.\n\n72. **Disruptive Ads Scheme. The Glupteba Enterprise sells the**\n\nplacement of “disruptive ads” (often, “pop-up” ads) on mobile devices infected with\n\nmalware. In today’s digital age, advertisers tend to view disruptive ads as more\n\neffective than standard ads used on social media and other websites because they\n\ngrab users’ attention. The Glupteba Enterprise has sold disruptive ads through at\n\nleast two websites, Trafspin.com and Push.farm.\n\n73. Trafspin.com is a real-time bidding advertising network that sells\n\ndisruptive in-app and web traffic through the botnet’s proxy connections to mobile\n\ndevices infected by the Glupteba malware. Trafspin.com is currently offline, but it\n\nappears to have been replaced by Push.farm. The format and content of the\n\nPush.farm website is nearly identical to Trafspin.com, and it lists the same “office”\n\nphone number on its website.\n\n74. Like Extracard.net, Trafspin.com and Push.farm appear to be supported\n\nby Prestige-Media. As shown below, Prestige-Media was listed on Trafspin.com’s\n\nwebsite as the entity supporting Trafspin.com’s U.S. operations.\n\n\n-----\n\n75. Similarly, as shown in the excerpt below from Trafspin.com’s website,\n\nTrafspin.com and Push.farm’s Russian operations appear to be supported by\n\nInvestavto LLC, a Russian limited-liability company based in Moscow. Investavto\n\nwas registered on May 26, 2016, and its legal address was 123112, Moscow,\n\nPresnenskaya Embankment 12, Office 5. Investavto may have been liquidated on\n\nSeptember 23, 2021.\n\n\n-----\n\n76. A third corporate entity supporting Trafspin and Push.farm is Valtron\n\nLLC (OOO ВАЛЬТРОН in Russian), a Russian limited-liability company based in\n\nMoscow. It was incorporated on August 23, 2019. Recent Russian job postings state\n\nthat Valtron LLC’s website is “Trafspin.com” and list the same office address as\n\nVoltronwork.com, Investavto LLC, and Trafspin.com: Presnenskaya Embankment 12\n\n(Federation Tower). The job postings include requirements that the candidates have\n\nexperience with Google and other technology-company advertising.[8]\n\n77. **Proxy Scheme.** The Glupteba Enterprise also uses the botnet’s\n\nconnections to infected devices to secretly convert those devices into proxy\n\n8 The Glupteba Enterprise’s corporate entities likely exist for the sole purpose of\nhiring and paying employees. See Robert McMillan, Ransomware Gang Masquerades\n_as Real Company to Recruit Tech Talent, Wall St. J. (Oct. 21, 2021, 8:30 AM),_\nhttps://www.wsj.com/articles/ransomware-gang-masquerades-as-real-company-torecruit-tech-talent-11634819400.\n\n\n-----\n\nconnections that it then sells to third-party customers, including those involved in\n\ncriminal activity. Specifically, AWMProxy.net[9] sells residential proxy servers that\n\nallow customers (including criminals) to conceal their location through the use of\n\ndevices infected by the botnet.\n\n78. AWMProxy.net rents out IP addresses that belong to physical devices\n\ninfected by Glupteba malware to customers seeking to proxy (or relay) their internet\n\nactivity through those devices. This enables customers to conceal their location, since\n\ntheir internet activity will appear to be coming from the IP address of the infected\n\ndevice, rather than the customers’ real location. AWMProxy.net updates the\n\navailable proxies frequently in order to circumvent bans by search engine\n\noptimization.\n\n79. IP addresses are a common factor used in identifying harmful activity,\n\nand by relaying efforts through residential proxies, bad actors are more likely to avoid\n\ndetection and successfully undertake harmful activities such as launching malicious\n\nor fraudulent Google Ad campaigns and sending phishing emails to Google users. The\n\nunwitting victim owners whose devices have been infected are not aware, nor have\n\nconsented, to their devices being used in this way.\n\n9 On November 23, 2021, AWMProxy.net was rebranded as Vd.net. A blog post on\nthe same day claimed new ownership. See The Project Has a New Domain and New\n_Owners!, VD.net (Nov. 23, 2021), https://vd.net/news/the-project-has-a-new-domain-_\nand-new-owners.html (“Dear friends! We are glad to inform you that our project has\nbeen sold to new owners. In this regard, we expect new positive changes and you can\nalready see the first one of them - we have a new website address! We are sure that\nthe new team will breathe new life into the project!”).\n\n\n-----\n\n80. The Glupteba Enterprise formerly used a website called “Abm.net” to\n\neffectuate the same scheme. Both AWMProxy.net and Abm.net have advertised their\n\nproxies as compatible with Google.\n\n81. AWMProxy.net also provides proxy services for use by Dont.farm, as it\n\nappears that most of the IP addresses used to proxy for Dont.farm are IP addresses\n\nthat AWMProxy.net also utilizes.\n\n82. The Glupteba Enterprise’s proxy scheme allows cybercriminals who rent\n\nan IP address from the Glupteba Enterprise to hide their tracks by concealing their\n\ntrue locations and IP addresses at the expense of unwitting and innocent owners of\n\ninfected computers and devices. As a result, security systems that screen for\n\nsuspicious IP addresses are less likely to detect the cybercriminal’s activity.\n\n83. AWMProxy.net and Abm.net also appear to be supported by Prestige\nMedia. All three share the same legal address (8 The Green, Suite A, Dover,\n\nDelaware, 19901), and AWMProxy.net’s website previously listed Prestige-Media as\n\na contact.\n\n84. **Cryptojacking Scheme. “Cryptojacking” involves secretly exploiting**\n\ncomputing and processing power devices to generate or “mine” cryptocurrency.\n\n85. For traditional, state-backed currencies (such as the U.S.\n\ndollar), new currency is injected into the economy when the government prints it.\n\nCryptocurrency works differently, and for certain cryptocurrencies, newly issued\n\ncurrency is distributed to those who “mine” it. Specifically, cryptocurrency networks\n\nrequire confirmation of transactions. Transactions are confirmed by solving complex\n\n\n-----\n\nmathematical problems (called “mining”) using computer processing power. After\n\nconfirmation, transactions are confirmed to the blockchain. Miners are rewarded for\n\nbeing the first to successfully complete this computational task by receiving newly\n\ncreated units of cryptocurrency, often in the form of a “transaction fee.”\n\n86. It is often not efficient or possible for the owner of a personal computer\n\nto “mine” cryptocurrency in this way.\n\n87. The Enterprise manipulates infected devices, marshaling their\n\ncollective computing power, to mine for cryptocurrency for the Glupteba Enterprise.\n\nThe Enterprise directs all of the rewards from the mining activity to its own wallets,\n\nleaving the device owner both unaware that they are contributing to a criminal\n\nenterprise and saddled with the high electricity bill and computing inefficiencies that\n\nresult from mining.\n\n88. **Other Criminal Schemes: As noted, the Glupteba malware has**\n\ninfected more than one million devices. At any moment, the unusual power of the\n\nbotnet could be harnessed by the Glupteba Enterprise for any of a number of other\n\ncriminal schemes, including large ransomware or DDoS attacks on legitimate\n\nbusinesses or targets of all sizes. The Glupteba Enterprise could itself perpetrate\n\nsuch a harmful attack, or it could sell access to the botnet to a third-party for such a\n\npurpose. Some of the largest DDoS attacks in internet history were recently carried\n\n\n-----\n\nout by the so-called “Meris botnet,” which some researchers have connected to the\n\nGlupteba Enterprise.[10]\n\n**_Developer Support for Criminal Schemes_**\n\n89. The Glupteba Enterprise actively recruits developers to support its\n\nwebsites, transactions, and overall operation. To recruit developers, the Enterprise\n\nuses a website called “Voltronwork.com.” This site uses Google advertisements to\n\npost job openings for the websites effectuating the above criminal schemes.\n\n90. Generally, Voltronwork.com has operated as a website that is central to\n\nthe Glupteba Enterprise’s operations. An IP address once connected to\n\nvpn.voltronwork.com was used to login to Google accounts from domains associated\n\nwith Dont.farm and AWMProxy.net. Additionally, advertisements from\n\nVoltronwork.com link to Trafspin.com, and the URL of a Voltronwork.com subdomain\n\nwas visible in a 2020 variant of the Glupteba malware proxy module.\n\n91. Voltronwork.com is no longer functioning, but it appears to have been\n\nreplaced by Undefined.team, which the Glupteba Enterprise also controls and\n\noperates. The domain Undefined.team has been associated with Voltronwork.com\n\nsince June 2021. Undefined.team shares the same Federation Tower address\n\n(Presnenskaya Embankment 12) as Voltronwork.com, Valtron LLC, Investavto LLC,\n\n10 _See Catalin Cimpanu, Russian Security Firm Sinkholes Part of the Dangerous_\n_Meris DDoS Botnet, The Record (Sept. 21, 2021), https://therecord.media/russian-_\nsecurity-firm-sinkholes-part-of-the-dangerous-meris-ddos-botnet/ (“[I]t is currently\nunclear if the Glupteba gang built the Meris botnet themselves or if another group\nrented access to Glupteba-infected hosts to deploy the MikroTik module that\neventually led to Meris’ creation.”).\n\n\n-----\n\nand Trafspin.com. Additionally, a September 2021 job posting for an HTML coder\n\nstated that Extracard.net and Abm.net were projects of the “large IT team\n\nUNDEFINED.TEAM.”\n\n**_Individual Defendants’ Roles in the Glupteba Enterprise_**\n\n92. Each named Defendant controls and/or participates in the Glupteba\n\nEnterprise’s operations.\n\n93. Defendants Dmitry Starovikov and Alexander Filippov each used one of\n\nthe Glupteba botnet’s proxy C2 servers in executing the Terms of Service required to\n\nset up their Gmail addresses.\n\n94. Defendant Dmitry Starovikov operates the Glupteba botnet and helps\n\nlead the criminal schemes of the Glupteba Enterprise. In addition to using the\n\naforementioned IP address of a Glupteba botnet proxy C2 Server when signing up for\n\na Gmail account, Dmitry Starovikov has an email account under the Voltronwork.com\n\ndomain, and acts as an administrator for the Voltronwork.com Google Workspace\n\naccount. Additionally, the secondary email address for the Google Workspace\n\nVoltronwork.com account, is an email containing Dmitry’s name under the\n\nTrafspin.com domain.\n\n95. Defendant Alexander Filippov operates the Glupteba botnet and helps\n\nlead the criminal schemes of the Glupteba Enterprise. In addition to using the IP\n\naddress of a proxy C2 Server when signing up for a Gmail account, Filippov has email\n\naccounts associated with the Google Workspace accounts related to Voltronwork.com,\n\nDont.farm, and Undefined.team. Moreover, Filippov’s Undefined.team account lists\n\n\n-----\n\nthe Russian Federation Tower address as the billing address, which is used by many\n\nother entities in the Glupteba Enterprise, as discussed above.\n\n**_Harm to Google, its Users, and the Public_**\n\n96. The Glupteba Enterprise harms the owners of the devices that are\n\ninfected with the malware, Google, and countless other persons and entities.\n\n97. The owners of infected devices are harmed in numerous ways, including\n\nthrough the theft and use of their account information, unauthorized access and\n\ncriminal misuse of their device, and potential subjugation to the criminal schemes of\n\nthird parties.\n\n98. The Glupteba Enterprise causes substantial harm to Google.\n\n99. The Glupteba Enterprise causes financial loss to Google, including but\n\nnot limited to the losses incurred in connection with the Credit Card Fraud Scheme,\n\nwhich results in the purchase of Google ads and services that are provided but never\n\npaid for.\n\n100. The Glupteba Enterprise also harms Google’s relationships with Google\n\nusers: it has illicitly accessed and exploited thousands of Google users’ accounts (as\n\nwell as thousands of accounts belonging to other technology companies), disrupting\n\nthese users’ experiences with the Google platform.\n\n101. The Glupteba Enterprise also harms Google itself by threatening the\n\nsafety and security of Google’s products, including Gmail, YouTube, and Google Ads.\n\n102. The Glupteba Enterprise impairs the value of Google marks, including\n\nby tricking individuals into downloading Glupteba malware through a fake “YouTube\n\n\n-----\n\nDownloader” website that deceived users into believing they were downloading a\n\nvideo from Google’s YouTube video sharing platform, impairing Google users’\n\nconfidence and trust in Google, its services, and its platforms.\n\n103. The Glupteba Enterprise causes Google to expend substantial resources\n\nto detect, deter, and disrupt it, due to the threat the Glupteba Enterprise and its\n\ncriminal schemes pose to the security of Google’s platform.\n\n104. Beyond Google and Google users, the continued proliferation of malware\n\non Google platforms harms the internet ecosystem as a whole.\n\n**CLAIMS FOR RELIEF**\n\n**CLAIM 1**\n**Violations of the Racketeer Influenced and Corrupt Organizations Act,**\n**18 U.S.C. §§ 1962(c)-(d)**\n\n105. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n106. At all relevant times, Google is a person within the meaning of 18 U.S.C.\n\n§§ 1961(3).\n\n107. At all relevant times, Google is a “person injured in his or her business\n\nor property by reason of a violation of” RICO within the meaning of 18 U.S.C.\n\n§ 1964(c).\n\n108. At all relevant times, each Defendant is a person within the meaning of\n\n18 U.S.C. §§ 1961(3) and 1962(c).\n\n**_The RICO Enterprise_**\n\n109. The Defendants are a group of persons associated together in fact for the\n\ncommon purpose of carrying out an ongoing criminal enterprise, as described in the\n\n\n-----\n\nforegoing paragraphs of this Complaint; namely, creating and controlling a vast\n\nbotnet using Glupteba malware, and using that botnet to execute numerous criminal\n\nschemes that harm and threaten to continue to harm Google, its users, and the public\n\nmore broadly. These schemes include the Stolen Accounts Scheme (supra ¶¶ 53-65),\n\nthe Credit Card Fraud Scheme (supra ¶¶ 66-71), the Disruptive Ads Scheme (supra\n\n- 72-76), the Proxy Scheme (supra ¶¶ 77-83), and the Cryptojacking Scheme (supra\n\n- 84-87).\n\n110. As described _supra at paragraphs 92 through 95, the Defendants and_\n\ntheir co-conspirators have organized their operation into a cohesive group with\n\nspecific and assigned responsibilities and a command structure, operating in the\n\nUnited States and overseas, targeting and using victim devices in the United States.\n\nOver time, they have adapted their operations and schemes to changing\n\ncircumstances, recruiting new members to and enlisting new devices in their\n\noperation, developing new malware modules, and expanding the scope and nature of\n\ntheir activities.\n\n111. The Glupteba Enterprise, including named Defendants and their\n\nunnamed co-conspirators (Doe Defendants), controls and uses multiple corporate\n\nentities to effectuate its various criminal schemes. One such corporate entity is\n\nPrestige-Media LLC, a Delaware limited liability company that owns the domain,\n\nQIP.ru, that is responsible for Extracard.net (used with the Credit Card Fraud\n\nScheme). Prestige-Media also supports Trafspin.com, the website used to facilitate\n\n\n-----\n\nthe Disruptive Ads Scheme. Another corporate entity controlled by the Glupteba\n\nEnterprise is Valtron LLC, a Russian entity that supports Trafspin.com.\n\n112. The individual Defendants named herein—Dmitry Starovikov and\n\nAlexander Filippov—are each bot controllers involved in providing instructions to\n\ndevices infected with the Glupteba malware, in furtherance of the criminal schemes\n\nalleged herein.\n\n113. The Defendants and their co-conspirators constitute an association-in\nfact enterprise within the meaning of 18 U.S.C. §§ 1961(4) and 1962(c): the Glupteba\n\nEnterprise. The members of the Glupteba Enterprise share the common purpose of\n\ndeveloping and operating the Glupteba botnet worldwide, as set forth above.\n\n114. At all relevant times, each of the Defendants were and are associated-in\n\nfact with the Glupteba Enterprise and participated in the operation or management\n\nof the Glupteba Enterprise.\n\n115. At all relevant times, the Glupteba Enterprise was engaged in, and its\n\nactivities affected interstate and foreign commerce within the meaning of 18 U.S.C.\n\n§ 1962(c).\n\n**_Pattern of Racketeering Activity and Predicate Acts_**\n\n116. At all relevant times, the Defendants conducted or participated, directly\n\nor indirectly, in the conduct, management, or operation of the Glupteba Enterprise’s\n\naffairs through a pattern of racketeering activity within the meaning of 18 U.S.C. §\n\n1961(5) and in violation of 18 U.S.C. § 1962(c), with such conduct and activities\n\naffecting interstate and foreign commerce.\n\n\n-----\n\n117. Defendants have directly or indirectly engaged in an unlawful pattern\n\nof racketeering activity involving thousands of RICO predicate offenses including\n\nviolations of the Computer Fraud and Abuse Act (18 U.S.C. § 1030(a)(5)(A),\n\nincorporated as a RICO predicate act under 18 U.S.C. § 1961(1)(G) and 18 U.S.C. §\n\n2332b(g)(5)(B)); wire fraud (18 U.S.C. § 1343); identity fraud (18 U.S.C. § 1028); and\n\naccess device fraud (18 U.S.C. § 1029). These activities have affected and continue to\n\naffect interstate or foreign commerce.\n\n118. Google was injured in its business and property by reason of the\n\nDefendants’ violations of 18 U.S.C. § 1962(c), as described herein. These injuries are\n\na direct, proximate, and reasonably foreseeable result of these violations, and Google\n\nwill continue to be harmed.\n\n119. Under 18 U.S.C. § 1964(c), Google is entitled to recover treble damages\n\nplus costs and attorneys’ fees from the Defendants.\n\n**_The_** **_Computer Fraud and Abuse Act Predicate Offenses_**\n\n120. RICO provides, in 18 U.S.C. § 1961(1)(G), that any act indictable under\n\n18 U.S.C. § 2332b(g)(5)(B) constitutes a RICO predicate act. Among the acts that are\n\nindictable under 18 U.S.C. § 2332b(g)(5)(B) are violations of 18 U.S.C.\n\n§ 1030(a)(5)(A)—a provision of the Computer Fraud and Abuse Act (CFAA)—if such\n\nviolation results in damage as defined in Section 1030(c)(4)(A)(i)(VI).\n\n121. Defendants have violated and continue to violate the CFAA, 18 U.S.C.\n\n§ 1030(a)(5)(A), resulting in damage as defined in Section 1030(c)(4)(A)(i)(VI), by\n\ninfecting protected computers with malware, transmitting programs designed to\n\n\n-----\n\ncarry out their schemes, and transmitting commands to infected computers. Each of\n\nthese violations constitutes a separate RICO predicate offense.\n\n122. _Transmission of Malware “Droppers.”_ Defendants have intentionally\n\ncaused damage to “protected computers” by transmitting malware “droppers” to those\n\ncomputers, thereby impairing the integrity of their systems and information, and\n\nallowing Defendants to access those systems. The infected computers are “protected\n\ncomputers” within the meaning of the CFAA because they are used in or affect\n\ninterstate commerce or communication through the internet. Through this conduct,\n\nDefendants have caused damage to 10 or more protected computers in a one-year\n\ntime period.\n\n123. _Transmission of Malware Modules._ Defendants have transmitted\n\nmalware modules to protected computers through the internet. Those modules\n\ndamage the protected computers by disabling the users’ cybersecurity detection tools,\n\nanti-virus software, and system monitoring programs, as well as transmitting other\n\nmodules to execute Defendants’ criminal schemes. Through this conduct, Defendants\n\nhave caused damage to 10 or more protected computers in a one-year time period.\n\n124. _Transmission of Commands. Defendants also have transmitted_\n\ncommands to protected computers through the internet, thereby causing damage to\n\nthose computers and enabling the Glupteba Enterprise to utilize these computers in\n\nits criminal schemes. Through this conduct, Defendants have caused damage to 10\n\nor more protected computers in a one-year time period.\n\n\n-----\n\n125. Google has suffered injury to its business or property as a result of these\n\npredicate offenses, including due to Defendants’ use of these violations in furtherance\n\nof the Stolen Accounts and Credit Card Fraud Schemes.\n\n**_Wire Fraud Predicate Offenses_**\n\n126. Defendants, with intent to defraud and obtain money or property by\n\nmeans of false or fraudulent pretenses, commit wire fraud in violation of 18 U.S.C.\n\n§ 1343 by transmitting or causing to be transmitted, by means of wire communication\n\nin interstate or foreign commerce, writings, signs, and signals for the purpose of\n\nexecuting fraudulent schemes. Defendants have violated and continue to violate the\n\nwire fraud statute in three ways, each instance of which constitutes a separate RICO\n\npredicate offense.\n\n127. First, the Glupteba Enterprise commits wire fraud, in violation of 18\n\nU.S.C. § 1343, each time that it tricks the owner of a device into unknowingly\n\ndownloading and installing Glupteba malware on the owner’s device through fraud,\n\nmisrepresentation, and deception. For example, the Glupteba Enterprise misused a\n\nknown Google mark, YouTube, described _supra at paragraphs 33 and 102, which_\n\nconstitutes an act of wire fraud, in violation of 18 U.S.C. § 1343.\n\n128. Second, in connection with the Stolen Accounts Scheme, Defendants\n\nsteal Google users’ login information (e.g., usernames and passwords), and then sell\n\naccess to open browsers that are pre-loaded with the stolen login information, thereby\n\ndeceiving Google through deceit and false pretenses as to the true identity of the\n\nperson accessing the Google account. Each time that the Glupteba Enterprise\n\n\n-----\n\nfacilitates an unauthorized login to a Google user’s account by a person other than\n\nthe true Google user, for the purpose of obtaining money or property, including as\n\ndescribed supra at paragraphs 53 through 65, the Glupteba Enterprise commits an\n\nact of wire fraud, in violation of 18 U.S.C. § 1343.\n\n129. Finally, the Glupteba Enterprise commits wire fraud through the Credit\n\nCard Fraud Scheme. The Glupteba Enterprise deliberately markets credit cards\n\nthrough Extracard.net and markets those cards specifically for use to purchase ads\n\nfraudulently on Google or other Google services, knowing that the cards can be used\n\nin connection with fraudulent activity. The Glupteba Enterprise’s customers can use\n\nthese cards to purchase Google Ads, falsely representing to Google that the cards are\n\nfully funded. The Glupteba Enterprise causes these transmissions because the\n\nEnterprise knows the transmissions can follow in the ordinary course of business and\n\nsuch use can reasonably be foreseen.\n\n130. Google has suffered injury to its business or property as a result of these\n\nfraudulent schemes.\n\n**_Identity Fraud Predicate Offenses_**\n\n131. Defendants commit identity fraud in violation of 18 U.S.C. § 1028(a)(7)\n\nby knowingly transferring, possessing, and using, without lawful authority, means of\n\nidentification of their victims with the intent to commit, or to aid or abet, or in\n\nconnection with, unlawful activity in violation of state and federal law and affecting\n\ninterstate commerce.\n\n\n-----\n\n132. Specifically, in connection with the Stolen Accounts Scheme and the\n\nCredit Card Fraud Scheme, the Glupteba Enterprise transfers, possesses, and uses,\n\nwithout authorization, the usernames and passwords of users whose account\n\ninformation has been stolen. Those usernames and passwords are “means of\n\nidentification” because they belong to and identify specific individuals. The Glupteba\n\nEnterprise acts with the intent to commit unlawful activities that violate federal law\n\n(including the Computer Fraud and Abuse Act, 18 U.S.C. § 1030(a)(5)(A), and 18\n\nU.S.C. § 1343) and that constitute felonies under state law (including theft of\n\nproperty).\n\n133. Google has suffered injury to its business or property as a result of these\n\nactions.\n\n**_Access Device Fraud Predicate Offenses_**\n\n134. Defendants, knowingly and with intent to defraud, committed and\n\ncontinue to commit access device fraud in violation of 18 U.S.C. § 1029(a)(2) and (3)\n\nby trafficking in or using unauthorized access devices in the form of stolen passwords,\n\ncredentials, and other account information in order to obtain anything of value\n\naggregating $1,000 or more during a one-year period, and/or possessing fifteen or\n\nmore unauthorized access devices, and affecting interstate or foreign commerce.\n\n135. For instance, the Glupteba Enterprise loads stolen usernames and\n\npasswords and cookies onto virtual machines, and then sells access to stolen Google\n\naccounts (and the accounts of other technology companies). Each set of credentials\n\nin a virtual machine is an “unauthorized access device” because it is a means of\n\n\n-----\n\naccessing a user’s account and was stolen by the Glupteba Enterprise. The\n\nEnterprise possesses thousands of unauthorized access devices, which it has obtained\n\nduring a one-year period.\n\n136. Google has suffered injury to its business or property as a result of these\n\nactions, which the Glupteba Enterprise uses to carry out the Stolen Accounts and\n\nCredit Card Fraud Schemes.\n\n**_Conspiracy to Violate RICO_**\n\n137. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n138. Defendants have not undertaken the practices described herein in\n\nisolation, but rather as part of a common scheme. In violation of 18 U.S.C. §1962(d),\n\neach Defendant unlawfully, knowingly, and willfully agreed and conspired together\n\nand with others to violate 18 U.S.C. § 1962(c) as described above, in violation of 18\n\nU.S.C. § 1962(d).\n\n139. The Defendants knew that they were engaged in a conspiracy to commit\n\nmultiple predicate offenses, and they knew that the predicate offenses were part of\n\nsuch racketeering activity, and their participation and agreement was necessary to\n\nallow the commission of this pattern of racketeering activity. This conduct\n\nconstitutes a conspiracy to violate 18 U.S.C. § 1962(c), in violation of 18 U.S.C. §\n\n1962(d).\n\n140. The Defendants agreed to direct or participate in, directly or indirectly,\n\nthe conduct, management, or operation of the Glupteba Enterprise’s affairs through\n\n\n-----\n\na pattern of racketeering activity in violation of 18 U.S.C. § 1962(c). Each Defendant\n\nknew about and agreed to facilitate the Glupteba Enterprise’s schemes. The purpose\n\nof the conspiracy was to commit a pattern of racketeering activity in the conduct of\n\nthe affairs of the Glupteba Enterprise, including the acts of racketeering set forth\n\nabove.\n\n141. Google has been and continues to be directly injured by Defendants’\n\nconduct. But for the alleged pattern of racketeering activity, Google would not have\n\nincurred damages.\n\n142. Google seeks injunctive relief and compensatory and punitive damages\n\nin an amount to be proven at trial.\n\n143. As a direct result of Defendants’ actions, Google has suffered and\n\ncontinues to suffer irreparable harm for which there is not adequate remedy at law,\n\nand which will continue unless Defendants’ actions are enjoined.\n\n**CLAIM 2**\n**Violations of the Computer Fraud and Abuse Act, 18 U.S.C. § 1030**\n\n144. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n145. Defendants intentionally accessed and continue to access protected\n\ncomputers without authorization and thereby obtained and continue to obtain\n\ninformation from the protected computers. _See_ 18 U.S.C. § 1030(a)(2)(C). The\n\nprotected computers include devices infected with Glupteba malware, from which\n\nDefendants obtain information concerning the device’s owner, including usernames\n\nand passwords. The protected computers also include Google’s servers, which\n\n\n-----\n\nDefendants intentionally accessed without authorization to obtain information from\n\nGoogle concerning the account, and use of the account.\n\n146. Further, as described above at paragraphs 29 through 40, Defendants\n\nknowingly caused and continue to cause the transmission of a program, information,\n\ncode, and/or commands, and as a result of such conduct, intentionally caused and\n\ncontinue to cause damage without authorization, to the protected computers, the\n\nsoftware residing thereon, and Google. See 18 U.S.C. § 1030(a)(5)(A).\n\n147. Defendants intentionally accessed and continue to access protected\n\ncomputers without authorization, and as a result of such conduct, recklessly caused\n\nand continue to cause damage to the protected computers, the software residing\n\nthereon, and Google. See 18 U.S.C. § 1030(a)(5)(B).\n\n148. Defendants intentionally accessed and continue to access protected\n\ncomputers without authorization, and as a result of such conduct, caused and\n\ncontinue to cause damage and loss to the protected computers, the software residing\n\nthereon, and Google. See 18 U.S.C. § 1030(a)(5)(C).\n\n149. Defendants knowingly and with intent to defraud trafficked and\n\ncontinue to traffic in passwords and/or similar information through which computers\n\nmay be accessed without authorization. See 18 U.S.C. § 1030(a)(6).\n\n150. Defendants’ conduct involved and affected, and continues to involve and\n\naffect, interstate and/or foreign communications and commerce, including involving\n\nprotected computers located inside the United States as well as protected computers\n\n\n-----\n\nlocated outside the United States that are used in a manner that affects interstate or\n\nforeign commerce or communication of the United States.\n\n151. Defendants’ conduct has caused damage to Google, including by\n\nimpairing the integrity of the accounts being offered to certain of its users.\n\n152. Defendants’ conduct has caused a loss to Google during a one-year\n\nperiod aggregating at least $5,000\n\n153. Google seeks injunctive relief and compensatory and punitive damages\n\nunder 18 U.S.C. § 1030(g) in an amount to be proven at trial.\n\n154. As a direct result of Defendants’ actions, Google has suffered and\n\ncontinues to suffer irreparable harm for which there is no adequate remedy at law,\n\nand which will continue unless Defendants’ actions are enjoined.\n\n**CLAIM 3**\n**Violations Of The Electronic Communications Privacy Act, 18 U.S.C. §§**\n**2701 et seq.**\n\n155. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n156. Google accounts and Google’s servers running such services are facilities\n\nthrough which electronic communication service is provided to Google users and\n\ncustomers.\n\n157. Defendants knowingly and intentionally accessed and continue to access\n\nGoogle accounts and Google’s servers running such services without authorization or\n\nin excess of any authorization granted by Google or any other party.\n\n158. Google seeks injunctive relief and compensatory, statutory, and punitive\n\ndamages in an amount to be proven at trial.\n\n\n-----\n\n159. As a direct result of Defendants’ actions, Google has suffered and\n\ncontinues to suffer irreparable harm for which no adequate remedy at law exists, and\n\nwhich will continue unless Defendants’ actions are enjoined.\n\n**CLAIM 4**\n**Trademark And Unfair Competition Violations**\n\n160. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n161. Since Google’s founding in 1997, its search engine, accessible at\n\nwww.google.com, has become one of the largest, most recognized, and widely used\n\ninternet search services in the world.\n\n162. Among its innovative goods and services, Google also offers a video\n\nsharing service under the famous YOUTUBE mark. YouTube, LLC (“YouTube”)\n\nlaunched the youtube.com website on April 24, 2005, and the mark YOUTUBE has\n\nbeen in continuous use ever since. Google acquired YouTube in November 2006, and\n\nthereafter maintained YouTube’s rights and use of the YOUTUBE mark.\n\n163. Google has devoted substantial efforts and resources, both in the United\n\nStates and internationally, to promote its services using its trademarks including\n\nYOUTUBE. Its platforms have had resounding success in the marketplace and have\n\ngarnered a significant and loyal network of users, including consumers, advertisers\n\nand content providers. Today, these platforms are among the most used services in\n\ntheir fields and the most visited websites and apps in the world.\n\n164. Google owns numerous trademark registrations in the U.S. and around\n\nthe world for its marks including YOUTUBE, including but not limited to\n\n\n-----\n\nincontestable U.S. Trademark Reg. No. 3711233, registered in 2009 and renewed in\n\n2020, covering the following goods and services:\n\n\n**(Int’l Class: 09)**\n\n\nDownloadable software to enable uploading, posting, showing,\n\ndisplaying, tagging, sharing and otherwise providing electronic media\n\nor information over the Internet and other communications networks;\n\napplication program interface (API) that enables developers to integrate\n\nvideo content and functionality into websites, software applications, and\n\n\ndevices\n\n\n**(Int’l Class: 35)**\n\n\nAdvertising and promotional services on behalf of others; promotional\n\nservices, namely, promoting the goods and services of others through\n\nonline entertainment, online education, and sharing of multimedia\n\ncontent via the Internet and other communications networks;\n\ndeveloping and providing marketing programs for advertisers,\n\nmarketers, and content providers; providing a website where\n\nadvertisers, marketers, and content providers can reach, engage, and\n\ninteract with online users for the purposes of promotion or advertising\n\n\n**(Int’l Class: 38)**\n\n\nAudio, video and multimedia broadcasting via the Internet and other\n\ncommunications networks; webcasting services; transmission of\n\nmessages, data and content via the Internet and other communications\n\nnetworks; providing forums for the transmission of messages, comments\n\nand multimedia content among users in the field of general interest via\n\n\n-----\n\nthe Internet and other communications networks; transmission of\n\nelectronic media, multimedia content, videos, movies, pictures, images,\n\ntext, photos, user-generated content, audio content, and information via\n\nthe Internet and other communications networks; providing community\n\nforums for users to post, search, watch, share, critique, rate, and\n\ncomment on, videos and other multimedia content via the Internet and\n\n\nother communications network\n\n\n**(Int’l Class: 41)**\n\n\nEntertainment and educational services, namely, providing a website\n\nfeaturing user-generated content, namely, electronic media, multimedia\n\ncontent, videos, movies, pictures, images, text, photos, audio content,\n\nand related information via the Internet and other communications\n\nnetworks on a wide variety of topics and subjects; Providing online\n\njournals, namely, blogs featuring information on the subject of the\n\nabove-listed user-generated website content; Online digital video, audio\n\nand multimedia entertainment publishing services; Online digital\n\npublishing services; Entertainment services, namely, conducting\n\n\ncontests\n\n\n**(Int’l Class: 42)**\n\n\nProviding temporary use of non-downloadable software to enable\n\nuploading, capturing, posting, showing, editing, playing, streaming,\n\nviewing, previewing, displaying, tagging, sharing, manipulating,\n\ndistributing, publishing, reproducing, and otherwise providing\n\n\n-----\n\nelectronic media, multimedia content, videos, movies, pictures, images,\n\ntext, photos, user-generated content, audio content and information via\n\nthe Internet and other communications networks; Providing temporary\n\nuse of non-downloadable software to enable sharing of multimedia\n\n\ncontent and comments among users; Providing temporary use of non\n\ndownloadable software to enable content providers to track multimedia\n\ncontent; Providing temporary use of non-downloadable analytics\n\nsoftware, namely, software that provides statistics about the behavior of\n\nviewers of online videos, movies, pictures, images, text, photos, games\n\nand other user-generated content; Hosting of websites featuring\n\nmultimedia content for others; Hosting multimedia entertainment and\n\neducational content for others; Providing a web site that gives computer\n\nusers the ability to upload and share user-generated videos, on a wide\n\n\nvariety of topics and subjects\n\n\n165. Google’s trademarks including YOUTUBE embody the substantial and\n\nvaluable reputation and goodwill that Google has earned in the marketplace for its\n\nhigh-quality and innovative services and related software and products. In\n\nparticular, the YOUTUBE brand has become famous because of, among other\n\nreasons, Google’s widespread use of the mark in the United States and\n\ninternationally, extensive media coverage, and the strong and loyal base of users of\n\nthis Google service.\n\n\n-----\n\n166. The YOUTUBE Mark was used by Defendants and/or their agents in\n\nconnection with a domain name and website purporting to be a YouTube video\n\ndownloader program that tricked the user into clicking the download link, infecting\n\nthe user’s computer with Glupteba malware and enabling Defendants to control the\n\nuser’s computer via instructions sent by Defendants’ C2 server, as noted above. The\n\nfake YouTube video downloader is one of the nefarious means Defendants or their\n\nagents have used to gain access to users’ computers and infect computers with the\n\nGlupteba malware.\n\n167. Defendants thus in part access user accounts through malicious\n\nfreeware that was marketed using the YOUTUBE Mark, purporting to offer YouTube\n\nvideo download programs and using the YOUTUBE Mark in domain names such as\n\nvideo-youtube-get.ru.\n\n168. Defendants used the YOUTUBE mark in commerce in connection with\n\nthe distribution and advertising of services in a manner that is likely to cause\n\nconfusion.\n\n**_Infringement of Federally Registered Trademark_**\n**_15 U.S.C. § 1114(1)_**\n\n169. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n170. Defendants’ and/or their agents’ use of the YOUTUBE mark has caused\n\nand/or is likely to continue to cause confusion with Google’s federally registered\n\nYOUTUBE trademark, in violation of 15 U.S.C. § 1114(1). The use by Defendants\n\nand/or their agents of YOUTUBE has caused and/or is likely to continue to cause\n\n\n-----\n\nconfusion and mistake, has deceived and/or is likely to continue to deceive potential\n\ncustomers and the relevant purchasing public as to the source, origin, or sponsorship\n\nof Defendants’ services, and has deceived and/or is likely to continue to deceive the\n\npublic into believing that those services originate from, are associated with, or are\n\notherwise authorized by Google, to the damage and detriment of Google’s reputation,\n\ngoodwill, and sales.\n\n171. Google has no adequate remedy at law, and, if Defendants’ actions are\n\nnot enjoined, Google will continue to suffer irreparable harm to its reputation and the\n\ngoodwill of its well-known YOUTUBE trademark.\n\n172. Further, Defendants have caused damage to Google, and they have\n\nprofited from their unlawful actions in an amount not known to Plaintiff.\n\n**_Federal Unfair Competition and False Designation of Origin_**\n**_15 U.S.C. § 1125(a)_**\n\n173. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n174. Defendants’ and/ or their agents’ use of YOUTUBE has caused and/or is\n\nlikely to cause confusion in violation of 15 U.S.C. § 1125(a). Defendants’ and/or their\n\nagents’ use of YOUTUBE has caused and/or is likely to cause confusion and mistake,\n\nhas deceived and/or is likely to continue to deceive potential customers and the\n\nrelevant purchasing public as to the source, origin, or sponsorship of Defendants’\n\nservices, and has deceived and/or is likely to continue to deceive the public into\n\nbelieving that those services originate from, are associated with, or are otherwise\n\n\n-----\n\nauthorized by Google, to the damage and detriment of Google’s reputation, goodwill,\n\nand sales.\n\n175. Google has no adequate remedy at law, and, if Defendants’ actions are\n\nnot enjoined, Google will continue to suffer irreparable harm to its reputation and the\n\ngoodwill of its well-known YOUTUBE trademark.\n\n**_Federal False Advertising in Violation of the Lanham Act_**\n**_15 U.S.C. § 1125(a)_**\n\n176. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n177. Defendants’ and/or their agents’ false, deceptive, and misleading\n\nadvertising in interstate commerce violates Section 43(a) of the Lanham Act, 15\n\nU.S.C. § 1125(a).\n\n178. Defendants’ and/or their agents’ advertising claims regarding alleged\n\nservices offered by Defendants, including offering of software that purported to assist\n\nin downloading of videos from YouTube, have been false, deceptive, and misleading.\n\n179. Defendants’ and/or their agents’ false, deceptive, and misleading claims\n\nwere included in their commercial advertising and/or promotional materials.\n\n180. Defendants and/or their agents have distributed their false, deceptive,\n\nand misleading advertising claims in interstate commerce.\n\n181. Defendants’ and/or their agents’ false, deceptive, and misleading\n\nadvertising claims have the capacity to deceive end users and are material to end\n\nusers’ decisions to engage with Defendants.\n\n\n-----\n\n182. Google has been injured as a result of this false, deceptive, and\n\nmisleading advertising.\n\n183. Google will continue to be irreparably injured unless and until\n\nDefendants’ conduct is preliminarily, and thereafter, permanently enjoined by this\n\nCourt, and Google has no adequate remedy at law.\n\n184. As a direct and proximate result of Defendants’ false, deceptive, and\n\nmisleading advertising, Google has suffered harm and damages in an amount to be\n\ndetermined by the trier of fact.\n\n185. Defendants and/or their agents have engaged in intentional and willful\n\nviolation of the Lanham Act entitling Google to enhanced damages and attorneys’\n\nfees and costs.\n\n**CLAIM 5**\n**Tortious Interference with Business Relationship**\n\n186. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n187. Defendants knew or should have known that Google had an actual and\n\ncontinuing business relationship with numerous users who interact with Google’s\n\nsystems and computer networks.\n\n188. In violation of the common law of New York, Defendants intentionally\n\nand maliciously interfered with Google’s business relationships with its users by\n\naccessing, without authorization, Google user accounts, and Google’s systems and\n\nnetworks, for the purpose of stealing account information and data from those users,\n\nthereby causing harm to Google users, Google, and Google’s relations with its users.\n\n\n-----\n\n189. Moreover, Defendants unlawfully and maliciously interfered with\n\nGoogle’s business relationship with prospective users by undermining the security\n\nand reputation of Google’s systems and networks.\n\n190. Defendants’ improper actions were the proximate cause of harm to\n\nGoogle.\n\n191. Google seeks injunctive relief and compensatory and punitive damages\n\nin an amount to be proven at trial.\n\n192. As a direct result of Defendants’ actions, Google has suffered and\n\ncontinues to suffer irreparable harm for which no adequate remedy at law exists, and\n\nwhich will continue unless Defendants’ actions are enjoined.\n\n**CLAIM 6**\n**Unjust Enrichment**\n\n193. Google incorporates by reference each and every foregoing paragraph of\n\nthe Complaint as if set forth in full.\n\n194. The acts of Defendants complained of herein constitute unjust\n\nenrichment of the Defendants at the expense of Google in violation of the common\n\nlaw of New York. Defendants accessed, without authorization, Google’s Gmail system\n\nand the computers by which such programs and services run.\n\n195. Defendants profited unjustly from their unauthorized use of Google’s\n\nsystems and networks.\n\n196. Defendants had an appreciation and knowledge of the benefit they\n\nderived from their unauthorized use of those systems and networks.\n\n\n-----\n\n197. Retention by the Defendants of the profits they derived from their\n\nmalfeasance would be inequitable.\n\n198. Google seeks injunctive relief and compensatory and punitive damages\n\nin an amount to be proven at trial, including without limitation disgorgement of\n\nDefendant’s ill-gotten profits.\n\n199. As a direct result of Defendants’ actions, Google suffered and continues\n\nto suffer irreparable harm for which no adequate remedy at law exists, and which\n\nwill continue unless Defendants’ actions are enjoined.\n\n**PRAYER FOR RELIEF**\n\nWHEREFORE, Plaintiff prays for judgment as set forth below:\n\nA. Judgment in favor of Google and against Defendants;\n\nB. A declaration that Defendants have engaged in acts or practices that\n\nviolate the Racketeer Influenced and Corrupt Organizations Act,\n\nComputer Fraud and Abuse Act, Electronic Communications Privacy\n\nAct, and Lanham Act, and they have engaged in tortious interference\n\nwith business relationships and been unjustly enriched;\n\nC. A declaration that Defendants have violated Google’s trademarks;\n\nD. A declaration that Defendants’ conduct has been willful and that\n\nDefendants have acted with fraud, malice, and oppression;\n\nE. A temporary restraining order and preliminary and permanent\n\ninjunctions enjoining Defendants and their officers, directors,\n\nprincipals, agents, servants, employees, successors, and assigns, and all\n\npersons and entities in active concert or participation with them, from\n\n\n-----\n\nengaging in any of the activity complained of herein or from causing any\n\nof the injury complained of herein and from assisting, aiding, or abetting\n\nany other person or business entity in engaging in or performing any of\n\nthe activity complained of herein or from causing any of the injury\n\ncomplained of herein;\n\nF. Award of appropriate equitable relief available under applicable\n\nstatutes and law, including injunctive relief and an accounting of profits;\n\nG. Judgment awarding Google actual and/or statutory damages from\n\nDefendants adequate to compensate Google for Defendants’ activity\n\ncomplained of herein and for any injury complained of herein, including\n\nbut not limited to interest and costs, in an amount to be proven at trial;\n\nH. Judgment awarding enhanced, exemplary and special damages, in an\n\namount to be proved at trial;\n\nI. Judgment awarding attorneys’ fees and costs; and\n\nJ. Order such other relief that the Court deems just and reasonable.\n\n**DEMAND FOR JURY TRIAL**\n\nGoogle respectfully requests a trial by jury on all triable issues in accordance\n\nwith Fed. R. Civ. P. 38.\n\n\n-----\n\nDATED: December 2, 2021 Respectfully submitted,\n\n__________________________\nLaura Harris\nAndrew Michaelson\nKathleen E. McCarthy\nMatthew Bush\nKING & SPALDING LLP\n1185 Ave. of the Americas, 34th Floor\nNew York, NY 10036\nTelephone: (212) 790-5356\nFax: (212) 556-2222\nlharris@kslaw.com\namichaelson@kslaw.com\nkmccarthy@kslaw.com\nmbush@kslaw.com\n\nSumon Dantiki (pro hac vice to be\nsubmitted)\nDavid P. Mattern (pro hac vice to be\nsubmitted)\nKING & SPALDING LLP\n1700 Pennsylvania Ave., NW, 2nd Floor\nWashington, DC 20006\nTelephone: (202) 626-5591\nFax: (202) 626-3737\nsdantiki@kslaw.com\ndmattern@kslaw.com\n\nBethany L. Rupert (pro hac vice to be\nsubmitted)\nKING & SPALDING LLP\n1180 Peachtree Street, NE, Suite 1600\nAtlanta, GA 30309\nTelephone: (404) 572-3525\nFax: (404) 572-5100\nbrupert@kslaw.com\n\n_Counsel for Plaintiff Google LLC_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://storage.googleapis.com/gweb-uniblog-publish-prod/documents/1_Complaint.pdf"
    ],
    "report_names": [
        "1_Complaint.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716505,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1638376594,
    "ts_modification_date": 1638376594,
    "files": {
        "pdf": "https://archive.orkl.eu/e14eca4829dd80072ee2e2bdb1e5c5abadc118d7.pdf",
        "text": "https://archive.orkl.eu/e14eca4829dd80072ee2e2bdb1e5c5abadc118d7.txt",
        "img": "https://archive.orkl.eu/e14eca4829dd80072ee2e2bdb1e5c5abadc118d7.jpg"
    }
}