{
    "id": "957c4b85-304f-4664-aa0f-e01cdc42f6a6",
    "created_at": "2023-01-12T15:07:25.932585Z",
    "updated_at": "2025-03-27T02:16:58.113483Z",
    "deleted_at": null,
    "sha1_hash": "3dc39d2ac164ce4b310455c143e8caf8b1a25aac",
    "title": "2021-04-27 - Ransomware Preparedness- A Call to Action",
    "authors": "",
    "file_creation_date": "2022-05-27T23:11:44Z",
    "file_modification_date": "2022-05-27T23:11:44Z",
    "file_size": 1247566,
    "plain_text": "# Ransomware Preparedness: A Call to Action\n\n**[crowdstrike.com/blog/ransomware-preparedness-a-call-to-action/](https://www.crowdstrike.com/blog/ransomware-preparedness-a-call-to-action/)**\n\nJosh Dalman - Kamil Janton - Eben Kaplan April 27, 2021\n\nHardly a day passes without news of another company, hospital, school district or municipal\n[government temporarily brought to a halt by ransomware. In fact, ransomware attacks have](https://www.crowdstrike.com/cybersecurity-101/ransomware/)\nbecome so commonplace that they make the news far less than they used to.\n\nYet while ransomware may no longer captivate the public’s attention, security professionals\njustifiably continue to obsess over it. Ransomware remains the most profitable method for\ncybercriminals to monetize their unauthorized access into business networks, with increasing\nransom demands often ranging from $1 million to $10 million USD. For this reason alone, all\norganizations are potential targets for ransomware campaigns that almost always have a\ncostly business impact, including disruption to operations and extortion that involves\nsensitive data theft.\n\nRansomware preparedness has become imperative for all organizations, so much so that\neven chief executives and boards of directors are recognizing it as part of their responsibility\nto promote good governance. But it is a cat-and-mouse game — as defenses improve,\nransomware actors continue to innovate to find new methods to compromise and extort their\nvictims.\n\n\n-----\n\nThe [CrowdStrike® Services team routinely assists organizations both in preparing for and](https://www.crowdstrike.com/services/)\nresponding to ransomware attacks. The following are some of the practices we recommend\nmost frequently.\n\n## Improve Resiliency of Internet-facing Applications\n\n[CrowdStrike has observed eCrime threat actors exploiting single-factor authentication and](https://adversary.crowdstrike.com/)\nunpatched internet-facing applications. BOSS SPIDER, one of the initial big game hunting\n(BGH) ransomware threat actors, routinely targeted systems with Remote Desktop Protocol\n(RDP) accessible from the internet. Less sophisticated threat actors operating ransomware\nvariants such as Dharma, Phobos and GlobeImposter frequently gain access through RDP\nbrute-force attacks.\n\nCrowdStrike recommends against RDP being exposed directly to the internet. Organizations\ncurrently leveraging the CrowdStrike Falcon® platform can quickly and effectively identify\nsystems being actively brute-forced via RDP by using the following query in the Falcon Event\nActivity Monitor:\n```\nevent_simpleName=UserLogonFailed2 | iplocation RemoteAddressIP4 | stats\nvalues(ClientComputerName) AS ClientComputerNames dc(UserName) values(LogonDomain) AS\nLogonDomains dc(RemoteAddressIP4) values(LogonType_decimal) dc(Country) count by\nevent_simpleName ComputerName | sort -\"dc(Country)\"\n\n```\nIn a separate but similar campaign in 2020, CrowdStrike observed CIRCUS SPIDER, the\n[group behind the development of Netwalker ransomware, and TWISTED SPIDER, the group](https://adversary.crowdstrike.com/adversary/twisted-spider/)\nbehind the development of Maze ransomware, exploit CVEs (common vulnerabilities and\nexposures) associated with Pulse VPN to gain access into victim organizations. For this\nreason, CrowdStrike recommends utilizing a VPN with multifactor authentication, and\nensuring that any CVEs associated with the VPN platform(s) and the underlying\nauthentication application are prioritized for patching. This principle should extend to all\nremote methods including, but not limited to Azure Active Directory (AD) and Citrix Gateway.\nThe latter, being used by threat actors such as TRAVELING SPIDER — the criminal\ndeveloper of Nemty ransomware — has been observed by CrowdStrike to take advantage of\nsingle-factor authentication to gain access to victim organizations through Citrix Gateway\nand send extortion-related emails using the victim’s own Microsoft Office 365 instance.\n\n## Implement and Enhance Email Security\n\n[Gaining an initial foothold into a victim organization through a phishing email is the most](https://www.crowdstrike.com/cybersecurity-101/phishing/)\ncommon tactic for BGH ransomware groups. Typically, these phishing emails contain a\nmalicious link or URL that delivers a payload to the recipient’s workstation.\n\nCrowdStrike recommends implementing an email security solution that conducts URL\nfiltering and also attachment sandboxing. To streamline these efforts, an automated\nresponse capability can be used to allow for retroactive quarantining of delivered emails\n\n\n-----\n\nbefore the user interacts with them. In addition, organizations may want to restrict users from\nreceiving password-protected zip files, executables, javascripts or Windows installer package\nfiles unless there is a legitimate business need. Adding an “[External]” tag to emails\noriginating from outside of the organization and a warning message on top of the email’s\nbody can help remind users to use discretion when handling such emails.\n\nUsers should also have a documented process to report any emails they are unsure of along\nthe way. In addition, if business permits, organizations should consider restricting users’\naccess to personal email accounts.\n\nAs always, organizations should also implement a robust security awareness program that\nincludes routine user training, reminders and “phish-me” campaigns. Creating your own\n“phish-me” campaign is one of the best and safest ways for your employees to learn to not\nbe fooled by phishing emails. The old adage applies: “Fool me once, shame on you — fool\nme twice, shame on me.” CrowdStrike employs this best practice internally.\n\n## Harden Endpoints\n\nThroughout an attack lifecycle that ultimately culminates in a ransomware deployment, threat\nactors will often leverage a number of endpoint exploitation techniques. These exploitation\ntechniques vary from exploiting poor AD configurations to leveraging publicly available\nexploits against unpatched systems or applications.\n\nA proper endpoint hardening strategy will ensure that threat actors have to defeat multiple\ndefensive layers before achieving success in the attack. Each layer of defense the threat\nactor encounters provides an opportunity for defensive teams to detect and ultimately\ncontain the activity before it results in ransomware deployment.\n\nThe list below includes some key system-hardening actions for defenders to implement. It is\nimportant to note this is not an exhaustive list, and system hardening should be an iterative\nprocess.\n\n**Ensure full coverage across all endpoints on your network for endpoint security**\n**products, and for the endpoint detection and protection (EDR) platform. Each endpoint**\nsecurity platform should have strict anti-tampering protections and alerting in place if\nand when a sensor goes offline or gets uninstalled.\n**Develop a vulnerability and patch management program. Doing so will ensure that**\nall endpoint applications and operating systems are kept up-to-date. Ransomware\n[actors leverage endpoint vulnerabilities for many purposes, including but not limited to](https://www.crowdstrike.com/cybersecurity-101/vulnerability-management-programs/)\n[privilege escalation and lateral movement. Existing Falcon customers can leverage](https://www.crowdstrike.com/cybersecurity-101/lateral-movement/)\nCrowdStrike Falcon Spotlight™ vulnerability management for a near real-time way to\nunderstand exposure to a particular vulnerability across the environment, without the\nneed to deploy additional agents and security tools.\n\n\n-----\n\n**Follow Active Directory security best practices. Based on some of the most**\ncommon AD downfalls observed by CrowdStrike Services during ransomware\nengagements, we recommend these steps:\n\nAvoid easy-to-guess passwords with weak authentication methods.\nAvoid having regular domain users with local administrator privileges, and local\nadministrator accounts with the same passwords across the entire enterprise or\nlarge portions of the enterprise.\nLimit workstation-to-workstation communication. While this can be achieved using\ngroup policy objects (GPOs), it can be also achieved through a number of microsegmentation software options.\nAvoid sharing privileged credentials. Poor security practices include shared\nadministrative accounts and using administrator accounts for personal or day-today business activity that does not require administrator privileges.\nNote that the first two points above can be accomplished using AD with little to no\nadditional costs. At an additional cost, a privileged access management (PAM)\nsolution can provide a much more scalable and robust solution to the same\nproblem and is discussed more later in this blog post.\n\nWith the [recent acquisition of Preempt, CrowdStrike is continuously adding capabilities to its](https://ir.crowdstrike.com/news-releases/news-release-details/crowdstrike-completes-acquisition-preempt-security)\nZero Trust framework. The “Implement an Identity and Access Management (IAM)” section of\nthis blog explains how Falcon Zero Trust can help you further harden your endpoints and\nimprove your IAM program.\n\n## Ransomware-proof Data with Offline Backups\n\nIn recent years, and since the emergence of ransomware as a top method of monetizing\nattacks, the developers behind malicious code have become very effective at ensuring\nvictims and security researchers cannot decrypt affected data without paying the ransom for\nthe decryption key. Further, when developing a ransomware-proof backup infrastructure, the\nmost important idea to consider is that threat actors have targeted online backups before\ndeploying ransomware to the environment.\n\nFor these reasons, the only sure way of salvaging data during a ransomware attack is\nthrough ransomware-proof backups. For example, maintaining offline backups of your data\nallows for a quicker recovery in emergencies. The following points should be considered\nwhen developing a ransomware-proof offline backup infrastructure:\n\nOffline backups, as well as the indexes (describing which volumes contain which data)\nshould be completely separate from the rest of the infrastructure.\nAccess to such networks should be controlled via strict access control lists (ACLs), and\nall authentications should be performed using multifactor authentication (MFA).\n\n\n-----\n\nAdministrators with access to both offline and online infrastructures should avoid\nreusing account passwords and use a jump box when accessing the offline backup\ninfrastructure.\nCloud storage services, with strict ACLs and rules, can also serve as offline backup\ninfrastructure.\nEmergency situations such as a ransomware attack should be the only time the offline\ninfrastructure is allowed a connection to the live network.\n\n## Restrict Access to Virtualization Management Infrastructure\n\nAs mentioned earlier, threat actors engaged in big game hunting ransomware campaigns are\ncontinuously innovating to increase the effectiveness of their attacks. The most recent such\ndevelopment includes the ability to attack virtualized infrastructure directly. This approach\nallows for targeting of hypervisors that deploy and store virtual machines (VMDK). As a\nresult, the endpoint security products installed on the virtualized machines are blind to\nmalicious actions taken on the hypervisor.\n\nTo further understand how this attack would unfold, we will use some of VMware’s naming\nconvention as it is the most common virtualizing product found in today’s enterprise\nenvironments.\n\nMany ESXi systems (VMware hypervisors) do not have Secure Shell (SSH) protocol enabled\nby default and are usually managed via vCenter. If SSH is disabled, previously stolen\nadministrative credentials are used to enable SSH on all ESXi systems. Once that is\ncomplete, a valid account is used to SSH into each ESXi system being targeted. Before the\nthreat actor deploys the Linux-based ransomware, VMDKs hosted on the ESXi are stopped\nto allow the ransomware binary to access the files for encryption purposes. Systems\nimpacted by the ransomware through this deployment method will be completely offline and\ninaccessible to the users.\n\nRecently, CrowdStrike Intelligence has observed this method being used by CARBON\nSPIDER and SPRITE SPIDER, and CrowdStrike expects this trend to continue to be used\nand adopted by eCrime operators. As adoption of this tactic becomes wider, the following\nitems can help organizations strengthen their virtualized environments.\n\nRestrict access to ESXi hosts to a small number of systems, and ensure these systems\nare fully patched and have proper endpoint monitoring in place.\nESXi systems are commonly managed via LDAP-binded Active Directory accounts,\nwhich are often privileged accounts targeted by the threat actor earlier in the\ncompromise. Removing or limiting such bindings could minimize the chance of an\nalready-compromised administrative account being used to target the ESXi systems\nwith ransomware.\nEnsure SSH access is disabled, or ensure that it is secured by MFA.\n\n\n-----\n\nEnsure passwords are unique to each ESXi host as well as to the web client and are\nstrong/complex, using a combination of letters, special characters and numbers. Avoid\nusing dictionary words and “1337” speak.\n[Enable Normal Lockdown Mode to further restrict access. See reference here.](https://kb.vmware.com/s/article/1008077)\n\n## Implement an Identity and Access Management (IAM) Program\n\nOrganizations can improve their security posture by implementing a robust IAM program that\nmaintains an activity trail for all privileged and service accounts, with immediate identification\nfor anomalous traffic or abnormal resource requests.\n\nTo help organizations implement an IAM program, CrowdStrike offers two Identity Protection\nmodules: Falcon Zero Trust and Falcon Identity Threat Detection. Deploying these modules\nto an existing Falcon instance will create real-time layers of threat prevention of identitybased attacks and anomalies targeting an organization. The adaptive capabilities of this\nplatform allow enterprises to automate responses with the right type of enforcement or\nnotification based on identity, behavior and risk. For example, service accounts attempting to\nconnect via RDP, or RDP connecting to an unusual destination, could be challenged via\n[multifactor authentication or blocked by Falcon Zero Trust in real time.](https://www.crowdstrike.com/resources/white-papers/hardening-your-ad-security/)\n\nIn addition, nearly all BGH ransomware groups will utilize off-the-shelf credential dumping\ntools such as Mimikatz or SPRITE SPIDER’s PyXie and LaZagne modules to steal\ncredentials and expand their foothold within the environment. The output of the tools are then\nused by the attackers to move laterally within a network using techniques such as Pass-theHash, Pass-the-Ticket, Kerberoasting and others.\n\nAn IAM platform such as Falcon Identity Protection can detect credential exploitation as well\nas the use of risky protocols and abnormal behavior within the AD environment. These\ndetections will identify devices and accounts that have been compromised and, based on the\nconfigured policy, decide if such accounts need to be challenged via MFA/2FA or blocked to\nhalt the progress of the attack. This will significantly cripple BGH ransomware groups from\nbeing able to act on their objectives.\n\n## Develop and Pressure-test an Incident Response Plan\n\nOrganizations sometimes become aware of threat actor activity within their environment, but\nthey lack the visibility to address the problem or the right intelligence to understand the\nnature of the threat. Recognizing the threat and responding quickly and effectively can be the\ndifference between a major incident and a near miss.\n\n[Incident response plans and playbooks help facilitate that speedy decision making. Plans](https://www.crowdstrike.com/cybersecurity-101/incident-response-ir-plan/)\nshould cover all parts of the response effort, across the organization. For the security team,\nthey should provide aids to decision-making so that front-line responders don’t overlook\n\n\n-----\n\nimportant details while triaging alerts. They should also outline the extent of the security\nteam’s authority to take decisive actions — such as shutting down business-essential\nservices — if a ransomware attack appears imminent.\n\nFor the crisis management team, plans should identify who will be involved and what their\nroles and responsibilities are. It should also tee up important decisions, like when to activate\nan incident response retainer, whether to notify insurance carriers, when and how to involve\nin-house or outside counsel, and how to discuss ransom demands with executives.\n\nConsider conducting regular tabletop exercises to test the incident response plan and\nprocesses. Some organizations may benefit from simulated exercises such as “purple team”\nengagements, where red teamers mimic ransomware operators’ actions on objectives,\nincluding data exfiltration and ultimately ransomware deployment. CrowdStrike also\nrecommends regular exercising of your incident response plan, both planned and unplanned,\nsuch as utilizing a red team to conduct a mock attack operation.\n\nOrganizations should never be surprised or caught flat-footed by an attack — it should be\nexpected and planned for.\n\n## Take Steps Now\n\nAny organization can fall victim to costly ransomware campaigns with ransom demands in\nthe seven digits, but much can be done to stop threat actors before they get a chance to\ndetonate a widespread ransomware attack. Locking down common initial entry vectors,\nimplementing multifactor authentication, and hardening of both endpoint and Active Directory\ninfrastructure can pay dividends by improving an organization’s resiliency to ransomware\nthreat actors.\n\nWhile it’s not possible to prevent all network intrusions, creating enough obstacles through\nprinciples of security-in-depth, and the recommended “1-10-60” benchmark time (one minute\nto detect an incident, 10 minutes to investigate and one hour to remediate), can ensure that\nthreat actors are halted before achieving their objectives of data theft and ransomware\ndeployment.\n\n**Additional Resources**\n\n_Learn about recent intrusion trends, adversary tactics and highlights of notable_\n_intrusions in the_ _[CrowdStrike 2021 Global Threat Report.](https://www.crowdstrike.com/global-threat-report/)_\n_Understand the trends and themes that we observed while responding to and_\n_remediating incidents around the globe in 2020 — download the latest CrowdStrike_\n_Services Cyber Front Lines Report._\n_[Learn more about the CrowdStrike Falcon® platform by visiting the product webpage.](https://www.crowdstrike.com/endpoint-security-products/falcon-platform/)_\n_[Test CrowdStrike next-gen AV for yourself. Start your free trial of Falcon Prevent™](https://go.crowdstrike.com/try-falcon-prevent.html)_\n_today._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-27 - Ransomware Preparedness- A Call to Action.pdf"
    ],
    "report_names": [
        "2021-04-27 - Ransomware Preparedness- A Call to Action.pdf"
    ],
    "threat_actors": [
        {
            "id": "eb8697fd-882a-4323-9eb8-8e20222cfd91",
            "created_at": "2022-10-25T16:07:23.416834Z",
            "updated_at": "2025-03-27T02:02:09.788953Z",
            "deleted_at": null,
            "main_name": "Boss Spider",
            "aliases": [
                "Boss Spider",
                "CTG-0007",
                "Gold Lowell"
            ],
            "source_name": "ETDA:Boss Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "SDelete",
                "SamSam",
                "Samas"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "53201ab8-30d2-4722-816e-f914604e78df",
            "created_at": "2022-10-25T16:07:23.466825Z",
            "updated_at": "2025-03-27T02:02:09.817805Z",
            "deleted_at": null,
            "main_name": "Circus Spider",
            "aliases": [],
            "source_name": "ETDA:Circus Spider",
            "tools": [
                "Koko Ransomware",
                "MailTo",
                "NetWalker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8b7faa58-947b-4530-ab1f-250a0370aabf",
            "created_at": "2022-10-25T16:07:24.34248Z",
            "updated_at": "2025-03-27T02:02:10.180543Z",
            "deleted_at": null,
            "main_name": "Traveling Spider",
            "aliases": [
                "Gold Mansard"
            ],
            "source_name": "ETDA:Traveling Spider",
            "tools": [
                "7-Zip",
                "AdFind",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Nefilim",
                "Nemty",
                "Nephilim",
                "Network Password Recovery",
                "PsExec",
                "smbtool"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "373d61cc-32a0-4c0c-b48b-ff9e3f1357ac",
            "created_at": "2023-01-06T13:46:39.222456Z",
            "updated_at": "2025-03-27T02:00:03.024584Z",
            "deleted_at": null,
            "main_name": "CIRCUS SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:CIRCUS SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1c76f1b6-a05b-4dba-82ea-07011b47c6cd",
            "created_at": "2023-01-06T13:46:39.201507Z",
            "updated_at": "2025-03-27T02:00:03.020126Z",
            "deleted_at": null,
            "main_name": "TRAVELING SPIDER",
            "aliases": [],
            "source_name": "MISPGALAXY:TRAVELING SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4116df25-aff6-46ee-a5dd-926254a78e89",
            "created_at": "2023-01-06T13:46:38.894033Z",
            "updated_at": "2025-03-27T02:00:02.94496Z",
            "deleted_at": null,
            "main_name": "BOSS SPIDER",
            "aliases": [
                "GOLD LOWELL"
            ],
            "source_name": "MISPGALAXY:BOSS SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7268a08d-d4d0-4ebc-bffe-3d35b3ead368",
            "created_at": "2022-10-25T16:07:24.225216Z",
            "updated_at": "2025-03-27T02:02:10.144446Z",
            "deleted_at": null,
            "main_name": "Sprite Spider",
            "aliases": [
                "Gold Dupont",
                "Sprite Spider"
            ],
            "source_name": "ETDA:Sprite Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Coroxy",
                "Defray 2018",
                "Defray777",
                "DroxiDat",
                "Glushkov",
                "LaZagne",
                "Metasploit",
                "PyXie",
                "PyXie RAT",
                "Ransom X",
                "RansomExx",
                "SharpHound",
                "Shifu",
                "SystemBC",
                "Target777",
                "Vatet",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "27e51b73-410e-4a33-93a1-49cf8a743cf7",
            "created_at": "2023-01-06T13:46:39.210675Z",
            "updated_at": "2025-03-27T02:00:03.022315Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "SPRITE SPIDER"
            ],
            "source_name": "MISPGALAXY:GOLD DUPONT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "07775b09-acd9-498e-895f-f10063115629",
            "created_at": "2024-06-04T02:03:07.817613Z",
            "updated_at": "2025-03-27T02:05:17.351811Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "Sprite Spider "
            ],
            "source_name": "Secureworks:GOLD DUPONT",
            "tools": [
                " ArtifactExx",
                " Cobalt Strike",
                " Defray",
                " Metasploit",
                " PyXie",
                " Shifu",
                " SystemBC",
                " Vatet",
                "777"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1b20199b-07ae-42f1-ad22-bbe2dd471df8",
            "created_at": "2024-06-04T02:03:07.872554Z",
            "updated_at": "2025-03-27T02:05:17.383011Z",
            "deleted_at": null,
            "main_name": "GOLD LOWELL",
            "aliases": [
                "CTG-0007 ",
                "Boss Spider "
            ],
            "source_name": "Secureworks:GOLD LOWELL",
            "tools": [
                "Samas"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536045,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1653693104,
    "ts_modification_date": 1653693104,
    "files": {
        "pdf": "https://archive.orkl.eu/3dc39d2ac164ce4b310455c143e8caf8b1a25aac.pdf",
        "text": "https://archive.orkl.eu/3dc39d2ac164ce4b310455c143e8caf8b1a25aac.txt",
        "img": "https://archive.orkl.eu/3dc39d2ac164ce4b310455c143e8caf8b1a25aac.jpg"
    }
}