{
    "id": "95c92e84-b4f5-4cef-b9d7-b114a81d0ac1",
    "created_at": "2023-01-12T15:02:30.292131Z",
    "updated_at": "2025-03-27T02:06:07.67481Z",
    "deleted_at": null,
    "sha1_hash": "494eb8af730d22468c0196ca81bddb5c5dbcdc58",
    "title": "2019-09-20 - Russian Cybercrime Group FullofDeep Behind QNAPCrypt Ransomware Campaigns",
    "authors": "",
    "file_creation_date": "2022-05-28T03:21:10Z",
    "file_modification_date": "2022-05-28T03:21:10Z",
    "file_size": 415043,
    "plain_text": "# Russian Cybercrime Group FullofDeep Behind QNAPCrypt Ransomware Campaigns\n\n**[intezer.com/blog-russian-cybercrime-group-fullofdeep-behind-qnapcrypt-ransomware-campaigns/](https://www.intezer.com/blog-russian-cybercrime-group-fullofdeep-behind-qnapcrypt-ransomware-campaigns/)**\n\n## Get Free Account\n\nJoin Now\n\n**Introduction**\n\n\nSeptember 20, 2019\n\n\n[We previously reported on how we managed to temporarily shut down 15 operative](https://www.intezer.com//blog-seizing-15-active-ransomware-campaigns-targeting-linux-file-storage-servers/)\n**QNAPCrypt ransomware campaigns targeting Linux-based file storage systems (NAS**\nservers). We have now identified a new QNAPCrypt sample which is being used by the\nsame threat actor group. The authors behind this new ransomware instance have revealed\nenough evidence for us to conclude the establishment of FullofDeep, a Russian cybercrime\ngroup operating from the Union State and the Ukraine. The group is mainly focused on\nransomware campaigns.\n\n**Technical Analysis**\n\nInitially, we received a hit from an older YARA signature, which was created to hunt for\nQNAPCrypt instances. Although the new ransomware variant does not share large portions\nof code with the original QNAPCrypt campaigns, the naming convention used in the new\nransomware’s functions has been observed in previous QNAPCrypt instances:\n\n\n-----\n\nIn addition, the new variant utilizes geolocation information in order to determine whether or\nnot the malware will operate:\n\nThe threat actors behind the new ransomware have filtered Belarusia(BY), Russia(RU), and\nUkraine(UA), in order to impede operation if the ransomware is executed from one of these\n[countries. This is similar to the QNAPCrypt implant Anomali previously reported on:](https://www.anomali.com/blog/the-ech0raix-ransomware)\n\n\n-----\n\nThe overall functionality of the ransomware remains similar to QNAPCrypt. The main\nconfiguration of the ransomware is static and hard-coded within the binary, much like the\nlatest version of QNAPCrypt.\n\nAs is similar to the original QNAPCrypt samples, the algorithm the attackers chose to\nencrypt the filesystem with is AES CFB. One noticeable difference is the main ransom note\ndoesn’t advertise a specific bitcoin wallet like it did in the original QNAPCrypt samples.\nInstead, the attackers demand to be contacted via a protonmail email account:\n\nThe email address provided is “fullofdeep”, and the ransom note annotates ‘CONTACT US’.\nThese strings draw us to the conclusion that this is a Russian cybercrime group referred to\nas FullOfDeep, and that the group is deploying different ransomware campaigns. Based on\nthe samples’ overlaps, including both ransomware were written in Go, and in addition to\nsimilarities in the implant function naming convention and the geolocation filtering applied,\nwe can assess with high confidence that this new ransomware sample is operated by the\nsame authors behind the original QNAPCrypt campaigns.\n\n**Summary**\n\nIn July, we identified and temporarily seized 15 active QNAPCrypt ransomware campaigns\ntargeting Linux-based file storage systems (NAS servers). This discovery was significant in\nthat it’s rare to see ransomware being used to target the Linux-operating system.\n\nWhile we prevented the malware from infecting additional victims, we have since hunted for\nand detected a new ransomware that shares many similarities with the previous\nQNAPCrypt samples We can assess with high confidence that FullofDeep a new Russian\n\n\n-----\n\ncybercrime group specializing in ransomware operations, is behind both the original\nQNAPCrypt campaigns and the newly identified ransomware instance.\n\nIn addition, both the original and new QNAPCrypt samples are indexed in Intezer Analyze’s\ncode genome database. If you have a suspicious file that you suspect to be QNAPCrypt,\n[you can upload it to the free Intezer Analyze community edition in order to view the verdict,](https://analyze.intezer.com/#/)\ncode and string reuse, and more.\n\nPlease refer to the mitigation recommendations section in our blog post titled, Why we\nShould be Paying More Attention to Linux Threats, for best practices Linux users can adopt\nin order to mitigate the threats posed by QNAPCrypt and other Linux-based threats.\n\n**IOCs**\n50470f94e7d65b50bf00d7416a9634d9e4141c5109a78f5769e4204906ab5f0b\nfullofdeep@protonmail.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-09-20 - Russian Cybercrime Group FullofDeep Behind QNAPCrypt Ransomware Campaigns.pdf"
    ],
    "report_names": [
        "2019-09-20 - Russian Cybercrime Group FullofDeep Behind QNAPCrypt Ransomware Campaigns.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535750,
    "ts_updated_at": 1743041167,
    "ts_creation_date": 1653708070,
    "ts_modification_date": 1653708070,
    "files": {
        "pdf": "https://archive.orkl.eu/494eb8af730d22468c0196ca81bddb5c5dbcdc58.pdf",
        "text": "https://archive.orkl.eu/494eb8af730d22468c0196ca81bddb5c5dbcdc58.txt",
        "img": "https://archive.orkl.eu/494eb8af730d22468c0196ca81bddb5c5dbcdc58.jpg"
    }
}