{
    "id": "9666dc4c-a7f1-444b-813a-33cfa07d5ab4",
    "created_at": "2023-01-12T15:05:28.452108Z",
    "updated_at": "2025-03-27T02:09:17.982875Z",
    "deleted_at": null,
    "sha1_hash": "039b53ab6ba9881d6e8d122f025312082a7e3d11",
    "title": "2021-11-07 - Who Will Bend the Knee in RaaS Game of Thrones in 2022-",
    "authors": "",
    "file_creation_date": "2022-05-28T00:45:11Z",
    "file_modification_date": "2022-05-28T00:45:11Z",
    "file_size": 75944,
    "plain_text": "# Who Will Bend the Knee in RaaS Game of Thrones in 2022?\n\n**[mcafee.com/blogs/enterprise/mcafee-enterprise-atr/who-will-bend-the-knee-in-raas-game-of-thrones-in-2022/](https://www.mcafee.com/blogs/enterprise/mcafee-enterprise-atr/who-will-bend-the-knee-in-raas-game-of-thrones-in-2022/)**\n\n## Stories\n\nThe latest cybersecurity trends, best practices,\n\nsecurity vulnerabilities, and more\n\n**ARCHIVED STORY**\n\nBy John Fokker and Raj Samani · November 07, 2021\n\n_McAfee Enterprise and FireEye recently released its 2022 Threat Predictions._ _In this blog,_\n_we take a deeper dive into a Game of Thrones power struggle among Ransomware-as-a-_\n_Service bad actors in 2022._\n\n## Prediction: Self-reliant cybercrime groups will shift the balance of power within the RaaS eco-kingdom.\n\nFor several years, ransomware attacks have dominated the headlines as arguably the most\n[impactful cyber threats. The Ransomware-as-a-Service (RaaS) model at the time opened](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-the-all-stars/)\nthe cybercrime career path to lesser skilled criminals which eventually led to more breaches\nand higher criminal profits.\n\nFor a long time, RaaS admins and developers were prioritized as the top targets, often\nneglecting the affiliates since they were perceived as less skilled. This, combined with the\nlack of disruptions in the RaaS ecosystem, created an atmosphere where those lesserskilled affiliates could thrive and grow into very competent cybercriminals, eventually with a\nmind of their own.\n\nIn a response to the Colonial Pipeline attack, the popular cybercrime forums have banned\nransomware actors from advertising. Now, the RaaS groups no longer have a thirdparty platform on which to actively recruit, show their seniority, offer escrow, have their\nbinaries tested by moderators, or settle disputes. The lack of visibility has made it harder for\nRaaS groups to establish or maintain credibility and will make it harder for RaaS developers\nto maintain their current top tier position in the underground.\n\n\n-----\n\nThese events have undermined their trusted position. Ransomware has generated billions\nof dollars in recent years and it’s only a matter of time before more individuals who believe\nthey aren’t getting their fair share become unhappy.\n\n[The first signs of this happening are already visible as described in our blog on the Groove](https://www.mcafee.com/blogs/enterprise/mcafee-enterprise-atr/how-groove-gang-is-shaking-up-the-ransomware-as-a-service-market-to-empower-affiliates/)\nGang, a cyber-criminal gang that branched off from classic RaaS to specialize in computer\nnetwork exploitation (CNE), exfiltrate sensitive data and, if lucrative, partner with a\nransomware team to encrypt the organization’s network. McAfee Enterprise ATR believes,\nwith high confidence, that the Groove gang is associated with the Babuk gang, either as a\nformer affiliate or subgroup. These cybercriminals are happy to put aside previous\nRansomware-as-a-Service hierarchies to focus on the ill-gotten gains to be made from\ncontrolling victim’s networks, rather than the previous approach which prioritized control of\nthe ransomware itself.\n\nTrust in a few things remains important even among cybercriminals underground, such as\nkeeping your word and paying people what they deserve. Cybercriminals aren’t immune\nfrom feeling like employees whose contributions aren’t being adequately rewarded. When\nthis happens, these bad actors cause problems within the organization. Ransomware has\nbeen generating billions of dollars in recent years and with revenue like that, it was\ninevitable that some individuals who believe they aren’t getting their fair share become\nunhappy and let the cybercrime world know it.\n\nRecently, a former Conti affiliate was unhappy with their financial portion and decided to\ndisclose the complete Conti attack playbook and their Cobalt Strike infrastructure online. In\nthe past, McAfee ATR has been approached by individuals affiliated with certain RaaS\ngroups expressing grudges with other RaaS members and admins, claiming they haven’t\nbeen paid in time or that their share wasn’t proportionate to the amount of work they put in.\n\nIn 2022, expect more self-reliant cybercrime groups to rise and shift the balance of power\nwithin the RaaS eco-climate from those who control the ransomware to those who control\nthe victim’s networks.\n\n## Less-skilled Operators Won’t Have to Bend the Knee in RaaS Model Power Shift\n\nThe Ransomware-as-a-Service eco system has evolved with the use of affiliates, the\nmiddlemen and women that work with the developers for a share of the profits. While this\nstructure was honed during the growth of GandCrab, we are witnessing potential chasms in\nwhat is becoming a not-so-perfect union.\n\nHistorically, the ransomware developers, held the cards, thanks to their ability to selectively\ndetermine the affiliates in their operations, even holding “job interviews” to establish\n[technical expertise. Using CTB locker as an example, prominence was placed on affiliates](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/advanced-threat-research/)\ngenerating sufficient installs via a botnet, exploit kits or stolen credentials. But affiliates\n\n\n-----\n\nrecently taking on the role and displaying the ability to penetrate and compromise a\ncomplete network using a variety of malicious and non-malicious tools essentially changed\nthe typical affiliate profile towards a highly skilled pen-tester/sysadmin.\n\nThe hierarchy of a conventional organized crime group often is described as a pyramid\nstructure. Historically, La Cosa Nostra, drug cartels and outlaw motor gangs were organized\nin such a fashion. However, due to further professionalization and specialization of the\nlogistics involved with committing crime, groups have evolved into more opportunistic\nnetwork-based groups that will work together more fluidly, according to their current needs.\n\nWhile criminals collaborating in the world of cybercrime isn’t new, a RaaS group’s hierarchy\nhas been more rigid compared to other forms of cybercrime, due to the power imbalance\nbetween the group’s developers/admins and affiliates. But things are changing. RaaS\nadmins and developers were prioritized as the top targets, but often neglected the affiliates\nwho they perceived to be less-skilled. This, combined with the lack of disruptions in the\nRaaS ecosystem, created an atmosphere where those lesser-skilled affiliates could thrive\nand grow into very competent cybercriminals.\n\nAs more ransomware players have entered the market, we suspect that the most talented\naffiliates are now able to auction their services for a bigger part of the profits, and maybe\ndemand a broader say in operations. For example, the introduction of Active Directory\nenumeration within DarkSide ransomware could be intended to remove the dependency on\nthe technical expertise of affiliates. These shifts signal a potential migration back to the\nearly days of ransomware, with less-skilled operators increasing in demand using the\nexpertise encoded by the ransomware developers.\n\nWill this work? Frankly, it will be challenging to replicate the technical expertise of a skilled\npenetration tester, and maybe – just maybe – the impact will not be as severe as recent\ncases.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-07 - Who Will Bend the Knee in RaaS Game of Thrones in 2022-.pdf"
    ],
    "report_names": [
        "2021-11-07 - Who Will Bend the Knee in RaaS Game of Thrones in 2022-.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535928,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653698711,
    "ts_modification_date": 1653698711,
    "files": {
        "pdf": "https://archive.orkl.eu/039b53ab6ba9881d6e8d122f025312082a7e3d11.pdf",
        "text": "https://archive.orkl.eu/039b53ab6ba9881d6e8d122f025312082a7e3d11.txt",
        "img": "https://archive.orkl.eu/039b53ab6ba9881d6e8d122f025312082a7e3d11.jpg"
    }
}