{
    "id": "9668937d-dce3-47cf-81f3-f8489e734436",
    "created_at": "2023-01-12T15:02:10.516562Z",
    "updated_at": "2025-03-27T02:11:39.787525Z",
    "deleted_at": null,
    "sha1_hash": "7d81b8ce000b193bbd507e3bc69107f3b220c4c1",
    "title": "2021-03-16 - ‘I scrounged through the trash heaps… now I’m a millionaire-’ An interview with REvil’s Unknown",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:53Z",
    "file_modification_date": "2022-05-28T19:41:53Z",
    "file_size": 868627,
    "plain_text": "# ‘I scrounged through the trash heaps… now I’m a millionaire:’ An interview with REvil’s Unknown\n\n**[therecord.media/i-scrounged-through-the-trash-heaps-now-im-a-millionaire-an-interview-with-revils-unknown/](https://therecord.media/i-scrounged-through-the-trash-heaps-now-im-a-millionaire-an-interview-with-revils-unknown/)**\n\nMarch 16, 2021\n\n[Dmitry Smilyanets](https://therecord.media/author/dmitry-smilyanets/)\nMarch 16, 2021\n\nEditor’s Note: It’s undeniable that ransomware is the big moneymaker in cybercrime right\nnow. And some groups looking to make a fortune are aggressively pushing the boundaries\nby raising their demands to seven or eight-figure sums, threatening to release data online if\npayments aren’t made, and targeting hospitals and other vulnerable organizations.\n\nOne group that has gained prominence for its audacious and lucrative tactics is REvil, also\nknown as Sodinokibi. The group runs a ransomware-as-a-service operation, in which\ndevelopers sell malware to affiliates who use it to lock up an organization’s data and\ndevices.\n\nIn addition to publishing victim data online when companies don’t pay demands, REvil has\nattracted attention for trying to [extort then-President Donald Trump and claiming to bring in](https://www.forbes.com/sites/daveywinder/2020/05/15/hackers-claim-to-have-trumps-dirty-laundry-and-demand-42-million-to-keep-quiet/?sh=144810537d1b)\n$100 million in revenue from their operations. And according to an REvil representative that\nuses the alias “Unknown,” the group has big plans for 2021.\n\n\n-----\n\nSome of Unknown s claims, like affiliates with access to ballistic missile launch systems and\n[nuclear power plants, seem outlandish—until you read reports that make them seem eerily](https://www.politico.com/news/2020/12/17/nuclear-agency-hacked-officials-inform-congress-447855)\n[plausible. The Record is not able to verify the assertions. Unknown talked to Recorded](https://www.nytimes.com/2020/10/23/us/politics/energetic-bear-russian-hackers.html)\nFuture expert threat intelligence analyst Dmitry Smilyanets recently about using ransomware\nas a weapon, staying out of politics, experimenting with new tactics, and much more. The\ninterview was conducted in Russian and translated to English with the help of a professional\ntranslator, and has been edited for clarity.\n\n**Dmitry Smilyanets: Unknown, how did you decide to get into the business of**\n**ransomware?**\n\n**Unknown: Speaking personally, it was a long time ago. Since 2007, when there were**\nwinlockers and SMS. Even then, it brought a good profit.\n\n**DS: You had a $1 million deposit on a hacking forum and mentioned $100 million in**\n**revenue—considering you get payments in cryptocurrency, then today you probably**\n**have half a billion dollars. How much is enough to make you quit ransomware?**\n\n**UNK: You counted everything correctly. The deposit was withdrawn precisely because of the**\nexchange rate. For me personally, there is no ceiling amount. I just love doing it and making\na profit from it. There is never too much money—but there’s always the risk of not enough\nmoney. Although, if we talk about advertisers, one felt that $50 million U.S. was enough and\nhe retired. However, after four months he returned—turned out that wasn’t enough money.\nThink about it.\n\nFor me personally, there is no ceiling amount. I just love doing it and making a profit\nfrom it. There is never too much money—but there’s always the risk of not enough\nmoney.”\n\n**DS: You previously said that you remain apolitical, and are purely financially**\n**motivated. But if you do decide that you’ve made enough money, could your point of**\n**view change and you decide to impact geopolitics?**\n\n**UNK: I don’t really want to be a bargaining chip. We brushed up against politics and nothing**\ngood came of it—only losses. With the current geopolitical relationships, everything is very\nbeneficial for us even without any interference.\n\n**DS: What makes REvil so special? The code? Affiliates? Media attention?**\n\n**UNK: I think it’s all of that working together. For example, this interview. It seems like, why**\nwould we even need it? On the other hand, better we give it than our competitors. Unusual\nideas, new methods, and brand reputation all give good results. As I said, we are creating a\nnew branch of development for extortion. If you look at the competitors, unfortunately, many\npeople simply copy our ideas and what is most surprising—the style of the text of our\nmessages. It’s nice—they try to show that they are as good as us, trying to reach the level\n\n\n-----\n\nand even striving to surpass in somethings. And in some things they are already better. For\nexample, with those Linux versions and so on. But this is temporary. Of course, we are\nworking on all of this as well, but with one caveat—it will all be much better. Therefore, a little\nbit slower.\n\nREvil uses its dark web “Happy Blog” to publicize data auctions for ransomware victims who\nhave not paid demands.\n**DS: Elliptic Curve Cryptography (ECC) was a really good choice [editor’s note: ECC**\n**has a smaller key size than the RSA-based public-key system, which makes it**\n**attractive to affiliates] what else are you proud of, what part of the code? How do you**\n**decide when it’s time for new features in the code?**\n\n**UNK: A search by IOCP [Input/output completion port], a back connection borrowed from**\ncrabs [carders], a server-side protection system—there are many advantages, it is better to\nread AV reviews. Personally, I really like the encryption system. It came out almost perfect.\n\n**DS: I have been impressed with the variety of packers and crypters I’ve seen with your**\n**malware. Do you sell them to others? I saw one used in a Maze malware sample once.**\n**Do you sell them or did one of your employees move to a competitor?**\n\n\n-----\n\n**UNK: Partners often switch affiliate programs and because of this, there is that kind of**\nvariety.\n\n**DS: Pavel Sitnikov said that you bought the GandCrab code from Maksim Plakhtiy, is**\n**this true?**\n\n**UNK: It’s true that we bought it, but the names and so on are unknown to us. Even if it was**\nthe Rotten Gene, we don’t care.\n\n**DS: Do you believe that ransomware is a perfect weapon for cyberwar? Are you afraid**\n**that one day it could start a real war?**\n\n**UNK: Yes, as a weapon it can be very destructive. Well, I know at the very least that several**\naffiliates have access to a ballistic missile launch system, one to a U.S. Navy cruiser, a third\nto a nuclear power plant, and a fourth to a weapons factory. It is quite feasible to start a war.\nBut it’s not worth it—the consequences are not profitable.\n\nAs a weapon [ransomware] can be very destructive… It is quite feasible to start a war.\nBut it’s not worth it—the consequences are not profitable.”\n\n**DS: What other regions besides the CIS [mainly comprised of post-Soviet republics]**\n**do you try to avoid? What organizations never pay?**\n\n**UNK: All the CIS, including Georgia and Ukraine. Primarily because of geopolitics. Secondly**\nbecause of the laws. Thirdly, for some, because of patriotism. Very poor countries don’t pay\n—India, Pakistan, Afghanistan, and so on.\n\n**DS: You previously mentioned that you and your affiliates understand the risks of**\n**going abroad and don’t travel. Do you think there can be a “winds of change” and**\n**local law enforcement will start paying attention to your operations?**\n\n**UNK: If we get into politics, yes. If we look at the countries in the CIS, yes. For everything**\nelse—we remain neutral.\n\n**DS: Do old-school criminals cause any issues?**\n\n**UNK: They don’t.**\n\n**DS: What’s your usual reaction when you see a ransomware gang or affiliate getting**\n**charged or arrested? Netwalker and Egregor reduced their operations since the raids,**\n**how do you feel about that?**\n\n**UNK: Neutral. This is a normal workflow. Due to the closure of the Maze, we have only**\nincreased the number of promising affiliates. So for us, I would say it is positive, in a way.\n\n**DS: What was the highest number of affiliates you had at any one time?**\n\n\n-----\n\n**UNK: 60.**\n\n**DS: When they leave, is it because they’re done with ransomware or because they**\n**jump ship to another ransomware-as-a-service for better rates? Does it create any**\n**issues or problems for you when an affiliate moves to a competitor?**\n\n**UNK: There are definitely two sides to this. 30% leave because they have earned enough.**\nBut naturally, they always come back sooner or later. Otherwise, yes, they go to competitors\nwho dump the rates (up to 90% and so on). Of course, this is unpleasant, but this is\ncompetition. It means that we need to make sure that people return. Give them what others\ndon’t.\n\n**DS: Some operators give a percentage of their earnings to charities. What’s your**\n**opinion on this? Who would you like to donate a million to?**\n\n**UNK: Free projects for anonymity.**\n\n**DS: How has your interaction with victim organizations changed since the beginning**\n**of the pandemic?**\n\n**UNK: It’s definitely changed. The crisis is palpable, they are not able to pay the same**\namounts as before. Except for manufacturers of pharmaceutical products. I think it is worth\npaying more attention to them. They are doing just fine. We need to help them.\n\n**DS: Do your operators target organizations that have cyber insurance?**\n\n**UNK: Yes, this is one of the tastiest morsels. Especially to hack the insurers first—to get their**\ncustomer base and work in a targeted way from there. And after you go through the list, then\nhit the insurer themselves.\n\n**DS: How do you treat ransomware negotiators? Is it easier to deal with professionals?**\n**Do they help or make it more difficult?**\n\n\n-----\n\nthis is one of the tastiest morsels. Especially to hack the insurers first—to get their\ncustomer base and work in a targeted way from there. And after you go through the\nlist, then hit the insurer themselves.”\n\n**UNK: 70% are just there to knock down the price. Very often they make it harder. Well, for**\nexample, the company has a revenue of $1 billion. They are being ransomed for $1 million.\nThe negotiator comes and says, we don’t care, we won’t give more than $15,000. We reduce\nthe price to $900,000. He offers $20,000. Well, then we understand that the conversation\nwith him is meaningless and we start publishing the data so that the owners of the network\nsmack him upside the head for negotiating like that. And of course, after those kinds of tricks,\nthe price tag only goes up. Instead of $1 million, they will pay one-and-a-half. Nobody likes\nhagglers, especially show-offs. So, more often than not, they are likely to do more harm.\nThey only help purely in buying BTC or Monero. The rest is harmful.\n\n**DS: Do you recommend any specific negotiators to the compromised businesses or**\n**do they act on their own? Not everyone has 100 BTC on hand to buy out the data and**\n**it’s not that easy to get on short notice.**\n\nTo finish off with DDoS is to kill the company. Literally. I also think we will expand this\ntactic to persecution of the CEO and/or founder of the company.”\n\n**UNK: We write to decent intermediaries to let them know the target so that they can reach**\nout themselves. We give good discounts to decent intermediaries so that they can make a bit\nof profit and the companies pay less. And in terms of deadlines—we can always give some\nextra time. In general, if there is an understanding that you have to pay, no other options, but\nnot as much, we will find a common language. But if we get delusional messages like, “There\nis no money” or, “We will pay one-tenth,” you have no one to blame but yourself.\n\n\n-----\n\nReferences to REvil attacks gathered from private and underground sources. Courtesy of\nRecorded Future.\n**DS: You said that you like to apply additional pressure through DDoS [editor’s note:**\n**distributed denial-of-service attacks involve flooding a site with junk traffic, making it**\n**unreachable]. How effective is this scheme?**\n\n**UNK: We do not use it often, in contrast to calls. Calling gives a very good result. We call**\neach target as well as their partners and journalists—the pressure increases significantly.\nAnd after that, if you start publishing files, well, it is absolutely gorgeous. But to finish off with\nDDoS is to kill the company. Literally. I also think we will expand this tactic to persecution of\nthe CEO and/or founder of the company. Personal OSINT, bullying. I think this will also be a\nvery fun option. But victims need to understand that the more resources we spend before\nyour ransom is paid—all this will be included in the cost of the service. =)\n\n**DS: Tell me a secret.**\n\n**UNK: As a child, I scrounged through the trash heaps and smoked cigarette butts. I walked**\n10 km one way to the school. I wore the same clothes for six months. In my youth, in a\ncommunal apartment, I didn’t eat for two or even three days. Now I am a millionaire.\n\n\n-----\n\nMission-driven and Russian-speaking intelligence analyst with type A personality. Dmitry\nhas twenty years of experience and expertise in cybercrime activity that includes being a\nformer member of an elite Russian-based hacking organization.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-16 - ‘I scrounged through the trash heaps… now I’m a millionaire-’ An interview with REvil’s Unknown.pdf"
    ],
    "report_names": [
        "2021-03-16 - ‘I scrounged through the trash heaps… now I’m a millionaire-’ An interview with REvil’s Unknown.pdf"
    ],
    "threat_actors": [
        {
            "id": "72d09c17-e33e-4c2f-95db-f204848cc797",
            "created_at": "2022-10-25T15:50:23.832551Z",
            "updated_at": "2025-03-27T02:00:55.554841Z",
            "deleted_at": null,
            "main_name": "FIN8",
            "aliases": [
                "FIN8",
                "Syssphinx"
            ],
            "source_name": "MITRE:FIN8",
            "tools": [
                "BADHATCH",
                "PUNCHBUGGY",
                "Ragnar Locker",
                "PUNCHTRACK",
                "dsquery",
                "Nltest",
                "Sardonic",
                "PsExec",
                "Impacket"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "fc80a724-e567-457c-82bb-70147435e129",
            "created_at": "2022-10-25T16:07:23.624289Z",
            "updated_at": "2025-03-27T02:02:09.892602Z",
            "deleted_at": null,
            "main_name": "FIN8",
            "aliases": [
                "ATK 113",
                "Syssphinx"
            ],
            "source_name": "ETDA:FIN8",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BadHatch",
                "BlackCat",
                "Noberus",
                "PSVC",
                "PUNCHTRACK",
                "PoSlurp",
                "Powersniff",
                "PunchBuggy",
                "Ragnar Locker",
                "RagnarLocker",
                "Sardonic",
                "ShellTea"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5bdde906-0416-42ee-9100-5ebd95dda77a",
            "created_at": "2023-01-06T13:46:38.601977Z",
            "updated_at": "2025-03-27T02:00:02.870694Z",
            "deleted_at": null,
            "main_name": "FIN8",
            "aliases": [
                "ATK113",
                "G0061"
            ],
            "source_name": "MISPGALAXY:FIN8",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535730,
    "ts_updated_at": 1743041499,
    "ts_creation_date": 1653766913,
    "ts_modification_date": 1653766913,
    "files": {
        "pdf": "https://archive.orkl.eu/7d81b8ce000b193bbd507e3bc69107f3b220c4c1.pdf",
        "text": "https://archive.orkl.eu/7d81b8ce000b193bbd507e3bc69107f3b220c4c1.txt",
        "img": "https://archive.orkl.eu/7d81b8ce000b193bbd507e3bc69107f3b220c4c1.jpg"
    }
}