{
    "id": "969fd140-096a-4630-81df-7ab47869fcd0",
    "created_at": "2023-01-12T15:05:48.628269Z",
    "updated_at": "2025-03-27T02:05:35.908465Z",
    "deleted_at": null,
    "sha1_hash": "2f1f4112584b33b3ead69b79052f3165f450cdbd",
    "title": "2021-07-19 - Fighting an emerging cybercrime trend",
    "authors": "",
    "file_creation_date": "2022-05-28T02:43:37Z",
    "file_modification_date": "2022-05-28T02:43:37Z",
    "file_size": 1288136,
    "plain_text": "# Fighting an emerging cybercrime trend\n\n**[blogs.microsoft.com/on-the-issues/2021/07/19/cybercrime-homoglyphs-dcu-court-order/](https://blogs.microsoft.com/on-the-issues/2021/07/19/cybercrime-homoglyphs-dcu-court-order/)**\n\nJuly 19, 2021\n\nOn July 16, Microsoft’s Digital Crimes Unit (DCU) again secured a court order to take down\nmalicious infrastructure used by cybercriminals. As we continually explore new ways to\ncombat emerging trends and techniques to better protect our customers, we filed this case to\ntarget the use of “homoglyph” – or imposter – domains that are increasingly being used in a\nvariety of attacks. As a result, a judge in the Eastern District of Virginia issued a court order\nrequiring domain registrars to disable service on malicious domains that have been used to\nimpersonate Microsoft customers and commit fraud.\n\nThese malicious homoglyphs exploit similarities of alpha-numeric characters to create\ndeceptive domains to unlawfully impersonate legitimate organizations. For example, a\nhomoglyph domain may utilize characters with shapes that appear identical or very similar to\nthe characters of a legitimate domain, such as the capital letter “O” and the number “0” (e.g.\nMICROSOFT.COM vs. MICR0S0FT.COM) or an uppercase “I” and a lowercase “l” (e.g.\nMICROSOFT.COM vs. MlCROSOFT.COM). We continue to see this technique used in\n[business email compromise (BEC), nation state activity, malware and ransomware](https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/business-email-uncompromised-part-one/ba-p/2159900)\n[distribution, often combined with credential phishing and account compromise to deceive](https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/business-email-uncompromised-part-two/ba-p/2167246)\nvictims and infiltrate customer networks.\n\n\n-----\n\nThis case started with a single customer complaint regarding BEC, and our investigation\nrevealed that this criminal group had created 17 additional malicious homoglyph domains\nthat were registered with third parties. The targets are predominantly small businesses\noperating in North America across several industries. Based on the techniques deployed, the\ncriminals appear to be financially motivated, and we believe they are part of an extensive\nnetwork that appears to be based out of West Africa.\n\nIn this BEC attack, these fraudulent domains, together with stolen customer credentials,\nwere used by cybercriminals to unlawfully access and monitor accounts. The group\nproceeded to gather intelligence to impersonate these customers in an attempt to trick\nvictims into transferring funds to the cybercriminals. Once the criminals gained access to a\nnetwork, they imitated customer employees and targeted their trusted networks, vendors,\ncontractors and agents in an effort to deceive them into sending or approving fraudulent\nfinancial payments.\n\nIn this instance, the criminals identified a legitimate email communication from the\ncompromised account of an Office 365 customer referencing payment issues and asking for\nadvice on processing payments. The criminals capitalized on this information and sent an\nimpersonation email from a homoglyph domain using the same sender name and nearly\n_identical domain. The only difference between the genuine communication and the imposter_\ncommunication was a single letter changed in the mail exchange domain, done to escape\nnotice of the recipient and deceive them into believing the email was a legitimate\ncommunication from a known trusted source. As seen in the example below, these criminals\nused the same subject line and format of an email from the earlier, legitimate conversation,\nbut falsely claimed a hold had been placed on the account by the CFO, time was running out\nand payment needed to be received as soon as possible.\n\n\n-----\n\nOften, once detected or addressed by Microsoft through technical means, these criminals\nmove their malicious infrastructure outside the Microsoft ecosystem and onto third-party\nservices in an attempt to continue their illegal activities. With this case, we secured an order\nwhich eliminates the defendants’ ability to move these domains to other providers. The\naction will further allow us to diminish the criminals’ capabilities and, more importantly, obtain\nadditional evidence to undertake further disruptions inside and outside court. This disruption\neffort follows 23 previous legal actions against malware and nation-state groups that we’ve\ntaken in collaboration with law enforcement and other partners since 2010.\n\nMicrosoft goes to great lengths to protect customer accounts. Office 365 uses real-time antispam and multiple anti-malware engines to prevent threats from reaching their inboxes.\nMicrosoft also offers [Defender for Office 365, which helps protect customers against new,](https://docs.microsoft.com/en-us/office365/servicedescriptions/office-365-advanced-threat-protection-service-description)\nsophisticated attacks in real time. When we identify customer accounts that have been\ntargeted or compromised, such as the ones in today’s court order, or where our\ninvestigations uncover homoglyph domains impersonating customers, we provide notice\nthrough the [Microsoft 365 Message Center.](https://docs.microsoft.com/en-us/microsoft-365/admin/manage/message-center?view=o365-worldwide)\n\n\n-----\n\n[Cybercriminals are getting more sophisticated.](https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/) [Microsoft s Digital Crimes Unit will continue to](https://news.microsoft.com/on-the-issues/topic/digital-crimes-unit/)\nfight cybercrime with our comprehensive efforts to disrupt the malicious infrastructure used\nby criminals, through referrals to law enforcement, civil legal actions on behalf of our\ncustomers such as this one, or technical measures in partnership with our product and\nservice teams. Organizations should regularly check for messages in the Microsoft 365\n[Message Center and can follow these steps to prevent BEC attacks.](https://techcommunity.microsoft.com/t5/microsoft-defender-for-office/business-email-uncompromised-part-three/ba-p/2247693)\n\nTags: [business email compromise,](https://blogs.microsoft.com/on-the-issues/tag/business-email-compromise/) [cybersecurity,](https://blogs.microsoft.com/on-the-issues/tag/cybersecurity-2/) [Digital Crimes Unit,](https://blogs.microsoft.com/on-the-issues/tag/digital-crimes-unit/) [homoglyphs,](https://blogs.microsoft.com/on-the-issues/tag/homoglyphs/) [malware,](https://blogs.microsoft.com/on-the-issues/tag/malware/)\n[phishing](https://blogs.microsoft.com/on-the-issues/tag/phishing/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-19 - Fighting an emerging cybercrime trend.pdf"
    ],
    "report_names": [
        "2021-07-19 - Fighting an emerging cybercrime trend.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535948,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653705817,
    "ts_modification_date": 1653705817,
    "files": {
        "pdf": "https://archive.orkl.eu/2f1f4112584b33b3ead69b79052f3165f450cdbd.pdf",
        "text": "https://archive.orkl.eu/2f1f4112584b33b3ead69b79052f3165f450cdbd.txt",
        "img": "https://archive.orkl.eu/2f1f4112584b33b3ead69b79052f3165f450cdbd.jpg"
    }
}