{
    "id": "96cbe7ad-7570-4659-8a7c-8ec267787a6c",
    "created_at": "2023-01-12T15:07:11.530551Z",
    "updated_at": "2025-03-27T02:15:46.10074Z",
    "deleted_at": null,
    "sha1_hash": "8f6d27049fd526c16200161e5917e3354ad4800d",
    "title": "2015-02-16 - How “omnipotent” hackers tied to NSA hid for 14 years—and were found at last",
    "authors": "",
    "file_creation_date": "2022-05-28T01:56:06Z",
    "file_modification_date": "2022-05-28T01:56:06Z",
    "file_size": 1510881,
    "plain_text": "# How “omnipotent” hackers tied to NSA hid for 14 years— and were found at last\n\n**arstechnica.com/information-technology/2015/02/how-omnipotent-hackers-tied-to-the-nsa-hid-for-14-years-and-were-**\nfound-at-last/\n\nDan Goodin\n\n[Enlarge](https://cdn.arstechnica.net/wp-content/uploads/2015/02/equation-group2.jpg)\nAurich Lawson\nCANCUN, Mexico — In 2009, one or more prestigious researchers received a CD by mail\nthat contained pictures and other materials from a recent scientific conference they attended\nin Houston. The scientists didn't know it then, but the disc also delivered a malicious payload\ndeveloped by a highly advanced hacking operation that had been active since at least 2001.\nThe CD, it seems, was tampered with on its way through the mail.\n\nIt wasn't the first time the operators—dubbed the \"Equation Group\" by researchers from\nMoscow-based Kaspersky Lab—had secretly intercepted a package in transit, boobytrapped its contents, and sent it to its intended destination. In 2002 or 2003, Equation Group\nmembers did something similar with an Oracle database installation CD in order to infect a\ndifferent target with malware from the group's extensive library. (Kaspersky settled on the\nname Equation Group because of members' strong affinity for encryption algorithms,\nadvanced obfuscation methods, and sophisticated techniques.)\n\n\n-----\n\nKaspersky researchers have documented 500 infections by Equation Group in at least 42\ncountries, with Iran, Russia, Pakistan, Afghanistan, India, Syria, and Mali topping the list.\nBecause of a self-destruct mechanism built into the malware, the researchers suspect that\nthis is just a tiny percentage of the total; the actual number of victims likely reaches into the\ntens of thousands.\n\n[Enlarge](https://cdn.arstechnica.net/wp-content/uploads/2015/02/Victims-map.png)\nA long list of almost superhuman technical feats illustrate Equation Group's extraordinary\nskill, painstaking work, and unlimited resources. They include:\n\nThe use of [virtual file systems, a feature also found in the highly sophisticated Regin](https://en.wikipedia.org/wiki/Virtual_file_system)\nmalware. Recently published documents provided by Ed Snowden indicate that the\n[NSA used Regin to infect the partly state-owned Belgian firm Belgacom.](http://www.wired.com/2014/11/mysteries-of-the-malware-regin/)\nThe stashing of malicious files in multiple branches of an infected computer's registry.\nBy encrypting all malicious files and storing them in multiple branches of a computer's\nWindows registry, the infection was impossible to detect using antivirus software.\nRedirects that sent iPhone users to unique exploit Web pages. In addition, infected\nmachines reporting to Equation Group command servers identified themselves as\nMacs, an indication that the group successfully compromised both iOS and OS X\ndevices.\nThe use of more than 300 Internet domains and 100 servers to host a sprawling\ncommand and control infrastructure.\n\n\n-----\n\nUSB stick-based reconnaissance malware to map air-gapped networks, which are so\nsensitive that they aren't connected to the Internet. Both Stuxnet and the related Flame\nmalware platform also had the ability to bridge airgaps.\nAn unusual if not truly novel way of bypassing code-signing restrictions in modern\nversions of Windows, which require that all third-party software interfacing with the\noperating system kernel be digitally signed by a recognized certificate authority. To\ncircumvent this restriction, Equation Group malware exploited a known vulnerability in\nan already signed driver for CloneCD to achieve kernel-level code execution.\n\nTaken together, the accomplishments led Kaspersky researchers to conclude that Equation\nGroup is probably the most sophisticated computer attack group in the world, with technical\n[skill and resources that rival the groups that developed Stuxnet and the](http://arstechnica.com/tech-policy/2011/07/how-digital-detectives-deciphered-stuxnet-the-most-menacing-malware-in-history/) Flame espionage\nmalware.\n\n\"It seems to me Equation Group are the ones with the coolest toys,\" Costin Raiu, director of\nKaspersky Lab's global research and analysis team, told Ars. \"Every now and then they\nshare them with the Stuxnet group and the Flame group, but they are originally available only\nto the Equation Group people. Equation Group are definitely the masters, and they are giving\nthe others, maybe, bread crumbs. From time to time they are giving them some goodies to\nintegrate into Stuxnet and Flame.\"\n\n## Further Reading\n\n[Puzzle box: The quest to crack the world’s most mysterious malware warhead](https://arstechnica.com/information-technology/2013/03/the-worlds-most-mysterious-potentially-destructive-malware-is-not-stuxnet/)\nIn an [exhaustive report published Monday at the](https://securelist.com/files/2015/02/Equation_group_questions_and_answers.pdf) [Kaspersky Security Analyst Summit here,](http://sas.kaspersky.com/)\nresearchers stopped short of saying Equation Group was the handiwork of the NSA—but\nthey provided detailed evidence that strongly implicates the US spy agency.\n\n[First is the group's known aptitude for conducting interdictions, such as](https://en.wikipedia.org/wiki/Interdiction) installing covert\nimplant firmware in a Cisco Systems router as it moved through the mail.\n\nSecond, a highly advanced keylogger in the Equation Group library refers to itself as \"Grok\"\nin its source code. The reference seems eerily similar to a line published last March in an\n_Intercept article headlined \"How the NSA Plans to Infect 'Millions' of Computers with_\nMalware.\" The article, which was based on Snowden-leaked documents, discussed an NSAdeveloped keylogger called Grok.\n\nThird, other Equation Group source code makes reference to \"STRAITACID\" and\n[\"STRAITSHOOTER.\" The code words bear a striking resemblance to \"STRAITBIZARRE,\"](https://nex.sx/blog/2015-01-27-everything-we-know-of-nsa-and-five-eyes-malware.html)\none of the most advanced malware platforms used by the NSA's Tailored Access Operations\nunit. Besides sharing the unconventional spelling \"strait,\" Snowden-leaked documents note\nthat STRAITBIZARRE could be turned into a disposable \"shooter.\" In addition, the codename\nFOXACID belonged to the same NSA malware framework as the Grok keylogger.\n\n\n-----\n\nApart from these shared code words, the Equation Group in 2008 used four zero-day\nvulnerabilities—including two that were later incorporated into Stuxnet.\n\nThe similarities don't stop there. Equation Group malware dubbed GrayFish encrypted its\n[payload with a 1,000-iteration hash of the target machine's unique NTFS object ID. The](http://blogs.technet.com/b/askcore/archive/2010/08/25/ntfs-file-attributes.aspx)\ntechnique makes it impossible for researchers to access the final payload without possessing\nthe raw disk image for each individual infected machine. The technique closely resembles\n[one used to conceal a potentially potent warhead in Gauss, a piece of highly advanced](http://arstechnica.com/security/2013/03/the-worlds-most-mysterious-potentially-destructive-malware-is-not-stuxnet/)\nmalware that shared strong technical similarities with both Stuxnet and Flame. (Stuxnet,\naccording to The New York Times, was a [joint operation between the NSA and Israel, while](http://arstechnica.com/tech-policy/2012/06/confirmed-us-israel-created-stuxnet-lost-control-of-it/)\nFlame, according to The Washington Post, was devised by the NSA, the CIA, and the Israeli\nmilitary.)\n\nBeyond the technical similarities to the Stuxnet and Flame developers, Equation Group\nboasted the type of extraordinary engineering skill people have come to expect from a spy\norganization sponsored by the world's wealthiest nation. One of the Equation Group's\nmalware platforms, for instance, rewrote the hard-drive firmware of infected computers—a\nnever-before-seen engineering marvel that worked on 12 drive categories from\nmanufacturers including Western Digital, Maxtor, Samsung, IBM, Micron, Toshiba, and\nSeagate.\n\nThe malicious firmware created a secret storage vault that survived military-grade disk\nwiping and reformatting, making sensitive data stolen from victims available even after\nreformatting the drive and reinstalling the operating system. The firmware also provided\nprogramming interfaces that other code in Equation Group's sprawling malware library could\naccess. Once a hard drive was compromised, the infection was impossible to detect or\nremove.\n\n\n-----\n\n[Enlarge / Forensics software displays some of the hard drives Equation Group was able to](https://cdn.arstechnica.net/wp-content/uploads/2015/02/hd-classes.jpg)\n\ncommandeer using malicious firmware.\nKaspersky Lab\nWhile it's simple for end users to re-flash their hard drives using executable files provided by\nmanufacturers, it's just about impossible for an outsider to reverse engineer a hard drive,\nread the existing firmware, and create malicious versions.\n\n\"This is an incredibly complicated thing that was achieved by these guys, and they didn't do it\nfor one kind of hard drive brand,\" Raiu said. \"It's very dangerous and bad because once a\nhard drive gets infected with this malicious payload it's impossible for anyone, especially an\nantivirus [provider], to scan inside that hard drive firmware. It's simply not possible to do\nthat.\"\n\n[Enlarge](https://cdn.arstechnica.net/wp-content/uploads/2015/02/EQ-Family.png)\n\n\n-----\n\nKaspersky Lab\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-16 - How “omnipotent” hackers tied to NSA hid for 14 years—and were found at last.pdf"
    ],
    "report_names": [
        "2015-02-16 - How “omnipotent” hackers tied to NSA hid for 14 years—and were found at last.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536031,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1653702966,
    "ts_modification_date": 1653702966,
    "files": {
        "pdf": "https://archive.orkl.eu/8f6d27049fd526c16200161e5917e3354ad4800d.pdf",
        "text": "https://archive.orkl.eu/8f6d27049fd526c16200161e5917e3354ad4800d.txt",
        "img": "https://archive.orkl.eu/8f6d27049fd526c16200161e5917e3354ad4800d.jpg"
    }
}