{
    "id": "974cfbb9-bd05-4b41-bd19-017464907a5d",
    "created_at": "2023-01-12T15:07:44.282749Z",
    "updated_at": "2025-03-27T02:05:55.048928Z",
    "deleted_at": null,
    "sha1_hash": "812f9efafacc827f9fc756ee1965e656a950b30d",
    "title": "2021-01-28 - Emotet disruption - Europol counterattack",
    "authors": "",
    "file_creation_date": "2022-05-28T19:07:40Z",
    "file_modification_date": "2022-05-28T19:07:40Z",
    "file_size": 353492,
    "plain_text": "# Emotet disruption - Europol counterattack\n\n**[hello.global.ntt/en-us/insights/blog/emotet-disruption-europol-counterattack](https://hello.global.ntt/en-us/insights/blog/emotet-disruption-europol-counterattack)**\n\nDan Saunders\n\n**The prolific Trojan known as Emotet, has been relentless over the past few years,**\n**infiltrating many organizations. However, recent disruption action on the part of**\n**authorities has taken the fight to the criminals behind it.**\n\n**On 27 January 2021, Europol (the European Union’s Law Enforcement Agency)**\n**announced 1** that in collaboration with international law enforcement agencies, they’ve\nsuccessfully penetrated the Emotet organized crime group (OCG) and seized control of\ncommand and control (C2) servers operating the botnet. Not only have the authorities,\nincluding the German Federal Police (Bundeskriminalamt), seized several C2 servers,\nauthorities in the Netherlands (Politie) have indicated they have seized databases used to\nstore credentials harvested by the malware. Additional agencies in the UK, US, Canada,\nUkraine, Lithuania and France participated in the operation, including carrying out raids in\nthe Ukraine on the administrators of the infrastructure operating the botnet. Victims can\nsubmit email addresses to the authorities to identify whether or not their details are present2\n\n\n-----\n\nin the database. This isn t the first time these authorities have been at the center of\nsignificant cyber-dependant crime-fighting activity, with both the German and Dutch\ndepartments having been instrumental in the takedown of the dark web ‘Wall Street Market’.3\n\n_The coordinated efforts of authorities are bearing fruit as more criminal networks are taken_\n_offline._\n\nThis is the second major proactive disruption activity carried out in recent months targeting\nsophisticated malware operational capabilities, following efforts in 2020 to takedown the\ncritical infrastructure operating TrickBot, led by Microsoft and with collaboration from security\npartners such as NTT. It should be noted that while it’s highly likely the malware developers\nor/and affiliates for Emotet will attempt to stand-up new C2 infrastructure in an effort to\nrelaunch their campaign, this is an important step in disrupting the day-to-day operations of\nthe botnet and by dismantling a significant portion of the botnet, reducing gateways for other\nmalware. Only time will tell if the operators are able to recover from this.\n\nFirst appearing in 2014, Emotet has been at the center of many security incidents over the\nyears, starting with a focus on stealing financial information as a banking Trojan and then\nevolving into one of the most dominant Trojan droppers of recent times, supporting other\nmalware families such as TrickBot  and QakBot (Qbot).4 5\n\n\n-----\n\nOur Digital Forensics & Incident Response (DFIR) team have first-hand experience of the\nseverity of the malware, having carried out multiple incident response engagements involving\nEmotet, followed by TrickBot, which then provides access for other threat actors operating\nransomware such as Ryuk. The remediation activities undertaken to contain and mitigate the\nthreats, is often intense and comprehensive in nature, due to the advanced capabilities of the\nmalware and the sophisticated techniques utilized to propagate it across an enterprise\nnetwork.\n\nIn recent months our threat researchers observed a resurgence of Emotet. After a short\nabsence prior at the end of 2020 there was a significant malspam campaign distributing\nspearphishing emails, focused on delivering the newly developed Emotet binaries in\nDecember 2020 and January 2021, with the common portable executable (.exe) binaries,\nreplaced by a dynamic link library (.dll). The malware is polymorphic in nature and often\ndifficult to detect and contain, due to the signatures consistently changing for different\npayloads. Spearphishing is the primary attack vector, used to entice victims to extract a\npassword protected archive file (.zip) and access a word document (.doc). Often the email\ncontent contains information previously harvested from email threads, appearing to align to\nlegitimate organizational communication. Once the word document is accessed, embedded\nmacros use Windows Management Instrumentation (WMI) to launch a sub-process of\nWmiPrvSe.exe, which is hidden obfuscated PowerShell code, aimed at dropping the Emotet\npayload onto the host via HTTP (port 80) GET requests.\n\n_Figure: Partial deobfuscated malicious PowerShell_\n\nThe malicious code depicted is typically a base-64 encoded string, unicode (UTF16-LE) and\nalso contains ‘+’ characters used to concatenate the strings. Once fully decoded, the code\ncontains readable strings, which instructs the operating system to attempt to connection to\nthe web address delivery URLs, used to drop the Emotet payload into folder directories in\ntemporary locations, such as %AppData%\\Local\\ and %AppData%\\Roaming\\. Once the\npayload is created in the file system, it’s executed via rundll32.exe.\n\n\n-----\n\nEmotet wastes no time in executing functions via legitimate Windows services and\nsubsequently carries out process injection, in an attempt to avoid detection. The malware\ncarries out preliminary discovery activities in order to gather intelligence from the infiltrated\nhost, using legitimate living off the land (LOLbins) tools such as net.exe and ipconfig.exe.\nPersistence is established via common methods such as the Windows registry autorun key.\nModules aimed at more intrusive techniques then focus on collecting email contacts and\nassociated threads, to assist with facilitating further spearphishing campaigns, while\nadditional processes are spawned, focusing on credential harvesting from web browsers and\nbrute-forcing local accounts, in an attempt to facilitate lateral movement at a later stage.\nCredentials are often exfiltrated via HTTP (port 80) POST requests to C2 infrastructure 6\nunder the control of the threat actor. Emotet aims to penetrate the network further, typically\nvia cracked credentials and exploiting vulnerable server message block (SMB) protocols\n(port 445), while facilitating access to additional threat actors in parallel.\n\nIt’s imperative organizations remain cautious, because despite the proactive operations\ntaking down critical infrastructure, the aforementioned malware distributed by Emotet\nremains active and additional threat actors may still remain within your network, utilizing\nother C2 infrastructure. Security researchers will now monitor the effect of the takedown\naction on the flow of malicious traffic, but nonetheless this is a significant landmark in the\nfight against one of the most dangerous malware of recent times.\n\nOrganizations should ensure their email security is correctly configured as a first line of\ndefense and, in addition, employees should be educated on current threats. Furthermore,\nsecurity technologies focused on endpoint threat detection must be properly configured and\nfeedback acted on, if alerts present themselves. Commodity malware should be cleaned up\nas a priority, preventing more sinister threats from materializing. To assist with threat hunting\nmissions, the following tactics, techniques and procedures (TTPs) were observed, not only\nduring the most recent Emotet malspam campaign, but also during recent ongoing incident\nresponse engagements.\n\nMITRE ATT&CK:\n\nT1566.001 - Phishing: Spearphishing Attachment\nT1204.002 - User Execution: Malicious File\nT1047 - Windows Management Instrumentation\nT1059.001 - Command and Scripting Interpreter: PowerShell\nT1059.003 - Command and Scripting Interpreter: Windows Command Shell\nT1027 - Obfuscated Files or Information\nT1027.002 - Obfuscated Files or Information: Software Packing\nT1055.001 - Process Injection: Dynamic-link Library Injection\nT1547 - Boot or Logon Auto start Execution: Registry Run Keys / Start-up Folder\nT1018 - Remote System Discovery\nT1016 - System Network Configuration Discovery\nT1033 - System Owner/User Discovery\n\n\n-----\n\nT1114.001 - Email Collection: Local Email Collection\nT1555.003 - Credentials from Password Stores: Credentials from Web Browsers\nT1110.002 - Brute Force: Password Cracking\nT1041 - Exfiltration Over C2 Channel\n\n_1_ [World's most dangerous malware Emotet disrupted through global action](https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\n\n2 [Internationale politieoperatie LadyBird: wereldwijd botnet Emotet ontmanteld](https://www.politie.nl/nieuws/2021/januari/27/11-internationale-politieoperatie-ladybird-botnet-emotet-wereldwijd-ontmanteld.html)\n\n3 [Double blow to dark web marketplaces](https://www.europol.europa.eu/newsroom/news/double-blow-to-dark-web-marketplaces)\n\n4 International efforts in the fight against global cybercrime: Disrupting cybercriminal\n\noperations\n\n\n5 _[GTIC Monthly Threat Report for December 2020](https://hello.global.ntt/en-us/insights/blog/-/media/1ce50d50a707448dae5891a1ce110a5c.ashx)_\n\n6 [Behind the scenes of the Emotet Infrastructure](https://cd1.euprod.services.global.ntt/en-us/sitecore-modules/web/ntt/home/insights/blog/behind-the-scenes-of-the-emotet-infrastructure)\n\nCopyright © 2022 NTT Limited\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-28 - Emotet disruption - Europol counterattack.pdf"
    ],
    "report_names": [
        "2021-01-28 - Emotet disruption - Europol counterattack.pdf"
    ],
    "threat_actors": [
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536064,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1653764860,
    "ts_modification_date": 1653764860,
    "files": {
        "pdf": "https://archive.orkl.eu/812f9efafacc827f9fc756ee1965e656a950b30d.pdf",
        "text": "https://archive.orkl.eu/812f9efafacc827f9fc756ee1965e656a950b30d.txt",
        "img": "https://archive.orkl.eu/812f9efafacc827f9fc756ee1965e656a950b30d.jpg"
    }
}