{
    "id": "976944e8-9e43-4ac5-b49e-171f6c0b2097",
    "created_at": "2023-01-12T15:05:04.048462Z",
    "updated_at": "2025-03-27T02:05:42.904703Z",
    "deleted_at": null,
    "sha1_hash": "4d7b7d4f117a70b5c5b99f5207bd6aaf70901414",
    "title": "2021-04-13 - Alert Number I-041321-PSA- Rise In Use of Cryptocurrency In Business Email Compromise Schemes",
    "authors": "",
    "file_creation_date": "2022-05-28T00:38:43Z",
    "file_modification_date": "2022-05-28T00:38:43Z",
    "file_size": 225521,
    "plain_text": "# Rise In Use of Cryptocurrency In Business Email Compromise Schemes\n\n**ic3.gov/Media/Y2021/PSA210413**\n\n## April 13, 2021 (2021-04-13T14:35:00-04:00)\n\nAlert Number\n\n## I-041321-PSA\n\nQuestions regarding this PSA should be directed to your local FBI Field Office.\n\nLocal Field Office Locations: [www.fbi.gov/contact-us/field-offices](https://www.ic3.gov/Home/Egress?url=http://www.fbi.gov/contact-us/field-offices&h=700C10174DA8E715FAA9E2937F48C0D91FA20372019A6642D5E367C0BD5AEF6D)\n\n_Business Email Compromise/Email Account Compromise (BEC/EAC) is a sophisticated_\nscam that targets both businesses and individuals who perform legitimate transfer-of-funds\nrequests.\n\nThe scam is frequently carried out when an individual compromises legitimate business or\npersonal email accounts through social engineering or computer intrusion to conduct\nunauthorized transfers of funds.\n\nThe IC3 has received an increased number of BEC complaints involving the use of\ncryptocurrency. Cryptocurrency is a form of virtual asset that uses cryptography (the use of\ncoded messages to secure communications) to secure financial transactions and is popular\namong illicit actors due to the high degree of anonymity associated with it and the speed at\nwhich transactions occur.\n\nTwo iterations of BEC scenarios have been identified through IC3 complaint information: a\ndirect transfer to a cryptocurrency exchange (CE) or a \"second hop\" transfer to a CE. In\nboth situations, the victim is unaware that the funds are being sent to be converted to\ncryptocurrency.\n\nA CE is an entity in the business of exchanging fiat currency (government issued currency\n_not backed by a commodity) to cryptocurrency. CEs routinely hold custodial accounts with_\ntraditional financial institutions (FIs) that are used for easy trading/exchanging for\ncustomers.\n\n### Direct Transfer\n\n\n-----\n\nThis iteration of the BEC/Cryptocurrency scam mirrors the traditional pattern of BEC\nincidents in the past. The victim entity will receive a spoofed or otherwise compromised\nemail that contains doctored wire instructions provided by the bad actor; however, since the\nrequested transfer is directed to a traditional financial institution (where the CE has a\ncustodial account), it is not easily identified by the victim.\n\n### Second Hop Transfer\n\nThis iteration of the BEC/Cryptocurrency scam uses victims of other cyber-enabled scams\nsuch as Extortion, Tech Support, and Romance Scams. Often, these individuals provided\ncopies of identifying documents such as driver's licenses, passports, etc., that are used to\nopen cryptocurrency wallets in their names. Once received by the scammer, the victim's\nbank account can be used to receive BEC funds that are then instructed to transfer to a CE\ncustodial account or even directly to the exchange itself.\n\n\n-----\n\nWhile the use of cryptocurrency is regularly reported in other crime types seen at the IC3\n(e.g., tech support, ransomware, employment), it was not identified in BEC-specific crimes\nuntil 2018, and even then, at minimal numbers. By 2019, reports had increased, culminating\nin the highest numbers to-date in 2020. Based on the data received, the IC3 expects this\ntrend to continue into 2021.\n\n\n-----\n\nSimilar to the classic BEC scams that IC3 has been tracking since 2013, the average dollar\nloss associated with these incidents is much higher than other forms of fraud reported to the\nIC3; however, smaller transactions are not immune to the scheme. The annual reported\nloss associated with these incidents has climbed steadily since the first reported in 2018,\ntopping $10M in 2020.\n\n### Suggestions For Protection\n\nUse secondary channels or two-factor authentication to verify requests for changes in\naccount information.\nEnsure the URL in emails is associated with the business/individual it claims to be\nfrom.\nBe alert to hyperlinks that may contain misspellings of the actual domain name.\nRefrain from supplying login credentials or PII of any sort via email. Be aware that\nmany emails requesting your personal information may appear to be legitimate.\nVerify the email address used to send emails, especially when using a mobile or\nhandheld device, by ensuring the sender's address appears to match who it is coming\nfrom.\nEnsure the settings in employees' computers are enabled to allow full email\nextensions to be viewed.\nMonitor your personal financial accounts on a regular basis for irregularities, such as\nmissing deposits.\n\n\n-----\n\nIf you discover you are the victim of a fraud incident, immediately contact your financial\ninstitution to request a recall of funds. Regardless of the amount lost, file a complaint with\n[www.ic3.gov or, for BEC/EAC victims,](https://www.ic3.gov/) [BEC.ic3.gov, as soon as possible.](https://bec.ic3.gov/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-13 - Alert Number I-041321-PSA- Rise In Use of Cryptocurrency In Business Email Compromise Schemes.pdf"
    ],
    "report_names": [
        "2021-04-13 - Alert Number I-041321-PSA- Rise In Use of Cryptocurrency In Business Email Compromise Schemes.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535904,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653698323,
    "ts_modification_date": 1653698323,
    "files": {
        "pdf": "https://archive.orkl.eu/4d7b7d4f117a70b5c5b99f5207bd6aaf70901414.pdf",
        "text": "https://archive.orkl.eu/4d7b7d4f117a70b5c5b99f5207bd6aaf70901414.txt",
        "img": "https://archive.orkl.eu/4d7b7d4f117a70b5c5b99f5207bd6aaf70901414.jpg"
    }
}