{
    "id": "9796c077-89dd-4bdb-a5b0-95f0bd63beb8",
    "created_at": "2023-01-12T15:01:39.761977Z",
    "updated_at": "2025-03-27T02:05:31.164456Z",
    "deleted_at": null,
    "sha1_hash": "3a6efcc7004b85aa8e6f6a99dfb5c7134cca78b0",
    "title": "2018-01-30 - GandCrab ransomware distributed by RIG and GrandSoft exploit kits (updated)",
    "authors": "",
    "file_creation_date": "2022-05-28T04:57:04Z",
    "file_modification_date": "2022-05-28T04:57:04Z",
    "file_size": 4429309,
    "plain_text": "# GandCrab ransomware distributed by RIG and GrandSoft exploit kits (updated)\n\n**[blog.malwarebytes.com/threat-analysis/2018/01/gandcrab-ransomware-distributed-by-rig-and-grandsoft-exploit-kits/](https://blog.malwarebytes.com/threat-analysis/2018/01/gandcrab-ransomware-distributed-by-rig-and-grandsoft-exploit-kits/)**\n\nMalwarebytes Labs January 30, 2018\n\n_This post was authored by Vasilios Hioueras and Jérôme Segura_\n\n**_[Update (2018-04-16): Magnitude EK has switched from Magniber to GandCrab.](https://blog.malwarebytes.com/threat-analysis/2018/04/magnitude-exploit-kit-switches-gandcrab-ransomware/)_**\n\n**_Update (2018-02-28): Major development with GandCrab. A decryptor for it is available from_**\n[NoMoreRansom here. You can read the press release from Europol here.](https://www.nomoreransom.org/en/index.html)\n\n**_[Update (2018-02-02): GandCrab is delivered via Necurs malicious spam [1].](https://twitter.com/Racco42/status/959529815148781568)_**\n\n**_[Update (2018-02-01): GandCrab is now also spread via the EITest campaign [2] [3].](https://blog.brillantit.com/exposing-eitest-campaign/)_**\n\n– –\n\n[Late last week saw the appearance of a new ransomware called GandCrab. Surprisingly, it is](https://www.malwarebytes.com/ransomware)\ndistributed via two exploit kits: RIG EK and GrandSoft EK.\n\nWhy is this surprising? Other than Magnitude EK, which is known to consistently push the\n[Magniber ransomware, other exploit kits have this year mostly dropped other payloads, such](https://blog.malwarebytes.com/threat-analysis/2017/10/magniber-ransomware-exclusively-for-south-koreans/)\nas Ramnit or SmokeLoader, typically followed by RATs and coin miners.\n\nDespite a bit of a slowdown in ransomware growth towards the last quarter of 2017, it\nremains a tried and tested business that guarantees threat actors a substantial source of\nrevenue.\n\n## Distribution\n\n[GandCrab was first](https://www.malwarebytes.com/gandcrab/) [spotted on Jan 26 and later identified in exploit kit campaigns.](https://twitter.com/CryptoInsane/status/956803455833853952)\n\n**RIG exploit kit**\n\nThe well-documented Seamless gate appears to have diversified itself as of late with distinct\nthreads pushing a specific payload. While Seamless is notorious for having switched to\nInternational Domain Names (IDNs) containing characters from the Russian alphabet, we\nhave also discovered a standard domain name in a different malvertising chain. (Side note:\nthat same chain is also used to redirect to the Magnitude exploit kit.)\n\nWe observed the same filtering done upstream, which will filter out known IPs, while the\n_gav[0-9].php step is a more surefire way to get the redirection to RIG EK._\n\n\n-----\n\nAt the moment, only the _[gav4.php flow is used to spread this ransomware.](https://twitter.com/nao_sec/status/956924254376812544)_\n\n**GrandSoft exploit kit**\n\n[This exploit kit is an oldie, far less common, and thought to have disappeared. Yet it was](https://github.com/MISP/misp-galaxy/blob/master/clusters/exploit-kit.json)\n[discovered that it too was used to redistribute GandCrab.](https://twitter.com/kafeine/status/958298409944920064)\n\n\n-----\n\nGrandSoft EK s landing page is not obfuscated and appears to be using similar functions\nfound in other exploit kits.\n\n**EITest**\n\nThis campaign is served via compromised websites.\n\n**Necurs malspam**\n\nNecurs started dropping GandCrab as well.\n\n\n-----\n\n## Ransom note\n\nInterestingly, GandCrab is not demanding payment in the popular Bitcoin currency, but rather\na lesser-known cryptocurrency called Dash. this is another sign that threat actors are going\nfor currencies that offer more anonymity and may have lower transaction fees than BTC.\n\n\n-----\n\n## Technical analysis\n\nAfter unpacking, the binary is pretty straight forward as far as analysis is concerned. There\nwere no attempts to obfuscate data or code beyond just the first layer of the packer.\nEverything from the exclusion file types to web request variables, URLs, list of AVs—even\nthe whole ransom message—is in plain text within the data section. On initial look-through,\nyou can deduce what some of the functionality might be just by simply looking at the strings\nof the binary.\n\nThe code flow stays relatively inline, so as far as reverse engineering is concerned, it allows\nyou to quite accurately analyze it even just statically in a disassembler. The code is divided\nup into three main segments: initialization, network, and encryption.\n\n**Initialization**\n\nAfter unpacking, GranCrab starts out with a few functions whose tasks are to set up some\ninformation to be used later in the code. It queries information about the user such as:\n\nusername\nkeyboard type\n\n\n-----\n\ncomputer name\npresence of antivirus\nprocessor type\nIP\nOS version\ndisk space\nsystem language\nactive drives\nlocale\ncurrent Windows version\nprocessor architecture\n\nIt specifically checks if the keyboard layout is Russian, writes out an integer representation\nfor that result, and builds a string with all this info. Below is the code that is starting to write\nout the variable names to label the information gathered:\n\nIt then cycles through all letters of the alphabet querying if a drive exists and what type it is. If\nit is a CDRom, unknown, or non existent, it skips it. If a fixed drive is found, it copies its name\nto a buffer and copies a string describing what type of drive it is. For example, the C: drive\nis FIXED.\n\nIt then gets disk free space and information on sectors that it converts into another series of\nnumbers via printf function tokens: C:FIXED_64317550592. It continues this for every drive\nand builds a list.\n\nIt puts all of the information gathered on the system together and you can assume, before\nyou even get to this point in the code, that this will be sent up to a C2 server at some point,\nas it is in the format of a GET request. Here is an example of how the system info gets\nstructured below:\n```\nip=99.8.160.100&pc_user=virusLab&pc_name=VI\n\n```\n\n-----\n\nIt also searches running processes, checking against a finite set of antivirus programs that\nwill also be converted to the info string for the C2 server.\n\nIt then proceeds to create a mutex with some system info along with a generated ID. For\nexample:\n```\nGlobal\\pc_group=WORKGROUP&ransom_id=c9ed65de824663f\n\n```\nIn order to initialize itself for the future encryption, it cycles through a hardcoded list of\nprocesses to kill. This is a common technique among ransomware that attempts to kill\nprocesses that might have a lock on certain files, which it would like to encrypt.\n\n\n-----\n\nKEY PROCESS LIST:\n\nmsftesql.exe            sqlagent.exe              sqlbrowser.exe\n\nsqlservr.exe             sqlwriter.exe             oracle.exe\n\nocssd.exe               dbsnmp.exe              synctime.exe\n\nmydesktopqos.exe      agntsvc.exe               isqlplussvc.exe\n\nxfssvccon.exe           mydesktopservice.exe    ocautoupds.exe\n\nagntsvc.exe             agntsvc.exe               agntsvc.exe\n\nencsvc.exe             firefoxconfig.exe         tbirdconfig.exe\n\nocomm.exe            mysqld.exe               mysqld-nt.exe\nmysqld-opt.exe         dbeng50.exe             sqbcoreservice.exe\n\nexcel.exe               infopath.exe              msaccess.exe\n\nmspub.exe             onenote.exe              outlook.exe\n\npowerpnt.exe          steam.exe                 thebat.exe\n\nthebat64.exe           thunderbird.exe          visio.exe\n\nwinword.exe            wordpad.exe\n\nNext, it calls the built-in crypto functions to generate keys. GandCrab generates the public\nand private keys on the client side and uses the standard Microsoft crypto libraries available\nusing API calls from Advapi32.dll. It calls CryptGenKey with the RSA algorithm.\n\n\n-----\n\n**Network connection**\n\nNow it enters the main loop for the Internet functionality portion of the ransomware. This area\nof code either succeeds and continues to the encryption section of code, or it loops again\nand again attempting to succeed. If it never succeeds, it will never encrypt any file.\n\nThis section starts off by making a GET request to ipv4bot.whatismyipaddress.com that\nsaves the IP address returned and adds to the GET request string, which has been built with\nthe system information.\n\n\n-----\n\nIt continues and takes a binary chunk, which is the RSA public key that was stored earlier in\nthe initialization. That key is converted to base64 via the CryptBinaryToStringA API with the\nfollowing parameters:\n```\nCRYPT_STRING_NOCRLF and CRYPT_STRING_BASE64\n\n```\nIt will be tacked on the the existent GET string, which it has been building this whole time.\nBelow is an example of the RSA key generated in binary and its conversion, followed by the\nfinalized GET string with the base64 of the keys in it:\n\nThis is an example of an RSA public key generated with the crypto APIs:\nA7 EC BD E2 49 43 E1 11 DA 12 10 E0 25 59 AA 83 77 35 FC 3E 49 C8 3B 6C 3D 91 CF FF 96 6E D8\n45 FE 8A 58 20 E6 CB 91 AB 99 6A E2 04 EC 58 66 95 05 8C 2F 7E C6 19 6D 24 B5 5F C4 9A 01 3D 3B\nFB 31 4E AC 25 07 8C 0E 6C 57 4C C0 23 24 3A EB 57 97 17 79 F8 62 73 6B AD B2 09 60 BB B7 9A\nCF F9 5B 68 B8 C1 44 07 F5 5E 3E 06 FE C2 35 CF 99 82 29 28 37 1B E6 51 29 6C 0B 87 89 F9 90 26\nF7 CC DA 75 C4 46 A1 E3 30 09 C0 6A CB 5E CB 87 8E 40 EF 4C 7E 02 AE E8 06 6A D7 24 FC 0E 40\nEA 69 CD 6D 8D 24 92 6E 53 2F D2 69 D2 A2 F3 97 54 63 EB D9 C7 BD 9E 41 19 91 F1 6B D6 CA AD\n9E 0E D3 0B A0 53 50 84 87 6D 49 4C 49 D2 3B 8E 80 F7 7F 35 F1 D7 A7 81 0F 90 04 40 AC 4B 7C ED\n37 71 8A B1 FA 84 33 33 FB 62 EE 04 A3 C7 9A 47 2C 64 64 95 3D 34 A5 CC 12 6E E4 81 40 E6 7F 03\n02 C4 57 D6\n\nWhich gets converted to:\n```\nBgIAAACkAABSU0ExAAgAAAEAAQCn7L3iSUPhEdoSEOAlWaqDdzX8PknIO2w9kc//lm7YRf6KWCDmy5GrmWriBO\n\n```\nAnd builds the GET string to send to the C2 with all the system information from earlier, and\nalso the encryption keys:\n```\naction=call&ip=99.8.160.100&pc_user=virusLab&pc_name=VIRUSLABPC&pc_group=WORKGROUP&pc_lang=en-US&pc_keyb=0&os_major=Windows 7\nEnterprise&os_bit=x64&ransom_id=c9ed65de824663fc&hdd=C:FIXED_64317550592/50065174528&p\n&priv_key=BwIAAACkAABSU0EyAAgAAAEAAQCn7L3iSUPhEdoSEOAlWaqDdzX8PknIO2w9kc//lm7YRf6KWCDm\n &version=1.0\n\n```\n\n-----\n\n[Crypto key base 64 functions]\n\n[Section of code that is adding the encoded keys to the get string under priv_key parameter]\n\nAt this point, it is clear that the malware will be sending this info to the C2 server. This is\ninteresting because it may be possible to pull the keys from memory and use them for the\ndecryption of files.We will continue to investigate this and update the article if any discoveries\nare found\n\n\n-----\n\nGandCrab s server is hosted on a .bit domain, and therefore it has to query a name server\nthat supports this TLD. It does this by querying for the addresses of the following domains\nusing the command:\n```\nnslookup [insert domain] a.dnspod.com.\n\n```\nThis command queries the a.dnspod.com name server, which support the .bit TLD for one of\nthe domains below.\n```\nbleepingcomputer.bit\nnomoreransom.bit\nesetnod32.bit\nemsisoft.bit\ngandcrab.bit\n\n```\nThe NSlookup child process is opened through a pipe that was created. This is done so that\na child process can directly affect the memory in the parent process, rather than transferring\noutputs manually back and forth. It is an interesting and useful technique. You can look at the\nfollowing section of code for more details:\n\nThe ransomware now attempts to send data to the server, and if an error occurs or the\nserver was not reachable, it continues this whole process in an infinite loop until it finds one\nthat works, re-querying for client IP and running nslookup again and again with different IP\noutputs. Unless it connects with the server, it will run until it is closed manually.\n\n\n-----\n\nAs mentioned before, it will not continue to the encryption routine until it finds a server, which\nmeans it will enter in an infinite loop of IP requests:\n\nOnce it finds one of these, it continues to open a thread that will start the main encryption\nfunctionality. However, before it begins, it opens another thread that creates a window and\nlabels itself as Firefox.The window is loaded with code that will copy itself to the temp\ndirectory and set itself up in the registry. This is actually one of the few parts of the malware\nthat is not taken directly from plain text. The file name copy of itself is a random series of\nletters generated by calling the cryptGenRandom function, and using its output on an array\nof letters.\n\n\n-----\n\nThe strange part about this function is not what it does, because it is creating persistence\nthat we had been waiting for, but rather why a window was created in the first place. As far\nas we could understand, there is no benefit of launching a window to perform these tasks.\nMaybe it was experiment on the part of the author, but the intent remains unclear.\n\n**Encryption routine**\n\nAs we have established from the initialization section of the malware, the encryption\nalgorithm used is RSA. Before we get the encryption section, the code makes sure that it is\nnot encrypting specific types of files that it considers protected. The files are the following,\nhard coded into the malware:\n```\ndesktop.ini\nautorun.inf\nntuser.dat\niconcache.db\nbootsect.bak\nboot.ini\nntuser.dat\nthumbs.db\nGDCB-DECRYPT.txt\n.sql\n\n```\nIf it finds that the file name is on that list, it will skip it and continue to the next. It also skips\nlooking into a folder if it is one of these key folders:\n```\nlocal app data\nwindows\nprogramfiles\nprogram data\nransomware\nlocalsettings\n\n```\nWhen it passes these checks and gets to a specific file, it runs one final check on the\nextension against a list of acceptable file extensions to be encrypted:\n\n\n-----\n\nIf all checks pass, it proceeds to use the previously generated keys along with some salt and\nrandom number generated to encrypt the file and rename it with a .GDCB extension. The\nmain encryption loop is a recursive function that will eventually make it to every file on the\ndrive.\n\n\n-----\n\n-----\n\n## Protection\n\nMalwarebytes users are protected at the delivery chain (exploit protection), but we also\nproactively stopped this ransomware before having seen it, thanks to our anti-ransomware\nengine:\n\n## Conclusion\n\nIt is interesting to see a new ransomware being distributed via exploit kits in what so far\nseems to be a few ongoing campaigns. The other interesting aspect is that two distinct\nexploit kits are delivering it, although it is unclear if the same actor is behind both campaigns\nand experimenting with different distribution channels.\n\n## Indicators of Compromise\n\nSeamless gate\n```\n31.31.196.187,xn--80abmi5aecft.xn--p1acf\n\n```\nGrandSoft EK (IP)\n```\n62.109.4.135\n\n```\nGandCrab (packed)\n```\n69f55139df165bea1fcada0b0174d01240bc40bc21aac4b42992f2e0a0c2ea1d\n\n```\nGandCrab (unpacked)\n```\nab0819ae61ecbaa87d893aa239dc82d971cfcce2d44b5bebb4c45e66bb32ec51\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-01-30 - GandCrab ransomware distributed by RIG and GrandSoft exploit kits (updated).pdf"
    ],
    "report_names": [
        "2018-01-30 - GandCrab ransomware distributed by RIG and GrandSoft exploit kits (updated).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535699,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653713824,
    "ts_modification_date": 1653713824,
    "files": {
        "pdf": "https://archive.orkl.eu/3a6efcc7004b85aa8e6f6a99dfb5c7134cca78b0.pdf",
        "text": "https://archive.orkl.eu/3a6efcc7004b85aa8e6f6a99dfb5c7134cca78b0.txt",
        "img": "https://archive.orkl.eu/3a6efcc7004b85aa8e6f6a99dfb5c7134cca78b0.jpg"
    }
}