{
    "id": "979ef3dd-1021-4936-9da6-dd2a48fc1b55",
    "created_at": "2022-10-25T16:48:15.451476Z",
    "updated_at": "2025-03-27T02:16:49.074066Z",
    "deleted_at": null,
    "sha1_hash": "a4520f8f85d13aa469ff3e1b6d333e4c9a290e7a",
    "title": "Operation Cloudyomega: Ichitaro Zero-Day And Ongoing Cyberespionage Campaign Targeting Japan",
    "authors": "Symantec",
    "file_creation_date": "2014-11-13T14:35:02Z",
    "file_modification_date": "2014-11-13T14:35:02Z",
    "file_size": 436641,
    "plain_text": "# cyberespionage campaign targeting Japan\n\nJustSystems has issued an update to its Ichitaro product line (Japanese office suite software), plugging a\n\nzero-day vulnerability. This vulnerability is being actively exploited in the wild to specifically target\n\nJapanese organizations.\n\nThe exploit is sent to the targeted organizations through emails with a malicious Ichitaro document file\n\n[attached, which Symantec products detect as Bloodhound.Exploit.557. Payloads from the exploit may](http://www.symantec.com/security_response/writeup.jsp?docid=2014-110611-5618-99)\n\n[include Backdoor.Emdivi, Backdoor.Korplug, and Backdoor.ZXshell; however, all payloads aim to steal](http://www.symantec.com/security_response/writeup.jsp?docid=2014-101715-1341-99)\n\nconfidential information from the compromised computer.\n\nThe content of the emails vary depending on the business interest of the targeted recipient’s organization;\n\nhowever, all are about recent political events associated with Japan. Opening the malicious attachment\n\nwith Ichitaro will drop the payload and display the document. Often such exploitation attempts crash and\n\nthen relaunch the document viewer to open a clean document in order to trick users into believing it is\n\nlegitimate. In this particular attack, opening the document and dropping the payload are done without\n\ncrashing Ichitaro and, as such, users have no visual indications as to what is really happening in the\n\nbackground.\n\n**CloudyOmega**\n\n[As Security Response previously discussed, unpatched vulnerabilities being exploited is nothing new for](http://www.symantec.com/connect/blogs/yet-another-zero-day-japan-hit-ichitaro-vulnerability)\n\nIchitaro. However, during our investigation of this Ichitaro zero-day attack, we discovered that the attack\n\nwas in fact part of an ongoing cyberespionage campaign specifically targeting various Japanese\n\norganizations. Symantec has named this attack campaign CloudyOmega. In this campaign, variants of\n\nBackdoor.Emdivi are persistently used as a payload. All attacks arrive on the target computers as an\n\nattachment to email messages. Mostly the attachments are in a simple executable format with a fake icon.\n\nHowever, some of the files exploit software vulnerabilities, and the aforementioned vulnerability in\n\nIchitaro software is only one of them. This group’s primary goal is to steal confidential information from\n\ntargeted organizations. This blog provides insights into the history of the attack campaign, infection\n\nmethods, malware payload, and the group carrying out the attacks.\n\n**Timeline**\n\nThe first attack of the campaign can be traced back to at least 2011. Figure 1 shows the targeted sectors\n\nand the number of attacks carried out each year. The perpetrators were very cautious launching attacks in\n\nthe early years with attacks beginning in earnest in 2014. By far, the public sector in Japan is the most\n\ntargeted sector hit by Operation CloudyOmega. This provides some clue as to who the attack group is.\n\n\n-----\n\n_Figure 1. Targeted sectors and number of attacks_\n\n**Attack vector**\n\nEmail is the predominant infection vector used in this campaign.\n\n_Figure 2. Sample email used in attack campaign_\n\nFigure 2 is an example of an email used in recent attacks prior to those exploiting the Ichitaro zero-day\n\nvulnerability. The emails include password-protected .zip files containing the malware. Ironically, the\n\nattackers follow security best practices by indicating in the first email that the password will be sent to the\n\nrecipient in a separate email. This is merely to trick the recipient into believing the email is from a\n\nlegitimate and trustworthy source. The body of the email is very short and claims the attachment includes\n\n\n-----\n\nThe file in the attachment has a Microsoft Word icon but, as indicated within Windows Explorer, it is an\n\nexecutable file.\n\n_Figure 3. Attached “document” is actually a malicious executable file_\n\n**Payload**\n\nThe malicious payload is Backdoor.Emdivi, a threat that opens a back door on the compromised\n\ncomputer. The malware is exclusively used in the CloudyOmega attack campaign and first appeared in\n\n2011 when it was used in an attack against a Japanese chemical company. Emdivi allows the remote\n\nattacker executing the commands to send the results back to the command-and-control (C&C) server\n\nthrough HTTP.\n\nEach Emdivi variant has a unique version number and belongs to one of two types: Type S and Type T.\n\nThe unique version number is not only a clear sign that Emdivi is systematically managed, but it also acts\n\nas an encryption key. The malware adds extra words to the version number and then, based on this,\n\ngenerates a hash, which it uses as an encryption key.\n\nBoth Emdivi Type S and Type T share the following functionality:\n\nAllow a remote attacker to execute code through HTTP\n\nSteal credentials stored by Internet Explorer\n\nType T is primarily used in Operation CloudyOmega, has been in constant development since the\n\ncampaign was first launched in 2011, and is written in the C++ programing language. Type T employs\n\ntechniques to protect itself from security vendors or network administrators. Important parts of Type T,\n\n\n-----\n\ndetects the presence of automatic analysis systems or debuggers, such as the following:\n\nVirtualMachine\n\nDebugger\n\nSandbox\n\nType S, on the other hand, was used only twice in the attack campaign. Type S is a .NET application based\n\non the same source code and shared C&C infrastructure as Type T. However, protection mechanisms and\n\nencryption, essential features for threat survival, are not present in Type S. One interesting trait of Type S\n\nis that it uses Japanese sentences that seem to be randomly taken from the internet to change the file\n\nhash. For instance, in the example shown in Figure 4, it uses a sentence talking about the special theory of\n\nrelativity.\n\n_Figure 4. Japanese text used by Emdivi Type S variant_\n\n**Who is Emdivi talking to?**\n\nOnce infected, Emdivi connects to hardcoded C&C servers using the HTTP protocol.\n\nSo far, a total of 50 unique domains have been identified from 58 Emdivi variants. Almost all websites\n\nused as C&C servers are compromised Japanese websites ranging from sites belonging to small businesses\n\nto personal blogs. We discovered that 40 out of the 50 compromised websites, spread across 13 IP\n\naddresses, are hosted on a single cloud-hosting service based in Japan.\n\n_Figure 5. Single IP hosts multiple compromised websites_\n\nThe compromised sites are hosted on various pieces of web server software, such as Apache and Microsoft\n\nInternet Information Services (IIS) and are on different website platforms This indicates that the sites\n\n\n-----\n\nthe attacker somehow penetrated the cloud service itself and turned the websites into C&C servers for\n\nBackdoor.Emdivi.\n\nThe compromised cloud hosting company has been notified but, at the time of writing, has not replied.\n\nSymantec offers two IPS signatures that detect and block network communication between infected\n\ncomputers and the Emdivi C&C server:\n\n[System Infected: Backdoor.Emdivi Activity](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=27975)\n\n[System Infected: Backdoor.Emdivi Activity 2](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=27989)\n\n**Zero-day and links to other cybercriminal groups**\n\nDuring our research, multiple samples related to this attack campaign were identified and allowed us to\n\nconnect the dots, as it were, when it came to CloudyOmega's connections to other attack groups.\n\nIn August 2012, the CloudyOmega attackers exploited the zero-day Adobe Flash Player and AIR\n\n'copyRawDataTo()' Integer Overflow Vulnerability (CVE-2012-5054) in an attack against a high-profile\n\norganization in Japan. The attackers sent a Microsoft Word file containing a maliciously crafted SWF file\n\nthat exploited the vulnerability. Once successfully exploited, the file installed Backdoor.Emdivi. As CVE\n2012-5054 was publicly disclosed in the same month, the attack utilized what was, at the time, a zero-day\n\nexploit.\n\nInterestingly, the Flash file that was used in an Emdivi attack in 2012 and the one used in the LadyBoyle\n\nattack in 2013 look very similar.\n\nFigure 6 shows the malformed SWF file executing LadyBoyle() code that attempts to exploit the Adobe\n\nFlash Player CVE-2013-0634 Remote Memory Corruption Vulnerability (CVE-2013-0634). The Flash file\n\nseems to have been created using the same framework used by the CloudyOmega group, but with a\n\ndifferent exploit.\n\n\n-----\n\n_Figure 6. Malformed SWF file used in the LadyBoyle campaign in February 2013_\n\nBoth attacks use a .doc file containing an Adobe Flash zero-day exploit that is used to install a back door.\n\nNo other evidence connects these two different campaigns; however, as described previously in Symantec\n\n[Security Response’s Elderwood blog, it is strongly believed that a single parent organization has broken](http://www.symantec.com/connect/blogs/how-elderwood-platform-fueling-2014-s-zero-day-attacks)\n\ninto a number of subgroups that each target a particular industry.\n\nIn terms of the latest attack on Ichitaro, we collected a dozen samples of JTD files, all of which are exactly\n\nthe same except for their payload. The parent organization, it would seem, supplied the zero-day exploit to\n\nthe different subgroups as part of an attack toolkit and each group launched a separate attack using their\n\nchosen malware. This is why three different payloads (Backdoor.Emdivi, Backdoor.Korplug, and\n\nBackdoor.ZXshell) were observed in the latest zero-day attack.\n\n\n-----\n\n_Figure 7. Parent group sharing zero-day exploit_\n\n**Conclusion**\n\nOperation CloudyOmega was launched by an attack group that has communication channels with other\n\nnotorious attack groups including Hidden Lynx and the group responsible for LadyBoyle. CloudyOmega\n\nhas been in operation since 2011 and is persistent in targeting Japanese organizations. With the latest\n\nattack employing a zero-day vulnerability, there is no indication that the group will stop their activities\n\nanytime soon. Symantec Security Response will be keeping a close eye on the CloudyOmega group.\n\n**Protection summary**\n\nIt is highly recommended that customers using Ichitaro products apply any patches as soon as possible.\n\nSymantec offers the following protection against attacks associated with Operation CloudyOmega:\n\n**AV**\n\n[Backdoor.Emdivi](http://www.symantec.com/security_response/writeup.jsp?docid=2014-101715-1341-99)\n\n[Backdoor.Emdivi!gen1](http://www.symantec.com/security_response/writeup.jsp?docid=2014-102411-3143-99)\n\n[Backdoor.Emdivi!gen2](http://www.symantec.com/security_response/writeup.jsp?docid=2014-102803-3342-99)\n\n[Bloodhound.Exploit.557](http://www.symantec.com/security_response/writeup.jsp?docid=2014-110611-5618-99)\n\n[Trojan.Mdropper](http://www.symantec.com/security_response/writeup.jsp?docid=2005-031911-0600-99)\n\n**IPS**\n\n[System Infected: Backdoor.Emdivi Activity](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=27975)\n\n[System Infected: Backdoor.Emdivi Activity 2](http://www.symantec.com/security_response/attacksignatures/detail.jsp?asid=27989)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/61pv7a2qufqbm3dhargkrsqjjzgswxba",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2014/2014.11.13.Operation_CloudyOmega/Operation_CloudyOmega_Ichitaro.pdf"
    ],
    "report_names": [
        "Operation_CloudyOmega_Ichitaro"
    ],
    "threat_actors": [
        {
            "id": "c92de6de-9538-43e5-9190-9da092194884",
            "created_at": "2022-10-25T16:07:23.411024Z",
            "updated_at": "2025-03-27T02:02:09.785868Z",
            "deleted_at": null,
            "main_name": "Blue Termite",
            "aliases": [
                "Blue Termite",
                "Cloudy Omega"
            ],
            "source_name": "ETDA:Blue Termite",
            "tools": [
                "Emdivi",
                "Newsripper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c2bf7f73-16b8-472f-8bc0-1427f4d86b8a",
            "created_at": "2022-10-25T16:07:23.210218Z",
            "updated_at": "2025-03-27T02:02:09.688431Z",
            "deleted_at": null,
            "main_name": "Dizzy Panda",
            "aliases": [
                "LadyBoyle"
            ],
            "source_name": "ETDA:Dizzy Panda",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b9ca5e9a-530a-4b0f-b2ca-ada722a63c44",
            "created_at": "2023-01-06T13:46:38.262372Z",
            "updated_at": "2025-03-27T02:00:02.786854Z",
            "deleted_at": null,
            "main_name": "DIZZY PANDA",
            "aliases": [
                "LadyBoyle"
            ],
            "source_name": "MISPGALAXY:DIZZY PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "57d2c58d-0445-441f-b94f-99d217b9e3c4",
            "created_at": "2023-01-06T13:46:38.327743Z",
            "updated_at": "2025-03-27T02:00:02.805939Z",
            "deleted_at": null,
            "main_name": "Beijing Group",
            "aliases": [
                "SIG22",
                "G0066",
                "SNEAKY PANDA",
                "Elderwood",
                "Elderwood Gang"
            ],
            "source_name": "MISPGALAXY:Beijing Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "48782737-377b-47b4-aff0-87424208a643",
            "created_at": "2023-01-06T13:46:38.569144Z",
            "updated_at": "2025-03-27T02:00:02.863397Z",
            "deleted_at": null,
            "main_name": "Blue Termite",
            "aliases": [
                "Cloudy Omega",
                "Emdivi"
            ],
            "source_name": "MISPGALAXY:Blue Termite",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a339e456-3f5a-40e9-b293-233281105e85",
            "created_at": "2022-10-25T15:50:23.260847Z",
            "updated_at": "2025-03-27T02:00:55.411558Z",
            "deleted_at": null,
            "main_name": "Elderwood",
            "aliases": [
                "Elderwood",
                "Elderwood Gang",
                "Beijing Group",
                "Sneaky Panda"
            ],
            "source_name": "MITRE:Elderwood",
            "tools": [
                "PoisonIvy",
                "Naid",
                "Briba",
                "Hydraq",
                "Linfo",
                "Nerex",
                "Vasport",
                "Wiarp",
                "Pasam",
                "Darkmoon"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "86fd71d3-06dc-4b73-b038-cedea7b83bac",
            "created_at": "2022-10-25T16:07:23.330793Z",
            "updated_at": "2025-03-27T02:02:09.740703Z",
            "deleted_at": null,
            "main_name": "APT 17",
            "aliases": [
                "APT 17",
                "ATK 2",
                "Beijing Group",
                "Bronze Keystone",
                "Deputy Dog",
                "Elderwood",
                "Elderwood Gang",
                "Operation Aurora",
                "Operation DeputyDog",
                "Operation Ephemeral Hydra",
                "Operation RAT Cook",
                "SIG22",
                "Sneaky Panda",
                "TEMP.Avengers",
                "TG-8153",
                "Tailgater Team"
            ],
            "source_name": "ETDA:APT 17",
            "tools": [
                "9002 RAT",
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "Briba",
                "Chymine",
                "Comfoo",
                "Comfoo RAT",
                "Darkmoon",
                "DeputyDog",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Jumpall",
                "Kaba",
                "Korplug",
                "Linfo",
                "MCRAT.A",
                "McRAT",
                "MdmBot",
                "Mdmbot.E",
                "Moudour",
                "Mydoor",
                "Naid",
                "Nerex",
                "PCRat",
                "PNGRAT",
                "Pasam",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "Roarur",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trojan.Naid",
                "Vasport",
                "Wiarp",
                "Xamtrav",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041809,
    "ts_creation_date": 1415889302,
    "ts_modification_date": 1415889302,
    "files": {
        "pdf": "https://archive.orkl.eu/a4520f8f85d13aa469ff3e1b6d333e4c9a290e7a.pdf",
        "text": "https://archive.orkl.eu/a4520f8f85d13aa469ff3e1b6d333e4c9a290e7a.txt",
        "img": "https://archive.orkl.eu/a4520f8f85d13aa469ff3e1b6d333e4c9a290e7a.jpg"
    }
}