{
    "id": "97b70b7a-5e88-41cb-9f4b-c5618aec458b",
    "created_at": "2023-01-12T15:06:09.672455Z",
    "updated_at": "2025-03-27T02:09:18.556004Z",
    "deleted_at": null,
    "sha1_hash": "c1c2a2ba8c492faead3899b62f8c61321960d3c4",
    "title": "2021-04-28 - The Sodinokibi Chronicles- A (R)Evil Cybercrime Gang Disrupts Organizations for Trade Secrets and Cash",
    "authors": "",
    "file_creation_date": "2022-05-28T03:52:36Z",
    "file_modification_date": "2022-05-28T03:52:36Z",
    "file_size": 1718315,
    "plain_text": "# A (R)Evil Cybercrime Gang Disrupting Organizations for Trade Secrets and Cash\n\n**[securityintelligence.com/posts/sodinokibi-revil-ransomware-disrupt-trade-secrets/](https://securityintelligence.com/posts/sodinokibi-revil-ransomware-disrupt-trade-secrets/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Incident Response](https://securityintelligence.com/category/topics/incident-response/)\nThe Sodinokibi Chronicles: A (R)Evil Cybercrime Gang Disrupts Organizations for Trade\nSecrets and Cash\n\n\n-----\n\n[Incident Response April 28, 2021](https://securityintelligence.com/category/topics/incident-response/)\nBy [Limor Kessem 9 min read](https://securityintelligence.com/author/limor-kessem/)\nIt likes big game hunting, it enjoys deploying Cobalt Strike and it dabbles in critical\nvulnerability abuse. It’s known as [Sodinokibi/REvil, a ransomware strain that emerged in](https://securityintelligence.com/news/revil-ransomware-gang-tells-all-alliances-revenue/)\n[2019 as the heir to the GandCrab ransomware, a malware family that supposedly retired](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/)\nfrom the cyber crime arena in mid-2019 after reportedly amassing illicit profits of over $2\nbillion.\n\nIn the two years of its existence, Sodinokibi has gained considerable momentum, having\nbeen implicated in high-profile cyberattacks, locking up and even auctioning off data that\nbelonged to companies like Travelex, Gunnebo, Brown-Forman, Asian retail giant The Dairy\nFarm Group and, most recently, an Apple supplier. The demand in each case is often\nexorbitant, asking victims for multi-million-dollar ransoms for their data:\n\n[Leading cosmetics group Pierre Fabre: $25,000,000](https://www.bleepingcomputer.com/news/security/leading-cosmetics-group-pierre-fabre-hit-with-25-million-ransomware-attack/)\nThe Dairy Farm Group: [$30,000,000](https://www.bleepingcomputer.com/news/security/pan-asian-retail-giant-dairy-farm-suffers-revil-ransomware-attack/)\n[New York-based law firm Grubman Shire Meiselas & Sacks: $42,000,000](https://www.teiss.co.uk/revil-ransomware-hackers-donald-trump/)\n[Apple MacBook supplier: $50,000,000](https://www.theverge.com/2021/4/21/22396283/apple-schematics-leak-ransomware-quanta-supplier-leak)\n\nIs Sodinokibi all about the money? It’s hard to say. In some cases, Sodinokibi actors manage\nto target defense contractors and organizations in countries that rival their assumed\noriginating state, Russia.\n\nRobbing terabytes of data, with no way for victims to know what they actually do with it after\nthey receive payment, it’s very plausible that money is just one objective, followed by\n[espionage, both business and nation-state driven. Not unlike other major cybercrime gangs,](https://www.washingtonpost.com/technology/2020/10/12/microsoft-trickbot-ransomware/)\nthe group’s access and control over major organizations’ assets can lend it the power to\ncollaborate on a variety of nefarious schemes, including adversarial nation-state activity.\n\n## ‘Cryptoviral Extortion’ Is the Name of the Game\n\nThreat actors that use ransomware are taking advantage of the inherent power of public key\ninfrastructure cryptology to encrypt information in a way that’s hard or impossible to break.\n[The term “cryptoviral extortion” was coined in 1996 in an Institute of Electrical and](https://en.wikipedia.org/wiki/Cryptovirology)\nElectronics Engineers (IEEE) paper. The IEEE also predicted that cryptoviral extortion would\none day demand ‘e-money,’ long before Bitcoin even existed.\n\nFor the cryptographic basis of the attack, Sodinokibi uses a combination of elliptic curve\nDiffie-Hellman (ECDH), Salsa20, SHA-3 and Advanced Encryption Standard (AES) to\nencrypt and decrypt both malicious configuration data and user data (i.e., user files). It\ngenerates its private-public key pair using Curve25519, one of the fastest elliptic-curve\ncryptography (ECC) curves designed for use with the ECDH key agreement scheme.\n\n\n-----\n\nSodinokibi operators may steal data in advance and then resort to extortion tactics that\nexceed the ability of the malware itself. Those who refuse to pay up, relying on their ability to\nrecover data, will then receive threats to have that data exposed on an auction site the group\ncalls The Happy Blog. That’s also where it names and shames its victims, offering up\ninformation that could be of use to other criminals or even competitors.\n\nAdditionally, in [an interview given by an alleged REvil operator, known as Unknown, the](https://www.youtube.com/watch?v=ZyQCQ1VZp8s)\nperson said he/she was considering launching distributed denial-of-service (DDoS) attacks\non victim organizations as yet another way to increase the pressure on victims to pay the\nransom.\n\nIn terms of prevalence in the wild, Sodinokibi made up 22% of all X-Force incident response\nengagements in 2020, suggesting that those operating this malware are more skilled at\ngaining access to victims’ networks when compared to other ransomware strains. XForce estimates that nearly 80% of the gang’s victims are a combination of organizations\nfrom the US (58%), UK (8%), Australia (5%) and Canada (3%).\n\nThe faces of Sodinokibi are many, as it is the sort of malware that’s distributed by various\naffiliates. In 2020, this ransomware’s originators showed off their success by depositing $1\n[million in Bitcoin into a Russian-speakers’ cyber crime forum as part of a recruitment drive for](https://www.bleepingcomputer.com/news/security/revil-ransomware-deposits-1-million-in-hacker-recruitment-drive/)\nmore affiliates to join its ranks.\n\n## Sodinokibi: A Head-to-Head Battle With Manual Targeted Attacks\n\nOnce Sodinokibi focuses on a potential victim, the attack goes into a more sophisticated\noperation by human actors who pave their way through the compromised networks to find\ndata, exfiltrate it and sow the seeds of the ransomware phase across as many devices as\npossible. This is a major issue since it’s harder to detect a careful human who can change\ntactics according to what’s happening on the defenders’ side.\n\nThat has not restricted the number of attacks by the group of Sodinokibi operators. The\nnumber of publicized attacks is likely the tip of an iceberg. According to X-Force data from\n2020, we estimate the total victim count to be around 250 organizations. Our most\nconservative estimate places the total Sodinokibi ransom revenue at $123 million in 2020.\nThis estimate is the result of several factors, notably the big game hunting attacks. Of the\nestimated 19 victim organizations with total annual revenue of $1 billion or more, at least 15\nhave probably paid a multi-million-dollar ransom.\n\n\n-----\n\n_Figure 1: Attacks per month (Source: IBM X-Force)_\n\n_Figure 2: Ransom demands per month (Source: IBM X-Force)_\n\n\n-----\n\n_Figure 3: Victimized organizations by geo-location (Source: IBM X-Force)_\n\n_Figure 4: Victimized organizations by industry (Source: IBM X-Force)_\n\n## The Price of Trust\n\nAccording to IBM Security surveys and data collected on ransomware attacks, at least half of\norganizations targeted with ransomware pay the ransom. That model might have worked in\nsome cases, in the past, when the only threat was locked files. But, a new question arises:\nAre cyber criminals breaking their own business model by challenging organizations to trust\nthem with their stolen data?\n\n\n-----\n\nWith blended attacks that both steal and encrypt data, cyber criminals can add pressure to\ntheir scheme and force organizations to pay or have their data exposed or auctioned off. But,\nin reality, the minute a copy of confidential data is outside the organization, there is no telling\nwhat’s actually being done with it. Is it truly being deleted? This is not a predicament any\norganization would choose to be in. In some Sodinokibi cases, the attackers who were\nsupposed to delete the stolen data after they got paid ended up coming back for seconds,\ndemanding more money be paid because they kept the data.\n\nThis raises the espionage question once again. After the ransom is paid for the decryption\nand supposed deletion of the stolen data, who’s to guarantee that the same data is not then\noffered anonymously to a competitor? Who’s to say it won’t be offered to a rivaling nationstate for a hefty fee, all under the cloak of cryptocurrency payments and money-laundering\ncapacity that cyber crime gangs build by fostering relationships with other organized crime\ngroups?\n\nThere are no guarantees. A decryption key is one thing, buying trust is another. That’s why\nthis may seem like bad news at first sight, but it could be a factor that will make organizations\nless inclined to pay ransoms.\n\nWith gangs like Sodinokibi thinking of expansion and attack diversity, security executives are\nbetter off looking at security reinforcements and preventive measures (i.e., encrypting data\nso it is useless if stolen, safely storing backups, threat intelligence-driven patch vulnerability\nstrategy, data loss prevention, continuous zero-trust improvements, etc.) rather than dumping\nmillions of dollars into a losing game — an attacker’s bottomless pocket.\n\n## It’s Sodinokibi — What’s Next?\n\nWhen a ransomware attack is discovered, every second counts. As time passes, more data\nand files are being encrypted, driving up the cost and damage of that attack. Immediate —\nyet methodical and informed — action must be taken.\n\nA first move should be involving IT security teams and allowing them to launch the incident\nresponse process that they have prepared to combat ransomware. If you have a retainer\ncontract with a [third-party provider, it is advisable to engage them now and get responders](https://www.ibm.com/security/services/ibm-x-force-incident-response-and-intelligence)\non site. In the meantime, all defensive actions should count on the assumption that the\nattacker is still in the environment and monitoring all communications.\n\nIf your team figures out which malware has encrypted data, typically by the encrypted file\nextensions, run an initial root cause analysis (RCA) to determine how the malware got in.\nWhile a formal RCA can wait until the post-incident activity phase, an abridged RCA will aid\nthe organization in entering the containment phase. Without a basic RCA, the infection cycle\nis more likely to repeat itself. It is also important to perform the RCA before the recovery\nphase, since an organization could expend a large amount of time and effort recovering files\nonly to see them re-encrypted shortly thereafter.\n\n\n-----\n\nThe pressure is on, the attackers make every possible threat at this point, and time is\nrunning out quickly. If data has been stolen (e.g., customer data, financial data, cyber\ninsurance information, intellectual property, etc.) and the organization understands what’s at\nstake, the company’s counsel, data privacy officer (DPO) or privacy officer should be\ninvolved to plan the response that concerns customers and data subjects. Other parties to\n[consider contacting are federal law enforcement and regulators, depending on the local](https://www.ic3.gov/Home/Ransomware)\nrequirements for the industry and geographies in which your company operates.\n\nFast forward to the recovery stage, as this is the point at which companies will typically\nconsider cutting their losses and may plan on paying the ransom or negotiating it down. It’s\nimportant to consider the newer pressure tactics Sodinokibi operators use on top of\nencryption, data exfiltration and DDoS, before paying. Moreover:\n\n[Paying a ransom does not guarantee recovery; some data may have been corrupted.](https://securityintelligence.com/news/when-cyber-gangs-disregard-ransomware-payments/)\nPaying a ransom does not equal instant recovery; it may take weeks or months to\ndecrypt data.\nPaying a ransom can be a federal offense if paid to attackers in certain countries.\nPaying organized cyber crime operations like Sodinokibi funds and strengthens their\nbusiness model.\n\n## Sodinokibi Expanding in 2021\n\nSodinokibi actors have been trying to recruit additional affiliates. One way to lure new\nmembers to collaborate with them is by flaunting their wealth, by depositing $1 million in a\nRussian-speaking underground forum, to assure members they can be trusted and those\nwho join will get paid.\n\nThe types of skills the group is after, and those which defenders will be seeing more of in\n2021, appeared in a post in a dark web forum.\n\n“Groups that have already got expertise and expertise in penetration testing, working with\n[MSF (aka MetaSploit Framework)/CS (aka Cobalt Strike)/Koadic (a Windows post-](https://attack.mitre.org/software/S0250/)\nexploitation framework and penetration testing tool), NAS/Tape (enterprise data archiving\nand storage), Hyper-V, and analogues of the listed software programs…”\n\nOn top of these popular ransomware tactics, techniques and procedures (TTPs), check out\nthe annex at the end of this blog post for additional cues.\n\nAt this time, no end is in sight for Sodinokibi, but that does not mean it will not suddenly shut\ndown operations and disappear. In some cases, cyber criminals bow out of the arena when\nthey have amassed considerable wealth and are worried about potential law enforcement\n[crackdowns. We have seen such occurrences with GandCrab in 2019,](https://www.zdnet.com/article/gandcrab-ransomware-operation-says-its-shutting-down/) [Maze ransomware in](https://techcrunch.com/2020/11/02/maze-ransomware-group-shutting-down/)\nlate 2020 and FonixCrypter in January 2021.\n\n\n-----\n\nUntil that happens with Sodinokibi — and with no reason to doubt that new actors will rise\nnext — defenders should continue to focus on security and employee awareness to limit the\npotential for these types of attacks.\n\n## Facing a Sodinokibi Attack?\n\nIf your team requires assistance, please contact the X-Force hotlines:\n\nNorth America: 24×7 Hotline: 1-888-241-9812\n\nGlobal Hotline: +00 1 (312) 212-8034\n\n[IBM X-Force Threat Intelligence](https://www.ibm.com/security/services/threat-intelligence)\n\nIBM X-Force IRIS Threat Intelligence Solutions offers global intelligence experts, analysis\nand platform integration of threat intelligence into security workflow applications.\n\n[IBM X-Force Incident Response Services](https://www.ibm.com/security/services/incident-response-services)\n\nIncident response services — retainer subscription and proactive services to reduce incident\nresponse time, minimize breach impact and help you recover faster.\n\n## ANNEX\n\n General Ransomware Characteristics to Look Out For\n\nRansomware attackers, including Sodinokibi actors, tend to be sophisticated, stealthy and\nprevalent. Most times, they seek to gain access to a victim organization’s network by either\nexploiting a vulnerability or acquiring and abusing valid account credentials.\n\nObtaining that initial set of account credentials typically comes through phishing attacks or\npurchases in dark web cyber crime forums. Ultimately, once an attacker gains an initial\nfoothold, they seek to move laterally and acquire as many privileged account credentials as\npossible. The use of some malware or penetration testing tools is a common practice.\n\n## Common Infection Vectors (e.g., vulns. exploits)\n\nPhishing/malware\nVulnerability exploitation\nOpen/poorly secured RDP\n\n## Commonly Exploited Vulnerabilities to Prioritize\n\n\n-----\n\nRDPs\n\nBlueGate CVE-2020-0609, CVE-2020-0610\nCVE-2020-16896\nCVE-2019-1225\nCVE-2019-1224\nCVE-2019-1108\nCVE-2019-19781 Citrix\nCVE-2019-2725 Oracle WebLogic\nCVE-2020-2021 Palo Alto Firewall\nCVE-2020-5902 F5 BIG-IP\nCVE-2018-8453 (EoP) Windows (RCE) win32k.sys\nCVE-2020-1472 Windows Netlogon ZeroLogon (post-initial foothold/compromise)\nVPNs\n\nCVE-2019-11510 Pulse Secure Connect\nCVE-2019-11539 Pulse Secure Connect\nCVE-2018-13379 FortiOS SSL VPN\nCVE-2019-18935 Telerik UI (JuicyPotato exploit)\n\n## Common Capabilities\n\nAntivirus and sandbox evasion/anti-debug, anti-analysis tricks\nBinary file is encrypted\nCRC32 checks\nProcess injection tactics\nAPI hashing/dynamic API resolution\nMount and encrypt virtual disks (e.g. virtual machine files like VHD, VHDX)\nUAC bypass\nWake-on-Lan (WoL)\nProcess doppelgänging\nDeploy and execute ransomware inside its own virtual machine container\nDisable Windows driver signature enforcement\nKill specific running processes and services\nDelete data, e.g., various logs (attack evidence), volume shadow copies, backups, etc.\nDisable/delete various system security settings (e.g., Windows firewall, Windows\nDefender definitions, etc.)\nEvade detection, e.g., msbuild.exe, Heaven’s Gate technique, use memory mapped I/O\nto encrypt each file, etc.\nRapid, multithread encryption\n\n## Common TTPs to Look Out For\n\nHarvesting privileged account credentials, admins of varying sorts.\nUse of legitimate, remote access software like AnyDesk, NetSupport Manager, etc.\n\n\n-----\n\nUse of PuTTY Link (aka Plink) to tunnel RDP sessions and establish connections to\nother devices on the network with randomized source and destination ports.\nCreation of one or more user accounts and/or groups, group policies (GPOs).\nAttempts to encrypt network shares; creates new tasks, registry keys\nAttacker will target systems with V-sphere/ESXi/Nagios, NAS (data exfil), network\nshares (data exfil), Exchange server (monitor and steal internal communications) and\nconsolidated backups (which can frustrate recovery efforts) especially during the\ninternal reconnaissance phase.\nInternal network scans looking for IP ranges with the following services/ports:\n\n10.0.0.0-10.0.255.255\nHTTP and proxy (ports 80, 443, 3128, 8080)\nFTP and SFTP (port 21, 115)\nDatabase servers (ports 1433, 3050, 3306)\nRemote management (ports 22, 23, 3389, and 4899)\nLog deletion using publicly available code.\nLateral movement — many times, a primary subgoal is to move to a domain controller\n(DC).\n\nPSremoting session started; PowerShell downloads scripts and files; privileged\naccount used (i.e., Domain Admin); ADrecon executed (reconnaissance);\nScheduled Task executes script from SystemApps; lateral movement via Cobalt\nSMB beacon.\nOnce on a DC, attackers attempt to disable Windows security settings like MS\nfirewall settings for all domain-joined computers via new GPO.\nDeployment and detonation of ransomware on all domain-joined computers via\nGPO.\nWatch for any network activity to/from cloud storage platforms as a way by which data\nis being exfiltrated.\n\n[Limor Kessem](https://securityintelligence.com/author/limor-kessem/)\nExecutive Security Advisor, IBM\n\nLimor Kessem is an Executive Security Advisor at IBM Security. She is a widely sought-after\nsecurity expert, speaker and author and a strong advocate for wom...\n\n\n-----\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-28 - The Sodinokibi Chronicles- A (R)Evil Cybercrime Gang Disrupts Organizations for Trade Secrets and Cash.pdf"
    ],
    "report_names": [
        "2021-04-28 - The Sodinokibi Chronicles- A (R)Evil Cybercrime Gang Disrupts Organizations for Trade Secrets and Cash.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535969,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653709956,
    "ts_modification_date": 1653709956,
    "files": {
        "pdf": "https://archive.orkl.eu/c1c2a2ba8c492faead3899b62f8c61321960d3c4.pdf",
        "text": "https://archive.orkl.eu/c1c2a2ba8c492faead3899b62f8c61321960d3c4.txt",
        "img": "https://archive.orkl.eu/c1c2a2ba8c492faead3899b62f8c61321960d3c4.jpg"
    }
}