{
    "id": "980fbb14-1af0-4621-bd82-bfc52137d6fb",
    "created_at": "2023-01-12T15:02:08.239929Z",
    "updated_at": "2025-03-27T02:05:39.153823Z",
    "deleted_at": null,
    "sha1_hash": "e08953f1297eccd736a7ed356ae8957a935e8934",
    "title": "2021-09-01 - Analysis of a Phishing Kit (that targets Chase Bank)",
    "authors": "",
    "file_creation_date": "2022-05-28T15:42:43Z",
    "file_modification_date": "2022-05-28T15:42:43Z",
    "file_size": 1768279,
    "plain_text": "# Sucuri Blog\n\n**[blog.sucuri.net/2021/09/analysis-of-a-phishing-kit-that-targets-chase-bank.html](https://blog.sucuri.net/2021/09/analysis-of-a-phishing-kit-that-targets-chase-bank.html)**\n\nBen Martin September 1, 2021\n\n[Most of us are already familiar with phishing: A common type of internet scam where](https://www.comptia.org/content/articles/what-is-phishing/cjhaMh8)\nunsuspecting victims are conned into entering their real login credentials on fake pages\ncontrolled by attackers. Once entered, the attackers syphon off those login details and use\nthem for their own purposes. Sometimes this can just be a nuisance: for example someone\nentering their Netflix account login information into a bogus page. Things become much\nmore serious when banking information is involved. The attackers could potentially empty\nyour bank account and life savings with the click of a few buttons. It is also very common for\nusers to re-use passwords across multiple services, and common practice for attackers to\ntest credentials on multiple other platforms.\n\nHopefully most folks are able to recognise a phishing email / landing page by now:\n\n\n-----\n\n_A fake Chase bank login page on a compromised website_\n\nWe can see in the image above that this is not the official Chase Bank website. However,\nmost often we only see the front-facing phishing pages but not what hides in the backend. In\ntoday’s post we will be examining what hides behind the surface in one such commercial\nphishing kit that was going for $80 on the black market as a limited release.\n\n## Directory Structure\n\nThe phishing toolkit that we will be taking apart in this post is actually a surprisingly featurerich product sold to other black hat attackers that specifically targets banking login details.\nAlthough most phishing is bought from the same hacker shops, a lot of the bogus login\npages are quite straightforward and do not contain most of the bells and whistles we found\nhere.\n\n_File/directory structure of the main phishing rootdir_\n\nSome of the features we found for this kit include:\n\nFunctionality to hide from bots and security companies\nFully functional admin panel to manage victim information\nAPI validation to only target Chase accounts\nRandom URL generator (to appear more legitimate)\nMobile device functionality\nProfanity filter\n\n\n-----\n\nLots more\n\nHere’s what the attackers themselves say about their kit:\n\n_[Works super fine, looks perfect just as real! Image credit to @malwrhunterteam](https://twitter.com/malwrhunterteam/status/1342932154779639808)_\n\nLet’s break down some of these features and how they can help the attackers steal the\nvictim’s banking information.\n\n## Hiding from Bots and Security Companies\n\nLet’s start at the beginning, shall we? Here we have the main index.php file in the root\ndirectory of the phishing kit:\n\n\n-----\n\nWhile this is by no means unique to this phishing kit, one of the most useful and noteworthy\nfeatures of this malware is the great lengths to which it has gone to block crawlers and bots\nfrom accessing it. On line 5 of this index file we see this:\n```\nrequire_once 'blocker.php';\n\n```\nLet’s take a look at this file and see what’s inside:\n\n\n-----\n\nHere we see a great deal of terms referencing search engine crawlers and security\ncompanies. For example:\n```\ngooglebot\nduckduck\nmsnbot\ncrawler\nvirustotal\nbitdefender\ndr.web\ncloudflare\navast\navira\nphishtank\nmcafee\nnetcraft\nclamav\n\n```\nIf you look closely you can even see sucuri.net mentioned there 😘 💕\n\nIf the host name or user agent trying to access the phishing page matches one of these\nstrings then the request will be met with a 403 Forbidden response. This is an attempt to try\nto evade detection.\n\nWhile sometimes attackers will register explicitly malicious domains (ie: this phishing kit was\nat one point planted at this domain:\n```\nsecure03f-chase[.]com\n\n```\nThis was registered on 2020-12-25 but since taken down for obvious abuse. More commonly\nthey will plant these phishing pages on compromised (but otherwise legitimate) websites (like\nour client, for example). This is why it’s important to always verify that you are entering your\nlogin credentials to the official page of your bank. Always double check that you are on the\nofficial website and that the site is showing a SSL/HTTPS protected shield!\n\nThe phishing kit tries to to avoid detection by preventing Google from crawling the phishing\ncontent. If the owner of the victim’s website was to search their website in Google and see\nreferences to a Chase login they’d know right away that something was amiss. This is one of\nthe reasons these search engine user agents/hostnames are deliberately blocked, in addition\nto preventing the website from being blocked by Google entirely.\n\nAll in all, this kit outright blocks nearly 500 bots, almost 350 hosting and Internet service\nproviders, 130+ words, and thousands of IP addresses and blanket IP ranges.\n\n\n-----\n\n## Built-In Administrator Panel\n\nNavigating to the “panel” directory we are met with an ever-so-leet Mr.Robot-inspired login\npage:\n\nOnce we enter in the hard-coded password “q1w2e3r4t5“…\n\n\n-----\n\n…we now land in the admin area which logs all of the stolen credentials in an easy-to-use,\nnicely presented interface:\n\nPressing on the config button leads us to additional functionality:\n\nHere we have multiple options such as changing the email addresses, API keys, passwords,\nthe type of phishing emails sent out, whether or not to block certain user agents and more.\n\nHere’s an example of the contents of the phishing email located within this file:\n```\n./config/unusual_activity.ini\n\n```\n\n-----\n\nThis allows easy customization of the phishing page that is being shown by the attacker.\n\n## Antibot Phishing Kit Service\n\nAnother interesting aspect of this phishing kit is the following file included in the index.php:\n```\nrequire_once(\"antibot.php\");\n\n```\nThis is an interesting aspect of this phishing kit. Using an included API key for the\nantibot[.]pw website it will return a 404 Not Found to any designated bot user agent.\nAlthough it could be used for legitimate purposes it appears that this website is used\nextensively by malicious phishing actors to help conceal their payloads from detection. We\n[have blacklisted this domain since late last year.](https://labs.sucuri.net/blacklist/info/?domain=antibot.pw)\n\nThis domain was originally registered in 2019 using the webnic.cc registrar:\n```\n$ whois antibot.pw\nDomain Name: ANTIBOT.PW\nRegistry Domain ID: D128657901-CNIC\nRegistrar WHOIS Server: whois.webnic.cc\nRegistrar URL: http://www.webnic.cc\nUpdated Date: 2021-01-04T10:59:04.0Z\nCreation Date: 2019-09-13T06:29:29.0Z\n\n```\n\n-----\n\nWhile .pw is the top-level domain for the island nation of Palau, this website is actually\nhosted at Vultr on a hosting server in Dallas, Texas:\n\n## Profanity Filter\n\nPlenty of effort has gone into educating people about phishing and many know how to\ncorrectly identify a phishing page right away. Most of us who know we are being scammed\nquickly close out of our browser and breathe a sigh of relief.\n\nOther (perhaps more cheeky) folks are tempted to insert insults and profanity to send to the\nattackers in the “user name” and “password” fields. But check this out:\n\nNot only does this phishing kit filter out profane submissions to this fake Chase Bank login\npage, it also uses the geoplugin.net service to pinpoint the location of these users. It then\nsends the IP address, host name, and browser user agent to the attackers, notifying them of\nthe location of those who choose to engage in a little trolling.\n\n## Geolocation\n\nAnother feature of this phishing kit is geolocation:\n\n\n-----\n\nNaturally, the attackers want to gather as much information as possible about their victims.\nTheir location is no exception. Here we see the attackers gathering the following information:\n\nCounty name\nCountry code\nContinent\nCity\nRegion\nTimezone\nLocal currency\nUser agent\n\nPresumably, this same functionality could allow the attackers to target their victims based on\nlocation as well. For example, since they are targeting Chase Bank users here they might\nwant to restrict access only to American victims and hide their payload to other countries.\nThis could be changed to other nations as well if they wanted to repurpose their phishing\ntargets to TD Canada Trust or Barclays clients.\n\n\n-----\n\n## Payload\n\nFinally, we come to the payload of this phishing kit:\n\n_With super l33t writing to boot!_\n\nOf course, we have the blockers.php file included to filter out unwanted, prying eyes. If the\nunsuspecting victim unfortunately fills out this phishing form the attackers will have\nsurreptitiously syphoned off the following information:\n\nIP address\nLocation (city, country)\nUser agent\nBrowser\nOperating system\nBanking username and password\nSecurity token\n\nThat information then gets added to the following file:\n```\n./result/total_login.txt\n\n```\n…which is then displayed within the phishing administration panel. It can then easily be sent\noff to the designated email address of whomever purchased this commercial phishing kit\nfrom the original malware developers.\n\n\n-----\n\n## Protect Yourself and Your Website from Phishing Attacks\n\nBy and large, phishing directories do not find themselves on websites by exploiting any super\ncool software vulnerability, complicated security hole or firewall evasion technique. In fact,\nthese attacks are successful because of the most straightforward aspect of all: You, the\nwebsite owner.\n\nAlthough phishing directories can be uploaded through weak and vulnerable upload forms in\nwebsites, overwhelmingly what we see are weak passwords being brute forced, stolen and\nexploited. Usually these passwords are tied to cPanel or FTP accounts on servers, usually\nconfigured with a simple dictionary word followed by a number and maybe a special\ncharacter. Once the attackers have that access they can easily upload whatever files they\nwant into their victim’s website environment. It is also not uncommon for the attackers to\ndelete the website files entirely, either intentionally or not, forcing the website owner to either\nrestore a backup or completely rebuild their website if no backups are available. Always\n[make sure that you are using a daily backup service in the event that catastrophe strikes!](https://sucuri.net/website-backups/)\n\nUnfortunately, many users choose passwords based on their ability to remember them rather\nthan them being hard to guess or crack through brute force. As many as 52% of people\n[report re-using passwords across multiple platforms so definitely avoid this. Also, always](https://services.google.com/fh/files/blogs/google_security_infographic.pdf)\nensure that when you are logging into any service that you are on their official, HTTPS\nencrypted and verified website.\n\nAs a website owner, to avoid falling victim to a phishing attack make sure that your cPanel,\nFTP and hosting account passwords are long and complex and preferably stored in a\n[password manager browser extension such as LastPass. It’s also prudent to use some](https://www.lastpass.com/)\n[server-level security software such as Fail2Ban and](https://www.fail2ban.org/wiki/index.php/Main_Page) [OSSECHIDS to ban IP addresses that](https://www.ossec.net/)\nare trying to brute force their way into your hosting environment. Always consider security to\n\n\n-----\n\nbe a priority from the very beginning when building and maintaining a website. If your\nwebsite falls victim to such an attack it will likely be blacklisted by Google and other vendors,\nharming your website reputation in the process.\n\nIf you come across a phishing page or compromised website hosting such content, do\n[everyone a favour and report it to Google so they can issue a warning to other folks who](https://safebrowsing.google.com/safebrowsing/report_phish/?hl=en)\nmight otherwise fall victim to these attacks.\n\nIf you find that your website has fallen victim to such an attack, don’t panic! Our incident\n[response team can deploy malware removal tools to get you restored.](https://sucuri.net/website-malware-removal/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-01 - Analysis of a Phishing Kit (that targets Chase Bank).pdf"
    ],
    "report_names": [
        "2021-09-01 - Analysis of a Phishing Kit (that targets Chase Bank).pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535728,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653752563,
    "ts_modification_date": 1653752563,
    "files": {
        "pdf": "https://archive.orkl.eu/e08953f1297eccd736a7ed356ae8957a935e8934.pdf",
        "text": "https://archive.orkl.eu/e08953f1297eccd736a7ed356ae8957a935e8934.txt",
        "img": "https://archive.orkl.eu/e08953f1297eccd736a7ed356ae8957a935e8934.jpg"
    }
}