{
    "id": "981ad315-1f16-4456-a3be-deadbb65ab27",
    "created_at": "2023-01-12T15:04:01.811917Z",
    "updated_at": "2025-03-27T02:16:25.830754Z",
    "deleted_at": null,
    "sha1_hash": "2cae3225900aa8ab70942df2b252bb4672953cae",
    "title": "2022-02-10 - A walk through Project Zero metrics",
    "authors": "",
    "file_creation_date": "2022-05-28T19:09:55Z",
    "file_modification_date": "2022-05-28T19:09:55Z",
    "file_size": 112177,
    "plain_text": "# A walk through Project Zero metrics\n\n**[googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html](https://googleprojectzero.blogspot.com/2022/02/a-walk-through-project-zero-metrics.html)**\n\nPosted by Ryan Schoen, Project Zero\n\n## tl;dr\n\nIn 2021, vendors took an average of 52 days to fix security vulnerabilities reported from\nProject Zero. This is a significant acceleration from an average of about 80 days 3\nyears ago.\n[In addition to the average now being well below the 90-day deadline, we have also](https://googleprojectzero.blogspot.com/p/vulnerability-disclosure-faq.html)\n[seen a dropoff in vendors missing the deadline (or the additional 14-day grace period).](https://googleprojectzero.blogspot.com/p/vulnerability-disclosure-faq.html#deadlinemiss)\nIn 2021, only one bug exceeded its fix deadline, though 14% of bugs required the\ngrace period.\nDifferences in the amount of time it takes a vendor/product to ship a fix to users reflects\ntheir product design, development practices, update cadence, and general processes\ntowards security reports. We hope that this comparison can showcase best practices,\nand encourage vendors to experiment with new policies.\nThis data aggregation and analysis is relatively new for Project Zero, but we hope to do\nit more in the future. We encourage all vendors to consider publishing aggregate data\non their time-to-fix and time-to-patch for externally reported vulnerabilities, as well as\nmore data sharing and transparency in general.\n\n## Overview\n\nFor nearly ten years, Google’s Project Zero has been working to make it more difficult for bad\nactors to find and exploit security vulnerabilities, significantly improving the security of the\nInternet for everyone. In that time, we have partnered with folks across industry to transform\nthe way organizations prioritize and approach fixing security vulnerabilities and updating\npeople’s software.\n\nTo help contextualize the shifts we are seeing the ecosystem make, we looked back at the\nset of vulnerabilities Project Zero has been reporting, how a range of vendors have been\nresponding to them, and then attempted to identify trends in this data, such as how the\nindustry as a whole is patching vulnerabilities faster.\n\nFor this post, we look at fixed bugs that were reported between January 2019 and December\n2021 (2019 is the year we made changes to our disclosure policies and also began recording\nmore detailed metrics on our reported bugs). The data we'll be referencing is publicly\n[available on the Project Zero Bug Tracker, and on various open source project repositories](https://bugs.chromium.org/p/project-zero/issues/list)\n(in the case of the data used below to track the timeline of open-source browser bugs).\n\n\n-----\n\nThere are a number of caveats with our data, the largest being that we ll be looking at a small\nnumber of samples, so differences in numbers may or may not be statistically significant.\nAlso, the direction of Project Zero's research is almost entirely influenced by the choices of\nindividual researchers, so changes in our research targets could shift metrics as much as\nchanges in vendor behaviors could. As much as possible, this post is designed to be an\nobjective presentation of the data, with additional subjective analysis included at the end.\n\n## The data!\n\n[Between 2019 and 2021, Project Zero reported 376 issues to vendors under our standard](https://bugs.chromium.org/p/project-zero/issues/list?sort=id&colspec=ID%20Status%20Restrict%20Finder%20Reported%20Deadline%20Remaining%20CVE%20Vendor%20Product%20Summary&q=status%21%3DInvalid%20id%3E%3D1748%20id%3C%3D2248%20Deadline%3A90&can=1)\n90-day deadline. 351 (93.4%) of these bugs have been fixed, while 14 (3.7%) have been\nmarked as WontFix by the vendors. 11 (2.9%) other bugs remain unfixed, though at the time\nof this writing 8 have passed their deadline to be fixed; the remaining 3 are still within their\ndeadline to be fixed. Most of the vulnerabilities are clustered around a few vendors, with 96\nbugs (26%) being reported to Microsoft, 85 (23%) to Apple, and 60 (16%) to Google.\n\n## Deadline adherence\n\nOnce a vendor receives a bug report under our standard deadline, they have 90 days to fix it\nand ship a patched version to the public. The vendor can also request a 14-day grace period\nif the vendor confirms they plan to release the fix by the end of that total 104-day window.\n\nIn this section, we'll be taking a look at how often vendors are able to hit these deadlines.\nThe table below includes all bugs that have been reported to the vendor under the 90-day\ndeadline since January 2019 and have since been fixed, for vendors with the most bug\nreports in the window.\n\n### Deadline adherence and fix time 2019-2021, by bug report volume\n\n\nVendor Total\nbugs\n\n\nFixed by day\n90\n\n\nFixed\nduring\n\ngrace\nperiod\n\n\nExceeded\ndeadline\n\n& grace period\n\n\nAvg days to\nfix\n\n\nApple 84 73 (87%) 7 (8%) 4 (5%) 69\n\nMicrosoft 80 61 (76%) 15 (19%) 4 (5%) 83\n\nGoogle 56 53 (95%) 2 (4%) 1 (2%) 44\n\nLinux 25 24 (96%) 0 (0%) 1 (4%) 25\n\n\n-----\n\nAdobe 19 15 (79%) 4 (21%) 0 (0%) 65\n\nMozilla 10 9 (90%) 1 (10%) 0 (0%) 46\n\nSamsung 10 8 (80%) 2 (20%) 0 (0%) 72\n\nOracle 7 3 (43%) 0 (0%) 4 (57%) 109\n\nOthers* 55 48 (87%) 3 (5%) 4 (7%) 44\n\nTOTAL 346 294 (84%) 34 (10%) 18 (5%) 61\n\n- For completeness, the vendors included in the \"Others\" bucket are Apache, ASWF, Avast,\nAWS, c-ares, Canonical, F5, Facebook, git, Github, glibc, gnupg, gnutls, gstreamer, haproxy,\nHashicorp, insidesecure, Intel, Kubernetes, libseccomp, libx264, Logmein, Node.js,\nopencontainers, QT, Qualcomm, RedHat, Reliance, SCTPLabs, Signal, systemd, Tencent,\nTor, udisks, usrsctp, Vandyke, VietTel, webrtc, and Zoom.\n\nOverall, the data show that almost all of the big vendors here are coming in under 90 days,\non average. The bulk of fixes during a grace period come from Apple and Microsoft (22 out\nof 34 total).\n\nVendors have exceeded the deadline and grace period about 5% of the time over this period.\nIn this slice, Oracle has exceeded at the highest rate, but admittedly with a relatively small\nsample size of only about 7 bugs. The next-highest rate is Microsoft, having exceeded 4 of\ntheir 80 deadlines.\n\nAverage number of days to fix bugs across all vendors is 61 days. Zooming in on just that\nstat, we can break it out by year:\n\n### Bug fix time 2019-2021, by bug report volume\n\n\nVendor Bugs in 2019\n\n(avg days to fix)\n\n\nBugs in 2020\n\n(avg days to fix)\n\n\nBugs in 2021\n\n(avg days to fix)\n\n\nApple 61 (71) 13 (63) 11 (64)\n\nMicrosoft 46 (85) 18 (87) 16 (76)\n\n\n-----\n\nGoogle 26 (49) 13 (22) 17 (53)\n\nLinux 12 (32) 8 (22) 5 (15)\n\nOthers* 54 (63) 35 (54) 14 (29)\n\nTOTAL 199 (67) 87 (54) 63 (52)\n\n- For completeness, the vendors included in the \"Others\" bucket are Adobe, Apache, ASWF,\nAvast, AWS, c-ares, Canonical, F5, Facebook, git, Github, glibc, gnupg, gnutls, gstreamer,\nhaproxy, Hashicorp, insidesecure, Intel, Kubernetes, libseccomp, libx264, Logmein, Mozilla,\nNode.js, opencontainers, Oracle, QT, Qualcomm, RedHat, Reliance, Samsung, SCTPLabs,\nSignal, systemd, Tencent, Tor, udisks, usrsctp, Vandyke, VietTel, webrtc, and Zoom.\n\nFrom this, we can see a few things: first of all, the overall time to fix has consistently been\ndecreasing, but most significantly between 2019 and 2020. Microsoft, Apple, and Linux\noverall have reduced their time to fix during the period, whereas Google sped up in 2020\nbefore slowing down again in 2021. Perhaps most impressively, the others not represented\non the chart have collectively cut their time to fix in more than half, though it's possible this\nrepresents a change in research targets rather than a change in practices for any particular\nvendor.\n\nFinally, focusing on just 2021, we see:\n\nOnly [1 deadline exceeded, versus an average of 9 per year in the other two years](https://bugs.chromium.org/p/project-zero/issues/list?colspec=ID%20Status%20Restrict%20Finder%20Reported%20Deadline%20Remaining%20CVE%20Vendor%20Product%20Summary&q=id%3E%3D2137%20Deadline%3DExceeded%20-Deadline-Grace&can=1)\nThe grace period used 9 times (notably with half being by Microsoft), versus the slightly\nlower average of 12.5 in the other years\n\n## Mobile phones\n\nSince the products in the previous table span a range of types (desktop operating systems,\nmobile operating systems, browsers), we can also focus on a particular, hopefully more\napples-to-apples comparison: mobile phone operating systems.\n\nVendor Total bugs Avg fix time\n\niOS 76 70\n\nAndroid (Samsung) 10 72\n\n\n-----\n\nAndroid (Pixel) 6 72\n\nThe first thing to note is that it appears that iOS received remarkably more bug reports from\nProject Zero than any flavor of Android did during this time period, but rather than an\nimbalance in research target selection, this is more a reflection of how Apple ships software.\nSecurity updates for \"apps\" such as iMessage, Facetime, and Safari/WebKit are all shipped\nas part of the OS updates, so we include those in the analysis of the operating system. On\nthe other hand, security updates for standalone apps on Android happen through the Google\nPlay Store, so they are not included here in this analysis.\n\nDespite that, all three vendors have an extraordinarily similar average time to fix. With the\ndata we have available, it's hard to determine how much time is spent on each part of the\nvulnerability lifecycle (e.g. triage, patch authoring, testing, etc). However, open-source\nproducts do provide a window into where time is spent.\n\n## Browsers\n\nFor most software, we aren't able to dig into specifics of the timeline. Specifically: after a\nvendor receives a report of a security issue, how much of the \"time to fix\" is spent between\nthe bug report and landing the fix, and how much time is spent between landing that fix and\nreleasing a build with the fix? The one window we do have is into open-source software, and\nspecific to the type of vulnerability research that Project Zero does, open-source browsers.\n\nFix time analysis for open-source browsers, by bug volume\n\n\nBrowser Bugs Avg days from bug\nreport to public patch\n\n\nAvg days from public\npatch to release\n\n\nAvg days from bug\nreport to release\n\n\nChrome 40 5.3 24.6 29.9\n\nWebKit 27 11.6 61.1 72.7\n\nFirefox 8 16.6 21.1 37.8\n\nTotal 75 8.8 37.3 46.1\n\nWe can also take a look at the same data, but with each bug spread out in a histogram. In\nparticular, the histogram of the amount of time from a fix being landed in public to that fix\nbeing shipped to users shows a clear story (in the table above, this corresponds to \"Avg days\nfrom public patch to release\" column:\n\n\n-----\n\nThe table and chart together tell us a few things:\n\nChrome is currently the fastest of the three browsers, with time from bug report to releasing a\nfix in the stable channel in 30 days. The time to patch is very fast here, with just an average\nof 5 days between the bug report and the patch landing in public. The time for that patch to\nbe released to the public is the bulk of the overall time window, though overall we still see the\nChrome (blue) bars of the histogram toward the left side of the histogram. (Important note:\ndespite being housed within the same company, Project Zero follows the same policies and\nprocedures with Chrome that an external security researcher would follow. More information\n[on that is available in our Vulnerability Disclosure FAQ.)](https://googleprojectzero.blogspot.com/p/vulnerability-disclosure-faq.html#earlyaccess)\n\nFirefox comes in second in this analysis, though with a relatively small number of data points\nto analyze. Firefox releases a fix on average in 38 days. A little under half of that is time for\nthe fix to land in public, though it's important to note that Firefox intentionally delays\ncommitting security patches to reduce the amount of exposure before the fix is released.\nOnce the patch has been made public, it releases the fixed build on average a few days\nfaster than Chrome – with the vast majority of the fixes shipping 10-15 days after their public\npatch.\n\nWebKit is the outlier in this analysis, with the longest number of days to release a patch at 73\ndays. Their time to land the fix publicly is in the middle between Chrome and Firefox, but\nunfortunately this leaves a very long amount of time for opportunistic attackers to find the\n\n\n-----\n\npatch and exploit it prior to the fix being made available to users. This can be seen by the\nApple (red) bars of the second histogram mostly being on the right side of the graph, and\nevery one of them except one being past the 30-day mark.\n\n## Analysis, hopes, and dreams\n\nOverall, we see a number of promising trends emerging from the data. Vendors are fixing\nalmost all of the bugs that they receive, and they generally do it within the 90-day deadline\nplus the 14-day grace period when needed. Over the past three years vendors have, for the\nmost part, accelerated their patch effectively reducing the overall average time to fix to about\n52 days. In 2021, there was only one 90-day deadline exceeded. We suspect that this trend\nmay be due to the fact that responsible disclosure policies have become the de-facto\nstandard in the industry, and vendors are more equipped to react rapidly to reports with\ndiffering deadlines. We also suspect that vendors have learned best practices from each\nother, as there has been increasing transparency in the industry.\n\nOne important caveat: we are aware that reports from Project Zero may be outliers\ncompared to other bug reports, in that they may receive faster action as there is a tangible\nrisk of public disclosure (as the team will disclose if deadline conditions are not met) and\nProject Zero is a trusted source of reliable bug reports. We encourage vendors to release\nmetrics, even if they are high level, to give a better overall picture of how quickly security\nissues are being fixed across the industry, and continue to encourage other security\nresearchers to share their experiences.\n\nFor Google, and in particular Chrome, we suspect that the quick turnaround time on security\nbugs is in part due to their rapid release cycle, as well as their additional stable releases for\nsecurity updates. We're encouraged by Chrome's recent switch from a 6-week release cycle\nto a [4-week release cycle. On the Android side, we see the Pixel variant of Android releasing](https://blog.chromium.org/2021/03/speeding-up-release-cycle.html)\nfixes about on par with the Samsung variants as well as iOS. Even so, we encourage the\nAndroid team to look for additional ways to speed up the application of security updates and\npush that segment of the industry further.\n\nFor Apple, we're pleased with the acceleration of patches landing, as well as the recent lack\nof use of grace periods as well as lack of missed deadlines. For WebKit in particular, we\nhope to see a reduction in the amount of time it takes between landing a patch and shipping\nit out to users, especially since WebKit security affects all browsers used in iOS, as WebKit is\nthe only browser engine permitted on the iOS platform.\n\nFor Microsoft, we suspect that the high time to fix and Microsoft's reliance on the grace\nperiod are consequences of the monthly cadence of Microsoft's \"patch Tuesday\" updates,\nwhich can make it more difficult for development teams to meet a disclosure deadline. We\nhope that Microsoft might consider implementing a more frequent patch cadence for security\nissues, or finding ways to further streamline their internal processes to land and ship code\nquicker.\n\n\n-----\n\n## Moving forward\n\nThis post represents some number-crunching we've done of our own public data, and we\nhope to continue this going forward. Now that we've established a baseline over the past few\nyears, we plan to continue to publish an annual update to better understand how the trends\nprogress.\n\nTo that end, we'd love to have even more insight into the processes and timelines of our\nvendors. We encourage all vendors to consider publishing aggregate data on their time-to-fix\nand time-to-patch for externally reported vulnerabilities. Through more transparency,\ninformation sharing, and collaboration across the industry, we believe we can learn from\neach other's best practices, better understand existing difficulties and hopefully make the\ninternet a safer place for all.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-10 - A walk through Project Zero metrics.pdf"
    ],
    "report_names": [
        "2022-02-10 - A walk through Project Zero metrics.pdf"
    ],
    "threat_actors": [
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535841,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653764995,
    "ts_modification_date": 1653764995,
    "files": {
        "pdf": "https://archive.orkl.eu/2cae3225900aa8ab70942df2b252bb4672953cae.pdf",
        "text": "https://archive.orkl.eu/2cae3225900aa8ab70942df2b252bb4672953cae.txt",
        "img": "https://archive.orkl.eu/2cae3225900aa8ab70942df2b252bb4672953cae.jpg"
    }
}