{
    "id": "98434759-701d-45ba-bdf9-fa4efc1702bb",
    "created_at": "2023-01-12T15:08:41.162462Z",
    "updated_at": "2025-03-27T02:05:47.771407Z",
    "deleted_at": null,
    "sha1_hash": "35452595d4f5050eecf659eb804ffed74d8672ea",
    "title": "2016-05-06 - 7ev3n ransomware turning ‘HONE$T’",
    "authors": "",
    "file_creation_date": "2022-05-28T02:30:33Z",
    "file_modification_date": "2022-05-28T02:30:33Z",
    "file_size": 895796,
    "plain_text": "# 7ev3n ransomware turning ‘HONE$T’\n\n**[blog.malwarebytes.com/threat-analysis/2016/05/7ev3n-ransomware/](https://blog.malwarebytes.com/threat-analysis/2016/05/7ev3n-ransomware/)**\n\nhasherezade May 6, 2016\n\n**7ev3n ransomware appeared at the beginning of this year. In addition to typical features of**\nencrypting files, it was blocking access to the system using a fullscreen window, and was\ndifficult to remove. It also became famous for demanding an unrealistic price of 13 bitcoins.\n\nAt that time the product looked like in early stage of development, however, the code was\nshowing a potential to evolve into something smarter in the future. Indeed – the authors\ndecided to actively work on making improvements. Currently we are facing an outbreak of a\n[new campaign with an improved version of this ransomware – this time named 7ev3n-](https://www.malwarebytes.com/ransomware)\n**HONE$T. Probably the new name refers to the added feature of decrypting test files before**\nthe payment – as a proof of the authors’ “honesty” in giving files back.\n\nIn this post we will take a look at its evolution.\n\n**_[UPDATE] See also:_** **_[decryptors for 7ev3n ransomware](https://hshrzd.wordpress.com/2016/06/13/decoder-for-7ev3n-ransomware/)_**\n\n## Analyzed samples\n\n**7ev3n (old edition):**\n\n\n-----\n\n**7ev3n-HONE$T (new edition):**\n\n## Behavioral analysis\n\n### 73v3n – old version\n\nOnce executed, 7ev3n ransomware was installing itself, deleting the clicked copy and silently\nencrypting files. The first symptom that something was wrong was a notification that User\nAccount Control is going to be turned off, and the system needed to be restarted:\n\nThe malware was not waiting for the next restart, but executing it by its own. Shortly after\nanother notification the system was going to shut down:\n\nOn the next reboot, the attack of that version of 7ev3n ransomware was announced by a big\nwindow, covering the entire desktop and blocking access to the system. It was difficult to\nbypass. In order to regain the control over the system, the user needed to put some special\n[effort (guidance has been provided, i.e. by BleepingComputer).](http://www.bleepingcomputer.com/news/security/7ev3n-ransomware-trashes-your-pc-and-then-demands-13-bitcoins/)\n\n\n-----\n\nThe ransomware installed itself in %LOCALAPPDATA% – the main file is dropped under the\nname system.exe:\n\nIn addition, it dropped one more executable: uac.exe – for User Account Controll bypass,\n[using a well-known trick with Cabinet files (Akagi) and two bat scripts: del.bat (responsible](https://github.com/hfiref0x/UACME/tree/master/Source/Akagi)\nfor deleting the original file) and bcd.bat – responsible for disabling backup. Content of\n**bcd.bat demonstrated below:**\n```\nbcdedit /set {current} bootems no \n bcdedit /set {current} advancedoptions off \n bcdedit /set {current} optionsedit off \n bcdedit /set {current} bootstatuspolicy IgnoreAllFailures \n bcdedit /set {current} recoveryenabled off\ndel %0\n\n```\n**Encryption process**\n\n\n-----\n\nThis ransomware is capable of encrypting files off-line.\n\nEncrypted files had their name changed to <number in directory>.R5A.\n\nPatterns found in the encrypted files (R5A extension) look like two different algorithms have\nbeen used for it’s different chunks.\n\n**_square.bmp : left – original, right encrypted with 7ev3n_**\n\nEvery file was encrypted with a different key.\n\n### 73v3n – HONE$T\n\nThe new edition comes with an improved interface. The most important difference is that the\nauthors gave up the idea of blocking the full desktop of the infected computer. Although the\nwindow with ransom demand cannot be closed, it is still possible to access other programs.\nMoreover, the GUI itself has been enriched with features allowing for navigation and getting\nmore information. Similarly to other ransomware, it provides a possibility to decrypt a few\nfiles for the test.\n\n\n-----\n\n[In the new edition the price of decryption is only 1 BTC (in some samples even 0.5) – that is](https://www.hybrid-analysis.com/sample/2955d081ed9bca764f5037728125a7487f29925956f3095c58035919d50290b5?environmentId=4)\na huge difference in comparison to 13 BTC from the previous campaign. The new ransom\nnote offers various models of payment (i.e possibility to decrypt half of the files for 60% of the\noriginal price) and a 20% discount in case of paying full sum at once. As we can see, the\nauthors learned to be more user-friendly and made a step towards “honesty”.\n\nInstallation folder and dropped files are different than in the previous version (sample 1\nBTC):\n\n\n-----\n\nHowever, this feature depends rather on the particular campaign – in some of the new\nsamples the installation path is like in the previous edition (sample 0.5 BTC)\n\nThis time, the main executable is dropped either as conlhost.exe or as system.exe\n(depending on the sample). Also, in the same folder, the ransomware creates 2 files with lists\nof paths:\n\n**_files – containing all the encrypted files_**\n**_testdecrypt – containing files that have been chosen as testfiles that can be decrypted_**\nfor free\n\nThe dropped executable have some unique ID appended to it’s end. It is an array of 34\nrandom characters, with ‘*’ used as a prefix/suffix – format: ‘*[\\x00-\\xff]{34}*’. This key is\nsame on every run for a particular machine.\n\n_Example: Left – the sample before being run. Right – the sample that was run and installed_\non the system:\n\nPersistence is based on a Run registry key:\n\n\n-----\n\nIn addition to displaying the GUI with ransom note it also drops a TXT file with contact\ninformation, that can be used if – for any reason – the main windows didn’t manage to popup:\n\nThe victim ID is the same after every execution on the same machine, so we can be sure\nthat it is not random (it may be generated from some local identifiers, i.e. GUID).\n\n**Encryption process**\n\nThe new version also can encrypt files off-line (no key needs to be downloaded from the\nserver).\n\nEncrypted files had their name changed to A<number in directory>.R5A (or, for some of\nthe new samples <number in directory>.R5A –just like in the old version). The new feature\nis that some randomly selected files are given a different extension: .R4A.\n\nJust like in the to the previous edition, patterns found in the encrypted files (R5A extension)\nlook like two different algorithms have been used for its different chunks.\n\n**_square.bmp : first – original, second- encrypted with 7ev3n-HONE$T, third – encrypted with_**\nold 7ev3n.\n\n\n-----\n\nCompletely different algorithm has been deployed on the files with R4A extension\n(introduced newly in 7ev3n-HONE$T)\n\nWe can see the patterns of the original file reflected in it’s encrypted content. Such an effect\ndepicts, that file could have been encrypted by some block cipher – but as well it can be a\ncustom, XOR-based algorithm.\n\nAlso in this version, every file with R5A extension is encrypted with a different key.\n\n**Experiment**\n\nFor the purpose of experiments I prepared set of short TXT files, as given below:\n\n\n-----\n\nThey have been encrypted as following:\n\n_1.txt_\n\n_16A.txt_\n\n_long_filename.txt_\n\nThe file 16M.txt has not been encrypted at all.\n\nWe can see that each end every encrypted file starts with a character ‘M’. After that, there is\nan encrypted content – it’s length is the same like the original. However, the same plaintext\ndoes not produce the same encrypted content (compare 1.txt and 16A.txt).\n\n\n-----\n\nThe encrypted content is suffixed with a separator and then the encrypted filename is\nstored (it’s original length is preserved). The last character is always ‘\\x0A’. Format of the\nencrypted file can be defined as:\n```\nM<encrypted content>**<encrypted filename>\\x0A\n\n```\nFiles with content length shorter or equal 8 are excluded from the encryption. Similarly,\nexcluded are files which content begins with ‘M’. More details about why it happens, we will\nfind by analyzing the code.\n\n**Network communication**\n\nAlthough the internet connection is not required in the process of encryption, 7even is\ncapable of communicating with C&C for the purpose of collecting information about the\nattacked machines.\n\nDuring beaconing, various information about the current infection are sent. As usual, the\nvictim ID (the same that is mentioned in the ransom note), wallet ID (hardcoded in the\nbinary), operating system, etc.\n\nSending statistics from the encryption:\n\n## Inside 7ev3n (the old version)\n\nThe techniques used by 7ev3n are not very advanced, but yet it is worth to take a look.\n\nAnalyzed files:\n\n\n-----\n\n**system.exe (a3dfd4a7f7c334cb48c35ca8cd431071) – main file**\n**uac.exe (7a681d8650d2c28d18ac630c34b2014e)– upx-packed payload**\n\nThe main file (system.exe) comes with UAC bypassing tools embedded (32 and 64 bit\nversion – the one that is deployed is chosen appropriately for the system). Among strings we\ncan see list of decimal numbers, that need to be simply converted into ASCII.\nBeginning of the new PE in strings of the file:\n```\n77 90 144 0 3 0 0 0 4 0 0 0 255 255 0 0 184 0 0 0 0 0 0 0 64 0 0 0 0 0 0 0 0 0 0 0 0\n0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\n[...]\n\n```\n[We can convert it easily into a binary (i.e by this script) getting as a result 64 bit version of](https://github.com/hasherezade/crypto_utils/blob/master/convert.py)\n[the same UAC bypassing tool (original is packed by UPX unpacked version available here).](https://virustotal.com/en/file/740623ad32b8da524b0b77eee9cd3bb92cc9c050db479551a799d1b064b7fe38/analysis/1461610564/)\n\n### Registry manipulation\n\nAdding a registry key indicating that files are encrypted:\n```\nREG ADD \"HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\" /v \"crypted\"\n/t REG_SZ /d 1 /f\n\n```\nManipulating registry keys – i.e. in order to block the screen:\n```\nREG ADD \\\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\" /v\n\\\"System\\\" /t REG_SZ /d \\\"                \nREG ADD \\\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\" /v\n\\\"rgd_bcd_condition\\\" /t REG_SZ /d 1 /f /reg:64        \nREG ADD\n\\\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\System\\\"\n /v \\\"EnableLUA\\\" /t REG_DWORD /d 0 /f /reg:64  \nREG ADD \\\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\nNT\\\\CurrentVersion\\\\Winlogon\\\" /v \\\"Shell\\\" /t REG_SZ /d \\\"explorer.exe\\\" /f /reg:64\nREG DELETE \\\"HKEY_LOCAL_MACHINE\\\\SYSTEM\\\\CurrentControlSet\\\\Control\\\\Keyboard\nLayout\\\" /v \\\"Scancode Map\\\" /f /reg:64             \nREG DELETE \\\"HKEY_LOCAL_MACHINE\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\"\n/v \\\"System\\\" /f /reg:64 \n\n## Inside 7ev3n-HONE$T\n\n```\nThe first layer is a packing: a simple crypter/FUD with an icon added. It’s role is deception:\ndelivering malicious payload in a way unnoticed by antimalware tools, as well as making it’s\nanalysis harder.\n\nAfter defeating the FUD layer we get the first payload\n[(32a56ca79f17fea432250ee704432dfc). Strings and imported functions are not obfuscated.](https://virustotal.com/en/file/758b3c4beb8a0a8ed26830b0e79fc7da20de1c4943c3314c966d3227ed829974/analysis/1461513713/)\nWe can find the path to the project inside the binary – it suggests that we are dealing with the\nvariant without UAC bypass (in contrary to the previous version, that had it implemented):\n```\nC:\\Users\\admin\\Desktop\\new version with NO UAC\\Release\\Win32Project9 pdb\n\n```\n\n-----\n\nInside this payload we can find yet another, UPX packed executable:\n[5b5e2d894cdd5aeeed41cc073b1c0d0f . It is also not very well protected and after unpacking](https://virustotal.com/en/file/965dd4497093621c56679508e4b76f9f0fc2daf8a205be90a144cf92eecb3210/analysis/1461516239/)\nit with standard UPX application we get another executable\n[(d004776ff5f77a2d2cab52232028ddeb) with all the strings and API calls visible.](https://virustotal.com/en/file/56169b64ca71f7919a0f30621fb17fc040c2274772c0c4c328bb02a0de6d7d9a/analysis/1461513247/)\n\n### Execution flow\n\nFirst execution is used just for the purpose of installation.\n\nWhen the sample is deployed, it makes it’s copy into the predefined installation folder\n(destination may vary for various samples). It drops a batch script that is supposed to delete\nthe initial sample\n\nThe unique, hardware-based ID is written at the end of the executable that has been copied\nto the destination path:\n\nBelow – the same key – at the end of the installed sample:\n\n\n-----\n\nIn the meanwhile, of the installation, malware sends the beacon to a hardcoded URL.\n\nThen, the new sample is deployed and the initial sample terminates and gets deleted.\n\nThe installed sample is supposed to run the second phase – that encrypt the files. Decision\nwhich execution path should be deployed (installation, encrypion, or GUI is based on the\nenvironment check.\n\n### Registry manipulation\n\nAdding a registry key indicating that files are encrypted:\n```\nREG ADD \"HKEY_CURRENT_USER\\SOFTWARE\" /v \"crypted\" /t REG_SZ /d \"1\"\n\n```\nManipulating other registry keys – related with persistance, status of decrypting etc.\n```\nREG ADD \"HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\" /v\n\"allkeeper\" /t REG_SZ /d \"\" /f\nREG ADD \"HKEY_CURRENT_USER\\SOFTWARE\" /v \"testdecrypt\" /t REG_SZ /d 1 \nREG DELETE \"HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\" /v\n\"allkeeper\" /f\nREG ADD \"HKEY_CURRENT_USER\\SOFTWARE\" /v \"Decrypt50\" /t REG_SZ /d 1\n\n### What is attacked?\n\n```\nThis ransomware encrypts local drives as well as mapped network shares.\n\nEncrypted extensions are hardcoded in the binary as UNICODE strings:\n\nSummary of all the file extensions that are attacked:\n\n\n-----\n\n```\nai arw txt doc docm docx zip rar xlsx xls xlsb xlsm jpg jpe jpeg bmp eql sql adp mdf\nmdb odb odm odp ods pds pdt pdf dt cf cfu mxl epf kdbx erf vrp grs geo st pff mft efd\n3dm 3ds rib ma max lwo lws m3d mb obj x3d c4d fbx dgn dwg 4db 4dl 4mp abs adn a3d aft\nahd alf ask awdb azz bdb bib bnd bok btr bak cdb ckp clkw cma crd dad daf db3 dbk dbt\ndbv dbx dcb dct dcx ddl df1 dmo dnc dp1 dqy dsk dsn dta dtsx dxl eco ecx edb emd fcd\nfic fid fil fm5 fol fp3 fp4 fp5 fp7 fpt fzb fzv gdb gwi hdb his ib idc ihx itdb itw\njtx kdb lgc maq mdn mdt mrg mud mwb s3m myd ndf ns2 ns3 ns4 nsf nv2 nyf oce oqy ora\norx owc owg oyx p96 p97 pan pdb pdm phm pnz pth pwa qpx qry qvd rctd rdb rpd rsd sbf\nsdb sdf spq sqb stp str tcx tdt te tmd trm udb usr v12 vdb vpd wdb wmdb xdb xld xlgc\nzdb zdc cdr cdr3 ppt pptx abw act aim ans apt asc ase aty awp awt aww bad bbs bdp bdr\nbean bna boc btd cnm crwl cyi dca dgs diz dne docz dot dotm dotx dsv dvi dx eio eit\nemlx epp err etf etx euc faq fb2 fbl fcf fdf fdr fds fdt fdx fdxt fes fft flr fodt\ngtp frt fwdn fxc gdoc gio gpn gsd gthr gv hbk hht hs htc hwp hz idx iil ipf jis joe\njp1 jrtf kes klg knt kon kwd lbt lis lit lnt lp2 lrc lst ltr ltx lue luf lwp lyt lyx\nman map mbox me mell min mnt msg mwp nfo njx now nzb ocr odo odt ofl oft ort ott p7s\npfs pfx pjt prt psw pu pvj pvm pwi pwr qdl rad rft ris rng rpt rst rt rtd rtf rtx run\nrzk rzn saf sam scc scm sct scw sdm sdoc sdw sgm sig sla sls smf sms ssa stw sty sub\nsxg sxw tab tdf tex text thp tlb tm tmv tmx tpc tvj u3d u3i unx uof uot upd utf8 utxt\nvct vnt vw wbk wcf wgz wn wp wp4 wp5 wp6 wp7 wpa wpd wpl wps wpt wpw wri wsc wsd wsh\nwtx xdl xlf xps xwp xy3 xyp xyw ybk yml zabw zw abm afx agif agp aic albm apd apm\napng aps apx art asw bay bm2 bmx brk brn brt bss bti c4 cal cals can cd5 cdc cdg cimg\ncin cit colz cpc cpd cpg cps cpx c2 c2 rdds dg dib djv djvu dm3 dmi vue dpx wire drz\ndt2 dtw dvl ecw eip exr fal fax fpos fpx gcdp gfb ggr gif gih gim spr scad gpd gro\ngrob hdp hdr hpi i3d icn icon iiq info ipx iwi j2c j2k jas jb2 jbmp jbr jfif jia jng\njp2 jpg2 jps jpx tf jwl jxr kdc kdi kdk kic kpg lbm ljp mac mbm mef mnr mos mpf mpo\nmrxs myl ncr nct nlm nrw oc3 oc4 oc5 oci omf oplc af2 af3 asy cdmm cdmt cdt cgm cmx\ncnv csy cv5 cvg cvi cvs cvx cwt cxf dcs ded dhs dpp drw dxb dxf egc emf ep eps epsf\nfh10 fh11 fh3 fh4 fh5 fh6 fh7 fh8 fif fig fmv ft10 ft11 ft7 ft8 ft9 ftn fxg gem glox\nhpg hpgl hpl idea igt igx imd ink lmk mgcb mgmt mt9 mgmx mmat mat otg ovp ovr pcs pfv\npl plt vrml psid rdl scv sk1 sk2 ssk stn svf svgz sxd tlc tne ufr vbr vec vml vsd\nvsdm vsdx stm vstx wpg vsm xar yal orf ota oti ozb ozj ozt pal pano pap pbm pc1 pc2\npc3 pcd pdd pe4 pef pfi pgf pgm pi1 pi2 pi3 pic pict pix pjpg pm pmg pni pnm pntg pop\npp4 pp5 ppm prw psdx pse psp ptg ptx pvr pxr pz3 pza pzp pzs z3d qmg ras rcu rgb rgf\nric riff rix rle rli rpf rri rsb rsr rw2 rwl s2mv sci sep sfc sfw skm sld sob spa spe\nsph spj spp sr2 srw ste sumo sva save t2b tb0 tbn tfc tg4 thm tjp tm2 tn tpi ufo uga\nvda vff vpe vst wb1 wbc wbd wbm wbmp wbz wdp webp pb wpe wvl x3f ysp zif cdr4 cdr6\nddoc css pptm raw cpt pcx pdn png psd tga tiff tif xpm ps sai wmf ani fl fb3 fli mng\nsmil svg mobi swf html csv xhtm \n\n### How does the encryption work?\n\n```\n7ev3n-HONE$T encrypts files in a loop, one by one. It completely changes their names – but\nat the same time it stores the previous name (as we know, files that are decrypted have their\nnames recovered).\n\nThe executable comes with 3 hardcoded strings, that are used in the process of encryption.\nTheir exact role will be described further.\n\n\n-----\n\nEvery encrypted file have it s content prefixed with M . This character is also checked in\norder to distinguish, if the file has been encrypted. If the ‘M’ was found as a first character of\nthe buffer, the file will not be encrypted:\n\nAuthors left a log in the code, leaving no doubt about their intentions, that this character is\nused as an indicator of the encrypted file:\n\nOf course such a check is not giving a precise detection and if it happens that we have a file\nstarting from ‘M’ it will not be encrypted.\n\nThis ransomware produce encrypted files by two ways – they can be distinguished by\ndifferent extensions: .R4A or .R5A.\n\nAfter deobfuscation we were able to reconstruct both algorithms and notice, that they are\ncustom and not employing any strong cryptography.\n\n**R4A algorithm turned out to be an XOR with a hardcoded key:**\n```\nANOASudgfjfirtj4k504iojm5io5nm59uh5vob5mho5p6gf2u43i5hojg4mf4i05j6g594cn9mjg6h\n\n```\n**R5A algorithm is also XOR-based, but not that simple – It have several execution steps:**\n\n1. A hardcoded string is scrambled and expanded to a predefined length (in analyzed\n\nsamples it was 0x10C). The algorithm used for scrambling differs from sample to\nsample.\n\n\n-----\n\n2. The scrambled key (0x10C byte long) is XOR-ed with the original file path.\n3. The key created in the previous step is used to XOR file content\n4. The XORed content is divided to 4 parts, that are processed by 2 different XOR-based\n\nalgorithms. First and Third quarter are processed by algorithm I. Second and fourth –\nby algorithm II. (That’s why we have seen 4 ‘strips’ on the visualized content).\n\n[Full reconstruction of the used algorithms you can see here.](https://github.com/hasherezade/malware_analysis/tree/master/7ev3n)\n\nAdding appropriate extension to the file name:\n\nAfter encrypting the content, some more data is appended to it. At the beginning – the\npreviously mentioned ‘M’ character – as an indicator that file is encrypted. At the end – a\nstring “**” – as a separator after which the encrypted file name of the particular file is stored.\n\nFilename is also encrypted in a very simple way – by XOR with one of the hardcoded keys.\n\nfor R4A:\n```\nANOASudgfjfirtj4k504iojm5io5nm59uh5vob5mho5p6gf2u43i5hojg4mf4i05j6g594cn9mjg6h\n\n```\nfor R5A:\n\n\n-----\n\n```\nASIBVbhciJ5hv6bjyuwetjykok7mbvtbvtiJ5h6jg54ifj0655iJ5hok7mbok7mbvtvtv6bjfib56j45fkmbvt\n\n```\nThe encrypted content is saved first to the original file. After that the file is moved under the\nnew name:\n\n## Conclusion\n\n7ev3n ransomware has been around for quite a while, but till now not many details about its\ninternals have been revealed. It turned out to have pretty unexpected features. Although a lot\nhas been told about weakness of solutions that are based on custom encryption, there\nare still some ransomware authors going for it. That’s why it is worth not making any rushed\ndecisions in paying the ransom. Sometimes the code is obfuscated and finding out how it\nreally works takes some time for analysts – but it doesn’t mean that the encryption is really\nunbreakable.\n\nWork on the full version of the decryptor is in progress. For now you can see the proof-ofconcept script (tested on [this variant):](https://www.hybrid-analysis.com/sample/2955d081ed9bca764f5037728125a7487f29925956f3095c58035919d50290b5?environmentId=4)\n[https://github.com/hasherezade/malware_analysis/tree/master/7ev3n](https://github.com/hasherezade/malware_analysis/tree/master/7ev3n)\n\n## Appendix\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-05-06 - 7ev3n ransomware turning ‘HONE$T’.pdf"
    ],
    "report_names": [
        "2016-05-06 - 7ev3n ransomware turning ‘HONE$T’.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536121,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653705033,
    "ts_modification_date": 1653705033,
    "files": {
        "pdf": "https://archive.orkl.eu/35452595d4f5050eecf659eb804ffed74d8672ea.pdf",
        "text": "https://archive.orkl.eu/35452595d4f5050eecf659eb804ffed74d8672ea.txt",
        "img": "https://archive.orkl.eu/35452595d4f5050eecf659eb804ffed74d8672ea.jpg"
    }
}