{
    "id": "984dc4cc-0c18-4159-ab50-2120d7565c8a",
    "created_at": "2023-06-05T02:07:40.278798Z",
    "updated_at": "2025-03-27T02:17:02.401346Z",
    "deleted_at": null,
    "sha1_hash": "b513800507fe9714bf4414cc9841b15045f52e8f",
    "title": "2023-05-10 - BPFDoor Malware Evolves – Stealthy Sniffing Backdoor Ups Its Game",
    "authors": "",
    "file_creation_date": "2023-06-04T12:41:29Z",
    "file_modification_date": "2023-06-04T12:41:29Z",
    "file_size": 897139,
    "plain_text": "# BPFDoor Malware Evolves – Stealthy Sniffing Backdoor Ups Its Game\n\n**[deepinstinct.com/blog/bpfdoor-malware-evolves-stealthy-sniffing-backdoor-ups-its-game](https://www.deepinstinct.com/blog/bpfdoor-malware-evolves-stealthy-sniffing-backdoor-ups-its-game)**\n\nMay 10, 2023\n\n## Deep Instinct Included in the 2022 Gartner® Magic Quadrant™ for\n Endpoint Protection Platforms (EPP)\n\n[Learn more](https://www.deepinstinct.com/blog/who-is-the-only-new-vendor-in-the-2022-gartner-magic-quadrant-for-endpoint-protection-platforms)\n\nWhat is BPFdoor?\n\nBPFdoor is a Linux-specific, low-profile, passive backdoor intended to maintain a persistent,\nlong-term foothold in already-breached networks and environments and functions primarily to\nensure an attacker can re-enter an infected system over an extended period of time, postcompromise.\n\n[The malware gets its name from its usage of a Berkley Packet Filter – a fairly unique way of](https://en.wikipedia.org/wiki/Berkeley_Packet_Filter)\nreceiving its instructions and evading detection, which bypasses firewall restrictions on\nincoming traffic.\n\nThe malware is associated with a Chinese threat actor, Red Menshen (AKA Red Dev 18),\nwhich has been observed targeting telecommunications providers across the Middle East\nand Asia, as well as entities in the government, education, and logistics sectors since 2021.\n\nWhen it was first discovered, approximately one year ago, BPFdoor was noted for its\neffective and elegant design and its high emphasis on stealth – an essential element in\nmaintaining undetected long-term persistence.\n\nRecently, Deep Instinct’s threat lab observed and analyzed a previously undocumented and\nfully undetected new variant of BPFdoor.\n\nNew, Stealthier Variant\n\nSeveral key differences that make this new variant even stealthier compared to the previous\nversion include the following:\n\n**“Old” 2022**\n\n**“New stealthy” 2023 variant** **variant**\n\nEncryption Static library encryption RC4\nEncryption\n\n\n-----\n\n**“New stealthy” 2023 variant**\n\n\n**“Old” 2022**\n\n**variant**\n\n\nCommunication Reverse-Shell Bind shell and\n\niptables\n\n\nCommands No hardcoded commands – all commands are sent\n\nthrough the reverse-shell\n\n\nHardcoded\ncommands\n\n\nFilenames Not hardcoded Hardcoded\n\nOne of the most significant differences compared to the previous variant lies in the removal\nof many of its hardcoded indicators, making the newer version more difficult to detect. Since\nfirst seen on VirusTotal in February 2023, the new variant remained undetected and is still\nundetected as of this writing.\n\nBPFdoor Technical Analysis\n\nWhen executed, the BPFdoor sample will attempt to create and get a lock on a runtime file at\n_“/var/run/initd.lock” and will exit if it fails using that file as a makeshift mutex._\n\nFigure 1 - BPFdoor \"mutex\" check\n\nIf successful, BPFdoor will fork itself and continue to run as a child process and in this\ncontext will close its stdin, stdout, and stderr streams, and set itself to ignore the following\noperating system signals:\n\n\n**Signal**\n**Number**\n\n\n**Signal**\n\n**Name** **Signal Description**\n\n\n-----\n\n**Signal**\n**Number**\n\n\n**Signal**\n\n**Name** **Signal Description**\n\n\n1 SIGHUP SIGHUP (\"signal hang-up\") is a signal sent to a process when its\n\ncontrolling terminal session is closed.\n\n2 SIGINT SIGINT (“signal interrupt”) is a signal sent when a user interrupts\n\na program (Ctrl + C)\n\n3 SIGQUIT SIGQUIT is a signal sent to terminate a process.\n\n13 SIGPIPE SIGPIPE is a signal sent when a pipe breaks.\n\n17 SIGCHLD SIGCHLD is a signal sent when a child process exits.\n\n21 SIGTTIN SIGTTIN is a signal sent to a process attempting to read from the\n\nsame terminal session and is blocked.\n\n23 SIGTTOU SIGTTOU is a signal sent to a process attempting to write to the\n\nsame terminal session and is blocked.\n\nIgnoring these signals hardens BPFdoor against tampering with its processes.\n\nHaving set up the above, BPFdoor then allocates a memory buffer and creates a socket as\nfollows:\n\nFigure 2 - Socket arguments Figure 3 - Socket creation\n\nIt will proceed to specify the following socket options using setsockopt:\n\n\n-----\n\nFigure 4 - Setsockopt options\n\nFigure 5 - Call to setsockopt\nAnd will read from it in a loop (further described below) using recvfrom:\n\nFigure 6 - Recvfrom arguments Figure 7 - Recvfrom call\n\nAn interesting point in the above-described flow is that the “addr” parameter is zeroed out in\nthe call to recvfrom; it should point to a specific address from which to read data. The socket\nis not connected and no bind or listen calls have been made. So, what exactly is going on\nhere?\n\nInterpreting the exact arguments that are used to create the socket reveals that the call is\nstructured as follows:\n\nFigure 8 \nSocket call\nThis creates the socket as a special packet sniffing socket which is able to read every packet\nthat is sent to the machine from the ethernet layer and above without being bound to any\nspecific protocol.\n\nBPFdoor employs this type of packet sniffing socket to read data with recvfrom, even without\nan “addr” parameter, by using the loop below to search for a specific “magic” byte sequence:\n\n\n-----\n\nFigure 9 - Looped search for \"magic\" byte sequence (highlighted)\n“Magic” byte sequence: \\x44\\x30\\xCD\\x9F\\x5E\\x14\\x27\\x66\n\nOnce found, the loop will break and BPFdoor will continue to Its next phase of operation.\n\nBut, that creates quite a lot of traffic that BPFdoor will need to go through.\n\nLet’s examine the usage of setsockopt a bit further. When parsing its arguments, we arrive at\nthe following code:\n\nFigure 10 - Setsockopt attaches BPF\nThis is where BPFdoor gets its name from. The above code that attaches a Berkley Packet\nFilter to the socket; this is the very same mechanism that underpins infosec staples such as\nlibpcap and allows BPFdoor to filter out “uninteresting” types of data coming through its\nsocket.\n\nA Berkley Packet Filter can be defined as in the example below, which allows TCP over IPv4:\n\n\n-----\n\nFigure 11 - BPF\n\nexample\nBy setting the socket option SO_ATTACH_FILTER and pointing filter to the following\nsock_filter_code:\n\n\n-----\n\nFigure 12 - BPF sock_filter_code\nBPFdoor guides the kernel to set up its socket to only read UDP, TCP, and SCTP traffic\ncoming through ports 22 (ssh), 80 (http), and 443 (https).\n\nBecause of its positioning at such a low level, BPFdoor does not abide by any firewall rules,\nand can bypass any firewall restrictions on incoming traffic and listen for packets that\notherwise wouldn't have surfaced to the machine's user mode.\n\nWhen BPFdoor finds a packet containing its “magic” bytes in the filtered traffic it will treat it\nas a message from its operator and will parse out two fields and will again fork itself.\n\n\n-----\n\nThe parent process will continue and monitor the filtered traffic coming through the socket\nwhile the child will treat the previously parsed fields as a Command & Control IP-Port\ncombination and will attempt to contact it.\n\nFigure 13 \nConnect to Command & Control\nAn interesting point to note, this variant of BPFdoor contains a pre-compiled version of\n[libtomcrypt, an open-source encryption library, as can be seen in the sample’s contained](https://github.com/libtom/libtomcrypt)\nstrings, which also offer a few additional insights:\n\nFigure 14 \nContained strings\nWe can see that the library was compiled at the beginning of October 2022 using GCC on a\nsystem running Red Hat Linux. This may suggest that this variant has been operational\nsignificantly earlier than its first appearance on VirusTotal.\n\nBy compiling our own version of the library in similar fashion and using bindiff to compare\nagainst BPFdoor we can see its statically linked exports:\n\n\n-----\n\nFigure 15 \nLibtomcrypt bindiff snippet\nHaving made the comparison, we determined that BPFdoor is using libtomcrypt functionality\nto set up a secure and encrypted “reverse-shell” session with its Command & Control. This\nreplaced its previous mechanism.\n\nAfter this session is established, BPFdoor will begin a loop that can be described by the\nfollowing:\n\n\n-----\n\n-----\n\nConclusion\n\nBPFdoor retains its reputation as an extremely stealthy and difficult-to-detect malware with\nthis latest iteration.\n\nRegardless of whether one considers the encryption library compilation time (October 2022)\nor its initial submission to VirusTotal (February 2023) as indicative of when this sample was\nfirst put into use, it is truly amazing how long it has remained fully undetected.\n\nFigure 16 & 17 - 0 VirusTotal detections, 7 different scans.\nIOCs\n\n\n-----\n\nafa8a32ec29a31f152ba20a30eb483520fe50f2dce6c9aa9135d88f7c9c511d7 – BPFDoor\nELF SHA256\n\n/var/run/initd.lock – BPFDoor \"mutex”\n\nMITRE ATT&CK:\n\n**Tactic** **Technique** **Description** **Observable**\n\n\nCommand\nand Control\n\nDefense\n\nEvasion\n\nPersistence\n\nCommand\nand Control\n\nDefense\n\nEvasion\n\nPersistence\n\nCommand\nand Control\n\n\nT1205 - Traffic\n\nSignaling\n\nT1205.002 - Traffic\n\nSignaling: Socket\n\nFilters\n\nT1573 - Encrypted\n\nChannel\n\n\nAttacker employs “magic” values\n\nto trigger response.\n\nAttacker attaches filter to a\n\nnetwork socket.\n\nAttacker employs encrypted\n\nCommand & Control\n\ncommunication.\n\n\n“Magic” byte\n\nsequence\n\nUsage of\nBerkley Packet\n\nFilter\n\nUsage of\nlibtomcrypt\n\nUsage of\n\npopen\n\n\nExecution T1106 – Native API Attacker calls upon native OS\n\nAPIs in order to execute\n\nbehaviors.\n\n**Earlier variant analysis:**\n\n[https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor](https://www.elastic.co/security-labs/a-peek-behind-the-bpfdoor)\n\n\nDeep Instinct takes a prevention-first approach to stopping ransomware and other malware\nusing the world’s first and only purpose-built, deep learning cybersecurity framework. We\nprevent ransomware, zero-day threats, and previously unknown malware in <20\nmilliseconds, 750x faster than the fastest ransomware can encrypt. Deep Instinct has >99%\nzero-day accuracy and promises a <0.1% false positive rate. The Deep Instinct Prevention\nPlatform is an essential addition to every security stack – providing complete, multi-layered\nprotection against threats across hybrid environments.\n\n[Back To Blog](https://www.deepinstinct.com/blog)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-10 - BPFDoor Malware Evolves – Stealthy Sniffing Backdoor Ups Its Game.pdf"
    ],
    "report_names": [
        "2023-05-10 - BPFDoor Malware Evolves – Stealthy Sniffing Backdoor Ups Its Game.pdf"
    ],
    "threat_actors": [
        {
            "id": "9c8a7541-1ce3-450a-9e41-494bc7af11a4",
            "created_at": "2023-01-06T13:46:39.358343Z",
            "updated_at": "2025-03-27T02:00:03.06082Z",
            "deleted_at": null,
            "main_name": "Red Menshen",
            "aliases": [
                "Red Dev 18"
            ],
            "source_name": "MISPGALAXY:Red Menshen",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1685930860,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1685882489,
    "ts_modification_date": 1685882489,
    "files": {
        "pdf": "https://archive.orkl.eu/b513800507fe9714bf4414cc9841b15045f52e8f.pdf",
        "text": "https://archive.orkl.eu/b513800507fe9714bf4414cc9841b15045f52e8f.txt",
        "img": "https://archive.orkl.eu/b513800507fe9714bf4414cc9841b15045f52e8f.jpg"
    }
}