{
    "id": "98f92d3d-2e98-4315-bc9e-26ec2d607fcc",
    "created_at": "2023-02-02T02:08:33.299992Z",
    "updated_at": "2025-03-27T02:05:44.738498Z",
    "deleted_at": null,
    "sha1_hash": "a3054cf157f34306794578987a99ed13d22f2bb8",
    "title": "2022-11-28 - HiveV5 file decryptor PoC",
    "authors": "",
    "file_creation_date": "2023-02-01T07:38:09Z",
    "file_modification_date": "2023-02-01T07:38:09Z",
    "file_size": 499097,
    "plain_text": "# reecdeep/HiveV5_file_decryptor\n\n**github.com/reecdeep/HiveV5_file_decryptor**\n\nreecdeep\n\n## HiveV5 file decryptor PoC\n\n Introduction\n\nThe work done in the last few months has been necessary to reveal the malicious file\nencryption mechanism of Hive v5-5.2.\nThe work was divided into two parts\n\n1. [Keystream decryption](https://github.com/reecdeep/HiveV5_keystream_decryptor)\n2. File decryption using the decrypted keystream\n\n[I would like to thank the great @rivitna for the support, dialogue and advices of these months](https://twitter.com/rivitna2)\n[of work!\nPlease take note of rivitna's github full of useful informations about Hive ransomware](https://github.com/rivitna)\nand more.\n\nIn this readme you will find some information about the file decryption algorithm, referring\nyou to the PoC for a more complete picture of how it works.\nA keystream is an encrypted\ncleartext. A cleartext is a set of 0xA00000 bytes to which the first 0x2FFF00 bytes have been\nappended, for a total of 0xCFFF00 bytes. These bytes were created with the weak algorithm\nalready discussed in the first part released in July 2022.\nHere below is a example of\ncleartext:\n\n\n-----\n\n[The Hive sample analyzed and referred to in this document was chosen from this list created](https://github.com/rivitna/Malware/blob/main/Hive/Hive_samples.txt)\nby [@rivitna to which my warmest thanks go.\nTo get an idea of the complexity of ransomware,](https://twitter.com/rivitna2)\n[please take a look at this analysis published by Microsoft Threat Intelligence Center](https://www.microsoft.com/security/blog/2022/07/05/hive-ransomware-gets-upgrades-in-rust/)\n(MSTIC).\n\n## File encryption algorithm\n\nThe cleartext (a decrypted keystream) is used by Hive ransomware when encrypting each\nfile. When encrypting a file, Hive ransomware calculates two integers referring to precise\npositions in the cleartext (offsets) to be used to encrypt the file according to the following\nformula:\n\nwhere c = i % 0x2FFF00 e d = i % 0x2FFD00, with i as a byte counter.\n\n## The encrypted file extension\n\nThe preliminary operations before writing a file are:\n\nRenaming the file using MoveFileExW and changing its extension;\n\n\n-----\n\nWriting the renamed file with the result of the xor operation shown above.\n\nAlso in this case the cleartext plays a fundamental role. In fact it is used for:\n\n1. Determine the keystream ID (first 6 bytes) using a hash function\n2. Encrypt the positions (offsets) used to extract bytes from the cleartext\nHowever, the first\n\noffset is encrypted using a fixed position of the cleartext and is different for each Hive\n5/5.1/5.2 sample.\nA kind of magical value. In many Hive 5/5.1 artifacts this magic value\nis shown explicitly inside a memory reference, like in this case 0x98072A :\n\nOr this case 0x7539D:\n\nBut in the next evidence the for loop is slightly different and has been written in such a way\nas not to explicit the magic value that we need to identify. This concerns an artifact belonging\nto Hive 5.2:\n\n\n-----\n\nIn this case it is possible to use the offset bruteforce function present in the released tool,\nusing a file with a known extension and the relative decrypted keystream. Using the header\nof the encrypted file and the header of the unencrypted file it is possible to understand what\nis the offset from which the decryptor must start to decrypt the file.\n\nThe file encryption mode can have two values: 0xFB or 0xFF\n\n0xFB means that the ransomware encrypted the entire file without leaving any portion\nof the file unencrypted.\n0xFF means that the ransomware calculated a NCB (not encrypted block) for each file\nand encrypting blocks of 0x100000 bytes.\nFor further information regarding the\ncalculation of the size of the unencrypted blocks and the cleartext offset, please refer to\nthe PoC code.\n\n## Usage\n\nThe program offers two options:\n\n1. Decryption of files using the decrypted keystream. You need to enter the special offset\n\npresent in the sample that encrypted the files.\n2. Given a file with a known header (PDF, JPG, PNG, Office files) brute the possible value\n\nof the special offset by decrypting the first bytes and looking for a match with the known\nsignature\n\n## References\n\n[https://github.com/rivitna/Malware/blob/main/Hive/Hive_samples.txt](https://github.com/rivitna/Malware/blob/main/Hive/Hive_samples.txt)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-11-28 - HiveV5 file decryptor PoC.pdf"
    ],
    "report_names": [
        "2022-11-28 - HiveV5 file decryptor PoC.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1675303713,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1675237089,
    "ts_modification_date": 1675237089,
    "files": {
        "pdf": "https://archive.orkl.eu/a3054cf157f34306794578987a99ed13d22f2bb8.pdf",
        "text": "https://archive.orkl.eu/a3054cf157f34306794578987a99ed13d22f2bb8.txt",
        "img": "https://archive.orkl.eu/a3054cf157f34306794578987a99ed13d22f2bb8.jpg"
    }
}