{
    "id": "9906b7f0-f667-49a5-9c59-f3b0a6ed0d91",
    "created_at": "2023-01-12T15:06:11.194725Z",
    "updated_at": "2025-03-27T02:17:05.811061Z",
    "deleted_at": null,
    "sha1_hash": "cf50d3ee1938fb011626dbcc4c4cf3c50a2d593b",
    "title": "2022-04-23 - Industroyer2 in Perspective",
    "authors": "",
    "file_creation_date": "2022-05-28T19:41:29Z",
    "file_modification_date": "2022-05-28T19:41:29Z",
    "file_size": 495098,
    "plain_text": "# Industroyer2 in Perspective\n\n**pylos.co/2022/04/23/industroyer2-in-perspective/**\n\nJoe 04/23/2022\n\n## Background\n\n[On 12 April 2022, the Ukrainian CERT and](https://cert.gov.ua/article/39518) [ESET disclosed the existence of Industroyer2, a](https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/)\nsuccessor to the malware targeting Ukrainian electric distribution and transmission\noperations in 2016. Industroyer2 arrived after multiple disruptive cyber incidents of varying\ndegrees of success surrounding Russia’s brutal invasion of Ukraine, as presented in the\nfollowing timeline:\n\nOverall, cyber operations targeting Ukraine have ranged from the “merely annoying” (DDoS)\nto “quite concerning” (Industroyer2). Fully contextualizing events will take time and the\nrelease of additional information, evidence, and technical background, although some\n\n\n-----\n\n[preliminary observations are possible. In the case of Industroyer, we have several mysteries](https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/)\nto contend with:\n\n[Leaked reporting indicating potentially successful disruptive events in mid-March, prior](https://www.technologyreview.com/2022/04/12/1049586/russian-hackers-tried-to-bring-down-ukraines-power-grid-to-help-the-invasion/)\nto the known Industroyer2 compilation date, across multiple substations.\n\n\n-----\n\nThe overall timing of Industroyer2 events, well after the start of hostilities (and as\nRussian performance continued to deteriorate across its invasion).\n[Reporting from Ukrainian authorities indicating attempted disruptive operations are](https://twitter.com/dsszzi/status/1517828908284002304?s=20&t=BT4Eqqdlc5SYhVJik_a70Q)\nquite widespread and may even be ongoing after the Industroyer2 disclosure.\n\nThere are many threads to pull to evaluate the Industroyer2 incident, given limited reporting\nbut also the existence of samples in commercial malware repositories. While much remains\nto be uncovered with events, sufficient information is available at this time to draw some\npreliminary conclusions and set events in context with the current situation in Ukraine, as\nwell as previous operations.\n\n## Industroyer2 and Past Events\n\nIndustroyer2 represents the third (but presumably unsuccessful) electric power event\n[targeting Ukrainian civilian infrastructure. The first such event took place in 2015, when three](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2016/05/20081514/E-ISAC_SANS_Ukraine_DUC_5.pdf)\ndistribution substations were targeted through a combination of direct interaction with\noperator control systems and a “SCADA hijack” scenario to open breakers to disrupt the flow\nof electricity. The disruption was quickly followed by a wiper deployed to operator\nworkstations, as well as disruption to control center Uninterrupted Power Supply (UPS)\nsystems and deploying a malicious firmware update to serial-to-ethernet devices to\neffectively “brick” the systems. This also coincided with a DoS to utility telephone lines\ninhibiting the ability of customers to report outages to operators.\n\nThe event resulted in an outage lasting several hours impacting over 200,000 customers.\nOverall, the 2015 event appears to be a “success,” in terms of the capabilities deployed\nresulting in an impact scenario commensurate with tools used. While Ukrainian operators\nwere able to restore operations relatively quickly by manually reclosing breakers, anecdotal\nevidence indicates the system wiping and effective destruction of serial-to-ethernet\nconverters produced damage taking years to effectively correct.\n\nThe 2015 event was followed roughly a year later by another incident, this time using power\n[system-specific malware referred to as Industroyer or](https://www.welivesecurity.com/wp-content/uploads/2017/06/Win32_Industroyer.pdf) [CRASHOVERRIDE. In 2016, a](https://www.dragos.com/wp-content/uploads/CrashOverride-01.pdf)\ntransmission substation was targeted, providing for a potentially larger impact scenario than\nthe 2015 event. However, as [detailed in analysis in 2019, the first Industroyer event appears](https://www.dragos.com/wp-content/uploads/CRASHOVERRIDE.pdf)\n[to have been very ambitious as an integrity- and protection-targeting industrial incident, but](https://www.dragos.com/wp-content/uploads/Past-and-Future-of-Integrity-Based-ICS-Attacks.pdf)\nalso a failure due to various mistakes in designing and deploying tools for the (attempted)\ndisruption. Thus the 2016 event resulted in relatively less-significant impact than 2015,\nlargely due to errors on the part of the attackers.\n\nIndustroyer2 appears to have learned some lessons from the 2016 incident. As detailed in\npublic presentations, the [IEC-104 manipulation module for the original Industroyer failed due](https://www.ipcomm.de/protocol/IEC104/en/sheet.html)\nto programmatic errors and ignoring proper state change requirements for proper protocol\ncommunication. Shown in the following packet capture, Industroyer2 appears to properly\nimplement the IEC-104 protocol in following appropriate state transitions. While findings are\n\n\n-----\n\npreliminary and complete assessment would require testing on equipment similar to what\nwas targeted in victim environments, preliminary analysis would indicate the attackers paid\nattention to past failures and implemented corrections in their code.\n\nHowever, other aspects of Industroyer2 are significantly different than past incidents. While\nseveral wipers are associated with Industroyer2’s deployment, preliminary analysis from\nESET and CERT-UA assesses this was likely for destroying intrusion artifacts and evidence,\nwith limited targeting of non-Windows systems that has not yet been thoroughly evaluated in\nterms of impact and likely adversary intent. Lacking from this event are the sort of physically\ndestructive applications, such as the serial-to-ethernet converter targeting or the attempted\nremoval of line protection in 2016.\n\nGiven currently-available evidence, it would appear that the 2022 attempt, although\n[potentially of much wider scope (up to two million potentially impacted customers, based on](https://www.wired.com/story/sandworm-russia-ukraine-blackout-gru/)\nUkrainian assessment), was also potentially less destructive than prior activity. Precisely why\nthis is the case is unknown. Some possibilities include:\n\n1. Desire on the part of Russian decision-makers to enable relatively quick restoration of\n\nthe impacted sites as part of an invasion plan.\n2. Inability to develop a suitable physical destruction capability for the targeted\n\nsubstations in time for deployment because of a “rushed” decision-making process.\n3. Failure to deploy a destructive capability because the attack was interrupted by\n\nUkrainian defenders before an impact could occur.\n\nEach of these possibilities require more evidence to evaluate, although the first might be\npossible to examine if the targeted sites were disclosed. For example, if the sites were tightly\ncorrelated with Russian invasion lines of (attempted) advance, having a way to restore\n\n\n-----\n\nelectricity service but disrupting it during operations might make sense. The other two\npossibilities will require information not likely to be available for some time in order to\nproperly assess.\n\nIn any case, Industroyer2 appears to represent both an advance from earlier operations, in\nthat industrial communication seems to be properly implemented, and a step back in terms of\nhard-coded configurations (making each sample unique to its victim site) and lack of a postdisruption destructive element.\n\n## BlackEnergy3 Connections\n\nOne curious aspect of Industroyer2 concerns service names used during execution in\ndeployment. In analysis of non-public samples published by ESET and analysis of different\n(but apparently functionally equivalent) samples in commercial malware repositories, the\nfollowing set of strings are present for targeting purposes:\n\nWhile seemingly innocuous, those with good memories (or a bit of search engine skill) can\nrapidly identify where this name – PService_PPD.exe – previously appeared: in past\nreporting on BlackEnergy3 use in connection with the 2015 Ukraine power event.\n\nWhile BlackEnergy3 is not “industrial-specific” in the same sense as either Industroyer\n[variant or other items such as Triton, it did serve a critical enabling function as part of the](https://www.mandiant.com/resources/attackers-deploy-new-ics-attack-framework-triton)\noverall attack sequence leading up to power disruption. The name has no other significance\n\n\n-----\n\nor notable observations beyond this context.\n\nBoth ESET and CERT-UA link Industroyer2 (as well as the original Industroyer and at least\n[some of the wiper events in Ukraine in 2022) to the Sandworm actor, linked to GRU post](https://attack.mitre.org/groups/G0034/)\n74455. [Previous reporting and](https://www.mandiant.com/resources/ukraine-and-sandworm-team) [government disclosures also linked Sandworm to the 2015](https://www.cisa.gov/uscert/ncas/alerts/aa22-110a)\n\n\n-----\n\npower event, and the use of BlackEnergy3 malware. Re-use of a specific process name or\nstring would therefore appear to be a very strange mistake in operational security – or it\ncould represent some degree of “victim trolling” by threat actors.\n\nThe name itself has no significance or function beyond the BlackEnergy3-Industroyer2\nconnection. Why this appears is an open question, and likely one that will never be\nsatisfactorily resolved. However, this instance may be an interesting cyber threat intelligence\ncounter-example of where indicator-like alerting (e.g., on specific filenames or references to\nspecific processes) may actually be a reasonable defensive measure for identifying certain\nadversaries.\n\n## Relationship to Wider Operations and Events\n\nWhen Russia initiated its terrible invasion of Ukraine in late February 2022, commentators\nand analysis anticipated early operations to feature significant cyber components. While\n[some effects certainly were observed and](https://pylos.co/2022/02/25/contextualizing-cyber-components-in-conventional-conflict/) others discovered after collection of more\nevidence, many expected to observe critical infrastructure disruption along the lines of the\n2015 and 2016 power events. That such an impact was attempted but only over a month into\nthe conflict seems exceptionally strange, and defies expectations and assumptions around\nwhen to deploy such capabilities in conjunction with more traditional military operations.\n\nFirst, while we cannot say this with complete confidence, it does appear that initial Russian\n[plans for invading Ukraine envisioned a relatively quick decapitation of national leadership](https://www.wsj.com/articles/russias-shifting-war-plan-threatens-more-suffering-for-eastern-ukraine-11648289112)\nand centers of gravity, centered around the sack of Kyiv. As part of this operation, one can\nassume that leaving critical infrastructure largely intact was probably an initial requirement to\nfacilitate occupation and subsequent installation of a puppet regime. As Russia’s\nincompetence and Ukraine’s bravery stymied these plans, a noticeable shift to indiscriminate\nattacks on population centers and infrastructure was observed. That a latent capability such\nas power system-targeting malware would be unleashed after such initial aims failed may\ntherefore make sense, along the lines of similar questionable Russian decisions such as\nusing [sophisticated anti-ship cruise missiles to target stationary targets on land.](https://www.washingtonpost.com/world/2022/03/24/russia-kalibr-cruise-missile-ukraine-weapons/)\n\nChanging war aims aside, at the start of the conflict Ukraine’s electric sector remained linked\nto Russian grid operations. Coinciding with the start of Russia’s invasion, Ukrainian operators\n[initiated an isolation test from Russian grid operations, and subsequently decided to not](https://ec.europa.eu/commission/presscorner/detail/en/SPEECH_22_1525)\nreconnect. While separating Ukraine from Russian grid operations, this also left Ukraine’s\ngrid isolated and thus more easily susceptible to disruption. Russian operations to capture\n[electric infrastructure, such as events in Chernobyl and Zaporizhzhia, could thus give Russia](https://www.nytimes.com/2022/03/04/science/ukraine-nuclear-power-plant.html)\nready control over Ukrainian electric operations, or at least significant influence over them.\n\nThis changed in mid-March, when Ukraine (and Moldova) successfully connected to the\nEuropean electric grid under ENTSO-E. As stated previously, this timing is interesting as\nsome suspected disruptive events appeared to take place immediately after this switchover.\nBut with Ukraine now part of the wider European electric system, unilateral options for\n\n\n-----\n\nRussia to control or manipulate Ukrainian electric operations were removed, or significantly\nreduced. Thus the timing of Industroyer2 after not just the start of the conflict, but also after\n[integration with ENTSO-E, makes more sense in light of these changes.](https://www.entsoe.eu/data/map/)\n\n## Conclusions\n\nMany details surrounding Industroyer2 and related (attempted) attacks on Ukrainian electric\ninfrastructure are unavailable, but sufficient information has emerged to allow for the\npreliminary observations above. Overall, the evolution of operations in Russia’s invasion of\nUkraine show that many assumptions surrounding the use of cyber capabilities as part of a\nconventional conflict require revision – but at the same time, we should also note that cyber\nhas been far from absent as part of hostilities. While paling in comparison to Russia’s\nphysical brutality, cyber operations appear to form a continuing area of interest and\ninvestment for Russia in attempting to achieve its goals in Ukraine.\n\nWith time and additional data, the items above can be revisited and improved. I would\ncaution anyone reading this, or any other, analysis that in the case of both the 2015 and\nespecially the 2016 power incidents in Ukraine, reasonably complete understanding of these\nevents did not occur until years after the events in question. Especially given the difficulties\nof network defense, forensics, and electric system operations in the middle of an invasion,\nresearchers would do well to be patient with matters such as this, and maintain a willingness\nto revise conclusions appropriately as more information emerges.\n\nOverall, Industroyer2 represents an interesting and important development surrounding the\nbroader violence Russia is inflicting upon Ukraine. Given that the malware did not result in a\ndisruption of service, other asset owners and operators should take note that robust, alert\noperations are critical in maintaining sufficient defense and resilience in the face of critical\ninfrastructure threats. We can learn much from Ukraine’s efforts in this conflict, not the least\nof which being how to maintain fundamental civilian services even in the face of a brutal, allout assault.\n\n## Technical Details\n\nWhile CERT-UA and ESET published some indicators related to Industroyer2, some other\nsamples appeared with equivalent functionality that were not previously identified in original\nreports. The following table provides a list of known Industroyer2 samples and potential\nvariants.\n\nFile Name SHA1 Note\n\n108_100.exe FD9C17C35A68FC505235E20C6E50C622AED8DEA0 Industroyer2\nvariant listed by\nESET, CERT-UA.\n\n\n-----\n\n40_115.exe FDEB96BC3D4AB32EF826E7E53F4FE1C72E580379 Industroyer2\nvariant\ndiscovered on\nVirusTotal.\n\nN/A 39B27DE81915B748EC56D1C5DF7E017B4A20323B Possible\nresearcher\nmodification of\navailable sample.\n\nN/A 1574A402E5604F17BC0068F196D8BCDCB05286E7 Possible\nresearcher\nmodification of\navailable sample.\n\n## Acknowledgments\n\nHuge thanks to the teams at ESET and CERT-UA for disclosing information for defenders\n[and enabling this analysis, as well as the team at MSTIC for their continued support of](https://www.microsoft.com/security/blog/microsoft-security-intelligence/)\n[Ukrainian defenders. Special thanks to Dan Gunter and](https://twitter.com/dan_gunter) [InsaneForensics for enabling](https://insaneforensics.com/)\nprotocol analysis of available Industroyer2 samples in a functioning lab environment.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-23 - Industroyer2 in Perspective.pdf"
    ],
    "report_names": [
        "2022-04-23 - Industroyer2 in Perspective.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535971,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1653766889,
    "ts_modification_date": 1653766889,
    "files": {
        "pdf": "https://archive.orkl.eu/cf50d3ee1938fb011626dbcc4c4cf3c50a2d593b.pdf",
        "text": "https://archive.orkl.eu/cf50d3ee1938fb011626dbcc4c4cf3c50a2d593b.txt",
        "img": "https://archive.orkl.eu/cf50d3ee1938fb011626dbcc4c4cf3c50a2d593b.jpg"
    }
}