{
    "id": "991bb2fc-0291-4dd0-a52b-9126e1b2a039",
    "created_at": "2023-03-03T02:05:57.994553Z",
    "updated_at": "2025-03-27T02:11:43.583688Z",
    "deleted_at": null,
    "sha1_hash": "0405bdbb8be2f4ef64de67d955a380aaaf699ea8",
    "title": "2023-02-07 - The Approach of TA413 for Tibetan Targets",
    "authors": "",
    "file_creation_date": "2023-03-01T09:13:32Z",
    "file_modification_date": "2023-03-01T09:13:32Z",
    "file_size": 1074315,
    "plain_text": "# The Approach of TA413 for Tibetan Targets\n\n**[malgamy.github.io/malware-analysis/The-Approach-of-TA413-for-Tibetan-Targets/](https://malgamy.github.io/malware-analysis/The-Approach-of-TA413-for-Tibetan-Targets/#third-stage)**\n\n12 minute read\n\n## Summary\n\n\nFebruary 7, 2023\n\n\nThis attack chain begins with the victim receiving a malicious RTF file through a phishing\nattack. When the victim opens the RTF file, it contains a hidden encoded file which is then\ndecoded and executed using a shellcode. The executed file then performs process\nhollowing, injecting itself into the rundll32.dll process and establishing a connection with the\nattacker’s command and control (C2) server.\n\nOnce connected to the C2 server, the infected machine begins sending data about itself to\nthe attacker, who can then use this information to send further modules and commands to\nthe infected machine.\n\n\n-----\n\n## Technical analysis\n\nDuring our analysis, we collected some important information about the document file in\nquestion. By utilizing VirusTotal to scan the file’s hash, we were able to detect that the file is\na RTF document that has been flagged by 34 different security solutions. Further analysis\nrevealed that the RTF document exploits several known vulnerabilities, including CVE-201711882, CVE-2017-8759, CVE-2018-0802, and CVE-2018-0798.\n\nUsing the tool rtfobj, we were able to extract multiple objects from the RTF document. Upon\nexamining these objects, we identified an exploit code. exploit code equation drop encode\npayload on temp folder Temp\\ghb4nrwmp.wmf. After deconding dropped file, it executed to\nreliver second stage.\n\n\n-----\n\nFurther investigation revealed that the RTF document is related to the Royal Road.\n\nRoyal Road: It is known for its use of weaponized Microsoft Office documents to deliver\npayloads, including ransomware and other malicious software. The documents often exploit\nvulnerabilities in software such as Adobe Reader or Microsoft Office to execute the payload\nwithout the user’s knowledge.\n\nRoyalRoad has been used in various campaigns targeting individuals and organizations\naround the world. It has been observed being delivered through spam emails, exploit kits,\nand other methods. Once the payload is delivered and executed, it may perform various\nmalicious actions such as encrypting files, stealing sensitive information, and installing other\nmalware.\n\nDuring our analysis, we utilized the rr_decoder tool to decode the second stage payload of\nthe RoyalRoad malware, which was named “ghb4nrwmp.wmf”. The results of the decoding\nare shown in the figure below.\n\n$python3 rr_decode.py sample_ghb4nrwmp.wmf second_stage.exe\n\n[!] Type [b2a66dff] is Detected!\n\n[+] Decoding…\n\n[!] Complete!\n\n## second stage\n\nUpon decoding the second stage payload of the RoyalRoad malware, second stage is\npacked. so we identified that it utilized the VirtualAlloc function multiple times to allocate a\nregion of memory in which to copy shellcode. Upon transferring execution to the shellcode,\nwe observed the use of obfuscation techniques such as stack strings to obscure the names\n\n\n-----\n\nof APIs. Further analysis revealed that the shellcode used the LoadLibraryA and\n“GetProcAddress” functions to resolve and locate APIs necessary for injecting the third stage\nof the malware into the “rundll.dll” process.\n\nIn order to understand the injection process used by the RoyalRoad, we analyzed the\nbehavior of the payload and identified the following steps:\n\nThe malware utilizes the VirtualAlloc function to copy shellcode into a region of\nmemory.\nThe shellcode uses stack strings to obscure the commandline.\nThe CreateProcA function is used to create a process in a suspended state (0x4)\n```\n   rundll32.dll.\n\n```\nA handle to the target process is obtained to allocate a region of memory on it using\n```\n   VirtualAllocEx.\n\n```\nThe third stage of the malware is copied into the target process using\n```\n   WriteProcessMemory`.\n\n```\nThe third stage is executed using the ResumeThread function.\n\nFrom the previous steps, we can identif that second stage used process hollowing to inject\nthird stage into rundll.dll and excute it using this commandline\n```\n   C:\\Windows\\system32\\rundll32.exe\"shell32.dll,Control_RunDLL\n\n## thrid stage\n\n```\nThe third stage of the malware is developed in C and functions as a backdoor to collect\ninformation about the infected system and send it to the attacker. If the attacker determines\nthat the infected system is of interest, they may choose to drop the next stage of the\nmalware.\n\n## mutex\n\nUpon analysis of the malware, it was observed that the malware creates a mutex with the\nidentifier “552FFA80-3393-423d-8671-7BA046BB5906.” This mutex is also used as the\nmalware’s campaign name, as shown in the following figure.\n\n\n-----\n\n## obfuscation\n\nThe malware is equipped with a capability to encrypt strings using a simple XOR algorithm.\nThis function was used by the malware to decrypt APIs into runtime in order to evade\ndetection by static analysis tools. The malware also loaded 4 libraries into runtime using this\ntechnique. It is worth noting that different keys were used to decrypt the APIs and the\nlibraries.\n\nThe keys used for decryption are as follows:\n\nKey for decrypting APIs : cffb9895f0dcddca9e8befc4aee9b1bf (in hex)\n\nKey for decrypting libraries: bf8a87e415cebb95aaf991b08ec486a4 (in hex)\n\n\n-----\n\nAfter decrypting the APIs, the malware was able to utilize the GetProcAddress function to\nresolve the APIs and load the libraries using LoadLibraryA. This allowed the malware to\nexecute its desired functions at runtime and we can include laoded libraries.\n\nws2_32.dll\nntdll.dll!\nadvapi32.dll\n\nwe can see our script to decrypted encrypted strings.\n```\ndef unhex(hex_string):\n\n  import binascii\n\n  if type(hex_string) == str:\n\n    return binascii.unhexlify(hex_string.encode('utf-8'))\n\n  else:\n\n    return binascii.unhexlify(hex_string)\n\ndef tohex(data):\n\n  import binascii\n\n  if type(data) == str:\n\n    return binascii.hexlify(data.encode('utf-8'))\n\n  else:\n\n    return binascii.hexlify(data)\n\nout = []\n\ndata = unhex(\"c8f8b7b822f993f6ce9c9b\")\n\nkey = unhex(\"bf8a87e415cebb95aaf991b08ec486a4\")\n\n\nfor i in range(0, len(data)):\n\n  out.append(i ^ data[i] ^ key[i & 15])\n\nprint(bytes(out))\n\n\n## collecting sensitive information\n\n```\nfunction appears to be designed to gather and encode various system information. It does\nthis by first decrypting several strings using the mw_decrypt_strings function. These strings\nare likely API names or other relevant information that is used later in the function.\n\nThe function then calls one of the decrypted functions (either GetNativeSystemInfo or\nGetSystemInfo) to retrieve system information and stores it in an array called system_info.\nThis information may include details such as the system’s processor, memory, and operating\nsystem.\n\nThe function then encodes this information, as well as the hostname and username, using\nthe mw_base64_encode function. The encoded strings are then concatenated into a single\nstring.\n\n\n-----\n\ncollected information:\n\nUsername\nProcess name and Process ID\nIP Address\nHostname\n\n## Evade Detection\n\nAfter gathering and encoding data, the malware appears to use the LZF compression\nalgorithm to compress the data further. It then applies an XOR operation with the value 0x2b\nto encrypt each element of the compressed data before encoding it again using the base64\nencoding method. This process may be used to reduce the size of the data for easier\ntransmission.\n\n## Establish a connection\n\nMalware establish a connection with the server over a socket, so malware call htons to\nensure that the data is correctly interpreted by the receiving system then call\n\nmw_create_listen: to create a socket that can listen for incoming connections.\n\n\n-----\n\nmw_send_socket_connection: to be used to send a socket connection request to a\nserver.\nmw_establishing_connection_server: to be used to establish a connection with a\nserver.\n\n## implemention of a simple HTTP\n\nThe malware appears to have implemented a simple HTTP client that can send HTTP\nrequests to a server and receive responses. The process begins by extracting the hostname\nand port number for the connection. A socket is then created and a connection is established\nwith the server.\n\nThe malware then constructs an HTTP request using the following format: “CONNECT\n%s:%d HTTP/1.1\\r\\nProxy-Connection: Keep-Alive\\r\\nContent-Length: 0\\r\\nHost:\n%s\\r\\nUser-Agent: %s\\r\\n”. The request is then sent to the server and a response is\nreceived. It is not clear how the response is processed or what the purpose of the request is.\n\n\n-----\n\n## Encryption data with AES\n\nAfter establishing a connection with the server, the malware appears to be utilizing the AES\nalgorithm to encrypt data before sending it to the server. It uses a ransom key as the initial\nkey for the encryption process and then receives a key from the server to encrypt the data\nagain\n\n\n-----\n\n## c2 response\n\nmalware appears to use a specific method for receiving encrypted data from the server and\ndecrypting it. This data is likely to be modules or commands that are used for specific tasks.\nThe decryption process is reversing method that was used to encrypt the data, which\nincludes:\n\nLZF compression\nXORing with 0x2b\nBase64 encoding\nAES encryption with a randomly generated key\nAES encryption with a key derived from the XOR of the Client, Server Random Bytes\nKey\n\n## commands\n\nmalware checkes the header of response with “PK” and receive also one commands or more\nand we can see the commands in the next figure.\n\nCommand 2000: which used to decode using base64, decrypt, with 0x2b key and\ndecompress uing LZF.\n\n\n-----\n\nWe can see a table of commands\n\n**No.** **command** **info**\n\n1 2000 which used to decode using base64, decrypt, with 0x2b key and\ndecompress uing LZF\n\n2 2001 clear the command of data\n\n3 2002 set communication delay time\n\n4 2003 exit command loop\n\n5 2004 break connection\n\n6 2005 load module from attaker into memory\n\n7 2006 run module\n\n8 default listen for proxy connection\n\n## Analysis Infrastructure\n\n\n-----\n\nIt appears that the hostname 45.77.19.75.vultrusercontent.com is associated with the\ndomain “VULTRUSERCONTENT.COM” and is hosted by the cloud provider Vultr. The\nhost is located in Japan, specifically in the city of Ōi. The organization responsible for\nthe host is Vultr Holdings, LLC, and the ISP is The Constant Company, LLC. The ASN\nassociated with the host is AS20473. It is important to note that the presence of a host\nor domain on a cloud provider does not necessarily indicate malicious activity.\n\nThe network and AS are likely used by the malware for communication with its\ncommand and control (C2).\n\n## Classification and attribution\n\nAttribution refers to the process of identifying the source of a cyber attack or threat. It is often\ndifficult to accurately attribute cyber attacks to a specific country, as attackers often use\nvarious tactics to hide their identity and location. There are a number of factors that can be\nused to help attribute a cyber attack to a specific country, including:\n\nVictimology: This refers to the characteristics of the victims of the attack, such as the type of\norganization or industry they belong to. If a group of attacks all target organizations in a\nspecific country, it can be a strong indication that the attacks are coming from that country.\n\nInfrastructure: If a group of attacks all use the same infrastructure, such as a specific set of\nservers or domain names, this can be used to help attribute the attacks to a specific country\nor group.\n\nTactics, Techniques, and Procedures (TTPs): The specific tactics and techniques used in an\nattack can often be used to identify the group or country behind the attack.\n\nMalware used: The type of malware used in an attack can often be used to attribute the\nattack to a specific group or country.\n\nA spreadsheet targeting a Tibetan organization was used and a domain, tibet[.]bet, was\nattributed to the TA413 group for the attack. ansd we can see that in the next figure.\n\n\n-----\n\nIn this particular case, TA413 are known to have impersonated the “Department of Religion &\nCulture.” This type of social engineering tactic is often used to trick individuals into revealing\nsensitive information or downloading malware.\n\n\n-----\n\n**ideas how to track activity of this tool:**\n\nSet up a YARA rule to identify the RTF version of the Royal Road tool or any\nassociated indicators of compromise (IOCs). This can be done by analyzing the\ncharacteristics of the RTF file, such as specific strings of code or patterns of behavior,\nand creating a rule that matches these characteristics.\n\nUse YARA to scan your network for any instances of the RTF version of the Royal\nRoad tool or associated IOCs. This can be done by running YARA on a schedule, such\nas daily or weekly, or in real-time as part of a threat hunting process.\n\nWhen YARA detects a match, conduct further investigation to determine the scope and\nimpact of the RTF version of the Royal Road tool on your network. This may involve\nanalyzing network traffic, examining system logs, and performing forensic analysis on\naffected systems.\n\nTake appropriate remediation steps to remove the RTF version of the Royal Road tool\nfrom your network and secure any affected systems. This may involve isolating infected\nsystems, patching vulnerabilities, and implementing additional security measures to\nprevent future attacks.\n\n\n-----\n\nUse threat intelligence sources to stay informed about the latest tactics and techniques\nused by APT groups, including those that use the RTF version of the Royal Road tool.\nThis can help you stay ahead of potential threats and better defend your network.\n\n## TTPs\n\n Yara Rule\n```\nrule lowzero_malware: lowzero\n\n{\n\n  meta:\n\n     description = \"Detect_lowzero_malware\"\n\n    author = \"@malgamy12\"\n\n     date = \"2022/12/26\"\n\n     license = \"DRL 1.1\"\n\n    hash = \"de44e5f6cfac9cd3e61194efd5c2b20ba44c437a520fe7018ed7f623e66f8131\"\n\n  strings:\n\n    $pdb = \"Proxy-Authorization: NTLM \" ascii\n\n    $op = {8B C1 8D 14 39 83 E0 ?? 8A 44 05 ?? 32 04 16 32 C1 41 88 02 3B CB}\n\n  condition:\n\n    uint16(0) == 0x5A4D and all of them\n\n}\n\n```\n\n-----\n\n## IOCs\n\n Frist stage\n\n9681ef910820d553e4cd54286f8893850a3a57a29df7114c6a6b0d89362ff326\n\n## second stage\n\n028e07fa88736f405d24f0d465bc789c3bcbbc9278effb3b1b73653847e86cf8\n\n## third stage\n\nde44e5f6cfac9cd3e61194efd5c2b20ba44c437a520fe7018ed7f623e66f8131\n\n## IP\n\n45.77.19.75\n\n## domain\n\nchorig-org.web.app\ndesktoppreview.com\nodc.officeapps.live.com\n\n## ip addresses\n\n131.107.255.255\n45.77.19.75\n## 199.36.158.100\n\n urls\n\nhttps://chorig-org.web.app/Application-form-Sixmonth-workshop-2022V1.doc\nhttp://chorig-org.web.app/Application-form-Sixmonth-workshop-2022V1.doc\nhttp://desktoppreview.com/salvoed.dotx\nhttps://desktoppreview.com/salvoed.dotx\n\n## Files\n\n0b30433bb80abd4b1978fa84d953c13f4d7b726cd533e3c50cef36b4e79f2d2e\ncfc72b48732286a2beab5d0fc60aabc8d529faf4d0fb262b99a092096a187dc0\n1351dca77922b22ab5dae0689550cb55807900348a42b5dc71b01a5a78602b0f\n9681ef910820d553e4cd54286f8893850a3a57a29df7114c6a6b0d89362ff326\nba2c89192643f05e64f49b5cb3513a6a5bbfa719225af3b72c83587b8b774e8d\n\n\n-----\n\nd987e80a23f334c5eb50c9883a6b5b1b2090230f950fa5eb7cec0a2d74f5271b\n3a69c1453b8062620837ab32be68ed871df383e24e68161839508a98bf7033b8\nc0fc6a2ba864650af25b9da8e70396cdb40e8a196f7f0ce6024ff67a080346dc\nc44be5ed5c4bec2be72ce9737bde5a2d48fe5fb0ea235ddc61ba447b26642949\nc8934c7b3187e48b1ee44fc2c8e1c3ab19850efc1e45383442cfe4b9b4a06d01\n9b79fbbc895ca98b951aecd664cdd7ce69f63901996c7341a560d7c207a143ea\n65bddf8148ed60f5625b3495baba0824d2fcd13a710494817c7a84e0062ce227\n1120275dc25bc9a7b3e078138c7240fbf26c91890d829e51d9fa837fe90237ed\n4f941e1203bf7c1cb3ec93d42792f7f971f8ec923d11017902481ccf42efaf75\n67458476cc289f7d0f0bda8938f959b8a1a515e23f37c9d16452b2e1d8adf5a4\n7d9e22ae60cb85c4dbdceac46d33fc080b89df23607ab4904b3795d9a9765b82\nc83c28add56ec8cad23a14155d5d3d082a1166c64ea5b7432e0acaa728231165\nb7bebe92a5802aa922e5719c948e35716f908e67701cfffaeebfcadc7a6e650a\n0eb7ba6457367f8f5f917f37ebbf1e7ccf0e971557dbe5d7547e49d129ac0e98\n\nReferences:\n\nhttps://www.recordedfuture.com/chinese-state-sponsored-group-ta413-adopts-newcapabilities-in-pursuit-of-tibetan-targets\nhttps://nao-sec.org/2020/01/an-overhead-view-of-the-royal-road.html\nhttps://github.com/nao-sec/rr_decoder\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-07 - The Approach of TA413 for Tibetan Targets.pdf"
    ],
    "report_names": [
        "2023-02-07 - The Approach of TA413 for Tibetan Targets.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9792e41f-4165-474b-99fa-e74ec332bd87",
            "created_at": "2023-01-06T13:46:38.986789Z",
            "updated_at": "2025-03-27T02:00:02.970288Z",
            "deleted_at": null,
            "main_name": "Lucky Cat",
            "aliases": [
                "White Dev 9",
                "TA413"
            ],
            "source_name": "MISPGALAXY:Lucky Cat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3b1367ff-99dc-41f0-986f-4a1dcb41bbbf",
            "created_at": "2022-10-25T16:07:24.273478Z",
            "updated_at": "2025-03-27T02:02:10.157226Z",
            "deleted_at": null,
            "main_name": "TA413",
            "aliases": [
                "White Dev 9"
            ],
            "source_name": "ETDA:TA413",
            "tools": [
                "Exile RAT",
                "ExileRAT",
                "Sepulcher"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1677809157,
    "ts_updated_at": 1743041503,
    "ts_creation_date": 1677662012,
    "ts_modification_date": 1677662012,
    "files": {
        "pdf": "https://archive.orkl.eu/0405bdbb8be2f4ef64de67d955a380aaaf699ea8.pdf",
        "text": "https://archive.orkl.eu/0405bdbb8be2f4ef64de67d955a380aaaf699ea8.txt",
        "img": "https://archive.orkl.eu/0405bdbb8be2f4ef64de67d955a380aaaf699ea8.jpg"
    }
}