{
    "id": "9928c109-63b7-4eac-bbd0-ba3214855df5",
    "created_at": "2023-01-12T15:09:41.214091Z",
    "updated_at": "2025-03-27T02:09:29.59692Z",
    "deleted_at": null,
    "sha1_hash": "d1395321c599473a98798d83477f7bc4f2a5a7ae",
    "title": "2020-04-01 - THE VOLLGAR CAMPAIGN- MS-SQL SERVERS UNDER ATTACK",
    "authors": "",
    "file_creation_date": "2022-05-28T02:29:22Z",
    "file_modification_date": "2022-05-28T02:29:22Z",
    "file_size": 698706,
    "plain_text": "# The Vollgar Campaign: MS-SQL Servers Under Attack\n\n**[guardicore.com/2020/04/vollgar-ms-sql-servers-under-attack/](https://www.guardicore.com/2020/04/vollgar-ms-sql-servers-under-attack/)**\n\nBy Ophir Harpaz\n\nGuardicore Labs team has recently uncovered a long-running attack campaign which aims to\ninfect Windows machines running MS-SQL servers. Dating back to May 2018, the campaign\nuses password brute force to breach victim machines, deploys multiple backdoors and\nexecutes numerous malicious modules, such as multifunctional remote access tools (RATs)\nand cryptominers. We dubbed the campaign Vollgar after the Vollar cryptocurrency it mines\nand its offensive, vulgar behavior.\n\nHaving MS-SQL servers exposed to the internet with weak credentials is not the best of\npractices. This might explain how this campaign has managed to infect around 3k database\nmachines daily. Victims belong to various industry sectors, including healthcare, aviation, IT\n& telecommunications and higher education.\n\n[Learn More About Threat Intelligence Firewall VIEW NOW](https://www.guardicore.com/lp/threat-intelligence-firewall/)\n\nA full list of IOCs (Indicators of Compromise) as well as a detection script can be found in\n[Guardicore Labs Campaigns repository.](https://github.com/guardicore/labs_campaigns/tree/master/Vollgar)\n\n\n-----\n\n## Victim Analysis: Long Infection Periods\n\nThe first incident of this campaign appeared in May 2018 in Guardicore’s Global Sensors\nNetwork (GGSN), a network of high-interaction honeypots. During its two years of activity,\nthe campaign’s attack flow has remained similar – thorough, well-planned and noisy; we\ndescribe the different steps of the attack chain in the next section. A peak in the number of\nincidents in last December drew us to closely monitoring the campaign and its impact.\n\nOverall, Vollgar attacks originated in more than 120 IP addresses, the vast majority of which\nare in China. These are most likely compromised machines, repurposed to scan and infect\nnew victims. While some of them were short-lived and responsible for only several incidents,\na couple of source IPs were active for over three months, attacking the GGSN dozens of\ntimes.\n\n\n-----\n\nBy analyzing the attacker s log files, we were able to obtain information on the compromised\nmachines. With regards to infection period, the majority (60%) of infected machines\nremained such for only a short period of time. However, almost 20% of all breached servers\nremained infected for more than a week and even longer than two weeks. This proves how\nsuccessful the attack is in hiding its tracks and bypassing mitigations such as antiviruses and\nEDR products. Alternatively, it is very likely that those do not exist on servers in the first\nplace.\n\nWe have noticed that 10% of the victims were reinfected by the malware; the system\nadministrator may have removed the malware, and then got hit by it again. This reinfection\npattern has been seen by Guardicore Labs before in the analysis of the Smominru\ncampaign, and suggests that malware removal is often done in a partial manner, without an\nin-depth investigation into the root cause of the infection.\n\n## Attack Flow: Vulgar, Thorough & Competitive\n\n\n-----\n\nThe Vollgar attack chain demonstrates the competitive nature of the attacker, who diligently\nand thoroughly kills other threat actors’ processes.\n\n## Initial Breach\n\nThe attack begins with MS-SQL brute force login attempts. Once the attacker breaks in, a\nseries of configuration changes is performed to the database to allow future command\nexecution.\n```\nEXEC sp_configure 'show advanced options', 1;RECONFIGURE;\nEXEC sp_configure 'xp_cmdshell', 1;RECONFIGURE;\nexec sp_configure 'show advanced options', 1;RECONFIGURE;\nexec sp_configure 'Ad Hoc Distributed Queries',1;RECONFIGURE;\nexec sp_configure 'show advanced options', 1;RECONFIGURE;\nexec sp_configure 'Ole Automation Procedures',1;RECONFIGURE;\nexec sp_addextendedproc xp_cmdshell,'xp_cmdshell.dll'\n\n```\nFollowing these settings changes, the attacker performs a series of steps to make the\nsystem as out-of-the-box as possible. For example, the attacker validates that certain COM\nclasses are available – WbemScripting.SWbemLocator, Microsoft.Jet.OLEDB.4.0 and\n_Windows Script Host Object Model (wshom). These classes support both WMI scripting and_\ncommand execution through MS-SQL, which will be later used to download the initial\nmalware binary. The Vollgar attacker also ensures that strategic files such as cmd.exe and\n_ftp.exe have execution permissions._\n\nPlanning ahead, the attacker sets multiple backdoor users on the machine – both in the MSSQL database context and in that of the operating system. In both cases, the users are\nadded to the administrators group to “arm” them with elevated privileges.\n```\nsp_addlogin 'web','hywjs!14','master'\nexec sp_addsrvrolemember 'web','sysadmin'\nsp_addlogin 'sql','hywjs!14','master'\nexec sp_addsrvrolemember 'sql','sysadmin'\nDECLARE @sp_passwordnet1 INT EXEC SP_OAcreate \n'wscript.shell',@sp_passwordnet1 OUTPUT EXEC SP_OAMETHOD \n@sp_passwordnet1,'run',null, 'net1 user IUER_SERVER Yuan00852 /add'\nDECLARE @sp_passwordnet1 INT EXEC SP_OAcreate \n'wscript.shell',@sp_passwordnet1 OUTPUT EXEC SP_OAMETHOD \n@sp_passwordnet1,'run',null, 'net1 user IUER_SERVER Yuan00852 /add'\n\n```\nBeing the only attacker on a machine is powerful – your malware gets the most resources,\nsuch as bandwidth and CPU power, and access is valid only through your backdoors.\nTherefore, the Vollgar attacker puts many efforts into both eliminating other threat actors’\n\n\n-----\n\nactivity and removing their traces. For example, Vollgar deletes the key\n_HKLM\\SOFTWARE\\Microsoft\\Command Processor\\Autorun, frequently used by attackers for_\npersistence.\n\nIn addition, many values from Image File Execution Options are removed. Normally, this\nsection in the registry is used to attach a certain process – usually a debugger – to other\nexecutables. Threat actors exploit this functionality to run malicious processes along with\nsystem executables. By deleting these values, Vollgar ensures that no other malware is\nattached to legitimate processes, such as cmd.exe, ftp.exe, net.exe and Windows scripting\nhosts such as wscript.exe and cscript.exe.\n```\nEXEC master..xp_regdeletevalue\n@rootkey='HKEY_LOCAL_MACHINE',\n@key='SOFTWARE\\Microsoft\\Command Processor',\n@value_name='Autorun'\n...\nxp_regdeletevalue 'HKEY_LOCAL_MACHINE','SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Image File Execution Options\\net.exe','Debugger'\nexec xp_regdeletekey 'HKEY_LOCAL_MACHINE', 'SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Image File Execution Options\\net.exe'\n...\n\n## Downloaders\n\n```\nTo prepare for possible failures, the attacker writes three separate downloader scripts – two\nVBScripts downloading over HTTP and one FTP script. Each downloader is executed a\ncouple of times, every time with a different target location on the local file system. This\nthoroughness is somewhat unusual among other attack groups, who often look for the\nfastest route to their goal.\n\n\n-----\n\n```\non error resume next \nwith wscript\nif .arguments.count<2 then .quit\nend if \nset \naso=.createobject(\"adodb.stream\")\nset \nweb=createobject(\"microsoft.xmlhtt\np\") \nweb.open \"get\",.arguments(0),0\nweb.send\nif web.status>200 then quit \naso.type=1:aso.open\naso.write web.responsebody\naso.savetofile .arguments(1),2\nend with\n\n```\n```\nSet x=\nCreateObject(\"Microsoft.XMLHTTP\")\nx.Open \n\"GET\",LCase(WScript.Arguments(0)),0\nx.Send()\nSet s =\nCreateObject(\"ADODB.Stream\")\ns.Mode = 3\ns.Type = 1\ns.Open()\ns.Write(x.responseBody)\ns.SaveToFile \nLCase(WScript.Arguments(1)),2\n\n```\n\n## Attacker Infrastructure: an Omni-Compromised Machine\n\n_Vollgar’s main CNC server was operated from a computer in China. The server, running an_\nMS-SQL database and a Tomcat web server, was found to be compromised by more than\none attack group. In fact, we found almost ten different backdoors used to access the\nmachine, read its file system contents, modify its registry, download and upload files and\nexecute commands. Nevertheless, the machine was “business as usual”, running the\ndatabase service as well as benign background processes. Malicious activity can be seen\namong running tasks, active sessions and lists of users with administrative privileges – yet it\nsomehow escaped the owners of this server.\n\nThe attacker held their entire infrastructure on the compromised machine. Among the files\nwas the MS-SQL attack tool, responsible for scanning IP ranges, brute-forcing the targeted\ndatabase and executing commands remotely. In addition, we found two CNC programs with\nGUI in Chinese, a tool for modifying files’ hash values, a portable HTTP file server (HFS),\nServ-U FTP server and a copy of the executable mstsc.exe (Microsoft Terminal Services\nClient) used to connect to victims over RDP.\n\n\n-----\n\nUpon connection from an infected client, the CNC receives from the client several identifying\ndata – its public IP, geolocation – city, district and country, operating system version,\ncomputer name and CPU model. Two command lines for cryptominer execution are also\nsent to the server, probably for monitoring purposes.\n\nAs mentioned earlier, we found two CNC platforms used by the attacker. These two\nplatforms were developed by different vendors, but offer a similar variety of remote control\ncapabilities to the attacker who controls them: downloading files, installing new Windows\nservices, keylogging, screen capturing, running an interactive shell terminal, activating the\ncamera and the microphone, initiating a DDoS attack, and more.\n\n\n-----\n\n## Hosting Companies Host Abusive Business\n\nThe Vollgar infrastructure is based on abused domain names and shell companies. The\nattacker uses this infrastructure to host malicious payloads and operate the campaign’s\ncommand-and-control bases.\n\nThe attacker freely uses internet services which are ripe for abuse; the domain vollar.ga uses\nthe .ga top-level domain (TLD), which can be registered for free. Like many other free TLDs,\n_.ga is wildly abused by malware providers._\n\nMany of the CNC servers are hosted on odd hosting services. One set of observed CNC\nservers all belong to a specific autonomous system number (ASN) AS133115, HK Kwaifong\n_Group Limited. Despite its large size, this AS is registered with a private email account,_\n_kwaifong33@gmail.com. The email address appears on multiple additional ASNs, such as_\nAS133073, registered to www.glovine.com.au – a completely disabled website.\n\nThe ASNs seem to share many of their IP ranges with a hosting company named\n_CloudInnovation Infrastructure. A quick look at their website – cloudinnovation.org – reveals_\nan obviously nonexistent business. However, the company owns a large collection of\nillegitimate domains.\n\nThese are just a few examples of different hosting services which clearly help provide a safe\nhaven for fraudulent activity. The next section describes the malware modules hosted on the\nattacker’s servers and how these modules communicate with the attacker’s backend.\n\n## Malware – Spawning Multiple RAT Modules\n\n\n-----\n\nThe initial payload, named SQLAGENTIDC.exe or SQLAGENTVDC.exe, starts by running\n_taskkill on a long list of processes, with the goal of eliminating competitors and earning more_\ncomputing resources. These processes include Rnaphin.exe, xmr.exe, and winxmr.exe, to\nname a few. Then, the payload copies itself to the user’s AppData folder and executes the\ncopy. The new process checks for internet connectivity, then queries Baidu Maps to obtain\nthe victim’s IP and geolocation which it later sends to the CNC. Then, a couple of additional\npayloads are downloaded onto the infected machine – multiple RAT modules and an XMRigbased cryptominer.\n\n\n-----\n\nEach RAT module attempts to connect to the CNC server on a different port. Ports we ve\nseen include 22251, 9383 and 3213. It is fair to assume that the simultaneous connections\nare for redundancy in case one of the CNCs is down. The communication between the client\nand server starts with an initial report of information, then continues with periodic heartbeats\nonce every ten seconds.\n\nThe attacker is mining both Monero and an alt-coin named VDS, or Vollar. This is an unusual\ncryptocurrency, combining elements of Monero (full privacy) and Ethereum (smart contracts),\npegged relatively close to the dollar.\n\n## Detection & Mitigation\n\nThe Vollgar campaign targets Windows machines running MS-SQL servers which are\ninternet-facing. To check if your Windows machine has been infected, Guardicore Labs\nprovides an open-source Powershell script to detect Vollgar’s tracks and IOCs. The script\n[along with execution instructions can be found in the campaign’s IOCs repository.](https://github.com/guardicore/labs_campaigns/tree/master/Vollgar)\n\nIt is highly recommended to not expose database servers to the internet. Instead, they need\nto be accessible to specific machines within the organization through segmentation and\nwhitelist access policies. We recommend enabling logging in order to monitor and alert on\nsuspicious, unexpected or recurring login attempts.\n\nThe majority of attack campaigns, and Vollgar included, involve network communication to\nCNC servers. Outgoing communications to such destinations can and should be blocked;\nGuardicore offers a [Threat-Intelligence Firewall, based on Guardicore Reputation Service, for](https://www.guardicore.com/lp/threat-intelligence-firewall/)\nexactly this type of protection.\n\nIf infected, we highly recommend to immediately quarantine the infected machine and\nprevent it from accessing other assets in the network. It is also important to change all your\nMS-SQL user account passwords to strong passwords, to avoid being reinfected by this or\nother brute force attacks.\n\n## Little Prey; Many Predators\n\n\n-----\n\nThere is a vast number of attacks targeting MS-SQL servers. However, there are only about\nhalf-a-million machines running this database service. This relatively-small number of\npotential victims triggers an inter-group competition over control and resources; these virtual\nfights can be seen in many of the recent mass-scale attacks.\n\nWhat makes these database servers appealing for attackers apart from their valuable CPU\npower is the huge amount of data they hold. These machines possibly store personal\ninformation such as usernames, passwords, credit card numbers, etc., which can fall into the\nattacker’s hands with only a simple brute-force.\n\nUnfortunately, oblivious or negligent registrars and hosting companies are part of the\nproblem, as they allow attackers to use IP addresses and domain names to host whole\ninfrastructures. If these providers continue to look the other way, mass-scale attacks will\ncontinue to prosper and operate under the radar for long periods of time.\n\n[Learn More About Threat Intelligence Firewall VIEW NOW](https://www.guardicore.com/lp/threat-intelligence-firewall/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-04-01 - THE VOLLGAR CAMPAIGN- MS-SQL SERVERS UNDER ATTACK.pdf"
    ],
    "report_names": [
        "2020-04-01 - THE VOLLGAR CAMPAIGN- MS-SQL SERVERS UNDER ATTACK.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536181,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1653704962,
    "ts_modification_date": 1653704962,
    "files": {
        "pdf": "https://archive.orkl.eu/d1395321c599473a98798d83477f7bc4f2a5a7ae.pdf",
        "text": "https://archive.orkl.eu/d1395321c599473a98798d83477f7bc4f2a5a7ae.txt",
        "img": "https://archive.orkl.eu/d1395321c599473a98798d83477f7bc4f2a5a7ae.jpg"
    }
}