{
    "id": "9949b261-84b4-4758-96f2-0ab9849845d1",
    "created_at": "2022-10-25T16:48:12.926875Z",
    "updated_at": "2025-03-27T02:10:07.560208Z",
    "deleted_at": null,
    "sha1_hash": "e33abbd24c9cbb57b3b4a97df165766e1fb42eeb",
    "title": "You Only Click Twice: Finfisher's Global Proliferation",
    "authors": "Citizen Lab",
    "file_creation_date": "2013-07-31T11:20:24Z",
    "file_modification_date": "2013-07-31T11:20:24Z",
    "file_size": 933736,
    "plain_text": "**Research Brief**\n\n# The Citizen Lab \n\nNumber 15 – March 2013\n\n\n**_You Only Click Twice:_**\n\n**_FinFisher’s Global Proliferation_**\n\nMorgan Marquis-Boire, Bill Marczak, Claudio Guarnieri, and John Scott-Railton.\n\n_This post describes the results of a comprehensive global Internet scan for the command and control servers_\n_of FinFisher’s surveillance software. It also details the discovery of a campaign using FinFisher in Ethiopia_\n_used to target individuals linked to an opposition group. Additionally, it provides examination of a FinSpy_\n_Mobile sample found in the wild, which appears to have been used in Vietnam._\n\n## 1. SUMMARY OF KEY FINDINGS\n\n  - We have found command and control servers for FinSpy backdoors, part of Gamma International’s\n\nFinFisher “remote monitoring solution,” in a total of 25 countries: Australia, Bahrain, Bangladesh,\nBrunei, Canada, Czech Republic, Estonia, Ethiopia, Germany, India, Indonesia, Japan, Latvia,\nMalaysia, Mexico, Mongolia, Netherlands, Qatar, Serbia, Singapore, Turkmenistan, United Arab\nEmirates, United Kingdom, United States, Vietnam.\n\n  - A FinSpy campaign in Ethiopia uses pictures of Ginbot 7, an Ethiopian opposition group, as bait to\n\ninfect users. This continues the theme of FinSpy deployments with strong indications of politicallymotivated targeting.\n\n  - There is strong evidence of a Vietnamese FinSpy Mobile Campaign. We found an Android FinSpy\n\nMobile sample in the wild with a command & control server in Vietnam that also exfiltrates text\nmessages to a local phone number.\n\n  - These findings call into question claims by Gamma International that previously reported servers were\n\n_not part of their product line, and that previously discovered copies of their software were either stolen_\nor demo copies.\n\n\n-----\n\n## 2. BACKGROUND AND INTRODUCTION\n\nFinFisher is a line of remote intrusion and surveillance software developed by Munich-based Gamma\nInternational GmbH. FinFisher products are marketed and sold exclusively to law enforcement and\n[intelligence agencies by the UK-based Gamma Group.[1] Although touted as a “lawful interception” suite for](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#1)\nmonitoring criminals, FinFisher has gained notoriety because it has been used in targeted attacks against\n[human rights campaigners and opposition activists in countries with questionable human rights records.[2]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#2)\n\n[In late July 2012, we published](https://citizenlab.org/2012/07/from-bahrain-with-love-finfishers-spy-kit-exposed/) the results of an investigation into a suspicious e-mail campaign targeting\n[Bahraini activists.[3] We analyzed the attachments and discovered that they contained the FinSpy spyware,](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#3)\nFinFisher’s remote monitoring product. FinSpy captures information from an infected computer, such as\npasswords and Skype calls, and sends the information to a FinSpy command & control (C2) server. The\nattachments we analyzed sent data to a command & control server inside Bahrain.\n\nThis discovery motivated researchers to search for other command & control servers to understand how\nwidely FinFisher might be used. Claudio Guarnieri at Rapid7 (one of the authors of this report) was the first to\n[search for these servers. He fingerprinted the Bahrain server and looked at historical Internet scanning data to](https://community.rapid7.com/community/infosec/blog/2012/08/08/finfisher)\nidentify other servers around the world that responded to the same fingerprint. Rapid7 published this list of\n[servers, and described their fingerprinting technique. Other groups, including CrowdStrike and SpiderLabs](http://blog.crowdstrike.com/2012/09/finspy-mobile-ios-and-apple-udid-leak.html)\nalso analyzed and published reports on FinSpy.\n\nImmediately after publication, the servers were apparently updated to evade detection by the Rapid7\nfingerprint. We devised a different fingerprinting technique and scanned portions of the internet. We\nconfirmed Rapid7’s results, and also found several new servers, including one inside Turkmenistan’s Ministry\n[of Communications. We published our list of servers in late August 2012, in addition to an analysis of mobile](https://citizenlab.org/2012/08/the-smartphone-who-loved-me-finfisher-goes-mobile/)\n[phone versions](https://citizenlab.org/2012/08/the-smartphone-who-loved-me-finfisher-goes-mobile/) of FinSpy. FinSpy servers were apparently updated again in October 2012 to disable this\nnewer fingerprinting technique, although it was never publicly described.\n\nNevertheless, via analysis of existing samples and observation of command & control servers, we managed to\nenumerate yet more fingerprinting methods and continue our survey of the internet for this surveillance\nsoftware. We describe the results in this post.\n\nCivil society groups have found cause for concern in these findings, as they indicate the use of FinFisher\nproducts by countries like Turkmenistan and Bahrain with problematic records on human rights, transparency,\nand rule of law. In an August 2012 response to a letter from UK-based NGO Privacy International, the UK\nGovernment revealed that at some unspecified time in the past, it had examined a version of FinSpy, and\ncommunicated to Gamma that a license would be required to export that version outside of the EU. Gamma\nhas repeatedly denied links to spyware and servers uncovered by our research, claiming that the servers\n[detected by our scans are “not … from the FinFisher product line.”[4]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#4) Gamma also claims that the spyware sent\nto activists in Bahrain was an “old” demonstration version of FinSpy, stolen during a product presentation.\n\nIn February 2013, Privacy International, the European Centre for Constitutional and Human Rights (ECCHR),\n[the Bahrain Center for Human Rights, Bahrain Watch, and Reporters Without Borders filed a complaint with](https://www.privacyinternational.org/press-releases/human-rights-organisations-file-formal-complaints-against-surveillance-firms-gamma)\nthe Organization for Economic Cooperation and Development (OECD), requesting that this body investigate\nwhether Gamma violated OECD Guidelines for Multinational Enterprises by exporting FinSpy to Bahrain.\n\n\n-----\n\nThe complaint called previous Gamma statements into question, noting that at least two different versions\n(4.00 and 4.01) of FinSpy were found in Bahrain, and that Bahrain’s server was a FinFisher product and was\n[likely receiving updates from Gamma. This complaint, as laid out by Privacy International states that Gamma:](https://www.privacyinternational.org/blog/our-oecd-complaint-against-gamma-international-and-trovicor)\n\n  - failed to respect the internationally recognised human rights of those affected by [its] activities\n\n  - caused and contributed to adverse human rights impacts in the course of [its] business activities\n\n  - failed to prevent and mitigate adverse human rights impacts linked to [its] activities and products, and\n\nfailed to address such impacts where they have occurred\n\n  - failed to carry out adequate due diligence (including human rights due diligence); and\n\n  - failed to implement a policy commitment to respect human rights.\n\n[According to recent reporting, German Federal Police appear to have plans to purchase and use the FinFisher](https://netzpolitik.org/2013/secret-government-document-reveals-german-federal-police-plans-to-use-gamma-finfisher-spyware/)\n[suite of tools domestically within Germany.[5]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#5) Meanwhile, findings by our group and others continue to\nillustrate the global proliferation of FinFisher’s products. Research continues to uncover troubling cases of\nFinSpy in countries with dismal human rights track records, and politically repressive regimes. Most recently,\n[work by Bahrain Watch](http://bahrainwatch.org/blog/2013/03/13/top-bahraini-company-infected-with-government-spyware-sold-by-uk-firm-in-apparent-politically-motivated-targeting/) has confirmed the presence of a Bahraini FinFisher campaign, and further\ncontradicted Gamma’s public statements. This post adds to the list by providing an updated list of FinSpy\nCommand & Control servers, and describing the FinSpy malware samples in the wild which appear to have\nbeen used to target victims in Ethiopia and Vietnam.\n\nWe present these updated findings in the hopes that we will further encourage civil society groups and\ncompetent investigative bodies to continue their scrutiny of Gamma’s activities, relevant export control issues,\nand the issue of the global and unregulated proliferation of surveillance malware.\n\n\n-----\n\n## FINFISHER: UPDATED GLOBAL SCAN\n\n**Figure 1. Map of global FinFisher proliferation**\n\nAround October 2012, we observed that the behavior of FinSpy servers began to change. Servers stopped\nresponding to our fingerprint, which had exploited a quirk in the distinctive FinSpy wire protocol. We believe\nthat this indicates that Gamma either independently changed the FinSpy protocol, or was able to determine\nkey elements of our fingerprint, although it has never been publicly revealed.\n\nIn the wake of this apparent update to FinSpy command & control servers, we devised a new fingerprint and\nconducted a scan of the internet for FinSpy command & control servers. This scan took roughly two months\nand involved sending more than 12 billion packets. Our new scan identified a total of 36 FinSpy servers, 30 of\nwhich were new and 6 of which we had found during previous scanning. The servers operated in 19 different\ncountries. Among the FinSpy servers we found, 7 were in countries we hadn’t seen before.\n\n**New Countries**\nCanada, Bangladesh, India, Malaysia, Mexico, Serbia, Vietnam\n\n\n-----\n\nIn our most recent scan, 16 servers that we had previously found did not show up. We suspect that after\nour earlier scans were published the operators moved them. Many of these servers were shut down or\nrelocated after the publication of previous results, but before the apparent October 2012 update. We no\nlonger found FinSpy servers in 4 countries where previous scanning identified them (Brunei, UAE,\nLatvia, and Mongolia). Taken together, FinSpy servers are currently, or have been present, in 25\ncountries.\n\nAustralia, Bahrain, Bangladesh, Brunei, Canada, Czech Republic, Estonia, Ethiopia, Germany, India,\nIndonesia, Japan, Latvia, Malaysia, Mexico, Mongolia, Netherlands, Qatar, Serbia, Singapore, Turkmenistan,\nUnited Arab Emirates, United Kingdom, United States, Vietnam.\n\nImportantly, we believe that our list of servers is incomplete due to the large diversity of ports used by FinSpy\nservers, as well as other efforts at concealment. Moreover, discovery of a FinSpy command and control server\nin a given country is not a sufficient indicator to conclude the use of FinFisher by that country’s law\nenforcement or intelligence agencies. In some cases, servers were found running on facilities provided by\ncommercial hosting providers that could have been purchased by actors from any country.\n\nThe table below shows the FinSpy servers detected in our latest scan. We list the full IP address of servers that\nhave been previously publicly revealed. For active servers that have not been publicly revealed, we list the\nfirst two octets only. Releasing complete IP addresses in the past has not proved useful, as the servers are\nquickly shut down and relocated.\n\n|IP|Operator|Routed to Country|\n|---|---|---|\n|117.121.xxx.xxx|GPLHost|Australia|\n|77.69.181.162|Batelco ADSL Service|Bahrain|\n|180.211.xxx.xxx|Telegraph & Telephone Board|Bangladesh|\n|168.144.xxx.xxx|Softcom, Inc.|Canada|\n|168.144.xxx.xxx|Softcom, Inc.|Canada|\n|217.16.xxx.xxx|PIPNI VPS|Czech Republic|\n|217.146.xxx.xxx|Zone Media UVS/Nodes|Estonia|\n|213.55.99.74|Ethio Telecom|Estonia|\n|80.156.xxx.xxx|Gamma International GmbH|Germany|\n|37.200.xxx.xxx|JiffyBox Servers|Germany|\n\n\n-----\n\n178.77.xxx.xxx HostEurope GmbH Germany\n\n|178.77.xxx.xxx|HostEurope GmbH|Germany|\n|---|---|---|\n|119.18.xxx.xxx|HostGator|India|\n|119.18.xxx.xxx|HostGator|India|\n|118.97.xxx.xxx|PT Telkom|Indonesia|\n|118.97.xxx.xxx|PT Telkom|Indonesia|\n|103.28.xxx.xxx|PT Matrixnet Global|Indonesia|\n|112.78.143.34|Biznet ISP|Indonesia|\n|112.78.143.26|Biznet ISP|Indonesia|\n|117.121.xxx.xxx|GPLHost|Malaysia|\n|187.188.xxx.xxx|Iusacell PCS|Mexico|\n|201.122.xxx.xxx|UniNet|Mexico|\n|164.138.xxx.xxx|Tilaa|Netherlands|\n|164.138.28.2|Tilaa|Netherlands|\n|78.100.57.165|Qtel – Government Relations|Qatar|\n|195.178.xxx.xxx|Tri.d.o.o / Telekom Srbija|Serbia|\n|117.121.xxx.xxx|GPLHost|Singapore|\n|217.174.229.82|Ministry of Communications|Turkmenistan|\n|72.22.xxx.xxx|iPower, Inc.|United States|\n|166.143.xxx.xxx|Verizon Wireless|United States|\n|117.121.xxx.xxx|GPLHost|United States|\n|117.121.xxx.xxx|GPLHost|United States|\n|117.121.xxx.xxx|GPLHost|United States|\n|117.121.xxx.xxx|GPLHost|United States|\n|183.91.xxx.xxx|CMC Telecom Infrastructure Company|Vietnam|\n\n\n-----\n\nSeveral of these findings are especially noteworthy:\n\n  - Eight servers are hosted by provider GPLHost in various countries (Singapore, Malaysia, Australia,\n\nUS). However, we observed only six of these servers active at any given time, suggesting that some IP\naddresses may have changed during our scans.\n\n  - A server identified in Germany has the registrant “Gamma International GmbH,” and the contact\n\nperson is listed as “Martin Muench.”\n\n  - There is a FinSpy server in an IP range registered to “Verizon Wireless.” Verizon Wireless sells ranges\n\nof IP addresses to corporate customers, so this is not necessarily an indication that Verizon Wireless\nitself is operating the server, or that Verizon Wireless customers are being spied on.\n\n  - A server in Qatar that was previously detected by Rapid7 seems to be back online after being\n\nunresponsive during the last round of our scanning. The server is located in a range of 16 addresses\nregistered to “Qtel – Corporate accounts – Government Relations.” The same block of 16 addresses\n[also contains the website http://qhotels.gov.qa/.](http://qhotels.gov.qa/)\n\n## 3. ETHIOPIA AND VIETNAM: IN-DEPTH DISCUSSION OF NEW SAMPLES\n\n 3.1 FinSpy in Ethiopia\n\nWe analyzed a recently acquired malware sample and identified it as FinSpy. The malware uses\nimages of members of the Ethiopian opposition group, Ginbot 7, as bait. The malware communicates\nwith a FinSpy Command & Control server in Ethiopia, which was first identified by Rapid7 in August\n2012. The server has been detected in every round of scanning, and remains operational at the time of\nthis writing. It can be found in the following address block run by Ethio Telecom, Ethiopia’s stateowned telecommunications provider:\n\nIP: 213.55.99.74\nroute: 213.55.99.0/24\ndescr: Ethio Telecom\norigin: AS24757\nmnt-by: ETC-MNT\nmember-of: rs-ethiotelecom\nsource: RIPE # Filtered\n\n\n-----\n\nThe server appears to be updated in a manner consistent with other servers, including servers in\nBahrain and Turkmenistan.\n\nMD5 8ae2febe04102450fdbc26a38037c82b\n\nSHA-1 1fd0a268086f8d13c6a3262d41cce13470886b09\n\nSHA-256 ff6f0bcdb02a9a1c10da14a0844ed6ec6a68c13c04b4c122afc559d606762fa\n\n[The sample is similar to a previously analyzed sample of FinSpy malware sent to activists in Bahrain in 2012.](https://citizenlab.org/2012/07/from-bahrain-with-love-finfishers-spy-kit-exposed/)\nJust like Bahraini samples, the malware relocates itself and drops a JPG image with the same filename as the\nsample when executed by an unsuspecting user. This appears to be an attempt to trick the victim into believing\nthe opened file is not malicious. Here are a few key similarities between the samples:\n\n  - The PE timestamp “2011-07-05 08:25:31” of the packer is exactly the same as the Bahraini sample.\n\n  - The following string (found in a process infected with the malware), self-identifies the malware and is\n\nsimilar to strings found in the Bahraini samples:\n\n  \n  - The samples share the same Bootkit, SHA-256:\n\nba21e452ee5ff3478f21b293a134b30ebf6b7f4ec03f8c8153202a740d7978b2.\n\n  - The samples share the same driverw.sys file, SHA-256:\n\n62bde3bac3782d36f9f2e56db097a4672e70463e11971fad5de060b191efb196.\n\n|MD5|8ae2febe04102450fdbc26a38037c82b|\n|---|---|\n|SHA-1|1fd0a268086f8d13c6a3262d41cce13470886b09|\n|SHA-256|ff6f0bcdb02a9a1c10da14a0844ed6ec6a68c13c04b4c122afc559d606762fa|\n\n\n-----\n\n**Figure 2. The image shown to the victim contains pictures of members of the Ginbot 7 Ethiopian**\n**opposition group**\n\n[In this case the picture contains photos of members of the Ethiopian opposition group, Ginbot 7.](http://en.wikipedia.org/wiki/Ginbot%207)\nControversially, Ginbot 7 was designated a terrorist group by the Ethiopian Government in 2011. The\n[Committee to Protect Journalists (CPJ) and Human Rights Watch have both criticized this action, CPJ has](http://www.hrw.org/world-report-2012/ethiopia)\npointed out that it is having a chilling effect on legitimate political reporting about the group and its\nleadership.\n\nThe existence of a FinSpy sample that contains Ethiopia-specific imagery, and that communicates with a stillactive command & control server in Ethiopia strongly suggests that the Ethiopian Government is using\nFinSpy.\n\n\n-----\n\n## 3.2 FinSpy Mobile in Vietnam\n\n[We recently obtained and analyzed a malware sample[6]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#6) and identified it as FinSpy Mobile for Android.\nThe sample communicates with a command & control server in Vietnam, and exfiltrates text messages\nto a Vietnamese telephone number.\n\nThe FinFisher suite includes mobile phone versions of FinSpy for all major platforms including iOS,\nAndroid, Windows Mobile, Symbian and Blackberry. Its features are broadly similar to the PC version\nof FinSpy identified in Bahrain, but it also contains mobile-specific features such as GPS tracking and\nfunctionality for silent ‘spy’ calls to snoop on conversations near the phone. An in-depth analysis of\n[the FinSpy Mobile suite of backdoors was provided in an earlier blog post: The Smartphone Who](https://citizenlab.org/2012/08/the-smartphone-who-loved-me-finfisher-goes-mobile/)\n[Loved Me: FinFisher Goes Mobile?](https://citizenlab.org/2012/08/the-smartphone-who-loved-me-finfisher-goes-mobile/)\n\nMD5 573ef0b7ff1dab2c3f785ee46c51a54f\n\nSHA-1 d58d4f6ad3235610bafba677b762f3872b0f67cb\n\nSHA-256 363172a2f2b228c7b00b614178e4ffa00a3a124200ceef4e6d7edb25a4696345\n\n[The sample included a configuration file[7] that indicates available functionality, and the options that](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#7)\nhave been enabled by those deploying it:\n\n**Figure 3. Image of a section of a configuration file for the FinSpy Mobile sample**\n\n|MD5|573ef0b7ff1dab2c3f785ee46c51a54f|\n|---|---|\n|SHA-1|d58d4f6ad3235610bafba677b762f3872b0f67cb|\n|SHA-256|363172a2f2b228c7b00b614178e4ffa00a3a124200ceef4e6d7edb25a4696345|\n\n\n-----\n\nInterestingly, the configuration file also specifies a Vietnamese phone number used for SMS based\ncommand and control:\n\nSection Type: TlvTypeConfigSMSPhoneNumber\nSection Data: “+841257725403”\n\nThe command and control server is in a range provided by the CMC Telecom Infrastructure Company\nin Hanoi:\n\nIP Address: 183.91.2.199\ninetnum: 183.91.0.0 – 183.91.9.255\nnetname: FTTX-NET\ncountry: Vietnam\naddress: CMC Telecom Infrastructure Company\naddress: Tang 3, 16 Lieu Giai str, Ba Dinh, Ha Noi\n\nThis server was active until very recently and matched our signatures for a FinSpy command and\ncontrol server. Both the command & control server IP and the phone number used for text-message\nexfiltration are in Vietnam which indicates a domestic campaign.\n\nThis apparent FinSpy deployment in Vietnam is troubling in the context of recent threats against online\nfree expression and activism. In 2012, Vietnam introduced new censorship laws amidst an ongoing\nharassment, intimidation, and detention campaign against of bloggers who spoke out against the\nregime. This culminated in the trial of 17 bloggers, 14 of whom were recently convicted and sentenced\nto terms ranging from 3 to 13 years.[8]\n\n## 4. BRIEF DISCUSSION OF FINDINGS\n\nCompanies selling surveillance and intrusion software commonly claim that their tools are only used to track\n[criminals and terrorists. FinFisher, VUPEN and Hacking Team have all used similar language.[9] Yet a growing](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#9)\nbody of evidence suggests that these tools are regularly obtained by countries where dissenting political\nactivity and speech is criminalized. Our findings highlight the increasing dissonance between Gamma’s public\nclaims that FinSpy is used exclusively to track “bad guys” and the growing body of evidence suggesting that\nthe tool has and continues to be used against opposition groups and human rights activists.\n\nWhile our work highlights the human rights ramifications of the mis-use of this technology, it is clear that\nthere are broader concerns. A global and unregulated market for offensive digital tools potentially presents a\n\n\n-----\n\nnovel risk to both national and corporate cyber-security. On March 12th, US Director of National Intelligence\nJames Clapper stated in his yearly congressional report on security threats:\n\n_“…companies develop and sell professional-quality technologies to support cyberoperations–often branding_\n_these tools as lawful-intercept or defensive security research products. Foreign governments already use some_\n_of these tools to target U.S. systems.”_\n\nThe unchecked global proliferation of products like FinFisher makes a strong case for policy debate about\nsurveillance software and the commercialization of offensive cyber-capabilities.\n\nOur latest findings give an updated look at the global proliferation of FinSpy. We identified 36 active FinSpy\ncommand & control servers, including 30 previously-unknown servers. Our list of servers is likely incomplete,\nas some FinSpy servers employ countermeasures to prevent detection. Including servers discovered last year,\nwe now count FinSpy servers in 25 countries, including countries with troubling human rights records. This is\nindicative of a global trend towards the acquisition of offensive cyber-capabilities by non-democratic regimes\nfrom commercial Western companies.\n\nThe Vietnamese and Ethiopian FinSpy samples we identified warrant further investigation, especially given\nthe poor human rights records of these countries. The fact that the Ethiopian version of FinSpy uses images of\nopposition members as bait suggests it may be used for politically influenced surveillance activities, rather\nthan strictly law enforcement purposes.\n\nThe Ethiopian sample is the second FinSpy sample we have discovered that communicates with a server we\nidentified by scanning as a FinSpy command & control server. This further validates our scanning results, and\n[calls into question Gamma’s claim that such servers are “not … from the FinFisher product line.”[10]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#10)\nSimilarities between the Ethiopian sample and those used to target Bahraini activists also bring into question\nGamma International’s earlier claims that the Bahrain samples were stolen demonstration copies.\n\nWhile the sale of such intrusion and surveillance software is largely unregulated, the issue has drawn\nincreased high-level scrutiny. In September of last year, the German foreign minister, Guido Westerwelle,\n[called for an EU-wide ban on the export of such surveillance software to totalitarian states.[11]](https://citizenlab.org/2013/03/you-only-click-twice-finfishers-global-proliferation-2/#11) In a December\n2012 interview, Marietje Schaake (MEP), currently the rapporteur for the first EU strategy on digital freedom\nin foreign policy, stated that it was “quite shocking” that Europe companies continue to export repressive\ntechnologies to countries where the rule of law is in question.[12]\n\nWe urge civil society groups and journalists to follow up on our findings within affected countries. We also\nhope that our findings will provide valuable information to the ongoing technology and policy debate about\nsurveillance software and the commercialisation of offensive cyber-capabilities.\n\n\n-----\n\n## ACKNOWLEDGEMENTS\n\nWe’d like to thank Eva Galperin and the Electronic Frontier Foundation (EFF), Privacy International, Bahrain\nWatch, and Drew Hintz.\n\n## MEDIA COVERAGE\n\n[Media coverage of the report includes HuffingtonPost Canada,](http://www.huffingtonpost.com/2013/03/13/finspy-spyware-activists_n_2864579.html) [Salon, The Verge,](http://www.salon.com/2013/03/13/surveillance_software_used_to_spy_on_activists_around_the_world/singleton/) [Bloomberg Business Week,](http://www.businessweek.com/news/2013-03-13/gamma-finspy-surveillance-servers-in-25-countries)\nTheYoungTurks.\n\n__________________________________\n\n## FOOTNOTES\n\n[1https://www.gammagroup.com/](https://www.gammagroup.com/)\n[2Software Meant to Fight Crime Is Used to Spy on Dissidents, http://goo.gl/GDRMe, New York Times,](http://goo.gl/GDRMe)\nAugust 31, 2012, Page A1 Print edition.\n[3Cyber Attacks on Activists Traced to FinFisher Spyware of Gamma, http://goo.gl/nJH7o, Bloomberg, July](http://goo.gl/nJH7o)\n25, 2012\n[4http://bits.blogs.nytimes.com/2012/08/16/company-denies-role-in-recently-uncovered-spyware/](http://bits.blogs.nytimes.com/2012/08/16/company-denies-role-in-recently-uncovered-spyware/)\n[5http://www.sueddeutsche.de/digital/finfisher-entwickler-gamma-spam-vom-staat-1.1595253](http://www.sueddeutsche.de/digital/finfisher-entwickler-gamma-spam-vom-staat-1.1595253)\n6This sample has also been discussed by Denis Maslennikov from Kasperksy in his analyses of FinSpy Mobile\n[– https://www.securelist.com/en/analysis/204792283/Mobile_Malware_Evolution_Part_6](https://www.securelist.com/en/analysis/204792283/Mobile_Malware_Evolution_Part_6)\n7Configuration parsed with a tool written by Josh Grunzweig of Spider Labs –\n[http://blog.spiderlabs.com/2012/09/finspy-mobile-configuration-and-insight.html](http://blog.spiderlabs.com/2012/09/finspy-mobile-configuration-and-insight.html)\n[8https://www.eff.org/deeplinks/2013/01/bloggers-trial-vietnam-are-part-ongoing-crackdown-free-expression](https://www.eff.org/deeplinks/2013/01/bloggers-trial-vietnam-are-part-ongoing-crackdown-free-expression)\n[9https://www.securityweek.com/podcast-vupen-ceo-chaouki-bekrar-addresses-zero-day-marketplace-](https://www.securityweek.com/podcast-vupen-ceo-chaouki-bekrar-addresses-zero-day-marketplace-controversy-cansecwest)\n[controversy-cansecwest](https://www.securityweek.com/podcast-vupen-ceo-chaouki-bekrar-addresses-zero-day-marketplace-controversy-cansecwest)\n[10http://bits.blogs.nytimes.com/2012/08/16/company-denies-role-in-recently-uncovered-spyware/](http://bits.blogs.nytimes.com/2012/08/16/company-denies-role-in-recently-uncovered-spyware/)\n[11http://www.guardian.co.uk/uk/2012/nov/28/offshore-company-directors-military-intelligence](http://www.guardian.co.uk/uk/2012/nov/28/offshore-company-directors-military-intelligence)\n12http://www.vieuws.eu/foreign-affairs/digital-freedoms-marietje-schaake-mep-alde/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/bdtw7jyfdcr9snnt14ye7ukb9oj2gmn9",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2013/2013.03.13.FinFisher/15-2013-youonlyclicktwice.pdf"
    ],
    "report_names": [
        "15-2013-youonlyclicktwice"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041407,
    "ts_creation_date": 1375269624,
    "ts_modification_date": 1375269624,
    "files": {
        "pdf": "https://archive.orkl.eu/e33abbd24c9cbb57b3b4a97df165766e1fb42eeb.pdf",
        "text": "https://archive.orkl.eu/e33abbd24c9cbb57b3b4a97df165766e1fb42eeb.txt",
        "img": "https://archive.orkl.eu/e33abbd24c9cbb57b3b4a97df165766e1fb42eeb.jpg"
    }
}