{
    "id": "995bd863-a82e-4f0c-82a6-47343ee84bdd",
    "created_at": "2022-10-25T16:48:20.069292Z",
    "updated_at": "2025-03-27T02:15:38.177122Z",
    "deleted_at": null,
    "sha1_hash": "719c40ddea9276bd4e49fdd2afad57b05b784286",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-03-02T14:48:17Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 1014807,
    "plain_text": "# EGREGOR RANSOMWARE\n\n#### 1.0 02/03/2021\n\n\n-----\n\nEgregor ransomware\n\nSince mid-September 2020, the ANSSI (French National Cyber Security Agency) has observed a vast campaign of\nattacks using the Egregor ransomware. At least 69 organisations, including some French companies, are believed\nto have been targeted [1] [2]. As ransomware, Egregor poses a significant threat since the activity of victim organisations is deeply affected. Bitcoin ransom demands can be in excess of $4,000,000 [2].\n\n## 1 Business model\n\nEgregor is operated using the Ransomware-as-a-service (RaaS) [3] business model. Several attacker groups may\ntherefore carry out attacks delivering Egregor and the kill chain may vary from one attack to the other. The ransomware operators are not necessarily its developers.\n\nEgregor is part of the Sekhmet malware family, discovered in March 2020 [4]. Its operators attempt to break into\nthe target organisation’s information system to steal sensitive documents and encrypt them. They then seek the\npayment of a ransom in exchange for which they claim to be able to decrypt these documents [5].\n\nTargeted organisations are also blackmailed with the threat of disclosure of their data: if the ransom is not paid\nwithin three days, operators threaten to publish the stolen files on a dedicated website [6]. To increase the pressure\non victims, operators may also threaten to release some of the stolen information to the media [7].\n\nOperators reportedly pay 30% of the profits to the developers [8].\n\n## 2 Origins and links with the Sekhmet and Maze ransomwares\n\nattacks campaign delivering Egregor is believed to be linked to the end of the activity of the attacker group behind\nthe Maze ransomware [9] [10]. As a result, many previous Maze affiliates are believed to have started using Egregor. Furthermore, some operators of other malware, such as those of the Qakbot RAT are now believed to prefer\nEgregor over Prolock as the final payload [11] [2].\n\nMany researchers consider Egregor the direct descendant of Maze. This assumption is based on several factors:\n\n  - Chronology: Egregor’s expansion coincides with the end of activity of the Maze ransomware [6].\n\n  - There are thought to be several code similarities between Egregor, Sekhmet and Maze [7] [12] [13] [14].\nSekhmet and Maze also use the same encryption algorithms (ChaCha and RSA-2048).\n\n  - The ransom notes of Maze, Sekhmet and Egregor are also very similar [15]. In addition to their similar\nstructure, parts of Egregor’s ransom notes are identical [6].\n\n  - The same infrastructure (IP 185.238.0[.]233) is believed to have distributed both Maze and Egregor, as well as\nzip files containing the file synchronisation tool RClone and the configuration files [6].\n\nFurthermore, Egregor reportedly shows similarities with other ransomwares and malicious codes, such as Clop and\nTinyMet Payload v0.2 [1].\n\n_Comment: It is common for different ransomware operators to be inspired by the latest tactics and techniques. However,_\n_all of these factors suggest that it is likely that one or more players in the Maze group is now working on Egregor, or at_\n_the very least, that part of the Maze code has been sold on or recovered by Egregor’s developers._\n\n## 3 Victimology\n\nEgregor is used in attacks targeting organisations because of their profitability or their ability to pay high ransom\namounts (Big Game Hunting).\n\n02/03/2021 Page 2 of 11\n\n\n-----\n\nEgregor ransomware\n\nAll activity sectors and all geographical areas represent potential targets. However, many of Egregor’s victims are\nlocated in the United States and belong to the service and manufacturing sectors [11] [2].\n\n## 4 Kill chain\n\n### 4.1 Infection vector\n\nLittle is currently known about the infection vector(s) used. Nevertheless, they appear to be using phishing emails\nwith an attachment containing a malicious macro [6] as well as illegitimate Remote Desktop Protocol (RDP) access.\n\n### 4.2 Lateral movement\n\nThe Qakbot banking Trojan is believed to be currently used to distribute Egregor along with the Prolock ransomware. In at least one case, Egregor operators reportedly used Microsoft Excel documents imitating DocuSign\nencrypted documents and email thread hijacking to distribute Qakbot [2].\n\nThe Ursnif and IcedID trojans are also thought to have been used by the Egregor operators. The use of these\nmalicious codes allow the operators to retrieve information facilitating subsequent lateral movements [6]. The operators are also thought to have distributed Qakbot over the network using the PsExec tool [2].\n\nFig. 4.1: Simplified diagram of the Qakbot (/Ursnif/IcedID) - Egregor kill chain\n\nAs Maze affiliates migrate to Egregor, the tactics, techniques and procedures (TTPs) used by Egregor operators may\nevolve in line with the TTPs usually associated with Maze [2].\n\nThe SharpHound or AdFind tools are believed to have been used during the lateral movement phase within the\nActive Directory (AD). To move around the network, Egregor operators are believed to use SMB beacons via the\nCobalt Strike tool or administrator access. Cobalt Strike payloads can be deobfuscated using the CyberChef tool\n\n[16]. Connections to the command and control server are made via the HTTPS protocol.\n\n02/03/2021 Page 3 of 11\n\n\n-----\n\nEgregor ransomware\n### 4.3 Evasion of defensive measures\n\nEgregor uses multiple techniques of obfuscation to conceal its activities and complicate its analysis. In particular,\nEgregor imitates the svchost.exe process to execute the RClone client and uses the injection of code into the memory to increase its stealth via a reflective dynamic-link library injection [16]).\n\nTo date, the use of code obfuscation techniques[1], anti-debugging techniques and the use of native Windows APIs\nare proven. The payload can only be decrypted using a specific argument inserted in the command line. In one\nincident this argument was “-passegregor10” [6]. During another incident, the following command was used to run\nthe dll to decrypt and then run Egregor [2]:\n```\nrundll32.exe C:\\Windows\\q.dll,DllRegisterServer -password --mode\n\n```\nAccording to an analysis by CybleInc, the Egregor dll was compiled by Microsoft Visual C++ 8.0 and contains 3 export functions: DllInstall, DllRegisterServer and DllUnregisterServer [1].\n\n### 4.4 Exfiltration\n\nThe RClone client is thought to allow operators to exfiltrate data for blackmail and disclosure purposes [2].\n\n### 4.5 Encryption\n\nEgregor seeks to stop numerous processes to ensure that they do not access the files during encryption. Certain\ntargeted processes (procmon and dumpcat for example) are usually used by researchers and complicate analysis of\nEgregor. Operators also reportedly attempt to create a Group Policy Object (GPO) to disable Windows Defender\n\n[12].\n\nThe Bitsadmin command line tool is believed to have been used to download and execute the malicious Egregor dll.\nThe payload is injected into an “iexplore.exe” process and starts the encryption. When the payload is executed, it\nfirst checks the language of the operating system [12]. If the system is configured in one of the following languages,\nthe machine will not be encrypted:\n\n  - Armenian (Armenia);\n\n  - Azeri (Cyrillic, Azerbaijan);\n\n  - Belarusian (Belarus);\n\n  - Georgian (Georgia);\n\n  - Kazakh (Kazakhstan);\n\n  - Kyrgyz (Kyrgyzstan);\n\n  - Moldovan (Moldova);\n\n  - Russian (Moldova);\n\n  - Russian (Russia);\n\n  - Tajiki (Cyrillic, Tajikistan);\n\n  - Tatar (Russia);\n\n  - Turkmen (Turkmenistan);\n\n1In particular, the command PUSH + JUMP instead of RETN is used in XOR operations [12] [16].\n\n02/03/2021 Page 4 of 11\n\n\n-----\n\nEgregor ransomware\n\n  - Ukrainian (Ukraine);\n\n  - Uzbek (Latin, Uzbekistan).\n\nThis practice is common among ransomwares. However, researchers believe that the verification method of the\nlanguage used by Egregor is very similar to that of Sekhmet and Maze [2].\n\nEgregor attempts to create a shortcut in directories to check that it has the privileges required to encrypt their\ncontent. This shortcut is created with the following option:\n```\nFILE_FLAG_DELETE_ON_CLOSE\n\n```\nThis option ensures that the shortcut is deleted automatically [2].\n\nFig. 4.2: Diagram of the kill chain following the use of trojans\n\nEgregor also attempts to remove shadow copies.\n\n_Comment: The ANSSI is not currently able to confirm the use of the vssadmin command by Egregor operators. The_\n_Raccine tool available on GitHub can intercept the use of vssadmin, prevent the deletion of shadow copies and even, in_\n_some cases, block the chain of infection. Raccine is a temporary solution only to be implemented as a last resort in the_\n_face of an imminent threat of encryption. Its use is not a substitute for the implementation of technical security measures._\n\nEgregor uses ChaCha encryption algorithms and RSA-2048. Once encrypted, the files are renamed by adding a new\nrandom extension corresponding to the following regular expression [1]:\n```\n{[a-zA-Z] {4,6}}\n\n```\nNo tool is currently capable of decrypting encrypted files other than the private key held by the operators.\n\nA “RECOVER-FILES.txt” text file containing the ransom note is created in all folders containing encrypted documents. This file also contains the procedure for contacting the ransomware operators [1]. The technical block at\nthe end of the ransom file also contains information about the number of encrypted files, the workstation and the\naffected domain [2].\n\n02/03/2021 Page 5 of 11\n\n\n-----\n\nEgregor ransomware\n### 4.6 Disclosure of data\n\nSeveral domains have been used by Egregor operators. The domains “egregor-support.com”, “egregorsup.com” and\n“newsegregor.com” are attributed to the Egregor ransomware. Investigations carried out by the ANSSI show that\nall three have been filed with the registrar Eranet and use DNSPod name servers. This registrar/name server pair is\nfairly uncommon, however it is consistent with the registration habits of other attacker group domains, including\nsome domains attributed to TA505.\n\nThe “egregor-support.com” and “egregorsup.com” domains allow contact to be made in order to decrypt files and/or\nnegotiate with operators. The “newsegregor.com” and “egregoranrmzapcv.onion” domains are used to disclose\ndata.\n\n_Comment: This could indicate that these groups share the same service providers for domain registration. This confirms_\n_the trend towards outsourcing as well as task-based specialisation within cyber criminal groups._\n\n## 5 The Twisted Spider group\n\nOn 1st November 2020, the Twisted Spider group issued a press release indicating the end of the “Maze Team”\nproject.\n\nAt the end of October 2020, the Egregor site operators threatened to distribute stolen data on various forums,\nthe darknet and via torrent if their domains continued to be targeted by attackers [7]. In at least one incident,\ncomments in Russian were included in a PowerShell script used by the attackers [2]. An operator of the group\nreportedly declared in June 2020 that the group was now cooperating with other attacker groups [9].\n\n_Comment: It is possible that the high degree of visibility acquired by the Maze group may have forced the group to bring_\n_the project to an end. Some of the members would then have developed Sekhmet in the event of the Maze project com-_\n_ing to a close. With Sekhmet having proven its worth, it is thought to have become Egregor following this closure. This_\n_hypothesis would explain the many similarities between these three different ransomwares._\n\n02/03/2021 Page 6 of 11\n\n\n-----\n\nEgregor ransomware\n\n## 6 Summary of the chain of infection\n\nWith regard to the methods used by Egregor affiliates, the following TTPs are likely to be employed:\n\n   - **Infection vectors**\n\n**– T1078: Valid Accounts - Use of legitimate identifiers previously obtained [11].**\n\n**– T1566: Phishing - Sometimes through the hijacking of email exchanges [11].**\n\n   - **Execution**\n\n**– T1086: Powershell - Many affiliates use Powershell for the execution of their scripts and codes on victims’**\nnetworks [11].\n\n**– T1569: System Services: Service Execution [11] [16].**\n\n**– T1053.005: Scheduled Task [16].**\n\n**– T1047: Windows Management Instrumentation [16].**\n\n   - **Persistence**\n\n**– T1543.003: Create or Modify System Process, Windows Service [16] [11].**\n\n**– T1098: Account Manipulation [11].**\n\n   - **Elevation of privileges**\n\n**– T1548: Abuse Elevation Control Mechanism [11].**\n\n   - **Defence evasion**\n\n**– T1562.001: Disable or Modify Tools - Disabling of Windows Defender through the creation of a Group**\nPolicy Object [16].\n\n**– T1222: File and Directory Permissions Modification [11].**\n\n**– T1001: Data Obfuscation - in particular through the use of JUMP [11].**\n\n**– T1027.004: Compile After Delivery - Compilation after delivery, using a password to decrypt and execute**\nthe Egregor dll [11].\n\n   - **Access to identification information**\n\n**– T1110: Brute Force [11].**\n\n**– T1552: Unsecured Credentials - Recovery of identification information via the registry [11].**\n\n   - **Lateral movement**\n\nAttackers in particular use the AdFind and SharpHound tools to map the network.\n\n**– T1087: Account Discovery - Reconnaissance of admin accounts [16] [11].**\n\n**– T1482: Domain Trust Discovery [16].**\n\n**– T1069.001: Permission Group Discovery [16].**\n\n**– T1082: System Information Discovery [11].**\n\n**– T1057: Process Discovery [11].**\n\n**– T1021.001: Remote Desktop Protocol - Within compromised networks, some attackers use RDP sessions**\nfor propagation, including using the rdp.bat batch file to modify the registry and firewall rules to allow\nRDP connections [2].\n\n02/03/2021 Page 7 of 11\n\n\n-----\n\nEgregor ransomware\n\n**– T1021.002: SMB/Windows Admin Shares - Use of Remote Services, in particular SMB/Windows Admin**\nShares [16].\n\n   - **Command and Control**\n\n**– T1071: Application Layer Protocol - Use of SMB beacon via Cobalt Strike [16].**\n\n   - **Exfiltration**\n\n**– T1567.002:Exfiltration to Cloud Storage - Exfiltration of data, mainly using RClone [16].**\n\n   - **Impact**\n\n**– T1486: Data Encrypted for Impact - Data encryption is the main objective of the Egregor operators [11].**\n\n**– T1490: Inhibit System Recovery - Hidden Windows copies are deleted [11].**\n\n02/03/2021 Page 8 of 11\n\n\n-----\n\nEgregor ransomware\n\n## 7 Recommendations\n\nIn order to protect against and react to this type of attack, the ANSSI recommends consulting the Attaques par\n_rançongiciels, tous concernés – Comment les anticiper et réagir en cas d’incident? (Ransomware attacks, all concerned_\n\n- How to anticipate them and react in the event of an incident) guide.\n\nTo reduce the risk of ransomware attacks, especially by Egregor:\n\n  - back up data regularly, physically move the backup of your network and put it in a safe place while ensuring\nit works;\n\n  - have the capacity to detect and block the use of Cobalt Strike on the network;\n\n  - be particularly vigilant with RDP connections and the use of BITS, wmic and PowerShell on the network;\n\n  - keep software and systems up to date. Special attention must be paid to VPN solutions and their updates to\nallow remote access for your employees;\n\n  - if possible, disable macros in office automation solutions that allow the automated completion of tasks. This\nrule will prevent the spread of ransomware via application vulnerabilities;\n\n  - encrypt sensitive documents on your network to prevent their possible disclosure [17];\n\n  - use anti-virus software and keep it updated;\n\n  - partition the information system;\n\n  - limit user privileges and application permissions;\n\n  - if possible, do not expose remote office services (such as RDP) on public networks and use complex passwords\non these services;\n\n  - control Internet access;\n\n  - implement the supervision of logs;\n\n  - ensure awareness among employees;\n\n  - implement a plan to respond to cyber attacks;\n\n  - think about the cyber crisis communication strategy.\n\nThe ANSSI’s advice on how to react in the event of an attack:\n\n  - ensure that attackers have not moved laterally if Qakbot, Ursnif or IcedID is detected on the network;\n\n  - coordinate the management of the cyber crisis;\n\n  - find technical assistance;\n\n  - immediately disconnect the machines from the network without deleting their data;\n\n  - communicate at the appropriate level;\n\n  - do not pay the ransom;\n\n  - file a complaint;\n\n  - restore systems from healthy sources.\n\n02/03/2021 Page 9 of 11\n\n\n-----\n\nEgregor ransomware\n\n## 8 Bibliography\n\n[1] Cyble, Inc. “Egregor Ransomware - A Deep Dive into Its Activities and Techniques”. Oct. 31, 2020. In: (Oct. 31,\n2020).\n\n[2] [Group-IB. The Locking Egregor. Nov. 23, 2020. URL: https://www.group-ib.com/blog/egregor.](https://www.group-ib.com/blog/egregor)\n\n[3] ZDNet. “As Maze Retires, Clients Turn to Sekhmet Ransomware Spin-off Egregor”. Nov. 4, 2020. In: (Nov. 4,\n2020).\n\n[4] [Twitter. @demonslay335. Sept. 18, 2020. URL: https://twitter.com/demonslay335/status/1307056098596335628.](https://twitter.com/demonslay335/status/1307056098596335628)\n\n[5] Dark Reading. “Meet ’Egregor,’ a New Ransomware Family to Watch”. Oct. 5, 2020. In: (Oct. 5, 2020).\n\n[6] Cybereason. “Cybereason vs. Egregor Ransomware”. Nov. 26, 2020. In: (Nov. 26, 2020).\n\n[7] ThreatPost. “Egregor Ransomware Threatens ‘Mass-Media’ Release of Corporate Data”. Oct. 2, 2020. In: (Oct. 2,\n2020).\n\n[8] Bleeping Computer. “Largest Global Staffing Agency Randstad Hit by Egregor Ransomware”. Dec. 4, 2020. In:\n(Dec. 4, 2020).\n\n[9] Bleeping Computer. “Maze Ransomware Shuts down Operations, Denies Creating Cartel”. Nov. 2, 2020. In:\n(Nov. 2, 2020).\n\n[10] Bleeping Computer. “Maze Ransomware Is Shutting down Its Cybercrime Operation”. Oct. 29, 2020. In:\n(Oct. 29, 2020).\n\n[11] [lauren-place. Egregor: The New Ransomware Variant to Watch | Digital Shadows. Nov. 24, 2020. URL: https:](https://www.digitalshadows.com/blog-and-research/egregor-the-new-ransomware-variant-to-watch/)\n```\n   //www.digitalshadows.com/blog-and-research/egregor-the-new-ransomware-variant-to-watch/.\n\n```\n[12] Kaspersky. “Targeted Ransomware: It’s Not Just about Encrypting Your Data!” Nov. 11, 2020. In: (Nov. 11,\n2020).\n\n[13] Security Boulevard. “Egregor: Sekhmet’s Cousin”. Oct. 29, 2020. In: (Oct. 29, 2020).\n\n[14] [Unit42. Threat Assessment: Egregor Ransomware. Dec. 9, 2020. URL: https://unit42.paloaltonetworks.](https://unit42.paloaltonetworks.com/egregor-ransomware-courses-of-action/)\n```\n   com/egregor-ransomware-courses-of-action/.\n\n```\n[15] [Enigma Software. Sekhmet Ransomware. Apr. 2, 2020. URL: https://www.enigmasoftware.com/sekhmetransomware-](https://www.enigmasoftware.com/sekhmetransomware-removal/)\n```\n   removal/.\n\n```\n[16] [Intrinsec. Egregor – Prolock: Fraternal Twins ? Nov. 12, 2020. URL: https://www.intrinsec.com/egregor-](https://www.intrinsec.com/egregor-prolock/)\n```\n   prolock/.\n\n```\n[17] Cyware. “Egregor - A New Ransomware Gang on the Rise”. Oct. 25, 2020. In: (Oct. 25, 2020).\n\n02/03/2021 Page 10 of 11\n\n\n-----\n\n1.0 - 02/03/2021\nOpen License (Étalab - v2.0)\n\n**AGENCE NATIONALE DE LA SÉCURITÉ DES SYSTÈMES D’INFORMATION**\n\nANSSI - 51 boulevard de la Tour-Maubourg, 75700 PARIS 07 SP\nwww.cert.ssi.gouv.fr / cert-fr.cossi@ssi.gouv.fr\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.cert.ssi.gouv.fr/uploads/CERTFR-2021-CTI-007.pdf"
    ],
    "report_names": [
        "CERTFR-2021-CTI-007.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c3c864b3-fac9-4d56-8500-7c06c829fbf8",
            "created_at": "2023-01-06T13:46:39.071873Z",
            "updated_at": "2025-03-27T02:00:02.990045Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Storm-0216",
                "DEV-0216",
                "UNC2198",
                "Maze Team",
                "TWISTED SPIDER",
                "GOLD VILLAGE"
            ],
            "source_name": "MISPGALAXY:TA2101",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "99cb4e5b-8071-4f9e-aa1d-45bfbb6197e3",
            "created_at": "2023-01-06T13:46:38.860754Z",
            "updated_at": "2025-03-27T02:00:02.937438Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "SectorJ04 Group",
                "Dudear",
                "G0092",
                "ATK103",
                "Hive0065",
                "Spandex Tempest",
                "GRACEFUL SPIDER",
                "GOLD TAHOE",
                "CHIMBORAZO",
                "SectorJ04"
            ],
            "source_name": "MISPGALAXY:TA505",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e9f85280-337c-4321-b872-0919f8ef64a6",
            "created_at": "2022-10-25T16:07:24.261761Z",
            "updated_at": "2025-03-27T02:02:10.153781Z",
            "deleted_at": null,
            "main_name": "TA2101",
            "aliases": [
                "Gold Village",
                "Maze Team",
                "TA2101",
                "Twisted Spider"
            ],
            "source_name": "ETDA:TA2101",
            "tools": [
                "7-Zip",
                "Agentemis",
                "BokBot",
                "Buran",
                "ChaCha",
                "Cobalt Strike",
                "CobaltStrike",
                "Egregor",
                "IceID",
                "IcedID",
                "Mimikatz",
                "PsExec",
                "SharpHound",
                "VegaLocker",
                "WinSCP",
                "cobeacon",
                "nmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5e6b31a6-80e3-4e7d-8b0a-d94897ce9b59",
            "created_at": "2024-06-19T02:03:08.128175Z",
            "updated_at": "2025-03-27T02:05:17.400394Z",
            "deleted_at": null,
            "main_name": "GOLD TAHOE",
            "aliases": [
                "SectorJ04 ",
                "Spandex Tempest ",
                "TA505 ",
                "FIN11 "
            ],
            "source_name": "Secureworks:GOLD TAHOE",
            "tools": [
                " Cobalt Strike",
                " FlawedAmmy",
                " Get2",
                " GraceWire",
                " Malichus",
                " SDBbot",
                " ServHelper",
                " TrueBot",
                "Clop"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75d4d6a9-b5d1-4087-a7a0-e4a9587c45f4",
            "created_at": "2022-10-25T15:50:23.5188Z",
            "updated_at": "2025-03-27T02:00:55.489882Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "TA505",
                "Hive0065",
                "Spandex Tempest",
                "CHIMBORAZO"
            ],
            "source_name": "MITRE:TA505",
            "tools": [
                "AdFind",
                "Azorult",
                "FlawedAmmyy",
                "Mimikatz",
                "Dridex",
                "TrickBot",
                "Get2",
                "FlawedGrace",
                "Cobalt Strike",
                "ServHelper",
                "Amadey",
                "SDBbot",
                "PowerSploit"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e447d393-c259-46e2-9932-19be2ba67149",
            "created_at": "2022-10-25T16:07:24.28282Z",
            "updated_at": "2025-03-27T02:02:10.159466Z",
            "deleted_at": null,
            "main_name": "TA505",
            "aliases": [
                "ATK 103",
                "Chimborazo",
                "Gold Evergreen",
                "Gold Tahoe",
                "Graceful Spider",
                "Hive0065",
                "Operation Tovar",
                "Operation Trident Breach",
                "SectorJ04",
                "Spandex Tempest",
                "TA505",
                "TEMP.Warlock"
            ],
            "source_name": "ETDA:TA505",
            "tools": [
                "Amadey",
                "AmmyyRAT",
                "AndroMut",
                "Azer",
                "Bart",
                "Bugat v5",
                "CryptFile2",
                "CryptoLocker",
                "CryptoMix",
                "CryptoShield",
                "Dridex",
                "Dudear",
                "EmailStealer",
                "FRIENDSPEAK",
                "Fake Globe",
                "Fareit",
                "FlawedAmmyy",
                "FlawedGrace",
                "FlowerPippi",
                "GOZ",
                "GameOver Zeus",
                "GazGolder",
                "Gelup",
                "Get2",
                "GetandGo",
                "GlobeImposter",
                "Gorhax",
                "GraceWire",
                "Gussdoor",
                "Jaff",
                "Kasidet",
                "Kegotip",
                "Kneber",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Locky",
                "MINEBRIDGE",
                "MINEBRIDGE RAT",
                "MirrorBlast",
                "Neutrino Bot",
                "Neutrino Exploit Kit",
                "P2P Zeus",
                "Peer-to-Peer Zeus",
                "Philadelphia",
                "Philadephia Ransom",
                "Pony Loader",
                "Rakhni",
                "ReflectiveGnome",
                "Remote Manipulator System",
                "RockLoader",
                "RuRAT",
                "SDBbot",
                "ServHelper",
                "Shifu",
                "Siplog",
                "TeslaGun",
                "TiniMet",
                "TinyMet",
                "Trojan.Zbot",
                "Wsnpoem",
                "Zbot",
                "Zeta",
                "ZeuS",
                "Zeus"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041738,
    "ts_creation_date": 1614696497,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/719c40ddea9276bd4e49fdd2afad57b05b784286.pdf",
        "text": "https://archive.orkl.eu/719c40ddea9276bd4e49fdd2afad57b05b784286.txt",
        "img": "https://archive.orkl.eu/719c40ddea9276bd4e49fdd2afad57b05b784286.jpg"
    }
}