{
    "id": "99677928-7854-4cc0-a09b-67cbca890b90",
    "created_at": "2023-01-12T15:10:55.241608Z",
    "updated_at": "2025-03-27T02:16:34.963279Z",
    "deleted_at": null,
    "sha1_hash": "43f674d4b9064453b42b5769c2da5869db37e395",
    "title": "2022-08-18 - You Can’t Audit Me- APT29 Continues Targeting Microsoft 365",
    "authors": "",
    "file_creation_date": "2022-09-01T10:10:07Z",
    "file_modification_date": "2022-09-01T10:10:07Z",
    "file_size": 2532526,
    "plain_text": "# You Can’t Audit Me: APT29 Continues Targeting Microsoft 365\n\n**[mandiant.com/resources/apt29-continues-targeting-microsoft](https://www.mandiant.com/resources/apt29-continues-targeting-microsoft)**\n\nAPT29 is a Russian espionage group that Mandiant has been tracking since at least 2014\n[and is likely sponsored by the Foreign Intelligence Service (SVR). Mandiant continues to](https://www.mandiant.com/resources/unc2452-merged-into-apt29)\nidentify APT29 operations targeting the United States' (US) interests, and those of NATO and\npartner countries. Despite the publicization of multiple APT29 operations, they continue to be\nextremely prolific. In 2022, APT29 has focused on organizations responsible for influencing\nand crafting the foreign policy of NATO countries. This has included multiple instances where\nAPT29 revisited victims they had compromised years, or sometimes only months\nbeforehand. This persistence and aggressiveness are indicative of sustained interest in this\ninformation and strict tasking by the Russian Government.\n\nMandiant has observed APT29 continue to demonstrate exceptional operational security and\nadvanced tactics targeting Microsoft 365. We are highlighting several newer TTPs used by\nAPT29 in recent operations.\n\n### Disabling Licenses\n\n\n-----\n\nMicrosoft 365 uses a variety of licensing models to control an individual user s access to\nservices in the Microsoft 365 suite of products. The licenses can also dictate security and\ncompliance settings such as log retention and Mail Items Accessed logging within Purview\nAudit. The most common licenses are E1, E3, and E5; however, there are a variety of other\nlicense plans and granular add-ons that make licensing in M365 complex.\n\nFor a threat actor, one of the most troublesome logging features is Purview Audit, formerly\n[Advanced Audit. This feature, available with E5 licenses and certain add-ons, enables the](https://docs.microsoft.com/en-us/microsoft-365/compliance/advanced-audit?view=o365-worldwide)\nMail Items Accessed audit. Mail Items Accessed records the user-agent string, timestamp, IP\naddress, and user each time a mail item is accessed. The audit records any type of mail\naccess whether it is using the Graph API, Outlook, a browser, or other methodology. This is a\ncritical log source to determine if a threat actor is accessing a particular mailbox, as well as\nto determine the scope of exposure. Further, it is the only way to effectively determine\naccess to a particular mailbox when the threat actor is using techniques like Application\nImpersonation or the Graph API.\n\nMandiant has observed APT29 disabling Purview Audit on targeted accounts in a\ncompromised tenant. Once disabled, they begin targeting the inbox for email collection. At\nthis point, there is no logging available to the organization to confirm which accounts the\nthreat actor targeted for email collection and when. Given APT29’s targeting and TTPs\nMandiant believes that email collection is the most likely activity following disablement of\nPurview Audit. We have updated our white paper, Remediation and Hardening Strategies for\nMicrosoft 365 to include more details on this technique as well as detection and remediation\n[advice. Additionally, we have updated the Azure AD Investigator with a new module to report](https://github.com/mandiant/Mandiant-Azure-AD-Investigator)\non users with advanced auditing disabled.\n\n### MFA Takeover of Dormant Accounts\n\nMulti-factor authentication (MFA) is a crucial tool that organizations can deploy to thwart\naccount takeover attacks by threat actors. By requiring users to provide both something they\n_know and something they have, organizations can significantly reduce the risk of account_\n[compromise. MFA itself, however, is not a silver bullet. Mandiant has previously discussed](https://www.mandiant.com/resources/russian-targeting-gov-business)\nhow threat actors abuse push-based MFA to spam users with notifications until they\neventually accept the prompt and allow the threat actor access. Microsoft has recently\n[announced that they will roll out MFA push notification with number matching to combat this.](https://docs.microsoft.com/en-us/azure/active-directory/authentication/how-to-mfa-number-match)\n\nMandiant has begun to observe another trend where threat actors, including APT29, take\nadvantage of the self-enrollment process for MFA in Azure Active Directory and other\nplatforms. When an organization first enforces MFA, most platforms allow users to enroll\ntheir first MFA device at the next login. This is often the workflow chosen by organizations to\nroll out MFA. In Azure AD and other platform’s default configuration, there are no additional\n\n\n-----\n\nenforcements on the MFA enrollment process. In other words, anyone with knowledge of the\nusername and password can access the account from any location and any device to enroll\nMFA, so long as they are the first person to do it.\n\nIn one instance, APT29 conducted a password guessing attack against a list of mailboxes\nthey had obtained through unknown means. The threat actor successfully guessed the\npassword to an account that had been setup, but never used. Because the account was\ndormant, Azure AD prompted APT29 to enroll in MFA. Once enrolled, APT29 was able to\nuse the account to access the organization’s’ VPN infrastructure that was using Azure AD for\nauthentication and MFA. Mandiant recommends that organizations ensure all active\naccounts have at least one MFA device enrolled and work with their platform vendor to add\nadditional verifications to the MFA enrollment process. Microsoft Azure AD recently rolled out\na feature to allow organizations to enforce controls around specific actions such as MFA\n[device enrollment. Using conditional access, Organizations can restrict the registration of](https://docs.microsoft.com/en-us/azure/active-directory/conditional-access/howto-conditional-access-policy-registration)\nMFA devices to only trusted locations, such as the internal network, or trusted devices.\nOrganizations can also choose to require MFA to enroll MFA. To avoid the chicken-and-egg\n[situation this creates, help desk employees can issue Temporary Access Passes to](https://docs.microsoft.com/en-us/azure/active-directory/authentication/howto-authentication-temporary-access-pass#create-a-temporary-access-pass)\nemployees when they first join or if they lose their MFA device. The pass can be used for a\nlimited time to login, bypass MFA, and register a new MFA device.\n\n### Focus on Operational Security\n\nAPT29 continues to demonstrate exceptional operational security and evasion tactics. In\naddition to the use of residential proxies to obfuscate their last mile access to victim\nenvironments, Mandiant has observed APT29 turn to Azure Virtual Machines. The virtual\nmachines used by APT29 exist in Azure subscriptions outside of the victim organization.\nMandiant does not know if these subscriptions have been compromised or purchased by\nAPT29. Sourcing their last-mile access from trusted Microsoft IP addresses reduces the\nlikelihood of detection. Because Microsoft 365 itself runs on Azure, the Azure AD Sign-In and\nUnified Audit Logs already contain many Microsoft IP addresses and it can be hard to quickly\ndetermine if an IP address belongs to a malicious VM or a backend M365 service. From\nMandiant’s own observation it also appears that Microsoft owned IP addresses greatly\nreduce the risk of detection by Microsoft’s risky sign-ins and risky users reports.\n\nMandiant has also observed APT29 mix benign administrative actions with their malicious\nones. For example, in a recent investigation APT29 gained access to a global administrator\naccount in Azure AD. They used the account to backdoor a service principal with\n```\nApplicationImpersonation rights and start collecting email from targeted mailboxes in\n\n```\n[the tenant. To accomplish this, APT29 added a new certificate, or Key Credential, to the](https://docs.microsoft.com/en-us/azure/active-directory/develop/howto-create-service-principal-portal#option-1-upload-a-certificate)\nservice principal. Once added, APT29 was able to authenticate to Azure AD as the Service\nPrincipal and use its roles to collect email. To blend in, APT29 created the certificate with a\nCommon Name (CN) that matched the display name of the backdoored service principal. In\naddition to this, they also added a new Application Address URL to the service principal. The\n\n\n-----\n\naddress they added was completely benign, not needed to facilitate their malicious activities,\nand was related to the functionality of the application as documented by the vendor. This\naction demonstrates the extremely high level of preparation that APT29 takes and the extent\nto wish they try to masquerade their actions as legitimate.\n\n## Outlook\n\nAPT29 continues to develop its technical tradecraft and dedication to strict operational\nsecurity. Mandiant expects that APT29 will stay apace with the development of techniques\nand tactics to access Microsoft 365 in novel and stealthy ways.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-08-18 - You Can’t Audit Me- APT29 Continues Targeting Microsoft 365.pdf"
    ],
    "report_names": [
        "2022-08-18 - You Can’t Audit Me- APT29 Continues Targeting Microsoft 365.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536255,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1662027007,
    "ts_modification_date": 1662027007,
    "files": {
        "pdf": "https://archive.orkl.eu/43f674d4b9064453b42b5769c2da5869db37e395.pdf",
        "text": "https://archive.orkl.eu/43f674d4b9064453b42b5769c2da5869db37e395.txt",
        "img": "https://archive.orkl.eu/43f674d4b9064453b42b5769c2da5869db37e395.jpg"
    }
}