{
    "id": "99847902-c800-4717-a505-f680fe00a847",
    "created_at": "2023-01-12T15:02:22.520741Z",
    "updated_at": "2025-03-27T02:06:02.272436Z",
    "deleted_at": null,
    "sha1_hash": "b7ea0d60d2f237e8c5af29185ac2b08c547e3796",
    "title": "2020-02-12 - CSI- Evidence Indicators for Targeted Ransomware Attacks – Part I",
    "authors": "",
    "file_creation_date": "2022-05-27T21:27:28Z",
    "file_modification_date": "2022-05-27T21:27:28Z",
    "file_size": 1120498,
    "plain_text": "# CSI: Evidence Indicators for Targeted Ransomware Attacks – Part I\n\n**[mcafee.com/blogs/other-blogs/mcafee-labs/csi-evidence-indicators-for-targeted-ransomware-attacks/](https://www.mcafee.com/blogs/other-blogs/mcafee-labs/csi-evidence-indicators-for-targeted-ransomware-attacks/)**\n\nFebruary 12, 2020\n\nFor many years now I have been working and teaching in the field of digital forensics,\nmalware analysis and threat intelligence. During one of the classes we always talk about\nLockard’s exchange principle: “with contact between two items, there will be an exchange”. If\nwe translate that to the digital world: “when an adversary breaches a system, they will leave\ntraces of evidence behind”. The challenge is often how to discover that evidence in a timely\nmanner to take action and discover what sources are available for detection. The volatile\nevidence sources must be secured as soon as possible while the non-volatile sources have\na lower priority. An example of order of volatility:\n\nTable 1: Order of Volatility\n\n\n-----\n\nIn this series of two articles, you will see an example we have been observing as a\nconcerning trend over the last couple of months.\n\nIn the first stage, companies are infected by some sort of information-stealing malware\n(Azorult, Dridex, Trickbot), or breached by having a weakly secured RDP server at the edge\nof the network.\n\nStage two occurs a few weeks later when the same victim is hit by a targeted ransomware\ncampaign using Ryuk, Bitpaymer or another ransomware family the attacker has access to.\n\n[A recent example was covered by the team in this article on Bitpaymer. The adversary](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/spanish-mssp-targeted-by-bitpaymer-ransomware/)\nexecuting stage one does not necessarily have to be the same as the actor executing stage\ntwo. There are plenty of credentials harvested by Azorult or RDP on underground markets.\nBelow is a screenshot from an advertiser demonstrating the number of Azorult victims (13k)\nthey have made, including the information stolen from them:\n\nFigure 1 Azorult C2 example\n\n## Stage 1: The Initial Infection\n\n\n-----\n\nFigure 2 Stage 1\nAlthough there might be some variations, the graphical overview demonstrates how most of\nthese attacks start. Whether by a drive-by compromise where a user visits a website infected\nwith a malicious script or a spear-phishing campaign, the result is a malware infection that\nsteals credentials, exfiltrates them and results in having valid accounts of the victim. The\nother scenario is buying the valid account information from the underground. Having valid\naccounts will give access toward a remote service or direct access to a victim’s machine\nusing the malware. When an adversary makes the next move, 9 out of 10 times we observe\nthe usage of a credential dumping tool like Mimikatz, or PowerShell related activity again for\npassword dumping. The goal? To get local-admin, domain-admin or system rights on a\nsystem within the victim’s network. The secondary goal we observe with the usage of\nPowerShell tools/scripts is conducting reconnaissance of the network.\n\n## Digital Evidence Initial Access stage:\n\nT1189 Drive-By Compromise\n\n\n-----\n\nIn this scenario the victim most likely browses the Internet and visits a webpage that contains\na malicious script. Following the order of Volatility, where could we discover evidence?\nDepending on what type of actions are defined in the malicious script, it could leave traces\non disk or in memory when injected.\n\nT1192 & T1193 Spear-phishing Link/Attachment\n\nIn this scenario, the victim receives an email with a link (T1192) or a weaponized attachment\n(T1193). By clicking on the link, a website is opened, and follow-up actions are executed as\ndescribed above in the T1189 Drive-by compromise. The order of volatility is similar but will\nhave a larger chain of execution. Since the user initiated the action, more digital evidence will\nbe available on the victim’s machine:\n\n1. Execution of a program (Email-client)\n2. Clicking on the link will open the default configured Web-browser\n3. Web-browser visits link\n4. Script will execute\n\nFor the execution of a program and launch, there is process evidence, the prefetch directory,\nUserAssist, Shimcache, RecentApps and many more sources to track when they were\nlaunched and executed. The email itself can either be retrieved from the victim’s inbox or, in\nthe case of Webmail, there might be remnants of it in the temporary Internet files. Most of the\nmentioned evidence artifacts are non-volatile and easy to extract in a forensically sound\nmatter.\n\nIn the case of a spear-phishing attack with a weaponized attachment, the flow will look\nmostly similar to below (of course there are variations):\n\n1. Execution of a program (Email-client)\n2. Opening attachment\n3. Launch of Office application\n4. Execution of the macro\n5. PowerShell/WMIC followed by Internet traffic downloading file\n6. Execution of script/file\n7. Execution in memory or written to disk and execution\n\nWe already discussed the non-volatile evidence available for the execution of a program. In\nthis example there will be evidence for the launch/execution of the email-client and the\nopening of an Office application to execute the attachment. In case the attachment was\nopened before saving to disk, in Outlook the file was copied to the “SecureTemp” folder\nwhich is a hidden folder under Temporary Internet files.\n\nDepending on the payload of the macro, evidence will exist of Internet related traffic. When\nPowerShell or WMIC is used, the launch of it is recorded in the Windows Prefetch directory\nand there are traces in the registry and/or event logs Depending on what type of script or file\n\n\n-----\n\nis executed, traces can be discovered in memory or on disk, with memory most volatile and\ndisk non-volatile.\n\nWhen, for example, a malware like Azorult is installed on the victim’s machine, the flow will\nlook like this:\n\nFigure 3 Exfiltration and Communication\nThe exfiltration of the data is mostly happening over TCP port 80 towards a C2 (command\nand control) dashboard, as demonstrated in Figure 1. Both T1043 and T1041 are techniques\nthat will most likely leave non-volatile traces behind in network logs from devices like a\nproxy/gateway/firewall.\n\nWhat we notice often is that infections with, for example, AZORULT are\nignored/underestimated. They are being detected and the infection is either blocked or\ndetected and later cleaned, however the capabilities of the malware are\nunderestimated/ignored.\n\nIf we look again to table 1, the order of Volatility, the timeframe in which we operate is\nseconds to minutes with regards to initial network traffic and running of processes. Between\ninfection and exfiltration is again in the timeframe of minutes, more than enough to exfiltrate\ncredentials before an action was taken. This is also the delta in which we have the challenge\n– are our people, processes and technology combined capable of responding within this\nattack-window? Anticipating early warning signs and understanding the malware’s\ncapabilities can assist in preventing larger damage.\n\nWhat happens when the initial compromise results in having valid credentials or victim\naccess through the RAT (random access Trojan), being used for a targeted ransomware\nattack? We will discuss that in the next article.\n\n\n-----\n\n[Christiaan Beek Lead Scientist & Sr. Principal Engineer](https://www.mcafee.com/blogs/author/christiaan-beek/)\nChristiaan Beek is the Lead Scientist & Sr. Principal Engineer of the Enterprise Office of the\nCTO. He is leading the strategic threat intelligence research with a focus on inventing...\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-12 - CSI- Evidence Indicators for Targeted Ransomware Attacks – Part I.pdf"
    ],
    "report_names": [
        "2020-02-12 - CSI- Evidence Indicators for Targeted Ransomware Attacks – Part I.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535742,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653686848,
    "ts_modification_date": 1653686848,
    "files": {
        "pdf": "https://archive.orkl.eu/b7ea0d60d2f237e8c5af29185ac2b08c547e3796.pdf",
        "text": "https://archive.orkl.eu/b7ea0d60d2f237e8c5af29185ac2b08c547e3796.txt",
        "img": "https://archive.orkl.eu/b7ea0d60d2f237e8c5af29185ac2b08c547e3796.jpg"
    }
}