{
    "id": "9996fc8a-e7fd-4ba9-ba7c-952ccf35cc7e",
    "created_at": "2023-01-12T15:04:54.091167Z",
    "updated_at": "2025-03-27T02:05:31.572602Z",
    "deleted_at": null,
    "sha1_hash": "f92c99930b51a1411fc1974092b58f62b37ce234",
    "title": "2021-06-28 - Nefilim Ransomware Attack Through a MITRE Att&ck Lens",
    "authors": "",
    "file_creation_date": "2022-05-28T16:01:33Z",
    "file_modification_date": "2022-05-28T16:01:33Z",
    "file_size": 426027,
    "plain_text": "# Nefilim Ransomware Attack Through a MITRE Att&ck Lens\n\n**[trendmicro.com/en_us/research/21/f/nefilim-modern-ransomware-attack-story.html](https://www.trendmicro.com/en_us/research/21/f/nefilim-modern-ransomware-attack-story.html)**\n\nJune 28, 2021\n\nFollow the story of Company X as they suffer an attack from the notorious modern ransomware family,\nNefilim, and their affiliates, to learn how you can better mitigate against the common tactic and techniques\nused in these attacks.\n\nBy: Trend Micro June 28, 2021 Read time: ( words)\n\nNefilim is among a new breed of ransomware families that use advanced techniques for a more targeted\nand virulent attack. It is operated by a group that we track under the intrusion set \"Water Roc\". This group\n[combines advanced techniques with legitimate tools to make them significantly harder to detect and](https://www.trendmicro.com/en_us/research/21/e/stop-ransomware-groups-who-weaponize-legitimate-tools.html)\nrespond before it is too late.\n\nThis allows them to remain undetected in the system for weeks, navigating across the environment to\nmaximize their damage. Before the attack is even initiated, deep victim profiling is done, allowing them to\nuse victim-specific extortion pricing to tailor the ransom.\n\n[Nefilim is a Ransomware as a Service(RaaS) operation first discovered in March 2020, and believed to](https://www.trendmicro.com/en_us/research/21/b/nefilim-ransomware.html)\nhave evolved from the earlier Nemty ransomware family. They target multi-billion dollar companies, primarily\nbased in North or South America, in the financial, manufacturing or transportation industries. They operate\nunder a profit share model, where Nefilim earns 30% for their ransomware service, and the remaining 70%\ngoes to the affiliates who provide the network access and implements the active phase of the attack.\n\nLike all ransomware, recovery is dependent on an external backup drive or paying for the encryption key, as\nNefilim ransomware replaces the original files with encrypted versions.\n\n\n-----\n\n[Along with a new wave of double extortion ransomware families, Nefilim affiliates are particularly vicious](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/ransomware#Ransomware_Evolved_Modern_Ransomware)\nwhen victims don’t immediately pay the ransom, leaking their sensitive data over an extended period of\ntime. They are one of few groups that host leaked victim data long-term, for months to years, using it to\ndeliver a chilling message to future victims.\n\n[The following is a fictional use case built using an in-depth case study of the Nefilim ransomware family to](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/modern-ransomwares-double-extortion-tactics-and-how-to-protect-enterprises-against-them)\n[demonstrate how their typical attack process occurs. The story leverages the MITRE ATT&CK Framework](https://attack.mitre.org/techniques/enterprise/)\nto define each tactic and technique used, with a detailed table below for further technical information.\n\nVictim Use Case of Nefilim\n\nMeet Company X, a fictional company serving the purpose of being the victim of a typical Nefilim\nransomware attack. Company X is a global manufacturing organization with a yearly revenue of US$1\nBillion and headquartered in North America, making them an ideal target of Nefilim.\n\nInfiltrating the Environment\n\nDuring their active vulnerability scanning (T1595.002) of Company X’s internet facing hosts, the adversaries\n[find that X has not patched a Citrix Application Delivery Controller vulnerability (CVE-2019-19781). This is a](https://nvd.nist.gov/vuln/detail/CVE-2019-19781)\nvulnerability they can exploit to gain initial access (T1133) through the exposed Remote Desktop Protocol\n(RDP), and so the attack begins!\n\nX’s security team should have maintained an inventory of their exposed services across their environment,\nperiodically scanning for vulnerabilities so they can proactively mitigate any potential inroads to their\nnetwork. Internet-facing systems such as Citrix should always be a patching priority and managed with\nstrong access controls. Access can be limited with a least-privileged administrative model and a strong\nmultifactor authentication system (M1032) to strengthen account security and prevent credential access. If\nthe RDP is unnecessary, which may be why it was left unpatched, then it should be disabled or blocked\n(M1042). Network proxies, gateways, and firewalls can also be leveraged to deny direct remote access to\nthe internal system, blocking the inroad by which the adversaries are entering.\n\nIntrusion Prevention Systems (IPS) can provide an additional layer of protection in advance of patch\navailability or patch deployment, which is particularly important with preventing targeted ransomware\nattacks, such as this one. IPS logs also provide relevant information for detecting initial access activities.\n\nOnce the actors have successfully infiltrated X’s network, they begin downloading the additional tools they\nwill need to further their plot (T1608). They download a Cobalt Strike beacon to establish a backdoor and\npersistent access to the environment so they can remotely execute commands, and later exfiltrate the data.\nThis beacon is connected back to one of their pre-established shell companies that hosts their Cobalt Strike\nCommand and Control (C&C) server. They also download Process Hacker to stop endpoint security agents\n(T1489), and Mimikatz to dump credentials (T1003.001), along with other tools they will need throughout\ntheir attack.\n\nThe adversaries need elevated permissions to run certain tools as administrators. They take advantage of\nanother unpatched vulnerability in X’s system (T1068), a Windows COM Elevation of Privilege Vulnerability\n[(CVE-2017-0213). Armed with elevated permissions and credentials courtesy of Mimikatz, they are ready to](https://msrc.microsoft.com/update-guide/en-US/vulnerability/CVE-2017-0213)\ncontinue their invasion.\n\nThe use of multiple vulnerabilities that were disclosed several years ago is a reminder of the importance of\ntimely software updating (M1051) and patch management. A threat intelligence program can be developed\nto help identify what software exploits and N-day vulnerabilities may have the most impact on an\norganization (M1019) Virtual patching programs can enhance existing patch management processes to\n\n\n-----\n\nfurther defend against known and unknown vulnerabilities. Application isolation and sandboxing can also be\nused to mitigate the impact of advisories taking advantage of unpatched vulnerabilities (M1048). Ultimately,\nan organization needs good application security that looks for and detects exploitation behavior.\n\nMimikatz is a popular tool used for credential dumping of plaintext passwords, hashes, Kerberos tickets and\nother sensitive data from memory. It can also be used to gain access to other systems within the network\nthrough a pass-the-hash attack (T1550). However, Mimikatz has no major legitimate use that would explain\nadmins having it on their system, so this tool should be treated as suspicious in most cases.\n\nMitigations can be established through strict account management and Active Directory Audit\nPolicies. Enforcing the least-privileged administrative Model (M1018) and limiting credential overlap (M1026)\nacross systems helps to further prevent compromised credential enabling lateral movement.\n\nCompleting the Invasion\n\nThe attackers take advantage of tools that already exist in the system to move laterally and expand their\ninvasion (T1570). They use PsExec to launch taskkill to stop services that could alert X’s security team, and\nto stop backup services (T1489). AdFind gives them vital information about the active directory setup which\nthey use to map out X’s infrastructure and find other targets of interest (T1018). Over time, they move\nthroughout X’s entire environment, including peripheral devices (T1120) and shared drives (T1135),\nidentifying all the valuable data (T1083), and then using PowerShell commands, they strategically drop\nCobalt Strike beacons in specific systems important to their attack as they go.\n\nNetwork intrusion detection and prevention systems (M1031) are critical to mitigate adversary activity after\ninitial access at the network level. These systems can help security teams see that they’ve been breached\nand track the attacker’s activities with sensors at the network, cloud, and endpoint/server layers. Network\nsegmentation and micro segmentation can help to inhibit lateral movement and support security monitoring.\n\nExfiltration for Encryption\n\nThe attackers use automated exfiltration (T1020) with their existing C&C channels established with the\nCobalt Strike beacons set up across X’s environment (T1041). The sensitive data is stolen using file transfer\nprotocols (FTP) in fixed size chucks to avoid triggering network data transfer threshold alerts (T1030). For\nany large files, they use mega.nz to callback the data over the legitimate web service (T1567).\n\nTo prevent the exfiltration of data, web-based content can be restricted (M1021) and network traffic can be\nfiltered (M1037). Any suspicious DNS, HTTP and HTTPS connections should be monitored or blocked\nentirely. AV software should also be kept up-to-date with machine learning plug-ins. As a rule of thumb, it is\nimportant to block any traffic to a Cobalt Strike C&C server, however since Cobalt Strike is designed to\nevade security measures, a multilayer approach is needed for this to be effective.\n\nExecution of Ransomware\n\nAfter a few weeks, the attackers are satisfied that they have identified all valuable data within X’s\nenvironment. They wait until a weekend to help ensure they remain undetected, and then they deploy the\nNefilim ransomware on X’s network. The ransom note is prepared for decryption, then Nefilim imports an\nRSA-2048 public key and leaves it ready to use for encryption. The Nefilim payload is executed with a\ncommand-line argument (T1059) containing the full path of directory with the files identified to be encrypted.\nAll of X’s logical drives are encrypted, and a decrypted ransom note named “NEFILIM-DECRYPT.txt” is\nwritten for each one.\n\n\n-----\n\nBefore starting to encrypt the files, Nefilim checks if they match its exclusion list of files and directory names.\nWith this confirmed, Nefilim encrypts the file contents (T1486), and then replaces the original content with\nthe encrypted version. After which it erases the encryption keys from memory and removes itself 3 seconds\nafter, deleting its path.\n\nCompany X’s CISO returns to work after a relaxing weekend to find her worst nightmare. She has been the\nvictim of a Nefilim ransomware attack.\n\nAfter verifying the attack, she receives the ransom specifically tailored to her company for maximum\nextortion. She must now make the toughest decision of her career; does she pay the ransom? Or risk all of\nCompany X’s sensitive data being leaked and the lawsuit that will follow that?\n\nHow Could This Have Been Prevented?\n\nWhen evaluating your protection against ransomware, you should start with auditing your ability to detect\nthe impact techniques. This tactic is used to attempt to inhibit an organization’s recovery ability and the\ntechniques used are the best indicators of a potential ransomware attack. Nefilim ransomware binaries are\nstraightforward, so general ransomware mitigation techniques would protect against this ransomware family.\n\nThe adversaries stopped services throughout the lifecycle of their attack over several weeks (T1489). These\nactions could be prevented with permission restrictions (M1022 & M1024) and network segmentation\n(M1030) techniques. The risk of an attacker seeing and interfering with critical response functions can be\ndecreased by separating the networks that operate intrusion detection, analysis and response systems from\nthe production environment. Critical services can be protected from interference or being disabled by\nattackers by restricting registry and directory permissions. Ultimately, secure account management (M1018)\nis important to ensure only authorized admins have access to critical services.\n\nOrganization’s security teams can also consider developing disaster recovery plans for situations like a\nsuccessful ransomware attack. These plans can also contain proactive processes such as routine data\nback-up (M1053) and testing the security of the back-up drives that can be used to recover from an attack.\n\n\n-----\n\nThese back-ups should be stored securely off the system and versioning enabled in cloud environments to\nmake copies of the backups. However, this does not stop the stolen data from being leaked, so prevention\nis key with modern ransomware attacks.\n\nThe Answer to Modern Ransomware Prevention\n\nWith most organizations using multiple, separate security layers, threat information is siloed, with an endless\namount of uncorrelated alerts. This results in a lack of visibility, making it extremely difficult to connect the\ntraces of advanced ransomware attacks in time to prevent it. To stay ahead of modern attack techniques, a\nsolution that can look across the entire environment, correlate suspicious activity, and detect critical threats\nwith quality alerts is essential.\n\nWe have answered the challenge of modern ransomware with a purpose-built threat defense extended\n[detection and response (XDR) solution, Trend Micro Vision One. It uses native sensors and protection](https://www.trendmicro.com/en_us/business/products/detection-response.html)\npoints — coupled with XDR capabilities to stitch together threat activity across layers — enabling you to\nquickly identify complex attacks, like Nefilim ransomware, that bypass traditional prevention. This provides\nyou with the ability to run root cause analysis, look at the execution profile, and identify the scope of the\nimpact across your environment. With a broader perspective and better context to hunt, detect and contain\nthreats with fewer, higher quality alerts so you can see more and respond faster.\n\n**Tactic** **Technique** **Observable** **Mitigation** **Prevention**\n\n\n**Reconnaissance** Active Scanning:\n[Vulnerability Scanning](https://attack.mitre.org/techniques/T1595/002/)\nT1595.002\n\n**Initial Access** T1133 : External\nRemote Services\n\n\nAttackers actively\nscan for internetfacing hosts that\nare vulnerable to\nrecently\ndisclosed\nexploits.\n\nAttackers gain\ninitial access\nusing valid\naccounts that\nhave been\nexposed via\nservices such as\nRDP, VPN, Citrix,\nor similar\nservices.\n\n\nPre-compromise\nM1056\n\nM1042: Disable or\n[Remove Feature or](https://attack.mitre.org/mitigations/M1042)\nProgram\n\n\nThis technique\ncannot be easily\nmitigated with\npreventive controls\nsince it is based\non behaviors\nperformed outside\nof the scope of\nenterprise\ndefenses and\ncontrols. Efforts\nshould focus on\nminimizing the\namount and\nsensitivity of data\navailable to\nexternal parties.\n\nDisable or block\nremotely available\nservices that may\nbe unnecessary.\n\n\n-----\n\nM1035: Limit\nAccess to\nResource Over\nNetwork\n\nM1032: Multifactor\nAuthentication\n\nM1030: Network\nSegmentation\n\n**Resource**\n**Development**\n\n\nLimit access to remote\nservices through\ncentrally managed\nconcentrators such as\nVPNs and other\nmanaged remote\naccess systems.\n\nUse strong two-factor\nor multi-factor\nauthentication for\nremote service\naccounts to mitigate an\nadversary's ability to\nleverage stolen\ncredentials, but be\naware of Two-Factor\nAuthentication\nInterception techniques\nfor some two-factor\nauthentication\nimplementations.\n\nDeny direct remote\naccess to internal\nsystems through the\nuse of network proxies,\ngateways, and\nfirewalls.\n\nT1608 -Stage\nCapabilities\n\n\nAdversaries may\nupload, install, or\notherwise set up\ncapabilities that\ncan be used\nduring targeting.\n\n\nPre-compromise\nM1056\n\n\nThis technique\ncannot be easily\nmitigated with\npreventive controls\nsince it is based\non behaviors\nperformed outside\nof the scope of\nenterprise\ndefenses and\ncontrols. Efforts\nshould focus on\nminimizing the\namount and\nsensitivity of data\navailable to\nexternal parties.\n\n\n-----\n\n**Privilege**\n**Escalation**\n\nM1038:\n[Execution](https://attack.mitre.org/mitigations/M1038)\nPrevention\n\n\nT1068 : Exploitation for\nPrivilege Escalation\n\nConsider blocking the\nexecution of known\nvulnerable drivers that\nadversaries may\nexploit to execute code\nin kernel mode.\nValidate driver block\nrules in audit mode to\nensure stability prior to\nproduction\ndeployment.\n\n\nAttackers exploit\nknown\nvulnerabilities to\nelevate privileges\nto perform\nadministrative\nactions or actions\nrequiring\nelevated\nprivileges\n\n\nM1048: Application\n[Isolation and](https://attack.mitre.org/mitigations/M1048)\nSandboxing\n\n\nMake it difficult for\nadversaries to\nadvance their\noperation through\nexploitation of\nundiscovered or\nunpatched\nvulnerabilities by\nusing sandboxing.\nOther types of\nvirtualization and\napplication\nmicrosegmentation\nmay also mitigate\nthe impact of some\ntypes of\nexploitation. Risks\nof additional\nexploits and\nweaknesses in\nthese systems\nmay still exist.\n\n\n-----\n\nM1050: Exploit\nProtection\n\nM1019: Threat\n[Intelligence](https://attack.mitre.org/mitigations/M1019)\nProgram\n\nM1051: Update\nSoftware\n\n\nSecurity applications\nthat look for behavior\nused during\nexploitation such as\nWindows Defender\nExploit Guard (WDEG)\nand the Enhanced\nMitigation Experience\nToolkit (EMET) can be\nused to mitigate some\nexploitation\nbehavior. Control flow\nintegrity checking is\nanother way to\npotentially identify and\nstop a software exploit\nfrom occurring. Many\nof these protections\ndepend on the\narchitecture and target\napplication binary for\ncompatibility and may\nnot work for software\ncomponents targeted\nfor privilege escalation.\n\nDevelop a robust cyber\nthreat intelligence\ncapability to determine\nwhat types and levels\nof threat may use\nsoftware exploits and\n0-days against a\nparticular organization.\n\nUpdate software\nregularly by employing\npatch management for\ninternal enterprise\nendpoints and servers.\n\n\n-----\n\nM1043: Credential\nAccess Protection\n\n\nWith Windows 10,\nMicrosoft\nimplemented new\nprotections called\nCredential Guard\nto protect the LSA\nsecrets that can be\nused to obtain\ncredentials\nthrough forms of\ncredential\ndumping. It is not\nconfigured by\ndefault and has\nhardware and\nfirmware system\nrequirements. It\nalso does not\nprotect against all\nforms of credential\ndumping.\n\n\n**Credential**\n**Access**\n\nM1028:\nOperating\nSystem\nConfiguration\n\nM1027:\n[Password](https://attack.mitre.org/mitigations/M1027)\nPolicies\n\nM1026:\nPrivileged\nAccount\nManagement\n\nM1025:\n[Privileged](https://attack.mitre.org/mitigations/M1025)\nProcess Integrity\n\n\nT1003.001 : OS\n[Credential Dumping:](https://attack.mitre.org/techniques/T1003/001/)\nLSASS Memory\n\nConsider disabling or\nrestricting\nNTLM. Consider\ndisabling WDigest\nauthentication.\n\nEnsure that local\nadministrator accounts\nhave complex, unique\npasswords across all\nsystems on the\nnetwork.\n\nDo not put user or\nadmin domain\naccounts in the local\nadministrator groups\nacross systems unless\nthey are tightly\ncontrolled, as this is\noften equivalent to\nhaving a local\nadministrator account\nwith the same\npassword on all\nsystems. Follow best\npractices for design\nand administration of\nan enterprise network\nto limit privileged\naccount use across\nadministrative tiers.\n\nOn Windows 8.1 and\nWindows Server 2012\nR2, enable Protected\nProcess Light for LSA.\n\n\nAttackers dump\nand use\ncredentials to\ngain access to\nadditional parts\nof the internal\nnetwork after\ngaining initial\naccess. It is also\nsubsequently\nused for lateral\nmovement. Look\nfor\nevidence/artifacts\nindicating the use\nof such\ntechniques.\n\n\n-----\n\nM1017: User\nTraining\n\n**Lateral**\n**Movement**\n\nM1018: User\n[Account](https://attack.mitre.org/mitigations/M1018)\nManagement\n\nT1570: Lateral\nTool Transfer\n\n\nLimit credential overlap\nacross accounts and\nsystems by training\nusers and\nadministrators not to\nuse the same\npassword for multiple\naccounts.\n\nT1550: Use Alternate\nAuthentication Material\n\nEnforce the principle of\nleast-privilege. Do not\nallow a domain user to\nbe in the local\nadministrator group on\nmultiple systems.\n\nAttackers can deploy\ntools within systems to\naid in lateral\nmovement. This\nincludes tools such as\nPsExec, Bloodhound,\nand AdFind.\n\n\nAttackers can\nuse Mimikatz to\ndump hashes,\ntickets, or plain\ntext passwords.\n\nM1037: Filter\nNetwork Traffic\n\n\nM1026: Privileged\nAccount\nManagement\n\nConsider using the\nhost firewall to\nrestrict file sharing\ncommunications such\nas SMB.\n\n\nLimit credential\noverlap across\nsystems to prevent\nthe damage of\ncredential\ncompromise and\nreduce the\nadversary's ability\nto perform Lateral\nMovement\nbetween systems.\n\n\n-----\n\nM1031: Network\n[Intrusion](https://attack.mitre.org/mitigations/M1031)\nPrevention\n\n\nNetwork intrusion\ndetection and\nprevention systems\nthat use network\nsignatures to identify\ntraffic for specific\nadversary malware or\nunusual data transfer\nover known tools and\nprotocols like FTP can\nbe used to mitigate\nactivity at the network\nlevel. Signatures are\noften for unique\nindicators within\nprotocols and may be\nbased on the specific\nobfuscation technique\nused by a particular\nadversary or tool, and\nwill likely be different\nacross various\nmalware families and\nversions.\n\n\nThis type of attack\ntechnique cannot\nbe easily mitigated\nwith preventive\ncontrols since it is\nbased on the\nabuse of system\nfeatures.\n\n\n**Discovery** T1018 Remote System\nDiscovery\n\n\nCybercriminals\ncan abuse tools\nlike AdFind to\ncollect Active\nDirectory\ninformation and\nmap out the\ninfrastructure to\nfind more targets.\n\n\nT1083 - File and\n[Directory](https://attack.mitre.org/techniques/T1083)\nDiscovery\n\nT1120 [Peripheral Device](https://attack.mitre.org/techniques/T1120)\nDiscovery\n\n\nAdversaries may\nenumerate files and\ndirectories or may\nsearch in specific\nlocations of a host or\nnetwork share for\ncertain information\nwithin a file system.\n\nAdversaries may\nattempt to gather\ninformation about\nattached peripheral\ndevices and\ncomponents connected\nto a computer system.\n\n\nThis type of attack\ntechnique cannot be\neasily mitigated with\npreventive controls\nsince it is based on\nthe abuse of system\nfeatures.\n\nThis type of attack\ntechnique cannot be\neasily mitigated with\npreventive controls\nsince it is based on\nthe abuse of system\nfeatures.\n\n\n-----\n\nT1135 - Network\nShare Discovery\n\n\nAdversaries may look\nfor folders and drives\nshared on remote\nsystems as a means of\nidentifying sources of\ninformation to gather\nas a precursor for\nCollection and to\nidentify potential\nsystems of interest for\nLateral Movement.\n\n\nEnable Windows\nGroup Policy \"Do Not\nAllow Anonymous\nEnumeration of SAM\nAccounts and\nShares\" security\nsetting to limit users\nwho can enumerate\nnetwork shares.[36]\n\nNetwork intrusion\ndetection and\nprevention systems\nthat use network\nsignatures to identify\ntraffic for specific\nadversary malware\ncan be used to\nmitigate activity at the\nnetwork level.\nSignatures are often\nfor unique indicators\nwithin protocols and\nmay be based on the\nspecific obfuscation\ntechnique used by a\nparticular adversary\nor tool, and will likely\nbe different across\nvarious malware\nfamilies and versions.\nAdversaries will likely\nchange tool\ncommand and control\nsignatures over time\nor construct protocols\nin such a way to\navoid detection by\ncommon defensive\ntools.\n\n\n**Exfiltration** T1020: Automated\nExfiltration\n\n\nThis type of attack\ntechnique cannot\nbe easily mitigated\nwith preventive\ncontrols since it is\nbased on the\nabuse of system\nfeatures.\n\n\nT1041:\n[Exfiltration Over](https://attack.mitre.org/techniques/T1041)\nC2 Channel\n\n\nAdversaries may steal\ndata by exfiltrating it\nover an existing\ncommand and control\nchannel. Stolen data is\nencoded into the\nnormal\ncommunications\nchannel using the\nsame protocol as\ncommand and control\ncommunications.\n\n\nM1028:\nOperating\nSystem\nConfiguration\n\nAdversaries may\nexfiltrate data,\nsuch as sensitive\ndocuments,\nthrough the use\nof automated\nprocessing after\nbeing gathered\nduring Collection.\n\nM1031: Network\n[Intrusion](https://attack.mitre.org/mitigations/M1031)\nPrevention\n\n\n-----\n\nT1030: Data\n[Transfer Size](https://attack.mitre.org/techniques/T1030)\nLimits\n\nT1567:\n[Exfiltration Over](https://attack.mitre.org/techniques/T1567)\nWeb Services\n\n\nAn adversary may\nexfiltrate data in fixed\nsize chunks instead of\nwhole files or limit\npacket sizes below\ncertain thresholds. This\napproach may be used\nto avoid triggering\nnetwork data transfer\nthreshold alerts.\n\nAdversaries may use\nan existing, legitimate\nexternal Web service\nto exfiltrate data rather\nthan their primary\ncommand and control\nchannel. Popular Web\nservices acting as an\nexfiltration mechanism\nmay give a significant\namount of cover due to\nthe likelihood that\nhosts within a network\nare already\ncommunicating with\nthem prior to\ncompromise. Firewall\nrules may also already\nexist to permit traffic to\nthese services.\n\n\nM1031: Network\n[Intrusion](https://attack.mitre.org/mitigations/M1031)\nPrevention\n\nM1021: Restrict\n[Web-Based](https://attack.mitre.org/mitigations/M1021)\nContent\n\n\nNetwork intrusion\ndetection and\nprevention systems\nthat use network\nsignatures to identify\ntraffic for specific\nadversary malware\ncan be used to\nmitigate activity at the\nnetwork level.\nSignatures are often\nfor unique indicators\nwithin protocols and\nmay be based on the\nspecific obfuscation\ntechnique used by a\nparticular adversary\nor tool, and will likely\nbe different across\nvarious malware\nfamilies and versions.\nAdversaries will likely\nchange tool\ncommand and control\nsignatures over time\nor construct protocols\nin such a way to\navoid detection by\ncommon defensive\ntools.\n\nWeb proxies can be\nused to enforce an\nexternal network\ncommunication policy\nthat prevents use of\nunauthorized external\nservices.\n\n\n-----\n\n**Execution** T1059 - Command and\nScripting Interpreter\n\n\nAdversaries may\nabuse command\nand script\ninterpreters to\nexecute\ncommands,\nscripts, or\nbinaries.\n\n\nM1049:\nAntivirus/Antimalware\n\n\nAnti-virus can be\nused to\nautomatically\nquarantine\nsuspicious files.\n\n\nM1045: Code\nSigning\n\nM1042: Disable\nor Remove\nFeature or\nProgram\n\nM1038:\n[Execution](https://attack.mitre.org/mitigations/M1038)\nPrevention\n\nM1026:\nPrivileged\nAccount\nManagement\n\n\nWhere possible, only\npermit execution of\nsigned scripts.\n\nDisable or remove any\nunnecessary or\nunused shells or\ninterpreters.\n\nUse application control\nwhere appropriate.\n\nWhen PowerShell is\nnecessary, restrict\nPowerShell execution\npolicy to\nadministrators. Be\naware that there are\nmethods of bypassing\nthe PowerShell\nexecution policy,\ndepending on\nenvironment\nconfiguration.\n\n\n-----\n\nM1021: Restrict\n[Web-Based](https://attack.mitre.org/mitigations/M1021)\nContent\n\n\nScript blocking\nextensions can help\nprevent the execution\nof scripts and HTA files\nthat may commonly be\nused during the\nexploitation process.\nFor malicious code\nserved up through ads,\nadblockers can help\nprevent that code from\nexecuting in the first\nplace.\n\n\n[M1053: Data Backup](https://attack.mitre.org/mitigations/M1053) Consider\nimplementing IT\ndisaster recovery\nplans that contain\nprocedures for\nregularly taking\nand testing data\nbackups that can\nbe used to restore\norganizational\ndata. Ensure\nbackups are\nstored off system\nand is protected\nfrom common\nmethods\nadversaries may\nuse to gain access\nand destroy the\nbackups to prevent\nrecovery. Consider\nenabling\nversioning in cloud\nenvironments to\nmaintain backup\ncopies of storage\nobjects.\n\nOperate intrusion\ndetection, analysis,\nand response\nsystems on a\nseparate network\nfrom the production\nenvironment to\nlessen the chances\nthat an adversary can\nsee and interfere with\ncritical response\nfunctions.\n\n\n**Impact** T1486 - Data\nEncrypted for Impact\n\n\nT1489 - Service\nStop\n\n\nAdversaries may stop\nor disable services on\na system to render\nthose services\nunavailable to\nlegitimate users.\n\n\nAdversaries may\nencrypt data on\ntarget systems or\non large numbers\nof systems in a\nnetwork to\ninterrupt\navailability to\nsystem and\nnetwork\nresources.\n\nM1030: Network\nSegmentation\n\n\n-----\n\nM1022: Restrict\n[File and Directory](https://attack.mitre.org/mitigations/M1022)\nPermissions\n\nM1024: Restrict\n[Registry](https://attack.mitre.org/mitigations/M1024)\nPermissions\n\nM1018: User\n[Account](https://attack.mitre.org/mitigations/M1018)\nManagement\n\n\nEnsure proper process\nand file permissions\nare in place to inhibit\nadversaries from\ndisabling or interfering\nwith critical services.\n\nEnsure proper registry\npermissions are in\nplace to inhibit\nadversaries from\ndisabling or interfering\nwith critical services.\n\nLimit privileges of user\naccounts and groups\nso that only authorized\nadministrators can\ninteract with service\nchanges and service\nconfigurations.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-28 - Nefilim Ransomware Attack Through a MITRE Att&ck Lens.pdf"
    ],
    "report_names": [
        "2021-06-28 - Nefilim Ransomware Attack Through a MITRE Att&ck Lens.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535894,
    "ts_updated_at": 1743041131,
    "ts_creation_date": 1653753693,
    "ts_modification_date": 1653753693,
    "files": {
        "pdf": "https://archive.orkl.eu/f92c99930b51a1411fc1974092b58f62b37ce234.pdf",
        "text": "https://archive.orkl.eu/f92c99930b51a1411fc1974092b58f62b37ce234.txt",
        "img": "https://archive.orkl.eu/f92c99930b51a1411fc1974092b58f62b37ce234.jpg"
    }
}