{
    "id": "99d52c2d-11d6-43ac-ab4c-79978519ee9c",
    "created_at": "2023-01-12T15:08:29.124144Z",
    "updated_at": "2025-03-27T02:09:30.16031Z",
    "deleted_at": null,
    "sha1_hash": "ab65147b4dad99bbb2b705397c604f186f1c856d",
    "title": "2019-05-08 - Dharma Ransomware Uses AV Tool to Distract from Malicious Activities",
    "authors": "",
    "file_creation_date": "2022-05-27T22:19:05Z",
    "file_modification_date": "2022-05-27T22:19:05Z",
    "file_size": 135374,
    "plain_text": "# Dharma Ransomware Uses AV Tool to Hide Activities\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/dharma-ransomware-uses-av-tool-to-distract-from-malicious-activities/](https://blog.trendmicro.com/trendlabs-security-intelligence/dharma-ransomware-uses-av-tool-to-distract-from-malicious-activities/)**\n\nRansomware\n\n\nMay 8, 2019\n\n\nTrend Micro recently found new samples of Dharma ransomware using a new technique: using software installation as a distraction to help\nhide malicious activities.\n\nBy: Raphael Centeno May 08, 2019 Read time: ( words)\n\n[The Dharma ransomware has been around since 2016, but it has continued to target and successfully victimize users and organizations](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/ransomware-recap-nov-7-18-2016)\n[around the world. One high profile attack happened in November 2018 when the ransomware infected a hospital in Texas, encrypting many of](https://www.zdnet.com/article/texas-hospital-becomes-victim-of-ransomware-patient-data-potentially-leaked/)\ntheir stored records; luckily the hospital was able to recover from the attack without paying the ransom. Trend Micro recently found new\nsamples of Dharma ransomware using a new technique: using software installation as a distraction to help hide malicious activities.\n\n**Dharma ransomware actors abuse AV tool**\n\nNew samples of Dharma ransomware show that it is still being distributed via spam mail. Typical of spam, the message pressures users into\ndownloading a file. If a user clicks on the download link, they will be prompted for a password (provided in the email message) before getting\nthe file.\n\n\n-----\n\ngu e a a a so a e ect o c a\n\nThe downloaded file is a self-extracting archive named Defender.exe, which drops the malicious file taskhost.exe as well as the installer of an\nold version of ESET AV Remover renamed as Defender_nt32_enu.exe. Trend Micro identifies taskhost.exe as a file connected to the Dharma\nransomware (detected as RANSOM.WIN32.DHARMA.THDAAAI)\n\nDharma2-2.png\n\nFigure 2. Spam mail for Dharma ransomware\n\nDharma-3-2.png\n\nFigure 3. Running the self-extracting archive (Defender.exe)\n\nThe ransomware uses this old ESET AV Remover installer, which appears unmodified based on initial scanning, to divert attention as it\nencrypts files on the victim’s device. When the self-extracting archive runs, Dharma starts encrypting files in the background and the ESET AV\nRemover installation begins. The user will see the ESET GUI onscreen, a distraction from Dharma’s malicious activities.\n\nDharma-4-2.jpg\n\nFigure 4. Software installation distracts from the ransomware’s activities\n\nDharma-5-2.png\n\nFigure 5. Software installation runs on a different instance than malware\n\nThe AV Remover is a working tool that goes through the familiar installation routine if it is executed. However, the ransomware will still encrypt\nfiles even if the installation is not started. The malware runs on a different instance than the software installation, so their behavior is not\nrelated.\n\nThe tool is legitimate software bundled with the malware, so user interaction is necessary to fully install it. The ransomware will run even if the\ntool installation is not triggered, and the tool can be installed even if the ransomware does not run. The installation process seems included just\nto trick users into thinking no malicious activity is going on.\n\nDharma-6-2.png\n\nFigure 6. The ESET installer file also has a valid digital signature, so this also helps it stay under the radar\n\n[Cybercriminals have a history of abusing authentic tools, and this recent Dharma tactic of using an installer as a diversion or screen of](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/best-practices-securing-sysadmin-tools)\nlegitimacy is simply another method they are experimenting with. This new version is designed to trick users and allow the ransomware to\nstealthily operate in the background. As malware authors continue to adopt layered evasion tactics and malicious techniques, users also have\nto adopt stronger and smarter security solutions to protect their assets.\n\nESET was informed of this research before publishing and issued this response:\n\n_The article describes the well-known practice for malware to be bundled with legitimate application(s). In the specific case Trend Micro is_\n_documenting, an official and unmodified ESET AV Remover was used. However, any other application could be used this way. The main_\n_reason is to distract the user, this application is used as a decoy application. ESET threat detection engineers have seen several cases of_\n_ransomware packed in self-extract package together with some clean files or hack/keygen/crack recently. So this is nothing new._\n_In the specific case described by Trend Micro, the ransomware is executed right after our remover application, but the remover has a dialogue_\n_and waits for user interaction, so there is no chance to remove any AV solution before the ransomware is fully executed._\n\n**How to defend against ransomware**\n\nThere has been a growing awareness about ransomware as well as improved solutions for organizations and users, which contributes to\n[ransomware’s continuing decline. However, as proven by the new samples of Dharma, many malicious actors are still trying to upgrade old](https://www.trendmicro.com/vinfo/ph/security/research-and-analysis/threat-reports/roundup/unraveling-the-tangle-of-old-and-new-threats)\nthreats and use new techniques. Ransomware remains a costly and versatile threat; earlier this month a ransomware family was spotted\n[targeting vulnerable Samba servers. This particular ransomware first emerged as a threat targeting victim’s network-attached storage device](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/nampohyu-aka-megalocker-virus-ransomware-found-remotely-encrypting-samba-servers)\nbefore it evolved to target other devices.\n\nUsers and organizations should prepare for Dharma and similar threats by adopting good cybersecurity hygiene. Some best practices to follow\ninclude:\n\n[Secure email gateways to thwart threats via spam and avoid opening suspicious emails.](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/infosec-guide-email-threats)\n[Regularly back up files.](https://www.trendmicro.com/vinfo/ph/security/news/virtualization-and-cloud/best-practices-backing-up-data)\n[Keep systems and applications updated, or use virtual patching for legacy or unpatchable systems and software.](https://www.trendmicro.com/vinfo/ph/security/news/vulnerabilities-and-exploits/virtual-patching-patch-those-vulnerabilities-before-they-can-be-exploited)\n[Enforce the principle of least privilege: Secure system administrations tools that attackers could abuse; implement network](https://www.trendmicro.com/vinfo/ph/security/news/cybercrime-and-digital-threats/best-practices-securing-sysadmin-tools)\nsegmentation and [data categorization to minimize further exposure of mission-critical and sensitive data; and disable third-party or](https://www.trendmicro.com/vinfo/ph/security/news/cyber-attacks/keeping-digital-assets-safe-need-for-data-classification/)\noutdated components that could be used as entry points.\n\n\n-----\n\np e e t de e se dept dd t o a aye s o secu ty [e app cat o](https://www.trendmicro.com/en_us/business/products/user-protection/sps/endpoint.html) co t o a d be a o o to g e ps t a t u a ted\nmodifications to the system or execution of anomalous files.\nFoster a culture of security in the workplace\n\n**Indicators of Compromise**\n\n**File Name** **SHA256** **Detection**\n\nDefender.exe a5de5b0e2a1da6e958955c189db72467ec0f8daaa9f9f5ccc44e71c6c5d8add4 Ransom.Win32.DHARMA.THDAAA\n\ntaskhost.exe1 703b57adaf02eef74097e5de9d0bbd06fc2c29ea7f92c90d54a0b9a01172babe Ransom.Win32.DHARMA.THDAAA\n\nDefender_nt32_enu.exe1 0d7e4d980ae644438ee17c1ea61ac076983ec3efb3cc9d3b588d2d92e52d7c83 normal ESET AV remover\n\npackager.dll 083b92a07beebbd9c7d089648b1949f78929410464578a36713033bbd3a8ecea normal\n\npanmap.dll 9ada26a385e8b10f76b7c4f05d591b282bd42e7f429c7bbe7ef0bb0d6499d729 normal\n\nsspisrv.dll f195983cdf8256f1d1425cc7683f9bf5c624928339ddb4e3da96fdae2657813d normal\n\nsstpsvc.dll 39d3254383e3f49fd3e2dff8212f4b5744d8d5e0a6bb320516c5ee525ad211eb\n\nnormal\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-08 - Dharma Ransomware Uses AV Tool to Distract from Malicious Activities.pdf"
    ],
    "report_names": [
        "2019-05-08 - Dharma Ransomware Uses AV Tool to Distract from Malicious Activities.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536109,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653689945,
    "ts_modification_date": 1653689945,
    "files": {
        "pdf": "https://archive.orkl.eu/ab65147b4dad99bbb2b705397c604f186f1c856d.pdf",
        "text": "https://archive.orkl.eu/ab65147b4dad99bbb2b705397c604f186f1c856d.txt",
        "img": "https://archive.orkl.eu/ab65147b4dad99bbb2b705397c604f186f1c856d.jpg"
    }
}