{
    "id": "99fcc18d-58aa-4bc8-b43f-3d1686c3d280",
    "created_at": "2023-01-12T15:02:54.548184Z",
    "updated_at": "2025-03-27T02:16:25.810372Z",
    "deleted_at": null,
    "sha1_hash": "798f8d8041e559f79ae4b70ed544f1a81f3e999e",
    "title": "2022-04-29 - Warning- GRIM and Magnus Android Botnets are Underground",
    "authors": "",
    "file_creation_date": "2022-05-27T19:11:13Z",
    "file_modification_date": "2022-05-27T19:11:13Z",
    "file_size": 575230,
    "plain_text": "# Warning: GRIM and Magnus Android Botnets are Underground\n\n**[fortinet.com/blog/threat-research/grim-magnus-android-botnets](https://www.fortinet.com/blog/threat-research/grim-magnus-android-botnets)**\n\nApril 29, 2022\n\nThe lifecycle of an Android banking botnet typically consists of two stages: rise and fall.\nDuring the rising phase, the malware author promotes their new code and rents it\nunderground—MaaS (Malware as a Service). As the botnet gains popularity, it evolves with\nnew features and pricing. At some point, though, an issue occurs, triggering its fall. For\n[example, the author gets caught (e.g Anubis) or its source code gets released on](https://twitter.com/threatfabric/status/1162283463891750913)\nunderground forums (either willingly by the authors themselves, by a competitor, or perhaps\nan unhappy customer). As a result, the botnet gradually dies. And unfortunately, others pop\nup on the market to take its place.\n\n[As malware analysts, the Android/Marcher, Locker, and Anubis malware we used to see](https://www.fortinet.com/blog/threat-research/spring-parade-for-refreshed-android-marcher)\n[have been replaced by BianLian, Cerberos, and Flubot (and still Anubis). A year ago, threat](https://www.fortinet.com/blog/threat-research/android-bianlian-botnet-mobile-banking)\nactor(s) started advertising a newcomer, the [Huracan botnet. We haven’t seen it in the wild](https://twitter.com/bank_security/status/1363930541372891137)\n\n\n-----\n\nyet—or if we have, we haven t recognized it (it s not always obvious to match underground\nnames with the samples we analyze).\n\nSince the beginning of 2022, there are even more newcomers. I have spotted at least\n**two future banking botnets:** **GRIM and Magnus. You should be keep an eye on those**\ntwo, as they will probably emerge in the wild in the next few months.\n\n## Underground advertisement\n\nThe Magnus Botnet has been repeatedly advertised underground by a threat actor named\n_whit3_d3vil since February 2022. It is unclear whether whi3_d3vil is the author or just a_\nreseller. The botnet implements all the typical features that banking trojans currently have:\noverlay injection over mobile banking applications, sending SMS, SMS interception, 2FA\nbypass, remote administration via VNC, etc. And unlike BianLian, communication with C2s\n**is encrypted using AES.**\n\nFigure 1: Magnus bot advertised on an underground forum\n\nThe botnet can be rented for 1,000 USD per month.\n\nShould we be amused or anxious that malware are being sold like boxes of cookies on the\nweb? There are even sales (prices marked down from 1,600 USD to 1,000 USD),\nwatermarked screenshots (against competitors?), and videos demonstrating the product!\n\nFigure 2: Magnus bot advertisement with lowered price\n\nThe Grim botnet is less expensive: only 500 USD/month. It is being advertised on a\nspecialized Telegram channel. It implements more or less the same features as the Magnus\nbot. Prices for underground botnet packages are freely fixed by the authors/resellers. They\ndon’t necessarily match features. A lower price for Grimbot can mean the malware has less\nnotoriety, for instance, rather than fewer features.\n\nFigure 3: Screen capture of a demo video of Grimbot exhibiting its injection features on\nvarious mobile banking apps (targets)\n\n## How does this concern me?\n\nIf you are a malware analyst, be on the lookout for a new banking botnet whose\n**communication with its C2 is encrypted with AES (Magnus) or a botnet with tags such**\n**as “grim” that poses as a “Security” application.**\n\nFortunately, if you are protected by Fortiguard Antivirus (e.g. FortiGate, FortiClient, FortiMail,\nFortiWeb, FortiProxy), you are automatically protected against many Android banking\ntrojans.\n\n\n-----\n\nHowever, there are a few other precautions you should take:\n\n1. Android banking trojans typically pose as famous applications: Video Player, Play\n\nStore, Flash Player, etc. Be sure to download such applications only from a trusted\nmarketplace. Never follow a link (email or SMS) to download the app, even if it\ncomes from a presumed friend. Important: Note that banking trojans do not usually\npose as a mobile banking app. Rather, they pose as another app, detect when you use\nyour (genuine) mobile banking app, and display (overlay) malicious windows on top of\nthe real ones.\n2. All those banking trojans also abuse Android Accessibility Services. Accessibility\n\nServices are meant to help people with disabilities. Do not grant such rights to any\nother application!\n\nFigure 4: This is the standard alert screen on Android that shows when an application tries to\nuse Accessibility Services. You should **not** accept this. Instead, click Cancel immediately,\nuninstall the corresponding app, and scan your smartphone\n\nFigure 5: This screen is a very good indicator of an infection by Android/BianLian. Do not\nactivate accessibility services! Uninstall the application immediately and scan your\nsmartphone for viruses with AV for higher security\n\n## Fortinet Protection\n\nFortinet products detect malware discussed in this blog:\n\nAnubis\n\nAndroid/Anubis.AOG!tr\nAndroid/Anubis.CST!tr\nAndroid/Anubis.BIR!tr\nAndroid/Anubis.AMB!tr\n\nMarcher\n\nAndroid/Marcher.X!tr\n\nLocker\n\nAndroid/Locker.KV!tr\nAndroid/Agent.BFQ!tr\nAndroid/Agent.BDH!tr\n\nBianLian\n\nAndroid/BianLian.10484!tr\n\n\n-----\n\nCerberus\n\nAndroid/Cerberus.DF!tr\nAndroid/Agent.DDF!tr\n\nFlubot\n\nAndroid/Flubot.G!tr\nAndroid/Agent.HWW!tr\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-29 - Warning- GRIM and Magnus Android Botnets are Underground.pdf"
    ],
    "report_names": [
        "2022-04-29 - Warning- GRIM and Magnus Android Botnets are Underground.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535774,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653678673,
    "ts_modification_date": 1653678673,
    "files": {
        "pdf": "https://archive.orkl.eu/798f8d8041e559f79ae4b70ed544f1a81f3e999e.pdf",
        "text": "https://archive.orkl.eu/798f8d8041e559f79ae4b70ed544f1a81f3e999e.txt",
        "img": "https://archive.orkl.eu/798f8d8041e559f79ae4b70ed544f1a81f3e999e.jpg"
    }
}