{
    "id": "9a6ad83c-db49-424e-835c-8b9d1d6df1d2",
    "created_at": "2023-01-12T14:59:48.187222Z",
    "updated_at": "2025-03-27T02:09:30.206113Z",
    "deleted_at": null,
    "sha1_hash": "3f61a7d4528f27e50daa49c4cb88be9dea2f6155",
    "title": "2019-11-26 - Insights from one year of tracking a polymorphic threat",
    "authors": "",
    "file_creation_date": "2022-05-28T22:02:13Z",
    "file_modification_date": "2022-05-28T22:02:13Z",
    "file_size": 939846,
    "plain_text": "# Insights from one year of tracking a polymorphic threat\n\n**[microsoft.com/security/blog/2019/11/26/insights-from-one-year-of-tracking-a-polymorphic-threat/](https://www.microsoft.com/security/blog/2019/11/26/insights-from-one-year-of-tracking-a-polymorphic-threat/)**\n\nNovember 26, 2019\n\nA little over a year ago, in October 2018, our polymorphic outbreak monitoring system detected a large\nsurge in reports, indicating that a large-scale campaign was unfolding. We observed as the new threat\nattempted to deploy files that changed every 20-30 minutes on thousands of devices. We gave the\nthreat the name “Dexphot,” based on certain characteristics of the malware code.\n\nThe Dexphot attack used a variety of sophisticated methods to evade security solutions. Layers of\nobfuscation, encryption, and the use of randomized file names hid the installation process. Dexphot\nthen used [fileless techniques to run malicious code directly in memory, leaving only a few traces that](https://docs.microsoft.com/en-us/windows/security/threat-protection/intelligence/fileless-threats)\ncan be used for forensics. It hijacked legitimate system processes to disguise malicious activity. If not\nstopped, Dexphot ultimately ran a cryptocurrency miner on the device, with monitoring services and\nscheduled tasks triggering re-infection when defenders attempt to remove the malware.\n\nIn the months that followed, we closely tracked the threat and witnessed the attackers upgrade the\nmalware, target new processes, and work around defensive measures:\n\n[While Microsoft Defender Advanced Threat Protection’s pre-execution detection engines blocked](https://www.microsoft.com/en-us/microsoft-365/windows/microsoft-defender-atp)\nDexphot in most cases, [behavior-based machine learning models provided protection for cases where](https://www.microsoft.com/security/blog/2019/10/08/in-hot-pursuit-of-elusive-threats-ai-driven-behavior-based-blocking-stops-attacks-in-their-tracks/)\nthe threat slipped through. Given the threat’s persistence mechanisms, polymorphism, and use of\nfileless techniques, behavior-based detection was a critical component of the comprehensive\nprotection against this malware and other threats that exhibit similar malicious behaviors.\n\nMicrosoft Defender ATP data shows the effectiveness of behavioral blocking and containment\ncapabilities in stopping the Dexphot campaign. Over time, Dexphot-related malicious behavior reports\ndropped to a low hum, as the threat lost steam.\n\n\n-----\n\nOur close monitoring of Dexphot helped us ensure that our customers were protected from the\nevolving threat. More importantly, one year’s worth of intelligence helped us gain insight not only into\nthe goals and motivations of Dexphot’s authors, but of cybercriminals in general.\n\n## Complex attack chain\n\nThe early stages of a Dexphot infection involves numerous files and processes. During the execution\nstage, Dexphot writes five key files to disk:\n\n1. An installer with two URLs\n2. An MSI package file downloaded from one of the URLs\n3. A password-protected ZIP archive\n4. A loader DLL, which is extracted from the archive\n5. An encrypted data file that holds three additional executables that are loaded into system\n\n[processes via process hollowing](https://www.microsoft.com/security/blog/2017/07/12/detecting-stealthier-cross-process-injection-techniques-with-windows-defender-atp-process-hollowing-and-atom-bombing/)\n\nExcept for the installer, the other processes that run during execution are legitimate system processes.\nThis can make detection and remediation more difficult. These legitimate system processes include\n_msiexec.exe (for installing MSI packages), unzip.exe (for extracting files from the password-protected_\nZIP archive), rundll32.exe (for loading the loader DLL), schtasks.exe (for scheduled tasks),\n_powershell.exe (for forced updates). In later stages, Dexphot targets a few other system processes for_\nprocess hollowing: svchost.exe, tracert.exe, and setup.exe.\n\n\n-----\n\n## Multiple layers of security evasion\n\n[Based on Microsoft Defender ATP signals, SoftwareBundler:Win32/ICLoader and its variants are](https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?Name=SoftwareBundler:Win32/ICLoader&threatId=222548)\nprimarily used to drop and run the Dexphot installer. The installer uses two URLs to download\nmalicious payloads. These are the same two URLs that Dexphot use later to establish persistence,\nupdate the malware, and re-infect the device.\n\nThe installer downloads an MSI package from one of the two URLs, and then launches msiexec.exe to\nperform a silent install. This is the first of several instances of Dexphot employing living-off-the-land\ntechniques, the use of legitimate system processes for nefarious purposes.\n\nDexphot’s package often contains an obfuscated batch script. If the package contains this file, the\nscript is the first thing that msiexec.exe runs when it begins the installation process. The said\nobfuscated script is designed to check for antivirus products. Dexphot halts the infection process\nimmediately if an antivirus product is found running.\n\nWhen we first began our research, the batch script only checked for antivirus products from Avast and\nAVG. Later, Windows Defender Antivirus was added to the checklist.\n\n\n-----\n\nIf the process is not halted, Dexphot decompresses the password-protected ZIP archive from the MSI\npackage. The password to this archive is within the MSI package. Along with the password, the\nmalware’s authors also include a clean version of unzip.exe so that they don’t have to rely on the\ntarget system having a ZIP utility. The unzip.exe file in the package is usually named various things,\nsuch as z.exe or ex.exe, to avoid scrutiny.\n\nThe ZIP archive usually contains three files: the loader DLL, an encrypted data file (usually named\n_bin.dat), and, often, one clean unrelated DLL, which is likely included to mislead detection._\n\nDexphot usually extracts the decompressed files to the target system’s Favorites folder. The files are\ngiven new, random names, which are generated by concatenating words and numbers based on the\ntime of execution (for example, C:\\Users\\<user>\\Favorites\\\\Res.Center.ponse\\<numbers>). The\ncommands to generate the new names are also obfuscated, for example:\n\n_Msiexec.exe next calls rundll32.exe, specifying loader DLL (urlmon.7z in the example above) in order_\nto decrypt the data file. The decryption process involves ADD and XOR operations, using a key\nhardcoded in the binary.\n\nThe decrypted data contains three executables. Unlike the files described earlier, these executables\nare never written to the filesystem. Instead, they exist only in memory, and Dexphot runs them by\nloading them into other system processes via process hollowing.\n\n## Stealthy execution through fileless techniques\n\n[Process hollowing is a technique that can hide malware within a legitimate system process. It replaces](https://www.microsoft.com/security/blog/2017/07/12/detecting-stealthier-cross-process-injection-techniques-with-windows-defender-atp-process-hollowing-and-atom-bombing/)\nthe contents of the legitimate process with malicious code. Detecting malicious code hidden using this\nmethod is not trivial, so process hollowing has become a prevalent technique used by malware today.\n\n\n-----\n\nThis method has the additional benefit of being fileless: the code can be run without actually being\nsaved on the file system. Not only is it harder to detect the malicious code while it’s running, it’s harder\nto find useful forensics after the process has stopped.\n\nTo initiate process hollowing, the loader DLL targets two legitimate system processes, for example\nsvchost.exe or nslookup.exe, and spawns them in a suspended state. The loader DLL replaces the\ncontents of these processes with the first and second decrypted executables. These executables are\nmonitoring services for maintaining Dexphot’s components. The now-malicious processes are released\nfrom suspension and run.\n\nNext, the loader DLL targets the setup.exe file in SysWoW64. It removes setup.exe’s contents and\nreplaces them with the third decrypted executable, a cryptocurrency miner. Although Dexphot always\nuses a cryptocurrency miner of some kind, it’s not always the same miner. It used different programs\nlike XMRig and JCE Miner over the course of our research.\n\n## Persistence through regularly scheduled malware updates\n\nThe two monitoring services simultaneously check the status of all three malicious processes. Having\ndual monitoring services provides redundancy in case one of the monitoring processes is halted. If any\nof the processes are terminated, the monitors immediately identify the situation, terminate all remaining\nmalicious processes, and re-infect the device. This forced update/re-infection process is started by a\nPowerShell command similar to the one below:\n\nThe monitoring components also detect freshly launched cmd.exe processes and terminate them\npromptly. As a final fail-safe, Dexphot uses schtasks.exe to create scheduled tasks, with the command\nbelow.\n\nThis persistence technique is interesting, because it employs two distinct MITRE ATT&CK techniques:\n[Scheduled Task and](https://attack.mitre.org/techniques/T1053/) [Signed Binary Proxy Execution.](https://attack.mitre.org/techniques/T1218/)\n\nThe scheduled tasks call msiexec.exe as a proxy to run the malicious code, much like how\n_msiexec.exe was used during installation. Using msiexec.exe, a legitimate system process, can make_\nit harder to trace the source of malicious activity.\n\n\n-----\n\nFurthermore, the tasks allow Dexphot to conveniently update the payload from the web every time the\ntasks run. They automatically update all of Dexphot’s components, both upon system reboot as well as\nevery 90 or 110 minutes while the system is running.\n\nDexphot also generates the names for the tasks at runtime, which means a simple block list of\nhardcoded task names will not be effective in preventing them from running. The names are usually in\na GUID format, although after we released our first round of Dexphot-blocking protections, the threat\nauthors began to use random strings.\n\nThe threat authors have one more evasion technique for these scheduled tasks: some Dexphot\nvariants copy msiexec.exe to an arbitrary location and give it a random name, such as %AppData%\\\n_<random>.exe. This makes the system process running malicious code a literal moving target._\n\n## Polymorphism\n\nDexphot exhibits multiple layers of polymorphism across the binaries it distributes. For example, the\nMSI package used in the campaign contains different files, as shown in the table below. The MSI\npackages generally include a clean version of unzip.exe, a password-protected ZIP file, and a batch\nfile that checks for currently installed antivirus products. However, the batch file is not always present,\nand the names of the ZIP files and Loader DLLs, as well as the password for extracting the ZIP file, all\nchange from one package to the next.\n\nIn addition, the contents of each Loader DLL differs from package to package, as does the encrypted\ndata included in the ZIP file. This leads to the generation of a different ZIP archive and, in turn, a\nunique MSI package, each time the attacker bundles the files together. Because of these carefully\ndesigned layers of polymorphism, a traditional file-based detection approach wouldn’t be effective\nagainst Dexphot.\n\n\n**MSI**\n**package**\n**ID**\n\n**Unzip.exe**\n**name**\n\n\n**MSI**\n**package**\n**contents**\n\n**ZIP file**\n**name**\n\n\n**Password for**\n**ZIP file**\n\n**Batch file**\n**name**\n\n\n**Contents**\n**of**\n**encrypted**\n**ZIP**\n\n**Loader**\n**DLL file**\n**name**\n\n\n**Encrypted**\n**data name**\n\n\nMSI-1 ex.exe webUI.r0_ f.bat kjfhwehjkf IECache.dll bin.dat\n\nMSI-2 ex.exe analog.tv f.bat ZvDagW kernel32.bin bin.dat\n\nMSI-3 z.exe yandex.zip f.bat jeremy SetupUi.dll bin.dat\n\nMSI-4 unzip.exe ERDNT.LOC.zip iso100 ERDNT.LOC data.bin\n\nMSI-5 pck.exe mse.zip kika _steam.dll bin.dat\n\nMSI-6 z.exe msi.zip arima ic64.dll bin.dat\n\nMSI-7 z.exe mse.zip f.bat kika _steam.dll bin.dat\n\nMSI-8 z.exe mse.zip kika _steam.dll bin.dat\n\n\n-----\n\nMSI-9 z.exe yandex.zip f.bat jeremy SetupUi.dll bin.dat\n\nMSI-10 hf.exe update.dat f.bat namr x32Frame.dll data.bin\n\nMSI-11 z.exe yandex.zip f.bat jeremy SetupUi.dll bin.dat\n\nMSI-12 unzip.exe PkgMgr.iso.zip pack PkgMgr.iso data.bin\n\nMSI-13 ex.exe analog.tv f.bat kjfhwefkjwehjkf urlmon.7z bin.dat\n\nMSI-14 ex.exe icon.ico f.bat ZDADW default.ocx bin.dat\n\nMSI-15 hf.exe update.dat namr AvastFileRep.dll data.bin\n\nMSI-16 pck.exe mse.zip f.bat kika _steam.dll bin.dat\n\nMSI-17 z.exe mse.zip f.bat joft win2k.wim bin.dat\n\nMSI-18 ex.exe plugin.cx f.bat ZDW _setup.ini bin.dat\n\nMSI-19 hf.exe update.dat namr AvastFileRep.dll data.bin\n\nMSI-20 ex.exe installers.msu f.bat 000cehjkf MSE.Engine.dll bin.dat\n\nMSI-21 z.exe msi.zip f.bat arima ic64.dll bin.dat\n\nMSI-22 z.exe archive00.x f.bat 00Jmsjeh20 chrome_watcher.dll bin.dat\n\n## A multitude of payload hosts\n\nBesides tracking the files and processes that Dexphot uses to execute an attack, we have also been\nmonitoring the domains used to host malicious payloads. The URLs used for hosting all follow a similar\npattern. The domain address usually ends in a .info or .net TLD, while the file name for the actual\npayload consists of random characters, similar to the randomness previously seen being used to\ngenerate file names and scheduled tasks. Some examples from our research are shown in the table\nbelow.\n\n**Scheduled task name** **Download URL**\n\nhboavboja https://supe********709.info/xoslqzu.pdi\n\n\n{C0B15B19-AB02-0A10-259B1789B8BD78D6}\n\n\nhttps://fa*****r.com/jz5jmdouv4js.uoe\n\n\nytiazuceqeif https://supe********709.info/spkfuvjwadou.bbo\n\nbeoxlwayou https://rb*****.info/xgvylniu.feo\n\n\n{F1B4C720-5A8B-8E97-8949696A113E8BA5}\n\n\nhttps://emp*******winc.com/f85kr64p1s5k.naj\n\n\ngxcxhbvlkie https://gu*****me.net/ssitocdfsiu.pef\n\n\n{BE7FFC87-6635-429F-9F2DCD3FD0E6DA51}\n\n\nhttps://sy*****.info/pasuuy/xqeilinooyesejou.oew\n\n\n-----\n\n{0575F553-1277-FB0F-AF67EB649EE04B39}\n\n\nhttps://sumb*******on.info/gbzycb.kiz\n\n\ngposiiobhkwz https://gu*****me.net/uyuvmueie.hui\n\n\n{EAABDEAC-2258-1340-63755D5C1B7CEA7F}\n\n\nhttps://refr*******r711.info/3WIfUntot.1Mb\n\n\nzsayuuec https://gu*****me.net/dexaeuioiexpyva.dil\n\nnjibqhcq https://supe********709.info/aodoweuvmnamugu.fux\n\n\n{22D36F35-F5C2-29D3-1CF1C51AC19564A4}\n\n\nhttps://pr*****.info/ppaorpbafeualuwfx/hix.ayk\n\n\nqeubpmnu https://gu*****me.net/ddssaizauuaxvt.cup\n\nadeuuelv https://supe********709.info/tpneevqlqziee.okn\n\n\n{0B44027E-7514-5EC6-CE7926EB87434AEF}\n\n{5A29AFD9-63FD-9F5E-F2495EC1F2238023}\n\n{C5C1D86D-44BB-8EAA-5CDC26B37F92E411}\n\n\nhttps://sy*****.info/huauroxaxhlvyyhp/xho.eqx\n\nhttps://refr*******r711rb.info/s28ZXoDH4.78y\n\nhttps://fa*****r.com/rbvelfbflyvf.rws\n\n\nMany of the URLs listed were in use for an extended period. However, the MSI packages hosted at\neach URL are frequently changed or updated. In addition, every few days more domains are generated\nto host more payloads. After a few months of monitoring, we were able to identify around 200 unique\nDexphot domains.\n\n## Conclusion: Dynamic, comprehensive protection against increasingly complex everyday threats\n\nDexphot is not the type of attack that generates mainstream media attention; it’s one of the countless\nmalware campaigns that are active at any given time. Its goal is a very common one in cybercriminal\ncircles — to install a coin miner that silently steals computer resources and generates revenue for the\nattackers — yet Dexphot exemplifies the level of complexity and rate of evolution of even everyday\nthreats, intent on evading protections and motivated to fly under the radar for the prospect of profit.\n\nTo combat threats, several [next-generation protection engines in](https://www.microsoft.com/security/blog/2019/06/24/inside-out-get-to-know-the-advanced-technologies-at-the-core-of-microsoft-defender-atp-next-generation-protection/) Microsoft Defender Advanced Threat\nProtection’s antivirus component detect and stop malicious techniques at multiple points along the\nattack chain. For Dexphot, machine learning-based detections in the cloud recognize and block the\nDLLs loaded by rundll32.exe, stopping the attack chain in its early stages. Memory scans detect and\nterminate the loading of malicious code hidden by process hollowing — including the monitoring\nprocesses that attempt to update the malware code and re-infect the machine via PowerShell\ncommands.\n\n[Behavioral blocking and containment capabilities are especially effective in defeating Dexphot’s fileless](https://www.microsoft.com/security/blog/2019/10/08/in-hot-pursuit-of-elusive-threats-ai-driven-behavior-based-blocking-stops-attacks-in-their-tracks/)\ntechniques, detection evasion, and persistence mechanisms, including the periodic and boot-time\nattempts to update the malware via scheduled tasks As mentioned given the complexity of the attack\n\n\n-----\n\n[chain and of Dexphot s persistence methods, we released a remediation solution that prevents re-](https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/configure-remediation-windows-defender-antivirus)\ninfection by removing artifacts.\n\nThe detection, blocking, and remediation of Dexphot on endpoints are exposed in Microsoft Defender\n[Security Center, where Microsoft Defender ATP’s rich capabilities like endpoint detection and](https://www.microsoft.com/en-us/microsoft-365/windows/microsoft-defender-atp)\nresponse, automated investigation and remediation, and others enable security operations teams to\ninvestigate and remediate attacks in enterprise environments. With these capabilities, Microsoft\nDefender ATP provides comprehensive protection against Dexphot and the countless other complex\nand evolving threats that we face every day.\n\n## Sample indicators of compromise (IoCs)\n\nInstaller (SHA-256):\n\n72acaf9ff8a43c68416884a3fff3b23e749b4bb8fb39e16f9976643360ed391f\n\nMSI files (SHA-256):\n\n22beffb61cbdc2e0c3eefaf068b498b63a193b239500dab25d03790c467379e3\n\n65eac7f9b67ff69cefed288f563b4d77917c94c410c6c6c4e4390db66305ca2a\n\nba9467e0d63ba65bf10650a3c8d36cd292b3f846983032a44a835e5966bc7e88\n\nLoader DLLs (SHA-256):\n\n537d7fe3b426827e40bbdd1d127ddb59effe1e9b3c160804df8922f92e0b366e\n\n504cc403e0b83233f8d20c0c86b0611facc040b868964b4afbda3214a2c8e1c5\n\naa5c56fe01af091f07c56ac7cbd240948ea6482b6146e0d3848d450977dff152\n\n**_Hazel Kim_**\n\n\n-----\n\n_Microsoft Defender ATP Research Team_\n\n## Talk to us\n\nQuestions, concerns, or insights on this story? Join discussions at the Microsoft Defender ATP\ncommunity.\n\n[Read all Microsoft security intelligence blog posts.](https://www.microsoft.com/security/blog/microsoft-security-intelligence/)\n\nFollow us on Twitter **[@MsftSecIntel.](https://twitter.com/MsftSecIntel)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-11-26 - Insights from one year of tracking a polymorphic threat.pdf"
    ],
    "report_names": [
        "2019-11-26 - Insights from one year of tracking a polymorphic threat.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535588,
    "ts_updated_at": 1743041370,
    "ts_creation_date": 1653775333,
    "ts_modification_date": 1653775333,
    "files": {
        "pdf": "https://archive.orkl.eu/3f61a7d4528f27e50daa49c4cb88be9dea2f6155.pdf",
        "text": "https://archive.orkl.eu/3f61a7d4528f27e50daa49c4cb88be9dea2f6155.txt",
        "img": "https://archive.orkl.eu/3f61a7d4528f27e50daa49c4cb88be9dea2f6155.jpg"
    }
}