{
    "id": "9a910b25-dfdc-406f-982a-737548e20986",
    "created_at": "2023-01-12T15:04:03.696531Z",
    "updated_at": "2025-03-27T02:17:00.580168Z",
    "deleted_at": null,
    "sha1_hash": "1f1da6cef03b7809705f3798d77b72cedf3ab78b",
    "title": "2022-06-21 - APT ToddyCat- Unveiling an unknown APT actor attacking high-profile entities in Europe and Asia",
    "authors": "",
    "file_creation_date": "2022-07-02T23:13:44Z",
    "file_modification_date": "2022-07-02T23:13:44Z",
    "file_size": 1048475,
    "plain_text": "# Unveiling an unknown APT actor attacking high-profile entities in Europe and Asia\n\n**securelist.com/toddycat/106799/**\n\nAuthors\n\n[Giampaolo Dedola](https://securelist.com/author/giampaolodedola/)\n\nToddyCat is a relatively new APT actor that we have not been able to relate to other known\nactors, responsible for multiple sets of attacks detected since December 2020 against highprofile entities in Europe and Asia. We still have little information about this actor, but we know\nthat its main distinctive signs are two formerly unknown tools that we call ‘Samurai backdoor’ and\n‘Ninja Trojan’.\n\nThe group started its activities in December 2020, compromising selected Exchange servers in\nTaiwan and Vietnam using an unknown exploit that led to the creation of a well-known China\nChopper web shell, which was in turn used to initiate a multi-stage infection chain. In that chain\nwe observed a number of components that include custom loaders used to stage the final\nexecution of the passive backdoor Samurai.\n\nDuring the first period, between December 2020 and February 2021, the group targeted a very\nlimited number of servers in Taiwan and Vietnam, related to three organizations.\n\nFrom February 26 until early March, we observed a quick escalation and the attacker abusing the\nProxyLogon vulnerability to compromise multiple organizations across Europe and Asia.\n\n\n-----\n\nWe suspect that this group started exploiting the Microsoft Exchange vulnerability in December\n2020, but unfortunately, we don’t have sufficient information to confirm the hypothesis. In any\ncase, it’s worth noting that all the targeted machines infected between December and February\nwere Microsoft Windows Exchange servers; the attackers compromised the servers with an\nunknown exploit, with the rest of the attack chain the same as that used in March.\n\n[Other vendors observed the attacks launched in March. Our colleagues at ESET dubbed the](https://www.welivesecurity.com/2021/03/10/exchange-servers-under-siege-10-apt-groups/)\n[cluster of activities ‘Websiic’, while the Vietnamese company GTSC released a report about the](https://gteltsc.vn/blog/cap-nhat-nhe-ve-lo-hong-bao-mat-0day-microsoft-exchange-dang-duoc-su-dung-de-tan-cong-cac-to-chuc-tai-viet-nam-9685.html)\ninfection vector and the technique used to deploy the first dropper. That said, as far as we know,\nnone of the public accounts described sightings of the full infection chain or later stages of the\nmalware deployed as part of this group’s operation.\n\nThe first wave of attacks exclusively targeted Microsoft Exchange Servers, which were\ncompromised with Samurai, a sophisticated passive backdoor that usually works on ports 80 and\n443. The malware allows arbitrary C# code execution and is used with multiple modules that\nallow the attacker to administrate the remote system and move laterally inside the targeted\nnetwork.\n\nIn some specific cases, the Samurai backdoor was also used to launch another sophisticated\nmalicious program that we dubbed Ninja. This tool is probably a component of an unknown postexploitation toolkit exclusively used by ToddyCat.\n\nBased on the code logic, it appears that Ninja is a collaborative tool allowing multiple operators to\nwork on the same machine simultaneously. It provides a large set of commands, which allow the\nattackers to control remote systems, avoid detection and penetrate deep inside a targeted\nnetwork. Some capabilities are similar to those provided in other notorious post-exploitation\ntoolkits. For example, Ninja has a feature like Cobalt Strike pivot listeners, which can limit the\nnumber of direct connections from the targeted network to the remote C2 and control systems\nwithout internet access. It also provides the ability to control the HTTP indicators and camouflage\nmalicious traffic in HTTP requests that appear legitimate by modifying HTTP header and URL\npaths. This feature provides functionality that reminds us of the Cobalt Strike Malleable C2\nprofile.\n\nSince it first appeared in December 2020, ToddyCat has continued its intense activity, especially\nin Asia where we detect many other variants of loaders and installers similar to those abused to\nload Samurai and Ninja malware. We also observed other waves of attacks against desktop\nmachines that were infected by sending the malicious loaders via Telegram.\n\n## First Campaign\n\n### Infection vector\n\nBased on our telemetry, ToddyCat started to compromise servers on December 22, 2020, using\nan unknown exploit against the Microsoft Exchange component. The exploit was used to deploy\nthe China Chopper web shell, which was used in turn to download and execute another dropper,\n\n\n-----\n\ndebug.exe.\n\nStarting from February 26, we observed the same infection chain and samples observed in\nDecember and January, deployed using ProxyLogon.\n\n### Stage 1 – Dropper\n\nThe dropper installs all the other components and creates multiple registry keys to force the\nlegitimate svchost.exe process to load the final Samurai backdoor.\n\n**_Infection workflow_**\n\nThe program debug.exe makes use of a special resolution function that is used every time it calls\na Windows API. The code checks if the pointer is already resolved and placed into a global\nvariable. If the value was not found, it goes on to retrieve the address using the resolution\nfunction, which receives a handle to the library that contains the API and an encrypted string of\nthe requested API name, following which it decrypts the string using an XOR-based algorithm.\n\n\n-----\n\n**_Code snippet used to resolve and call CryptDestroyKey and CryptReleaseContext_**\n**_functions_**\n\nThe dropper was configured to load an encrypted payload stored in another file, debug.xml. The\ndata are decrypted using the standard Wincrypt functions with the CALG_3DES_112 algorithm\nand a static key embedded in the code. Once decrypted, the file shows a structure that contains\nmultiple payloads and values used to install the next stages.\n\n**Field** **Value**\n\nmagic 0x12345678\n\nDotNet_Loader_v2_Payload websvc.dll payload compatible with .Net Framework v2.0\n\nDotNet_Loader_v4_Payload websvc.dll payload compatible with .Net Framework v4.0\n\nLoader_Dll_Payload iiswmi.dll dll loader\n\nServiceName WebUpdate\n\nPath_DotNet_Loader %COMMONPROGRAMFILES%\\System\\websvc.dll\n\nPath_Loader_Dll %COMMONPROGRAMFILES%\\microsoft\nshared\\WMI\\iiswmi.dll\n\nRegKey_Path_Service_SvcHost SOFTWARE\\Microsoft\\Windows\nNT\\CurrentVersion\\Svchost\n\nRegKey_Path_Interface SOFTWARE\\Classes\\Interface\\{6FD0637B-85C6-D3A9CCE9-65A3F73ADED9}\n\nReg_Interface_Payload_v4 Samurai backdoor for .Net Framework v4.0\n\nReg_Interface_Payload_v2 Samurai backdoor for .Net Framework v2.0\n\n\n-----\n\nOnce the values are retrieved from the file, the malware conducts a sequence of actions in order\nto stage the next component in the infection chain:\n\n1. Attempts to create the directory %COMMONPROGRAMFILES%\\Microsoft Shared\\wmi\\\n\nthat will contain the DLL used for the next stage.\n2. Checks if a service corresponding to the subsequent stage already exists, and if so\n\nattempts to stop it.\n3. Checks if the .NET framework of version 2.0 is installed by attempting to open the registry\n\nkey SOFTWARE\\Microsoft\\.NETFramework\\policy\\v2.0\n4. If the key exists, the malware drops the element we refer to as DotNet_Loader_v2_Payload\n\nto %COMMONPROGRAMFILES%\\System\\websvc.dll; otherwise, it drops the contents of\nDotNet_Loader_v4_Payload in the same path.\n5. Drops a DLL loader used to start the second stage under the path\n\n%COMMONPROGRAMFILES%\\microsoft shared\\WMI\\iiswmi.dll\n6. Once the aforementioned files are available on the system, the malware tries to create the\n\nregistry key specified below to maintain persistence on the system. The value in that key\nindicates the name of the service that is created to execute the binary. Following the\nexample below, once executed the service-related process is associated with the command\nline %SystemRoot%\\System32\\svchost.exe -k httpsvc.\n\n\n1\n\n2\n\n3\n\n\nRegistry Key: HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\n\nValue name: httpsvc\n\nValue: WebUpdate\n\n\n7. After the service is created, the malware attempts to configure the second stage DLL and\n\nentry point within it to be executed when the service is started. This is done by setting the\ncorresponding registry keys with the following values:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n\nRegistry Key: $HKLM\\System\\ControlSet\\Services\\WebUpdate\\Parameters\n\nValue name: ServiceDll\n\nValue: %ProgramFiles%\\Common Files\\microsoft shared\\WMI\\iiswmi.dll\n\nRegistry Key: $HKLM\\System\\ControlSet\\Services\\WebUpdate\\Parameters\n\nValue name: ServiceMain\n\nValue: INIT\n\n\n-----\n\n8. The malware drops the final payload in the infection chain as a compressed, encrypted and\n\nbase64 encoded blob under the following registry key:\n\n\n1\n\n2\n\n3\n\n\nRegistry Key: $HKLM\\SOFTWARE\\Classes\\Interface\\{6FD0637B-85C6-D3A9-CCE965A3F73ADED9}\n\nValue name:\n\nValue: ILQ3Pz8/Pz87P9IFVEskWKpIeTB0jZx5SVXYXhh1fG...%encoded data%\n\n\n### Stage 2 – DLL Loader\n\nThe registry keys created during the previous step forced the svchost.exe process to load a\nmalicious library developed in C++, iiswmi.dll. The code used inside the library is quite similar to\nthe dropper and it calls the Windows API using the same special resolution function observed in\nthe dropper.\n\nThis component is merely a loader that attempts to get an encrypted payload from the registry\nand pass it as an argument to another DLL manually loaded during runtime.\n\nThe malware attempts to read the contents of the previously written registry key\nSOFTWARE\\Classes\\Interface\\{6FD0637B-85C6-D3A9-CCE9-65A3F73ADED9}, and if it\nsucceeds, loads the previously dropped DLL in the path\n%COMMONPROGRAMFILES%\\System\\websvc.dll.\n\nTo invoke the next stage, the malware calls the Init export in the loaded DLL (websvc.dll) while\npassing the contents of the former registry key as an argument.\n\n**_Code snippet used to load and execute websvc.dll_**\n\n### Stage 3 – .NET Loader\n\n\n-----\n\nThe websvc.dll library was developed in C# and it is another loader that expects an encrypted\npayload as input argument. That input is comprised of two base64-encoded strings separated by\nthe pipe character (“|”). The first string contains the final stage and the second an encrypted\nconfiguration that is used during the execution of the next stage.\n\nThe library decodes the first string and the resulting data are decrypted with a simple single XOR\nwith the key 0x3F and decompressed using Gzip. The resulting payload is another library written\nin C#, which is loaded in memory and executed by invoking a method named “Equals” from the\nclass “X” defined in the loaded code. The second base64-encoded string loaded from the registry\nis passed as argument to the new C# library.\n\n**_Code snippet used to load and execute final stage_**\n\n### Samurai backdoor\n\nThe final stage is a formerly unknown modular backdoor that we dubbed Samurai, due to a\nconstant keyword used inside an important dictionary used by the malware to share data\nbetween its modules.\n\nThe library was developed in C# and uses the .NET HTTPListener class to receive and handle\nHTTP POST requests, looking for specially crafted requests that carry encrypted C# source code\nissued by the attackers. These programs will be in turn compiled and executed during runtime.\n\nThe malware is obfuscated with an algorithm developed to increase the difficulty of reverse\nengineering by making the code complicated to read. Multiple functions in the code are assigned\nrandom names, while some perform very simple actions, like getting a property of an object\npassed as input.\n\nMoreover, the malware uses multiple while loops and switch cases to jump between instructions,\nthus flattening the control flow and making it hard to track the order of actions in the code. The\nflow is controlled by modifying the switch case expression value and using break and goto\n\n\n-----\n\nstatements to restart the loop, re-evaluate the switch expression and jump to the correct\ninstruction.\n\n**_Code snippet with while loop and switch case_**\n\nThe malware’s logic starts by decrypting configuration data provided as an input argument.\nThose data are encoded with base64 and encrypted with the DES algorithm using the hardcoded\nkey 90 EE 0C E1 6C 0D C9 0C. The resulting payload is a configuration file, which is customized\nper victim, containing multiple lines with several parameters consumed by the backdoor.\n\nBelow is an example of the configuration block’s structure:\n\n\n1\n\n2\n\n3\n\n4\n\n\nkeywordxyz\n\nC:\\Windows\\Temp\\\n\nhttp://*:80/owa/auth/sslauth/\n\nhttps://*:443/owa/auth/sslauth/\n\n\nThe first line contains a keyword that needs to be included as a variable in the received POST\nrequest, marking it as designated for processing by the backdoor and also used to specify\nimportant session parameters like the AES session key and the list of variable names that\ncontain the data that should be processed.\n\n\n-----\n\nIn some variants, the second line is used as a directory path, whose value is used to override the\nTEMP environment variable. All the other lines are URI prefixes that are used to configure the\nHTTPListener component, whereby each is a string composed of a scheme (HTTP or HTTPS), a\nhost, an optional port, and an optional path defining which request will be processed by the\nHTTPListener object.\n\nIn several cases, the URL prefixes contained in the configuration included the victim’s domain, as\nin the following example: https://mail.%redacted%.gov.%redacted%/owa/auth/sslauth.\n\nOnce the configuration is successfully decrypted, the backdoor starts the listeners according to\nthe provided configuration and waits for incoming requests. The request must to be structured as\nin the following example:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n\nPOST /owa/auth/sslauth/ HTTP/1.0\n\nHost: example.xyz\n\nHeaders...\n\nkeywordxyz={session_AES_key,variable2,variable3}&variable2=[C# source\n\ncode]&variable3=[argument_for_the_compiled_program\\r\\nassembly_reference1;assemb\n\nly_reference2]\n\n\nWhere:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n\n{} = encrypted with default AES key + base64 encoded\n\n[] = encrypted with session AES key + base64 encoded\n\n### Input config ###\n\nkeywordxyz\n\nC:\\Windows\\Temp\\\n\nhttp://*:80/owa/auth/sslauth/\n\n\nThe request body should contain three values, one of which is equal to the keyword specified in\nthe configuration received as input. The related value should be encoded with base64 and\nencrypted with AES, using a predefined key. The resulting string will contain three values\ndelimited by the comma character: the first value is another AES key that is used to decrypt the\n\n\n-----\n\nother POST values, the second is the name of the variable that contains the C# source code,\nand the third contains the name of the variable that contains the arguments and the list of\nassembly references that should be added to the compiled project.\n\nOnce compiled, the backdoor tries to invoke a method named “run” from a class named “core”\nthat should be included in the received program. The invoked method receives two arguments as\ninput:\n\nThe first one is a dictionary containing a key named “samurai” holding the current working\ndirectory path as a value.\nThe second is a value provided by the attacker in the third element of the POST request.\n\nIf the request is valid and the code is successfully executed, the backdoor replies with an HTTP\n200 code, including the result generated by the invoked .NET assembly in the response body.\nThe message will be encrypted with AES using the session key and it will be encoded with\nBase64.\n\n### Uploaded modules\n\nDuring our investigation, we were able to discover some modules uploaded by the attackers and\ncompiled by the Samurai backdoor:\n\n**Module** **Description**\n\n\nRemote\nCommand\n\nFile\nenumerator\n\n\nExecute arbitrary commands using the Windows command line, cmd.exe.\n\nGet a list of files and directories in a specific path provided by the attacker\nas an argument.\n\n\nFile exfiltration Download arbitrary files from the compromised machines.\n\nProxy Connect Start a connection to a remote IP address and TCP port specified in the\ncode.\n\nProxy Handler Forward the payload received with HTTP request to the remote IP address\nand vice versa.\n\nIt is worth mentioning the arguments passed to the modules, which in some cases are structures\nwith specific formats. All modules must contain a “run” method, which expects two arguments, a\ndictionary that contains the “samurai” keyword with the current working directory, and a string\nprovided by the attacker. The string should include values separated by the semi-colon character\n(“;”).\n\nFor example, the following is a valid string for the Remote Command module:\n\n1 Y21kLmV4ZQ==;ZGlyICVNQUxESVIlXCoubXdy;TUFMRElSPUM6XE1hbGRpcg==\n\n\n-----\n\nThe string contains three different fields, and each of them is encoded with base64. The decoded\nvalue for this example is the following:\n\n1 cmd.exe;dir %MALDIR%\\*.mwr;MALDIR=C:\\Maldir\n\nThe first value is the program that will be executed, the second one is the argument that will be\npassed to the new process and the last one is an environment variable.\n\nThe cumbersome administration of the Samurai backdoor using arguments in this structure\nsuggests that the Samurai backdoor is the server-side component of a bigger solution that\nincludes at least another client component providing an interface for the operators that can be\nused to automatically upload some predefined modules.\n\nFurther evidence that enhances this hypothesis is related to the proxy modules, two different C#\nprograms developed to forward TCP packets to arbitrary hosts. The attacker uses these modules\nto start a connection between a running instance of a Samurai backdoor and a remote host and\nforward the packets using the backdoor as a proxy. It is probably used to move laterally inside\nthe compromised network. Most of the detected modules were configured to communicate with\ninternal IPs on standard ports, such as: 135, 445, 389, 80 and 443.\n\nThe first program is used to initialize the connection and it embeds the remote IP and the remote\nport inside the code.\n\n**_Code snippet with the socket object creation_**\n\nWhen the connection is established, the socket object is added to the first argument received by\nthe “run” method. This argument is usually a dictionary that contains the keyword “samurai”.\n\n\n-----\n\nSo, the socket object is stored in the dictionary as the value of a unique key, whose name is\ncomposed by the word “ninja” followed by an alphanumeric unique code. The same value is then\nembedded in the second program, which is used to handle the packets.\n\n**_Code snippet of socket object handling_**\n\nIt suggests that the C# source code is probably dynamically generated by a client-side program\nthat keeps track of proxy sessions.\n\n### Ninja Trojan\n\nIn specific cases the Samurai backdoor was used to deploy another sophisticated malware that\nwe dubbed Ninja, a tool developed in C++, likely a part of an unknown post-exploitation toolkit\ndeveloped by ToddyCat.\n\nThis tool was designed to take full control of a remote system and provide the attacker with the\nability to operate deeply within the targeted network. The attacker can use a number of different\ncommands that provide the following capabilities:\n\nEnumerate and manage running processes;\nManage the file system;\nStart multiple reverse shell sessions;\nInject code in arbitrary processes;\nLoad additional modules (probably plugins) at runtime;\nProvide proxy functionalities to forward TCP packets between the C2 and a remote host.\n\nMoreover, the tool can be configured to communicate using multiple protocols and it includes\nfeatures to evade detection, camouflaging its malicious traffic inside HTTP and HTTPS requests\nthat try to appear legitimate by using popular hostname and URL path combinations. The\nconfiguration is fully customizable and is similar to other features provided by famous postexploitation tools such as Cobalt Strike and its Malleable C2 profiles.\n\nThe attacker can configure the agent to work only in specific time frames, which can be\ndynamically configured using a specific command.\n\nLast, but not least, each agent can also work as a server component that receives packets from\nother agents, parses the requests and forwards them to another predefined C2. This feature\nallows the attackers to create chains of servers and communicate with agents without a direct\n\n\n-----\n\ninternet connection. It can also be used to avoid network detections, by forwarding all malicious\ntraffic generated inside a targeted intranet through a unique node instead of generating activities\nfrom all compromised machines.\n\n**Loader**\n\nWe have never observed Ninja stored on the file system; it is usually loaded in memory by\nanother component. The loader is usually an executable file, which shares many similarities with\nthe iiswmi.dll library and Samurai installers such as the previously mentioned debug.exe.\n\nThe loader uses the same “special resolution function” to call the Windows API and decrypts the\nfile payload using 3DES (112-bit) and uncompress the decrypted data with the LZSS algorithm.\n\nThe resulting payload is a library that will be mapped in memory by the loader without the DOS\nheader and it will be invoked calling an exported function “Debug”.\n\nWe observed multiple variants, and the tool evolved during the year. The first samples lacked\nsome features, such as the ability to handle multiple sessions on the client side and the ability to\ncommunicate with HTTP and HTTPS protocols. The embedded configuration structure was also\na little different.\n\nIn this article we are going to describe the last detected version.\n\n**Config**\n\nThe malware starts operations by retrieving configuration parameters from an encrypted payload\nembedded in the binary, which is XORed with the constant value “0xAA” and compressed with\nthe LZSS algorithm.\n\nThe analyzed configuration contains a list of 15 elements with the following values:\n\n**Parameter** **Description**\n\n\n2B847033-C95F-92E3-D84729C6AE934CDC\n\n\nMutex name used to guarantee atomic execution.\n\n\nC2_INFO A structure that contains the information to\ncommunicate with the C2 servers.\n\n/Collector/3.0/ URL path used with HTTP and HTTPS protocols.\n\n\nContent-Type: application/x-www-formurlencoded\n\n\nHTTP header used with HTTP and HTTPS\nprotocols.\n\n\nHost: mobile.pipe.microsoft.com:8080 HTTP header used with HTTP and HTTPS\nprotocols.\n\n\nMozilla/5.0 (Windows NT 6.3;\nTrident/7.0; rv 11.0) like Gecko\n\n\nUser-Agent used with HTTP and HTTPS protocols.\n\n\n-----\n\n0 Working hour Start.\n\n0 Working minute Start.\n\n0 Working second Start.\n\n0 Working hour Stop.\n\n0 Working minute Stop.\n\n0 Working second Stop.\n\n0 TCP C2 communication interval.\n\n300 HTTP C2 communication interval.\n\n0 Local Server port.\n\nThe first element is the mutex name, which could be any string, but usually looks like a GUID\nvalue. C2_INFO is a string that contains multiple values organized with a specific structure.\n\n**HTTP config**\n\nThe attacker can also customize the HTTP URL path and headers to mimic legitimate services\nand hide malicious traffic. The specific values in the example will generate requests like the\nfollowing.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n\nPOST /Collector/3.0/ HTTP/1.1\n\nContent-Type: application/x-www-form-urlencoded\n\nHost: mobile.pipe.microsoft.com:8080\n\nUser-Agent: Mozilla/5.0 (Windows NT 6.3; Trident/7.0; rv 11.0) like Gecko\n\nContent-Length: 430\n\nCache-Control: no-cache\n\n\nWe may infer that the attacker was trying to emulate Microsoft Teams behavior, although the\n“User-Agent” and the “Host” headers are incorrect.\n\n**C2 Info**\n\nThe C2_INFO contains multiple information items specified with the following format:\n\n1 %Protocol% \\r %C2_Hostname% \\r %C2_Port% \\r %Proxy_Type% \\r Proxy_Info\n\nThe protocol is a numeric value that identify the communication protocol:\n\n\n-----\n\n1. HTTP\n2. HTTPS\n3. TCP\n\nThe C2 hostname and port are self-explanatory.\n\nThe “Proxy_Type” is another integer that can have three different values:\n\n1. No Proxy. Connect to the C2 directly\n2. System Proxy\n3. Manual Proxy\n\nWhen the value is equal to “3”, the agent will try to decode a base64 string embedded in\n“Proxy_Info” that contains different information, according to the specified protocol. When the\nprotocol is HTTP or HTTPS, the following information must be specified:\n\n1 %Proxy_Address% : %Proxy_Port% \\t %Proxy Username% \\t %Proxy_Password%\n\nIf the protocol is TCP, the decoded strings could specify a proxy chain with up to 255 hops.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n\n%Proxy_Address% \\t %Proxy_Port% \\t %Remote_Host% \\t %Remote_Port% \\r\n\n%Proxy_Address% \\t %Proxy_Port% \\t %Remote_Host% \\t %Remote_Port% \\r\n\n%Proxy_Address% \\t %Proxy_Port% \\t %Remote_Host% \\t %Remote_Port% \\r\n\n%Proxy_Address% \\t %Proxy_Port% \\t %Remote_Host% \\t %Remote_Port% \\r\n\n... up to 255\n\n\nThe information will be used by the agent to initialize the connection with the C2.\n\n**Working time config**\n\nThe Ninja agent includes an interesting ‘working time’ feature that can be used to force the\nmalware to work only within a specific time frame. For example, it could configure the malware to\nwork only from 9am to 6pm, during typical working hours. This feature is useful to avoid being\ndetected by specific security solutions such as behavior-based intrusion detection systems.\nWhen the values are equal to zero, the feature is disabled and the agent works at any time. The\nattacker can remotely configure these options with a specific command.\n\n\n-----\n\n**Local server**\n\nThe last value is the local server port. When the local server feature is enabled, the agent acts as\nthe C2. It waits for agent connections, decodes the received requests and forwards them to the\nremote C2. This feature is probably used for ‘pivoting’ and accessing other internal systems from\nthe compromised machine. Also, this value can be modified by the attacker with a specific\ncommand.\n\n**Communication protocol**\n\nMalware communications are protected with a sequence of encryption and encoding algorithms,\nwith small differences between the HTTP and TCP protocols.\n\nBoth protocols use a message format as follows:\n\n1 Message_ID@Message_payload\n\nThe “Message_ID” changes according to the command type and the “Message_payload”\ncontains the real payload compressed, XORed with the static value 0x3F and encoded with\nbase64 algorithm using a custom alphabet.\n\nThe resulting message is then encrypted with AES 256 using a session key generated by\nselecting two random characters from the custom base64 alphabet. The agent will use random\ncharacters to generate a SHA1 hash, which will be used for the AES encryption.\n\nThe encrypted data is then encoded again using the base64 algorithm and the resulting string is\nappended to the previously generated random character to allow the server to decrypt the\ninformation.\n\nWhen the agent is configured to use the HTTP/S protocol, the data are included in standard\nPOST requests.\n\nIf the C2 communicates using the TCP protocol, the agent will send a first packet with the\nconstant value 0x6CC8DF01 and then other packets with the generated payload. The server\nshould reply with a packet with the same constant value 0x6CC8DF01 and then with other\npackets encrypted with the same algorithms. The constant value is not always the same, but\nchanges according to the variant.\n\nThe first message is sent using the “Message_ID” 10001 and it contains information about the\ninfected system and the agent configuration.\n\nSystem info (collected with Kernel32.GetNativeSystemInfo function)\nOS info (collected with Ntdll.RtlGetVersion function)\nComputer name\nLocal IP address\nAgent file path\n\n\n-----\n\nAgent PID\nAgent Sleep Time\nAgent C2 configuration (C2 hostname, Port, Proxy Info)\n\n**Commands**\n\nThe server response usually has the following structure:\n\nMagic constant 0x887766\nNumber of commands\nList of commands\n\nThe “Magic constant” is an integer, the value of which changes according to the variants. The list\nof commands is an array, and for each element the attacker could specify:\n\nCommandID\nArguments Size\nArguments\n\nThe argument values change according to the “CommandID”, but usually they are strings with\nmultiple values divided by the ‘*’ character.\n\n**Command ID** **Description** **Response ID**\n\n20000 Enable Session\n\n20001 Disable Session\n\n20002 Update sleep time\n\n20003 Kill Bot\n\n20004 Execute program as user\n\n20005 Set Local Server Port\n\n20006 Safe Exit\n\n20010 Shell::Start new session 30010\n\n20011 Shell::Handle Command 30011\n\n20012 Shell::Close Session 30012\n\n20013 Shell::Terminate Session Tree 30013\n\n20020 File::Get Drives list 30020\n\n20021 File::Get Directory content 30021\n\n20022 File::Create directory 30022\n\n\n-----\n\n20023 File::Delete file 30023\n\n20024 File::Remove directory 30024\n\n20025 File::Move file 30025\n\n20026 File::Change Create\\Last access\\Last write Time 30026\n\n20030 File::Read file 30030\n\n20031 File::Write file 30031\n\n20040 Proxy::Start Session 30040\n\n20041 Proxy::Set socket as writeable 30041\n\n20042 Proxy::Send Data 30042\n\n20043 Proxy::Receive Data 30043\n\n20044 Proxy::Close Session 30044\n\n20045 Proxy::Reconnect 30045\n\n20050 Enumerate Processes (filename|pid|number of threads) 30050\n\n20051 Kill a list of processes\n\n20052 Process Injection 30052\n\n20053 Plugin::Load 30053\n\n20054 Plugin::Read Output 30054\n\n20055 Plugin::Unload 30055\n\n20056 Enumerate Processes (SessionID\\PID\\Domain\\Username) 30056\n\n20060 Injection::Start new session 30060\n\n20061 Injection::List active sessions 30061\n\n20062 Injection::Close session 30062\n\n20064 Injection::Inject code in a new process 30064\n\n20065 Injection::Read “pobject” 30065\n\n20068 Injection::Read “create_object” 30068\n\n21000 Configure Working Time 31000\n\nSome commands are self-explanatory, others aren’t, and in some cases we are unable to fully\nunderstand them since we are still missing some information.\n\n\n-----\n\nThe Enable and Disable session commands are used to activate or deactivate the Agent. The\nattacker should enable the bot before sending any other commands, which will be dropped by\ndeactivated bots. The Enable command is also mandatory to enable the “Local server” feature.\n\nThe Shell, Proxy and Injection commands were designed to run multiple parallel sessions, which\nprobably means that multiple operators can work on the target machine simultaneously. The\nagent manages three structures, one for the Shell, one for the Proxy and the last one for the\nInjection commands.\n\nFor example, when the attacker wants to start a shell, they must use the command “20010” that\nwill force the agent to create a new process and new pipes used to redirect the standard input\nand the standard output. The “Shell session ID” must be specified by the attacker and this value\nwill be stored in the local array, which contains the list of active sessions. If the command\nsucceeds, the agent will reply with a list of information like new PID and pipe handles.\n\nThe command 20011 can be used to read or write data in the pipes. The attacker has to provide\na valid “Shell session id”, an event ID and the pipe handles. Before processing the command, the\nagent will check if the provided ID is valid, by comparing the values with those in the local\nstructure.\n\nThe command 20012 is used to close an active session, remove the “Session_ID” from the local\narray, terminate the running process and close the pipe handles. A similar logic is used to\nmanage the Proxy commands, which can be used to forward packets to other remote hosts using\nthe TCP protocol.\n\nThe Plugin commands are used to load other unknown libraries in the agent process address\nspace. We don’t have information about the other modules, but we presume they are additional\nplugins that can be used by the attacker to provide more features.\n\nBased on static analysis we know the libraries should export at least three functions: GET, RUN\nand CLOSE; and then share data with the main process by using a file mapping object.\n\nThe “Process Injection” (20052) command and the “Injection” set of commands could cause\nsome confusion, but they are quite different. The first one is used to inject arbitrary shellcode in a\nrunning process. The second is used to inject another agent module in a new process specified\nby the attack. The injected code is not an arbitrary shellcode, but something that should\ncommunicate with the main agent by using specific file mapping objects.\n\nThe attacker uses command 20060 to start a new injection session, where the attacker basically\nprovides the shellcode that will be injected in a new program, and whose path will be specified\nwith command 20064.\n\nThe “Injection::Inject code in a new process” command will force the agent to start a program\nspecified by the attacker. The specified program will be created as suspended and the agent will\nwrite the shellcode in a new section allocated in the created process.\n\n\n-----\n\nThe agent then gets the remote thread s context to obtain the instruction pointer address and\nreplace the instruction in that offset with the following:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n\ndec eax\n\nsub esp, 40h\n\ndec eax\n\nmov eax, %SHELLCODE_ADDRESS%\n\ncall eax\n\n\nFinally, the code will resume the remote process, which will execute the injected code.\n\nThe commands 20065 and 20068 are then used to read data from the file mapping objects,\nwhich should contain information generated by the injected code.\n\n## Other campaigns and variants\n\n### Other variants\n\nDuring our investigations, we discovered several loader and installer variants that evolved during\n2021 and were used in different campaigns.\n\n**Installers**\n\nAll the installers are quite similar in their logic: they load a payload from an external file, usually\nlocated in the same directory, with a name that differs according to the variant:\n\ndebug.xml\nweb.xml\naccess.log\ncache.dat\nreg.txt\nlogo.jpg\n\nThe files are always decrypted with the same algorithm, CALG_3DES_112, but the loaded data\nare usually tailored for the victim.\n\nAll installers create a new service using a name and description specified in an encrypted file.\nThey also set a registry value (either httpsvc or w3esvc) in the following Windows registry key:\n\n1 HKLM\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\SvcHost\n\n\n-----\n\nThese values cause svchost.exe to automatically start the malicious service and load the code in\nits process address memory. The registry values contain the malicious service name. The main\ndifference between the installer variants is related to the final payload. Based on initial\ninvestigations, we know that the first variants (from December 2020 to May 2021) were\nconfigured to store their payload inside a registry key, such as:\n\n\n1\n\n2\n\n\n$HKLM\\SOFTWARE\\Classes\\Interface\\{6FD0637B-85C6-D3A9-CCE9-65A3F73ADED9}\n\n$HKLM\\SOFTWARE\\Classes\\Interface\\{AFDB6869-CAFA-25D2-C0E0-09B80690F21D}\n\n\nStarting from March we also observed new variants configured to store the final backdoor inside\nother encrypted files in the file system. The most common dropped the Stage 2 loader in the\nfollowing paths:\n\n%System32%\\Triedit.dll\n%System32%\\fveapi.dll\n\nand the Stage 3 loader and encrypted payload in the following paths:\n\n%WINDIR%\\Microsoft.NET\\Framework\\sbs_clrhost.dll\n%WINDIR%\\Microsoft.NET\\Framework\\sbs_clrhost.dat\n%WINDIR%\\Microsoft.NET\\Framework\\Util.dll\n%WINDIR%\\Microsoft.NET\\Framework\\Util.dat\n\nStarting from September 2021, we observed new samples configured to once again store the\nfinal payload in the Windows registry, but instead of relying on static registry key values, the\nmalware was configured to create a dynamically generated key in\n$HKLM\\SOFTWARE\\Classes\\Interface\\, based on the disk drive’s serial number:\n\n\n-----\n\n**_Code snippet to create a registry key based on the Volume Serial Number_**\n\nThe constants used to generate the final registry key name change for each sample.\n\n**Loaders**\n\nThe loaders are basic tools used to decrypt payloads from 3DES and load them into memory.\nThey were modified over time along with the installers to account for the changes in how the final\npayload is stored.\n\nSome loaders, like those mentioned in the previous paragraph, were configured to load another\npayload from an encrypted file and pass the resulting data as arguments for another library, a\nStage 3 loader, stored in a specific location.\n\nOther loaders were configured to load the payload from the registry and pass it to the Stage 3\nlibrary.\n\nSome variants included a function to directly run .NET code at runtime, without relying on\nanother external Stage 3 library.\n\nFinally, we observed other loaders that were mainly used on desktop systems to load the Ninja\nTrojan.\n\n### Other attacks against Desktop systems\n\nThe first waves of attacks exclusively targeted Microsoft Exchange servers, but starting from\nSeptember 2021, we also observed a new set of loaders detected on desktop systems in Central\nAsia with filenames such as “01.09.2021 г..exe”, “03.09.2021 г.exe”, “нота мид кр\nрегламент.exe” and “Тех.Инструкции.exe”.\n\nThe files were loaders configured to run the Ninja component, but they were distributed as\nexecutable files embedded in zip archives and sent through the popular messaging app\nTelegram.\n\nThe programs were configured to load a payload from another file, “license.txt”, which should be\nlocated in the same directory. The malware then uses the previously described “special\nresolution function” to call the Windows API and decrypts the file payload using 3DES (112)-bit\nand uncompresses the decrypted data.\n\nThe resulting payload is the Ninja library that will be mapped in memory by the loader without the\nDOS header and it will be invoked calling an exported function “Debug”.\n\n## How to detect the Samurai backdoor\n\nThe whole infection scheme used to deploy and guarantee Samurai persistence, was designed\nto avoid forensic analysis and the most common superficial checks.\n\n\n-----\n\nAs we said, the malicious code is loaded by the legitimate svchosts.exe process, which means\nthat the backdoor cannot be detected with a simple process enumeration.\n\nMoreover, the backdoor cannot be spotted by watching the open TCP ports, because it uses the\n.NET HTTPListener class, which is built on top of HTTP.sys and allows different processes to\nshare the same ports. In the case of the Samurai backdoor, it uses ports 80 or 443, which are\nalso used by Microsoft Exchange.\n\nWe detect this backdoor as “HEUR:Backdoor.MSIL.Samurai.gen”, but in the absurd case that\nyou are not using our products, a simple way to check if the backdoor is running is to try to find\none of the IoCs shared in this blogpost or trying to execute the following command:\n\n1 #>netsh http show servicestate verbose=yes\n\nAs [described by Microsoft, this command will display a snapshot of the HTTP service, and you](https://docs.microsoft.com/en-us/windows-server/networking/technologies/netsh/netsh-http#show-servicestate)\ncan try to find suspicious registered URLs such as the following:\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n\nServer session ID: ED00000020000013\n\nVersion: 2.0\n\nState: Active\n\nProperties:\n\n...\n\nMax bandwidth: inherited\n\nMax connections: inherited\n\nTimeouts:\n\nTimeout values inherited\n\nNumber of registered URLs: 2\n\nRegistered URLs:\n\nHTTP://*:80/OWA/AUTH/TOKEN/\n\nHTTPS://*:443/OWA/AUTH/TOKEN/\n\n\n## Victims\n\nBased on our visibility we know that ToddyCat focused its attention on high-profile targets; most\nof them were government organizations and military entities, as well as military contractors.\n\n\n-----\n\nWe know the attacks launched before February 2021 targeted a very limited number of\ngovernment entities in:\n\nTaiwan\nVietnam\n\nAfter the ProxyLogon publication the number of detections rapidly increased around the world,\nand we also observed victims in the following countries:\n\nAfghanistan\nIndia\nIran\nMalaysia\nPakistan\nRussia\nSlovakia\nThailand\nUnited Kingdom\n\nAfter May 2021, we observed other variants and campaigns that we attributed to the same group\nand affected most of the previously mentioned countries in Asia and the following:\n\nKyrgyzstan\nUzbekistan\nIndonesia\n\n\n-----\n\n**_Overall affected victims map_**\n\n## Attribution\n\nUnfortunately, we were not able to attribute the attacks to a known APT group; and for this\nreason we dubbed this entity ToddyCat.\n\nDuring our investigations we noticed that ToddyCat victims are related to countries and sectors\nusually targeted by multiple Chinese-speaking groups. In fact, we observed three different highprofile organizations compromised during a similar time frame by ToddyCat and another\nChinese-speaking APT group that used the FunnyDream backdoor.\n\nThis overlap caught our attention, since the ToddyCat malware cluster is rarely seen as per our\ntelemetry; and we observed the same targets compromised by both APTs in three different\ncountries. Moreover, in all the cases there was a proximity in the staging locations and in one\ncase they used the same directory.\n\n**Target 1**\n\nC:\\ProgramData\\Microsoft\\DRM\\rundll.dll – FunnyDream related\n\nC:\\ProgramData\\Microsoft\\mf\\svchost.dll – ToddyCat\n\n**Target 2**\n\nC:\\ProgramData\\adobe\\avps.exe – FunnyDream related\n\nC:\\ProgramData\\adobe\\2.dll – ToddyCat\n\nDespite the overlap, we do not feel confident merging ToddyCat with the FunnyDream cluster at\nthe moment. Considering the high-profile nature of all the victims we discovered, it is likely they\nwere of interest to several APT groups. Moreover, despite the occasional proximity in staging\nlocations, we have no concrete evidence of the two malware families directly interacting (for\ninstance, one deploying the other), and the specific directories are frequently used by multiple\nattackers.\n\n## Conclusions\n\nToddyCat is a sophisticated APT group that uses multiple techniques to avoid detection and\nthereby keeps a low profile. During our investigations we discovered dozens of samples, but\ndespite the number of files and the duration of their activities, we were unable to attribute the\nattacks to a known group; and there is also quite a bit of technical information about the\noperations that we don’t have.\n\nThe affected organizations, both governmental and military, show that this group is focused on\nvery high-profile targets and is probably used to achieve critical goals, likely related to\ngeopolitical interests.\n\n\n-----\n\nBased on our telemetry, the group shows a strong interest in targets in Southeast Asia, but their\nactivities also impact targets in the rest of Asia and Europe.\n\nWe’ll continue to monitor this group and keep you updated.\n\nMore information, IoCs and YARA rules about ToddyCat are available to customers of the\n[Kaspersky Intelligence Reporting Service. Contact: intelreports@kaspersky.com.](http://10.10.0.46/mailto:intelreports@kaspersky.com)\n\n## ToddyCat’s indicators of compromise\n\n[5cfdb7340316abc5586448842c52aabc Dropper google.log](https://opentip.kaspersky.com/5cfdb7340316abc5586448842c52aabc/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[93c186c33e4bbe2abdcc6dfea86fbbff Dropper](https://opentip.kaspersky.com/93c186c33e4bbe2abdcc6dfea86fbbff/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[5a912beec77d465fc2a27f0ce9b4052b Dll Loader Stage 2 iiswmi.dll](https://opentip.kaspersky.com/5a912beec77d465fc2a27f0ce9b4052b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[f595edf293af9b5b83c5ffc2e4c0f14b Dll Loader Stage 3 websvc.dll](https://opentip.kaspersky.com/f595edf293af9b5b83c5ffc2e4c0f14b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[5a531f237b8723396bcfd7c24885177f Dll Loader Stage 2 fveapi.dll](https://opentip.kaspersky.com/5a531f237b8723396bcfd7c24885177f/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[1ad6dccb520893b3831a9cfe94786b82 Dll Loader Stage 2 fveapi.dll](https://opentip.kaspersky.com/1ad6dccb520893b3831a9cfe94786b82/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[f595edf293af9b5b83c5ffc2e4c0f14b Dll Loader Stage 3 sbs_clrhost.dll](https://opentip.kaspersky.com/f595edf293af9b5b83c5ffc2e4c0f14b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[8a00d23192c4441c3ee3e56acebf64b0 Samurai Backdoor](https://opentip.kaspersky.com/8a00d23192c4441c3ee3e56acebf64b0/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n5e721804f556e20bf9ddeec41ccf915d Ninja Trojan\n\n**Other variants**\n\n[33694faf25f95b4c7e81d52d82e27e7b 1.dll – Installer](https://opentip.kaspersky.com/33694faf25f95b4c7e81d52d82e27e7b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[832bb747262fed7bd45d88f28775bca6 Техинстр egov – ГЦП – Акрамов.exe – Loader](https://opentip.kaspersky.com/832bb747262fed7bd45d88f28775bca6/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[8fb70ba9b7e5038710b258976ea97c98 28.09.2021. Управление ИР и ИС.exe – Loader](https://opentip.kaspersky.com/8fb70ba9b7e5038710b258976ea97c98/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[ee881e0e8b496bb62ed0b699f63ce7a6 Loader](https://opentip.kaspersky.com/ee881e0e8b496bb62ed0b699f63ce7a6/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[ae5d2cef136ac1994b63c7f8d95c9c84 Loader](https://opentip.kaspersky.com/ae5d2cef136ac1994b63c7f8d95c9c84/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[5c3bf5d7c3a113ee495e967f236ab614 System.Core.dll – Loader](https://opentip.kaspersky.com/5c3bf5d7c3a113ee495e967f236ab614/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[bde2073dea3a0f447eeb072c7e568ee7 wabext.dll – Loader](https://opentip.kaspersky.com/bde2073dea3a0f447eeb072c7e568ee7/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[350313b5e1683429c9ffcbc0f7aebf3b rcdll.dll – Loader](https://opentip.kaspersky.com/350313b5e1683429c9ffcbc0f7aebf3b/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n**Ninja C2**\n\n[149.28.28[.]159](https://opentip.kaspersky.com/149.28.28.159/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n[eohsdnsaaojrhnqo.windowshost[.]us](https://opentip.kaspersky.com/eohsdnsaaojrhnqo.windowshost.us/?utm_source=SL&utm_medium=SL&utm_campaign=SL)\n\n**File paths**\n\nC:\\inetpub\\temp\\debug.exe\n\nC:\\Windows\\Temp\\debug.exe\n\nC:\\Windows\\Temp\\debug.xml\n\nC:\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\Temporary ASP.NET Files\\web.exe\n\nC:\\Users\\Public\\Downloads\\dw.exe\n\nC:\\Users\\Public\\Downloads\\chrome.log\nC:\\Windows\\System32\\chr.exe\n\nC:\\googleup.exe\n\nC:\\Program Files\\microsoft\\exchange server\\v15\\frontend\\httpproxy\\owa\\auth\\googleup.log\n\nC:\\google.exe\n\n\n-----\n\nC:\\Users\\Public\\Downloads\\x64.exe\nC:\\Users\\Public\\Downloads\\1.dll\n\nC:\\Program Files\\Common Files\\microsoft shared\\WMI\\iiswmi.dll\n\nC:\\Program Files\\Common Files\\microsoft shared\\Triedit\\Triedit.dll\n\nC:\\Program Files\\Common Files\\System\\websvc.dll\n\nC:\\Windows\\Microsoft.NET\\Framework\\sbs_clrhost.dll\n\nC:\\Windows\\Microsoft.NET\\Framework\\sbs_clrhost.dat\n\nC:\\Windows\\Microsoft.NET\\Framework64\\v2.0.50727\\Temporary ASP.NET Files\\web.xml\n\nC:\\Users\\Public\\Downloads\\debug.xml\n\nC:\\Users\\Public\\Downloads\\cache.dat\n\nC:\\Windows\\System32\\config\\index.dat\n\nC:\\Windows\\Microsoft.NET\\Framework\\netfx.dat\n\n%ProgramData%\\adobe\\2.dll\n\n%ProgramData%\\adobe\\acrobat.exe\n\n%ProgramData%\\git\\git.exe\n\n%ProgramData%\\intel\\mstacx.dll\n\n%ProgramData%\\microsoft\\drm\\svchost.dll\n\n%ProgramData%\\microsoft\\mf\\svchost.dll\n\n%ProgramData%\\microsoft\\mf\\svhost.dll\n\n%program files%\\Common Files\\services\\System.Core.dll\n\n%public%\\Downloads\\1.dll\n\n%public%\\Downloads\\config.dll\n\n%system%\\Triedit.dll\n\n%userprofile%\\Downloads\\Telegram Desktop\\03.09.2021 г.zip\n\n%userprofile%\\Downloads\\Telegram Desktop\\Тех.Инструкции.zip\n\n%userprofile%\\libraries\\1.dll\n\n%userprofile%\\libraries\\chrome.exe\n\n%userprofile%\\libraries\\chrome.log\n\n%userprofile%\\libraries\\config.dll\n\nC:\\intel\\2.dll\n\nC:\\intel\\86.dll\n\nC:\\intel\\x86.dll\n\n**Registry Keys**\n\n$HKLM\\System\\ControlSet\\Services\\WebUpdate\n\n$HKLM\\System\\ControlSet\\Services\\PowerService\n\n$HKLM\\SOFTWARE\\Classes\\Interface\\{6FD0637B-85C6-D3A9-CCE9-65A3F73ADED9}\n\n$HKLM\\SOFTWARE\\Classes\\Interface\\{AFDB6869-CAFA-25D2-C0E0-09B80690F21D}\n\n[APT](https://securelist.com/tag/apt/)\n[Backdoor](https://securelist.com/tag/backdoor/)\n[Dropper](https://securelist.com/tag/dropper/)\n[Encryption](https://securelist.com/tag/encryption/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n\n\n-----\n\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Microsoft Exchange](https://securelist.com/tag/microsoft-exchange/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\n[Giampaolo Dedola](https://securelist.com/author/giampaolodedola/)\n\nAPT ToddyCat\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-21 - APT ToddyCat- Unveiling an unknown APT actor attacking high-profile entities in Europe and Asia.pdf"
    ],
    "report_names": [
        "2022-06-21 - APT ToddyCat- Unveiling an unknown APT actor attacking high-profile entities in Europe and Asia.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b98eb1ec-dc8b-4aea-b112-9e485408dd14",
            "created_at": "2022-10-25T16:07:23.649308Z",
            "updated_at": "2025-03-27T02:02:09.906895Z",
            "deleted_at": null,
            "main_name": "FunnyDream",
            "aliases": [
                "Bronze Edgewood",
                "Red Hariasa",
                "TAG-16"
            ],
            "source_name": "ETDA:FunnyDream",
            "tools": [
                "Chinoxy",
                "Filepak",
                "FilepakMonitor",
                "FunnyDream",
                "Keyrecord",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Md_client",
                "PCShare",
                "ScreenCap",
                "TcpBridge",
                "Tcp_transfer",
                "ccf32"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d67df52c-a901-4d55-b287-321818500789",
            "created_at": "2024-04-24T02:00:49.591518Z",
            "updated_at": "2025-03-27T02:00:55.515052Z",
            "deleted_at": null,
            "main_name": "ToddyCat",
            "aliases": [
                "ToddyCat"
            ],
            "source_name": "MITRE:ToddyCat",
            "tools": [
                "Cobalt Strike",
                "LoFiSe",
                "China Chopper",
                "netstat",
                "Pcexter",
                "Samurai"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4c4e1108-8c11-48e3-91e3-95c24042f3a5",
            "created_at": "2022-10-25T16:07:24.329539Z",
            "updated_at": "2025-03-27T02:02:10.17315Z",
            "deleted_at": null,
            "main_name": "ToddyCat",
            "aliases": [
                "Operation Stayin’ Alive"
            ],
            "source_name": "ETDA:ToddyCat",
            "tools": [
                "CHINACHOPPER",
                "China Chopper",
                "Cuthead",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "Krong",
                "LoFiSe",
                "Ngrok",
                "PcExter",
                "PsExec",
                "Samurai",
                "SinoChopper",
                "SoftEther VPN",
                "TomBerBil",
                "WAExp"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "60d96824-1767-4b97-a6c7-7e9527458007",
            "created_at": "2023-01-06T13:46:39.378701Z",
            "updated_at": "2025-03-27T02:00:03.068436Z",
            "deleted_at": null,
            "main_name": "ToddyCat",
            "aliases": [
                "Websiic"
            ],
            "source_name": "MISPGALAXY:ToddyCat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535843,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1656803624,
    "ts_modification_date": 1656803624,
    "files": {
        "pdf": "https://archive.orkl.eu/1f1da6cef03b7809705f3798d77b72cedf3ab78b.pdf",
        "text": "https://archive.orkl.eu/1f1da6cef03b7809705f3798d77b72cedf3ab78b.txt",
        "img": "https://archive.orkl.eu/1f1da6cef03b7809705f3798d77b72cedf3ab78b.jpg"
    }
}