{
    "id": "9acd3992-0582-4c6b-add7-8e9e8461a9e0",
    "created_at": "2023-01-12T15:06:58.97235Z",
    "updated_at": "2025-03-27T02:13:08.204181Z",
    "deleted_at": null,
    "sha1_hash": "08490845a0532020867e2b1ab99698bcfd005b95",
    "title": "2022-03-07 - 2021 Year In Review",
    "authors": "",
    "file_creation_date": "2022-05-28T18:05:08Z",
    "file_modification_date": "2022-05-28T18:05:08Z",
    "file_size": 3416820,
    "plain_text": "# 2021 Year In Review\n\n**thedfirreport.com/2022/03/07/2021-year-in-review/**\n\nMarch 7, 2022\n\nAs we come to the end of the first quarter of 2022, we want to take some time to look back\nover our cases from 2021, in aggregate, and look at some of the top tactics, techniques and\nprocedures (TTP’s) we observed. In total, we reported on 20 incidents in 2021, the vast\nmajority were initial access broker malware (Trickbot, IcedID, BazarLoader, etc.), which often\nlead to full domain compromise and ransomware.\n\nThis report will contain details from all of our public reports over 2021, this is not\ncomprehensive of overall threat actor activity, as there is always inherit sampling and\ncollection bias. However, reviewing these common activities can help a defender prioritize\ntheir time and budget, to protect against some of the most common threat actor behaviors.\n\n### Shout out to our analysts who put this report together!\n\n[Report lead @kostastsale](https://twitter.com/Kostastsale)\n\n[Contributing analysts @ICSNick,](https://twitter.com/IcsNick) [@yatinwad,](https://twitter.com/yatinwad) [@_pete_0 and 1 unnamed contributor](https://twitter.com/_pete_0)\n\n### Services\n\n\n-----\n\n[We offer multiple services including a Threat Feed service which tracks Command and](https://thedfirreport.com/services/)\nControl frameworks such as Cobalt Strike, Metasploit, Empire, PoshC2, etc. More\n[information on this service and others can be found here.](https://thedfirreport.com/services/)\n\nWe also have artifacts available from our cases such as pcaps, memory captures, files,\nevent logs including Sysmon, Kape packages, and more, under our Security Researcher and\nOrganization services.\n\n## Intrusion statistics aligned to the MITRE ATT&CK framework\n\n### Initial Access\n\nOver the last year, we have witnessed numerous intrusions where malware variants such as\nTrickbot, Hancitor, Bazar, and IcedID have been utilized as an entry point for ransomware\nattacks. In the majority of the intrusions, the malware was distributed in the form of nontargeted phishing, such as mass malware spam campaigns.\n\nInitial Access Sources 2021.\n\nOur reports tend to focus on instances where phishing is the initial vector, as was the case in\n16 of 20 reports. Although we still experience cases of threat actors compromising\nvulnerable web-facing applications those cases do not always turn into a large-scale\n\n\n-----\n\nintrusion.. Our report on [Exchange Exploit Leads to Domain Wide Ransomware, was the](https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/)\nonly case where the threat actors actively sought to deploy ransomware after getting access\n[through a vulnerable application. The other two cases (All that for a Coinminer? and](https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer/)\n[WebLogic RCE Leads to XMRig) are a good representation of less impactful malicious](https://thedfirreport.com/2021/06/03/weblogic-rce-leads-to-xmrig/)\nactivity, where the threat actors installed cryptominers. However, we believe that these\nintrusions can signal vulnerabilities that need immediate patching and remediation before\nbeing exploited by a threat actor seeking larger scale objectives.\n\nPhishing was the main initial access vector for our cases in 2021. The malware vectors we\nsaw in 2021 were:\n\n[1. TrickBot](https://thedfirreport.com/category/trickbot/)\n[2. Bazar](https://thedfirreport.com/category/bazar/)\n[3. IcedID](https://thedfirreport.com/category/icedid/)\n[4. Hancitor](https://thedfirreport.com/category/hancitor/)\n\nThe below graphic displays the tools/methods used by threat actors after getting initial\naccess via the initial access malware listed above.\n\n### Persistence\n\nAfter execution of the initial access malware, many threat actors deploy persistence\nmechanisms, such as the creation of scheduled tasks, deployment of web shells, remote\naccess software and registry “Run” Keys\n\n\n-----\n\n[Scheduled Task Example (reference)](https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/)\n\n[Add New User Example (reference)](https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/)\n\n[Registry Run Key Example (reference)](https://thedfirreport.com/2021/06/03/weblogic-rce-leads-to-xmrig/)\n\nIn 14 of 20 cases, persistence was observed. Scheduled tasks were the most common\npersistence method observed in our intrusions. In most, if not all cases, scheduled tasks,\nbits-jobs, and registry run keys were executed from the initial malware vector. When we look\nat the later stages of the attack, during post-exploitation activities, we can see that the threat\nactors favor new user additions and third-party remote access software as the main\npersistence techniques.\n\n\n-----\n\nIn some cases, we did not observe any typical form of persistence during the entire intrusion.\nHowever, we found that these threat actors seem to prefer to broaden their access\nthroughout the network by launching several Cobalt Strike beacon sessions. In this way, they\ncan maintain their presence even if one or more compromised workstations become\ninaccessible. Servers are often chosen during this beacon deployment phase, which is more\nlikely to remain online compared to a typical workstation.\n\nAnother common method observed to maintain access is by installing third-party remote\naccess software such as AnyDesk, TeamViewer, Splashtop and Atera. An interesting\nobservation is that the majority of this activity occurred on compromised domain controllers.\n\n[Here’s an example from the Conti Leaks that show the process of how they install AnyDesk:](https://twitter.com/TheDFIRReport/status/1498642505646149634)\n\n\"Anydesk\"\n\ncmd.exe /c C:ProgramDataAnyDesk.exe –install C:ProgramDataAnyDesk –start-withwin –silent\n\n\"And then we log in with a local admin or a domain account and use the charms of\nAnydesk\n\n[You can also download / upload to / from the victim's machine…\"#ContiLeaks](https://twitter.com/hashtag/ContiLeaks?src=hash&ref_src=twsrc%5Etfw)\n[pic.twitter.com/2nUm0XdLMW](https://t.co/2nUm0XdLMW)\n\n[— The DFIR Report (@TheDFIRReport) March 1, 2022](https://twitter.com/TheDFIRReport/status/1498672358843953152?ref_src=twsrc%5Etfw)\n\n[This AnyDesk activity was also observed in our Diavol Ransomware case.](https://thedfirreport.com/2021/12/13/diavol-ransomware/)\n\n\n-----\n\n### Privilege Escalation/Credential Access\n\nWith respect to credential access, multiple techniques were utilized by the threat actors.\nSome of the notable ones are: Dumping of LSASS using Task Manager and Procdump,\ncreation of a copy of NTDS.dit using ntdsutil.exe and extraction of SAM, SECURITY and\nSYSTEM hives.\n\nDepending on the level of access, threat actors are looking to escalate privileges on the\nbeachhead host to leverage high integrity Beacon sessions. Having high integrity access\nallows them to access credentials from the host using various methods. Below, we highlight\nthe privilege escalation and credential access methods observed across our 2021 reports.\n\n\n-----\n\nAccessing the LSASS process is the method that we see used by threat actors in the\nmajority of the cases. Using Cobalt Strike, attackers can extract credentials from the LSASS\nprocess either with the use of Mimikatz or by accessing the security hives. We covered\n[related detections in our Cobalt Strike, a Defender’s Guide.](https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/)\n\nThreat actors can also use third-party tools such as ProcDump or even Task Manager in\ncases where remote interactive access is possible. These methods allow them to dump the\nLSASS process to disk and take it offline to extract the credentials.\n\n[ProcDump Example (reference)](https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/)\n\n[Task Manager Example (reference)](https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/)\n\n\n-----\n\n### Defense Evasion\n\nWhen it comes to defense evasion, we noticed that process injection techniques were very\ncommon among threat actors. This allows them to establish additional Beacons on the\nalready compromised hosts, to avoid detection.\n\nIn five separate cases, we encountered threat actors disabling security tools using various\nmethods. One of the most notable cases was the IcedID to XingLocker Ransomware in 24\nhours case. In that case, the attackers used multiple batch files to disable well-known AV and\nEDR agents on the host. The batch scripts came from the first revision of Revisions · quickdisable-windows-defender.bat · GitHub, which was used by the ransomware operators\nwithout making any changes.\n\n\n-----\n\n[Masquerading Example (reference)](https://thedfirreport.com/2021/11/15/exchange-exploit-leads-to-domain-wide-ransomware/)\n\n[Obfuscation Example (reference)](https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/)\n\n### Discovery\n\nOnce access is established, threat actors then need to enumerate the victim environment.\nCommon initial discovery tools include Windows built-in utilities (net.exe, nltest.exe,\n[systeminfo, ipconfig, whoami, etc) and the AdFind tool. In a few cases, adversaries](https://www.joeware.net/freetools/tools/adfind/)\nattempted to get a listing of open ports/running services on remote hosts by performing port\nscans using tools such as Advanced IP Scanner and KPortScan 3.0.\n\nThe first thing we observe from hands-on keyboard operators is usually additional discovery\nactivity. We see threat actors concentrate on searching for the Domain Controllers and\ngeneral environmental information.\n\nThe statistics below illustrate the most used Windows tools for enumerating the environment.\nWe compare each tool to the total percent of cases investigated.\n\n\n-----\n\nWe see the enumeration commands executed in a short time span, between 1-5 seconds.\nThe execution is usually done through post-exploitation frameworks (Cobalt Strike in most\ncases).\n\n_[Example screenshot is taken from the case: From Zero to Domain Admin](https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/)_\n```\nC:\\Windows\\system32\\cmd.exe /C net time \nC:\\Windows\\system32\\cmd.exe /C ping [Domain Controller] \nC:\\Windows\\system32\\cmd.exe /C nltest /dclist:[Domain Name] \nC:\\Windows\\system32\\cmd.exe /C Net group \"Domain Admins\" /domain \\\nC:\\Windows\\system32\\cmd.exe /C nslookup \nC:\\Windows\\system32\\cmd.exe /C ping 190.114.254.116 \nC:\\Windows\\system32\\cmd.exe /C net group /domain\n\n### Lateral Movement\n\n```\nLateral movement is a vital component of threat actor TTPs. Once they get the lay of the\nland through the discovery methods we outlined above, we repeatedly see them move\nlaterally across the network. Domain Controllers, file shares and similarly high-value servers\nare primary targets.\n\n\n-----\n\nThe number one post-exploitation framework of choice, Cobalt Strike, allows threat actors to\nleverage different techniques for the purpose of lateral movement.\n\nOther common choices for threat attackers include Remote Desktop connections, remote\nWMI execution of transferred binaries, and the Sysinternals tool PsExec.\n\n(updated 3/7/22 @ 1330 UTC)\n\n[WMIC Lateral Movement Example (reference)](https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/)\n\n[Psexec Example (reference)](https://thedfirreport.com/2021/05/12/conti-ransomware/)\n\n\n-----\n\n### Command and Control\n\nOne common theme seen across the majority of the intrusions has been the reliance on\nCobalt Strike for performing post-exploitation activities. In almost all cases, the initial access\nbrokers such as Trickbot and Bazar, dropped multiple Cobalt Strike beacons across the\nvictim environment.\n\nFor an in-depth breakdown of some of the network operations of Cobalt Strike see our recent\nreport on the topic.\n\n### Exfiltration\n\nWhile exfiltration of data was not a common sight in our data set, we observed exfil in 6 of\nthe 20 cases. In the cases where data exfiltration was observed, the threat actors used tools\nsuch as RClone, FileZilla, or WinSCP to transfer the data to their controlled servers. In many\nother cases, threat actors downloaded sensitive data via Cobalt Strike Beacons.\n\n[One notable case for the year was the Diavol Ransomware. Ransomware operators used](https://thedfirreport.com/2021/12/13/diavol-ransomware/)\n[ufile.io to upload the LSASS dump file they extracted from one of the domain controllers.](http://ufile.io/)\n\n\n-----\n\nTo wrap up this chapter, we’d like to provide an overview of the tools that we’ve seen\nattackers employ this year. We included the tools in their respective phases of attack after\nseeing them in action. We used the MITRE ATT&CK framework to show how these tools\nwork at various phases of an attack.\n\n## Indicators of Attack/Behavior-based information focusing on the human element\n\n\n-----\n\nIn our cases, we frequently observe hands-on keyboard activity by the threat actor during the\nintrusion. This provides a unique insight into the human side of the attack – how they\nconduct operations, respond to challenges, and how they use the tooling to achieve effects.\nThis provides additional detection opportunities – in addition to Indicators of Compromise\n(IoC) and Indicators of Activity (IoA).\n\nIt is impressive to see that, in some instances, threat actors have adapted their tools,\ntechniques, and procedures (TTPs) to evade detection. In other cases, we’ve observed\noperator mistakes, errors of judgement, and operational security (OPSEC) failures. We have\nalso witnessed some of the challenges they encounter during intrusions.\n\nLooking into the early Cyber Kill Chain steps of the intrusions, we see that some tasks are\nautomated. However, once an attacker is within a target’s operating environment, many\nactivities often require hands-on keyboard intervention by the operator in order to continue\nwith their objectives. During this period, all the attacker’s hands-on keyboard activities can\nbring risk of detection or bring them one step closer to their objectives. Some of the typical\nhands-on keyboard activities include:\n\nDiscovering security audit tools\nOvercoming security tools by disabling them all together\nEncountering lateral movement barriers and seeking alternative approaches, etc.\n\nWe looked into our most popular and unusual activities related to attackers’ activities, which\nwe will discuss below, from attackers’ tooling configurations, to usage, and conduct during\nintrusions.\n\n### Cobalt Strike\n\nA common trend observed in our cases is the use of Cobalt Strike which is usually\nconfigured with a standard malleable C2 profile. A malleable C2 profile specifies a number of\nparameters, such as user agent string, spawn to process, jitter etc. Most of the default\nprofiles are well known and can be detected by host and network monitoring rules.\n\nCobalt Strike continues to be the top post-exploitation tool favored by most threat actor\ngroups, with the most popular malleable c2 profile observed this year being ‘jquery3.3.1.min.js’ with the relevant Beacon spawning under Rundll32.exe. The chart below\nillustrates the most popular spawn-as executable types and some rare ones, such as\ncalc.exe that we saw in 2021.\n\n\n-----\n\nFor further information on Cobalt Strike malleable C2 profiles and possible avenues for\ndetection, check out our second Cobalt Strike report – Cobalt Strike, a Defender’s Guide –\nPart 2.\n\n### Thou shall follow the playbook\n\nFollowing the playbook in the literal sense, copying and pasting commands are more\ncommon than expected. We have observed cases where operators kept entering misspelled\n[commands taken from documentation. In one case, we observed the operator copying and](https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/)\npasting commands from a script, neglecting to provide the actual IPv4 addresses as the\nrequired parameter:\n\nIn the case [BazarLoader and the Conti Leaks, the operator accidentally entered a Cobalt](https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/)\nStrike command via the Windows command line:\n\n[We can only assume that the operators attempted to invoke a Cobalt Strike aggressor script](https://github.com/harleyQu1nn/AggressorScripts/blob/master/AVQuery.cna)\nto enumerate and discover the installed AV. Later on, in 2021, the Conti playbooks were\nleaked, allowing us to link this activity with the operator’s hands-on keyboard-related task.\nWe were then able to reference many of the observed activities in our previous cases and\nprovide insights through our Twitter account:\n\n\n-----\n\n[This content looks VERY familiar…https://t.co/wxgeovLjE1](https://t.co/wxgeovLjE1)\n\n1. \"Initial Actions\"\n2. rclone config using Mega\n3. rclone instructions\n4.Powerview/UserHunter instructions\n\nThanks [@vxunderground!!](https://twitter.com/vxunderground?ref_src=twsrc%5Etfw) [pic.twitter.com/9Dgi8SGatG](https://t.co/9Dgi8SGatG)\n\n[— The DFIR Report (@TheDFIRReport) August 5, 2021](https://twitter.com/TheDFIRReport/status/1423361119926816776?ref_src=twsrc%5Etfw)\n\n### BYOT (Bring Your Own Tools)\n\nWe are astonished by the number of tools brought into an intrusion. Along with third-party\ntooling, living-off-the-land techniques are routinely observed – especially during the\ndiscovery phase. Bringing tools into an environment introduces several risks for the operator\nand opportunities for the defender from a detection point of view. Some of those risks include\ndetection and blocking by AV, software incompatibilities, software restriction policies, etc. As\ndiscussed in the sections above, the most popular tool observed this year is AdFind. AdFind\nis the usual suspect in almost every intrusion we report. In 2020, we published a whole\n[article covering this tool.](https://thedfirreport.com/2020/05/08/adfind-recon/)\n\nOther tools and scripts we have encountered during the past year across a number of\npublished cases are illustrated below:\n\n\n-----\n\nOccasionally, we observe threat actors making changes to their tool configurations inside the\ninfected host. Below is an example where threat actors made the necessary changes before\na successful ransomware execution.\n\n_Case:_ _[CONTInuing the Bazar Ransomware Story](https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/)_\n\n### Every Contact Leaves a Trace\n\nEvery case provides us with a range of artifacts that are left behind on hosts, either\nintentionally (threat actor bringing own tools) or as a byproduct (execution of commands via\nprefetch). Artifacts can include scripts, tools, beacons, staged files, etc.\n\nA common trend observed, is that there is very little effort to remove traces during and after\nthe intrusion. Some examples from our cases include:\n\nRunning beacons that have failed to call home, resulting in persistent DNS callback requests\nfrom processes that wouldn’t be expected to make high volume of requests. Look for domain\ntraffic, where the polling requests have a consistent trend profile. In this example, a beacon\nis sending heartbeats to an unreachable C2 server, notice that the requests per-hour and\nper-day are consistent.\n\nResults of various Tools/scripts are left behind along with the tools themselves, i.e. text files\ncontaining collected host details from discovery, executable beacons in user folders etc.\n\n[BloodHound files dropped to disk](https://thedfirreport.com/wp-content/uploads/2021/09/f8a41ed862e52a8a240ae0e7e197ca06389099229378e60d56feab93acf96f67)\n\n\n-----\n\n[AdFind results written to disk](https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/)\n\n[Task Manager dumping Lsass](https://thedfirreport.com/2021/12/13/diavol-ransomware/)\n\n### Attacker Infrastructure\n\nWe have observed several instances where the threat actor’s infrastructure becomes\nexposed during the intrusion. One example includes the operator’s source machine during a\n[remote desktop session – CONTInuing the Bazar Ransomware.](https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/)\n\nAnother case, was during what we believed to have been a technical issue – a hosted\nbeacon, was remotely pulled (out of band coms) – rather than through the standard C2 that\n[was already established – BazarCall to Conti Ransomware via Trickbot and Cobalt Strike.](https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/)\n\n\n-----\n\nThe payload was available from a public facing IP, and pulled using the curl command\n(evident by the Curl user agent string).\\\n\nNot all intrusions are successful; sometimes, attackers come across technical issues. Some\nissues include tooling that doesn’t function as expected and other environmental-specific\nchallenges that would slow down expansion within the network.\n\n### Fingerprinting\n\nFingerprinting threat actors’ craftsmanship is one of the more fascinating conclusions made\n[when investigating artifacts. In the case of CONTInuing the Bazar Ransomware Story the](https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/)\nuse of profanity was embedded within the HTA file.\n\nThese can be useful IoCs in and of themselves. In other circumstances, threat actors spend\nconsiderable effort developing bespoke software, only to leave identifiers such as helpful\ngroup names and version numbers.\n\n## Final Advice for Defenders\n\nFrom a defender’s perspective, each of the above points provides various detection\nopportunities. These could include recognizing outlier behavior, such as binaries executing\nfrom non-standard locations, or detecting outlier activity, such as a high frequency of crashes\nwithin a short period of each other.\n\nReducing your attack surface and regular patching can have some big wins and avoid some\ncommon scenarios we have seen in 2021, such as initial compromises through Log4j and\nProxyShell/ProxyLogon exploits. Disabling macros and forcing scriptable files to open in\nnotepad will also provide a high level of return on investment.\n\nWe would like to highlight a few guides that CISA has released that can assist defenders and\norganizations in getting their attack surface under control.\n\n\n-----\n\n[Stuff off Search](https://www.cisa.gov/publication/stuff-off-search)\n\nBy using various online search platforms it is possible to get an understanding of what\nservices, assets and devices are exposed on the internet. Reducing this footprint limits the\nadversaries’ potential entries into the organization’s network.\n\n[Known Exploited Vulnerabilities &](https://www.cisa.gov/known-exploited-vulnerabilities) [Top Routinely Exploited Vulnerabilities in 2021](https://www.cisa.gov/uscert/ncas/alerts/aa21-209a)\n\n[Using these resources along with “S.O.S” defenders and organizations can identify the](https://www.cisa.gov/publication/stuff-off-search)\nvulnerabilities associated with their exposed assets. By prioritizing assets that have known\nvulnerabilities which are actively exploited, the organization can remediate risk quicker and\nfocus on things that provide a high return on investment.\n\nCISA, ASD/ACSC, Mandiant, Microsoft and the UK NCSC have plenty of information and\nguides regarding protecting against ransomware and general best practices for logging,\nnetwork architecture and tips for everyday users.\n\nMany of the ransomware TTPs are not complex or stealthy. One of the primary reasons\nbehind this is that they do not need to be stealthy to achieve their goals. We commonly see\nthreat actors use Cobalt Strike more than other implants due to the ease of use and the fact\nthat it is a really powerful post-exploitation framework.\n\nWe have released a two-part guide about Cobalt Strike to assist defenders in understanding\nmore, and hopefully; are better equipped to detect this framework. The guide can be found\nhere:\n\n[https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/](https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/)\n[https://thedfirreport.com/2022/01/24/cobalt-strike-a-defenders-guide-part-2/](https://thedfirreport.com/2022/01/24/cobalt-strike-a-defenders-guide-part-2/)\n\n## Outlook\n\nThere is no magic bullet to make ransomware disappear, and we anticipate that\nransomware-based attacks will continue while incentives remain. Across the globe, multiple\ncountries like USA, Australia and Netherlands have announced task forces to focus on the\nransomware threat.\n\nAustralia specifically announced their “Ransomware Action Plan” and planned to achieve\npart of it using offensive cyber capabilities [1]. The Netherlands has also announced similar\nefforts [2]. Ransomware actors may become risk-averse and select their targets more\ncarefully to avoid being attacked by such operations. We hope to see more ransomware\ngroups brought down in the following year, as well, as a consequence of such operations.\n\n[1] [https://www.homeaffairs.gov.au/cyber-security-subsite/files/ransomware-action-plan.pdf](https://www.homeaffairs.gov.au/cyber-security-subsite/files/ransomware-action-plan.pdf)\n\n\n-----\n\n[2] https://securityaffairs.co/wordpress/123113/security/the-netherlands-war-ransomwareoperations.html\n\n### Resources\n\n## References\n\nOpSec for Russians – https://grugq.github.io/presentations/Keynote_The_Grugq__OPSEC_for_Russians.pdf\nA Deep Dive into Cobalt Strike Malleable C2 – https://posts.specterops.io/a-deep-diveinto-cobalt-strike-malleable-c2-6660e33b0e0b\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-07 - 2021 Year In Review.pdf"
    ],
    "report_names": [
        "2022-03-07 - 2021 Year In Review.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "faa4a29b-254a-45bd-b412-9a1cbddbd5e3",
            "created_at": "2022-10-25T16:07:23.80111Z",
            "updated_at": "2025-03-27T02:02:09.985067Z",
            "deleted_at": null,
            "main_name": "LookBack",
            "aliases": [
                "FlowingFrog",
                "LookBack",
                "LookingFrog",
                "TA410",
                "Witchetty"
            ],
            "source_name": "ETDA:LookBack",
            "tools": [
                "FlowCloud",
                "GUP Proxy Tool",
                "SodomMain",
                "SodomMain RAT",
                "SodomNormal"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536018,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653761108,
    "ts_modification_date": 1653761108,
    "files": {
        "pdf": "https://archive.orkl.eu/08490845a0532020867e2b1ab99698bcfd005b95.pdf",
        "text": "https://archive.orkl.eu/08490845a0532020867e2b1ab99698bcfd005b95.txt",
        "img": "https://archive.orkl.eu/08490845a0532020867e2b1ab99698bcfd005b95.jpg"
    }
}