{
    "id": "9afdac72-c48b-4e7d-9882-bb975903f9ce",
    "created_at": "2023-01-12T15:04:42.510147Z",
    "updated_at": "2025-03-27T02:05:41.239276Z",
    "deleted_at": null,
    "sha1_hash": "366bd1928ce20ea0f5c975ca65f9096e7ab0c953",
    "title": "2020-10-06 - PoetRAT- Malware targeting public and private sector in Azerbaijan evolves",
    "authors": "",
    "file_creation_date": "2022-05-28T15:56:25Z",
    "file_modification_date": "2022-05-28T15:56:25Z",
    "file_size": 1406508,
    "plain_text": "# PoetRAT: Malware targeting public and private sector in Azerbaijan evolves\n\n**blog.talosintelligence.com/2020/10/poetrat-update.html**\n\n_By_ _[Warren Mercer,](https://twitter.com/securitybeard?lang%3Den)_ _[Paul Rascagneres and](https://twitter.com/r00tbsd?lang%3Den)_ _[Vitor Ventura.](https://twitter.com/_vventura)_\n\nThe Azerbaijan public sector and other important organizations are still targeted by new\nversions of PoetRAT.\n\n\n-----\n\nThis actor leverages malicious Microsoft Word documents alleged to be from the\nAzerbaijan government.\nThe attacker has moved from Python to Lua script.\nThe attacker improves their operational security (OpSec) by replacing protocol and\nperforming reconnaissance on compromised systems.\n\n## Executive summary\n\nCisco Talos discovered PoetRAT [earlier this year. We have continued to monitor this actor](https://blog.talosintelligence.com/2020/04/poetrat-covid-19-lures.html)\nand their behavior over the preceding months. We have observed multiple new campaigns\nindicating a change in the actor's capabilities and showing their maturity toward better\noperational security. We assess with medium confidence this actor continues to use spearphishing attacks to lure a user to download a malicious document from temporary hosting\nproviders. We currently believe the malware comes from malicious URLs included in the\nemail, resulting in the user clicking and downloading a malicious document. These Word\ndocuments continue to contain malicious macros, which in turn download additional payloads\nonce the attacker sets their sites on a particular victim. Previous versions of PoetRAT\ndeployed a Python interpreter to execute the included source code which resulted in a much\nlarger file size compared to the latest version's switch to Lua script. As the geopolitical\ntensions grow in Azerbaijan with neighbouring countries, this is no doubt a stage of\nespionage with national security implications being deployed by a malicious actor with a\nspecific interest in various Azerbajiani government departments.\n\n## New campaigns\n\n### Campaign of September 2020\n\nThe malicious document alleged to be a letter with the National Emblem of Azerbaijan in the\ntop corners:\n\n\n-----\n\nThe document we observed used multiple filenames: the first being \"argument.doc\" and\nanother named \"siyahı.doc\" (Azeri word for \"List\"). As previously with PoetRAT, the Word\ndocument contained a macro:\n\n\n-----\n\nThe macro still contains literature references as on the previous version we documented.\nThis time, the text is from the novel \"The Brothers Karamazov\" by Fyodor Dostoevsky (a\nRussian writer).\n\nThe malicious document drops a Python interpreter and PoetRAT. The author made a few\nchanges to the PoetRAT malware, though.\n\n[First, the malware uses pyminifier to obfuscate the Python script and avoid detection based](https://github.com/liftoff/pyminifier)\non string or YARA rules:\n\nThe obfuscation is a base64 and an LZMA compression algorithm.\n\nSecondly, the author split the malware in a couple of different files. For example, the\nvariables are stored in a \"Constant.py\" file containing the C2 server and the configuration.\n\nThe malware also changed a small amount of its code. The most notable change is the\nprotocol used to download and upload files. The first version of PoetRAT used FTP, while the\nnew version supports HTTP protocol:\n\nThese few changes allow the attacker to avoid tracking based on signature and stay under\nthe radar by using a most common protocol for exfiltration — thus improving their opsec.\n\n### Campaign of October 2020\n\nIn this campaign, the decoy document is a Microsoft Office document alleged to be from the\nState Service for Mobilization and Conscription of Azerbaijan:\n\n\n-----\n\nDue to current events in Azerbaijan, the President of the Republic of Azerbaijan has signed a\ndecree \"about declaring partial mobilization in the Republic of Azerbaijan.\" More information\n[can be found here. The Office document was saved six days after the announcement.](https://seferberlik.gov.az/en/military/news/detail/592)\n\nThe malware author changed the embedded payload. A macro is executed by the Office\ndocument:\n\n\n-----\n\nThe macro inflates and creates a ZIP file on the targeted system and executes a Lua script in\nthis archive. The archive contains the Lua payload and luajit, a Lua interpreter for Windows.\nHere is the script:\n\nThis script downloads and executes an additional payload. We did not receive the payload.\nHowever, the operator sent us a text file named 'FUCK-YOU.txt' with hundred of lines of\nexplitives.\n\n### Same victimology\n\nAs with the previous campaigns, the targets of the new campaigns are linked to Azerbaijan.\nIn the previous campaigns, the attacker was mainly interested in the energy sector, more\nspecifically those involved with wind turbines.\n\nThe attacker is still attracted to VIPs and the public sector. In the recent campaign we\nidentified the attacker had access to sensitive information, such as diplomatic passports\nbelonging to citizens of Azerbaijan.\n\n\n-----\n\n## Conclusion\n\nWith recent geopolitical events in Azerbaijan, it is fair to expect some cyber attacks. The\nPoetRAT malware was used against this country a few months ago and new campaigns from\nthis threat actor appeared after the armed conflict.\n\nThe malware slightly evolved since our previous publication. The developer implemented a\nnew exfiltration protocol to hide its activities. There's also additional obfuscation to avoid\ndetection based on strings or signatures.\n\nThe latest evolution of PoetRAT shows us an evolution from Python to Lua. The code is easy\nto parse — nothing advanced — but our analysis showed us that the campaigns are efficient.\nThe attacker obtained access to sensitive documents from the compromised systems, even\nif the technical aspects are not as evolved as expected in this kind of context and targeted\nattacks.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors. Exploit Prevention present within AMP is designed to\nprotect customers from unknown attacks such as this automatically.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), Cisco ISR, and Meraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs\n\nMalicious documents\n\nThis includes newly observed hashes and also previously observed PoetRAT hashes.\n\n\n-----\n\ndc565146cd4ecfb45873e44aa1ea1bac8cfa8fb086140154b429ba7274cda9a2 - Oct 2020\n64aeffe15aece5ae22e99d9fd55657788e71c1c52ceb08e3b16b8475b8655059 - Sept 2020\nac4e621cc5895f63a226f8ef183fe69e1ae631e12a5dbef97dd16a6dfafd1bfc - April 2020\na703dc8819dca1bc5774de3b6151c355606e7fe93c760b56bc09bcb6f928ba2d - April 2020\n208ec23c233580dbfc53aad5655845f7152ada56dd6a5c780d54e84a9d227407 - April 2020\ne4e99dc07fae55f2fa8884c586f8006774fe0f16232bd4e13660a8610b1850a2 - April 2020\n\nC2 Infrastructure\n\nslimip[.]accesscam[.]org\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-06 - PoetRAT- Malware targeting public and private sector in Azerbaijan evolves.pdf"
    ],
    "report_names": [
        "2020-10-06 - PoetRAT- Malware targeting public and private sector in Azerbaijan evolves.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535882,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1653753385,
    "ts_modification_date": 1653753385,
    "files": {
        "pdf": "https://archive.orkl.eu/366bd1928ce20ea0f5c975ca65f9096e7ab0c953.pdf",
        "text": "https://archive.orkl.eu/366bd1928ce20ea0f5c975ca65f9096e7ab0c953.txt",
        "img": "https://archive.orkl.eu/366bd1928ce20ea0f5c975ca65f9096e7ab0c953.jpg"
    }
}