{
    "id": "9b134b23-43c2-4217-9747-6c3a5b21a2b8",
    "created_at": "2022-10-25T16:48:19.896205Z",
    "updated_at": "2025-03-27T02:16:25.717145Z",
    "deleted_at": null,
    "sha1_hash": "64aeaf3629e73d54de04f82c17f40d0463184835",
    "title": "",
    "authors": "",
    "file_creation_date": "2018-01-25T13:41:30Z",
    "file_modification_date": "2018-01-25T13:41:32Z",
    "file_size": 335459,
    "plain_text": "-----\n\n## ASEC REPORT\n#### VOL.89 [Q4 2017]\n\n\n###### ASEC (AhnLab Security Emergency Response Center) is a global security response group consisting of malware\n\n analysts and security experts. This report is published by ASEC and focuses on the most significant security\n\n threats and latest security technologies to guard against such threats. For further details, please visit AhnLab,\n\n Inc.’s homepage (www.ahnlab.com).\n\n\n###### SECURITY TREND OF Q4 2018\n\n\n###### Table of Contents\n\n\n-----\n\n-----\n\n###### Security Issue\n\n\n### Targeted Attacks on Central Management Systems\n\n\n###### Last year, one of the top security threat that organizations faced was the exploit attacks on software\n\n vulnerabilities alongside ransomware. In particular, the main target of attack was the central\n\n management system, which is used by companies and institutions to apply a common policy to\n\n internal systems or to distribute specific files. The central management system is chosen by the\n\n attackers as it consists of the management server and the agent, which can be used to quickly and\n\n easily infect a large number of users with malware.\n\n This report analyzes the current status of malware distribution and attack trends on the central\n\n management system.\n\n Malware distribution\n\n As shown in Figure 1-1, the central management\n\n system consists of the management server\n\n and agent installed client. The management\n\n server is a system for managing the subordinate\n\n PCs; the administrator can send files or\n\n policies to the PCs connected to the server Figure 1-1 | Overview of the central management system\n\n\n-----\n\n###### via the management page. The client installed with the agent executes the files received from the\n\n management server and follows commands. Then the attacker exploits the composition of these\n\n servers and agents to distribute malware through the file distribution function.\n\n Method of attack\n\n The attacks on the central management system can be generalized into two main types: ma\n nagement server account attacks and vulnerability attacks on agents installed in the client PC.\n\n Attacks using management server accounts\n\n Through the central management system, security policies can be applied or executable files\n\n can be distributed to PCs connected through the management server, and the agent can even\n\n be remotely controlled. Thus the attacker can hack the login information of the administrator\n\n to tamper with the distribution phase to distribute a malware instead. Any agents that have\n\n downloaded the malicious file from the server are then infected with malware.\n\n Also, the management server has the role of getting the anti-virus program or the security update\n\n file from the external server. The attacker can exploit this process to change the file slotted for\n\n download in the update server into a malicious file for internal distribution.\n\n Attacks using agent vulnerability\n\n Each agent installed on the client PC receives the command sent from the management server\n\n for execution. In addition to executing commands, it also executes files distributed from the\n\n management server. The agent has a function to check whether the command issued by the server\n\n is suitable and check for the validity of the file. With the understanding of management algorithm\n\n\n-----\n\n###### for these type of functions, the attacker disguises as the management server to send a command\n\n to the agent.\n\n Attack Cases\n\n Here is a detailed description on attack cases which exploited the central management software in\n\n South Korea to distribute malware using the agent vulnerability.\n\n Attack Case 1: Management Software A\n\n In November 2015, the first malware to exploit vulnerabilities was found in management software A.\n\n When the malware was executed, the file containing malware was sent to the agent on a specific\n\n IP address. The name of the file used for the management software A vulnerability attack was **\n\n PScan.exe.\n\n|Time of discovery|Content|\n|---|---|\n|2015/11/16|Runs ** PScan.exe with a command beginning with [FILE_REMOTE_EXEC]|\n|2015/11/24|Receives IP and the port parameter and transfers **PScan.exe file|\n|2016/4/4|Receives only the IP only as a parameter (fixed port number), and transfers ** PScan.exe file|\n\n\nTable 1-1 | Attack timeline for malware exploiting A vulnerability\n\n\n###### When the ** PScan.exe file is executed on the agent that has received the file, the client PC\n\n becomes infected with malware. Attacks exploiting the vulnerabilities of A, shown in Table 1-1, were\n\n first discovered in November 2015 through to the first half of 2016.\n\n Attack Case 2: Management Software B\n\n Attacks exploiting the vulnerabilities of the management software B have also been discovered\n\n since 2015. The attacks showed various patterns of attacks, and the files such as nc.exe, nt.exe, n5lic.\n\n\n-----\n\n###### exe, nc5rt2.exe, and Bin.exe were also found to be used in the attack. It was also discovered to be\n\n downloading VB script files, generated in the names, such as vs1.vbs and winrm.vbs.\n\n The variants of malware used to exploit the vulnerability of B were discovered every year. The\n\n variant found in 2015 generates the winrm.vbs file with the server IP, destination IP, download\n\n address, and remote executable path as arguments.\n\n\nFigure 1-2 | Management Software B attack tool found in 2015\n\n\nFigure 1-3 | Management Software B attack tool found in 2016\n\n\nFigure 1-4 | Management Software B attack tool found in 2017\n\n\n###### The variant found in 2016 additionally receives the port number, unlike the 2015 variant, to create\n\n a winrm.vbs file.\n\n The attack tool for management software B discovered most recently was manufactured in 2017\n\n to generate the vs1.vbs file with the target IP, download address, and remote executable path\n\n parameters as shown in Figure 1-4.\n\n\n-----\n\n###### The generated VBS script file downloads the file\n\n from the address entered in the parameters. The\n\n downloaded file is in the form of a Windows\n\n executable file, which is not executed because\n\n the first 5 bytes of the file do not exist. At this\n\n time, the code contained in the script recovers\n\n the corresponding 5-byte portion, converts it\n\n into a Window executable to execute malware.\n\n Figure 1-5 shows recovery related code includ\nFigure 1-5 | Generated script code\n###### ed in the script.\n\n Attack Case 3: Management Software C\n\n The attack using the vulnerabilities of the management software C was first found in September\n\n 2016. Malware used in this attack performs file transmissions and executions. The attack tool for C is\n\n shown in Figure 1-6.\n\n\nFigure 1-6 | Attack tool of the Management Software C\n\n\n###### Conclusion\n\n To prevent targeted attacks that exploit file distribution functions of the central management\n\n software, the policies concerning the management server are crucial. Management servers should\n\n\n-----\n\n###### be controlled so that it can only be accessed from the specified system, and the administrator\n\n account of the server should also be changed periodically without storing the login information\n\n in the system. Event logs generated from the management server should always be thoroughly\n\n checked to ensure that abnormal files are not distributed internally.\n\n\n-----\n\n-----\n\n###### Annual Report\n### Security Trends from 2017\n\n###### 2017 was a year full of cyberattacks. Even in this moment, ransomware is indiscriminately\n\n attacking unsuspecting targets with the intent of having the biggest adverse effect. Meanwhile,\n\n other security threats are silently evolving, stronger than ever, in the shadow of ransomware.\n\n AhnLab Security Emergency-response Center(ASEC) lists the key security threats of the year\n\n 2017 and their changes.\n\n Three Changes in the Ransomware Paradigm\n\n The top issue for cyber security in 2017 over the world is undoubtedly ransomware. Its\n\n characteristics can be summarized in three: large scale of damage, changes in the routes of\n\n infection, and emergence and termination of variants.\n\n Ransomware hit record high damages in 2017. From WannaCry(also known as WannaCryptor),\n\n which infected more than 300,000 systems in 150 countries, to Bad Rabbit(also known as Disk\n\n Coder), which spread to 15 countries in Europe, the damages are incurred on a world-wide level.\n\n Routes of infections have changed from 2016. While infections using web application\n\n vulnerabilities decreased, infections via email increased a tremendous amount. Locky for\n\n\n-----\n\n###### example used emails with attachments containing malicious macros or various types of scripts\n\n adding social engineering techniques to encourage to open the attachments or run the scripts.\n\n In 2017 a new ransomware emerged which was distributed in an unprecedented way.\n\n WannaCry and Petya did not exploit the traditional web application vulnerabilities, nor did\n\n they use spam emails that were surging in 2017, but exploited a vulnerability of the Windows\n\n system. These kinds of attacks had not been reported before and caused an even bigger stir\n\n when it was discovered that the intention was to damage the system and not monetary gain.\n\n The emergence of a ransomware designed simply for destroying systems can be seen as a\n\n major shift in the security paradigm. On the other hand, the ransomware which resulted in the\n\n largest number of infections worldwide, Cerber, seem to have disappeared since the end of\n\n September 2017.\n\n Rise of Supply Chain Attacks\n\n Supply chain attacks have increased in 2017. A supply chain attack is when hackers gain access\n\n to an organization or company's infrastructure to inject malware. Usually, the attacker hacks the\n\n update server of a normal program to inject malware during a normal program update process,\n\n or hacks a software developing company to inject malicious code into the source codes of a\n\n program during a development phase, such as build or deployment.\n\n The attacker understands that security measures are performed on files from external sources,\n\n and so they take advantage of a trusted relationship of internally used software and its files. The\n\n supply chain attack also targets supporting companies, such as maintenance businesses.\n\n\n-----\n\n###### The aforementioned Petya Ransomware was distributed via a Ukrainian tax accounting\n\n software. There were also reported cases of where CCleaner was used for distribution. CCleaner\n\n is a widely used network management and system optimization program. Malware was\n\n injected in the program development phase in all of these cases. Other cases include malware\n\n targeting MacOS being injected into video conversion programs, such as HandBrake or Eltima\n\n Player, which were distributed through these program’s official websites in 2017.\n\n Attacks Aimed at Cryptocurrencies\n\n The cryptocurrency(or virtual currency) market bloomed in 2017, which can be obtained\n\n through 'mining' with a computer system. As the value of cryptocurrency skyrocketed, new\n\n mining malware was being discovered where cybercriminals secretly use other users’ PCs to\n\n mine cryptocurrency.\n\n The distribution method of such malware varies, such as disguising as a Windows update\n\n file or a compressed file delivered along with normal files. Moreover, mining malware is now\n\n executable in not only the Windows systems, but also in the Linux server system.\n\n There is also an increase of the direct attacks on cryptocurrency exchanges as the size of\n\n the market has been expanded. The attacks targeting the cryptocurrency exchanges can be\n\n characterized by their extortion of cryptocurrency, extortion of member account information,\n\n and DDoS attacks on cryptocurrency exchange sites.\n\n Rise of Diversified Vulnerability Exploits\n\n Until 2016, web-based attacks using exploit kits were at the center of most security threats.\n\n\n-----\n\n###### However, there was a significant decrease of attacks using exploits kits in 2017 and thus less\n\n focus on web-based attacks. Instead, the attacks are becoming more sophisticated by targeting\n\n not only one vulnerability, but various types.\n\n In South Korea, there was an attack from China exploiting the Apache Struts2 vulnerabili\n ty(CVE-2017-5638) amid the political dispute between China and South Korea earlier on in\n\n the year. A number of Microsoft Office documentation vulnerabilities(CVE-2017-0199, CVE\n 2017-8759, CVE-2017-8570, CVE-2017-11826) identified in 2017, have also been used in\n\n politically motivated attacks as well as for ransomware distribution. Motivation for these\n\n politically charged attacks comes from issues related to North Korea's nuclear tests and the\n\n 2018 Pyeongchang Winter Olympics. The CVE-2017-0199 is one of the newly discovered\n\n vulnerabilities of Microsoft Office and is known to be used for the distribution of FINSPY, a\n\n malware used in an attack that targeted the Russian government, and WannaCry, the biggest\n\n cyberattack event of 2017.\n\n Due to WannaCry, the vulnerability named EternalBlue(CVE-2017-0144) became very well\n known. WannaCry exploits the Server Message Block(SMB), a protocol used for purposes\n\n such a file sharing, and is specialized for infecting other internal systems by spreading via the\n\n EternalBlue vulnerability. This vulnerability was also exploited in a number of vulnerability\n\n exploit tools publically released by the hacking group known as The Shadow Brokers. Since its\n\n release, the vulnerability was used for distribution by other ransomware, such as Petya. This is\n\n reminiscent of when the Italy based information technology company Hacking Team revealed\n\n their hacked data online, which led to the uncovering of the zero-day exploit in 2016.\n\n\n-----\n\n###### Acceleration of Mobile Threats\n\n The numbers of mobile threats has been steadily rising and have become more sophisticated at\n\n a faster pace since 2017.\n\n In the past, malware attempted to induce user downloads of malicious apps via links attached\n\n to spam messages, but from 2017, social engineering attacks frequently appeared. When\n\n installed, the app conducts malicious actions, such as leaking sensitive personal information\n\n stored in the smartphone and blocking outgoing and incoming calls and text messages.\n\n Fake apps are being discovered on Google Play, the official app store of Google. These fake\n\n apps disguise themselves as well-known apps to induce user downloads. Attackers used a very\n\n similar icon and changed the app name or label slightly by adding a special character.\n\n\n-----\n\n###### Annual Report\n### Security Threats in 2018\n\n###### As we enter 2018, security threats will also enter a new phase as cybercrime groups are\n\n becoming more organized and systematic than ever. Breaches will be bigger, hackers will\n\n be smarter, and security teams and budgets won’t seem to keep pace. AhnLab Security\n\n Emergency-response Center(ASEC) identified the following as some of the bigger security\n\n threats in 2018.\n\n\n###### Cybercrime-as-a-Service\n\n\n###### 2016 was the year that ransomware threats took the limelight and 2017 was the year\n\n when ransomware evolved. Not only did the number of attacks spike, but the number of\n\n\n###### ransomware variants flooding the market at\n\n an unprecedented rate reached new heights.\n\n This was all possible due to Ransomware-as\n a-Service(RaaS). RaaS is being sold widely on\n\n the dark web, allowing novice criminals with\n\n little technological knowledge to launch their\n\n\n###### own custom-made ransomware campaigns.\n\n\n-----\n\n###### As RaaS has become a successful business model in the cybercrime community, Cybercrime-as\n a-Service(CaaS) is becoming a reality. CaaS today exists as a platform where cybercrime groups\n\n provide role-specific operations, such as sales, distribution, and marketing, just like a legitimate\n\n enterprise. The service is becoming increasingly commercialized in the cybercrime business\n\n world. As cybercrime groups providing these types of businesses are on the rise, an increase in\n\n more diverse cyberattacks is predicted for 2018 with the commercialization of CaaS.\n\n Increasing Supply Chain Attacks\n\n Supply chain attacks will continue their highly\n\n successful attack methods in 2018. The supply\n\n chain attack method seeks to infect systems\n\n during the process of supplying products or\n\n services used by companies or institutions.\n\n This attack exploits the vulnerability that most\n\n companies and institutions trust programs and relates filed already in use while being highly\n\n sensitive to external files from emails or websites. Thus, in the viewpoint of the attacker, it can\n\n be seen that an indirect method of using the target trusted by the victim has a higher success\n\n method than directly attacking companies and institutions that are equipped with various\n\n security systems. Moreover, the attacker can have a bigger control of the network system once\n\n the attack is successful.\n\n Due to these types of attacks, program manufacturers and service providers must take\n\n proactive action to prevent malware infections. And companies and institutions also need to\n\n make a continuous effort to verify and manage internal programs or services in use.\n\n\n-----\n\n-----\n\n###### Last year, a ransomware attack targeted Linux servers of a Korean web hosting company and a\n\n large IDC company, which resulted in huge losses for the companies. And, recently, a malware\n\n appeared that mines cryptocurrency in Linux systems. AhnLab Security Emergency Response\n\n Center(ASEC) has detected 327 Linux malwares in Korea from January to November of 2017.\n\n Similarly to Linux, malware targeting macOS - an operating system that was widely considered\n\n to be safe - is growing continuously. In 2018, malware aiming at Linux, macOS, and Android,\n\n in addition to Windows, is expected to increase. This means that smart devices and IoT devices\n\n that use Linux or Android can also be exposed to security threats.\n\n As IoT devices, such as Robot cleaners, IP cameras and smart refrigerators continue to spread, they\n\n are at an increased risk of malware attacks. ASEC has already discovered Linux.Mirai, one of the\n\n Linux malware programs that targets IoT devices. However, most IoT devices, such as wearable\n\n devices, lack security and security management. With these new changes, it has become clear that\n\n security measures are no longer just for the protection of mobile devices, and effective security\n\n measures must be searched for Internet-connected wearables and home IoT devices.\n\n Increase of Mobile Threats through Official Market\n\n According to StatCounter, a global market survey company, the Android developed by Google\n\n took up 70% of the mobile market in 2017. Due to the high number of people using these\n\n Android-based mobile devices, malware aiming at Android OS is also increasing at a steady\n\n pace. Currently many malicious apps, disguised as legitimate applications, are being discovered\n\n in Google Play Store.\n\n\n-----\n\n###### As a response, Google announced Google\n\n Play Protect, a protection tool for Google Play\n\n Store users which displays a warning in case\n\n of connecting to an app or a website that has\n\n violated Google's security policy. Despite this\n\n effort, there are no signs of a decline in the\n\n registration of malicious apps in Google Play\n\n\n###### Store.\n\n\n###### It is likely that malicious apps bypassing the security checks of Google Play Store will continue\n\n to increase in 2018 since the attackers are continuously developing ways to bypass the security\n\n checks of the OS provider.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "http://global.ahnlab.com/global/upload/download/asecreport/ASEC%20REPORT_vol.89_ENG.pdf"
    ],
    "report_names": [
        "ASEC%20REPORT_vol.89_ENG.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716499,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1516887690,
    "ts_modification_date": 1516887692,
    "files": {
        "pdf": "https://archive.orkl.eu/64aeaf3629e73d54de04f82c17f40d0463184835.pdf",
        "text": "https://archive.orkl.eu/64aeaf3629e73d54de04f82c17f40d0463184835.txt",
        "img": "https://archive.orkl.eu/64aeaf3629e73d54de04f82c17f40d0463184835.jpg"
    }
}