{
    "id": "9b2a3c85-27b5-4b01-92c5-e712aec5dd00",
    "created_at": "2022-10-25T16:48:24.148823Z",
    "updated_at": "2025-03-27T02:05:32.57977Z",
    "deleted_at": null,
    "sha1_hash": "b2eab25e33718c6f5114a4260c41b22d96938842",
    "title": "Attack on Indian Government, Financial Institutions",
    "authors": "",
    "file_creation_date": "2020-05-12T06:56:57Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 2512592,
    "plain_text": "# Attack on Indian Government, Financial Institutions\n\n**[zscaler.com/blogs/research/targeted-attacks-indian-government-and-financial-institutions-using-jsoutprox-rat](https://www.zscaler.com/blogs/research/targeted-attacks-indian-government-and-financial-institutions-using-jsoutprox-rat)**\n\nPublished on: May 11, 2020 Authored by: Sudeep Singh Category: Encryption Evasion/Stealth\n\nMalware\n\nIt is not uncommon for cybercriminals to target specific countries or regions. They often employ this strategy\n\nIn April 2020, ThreatLabZ observed several instances of targeted attacks on Indian government establishments and the banking sector. Emails\nwere sent to organisations, such as the Reserve Bank of India (RBI), IDBI Bank, the Department of Refinance (DOR) within the National Bank for\nAgriculture and Rural Development (NABARD) in India with archive file attachments containing JavaScript and Java-based backdoors.\n\nFurther analysis of the JavaScript-based backdoor led us to correlate it to the JsOutProx RAT, which was used for the first time by a threat actor in\n[December 2019 as mentioned by Yoroi.](https://yoroi.company/research/unveiling-jsoutprox-a-new-enterprise-grade-implant/)\n\nThe Java-based RAT provided functionalities similar to the JavaScript-based backdoor in this attack.\n\nIn this blog, we describe in detail the email attack vector of this targeted campaign, the technical analysis of the discovered backdoors, and our\nconclusions on this attack.\n\n# Email analysis\n\nBelow is the email that was sent to the government officials in NABARD, which contained a malicious archive file attachment.\n\n_Figure 1: Email sent with malicious attachment to NABARD._\n\nThe email attachment filename is: KCC_Saturation_letter_to_all_StCBs_RRBs_pdf.zip\n\nThis archive contains an HTA file inside it that performs the malicious activities.\n\n**The MD5 hash of the HTA file is: 23b32dce9e3a7c1af4534fe9cf7f461e**\n\nThe theme of the email is related to KCC Saturation, which relates to the Kisan Credit Card scheme and is detailed on the official website of\n[NABARD.](https://www.nabard.org/CircularPage.aspx?cid=504&id=2919)\n\nAttackers leveraged this theme because it is relevant to the Department of Refinance, making this email look more legitimate.\n\nWe used the email headers to trace the origin to hosteam.pl, which is a hosting provider in Poland as shown below:\n\nX-Auth-ID: syeds@rockwellinternationalschool.com\n\nReceived: by smtp10.relay.iad3b.emailsrvr.com (Authenticated sender: syeds-AT-rockwellinternationalschool.com) with ESMTPSA id 0928BE00BD;\n\nM 20 A 2020 21 33 53 0400 (EDT)\n\n\n-----\n\nX Sender Id: syeds@rockwellinternationalschool.com\n\nReceived: from WINDEB0UPGVCUK (unused-31-133-6-113.hosteam.pl [31.133.6.113])\n\n(using TLSv1.2 with cipher DHE-RSA-AES256-GCM-SHA384)\n\nby 0.0.0.0:465 (trex/5.7.12);\n\nMon, 20 Apr 2020 21:34:40 -0400\n\nThe same HTML Application (HTA) file was also sent in an archive attachment to IDBI bank as shown in Figure 2.\n\n_Figure 2: The email sent with a malicious attachment to IDBI bank._\n\nBased on the email headers and the infrastructure used to send the previous emails, we were able to identify more instances of these attacks and\nwere able to attribute them to the same threat actor.\n\nFigure 3 shows an email sent to RBI with an archive file that contains a Java-based backdoor.\n\n_Figure 3: The email sent with a malicious attachment to RBI._\n\nFigure 4 shows an email that was used to send an archive file with a Java-based backdoor to Agriculture Insurance Company of India (AIC).\n\n\n-----\n\n_Figure 4: The email sent with a malicious attachment to AIC India._\n\nThe contents of the email are in the Hindi language.\n\nIn both of the cases above, the Java-based backdoor has the same hash and only the filenames used were different.\n\nThe hash of the JAR file is: 0ac306c29fde5e710ae5d022d78769f6\n\n# Technical analysis of JsOutProx\n\nThe MD5 hash of the HTA file is: 23b32dce9e3a7c1af4534fe9cf7f461e\n\nUpon execution, the HTA file displays junk data in a window that flashes quickly on the screen before auto-closing.\n\nThis HTA file contains a JavaScript that is executed by mshta as can be seen in the file header in Figure 5.\n\n_Figure 5: The HTA header in the file._\n\nThere is a long array of encoded strings present at the beginning of the JavaScript as shown in Figure 6.\n\n_Figure 6: A long array of encoded strings._\n\nThis array of strings will be referenced throughout the JavaScript. They are base64 decoded and RC4 decrypted at runtime at the time\nof execution.\n\nJavaScript code in this HTA file is heavily obfuscated as shown in Figure 7.\n\n\n-----\n\n_Figure 7: The heavily obfuscated JavaScript code._\n\nThe string decoding and decryption routines are shown in Figure 8.\n\n_Figure 8: The string decoding and decryption routines._\n\nAfter analyzing the string decryption routine, we can see that RC4 algorithm was used.\n\nThe process of string decryption can be summarized in the following steps:\n\n1. The string decryption routines are invoked with calls such as: b(‘0x4’, ‘qP52’). The first parameter is the index of the encoded string in the\n\nlong array declared at the beginning of the JavaScript. The second parameter is the RC4 decryption key.\n2. The string is base64 decoded using atob() JavaScript function.\n3. An S-box is generated using a for loop to generate the sequence: 0x0 to 0x100.\n4. S-box is permutated using the decryption key.\n5. The permutated S-box is used to perform XOR decryption of the encrypted string.\n\nAfter decrypting all the strings in this JavaScript, we can see the main configuration as shown in Figure 9.\n\n\n-----\n\n_Figure 9: The main configuration file of the JsOutProx backdoor._\n\nSome of the critical parameters in the above config file are:\n\n1. **BaseURL: This is the C2 communication URL. In this case, it makes use of Dynamic DNS (*.ddns.net) and a non-standard port.**\n2. **Delimiter: This is the delimiter that will be used while exfiltrating information about the system.**\n3. **SleepTime: The duration for which the execution needs to be delayed.**\n4. **Delay: Similar to the SleepTime parameter.**\n5. **Tag: This is a unique indicator that is appended to the data during exfiltration. In this case the tag is: Vaster. The first time this JavaScript**\n\nbased backdoor was discovered in December 2019, the value of this tag was: JsOutProx.\n6. **IDPrefix: This parameter corresponds to the Cookie name that will be set in the HTTP POST request sent by the backdoor to the C2 server at**\n\nthe time of initialization.\n7. **RunSubKey: This is the Windows Registry Key that will be used for persistence on the machine.**\n\nThe script checks whether it is being executed by mshta, wscript or by an ASP Server as shown in Figure 10.\n\n_Figure 10: Checks for source of execution._\n\n\n-----\n\nThis also indicates that the script has the capability to execute in different environments, including web servers. The first instance of JsOutProx\ndiscovered in December 2019 was a JavaScript file. The instance we discovered in April 2020 was an HTA file with the JavaScript code obfuscated\nand embedded inside. So we are observing this threat actor deploy the backdoor using different methods in the wild.\n\nThe script also has the ability to delay execution as shown in Figure 11.\n\n_Figure 11: Delaying execution._\n\nThe init() routine is the initialization routine, which gathers different types of information from the system and sends it in an HTTP POST request to\nthe C2 server as shown in Figure 12.\n\n_Figure 12: The main initialization routine._\n\nThe individual fields collected during init() routine are:\n\n**Volume serial number: Fetches the volume serial number using WMI query: “select * from win32_logicaldisk” by inspecting the**\nvolumeSerialNumber field.\n\n**UUID: This is randomly generated using the getUUID function in the script. The format of the UUID used is: xxxxxxxx-xxxx-4xxx-yxxx-xxxxxxxxxxxx**\n\n**ComputerName: Host name of the machine.**\n\n**UserName: User name of the machine on which this script is executing.**\n\n\n-----\n\n**OS caption: This value is fetched using the WMI query: select from win32_operatingsystem by inspecting the Caption field.**\n\n**OS version: This information is also gathered using WMI query similar to OS caption.**\n\n**Tag: This is the tag defined in the configuration of the backdoor. In our case, the tag is Vaster.**\n\nThe last keyword is “ping,” which is added by the receive() method.\n\nAll these values are separated by the delimiter “_|_” and concatenated, then hex encoded and set in the Cookie header called “_giks” of the HTTP\nPOST request sent to the C2 server as shown in Figure 13.\n\n_Figure 13: First HTTP POST request sent to the C2 server._\n\nThe command and control communication between the backdoor and the C2 server is synchronized using the Cookie in the HTTP request\nand responses.\n\nThe last field in the cookie indicates the type of client command.\n\nFor example, if the cookie is:\n\nCookie: _giks=46464646464646465f7c5f65363261396233322d323434352d346166612d393233622d3836653530306530363665655f7c5f486f73746e616\n\nThen the client command can be identified as:\n\n1. Hex decode the cookie to get: FFFFFFFF_|_e62a9b32-2445-4afa-923b\n86e500e066ee_|_Hostname_|_Administrator_|_OS_Name_|_Version_|_Vaster_|_ping\n2. Split the decoded content using the delimiter: “_|_” to get: ['FFFFFFFF', 'e62a9b32-2445-4afa-923b-86e500e066ee', 'Hostname',\n\n'Administrator', 'OS_Name', 'Version', 'Vaster', 'ping']\n3. Extract the last field from the above list. In this case the command is: ping.\n\nFigure 14 shows the main subroutine in the code that handles all the commands.\n\n\n-----\n\n_Figure 14: The C2 command handler subroutine in JsOutProx._\n\nThe description of the commands are included in the table below.\n\n## Command Description\n\n upd Download and execute the script.\n\n rst Re-launch the script.\n\n l32 Similar to rst command.\n\n dcn Exit the execution.\n\n rbt Reboot the system.\n\n shd Shutdown the system.\n\n lgf Shutdown the system.\n\n ejs Use eval() to execute the JavaScript sent by server.\n\n evb Use ActiveXObject to execute the VBScript sent by server.\n\n uis Uninstall the backdoor.\n\n ins Install the backdoor.\n\n\n-----\n\n## fi Invokes the File Plugin.\n\n do Invokes the Download Plugin.\n\n sp Invokes the ScreenPShellPlugin.\n\n cn Invokes the ShellPlugin.\n\n# Technical analysis of the Java-based backdoor\n\n**The MD5 hash of the JAR file is: 0ac306c29fde5e710ae5d022d78769f6**\n\nThe JAR file is heavily obfuscated in this case. The structure of the JAR file is shown in Figure 15.\n\n_Figure 15: The JAR file structure._\n\nThere is an AES-encrypted resource present in this JAR file with the name: “jkgdlfhggf.bvl”.\n\nThis resource will be loaded and decrypted at runtime as shown in Figure 16.\n\n_Figure 16: The Stage 1 resource decryption routine._\n\n\n-----\n\nThis resource gets decrypted to another JAR file, which will be dropped in the %appdata% directory on the machine with the name jhkgdldsgf.jar\n\nThe dropped JAR file contains all the functionality for this Java-based backdoor. Figure 17 shows the main structure of the JAR file.\n\n_Figure 17: The JAR file structure of the Java-based backdoor._\n\nAll the strings in this JAR file are obfuscated by an obfuscator called Allatori. The string decryption routine is as shown in Figure 18.\n\n_Figure 18: The string decryption routine._\n\nWe described this string decryption routine in more details in an earlier [blog, which also includes the Python implementation of the](https://www.zscaler.com/blogs/research/compromised-wordpress-sites-used-distribute-crypted-adwind-rat)\ndecryption routine.\n\nThe JAR file connects to the C&C server: scndppe.ddns.net at port 9050.\n\nThis Java-based backdoor is modular in structure and contains several plugins. Figure 19 shows the main network controller code that handles the\nC&C communication and dispatches the commands to corresponding plugins for further processing.\n\n\n-----\n\n_Figure 19: The network controller command handler._\n\nThe controller receives the command along with an array of strings that represent the parameters for the corresponding command.\n\nEach of the C&C commands are used to invoke a plugin that executes the command sent by the server.\n\n## Command Invoked Plugin\n\n sc Screen plugin.\n\n aut Log plugin.\n\n cm Command plugin.\n\n dn Downloader plugin.\n\n fm Filemanager plugin.\n\n st Startup plugin.\n\n ln.t Base plugin to exit execution.\n\n ln.rst Base plugin to restart execution.\n\nNow, we will describe two main plugins in this Java-based backdoor and the commands processed by them.\n\n**Filemanager plugin: This plugin is responsible for managing all the file system related actions which can be performed by the attacker remotely.**\nThe plugin supports multiple commands and the summary is in the table below.\n\n## Plugin command Purpose\n\n Fm.dv Get list of system drives (including CD drive.)\n\n Fm.get Get list of files and folders in a directory.\n\n\n-----\n\n## Fm.nd Create a new directory.\n\n Fm.e Execute a command using Runtime.getRuntime().exec()\n\n Fm.es Start a new system shell based on the type of OS.\n\n Fm.cp Copy contents of one file to another.\n\n Fm.chm Change the permissions of a file using chmod command (only for Linux and Mac).\n\n Fm.mv Move a file from one location to another.\n\n Fm.del Delete a file.\n\n Fm.ren Rename a file.\n\n Fm.chmod Similar to chm command.\n\n Fm.down Download a file from the system. Contents of the file are Gzip compressed and Base64 encoded before downloading.\n\n Fm.up Upload a file to the system. Contents of the file Gzip decompressed and Base64 decoded before dropping on the file system.\n\n**Screen Plugin: This plugin uses the java.Awt.Robot class to perform all the mouse and keyboard simulations on the machine as well as to take**\nscreen captures. The commands for this plugin are detailed in the table below.\n\n## Plugin Command Purpose\n\n sc.op Fetch the screen size width and height information.\n\n sc.ck Simulate mouse actions like double click, scroll up and scroll down.\n\n sc.mv Move the mouse cursor to specified co-ordinates.\n\n sc.cap Take a screen capture.\n\n sc.ky Send keystrokes to the machine.\n\n**Persistence: To ensure that this JAR file is executed automatically when the system reboots, a Window run registry key is created as shown below:**\n\nHKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run /v jhkgdldsgf /d '\\'C:\\Program Files\\Java\\jre1.8.0_131\\bin\\javaw.exe\\' -jar\n\\'C:\\Users\\user\\AppData\\Roaming\\jhkgdldsgf.jar\\'' /f\n\n# Cloud Sandbox detection\n\n[Figure 20 shows the Zscaler Cloud Sandbox successfully detecting the Java-based backdoor.](https://www.zscaler.com/products/sandboxing)\n\n\n-----\n\n_Figure 20: The Zscaler Cloud Sandbox detection for this Java-based backdoor._\n\n[Figure 21 shows the Zscaler Cloud Sandbox successfully detecting the HTA-based backdoor which contains the JsOutProx RAT.](https://www.zscaler.com/products/sandboxing)\n\n_Figure 21: The Zscaler Cloud Sandbox detection for the HTA-based backdoor._\n\n# Conclusion\n\nThis threat actor has a specific interest in organisations located in India and the content of the emails indicates a good knowledge of topics\nrelevant to each of the targeted organisations. The backdoors used in this attack are uncommon, such as JsOutProx, which has only been\nobserved in the wild once before in December 2019.\n\nThe Zscaler ThreatLabZ team will continue to monitor this campaign, as well as others, to help keep our customers safe.\n\n# MITRE ATT&CK TTP Mapping\n\n## Tactic Technique\n\n Obfuscation Obfuscated Files or Information - T1027\n\n\n-----\n\n## Software Packing T1045\n\n Persistence Registry run keys / Startup folder\n - T1060\n\n Screen Capture T1113\n\n System Shutdown/Reboot T1529\n\n Mshta T1170\n\n File and Directory Discovery T1083\n\n Uncommonly Used Port T1065\n\n\n## Windows Management Instrumentation\n\n\n## T1047\n\n\n# Indicators of Compromise (IOCs)\n\n**Hashes**\n\n23b32dce9e3a7c1af4534fe9cf7f461e – HTA file (JSOutProx)\n\n0ac306c29fde5e710ae5d022d78769f6 – Java-based Backdoor\n\n**Network indicators**\n\nscndppe[.]ddns[.]net:9050\n\nbackjaadra[.]ddns[.]net:8999\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.05.11.JsOutProx_RAT_Targeted_Attacks/zscaler.com-Attack%20on%20Indian%20Government%20Financial%20Institutions.pdf"
    ],
    "report_names": [
        "zscaler.com-Attack on Indian Government Financial Institutions"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041132,
    "ts_creation_date": 1589266617,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/b2eab25e33718c6f5114a4260c41b22d96938842.pdf",
        "text": "https://archive.orkl.eu/b2eab25e33718c6f5114a4260c41b22d96938842.txt",
        "img": "https://archive.orkl.eu/b2eab25e33718c6f5114a4260c41b22d96938842.jpg"
    }
}