{
    "id": "9b6f1348-9b72-4db7-ab4f-79ea62463cfa",
    "created_at": "2023-01-12T15:09:18.423595Z",
    "updated_at": "2025-03-27T02:11:34.438101Z",
    "deleted_at": null,
    "sha1_hash": "5d61430f226b13fab5b8db8f9debf142f24c4005",
    "title": "2018-12-12 - The TrickBot and MikroTik connection",
    "authors": "",
    "file_creation_date": "2022-05-28T18:29:02Z",
    "file_modification_date": "2022-05-28T18:29:02Z",
    "file_size": 78686,
    "plain_text": "# The TrickBot and MikroTik Connection – A Story of Investment and Collaboration\n\n**[infosecurity-magazine.com/blogs/trickbot-mikrotik-connection/](https://www.infosecurity-magazine.com/blogs/trickbot-mikrotik-connection/)**\n\nDecember 12, 2018\n\n**[Wicus Ross Lead Security Researcher, SecureData Labs](https://www.infosecurity-magazine.com/profile/wicus-ross/)**\n\nIn my professional capacity I perform several tasks. One involves tracking and collecting\nindicators of compromise (IoC) used to identify malware campaigns. Another involves\ntracking incidents reported in mainstream media, establishing trends, and distilling the\ninformation into actionable items for clients and colleagues. The fun part of my job involves\nwriting tools or playing with those authored by others.\n\nThis is a story where all these aspects neatly intersect. It’s also a story which highlights the\nneed for security companies to invest in their staff, and to encourage creativity to build a\nsafer online environment for businesses and consumers.\n\n**Tracking TrickBot**\n\nSecurity companies across the globe track malware campaigns, including one named\nTrickBot. TrickBot monitors the web surfing activity of its victim, and activate when certain\nwebsites, such as internet banking, are accessed. It then attempts to capture account details\nof its victim when he or she browses to a login URL that is being monitored.\n\n\n-----\n\nIf we look at industry trends, this one is definitely a contender on the top ten offender list.\nAmong the others are those which target unsecured IoT devices, subverting them into what\nis called a botnet – the likes of Mirai, Satori, VPNFilter, and Slingshot. The latter two have\nbeen linked to APT or nation state actors, Mirai and VPNFilter have been associated with\ndistributed denial of service attacks, while Slingshot was reportedly used to pivot into internal\nnetworks. So, a pretty bad bunch!\n\nWe’ve noticed, in our own tracking of botnets, the increasing involvement of MikroTik\ndevices, and also noted vulnerable MikroTik routers, through publicly disclosed vulnerabilities\nthat were attributed to others. This, coupled with poor vulnerability management, has meant\nan increase in the number of compromised MikroTik hosts.\n\n**Where internal investment plays its part**\nOn to the fun part. Our team takes a creative approach to cybersecurity and they’re\nconstantly expanding their capabilities, building tools not only because they have to, but out\nof curiosity.\n\nEnter my esteemed colleague, Willem. A few weeks ago, Willem saw that Pastebin was\nrunning a lifetime Pro subscription promotion. Willem signed up, and a couple of hours later\nhad created Pastebot, a Pastebin scraper that hooked into cloud-based collaboration\nplatform, Slack. It was not long before Pastebot started spamming our SD Labs’ Slack\nworkspace with all kinds of nasties found on Pastebin.\n\nFast forward to one Monday morning just before lunch. I received a Slack message from\nWillem with a link to a Pastebin post that hosted XML config for a TrickBot campaign. This\nwas picked up by Pastebot because Willem was looking for Pastebin posts that contain\n[names of certain well-established financial institutions. This returned a TrickBot XML file](https://pastebin.com/raw/EZk38uw8)\ncontaining 38 IP addresses and port pairs across the world.\n\nNext, a quick spot check using Shodan, which provided us with a sense of what we were\ndealing with: several were associated with MikroTik routers. We verified this and the result\nwas surprising. Of the 38 IPs, Shodan returned info on 37 hosts, 19 of which were identified\nas MikroTik routers. This suggests that either the routers or the hosts behind them had been\ncompromised – or both.\n\nOne of the MikroTik routers reported the latest version of firmware which had been fully\npatched against known exploits. All the 19 MikroTik routers had their bandwidth test services\nexposed to the internet, and 18 had default SSH ports exposed to the internet.\n\n**Tools and tactics**\nWe passed MikroTik router IPs through IOCParlor (a tool created by our team that helps\nautomate IOC collection and verification) to get a sense of how naughty these hosts really\nare. IOCParlor queried VirusTotal and returned a list of 14 IPs flagged as malicious.\n\n\n-----\n\nTo verify the results, we picked one IP and manually reviewed it using the VirusTotal web\nclient, which produced an MS Word document.\n\nOf the 61 malware engines that scanned the document, 35 reported it as malicious. Several\nof the malware engines classified the document as a trojan downloader, meaning that when\nWord opens the file it will download malware.\n\nThe community tab associated with the VirusTotal report had several comments, including\none from by dvk01 of My Online Security, a phishing and malware campaign reporting site\nthat the SD Labs team regularly uses. dvk01 labelled the malware as TrickBot and links to an\narticle that describes how the same contagion was used for a malicious Bank of America\nemail.\n\nIn September 2018, there were reports in the industry that highlighted the increasing number\nof MikroTik routers that are ensnared in malicious activity. What was interesting was that\nTrickBot is using C2 hosts that have MikroTik routers involved.\n\nHad the SD Labs not been tinkering with cybersecurity tools, this discovery may not have\nbeen made. Leveraging seemingly unrelated events and tying them together with other\nanalysis demonstrates the need to not only examine obscure incidents across the industry,\nbut also the kind of tactics needed to protect organizations against threats that could never\nhave been imagined.\n\nContinued investment in research and tooling is needed across industry, coupled with a\ncreative approach and some outside-the-box thinking.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-12-12 - The TrickBot and MikroTik connection.pdf"
    ],
    "report_names": [
        "2018-12-12 - The TrickBot and MikroTik connection.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "72aaa00d-4dcb-4f50-934c-326c84ca46e3",
            "created_at": "2023-01-06T13:46:38.995743Z",
            "updated_at": "2025-03-27T02:00:02.972623Z",
            "deleted_at": null,
            "main_name": "Slingshot",
            "aliases": [],
            "source_name": "MISPGALAXY:Slingshot",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f55c7778-a41c-4fc6-a2e7-fa970c5295f2",
            "created_at": "2022-10-25T16:07:24.198891Z",
            "updated_at": "2025-03-27T02:02:10.138587Z",
            "deleted_at": null,
            "main_name": "Slingshot",
            "aliases": [],
            "source_name": "ETDA:Slingshot",
            "tools": [
                "Cahnadr",
                "GollumApp",
                "NDriver"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536158,
    "ts_updated_at": 1743041494,
    "ts_creation_date": 1653762542,
    "ts_modification_date": 1653762542,
    "files": {
        "pdf": "https://archive.orkl.eu/5d61430f226b13fab5b8db8f9debf142f24c4005.pdf",
        "text": "https://archive.orkl.eu/5d61430f226b13fab5b8db8f9debf142f24c4005.txt",
        "img": "https://archive.orkl.eu/5d61430f226b13fab5b8db8f9debf142f24c4005.jpg"
    }
}