{
    "id": "9c23852a-8f92-4c23-b02e-9df699efea07",
    "created_at": "2023-01-12T15:02:38.444303Z",
    "updated_at": "2025-03-27T02:15:41.779818Z",
    "deleted_at": null,
    "sha1_hash": "fd3220fcf66ca964d3538c992a27b049268f6f35",
    "title": "2015-03-04 - Who’s Really Spreading through the Bright Star-",
    "authors": "",
    "file_creation_date": "2022-05-27T21:17:51Z",
    "file_modification_date": "2022-05-27T21:17:51Z",
    "file_size": 974093,
    "plain_text": "# Who’s Really Spreading through the Bright Star?\n\n**[securelist.com/whos-really-spreading-through-the-bright-star/68978/](https://securelist.com/whos-really-spreading-through-the-bright-star/68978/)**\n\nAuthors\n\n[Kurt Baumgartner](https://securelist.com/author/kurtb/)\n\n[Juan Andrés Guerrero-Saade](https://securelist.com/author/juanguerrero/)\n\n## Early reporting blind to likely external KCNA attacker\n\nSecurity researchers recently announced that that the official website for the Korean Central\nNews Agency of the Democratic People’s Republic of Korea has been serving malware\ndisguised as a Flash Player update. The immediately conspicuous code is still active on the\nKCNA front page. The javascript variables at the top of the front page source code are part\nof an interwoven js mechanism meant to check for specific requirements before redirecting\nthe visitor to a relative location, /download/FlashPlayer10.zip.\n\n\n-----\n\nThe malware delivery site has been live, although response to connection attempts is\nintermittent at best. The zip file contains two executables with the common Flash\ninstaller names.This malware has been around since the end of 2012.\n\nWhat appears to be rushed attribution and pretty faux-intelligence diagrams proposes the\nstandard hypothesis that the malware was placed there by the site’s developers in an\nattempt to infect the endpoints of those outsiders interested in the goings-on of the DPRK.\nThis may not be the case, because incidents are usually more complex than they seem. And\nclearly, this is a significant piece of the puzzle – there was human involvement in adding this\nweb page filtering. It is not a part of the viral routines in its handful of components. Instead,\nthe malware’s trigger, system requirements, and technical and operational similarities with\n[the more recent DarkHotel campaigns point in the direction of an external actor, possibly](http://securelist.com/blog/research/66779/the-darkhotel-apt/)\nlooking to keep tabs on the geographically dispersed DPRK internet-enabled elite.\n\nThe larger spread of victims include telecommunications network engineering staff, wealth\nmanagement and trading staff, a pharmaceutical’s electrical engineering staff, distributed\nsoftware development teams, business management and related school faculty and IT, and\nmany, many more.\n\n### Website Attack and Geographic Spread\n\nOne of the most notable characteristics is that the malware isn’t being delivered to every site\nvisitor. The delivery trigger is contingent on the absence of the legitimate Flash Player 10 or\nnewer being present on the target’s Windows system. If a user attempts to view the videos or\npicture slideshows linked on the bottom right pane of the front page, the user is presented\nwith a gif in place of the desired content indicating that flash player is required. Naturally,\nclicking on the gif will redirect to the malicious zip file. It’s also interesting that this malware\n\n\n-----\n\nhas no Linux or OS X variant, deliverables are exclusively Windows executables. It s also\ninteresting that the malware components were first detected in Nov of 2012, two months prior\nto the first known appearance of the Flashplayer bundle on the kcna.kp website. While we\ndon’t know definitively the exact origin of these infections, at this point, we suspect it was in\nfact the kcna website. There are no other known sources.\n\nKSN data also includes few select cases where Firefox users were served up the malware\nwhile visiting a page known for cross-site scripting, described in the following section\n“Potential XSS-Enabled Watering Hole”. Basically, the timing and resource location of this\nvulnerability presents the definite possibility of an external actor’s intrusion.\n\nThe delivery of a zip file dependent on user interaction and self-infection initially implies a\nfairly low level of attack sophistication, but let’s go farther than the social engineering\nelements of the attack and consider the victim profiling too. From this web site in particular,\nthe attackers are initially targeting users with not only a low-level of technical expertise and\ngeneral knowledge, but also tragically outdated Windows systems. Flash Player version 10\nwas released on October 2008, and newer browsers like Google Chrome include a more\nrecent flash plug-in out of the box. These attacks took place in the third quarter of 2012 at\nthe earliest.\n\nMost likely, the intended victims are known to use outdated systems that fit these\nspecifications. This is the case in North Korea, where Global Stats places nearly half of\ndesktop computers systems still running Windows XP. In comparison, South Korea has a\nsteady Windows 7 adoption rate of nearly 80% over the past year.\n\n\n-----\n\nSo what is the actual geographic spread of the malware? Well, the two main associated\ncomponents mscaps.exe and wtime32.dll were detected on systems mostly in China,\nfollowed by South Korea, and Russia. We can infer that these systems were infected at\nsome point and were victim systems of the kcna.kp spread malware:\n\nChina 450\n\nKorea, Republic of 43\n\nRussian Federation 25\n\nMalaysia 20\n\nItaly 11\n\nIndia 10\n\nKorea, Democratic People’s Republic of 7\n\nGermany 7\n\nHong Kong 6\n\nIran, Islamic Republic of 4\n\nHowever, reading into the geolocation of the top hits is not as straightforward as it may\nseem. Reports suggest that NK elites have access to various internet providers that may\n[geolocate their ip in Chinese, Russian, and Hong Kong IP ranges.](http://www.vox.com/2014/12/22/7435625/north-korea-internet)\n\n### Potential XSS-Enabled Watering Hole\n\nGiven the recent branding of NK threat actor as the culprit of the Sony hack, original\nreporting has had no difficulty accepting the idea that this is an attack perpetrated from within\nthe DPRK in order to keep track of those people interested in the official state media. Let’s\nexamine the difficulties in arriving at that conclusion.\n\n\n-----\n\nFirst, the site itself was vulnerable to XSS in the early 2013 time frame, when the Flashplayer\ninstaller bundle first appeared on the site. The site’s vulnerability is recorded here by\n“Hexspirit” on XSSed in April 2013. As a matter of fact, the first pages we are aware of that\nreferred to the flashplayer bundle on kcna.kp by the exact same XSS-vulnerable page were\nseen in Jan 2013:\n\nhxxp://www.kcna.kp/kcna.user.home.photo.retrievePhotoList.kcmsf;jsessionid=xxx\n\nSo, the flashplayer bundle may have been delivered by any APT actor and not simply the\nsite’s governmental sponsor. Coupling that possibility with the Darkhotel APT’s penchant for\ndelivering Flashplayer installers from compromised resources, this scenario holds weight.\nAlso, the strong possibility that the site’s developers unknowingly maintained infected\nmachines is present.\n\nThe operational angle of placing malware on the state’s official news site is dependent on\nwho is most likely to view this site or directed to it and be interested in its content – to the\npoint of arriving at the download trigger deep in the media section. Sure, we can consider\nthat key elements in the international community, like dissidents, think tanks, and foreign\ninstitutions are likely to keep an eye on NK state news but their systems are unlikely to fit the\nFlash player requirements for the infection. We also have seen forums maintaining\nemotionally charged discussions containing links to photo images redirecting to the Flash\ninstaller malware. Perhaps forum participants were targeted actively in this way as well. So\nthis watering hole attack may be focused inward, intentionally targeting the geographicallyspread North Korean internet-enabled elite and other interested readers by an external threat\nactor.\n\n### Malware Similarities to Darkhotel APT Toolset\n\nThe original finding includes a preliminary analysis of the quirky inner workings of the\nmalware dropper, delving into the two executables masquerading as Flash Player 10\nupdates. Let’s go a step further and discuss the following similarities between the viral code\nhosted on kcna.kp and the previously documented Darkhotel malware in the following\ncategories:\n\n\n-----\n\nSocial engineering\nDistribution\nData collection\nNetwork configuration and simple obfuscation\nInfection and injection behavior\nTimestamps and timelines\n\nA referent for these malware similarities can be found in descriptions of the malware\n[distributed during the DarkHotel campaigns. Comparisons follow.](http://securelist.com/blog/research/66779/the-darkhotel-apt/)\n\n### Social engineering\n\nThe most blatant and obvious similarity between these campaigns is the approach of\ndelivering spoofed FlashPlayer installers bound with backdoors from compromised server\nresources. This is the first page out of the Darkhotel playbook and one of its most distinct\nqualities now replicated in the KCNA attack. The benefits of this approach are significant,\nespecially when considering that the malware in the case of KCNA is not digitally signed and\nrequires express user interaction for execution.\n\n### Data Collection\n\nOn a technical level, it’s interesting to recall the Darkhotel information stealer from 2012. Its\npurpose is to collect identifying data points from victim systems. The data points of interest to\nthe DH information stealer are very similar to that of its KCNA equivalent (shown below):\n\nCoincidentally, the KCNA dropper collects much the same identifying data points from victim\nsystems. The Darkhotel item missing from this list is the ‘CPU Name and Identifier’,\nsupplanted by ‘time of infection’.\n\n\n-----\n\nThe Darkhotel stealer maintained the stolen data in a specific internal format of label**colon-value as follows:**\n\nThe KCNA stealer maintained the stolen data in the following internal format, very similar\nto the Darkhotel format (label-colon-value):\n\n### Network configuration and simple obfuscation\n\nThis package’s network callback includes several unusual Fully Qualified Domain Names\n(FQDNs). This network configuration is specifically hardcoded within wtime32.dll:\n\na.gwas.perl.sh\n\na-gwas-01.dyndns.org\n\na-gwas-01.slyip.net\n\nIt’s interesting that the malware is configured with three connectback command & control\nservers, just like the network configuration of tens of the Darkhotel backdoors. Also, a very\nsimple routine locates these strings within the wtime32.dll component’s .data section and\ndecodes them as global variables. Those strings are obfuscated within the binary with a\nsimple XOR 0x12 loop. The later Darkhotel samples maintain a somewhat more complicated\napproach, but not by much. Here are strangely obfuscated strings:\n\nSoftware\\Microsoft\\Active Setup\\Installed Components\n\n{ef2b00e3-19da-4e78-b118-6b6451b719f2}\n\n{a96adc11-e20e-4e21-bfac-3e483c40906e}\n\nSoftware\\Microsoft\\Windows\\CurrentVersion\\Run\n\nJREUpdate\n\nmscaps exe\n\n\n-----\n\na.gwas.perl.sh\na-gwas-01.slyip.net\na-gwas-01.dyndns.org\nupdate.microsoft.com\n20\n%SystemRoot%\\system32\n%APPDATA%\\Microsoft\\Protect\\SETUP\n%SystemRoot%\\system32\\gdi32.dll\n\n### Targeting Specificity\n\nThe Darkhotel actor is unusual in the varying degrees of specificity it uses to spread its\nmalware: “This APT precisely drives its campaigns by spear-phishing targets with highly\nadvanced Flash zero-day exploits that effectively evade the latest Windows and Adobe\ndefenses, and yet they also imprecisely spread among large numbers of vague targets with\npeer-to-peer spreading tactics.”\n\nIn other words, the group is surprisingly open to their worms spreading indiscriminately\nacross entire countries, hitting tens of thousands of systems. This is also the case in the\nKCNA campaign wherein malware is positioned in a way meant to attract a specific target\naudience with uncommon system requirements and yet the malware itself is designed to\nspread indiscriminately (via a mechanism described below).\n\n### Infection and Injection Behaviors\n\nMuch like the Darkhotel toolset, the KCNA malware includes viral code. The routine is\nmaintained in the fil.dll code. After sleeping for a couple of minute intervals, the code\nrepeatedly looks through attached network drives for executables to infect. It infects these\nfiles with its explorer shellcode and the @AE1.tmp dropper itself. It’s a strange infection\nstrategy – notably, the shellcode blob does not transfer control back into the original file.\n\nThe injection behavior is both intricate and indiscriminate as the malware not only infects\nexecutables on network shares but also locally. As an example, the size of an infected Skype\ninstaller on a network drive increased in size from its original 1,513 kb to 3,221 kb.\n\n\n-----\n\nGreat strides, however inelegant, were taken in adding to the malware s injection capabilities\nbeyond simple executables. For this purpose, the malware drops a copy of command-line\nWinRar version 4.1.0 (released January 2012) in\n%USERS%\\AppData\\Roaming\\Microsoft\\Identities\\\\Rar.exe. This Winrar software is used in\norder to access ZIP, RAR, ISO, and 7Z files in search of any executable contents to infect.\nArchives in the aforementioned formats containing executables are infected and then\nrepackaged under their original filenames but with their new executable contents under the\nDaws.awfy scheme.\n\nAll resultant infected files are detected by our products as Trojan-Dropper.Win32.Daws.awfy.\nSeveral networks were affected by this viral code, and almost one thousand unique md5s\nrepresenting related infected files across various systems were recorded as “TrojanDropper.Win32.Daws.awfy”.\n\n### Viral Victimology\n\nGiven the malware’s viral propagation capabilities, we can distinguish the infection spread\ndata above, which relates directly to the Flashplayer hosted on KCNA, from the malware’s\nviral spread through network shares and removable drives. While each count in this list\nrepresents a unique organization or system that detected a set of KCNA-viral infected files\non their drives, the total infected file detection count is almost 20,000 files. Focusing on the\nDaws.awfy spread, we get a different picture of the malware’s reach:\n\n**Country** **Systems and organzations**\n**encountering infected files**\n\nChina 481\n\nMalaysia 51\n\nRussia 47\n\nKorea, Republic of 34\n\nTaiwan 14\n\nSenegal 14\n\n\nKorea, Democratic People’s\nRepublic of\n\n\n11*\n\n\nIndia 9\n\nMexico 9\n\nQatar 9\n\n\n-----\n\nIt s important to note the different conditions that apply to North Korea. First of all, the limited\nIP space means that multiple unique systems share IP addresses –in the case of DPRK\nvictims above, the number is based on unique systems instead of unique IP addresses.\nNext, we attribute the relatively low number of network-based infections to the restrictive\npolicies that keep many users from connecting to the larger Internet from KP ip ranges in the\nfirst place. A network- and usb-based viral infector is a great tool for a malicious actor to use\nthe few front-facing systems in order to infect computers on an isolated intranet, like the one\nconnecting most machines inside NK. However, that very isolation makes it impossible to\nprecisely quantify the malware’s success inside that intranet at this time.\n\n### Timestamps and timelines\n\nKCNA malware dropper compilation timestamp: Tue, 13 Mar 2012 02:24:49 GMT.\n\nDarkhotel information stealer compilation timestamp: Mon, 30 Apr 2012 00:25:59 GMT.\n\nAlso interesting is that mostly all of the additional KCNA malware related components were\ncompiled in mid-March 2012.\n\nThe first Darkhotel APT spoofed flashplayer installer incidents recorded in our KSN data\nbegan in 2012 and peaked in 2013. This KCNA incident would fall in the peak timeframe for\nthis type of offensive activity for Darkhotel.\n\n### Noteworthy Components\n\nIn addition to the legitimate flash player upgrade that this archive maintains, the backdoor\ncomponents that it drops to disk and executes seem to be clustered as Windows Live\ncomponents (i.e.: Defender, IM Messenger). The two most interesting dropped files are the\nfollowing:\n\n78d3c8705f8baf7d34e6a6737d1cfa18,c:\\windows\\system32\\mscaps.exe\n\n978888892a1ed13e94d2fcb832a2a6b5,c:\\windows\\system32\\wtime32.dll\n\nThe mscaps.exe component’s reboot persistence setting is added to the registry\nhere: HKLM\\SOFTWARE\\Microsoft\\Active Setup\\Installed Components\\{a96adc11-e20e4e21-bfac-3e483c40906e}, where its stubpath is set to\n‘”C:\\WINDOWS\\system32\\mscaps.exe” /s /n /i:U shell32.dll’. This setting ensures that every\ntime the explorer.exe shell is started or restarted on the system, this executable injects its\ncode.\n\nOther analyses of this malware failed to mention the presence of Madshi’s madCodeHook. It\nis a legitimate commercial DLL injection and api hooking framework, in this case used to\ninject the att.dll spyware component specifically into the following communications\napplications:\n\nInternet Explorer – iexplore.exe, ieuser.exe\n\n\n-----\n\nMozilla Firefox, firefox.exe\nGoogle Chrome, chrome.exe\nMicrosoft Outlook Express, msimn.exe\nMicrosoft Outlook, outlook.exe\nWindows Mail, winmail.exe\nWindows Live Mail, wlmail.exe\nMSN Messenger, msnmsgr.exe\nYahoo! Messenger, yahoomessenger.exe\nWindows FTP Client, ftp.exe\n\nThe LoadLibraryExW hook is placed here:\n\nThe hook jmp listed here:\n\nRelated string parsing loop here:\n\nOther analysis notes that ws2_32.dll, or the winsock2 library, is dropped to disk and copied\nto mydll.dll. The reason for this is most likely to maintain stable Winsock2 hooks across\nWindows OS. In the past, some madCodeHooks set on Winsock2 api proved to be unstable,\nso these guys just include one that they know works.\n\nThis implementation throws a wrench in the works, it is certainly a dissimilarity. The\nmadCodeHook library was not observed in Darkhotel malware.\n\n\n-----\n\nThe wtime32.dll component is dropped to disk and loaded at startup into explorer.exe. It is\nthen injected into each of the listed “interesting” processes. It is a very interesting bot\ncomponent, communicating with its three c2 domains and listening for further commands. It\nmaintains 13 primitive interactive bot commands:\n\n**Command** **Command Description**\n\ncmd run provided cmd and output to file as a part of newly created and killed\nprocess, i.e. “cmd /c tree > file 2>&1”\n\ninf collect system information – operating system version, username,\ncomputername, system drive, local time, all connected drives and properties,\nnetwork adapter properties, disk free space, enumerate all installed\nprograms as per-user or per-machine\n\ncap capture screenshot and send to c2\n\ndlu ncomplete function\n\ndll open a process with all access, write a dll to memory and remotely create\nthread (load a dll into a remote process)\n\nput receive, decrypt, and write specified file to disk\n\ngot report status on retrieved file\n\nget collect, encrypt, and retrieve specified file\n\nexe run provided executable name with WinExec\n\ndel record file attributes to specified c2 and delete specified file\n\ndir record and report to c2 all files in current directory tree and their attributes:\nfilename, file size, last write time, archive or directory, hidden, system\n\nquit exit thread\n\nprc process request\n\nIts functionality includes older technologies used here that we just don’t see anymore. Not\nonly does it provide for NTFS, FAT32, FAT16, and FAT filesystem I/O routines, but it\nimplements the older FAT12 I/O routines as well. Low level Windows95 raw disk access is\nenabled with CreateFileA on \\\\.\\vwin32 through the vwin32 virtual driver.\n\nFinally, the KCNA malware does have a unique trick up its sleeve. Its dropped components’\nability to scan connected drives and network shares to copy their contents and deliver a\nspecial something to further its spread. So in its own crude way, this malware could hop\nacross usb-enabled air-gapped networks by infecting both executables and archives on usb\nsticks.\n\n\n-----\n\n### Conclusions\n\nThe KCNA incident and the related viral bot’s spread leaves more questions than solid\nanswers. Chalking this campaign up to DPRK operations is certainly a simplistic thing to do\nand unsupported here. The possibility for the spread of an internal network virus or the\npossibility of an XSS-enabled website compromise are both high. Some similarities with the\nDarkhotel toolset are present, including the network configuration, spoofing technique, as\nwell as the format and selection of stolen data. Were these to be related campaigns,\nparticularities of the KCNA malware show that the Darkhotel actor may still have some tricks\nup its sleeve.\n\n## Appendix\n\n### Components Dropped by the KCNA Malware\n\n78d3c8705f8baf7d34e6a6737d1cfa18, mscaps.exe, Tue, 12 Apr 2011 09:15:59 GMT\n\n978888892a1ed13e94d2fcb832a2a6b5, wtime32.dll, 213kb, Trojan.Win32.Agent.hwgw,\nCompiledOn:Wed, 29 Feb 2012 00:50:36 GMT\n\n2d9df706d1857434fcaa014df70d1c66, arc.dll, 1029kb, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:34:00 GMT\n\nfffa05401511ad2a89283c52d0c86472, att.dll, 229KB, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:24:32 GMT\n\n1fcc5b3ed6bc76d70cfa49d051e0dff6, dis.dll, 120.kb, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:24:36 GMT\n\nd0c9ada173da923efabb53d5a9b28d54, fil.dll, 126kb, UDS:DangerousObject.Multi.Generic,\nCompiledOn:Tue, 13 Mar 2012 02:24:41 GMT\n\ndaac1781c9d22f5743ade0cb41feaebf, launch.exe, 172KB, HEUR:Trojan.Win32.Generic,\nCompiledOn:Tue, 13 Mar 2012 02:24:52 GMT\n\n6a9461f260ebb2556b8ae1d0ba93858a, sha.dll, 89KB, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:24:43 GMT\n\nf1c9f4a1f92588aeb82be5d2d4c2c730, usd.dll, 99KB, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:24:46 GMT\n\n59ee2ff6dbac2b6cd3e98cb0ff581bdb, WdExt.exe, 1.66MB, Trojan.Win32.Agent.hwgw,\nCompiledOn:Tue, 13 Mar 2012 02:24:49 GMT\n\nf415ea8f2435d6c9656cc6525c65bd3c, wtmps.exe, 1.94MB, TrojanDropper.Win32.Daws.awfy, CompiledOn:Mon, 05 Mar 2012 08:37:55 GMT\n\n### Related MD5s, Domains, and Detections\n\n_Trojan.Win32.Agent.hwgw_\n\n78d3c8705f8baf7d34e6a6737d1cfa18, mscaps.exe\n\n2d9df706d1857434fcaa014df70d1c66, arc.dll\n\n1e7c6907b63c4a485e7616aa04351da7, @aedf66.tmp.exe\n\n\n-----\n\n1fcc5b3ed6bc76d70cfa49d051e0dff6, dis.dll\n523b4b169dde3bcab81311cfdee68e92, wdext.exe\n541989816355fd606838260f5b49d931, wdext.exe\n5e34f85278bf3504fc1b9a59d2e7479b, wdext.exe\n6a9461f260ebb2556b8ae1d0ba93858a, sha.dll\n78ba5b642df336009812a0b52827e1de, wdexe.exe\n7f15d9149736966f1df03fc60e87b8ac, wdext.exe\n7f3a38093bd60da04d0fa5f50867d24f\n82206de94db9fb9413e7b90c2923d674\na59d9476cfe51597129d5aec64a8e422, @ae465f.tmp.exe\nf1c9f4a1f92588aeb82be5d2d4c2c730, usd.dll\nfffa05401511ad2a89283c52d0c86472, att.dll\nd0c9ada173da923efabb53d5a9b28d54, fil.dll\n\n_Trojan-Dropper.Win32.Daws.awfy_\n2f7b96b196a1ebd7b4ab4a6e131aac58\n8948f967b61fecf1017f620f51ab737d\n…and almost 800 other executables that were infected on network shares and attached\ndrives\n\n_c2 Domains_\na.gwas.perl.sh,211.233.75.83\na-gwas-01.dyndns.org\na-gwas-01.slyip.net\n\n[APT](https://securelist.com/tag/apt/)\n[Cyber espionage](https://securelist.com/tag/cyber-espionage/)\n[Malware](https://securelist.com/tag/malware/)\n[Social engineering](https://securelist.com/tag/social-engineering/)\n[Targeted attacks](https://securelist.com/tag/targeted-attacks/)\n[Website Hacks](https://securelist.com/tag/website-hacks/)\n\nAuthors\n\n[Kurt Baumgartner](https://securelist.com/author/kurtb/)\n\n[Juan Andrés Guerrero-Saade](https://securelist.com/author/juanguerrero/)\n\nWho’s Really Spreading through the Bright Star?\n\n\n-----\n\nYour email address will not be published. Required fields are marked\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-03-04 - Who’s Really Spreading through the Bright Star-.pdf"
    ],
    "report_names": [
        "2015-03-04 - Who’s Really Spreading through the Bright Star-.pdf"
    ],
    "threat_actors": [
        {
            "id": "1dadf04e-d725-426f-9f6c-08c5be7da159",
            "created_at": "2022-10-25T15:50:23.624538Z",
            "updated_at": "2025-03-27T02:00:55.508759Z",
            "deleted_at": null,
            "main_name": "Darkhotel",
            "aliases": [
                "Darkhotel",
                "DUBNIUM",
                "Zigzag Hail"
            ],
            "source_name": "MITRE:Darkhotel",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b13c19d6-247d-47ba-86ba-15a94accc179",
            "created_at": "2024-05-01T02:03:08.149923Z",
            "updated_at": "2025-03-27T02:05:17.422065Z",
            "deleted_at": null,
            "main_name": "TUNGSTEN BRIDGE",
            "aliases": [
                "DUBNIUM ",
                "DarkHotel ",
                "CTG-1948 "
            ],
            "source_name": "Secureworks:TUNGSTEN BRIDGE",
            "tools": [
                "Nemim"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2b4eec94-7672-4bee-acb2-b857d0d26d12",
            "created_at": "2023-01-06T13:46:38.272109Z",
            "updated_at": "2025-03-27T02:00:02.790029Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "DUBNIUM",
                "Fallout Team",
                "Luder",
                "Tapaoux",
                "Shadow Crane",
                "APT-C-06",
                "SIG25",
                "Karba",
                "Nemim",
                "Nemin",
                "G0012",
                "ATK52",
                "T-APT-02",
                "TUNGSTEN BRIDGE",
                "Zigzag Hail"
            ],
            "source_name": "MISPGALAXY:DarkHotel",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c0cedde3-5a9b-430f-9b77-e6568307205e",
            "created_at": "2022-10-25T16:07:23.528994Z",
            "updated_at": "2025-03-27T02:02:09.847683Z",
            "deleted_at": null,
            "main_name": "DarkHotel",
            "aliases": [
                "APT-C-06",
                "ATK 52",
                "CTG-1948",
                "Dubnium",
                "Fallout Team",
                "Higaisa",
                "Luder",
                "Operation DarkHotel",
                "Operation Daybreak",
                "Operation Inexsmar",
                "Operation PowerFall",
                "Operation The Gh0st Remains the Same",
                "SIG25",
                "Shadow Crane",
                "T-APT-02",
                "Tungsten Bridge",
                "Zigzag Hail"
            ],
            "source_name": "ETDA:DarkHotel",
            "tools": [
                "Asruex",
                "DarkHotel",
                "DmaUp3.exe",
                "GreezeBackdoor",
                "Karba",
                "Nemain",
                "Nemim",
                "Ramsay",
                "Retro",
                "Tapaoux",
                "Trojan.Win32.Karba.e",
                "Virus.Win32.Pioneer.dx",
                "igfxext.exe",
                "msieckc.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535758,
    "ts_updated_at": 1743041741,
    "ts_creation_date": 1653686271,
    "ts_modification_date": 1653686271,
    "files": {
        "pdf": "https://archive.orkl.eu/fd3220fcf66ca964d3538c992a27b049268f6f35.pdf",
        "text": "https://archive.orkl.eu/fd3220fcf66ca964d3538c992a27b049268f6f35.txt",
        "img": "https://archive.orkl.eu/fd3220fcf66ca964d3538c992a27b049268f6f35.jpg"
    }
}