{
    "id": "9c717ca2-8d9c-4360-8dc1-8e3969f16039",
    "created_at": "2023-01-12T14:59:41.59459Z",
    "updated_at": "2025-03-27T02:15:35.660218Z",
    "deleted_at": null,
    "sha1_hash": "57c4d0fd7107ddc6faf8ea7bb08c016c6be59e3c",
    "title": "2022-06-30 - BRIEF- Raccoon Stealer Version 2.0",
    "authors": "",
    "file_creation_date": "2022-08-18T03:29:33Z",
    "file_modification_date": "2022-08-18T03:29:33Z",
    "file_size": 2672215,
    "plain_text": "# BRIEF: Raccoon Stealer Version 2.0\n\n**zerofox.com/blog/brief-raccoon-stealer-version-2-0/**\n\n[BLOG](https://www.zerofox.com/blog/)\nJune 30, 2022 |\n\nby [Stephan Simon](https://www.zerofox.com/blog/author/stephan-simon/)\n\n\nJune 30, 2022\n\n\n-----\n\n14\nminute read\n\nZeroFox Intelligence has observed the following information as of June 28, 2022, and has\nreleased the following.\n\n## Executive Summary\n\nOn June 4, 2022, ZeroFox Intelligence discovered a then-unknown information stealer being\ndistributed by ProCrackerz, a website distributing fake software cracks and key generators\n(keygens). The earliest known instance of this information stealer observed by ZeroFox\nIntelligence was a sample uploaded to VirusTotal on April 19, 2022. Twitter user\n[@James_inthe_box suggested the name “Recordbreaker” for it based on the use of “record”](https://twitter.com/James_inthe_box/status/1534593736356663296)\nas the User-Agent string in each sample. In May 2022, logs for sale with “Raccoon Stealer\n[V2.0” branding were discovered that matched what ZeroFox Intelligence was observing with](https://medium.com/s2wblog/raccoon-stealer-is-back-with-a-new-version-5f436e04b20d)\nRecordbreaker. Due to this and multiple other private confirmations, ZeroFox Intelligence\nasserts with MEDIUM confidence that Raccoon Stealer has returned and that Recordbreaker\nis actually Raccoon Stealer version 2.0.\n\n## Details\n\nRaccoon Stealer version 2.0 is capable of targeting Chromium and Mozilla-based browsers\nby looking for well-known file names in specific directories. For Chromium-based browsers,\nthreat actors using Raccoon Stealer 2.0 have the ability to specify a list of Chrome extension\nIDs and associated files as well. In ZeroFox Intelligence’s observations, these consisted\n\n\n-----\n\nentirely of cryptocurrency extensions. Raccoon Stealer 2.0 attempts to collect credentials,\ncookies, autofill data, credit cards, and data associated with specified Chrome extensions.\nFor Mozilla browsers such as Firefox, only credentials, cookies, and autofill data were\ntargeted. Other applications like Telegram and specific cryptocurrency applications can be\ntargeted as well. To ensure that all cryptocurrency wallets are collected, a separate function\nexists solely to collect “wallet.dat” files. For any applications or files without specific support,\na generic “grbr_” function exists to allow actors to specify files by path and a name or\npattern.\n\n## Technical Analysis\n\nZeroFox Intelligence first discovered Raccoon Stealer version 2.0 disguised as a crack for\nMicrosoft Office on the ProCrackerz website. Clicking on any of the download links redirected\nthe viewer through various advertisements and click trackers until they were eventually\nshown a set of directions and a Discord CDN link hosting the fake crack. The download links\non ProCrackerz change regularly as the Discord links are removed.\n\n**Figure 1. ProCrackerz listing for a Microsoft Office crack**\n\n_Source: ZeroFox Intelligence_\n\n\n-----\n\n**Figure 2. Instructions on downloading a compressed Raccoon Stealer version 2.0**\n**sample**\n\n_Source: ZeroFox Intelligence_\nThe compressed files are small in size but inflate to hundreds of megabytes when\ndecompressed. This is due to the samples being padded with large amounts of repeating\nbytes.\n\nSamples ZeroFox Intelligence observed distributed in this way were obfuscated or packed;\nthe unique string “edinayarossiya” was visible and used to pivot to other samples uploaded\nto VirusTotal. This allowed ZeroFox Intelligence to download much smaller (~56KB)\nunprotected samples and greatly sped up our analysis. Translated, Edinaya Rossiya means\n[“United Russia,” which is currently the largest political party in Russia. Later analysis of the](https://en.wikipedia.org/wiki/United_Russia)\nstring decryption routine determined this is an encryption key for the protected strings used\nby the stealer.\n\nRaccoon Stealer version 2.0 begins by importing all of the Windows API calls it needs (and\nsome it does not). Importing API calls at runtime is a common tactic used by malware to\navoid adding them to the import table to be used as a signature.\n\n\n-----\n\n**Figure 3. Raccoon Stealer version 2.0 resolves Windows API calls at runtime**\n_Source: ZeroFox Intelligence_\nAfterwards, all protected strings are base64 decoded and RC4 decrypted as shown in\n**Figure 4.**\n\n**Figure 4. Strings are protected by RC4 encryption and base64 encoding**\n\n_Source: ZeroFox Intelligence_\n\nThe RC4 key “edinayarossiya” was consistent across most samples, though some also used\n“credit19” instead. ZeroFox Intelligence is currently unsure if this is specified by each actor\ndeploying the stealer or if this is decided by the authors for each build.\n\n\n-----\n\nUnlike the RC4 key used to decrypt strings, the RC4 key used to decrypt command and\ncontrol (C2) servers is a fixed length and changes with every sample. Aside from this, C2\nservers are protected in much the same way the other strings are. Up to five C2s can be\nconfigured per sample, with each C2 slot hardcoded to be 65 bytes long. Addresses that are\nshorter than 65 bytes after being encrypted and base64 encoded are padded with spaces.\n\n**Figure 5. C2s are RC4 encrypted, base64 encoded, and padded with spaces**\n\n_Source: ZeroFox Intelligence_\nThe locale on the victim’s machine is checked against two locales that can be hard-coded in\nthe binary. ZeroFox did observe a check for a “ru” locale, but the language check does not\naffect the execution in any way. A second locale was not configured in the samples we\nobserved.\n\n**Figure 6. Checking the victim’s locale**\n\n_Source: ZeroFox Intelligence_\n\n\n-----\n\nRaccoon Stealer 2.0 also ensures that only one instance is running at a time by checking\nand creating a mutex. ZeroFox Intelligence observed this to be “8724643052” with every\nsample obtained. If it cannot open a handle to the mutex, Raccoon Stealer 2.0 will exit with\nError Code 2.\n\n**Figure 7. Raccoon Stealer 2.0 ensures that only one instance is running at a time**\n\nSource: ZeroFox Intelligence\nThe victim’s security identifier (SID) is checked against the value “S-1-5-18” to determine if\nthe process happens to be running as the SYSTEM or LOCAL SYSTEM user. If so, Raccoon\nStealer 2.0 will enumerate the list of running processes on the infected machine.\n\n**Figure 8.**\n\n**Enumerate running processes if running as SYSTEM**\n\n_Source: ZeroFox Intelligence_\nThe first real action Raccoon Stealer 2.0 takes is to get the machine GUID and username,\nwhich are then sent as an HTTP POST request to the C2. As seen in Figure 9 below, the\nGUID and username are sent together in the URL parameter “machineId” separated by a\npipe character. The “configId” parameter shown is the RC4 key used to decrypt C2\naddresses.\n\n\n-----\n\n**Figure 9. Sending a unique identifier to a Raccoon Stealer C2 server**\n_Source: ZeroFox Intelligence_\nIf the C2 is still available, the server will respond with a simple, newline-separated\nconfiguration. If no C2 is available, Raccoon Stealer 2.0 simply exits.\n\n**Figure 10. A Raccoon Stealer 2.0 C2 responds with a configuration**\n\n_Source: ZeroFox Intelligence_\nThere are currently nine options that can be processed from the settings shown in Figure 10.\n[A sample configuration returned by one of the C2 servers can be found here.](https://gist.github.com/FirehaK/bb4f0c17c77d284bd5ad54187bbd199a)\n\n**Option** **Description**\n\news_ Targeted Chrome browser extensions\n\ngrbr_ Targeted files to steal\n\nldr_ A command, DLL, or executable to run\n\nlibs_ DLLs to download\n\n\n-----\n\n**Option** **Description**\n\nscrnsht_ Screenshot file name\n\nsstmnfo_ Send system information to the C2 with this file name and add this template\ntext\n\ntlgrm_ Telegram-specific files and folders to target\n\ntoken URL path to POST stolen data\n\nwlts_ Cryptocurrency wallets and associated files and folders to target\n\nDLL files downloaded using the “libs_” option are saved to the AppData\\LocalLow directory.\nRaccoon Stealer 2.0 attempts to add this directory to the PATH environment variable but\ndoes not verify if it was successful. In our observations, this actually failed, and the sample\ncontinued to run without issue.\n\nThe following system information is collected during a run:\n\nUser locale\nSystem time zone\nOperating system\nSystem architecture (32-bit or 64-bit)\nCPU core count\nInstalled RAM\nScreen resolution\nAll display devices (GPUs)\nInstalled software and versions\n\nOnce each of these functions has run, another POST request is made to /<token>.\n\n\n-----\n\n**Figure 11. System information being sent to the C2 server**\n_Source: ZeroFox Intelligence_\nRather than look for specific browsers, Raccoon Stealer version 2.0 targets any Chromium or\nMozilla-based browsers by the name of the directories in which each respective browser\nstores its data. For Chromium, this is “User Data” while Mozilla/Gecko uses “Profiles.”\n\n\n-----\n\n**Figure 12. Raccoon Stealer 2.0 targets browsers based on Chromium and Mozilla’s**\n**Gecko**\n\n_Source: ZeroFox Intelligence_\nIn order for Raccoon Stealer 2.0 to be able to read the data threat actors are interested in, it\nmust load the DLLs from the “libs_” options earlier.\n\n\n-----\n\n**Figure 13. Raccoon stealer resolving external imports to read browser data later**\n_Source: ZeroFox Intelligence_\nData targeted from Chromium-based browsers includes:\n\nCredentials\nCookies\nAutofill data\nCredit cards\nExtensions listed in the configuration retrieved from the C2\n\nData targeted from Mozilla/Gecko-based browsers includes:\n\nCredentials\nCookies\nAutofill data\n\nAlthough the “ews_” option is not necessarily limited to only cryptocurrency-related browser\nextensions, ZeroFox Intelligence has only observed this to be the use case. Figure 14 below\nshows two more functions dedicated to stealing cryptocurrency wallets. The first, “wlts_”,\nexfiltrates files based on the configuration option of the same name. Other cryptocurrency\nwallets may still be stolen by the next function, which looks for “wallet.dat” files.\n\n\n-----\n\n**Figure**\n\n**14. The last several functions of Raccoon Stealer version 2.0**\n_Source: ZeroFox Intelligence_\nThe “grbr_” function uses directory paths, file names or patterns, and other options such as\nfile size specified in the configuration to decide which files it should exfiltrate.\n\nThe “tlgrm_” function is similar to “grbr_” but has fewer options. It is meant to target\nTelegram data, though the same functionality could have been achieved with the generic file\ngrabber.\n\nTaking a screenshot is separated into two functions. The first, “scrnsht_” checks to see if the\nconfiguration wants it to take one, and the second function actually takes and sends the\nscreenshot\n\n\n-----\n\nFinally, the ldr_ function is capable of allowing Raccoon Stealer version 2.0 to act as a\nloader for secondary payloads or execute commands. Each “ldr_” option contains multiple\nparts. It could contain a command to execute or the URL of a file to download, and if a URL\nis given a directory is specified to which the file should be downloaded. The last part\nspecifies which action should be taken (e.g., execute a command, run EXE or DLL).\n\n**Figure 15. The “ldr_” function can download and execute secondary payloads**\n\n_Source: ZeroFox Intelligence_\n\n## Recommendations\n\nZeroFox Intelligence highly discourages seeking out pirated software of any kind. As in this\ncase, such downloads are often completely fake and will not install the software the victim\nwanted. In some cases, the download may contain the actual software—as well as a hidden\nmalicious component to infect the victim.\n\nZeroFox Intelligence also highly recommends that organizations take reports of pirated\nsoftware on corporate machines seriously. With each download, the risk of infection\nincreases.\n\n## YARA\n\n[ZeroFox Intelligence has created a public YARA rule that can be found on GitHub.](https://github.com/FirehaK/YARA/blob/master/RaccoonV2/RaccoonV2.yar)\n\n## MITRE ATT&CK\n\n\n-----\n\n**Tactic** **Technique** **Comments**\n\n\nReconnaissance T1592.001Gather\nVictim Host\nInformation:\nHardware\n\nReconnaissance T1592.002Gather\nVictim Host\nInformation: Software\n\nReconnaissance T1589.001\n\nGather Victim Identity\nInformation:\nCredentials\n\nExecution T1059\n\nCommand and\nScripting Interpreter\n\nExecution T1559.001InterProcess\nCommunication:\nComponent Object\nModel\n\nExecution T1204\n\nUser Execution\n\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nDefense\nEvasion\n\nCredential\nAccess\n\n\nT1027.002\n\nSoftware Packing\n\nT1140\n\nDeobfuscate/Decode\nFiles or Information\n\nPath Interception by\nPATH Environment\nVariable\n\nT1070.004\n\nIndicator Removal on\nHost: File Deletion\n\nT1539Steal Web\nSession Cookie\n\n\nThe sstmnfo_ function collects information\nabout the infected system’s CPU, installed\nRAM, and display devices.\n\nThe sstmnfo_ function collects installed\napplications and their version numbers.\n\nRaccoon Stealer 2.0 retrieves stored\ncredentials from targeted web browsers.\n\nThe ldr_ function can be used to run\ncommands.\n\nRaccoon Stealer 2.0 makes use of COM\nobjects in the grbr_ function.\n\nSamples discovered so far relied on victims\nseeking out pirated software.\n\nRaccoon Stealer 2.0 can be found packed in\nthe wild.\n\nStrings and hosts to reach out to are RC4\nencrypted and base64 encoded.\n\nRaccoon Stealer 2.0 attempts to add\nAppData\\LocalLow to the PATH variable.\n\nSeveral files are copied into the\nAppData\\LocalLow directory and subsequently\ndeleted after use.\n\nRaccoon Stealer 2.0 steals cookies from\ntargeted web browsers.\n\nIf the process is running as SYSTEM, it will\nenumerate running processes.\n\n\nDiscovery T1057\n\nProcess Discovery\n\n\n-----\n\n**Tactic** **Technique** **Comments**\n\nDiscovery T1012Query Registry The registry is used to gather system info, such\nas the operating system and currently-installed\nsoftware.\n\n\nDiscovery T1082\n\nSystem Information\nDiscovery\n\nDiscovery T1614.001System\nLocation Discovery:\nSystem Language\nDiscovery\n\nDiscovery T1124System Time\nDiscovery\n\nCollection T1005\n\nData from Local\nSystem\n\nCollection T1113\n\nScreen Capture\n\n\nCommand and\nControl\n\nCommand and\nControl\n\n\nT1071.001Application\nLayer Protocol: Web\nProtocols\n\nT1105Ingress Tool\nTransfer\n\n\nRaccoon Stealer 2.0 gathers system\ninformation, such as the victim operating\nsystem, system architecture, user locale,\ninstalled applications, and more.\n\nUser locale is checked, but no specific action is\ntaken.\n\nThe victim’s time zone is checked and\ncompared to GMT/UTC.\n\nRaccoon Stealer 2.0 offers configurable filestealing capabilities for actors to choose based\non their interests.\n\nRaccoon Stealer 2.0 takes a screenshot near\nthe end of its execution.\n\nRaccoon Stealer 2.0 uses standard HTTP\nrequests to exfiltrate data and download files.\n\nRaccoon Stealer 2.0 downloads a set of\nlegitimate DLL files to read browser data.\n\nData exfiltration is customizable by the actor\nthrough specified directories and file name\npatterns.\n\nActors have the ability to only steal files within\na configurable size limit.\n\nData is exfiltrated over HTTP and in plain text.\n\n\nExfiltration T1020Automated\nExfiltration\n\nExfiltration T1030Data Transfer\nSize Limits\n\nExfiltration T1041Exfiltration\nOver C2 Channel\n\n## IOCs\n\n**Type** **IOC**\n\nIPv4 5.252.22.62\n\nIPv4 45.142.212.100\n\n\n-----\n\n**Type** **IOC**\n\nIPv4 51.81.143.169\n\nIPv4 51.195.166.171\n\nIPv4 51.195.166.175\n\nIPv4 51.195.166.176\n\nIPv4 51.195.166.184\n\nIPv4 51.195.166.201\n\nIPv4 62.113.255.110\n\nIPv4 80.92.206.126\n\nIPv4 80.92.206.215\n\nIPv4 85.202.169.112\n\nIPv4 188.215.229.203\n\nIPv4 193.106.191.146\n\nIPv4 194.156.98.151\n\nDomain wiwirdo.ac[.]ug\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/nss3.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/msvcp140.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/vcruntime140.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/mozglue.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/freebl3.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/softokn3.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/sqlite3.dll\n\nURL hxxp://<c2 address>/aN7jD0qO6kT5bK5bQ4eR8fE1xP7hL2vK/nssdbm3.dll\n\nURL hxxp://wiwirdo.ac[.]ug/azne.exe\n\nURL hxxp://wiwirdo.ac[.]ug/pm.exe\n\nURL hxxp://wiwirdo.ac[.]ug/cc.exe\n\n\n-----\n\n**Type** **IOC**\n\nURL hxxp://wiwirdo.ac[.]ug/rc.exe\n\nSHA256 048c0113233ddc1250c269c74c9c9b8e9ad3e4dae3533ff0412d02b06bdf4059\n\nSHA256 0661dbb6a0ff7d84c25ae7dd840cefd470279346bd476f1cff5d766f0902a277\n\nSHA256 0b7d9b786726641c28afda4f641baa4811e0d4c8937748075e61611843e94234\n\nSHA256 0c722728ca1a996bbb83455332fa27018158cef21ad35dc057191a0353960256\n\nSHA256 263c18c86071d085c69f2096460c6b418ae414d3ea92c0c2e75ef7cb47bbe693\n\nSHA256 27e02b973771d43531c97eb5d3fb662f9247e85c4135fe4c030587a8dea72577\n\nSHA256 516c81438ac269de2b632fb1c59f4e36c3d714e0929a969ec971430d2d63ac4e\n\nSHA256 5e614758b6344d6aa9619a75c110b9af4ea2dc1b1103c542e5d10e8d5fc2d66a\n\nSHA256 7299026b22e61b0f9765eb63e42253f7e5d6ec4657008ea60aad220bbc7e2269\n\nSHA256 79103532395036c14b755d90f9cacfdec6b588f1b031a7cba936c1b9d2ef3b51\n\nSHA256 8655a544a26bade11fbda736c2af2a475ed12f2150efce7f0500b6fc6d317cb8\n\nSHA256 89a718dacc3cfe4f804328cbd588006a65f4dbf877bfd22a96859bf339c6f8bc\n\nSHA256 960ce3cc26c8313b0fe41197e2aff5533f5f3efb1ba2970190779bc9a07bea63\n\nSHA256 99f510990f240215e24ef4dd1d22d485bf8c79f8ef3e963c4787a8eb6bf0b9ac\n\nSHA256 9e239b12c8cc7f5f7fc0a46121aa5dbfd82306f08c4b04a6ac9f61495ecd410b\n\nSHA256 9ee50e94a731872a74f47780317850ae2b9fae9d6c53a957ed7187173feb4f42\n\nSHA256 bc15f011574289e46eaa432f676e59c50a9c9c42ce21332095a1bd68de5f30e5\n\nSHA256 e514d7ee18dbe841e411f03dd6e0f498b509599d81d15c0945325070cdc8c687\n\nSHA256 f20dcb9477e356e91e1b00abc351f749739f98ca395840ae3062d6cebc72f85b\n\nSHA256 f9c4d451f8c9d4e546e67348c4cc2e8810aa5c39d4fabe1ee891408a0bc53043\n\nSHA256 fb26544d45a1166e15e37853786f0b98ff876d1ce94c240a0f3bc2f9a8fb258f\n\nSHA256 fba1005e8c248ec460e6c13cb38759bd70d9db4882f88f651b194ab1800e656c\n\n### SCOPE NOTE\n\n\n-----\n\n_ZeroFox Intelligence is derived from a variety of sources, including—but not limited to—_\n_curated open-source accesses, vetted social media, proprietary data sources, and direct_\n_access to threat actors and groups through covert communication channels. Information_\n_relied upon to complete any report cannot always be independently verified. As such,_\n_ZeroFox applies rigorous analytic standards and tradecraft in accordance with best practices_\n_and includes caveat language and source citations to clearly identify the veracity of our_\n_Intelligence reporting and substantiate our assessments and recommendations. All sources_\n_used in this particular Intelligence product were identified prior to 12:00 PM (EDT) on June_\n_28, 2022; per cyber hygiene best practices, caution is advised when clicking on any third-_\n_party links._\n\n**Tags:** [Cyber Trends\n,](https://www.zerofox.com/topic/cyber-trends/) [Cybersecurity\n,](https://www.zerofox.com/topic/cybersecurity/) [Threat Intelligence](https://www.zerofox.com/topic/threat-intelligence/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-30 - BRIEF- Raccoon Stealer Version 2.0.pdf"
    ],
    "report_names": [
        "2022-06-30 - BRIEF- Raccoon Stealer Version 2.0.pdf"
    ],
    "threat_actors": [
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535581,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1660793373,
    "ts_modification_date": 1660793373,
    "files": {
        "pdf": "https://archive.orkl.eu/57c4d0fd7107ddc6faf8ea7bb08c016c6be59e3c.pdf",
        "text": "https://archive.orkl.eu/57c4d0fd7107ddc6faf8ea7bb08c016c6be59e3c.txt",
        "img": "https://archive.orkl.eu/57c4d0fd7107ddc6faf8ea7bb08c016c6be59e3c.jpg"
    }
}