{
    "id": "9c786af2-2abf-4415-8da5-e8288301b8f2",
    "created_at": "2023-01-12T15:09:04.137769Z",
    "updated_at": "2025-03-27T02:14:11.92514Z",
    "deleted_at": null,
    "sha1_hash": "9554808e2f36e2ed8203c9942c8511b85e3d08b5",
    "title": "2022-04-29 - Stormous- The Pro-Russian, Clout Hungry Ransomware Gang Targets the US and Ukraine",
    "authors": "",
    "file_creation_date": "2022-09-01T10:09:05Z",
    "file_modification_date": "2022-09-01T10:09:05Z",
    "file_size": 821805,
    "plain_text": "# Stormous: The Pro-Russian, Clout Hungry Ransomware Gang Targets the US and Ukraine\n\n**trustwave.com/en-us/resources/blogs/spiderlabs-blog/stormous-the-pro-russian-clout-hungry-ransomware-gang-**\ntargets-the-us-and-ukraine\n\n_May 2 Stormous update: The Trustwave SpiderLabs team has noted Stormous’_\n_underground website became inaccessible on April 29. At this time it is not known why the_\n_site is down. We will continue to monitor for additional threat intelligence._\n\n\n-----\n\nAs part of our regular Dark Web and cybercriminal research, Trustwave SpiderLabs has\nuncovered and analyzed postings from a politically motivated, pro-Russian ransomware\ngroup named Stormous. The group has recently proclaimed support for Russia in its war\nwith Ukraine, attacking the Ukraine Ministry of Foreign Affairs and allegedly obtaining and\nmaking public phone numbers, email addresses, and national identity cards. But the group\nalso claims to have a successful ransomware operation and has taken responsibility for\ncyber attacks on major American brands Coca-Cola, Mattel and Danaher. In total, Stormous\nclaims to have already accessed and defaced 700 U.S. websites and attacked 44 American\ncompanies.\n\nAs of April 29, the group has listed the Coca-Cola data for sale on its Dark Web site. At the\ntime of publishing, Coca-Cola has neither confirmed nor denied whether the data listed is\nlegitimate. Most recently, the gang has promised to release additional stolen information\nfrom multinational toy manufacturer Mattel and medical diagnostics and healthcare\ntechnology company Danaher on May 1.\n\n\n-----\n\n_Stormous announcement of the Coca-Cola data for sale and teasing new data dumps from_\n_other US companies_\n\n**Who Is Stormous and Where Does Its Allegiance Lie?**\n\nStormous, which may have begun operating as early as mid-2021, has posted a mission\nstatement stating its objective is to attack targets in the U.S. and other western nations.\nThis goal shifted in 2022, adding Ukraine and India to its target list. The way they discuss\ncountries as their targets as opposed to specific businesses or industries suggests that\npolitics more influence these shifts in targets than financial gain.\n\n_Screenshot from the Stormous Dark Web page_\n\nOur initial analysis of Stormous indicates the gang likely has members located in MidEastern countries and Russia. Some of the group's postings are written in Arabic along\nwith its public pro-Russian stance, which is consistent with the region. Moreover, two of the\ngroup's members that were arrested were from mid-eastern countries.\n\n\n-----\n\nThe group communicates through a Telegram channel and an .onion website on Tor. There\nis little chatter on the Telegram channel, with the conversation mainly comprised of the\ngroup’s proclamations. While the group identifies itself as a ransomware group, it is not\noperating as a Ransomware-as-a-Service (RaaS), and it’s not known what type of\nransomware it may be using in their campaigns\n\nThe group's motivating principles and behavior somewhat resemble the Lapsus$ hacker\ngroup, which targets entities mainly in the Western hemisphere. Like Lapsus$, Stormous is\nquite “loud” online and looks to attract attention to itself, making splashy proclamations on\nthe Dark Web and utilizing Telegram to communicate with its audience and organize to\ndetermine who to hack next.\n\n**Click-Bait or Serious Business?**\n\nStormous has stated that on May 1, it will put up for sale data allegedly exfiltrated from toy\nmanufacturer Mattel and Danaher, a global science and technology innovator. However, the\ngroup did not define the type or amount of data it had taken, and neither Mattel nor Danaher\nreported suffering a related cyber incident.\n\nStormous has already claimed responsibility for an alleged attack on the Coca-Cola Corp\nthat it claims garnered 161GB of data. The group began selling the data on April 24 for 1.6\nBTC, or about $64,000.\n\n\n-----\n\n_Screenshot purporting to be stolen data from Coca-Cola, which shows passwords and_\n_name accounts._\n\nThe soft drink giant has confirmed that it has contacted law enforcement and is\ninvestigating a cyber incident but has so far offered no details on what might have\n[transpired, according to Security Week.](https://www.securityweek.com/coca-cola-investigating-hack-claims-made-pro-russia-group)\n\nThe screenshot from Stormous site shows that the data it sells includes files with names\nsuch as accounts.zip and passwords.txt. If those files indeed contain the content that their\nnames imply, then that content can be used by hackers for exploring additional ways to\nconnect to Coca Cola's networks in an unauthorized way.\n\n\n-----\n\nThere is some debate within the cybersecurity community on the validity of Stormous\nclaims, specifically in relation to the Coca-Cola hack. The community questions whether or\nnot the group has truly breached the companies named and exfiltrated data or if it’s merely\nscavenging previously stolen or public information. For example, Mattel announced in\nNovember 2020, that it had been successfully hit by a ransomware attack earlier that year.\nThe Stormous attackers could be simply compiling this already stolen data and packaging it\nas a ‘new’ breach in an attempt to earn quick money.\n\nStormous has also claimed to have successfully attacked several targets in India and Saudi\nArabia and possibly a Chinese government site.\n\n_Stormous’ logo wall of alleged victims_\n\nStormous is also representative of another recent trend that sees threat actors creating a\n\"corporate-like\" structure and business model. In this case, perhaps because Stormous is\nrelatively new to the scene, its postings and communications appear to be a brand-building\nexercise. Also, by pre-announcing the availability of supposedly stolen data, the group is\ntrying to hype demand as any company might do with a new product. Finally, by taking a\npolitical stance, it likely hopes to attract supporters with similar viewpoints.\n\n**Politically Motivated Targeted Attacks**\n\nStormous has posted its support for Russia and is claiming to have attacked the Ukraine\nMinistry of Foreign Affairs, obtaining and making public phone numbers, email addresses,\nand national identity cards. However, this attack, like the others, has not been corroborated.\n\n\n-----\n\n_Stormous’ official statement on its support for Russia_\n\n\n-----\n\nStormous actions are not unique. Since the Russia-Ukraine war started on Feb. 14, threat\n[groups have been lining up to support each side. Trustwave SpiderLabs reported on this](https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/dark-web-insights-evolving-cyber-tactics-aim-to-impact-the-russia-ukraine-conflict/)\nactivity soon after hostilities broke out.\n\nMultiple sources have used Facebook and other social media outlets to try and gather a\nforce to conduct these attacks. Most notably, Yegor Aushev, co-founder of a cybersecurity\ncompany in Kyiv, [told Reuters he wrote a post calling for underground cyber defenders at](https://www.reuters.com/world/exclusive-ukraine-calls-hacker-underground-defend-against-russia-2022-02-24/)\nthe request of a senior Ukrainian Defense Ministry official who contacted him.\n\nTrustwave SpiderLabs has observed similar calls to cyber arms on the Dark Web. These\ninclude links to groups organizing to attack Russian entities, sites containing instructions on\nhow to conduct a DDoS attack, and a recommended DDoS attack target list.\n\n\n-----\n\n_A message in Arabic from the Stormous Telegram channel stating it had attacked the_\n_Ukraine Ministry of Foreign Affairs_\n\nThe Stormous group has also signaled that it won’t stand by and allow other entities, such\nas ransomware groups, to attack Russia. Stormous has declared it will respond to any\nattack against Russia, noting that if the attacks on Russia stop then, Stormous will halt its\nefforts.\n\n_A note from the Stormous Telegram channel_\n\n**A New Age of Cybercriminal**\n\n\n-----\n\nThe new style of threat group Stormous represents, being unafraid of -- and in fact seeking\npublic adulation -- can make its members more susceptible to being found and arrested.\n\nWhile there may be an upside from a clout and branding perspective to making hacking\nactivities public, law enforcement can use communications information to bring\ncybercriminals more swiftly to justice.\n\nTrustwave SpiderLabs will continue to track the threat of Stormous and group’s activities as\nmore information becomes available.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-29 - Stormous- The Pro-Russian, Clout Hungry Ransomware Gang Targets the US and Ukraine.pdf"
    ],
    "report_names": [
        "2022-04-29 - Stormous- The Pro-Russian, Clout Hungry Ransomware Gang Targets the US and Ukraine.pdf"
    ],
    "threat_actors": [
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2347282d-6b88-4fbe-b816-16b156c285ac",
            "created_at": "2024-06-19T02:03:08.099397Z",
            "updated_at": "2025-03-27T02:05:17.390442Z",
            "deleted_at": null,
            "main_name": "GOLD RAINFOREST",
            "aliases": [
                "Strawberry Tempest ",
                "Lapsus$"
            ],
            "source_name": "Secureworks:GOLD RAINFOREST",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536144,
    "ts_updated_at": 1743041651,
    "ts_creation_date": 1662026945,
    "ts_modification_date": 1662026945,
    "files": {
        "pdf": "https://archive.orkl.eu/9554808e2f36e2ed8203c9942c8511b85e3d08b5.pdf",
        "text": "https://archive.orkl.eu/9554808e2f36e2ed8203c9942c8511b85e3d08b5.txt",
        "img": "https://archive.orkl.eu/9554808e2f36e2ed8203c9942c8511b85e3d08b5.jpg"
    }
}