{
    "id": "9c9c4783-727b-4268-9021-1fe2d9f676bf",
    "created_at": "2023-01-12T15:08:02.097235Z",
    "updated_at": "2025-03-27T02:16:25.990624Z",
    "deleted_at": null,
    "sha1_hash": "e5437e37ba2abcf142ba643eaa3b224e29ff9f55",
    "title": "2022-03-03 - TeaBot Banking Trojan Posted as QR Code app in Google Play Store Targeting US Users",
    "authors": "",
    "file_creation_date": "2022-05-28T18:59:54Z",
    "file_modification_date": "2022-05-28T18:59:54Z",
    "file_size": 1312634,
    "plain_text": "# TeaBot Banking Trojan Posted as QR Code app in Google Play Store Targeting US Users\n\n**gbhackers.com/teabot-banking-trojan/**\n\nMarch 3, 2022\n\nAt the beginning of 2021, a new type of trojan called “Teabot” was found attacking users. The\ntrojan was specifically designed to steal the victim’s bank credentials and SMS messages.\n\nOther features of the trojan included Remote access capabilities and screen capturing via\nrequest-on-demand services. Threat actors have the ability to do account takeovers directly\nfrom compromised mobile devices. This technique is called “On-device fraud”.\n\nTeabot trojan was distributed through smashing campaigns where attackers used a lure list\nsuch as VLC media player, TeaTV, DHL and UPS, etc. Recent researches show that hackers\nhave used the Google Play store to distribute the “dropper applications”.\n\nReports suggest that the target list has expanded further including 400 applications that\ninvolve various banks, crypto exchanges or wallets, and digital insurances in countries like\nthe US, Russia, and Hong Kong.\n\n## Evolution and Distribution of TeaBot\n\nIn its initial stages in 2021, TeaBot was not fully developed. Nevertheless, hackers were\ndistributing it through smashing campaigns as mentioned before. Later, the trace was lost\nand the malware was found to be non-existent until February 21, 2022.\n\n\n-----\n\nResearchers at Cleafy were able to take a glimpse of a particular application that was\npublished on the Google Play store. Reviews seemed very legitimate with almost 10,000+\ndownloads. However, this application was found to be a TeaBot dropper application. The\ndropper was delivering TeaBot through fake update procedures.\n\nThe application was a QR code and Barcode Scanner Application published under the name\n“QR BarCode Scanner Bussiness LLC”. Users were giving feedback that the app was\ngood and well-functioning. The dropper was hiding behind the QR code scanner.\n\nOnce the victims install and open the app through the Google Play store, the app gives a\npop-up message that an update must be installed. When victims click on install, the\napplication downloads the dropper and installs another application on the victim’s device.\n\nLegitimate Play store apps will redirect to Google play store for any updates. The installed\napplication was found to be TeaBot trojan.\n\n\n-----\n\nSource : Cleafy\n\nCleafy labs reported that the second application which was named QR Code Scanner: Add**on is downloaded from two particular Github repositories owned by the user feleanicusor.**\n\nOn exploring further, the repositories had so many samples of TeaBot dated from Feb 17,\n2022.\n\nSource : Cleafy\n\n## Attack Chain of TeaBot\n\n\n-----\n\nTeabot s attack chain clearly states that attackers have been working on the sideloading and\nevasive techniques which start from the initial dropper application to the hosting of the\nmalicious payload.\n\nWhen the victims accept the download of the fake update, TeaBot installation procedures\ntake place. During the installation, it also asks for Accessibility services permission to get\nnecessary privileges. The application specifically asks for 2 permissions.\n\n**View and control Screen – This permission is acquired to view and control the screen**\non the victim’s device which is used for obtaining login credentials, 2FA codes, and to\nread SMS.\nView and Perform actions – This permission is described as interaction with an app.\nBut actually, it is required to perform malicious actions with the infected device.\n\nSource : Cleafy\n\n\n-----\n\n[A full detailed report on how threat Actors used strong obfuscation techniques to evade](https://www.cleafy.com/cleafy-labs/teabot-is-now-spreading-across-the-globe)\nantivirus software was published by Cleafy.\n\n### Leave a Reply\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-03 - TeaBot Banking Trojan Posted as QR Code app in Google Play Store Targeting US Users.pdf"
    ],
    "report_names": [
        "2022-03-03 - TeaBot Banking Trojan Posted as QR Code app in Google Play Store Targeting US Users.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536082,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653764394,
    "ts_modification_date": 1653764394,
    "files": {
        "pdf": "https://archive.orkl.eu/e5437e37ba2abcf142ba643eaa3b224e29ff9f55.pdf",
        "text": "https://archive.orkl.eu/e5437e37ba2abcf142ba643eaa3b224e29ff9f55.txt",
        "img": "https://archive.orkl.eu/e5437e37ba2abcf142ba643eaa3b224e29ff9f55.jpg"
    }
}