{
    "id": "9ca935b5-60dc-4de2-9fe3-9eb7848e75b3",
    "created_at": "2022-10-25T16:48:11.156598Z",
    "updated_at": "2025-03-27T02:16:59.329845Z",
    "deleted_at": null,
    "sha1_hash": "bbb2512ccf7681d73faa6a447fdbda1fb5da9b2d",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-10-11T15:16:20Z",
    "file_modification_date": "2019-10-11T15:16:20Z",
    "file_size": 440942,
    "plain_text": "# ESET discovers Attor, a spy platform with curious GSM fingerprinting\n\n**[welivesecurity.com/2019/10/10/eset-discovers-attor-spy-platform](https://www.welivesecurity.com/2019/10/10/eset-discovers-attor-spy-platform/)**\n\nOctober 10, 2019\n\nESET researchers discover a previously unreported cyberespionage platform used in targeted\nattacks against diplomatic missions and governmental institutions, and privacy-concerned users\n\n[Zuzana Hromcová 10 Oct 2019 - 11:30AM](https://www.welivesecurity.com/author/zhromcova/)\nESET researchers have discovered a new espionage platform with a complex\narchitecture, a host of measures to make detection and analysis more difficult and\ntwo notable features. First, its GSM plugin uses the AT command protocol, and\nsecond, it uses Tor for its network communications. ESET researchers thus named the\ncyberespionage platform Attor.\n\n# Targets\n\nAttor’s espionage operation is highly targeted – we were able to trace Attor’s operation back to at\nleast 2013, yet we only identified a few dozen victims. Despite that, we were able to learn more\nabout the intended victims by analyzing artifacts in the malware.\n\nFor example, in order to be able to report on the victim’s activities, Attor monitors active\nprocesses to take screenshots of selected applications. Only certain applications are targeted –\nthose with specific substrings in the process name or window title.\n\nBesides standard services such as popular web browsers, instant messaging applications and\nemail services, the list of targeted applications contains several Russian services, as detailed in\nTable 1.\n\n**Table 1. Domains misused in the campaign**\n\n**Process name/window title substring** **Context**\n\nОДНОКЛАССНИКИ (transl. Classmates) Russian social network (Odnoklass‐\nniki)\n\nAGENTVKONTAKTE [Russian social network (VKontakte)](https://vk.com/)\n\nWEBMONEY Online payment system used in\n[Russia (WebMoney)](https://www.webmoney.ru/)\n\n\nMAIL.YANDEX, ЯНДЕКС.ПОЧТА (transl. Yandex.Mail), MAIL.RU,\nPOCHTA (transl. Mail), MAGENT\n\n\n[Russian email services (Mail.ru,](https://mail.ru/)\n[Yandex.Mail)](https://mail.yandex.com/)\n\n\nПРИГЛАШЕНИЕ ДРУЖИТЬ (transl. Friend request) Russian text\n\nВАМ СООБЩЕНИЕ (transl. Message for you) Russian text\n\nMULTIFON Russian VoIP service\n\n\n-----\n\n**Table 1. Domains misused in the campaign**\n\nQIP, INFIUM [Russian IM application (QIP)](https://qip.ru/)\n\nRAMBLER [Russian search engine (Rambler)](https://www.rambler.ru/)\n\nThe list includes the two most popular social networks in Russia (Odnoklassniki, VKontakte) and\na VoIP service provided by a Russian telecom operator (Multifon). Our conclusion is that Attor is\nspecifically targeting Russian-speakers, which is further supported by the fact that most of the\ntargets are located in Russia, as seen in Figure 1. Other targets are located in Eastern Europe,\nand they include diplomatic missions and governmental institutions.\n\n\n_Figure 1. Countries affected by Attor_\n\n\nIn addition to its geographical and language targeting, Attor’s creators appear to be specifically\ninterested in users concerned about their privacy.\n\nAttor is configured to capture screenshots of encryption/digital signature utilities, the VPN service\nHMA, end‑to‑end encryption email services Hushmail and The Bat!, and the disk encryption utility\nTrueCrypt.\n\nThe victim’s usage of TrueCrypt is further inspected in another part of Attor. It monitors hard disk\ndevices connected to the compromised computer, and searches for the presence of TrueCrypt. If\nTrueCrypt is detected, its version is determined by sending IOCTLs to the TrueCrypt driver\n(0x222004 (TC_IOCTL_GET_DRIVER_VERSION) and 0x72018\n(TC_IOCTL_LEGACY_GET_DRIVER_VERSION)). As these are TrueCrypt-specific control\n\n\n-----\n\ncodes, not standard codes, the authors of the malware must actually understand the open-source\ncode of TrueCrypt installer. We have not seen this technique used before nor seen it documented\nin other malware.\n\n\n_Figure 2. The Device monitor plugin sends non-standard, TrueCrypt-specific control codes to the TrueCrypt driver, in order to_\n\n_determine the TrueCrypt version_\n\n\n# Platform architecture\n\nAttor consists of a dispatcher and loadable plugins, all of which are implemented as dynamic-link\nlibraries (DLLs). The first step of a compromise comprises dropping all these components on disk\nand loading the dispatcher DLL.\n\n\n-----\n\nThe dispatcher is the core of the whole platform – it serves as a management and\nsynchronization unit for the additional plugins. On each system start, it injects itself into almost all\nrunning processes and loads all available plugins within each of these processes. As an\nexception, Attor avoids injection into some system and security‑product‑related processes.\n\nAll plugins rely on the dispatcher for implementing basic functionalities. Rather than calling\nWindows API functions directly, the plugins use a reference to a helper function (a function\ndispatcher) implemented by the dispatcher DLL. A reference to the function dispatcher is passed\nto the plugins when they are loaded. Because the plugins are injected in the same process as the\ndispatcher itself, they share the same address space and are thus able to call this function\ndirectly.\n\nCalls to the function dispatcher take as their arguments the function type and its numerical\nidentifier. This design makes it harder to analyze individual components of Attor without having\naccess to the dispatcher, as it translates the specified identifier to a meaningful function that is\nthen executed.\n\nFigure 3 illustrates a part of one plugin, calling the function dispatcher on several occasions. In\nthe disassembly on the right, we have replaced the numeric identifiers (that we recovered by\nreverse-engineering the dispatcher) with descriptive names. Refer to our white paper for a full\nanalysis of the dispatcher’s interface.\n\n\n-----\n\n_Figure 3. Additional plugins use functions implemented in the main module, by calling the function dispatcher (dubbed_\n\n_helperFnc here)_\n\nFurthermore, the dispatcher is the only component of the platform that has access to the\nconfiguration data. Attor’s plugins retrieve their configuration data from the dispatcher via the\ninterface, as described above.\n\n# Plugins\n\nAttor’s plugins are delivered to the compromised computer as DLLs, asymmetrically encrypted\nwith RSA. The plugins are only fully recovered in memory, using the public RSA key embedded in\nthe dispatcher. As a result, it is difficult to obtain Attor’s plugins, and to decrypt them, without\n\n\n-----\n\nWe were able to recover eight of Attor s plugins, some in multiple versions – we list them in Table\n2. Assuming the numbering of plugins is continuous, and that actors behind Attor may use\ndifferent sets of plugins on a per‑victim basis, we suspect there are even more plugins that have\nnot yet been discovered.\n\n**Table 2. The analyzed plugins and their versions**\n\n**Plugin ID** **Analyzed versions** **Functionality**\n\n0x01 0x0E Device monitor\n\n0x02 (no version), 0x0C Screengrabber\n\n0x03 (no version), 0x08, 0x09, 0x0B, 0x0C Audio recorder\n\n0x05 0x0A File uploader\n\n0x06 0x0A Command dispatcher/SOCKS proxy\n\n0x07 0x02, 0x04, 0x09, 0x0A Key/clipboard logger\n\n0x0D 0x03 Tor client\n\n0x10 0x01 Installer/watchdog\n\nThe plugins are responsible for persistence of the platform (Installer/watchdog plugin), for\ncollecting sensitive information (Device monitor, Screengrabber, Audio recorder, Key/clipboard\nlogger) and for network communication with the C&C server (File uploader, Command\ndispatcher/SOCKS proxy, Tor client).\n\nAttor has built-in mechanisms for adding new plugins, for updating itself, and for automatically\nexfiltrating collected data and log files. These mechanisms are illustrated in Figure 4.\n\nIn the following sections, we focus on plugins responsible for the two notable features that gave\nAttor its name – GSM fingerprinting via AT commands, and elaborate network communication\nusing Tor.\n\n\n-----\n\n_Figure 4. Attor’s architecture. Note that ID 0x06 represents a single plugin, but the functionality is split here into two parts for_\n\n_clarity._\n\n\n# Network communication\n\nAttor’s espionage plugins collect sensitive data (such as a list of documents present on the disk)\nthat are ultimately exfiltrated to a remote server, but these plugins themselves do not\ncommunicate over the network.\n\nOnly two of Attor’s components communicate with its C&C server: File uploader and Command\ndispatcher.\n\nFiles collected by the “espionage plugins” (Device monitor, Screengrabber, Audio recorder, and\nKey/clipboard logger) are uploaded to the C&C server automatically by the File uploader plugin.\nThese plugins use a dedicated Upload folder as a central folder to store collected data, and other\nplugins use it to store log files.\n\nThe Command dispatcher plugin downloads commands and additional tools from the C&C server\nand interprets them. Again, it uses dedicated folders to store its data – most prominently, freshly\ndownloaded plugins and platform updates, and encrypted log data containing status/results of the\nexecuted commands.\n\nAttor’s dispatcher monitors the shared folders, and loads any new plugins and updates pushed to\nthe compromised computer.\n\nThis means that neither Attor’s dispatcher, nor espionage plugins, ever communicate with the\nC&C server – they only use local shared folders for storing data to be exfiltrated and for reading\nfurther instructions from the server\n\n\n-----\n\nBoth File uploader, and Command dispatcher use the same infrastructure to reach the remote\nserver – the network communication itself is scattered across four different Attor components,\neach implementing a different layer.\n\nAttor uses Tor: Onion Service Protocol, with an onion address for the C&C server. In order to\ncommunicate with the C&C server, any plugin must thus first establish a connection with the Tor\nclient plugin (listening on the non‑default 127.0.0.1:8045) which is responsible for resolving the\nonion domain, choosing a circuit and encrypting data in layers. The Tor client plugin is based on\nthe Tor client, and customized to the design of this malware (tor.exe with added interaction with\nAttor’s dispatcher).\n\nThe Tor client plugin must communicate with the dispatcher, which implements the cryptographic\nfunctions. Furthermore, it communicates with the SOCKS proxy plugin (listening on\n127.0.0.1:5153) that relays communications between the Tor client and the remote server.\n\nBoth File uploader and Command dispatcher use FTP; files are uploaded to/downloaded from an\nFTP server that is protected by credentials hardcoded in the configuration:\n\n**C&C server: idayqh3zhj5j243t[.]onion**\n**Username: do**\n**Password: [Redacted]**\n\nThe plugins log in to the FTP server and copy the collected data to, or download commands from,\na victim‑specific directory.\n\nIn total, the infrastructure for C&C communication spans four Attor components – the dispatcher\nproviding encryption functions, and three plugins implementing the FTP protocol, the Tor\nfunctionality and the actual network communication, as illustrated in Figure 5. This mechanism\nmakes it impossible to analyze Attor’s network communication unless all pieces of the puzzle\nhave been collected.\n\n\n-----\n\n_Figure 5. Four Attor components cooperate to enable communication with the C&C server_\n\nIt is important to note that Attor uses several additional tricks to hide its communications from the\nuser and security products:\n\nFirst, the C&C server is a Tor service, aiming for anonymity and untraceability.\n\nSecond, all network-communication-related plugins are only activated if running within the\nprocess of a web browser or an instant messaging application or other network applications (this\nis determined by checking the process name against a hardcoded list). This trick hides the\nexfiltration-related network communication in a stream of legitimate communications made by that\n\n\n-----\n\n# GSM fingerprinting\n\nThe most curious plugin in Attor’s arsenal collects information about both connected\nmodem/phone devices and connected storage drives, and about files present on these drives. It\nis responsible for collection of metadata, not the files themselves, so we consider it a plugin used\nfor device fingerprinting, and hence likely used as a base for further data theft.\n\nWhile Attor’s functionality of fingerprinting storage drives is rather standard, its fingerprinting of\nGSM devices is unique.\n\nWhenever a modem or a phone device is connected to a COM port, Device monitor uses AT\ncommands to communicate with the device, via the associated serial port.\n\nAT commands, also known as Hayes command set, were originally developed in the 1980s to\ncommand a modem to dial, hang up or change connection settings. The command set was\nsubsequently extended to support additional functionality, both standardized and vendor-specific.\n\n[In a recent paper, it was discovered that the commands are still in use in most modern](https://atcommands.org/sec18-tian.pdf)\nsmartphones. Those researchers were able to bypass security mechanisms and communicate\nwith smartphones using AT commands through their USB interface. Thousands of commands\nwere recovered and tested, including those to send SMS messages, emulate on-screen touch\nevents, or leak sensitive information. That research illustrates that the old‑school AT commands\npose a serious risk when misused.\n\nAs for Attor’s plugin, however, we may only speculate why AT commands are employed. We have\ndetected a 64‑bit version of this plugin in 2019, and we can confirm it is still a part of the newest\nAttor version (that we first saw in 2018). On the other hand, it seems unlikely it is targeting\nmodern smartphone devices. The plugin ignores devices connected via a USB port, and only\ncontacts those connected via a serial port (more precisely, devices whose friendly names match\n“COM*”).\n\nA more likely explanation of the plugin’s main motive is that it targets modems and older phones.\nAlternatively, it may be used to communicate with some specific devices (used by the victim or\ntarget organization) that are connected to the COM port or to the USB port using a USB-to-serial\nadaptor. In this scenario, it is possible the attackers have learned about the victim’s use of these\ndevices using some other reconnaissance techniques.\n\nIn any case, the plugin retrieves the following information from the connected devices, using the\nAT commands listed in Table 3:\n\nBasic information about the mobile phone or GSM/GPRS modem: name of manufacturer,\nmodel number, IMEI number and software version\nBasic information about the subscriber: MSISDN and IMSI number\n\n**Table 3. The commands of the AT protocol used by the Device monitor plugin**\n\n\n**AT com‐**\n**mand**\n\n\n**Functionality**\n\n\nAT Signals start of communication (AT for attention).\n\n\n-----\n\n**Table 3. The commands of the AT protocol used by the Device monitor plugin**\n\nAT+CGSN Requests IMEI number (International Mobile Equipment Identity), which is a unique number\nto identify a device.\n\nAT+CGMM Requests information about the model of the device (model number).\n\nAT+CGMI Requests name of the device manufacturer.\n\nAT+CGMR Requests the version of the software loaded on the device.\n\nAT+CNUM Requests MSISDN (Mobile Station International Subscriber Directory Number), which is the\nmapping of the telephone number to the subscriber identity module in a mobile or cellular\nphone.\n\nAT+CIMI Requests IMSI (International Mobile Subscriber Identity), which is a unique number identify‐\ning a GSM subscriber. This number has two parts. The initial part is comprised of six digits in\nthe North American standard and five digits in the European standard. It identifies the GSM\nnetwork operator in a specific country with whom the subscriber holds an account. The sec‐\nond part is allocated by the network operator to identify the subscriber uniquely.\n\nNote that many more (vendor-specific) AT commands exist that are not used by this plugin. It is\npossible that the malware operators use the listed commands to fingerprint the connected\ndevices, and then deploy another plugin with more specific commands to extract information from\nthe device.\n\n# Conclusion\n\nAttor is an espionage platform, used for highly targeted attacks against high-profile users in\nEastern Europe, and Russian-speaking, security-concerned users.\n\nThe malware, which has flown under the radar since 2013, has a loadable-plugin architecture that\ncan be used to customize the functionality to specific victims. It includes an unusual plugin for\nGSM fingerprinting that utilizes the rarely used AT command set, and incorporates Tor with the\naim of anonymity and untraceability.\n\nOur research provides a deep insight into the malware and suggests that it is well worth further\ntracking of the operations of the group behind it.\n\nESET detection names and other Indicators of Compromise for these campaigns can be found in\nthe full white paper: AT commands, TOR-based communications: Meet Attor, a fantasy creature\nand also a spy platform.\n\n_Acknowledgements to Anton Cherepanov, Peter Košinár, and Zoltán Rusnák_ _for their work on this_\n_investigation._\n\n# MITRE ATT&CK techniques\n\n**Tactic** **ID** **Name** **Description**\n\n\nExe‐\ncution\n\n\n[T1106](https://attack.mitre.org/techniques/T1106/) Execution\nthrough API\n\n\nAttor’s dispatcher uses CreateProcessW API for execution.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1129](https://attack.mitre.org/techniques/T1129/) Execution\nthrough\nModule\nLoad\n\n\nAttor’s dispatcher executes additional plugins by loading the respective\nDLLs.\n\n\n[T1085](https://attack.mitre.org/techniques/T1085/) Rundll32 Plugin 0x10 schedules rundll32.exe to load the dispatcher.\n\n\nPlugin 0x10 schedules rundll32.exe to be executed on each boot/logon,\nand subsequently to load the dispatcher.\n\nAttor’s dispatcher can be executed as a service.\n\nAttor’s dispatcher can establish persistence via adding a Registry key with\na logon script: HKEY_CURRENT_USER\\Environment\"UserInitMprLogon‐\nScript\".\n\n\nPer‐\nsis‐\ntence\n\nDe‐\nfense\nEva‐\nsion\n\n\n[T1053](https://attack.mitre.org/techniques/T1053/) Scheduled\nTask\n\n[T1035](https://attack.mitre.org/techniques/T1035/) Service\nExecution\n\n[T1037](https://attack.mitre.org/techniques/T1037/) Logon\nScripts\n\n\n[T1053](https://attack.mitre.org/techniques/T1053/) Scheduled\nTask\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfus‐\ncate/Decode\nFiles or\nInformation\n\n\n[T1050](https://attack.mitre.org/techniques/T1050/) New Service Attor’s dispatcher can establish persistence by registering a new service.\nHKEY_LOCAL_MACHINE\\SYSTEM\\*ControlSet*\\Control\\SafeBoot\\Mini‐\nmal registry keys are updated to execute the service even in Safe mode\nand Safe mode with networking.\n\n\nPlugin 0x10 schedules a new task that loads the dispatcher on boot/logon.\n\nStrings are encrypted with a XOR cipher, using a hardcoded key.\nConfiguration data, log files and plugins are encrypted using a hybrid en‐\ncryption scheme – Blowfish-OFB combined with RSA.\n\n\n[T1107](https://attack.mitre.org/techniques/T1107/) File Deletion The collected files and log files are deleted after exfiltration by plugin\n0x05.\n\n\n[T1158](https://attack.mitre.org/techniques/T1158/) Hidden Files\nand\nDirectories\n\n[T1036](https://attack.mitre.org/techniques/T1036/) Masquerad‐\ning\n\n[T1112](https://attack.mitre.org/techniques/T1112/) Modify\nRegistry\n\n[T1055](https://attack.mitre.org/techniques/T1055/) Process\nInjection\n\n[T1108](https://attack.mitre.org/techniques/T1108/) Redundant\nAccess\n\n\nThe attributes of log files and directories are set to HIDDEN/SYSTEM/AR‐\nCHIVE (or combination of those).\n\nAttor’s dispatcher disguises itself as a legitimate task (i.e., the task name\nand description appear legitimate).\n\nAttor’s dispatcher can modify the Run registry key.\n\nAttor’s dispatcher injects itself into running processes, to gain higher privi‐\nleges and to evade detection. It avoids specific system and Symantec\nprocesses.\n\nBoth 32-bit and 64-bit versions of Attor’s dispatcher are executed; also\nthey are injected into almost all processes.\nThere is a watchdog component, implemented in the dispatcher or as a\nseparate plugin, that reinstalls Attor if it has been removed.\n\n\n[T1099](https://attack.mitre.org/techniques/T1099/) Timestomp The time of last access to files and registry keys is manipulated after they\nhave been created/modified.\n\n\n[T1497](https://attack.mitre.org/techniques/T1497/) Virtualiza‐\ntion/Sand‐\nbox Evasion\n\n\nAttor can detect whether it is executed in some virtualized or emulated en‐\nvironments. If detected, it terminates itself immediately.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\nCre‐\nden‐\ntial\nAc‐\ncess\n\nDis‐\ncov‐\nery\n\nCol‐\nlec‐\ntion\n\nCom‐\nmand\nand\nCon‐\ntrol\n\nExfil‐\ntration\n\n\n[T1056](https://attack.mitre.org/techniques/T1056/) Input\nCapture\n\n[T1083](https://attack.mitre.org/techniques/T1083/) File and Di‐\nrectory\nDiscovery\n\n[T1120](https://attack.mitre.org/techniques/T1120/) Peripheral\nDevice\nDiscovery\n\n[T1082](https://attack.mitre.org/techniques/T1082/) System In‐\nformation\nDiscovery\n\n[T1123](https://attack.mitre.org/techniques/T1123/) Audio\nCapture\n\n[T1119](https://attack.mitre.org/techniques/T1119/) Automated\nCollection\n\n[T115](https://attack.mitre.org/techniques/T1115/) Clipboard\nData\n\n\n[T1056](https://attack.mitre.org/techniques/T1056/) Input\nCapture\n\n[T1113](https://attack.mitre.org/techniques/T1113/) Screen\nCapture\n\n[T1043](https://attack.mitre.org/techniques/T1043/) Commonly\nUsed Port\n\n[T1188](https://attack.mitre.org/techniques/T1188/) Multi-hop\nProxy\n\n[T1079](https://attack.mitre.org/techniques/T1079/) Multilayer\nEncryption\n\n[T1105](https://attack.mitre.org/techniques/T1105/) Remote File\nCopy\n\n[T1071](https://attack.mitre.org/techniques/T1071/) Standard\nApplication\nLayer\nProtocol\n\n[T1032](https://attack.mitre.org/techniques/T1032/) Standard\nCrypto‐\ngraphic\nProtocol\n\n[T1020](https://attack.mitre.org/techniques/T1020/) Automated\nExfiltration\n\n[T1022](https://attack.mitre.org/techniques/T1022/) Data\nEncrypted\n\n\nUser credentials can be collected by plugin 0x07 via capturing keystrokes.\n\nPlugin 0x01 enumerates files with specific extensions on all hard disk dri‐\nves and stores file information in encrypted log files.\n\nPlugin 0x01 collects information about inserted storage devices, modems\nand phone devices.\n\nAttor monitors the free disk space on the system.\n\nPlugin 0x03 is capable of recording audio using available input sound\ndevices.\n\nAttor automatically collects data about the compromised system.\n\nPlugin 0x07 collects data stored in the Windows clipboard by using the\nOpenClipboard and GetClipboardData APIs.\n\n\n[T1074](https://attack.mitre.org/techniques/T1074/) Data Staged Collected data is staged in a central upload directory prior to exfiltration.\n\n\nPlugin 0x07 captures keystrokes pressed within the window of the process\nwhere Attor is injected.\n\nPlugin 0x02 captures screenshots of target applications.\n\nAttor uses port 21 for C&C communication.\n\nAttor uses Tor for C&C communication.\n\nAttor sends encrypted traffic using Tor, which itself uses multiple layers of\nencryption.\n\nAttor can download additional plugins, updates and other files.\n\nFTP protocol is used for C&C communication.\n\nA combination of Blowfish-OFB and RSA is used for data encryption.\n\nExfiltration of the collected data and log files is done automatically by plug‐\nin 0x05.\n\nAttor encrypts data with a combination of Blowfish and RSA ciphers before\nsending it to the C&C server\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n\n[T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration\nOver Com‐\nmand and\nControl\nChannel\n\n\nAttor exfiltrates data over the C&C channel.\n\n\n[Zuzana Hromcová 10 Oct 2019 - 11:30AM](https://www.welivesecurity.com/author/zhromcova/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.10.10.Attor_GSM_fingerprinting_spy_platform/ESET%20discovers%20Attor%2C%20a%20spy%20platform%20with%20curious%20GSM%20fingerprinting%20_%20WeLiveSecurity.pdf"
    ],
    "report_names": [
        "ESET discovers Attor, a spy platform with curious GSM fingerprinting _ WeLiveSecurity"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a76ba723-d744-472a-b683-19d80e105d9f",
            "created_at": "2023-01-06T13:46:39.089347Z",
            "updated_at": "2025-03-27T02:00:02.994033Z",
            "deleted_at": null,
            "main_name": "Attor",
            "aliases": [],
            "source_name": "MISPGALAXY:Attor",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716491,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1570806980,
    "ts_modification_date": 1570806980,
    "files": {
        "pdf": "https://archive.orkl.eu/bbb2512ccf7681d73faa6a447fdbda1fb5da9b2d.pdf",
        "text": "https://archive.orkl.eu/bbb2512ccf7681d73faa6a447fdbda1fb5da9b2d.txt",
        "img": "https://archive.orkl.eu/bbb2512ccf7681d73faa6a447fdbda1fb5da9b2d.jpg"
    }
}