{
    "id": "9cae9752-554e-42ca-b66f-7abdb01ae7a3",
    "created_at": "2023-01-12T15:09:06.455778Z",
    "updated_at": "2025-03-27T02:14:13.70328Z",
    "deleted_at": null,
    "sha1_hash": "f9d2ef0bb75664eb7acebe6573d4e92a918faef6",
    "title": "2022-02-28 - Trellix Global Defenders- Analysis and Protections for BlackByte Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T16:16:33Z",
    "file_modification_date": "2022-05-28T16:16:33Z",
    "file_size": 983415,
    "plain_text": "# Trellix Global Defenders: Analysis and Protections for BlackByte Ransomware\n\n**trellix.com/en-us/about/newsroom/stories/threat-labs/trellix-global-defenders-analysis-and-protections-for-blackbyte-**\nransomware.html\n\n## Stories\n\nThe latest cybersecurity trends, best practices,\n\nsecurity vulnerabilities, and more\n\nBy [Taylor Mullins · February 28, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/taylor-mullins.html)\n\n\n-----\n\nBlackByte Ransomware has been in the news of late due to a successful attack against a\nNational Football League (NFL) Franchise and a Joint Cybersecurity Advisory by the\nFederal Bureau of Investigation (FBI) and the U.S. Secret Service (USSS) warning on\nbreaches to the networks of at least three organizations from US critical infrastructure\nsectors in the last three months. BlackByte Ransomware is currently being offered to threat\nactors as a Ransomware-as-a-Service (RaaS) and makes use of PowerShell and Windows\nCLI commands to carry out various tasks such as network discovery, task scheduling and to\ncreate and disable Windows and security services.\n\nBlackByte Ransomware makes files inaccessible by encrypting them and generates a\nransom note (the \"BlackByte_restoremyfiles.hta\" file) that contains instructions on how to\ncontact the attackers for data decryption and other details. Also, BlackByte appends the\n\".blackbyte\" extension to the names of encrypted files. BlackByte does have worming\ncapabilities and can infect additional endpoints on the same network.\n\n**Figure 1. MITRE ATT&CK Framework for BlackByte Ransomware**\n\n## Recommended Steps to Prevent Initial Access\n\nThe Joint Cybersecurity Advisory provides several recommendations to secure your\nenvironment against BlackByte that were gathered from their analysis of malware samples\ndiscovered in the wild.\n\nBlackByte operators have been observed exploiting the following CVEs to gain initial\naccess, patching is recommended to prevent exploitation.\n\n[CVE-2021-34473 - Microsoft Exchange Server Remote Code Execution](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-34473)\nVulnerability\n[CVE-2021-34523 - Microsoft Exchange Server Elevation of Privilege](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-34523)\nVulnerability\n[CVE-2021-31207 - Microsoft Exchange Server Security Feature Bypass](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-31207)\nVulnerability\n\n\n-----\n\nBlocking IP Addresses known to download additional payloads in BlackByte attacks\nprior to encryption: 185.93.6.31 and 45.9.148.114.\nDisable unused remote access/Remote Desktop Protocol (RDP) ports and monitor\nremote access/RDP logs for any unusual activity.\nAfter gaining access to the service accounts some adversaries have utilized AnyDesk\nfor lateral movement, monitoring for AnyDesk activity can be an early indicator of\ncompromise if AnyDesk is not utilized or allowed by your organization.\nReview domain controllers, servers, workstations, and active directories for new or\nunrecognized user accounts.\nDisable hyperlinks in received emails.\n\nJoint Cybersecurity Advisory: Indicators of Compromise Associated with BlackByte\nRansomware\n\n## Trellix Protections and Global Detections\n\nTrellix Global Threat Intelligence is currently detecting all known analyzed indicators for this\ncampaign.\n\n**Figure 2. Trellix Products**\n\n**detecting this threat globally. Source: MVISION Insights**\n\n## Blocking BlackByte Attacks with Endpoint Security\n\nTrellix ENS is currently detecting BlackByte Indicators of Compromise (IOCs) from the\nstandpoint of signature detections and the malware behavior associated with BlackByte\nRansomware attacks. The following Exploit Prevention Rule in ENS has shown success in\nstopping BlackByte samples due to BlackByte being Script-based. Trellix always\nrecommends testing in Report Only Mode before blocking to confirm no false positives are\nbeing detected by this signature rule\n\n\n-----\n\n### Exploit Prevention Signature ID 6207: ASR : File Download attempt by Scripts\n\n**Figure 3. Exploit Prevention Rule in ePolicy Orchestrator/MVISION ePO**\n\n**Figure 4. MVISION EDR noting where Endpoint Protection (ENS) could have stopped**\n**specific techniques**\n\n\n-----\n\n**Figure 5. Ransomware Detection Name and Observed Detections noted in MVISION**\n**Insights**\n\n## BlackByte Threat Intelligence from the Trellix Advanced Threat Research Team and MVISION Insights\n\nMVISION Insights will provide the current threat intelligence and known indicators for\nBlackByte Ransomware. MVISION Insights will alert to detections and Process Traces that\nhave been observed and systems that require additional attention to prevent widespread\ninfection. MVISION Insights will also include Hunting Rules for threat hunting and further\nintelligence gathering of the threat activity and adversary.\n\n### MVISION Insights Campaign Names: Cybersecurity Advisory - BlackByte Ransomware and JavaScript Malware Threat Landscape\n\n**Figure 6. Campaign Details, Analyzed Indicators of Compromise, and Detections**\n\n\n-----\n\n**Figure 7. Hunting Rules for BlackByte Ransomware in MVISION Insights**\n\n## Detecting Malicious Activity with MVISION EDR\n\nMVISION EDR is currently monitoring for the activity associated with BlackByte\nRansomware and will note the MITRE techniques and any suspicious indicators related to\nthe adversarial activity. Several of the techniques outlined in the Joint Advisory that are\nobserved with BlackByte are noted below, monitoring for this type of activity can point to\nactivity associated with the Tactics, techniques, and procedures (TTPs) for BlackByte.\n\n**Figure 8. Network Connection to Known Malicious IP Address Associated with**\n**BlackByte**\n\n\n-----\n\n**Figure 9. Enabling of remote registry for possible preparation of Lateral Movement**\n\n**Figure 10. Deletion of Shadow Copy to inhibit system recovery**\nTrellix offers Threat Intelligence Briefings along with Cloud Security and Data Protection\nworkshops to provide customers with best practice recommendations on how to utilize their\nexisting security controls to protect against adversarial and insider threats, please reach out\nif you would like to schedule a workshop with your organization.\n\n### Featured Content\n\nPERSPECTIVES\n\n### Our CEO On Living Security\n\n[By Bryan Palma · January 19 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/bryan-palma.html)\n\n\n-----\n\nTrellix CEO, Bryan Palma, explains the critical need for security that s always learning.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/perspectives/our-ceo-on-living-security.html)\n\nXDR\n\n### Time to Drive Change by Challenging the Challengers\n\nBy [Michelle Salvado · January 19, 2022](https://www.trellix.com/en-us/about/newsroom/stories/contributors/michelle-salvado.html)\n\nDynamic threats call for dynamic security – the path to resiliency lies in XDR.\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/xdr/time-to-drive-change-by-challenging-the-challengers.html)\n\nTHREAT LABS\n\n### 2022 Threat Predictions\n\nBy Trellix · January 19, 2022\n\nWhat cyber security threats should enterprises look out for in 2022?\n\n[Read More](https://www.trellix.com/en-us/about/newsroom/stories/threat-labs/2022-threat-predictions.html)\n\n## Get the latest\n\nWe’re no strangers to cybersecurity. But we are a new company.\n\nStay up to date as we evolve.\n\nPlease enter a valid email address.\n\nZero spam. Unsubscribe at any time.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-28 - Trellix Global Defenders- Analysis and Protections for BlackByte Ransomware.pdf"
    ],
    "report_names": [
        "2022-02-28 - Trellix Global Defenders- Analysis and Protections for BlackByte Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536146,
    "ts_updated_at": 1743041653,
    "ts_creation_date": 1653754593,
    "ts_modification_date": 1653754593,
    "files": {
        "pdf": "https://archive.orkl.eu/f9d2ef0bb75664eb7acebe6573d4e92a918faef6.pdf",
        "text": "https://archive.orkl.eu/f9d2ef0bb75664eb7acebe6573d4e92a918faef6.txt",
        "img": "https://archive.orkl.eu/f9d2ef0bb75664eb7acebe6573d4e92a918faef6.jpg"
    }
}