{
    "id": "9ce516bc-c05f-4a36-8292-402f137dbdd0",
    "created_at": "2023-01-12T15:03:00.636665Z",
    "updated_at": "2025-03-27T02:12:11.126399Z",
    "deleted_at": null,
    "sha1_hash": "e8e03606fe578c308e4b086f82f1076bfef16bc9",
    "title": "2016-07-01 - KeyBase - A New Keylogger on the Block",
    "authors": "",
    "file_creation_date": "2022-05-28T21:41:41Z",
    "file_modification_date": "2022-05-28T21:41:41Z",
    "file_size": 2756861,
    "plain_text": "# New Keylogger on the Block\n\n**[virusbulletin.com/virusbulletin/2016/07/new-keylogger-block/](https://www.virusbulletin.com/virusbulletin/2016/07/new-keylogger-block/)**\n\n### Gabor Szappanos\n\nSophos, Hungary\n\n_Copyright © 2016 Virus Bulletin_\n\nTable of contents\n\nIntroduction\n\nKeyBase Builder\n\nKeyBase Server Side\n\nKeyBase Campaign\n\nReferences\n\n## Introduction\n\nKeyBase is a trending payload in several of today's malware groups. In fact, we have seen\nevidence that all of the Office exploit kits (MWI, AK-1, AK-2, DL-1 and DL-2) have been\nused to distribute it. A detailed description of these Office kits can be found in [1].\n\nOne of the incidents related to the KeyBase trojan was described in [2], while a very\ndetailed and extensive listing of incidents was published in [3]. Its significance is being\nrecognized, and recently Team Cymru started tracking KeyBase C&C activity [4].\n\nIn this paper we provide an overview of KeyBase, both the keylogger itself and the serverside management component. Additionally, we will look at an example of when this trojan\nwas used.\n\n## KeyBase Builder\n\nKeyBase is a commercial product (i.e. it is sold for money, which does not necessarily\nmeans that it is legitimate). The original homepage of the product was\nhttp://www.keybase.in/ (note that, despite the fact that the URL differs only by one\ncharacter, it is not related in any way to the popular public key store keybase.io).\n\nHowever, the project has been shut down due to its increased use by criminals.\n\n\n-----\n\nFigure 1: The project has been shut down.\n\nThis move hasn't stopped the criminals from using the keylogger in their campaigns though.\nEven now (at the time of writing: June 2016) we are seeing new instances being distributed.\n\nThe Wayback Machine web archive stores earlier versions of the site, which give us some\nhints about the capabilities of the tool [5].\n\nKeyBase is more than just a simple keylogger, it is a complete credential stealing suite.\nAside from stealing credentials from all popular web browsers and email clients, KeyBase is\nalso capable of storing keystrokes and clipboard content, and screenshots can also be\ncreated with it.\n\nPasswords are stolen from a long list of applications which include the most popular web\nbrowsers and email clients.\n\n\n-----\n\nFigure 2: Passwords are stolen from a long list of applications.\n\nPassword stealing is not an original development in the product. This functionality is\noutsourced using the MailPassView and WebBrowserPassView utilities from Nirsoft [6] – as\nin most other contemporary credential stealers (e.g. Predator Pain, Hawkeye, iSpy).\n\nThe Nirsoft utilities are stored in encrypted form (using the AES algorithm) and extracted\nand executed on the fly when needed, as shown in Figure 3.\n\n\n-----\n\nFigure 3: The Nirsoft utilities are stored in encrypted form and extracted and executed on\nthe fly.\n\nIn this example the email stealer is stored as a resource called 'Recovermail'. Figure 4\nshows the version information of the embedded utilities.\n\nFigure 4: Version information of the embedded utilities.\n\nScreenshots are taken periodically and uploaded to the server. It is even possible, using the\nInstaLogging feature, to specify which applications trigger the screenshot (see Figure 5).\n\n\n-----\n\nFigure 5: The InstaLogging feature specifies\n\nwhich applications trigger the screenshot.\n\nIn most cases the screenshot feature is turned off, which is probably to save disk space on\nthe server side – KeyBase can easily create thousands of screenshots, which consume\nseveral gigabytes of disk space.\n\nAs shown in Figure 6, the uploading of clipboard content is configurable, and a self-destruct\ndate can even be specified for time-limited operations (see Figure 7).\n\n\n-----\n\nFigure 6:\n\nClipboard content uploading.\n\nFigure 7: A self-destruction date can be specified for time‑limited operations.\n\nMost of the keyloggers we see today support multiple submission methods for stolen data;\nthese are usually email, FTP and web upload. KeyBase supports only one of these, web\nupload.\n\n\n-----\n\nOnce the installation of the trojan is complete, it sends back a notification to the server (as\nan HTTP GET request sent to the server side PHP script) (see Figure 8).\n\nFigure 8: Once the installation of the trojan is complete it sends back a notification.\n\nThen it periodically sends the collected keystrokes and other information in the same way\n(Figure 9).\n\nFigure 9: Periodically it sends the collected keystrokes and other information.\n\nInterestingly, even though most of the strings are encrypted in the source of the trojan\n(using a slightly modified Vigenere cypher), and are thus hidden from simple analysis tools,\nthe web panel URL is stored in plain text.\n\nFigure 10: The web panel URL is stored in plain text.\n\nAn interesting feature is that the password for encrypting the string variables is not specified\nin plain text (which would make it relatively easy to guess/crack), but instead is derived from\na bitmap when generating the trojan with the builder. Clicking within the map sets the\npassword.\n\n\n-----\n\nFigure 11: The password for encrypting the string variables is derived from a bitmap.\n\n## KeyBase Server Side\n\nAlthough it falls short compared with other common keyloggers in terms of submission\nfeatures, one clear advantage of KeyBase is a user-friendly server-side interface, Keypanel,\nwhich starts with a login page, as shown in Figure 12.\n\nFigure 12: KeyBase login.\n\nA successful login leads to a dashboard (Figure 13), which summarizes the information\ncollected from the infected victims, listing separately the infected computers, collected\npasswords, logged keystrokes and uploaded screenshots.\n\n\n-----\n\nFigure 13: A dashboard summarizes the available information collected from the infected\nvictims.\n\nFrom here it is possible to access the uploaded clipboard content (Figure 14) and the stolen\npasswords (Figure 15), or browse the screenshots (Figure 16).\n\nFigure 14: The uploaded clipboard content can be accessed.\n\n\n-----\n\nFigure 15: The stolen passwords can be accessed.\n\n\n-----\n\nFigure 16: The screenshots can be browsed.\n\nHaving access to all of this data is just the beginning, the real activities start when the\ncriminals begin to use the stolen information in their schemes.\n\nThe stolen data is typically used in supply chain hijacking attacks, similar to the one\ndescribed in [7], which features a different keylogger, Hawkeye.\n\n## KeyBase Campaign\n\n\n-----\n\nAs examples we take a series of KeyBase trojan variants that sent stolen data to the\njobme.eu server.\nThese trojans were distributed in email messages like the one shown in Figure 17.\n\nFigure 17: KeyBase trojan distribution email.\n\nThe trojan was attached to the email as a Windows executable packed in a ZIP archive. In\nthis case Office exploits were not used in the distribution, instead the criminals relied on\ntraditional social engineering.\n\nIn another case we couldn't recover the original email, but we know that the trojan was\ndistributed by email, once again in an archive. This time the archive was named\n'enquiry_shipsrv_047pdf.gz' (even though the file extension suggests it was a gzip archive,\nit was really a renamed ZIP file).\n\n_VirusTotal data suggests that the original email had the following text:_\n\n\n-----\n\n```\nFrom: PT Indofuels Limited\nSent: Monday, 19 October, 2015 4:08 PM\n*Blank out*\nSubject: Request for Quotation\nHello sir,\nWe just sent you our Request for Quotation via ShipServ.\nAttached please find additional data, as announced in our ShipServ inquiry.\nWe are looking forward to receiving your quotation.\nBest regards\nMr Tse Lenora\nDirector\nPT Indofuels Limited\nTel : +852 31889879\nEmail : [email protected]\nWebsite : http://www.indofuels.com\n======================================================\nNotice:\n(1) It is not SPAM/Junk Mail but only regular e-mail of shipping & chartering\nbusiness;\n(2) If you are not interested in these biz areas and do not want to receive our mail\nagain, please inform us;\n(3) Please consider the environment before printing this e-mail.\n\n```\nWhen the victim opens and executes the attachment, the trojan activates and installs itself\non the computer, then creates a link in the user's %STARTUP% directory. This way, the\nkeylogger will execute every time the computer is turned on.\n\nOn the server we found multiple installations of the server‑side panel.\n\n\n-----\n\nFigure 18: Multiple installations of the server-side panel.\n\nHere, each of the subfolders (except for cgi-bin and tmp) contained a separate control\npanel. A possible reason for this is to separate different malware distribution campaigns.\nWe were able to identify a couple of samples that connected to some of the panels.\n\n**SHA1** **Drop folder/panel**\n\n2243661696ef0a519c6583ac1ab2e14088fe476f roko\n\n\nf73dc85a3506a11e4dbbeda5e4e69109bd9a2ffe\n6d6d2002f8841fa605fc51f749bacb6bd50b7678\n\n\nocha\n\n\nThe majority of the panels were empty – either the campaign didn't start or the logs had\nalready been deleted.\n\n\n-----\n\nFigure 19: The majority of the panels were empty.\n\nEven though a typical campaign in this operation affected only a few dozen computers, the\ncriminals managed to collect a lot of password and keystrokes (and skipped the\nscreenshots, possibly to spare server storage).\n\nFigure 20: The criminals managed to collect a lot of password and keystrokes.\n\nIt is generally observable with KeyBase (and other keylogger) campaigns that the criminals\nkeep the number of infected hosts low – in the dozens. This gives them a manageable\namount of data and number of victims, for when they (usually) engage in invoice hijacking\nactions.\n\n\n-----\n\nThe target distribution of the KeyBase campaigns tied to the jobmen.eu domain is illustrated\nin Figure 21. The main targets were in Asia, India, Indonesia, Bangladesh and Djibouti.\n\nFigure 21: The main targets were in Asia, India, Indonesia, Bangladesh and Djibouti.\n\nWe don't have information on the actual use of the credentials, but it is likely that the\ncriminals were engaged in a supply chain hijacking operation, much like that described in\n\n[7].\n\n## References\n\n[1] https://blogs.sophos.com/2016/04/20/sophoslabs-investigates-the-most-popularmicrosoft-office-exploit-kits/.\n\n[2] [http://th3l4b.blogspot.ie/2015/10/keybase-loggerclipboardcredsstealer.html.](https://th3l4b.blogspot.ie/2015/10/keybase-loggerclipboardcredsstealer.html)\n\n[3] http://researchcenter.paloaltonetworks.com/2016/02/keybase-threat-grows-despitepublic-takedown-a-picture-is-worth-a-thousand-words/.\n\n[4] https://blog.team-cymru.org/2016/02/keybase-malware-family-added-to-team-cymrubotnet-analysis-and-reporting-service-bars/.\n\n[5] [https://web.archive.org/web/20150623002553/http://www.keybase.in/.](https://web.archive.org/web/20150623002553/http://www.keybase.in/)\n\n[6] [http://www.nirsoft.net/utils/index.html#password_utils.](https://www.nirsoft.net/utils/index.html#password_utils)\n\n[7] https://nakedsecurity.sophos.com/2016/02/29/the-hawkeye-attack-how-cybercrookstarget-small-businesses-for-big-money/.\n\n## Latest articles:\n\n\n-----\n\n### Cryptojacking on the fly: TeamTNT using NVIDIA drivers to mine cryptocurrency\n\nTeamTNT is known for attacking insecure and vulnerable Kubernetes deployments in order\nto infiltrate organizations’ dedicated environments and transform them into attack\nlaunchpads. In this article Aditya Sood presents a new module introduced by…\n\n### Collector-stealer: a Russian origin credential and information extractor\n\nCollector-stealer, a piece of malware of Russian origin, is heavily used on the Internet to\nexfiltrate sensitive data from end-user systems and store it in its C&C panels. In this article,\nresearchers Aditya K Sood and Rohit Chaturvedi present a 360…\n\n### Fighting Fire with Fire\n\nIn 1989, Joe Wells encountered his first virus: Jerusalem. He disassembled the virus, and\nfrom that moment onward, was intrigued by the properties of these small pieces of selfreplicating code. Joe Wells was an expert on computer viruses, was partly…\n\n### Run your malicious VBA macros anywhere!\n\nKurt Natvig wanted to understand whether it’s possible to recompile VBA macros to another\nlanguage, which could then easily be ‘run’ on any gateway, thus revealing a sample’s true\nnature in a safe manner. In this article he explains how he recompiled…\n\n### Dissecting the design and vulnerabilities in AZORult C&C panels\n\nAditya K Sood looks at the command-and-control (C&C) design of the AZORult malware,\ndiscussing his team's findings related to the C&C design and some security issues they\nidentified during the research.\n\n[Bulletin Archive](https://www.virusbulletin.com/virusbulletin/archive)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2016/2016-07-01 - KeyBase - A New Keylogger on the Block.pdf"
    ],
    "report_names": [
        "2016-07-01 - KeyBase - A New Keylogger on the Block.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535780,
    "ts_updated_at": 1743041531,
    "ts_creation_date": 1653774101,
    "ts_modification_date": 1653774101,
    "files": {
        "pdf": "https://archive.orkl.eu/e8e03606fe578c308e4b086f82f1076bfef16bc9.pdf",
        "text": "https://archive.orkl.eu/e8e03606fe578c308e4b086f82f1076bfef16bc9.txt",
        "img": "https://archive.orkl.eu/e8e03606fe578c308e4b086f82f1076bfef16bc9.jpg"
    }
}