{
    "id": "9d326174-c31b-4ddf-9e0f-ca9ebf0dcd82",
    "created_at": "2023-01-12T15:08:44.942724Z",
    "updated_at": "2025-03-27T02:16:41.427026Z",
    "deleted_at": null,
    "sha1_hash": "2aad47a5ac2a122482e8d6deda289ca03f207198",
    "title": "2022-02-18 - How a Saudi woman's iPhone revealed hacking around the world",
    "authors": "",
    "file_creation_date": "2022-05-28T19:08:12Z",
    "file_modification_date": "2022-05-28T19:08:12Z",
    "file_size": 201290,
    "plain_text": "# How a Saudi woman's iPhone revealed hacking around the world\n\n**[reuters.com/technology/how-saudi-womans-iphone-revealed-hacking-around-world-2022-02-17/](https://www.reuters.com/technology/how-saudi-womans-iphone-revealed-hacking-around-world-2022-02-17/)**\n\nJoel Schectman, Christopher Bing\n\n1/4\nSaudi activist Loujain al-Hathloul makes her way to appear at a special criminal court for an\nappeals hearing, in Riyadh, Saudi Arabia March 10, 2021. REUTERS/Ahmed Yosri\n\nRegister now for FREE unlimited access to Reuters.com\n\nWASHINGTON, Feb 17 (Reuters) - A single activist helped turn the tide against NSO Group,\none of the world’s most sophisticated spyware companies now facing a cascade of legal\naction and scrutiny in Washington over damaging new allegations that its software was used\nto hack government officials and dissidents around the world.\n\nIt all started with a software glitch on her iPhone.\n\nAn unusual error in NSO’s spyware allowed Saudi women’s rights activist Loujain al-Hathloul\nand privacy researchers to discover a trove of evidence suggesting the Israeli spyware\nmaker had helped hack her iPhone, according to six people involved in the incident. A\nmysterious fake image file within her phone, mistakenly left behind by the spyware, tipped off\nsecurity researchers.\n\nRegister now for FREE unlimited access to Reuters.com\n\n\n-----\n\nThe discovery on al-Hathloul s phone last year ignited a storm of legal and government\naction that has put NSO on the defensive. How the hack was initially uncovered is reported\nhere for the first time.\n\nAl-Hathloul, one of Saudi Arabia’s most prominent activists, is known for helping lead a\ncampaign to end the ban on women drivers in Saudi Arabia. She was released from jail in\n[February 2021 on charges of harming national security. read more](https://www.reuters.com/world/who-is-saudi-human-rights-activist-loujain-al-hathloul-2021-02-10/)\n\nSoon after her release from jail, the activist received an email from Google warning her that\nstate-backed hackers had tried to penetrate her Gmail account. Fearful that her iPhone had\nbeen hacked as well, al-Hathloul contacted the Canadian privacy rights group Citizen Lab\nand asked them to probe her device for evidence, three people close to al-Hathloul told\nReuters.\n\nAfter six months of digging through her iPhone records, Citizen Lab researcher Bill Marczak\nmade what he described as an unprecedented discovery: a malfunction in the surveillance\nsoftware implanted on her phone had left a copy of the malicious image file, rather than\ndeleting itself, after stealing the messages of its target.\n\nHe said the finding, computer code left by the attack, provided direct evidence NSO built the\nespionage tool.\n\n“It was a game changer,” said Marczak “We caught something that the company thought was\nuncatchable.”\n\nBill Marczak poses for a portrait at Berkeley's university campus in Berkeley, California, U.S.,\nJanuary 26, 2022. Picture taken on January 26, 2022. REUTERS/Carlos Barria\n[The discovery amounted to a hacking blueprint and led Apple Inc (AAPL.O) to notify](https://www.reuters.com/companies/AAPL.O)\nthousands of other state-backed hacking victims around the world, according to four people\nwith direct knowledge of the incident.\n\nCitizen Lab and al-Hathloul’s find provided the basis for Apple’s November 2021 lawsuit\nagainst NSO and it also reverberated in Washington, where U.S. officials learned that NSO’s\ncyberweapon was used to spy on American diplomats.\n\nIn recent years, the spyware industry has enjoyed explosive growth as governments around\nthe world buy phone hacking software that allows the kind of digital surveillance once the\npurview of just a few elite intelligence agencies.\n\nOver the past year, a series of revelations from journalists and activists, including the\ninternational journalism collaboration Pegasus Project, has tied the spyware industry to\nhuman rights violations, fueling greater scrutiny of NSO and its peers.\n\n\n-----\n\nBut security researchers say the al-Hathloul discovery was the first to provide a blueprint of a\npowerful new form of cyberespionage, a hacking tool that penetrates devices without any\ninteraction from the user, providing the most concrete evidence to date of the scope of the\nweapon.\n\nIn a statement, an NSO spokesperson said the company does not operate the hacking tools\nit sells – “government, law enforcement and intelligence agencies do.” The spokesperson did\nnot answer questions on whether its software was used to target al-Hathloul or other\nactivists.\n\nBut the spokesperson said the organizations making those claims were “political opponents\nof cyber intelligence,” and suggested some of the allegations were “contractually and\ntechnologically impossible.” The spokesperson declined to provide specifics, citing client\nconfidentiality agreements.\n\nWithout elaborating on specifics, the company said it had an established procedure to\ninvestigate alleged misuse of its products and had cut off clients over human rights issues.\n\nA man walks past the logo of Israeli cyber firm NSO Group at one of its branches in the\nArava Desert, southern Israel July 22, 2021. REUTERS/Amir Cohen\n\n## DISCOVERING THE BLUEPRINT\n\nAl-Hathloul had good reason to be suspicious - it was not the first time she was being\nwatched.\n\nA 2019 Reuters investigation revealed that she was targeted in 2017 by a team of U.S.\nmercenaries who surveilled dissidents on behalf of the United Arab Emirates under a secret\nprogram called Project Raven, which categorized her as a “national security threat” and\nhacked into her iPhone.\n\nShe was arrested and jailed in Saudi Arabia for almost three years, where her family says\nshe was tortured and interrogated utilizing information stolen from her device. Al-Hathloul\nwas released in February 2021 and is currently banned from leaving the country.\n\nReuters has no evidence NSO was involved in that earlier hack.\n\nAl-Hathloul’s experience of surveillance and imprisonment made her determined to gather\nevidence that could be used against those who wield these tools, said her sister Lina alHathloul. “She feels she has a responsibility to continue this fight because she knows she\ncan change things.”\n\nThe type of spyware Citizen Lab discovered on al-Hathloul’s iPhone is known as a “zero\nclick,” meaning the user can be infected without ever clicking on a malicious link.\n\n\n-----\n\nZero-click malware usually deletes itself upon infecting a user, leaving researchers and tech\ncompanies without a sample of the weapon to study. That can make gathering hard evidence\nof iPhone hacks almost impossible, security researchers say.\n\nBut this time was different.\n\nThe software glitch left a copy of the spyware hidden on al-Hathloul’s iPhone, allowing\nMarczak and his team to obtain a virtual blueprint of the attack and evidence of who had built\nit.\n\n“Here we had the shell casing from the crime scene,” he said.\n\nMarczak and his team found that the spyware worked in part by sending picture files to alHathloul through an invisible text message.\n\nThe image files tricked the iPhone into giving access to its entire memory, bypassing security\nand allowing the installation of spyware that would steal a user's messages.\n\nThe Citizen Lab discovery provided solid evidence the cyberweapon was built by NSO, said\nMarczak, whose analysis was confirmed by researchers from Amnesty International and\nApple, according to three people with direct knowledge of the situation.\n\nThe spyware found on al-Hathloul’s device contained code that showed it was\ncommunicating with servers Citizen Lab previously identified as controlled by NSO, Marczak\nsaid. Citizen Lab named this new iPhone hacking method \"ForcedEntry.\" The researchers\nthen provided the sample to Apple last September.\n\nHaving a blueprint of the attack in hand allowed Apple to fix the critical vulnerability and led\nthem to notify thousands of other iPhone users who were targeted by NSO software, warning\nthem they had been targeted by “state-sponsored attackers.”\n\nIt was the first time Apple had taken this step.\n\nSaudi women's rights activist Loujain al-Hathloul is seen in this undated handout picture.\nMarieke Wijntjes/Handout via REUTERS\nWhile Apple determined the vast majority were targeted through NSO’s tool, security\nresearchers also discovered spy software from a second Israeli vendor QuaDream leveraged\nthe same iPhone vulnerability, Reuters reported earlier this month. QuaDream has not\n[responded to repeated requests for comment. read more](https://www.reuters.com/technology/exclusive-iphone-flaw-exploited-by-second-israeli-spy-firm-sources-2022-02-03/)\n\nThe victims ranged from dissidents critical of Thailand's government to human rights activists\nin El Salvador.\n\nCiting the findings obtained from al-Hathloul’s phone, Apple sued NSO in November in\nfederal court alleging the spyware maker had violated U.S. laws by building products\ndesigned “to target, attack, and harm Apple users, Apple products, and Apple.” Apple\n\n\n-----\n\ncredited Citizen Lab with providing technical information used as evidence for the lawsuit,\nbut did not reveal that it was originally obtained from al-Hathloul's iPhone.\n\nNSO said its tools have assisted law enforcement and have saved \"thousands of lives.\" The\ncompany said some of the allegations attributed to NSO software were not credible, but\ndeclined to elaborate on specific claims citing confidentiality agreements with its clients.\n\nAmong those Apple warned were at least nine U.S. State Department employees in Uganda\nwho were targeted with NSO software, according to people familiar with the matter, igniting a\nfresh wave of criticism against the company in Washington.\n\nIn November, the U.S. Commerce Department placed NSO on a trade blacklist, restricting\nAmerican companies from selling the Israeli firm software products, threatening its supply\n[chain. read more](https://www.reuters.com/technology/us-blacklists-four-companies-israel-russia-singapore-citing-spyware-2021-11-03/)\n\nThe Commerce Department said the action was based on evidence that NSO’s spyware was\nused to target “journalists, businesspeople, activists, academics, and embassy workers.”\n\nIn December, Democratic Senator Ron Wyden and 17 other lawmakers called for the\nTreasury Department to sanction NSO Group and three other foreign surveillance companies\nthey say helped authoritarian governments commit human rights abuses.\n\n“When the public saw you had U.S. government figures getting hacked, that quite clearly\nmoved the needle,” Wyden told Reuters in an interview, referring to the targeting of U.S.\nofficials in Uganda.\n\nLina al-Hathloul, Loujain’s sister, said the financial blows to NSO might be the only thing that\ncan deter the spyware industry. “It hit them where it hurts,” she said.\n\nRegister now for FREE unlimited access to Reuters.com\n\nReporting by Joel Schectman and Christopher Bing; editing by Kieran Murray and Edward\nTobin\n\nOur Standards: [The Thomson Reuters Trust Principles.](https://www.thomsonreuters.com/en/about-us/trust-principles.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-18 - How a Saudi woman's iPhone revealed hacking around the world.pdf"
    ],
    "report_names": [
        "2022-02-18 - How a Saudi woman's iPhone revealed hacking around the world.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "0f47a6f3-a181-4e15-9261-50eef5f03a3a",
            "created_at": "2022-10-25T16:07:24.228663Z",
            "updated_at": "2025-03-27T02:02:10.145238Z",
            "deleted_at": null,
            "main_name": "Stealth Falcon",
            "aliases": [
                "FruityArmor",
                "Project Raven",
                "Stealth Falcon"
            ],
            "source_name": "ETDA:Stealth Falcon",
            "tools": [
                "Deadglyph",
                "StealthFalcon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b8c7c542-43ed-498c-af6b-b4b5f0c75724",
            "created_at": "2024-02-02T02:00:04.026045Z",
            "updated_at": "2025-03-27T02:00:03.291916Z",
            "deleted_at": null,
            "main_name": "Carmine Tsunami",
            "aliases": [
                "DEV-0196",
                "QuaDream"
            ],
            "source_name": "MISPGALAXY:Carmine Tsunami",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536124,
    "ts_updated_at": 1743041801,
    "ts_creation_date": 1653764892,
    "ts_modification_date": 1653764892,
    "files": {
        "pdf": "https://archive.orkl.eu/2aad47a5ac2a122482e8d6deda289ca03f207198.pdf",
        "text": "https://archive.orkl.eu/2aad47a5ac2a122482e8d6deda289ca03f207198.txt",
        "img": "https://archive.orkl.eu/2aad47a5ac2a122482e8d6deda289ca03f207198.jpg"
    }
}