{
    "id": "9d6ec1c9-8526-476b-a9a9-fb811c754262",
    "created_at": "2023-01-12T15:08:54.976075Z",
    "updated_at": "2025-03-27T02:15:35.5343Z",
    "deleted_at": null,
    "sha1_hash": "0628930f28de523c4a1077d8447183fad7f57f88",
    "title": "2021-02-17 - Masslogger campaigns exfiltrates user credentials",
    "authors": "",
    "file_creation_date": "2022-05-28T21:39:50Z",
    "file_modification_date": "2022-05-28T21:39:50Z",
    "file_size": 2275199,
    "plain_text": "# Masslogger campaigns exfiltrates user credentials\n\n**[blog.talosintelligence.com/2021/02/masslogger-cred-exfil.html](https://blog.talosintelligence.com/2021/02/masslogger-cred-exfil.html)**\n\nBy [Vanja Svajcer.](https://www.google.com/url?q=https://twitter.com/vanjasvajcer&sa=D&source=editors&ust=1613558376141000&usg=AOvVaw2b9iUY2soly67oFZ5Wy2nm)\n\n## News summary\n\n\n-----\n\nAs protection techniques develop, attackers are finding it harder to successfully attack\ntheir targets and must find creative ways to succeed.\nCisco Talos recently discovered a campaign utilizing a variant of the Masslogger trojan\ndesigned to retrieve and exfiltrate user credentials from multiple sources such as\nMicrosoft Outlook, Google Chrome and instant messengers.\nApart from the initial email attachment, all the stages of the attacks are fileless and they\nonly occur in volatile memory.\n[These threats demonstrate several techniques of the MITRE ATT&CK framework, most](https://attack.mitre.org/&sa=D&source=editors&ust=1613558376142000&usg=AOvVaw2w9QlS_0G_8gA9kTp65smA)\nnotably [T1566 — Phishing, T1059.001 and](https://attack.mitre.org/techniques/T1566/&sa=D&source=editors&ust=1613558376142000&usg=AOvVaw2mM9T9_A5-DcWi9nl9oICW) [T1059.007 — Command and Scripting](https://attack.mitre.org/techniques/T1059/007/&sa=D&source=editors&ust=1613558376143000&usg=AOvVaw1FnEJHPJgZsLP_3ycj1aCS)\nInterpreters, [T1140 — Deobfuscate/Decode Files or Information, T1497 —](https://attack.mitre.org/techniques/T1140/&sa=D&source=editors&ust=1613558376143000&usg=AOvVaw1CErSKihrgfjoNnu7ylGrX)\n[Virtualization/Sandbox Evasion, T1555.003 — Credentials from Web Browsers,](https://attack.mitre.org/techniques/T1555/003/&sa=D&source=editors&ust=1613558376144000&usg=AOvVaw0iw4cflB1MtkbOzcsZU8_N) [T1115](https://attack.mitre.org/techniques/T1115/&sa=D&source=editors&ust=1613558376144000&usg=AOvVaw3fvykbP3u4Rfqh6rw_F7-8)\n[— Clipboard Data, T1056.001 — Keylogging and T1048.003 — Exfiltration Over](https://attack.mitre.org/techniques/T1056/001/&sa=D&source=editors&ust=1613558376144000&usg=AOvVaw0EanwDVxiMCUt7MZZ3gj01)\nUnencrypted/Obfuscated Non-C2 Protocol.\n\nAttackers are constantly reinventing ways to monetize their tools. Cisco Talos recently\ndiscovered an interesting campaign affecting Windows systems and targeting users in\nTurkey, Latvia and Italy, although similar campaigns by the same actor have also been\ntargeting users in Bulgaria, Lithuania, Hungary, Estonia, Romania and Spain in September,\nOctober and November 2020.\n\nThe actor employs a multi-modular approach that starts with the initial phishing email and\ncarries through to the final payload. The adversaries behind this campaign likely do this to\nevade detection. But it can also be a weakness, as there are plenty of opportunities for\ndefenders to break the killchain.\n\n**What's new?**\n\nAlthough operations of the Masslogger trojan have been previously documented, we found\nthe new campaign notable for using the compiled HTML file format to start the infection\nchain. This file format is typically used for Windows Help files, but it can also contain active\nscript components, in this case JavaScript, which launches the malware's processes.\n\n**How did it work?**\n\nThe infection starts with an email message containing a legitimate-looking subject line that\nseems to relate to a business. The email contains a RAR attachment with a slightly unusual\nfilename extension.\n\nThe usual filename extension for RAR files is .rar. However, RAR-compressed archives can\nalso be split into multi-volume archives. In this case, the filename creates files with the RAR\nextension named \"r00\" and onwards with the .chm file extension. This naming scheme is\nused by the Masslogger campaign, presumably to bypass any programs that would block the\nemail attachment based on its file extension\n\n\n-----\n\nCHM is a compiled HTML file that contains an embedded HTML file with JavaScript code to\nstart the active infection process. Every stage of the infection is obfuscated to avoid\ndetection using simple signatures.\n\nThe second stage is a PowerShell script that eventually deobfuscates into a downloader and\ndownloads and loads the main PowerShell loader. The Masslogger loaders seem to be\nhosted on compromised legitimate hosts with a filename containing one letter and one\nnumber concatenated with the filename extension .jpg. For example, \"D9.jpg\".\n\nThe main payload is a variant of the Masslogger trojan designed to retrieve and exfiltrate\nuser credentials from a variety of sources, targeting home and business users. Masslogger\ncan be configured as a keylogger, but in this case, the actor has disabled this functionality.\n\n**So what?**\n\nWhile most of the public attention seems to be focused on ransomware attacks, big game\nhunting and APTs, it is important to keep in mind that crimeware actors are still active and\ncan inflict significant damage to organizations by stealing users' credentials. The credentials\nthemselves have value on the dark web and actors sell them for money or use them in other\nattacks.\n\nBased on the IOCs we retrieved, we have moderate confidence that this actor has previously\n[used other payloads such as AgentTesla,](https://blog.talosintelligence.com/2019/11/custom-dropper-hide-and-seek.html&sa=D&source=editors&ust=1613558376147000&usg=AOvVaw3bRZazyMAi_9ApyAOiV1bv) [Formbook and AsyncRAT in campaigns starting as](https://blog.talosintelligence.com/2018/06/my-little-formbook.html&sa=D&source=editors&ust=1613558376147000&usg=AOvVaw1XcjzdYecnsbzKwecjJjOC)\nearly as April 2020.\n\n## Technical case overview\n\n**Introduction**\n\nMasslogger is a spyware program written in .NET with a focus on stealing user credentials,\nmostly from the browsers but also from several popular messaging applications and email\nclients. It was released in April 2020 and sold on underground forums for a moderate price\nwith a few licensing options.\n\nThe exfiltration of data takes place over one or more of these channels:\n\nFTP (plain text over default port 21), the configuration contains user credentials.\nHTTP — Using a PHP-based control panel.\nSMTP — The user has to specify email address, server and credentials to use it.\n\nWe won't dig deep into the functionality of the final Masslogger payload, as this was\n[previously well-described by other researchers. Instead, we'll focus on the infection vector](https://fr3d.hk/blog/masslogger-frankenstein-s-creation&sa=D&source=editors&ust=1613558376148000&usg=AOvVaw2Qj6JdzZvYHNC7iNw7rUQs)\nand the memory-only delivery chain before the final stage is loaded. In case of commodity\n\n\n-----\n\nspyware such as Masslogger, it is the infection chain and contextual information that\ndistinguish the individual actors behind each campaign.\n\nThe infection chain we follow seems to focus on business users, with email being the\ninfection vector. The email contains a RAR attachment with a compiled HTML (.chm)\nattachment. The rest of the chain is split between JavaScript, PowerShell and .NET.\n\n**Email as an infection vector**\n\nThe latest campaign began in mid-January. Based on the combination of discovered emails\nand file names, we believe it was targeting organizations in Turkey, Latvia and Italy. We have\nobserved similar campaigns happening in several instances before, starting no later than\nSeptember 2020. In previous campaigns, the actor was targeting users in Bulgaria,\nLithuania, Hungary, Estonia, Romania and Spain.\n\n_European countries targeted by the observed Masslogger campaigns from September 2020._\n\nThe email is written in the language of the targeted recipient's top-level domain. The first\nexample is an email targeted at users in Turkey with the subject \"Domestic customer inquiry\"\nand the body \"At the request of our customer, please send your attached best quotes.\"\n\n\n-----\n\n_Email campaign example targeting users in Turkey._\n\nSome earlier campaigns were purported to be a request to open and sign a memorandum of\nunderstanding. The actor attempted to make emails more credible by adding a link to the\nlegitimate scanning application to the email footer \"Shipped with Genius Scan for iOS.\"\n\nFor the campaigns in September, October and November, the adversaries sent emails\ncontaining a subject line that translates to \"MOU Information\" with the text \"Please return it\nsigned and stamped. Best regards,\" in the body.\n\n\n-----\n\n_An example of an earlier email targeting users in Spain._\n\n_An example of an earlier email targeting users in Bulgaria._\n\nThe attachment file name for the latest campaign is chosen according to the email subject,\nwith possible random strings prepended, for example, \"70727_YK90054_Teknik_Cizimler.\"\nThe attachment filename extension is chosen to bypass simple blockers that attempt to block\nRAR attachments using its default filename extension \".rar\". The actor changes the filename\n\n\n-----\n\nextension to RAR multi-volume filename extensions, starting from .r00 . WinRAR and other\nRAR-capable unarchivers will still open the file without problems.\n\nThe attached RAR archive contains a single file with the \".chm\" filename extension. CHM\nstands for \"compiled HTML files,\" and it is one of the default formats for Windows Help files.\nCompiled HTML files can be easily created using the Windows HTML Help executable\nprogram hh.exe. The same program can be used with the command line option \"-decompile\"\nto extract the embedded and compressed HTML files.\n\nWhen the user opens the attachment with the default application, a simple HTML page is\ndisplayed, containing the text \"Customer service, Please Wait…\"\n\n\n-----\n\n_The HTML page displayed when the .CHM attachment is opened._\n\nWhen the CHM file is decompiled and the HTML file extracted, it contains lightly obfuscated\nJavaScript code to create an HTML page. The HTML content is escaped and reversed, so it\nis easy to deobfuscate.\n\n\n-----\n\n_Obfuscated JavaScript code in the decompiled HTML file._\n\nThe HTML code contains an ActiveX object containing PowerShell code obfuscated in a\nsimilar way to strings in the JavaScript code of the CHM file.\n\n_HTML page with an ActiveX object embedded and PowerShell code._\n\nWhen deobfuscated, we can observe a PowerShell downloader stage, which simply\nconnects to the download server, usually a compromised legitimate host. The download\nserver hosts the next stage of the infection.\n\n\n-----\n\n_PowerShell downloader stage._\n\nThe URL to download the next stage ends in the path with the format [1Letter][1 to 2-digit\nnumber].jpg, for example, hxxp://sinetcol[.]co/D7.jpg. This stage is encoded with a simple\nhexadecimal encoding scheme and is converted to code by first splitting the downloaded\ncontent using the character \"^\" as the delimiter and then adding ASCII representation of each\nnumber to a string variable. Eventually, the string containing PowerShell code is piped into\nthe Invoke-Expression (IEX) cmdlet. This is the PowerShell loader.\n\n_Encoded PowerShell loader_\n\nThe PowerShell loader contains two encoded .NET assemblies. The first one is a DLL and\nthe other an executable.\n\n**Loader DLL and final Masslogger payload**\n\n_Start of the PowerShell loader._\n\n\n-----\n\nThe PowerShell loader first decodes the .NET DLL and then deobfuscates the string\n\"System.AppDomain\" to get the reference to its method \"GetCurrentDomain.\" The loader\nthen creates a byte array where it stores the Masslogger loader before it invokes the\nGetCurrentDomain function to get the context of execution and the process where the script\nis executing.\n\nThe acquired domain is then used to load the .NET DLL assembly into the powershell.exe\nprocess space with the assembly name \"Waves.dll.\" Waves employs a Costura loader, an\n[open-source reflective assembly loader alternative to ILMerge and is obfuscated with](https://github.com/dotnet/ILMerge&sa=D&source=editors&ust=1613558376153000&usg=AOvVaw2q8JU4QosE_ps8ZpkWhzeb)\nDotNetGuard obfuscator, all to make analysis and detection more difficult.\n\nOnce the DLL is loaded as a .NET assembly, the PowerShell loader calls the method tasked\nwith creating a msbuild.exe process, injecting the final payload into its process space and\nlaunching it.\n\n_After decoding, the DLL loader assembly is created and loaded._\n\nThe Masslogger payload is stored in memory as a buffer compressed with gzip. The buffer is\ndecompressed by the DLL loader. The internal assembly name of the payload is \"servicemed-star.gr\", which is a concatenation of the username and the server used for FTP\ncredentials exfiltration.\n\nMasslogger is a credential stealer and keylogger with the ability to exfiltrate data through\nSMTP, FTP or HTTP protocols. For the first two, no additional server-side components are\nrequired, while the exfiltration over HTTP is done through the Masslogger control panel web\napplication.\n\nThis version of Masslogger contains the functionality to target and retrieve credentials from\nthe following applications:\n\nPidgin messenger client\nFileZilla FTP client\nDiscord\n\n\n-----\n\nNordVPN\nOutlook\nFoxMail\nThunderbird\nFireFox\nQQ Browser\nChromium based browsers (Chrome, Chromium, Edge, Opera, Brave)\n\nThe configuration for a payload is stored as an encrypted array of strings within the payload\nitself. Although the configuration is encrypted and the payload obfuscated with an unknown\nobfuscator it is still possible to find code used to decrypt the configuration as previously\ndocumented by Mario Henkel.\n\nThe configuration is decrypted using the standard .NET framework functionality. This allows\nus to place a breakpoint to the beginning of the method\nSystem.Security.Cryptography.AesCryptoServiceProvider and step back to the configuration\ndecryption function within the payload body and trace the value returned to the caller after\neach configuration string is decrypted.\n\n_Breakpoints placed to decrypt the payload configuration._\n\nThe decrypted configuration is parsed by Masslogger to configure the trojan to target a\nspecific set of applications and exhibit functionality. In our case, the Masslogger version we\nare dealing with is 3.0.7563.31381 and the exfiltration is conducted over FTP, with medstar.gr as the FTP exfiltration server. Although the payload is configured to use FTP, the\nactor has installed a version of Masslogger control panel on the same server with the URL\nhxxps://www[.]med-star[.]gr/panel/?/login.\n\n\n-----\n\n_Decrypted Masslogger configuration strings._\n\nOnce the credentials from targeted applications are retrieved, they are uploaded to the\nexfiltration server with a filename containing the username, two-letter country ID, unique\nmachine ID and the timestamp for when the file was created.\n\nUploaded credential files begin with the information about the user and the infected system,\nconfiguration options and processes running, followed by the retrieved credentials delimited\nby lines containing targeted application names.\n\n\n-----\n\n_The beginning of an uploaded exfiltrated credentials file._\n\n**Conclusion**\n\nThis recently discovered Masslogger campaign — which we attribute to an actor launching\nsimilar credential-stealing campaigns — back to at least September 2020. There is moderate\nconfidence the author has previously used AgentTesla with similar goals in April 2020. The\ncampaigns are targeted to several European countries, shifting its focus monthly. In our\nresearch, we detected email messages targeting Turkey, Latvia, Lithuania, Bulgaria,\nHungary, Estonia, Romania, Italy and Spain, as well as messages written in English.\n\n_Masslogger campaign modules._\n\nThe observed campaign is almost entirely executed and present only in memory, which\nemphasizes the importance of conducting regular and background memory scans. The only\ncomponent present on disk is the attachment and the compiled HTML help file.\n\nUsers are advised to configure their systems for logging PowerShell events such as module\nloading and executed script blocks as they will show executed code in its deobfuscated\nformat. Talos will continue to track similar campaigns to make sure adequate protection is\nincluded in Cisco Secure products.\n\n\n-----\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection&sa=D&source=editors&ust=1613558376161000&usg=AOvVaw0aYnze42N4C77H8Pearb13)\n\nsuited to prevent the execution of the malware used by these threat actors. Exploit\nPrevention present within AMP is designed to protect customers from unknown attacks such\nas this automatically.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html&sa=D&source=editors&ust=1613558376162000&usg=AOvVaw3G_2ZrBkadoXxwQfVkoTDK) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html&sa=D&source=editors&ust=1613558376163000&usg=AOvVaw2ZeMu-AHaM2rBbsW2lsS06)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html&sa=D&source=editors&ust=1613558376164000&usg=AOvVaw1u1xf1ViOpUeIxvP44GEz8)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html&sa=D&source=editors&ust=1613558376164000&usg=AOvVaw2Ln6mNYWvEO9hO0uWqOaV4)\n[Intrusion Prevention System (NGIPS),Cisco ISR andMeraki MX can detect malicious activity](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html&sa=D&source=editors&ust=1613558376165000&usg=AOvVaw0x9QJOxxWAX18Che2HQU29)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and builds protection into all Cisco](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html&sa=D&source=editors&ust=1613558376167000&usg=AOvVaw2jMFHliHL_dwqo12oTU4hV)\nSecurity products.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/&sa=D&source=editors&ust=1613558376168000&usg=AOvVaw1EPjqwalD8RAxYXWHkHVPB)\ndomains, IPs and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase onSnort.org.](https://www.snort.org/products&sa=D&source=editors&ust=1613558376169000&usg=AOvVaw0Vc5ZR6bYfBe_K1T5P01R3)\n\n\n-----\n\n**OSQuery**\n\nCisco AMP users can use Orbital Advanced Search to run complex OSqueries to see if their\nendpoints are infected with this specific threat. For specific OSqueries on this threat, click\nhere https://github.com/CiscoTalos/osquery_queries/blob/master/win_forensics/potential_compiled_HTML_abuse.yaml\n\n## IOCs\n\n**URLs**\n\nhxxp://sinetcol[.]co/A7.jpg - January\n\nhxxp://sinetcol[.]co/D7.jpg - January\n\nhxxp://becasmedikal[.]com.tr/A5.jpg - January\n\nhxxp://risu[.]fi/D9.jpg - November\n\nhxxp://topometria[.]com.cy/A12.jpg - September\n\nhxxp://bouinteriorismo[.]com/R9.jpg - November\n\nhxxp://optovision[.]gr/4B.jpg - October\n\nhxxp://hotelaretes[.]gr/V8.jpg - October\n\nhxxp://jetfleet24[.]com/T5.jpg - October\n\nhxxps://www.med-star[.]gr/panel/?/login - C2 panel\n\nfxp://med-star[.]gr - exfiltration FTP\n\n**Email messages**\n\n54ca02b013e898be2606f964bc0946430a276de9ef478596a1d33cb6f806db8c\n\n516d45fcbdbdc4526bdd0f6979fe3ad929b82e1fd31247c7891528703ac16131\n\n1c0a17a11a4b64dbe6082be807309a3c447b4861ea56155c1bfcf4d072746d38\n\n7c92e1befd1cc5fa4a253716ac8441f6e29a351b7e449d3b8ef171cb6181db8e\n\n83c64bf1c919c5e6ce25633d0eff2b7cda5b93a210b60372d984f862933e0b4e\n\ne2c3ad4bedf9e6d1122d418e97dfb743b1559a5af99befabed5bb7c6164028a8\n\n8129a86056aa28f2af87110bb25732b14b77f18a7c820d9bcf1adcd2c7d97a7a\n\n**Initial scripts**\n\n742b9912f329c05296e2f837555dceea0ae3e06e80aa178a9127692d25e21479 - September\n2020, Windows batch file\n\n04910322c2e91d58e9ed3c5bcc3a18be1ba1b5582153184d1f5da3d9c42bac15 - January\n2021, CHM file\n\naac62b80b790d96882b4b747a8ed592f45b39ceadd9864948bb391f3f41d7f9f - January\n\n\n-----\n\n2021, CHM file\nf946e1c690fc2125af4ad7d3d1b93c6af218a82d55a11a5a6ee5a9b04a763e7f - January\n2021, CHM file\n9cd7622ade7408c03e0c966738f51f74f884fbafdf3fe97edf4be374a7fb1d77 - November\n2020, CHM file\n5415bcc4bffa5191a1fac3ce3b11c46335d19f053f5d9d51a10f4ed77393ed82 - October 2020,\nCHM file\n\n**Downloaded obfuscated PowerShell loaders**\n\n0eef444f062ea06340ca7ef300cb39c44a6cdf7ead2732bb885d79f098991cb8\n\ndf929834de2b10efaa8b2cb67c71ae98508cfb79f22213ee24aedc38a962ccb5\n\n**DLL loaders**\n\n49fc4103d8747de341b9d3cd08f05c83f2e6943215df6939d02c7c3099345343\n\n39dbe72ea847012243e4642d766fd4cf6fe138302cbfba67c65088b2cdefc1f4\n\na16fa0a14f0d20b66af550e3cdb0b60f8ffb965415404df6cc8164e62dfbe124\n\nda256158ac0d7dc031b2541f9b7486d9822a402b6e9c5176c2ec2ed717592fbf\n\n**Masslogger payload**\n\n2487b12f52b803f5d38b3bb9388b039bf4f58c4b5d192d50da5fa047e9db828b\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-17 - Masslogger campaigns exfiltrates user credentials.pdf"
    ],
    "report_names": [
        "2021-02-17 - Masslogger campaigns exfiltrates user credentials.pdf"
    ],
    "threat_actors": [
        {
            "id": "a7d4fe31-d92f-425a-ba8c-c70219f52fb8",
            "created_at": "2022-10-25T15:50:23.466009Z",
            "updated_at": "2025-03-27T02:00:55.477162Z",
            "deleted_at": null,
            "main_name": "Frankenstein",
            "aliases": [
                "Frankenstein"
            ],
            "source_name": "MITRE:Frankenstein",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "63061658-5810-4f01-9620-7eada7e9ae2e",
            "created_at": "2022-10-25T15:50:23.752974Z",
            "updated_at": "2025-03-27T02:00:55.538582Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "Wizard Spider",
                "UNC1878",
                "TEMP.MixMaster",
                "Grim Spider",
                "FIN12",
                "GOLD BLACKBURN",
                "ITG23",
                "Periwinkle Tempest",
                "DEV-0193"
            ],
            "source_name": "MITRE:Wizard Spider",
            "tools": [
                "TrickBot",
                "AdFind",
                "BITSAdmin",
                "Bazar",
                "LaZagne",
                "Nltest",
                "GrimAgent",
                "Dyre",
                "Ryuk",
                "Conti",
                "Emotet",
                "Rubeus",
                "Mimikatz",
                "Diavol",
                "PsExec",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f6f91e1c-9202-4497-bf22-9cd5ef477600",
            "created_at": "2023-01-06T13:46:38.86765Z",
            "updated_at": "2025-03-27T02:00:02.938998Z",
            "deleted_at": null,
            "main_name": "WIZARD SPIDER",
            "aliases": [
                "FIN12",
                "UNC2053",
                "Pistachio Tempest",
                "TEMP.MixMaster",
                "GOLD BLACKBURN",
                "Periwinkle Tempest",
                "DEV-0193",
                "Storm-0193",
                "Trickbot LLC",
                "DEV-0237"
            ],
            "source_name": "MISPGALAXY:WIZARD SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "56b3eb1d-6baf-4ee4-a098-ec0081280315",
            "created_at": "2024-09-28T02:05:36.599884Z",
            "updated_at": "2025-03-27T02:05:17.250078Z",
            "deleted_at": null,
            "main_name": "ALUMINUM THORN",
            "aliases": [
                "WIRTE ",
                "Frankenstein "
            ],
            "source_name": "Secureworks:ALUMINUM THORN",
            "tools": [
                " Powershell Empire",
                "FruityC2"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e6a21528-2999-4e2e-aaf4-8b6af14e17f3",
            "created_at": "2022-10-25T16:07:24.422115Z",
            "updated_at": "2025-03-27T02:02:10.216817Z",
            "deleted_at": null,
            "main_name": "Wizard Spider",
            "aliases": [
                "DEV-0193",
                "Gold Blackburn",
                "Gold Ulrick",
                "Grim Spider",
                "ITG23",
                "Operation BazaFlix",
                "Periwinkle Tempest",
                "TEMP.MixMaster",
                "Wizard Spider"
            ],
            "source_name": "ETDA:Wizard Spider",
            "tools": [
                "AdFind",
                "Agentemis",
                "Anchor_DNS",
                "BEERBOT",
                "BazarBackdoor",
                "BazarCall",
                "BazarLoader",
                "Cobalt Strike",
                "CobaltStrike",
                "Conti",
                "Diavol",
                "Dyranges",
                "Dyre",
                "Dyreza",
                "Dyzap",
                "Gophe",
                "Invoke-SMBAutoBrute",
                "KEGTAP",
                "LaZagne",
                "LightBot",
                "PowerSploit",
                "PowerTrick",
                "PsExec",
                "Ryuk",
                "SessionGopher",
                "TSPY_TRICKLOAD",
                "Team9Backdoor",
                "The Trick",
                "TheTrick",
                "Totbrick",
                "TrickBot",
                "TrickLoader",
                "TrickMo",
                "Upatre",
                "bazaloader",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536134,
    "ts_updated_at": 1743041735,
    "ts_creation_date": 1653773990,
    "ts_modification_date": 1653773990,
    "files": {
        "pdf": "https://archive.orkl.eu/0628930f28de523c4a1077d8447183fad7f57f88.pdf",
        "text": "https://archive.orkl.eu/0628930f28de523c4a1077d8447183fad7f57f88.txt",
        "img": "https://archive.orkl.eu/0628930f28de523c4a1077d8447183fad7f57f88.jpg"
    }
}