{
    "id": "9d89dc59-2c00-4175-be49-2f1cb59e68f1",
    "created_at": "2023-01-12T15:10:11.917601Z",
    "updated_at": "2025-03-27T02:08:51.254541Z",
    "deleted_at": null,
    "sha1_hash": "c9e827ff010b1a4798e7a440fe2310dada44208f",
    "title": "2021-09-14 - Russia is fully capable of shutting down cybercrime",
    "authors": "",
    "file_creation_date": "2022-05-27T22:05:09Z",
    "file_modification_date": "2022-05-27T22:05:09Z",
    "file_size": 2391700,
    "plain_text": "# Russia is fully capable of shutting down cybercrime\n\n**[csoonline.com/article/3632943/russia-is-fully-capable-of-shutting-down-cybercrime.html](https://www.csoonline.com/article/3632943/russia-is-fully-capable-of-shutting-down-cybercrime.html)**\n\nChristopher Burgess\n\nIt is no secret the locus for a great deal of the world’s cybercriminal activity lays within the\nboundaries of The Russian Federation. The onslaught of ransomware attacks directed at\nnon-Russian entities is evidence of that.\n\n[Last week, Recorded Future’s Insikt Group published a report shedding more light on the](https://www.recordedfuture.com/russian-state-connections-criminal-actors/)\nconnection between the Russian state and criminal actors, a connection that Insikt Group\nposits is “well established yet highly diffused.”\n\nThe key judgments from the Insikt Groups analysis are:\n\nIt is highly likely that Russian intelligence services and law enforcement have a\nlongstanding, tacit understanding with criminal threat actors.\nThis association will continue, though efforts to put space between the government and\ncriminal entities may increase to provide greater plausible deniability to the government\nUS President Joe Biden’s assertion that Russian cybercriminals are protected by the\nRussian government has placed Russian President Vladimir Putin on the defensive.\n\n\n-----\n\nRussian cybercriminals are reforming their operations and targeting vectors implying\nthat the Biden administration’s actions have been modestly successful.\n\nIs this much of a surprise to those who invest their professional life watching things Russia?\n[Not really, says Monique Camarra, co-host of the Kremlin File who explains, “We know the](https://kremlinfile.com/)\nKGB was present in all aspects of Soviet life, so it’s no surprise that they would have\nrelations and dealings with criminal groups. Important hubs were controlled by the KGB in\ncooperation with criminal elements.” She continued how, for example, “the Tambov crime\ngroup, during privatization of state assets, regained control of the port, fuel and energy\nbusiness. The fact that the new cadre of criminals, the cybercriminals, are attached at the hip\nto the Russian security apparatus should surprise no one.”\n\n## US sanctions have consequences\n\nAs a result of a flurry of ransomware attacks that impacted the United States infrastructure,\nthe United States hit Russia in April 2021 with both sanctions and the expulsion of\ndiplomatic/intelligence personnel from the United States, tying the diplomatic actions to the\ncriminal actions in a clear and unambiguous signal: the tolerance of the United States was\napproaching its end point.\n\nIn June, at the summit referenced in Insikt Group’s analysis and then again in July 2021\nwhen Biden held a telephone conference call with Putin, a similar message was delivered,\nunambiguously, by Biden. Biden commented to reporters, \"I made it very clear to him that the\nUnited States expects, when a ransomware operation is coming from his soil even though it's\nnot sponsored by the state, we expect them to act if we give them enough information to act\non who that is.\"\n\nIt isn’t as if Russia can’t control their internet gateways across which these cyber crimes are\nbeing committed. To wit: On September 2, 2021, with the Russian election fast approaching\nand the efforts of Putin to silence dissent in overdrive, Roskomnadzor blocked six providers\nof virtual private networks to the Russian market (Hola! VPN, ExpressVPN, KeepSolid VPN\nUnlimited, Nord VPN, Speedify VPN, IPVanish VPN); the organization had previously\nexcluded two others, VyprVPN and OperaVPN. Roskomnadzor claims they blocked the VPN\nservices due to “illegal activities, including those related to the distribution of drugs, child\npornography, extremism and suicidal tendencies.”\n\n## Dmitry Dokuchaev—a key individual\n\nInterestingly, the Insikt analysis draws on actions that occurred over the last decade to create\ntheir mosaic of interconnectivity between the Russian government and cybercriminals. The\nanalysis hangs its hat on Dmitry Dokuchaev, among others, a major in the Russian interior\nministry (FSB), who is a unique individual in that he was simultaneously under indictment by\nthe United States for cybercrimes and by Russia for treason associated with cybercrimes\nwhile an officer of the FSB in 2016 He pleaded guilty in Russia and went to prison\n\n\n-----\n\nThe circumstances of Dokuchaev s arrest further cement the connection between the\nRussian government and the criminal cyber world and illustrate what Russia is capable of\ndoing to cybercriminals if it is in their interests.\n\nThe FSB cyber operations group, Information Security Center, of which Dokuchaev was a\nmember, imploded in December 2016 through January 2017, with the arrests of multiple\nleadership personnel.\n\nThe [initial arrests included Colonel Sergey Mikhailov, deputy director of the center, and](https://www.kommersant.ru/doc/3200840)\nRuslan Stoyanov, a manager at Kaspersky Labs. They are alleged to have feathered their\nnest by sharing with the West (the FBI and others) data that had been harvested from\nRussian companies which they engaged to investigate… wait for it… cybercrimes.\n\nThe arrest of Mikhailov was full of drama and seemed straight out of a 1950s Russian crime\nfilm: He reportedly was present at an FSB staff meeting when he was dragged\nunceremoniously out the of the building with a bag over his head. The next arrests included\nDokuchaev, who served as Mikhailov’s deputy within the center, and the director of the\ncenter, Andrei Gerasimov. In 2019, Mikhailov was sentenced to 22 years in prison by the\nRussian courts.\n\nMuch to the chagrin of the FSB, their dirty laundry was being aired for all to see, as the\ninternal catfight between the FSB’s Information Security Center, which just had its leadership\narrested for cybercrimes, and the FSB’s Special Communications Group (previously known\nto western intelligence as FAPSI, the group in charge of Russian cryptographic standards,\nsecurity of Russian elections, signals intelligence, and a multitude of other activities)\nculminated in the Special Communications Group assimilating the Information Security\nCenter.\n\n## Russia’s action to take\n\nThe FSB saga is evidence that Russia is fully capable of arresting and prosecuting cyber\ncriminals operating within their geographic and virtual internet footprint. The bar is high for\ninstances of cybercrime that will cause the Russian government to take action. But clearly,\ntwo officers facilitating the West’s investigation into Russian cybercriminals off the record and\nallegedly for millions of dollars, met that bar.\n\nThe choice of words is always important and therefore one reading between the lines will\nnote the subtlety of Biden’s messaging to Putin: It is in the Russian Federation’s interest to\nact because, regardless of whether entities operate with or without the tacit\nacknowledgement of the Russian government, the United States had provided fair warning\nthat lack of action by Russia will result in the United States acting in its own interest.\n\n\n-----\n\nTime will tell if the relationship between Russian cybercriminals and the Russian Federation\ncyber entities will evolve in a manner that quiets the former and their criminal activities. If not,\nthe potential for action by U.S. government entities should be expected.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-14 - Russia is fully capable of shutting down cybercrime.pdf"
    ],
    "report_names": [
        "2021-09-14 - Russia is fully capable of shutting down cybercrime.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536211,
    "ts_updated_at": 1743041331,
    "ts_creation_date": 1653689109,
    "ts_modification_date": 1653689109,
    "files": {
        "pdf": "https://archive.orkl.eu/c9e827ff010b1a4798e7a440fe2310dada44208f.pdf",
        "text": "https://archive.orkl.eu/c9e827ff010b1a4798e7a440fe2310dada44208f.txt",
        "img": "https://archive.orkl.eu/c9e827ff010b1a4798e7a440fe2310dada44208f.jpg"
    }
}