{
    "id": "9d97683a-afe4-497a-b2cf-187fe7aea471",
    "created_at": "2023-01-12T15:05:43.650797Z",
    "updated_at": "2025-03-27T02:16:05.84581Z",
    "deleted_at": null,
    "sha1_hash": "8edfe289c0cb0f6dcd28bad38e02f9735af3effd",
    "title": "2017-10-04 - Protecting the Software Supply Chain- Deep Insights into the CCleaner Backdoor",
    "authors": "",
    "file_creation_date": "2022-05-28T19:45:32Z",
    "file_modification_date": "2022-05-28T19:45:32Z",
    "file_size": 1145423,
    "plain_text": "# CCleaner Backdoor: Analysis & Recommendations\n\n**[crowdstrike.com/blog/protecting-software-supply-chain-deep-insights-ccleaner-backdoor/](https://www.crowdstrike.com/blog/protecting-software-supply-chain-deep-insights-ccleaner-backdoor/)**\n\nKaran Sood October 4, 2017\n\nThe term “supply chain attacks” means different things to different people. To the general\nbusiness community, it refers to attacks targeting vulnerable third-parties in a larger\norganization’s supply chain. A well-known retail chain’s massive breach in 2013 is a classic\nexample: Adversaries used a poorly protected HVAC vendor as their gateway to hack into\nthe giant retailer’s enterprise network. However, threat researchers have another definition:\nTo them, supply chain attacks can also denote the growing phenomenon in which malicious\ncode is injected into new releases and updates of legitimate software packages, effectively\nturning an organization’s own software supply infrastructure into a potent and hard-toprevent attack vector. The recent backdoor that was discovered embedded in the legitimate,\nsigned version of CCleaner 5.33, is just such an attack.\n\nTo help inform the user community and empower them to better defend against software\nsupply chain attacks, the CrowdStrike® Security Response Team (SRT) conducted a\nthorough analysis of the CCleaner backdoor. A popular PC optimization tool, the 5.33 version\nof CCleaner has had widespread distribution across multiple industries, but the embedded\ncode appeared to actually be targeted at specific groups in the technology sector. (More\ninformation on targeted industries is available for CrowdStrike customers in our Falcon\n[Intelligence™ portal.) CrowdStrike’s threat intelligence team had also previously reported on](https://www.crowdstrike.com/endpoint-security-products/falcon-x-threat-intelligence/)\nthe malware’s C2 (command and control) infrastructure in a recent alert for CrowdStrike\ncustomers identifying possible links to Aurora Panda. The report also outlines the potential\nfor additional adversary tactics, techniques and procedures (TTPs).\n\n\n-----\n\n## Technical Analysis\n\n### CCleaner\n\nCCleaner is a PC cleaning utility developed by Piriform, which was recently acquired by\nantivirus (AV) provider Avast in June 2017. The affected version of the utility contains a\nmodified __scrt_common_main_seh function that routes the execution flow to a custom\nfunction meant to decode and load the malware. This takes place even before the entry point\n(EP) of the utility is reached.The new execution flow leads to a function that decodes a blob\nof data, as reproduced in Python below:\n\n```\n  key = 0x2547383\n\n```\n```\n  i = 0\n\n```\n```\n  dec = []\n\n```\n```\n  for i in range(0, len(indata)):\n\n```\n```\n    dec.append(blob[i] ^ key)\n\n```\n```\n    key = key >> 0x8\n\n```\n```\n  return dec\n\n```\n\nThe result of the decoding subroutine is shellcode and the payload (which is missing the\nIMAGE_DOS_HEADER field). The missing IMAGE_DOS_HEADER is likely to subvert AV\nsolutions that search for MZ (0x4d5a) headers in memory.\n\nNext, the program creates a memory heap with the flag\nHEAP_CREATE_ENABLE_EXECUTE to allow for execution, and copies the shellcode on\nthe heap, and executes it.\n\n### ShellCode\n\nThe shellcode is responsible for loading the payload in memory. It attains the PEB (Process\nEnvironment Block) of the malware process to load kernel32.dll and find the location of the\nfunction GetProcAddress. This function is used to retrieve the addresses of functions such\nas VirtualAlloc, memcpy, and LoadLibrary. It allocates PAGE_EXECUTE_READWRITE\nmemory to which it copies the previously decoded payload (minus the\nIMAGE_DOS_HEADER) as shown below.\n```\n0000000: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000010: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000020: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n\n```\n\n-----\n\n```\n0000030: 0000 0000 0000 0000 0000 0000 d000 0000 ................\n0000040: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000050: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000060: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000070: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000080: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000090: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00000a0: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00000b0: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00000c0: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00000d0: 5045 0000 4c01 0200 c23a 8059 0000 0000 PE..L....:.Y....\n00000e0: 0000 0000 e000 0e21 0b01 0600 0020 0000 .......!..... ..\n00000f0: 0002 0000 0000 0000 0011 0000 0010 0000 ................\n0000100: 0030 0000 0000 0010 0010 0000 0002 0000 .0..............\n0000110: 0400 0000 0000 0000 0400 0000 0000 0000 ................\n0000120: 0040 0000 0004 0000 0000 0000 0200 0000 .@..............\n0000130: 0000 1000 0010 0000 0000 1000 0010 0000 ................\n0000140: 0000 0000 1000 0000 0000 0000 0000 0000 ................\n0000150: 4c28 0000 dc00 0000 0000 0000 0000 0000 L(..............\n0000160: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000170: 0030 0000 c000 0000 0000 0000 0000 0000 .0..............\n0000180: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n0000190: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00001a0: 0000 0000 0000 0000 0010 0000 0001 0000 ................\n00001b0: 0000 0000 0000 0000 0000 0000 0000 0000 ................\n00001c0: 0000 0000 0000 0000 2e74 6578 7400 0000 .........text…\n00001d0: 041e 0000 0010 0000 0020 0000 0004 0000 ......... ......\n00001e0: 0000 0000 0000 0000 0000 0000 2000 00e0 ............ …\n00001f0: 2e72 656c 6f63 0000 1a01 0000 0030 0000 .reloc.......0..\n0000200: 0002 0000 0024 0000 0000 0000 0000 0000 .....$..........\n0000210: 0000 0000 4000 0042 0000 0000 0000 0000 ....@..B........\n\n```\nOnce the payload is copied to the newly allocated memory, the shellcode resolves the\nneeded API’s, and calls the OEP (original entry point) of the payload in memory.\n\n### Payload\n\n Environment Checks\n\nOnce it’s loaded, the payload creates a thread that performs the core functionality of the\nmalware. It performs a few checks at the onset of the environment and the user privileges.\nThe malware employs the function msvcrt.time to record the current time of the malware. It\nthen uses IcmpCreateFile and IcmpSendEcho to send an IPv4 ICMP echo to an invalid IP\naddress, with a timeout of 601 seconds. This is meant to delay the execution of the malware\nby 601 seconds; this delay is then measured by calling msvcrt.time again, and ensuring that\nmore than 600 seconds have elapsed between the first and second calls to the function. It\n\n\n-----\n\nshould be noted that if the call to IcmpCreateFile fails, the malware will just sleep for 600\nseconds.These steps are measures against debugging and/or sandboxing. It also invokes\n**IsUserAnAdmin to ensure that the current user is member of the administrator’s group. If**\neither of these checks fails, the malware exits immediately.\n\nIt uses a decoding scheme as the one described above to decode strings during runtime in\nmemory. It is important to note that these dynamically decoded strings are zeroed out in\nmemory before each function using them exits. The strings dynamically decoded throughout\nthe execution of the malware are listed in the Appendix section of this blog.\n\nThe malware also checks the privilege levels of its own process; if the process does not have\nadministrative privileges, it uses AdjustTokenPrivileges to enable the SeDebugPrivilege\nvalue for the process. This enables the process to either debug or adjust memory for a\nprocess owned by another account.\n\n### Registry Checks\n\nThe malware checks for the following registry key:\n**HKLM\\SOFTWARE\\Piriform\\Agomo\\TCID. The key value is supposed to hold a system**\ntime value; if the value is greater than the current time, the malware will terminate. It also\nchecks the value of HKLM\\SOFTWARE\\Piriform\\Agomo\\MUID. If the key does not exist,\nthe malware will set its value using a pseudo-random number derived in the following\nmanner:\n\n`// Pseudocode to calculate MUID` val\n\n```\nDWORD MUID;\n\n```\n```\nseed = GetTickCount();\n\n```\n\n### Gathering Victim Information\n\nOnce the checks are completed, the malware gathers the following information about the\nvictim machine:\n\nOS major version\nOS minor version\nOS architecture\nComputer name\nComputer DNS domain\n\n\n-----\n\nIPv4 addresses associated with the machine. This information is gathered by calling\n**GetAdaptersInfo, and then enumerating through each adapter to search for the**\nIP_ADAPTER_INFO → IpAddressList → IpAddress field.\nInstalled applications. The malware accesses the registry key\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall, and enumerates\nthrough each key, and compares the Publisher value with “Microsoft Corporation.” If\nthere is a match, it moves on to the next value. If not, it will attain the DisplayName\nvalue using SHGetValueA, and insert it into memory. Each name is prepended with an\n“S” in memory.\nFull name of the executable image of each running process. The malware calls\n**WTSEnumerateProcessA to get a pointer to an array of WTS_PROCESS_INFO**\nstructures, which are then used to get the ProcessName field for each process. Each\nprocess name is prepended with a “P” in memory.\n\nThis information is stored in a data structure in memory in the following manner:\n\nThe MUID_Val is used as a unique identifier for the victim machine.\n\nNext, the structure is encoded in memory in two steps:\n\nStep 1: Aforementioned scheme\nStep 2: Modified version of base64\n\nThe image below displays the data structure as it goes through each encoding step.\n\n\n-----\n\nThe custom base64 encoding scheme uses a modified Base64 index table. Rather than the\nregular table that has the following values:\n**ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789+/; its**\ntable has the following values:\n**abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789!*.**\n\n### C2 Communication\n\nOnce the victim machine information has been encoded, the malware queries the registry\nkey HKLM\\SOFTWARE\\Piriform\\Agomo\\NID. Upon the initial run, the registry key does not\nexist; however, the malware eventually inserts an IP address computed via a DGA (Domain\nGenerating Algorithm) later in the execution flow. It is interesting to note that even if the\nregistry key exists, the malware extracts the IP address from the registry value, but does not\ndo anything with it. After the registry check, it decodes the hard-coded IP address\n**216.126.225[.]148, and attempts to send the encoded data struct to it via an HTTP POST**\nrequest on port 443. It uses InternetSetOptionA to set the following option flags on the\nHTTP handle:\n\nSECURITY_FLAG_IGNORE_CERT_DATE_INVALID → Ignores bad or expired SSL\ncertificates from the server\nSECURITY_FLAG_IGNORE_CERT_CN_INVALID → Ignores incorrect SSL certificate\ncommon names\nSECURITY_FLAG_IGNORE_WRONG_USAGE → Ignores incorrect usage problems\nSECURITY_FLAG_IGNORE_UNKNOWN_CA → Ignores unknown certificate authority\nproblems\nSECURITY_FLAG_IGNORE_REVOCATION → Ignores certificate revocation problems\n\nThe malware also calls HttpAddRequestHeadersA to append the domain\n**speccy.piriform[.]com to the POST request. This is performed to appear inconspicuous and**\nmake it harder to detect. It is also likely an attempt to confuse the analyst performing\ndynamic analysis of the malware. Once the information is sent to the C2, the malware\nexpects to receive a stage 2, which it reads into a locally allocated memory block. Analysis\nshows that once stage 2 is received, it is decoded using the same custom Base64 and the\ndecoding algorithm. Once decoded, the functions GetProcAddress and LoadLibraryA are\npushed to the stack, and the EP of stage 2 is called. At the time of analysis, stage 2 was not\navailable.\n\n**DGA**\n\nIf the malware cannot connect to the C2, it employs a Domain Generating Algorithm, or\nDGA, to generate a domain. The DGA is dependent on the current year and month;\ntherefore, it generates a new domain on a monthly basis. Below is the code, reproduced in\nC, displaying the DGA utilized by the malware.\n\n\n-----\n\n```\n#include stdafx.h\n#include <Windows.h>\n#include <stdio.h>\nvoid main()\n{\nSYSTEMTIME st;\nDWORD r1, r2, r3, seed;\nchar buf[100];\nconst char *format = \"ab%x%x.com\";\nGetLocalTime(&st);\nseed = st.wYear * 10000 + st.wMonth;\nsrand(seed);\nr1 = rand();\nr2 = rand();\nr3 = rand() * r2;\nsprintf_s(buf, format, r3, r1);\n}\n\n```\nThe list of domains calculated for all months in the years 2017 and 2018 are listed in the\nAppendix.\n\nOnce the DGA domain for the current month and year has been calculated, the malware\ncalculates an IP address using that domain in the following steps:\n\nGet a hostent structure by calling gethostbyname on the generated domain\nGet the h_addr_list, which is a NULL terminated list of IP addresses associated with\nthe domain\n\nThese A records (127.100.183[.]225 and 10.158.168[.]171) for the domain\nab1145b758c30[.]com, as highlighted in the PCAP screenshot below will be used to\ncalculate a new C2 IP address. If there are more than two A records, the malware will only\nutilize the first two on the list.\n\n\n-----\n\nThe Python code below reproduces the algorithm to calculate the new C2 IP address from\nthe A records of the newly generated domain.\n\n```\n  rr3 = rr & 0xff00\n\n```\n```\nnewa2 = mod_record(a2) newIP = (newa2 & 0xffff0000) | (newa1 >> 0x10) #\nnewIP = 0xA1369ED3 print socket.inet_ntoa(struct.pack(\"<L\", newIP)) #\nOutput is 211.158.54.161\n\n```\nThe new C2 IP address derived from the records of the domain ab1145b758c30[.]com is\n211.158.54[.]161. The malware will attempt to connect to this C2 as shown below. If the\nconnection is successful, it will subsequently send the encoded data structure and await\nstage 2.\n\n\n-----\n\n### Initial (Buggy) Registry Modifications\n\nOnce the C2 communication subroutine has ended, the malware makes two registry\nmodifications:\n\nEncodes the newly calculated C2 IP address and attempts to save it in\n**HKLM\\SOFTWARE\\Piriform\\Agomo\\NID. The encoding scheme is the same as the**\none mentioned before. Analysis shows that before the registry key string is built, a\nfunction is called to change the endianness of 0x44494E (DIN) to 0x4E4944 (NID).\nHowever, due to a bug in the code the function incorrectly changes it to 0x004E4944\n(prepended with a NULL value). Subsequently, function SHSetValueA is called with the\nfollowing parameters:\n\n**hKey = HKEY_LOCAL_MACHINE**\n**Subkey = “SOFTWARE\\Piriform\\Agomo”**\n**Value = “”**\n**ValueType = REG_DWORD**\n**Data = …**\n**DataLength = 0x4**\n\nThe parameter Value should be “NID”; however, since the string is incorrectly prepended\nwith a NULL value, the function doesn’t read the string at all. The C2 IP address is instead\nsaved in HKLM\\SOFTWARE\\Piriform\\Agomo\\Default as shown below.\n\n\n-----\n\nTakes the current time value as determined by the earlier call to msvcrt.time and adds\n172,800 seconds (2 days) to the value. Saves the new value in\nHKLM\\SOFTWARE\\Piriform\\Agomo\\TCID.\n\n### Recommendations\n\nFalcon Endpoint will notify you of any additional activity through our Falcon Intelligence\ndetections. The intent behind the malicious packages was to collect an initial set of\nreconnaissance data; we urge you to block the known IP address and domains at your\nnetwork perimeter to prevent any communication to the collection server. In addition, we\nrecommend you update to the latest version of the Avast CCleaner software to ensure the\nembedded malicious code is removed.\n\nFor additional information on CrowdStrike’s threat intelligence offerings, visit the Falcon\nIntelligence product page.\n\n## Appendix\n\n### Hashes\n\nInformation regarding the CCleaner binaries that were affected:\n\n\n-----\n\n**Size:   9791816**\n**SHA256:** `1A4A5123D7B2C534CB3E3168F7032CF9EBF38B9A2A97226D0FDB7933CF6030FF`\n**Compiled: Tue, Dec 29 2015, 21:34:49 UTC – 32 Bit EXE**\n**Version: 5.33.00.6162**\n**Signature Valid**\n**Subject: Piriform Ltd**\n**Issuer:  Symantec Class 3 SHA256 Code Signing CA**\n\n**Size:   7680216**\n**SHA256:** `6F7840C77F99049D788155C1351E1560B62B8AD18AD0E9ADDA8218B9F432F0A9`\n**Compiled: Thu, Aug 3 2017, 9:25:13 UTC – 32 Bit EXE**\n**Version: 5, 33, 00, 6162**\n**Signature Valid**\n**Subject: Piriform Ltd**\n**Issuer:  Symantec Class 3 SHA256 Code Signing CA**\n\n**Size:   7781592**\n**SHA256:** `36B36EE9515E0A60629D2C722B006B33E543DCE1C8C2611053E0651A0BFDB2E9`\n**Compiled: Thu, Aug 3 2017, 9:37:49 UTC – 32 Bit EXE**\n**Version: 5, 33, 00, 6162**\n**Signature Valid**\n**Subject: Piriform Ltd**\n**Issuer:  Symantec Class 3 SHA256 Code Signing CA**\n\nThe following is the information about the decoded payload in memory:\n**Size: 16384**\n**SHA256:** `FA8A55A05CA9E6587C941354628A0E818DCBF42ED3D98C40689F28564F0BFA19`\n**Compiled: Tue, Aug 1 2017, 8:24:34 UTC – 32 Bit DLL**\n\n### Network Artifacts\n\nThe following is the infrastructure associated with the CCleaner backdoor:\n\nInfrastructure Connection Type Description\n\n216.126.225[.]148 Port 443 / TCP C2\n\n### DGA Domains\n\nMonth, Year Domain Month, Year Domain\n\nJanuary, 2017 abde911dcc16[.]com January, 2018 ab3c2b0d28ba6[.]com\n\nFebruary, 2017 ab6d54340c1a[.]com Feburary, 2018 ab99c24c0ba9[.]com\n\n\n-----\n\nMarch, 2017 aba9a949bc1d[.]com March, 2018 ab2e1b782bad[.]com\n\nApril, 2017 ab2da3d400c20[.]com April, 2018 ab253af862bb0[.]com\n\nMay, 2017 ab3520430c23[.]com May, 2018 ab2d02b02bb3[.]com\n\nJune, 2017 ab1c403220c27[.]com June, 2018 ab1b0eaa24bb6[.]com\n\nJuly, 2017 ab1abad1d0c2a[.]com July, 2018 abf09fc5abba[.]com\n\nAugust, 2017 ab8cee60c2d[.]com August, 2018 abce85a51bbd[.]com\n\nSeptember, 2017 ab1145b758c30[.]com September, 2018 abccc097dbc0[.]com\n\nOctober, 2017 ab890e964c34[.]com October, 2018 ab33b8aa69bc4[.]com\n\nNovember, 2017 ab3d685a0c37[.]com November, 2018 ab693f4c0bc7[.]com\n\nDecember, 2017 ab70a139cc3a[.]com December, 2018 ab23660730bca[.]com\n\n### Dynamically Decoded Strings\n\nThe following are the strings that are dynamically decoded during the malware’s execution. It\nshould be noted that each string is promptly zeroed out in memory after use.\n\n```\nPublisher\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-10-04 - Protecting the Software Supply Chain- Deep Insights into the CCleaner Backdoor.pdf"
    ],
    "report_names": [
        "2017-10-04 - Protecting the Software Supply Chain- Deep Insights into the CCleaner Backdoor.pdf"
    ],
    "threat_actors": [
        {
            "id": "4b076dcb-516e-42fb-9c8f-f153902cd5e9",
            "created_at": "2022-10-25T16:07:23.708745Z",
            "updated_at": "2025-03-27T02:02:09.935617Z",
            "deleted_at": null,
            "main_name": "Hidden Lynx",
            "aliases": [
                "Aurora Panda",
                "Group 8",
                "Hidden Lynx",
                "Operation SMN"
            ],
            "source_name": "ETDA:Hidden Lynx",
            "tools": [
                "AGENT.ABQMR",
                "AGENT.AQUP.DROPPER",
                "AGENT.BMZA",
                "AGENT.GUNZ",
                "BlackCoffee",
                "HiKit",
                "MCRAT.A",
                "Mdmbot.E",
                "Moudoor",
                "Naid",
                "PNGRAT",
                "Trojan.Naid",
                "ZoxPNG",
                "gresim"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535943,
    "ts_updated_at": 1743041765,
    "ts_creation_date": 1653767132,
    "ts_modification_date": 1653767132,
    "files": {
        "pdf": "https://archive.orkl.eu/8edfe289c0cb0f6dcd28bad38e02f9735af3effd.pdf",
        "text": "https://archive.orkl.eu/8edfe289c0cb0f6dcd28bad38e02f9735af3effd.txt",
        "img": "https://archive.orkl.eu/8edfe289c0cb0f6dcd28bad38e02f9735af3effd.jpg"
    }
}