{
    "id": "9db8f0b1-3000-47a8-8589-67bfe6a9deb3",
    "created_at": "2023-01-12T15:03:35.632406Z",
    "updated_at": "2025-03-27T02:17:01.615487Z",
    "deleted_at": null,
    "sha1_hash": "518df9a66b549b397f7e79ba2e44a3cb664711ac",
    "title": "2021-10-13 - Trouble in Asia and the Middle East. Tracking the TransparentTribe threat actor.",
    "authors": "",
    "file_creation_date": "2022-05-28T18:23:45Z",
    "file_modification_date": "2022-05-28T18:23:45Z",
    "file_size": 1131217,
    "plain_text": "# Trouble in Asia and the Middle East. Tracking the TransparentTribe threat actor.\n\n**[anchorednarratives.substack.com/p/trouble-in-asia-and-the-middle-east](https://anchorednarratives.substack.com/p/trouble-in-asia-and-the-middle-east)**\n\nRJM\n\nShare this post\n\nTrouble in Asia and the Middle East. Tracking the TransparentTribe threat actor.\n\nanchorednarratives.substack.com\n\n### A case study into a threat actor that is likely originating from Pakistan which is leveraging CrimsonRat and malicious documents to control their targets.\n\n[RJM](https://substack.com/profile/23714532-rjm)\nOct 13, 2021\n\nShare this post\n\nTrouble in Asia and the Middle East. Tracking the TransparentTribe threat actor.\n\nanchorednarratives.substack.com\n\nCover: Chabahar Port Iran, photo credit:www.tehrantimes.com\n\n\n-----\n\n**Disclaimer: The views, methods, and opinions expressed at Anchored Narratives are the**\nauthor’s and do not necessarily reflect my employer’s official policy or position.\n\n## Introduction\n\nWelcome to the new subscribers of the Anchored Narratives mailing list. For those new to\nthe list, I regularly pick an exciting tweet that matched my intelligence requirements and\ngenerated anchored stories on geopolitical (cyber) threats, digital forensics, and crime from\nthat. Usually, I pick a story that I have no real in-depth or prior knowledge about. The goal is\nto understand a particular topic better, improve my investigation or writing skills, and\ngenerate a reliable story anchored with evidence that can be verified or challenged.\n\nI have not been writing any stories lately as I started a great new job in September. I’m also\nworking in incident response (IR) again with a lot of memory forensics! Awesome how\n[Volexity has taken that field to the next level with a robust memory acquisition capability](https://www.volexity.com/)\n[called Surge and a Volcano’s memory analysis platform. I participated with the great George](https://www.volexity.com/products-overview/surge/)\nGarner Jr1., who unfortunately passed away in 2017, in a memory forensics challenge in\n[2005 where no software existed to analyze memory dumps.](http://old.dfrws.org/2005/challenge/)\n\nBut unbelievable how Volexity improved the acquisition and analysis piece with their\nproducts. However, they are commercial tools. I can only recommend them as they will\nprovide you valuable insights into the State of a machine (integrity) in a certain period and\ndecrease your root cause analysis time for breaches. The amount of forensic reconstruction\nfrom a collected memory sample the software can do is just something I have not\nexperienced before. We are even able to recover the entire exploit chains and backdoors\nexecuted by threat actors from memory. Just awesome.\n\nBut now, back to a new anchored narrative about a threat actor covered in the earlier\nmonthly threat actor overviews of June and September, namely TransparentTribe.\n\nWith the revival of the Taliban in Afghanistan also geopolitical tensions in the neighboring\ncountries changed drastically. What does this revival mean for China, India, and Pakistan? In\nthis article, the nation-state actor, TransparentTribe matched my Twitter threat intelligence\nrequirements 71 times since the beginning of this year. The threat-actor is likely originating\nfrom Pakistan and also linked to attacks on the critical infrastructure of India. Here we go!\n\n## Background TransparentTribe\n\n[In 2016 Proofpoint released a report “Operation TransparentTribe’ of a nation-state threat](https://www.proofpoint.com/sites/default/files/proofpoint-operation-transparent-tribe-threat-insight-en.pdf)\nactor targeting India’s embassy staff in Saudi Arabia and Kazakstan via phishing attacks.\nTheir research also unraveled attacks against Indian diplomatic and military resources via\nso-called watering holes attacks. A watering hole attack is a technique that hackers employ\n\n\n-----\n\nto compromise a popular website and infect its visitors with malware once they visit that\ninfected website. Proofpoint then dubbed their malware as “MSIL/Crimson”, which later\nbecame known as CrimsonRat.\n\n[By 2017 CysInfo, shared an in-depth story about a threat actor who was impersonating the](https://cysinfo.com/cyber-attack-targeting-cbi-and-possibly-indian-army-officials/)\nidentity of an Indian Think Tank to Target the Central Bureau of Investigation (CBI) and\nPossibly Indian Army Officials. The registration information of the domains was traced back\nto a Pakistani telephone number and an IP address from Pakistan. The story’s author, known\nmalware researcher, [Monnappa K A, did not attribute it to TransparentTribe. However, his](https://cysinfo.com/author/monnappa/)\n[analysis was referenced in the Threat Actor Encyclopedia and attributed to the same group](https://www.thaicert.or.th/downloads/files/A_Threat_Actor_Encyclopedia.pdf)\nthere.\n\n[In 2020 Kaspersky shared interesting research about the CrimsonRat Server component](https://securelist.com/transparent-tribe-part-1/98127/)\nthey detected and that the actor group targeted victims in Afghanistan and India.\n\nFigure 1: .Net Server component of CrimsonRat, reported by Kaspersky\nCrimsonRat provides the espionage group with the following capabilities on the infected\nsystems:\n\nmanage remote filesystems\n\nupload or download files\n\ncapture screenshots\n\nperform audio surveillance using microphones\n\nrecord video streams from webcam devices\n\ncapture screenshots\n\nsteal files from removable media\n\nexecute arbitrary commands\n\nrecord keystrokes\n\nsteal passwords saved in browsers\n\n\n-----\n\nspread across systems by infecting removable media\n\nFigure 2: Collection of relevant files on\n\ninfected systems via USB worm\nKaspersky detected hundreds of victims, but infection also occurred through a USB-Worm\ncomponent of CrimsonRat. Kaspersky found an Android piece of malware to spy on mobile\nphones and a link between ObliqueRAT and Transparent Tribe in their second part. The\ngroup mimicked a known COVID tracking app.\n\n[In April 2021 and July 2021, Team Cymru released part 1 and](https://team-cymru.com/blog/2021/04/16/transparent-tribe-apt-infrastructure-mapping/) [part 2 of their analysis that](https://team-cymru.com/blog/2021/07/02/transparent-tribe-apt-infrastructure-mapping-2/)\nfocused on the infrastructure leveraged by the TransparentTribe group. It highlighted the\nfollowing findings:\n\n1. C2s are hosted with several VPS providers – most commonly Contabo, ColoCrossing,\n\nPi Net, and QuadraNet.\n\n2. Port 3389 was observed open on 83% of the CrimsonRAT C2 servers.\n\n3. An RDP certificate serves as a key indicator for CrimsonRAT and has been observed\n\non 17 C2 servers in total.\n\n4. Analysis of C2 servers showed beaconing from victims who were primarily located in\n\nthe Kashmir region.\n\n\n-----\n\nFigure 3:\n\nClustering victims from a known TransparentTribe C2 server\n[In July 2021, the Hindu media outlet reported that TransparentTribe was targeting critical](https://www.thehindu.com/sci-tech/technology/internet/pakistan-linked-hackers-are-targeting-critical-infrastructure-psus-in-india/article35230901.ece)\n[Indian infrastructure of public enterprises, according to a report by Seqrite. In their report,](https://www.seqrite.com/documents/en/white-papers/Seqrite-WhitePaper-Operation-SideCopy.pdf)\nSeqrite mentions the group was “targeting critical Indian organizations”. The report explains\nthat TransparentTribe mimicked the behavior of an Indian nation-state actor group named\nSidewinder. Their analysis demonstrates that VPS provider Contabo in Germany hosts the\nCrimsonRat infrastructure. In addition, some of the domains used for their operations were\nregistered to someone in Pakistan with the e-mail address “kingsmanfisher@gmail.com”.\n\n[In September 2021, Cyble shared research finding TransparentTribe malware that targeted](https://blog.cyble.com/2021/09/14/apt-group-targets-indian-defense-officials-through-enhanced-ttps/)\nthe Indian Armed forces staff. Additionally, they found an icon loaded by the malicious app,\nwhich is the logo of the Canteen Store Department (CSD).\n\n\n-----\n\nFigure 4: Icon of the CSD of the Indian Armed Forces\n\n[Lastly, in September 2021, Weibu online shared their insights in a threat intelligence report](https://mp-weixin-qq-com.translate.goog/s/AhxP5HmROtMsFBiUxj0cFg?_x_tr_sl=zh-CN&_x_tr_tl=en&_x_tr_hl=nl&_x_tr_pto=nui)\nwith relevant indicators of compromise (translated) called “Trilateral operations: years of\ncyber espionage against many countries in South Asia and the Middle East”. They captured\nseveral APT attacks against Iran, Afghanistan, and India, all parties that signed the\n“Chabahar Port Agreement”. In the report, Weibu lists a malicious document called\n[“Chabahar Port Agreement (Trilateral) in Iran.doc”, which they observed in the attack](https://www.virustotal.com/gui/file/7eeef37f3a4c6367603d14e63e7783c75ec66ee85beee21d692ec5391437600d)\nuploaded to VirusTotal March 2021. The victims were targeted via phishing, watering holes\nor backdoored software, or malicious Android packages.\n\nWeibu further explains the geopolitical significance of the Chabahar port. “Chabahar Port is\n_the global oil and gas center on the coast of the Persian Gulf to the west, and leads to the_\n_oil-rich Central Asian countries to the north. It is right at the intersection of West Asia, South_\n_Asia, Central Asia and the Indian Ocean. Geographical transportation is extremely important._\n“\n\nThe agreement is crucial to India as this will provide them strategic access to Iran, and it can\n[bypass Pakistan in transporting goods to Afghanistan. Still, it is also vital to counter the](https://www.indiatoday.in/fyi/story/chabahar-port-iran-importance-to-india-pakistan-afghanistan-1028342-2017-08-07)\nChinese (naval) presence in the Arabian Sea, where China supports Pakistan to develop the\nGwadar Port, which is nearby, namely 100 kilometers by sea.\n\nThe city of Chabahar is also an important military site for Iran’s navy and air force. In\naddition, Iran has many large iron mines, giant copper mines, and rich oil and gas resources.\nThe threat actor responsible for the attack overlaps to a certain degree with the\nTransparentTribe group, and they are likely to have a Pakistani background, claimed by\nWeibu.\n\n## Reversing their latest malware\n\nOn the 24th of September 2021 malware researcher, at Malwarebytes Jazi (@h2jazi) shared\nthe following TransparentTribe intelligence. Interestingly, the actors mimicked the original\nIranian website “https://www.tasnimnews.com” website as their C2 server.\n\nJazi @h2jazi\n\n\n-----\n\n#TransparentTribe #APT maldoc:\n59ed41388826fed419cc3b18d28707491a4fa51309935c4fa016e53c6f2f94bc Nakul\nKumar.doc #Crimson Rat:\nafd21ef5712ffcbe4e338a5eb347f742d3c786f985ba003434568146adedb290 C2:\ntasnimnewstehran[.]club\n\n\n-----\n\nSeptember 24th 2021\n\n11 Retweets31 Likes\nI will briefly assess the malicious document and CrimsonRat backdoor to determine if new\ndevelopments can be spotted. Let’s start with the malicious document.\n```\nNakul Kumar.doc 59ed41388826fed419cc3b18d28707491a4fa51309935c4fa016e53c6f2f94bc\n\n```\nFirst, the file type was determined with the file command. This revealed the following\ninformation:\n```\n59ed41388826fed419cc3b18d28707491a4fa51309935c4fa016e53c6f2f94bc: Composite Document\nFile V2 Document, Little Endian, Os: Windows, Version 10.0, Code page: 1252, Author:\nChinto, Template: Normal.dotm, Last Saved By: Allen Murphy, Revision Number: 17, Name\nof Creating Application: Microsoft Office Word, Total Editing Time: 17:00, Create\nTime/Date: Tue Sep 21 07:52:00 2021, Last Saved Time/Date: Tue Sep 21 10:00:00 2021,\nNumber of Pages: 1, Number of Words: 0, Number of Characters: 1, Security: 0\n\n```\nThe file command revealed some interesting metadata. The next step was to inspect the\n[documents for the presence of malicious macros. With the famous oletools, it was possible](https://www.decalage.info/python/oletools)\nto retrieve all the Visual Basic for Application (VBA) macro’s in the document.\n```\naskfjlskdjflkjsdrkljskd = Split(UserForm1.TextBox1.Text & UserForm1.TextBox2.Text &\nUserForm1.TextBox3.Text & UserForm1.TextBox4.Text, \"!\")\nDim lskjfjiogjnvdfgljwlfjfsf As Double\nlskjfjiogjnvdfgljwlfjfsf = 0\nFor Each tiogjvelrrkjf In askfjlskdjflkjsdrkljskd\n    ReDim Preserve alksdjweoijgskljsl_____(lskjfjiogjnvdfgljwlfjfsf)\n    alksdjweoijgskljsl_____(lskjfjiogjnvdfgljwlfjfsf) = CByte(tiogjvelrrkjf)\n    lskjfjiogjnvdfgljwlfjfsf = lskjfjiogjnvdfgljwlfjfsf + 1\nVBA FORM STRING IN '59ed41388826fed419cc3b18d28707491a4fa51309935c4fa016e53c6f2f94bc'\n- OLE stream: 'Macros/UserForm1/o'\n- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n20!163!163!232!71!161!103!90!143!154!72!231!144!84!104!72!25!253!146!69!107!219!79!95!\n\n```\nBeing familiar with their malicious documents, it appears that the actor is starting to use\nrandom names for variables and functions, but take note that the actor is still using the\nSplit(UserForm1.Textbox1) where the decimal content is separated by “!”. The same\ntechnique has been observed in the analysis of Monnappa K A in 2017 and displayed in the\nscreenshot below.\n\n\n-----\n\nFigure 5: Similar\n\nmethods observed in research from 2017\nBy extracting the decimal content from the malicious document and storing it in a text file, the\nCrimsonRat backdoor named “winword.exe” could be extracted by the following Python\nprogram. I could not enter the program in the code section of Substack as this produced an\nerror, hence the screenshot.\n\nFigure 6: Sample program to convert the decimal content into binary\nTo determine if the data has been converted correctly, the executable is calculated with\n_sha256sum._\n```\n$ sha256sum winword.exe \nafd21ef5712ffcbe4e338a5eb347f742d3c786f985ba003434568146adedb290 \n\n```\n\n-----\n\nThe value corresponds with the data that Jazi, the malware researcher, shared. The file\ncommand was used again to determine if the executable is indeed a .Net piece of malware.\n```\n$ file winword.exe \nwinword.exe: PE32 executable (GUI) Intel 80386 Mono/.Net assembly, for MS Windows\n\n```\nThe file command provides insights that the malware is a .Net executable with loads in\nDnSpy, but first, the executable was investigated with ClamAV, the open-source anti-virus\nscanner. I’m a massive fan of that project as it is fast, and you can build your custom\nsignatures with it. I have used it in the past to detect malicious backdoors on forensic images\nof multiple servers that were part of a significant forensic investigation.\n```\n$ clamscan winword.exe \nwinword.exe: Win.Trojan.CrimsonRAT-7591455-0 FOUND\n----------- SCAN SUMMARY ----------Known viruses: 17106785\nEngine version: 0.103.2\nScanned directories: 0\nScanned files: 1\nInfected files: 1\nData scanned: 1.66 MB\nData read: 1.56 MB (ratio 1.07:1)\nTime: 559.328 sec (9 m 19 s)\nStart Date: 2021:10:10 11:15:17\nEnd Date:  2021:10:10 11:24:37\n\n```\nClamAV still detects this latest CrimsonRat. If you want to understand which patterns the\nmalware got detected, you could leverage the power of sigtool. With the sigtool, you can\ndisplay the signatures and decode the decimal and compressed values stored in the ClamAV\ndatabases. This method can also get a better insight into how actors develop their malware\nand obtain better intelligence on them.\n```\n$ sigtool --find-sigs Win.Trojan.CrimsonRAT-7591455-0\n[daily.ldb] Win.Trojan.CrimsonRAT-7591455-0;Engine:51-255,Target:1;(0|\n((1|2|3|4|5|6)>3,3));74686e61766977615c74686e61766977615c6f626a5c44656275675c74686e617\n\n```\nThe -decode-sigs argument can decode the signatures of ClamAV.\n\n\n-----\n\n```\n$ sigtool find sigs Win.Trojan.CrimsonRAT 7591455 0 |sigtool decode sigs\nVIRUS NAME: Win.Trojan.CrimsonRAT-7591455-0\n<cut for brevity>\nthnaviwa\\thnaviwa\\obj\\Debug\\thnaviwa.pdb\npull_data\ndo_process\nIPSConfig\n_responce>b__\nsee_responce\nfunStarter\n<cut for brevity>\n\n```\nI have removed other information for readability, but ClamAV detected the CrimsonRat\nsample as it encountered more than 3 of the strings like “pull_data” or “do_process” in the\nsample. This can be verified by executing the strings and grep on the “winword.exe” sample.\n```\n$ strings -a winword.exe |grep -iE \"\n(pull_data|do_process|_responce>b__|see_responce|funStarter|thnaviwa.pdb)\"\ngitfunStarter\ngitsee_responce\ngitpull_data\ngitdo_process\n\n```\nThe sample contained four matches with the signatures stored in the ClamAV database’\ndaily.ldb’. By loading the CrimsonRat (winword.exe) in dnSpy, you can view the code of the\nCrimsonRat, but also see some of the matching strings on the left. From this sample is also\nappears that the author of the CrimsonRat is obfuscating the code better than observed in\nearlier samples.\n\n\n-----\n\nFigure 6: dnSpy displays randomized functions and routines in the latest CrimsonRat\n\n## Conclusion\n\nThe TransparentTribe actor seems very busy, is not stealthy, and anti-virus solutions have\nproper detections. The actor is observed in different regions in Asia and attacking multiple\ncountries in the area, but primarily India and Afghanistan. The main attack vectors that the\ngroup employs are still phishing, watering hole attacks, or backdoored downloads. There\nappears to be a broad consensus among malware security researchers that the nation-state\nactor originates from Pakistan. The latest samples demonstrate that the actor is trying to\nobfuscate the malware by applying random names to functions and variables in the malicious\ndocuments and the CrimsonRat, thus far not with a lot of success. The actor also has\ncapabilities the target victims on the Android platform.\n\nAlthough mentioned in some research, I could not observe that TransperentTribe was\nattacking critical infrastructure in India. Still, from a nation-state perspective, you likely want\nto gain a strategic foothold in the crucial infrastructure networks of your enemy.\n\nMany security companies have shared research on TransparentTribe. Still, Weibo shared the\nfascinating geopolitical angle that I was unfamiliar with, namely one of significant strategic\nimportance towards countering China’s Belt and Road Initiative in the Middle East and Asia\nby India. They reported an attack on Iran, India, and Afghanistan with a theme of the trilateral\nagreement of the port of Chahabar in Iran. Until next time, where the indicators will direct me\nin writing the subsequent anchored narrative. Likely on another nation-state operating in the\nSouth Asia region.\n\n\n-----\n\n## Appendix: TransparentTribe IOC s since January 2021\n\nThe following IOC’s were shared on Twitter by many malware researchers since the\nbeginning of January 2021. Sharing is caring. Keep doing that! The list below matched my\nintelligence requirements multiple times but is not complete. The format of sharing that is the\nmost used by security researchers is the following:\n```\n#APT #APTGroupname\nMD5 Maldoc:MD5 Value\nFilename:Filename\nBackdoor Name:MD5 value\nITW:MD5 value\nFilename:Filename\nDownload from:Second stage payload location \nC2: IP-address\nDomain name: DNS name\nAny other interesting artifacts: DBG path\n\n```\nBased upon the above information, the data listed below matched the search criteria. Of\ncourse, I have not reviewed all samples or confirmed them to belong to that the\nTransparentTribe group definitely, but it is very likely.\n\n### TransparentTribe IOC’s\n```\nMD5: c7a3276763a5c1b13f93028aab5a6e73\nFilename:Nisha Doc.doc\nCrimsonRat:938770e6e69e6feadb1b9f63af9969f4\nFilename:ravidhtirad.exe \nC2:151.106.14.125\nMD5:1F1082F170381D1CBA07EAE5F750FE7B\nFilename:National Conference 2021.xlam\nCrimsonRat:050EC7C999666E94840D559B4EBE2BE\nC2:23.254.119.118\nMD5:7f1f7c5c4b6b486e5ba9340944036285\nMD5:77c29d464efcae961424ae050453ef11\nMD5:3c2b45a6d878cc9f30a5dc10abf400a1\nMD5:66558073be686a57514dbc72e56fd41c\nFilename:RAKESH JAYKRISHNA.xls\nC2:167.86.105.43:6588\nMD5:039c162d7fcd8640b337173e323f94d8\nFilename:CSD_AppLaunch.exe\nDownload from:hxxps://secure256.net/ver4.mp3 = IntelWifi.exe\nFilename:IntelWifi.exe\nC2: 45.147.228.195:5434\nITW:54a86a284932a893a80fb760f9231283\nFilename:Weekly trg prog.doc\nC2:64.188.25.143:4586\n\n```\n\n-----\n\n```\nFake Wechat.exe\nMD5:1DEFE1EAC1D87D6A7808E4471080388B\nMD5:571E6B675E7E9AA3E5A1EF3A19C25909\n#Netwire RAT suspected to be dropped by #APT-C-56 #TransparentTribe\nMD5:c2a38018cf336685e3c760c614bbf4c3\nMD5:f0b43a3f4821a4cf4b514144b496e4d7\n\"Today our researchers have found new #Tahorse sample which belongs to\n#TransparentTribe #APT group\nITW/MD5:cf937b817a81db6521a64229625fbc1b\nC2:178.132.3.230\nC2: 5.189.134.216\nMD5/ITW:e98510e1252e7dd99012b23a400bb00b\nFilename: program.exe\nC2:185.117.73.222:3344\nMD5/ITW:4a7ff92e0ea13b41a5e3410c3becfb2e\nFilename:i.docm\nC2:198.23.210.211:4898(8786)\nMD5:54d5743efcc5511368c6c04bf6840a59\nFilename:Defence and security Agenda Point.ppt\n#Crimson Rat:\nMD5:6d88dcb578cef59d3d0244d1e93b0f57\nFilename: trbgertrnion.exe\nDebug path:e:\\\\coreprojects\\\\adii\\\\trbgertrnion\\\\trbgertrnion\\\\obj\\\\Debug\\\\trbgertrnion.pdb\nC2:167.160.166.80\n\"Today our researchers have found new #Tahorse sample which belongs to\n#TransparentTribe #APT group\nITW/MD5:7d5eea5905af0b091f3ed37b20b7d847\nC2:178.132.3.230\nMD5:8057dacaf42319cde2b979b5cdfff034\nFilename:Criteria_of_Armed_forces_Offrs_docm\n#Crimson Rat:\nFilename:railthnsrqn.exe\nMD5:3a64279863fa16be74abdc8c20ceecb0\nC2:167.160.166.177\n\"Today our researchers have found #Tahorse APK Implant which belongs to\n#TransparentTribe #APT group\nITW:0fd1530fa9d78a579af960d57151a431\nfilename:whatsapplite.apk\nC2:109.236.85.16:5987\nmyabcxyz1[.]ddns[.]net:5987\nMD5:5cbcc3485f4286098b3a111ceec8ce54 #\"This might be #TransparentTribe #APT maldoc:\nMD5 c08e1509f379755df710d5a8fd4ff175 #Dropped payload\nC2:5.189.170.84\n\n```\n\n-----\n\n```\nMD5:66870a4045126c2744d86d92d564e1a4\nC2: 167.86.118.69\nPort: 443,7834\nDomain: speedytech[.]work\nJA3(ssl fingerprint): 54328bd36c14bd82ddaa0c04b25ed9ad\nITW/MD5:2f71caebb2842f4afd6c262f742d3b2b\nFilename: Sunita Singh.exe\nC2:151.106.14.125:6818\nMD5:6917d9ca4f9604ee09d08d5c33e93955\nC2: 64.188.13.46\nhxxp://64.188.13.46/deliveryyyyyyyyy/adwc.exe\n59ed41388826fed419cc3b18d28707491a4fa51309935c4fa016e53c6f2f94bc\nNakul Kumar.doc\nCrimson Rat:\nafd21ef5712ffcbe4e338a5eb347f742d3c786f985ba003434568146adedb290\nC2:tasnimnewstehran[.]club\nITW:643b11c3f6a6ccc41cfd37544b71c0dc 467e17b8d44626b7456716680e3d043d\n0061d17ff54d214c5ea6867cb815caea  \nC2:66.154.103[.]106 Port :13374\nITW:cb27d0bd9a97e053f3fbfcf4bba8b8fc\nFilename:Ultimate-File.docm\nC2:134.119.181.142:6672\nMD5：28dc287cc78e195386dc33564dfe449a\n\n```\nGeorge M. Garner Jr. was the author of kntdd and kntlist. Kntdd was used to acquire memory\non Windows systems, and kntlist was used to interpret structures in memory to detect\nrootkits. George, unfortunately, passed away in 2017.\n\n1\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-13 - Trouble in Asia and the Middle East. Tracking the TransparentTribe threat actor..pdf"
    ],
    "report_names": [
        "2021-10-13 - Trouble in Asia and the Middle East. Tracking the TransparentTribe threat actor..pdf"
    ],
    "threat_actors": [
        {
            "id": "b584b10a-7d54-4d05-9e21-b223563df7b8",
            "created_at": "2022-10-25T16:07:24.181589Z",
            "updated_at": "2025-03-27T02:02:10.134233Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "ETDA:SideCopy",
            "tools": [
                "ActionRAT",
                "AllaKore",
                "Allakore RAT",
                "AresRAT",
                "Bladabindi",
                "CetaRAT",
                "DetaRAT",
                "EpicenterRAT",
                "Jorik",
                "Lilith",
                "Lilith RAT",
                "MargulasRAT",
                "ReverseRAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6b9fc913-06c6-4432-8c58-86a3ac614564",
            "created_at": "2022-10-25T16:07:24.185236Z",
            "updated_at": "2025-03-27T02:02:10.135195Z",
            "deleted_at": null,
            "main_name": "SideWinder",
            "aliases": [
                "APT-C-17",
                "APT-Q-39",
                "BabyElephant",
                "GroupA21",
                "HN2",
                "Hardcore Nationalist",
                "Rattlesnake",
                "Razor Tiger",
                "SideWinder",
                "T-APT-04"
            ],
            "source_name": "ETDA:SideWinder",
            "tools": [
                "BroStealer",
                "Capriccio RAT",
                "callCam"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "187a0668-a968-4cf0-8bfd-4bc97c02f6dc",
            "created_at": "2022-10-27T08:27:12.955905Z",
            "updated_at": "2025-03-27T02:00:55.41311Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [
                "SideCopy"
            ],
            "source_name": "MITRE:SideCopy",
            "tools": [
                "AuTo Stealer",
                "Action RAT"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "fce5181c-7aab-400f-bd03-9db9e791da04",
            "created_at": "2022-10-25T15:50:23.759799Z",
            "updated_at": "2025-03-27T02:00:55.540135Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "Transparent Tribe",
                "COPPER FIELDSTONE",
                "APT36",
                "Mythic Leopard",
                "ProjectM"
            ],
            "source_name": "MITRE:Transparent Tribe",
            "tools": [
                "DarkComet",
                "ObliqueRAT",
                "njRAT",
                "Peppy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "c68fa27f-e8d9-4932-856b-467ccfe39997",
            "created_at": "2023-01-06T13:46:38.450585Z",
            "updated_at": "2025-03-27T02:00:02.836543Z",
            "deleted_at": null,
            "main_name": "Operation C-Major",
            "aliases": [
                "C-Major",
                "Transparent Tribe",
                "Mythic Leopard",
                "ProjectM",
                "APT 36",
                "TMP.Lapis",
                "Green Havildar",
                "COPPER FIELDSTONE",
                "APT36",
                "Earth Karkaddan",
                "Storm-0156"
            ],
            "source_name": "MISPGALAXY:Operation C-Major",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "66fc98f4-8978-401e-9b73-81c3d5f1e44c",
            "created_at": "2024-05-01T02:03:08.050109Z",
            "updated_at": "2025-03-27T02:05:17.327953Z",
            "deleted_at": null,
            "main_name": "COPPER FIELDSTONE",
            "aliases": [
                "Gorgon Group",
                "Green Havildar ",
                "Mythic Leopard ",
                "Operation C-Major ",
                "Operation Transparent Tribe ",
                "Pasty Draco ",
                "ProjectM ",
                "Storm-0156 ",
                "APT36 "
            ],
            "source_name": "Secureworks:COPPER FIELDSTONE",
            "tools": [
                " DarkComet",
                " LuminosityLink",
                " Peppy",
                " njRAT",
                "Crimson RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "173f1641-36e3-4bce-9834-c5372468b4f7",
            "created_at": "2022-10-25T15:50:23.349637Z",
            "updated_at": "2025-03-27T02:00:55.450857Z",
            "deleted_at": null,
            "main_name": "Sidewinder",
            "aliases": [
                "Sidewinder",
                "T-APT-04"
            ],
            "source_name": "MITRE:Sidewinder",
            "tools": [
                "Koadic"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0c0a5ea-3066-42a5-846c-b13527f64a3e",
            "created_at": "2023-01-06T13:46:39.080551Z",
            "updated_at": "2025-03-27T02:00:02.992026Z",
            "deleted_at": null,
            "main_name": "RAZOR TIGER",
            "aliases": [
                "SideWinder",
                "APT-C-17",
                "T-APT-04"
            ],
            "source_name": "MISPGALAXY:RAZOR TIGER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "abb24b7b-6baa-4070-9a2b-aa59091097d1",
            "created_at": "2022-10-25T16:07:24.339942Z",
            "updated_at": "2025-03-27T02:02:10.179404Z",
            "deleted_at": null,
            "main_name": "Transparent Tribe",
            "aliases": [
                "APT 36",
                "APT-C-56",
                "Copper Fieldstone",
                "Earth Karkaddan",
                "Green Havildar",
                "Mythic Leopard",
                "Operation C-Major",
                "Operation Honey Trap",
                "Operation Transparent Tribe",
                "ProjectM",
                "STEPPY-KAVACH",
                "Storm-0156",
                "TEMP.Lapis",
                "Transparent Tribe"
            ],
            "source_name": "ETDA:Transparent Tribe",
            "tools": [
                "Amphibeon",
                "Android RAT",
                "Bezigate",
                "Bladabindi",
                "Bozok",
                "Bozok RAT",
                "BreachRAT",
                "Breut",
                "CapraRAT",
                "CinaRAT",
                "Crimson RAT",
                "DarkComet",
                "DarkKomet",
                "ElizaRAT",
                "FYNLOS",
                "Fynloski",
                "Jorik",
                "Krademok",
                "Limepad",
                "Luminosity RAT",
                "LuminosityLink",
                "MSIL",
                "MSIL/Crimson",
                "Mobzsar",
                "MumbaiDown",
                "Oblique RAT",
                "ObliqueRAT",
                "Peppy RAT",
                "Peppy Trojan",
                "Quasar RAT",
                "QuasarRAT",
                "SEEDOOR",
                "Scarimson",
                "SilentCMD",
                "Stealth Mango",
                "UPDATESEE",
                "USBWorm",
                "Waizsar RAT",
                "Yggdrasil",
                "beendoor",
                "klovbot",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a4f0e383-f447-4cd6-80e3-ffc073ed4e00",
            "created_at": "2023-01-06T13:46:39.30167Z",
            "updated_at": "2025-03-27T02:00:03.045082Z",
            "deleted_at": null,
            "main_name": "SideCopy",
            "aliases": [],
            "source_name": "MISPGALAXY:SideCopy",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535815,
    "ts_updated_at": 1743041821,
    "ts_creation_date": 1653762225,
    "ts_modification_date": 1653762225,
    "files": {
        "pdf": "https://archive.orkl.eu/518df9a66b549b397f7e79ba2e44a3cb664711ac.pdf",
        "text": "https://archive.orkl.eu/518df9a66b549b397f7e79ba2e44a3cb664711ac.txt",
        "img": "https://archive.orkl.eu/518df9a66b549b397f7e79ba2e44a3cb664711ac.jpg"
    }
}