{
    "id": "9dc58640-7921-4e83-a41b-9b7b69980e4f",
    "created_at": "2023-01-12T15:10:11.565672Z",
    "updated_at": "2025-03-27T02:08:41.497891Z",
    "deleted_at": null,
    "sha1_hash": "6cc250dbaf429a5cfa70d474abdb9d5f5ed4cc52",
    "title": "2015-03-05 - Casper Malware- After Babar and Bunny, Another Espionage Cartoon",
    "authors": "",
    "file_creation_date": "2022-05-27T22:08:48Z",
    "file_modification_date": "2022-05-27T22:08:48Z",
    "file_size": 695718,
    "plain_text": "# Casper Malware: After Babar and Bunny, Another Espionage Cartoon\n\n**[welivesecurity.com/2015/03/05/casper-malware-babar-bunny-another-espionage-cartoon/](https://www.welivesecurity.com/2015/03/05/casper-malware-babar-bunny-another-espionage-cartoon/)**\n\nMarch 5, 2015\n\nIn this post, we lift the veil on Casper - another piece of software that we believe to have\nbeen created by the same organization that is behind Babar and Bunny.\n\n5 Mar 2015 - 01:55PM\n\nIn this post, we lift the veil on Casper – another piece of software that we believe to have\nbeen created by the same organization that is behind Babar and Bunny.\n\n[In March 2014, French newspaper Le Monde revealed that France is suspected by the](http://www.lemonde.fr/international/article/2014/03/21/quand-les-canadiens-partent-en-chasse-de-babar_4387233_3210.html)\nCommunications Security Establishment Canada (CSEC) of having developed and\ndeployed malicious software for espionage purposes. This story was based on presentation\nslides leaked by Edward Snowden, which were then published by Germany’s [Der Spiegel in](http://www.spiegel.de/media/media-35683.pdf)\nJanuary 2015.\n\n\n-----\n\nAccording to the CSEC presentation, the malicious software in question is called Babar by\n[its creators, likely after the famous French cartoon character “Babar The Elephant”. Since](http://en.wikipedia.org/wiki/Babar_the_Elephant)\nthen, several malware researchers have begun to work on the enigma that is Babar. Marion\nMarschalek (Cyphort) struck first, with [her report on the “Bunny” malware. Bunny shares](http://www.cyphort.com/evilbunny-malware-instrumented-lua/)\nsome characteristics with the Babar malware described by CSEC. In mid-February, Marion\n[published another report, this time on the actual Babar case, explaining in great detail its](http://www.cyphort.com/babar-suspected-nation-state-spyware-spotlight/)\n[spying features. At the same time, Paul Rascagnères (G Data) published a blog post on the](https://blog.gdatasoftware.com/blog/article/babar-espionage-software-finally-found-and-put-under-the-microscope.html)\nsimilarities between Babar and Bunny, and showed that they were very probably related to\nthe malware described in the CSEC’s slides.\n\nIn this blog post, we lift the veil on another piece of software that we believe to have been\ncreated by the same organization that is behind Babar and Bunny. This component is called\n“Casper” by its authors – presumably named after yet another famous cartoon character.\n\nCasper was used against Syrian targets in April 2014, which makes it the most recent\nmalware from this group publicly known at this time. To attack their targets, Casper’s\n[operators used zero-day exploits in Adobe Flash, and these exploits were – surprisingly –](http://virusradar.com/glossary/zero-day)\nhosted on a Syrian governmental website. Casper is a well-developed reconnaissance tool,\nmaking extensive efforts to remain unseen on targeted machines. Of particular note are the\nspecific strategies adopted against antimalware software.\n\n## Context\n\nIn mid-April 2014, Vyacheslav Zakorzhevsky (Kaspersky) observed that the website\n“jpic.gov.sy” was hosting two Flash zero-day exploits, targeting the vulnerability later labeled\nCVE-2014-0515. This website was set up in 2011 by the Syrian Justice Ministry apparently\nto allow Syrian people to ask for reparation for the damage of the civil war. The website is\n[still online and apparently currently clean, although it was defaced in September 2014 by](http://www.zone-h.org/mirror/id/22851174?zh=2)\nsome “hacktivist”.\n\nAt the time of the events, Zakorzhevsky could not retrieve the payloads distributed by these\nFlash zero-days exploits. ESET researchers were able to find two of these payloads, thanks\nto [ESET LiveGrid® threat telemetry systems. The URLs of these payloads and the dates](http://www.eset.com/int/about/technology/#livegrid)\nwhen they were seen correspond to Zakorzhevsky’s description.\n\nIn a joint effort with Marion Marschalek, Paul Rascagnères, and researchers from the\n[Computer Incident Response Center Luxemboug (CIRCL), we were recently able to](http://www.circl.lu/)\ndetermine that the payloads distributed were very likely developed by the same actors who\ndeveloped the Babar and Bunny software.\n\n## Casper Binary Analysis\n\n\n-----\n\nThe two samples we found are the same core program but differently packaged. The first\nsample is an executable dropping the core program and making it persistent on the\nmachine. The second is a Windows library that deploys the core program directly into\nmemory, also in the form of a library. In this latter case, the name of the core program library\nwas left visible by its creators: “Casper_DLL.dll”.\n\nThroughout this blog, we will focus on the first of these two payloads, the second one being\nsimilar in terms of behavior.\n\n## Dropper\n\nThe dropper is named “domcommon.exe” and its compilation date is set to the June 18,th\n2010. This is very likely a forged date, as we will explain later.\n\nIts execution is based on an XML configuration file decrypted at runtime with the RC4\nalgorithm and a hardcoded 16-byte key. Before the decryption, the program uses a\nchecksum computation to make sure the memory area containing the decryption key has\nnot been modified. Figure 1 shows the dropper’s decrypted configuration file.\n\nFigure 1 – Casper Dropper Configuration File\n\n## Casper Playing Chess against Antivirus\n\nFirstly, the dropper extracts the <STRATEGY> tag from its configuration file. This tag\ndefines precisely how the malware should behave, depending on which antivirus is present\non the machine.\n\n**Choosing the appropriate strategy**\n\nFirst, the dropper retrieves the name of any antivirus that may be running on the machine\n[by executing the Windows Management Instrumentation (WMI) request “SELECT * FROM](https://msdn.microsoft.com/en-us/library/aa394582%28v=vs.85%29.aspx)\nAntiVirusProduct” and fetching the “displayName” field from the result. If an <AV> tag exists\nin the configuration file with a “NAME” attribute matching the name of an installed antivirus\nproduct, it will be set as the execution strategy. In this case, four antivirus products have a\ndefined strategy.\n\n\n-----\n\nIf no strategy is found for the running antivirus, or if no antivirus is protecting the computer,\nthe default strategy described in the <STRATEGY> tag’s attributes will be applied.\nAlternatively, if a file named “strategy.xml” is present in the dropper’s folder, it will override\nthe strategy from the configuration file.\n\n**Possible Moves**\n\nA strategy is a set of attributes that influences both the dropper and the payload execution.\nSome of these attributes define how to realize certain actions, whereas the others define\n_whether to perform certain actions. The following array describes the various “moves”_\noffered by these attributes.\n\n\n**Attribute** **Attribute Purpose**\n\nRUNKEY Defines how the dropper will interact\nwith the Windows registry in order to\nbe persistent on the machine\n\nBAT Execution of a batch file containing\n[“reg” commands](https://technet.microsoft.com/en-us/library/cc732643.aspx)\n\nREG Execution of “reg” commands in a\ncommand prompt process\n\nWMI Calls to methods of the StdRegProv\nWMI class\n\nAUTODEL Defines how the dropper will remove\nitself from the machine after its\nexecution\n\nAPI [Call to MoveFileEx API function to](https://msdn.microsoft.com/en-us/library/windows/desktop/aa365240%28v=vs.85%29.aspx)\ndelete the dropper during the next\nrestart of the system\n\nWMI Execution of a command line in a\ncommand prompt process created\nthrough the Create method of the\nWin32_Process WMI class\n\nINJECTION Defines whether the dropper and the\npayload will inject their code into a\nnew process, or execute it in the\ninitial process\n\nSAFENOTIF Defines whether or not the payload\nwill contact the C&C server\n\n\n**Possible**\n**Value** **Value Meaning**\n\nAPI Calls to Windows API\nfunctions\n\n(RegOpenKeyEx,\nRegQueryValueEx…)\n\nDEL Execution of a\ncommand line in a\ncommand prompt\nprocess\n\nYES/NO N/A\n\nYES/NO N/A\n\n\n-----\n\n**Attribute** **Attribute Purpose**\n\nSERVICE Likely defines how to interact with\nWindows services, but the code\nmanaging this attribute is missing in\nthese Casper samples\n\nSC N/A\n\nESCAPE Defines whether the dropper will\nexecute normally, or simply exit\n\nSCHEDULER Unknown. The code managing this\nattribute is missing in these Casper\nsamples\n\n\n**Possible**\n**Value** **Value Meaning**\n\nAPI N/A\n\nYES/NO N/A\n\nCMD N/A\n\n\nThe possibilities offered by this <STRATEGY> tag show that Casper’s authors have\nacquired an in-depth knowledge of behavioral detections in certain antivirus products.\n\nFor example, process injection will only happen on machines with none of the four defined\nantiviruses running, since in such a case the “INJECTION” attribute will be set to “NO”.\nInterestingly, three antiviruses have the “ESCAPE” attribute set to “YES”, which means the\ndropper will simply uninstall itself in their presence without deploying Casper’s payload.\n\nAs the list of <AV> tags is pretty short, we can speculate that these are the antiviruses\nCasper’s authors expect to find on their targets. For the record, the “VERSION” attribute\npresent in one <AV> tag is actually never used in the code, but it still indicates the intention\nto distinguish different versions of the same antivirus product. We very rarely see this level\nof precision employed in malware in order to bypass antivirus.\n\n### Time To Drop The Payload\n\nIn the event that the “ESCAPE” attribute is set to “NO” in the chosen strategy – as is the\ncase with the default strategy – the dropper will then execute the commands provided in the\nform of XML tags in the configuration file, as shown in Figure 2.\n\nFigure 2 – Casper Dropper’s Commands\n\n**Uninstalling previous versions**\n\n\n-----\n\nThe first command instructs the dropper to remove other Casper instances that could\npossibly be running on the system. The corresponding <UNINSTALL> tag comes with a\n“name” attribute, which will be prefixed with the BIOS constructor name retrieved from the\nWindows registry (Intel, NEC…) before being used as an identifier. This prefixing is likely\nmeant to avoid drawing the user’s attention if he or she happened to notice the identifier.\n\nThe program is uninstalled in two steps, each step addressing different methods of\npersistence employed by Casper:\n\nIf it exists, the scheduled task whose name matches the identifier is removed from the\nsystem\nIf it exists, the application registered with the identifier in the Windows registry is\nremoved from the system\n\n**Payload installation**\n\nThe payload installation is then directed by the <INSTALL> tag, which provides two\nversions of the payload, one for 32-bit machines (<x86>) and another one for 64-bit\nmachines (<x64>).\n\nThe attributes of the <INSTALL> tag will then be used by one of the two installation\nmethods previously mentioned. If the operating system is Windows 7 or newer, persistence\nwill be set through a scheduled task; otherwise it will be set through the Windows registry\nkey\n\n“HKLM\\Software\\Microsoft\\Windows\\CurrentVersion\\Run”.\n\nThe <INSTALL> tag provides an argument to give to the payload. The exact value of the\nargument is critical to the “correct” execution of the payload. The actual verification in the\npayload is subtle: the argument is used in a custom algorithm to find library functions in\nmemory. Unless the value is correct, the addresses of these library functions will be wrong,\nresulting in a random-looking crash of the payload.\n\n**Dropper cleans itself**\n\nBefore terminating its execution, the dropper removes itself from the system, using the\nmethod defined in the AUTODEL attribute. It should be noted that the payload is not\nlaunched at this moment: it will be run only at the next startup thanks to the previous\npersistence method.\n\n## Payload\n\nSimilarly to the dropper, Casper payload’s execution is based on an XML configuration file\ndecrypted at run-time, and shown in Figure 3.\n\n\n-----\n\nFigure 3 – Casper’s Payload Configuration File\n\nThis configuration file starts with a timestamp, which corresponds to Monday, the 7th April\n**2014 at 21:27:05 GMT. Therefore, the compilation timestamps – set to 2010 – have very**\nlikely been forged.\n\nA series of <PARAM> tags will then control the payload’s behavior, as described in the\nfollowing array.\n\n**attribute** **Purpose**\n\nID Unknown. It could be used to distinguish operations, as the value is the\nsame in the two payloads hosted on “jpic.gov.sy”.\n\nREGKEY Path in the Windows registry that will be used as storage area\n\nURL C&C server’s URL\n\nKEY Cryptographic key for the communications with the C&C server\n\n\nDELAYMIN\n\nDELAYMAX\n\nDELAYRETRY\n\n\nTimers to configure the frequency of the contacts with the C&C server\n\n\nThe payload then generates a unique identifier for the machine and inserts it at the end of\nthe configuration in a <UID> tag. Finally, the configuration is RC4-encrypted and stored in\nthe Windows registry.\n\nThe code handling the configuration shows certain capabilities not exploited in these\nCasper samples, for example a TIMETOLIVE attribute to plan the termination of Casper\nafter a certain amount of time, or a DELAYED_START attribute to wait before interacting\nwith the system.\n\nFinally, the payload’s configuration contains the exact same <STRATEGY> as the dropper.\n\n**Report to C&C**\n\nDuring its first execution, Casper’s payload executes the following XML file:\n\n\n-----\n\n<COMMAND name= SYSINFO />\n\nThe handler of the “SYSINFO” command retrieves information about the system and builds\na report containing several sections, as shown in Figure 4.\n\nFigure 4 – SYSINFO Command’s Result\n\nThe titles of the report sections are self-explanatory. Interestingly, the version of the\nmalware is clearly mentioned: 4.4.1. This report is then base64-encoded and sent to the\n[C&C server in the body of an HTTP POST request. It will also be written into a temporary](http://virusradar.com/en/glossary/command-and-control-server)\nfile named “perfaudio.dat”.\n\n\n-----\n\nThe network request will also have a cookie named PREF filled with the concatenation of\nthe machine UID, the configuration ID, the version of Casper and the hardcoded character\n“R”, all base64-encoded.\n\n**C&C’s possible answers**\n\nDue to the C&C being down at the time of the investigation we can only speculate on the\nrest of the execution based on Casper’s known capabilities.\n\nAt this point, the binary regularly contacts the C&C server with a cookie similar to the one in\nthe SYSINFO request, but this time with “G” as the hardcoded character instead of “R”. Our\nanalysis of the binary reveals that the server can then send back a PNG image – with the\ncorrect header and format for a PNG file — from which a XML command file will be\ndecrypted and executed.\n\nIn addition to the “SYSINFO” command, Casper can handle <COMMAND> tags with the\nfollowing values:\n\n“EXEC” to execute a program on the machine from its local path\n“SYSTEM” to execute commands in a Windows command prompt\n\nFinally, Casper can also handle <PLUGIN> tags, whose content is a Windows executable to\ndeploy on the machine.\n\n## How Does Casper Relate to the Other Cartoons?\n\nOur best chance of establishing that the same developers are behind Bunny, Babar and\nCasper is to identify unusual code or algorithms shared between these various programs. In\nour comparison we also take into account the so-called “NBOT” malware (also known as\nthe “TFC” malware), whose link with Babar and Bunny was established by Marion\n[Marschalek in her Babar report. Here is a non-exhaustive list of such shared features we](http://www.cyphort.com/babar-suspected-nation-state-spyware-spotlight/)\nobserved:\n\nCasper hides its calls to API functions by using a hash calculated from the functions’\nnames, rather than the names themselves. The hashing algorithm is a combination of\nrotate-left (ROL) of 7 bits and exclusive-or (XOR) operations. NBOT uses the exact\nsame algorithm for the same purpose, whereas Babar hides its API calls in a similar\nmanner but with a different algorithm.\n\nCasper fetches information about the running antivirus in a way similar to Bunny,\nBabar, and NBOT, namely through the same WMI request. Moreover, all these\nmalwares compute the SHA-256 hash of the first word of the antivirus name, although\nin Casper it is actually never used.\n\n\n-----\n\nCasper generates delimiters for its HTTP requests by filling a specific format string\nwith the results of calls to the GetTickCount API function. The same code is present in\nsome NBOT samples, as shown in the following array.\n\nExtract of Casper’s code\n\nExtract of NBOT’s code\n\nCasper removes its dropper by executing a Windows command created from the\nfollowing format string:\n\ncmd.exe /C FOR /L %%i IN (1,1,%d) DO IF EXIST “%hs” (DEL “%hs” & SYSTEMINFO)\nELSE EXIT\n\nIn some NBOT samples we can find the following similar syntax:\n\n\n-----\n\ncmd.exe /C FOR /L %%i IN (1,1,%d) DO IF EXIST “%s” (DEL “%s” & PING 127.0.0.1 -n\n3) ELSE EXIT\n\nCasper uses an “ID” value set to “13001”, whereas Babar samples contain an ID of\n“12075-01”. Also, the malware discovered in 2009 by the CSEC possesses an ID of\n“08184” (slide 8 of the [CSEC slides). This similar format, and the increasing value in](http://www.spiegel.de/media/media-35683.pdf)\ndecimal, could indicate a familial link.\n\nNone of these signs alone is enough to establish a strong link but all the shared features\n**together make us assess with high confidence that Bunny, Babar, NBOT and Casper**\n**were all developed by the same organization.**\n\n## Victimology\n\nAccording to our telemetry data, all the people targeted during this operation were located\nin Syria. These targets may have been the visitors of the “jpic.gov.sy” website — Syrian\ncitizens who want to file a complaint. In this case they could have been redirected to the\nexploits from a legitimate page of this website.\n\nBut we were actually unable to determine if this were indeed the case. In other words, it is\njust as likely that the targets have been redirected to the exploits from another location, for\nexample from a hacked legitimate website or from a link in an email. What is known for sure\nis that the exploits, the Casper binaries and the C&C component were all hosted on this\nwebsite’s server.\n\nThis leads us to a second hypothesis: the “jpic.gov.sy” website could have been hacked to\nserve as a storage area. This would have at least two advantages for the attackers: firstly,\nhosting the files on a Syrian server can make them more easily accessible from Syria, a\ncountry whose Internet connection to the outside world has been unstable since the\n[beginning of the civil war, as shown in Google Transparency Report. Secondly, it would](http://www.google.com/transparencyreport/traffic/explorer/?r=SY&l=EVERYTHING&csd=1301710971931&ced=1413615600000)\nmislead attribution efforts by raising suspicion against the Syrian government.\n\n## Conclusion\n\nAs previously explained, we are confident that the same group developed Bunny, Babar\nand Casper. The detailed analysis of Babar in the CSEC slides from 2009 indicates this\ngroup is not a newcomer to the espionage business. The use of zero-day exploits is another\nindication that Casper’s operators belong to a powerful organization. Finally, the narrow\ntargeting of people in Syria shows a likely interest in geopolitics.\n\nNevertheless, we did not find any evidence in Casper itself to point a finger at a specific\ncountry. In particular, no signs of French origin, as suggested by CSEC for Babar, were\nfound in the binaries.\n\n\n-----\n\n## Hashes\n\n**SHA1** **Note**\n\n75BF51709B913FDB4086DF78D84C099418F0F449 DLL\nDropper\n\n7F266A5E959BEF9798A08E791E22DF4E1DEA9ED5 DLL\nDropper\n\nE4CC35792A48123E71A2C7B6AA904006343A157A Executable\nDropper\n\nF4C39EDDEF1C7D99283C7303C1835E99D8E498B0 X86\nExecutable\nPayload\n\nC2CE95256206E0EBC98E237FB73B68AC69843DD5 X64\nExecutable\nPayload\n\n## Indicators of Compromise\n\n**Indicator** **Value**\n\nDropper’s file name domcommon.exe\n\nPayload’s file name aiomgr.exe\n\n\n**ESET Detection**\n**Name**\n\nWin32/ProxyBot.B\n\nWin32/ProxyBot.B\n\nWin32/ProxyBot.B\n\nWin32/ProxyBot.B\n\nWin32/ProxyBot.A\n\n\nC&C URLs hXXp://jpic.gov.sy/css/images/_cgi/index.php\n\nMutex name {4216567A-4512-9825-7745F856}\n\nKey for configuration decryption 7B 4B 59 DE 37 4A 42 26 59 98 63 C6 2D 0F 57 40\n\nTemporary file name perfaudio.dat\n\n_Image: PAISAN HOMHUAN / Shutterstock.com_\n\n5 Mar 2015 - 01:55PM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n\n-----\n\n### Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-03-05 - Casper Malware- After Babar and Bunny, Another Espionage Cartoon.pdf"
    ],
    "report_names": [
        "2015-03-05 - Casper Malware- After Babar and Bunny, Another Espionage Cartoon.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536211,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653689328,
    "ts_modification_date": 1653689328,
    "files": {
        "pdf": "https://archive.orkl.eu/6cc250dbaf429a5cfa70d474abdb9d5f5ed4cc52.pdf",
        "text": "https://archive.orkl.eu/6cc250dbaf429a5cfa70d474abdb9d5f5ed4cc52.txt",
        "img": "https://archive.orkl.eu/6cc250dbaf429a5cfa70d474abdb9d5f5ed4cc52.jpg"
    }
}