{
    "id": "9e614c28-51cb-428a-9437-c4c50412a40a",
    "created_at": "2023-01-12T15:10:19.507577Z",
    "updated_at": "2025-03-27T02:16:25.92803Z",
    "deleted_at": null,
    "sha1_hash": "c7fee97954456fb3d51672c67a6759be18525035",
    "title": "2014-02-17 - Hiding in plain sight- a story about a sneaky banking Trojan",
    "authors": "",
    "file_creation_date": "2022-05-28T19:21:00Z",
    "file_modification_date": "2022-05-28T19:21:00Z",
    "file_size": 2009314,
    "plain_text": "# Hiding in plain sight: a story about a sneaky banking Trojan\n\n**[blog.malwarebytes.com/threat-analysis/2014/02/hiding-in-plain-sight-a-story-about-a-sneaky-banking-trojan/](https://blog.malwarebytes.com/threat-analysis/2014/02/hiding-in-plain-sight-a-story-about-a-sneaky-banking-trojan/)**\n\nJérôme Segura February 17, 2014\n\nThe Zeus/Zbot Trojan is one the most notorious banking Trojans ever created; it’s so popular\nit gave birth to many offshoots and copycats.\n\n[The particularity of Zeus is that it acts as a “man-in-the-browser“ allowing cyber-crooks to](http://en.wikipedia.org/wiki/Man-in-the-browser)\ncollect personal information from its victims as well as to surreptitiously perform online\ntransactions.\n\nA new [variant of this trojan, dubbed ZeusVM, is using images as a decoy to retrieve its](https://www.virustotal.com/en/file/75352a45b67b3a7f91e237cc5dc2de79f52e0e13b81fe10e289199477f2d46c9/analysis/)\nconfiguration file, a vital piece for its proper operation.\n\n[French security researcher Xylitol noted something strange in one of the malvertising](https://twitter.com/xylit0l)\ncampaigns I [reported a couple weeks ago.](https://twitter.com/jeromesegura/status/423180548236771328)\n\nThe malware was retrieving a JPG image hosted on the same server as were other malware\ncomponents.\n\n\n-----\n\n[He later sent me a message about how this new variant was using steganography, a](http://en.wikipedia.org/wiki/Steganography)\ntechnique that allows to disguise data inside of an existing file without damaging it.\n\nOver the next couple weeks, we exchanged a few more emails as he had discovered other\nsamples exhibiting the same behaviour.\n\nCurious about this new trick, I decided to study one of those pictures more closely to better\nunderstand what was going on.\n\nHere is a beautiful picture of a sunset and you would never guess that code used to steal\nmoney is hiding within this image:\n\nThere are various tools to analyze pictures but one easy way to go at it is to find an exact\ncopy of it and then compare it against the one you have.\n\nFor this, I did a Google image search and directly uploaded the suspicious JPG:\n\n\n-----\n\nOnce you have a match, you can select one with the same width and height. Of course, this\ntechnique might not always work, but in this case the bad guys simply picked a picture that\nthey had found on the web, thus making my job easier.\n\nIf we put both pictures (the original and altered one) side by side and view them in bitmap\nmode, we can spot where extra data was added.\n\n\n-----\n\nUsing an hexadecimal viewer we can see where the code for the picture ends and where the\nhidden data starts (highlighted):\n\nSo here is our data, although at this point it is not human readable:\n\n\n-----\n\n[To make identification more difficult, the appended data is encrypted with Base64,](http://en.wikipedia.org/wiki/Base64) [RC4 and](http://en.wikipedia.org/wiki/RC4)\n[XOR. To decode it you can reverse the file with a debugger such as OllyDbg and grab the](http://en.wikipedia.org/wiki/XOR_cipher)\ndecryption routine. Alternatively, you can use the leaked Zeus source code to create your\nown module that will decompress the data blocks.\n\nThe decrypted configuration file shows which banks and financial institutions are targeted:\n\n\n-----\n\nOne of these is the Deutsche Bank (Germany) and this is what its login page looks like:\n\nWhen an infected user loads their banking website, the Trojan starts acting as man-in-themiddle and can literally empty out his bank account in total discretion. The bank cannot tell\nthese are illegal money transfers since the customer was properly authenticated into their\nsystem.\n\nIt’s not the first time we see malware embedding data within innocuous files. Not too long\n[ago, website security company Sucuri disclosed how an innocent looking PNG file contained](http://blog.sucuri.net/2014/02/new-iframe-injections-leverage-png-image-metadata.html)\ninstructions in its metadata.\n\nHiding malevolent code in such a way can successfully bypass signature-based Intrusion\nDetection Systems or even antivirus software. From a webmaster point of view, images\n(especially ones that can be viewed) would appear harmless.\n\n\n-----\n\nIt s a reminder that a file should not be considered safe simply because it appears to be a\nlegitimate picture, song or movie.\n\nInterestingly, steganography itself is a really old practice: in ancient Greece, secret\ninstructions carved on wood were covered with wax where an innocent message would fool\nany outsider.\n\nIn that regard, the bad guys aren’t really innovators per se, they are just applying old tricks to\nmodern technology; that’s where our job comes into play because solving puzzles is just as\nmuch fun as creating them.\n\n[@jeromesegura](https://twitter.com/jeromesegura)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-02-17 - Hiding in plain sight- a story about a sneaky banking Trojan.pdf"
    ],
    "report_names": [
        "2014-02-17 - Hiding in plain sight- a story about a sneaky banking Trojan.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536219,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653765660,
    "ts_modification_date": 1653765660,
    "files": {
        "pdf": "https://archive.orkl.eu/c7fee97954456fb3d51672c67a6759be18525035.pdf",
        "text": "https://archive.orkl.eu/c7fee97954456fb3d51672c67a6759be18525035.txt",
        "img": "https://archive.orkl.eu/c7fee97954456fb3d51672c67a6759be18525035.jpg"
    }
}