{
    "id": "9e6cf792-c01a-4135-b434-25a4003fcda0",
    "created_at": "2023-01-12T15:01:23.912008Z",
    "updated_at": "2025-03-27T02:06:08.472321Z",
    "deleted_at": null,
    "sha1_hash": "b172533c54ef04a9beed66468f0331ec6be80b5b",
    "title": "2022-07-06 - LockBit 3.0- “Making The Ransomware Great Again”",
    "authors": "",
    "file_creation_date": "2022-07-18T18:21:29Z",
    "file_modification_date": "2022-07-18T18:21:29Z",
    "file_size": 2140615,
    "plain_text": "# LockBit 3.0: “Making the ransomware great again”\n\n**[cluster25.io/2022/07/06/lockbit-3-0-making-the-ransomware-great-again/](https://cluster25.io/2022/07/06/lockbit-3-0-making-the-ransomware-great-again/)**\n\nJuly 6, 2022\n\nLockBit is a major player in the ransomware scene and has contributed heavily for this cyber-crime\nmodel to become one of the most popular and imitated in the threats landscape. The version 2.0 of its\nproject entered the scene in July 2021 showing immediately the potential to become one of the\nleading syndicate in this “business”. The collective distinguished itself for having pointed out some\ndistintive technical characteristics of its product and for several public statements where the speed\n\n\n-----\n\nand efficiency of its ransomware have been defined, by gang representatives, unmatched if\ncompared to what the community had been able to observe up to that moment. Always according to\nLockBit members the 2.0 project could count on:\n\n1. The fastest encryption speed on the market\n2. A tool specifically aimed at data exfiltration\n3. Automated mechanisms for payload distribution and data encryption\n\nRecently, on 27 of June, 2022, LockBit released the third version of its project and many new features\nseem to have been included in it. For example one main thing to note that differs from the 2.0 is the\nfact that the group has come up with another way to pressure and extort its victims. Like other threat\ngroups, LockBit works mainly through its own DLS (Data Leak Site) through which it manages and\ndeals with the victims of its operations. Until now, these victims were given a well-defined period of\ntime to pay the requested ransom. In project 3.0 the collective seems to have included new\npossibilities for negotiations; Indeed, by paying a specific fee is now possible to extend the timer by 24\nhours, destroy all data from the website, or download all data right away. This could be a way also to\ncover the extortion technique, not making public the actual ransom price. Basically, they are\nmaximizing the money they can get from each victim. Another interesting aspect of this third version is\nthe Bug Bounty Program; this appears to be an initiative never taken from any other group before.\nThe group not only offers rewards for\n\nfinding vulnerabilities or for doxxing the managers but is rewarding for “brilliant ideas” to be added in\nthe R-a-a-S as well. Currently, however, it’s to be pointed out that the group is continuing to update\nalso the LockBit 2.0 DLS, where new victims have recently been added.\n\n**LockBit 3.0**\n\n**Cluster25 obtained a sample of LockBit 3.0 and analyzed it in order to understand its functionalities**\nand its behavior. During the analysis also emerged interesting similarities between this version and\nsamples related to other ransomware families (BlackMatter/DarkSide) that may suggest a possible\ncorrelation between threat groups behind the development of this piece of malware. The new version\nof LockBit (Lockbit 3.0 or LockBitBlack) uses a code protection mechanism consisting in the\npresence of encrypted code sections in the binary, so to hinder the malware detection, especially\nwhen performed through automated analysis. To activate the proper execution of the malware, a\n**decryption key must be provided as a parameter (-pass) when the malicious file is launched, and**\nwithout this key its behavior just results in a software crash at the beginning of its execution. The\ndecryption key used for the analyzed sample is reported below:\n\n**db66023ab2abcb9957fb01ed50cdfa6a**\n\nWhen the program starts, the fist subroutine to be called (sub_41B000) is responsible to perform the\ndecryption of the sections of the binary, by retrieving the decryption key from the execution parameters\nand by passing it through a RC4 Key Scheduling Algorithm (KSA) algorithm. Later, the sections to\ndecrypt are accessed by reading the Process Environment Block (PEB) and the decryption takes\nplace, according to evidence below:\n\n\n-----\n\nAn anti-Analysis mechanism implemented by the malware regards the dynamic loading of the\n**Win32 APIs needed to perform its malicious behavior. The subroutine responsible to load and map**\nthe needed APIs into memory is analyzable only on the decrypted/unpacked version of the malware.\nThe way the APIs are resolved consists in a call to a subroutine (sub_407C5C) that receives as input\nan obfuscated string that is XORed with the key 0x4506DFCA, so to decrypt the Win32 API name to\nbe resolved.\n\nFurthermore, the analysis showed an interesting similarity between this subroutine and the one used\nin the BlackMatter ransomware. In fact, the above-mentioned decryption steps are present in both the\nmalware, as also visible in the screenshot below, taken from a BlackMatter sample:\n\n\n-----\n\nThe analysis also showed other sections of the code that are similar between the samples of Lockbit\n3.0 and BlackMatter, suggesting a possible correlation between the threat groups behind the\nimplementation of the two ransomware. To hinder the analysis, LockBit 3.0 also uses string\n**obfuscation, which is done though a simple decryption algorithm (XOR) to decrypt the strings.**\nRegarding the file encryption, the ransomware uses a multi-thread approach. Files are encrypted\nwith AES, in case of large files, not all content is encrypted, but only a part of sections in it. Moreover,\nfiles are renamed replacing filenames and their extension with random dynamic and static string: with\nthe analyzed sample, the extension used was .HLJkNskOq and filenames were replaced by random\n7 characters strings (e.g. TIe9pEW.HLJkNskOq). Also, a new icon is associated with the encrypted\nfiles, which is written on the disk in an .ico image file in the directory C:\\ProgramData, under the\nname HLJkNskOq.ico. The ransom note is written in every directory containing encrypted files. It\nstates that data is stolen and encrypted and that if the ransom is not paid it will be published on the\ndarknet. The ransom note also contains the .onion URLs to the TOR website, and instruct the victim to\ncontact the attackers using the provided websites and personal ID. As usual, the ransom note warns\nthat deleting or modifying the encrypted files will prevent their decryption.\n\n\n-----\n\nFinally, when the encryption process ends, also the victim’s wallpaper is changed with the image\nbelow, which instructs the victim to read the ransom note:\n\nMoreover, LockBit 3.0 also has the capability to print a version of its ransom note using connected\nprinters using WinSpool APIs, as can be seen by the process splwow64.exe launched after the\nmalware execution. The printed file is shown below:\n\n\n-----\n\nFinally, one of the last operations performed by the malware consists in setting a considerable amount\nof modification in the keys of the Windows Registry related to the Windows Event Log, in order to\ndisable the monitoring of event such as the one associated with Windows Defender. These\nmodifications can be traced in the subkeys of the registry starting from\n\n**HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\WINEVT\\Channels\\**\n**<Log Name>**\n\nWhere the Enabled subkey associated with each log is set to 0.\n\n**CONCLUSIONS**\n\nThe LockBit 3.0 project is proof of the extreme dynamism of the ransomware business. Potentially, the\ngroup appears to have acquired skills from other groups that have actively operated in the sector in\nthe past. Interesting the code overlaps with BlackMatter as the relations between the two groups may\nbe not casual; on September 2021 Cluster25 observed a coordinated attack handled simultaneously\nby members of the LockBit and BlackMatter crews. Despite the observation of simultaneous attacks\ncan be considered a quite common event in the ransomware world, this one is going to confirm once\nagain the high degree of complexity of the Russian-speaking ransomware ecosystem which very\noften is based on personal relationships between the different teams members. Furthermore, on\nNovember 2021, BlackMatter shuts down its activities and declares the quit of its business. As the\n**BlackMatter gang quitted the operations several team members were transferred to other R-a-a-S**\npartnerships, specifically LockBit. Cluster25 also noted the direct involvement of LockBit\nrepresentatives in trying to acquire the members of the BlackMatter group, at that time in the process\nof winding up, as reported by the image below.\n\n\n-----\n\nFinally, the strong similarity of the 3.0 payload to BlackMatter could suggest either a purchase of the\nlatter’s code or a current collaboration of the LockBit collective with some former BlackMatter\ndevelopers.\n\n**ATT&CK MATRIX**\n\n**TACTIC** **TECHNIQUE** **DESCRIPTION**\n\nInitial Access T1566.001 Phishing: Spearphishing Attachment\n\nExecution T1106 Native API\n\nExecution T1204.002 User Execution: Malicious File\n\nPrivilege Escalation T1134 Access Token Manipulation\n\nDefense Evasion T1622 Debugger Evasion\n\nDefense Evasion T1140 Deobfuscate/Decode Files or Information\n\nDefense Evasion T1112 Modify Registry\n\n**INDICATORS OF COMPROMISE**\n\n**CATEGORY** **TYPE** **VALUE**\n\nPAYLOAD SHA256 80e8defa5377018b093b5b90de0f2957f7062144c83a09a56bba1fe4eda932ce\n\nPAYLOAD SHA1 f2a72bee623659d3ba16b365024020868246d901\n\nPAYLOAD MD5 38745539b71cf201bb502437f891d799\n\nWritten by: [Cluster25](https://cluster25.io/author/cluster25/)\n\nTagged as: [ransomware,](https://cluster25.io/tag/ransomware-2/) [LockBit,](https://cluster25.io/tag/lockbit/) [BlackMatter,](https://cluster25.io/tag/blackmatter/) [DarkSide,](https://cluster25.io/tag/darkside/) [Crimeware,](https://cluster25.io/tag/crimeware/) [LockBit 3.0,](https://cluster25.io/tag/lockbit-3-0/) [LockBitBlack.](https://cluster25.io/tag/lockbitblack/)\n\nPrevious post\n\n[energy Cluster25](https://cluster25.io/category/energy/) [/ May 27, 2022](https://cluster25.io/2022/05/27/cyberwarfare-targeting-energy-sector/)\n\n**[Cyberwarfare targeting the energy sector. Is Europe under threat?](https://cluster25.io/2022/05/27/cyberwarfare-targeting-energy-sector/)**\n\nThe energy sector is a pivotal one for the whole contemporary economy. A disrupt of its functions\ncould cause huge problems for the economy of a certain country. In this report C25 listed some of the\nmost famous cases of [...]\n\n\n-----\n\n## Post comments (0)\n\n**Leave a reply**\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-06 - LockBit 3.0- “Making The Ransomware Great Again”.pdf"
    ],
    "report_names": [
        "2022-07-06 - LockBit 3.0- “Making The Ransomware Great Again”.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535683,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1658168489,
    "ts_modification_date": 1658168489,
    "files": {
        "pdf": "https://archive.orkl.eu/b172533c54ef04a9beed66468f0331ec6be80b5b.pdf",
        "text": "https://archive.orkl.eu/b172533c54ef04a9beed66468f0331ec6be80b5b.txt",
        "img": "https://archive.orkl.eu/b172533c54ef04a9beed66468f0331ec6be80b5b.jpg"
    }
}