{
    "id": "9edac3ba-d6b1-48a1-bdae-a3fa48d4ba8c",
    "created_at": "2023-01-12T15:00:36.595605Z",
    "updated_at": "2025-03-27T02:05:19.719591Z",
    "deleted_at": null,
    "sha1_hash": "6b90faedcce46f2d79312040f12ac06e0bb2af39",
    "title": "2022-01-24 - Log4Shell- No Mass Abuse, But No Respite, What Happened-",
    "authors": "",
    "file_creation_date": "2022-05-29T01:31:29Z",
    "file_modification_date": "2022-05-29T01:31:29Z",
    "file_size": 3338092,
    "plain_text": "# Log4Shell: No Mass Abuse, But No Respite, What Happened?\n\n**[news.sophos.com/en-us/2022/01/24/log4shell-no-mass-abuse-but-no-respite-what-happened/](https://news.sophos.com/en-us/2022/01/24/log4shell-no-mass-abuse-but-no-respite-what-happened/?cmp=30726)**\n\nChester Wisniewski January 24, 2022\n\nSometimes, when a software crisis doesn’t cause the kind of devastation everyone expects,\nit is because there may not have been a crisis in the first place. That is not the case with the\n[Log4Shell vulnerability found in the widely used Apache Log4J software in early December](https://news.sophos.com/en-us/2021/12/12/log4shell-hell-anatomy-of-an-exploit-outbreak/)\n2021. Even though the world hasn’t seen the feared mass exploitation of the vulnerability, the\nLog4Shell bug, buried deep in many digital applications and products, will likely be a target\nfor exploitation for years to come.\n\nSophos believes that the immediate threat of attackers mass exploiting Log4Shell was\naverted because the severity of the bug united the digital and security communities and\ngalvanised people into action. This was seen back in 2000 with the Y2K bug and it seems to\nhave made a significant difference here.\n\nAs soon as details of the Log4Shell bug became clear, the world’s biggest and most\nimportant cloud services, software packages and enterprises took action to steer away from\nthe iceberg, supported by shared threat intelligence and practical guidance from the security\ncommunity.\n\nLike others across the security industry, Sophos has continued to track and monitor the\nthreat. It is worth taking stock of how things have unfolded since Dec. 9, 2021; what we know\nnow and what we anticipate for the future.\n\n\n-----\n\n## Scanning the Scanners\n\nSophos telemetry on scans for exposed instances of Log4J reveals a typical pattern for a\nnewly reported vulnerability. In the first few days, the volume of scans was moderate,\nreflecting the early development of Proof-of-Concept exploits and preliminary online\nscanning for exploitable systems.\n\nWithin a week, there was a significant increase in scan detections, with numbers peaking\nbetween Dec. 20 and Dec. 23, 2021.\n\nThese numbers will undoubtably include successful but not yet identified exploitations,\nopportunistic cryptominers, nation-state supported threat actors and other cybercriminals\nlooking to find and breach targets. However, it is also worth noting that during these days in\nlate December, many security companies were still open for business before the holidays\nand were actively monitoring the landscape.\n\nIn other words, the numbers simply confirm that a great many people, with good or bad\nintentions, were trying to gauge how vulnerable others were to the threat by looking for the\nnumber of potentially exposed systems.\n\nAnother factor to consider when evaluating the scanning numbers is that a Log4Shell type of\nflaw is exploited differently based on which application the Log4J code is in and how it has\nbeen integrated with that application. This results in a high volume of redundant scans trying\ndifferent ways to exploit different applications.\n\nFrom late December through January 2022, however, the curve of attack attempts flattened\nout and declined. This doesn’t mean the threat level declined too: by this time, an evergreater percentage of detections were likely real attacks with fewer coming from researchers\n\n\n-----\n\nmonitoring the latest patching status.\n\n## Limited Mass Exploitation\n\nThe overall number of successful attacks to date remains lower than expected. Evidence for\n[this can be found on the frontline. The Sophos Managed Threat Response Team (MTR)](https://www.sophos.com/en-us/products/managed-threat-response)\nnotes that while the team has detected many scans and attempts to trigger the Log4Shell\nexploit, by early January 2022 only a handful of MTR customers faced attempted intrusions\nwhere Log4j was determined to be the initial entry point. The majority of these were\ncryptominers.\n\nAnother possible reason for the limited mass exploitation could be the need to customize the\nattack to each application that includes the vulnerable Apache Log4J code.\n\nAt one end of the scale are the incredibly widely used applications that are exposed to the\ninternet and which need to be manually updated, one by one. These are being exploited at\nscale in an automated fashion. An example of such an application is VMware Horizon. The\nfirst intrusion seen by Sophos MTR that leveraged Log4Shell involved VMware Horizon.\n\nAt the other end of the scale are many other, more obscure applications involving Apache\nLog4J that will take time to be discovered and exploited by attackers. These attacks will\nproceed at a human pace and won’t result in giant spikes of activity, although they will still\npresent a significant risk to organizations that remain vulnerable.\n\n## The Geography of Attack Attempts: Then and Now\n\nSophos geolocation telemetry from when the bug was reported on Dec. 9, 2021, to the end\nof the year, and for the first two weeks of January 2022 shows some interesting variations in\nthe sources of attack attempts and scans.\n\n\n-----\n\nLooking at the map for December, it is worth noting that the top countries, including the U.S.,\nRussia, and China, as well as countries in Western Europe and Latin America, generally\nhave large populations and a significant, skilled cybersecurity workforce. Many also have\nwell established digital infrastructure and are popular internet hosting hubs. For example, the\nheavy weighting of the U.S. and Germany in the geolocation IP source data likely reflects the\nlarge data centres that are based there and operated by Amazon, Microsoft, and Google,\namong others.\n\nThis picture changes dramatically in early 2022, as detections of mass scanning give way to\nindicators of more detailed probing and exploitation.\n\nThe most noticeable difference between the two maps is how the early dominance of Russia\nand China appears to have diminished by January. Sophos intelligence suggests that this\nreflects an apparent decline in the number of attack attempts by a small number of highly\naggressive cryptominers based in these regions.\n\nIt’s important to note that there may not be a relationship between the source IPs that are\nscanning or exploiting the vulnerability, and the actual location of those who are generating\nthe traffic. A better view might be the destination of the call backs.\n\n## The Geography of Call Back Destinations\n\nLike the source IP data, Sophos has captured call back destinations relating to Log4Shell for\nthe end of 2021 and the beginning of 2022. There are fewer variations over time, but the\noverall picture is very different to that of the IP source location.\n\n\n-----\n\nThe data shows the top destinations worldwide that vulnerable (unpatched) devices are\nreaching out to in order to retrieve a Java payload or to dump information extracted from the\nmachine, such as AWS security keys or other variables.\n\nWhile the U.S. remains a top contender, this view brings India into the number one position\nand highlights Turkey, Brazil and even Australia. It is difficult to speculate as to why these\nregions are top destinations for call backs. One reason might be that these countries have\nmany active participants in bug bounty programs, hoping to earn money by being the first to\nalert organizations that they are exposed.\n\n## The Threat Remains\n\nJust because we’ve steered round the immediate iceberg, that doesn’t mean we’re clear of\nthe risk.\n\nAs [others have pointed out, some of the initial attack scans may have resulted in attackers](https://www.wsj.com/articles/cyber-officials-warn-of-long-term-fallout-from-log4j-cyber-flaw-11641843635)\nsecuring access to a vulnerable target, but not actually abusing that access to deliver\nmalware, for instance – so the successful breach remains undetected.\n\nIn the past Sophos has observed countries such as Iran and North Korea pounce on VPN\nvulnerabilities to gain access to targets’ networks and install backdoors before the targets\nhave had a chance to deploy the patches, and then waiting months before using that access\nin an attack.\n\nIn another example, attackers targeted vulnerable Exchange servers in the immediate\naftermath of the first [ProxyLogon patches, leaving behind web shells as backdoors for later](https://news.sophos.com/en-us/2021/03/15/dearcry-ransomware-attacks-exploit-exchange-server-vulnerabilities/)\nattacks. Patching your Exchange server wasn’t enough, you also had to remove any\nbackdoors that were dropped\n\n\n-----\n\nThere s more. Over time, internet facing applications vulnerable to a Log4Shell exploit are\nlikely to be identified patched or removed. However, unknown internally vulnerable systems\nmay never be known or discovered, and these will remain a security risk. Sophos telemetry\nshows that the number of vulnerable Java Archive files (JAR) on Sophos protected endpoints\nhasn’t changed. These could become a favorite tool for malicious lateral movement down the\nroad.\n\n## Conclusion\n\nSophos believes that attempted exploitation of the Log4Shell vulnerability will likely continue\nfor years and will become a favourite target for penetration testers and nation-state\nsupported threat actors alike. The urgency of identifying where it is used in applications and\nupdating the software with the patch remains as critical as ever.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-24 - Log4Shell- No Mass Abuse, But No Respite, What Happened-.pdf"
    ],
    "report_names": [
        "2022-01-24 - Log4Shell- No Mass Abuse, But No Respite, What Happened-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535636,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653787889,
    "ts_modification_date": 1653787889,
    "files": {
        "pdf": "https://archive.orkl.eu/6b90faedcce46f2d79312040f12ac06e0bb2af39.pdf",
        "text": "https://archive.orkl.eu/6b90faedcce46f2d79312040f12ac06e0bb2af39.txt",
        "img": "https://archive.orkl.eu/6b90faedcce46f2d79312040f12ac06e0bb2af39.jpg"
    }
}