{
    "id": "9ee0fd63-2b7e-4f01-9a89-7851fb356504",
    "created_at": "2023-01-12T15:06:47.28326Z",
    "updated_at": "2025-03-27T02:09:07.297716Z",
    "deleted_at": null,
    "sha1_hash": "93b26a44abb420daa6a2374044800003bbe5302f",
    "title": "2017-11-04 - How the FBI Took Down Russia's Spam King—And His Massive Botnet",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:28Z",
    "file_modification_date": "2022-05-28T01:59:28Z",
    "file_size": 1120557,
    "plain_text": "# How the FBI Took Down Russia's Spam King---And His Massive Botnet\n\n**[wired.com/2017/04/fbi-took-russias-spam-king-massive-botnet/](https://www.wired.com/2017/04/fbi-took-russias-spam-king-massive-botnet/)**\n\nGarrett M. Graff April 11, 2017\n\nOne of the world’s most notorious spammers appears to have been tripped up by a basic\ncybersecurity no-no, according to the FBI: He used the same log-in credentials to both run\nhis criminal enterprise and also log into sites like iTunes.\n\n[The Justice Department announced Monday that it had successfully targeted a man](https://www.justice.gov/opa/pr/justice-department-announces-actions-dismantle-kelihos-botnet-0)\nprosecutors called “one of the world’s most notorious criminal spammers,” a Russian hacker\nknown as Peter Yuryevich Levashov, also known as Peter Severa, or “Peter of the North.”\nLevashov had long run the Kelihos botnet, a global network of infected computers that\ncollectively flooded email inboxes worldwide with spam, stole banking credentials from\ninfected users, and spread malware across the internet.\n\nSpanish authorities arrested Levashov, who normally resides in St. Petersburg, Russia, while\n[he was on vacation with his family. Rumors had swirled over the weekend, sourced only to a](http://www.reuters.com/article/us-spain-russia-idUSKBN17B0O2)\nvague report on the Russian propaganda network RT, that he’d been involved in that\ncountry’s meddling with the 2016 US presidential election, but there was no hint of that in\nMonday’s Justice Department complaint, which focused instead on Levashov’s role in\ndeveloping and running one of the internet’s most pernicious and longest-running botnets.\nLevashov's operation had infected as many as 100,000 computers worldwide, roughly five to\nten percent of which were inside the United States.\n\n\n-----\n\nProsecutors described Kelihos as a sophisticated malware variant that harvested user\ncredentials from victim computers, and was used to send massive quantities of spam emails.\nThe complaints and court orders associated with the case also laid out details of how\nLevashov operated his business, offering a million spam messages promoting “legal”\nproducts such as “adult, mortgage, leads, pills, replics [i.e., counterfeit goods], etc.” for just\n$200, while that price went to $300 per million messages for “Job spam,” that is, messages\nthat attempted to recruit job seekers into fraudulent positions, including “money mules” who\nwould help launder stolen money and goods. According to the Justice Department, Levashov\nalso offered to deploy his network on behalf of online fraudsters to execute phishing attacks\nfor $500 per million messages.\n\nAs part of the operation, security researchers and the FBI teamed up to dismantle the\nKelihos botnet itself, targeting three domains used to run the network—gorodkoff.com,\ngoloduha.info, and combach.com---and redirecting traffic from infected computers to new\nservers controlled by authorities and the ShadowServer Foundation, a volunteer anticybercrime group, a process that’s known in cybersecurity circles as “sink-holing.”\n\nCracking Down\n\nThe arrest of Levashov---and the complex, sophisticated assault on his long-running botnet--marked another victory in the US government’s rising war against Russian aggression in\ncyberspace, coming just weeks after another Justice Department indictment charged both\n[Russian criminals and intelligence officer with conspiring to hack Yahoo’s user database.](https://www.wired.com/2017/03/yahoo-hack-russia-indictment/)\n\nIt also, for the time being at least, perhaps marked the end of one of the most powerful spam\nnetworks on the internet, a global network of malware-infected computers that had proven\nuniquely difficult to dismantle, reappearing multiple times and evolving even as its chief\noutput---multitudes upon multitudes of unwanted junk emails advertising Viagra, adult\nentertainment, and, at worst, phishing emails that spread even more malware---continued\nunabated for the better part of a decade.\n\n“The ability of botnets like Kelihos to be weaponized quickly for vast and varied types of\nharms is a dangerous and deep threat to all Americans, driving at the core of how we\ncommunicate, network, earn a living, and live our everyday lives,” said Kenneth Blanco, the\nacting assistant attorney general overseeing the Justice Department’s criminal division.\n\nThe case also marks one of the first times that the Justice Department has acknowledged\nusing what’s known as “Rule 41,” a controversial change to federal criminal procedures that\ntook effect last December and allows the government to seek powerful search warrants to\ninvestigate cybercrime no matter where infected computers might be physically located. (The\nJustice Department, though, was quick to caution Monday that it didn’t actually use warrants\nto penetrate any infected computer, merely to help attack the botnet nationwide.)\n\n\n-----\n\nWhile the newly unsealed case against Levashov sprawled internationally and included\nagents from multiple FBI field offices, as well as numerous international partners, it’s hard to\nmiss the fingerprints of Special Agent Elliott Peterson---a veteran of the FBI’s crack cyber\nsquad in Pittsburgh who transferred recently to the Anchorage Field Office, where Monday’s\nannouncement was made.\n\nIt perhaps marks the end of one of the most powerful spam networks on the internet.\n\nTo defeat Kelihos technically, Peterson worked closely with two Crowdstrike engineers, Brett\nStone-Gross and Tillman Werner, who traveled to Alaska last week. The three men had also\nteamed up in Pittsburgh in 2014 to defeat the GameOver Zeus botnet, built by Evgeny\nBogachev, who today is America’s most wanted hacker, with a $3 million reward for his\ncapture. (That case, involving Russian hackers, botnets, and bank theft, was the subject of\nWIRED’s April cover story.)\n\nBoth Werner and Stone-Gross had long battled Kelihos. Stone-Gross had come into the\nbotnet’s source code years ago and had worked to dismantle it since, and Werner had\npreviously “sink-holed” an earlier variant of the network live onstage during a security\nconference in 2012, only to see it bounce back even more sophisticated and resilient later\non.\n\nAs for the tenuous election hacking connection, it may have stemmed from rumors online\nthat Levashov may have ties to Russian security forces or intelligence agencies,\nrelationships that would be consistent with other high-profile, powerful Russian hackers. That\nalleged affiliation wouldn't be unusual; Bogachev’s GameOver Zeus botnet was deployed to\nhelp gather intelligence on Ukrainian targets during Russia’s invasion of Crimea in the spring\nof 2014, and, more recently, the March Yahoo indictment documented ties between one wellknown hacker, Alexsey Belan, and Russian officials with the FSB, its domestic intelligence\nagency that succeeded the KGB. This indictment, though, doesn't mention the presidential\ncampaign whatsoever.\n\nA Digital Trail\n\nAccording to court documents, the investigators tracking Levashov figured out this spring\nthat there was a brief window to possibly arrest him while he was traveling with his family in\nSpain---a country that’s proven a strong US ally on cybercrime, and previously been the site\nof arrest of Russian hackers on vacation. Indeed, there are hints that the operation might\nhave been moved up to coincide with the opportunity to arrest the hacker; the original date\non the search warrant was crossed out and moved up by two weeks.\n\nLevashov, who for years has been featured on SpamHaus’s list of the most notorious\nspammers and currently occupies the sixth spot on its list, has long operated beyond the arm\nof US law enforcement. He was indicted more than a decade ago in Michigan for email and\n\n\n-----\n\nwire fraud for using spam as part of a penny-stock pump-and-dump scheme. Later, in 2009,\nDC prosecutors again indicted him for computer fraud, stemming from his operation of the\n“Storm” botnet, a predecessor to his later development of Kelihos.\n\nInvestigators eventually linked Levashov to Kelihos by painstakingly matching IPs and log-in\ncredentials on sites like FourSquare, Apple, and Google. Whether, if, and how long it might\ntake to extradite the spam king from Spain to the United States remains an open question;\nwhile US law enforcement have had recent success in getting friendly foreign governments\nto arrest suspected Russian criminals abroad, they’ve been less successful in returning all of\nthose suspects to US soil. Other cases in Thailand and Austria have been tied up in court for\nextended periods of time.\n\nRegardless of which country has him for now, Levashov remains in custody. That's a relief\nfor authorities, and to spam-besieged inboxes and vulnerable computers around the world.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-11-04 - How the FBI Took Down Russia's Spam King—And His Massive Botnet.pdf"
    ],
    "report_names": [
        "2017-11-04 - How the FBI Took Down Russia's Spam King—And His Massive Botnet.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536007,
    "ts_updated_at": 1743041347,
    "ts_creation_date": 1653703168,
    "ts_modification_date": 1653703168,
    "files": {
        "pdf": "https://archive.orkl.eu/93b26a44abb420daa6a2374044800003bbe5302f.pdf",
        "text": "https://archive.orkl.eu/93b26a44abb420daa6a2374044800003bbe5302f.txt",
        "img": "https://archive.orkl.eu/93b26a44abb420daa6a2374044800003bbe5302f.jpg"
    }
}