{
    "id": "9ef7c6c9-2177-4678-a0fb-12cd48275cf3",
    "created_at": "2023-01-12T15:00:05.399542Z",
    "updated_at": "2025-03-27T02:10:49.388693Z",
    "deleted_at": null,
    "sha1_hash": "bc8797724142a130a52170988e1728e298738d4c",
    "title": "2021-12-06 - Magecart Groups Abuse Google Tag Manager",
    "authors": "",
    "file_creation_date": "2022-05-28T01:27:22Z",
    "file_modification_date": "2022-05-28T01:27:22Z",
    "file_size": 7761168,
    "plain_text": "# Magecart Groups Abuse Google Tag Manager\n\n**geminiadvisory.io/magecart-google-tag-manager/**\n\n12/06/2021\n\n## Key Findings\n\n\nDecember 6, 2021\n\n\nGemini analysts have identified 316 e-commerce sites worldwide infected with trojanized Google Tag Manager (GTM) containers as part\nof an ongoing Magecart campaign. This tactic has become increasingly popular this year.\nThe abuse of this legitimate Google service is concerning because it provides threat actors free infrastructure upon which they can host\ntheir malicious scripts, while also granting enhanced capability to avoid detection.\nThe Magecart actors behind these attacks have posted at least 88,000 payment card records from these attacks to the dark web\nmarketplaces. This aligns with the increasing interest in Card Not Present (CNP) e-skimming activity during the COVID-19 pandemic.\nAs the level of activity increases, so too does the level of effort to mask the activity from automated scanners and security researchers.\nThe use of a legitimate service offers an excellent opportunity to hide malicious scripts and thus maintain a foothold on victimized ecommerce sites.\n\n## Background\n\nGemini analysts continue to identify Magecart campaigns that target numerous e-commerce sites worldwide. Since February 4, 2021, analysts\nhave observed 316 e-commerce sites infected with trojanized Google Tag Manager (GTM) containers. This technique capitalizes on the ability\nto place JavaScript within the GTM container. Gemini has observed two variants that abuse GTM containers: one that embeds the malicious eskimmer script in the container and another that uses the container to download the actual e-skimmer script from a separate dual-use domain.\n\nThe abuse of this legitimate Google service is concerning because it provides threat actors free infrastructure upon which they can host their\nscripts, while also granting enhanced capability to avoid detection. The Magecart actors behind these attacks have posted at least 88,000\npayment card records from these attacks to the dark web markets.\n\n[Magecart attacks abusing Google services have become increasingly popular since 2020. This tactic offers discretion to hackers since Google](https://arstechnica.com/information-technology/2020/06/google-analytics-trick-allows-crooks-to-hide-card-skimming/)\nis legitimate and widely used, so many security policies automatically trust its data. In June 2020, a Google spokesperson claimed to be\nsearching for unauthorized uses of Google Analytics products to suspend, although the scale of the abuse often outpaces preventative security\n\n\n-----\n\npo c es S a e e co e ce s ops a e t e ost co o ta get s ce t ey o te ac t e esou ces o te est to des g obust secu ty\nsystems.\n\n## In-Depth Analysis\n\n**GTM Container Abuse**\n\nThe GTM platform provides web authors a means to update measurement codes and other code fragments on their websites or mobile\n[applications. The GTM website (tagmanager.google.com) provides a web-based interface to create and manage GTM containers. GTM](https://tagmanager.google.com/)\ncontainers provide a perfect malware delivery system ripe for abuse by Magecart actors because:\n\nJavaScript can be embedded inside GTM containers and is executed when a browser loads the link to a container\nThe typically legitimate use of GTM containers means that web application firewalls (WAFs) often do not block web traffic from GTM\ncontainers\nMalicious payloads hidden within GTM containers can avoid detection by security software\n\nGemini has recently observed two variations of Magecart e-skimming attacks conducted through the abuse of GTM containers. The first\nvariant, discovered in March 2021, embeds e-skimmer JavaScript directly into the GTM container. Gemini has identified 201 victims of this\nattack to date.\n\nThe second variant, observed in February 2021, uses a single GTM container across all victims, and this container houses a script that loads\nthe actual e-skimmer script from a separate dual-use domain (a domain used to both host e-skimmer scripts and receive exfiltrated payment\ncard data). Gemini found seven malicious dual-use domains that have been used with this container.\n\nGemini has identified more than 88,000 stolen payment card records linked to these two GTM variants. They were posted to a single top-tier\ndark web CNP marketplace. Due to the large number of victims, additional records from both campaigns will likely continue to appear on this\nmarketplace.\n\n**Variant 1: e-Skimmer Embedded in GTM Container**\n\n**Overview and Impact**\n\nGemini discovered 201 e-commerce sites infected with Magecart e-skimmers hosted within GTM containers since March 2021. The script\nwithin most of these GTM containers collects identifiers and data from HTML input, select, and textarea elements; encodes this information\nwith base64; and sends it to an exfiltration URL. The exfiltration URLs were hosted on domains masquerading as Google sites through the use\nof typosquatting and top-level domain (TLD) substitution (e.g., using .net versus .com). The vast majority of websites infected with this variant\nof GTM e-skimmer were hosted in the United States. The top five victims of this attack variant (by Alexa Rank) are listed in the table below.\n\n**e-Commerce Site** **Country** **Alexa Rank**\n\n[mooseknucklescanada.com](http://mooseknucklescanada.com/) Canada 74,439\n\n[nunababy.com](http://nunababy.com/) Germany 87,210\n\n[flashingblinkylights.com](http://flashingblinkylights.com/) United States 87,525\n\n[pfiwestern.com](http://pfiwestern.com/) United States 89,803\n\n[baytonia.com](http://baytonia.com/) Saudi Arabia 94,285\n\nImage 1: Chart showing distribution of victims by web host country.\n\nA majority of the victims were based on the Magento platform, with version 2 being the most common. Magento has historically been a very\n[popular target for Magecart attacks; Gemini has previously reported that 85% of the “Keeper” Magecart group’s victims used Magento. As the](https://geminiadvisory.io/keeper-magecart-group-infects-570-sites/?swcfpc=1)\nMagento model favors installation and management of the e-commerce site on the merchant’s own infrastructure security and updating also\n\n\n-----\n\na s o t e e c a t s o at o tec o ogy ( ) tea a y o t ese s a e c a ts do ot a e ded cated pe so e, c o te\nresults in unpatched systems that are vulnerable to compromise. These systems are also less likely to see security scans that would likely\nidentify vulnerabilities and infections.\n\nImage 2: Chart showing distribution of victims by e-commerce platform.\n\n**Indicators of Compromise**\n\nThe e-commerce sites infected with the first variant that Gemini initially analyzed had Magecart e-skimmers hosted in GTM containers with\nscripts that collected identifiers and data from HTML input, select, and textarea elements. This information was base64-encoded and then sent\nto exfiltration URLs hosted on domains masquerading as Google sites through typosquatting and TLD substitution. The images below include\nthe indicators of compromise in these attacks.\n\n[Image 3: Screenshot of a loader script injected into a victim e-commerce site (Woodshop Products’ site selling Mohawk Wood goods) being](https://www.woodshopproducts.com/)\nused to construct and load the URL for a container hosted on GTMr.\n\nIn the screenshot above, Magecart actors injected a script tag containing the loader for the GTM container e-skimmer. The script constructs\nthe full GTM URL and uses it to retrieve the container.\n\nImage 4: Screenshot of the e-skimmer script embedded in the GTM container.\n\nThe e-skimmer source code is hidden within the GTM container. The image above highlights key elements of the e-skimmer JavaScript,\nnamely (top to bottom): the setting of the form action to the exfiltration URL; the routine that finds and collects information from input, select,\nand textarea elements; and the checkout URL trigger #payment_form_payflowpro used to initiate the e-skimmer routine.\n\n\n-----\n\nImage 5: Screenshot of network traffic showing the e-skimmer script sending stolen form data to the exfiltration URL.\n\nImage 5 shows the HTTP traffic generated by the e-skimmer when a cardholder invokes the checkout routine on an infected e-commerce site.\nThe highlighted box on the left of the image shows the structure of the HTTP POST sent to the exfiltration URL (googleadwordstrack[.]com).\nThe two boxes on the right of the image show the encoded and decoded versions of the stolen data.\n\nAnalysts identified six exfiltration domains used by the e-skimmers that were implanted into GTM containers. The first seen dates reflect the\nearliest known date of infection for websites set to communicate to the respective exfiltration domain. All six exfiltration domains are currently\nbeing used for active infections.\n\n**Exfiltration Domain** **Infected Victim Domains** **Infection First Seen Date** **Infection Last Seen Date**\n\ngoogleadwordstrack[.]com 77 03/17/2021 11/09/2021\n\ngoogletrackevent[.]com 53 03/17/2021 11/09/2021\n\ngoogleadwordswidget[.]com 26 03/17/2021 11/09/2021\n\ngoogletagstorage[.]com 21 03/30/2021 11/09/2021\n\ngoogletagswidget[.]com 17 08/24/2021 11/09/2021\n\ngoogletagwidgets[.]com 7 08/27/2021 11/09/2021\n\nAnalysis revealed that 201 e-commerce domains sent stolen data to the above exfiltration domains.\n\n**Variant 2: GTM Container Uses Dual-Use Domain**\n\nGemini discovered a second GTM container exploitation technique in May 2021, wherein the Magecart actors used a single GTM container\n(GTM-5SF293J) to infect 85 e-commerce domains. This external domain operates as a dual-use domain, which means that it is responsible for\nboth hosting the e-skimmer script (e-skimmer domain) and receiving exfiltrated data (exfiltration domain). The United States was also the top\nhost country for victims of the GTM container variant using this dual-use domain technique. The top five victims of this attack variant (by Alexa\nRank) are listed in the table below.\n\n**e-Commerce Site** **Host Country** **Alexa Rank**\n\n[nwzonline.de](https://www.nwzonline.de/) Germany 37,269\n\n[binisilvia.com](http://binisilvia.com/) Italy 57,264\n\n[souqtime.com](http://souqtime.com/) United Arab Emirates 78,172\n\n[cobbtuning.com](https://geminiadvisory.io/magecart-google-tag-manager/cobbtuning.com) United States 91,629\n\n[beatrizfranck.com](http://beatrizfranck.com/) Angola 178,687\n\n\n-----\n\nImage 6: Chart showing distribution of victims by web host country for those countries with two or more victims. France, Indonesia, South\nAfrica, Canada, Pakistan, Thailand, Belgium, Cyprus, Vietnam, the Philippines, Angola, Malaysia, and Romania each had one victim.\n\nA majority of the victims were based on the Magento platform, with version 2 being the most common.\n\nImage 7: Chart showing distribution of victims by e-commerce platform.\n\n**Indicators of Compromise**\n\nIn this dual-use domain variant, the single GTM container houses an obfuscated script that ultimately loads an e-skimmer script from an\nexternal domain. Since the external domain is a dual-use domain, it both hosts the e-skimmer script and receives exfiltrated data. Notably, over\nthe past eight months, the actors have repeatedly replaced the specific dual-use domain housed in the container with a new domain, enabling\nthe actors to update the e-skimmer scripts affecting all victims without directly accessing the infected sites or modifying a large set of separate\nGTM containers.\n\nAnalysts originally found 85 domains where this infection technique was used, and have since discovered an additional 30 victim domains.\nThere have been a total of 115 known victims of this variant to date.\n\n\n-----\n\nage 8 Sc ee s ot o a oade sc pt jected to a ct e co e ce s te (50 [a ts co](https://www.501parts.com/) ) be g used to co st uct a d oad t e U o a\ncontainer hosted on GTM.\n\nSimilar to Variant 1 in which the e-skimmer script is embedded in the GTM container, the Magecart actors inject a script tag containing the\nloader for the GTM container e-skimmer into the infected pages. The script constructs the full GTM URL and uses it to retrieve the container.\nHowever, in contrast to Variant 1, the GTM containers used for Variant 2 do not contain the actual e-skimmer script but instead contain scripts\nthat load the e-skimmer from a dual-use domain.\n\nImage 9: Screenshot of GTM container with the URL that hosts the e-skimmer script highlighted.\n\nImage 10: Screenshot of GTM container that obfuscates the URL used to host the e-skimmer script.\n\nAs can be seen in Image 9, the variable vtp_html, within the tags section, holds an HTML <script> element that asynchronously loads the URL\n(statcs[.]com/favicon) from the dual-use domain that hosts the actual e-skimmer script. In Image 10, the variable vtp_html also holds a <script>\nelement, but this version is more complex as it uses a deobfuscation routine on a set of variables to reconstruct the URL\n(ganalitis[.]com/refresh). Both variants of vtp_html result in the loading of the JavaScript in Image 11.\n\nImage 11: Screenshot of the JavaScript loaded upon execution of the script link housed in the GTM container.\n\nAnalysts captured a sample of the payment form data being sent to the dual-use URL over the WebSocket connection. As the script encodes\nthe data via base64 prior transmission, the listing below has been decoded for viewability.\n\n[{“info”:”null=4&form_key=il1y7byeHKLsNxTu&captcha_form_id=user_login&context=checkout&[email protected]email.com&captcha_form_id=use](https://geminiadvisory.io/cdn-cgi/l/email-protection)\n_login&context=checkout&firstname=John&lastname=Doe&company=Trump%20Tower&street%5B0%5D=725%205th%20Ave&city=New%20Yor\n_id=43&postcode=10022&country_id=US&telephone=+12123361440&ko_unique_13=freeshipping_freeshipping&ko_unique_14=flatrate_flatrate&\nunique_15=usps_3&ko_unique_16=ups_02&ko_unique_17=ups_01&form_key=il1y7byeHKLsNxTu&captcha_form_id=payment_processing_requ\npayment%5Bmethod%5D=authorizenet_directpost&billing-address-same-as-shipping=on&country_id=US&payment%5Bcc_type%5D=MC&paym\n5Bcc_number%5D=5555555555555557&payment%5Bcc_exp_month%5D=5&payment%5Bcc_exp_year%5D=2025&payment%5Bcc_cid%5D=5\npayment%5Bmethod%5D=paypal_express&=Apply%20Discount&captcha_form_id=sales_rule_coupon_request&captcha_form_id=user_login&co\ncheckout&”,”hostname”:”nelsonuniform com”,”key”:”1620313981929-818276572″}\n\n\n-----\n\ns oted abo e, t e ageca t acto s be d t s attac a e c a ged t e dua use do a oused t e G co ta e s t es du g t e\nanalysis window. The actors used the dual-use domains listed below, with the URL on ganalitis[.]com being the currently active variant.\n\n**Dual-Use URL** **Dual-Use Domain** **Domain Creation Datetime**\n\nhxxps://www[.]ganalitis[.].com/refresh ganalitis[.]com 2021-10-21T11:05:05Z\n\nhxxps://www[.]ganalitics[.].com/favicon ganalitics[.]com 2021-06-03T12:17:07Z\n\nhxxps://www[.]gstatcs[.]com/favicon gstatcs[.]com 2021-04-15T13:53:05Z\n\nhxxps://webfaset[.]com/str[.]css webfaset[.]com 2021-04-13T10:46:06Z\n\nhxxps://fountm[.]online/str[.]css fountm[.]online 2021-04-07T09:13:51Z\n\nhxxps://pixupjqes[.]tech/str[.]css pixupjqes[.]tech 2021-04-05T07:08:10Z\n\nhxxps://jqwereid[.]online/str[.]css jqwereid[.]online 2021-03-26T08:08:14Z\n\n**Separate Variants, Separate Magecart Groups?**\n\nAlthough the two GTM container variants involve similar tactics—storing e-skimmers within GTM containers or housing scripts in GTM\ncontainers that load e-skimmers from dual-use domains—analysis of the two variants suggest that two different Magecart groups are\nresponsible for each variant.\n\nGemini has attributed all of the infections associated with Variant 1 (storing e-skimmers within GTM containers) to a single Magecart group\nbecause all of the infections:\n\nUse the exact same e-skimmer script and unobfuscated loader scripts\nPlace the injected scripts in a similar location on victimized e-commerce sites\nSend stolen data to one of six exfiltration domains with domain names that all use the term “google” combined with legitimate-appearing\ntext (“tagstorage”, “trackevent”, etc.)\n\nGemini has attributed all of the infections associated with Variant 2 (housing scripts in GTM containers that load e-skimmers from dual-use\ndomains) to a separate Magecart group because all of the infections:\n\nUse the same GTM container (actors have swapped out the dual-use domain associated with the GTM container six times, but the GTM\ncontainer has remained constant)\nTransfer data via WebSocket connections\nUse the exact same e-skimmer script (but different than Variant 1 script)\n\nIt appears highly likely that the two contemporaneous variants are used by two different Magecart groups because they use different eskimmer scripts, exfiltration domains, and only Variant 2 employs WebSocket connections.\n\n## Conclusion\n\nThe shift to e-commerce due to the COVID-19 pandemic has increased interest in CNP e-skimming activity. As the level of activity increases,\nso too does the level of effort to mask the activity from automated scanners and security researchers. The use of a legitimate service offers an\nexcellent opportunity to hide malicious scripts and thus maintain a foothold on victimized e-commerce sites.\n\nThe GTM container e-skimmer variant utilized a simple “grab everything” approach to collecting data from web forms and attempted to mask\nits data exfiltration by using familiar domain names. Once infected with either of the GTM variants, malicious actors are afforded the ability to\nmodify their attack infrastructure without being required to access the victim server. This offers a significant means for remaining undetected\nwhen changes are required due to issues such as defects in the skimmer and remediation of secondary loaders or exfiltration URLs.\n\nDespite the fact that two separate groups appear responsible for each variant, the vast majority of payment card records that are stolen with\neither GTM container variant have later been offered for sale on the above-mentioned top-tier CNP marketplace.\n\n**Gemini Advisory Mission Statement**\n\n_Gemini Advisory provides actionable fraud intelligence to the largest financial organizations in an effort to mitigate ever-growing cyber risks._\n_Our proprietary software utilizes asymmetrical solutions in order to help identify and isolate assets targeted by fraudsters and online criminals_\n_in real-time._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-06 - Magecart Groups Abuse Google Tag Manager.pdf"
    ],
    "report_names": [
        "2021-12-06 - Magecart Groups Abuse Google Tag Manager.pdf"
    ],
    "threat_actors": [
        {
            "id": "5a0483f5-09b3-4673-bb5a-56d41eaf91ed",
            "created_at": "2023-01-06T13:46:38.814104Z",
            "updated_at": "2025-03-27T02:00:02.925972Z",
            "deleted_at": null,
            "main_name": "MageCart",
            "aliases": [],
            "source_name": "MISPGALAXY:MageCart",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041449,
    "ts_creation_date": 1653701242,
    "ts_modification_date": 1653701242,
    "files": {
        "pdf": "https://archive.orkl.eu/bc8797724142a130a52170988e1728e298738d4c.pdf",
        "text": "https://archive.orkl.eu/bc8797724142a130a52170988e1728e298738d4c.txt",
        "img": "https://archive.orkl.eu/bc8797724142a130a52170988e1728e298738d4c.jpg"
    }
}