{
    "id": "9f08221f-b9ad-4526-883c-f9e5a3a3d5b4",
    "created_at": "2022-10-25T16:48:22.357537Z",
    "updated_at": "2025-03-27T02:17:11.469475Z",
    "deleted_at": null,
    "sha1_hash": "ed60cfb74a60a22fba34b7d85fec2e4b5ca72024",
    "title": "The Kittens Are Back in Town 2",
    "authors": "Clearsky",
    "file_creation_date": "2019-10-16T11:11:37Z",
    "file_modification_date": "2019-10-16T11:11:37Z",
    "file_size": 3223150,
    "plain_text": "# The Kittens Are Back in Town 2\n## Charming Kitten Campaign Keeps Going on,\n Using New Impersonation Methods \n\n### October 2019\n\n#### TLP:WHITE\n\n\n-----\n\n#### Table of Content\n\nIntroduction ................................................................................................................. 3\nAbout Charming Kitten .................................................................................................. 4\nAttack Vector ............................................................................................................... 5\nImpersonation Vectors .................................................................................................. 5 First Vector -A message with a link pretending to be Google Drive.................................................5\n\nSecond Vector –An SMS message........................................................................................................9\nThird Vector –Login attempt alert message.....................................................................................10\nFourth Vector –Social Networks imperonation...............................................................................11\n\nDigital Infrastructure ................................................................................................... 14\nIndicators of Compromise ............................................................................................ 17\n\n\n-----\n\n#### Introduction On the 15thof September 2019, wehave published a report1about a sharp increase in Charming Kitten attacksagainst researchers from the US, Middle East, and France, focusing on Iranian academic researchers, Iranian dissidents in the US. In our last report, we exposed a new cyber espionage campaignthat was conductedon July 2019. Sincethen, we observed another wave ofthese attacks, leveraging new impersonating vectors and IOCs.Until these days, Iran was not known as a country who tends to interfere in elections around the world.From a historical perspective, this type of cyber activitieshad been attributed mainly to the Russian APT groups such as APT28 (known as Fancy Bear). The group is infamous for hacking American Democratic National Committee emails and targeting German and French campaign members, in an attempt to circumvent the elections in the US, Germany and France. Microsoft’s Octoberannouncement exposes, for first time, that Charming Kitten, an Iranian APT group, plays a role in the domain of cyber-attacks forthe purpose ofinterfering with democratic procedures.On 4thof October 20192, Microsofthasannounced that Phosphorus(known as Charming Kitten)attemptedto attack email accountsthat are associated with the following targets: U.S. presidential campaign, current and former U.S. government officials, journalists covering global politics,and prominent Iranians living outside Iran. Thesespear-phishingattackswere conductedby Charming Kitten inAugust and September.We evaluate ina medium-high level of confidence, that Microsoft’s discoveryand our findingsin our previous and existing reportsis a congruent operation, based on the following issues:1.\n\nSame victim profiles–In both cases, the victims were individuals of interest to Iran in the fields of academic research, human rights, opposition to the Islamic Republic of Iran's regime (such as NIAC) and journalists. Although the congruent is not exactly similar, our sample is mainly based on Israeli victims.2.\n\nTime overlapping–In our latest report, we mentioned that wehaveobserved an escalation of the attacks in July-August 2019. In their announcement, Microsoft mentioned that the attacks occurred on ‘In a 30-day periodbetween August and September’.3.\n\nSimilar attack vectors–In both cases, Charming Kitten used similar attack vectors which are:a.\n\nPassword recovery impersonationof the secondary emailbelonging to the victims in both cases.b.\n\nBoth attack vectors used spear-phishing emails in order to targetMicrosoft, Google and Yahoo services. c.\n\nIn our research, we identified spear-phishing attack via SMS messages, indicating that Charming Kitten gather phone numbers of the relevant victim. Microsoft foundthatCharming Kitten gather phone numbersforpassword recovery and two-factor authenticationsof the relevant victims to gain control to their email accounts. In this report, we uncoveredfournew spear-phishing methods used by this group, alongside with newindicators of this operation.\n\n1 [https://www.clearskysec.com/the-kittens-are-back-in-town/](https://www.clearskysec.com/the-kittens-are-back-in-town/)\n2 https://blogs.microsoft.com/on-the-issues/2019/10/04/recent-cyberattacks-require-us-all-to-be-vigilant/\n\n\n-----\n\n#### About Charming Kitten Charming Kitten, also known as APT35or Ajaxor Phosphorus,is an Iranian cyber-espionage group activesince 20143.This APTisassociated with the Ministry of Intelligence of Iran.In our previous report, we made an attacktimeline. Below is akey event timeline:\n\nSee corresponding footnote for relevant references[4].\n\n3https://attack.mitre.org/groups/G0058/\n\n4 2015 - [https://www.clearskysec.com/thamar-reservoir/](https://www.clearskysec.com/thamar-reservoir/)\n2017 - https://www.clearskysec.com/charmingkitten/\n[2018 - https://www.bleepingcomputer.com/news/security/iranian-apt-poses-as-israeli-cyber-](https://www.bleepingcomputer.com/news/security/iranian-apt-poses-as-israeli-cyber-security-firm-that-exposed-its-operations/)\n[security-firm-that-exposed-its-operations/](https://www.bleepingcomputer.com/news/security/iranian-apt-poses-as-israeli-cyber-security-firm-that-exposed-its-operations/)\n[March 2019 - https://noticeofpleadings.com/phosphorus/files/Complaint.pdf](https://noticeofpleadings.com/phosphorus/files/Complaint.pdf)\n[September 2019 – https://www.clearskysec.com/the-kittens-are-back-in-town/](https://www.clearskysec.com/the-kittens-are-back-in-town/)\nOctober 2019 - https://blogs.microsoft.com/on-the-issues/2019/10/04/recent-cyberattacks-requireus-all-to-be-vigilant/ 2015•ClearSkydiscovered the first wave of phishing attacks, named \"Thamar reservoir\".2017•ClearSkyexposed a vast espinage operation against Iranian experts working in the academy, human rights activists and media personnel.2018•Charming Kitten attempted to attack ClearSky and our customers directly via a fraudulent website impersonating the ClearSky portal.•ClearSkyidentified new wave of attacks against researchers in the Middle East, using fake emails and look-alike websites. 2019•March-Microsoft filed an official complaint against the group for “establishing an internet-based cyber theft operation referred to as 'Phosphorus'.”•September-ClearSkypublished a report about a sharp increase in Charming Kitten attacks. It appears that group has initiated a new cyber espionage campaign comprised of two stages.•October-Microsoftannounced that ‘the group is making attempts to identify consumer email accounts belonging to specific Microsoft customers, including a US Presidential Candidate. ClearSkyexposed new impersonation vectors.\n\n\n-----\n\n#### Attack Vector Charming Kitten keep trying to attack their victims with spear-phishing methods. We observed an escalation inthe volume of phishingattempts. It can be divided into threeattack platforms-1.\n\nThe first platformis sending an email message leveraging social engineering methods. 2.\n\nThe second platform includesimpersonation ofsocial media websites, such as Facebook, Twitter and Instagram, as well as using these social medias to spreadmalicious links. Clearsky has observed a few social media entitiesthat contactedtheir victims on these platforms in order to infect them via malicious websites.3.\n\nThe third platformis sending SMS messages to the cellularphone of the victim.\n\n#### Impersonation Vectors Analyzing this campaign, we identified four impersonation vectors that Charming Kitten usesin their recent attacks. Based on our investigation, Charming Kitten tried to carryout all of these vectorsagainstthe same victims,andin some cases a few of thoseon the same day.\n\n##### First Vector - A message with a link pretending to be Google Drive During the first impersonation vector the attacked will receive an email with a link to Google Sites from an acquaintance; for example –a research fellow. Through this vector, the victim is tempted to download a file located at the addressing fellow's Google Sites, and thus collect the victim's Google credentials.The phishing message that impersonated Google Drive serviceunder the title ‘Middle East Article’The link shown above leads to a site built with the Google Sites platform. Additionally, the domain from which the link was allegedly shared is gmail.com, whereas the domain which should appear while sharing Google Sites' sites is google.com; Also, the sharing message should be sent from an address which contains 'noreply', and not the sender's address. For acorrectsample of a Google Sites' sitesharing message, see below:Correct Google Site’s sharing message –the sender’s email is ‘drive-shares-noreplay@google.com’\n\n\n-----\n\n-----\n\n-----\n\nDrive). Another social engineering technique is to identify the Google Site from which the victim was directed and to pair the phishing page with its (the site's) email. In other words, the victim receives an email from the attacker with a link which was prepared for them personally. Identifying the attack –at the address line, the victim's email appears, and if it will be changed, the email presented at the site will change as well.\n\n\n-----\n\n##### Second Vector – An SMS message Through this vector, the victim will receive an SMS message which uses a Sender ID of 'Live Recover' and contains an alert about a stranger, who has attempted to compromise the victim's email, and the victim has to verify it through an attached link. The link will lead to the address shortening service presented earlier. Notice that the victim in the following example has received two messages with different links:\n\n\n-----\n\n##### Third Vector – Login attempt alert message The attackers try to present a sham show about a North Koreanattacker who has attempted to compromise the victim's Yahoo mail. The message says that a person from North Korea has logged into the email of the victim. In addition, the IP address of the alleged intruder is attached to the message (the IP is indeed North Korean), and also a button which the victim is asked to push to secure their account.The first email impersonated ‘Yahoo Login Attempt’ email. Note that similar to the impersonation in the first vector, this email address has a profile picture with2 letters that represent the email sender (CS for Customer service)This victim has received another message earlier that day about a North Korean person which made changes to the victim's account password recovery settings, so they (the victim) have to approve those changes.\n\n\n-----\n\n##### Fourth Vector – Social Networks imperonation In our previous report about Charming Kitten, we have discovered that they are impersonating security teams of social networks in order to get authentication factors. Unlike the previous cases, this group has acted mostly against email boxes. In the group's activity since July-August, we have identified a shift towards social networks, such as Instagram.\n\n\n-----\n\n_Note that the domains that are presented in the directory are related to the impersonation subject_\n\n_and not the malicious domain. As seen from the picture, the first uploaded files were Facebook and Twitter impersonations. Impersonations of Instagram, Google, and the National Iranian-American Council (and Iranian organization sitting in the US), were uploaded later. At every such site directory, there is a ZIP file with a ready infrastructure for a phishing site:_\n\n\n-----\n\n5 https://www.niacouncil.org/about-niac/staff-board/nooshin-sadegh-samimi/\n\n\n-----\n\n#### Digital Infrastructure Through a pivot we have conducted on the main domainthat we have identified in our researchwe have found more than eightnew and unknown domains, all of which bear the '.site' TLD. For instance:customers-recovery[.]sitecom-verifications[.]sitecom-session[.]siteEach of these domains resolves to a different IP, yet almost all of them point –through DNS research –at the same Nameserver-ns11025[.]ztomy[.]com:We have succeeded to identify the new domainsthrough this Nameserver. As we pointed out, we identifieda step upin therecentcampaign regardingthetargeting of Yahoo accounts.The group has acted in the past, in 2017, to acquire the usernames and passwords for those accounts, yet it seems that in the recent years it has moved its focus toGoogle accounts. In this research, we found that thethreat actor focuses again in Yahooaccounts and impersonation to Yahoo services. Below an example toanURL address of one of the group's phishing sites which depicts an impersonation to Yahoo services such as YMail.hxxps://mobiles.com-identifier[.]site/ymail/secureLogin/challenge/url?ucode=d105ad2b-2f7d-4193-a303-03eb32967133&service=mailservice&type=password In our previous report weuncovered a server-registered methodwhich in, the malicious server will redirect the clientfrom the phishing websiteto the original website (HTTP 302 in port 442 or 301 in port 80).Inthis time too it has set its server in a way that redirects to the original Yahoo site, if a not-dedicated (i.e. specifically authorized) entrance is attempted.\n\n\n-----\n\n6.On March 2019, Microsoft filed an official complaint against Phosphorus(known as Charming Kitten),whichincludes 99 websites targeting Microsoft users. Clearsky has been monitoringthis infrastructureand identified several changes,such as new suspiciousdomains and new IPs.\n\n6 [https://blogs.microsoft.com/on-the-issues/2019/03/27/new-steps-to-protect-customers-from-](https://blogs.microsoft.com/on-the-issues/2019/03/27/new-steps-to-protect-customers-from-hacking/)\n[hacking/](https://blogs.microsoft.com/on-the-issues/2019/03/27/new-steps-to-protect-customers-from-hacking/)\n\n\n6.On March 2019, Microsoft filed an official complaint against Phosphorus(known as Charming Kitten),whichincludes 99 websites targeting Microsoft users. Clearsky has been monitoringthis infrastructureand identified several changes,such as new suspiciousdomains and new IPs.\n\n\n-----\n\n7 [https://noticeofpleadings.com/strontium/files/prop_ord_dj_pi_appc.pdf](https://noticeofpleadings.com/strontium/files/prop_ord_dj_pi_appc.pdf)\n\n\n-----\n\n#### Indicators of Compromisebahaius[.]infobailment[.]orgcom-activities[.]sitecom-identifier[.]sitecom-session[.]sitecom-verifications[.]sitecustomers-activities[.]sitecustomers-recovery[.]sitecustomers-reminder[.]infodocumentsfilesharing[.]clouddocument-sharing[.]onlinegomyfiles[.]infoidentifier-activities[.]infoidentifier-activities[.]onlineidentity-verification-service[.]infoinbox-drive[.]infoinbox-sharif[.]infomagic-delivery[.]infomobilecontinue[.]networkmobile-messengerplus[.]networkmy[.]en-gb[.]home-access[.]onlinenotification-accountservice[.]comrecovery-services[.]inforecoverysuperuser[.]infosee-us[.]infosessions-identifier-memberemailid[.]networksystem-services[.]sitetelagram[.]netuploaddata[.]infoverification-services[.]info40[.]112[.]253[.]18591[.]109[.]22[.]53136[.]243[.]195[.]229178[.]32[.]58[.]182185[.]177[.]59[.]24046[.]166[.]151[.]20951[.]68[.]200[.]12651[.]89[.]229[.]21551[.]255[.]157[.]110181[.]177[.]59[.]240\n\n\n-----\n\n### ClearSky Cyber Intelligence Report\n\n\nPhoto by 42 North on Unsplash\nhttps://unsplash.com/photos/OE7H8Zp1\n\nmw8\n\n\n2019 All rights reserved to ClearSky Security Ltd.\nTLP: WHITE - The content of the document is solely for internal use. Distributing the report outside of recipient organization is\n\nnot permitted.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://www.clearskysec.com/wp-content/uploads/2019/10/The-Kittens-Are-Back-in-Town-2-1.pdf",
        "https://app.box.com/s/mnhv0kovo856xhocnetpcu1ta5f3iju2"
    ],
    "report_names": [
        "The-Kittens-Are-Back-in-Town-2-1.pdf",
        "Clearsky_The-Kittens-Are-Back-in-Town-2-1(10-07-2019)"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1571224297,
    "ts_modification_date": 1571224297,
    "files": {
        "pdf": "https://archive.orkl.eu/ed60cfb74a60a22fba34b7d85fec2e4b5ca72024.pdf",
        "text": "https://archive.orkl.eu/ed60cfb74a60a22fba34b7d85fec2e4b5ca72024.txt",
        "img": "https://archive.orkl.eu/ed60cfb74a60a22fba34b7d85fec2e4b5ca72024.jpg"
    }
}