{
    "id": "9f116279-e780-4065-bbcf-e5376773cea6",
    "created_at": "2022-10-25T16:48:15.821254Z",
    "updated_at": "2025-03-27T02:16:08.446087Z",
    "deleted_at": null,
    "sha1_hash": "bc0f27dddaa449417b9a419c1950d0de36e550bc",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-08-16T12:45:53Z",
    "file_modification_date": "2017-08-16T12:45:59Z",
    "file_size": 9188438,
    "plain_text": "-----\n\n## CONTENTS\n\nIntroduction..........................................................................................................................................................................................3\n\n1. Executive summary.................................................................................................................................................................3\n\n2. What we already knew about Cobalt..........................................................................................................................4\n\n3. Cobalt targets and objectives...........................................................................................................................................5\n\n4. Chronology of Cobalt 2017 campaign.......................................................................................................................6\n\n5. Cobalt attack methods.........................................................................................................................................................8\n\n5.1. Partner phishing...........................................................................................................................................................9\n\n5.2. Malicious attachments..........................................................................................................................................13\n\n5.3. Cobalt infrastructure................................................................................................................................................17\n\nConclusion..........................................................................................................................................................................................19\n\n\n-----\n\n## INTRODUCTION\n\nBank robbery is perhaps the quintessential crime. The promise of immense, instant riches has\nlured many a criminal to target banks. And while the methods, tools, and scale of robbery have all\nchanged, two things have stayed the same: the enticement of a hefty payday and the fact that no\nsystem is perfectly secure.\n\nIn the modern digital economy, criminals are becoming ever more creative in ways to make off\nwith millions without having to leave home. Despite enormous efforts, security is always a work in\nprogress because of technical vulnerabilities and the human factor. Only a small fraction of banks\ntoday are able to withstand targeted attacks of the kind perpetrated by Cobalt, a cybercriminal\ngroup first described in 2016 that is currently active worldwide. Now the group has set its sights\non more than just banks.\n\nResearchers at Positive Technologies and other companies[1] have described the group’s methods\npreviously. In this report, we will describe the new techniques used by Cobalt in 2017, the changing target profile, and recommendations on how to avoid becoming their latest victim.\n\n## 1. EXECUTIVE SUMMARY\n\nThe Cobalt group has been quick to react to banks’ protective measures. When spam filters on\nmail servers began to block most of the group’s phishing emails, which contained forged sender\ninformation, the attackers changed techniques. Now they actively use Supply Chain Attacks[2] to\nleverage the infrastructure and accounts of actual employees at one company, in order to forge\nconvincing emails targeting a different partner organization. This tactic has already been used by\nother attackers, such as when the infrastructure of M.E.Doc was used to spread the NotPetya virus,\nwhich blocked workstations at a large number of major companies.[3]\n\nCobalt has attacked banks, financial exchanges, insurance companies, investment funds, and other financial organizations. The group is not afraid to use the names of regulatory authorities or\nsecurity topics to trick recipients into opening phishing messages from illegitimate domains.\n\nThis year the Cobalt group:\n\n**+** **Actively attaks bank partners in order to use partner infrastructure for sending phishing**\nmessages to banks.\n**+** **Sends phishing messages disguised as mailings from financial regulators.**\n**+** **Uses various types of malicious attachments: document with an exploit (.doc, .xls, .rtf),**\narchive with an executable dropper file (.scr, .exe), and archive with LNK file (.lnk).\n**+** **Appears among the first groups to get access to the latest version of the Microsoft Word**\n**Intruder 8 exploit builder, which made it possible to create documents exploiting vulnerabil-**\nity CVE-2017-0199.\n**+** **Uses poorly protected public sites to upload files and then download them to victim**\ncomputers.\n**+** **Sends phishing messages to both corporate addresses and personal addresses of**\n**employees.**\n\n[1 www.group-ib.com/cobalt.html](https://www.group-ib.com/cobalt.html)\n[2 www.sans.org/reading-room/whitepapers/analyst/combatting-cyber-risks-supply-chain-36252](https://www.sans.org/reading-room/whitepapers/analyst/combatting-cyber-risks-supply-chain-36252)\n[3 www.welivesecurity.com/2017/06/30/telebots-back-supply-chain-attacks-against-ukraine/](https://www.welivesecurity.com/2017/06/30/telebots-back-supply-chain-attacks-against-ukraine/)\n\n\n-----\n\n## 2. WHAT WE ALREADY KNEW ABOUT COBALT\n\n### Group objective Steal money\n\n Main targets Banks in Eastern Europe and Central Asia\n\n\n### Methods\n\n\nPerform cyberattacks on a bank’s information infrastructure.\nGain a foothold on bank local networks by tricking employees\ninto opening phishing messages that contain malware.\n\n\nCobalt Strike, Ammyy Admin, SoftPerfect Network Scanner,\n### Software used\nMimikatz, and OS functions (PowerShell, PsExec, Runas)\n\n\n### Outline  of a typical attack\n\n\n1. Spear phishing against bank employees\n2. Infection of the employee computer used to open an\nattachment\n3. Continuation of attack on the bank network; compromise of\nworkstations used to administer bank ATMs\n4. Infection of ATMs and on-command dispensing of cash\n5. Cash withdrawal by willing cut-outs who receive a portion of\nthe proceeds (\"mules\")\n\n\n-----\n\nThe remaining 25 percent\nof targeted companies\nrepresent diverse industries:\n\n**+** Government\n**+** Telecom/Internet\n**+** Service Providers\n**+** Manufacturing\n**+** Entertainment\n**+** Healthcare\n\n\n## 3. COBALT TARGETS AND OBJECTIVES\n\nThe Cobalt group’s traditional \"stomping grounds\" are the Eastern Europe, Central Asia, and\nSoutheast Asia. In 2017, attacks grew to include North America, Western Europe, and even South\nAmerica (Argentina).\n\nLocations of Cobalt phishing targets\n\nOf the companies targeted by Cobalt in phishing mailings, around 75 percent are in the financial\nsector. Most of these financial companies are banks (90%), but others include financial exchanges,\ninvestment funds, and lenders. This widening range of targets suggests that attacks on diverse\ncompanies with major financial flows are underway. This concurs with the forecast made by the\nFinCERT of the Russian Central Bank, which predicted increased interest by cybercriminals in financial exchanges in 2017.\n\nBy attacking a financial exchange, the Cobalt group can \"pump\" or \"dump\" stocks, incentivizing\npurchase or sale of shares in certain companies in a way that causes rapid fluctuations in share\nprice. Stock manipulation can affect not just the welfare of a single company, but the economy\nof entire countries. These methods were employed by the Corkow group in their 2016 attack on\nRussia’s Energobank, which caused a 15-percent change in the exchange rate of the ruble and\ncaused bank losses of RUB 244 million (over USD 4 million).[4]\n\nSince the beginning of 2017, our researchers have studied over 60 unique samples of phishing\nmessages sent as part of Cobalt campaigns. These messages were sent to over 3,000 people in 13\ncountries. The addresses include corporate addresses but also personal addresses, since employees often can check their email on work computers.\n\nNotably, Cobalt attacks government organizations and ministries in order to use them as a stepping stone for other targets.\n\n[4 fortune.com/2016/02/08/russian-hackers-currency-rate/](http://fortune.com/2016/02/08/russian-hackers-currency-rate/)\n\n\n-----\n\n## 4. CHRONOLOGY OF COBALT 2017 CAMPAIGN\n\n\n### January\n\n1. Registration of new phishing\ndomains and configuration\nof DNS servers\n\n\n2. Mass phishing mailings\n#### Mass mailing\n\n\n### February\n\n3. Several successful targeted\nattacks on partners, with\nfull compromise of partner\ninfrastructure\n\n4. Mailings sent from partners to\ncompanies in North America,\nEurope, USA, Southeast Asia,\nand South America\n\n\n#### Targeted mailing Partner infrastructure\n\n Mass mailing\n\n\n### March\n\n5. Compromise of several\npartners and banks\n\n6. Continuation of mass\nphishing and attacks\non other banks\n\n\n### April\n\n7. Registration of new phishing\ndomains and configuration\nof DNS servers\n\n8. Mass phishing mailings\n\n\n-----\n\n### May\n\n9. MWI 8 update used to create\ndocuments exploiting\nvulnerability CVE-2017-0199\n\n10. Registration of new phishing\ndomains and configuration\nof DNS servers\n\n11. Phishing mailings with new\ndocuments (CVE-2017-0199)\n\n12. Repeat attempts to attack\npartners are blocked\n\n\n#### Targeted mailing Attacks blocked Partner infrastructure\n\nIn early 2017, we noted that the Cobalt group was actively registering illegitimate domains. As\nsoon as these domains were used to send phishing mailings, we notified the security departments of the targeted companies, as well as the FinCERT of the Russian Central Bank. Thanks to\nthis timely intervention, the domains were blocked before the attackers could make use of them.\n\nPositive Technologies has investigated incidents related to attacks by the Cobalt group at a number of companies in 2017. In several cases, the attackers compromised company infrastructure and\nemployee accounts in order to send phishing messages to partner companies (i.e., companies\nthat have a legitimate pre-existing business relationship with banks) in North and South America,\nEurope, CIS countries, and Central and Southeast Asia. Against targets in the CIS countries, the\nattackers also used their own infrastructure, which included rented dedicated servers located in\nNorth America, Europe, and Southeast Asia.\n\nWith the help of timely countermeasures, not only was it possible to detect and stop Cobalt attacks on partner infrastructures, but also to prevent repeat compromise when the attackers attempted to re-establish control on victim networks. Companies whose partners had been used to\nsend phishing messages were warned of the danger.\n\nAttacks on various organizations around the world were just an intermediate step for Cobalt.\nHaving successfully implemented an attack on a bank or other partner organization, the group\npressed on, sending phishing messages and attacking other banks.\n\nEurope CIS\n\nSingapore\n\nSources of Cobalt phishing mailings\n\n\n-----\n\nSeveral pieces of information suggest that the team responsible for the technical aspects of attacks consists of only a handful of people. When the attackers were at their most active inside target networks, the group would temporarily stop registering domain names and sending phishing\nmailings. Activity not aimed at the targeted infrastructure was not detected. The days and times\nof mailings are also suggestive in this regard, as described later in this report.\n\n## 5. COBALT ATTACK METHODS\n\nThe Cobalt group relies on social engineering to penetrate networks—users open malicious attachments from phishing messages that are disguised by the attackers to resemble messages\nfrom legitimate companies and regulatory authorities. These attachments contain a document\nfile, which downloads a dropper from a remote server or contains the dropper in a password-protected archive. Small in size, a dropper is used to download and run other malicious software (in\nthe case of Cobalt, the Beacon Trojan).\n\nPreparations and progression of a typical attack are illustrated below.\n\n**Search for vulnerable websites** **Beacon dropper**\nfor later hosting of malicious files When launched, downloads and\n\nruns Beacon\n\n**Registration of email addresses**\n\n**LNK files**\nRun commands for downloading\nand running the dropper\n\n**Registration of phishing domains**\n\n**Malicious documents**\n**with exploits or macros**\nMWI 8 and Ancalog exploit builders\n\n**Configuration of SPF entries** used to create documents that, when\n**on DNS server** opened, download and run the dropper\n\n**Configuration of PHP script** **Encrypted ZIP archives**\n**on web server to enable** The dropper or LNK files are packed\nanonymous sending in a password-protected archive\n\n**PREPARATION** **PREPARATION**\n**OF INFRASTRUCTURE** **OF MALWARE AND FILES**\n\n**COBALT GROUP** **SPEAR PHISHING OF BANKS**\n\n**AND BANK PARTNERS**\n\n**COMPROMISE**\n**OF PARTNER INFRASTRUCTURE** **BANKS**\n\nEmployee accounts are compromised **FINANCIAL EXCHANGES**\n\nPhishing mailings with mailicious\n\n**INVESTMENT FUNDS**\n\n\nInformation about the partner’s clients\nis obtained\n\n\n**INSURANCE COMPANIES**\n\n|COMPROMISE OF PARTNER INFRASTRUCTURE|Col2|\n|---|---|\n|Employee accounts are compromised Phishing mailings with mailicious attachments are sent from the account of a partner employee Information about the partner’s clients is obtained||\n\n\nFor information on the actions of Cobalt attackers inside the network of a targeted organization,\nplease see our previous report.[5]\n\n[5 www.ptsecurity.com/upload/corporate/ww-en/analytics/Cobalt-Snatch-eng.pdf](https://www.ptsecurity.com/upload/corporate/ww-en/analytics/Cobalt-Snatch-eng.pdf)\n\n\n-----\n\n### 5.1. Partner phishing\n\nThe Cobalt group’s traditional method—sending messages with forged sender information—has\nfallen out of favor. Instead, the group has paid more attention to making sure that messages get\ndelivered by dodging mail server filters.\n\nFor a targeted mailing (\"spear phishing\"), the criminals use previously registered domains. A domain name is chosen to be similar in meaning and spelling to the domain of the real company.\nFor messages to make it through antispam and antivirus checks, the criminals correctly configure\nSPF entries on the DNS server and indicate the correct DKIM signatures for their messages. This\napproach allows bypassing verification of the address of the sender’s mail server, but offers digital\nevidence for investigators.\n\nDespite the increased complexity involved, in the first quarter of 2017 the Cobalt group also began\nto attack various companies that partner with banks, then send phishing messages from these\npartners’ infrastructures using the hacked accounts and mail servers of real employees.\n\n\nLikelihood\nof attachment opening\n\nLikelihood\nof message delivery\n\nAbility to scale mailings\n\n\nMinimization of IOCs\n\nSpeed of attack\n\n\n**Mailings with spoofed**\n**sender addresses**\n\n**2016–2017**\n\n**Mailings from**\n**a confusingly similar domain**\n\n\n**Center = lowest (least likely), edge = highest (most likely)**\n\n**2017**\n\n**Mailings from infrastructure**\n**of a compromised partner of the target**\n\n\nThis approach ensures that recipients are likely to trust the sender and has a number of advantages:\n\n**+** Attackers get information stored on the servers and in the databases of the compromised\npartner organization. This information can be used to create convincing phishing messages.\n\n**+** Attackers obtain access to employee accounts on workstations and mail servers, giving phishing messages a high degree of trust and plausibility among potential recipients.\n\n**+** Messages from partners are not blocked by mail server filters.\n\n\n-----\n\nToday, Cobalt uses phishing mailings at practically all stages of targeted attacks on banks.\n\n1. Initial compromise starts with one or more workstations at a partner organization, which\nhave been infected via phishing.\n\nA message informing of \"missed payments\"\n\nInstructions for connecting to a payment gateway—supposedly\n\n2. The attack against the partner organization is then developed by means of internal mailings containing malicious documents supposedly from colleagues, management, or IT.\n\n\"Documents requested by the head of the department\"\n\n\n-----\n\nA message claiming to inform of payroll changes\n\n3. Malicious messages are sent from the partner’s infrastructure to banks and other financial\norganizations.\n\nA password-protected archive (with the password \"doc\") supposedly containing an invoice for ATM maintenance\n\nIn early 2017, 60 percent of phishing messages from Cobalt related to cooperation and service\nterms between banks and their partners.\n\n\nRequests and recommendations from\nregulators/law enforcement\n\nRequests and instructions from colleagues\nand management\n\nChanges in terms and conditions of\ncompany partners\n\nSecurity recommendations\n\nSubjects of phishing messages\n\n\n20%\n\n\n12%\n\n60%\n\n\n-----\n\nIn 2017 Cobalt began to use security anxieties as an attack vector. The group has sent messages\nfrom illegitimate domains posing as VISA, MasterCard, and FinCERT units of the Russian Central\nBank and National Bank of the Republic of Kazakhstan.\n\nBroken English and copied boilerplate text can be convincing in the right circumstances\n\nA fake FinCERT message\n\nIn Russia, this was a particularly ironic \"twist\" since FinCERT had been actively warning financial\ncompanies about the Cobalt threat. So the group took advantage of such anxiety to send messages to banks with malicious documents, supposedly on how to keep bank systems safe.\n\nA vague warning that asks the user to act immediately\n\n\n-----\n\nSo by creating counterfeit domains superficially similar to those of real companies, the criminals use\nthe imprimatur of well-known organizations to convince users to open dangerous attachments.\n\nSince real messages from colleagues and partners usually arrive during working hours, the criminals structured the mailings so that employees would receive them during working hours (no\nmatter in which time zone the attackers themselves were located).\n\nTime of message receipt for Eastern European companies (UTC+3)\n\nTime of message receipt for Central and Southeast Asian companies (UTC+6)\n\nMost messages were received in the afternoon—the reason being that employees tend to be less\nvigilant, and therefore more susceptible to phishing, as the evening approaches.\n\nTime of message receipt for North American companies (UTC-4)\n\nWe noticed a slight variation in tactics against North American companies. Messages targeting\nU.S. and Canadian organizations were sent from the compromised infrastructure of a European\npartner. For the phishing messages to be plausibly European in origin, the criminals performed\nthe mailing during European working hours, due to which the targets received emails in the early\nwaking hours in the U.S. and Canada.\n\n### 5.2. Malicious attachments\n\nTo ensure remote access to the workstation of an employee at a target organization, the Cobalt\ngroup (as in previous years) uses Beacon, a Trojan available as part of commercial penetration\ntesting software Cobalt Strike.\n\n7% 2%\n\n11%\n\n12% DAT\n\nDOC\n\nEXE\n\nSCR\n\nRTF\n\nXLS\n\nZIP\n\nLNK\n\n2%\n\n12% 52%\n\n2%\n\nTypes of malicious files\n\n\n-----\n\nThe Trojan is delivered and run with the help of a special dropper. The dropper consists of .scr or\n.exe files that are placed on the victim's computer in one of the following ways:\n\n**+** In a password-protected ZIP archive, the password to which is given in the text of the phishing\nmessage\n**+** Downloaded from a hacked website when a malicious attachment (.doc, .xls, .rtf) is opened\nfrom the phishing message\n**+** Downloaded from a hacked website based on commands coded in a LNK file that is in a ZIP\narchive attached to the message\n\nPoorly protected websites are compromised by the attackers and used, in essence, as file hosts for\nspreading malicious files in attacks against banks.\n\n52 percent of the Cobalt phishing messages reviewed by our researchers contained Microsoft\nWord documents.\n\nPoorly protected websites are compromised by the attackers and used, in essence, as file hosts for\nspreading malicious files in attacks against banks.\n\nThe malicious Microsoft Office documents that trigger download of the dropper are created\nusing the Ancalog and Microsoft Word Intruder (MWI) exploit kits. With these kits, even a hacker\nwithout programming skills can create malicious Word documents and PDF files in an intuitive\nvisual interface in just minutes.\n\nThe Cobalt group was one of the first to get their hands on a restricted version of MWI that can\ncreate documents exploiting the critical vulnerability CVE-2017-0199. Since the version in question\nwas sold on an individual basis to customers well known to the developer, there may be a relationship between the Cobalt group and developer of MWI. One instructive fact in this regard is\nthat less than a week passed between announcement of a new MWI version and use by Cobalt of\nattachments exploiting vulnerability CVE-2017-0199.[6]\n\n[6 www.proofpoint.com/us/threat-insight/post/microsoft-word-intruder-integrates-cve-2017-0199-utilized-cobalt-group-target](https://www.proofpoint.com/us/threat-insight/post/microsoft-word-intruder-integrates-cve-2017-0199-u)\n\n\n-----\n\nMWI is positioned by its developer as a tool for conducting APT; if the software is instead used to\ncreate files for mass spamming, the developer revokes the license. For users of the restricted version of MWI, the developer offers a sort of \"scrubbing\" so that files will not be flagged by currently\navailable antivirus scanners.\n\nThe MWI developer boasting of the \"product\" online\n\nMalicious documents sent by Cobalt to banks and their partners use exploits for vulnerabilities\nCVE-2017-0199, CVE-2015-1641, and CVE-2012-0158 in order to download and run the dropper on\nthe victim system.\n\nAn official-seeming document about how to pay overdue debts\n\nWhen the attachment is opened, malicious code is run. This code takes advantage of vulnerabilities in Microsoft Office to download the dropper from a remote server and run it.[7] After the code\nfinishes running, a decoy document (such as shown in the screenshot above) is displayed.\n\n[7 blog.fortinet.com/2017/05/30/spear-phishing-fileless-attack-with-cve-2017-0199](https://blog.fortinet.com/2017/05/30/spear-phishing-fileless-attack-with-cve-2017-0199)\n\n\n-----\n\n#### .scr\n\n .exe\n\n Cobalt Strike Beacon dropper Hacked website penetration testing software\n\nUpload of trojan to previously hacked site\n\nThe attackers upload files to vulnerable sites in advance, from where the files can be later downloaded to victim systems during an attack. Therefore we urge website owners to be vigilant in\nsecuring their sites: if weak protections cause a site to become a staging ground for malware,\nregulators may block the site or law enforcement may seize server equipment as part of a criminal\ninvestigation. Public knowledge of such incidents is likely to cause severe damage to company\nreputation.\n\nUsually Cobalt phishing messages are sent in several waves. In the first wave, the criminals send\nMicrosoft Office documents created using the described exploit kits.\n\n#### .doc .rtf .xls\n\n\n#### Ancalog and MWI exploit kits\n\n\n#### Documents with exploits for CVE-2017-0199, CVE-2015-1641, CVE-2012-0158\n\nFirst wave of spear phishing\n\n\nIf there are no \"hits\" from targeted users within 24 hours of a mailing (this is possible if a company\nhas up-to-date versions of Microsoft Office that are free of the vulnerabilities targeted by the exploit builders), the attackers send a second wave.\n\n\n#### .scr\n\n .exe\n\n Beacon dropper\n\n\n#### .zip\n\n Password-protected archive\n\nSecond wave of spear phishing\n\n\nAttached to the messages is a dropper, consisting of .exe or .scr executable files, in a password-protected archive. By placing the files in an archive, the attackers can bypass some filtering and antivirus systems. Solutions are available for real-time scanning of encrypted archives\n(when the password is indicated in the body of the message, as is the case here) but organizations making use of such software are few and far between.\n\n\n#### .lnk\n\n Downloads and runs dropper\n\n\n#### .zip\n\n Archive\n\nSpear phishing\n\n\nIn addition, we have observed a separate mailing in which the attached archives contained LNK\nfiles; as in all the other cases, these files are used to download the Beacon dropper.\n\n\n-----\n\n### 5.3. Cobalt infrastructure\n\nSince a Cobalt mailing is sent to thousands of recipients, the group clearly is using some sort of\nautomation. Based on analysis of the phishing messages, we believe that the messages are sent\nfrom phishing domains with the help of alexusMailer v2.0, a freely available PHP script used to\nsend emails anonymously.[8]\n\nalexusMailer and other scripts are available on forums\n\nThe script includes support for multithreaded sending, a visual editor for messages, import of\nrecipient lists and other fields from files, templates, attaching any number of files to a message,\nand more. Users can distribute sending tasks over a number of servers and set a delay for message\nsending.\n\nalexusMailer interface\n\nHowever, when messages are sent with alexusMailer, the message header contains an artifact:\nthe X-PHP-Originating-Script field contains the name of the file of the PHP script that was used to\nsend the messages. This means that on servers used for sending, the php.ini configuration file is\nset to log outgoing mail.\n\n[8 github.com/AlexusBlack](https://github.com/AlexusBlack)\n\n\n-----\n\nThe Cobalt group uses widely available public mail services, as well as services that allow anonymous registration of temporary addresses. Some of the domains used for reply addresses\nin Cobalt mailings include: TempMail (@doanart.com, @rootfest.net), Mail.com (@mail.com),\nAT&T Mail (@att.net, @sbcglobal.net), and Yahoo! (@ymail.com). These same services were used\nby Cobalt to create email addresses when registering domains.\n\nBased on the times at which the domains in the Cobalt infrastructure were registered, we found\nthat the attackers tended to register domains towards the beginning of the week. This enables us\nto speculate on their working schedule:\n\n**+** On weekdays, the attackers actively register domains, prepare hacking tools, and (less often)\nsend phishing mailings.\n\n8\n\n7\n\n6\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\nMon Tue Wed Thu Fri Sat Sun\n\nDays on which domains were registered\n\n**+** At the end of the week, the group concentrates on sending out mailings and advancing their\nattacks within the infrastructure of compromised organizations.\n\n**+** Since phishing mailings are sent out during working hours, domains are usually registered\nduring the interval from 6:00 p.m. to 12:00 a.m. (UTC+0), which coincides with the end of the\nworking day in European countries.\n\nTime of domain registration (UTC+0)\n\nIt would seem that after registering a domain at the beginning of the week, the Cobalt group\ntakes some time to prepare for their upcoming phishing campaign, which as noted usually comes\nat the end of the week. On average, the time from domain registration to the first phishing mailing\nwith that same domain is four days.\n\nOur researchers discovered a number of Cobalt phishing domains before the group was able to\nuse them in its phishing campaigns. By acting quickly, it was possible to block the domains.\n\nWorking in cooperation with industry regulators in Russia and other countries, we have succeeded\nin disabling delegation for all .ru domains and most other top-level domains known to be associated with Cobalt.\n\n\n-----\n\n## CONCLUSION\n\nThe barrier to entry for would-be cybercriminals keeps falling every year. No longer do hackers\nneed to look for zero-day vulnerabilities and expensive tools to perform attacks. Instead, all they\nrequire are basic programming skills, commercially available software, and instructions posted on\nthe Internet.\n\nBanks and other companies must realize that attackers are constantly refining the tools and techniques they use. In today's environment, a company can fall victim just by getting caught in the\nmiddle as attackers scout for stepping stones to reach their ultimate target. That's why responsible\ncompanies can no longer remain complacent about security and pretend that hackers go after\nonly large companies and banks, or target only far-away areas of the world. No matter their industry or ownership—whether banks, state-owned organizations, or whatever else—companies\nmust keep protection of their digital infrastructure current and proactively update their software\nand operating systems. Employees must be trained to increase their security awareness and resist\nphishing attempts. Moreover, scanning should go beyond just incoming messages and attachments to include outgoing messages, with retrospective analysis. Public-facing web applications\nmust also be protected—if company infrastructure or sites are compromised by an attacker, this\ncan wound company reputation, cause blocking of company servers, trigger a drop in search\nengine ratings, and drive away customers.\n\nInformation about the extent of losses caused by the Cobalt group in 2017 is not yet available.\nPerhaps warnings by bank regulators headed off some of the group's efforts. We will continue to\nmonitor the Cobalt group and report new details as they become available. Judging by the scale\nof Cobalt campaigns worldwide, multimillion-dollar losses by banks are a real possibility. And if\nattacks on financial exchanges are successful, the consequences will include not only direct losses\nto individual companies, but rate turbulence on world currency markets.\n\nAbout Positive Technologies\n\nPositive Technologies is a leading global provider of enterprise security solutions for vulnerability and compliance\nmanagement, incident and threat analysis, and application protection. Commitment to clients and research has earned\nPositive Technologies a reputation as one of the foremost authorities on Industrial Control System, Banking, Telecom,\nWeb Application, and ERP security, supported by recognition from the analyst community. Learn more about Positive\nTechnologies at ptsecurity.com.\n\n© 2017 Positive Technologies. Positive Technologies and the Positive Technologies logo are trademarks or registered trademarks of Positive\nTechnologies. All other trademarks mentioned herein are the property of their respective owners.\n\n[info@ptsecurity.com](mailto:info%40ptsecurity.com?subject=) [ptsecurity.com](http://www.ptsecurity.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.ptsecurity.com/upload/corporate/ww-en/analytics/Cobalt-2017-eng.pdf"
    ],
    "report_names": [
        "Cobalt-2017-eng.pdf"
    ],
    "threat_actors": [
        {
            "id": "a58aedbc-e89f-4e0c-8147-c6406a616cfa",
            "created_at": "2022-10-25T16:07:23.494355Z",
            "updated_at": "2025-03-27T02:02:09.831373Z",
            "deleted_at": null,
            "main_name": "Corkow",
            "aliases": [
                "Corkow",
                "Metel"
            ],
            "source_name": "ETDA:Corkow",
            "tools": [
                "Corkow",
                "Metel"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716495,
    "ts_updated_at": 1743041768,
    "ts_creation_date": 1502887553,
    "ts_modification_date": 1502887559,
    "files": {
        "pdf": "https://archive.orkl.eu/bc0f27dddaa449417b9a419c1950d0de36e550bc.pdf",
        "text": "https://archive.orkl.eu/bc0f27dddaa449417b9a419c1950d0de36e550bc.txt",
        "img": "https://archive.orkl.eu/bc0f27dddaa449417b9a419c1950d0de36e550bc.jpg"
    }
}