{
    "id": "9f2851d4-dcb9-489d-b15c-af78b3dfce86",
    "created_at": "2022-10-25T16:48:17.104085Z",
    "updated_at": "2025-03-27T02:17:23.432031Z",
    "deleted_at": null,
    "sha1_hash": "9e6dbde54289974038d5b36e40163761b444361f",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-04-13T10:25:26Z",
    "file_modification_date": "2021-04-13T10:25:28Z",
    "file_size": 1247210,
    "plain_text": "### Vol.102\n\n\n-----\n\n## Contents\n\n##### Operation Dream Job's Campaign to Victimize Job Seekers in Korea\n\n 1. Analysis of Operation Dream Job  04\n\n 2. Analysis of ‘2 Malware Signed with TOY GUYS LLC’ Certificate  08\n\n 3. Malware Attributions  15\n\n 4. Overview of AhnLab Response   16\n\n 5. Conclusion  17\n\n 6. IoC (Indicators of Compromise)  17\n\n 7. References  19\n\n\n#### Report Vol.102 2021 Q1\n\n\n###### ASEC (AhnLab Security Emergency-response Center) is a global security response group consisting\n\n of malware analysts and security experts. This report is published by ASEC and focuses on the most\n\n significant security threats and latest security technologies to guard against such threats. For further\n\n details, please visit AhnLab, Inc.’s homepage (www.ahnlab.com).\n\n\n-----\n\n##### Operation Dream Job\n# Operation Dream Job's Campaign to Victimize Job Seekers in Korea\n\n##### The attack against job seekers in the aerospace and defense industry was first discovered\n\n in 2019. This attack was dubbed ‘Operation Dream Job.’ The attacker disguised as recruiters\n\n from well-known aerospace and defense companies and exploited business-related SNS\n\n accounts to carry out the attacks. Using these accounts, the attackers lured job seekers\n\n with job-related posts. Numerous security vendors have published analysis reports\n\n regarding this attack under different names. Despite the differences in the reported\n\n attack methods and malware strains, the published reports collectively mentioned the\n\n connection between the attack and the North-Korean hacking group, ‘Lazarus.’\n\n In January 2021, JPCERT revealed two major malware strains utilized in attacks related\n\n to Operation Dream Job: Torisma is a malware that was revealed in November 2020, and\n\n Lcpdot is a malware that was recently introduced. AhnLab found out that three variants of\n\n Lcpdot were signed with the ‘2 TOY GUYS LLC’ certificate and decided to analyze the files\n\n signed with the certificate. As a result, variants of Lcpdot malware and other malware were\n\n discovered.\n\n In this report, AhnLab Security Emergency-response Center (ASEC) will examine the\n\n Lcpdot variants used in Operation Dream Job attack while also going over the attack\n\n methods that used malware signed with ‘2 TOY GUYS LLC’ certificate.\n\n\n-----\n\n##### 1. Analysis of Operation Dream Job\n\n 1) Characteristics and Connections\n\n According to numerous security providers and relevant organizations, Lazarus group\n\n has been continuously attacking the aerospace and defense industries with malicious\n\n documents related to employment. These attacks go by various operation names,\n\n but ‘Operation Dream Job’ is most common. Kaspersky categorizes this activity as the\n\n DeathNote cluster of Lazarus group, but the connections are yet to be confirmed. Figure 1\n\n shows the associated operations of Operation Dream Job.\n\nFigure 1. Associated Operation of Operation Dream Job\n\n##### On July 29, 2020, McAfee revealed that Lazarus group attacked employees in defense\n\n industries in countries like the U.S. through Operation North Star . They also stated that the\n\n attack was related to attacks that occurred in 2017 and 2019.\n\n On August 13, 2020, security provider Clearsky revealed 'Operation Dream Job' that used\n\n fake documents related to defense industry recruitment, targeting Israeli defense workers.\n\n According to this report, Operation Dream Job is related to 'Operation Sharpshooter,' \n\n which McAfee revealed in December 2018, ‘Operation Interception' which was an attack\n\n campaign against European and Middle Eastern aerospace and defense companies,\n\n\n-----\n\n##### revealed by ESET in June 2020, and McAfee's 'Operation North Star.’\n\n On November 5, 2020, McAfee revealed additional information about Operation North Star\n\n and confirmed attacks against Australian, Israeli, and Russian IP addresses through C&C\n\n server log analysis. Details of Torisma malware analysis were also revealed in the report,\n\n but IOC information of the relevant file was not revealed.\n\n On January 26, 2021, JPCERT published 'Operation Dream Job by Lazarus' in their blog.\n\n Operation Dream Job is a targeted attack that took place between July and August\n\n 2020. On August 13, 2020, Clearsky revealed that the attack targeted aerospace and\n\n defense personnel under the disguise of recruitment documents. The article stated that\n\n the operation title was the same, and the attacker is believed to be the Lazarus group.\n\n Although Clearsky did not mention the attack's connection to Operation Dream Job, the\n\n article contained information about Torisma malware, mentioned in ‘Operation North Star:\n\n Behind The Scenes,’ an article published by McAfee in November 2020. It also included\n\n information on Lcpdot malware, the new malware variant.\n\n In January 2021, Google revealed an attack was attempted on their security research, and\n\n the C&C server used in the attack was identical to the C&C server that JPCERT had revealed.\n\n An additional malware strain connected to the same C&C server was found among the\n\n malware strains signed with the certificate associated with other attacks. Some malware\n\n strains were identified to be active in APAC region, and it is believed that activities related\n\n to these malware strains will be continually discovered in all regions.\n\n 2) Attack Method\n\n The attack method of Operation Dream Job is not yet fully explained. However, attack\n\n cases detailed in other reports suggest a standard method. It involves developing trust\n\n with the victim through conversation via social networking services, such as LinkedIn,\n\n\n-----\n\n##### while impersonating a corporate human resource manager. Then, the attacker will send\n\n malware disguised as an employment document.\n\n 3) Key Malware Strains\n\n The two key malware strains of Operation Dream Job revealed by JPCERT are Torisma and\n\n Lcpdot.\n\n (1) Torisma\n\n Torisma was first introduced in the article: 'Operation North Star Behind,' published by\n\n McAfee in November 2020. Torisma malware is executed via a Word document that\n\n includes a malicious macro and is usually packed with Themida.\n\n Torisma downloads and executes an additional module from the external server and\n\n performs additional functions, including sending information of the corrupted host and\n\n executing certain files.\n\n (2) Lcpdot\n\n Lcpdot was not mentioned in McAfee's analysis, but it is a malware that was newly\n\n revealed by JPCERT and is also referred to as CookieTime. JPCERT did not reveal the\n\n precise connection between Torisma and Lcpdot, but it is assumed that the malware was\n\n discovered while investigating security breach cases in Japan.\n\n Lcpdot is a downloader similar to Torisma, and some of the samples are protected with\n\n VMProtect packer. It receives the RC4 encryption key and base64-encoded C&C server info\n\n as an argument.\n\n It also uses the Steganography technique to disguise data as GIF files and communicate.\n\n ASEC could not confirm the features of the additionally downloaded module during the\n\n analysis. Thus details of its additional features remain unconfirmed.\n\n\n-----\n\n##### All three Lcpdot malware variants were digitally signed with the '2 TOY GUYS LLC'\n\n certificate. Figure 2 shows information on the digital signature that was signed in the file.\n\nFigure 2. Information of Digital Signature Signed in Lcpdot\n\n##### 4) Additional Activities\n\n Since Lcpdot malware files are collectively signed with an identical digital certificate, ASEC\n\n analyzed the files signed with the certificate, investigated variants of the malware, and\n\n confirmed additional attack cases. Table 1 shows major attack cases between 2020 and 2021.\n\n###### Date Attack Target Details\n\n Mar 2020 ? (Korea) ntuser.exe. variant of early Lcpdot\n\n Mar 2020 ? (Korea) Disguised as CitrixWorkspace file\n\n Jan 2021 ? (Oman) Collected with igfxaudio.exe\n\nTable 1. Major Attack Cases\n\n\n-----\n\n##### 2. Analysis of ‘2 Malware Signed with TOY GUYS LLC’ Certificate\n\n As mentioned above, ASEC analyzed files signed with the '2 TOY GUYS LLC' certificate, and\n\n all signed files were confirmed to be malware. Two samples in Table 2 were collected in\n\n Korea and one sample from Oman.\n\n###### Date Hash File Name Attack Target\n\n Mar 2020 06adca7a28b6d1d983912f7f544ee413 ntuser.exe ? (Korea)\n\n Mar 2020 5b831eaed711d5c4bc19d7e75fcaf46e citrixvesystem_laptop.exe ? (Korea)\n\n Sep 2020 d59a0a04abcb38fdb391a09972aa3ff4 ? ?\n\n Oct 2020 d7ec4cc00b212a4a8c574ce22775eb52 ? ?\n\n Nov 2020 ec0c8d2cb8da72f4b82ebe3c33c9f24f d3d10.dll ?\n\n Jan 2021 22cb24a51394e3ab9b161cd2f6de234f igfxaudio.exe ? (Oman)\n\nTable 2. Files Signed with the Certificate\n\n##### Information about key malware is as follows.\n\n 1) March 2020 - ntuser.exe\n\n This malware was first collected on March 6, 2020, and the name of the file is ntuser.exe.\n\n (md5: 06adca7a28b6d1d983912f7f544ee413) It was collected in Korea, and the fact that\n\n the C&C server address contains a Korean website suggests that Korea is the attack target.\n\n Analysis of the malware executed from memory, in Figure 3, revealed that the main body\n\n is encrypted.\n\n|Hash|File Name|\n|---|---|\n|06adca7a28b6d1d983912f7f544ee413|ntuser.exe|\n|5b831eaed711d5c4bc19d7e75fcaf46e|citrixvesystem_laptop.exe|\n|d59a0a04abcb38fdb391a09972aa3ff4|?|\n|d7ec4cc00b212a4a8c574ce22775eb52|?|\n|ec0c8d2cb8da72f4b82ebe3c33c9f24f|d3d10.dll|\n|22cb24a51394e3ab9b161cd2f6de234f|igfxaudio.exe|\n\n\n-----\n\nFigure 3. Malware that is Executed in the Memory\n\n##### When malware is executed, it is decrypted and executed in the memory. The code\n\n executed in the memory (md5: 195565729c1bc9d18197e1579431824d) is a malware\n\n variant of Lcpdot, and the file creation date is February 26, 2020. The sample that JPCERT\n\n revealed is believed to be developed around fall 2020 and is a version that is older than\n\n the one found in South Korea.\n\n Afterward, it gives an encryption key as an argument to run Lcpdot, as shown in Figure 4.\n\nFigure 4. Encryption Key is Sent as Argument\n\n##### Figure 5 shows strings such as ‘Cookie=Enable&CookieV=%d&Cookie_Time=32’, a string\n\n unique to Lcpdot.\n\n\n-----\n\nFigure 5. Lcpdot's Unique String\n\n##### When comparing it to the sample that JPCERT revealed (md5: b8df94ce84201b17684e0d3\n\n 68ed38024), it is very similar to the code shown in Figure 6.\n\nFigure 6. Comparison with JPCERT Sample\n\n##### The analysis confirmed that the malware downloads encrypted files. However, information\n\n regarding the file it downloads and its additional features remains unknown.\n\n Figure 7 and Table 3 show the target address and the list of URLs. From the lists, and it\n\n connects to several Korean websites.\n\n\n-----\n\nFigure 7. Target Address\n\n###### URLs\n\n hxxp://121.2**.2**.218/A*****.***.Common.FileServiceServer/Web/document/netframework.asp\n\n hxxp://www.co****st.com/data/geditor/main_1.php\n\n hxxps://www.myu*****un.co.kr/_proc/member/member_bk.asp\n\n hxxp://gbflatinamerica.com/test1.php\n\n hxxp://121.1**.6*.233/FileServer/temp/platform.asp\n\nTable 3. List of URLs\n\n##### Note that there are two websites related to ERP (Enterprise Resource Planning) systems. It\n\n is unconfirmed whether the server of the developer or the company that operates the ERP\n\n system was infiltrated.\n\n 2) March 2020 - citrixvesystem_laptop.exe\n\n The malware collected on March 27, 2020 (md5: 5b831eaed711d5c4bc19d7e75fcaf46e) is\n\n disguised as Citrix Workspace program. Figure 8 is the screenshot of the file attributes.\n\n\n-----\n\nFigure 8. Information of citrixvessystem_laptop.exe File\n\n##### Citrix Workspace is a digital workspace solution that helps users access company\n\n applications and data from a single, central platform. It's a tool that allows users to access\n\n the web app, company data, file virtual applications, and desktop.\n\n When malware is executed, it attempts to download the file from an industrial supply mall\n\n (hxxps://www.to****9.com/common/Download.asp?id=293). During testing, ‘Update Data.\n\n db' file with the size of 0 bytes was downloaded.\n\n It was confirmed that the normal Citrix Workspace file was included in the resource\n\n (Resource IDR_CITRIXAPP) area, and it was executed after being created.\n\nFigure 9. Main Function Code\n\n\n-----\n\n##### Figure 9 shows the malware's main function code, and the attacker probably swapped the\n\n normal Citrix Workspace file with malware.\n\n Table 4 shows the list of URLs that the malware access. Like the malware analyzed\n\n previously, various Korean websites with themes were found. The themes included\n\n infant care, association, China marketing, and university. However, downloaded files and\n\n additional commands were not confirmed.\n\n###### URLs\n\n hxxps://www.to****9.com/common/Download.asp?id=293\n\n hxxps://www.ag****ll.com/customer/qnaDelOk.asp\n\n hxxps://www.l*****al.k***.or.kr/_include/left_ajax.asp\n\n hxxps://www.china-c*****.co.kr/Interview/dcm.asp\n\n hxxp://www.w***.ac.kr/w***/listboard/faq.asp\n\nTable 4. List of URLs\n\n##### 3) Samples Collected in September 2020\n\n The variant of Lcpdot (md5: d59a0a04abcb38fdb391a09972aa3ff4) that was collected in\n\n September 2020 was provided by another security provider.\n\n The URLs the malware connects are shown in Table 5.\n\n###### URLs\n\n hxxps://www.leemble.com/5mai-lyon/public/webconf.php\n\n hxxps://www.tronslog.com/public/appstore.php\n\n hxxps://mail.clicktocareers.com/dev_clicktocareers/public/mailview.php\n\nTable 5. List of URLs\n\n\n-----\n\n##### 4) November 2020 - d3d10.dll\n\n The malware that was found in November 2020 is known as ComeBacker. The C&C server\n\n of this sample (dm5: ec0c8d2cb8da72f4b82ebe3c33c9f24f) has an identical URL to www.\n\n fabioluciani.com, a URL of Figure 10. This URL also happens to be the C&C server of the\n\n attack against Google security researchers in January 2021, revealed by Google. \n\nFigure 10. C&C server identical to other campaigns of Lazarus group\n\n##### Among the targets of the attack directed to security researchers, Korean security provider\n\n Enki revealed information regarding the attack that was launched against them and the\n\n Zero-day vulnerability (CVE-2021-26411) that affected the Internet Explorer . A security patch\n\n was later issued on March 9, 2021. The identical certificate and C&C server address suggest\n\n that Operation Dream Job and the attack on security researchers are highly related.\n\n 5) January 2021 - igfxaudio.exe\n\n igfxaudio.exe file (md5: 22cb24a51394e3ab9b161cd2f6de234f) that was collected from\n\n Oman in January 2021 has a size of 4,073,592 bytes, and is packed.\n\n\n-----\n\n##### 3. Malware Attributions\n\n Figure 11 shows the overview of connections between malware strains and attack\n\n methods related to Operation Dream Job.\n\nFigure 11. Malware Attributions\n\n##### It is believed that Lcpdot malware revealed by JPCERT was discovered along with Torisma\n\n malware. There are some cases where Lcpdot malware is signed with a specific certificate,\n\n and AhnLab managed to find a variant of Lcpdot and additional malware after analyzing\n\n the files signed with the certificate.\n\n Upon analysis, it was found that since spring 2020, the attacker has been using Lcpdot\n\n type malware to attack various countries, including Korea. It is assumed that the malware\n\n normally connects to 3-4 websites and uses different C&C server address for each attack\n\n target, based on the region and the language. For example, malware found in Korea all\n\n takes a form of a Korean website, and the same goes for Japan, where all malware found\n\n takes the form of websites that exist in Japan. Furthermore, one of the malware signed\n\n with 2 TOY GUYS LLC certificate has the same C&C server address as the one revealed by\n\n Google in 2021 (www.fabioluciani.com).\n\n\n-----\n\n##### Some statements regarding the malware attribution made by various security providers\n\n have little to no evidence backing up their statement. Thus, security vendors, such as\n\n Clearsky, stated that Operation Sharpshooter and Operation Interception might be\n\n ‘somewhat’ associated to Operation Dream Job.\n\n Furthermore, Torisma that JPCERT revealed may seem like it is linked to McAfee's Torisma,\n\n but this cannot be confirmed as McAfee did not reveal the specifics regarding the IOC.\n\n Additionally, JPCERT revealed Lcpdot but did not reveal its exact connection to Torisma\n\n malware. Still, Kaspersky claimed that they confirmed Lcpdot malware's access to the C&C\n\n server, which was used by malware of the Lazarus group.\n\n Categorizing this group of malware into a specific group is challenging and risky when\n\n attack vectors, attack methods, and malware can only be identified in a limited fashion.\n\n This report also does not attempt to claim that there is a definite link between the malware\n\n strains and the Lazarus group. However, AhnLab hopes that this report can help track\n\n related groups via information about Lcpdot variants and other malware that are assumed\n\n to be linked.\n\n 4. Overview of AhnLab Response\n\n AhnLab's solutions detect and block the malware related to Operation Dream Job using\n\n the following aliases:\n\nTrojan/Win32.Lcpdot (2021.02.09.00)\n\nTrojan/Win32.Pretendapp (2021.02.09.00)\n\nTrojan/Win64.Nukesped (2021.02.01.01)\n\nTrojan/Win32.NukeSped (2021.02.02.02)\n\nTrojan/Win64.Manuscrypt (2021.02.02.02)\n\nTrojan/Win32.Lcpdot (2021.02.26.04)\n\n\n-----\n\n##### Activities of Operation Dream Job and Lazarus attack group were revealed recently, but\n\n AhnLab solutions have been detecting them with the aliases stated above. Please note\n\n that some malware may not have been detected as they were not confirmed to be related\n\n to this attack during the analysis phase.\n\n 5. Conclusion\n\n Lazarus group is one of the attack groups that have been maintaining high level of\n\n activity since 2020, and many analysts are tracking and performing analysis on the\n\n group. The attack group of Operation Dream Job, assumed to be the Lazarus group, has\n\n been attacking aerospace and defense companies since 2019 under disguise. However,\n\n considering its connection with other attacks, there is a probability that the group may\n\n have launched attacks on other industries as well. Furthermore, multiple group activities\n\n have been detected, although their connections are yet to be confirmed. ASEC will\n\n continue to track the group and the attacks regarding Operation Dream Jobs until further\n\n discoveries are made.\n\n 6. IoC (Indicators of Compromise)\n\n 1) File Path and Name\n\n The paths and names of the files used in malware related to Operation Dream Job are as\n\n follows:\n\n (Some may be identical to the names of normal files)\n\ncitrixvesystem_laptop.exe\n\nd3d10.dll\n\nGoogleUpdate.exe\n\nigfxaudio.exe\n\nntuser.exe\n\nntuser.log\n\n\n-----\n\n##### 2) File Hashes (MD5)\n\n MD5 of the files related to Operation Dream Job is as follows:\n\n06adca7a28b6d1d983912f7f544ee413\n\n195565729c1bc9d18197e1579431824d\n\n22cb24a51394e3ab9b161cd2f6de234f\n\n5b831eaed711d5c4bc19d7e75fcaf46e\n\nd59a0a04abcb38fdb391a09972aa3ff4\n\nd7ec4cc00b212a4a8c574ce22775eb52\n\nec0c8d2cb8da72f4b82ebe3c33c9f24f\n\n##### 3) Relevant Domain, URL, and IP address\n\n Download URL or C&C address used in Operation Dream Job attack is as follows:\n\n (http was changed to hxxp)\n\nhxxp://121.1**.68.2**/FileServer/temp/platform.asp\n\nhxxp://121.25*.2**.218/A**K**.***.Common.FileServiceServer/Web/document/netframework.asp\n\nhxxp://gbflatinamerica.com/test1.php\n\nhxxp://www.co****st.com/data/geditor/main_1.php\n\nhxxp://www.w***.ac.kr/w***/listboard/faq.asp\n\nhxxps://mail.clicktocareers.com/dev_clicktocareers/public/mailview.php\n\nhxxps://www.a****ll.com/customer/qnaDelOk.asp\n\nhxxps://www.china-*****.co.kr/Interview/dcm.asp\n\nhxxps://www.leemble.com/5mai-lyon/public/webconf.php\n\nhxxps://www.love****.k***.or.kr/_include/left_ajax.asp\n\nhxxps://www.myu*****un.co.kr/_proc/member/member_bk.asp\n\nhxxps://www.to****9.com/common/Download.asp?id=293\n\nhxxps://www.tronslog.com/public/appstore.php\n\n\n-----\n\n##### 7. References\n\n [1] Ryan Sherstobitoff and Asheer Malhotra, ‘Operation Sharpshooter’ Targets Global\n\n Defense, Critical Infrastructure (https://www.mcafee.com/blogs/other-blogs/mcafee-labs/\n\n operation-sharpshooter-targets-global-defense-critical-infrastructure/)\n\n [2] Operation In(ter)ception: Aerospace and military companies in the crosshairs of\n\n cyberspies (https://www.welivesecurity.com/2020/06/17/operation-interception\n aerospace-military-companies-cyberspies/)\n\n [3] 클리어스카이(Clearsky), Operation ‘Dream Job’ Widespread North Korean Espionage\n\n Campaign (https://www.클리어스카이(Clearsky)sec.com/operation-dream-job/)\n\n [4] McAfee, Operation (노스 스타) North Star A Job Offer That’s Too Good to be True? (https://\n\n www.mcafee.com/blogs/other-blogs/mcafee-labs/operation-north-star-a-job-offer-thats\n too-good-to-be-true/)\n\n [5] Christiaan Beek and Ryan Sherstobitoff, Operation North Star: Behind The Scenes\n\n (https://www.mcafee.com/blogs/other-blogs/mcafee-labs/operation-north-star-behind\n the-scenes/)\n\n [6] JPCERT, Operation Dream Job by 라자루스(Lazarus) (https://blogs.jpcert.or.jp/\n\n en/2021/01/라자루스(Lazarus)_malware2.html)\n\n\n-----\n\n#### Report Vol.102\n\nContributors **ASEC Researchers**\n\nEditor **Content Creatives Team**\n\nDesign **Content Creatives Team**\n\n\nPublisher **AhnLab, Inc.**\n\nWebsite **www.ahnlab.com**\n\nEmail **global.info@ahnlab.com**\n\n\nDisclosure to or reproduction for others without the specific written authorization of AhnLab is prohibited.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/Report/AhnLab/ASEC_REPORT_vol.102_ENG.pdf"
    ],
    "report_names": [
        "ASEC_REPORT_vol.102_ENG"
    ],
    "threat_actors": [
        {
            "id": "a13b5ca4-fb52-44a9-aa5a-595eca6789ed",
            "created_at": "2022-10-25T15:50:23.4331Z",
            "updated_at": "2025-03-27T02:00:55.46701Z",
            "deleted_at": null,
            "main_name": "Sharpshooter",
            "aliases": [
                "Sharpshooter"
            ],
            "source_name": "MITRE:Sharpshooter",
            "tools": [
                "Rising Sun"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "874ada20-4ca8-4997-9f2e-e3933742d09c",
            "created_at": "2023-01-06T13:46:38.857642Z",
            "updated_at": "2025-03-27T02:00:02.936711Z",
            "deleted_at": null,
            "main_name": "Operation Sharpshooter",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation Sharpshooter",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041843,
    "ts_creation_date": 1618309526,
    "ts_modification_date": 1618309528,
    "files": {
        "pdf": "https://archive.orkl.eu/9e6dbde54289974038d5b36e40163761b444361f.pdf",
        "text": "https://archive.orkl.eu/9e6dbde54289974038d5b36e40163761b444361f.txt",
        "img": "https://archive.orkl.eu/9e6dbde54289974038d5b36e40163761b444361f.jpg"
    }
}