{
    "id": "9f427b72-9ca7-48d1-8e01-87d31b22307a",
    "created_at": "2023-01-12T15:06:40.216418Z",
    "updated_at": "2025-03-27T02:13:08.193552Z",
    "deleted_at": null,
    "sha1_hash": "f585af92197dd91841603a4f62ef7755283258fa",
    "title": "2021-07-29 - BazaCall- Phony call centers lead to exfiltration and ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T23:14:12Z",
    "file_modification_date": "2022-05-28T23:14:12Z",
    "file_size": 748374,
    "plain_text": "# BazaCall: Phony call centers lead to exfiltration and ransomware\n\n**[microsoft.com/security/blog/2021/07/29/bazacall-phony-call-centers-lead-to-exfiltration-and-ransomware/](https://www.microsoft.com/security/blog/2021/07/29/bazacall-phony-call-centers-lead-to-exfiltration-and-ransomware/)**\n\nJuly 29, 2021\n\nOur continued investigation into BazaCall campaigns, those that use fraudulent call centers\nthat trick unsuspecting users into downloading the BazaLoader malware, shows that this\nthreat is more dangerous than what’s been discussed publicly in other security blogs and\ncovered by the media. Apart from having backdoor capabilities, the BazaLoader payload\nfrom these campaigns also gives a remote attacker hands-on-keyboard control on an\naffected user’s device, which allows for a fast network compromise. In our observation,\nattacks emanating from the BazaCall threat could move quickly within a network, conduct\nextensive data exfiltration and credential theft, and distribute ransomware within 48 hours of\nthe initial compromise.\n\n**_Additional resources_**\n_[Protect your organization against ransomware: aka.ms/ransomware](https://aka.ms/ransomware)_\n\n_Learn how attackers operate: Human-operated ransomware attacks: A preventable_\n_disaster_\n\nBazaCall campaigns forgo malicious links or attachments in email messages in favor of\nphone numbers that recipients are misled into calling. It’s a technique reminiscent of vishing\nand tech support scams where potential victims are being cold-called by the attacker, except\nin BazaCall’s case, targeted users must dial the number. And when they do, the users are\n\n\n-----\n\nconnected with actual humans on the other end of the line, who then provide step-by-step\ninstructions for installing malware into their devices. Thus, BazaCall campaigns require direct\nphone communication with a human and social engineering tactics to succeed. Moreover,\nthe lack of obvious malicious elements in the delivery methods could render typical ways of\ndetecting spam and phishing emails ineffective.\n\n_Figure 1. The flow of a typical BazaCall attack, from the spam email to social engineering to_\n_the payload being downloaded and hands-on-keyboard attacks_\n\nThe use of another human element in BazaCall’s attack chain through the abovementioned\nhands-on-keyboard control further makes this threat more dangerous and more evasive than\ntraditional, automated malware attacks. BazaCall campaigns highlight the importance of\ncross-domain optics and the ability to correlate events in building a comprehensive defense\nagainst complex threats.\n\n[Microsoft 365 Defender orchestrates protection across domains to deliver coordinated](https://www.microsoft.com/en-us/security/technology/threat-protection)\n[defense. In the case of BazaCall, Microsoft Defender for Endpoint detects malware and](https://www.microsoft.com/en-us/security/business/threat-protection/endpoint-defender)\nattacker behavior resulting from the campaign, and these signals inform Microsoft Defender\nfor Office 365 protections against related emails, even if these emails don’t have the typical\nmalicious artifacts. Microsoft threat analysts who constantly monitor BazaCall campaigns\nenrich the intelligence on this threat and enhance our ability to protect customers.\n\nIn this blog post, we discuss how a recent BazaCall campaign attempts to compromise\nsystems and networks through the mentioned human elements and how Microsoft defends\nagainst it.\n\n## Out with the links and attachments, in with the customer service phone numbers\n\n\n-----\n\nBazaCall campaigns begin with an email that uses various social engineering lures to trick\ntarget recipients into calling a phone number. For example, the email informs users about a\nsupposed expiring trial subscription and that their credit card will soon be automatically\ncharged for the subscription’s premium version. Each wave of emails in the campaign uses a\ndifferent “theme” of subscription that is supposed to be expiring, such as a photo editing\nservice or a cooking and recipes website membership. In a more recent campaign, the email\ndoes away with the subscription trial angle and instead poses as a confirmation receipt for a\npurchased software license.\n\nUnlike typical spam and phishing emails, BazaCall’s do not have a link or attachment in its\nmessage body that users must click or open. Instead, it instructs users to call a phone\nnumber in case they have questions or concerns. This lack of typical malicious elements—\nlinks or attachments—adds a level of difficulty in detecting and hunting for these emails. In\naddition, the messaging of the email’s content might also add an air of legitimacy if the user\nhas been narrowly trained to avoid typical phishing and malware emails but not taught to be\nwary of social engineering techniques.\n\n\n-----\n\n_Figure 2. A typical BazaCall email, claiming that the user’s trial for a photo editing service will_\n_soon expire, and that they will be automatically charged. A fake customer service number is_\n_provided to help cancel the subscription._\n\nEach BazaCall email is sent from a different sender, typically using free email services and\nlikely-compromised email addresses. The lures within the email use fake business names\nthat are similar to the names of real businesses. A recipient who then searches the business\nname online to check the email’s legitimacy may be led to believe that such a company\nexists and that the message they received has merit.\n\nSome sample subject lines are listed below. They each have a unique “account number”\ncreated by the attackers to identify the recipients:\n\nSoon you’ll be moved to the Premium membership, as the demo period is ending.\nPersonal ID: KT[unique ID number]\n\n\n-----\n\nAutomated premium membership renewal notice GW[unique ID number] 👵\nYour demo stage is nearly ended. Your user account number VC[unique ID number].\nAll set to continue?\nNotification of an abandoned road accident site! Must to get hold of a manager! [body\nof email contains unique ID number]\nThanks for deciding to become a member of BooyaFitness. Fitness program was never\nsimpler before [body of email contains unique ID number]\nYour subscription will be changed to the gold membership, as the trial is ending. Order:\nKT[unique ID number]\nYour free period is almost ended. Your member’s account number VC[unique ID\nnumber]. Ready to move forward?\nThank you for getting WinRAR pro plan. Your order # is WR[unique ID number].\nMany thanks for choosing WinRAR. You need to check out the information about your\nlicenses [body of email contains unique ID number]\n\nWhile the subject lines in most of the observed campaigns contain similar keywords and\noccasional emojis, each one is unique because it includes an alphanumeric sequence\nspecific to the recipient. This sequence is always presented as a user ID or transaction code,\nbut it actually serves as a way for the attacker to identify the recipient and track the latter’s\nresponses to the campaign. The unique ID numbers largely follow the same pattern, which\nthe regular expression [A-Z]{1,3}(?:\\d{9,15}) can surface, for example, L0123456789 and\n_KT01234567891._\n\nIn one recent BazaCall campaign, the unique ID was present in the body of the email, but not\nin the subject line:\n\n\n-----\n\n_Figure 3. A recent BazaCall email with the unique ID present only in the message body._\n\nIf a target recipient does decide to call the phone number indicated in the email, they will\nspeak with a real person from a fraudulent call center set up by BazaCall’s operators. The\ncall center agent serves as a conduit to the next phase of the attack: during their\nconversation, an agent tells the caller they can help cancel the supposed subscription or\ntransaction. To do so, the agent asks the caller to visit a website.\n\nThese websites are designed to look like legitimate businesses, some of which even\nimpersonate actual companies. However, we have noted that some domain names do not\nalways match the name of the fictitious business included in the email. For example, an\nemail claiming that a user’s free trial for “Pre Pear Cooking” was set to expire was paired\nwith the domain, “topcooks[.]us”.\n\n\n-----\n\n_Figure 4. A sample website used in the BazaCall campaign. It mimics a real recipe website_\n_but is attacker-controlled._\n\nThe call center agent then instructs the user to navigate to the account page and download a\nfile to cancel their subscription. The file is a macro-enabled Excel document, with names\nsuch as “cancel_sub_[unique ID number].xlsb.” Note that in some instances, we observed\n[that even if security filters such as Microsoft Defender SmartScreen are enabled, users](https://support.microsoft.com/en-us/microsoft-edge/what-is-smartscreen-and-how-can-it-help-protect-me-1c9a874a-6826-be5e-45b1-67fa445a74c8)\nintentionally bypass it to download the file, which indicates that the call center agent is likely\ninstructing the user to circumvent security protocols, with the threat that their credit cards will\nbe charged if they don’t. Again, this demonstrates the effectiveness of social engineering\ntactics used in BazaCall attacks.\n\nThe downloaded Excel file displays a fake notification that it is protected by Microsoft Office.\nThe call center agent then instructs the user to click on the button that enables editing and\ncontent (macros) to view the spreadsheet’s contents. If the user enables the macro,\nBazaLoader malware is delivered to the device.\n\n\n-----\n\n_Figure 5. An Excel document used by the attackers, prompting the user to enable malicious_\n_code._\n\n## Hands-on-keyboard control for selective data exfiltration\n\nThe enabled macro on the Excel document creates a new folder named with a random string\nof characters in the %programdata% folder. It then copies _[certutil.exe, a known living-off-the-](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil)_\nland binary (LOLBin), from the System folder and places the copy of certutil.exe into the\nnewly created folder as a means of defense evasion. Finally, the copy of certutil.exe is\nrenamed to match the random string of characters in the folder name.\n\nThe macro then uses the newly renamed copy of certutil.exe to connect to the attacker\ninfrastructure and download BazaLoader. This downloaded payload is a malicious dynamic\nlink library ( dll) and is loaded by rundll32 exe Rundll32 then injects a legitimate MsEdge exe\n\n\n-----\n\nprocess to connect to a BazaLoader command-and-control (C2) and establish persistence by\nusing Edge to create a .lnk (shortcut) file to the payload in the Startup folder. The injected\n_MsEdge.exe is also used for reconnaissance, collecting system and user information,_\ndomains on the networks, and domain trusts.\n\nThe rundll32.exe process retrieves a Cobalt Strike beacon that enables the attacker to have\nhands-on-keyboard control of the device. Now with direct access, the attacker performs\nreconnaissance on the network and searches for local administrators and high-privilege\ndomain administrator account information.\n\n[The attacker also conducts further extensive reconnaissance using ADFind, a free](http://joeware.net/freetools/tools/adfind/index.htm)\ncommand-line tool designed for Active Directory discovery. Often, information gathered from\nthis reconnaissance is saved to a text file and viewed by the attacker using the “Type”\ncommand in the command prompt.\n\nOnce the attacker has established a list of target devices on the network, they use Cobalt\nStrike’s custom, built-in [PsExec functionality to move laterally to the targets. Each device the](https://docs.microsoft.com/en-us/sysinternals/downloads/psexec)\nattacker lands on establishes a connection to the Cobalt Strike C2 server. Additionally,\ncertain devices are used for additional reconnaissance by downloading open-source tools\n[designed to steal browser passwords. In some instances, the attackers also used WMIC to](https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmic)\nmove laterally to high-value targets, such as Domain Controllers.\n\nWhen the attacker lands on a selected high-value target, they use 7-Zip to archive\nintellectual property for exfiltration. The archived files are named after the type of data they\ncontain, such as IT information, or information about security operations, finance and\nbudgeting, and details specific to each target’s industry. The attacker then uses a renamed\nversion of the open-source tool, RClone, to exfiltrate these archives to an attacker-controlled\ndomain.\n\n\n-----\n\n_Figure 6 Post-compromise activity on the target, including exfiltration and ransomware._\n\nFinally, on domain controller devices, the attacker uses NTDSUtil.exe—a legitimate tool\ntypically used to create and maintain the Active Directory database—to create a copy of the\n_NTDS.dit Active Directory database, in either the %programdata% or %temp% folders, for_\nsubsequent exfiltration. NTDS.dit contains user information and password hashes for all\nusers in the domain.\n\nIn some instances, data exfiltration appeared to be the primary objective of the attack, which\nwould typically be in preparation for future activity. However, in other instances, the attacker\ndeploys ransomware after conducting the previously described activity. In those cases where\nransomware was dropped, the attacker used high-privilege compromised accounts in\nconjunction with Cobalt Strike’s PsExec functionality to drop a Ryuk or Conti ransomware\npayload onto network devices.\n\n## Detecting BazaCall through cross-domain visibility and threat intelligence\n\nWhile many cybersecurity threats rely on automated, drive-by tactics (for example, exploiting\nsystem vulnerabilities to drop malware or compromising legitimate websites for a watering\nhole attack) or develop advanced detection evasion methods, attackers continue to find\nsuccess in social engineering and human interaction in attacks. The BazaCall campaign\nreplaces links and attachments with phone numbers in the emails it sends out, posing\nchallenges in detection, especially by traditional antispam and anti-phishing solutions that\ncheck for those malicious indicators.\n\nThe lack of typical malicious elements in BazaCall’s emails and the speed with which their\noperators can conduct an attack exemplify the increasingly complex and evasive threats that\norganizations face today. [Microsoft 365 Defender provides the cross-domain visibility and](https://www.microsoft.com/en-us/microsoft-365/security/microsoft-365-defender)\ncoordinated defense to protect customers against such threats. The ability to correlate\nevents across endpoints and emails is crucial in the case of BazaCall, given its distinct\n[characteristics. Microsoft Defender for Endpoint detects implants such as BazaLoader and](https://www.microsoft.com/security/business/threat-protection/endpoint-defender)\nCobalt Strike, payloads such as Conti and Ryuk, and subsequent attacker behavior. These\nendpoint signals are correlated with email threat data, informing Microsoft Defender for Office\n365 to block the BazaCall emails, even if these emails don’t have the typical malicious\nartifacts.\n\nMicrosoft 365 Defender further enables organizations to defend against this threat through\nrich investigations tools like advanced hunting, allowing security teams to locate related or\nsimilar activities and seamlessly resolve them.\n\n**_Justin Carroll and Emily Hacker_**\n\n_Microsoft 365 Defender Threat Intelligence Team_\n\n\n-----\n\n## Advanced hunting queries\n\nThe following Advanced Hunting Queries are accurate as of the time of publish of this blog.\n[For the most up-to-date queries, please visit aka.ms/BazaCall.](https://aka.ms/BazaCall)\n\nTo locate possible exploitation activity, run the following queries in the Microsoft 365\nDefender portal.\n\n**BazaCall emails**\n\n[To look for malicious emails matching the patterns of the BazaCall campaign, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA3WQz26CQBjEf-cmfYeNF2qiB9N46E0PPkFvtaZBoIoBISxUje27d_gU6qGG7GZmvj8zy4KckJSMBV8k7KnxPPLAN44DW2mVjuOVhjU74Ug9zuZq4bbDi7ddG52j8IwBS-aMeWPFmQkjnvnhnVjsRWzCVHxgTu76hXKP_3HaquL5sPqJJwKplTKHSh1ol9P9af5Jz2PhnKLnufG1vcZrY0rZ10qbzaU1ujt1o-lMey78NmegHIUypHJNlTE0XEjtZrt6dJMo0rb2T_85FPKNLVGnZNeZvTImd1QvZcgvqTqsFbgBAAA&timeRangeId=month)\n```\nEmailEvents\n| where Subject matches regex @\"[A-Z]{1,3}\\d{9,15}\"\nand Subject has_any('trial', 'free', 'demo', 'membership', 'premium',\n'gold',\n'notification', 'notice', 'claim', 'order', 'license', 'licenses')\n\n```\n**BazaCall Excel file delivery**\n\nTo look for signs of web file delivery behavior matching the patterns of the BazaCall\n[campaign, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA62OTQrCMBSEv7XgHUIPoJdQt4LgAUIbbSG0pf504-H9zMKVggsJL_PezMtkNiTudNTiTsziVibRc-XCkgUPAjOt3GSF997eueNs9Rzts1pL9FWgYq1nVHk5Z1aMaqN8KGzzxefgfCo_TeX-5Bv1rBm4lYxVyRg8g7u_p2vcn9WyGJ3-mbAufbJ_AuD_t09gAQAA&timeRangeId=month)\n```\nDeviceFileEvents\n| where FileOriginUrl has \"/cancel.php\" and FileOriginReferrerUrl has\n\"/account\"\nor FileOriginUrl has \"/download.php\" and FileOriginReferrerUrl has \"/case\"\n\n```\n**BazaCall Excel file execution**\n\n[To surface the execution of malicious Excel files associated with BazaCall, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA12PWQoCMRBE61vwDsEPoyDewC8XEES8gQxjcIKzyMy4gXh2ny0oSpFOUV1dncwUdFZUyr1RrcpYA-boQaVaeFcd3eV0UYZWc5yW9CLdqMRqqf1fwgI1h69xFDYz0YPag1_NlWtsPKA525KQs4P_Jk3hBXh3V7btlZehNNpSczCQx3PAEZn2GuHw6gNHUqWjbh81tX-0Otnbv-_wGuoJVbak7xQBAAA&timeRangeId=month)\n```\nDeviceProcessEvents\n| where InitiatingProcessFileName =~ \"excel.exe\"\nand ProcessCommandLine has_all('mkdir', '&& copy', 'certutil.exe')\n\n```\n**BazaCall Excel file download domain pattern**\n\n[To look for malicious Excel files downloaded from .XYZ domains, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAAx2OsQ6CQBAFpzbhH4gfICHxAyy0tTCxszEE0ABCgAgC_rsjxbvdnZvN3ZGUN08S69n0DNS0FJzkKS9JR8CGhdC7h6w1IRfPSre3XmWlrOLunKxW5_w3czPaH9iyYyZmz5eb_ciHiUi_9p3MX-Qrb9xvtH_9fFxAnAAAAA&timeRangeId=month)\n```\nDeviceNetworkEvents\n| where RemoteUrl matches regex @\".{14}\\.xyz/config\\.php\"\n\n```\n**BazaCall dropping payload via certutil**\n\nTo look for the copy of certutil.exe that was used to download the BazaLoader payload, run\nthis query.\n\n\n-----\n\n```\nDeviceFileEvents\n| where InitiatingProcessFileName !~ \"certutil.exe\"\n| where InitiatingProcessFileName !~ \"cmd.exe\"\n| where InitiatingProcessCommandLine has_all(\"-urlcache\", \"split\", \"http\")\n\n```\n**NTDS theft**\n\nTo look for theft of Active Directory in paths used by this threat, [run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA62QSQrCQBBF_1rwDjErBdETCOK0EvEGEjIYMRNJ1Aji2X0pUBFciRTVXf1reEUvFOqsg3zurUrlFlXYEj1Uppq4q45ucnRRjFbijlZ0JUQbeUpNmejO6VpPQNeJu60ZkW1wl-y3SZ_cOXGKecwJtGZCZlUxSqWd6Vf1mRZBSDBXQ-O2b1eDvzEco9RkUhUvSmEzI7i59lS_9dKU0v4j4Kzx5z5jzOFPG3ZI2LOCmUP5fdceFbn9tWdahTaFN-Pt6wij3fkBW4ib7OABAAA&timeRangeId=month)\n```\nDeviceProcessEvents\n| where FileName =~ \"ntdsutil.exe\"\n| where ProcessCommandLine has_any(\"full\", \"fu\")\n| where ProcessCommandLine has_any (\"temp\", \"perflogs\", \"programdata\")\n// Exclusion\n| where ProcessCommandLine !contains @\"Backup\"\n\n```\n**Renamed Rclone data exfiltration**\n\n[To look for data exfiltration using renamed Rclone, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA4WMvQrCQBCEv1rwHQ6r-B5RSCNW6SWeRIg5yI82eXi_XDobWXZ3dnZmSiJvnjTuKwMpo9E6yUd6JnFgz47F_aGVHezwo68zP5qVdFX2Q7Rp7szqJi7ceGVvK1pzD_4buuyJXkG-Vx-cSUfB2cTO33_vkS_7lR_qzgAAAA&timeRangeId=month)\n```\nDeviceProcessEvents\n| where ProcessVersionInfoProductName has \"rclone\" and not(FileName has\n\"rclone\")\n\n```\n**RunDLL Suspicious Network Connections**\n\n[To look for RunDLL making suspicious network connections, run this query.](https://security.microsoft.com/v2/advanced-hunting?query=H4sIAAAAAAAAA42NSQrCQBAA6yz4h-AlF_GgZ08uQRD1C1GDCWaBJC4H8e2W4wek6emhqpclGXcKTtad2fOgoeXKSp5RSzqGDHgR6XJZa0ZsdIW2IA1vzYWDrgm7OmMtLcPelCrMzHn7xnbd7D9rS2ZMmWifZqxNg_ln_8J_ZfwmtqHneyWXdNYRYxIvNBwlJXuv9tIPBVhGvPQAAAA&timeRangeId=month)\n```\nDeviceNetworkEvents\n| where InitiatingProcessFileName =~ 'rundll32.exe' and\nInitiatingProcessCommandLine has \",GlobalOut\"\n\n```\nLearn how your organization can stop attacks through automated, cross-domain security and\nbuilt-in AI with Microsoft Defender 365.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-29 - BazaCall- Phony call centers lead to exfiltration and ransomware.pdf"
    ],
    "report_names": [
        "2021-07-29 - BazaCall- Phony call centers lead to exfiltration and ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536000,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653779652,
    "ts_modification_date": 1653779652,
    "files": {
        "pdf": "https://archive.orkl.eu/f585af92197dd91841603a4f62ef7755283258fa.pdf",
        "text": "https://archive.orkl.eu/f585af92197dd91841603a4f62ef7755283258fa.txt",
        "img": "https://archive.orkl.eu/f585af92197dd91841603a4f62ef7755283258fa.jpg"
    }
}