{
    "id": "9f643ec0-4444-4f9e-a52e-8a033c048c4b",
    "created_at": "2023-01-12T15:08:11.898502Z",
    "updated_at": "2025-03-27T02:17:22.940278Z",
    "deleted_at": null,
    "sha1_hash": "945d5aa87d4b390615a49a23961dac1a1d3cb558",
    "title": "2019-01-23 - SectorA01 Custom Proxy Utility Tool Analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T21:58:46Z",
    "file_modification_date": "2022-05-28T21:58:46Z",
    "file_size": 120986,
    "plain_text": "# SectorA01 Custom Proxy Utility Tool Analysis\n\n**[threatrecon.nshc.net/2019/01/23/sectora01-custom-proxy-utility-tool-analysis/](https://threatrecon.nshc.net/2019/01/23/sectora01-custom-proxy-utility-tool-analysis/)**\n\n## Overview\n\nSectorA01 is one of the most infamous state sponsored threat actor groups globally and is\nunique in the sense that it is one of the only state sponsored groups with large interests in\nfinancial crime. So with the continued interest into SectorA01’s financial crime activities due\nto the recent potential misattribution of the Ryuk ransomware [1], we decided to perform an\nanalysis into one of the tools – a proxy utility executable – used exclusively by SectorA01\nthat recently caught our attention again.\n\nInterestingly, in the Hidden Cobra FASTCash report by the US-CERT [2] in October last year,\nthere were two versions of a “Themida packed proxy service module” (i.e. x32 and x64\nversions). Our analysis of those modules showed code reuse of critical functions with the\nsample we are analyzing in this post, leading us to think that those samples might be an\nevolution of this sample.\n\n## SectorA01 Proxy Utility\n\nSectorA01 uses a variety of tools for different purposes, but one common custom tool used\nin the attacks targeting the Polish banks in 2016-2017 [3], a Taiwanese Bank in 2017 [4], and\nVietnamese banks in 2018 [5] is one of their custom proxy utility executables.\n\nThe latest unique sample of this proxy utility we could find was on December 10th, 2018 from\nCanada. This leads us to one of a few possible theories that Canadian bank(s) may have\nbeen one of the many unreported or reported [6] targets during the time period of the attack\non the Taiwanese bank based on the compilation timestamps.\n\nAs we can see from the FASTCash proxy samples below, at least one of their developers\ncompiles the 64-bit sample immediately after compiling the 32-bit sample – behavior very\nnormal for developers when compiling for multiple systems. The same thing can be seen for\nthe two samples on 20 Feb 2017, and so in fact instead of calling them samples targeting a\nTaiwanese bank and potentially a Canadian bank, it may be more accurate to call it just one\nof the many pairs of 32-bit and 64-bit proxy samples produced by the group.\n\nA proxy was also used against an unnamed Southeast Asian bank [7] which appears to be\nan older version of the proxy, and against an Indian bank [8] which appears to be a newer\nversion of the proxy based our code analysis from samples in the US-CERT FASTCash\nreport.\n\n\n-----\n\nBut despite the similarities, however, we are unable to definitively state that these samples\nwere earlier (unnamed Southeast Asian bank) or later (FASTCash attack, such as against\nthe Indian bank) versions of the proxy. After all, SectorA01 has more than one proxy tool in\nits arsenal, such as the proxy used together with their TYPEFRAME trojan [9] which has a\nseparate code base.\n\n**Description** **Compilation Timestamp**\n\nAttack on unnamed SEA bank (old version) 17 Sep 2014 16:59:33\n\nAttack on several Polish banks (variant) 24 Aug 2015 10:21:52\n\nAttack on Vietnamese banks (variant) 2 May 2016 03:24:39\n\nAttack on a Taiwanese Bank (32-bit) (variant) 20 Feb 2017 11:09:30\n\nSample Discovered from Canada (64-bit) (sample analyzed) 20 Feb 2017 11:09:41\n\nFASTCash (32-bit) (new version) 14 Aug 2017 17:14:04\n\nFASTCash (64-bit) (new version) 14 Aug 2017 17:14:12\n\n## Sample Background\n\nThis executable is a custom tunneling proxy utility tool in SectorA01’s toolkit. It can be used\nas either a tunneling proxy server to forward traffic to another destination, or as a tunneling\nproxy client which requests another infected tunneling proxy server to perform requests.\n\nBesides being used as one of several ordinary proxy servers in a chain of servers to hide the\nsource of attacks, against one example banking target from India in the FASTCash attacks,\n“a proxy server was created and transactions authorized by the fake or proxy server”. In this\nscenario, the proxy utility seems to be not used just as a secondary helper utility, but as the\nprimary attack malware.\n\nSectorA01 normally packs these samples with either the Themida or Enigma Protector, but in\nthis blog post we will only be showing the analysis of the unpacked sample.\n\n## Process Arguments\n\nThis utility requires a single process argument in order for it to run. It attempts to decode the\nargument and only continues its execution path if the decoded argument match the format it\nis expecting.\n\nThe argument is delimited by the “|” symbol, and the utility decodes up to four tokens with\neach token being decoded individually. The first is required and used as the primary C2\nserver (malware acting as tunneling proxy server) or as the URL to be requested (malware\n\n\n-----\n\nacting as tunneling proxy client), the optional second token is used as the proxy target\ninformation, the optional third token is used as proxy server information, and the optional\nfourth token is an optional proxy username and password.\n\nEach deobfuscated token is separated by a colon “:”, which is used as the deobfuscated\nprocess arguments delimiter.\n```\nint __stdcall WinMain_0(HINSTANCE hInstance, HINSTANCE hPrevInstance, LPSTR\nlpCmdLine, int nShowCmd){\n //deobfuscate process arguments here\ndeobfuscation_complete:\n if ( strlen(deobfuscated_c2_1) != 0 && strchr(deobfuscated_c2_1, “:”) ){\n  …\n }\nreturn 0;\n}\n\n```\nThe decoding algorithm makes use of a rotating character in an eight character string\n“cEzQfoPw” and the loop index to ensure that every deobfuscated character at a different\nindex comes from a different two obfuscated characters.\n\nWe recreated this deobfuscation algorithm and created an obfuscation algorithm, which\nallowed us to forge our own process arguments. An example of a process argument which\nuses all four tokens could be\n“!y$t$A$s!z$S$e$U$Q$Y$1$W$U!}$d|!y#z$A$s!z$S$o$1$5$t$A$e$U!x|!y#\n{!}$Z$C$R$o$1$P#}$8$a!y!y|!00X!B0]0D!8#z$2$R0d$0$b!w!20c!70B0d”.\n\n\n**Example Token**\n\n\n**Decoded C2**\n**Information** **Usage**\n\n\n!y$t$A$s!z$S$e$U$Q$Y$1$W$U!}$d 192.168.1.1:443 C2 Server (1-2\narguments)\nProxy Target (3-4\narguments)\n\n!y#z$A$s!z$S$o$1$5$t$A$e$U!x 172.16.1.1:443 Proxy Target (2\narguments only)\n\n!y#{!}$Z$C$R$o$1$P#}$8$a!y!y 10.1.1.12:8080 Proxy Server (3-4\narguments)\n\n!00X!B0]0D!8#z$2$R0d$0$b!w!20c!70B0d sector%20a01:proxy Proxy Authentication\n(4 arguments only)\n\nNote that since the algorithm transforms every two encoded characters into one decoded\ncharacter based on its character index, there are many possible two characters which will\nresult in the same character, and finally countless different strings which would decode to a\nsingle string.\n\n\n-----\n\n## C2 Communication\n\nThe algorithm used for C2 communications is more straightforward – a combination of\nADD/XOR repeatedly from each character in a hard coded 20 character byte array “{47 B0\n62 0E 69 F3 22 8D 65 40 BF 39 24 A6 C3 BB 8E 68 EB B5}” is used for decoding, and the\nopposite XOR/SUB repeatedly from the reversed byte array is used for encoding. The\nalgorithm restarts for each character without context, so it essentially ends up being a\ncharacter substitution table.\n\nThere are eight commands to communicate with the C2 server, encoded by either the C2\nserver or the proxy client then decoded by the other side. These commands are in the\nRussian language but as other researchers have pointed out in the past, is simply a false\nflag.\n\nIn fact, in one of the analyzed malware used against an unnamed Southeast Asian bank, we\nsee that what appears to be a much earlier versions of the proxy having seven numeric-only\ncontrol codes while this sample has eight Russian language control codes, with the control\ncodes in both samples having almost the same meaning.\n\n**Operation** **Description** **Hex Values over the Network**\n\n\nkliyent2podklyuchit Malware thread created notification\n(client)\n\n\nd1 14 23 b3 c7 b2 ac fe 70 0d\n1c d1 14 b3 d7 f9 38 23 ac\n\n\nNachalo Client has started (client) 92 ab f9 38 ab 14 0d\n\n\nssylka Tunneling proxy server has started\n(client)\n\npoluchit Get proxy target information\n(server)\n\nustanavlivat Set proxy target information\n(server)\n\npereslat Start a new tunneling proxy server\nsession in new thread (server)\n\n\nc9 c9 b3 14 d1 ab\n\n70 0d 14 d7 f9 38 23 ac\n\nd7 c9 ac ab b2 ab 2a 14 23 2a\nab ac\n\n70 c7 be c7 c9 14 ab ac\n\n\nderzhat Maintain connection (server) 1c c7 be b6 38 ab ac\n\n\nvykhodit Exit (server) / Client has exited\n(client)\n\n## Tunneling Proxy Server\n\n\n2a b3 d1 38 0d 1c 23 ac\n\n\nWhen this utility acts as a tunneling proxy server, it directly uses Windows Sockets 2\n(“WS2 32”) to achieve their rudimentary proxy.\n\n\n-----\n\n```\nsigned __int64 __fastcall c2_ssylka(LPVOID lpThreadParameter){\n SOCKET c2Socket = begin_c2(“ssylka”);\n …\n SOCKET targetProxySocket = retrieveProxySocket();\n …\n start_tunnel_proxy_server(c2Socket, targetProxySocket);\n …\n}\nsigned int __fastcall start_tunnel_proxy_server(SOCKET c2Socket, SOCKET\ntargetProxySocket){\n …\n numBytesReceived = recv(c2Socket, &dataToProxy, 0x2000, 0);\n …\n numBytesReceived = send(targetProxySocket, &dataToProxy, numBytesReceived, 0);\n …\n}\n\n## Tunneling Proxy Client\n\n```\nWhen this utility acts as a tunneling proxy client, it utilizes the more powerful embedded\nlibcurl library (version 7.49.1 for this sample, but not always the case) to command other\ninfected tunneling proxy servers.\n```\n__int64 __fastcall connect_to_proxy(__int64 fixedFunctionAddress, __int64\nproxyTarget){\n …\n curl_setopt(handle, CURLOPT_URL, proxyTarget);\n …\n curl_setopt(handle, CURLOPT_PROXY, fixedFunctionAddress + 16); //refers to\ndeobfuscated proxy server information\n …\n curl_setopt(handle, CURLOPT_HTTPPROXYTUNNEL, 1);\n …\n if ( strlen((fixedFunctionAddress + 278)) != ) //if deobfuscated argument 4 is not\nempty\n  curl_setopt(handle, CURLOPT_PROXYUSERPWD); //curl_setopt argument 3 =\ndeobfuscated process argument 4, which is not detected by decompiler\n  …\n }\n …\n}\n\n```\nThe CURLOPT_HTTPPROXYTUNNEL code causes the client to starts by using HTTP\nCONNECT to the proxy server in order to request it to forward traffic to the proxy target.\n\n\n-----\n\n```\n>Internet Protocol Version 4, Src: x.x.x.x, Dst: 10.1.1.12\n>Transmission Control Protocol, Src Port: xxxxx, Dst Port: 8080, Seq: 1, Ack: 1, Len:\n59\n>Hypertext Transfer Protocol\n >CONNECT 192.168.1.1:443 HTTP/1.1\\r\\n\n  >[Expert Info (Chat/Sequence): CONNECT 192.168.1.1:443 HTTP/1.1\\r\\n]\n   Request Method: CONNECT\n   Request URI: 192.168.1.1:443\n   Request Version: HTTP/1.1\n  Host: 192.168.1.1:443\\r\\n\n\n## The FASTCash Connection\n\n```\nIn October last year, the US-CERT reported about the “FASTCash” campaign by SectorA01,\nwhich was essentially an ATM cash-out scheme whereby SectorA01 remotely compromised\nbank payment switch applications to simultaneously physically withdraw from ATMs in many\ncountries and steal millions of dollars.\n\nSome of the artifacts used in the campaign included proxy modules, a RAT, and an installer\napplication. When we performed a preliminary analysis and compared the FASTCash proxy\nmodule to the proxy module analyzed in this post, we found algorithmic similarities between\nthe decoding/encoding functions, the process argument deobfuscation function, and the\nproxy function.\n\nHowever, the FASTCash proxy module also had more functions in them with new capabilities\nas described briefly in the US-CERT FASTCash Malware Analysis Report [10]. Additionally,\nour own analysis showed that they have also updated the use of amateur-ish strings which\nwere previously easily detectable from memory and obviously malicious, to now hiding or\nremoving those custom strings. This is their normal behavior as it has been known that they\nare constantly modifying their own source code, and these similarities and developments\nleads us to think that the FASTCash proxy module might be an evolution of their previous\nproxy module.\n\n## Summary\n\nAttribution is a complex and controversial topic, but regardless, correctly attributing a threat\nto a particular threat group is a far easier task than correctly attributing the threat to or being\nlinked to a particular nation state. Given even a single piece of complex enough custom\nmalware believed to be in possession by only a single group and context behind the attack, it\nis possible to have some degree of confidence of which group was behind the attack.\n\nBut even custom malware source code can get stolen, the executable itself repackaged, or\nthe functions recreated. In a simpler scenario, false flags such as strings and metadata could\nalso be placed.\n\n\n-----\n\nRegarding the initial attribution of the Ryuk ransomware, however, while others have focused\non the misattribution, our view is that even if it was correct it would simply have been a lucky\nguess. Basing attribution solely on the usage of a single privately purchasable malware is\nfundamentally flawed, and the simple truth is that no organization in the world would be able\nto track every piece of malware to know what is being sold in the dark and deep web\nanyway.\n\nThat is why in order to have a higher degree of confidence of who is behind an attack, the\nentirety of the threat’s tactics, techniques, and procedures (TTPs) need to be analyzed\nacross multiple events using both trusted public and vetted private sources.\n\nSectorA01 shows no signs of stopping their attacks against financial sectors worldwide and\nalthough they have been constantly modifying their code protectors, functions, and\nalgorithms, there will be traces of similarities across different versions of their tools. Our\nThreat Recon Team will continue tracking such events and malware and report on our\nfindings.\n\n## Indicators of Compromise (IoCs)\n\n**Unpacked Sample (SHA-256)**\n\n0d75d429c1cc3550b2961be84af777f8bed287a44a144b7a47988c601e1e9a27\n\n**Memory Dump Samples from US-CERT FASTCash Report (SHA-256)**\n\n9ddacbcd0700dc4b9babcd09ac1cebe23a0035099cb612e6c85ff4dffd087a26\n\n1f2cd2bc23556fb84a51467fedb89cbde7a5883f49e3cfd75a241a6f08a42d6d\n\n**Packed Sample from Polish banks attack (SHA-256)**\n\nd4616f9706403a0d5a2f9a8726230a4693e4c95c58df5c753ccc684f1d3542e2\n\n**Sample from Taiwanese bank attack (SHA-256)**\n\n9a776b895e93926e2a758c09e341accb9333edc1243d216a5e53f47c6043c852\n\n**Sample from Vietnamese banks attack (SHA-256)**\n\nf3ca8f15ca582dd486bd78fd57c2f4d7b958163542561606bebd250c827022de\n\n**Attack on Unnamed SEA Bank (TCP Tunnel Tool) (SHA-256)**\n\n19bba0a7669a0109a6d2184bc0135ea4581449c8f5f0ef8a04af057447635cab\n\n## References\n\n[1] [Ryuk Ransomware Attack: Rush to Attribution Misses the Point](https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/ryuk-ransomware-attack-rush-to-attribution-misses-the-point/)\n\n[2] [HIDDEN COBRA – FASTCash Campaign](https://www.us-cert.gov/ncas/alerts/TA18-275A)\n\n[[3] Włamania do kilku banków skutkiem poważnego ataku na polski sektor finansowy](https://zaufanatrzeciastrona.pl/post/wlamania-do-kilku-bankow-skutkiem-powaznego-ataku-na-polski-sektor-finansowy/)\n\n\n-----\n\n[4] [TAIWAN HEIST: LAZARUS TOOLS AND RANSOMWARE](https://baesystemsai.blogspot.com/2017/10/taiwan-heist-lazarus-tools.html)\n\n[5] [High alert against malicious code attacks in Vietnam](https://vietnaminsider.vn/high-alert-against-malicious-code-attacks-in-vietnam/)\n\n[6] [BMO and CIBC-owned Simplii Financial reveal hacks of customer data](https://www.cbc.ca/news/business/simplii-data-hack-1.4680575)\n\n[7] [LAZARUS UNDER THE HOOD](https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf)\n\n[8] North Korean connection to Cosmos hacking? Signs point to Bangladesh heist\nmasterminds\n\n[9] [MAR-10135536-12 – North Korean Trojan: TYPEFRAME](https://www.us-cert.gov/ncas/analysis-reports/AR18-165A)\n\n[10] [MAR-10201537 – HIDDEN COBRA FASTCash-Related Malware](https://www.us-cert.gov/ncas/analysis-reports/AR18-275A)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-23 - SectorA01 Custom Proxy Utility Tool Analysis.pdf"
    ],
    "report_names": [
        "2019-01-23 - SectorA01 Custom Proxy Utility Tool Analysis.pdf"
    ],
    "threat_actors": [
        {
            "id": "32a223a8-3c79-4146-87c5-8557d38662ae",
            "created_at": "2022-10-25T15:50:23.703698Z",
            "updated_at": "2025-03-27T02:00:55.528031Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Lazarus Group",
                "Labyrinth Chollima",
                "HIDDEN COBRA",
                "Guardians of Peace",
                "NICKEL ACADEMY",
                "Diamond Sleet"
            ],
            "source_name": "MITRE:Lazarus Group",
            "tools": [
                "RawDisk",
                "Proxysvc",
                "BADCALL",
                "FALLCHILL",
                "WannaCry",
                "HOPLIGHT",
                "TYPEFRAME",
                "Dtrack",
                "HotCroissant",
                "HARDRAIN",
                "Dacls",
                "KEYMARBLE",
                "TAINTEDSCRIBE",
                "AuditCred",
                "netsh",
                "ECCENTRICBANDWAGON",
                "AppleJeus",
                "BLINDINGCAN",
                "ThreatNeedle",
                "Volgmer",
                "Cryptoistic",
                "RATANKBA",
                "Bankshot",
                "Torisma",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b0d34dd6-ee90-483b-bb6c-441332274160",
            "created_at": "2022-10-25T16:07:23.296754Z",
            "updated_at": "2025-03-27T02:02:09.724313Z",
            "deleted_at": null,
            "main_name": "Aggah",
            "aliases": [
                "Operation Red Deer",
                "Operation Roma225"
            ],
            "source_name": "ETDA:Aggah",
            "tools": [
                "AgenTesla",
                "Agent Tesla",
                "AgentTesla",
                "Aggah",
                "Atros2.CKPN",
                "Bladabindi",
                "Jorik",
                "Nancrat",
                "NanoCore",
                "NanoCore RAT",
                "Negasteal",
                "Origin Logger",
                "Revenge RAT",
                "RevengeRAT",
                "Revetrat",
                "Warzone",
                "Warzone RAT",
                "ZPAQ",
                "Zurten",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8bc1a044-a23b-4904-903c-13f463605cb3",
            "created_at": "2024-05-01T02:03:08.136237Z",
            "updated_at": "2025-03-27T02:05:17.415795Z",
            "deleted_at": null,
            "main_name": "NICKEL GLADSTONE",
            "aliases": [
                "Bluenoroff ",
                "CTG-6459 ",
                "Citrine Sleet ",
                "HIDDEN COBRA ",
                "Lazarus Group",
                "Sapphire Sleet ",
                "Stardust Chollima ",
                "APT38 "
            ],
            "source_name": "Secureworks:NICKEL GLADSTONE",
            "tools": [
                " Bankshot",
                " CATCH22",
                " CCGC_Proxy",
                " Cur1Agent",
                " Ratankba",
                " Server_TrafficForwarder",
                " Wcry",
                "AlphaNC"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a2b92056-9378-4749-926b-7e10c4500dac",
            "created_at": "2023-01-06T13:46:38.430595Z",
            "updated_at": "2025-03-27T02:00:02.831633Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "Operation DarkSeoul",
                "APT38",
                "ATK117",
                "DEV-1222",
                "G0032",
                "APT 38",
                "Stardust Chollima",
                "APT-C-26",
                "ATK3",
                "Diamond Sleet",
                "Hidden Cobra",
                "Unit 121",
                "Subgroup: Bluenoroff",
                "NICKEL GLADSTONE",
                "DEV-0139",
                "Andariel",
                "Operation Troy",
                "COVELLITE",
                "TA404",
                "Lazarus group",
                "Dark Seoul",
                "G0082",
                "NewRomanic Cyber Army Team",
                "Bluenoroff",
                "Appleworm",
                "Nickel Academy",
                "COPERNICIUM",
                "Hastati Group",
                "Bureau 121",
                "Operation AppleJeus",
                "Whois Hacking Team",
                "Citrine Sleet",
                "Sapphire Sleet",
                "Group 77",
                "Labyrinth Chollima",
                "Operation GhostSecret",
                "BeagleBoyz"
            ],
            "source_name": "MISPGALAXY:Lazarus Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "679e335a-38a4-4db9-8fdf-a48c17a1f5e6",
            "created_at": "2023-01-06T13:46:38.820429Z",
            "updated_at": "2025-03-27T02:00:02.927526Z",
            "deleted_at": null,
            "main_name": "FASTCash",
            "aliases": [],
            "source_name": "MISPGALAXY:FASTCash",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f32df445-9fb4-4234-99e0-3561f6498e4e",
            "created_at": "2022-10-25T16:07:23.756373Z",
            "updated_at": "2025-03-27T02:02:09.966155Z",
            "deleted_at": null,
            "main_name": "Lazarus Group",
            "aliases": [
                "APT-C-26",
                "ATK 3",
                "Appleworm",
                "Citrine Sleet",
                "DEV-0139",
                "Diamond Sleet",
                "Gleaming Pisces",
                "Gods Apostles",
                "Gods Disciples",
                "Group 77",
                "Guardians of Peace",
                "Hastati Group",
                "Hidden Cobra",
                "ITG03",
                "Jade Sleet",
                "Labyrinth Chollima",
                "Lazarus Group",
                "NewRomanic Cyber Army Team",
                "Operation 99",
                "Operation AppleJeus",
                "Operation AppleJeus sequel",
                "Operation Blockbuster: Breach of Sony Pictures Entertainment",
                "Operation CryptoCore",
                "Operation Dream Job",
                "Operation Dream Magic",
                "Operation Flame",
                "Operation GhostSecret",
                "Operation In(ter)caption",
                "Operation LolZarus",
                "Operation Marstech Mayhem",
                "Operation No Pineapple!",
                "Operation North Star",
                "Operation Phantom Circuit",
                "Operation Sharpshooter",
                "Operation Ten Days of Rain / DarkSeoul",
                "Operation Troy",
                "SectorA01",
                "Slow Pisces",
                "TA404",
                "TraderTraitor",
                "UNC2970",
                "UNC4034",
                "UNC4736",
                "UNC4899",
                "UNC577",
                "Whois Hacking Team"
            ],
            "source_name": "ETDA:Lazarus Group",
            "tools": [
                "3CX Backdoor",
                "3Rat Client",
                "3proxy",
                "AIRDRY",
                "ARTFULPIE",
                "ATMDtrack",
                "AlphaNC",
                "Alreay",
                "Andaratm",
                "AngryRebel",
                "AppleJeus",
                "Aryan",
                "AuditCred",
                "BADCALL",
                "BISTROMATH",
                "BLINDINGCAN",
                "BTC Changer",
                "BUFFETLINE",
                "BanSwift",
                "Bankshot",
                "Bitrep",
                "Bitsran",
                "BlindToad",
                "Bookcode",
                "BootWreck",
                "BottomLoader",
                "Brambul",
                "BravoNC",
                "Breut",
                "COLDCAT",
                "COPPERHEDGE",
                "CROWDEDFLOUNDER",
                "Castov",
                "CheeseTray",
                "CleanToad",
                "ClientTraficForwarder",
                "CollectionRAT",
                "Concealment Troy",
                "Contopee",
                "CookieTime",
                "Cyruslish",
                "DAVESHELL",
                "DBLL Dropper",
                "DLRAT",
                "DRATzarus",
                "DRATzarus RAT",
                "Dacls",
                "Dacls RAT",
                "DarkComet",
                "DarkKomet",
                "DeltaCharlie",
                "DeltaNC",
                "Dembr",
                "Destover",
                "DoublePulsar",
                "Dozer",
                "Dtrack",
                "Duuzer",
                "DyePack",
                "ECCENTRICBANDWAGON",
                "ELECTRICFISH",
                "Escad",
                "EternalBlue",
                "FALLCHILL",
                "FYNLOS",
                "FallChill RAT",
                "Farfli",
                "Fimlis",
                "FoggyBrass",
                "FudModule",
                "Fynloski",
                "Gh0st RAT",
                "Ghost RAT",
                "Gopuram",
                "HARDRAIN",
                "HIDDEN COBRA RAT/Worm",
                "HLOADER",
                "HOOKSHOT",
                "HOPLIGHT",
                "HOTCROISSANT",
                "HOTWAX",
                "HTTP Troy",
                "Hawup",
                "Hawup RAT",
                "Hermes",
                "HotCroissant",
                "HotelAlfa",
                "Hotwax",
                "HtDnDownLoader",
                "Http Dr0pper",
                "ICONICSTEALER",
                "Joanap",
                "Jokra",
                "KANDYKORN",
                "KEYMARBLE",
                "Kaos",
                "KillDisk",
                "KillMBR",
                "Koredos",
                "Krademok",
                "LIGHTSHIFT",
                "LIGHTSHOW",
                "LOLBAS",
                "LOLBins",
                "Lazarus",
                "LightlessCan",
                "Living off the Land",
                "MATA",
                "MBRkiller",
                "MagicRAT",
                "Manuscrypt",
                "Mimail",
                "Mimikatz",
                "Moudour",
                "Mydoom",
                "Mydoor",
                "Mytob",
                "NACHOCHEESE",
                "NachoCheese",
                "NestEgg",
                "NickelLoader",
                "NineRAT",
                "Novarg",
                "NukeSped",
                "OpBlockBuster",
                "PCRat",
                "PEBBLEDASH",
                "PLANKWALK",
                "POOLRAT",
                "PSLogger",
                "PhanDoor",
                "Plink",
                "PondRAT",
                "PowerBrace",
                "PowerRatankba",
                "PowerShell RAT",
                "PowerSpritz",
                "PowerTask",
                "Preft",
                "ProcDump",
                "Proxysvc",
                "PuTTY Link",
                "QUICKRIDE",
                "QUICKRIDE.POWER",
                "Quickcafe",
                "QuiteRAT",
                "R-C1",
                "ROptimizer",
                "Ratabanka",
                "RatabankaPOS",
                "Ratankba",
                "RatankbaPOS",
                "RawDisk",
                "RedShawl",
                "Rifdoor",
                "Rising Sun",
                "Romeo-CoreOne",
                "RomeoAlfa",
                "RomeoBravo",
                "RomeoCharlie",
                "RomeoCore",
                "RomeoDelta",
                "RomeoEcho",
                "RomeoFoxtrot",
                "RomeoGolf",
                "RomeoHotel",
                "RomeoMike",
                "RomeoNovember",
                "RomeoWhiskey",
                "Romeos",
                "RustBucket",
                "SHADYCAT",
                "SHARPKNOT",
                "SIGFLIP",
                "SIMPLESEA",
                "SLICKSHOES",
                "SORRYBRUTE",
                "SUDDENICON",
                "SUGARLOADER",
                "SheepRAT",
                "SierraAlfa",
                "SierraBravo",
                "SierraCharlie",
                "SierraJuliett-MikeOne",
                "SierraJuliett-MikeTwo",
                "SimpleTea",
                "SimplexTea",
                "SmallTiger",
                "Stunnel",
                "TAINTEDSCRIBE",
                "TAXHAUL",
                "TFlower",
                "TOUCHKEY",
                "TOUCHMOVE",
                "TOUCHSHIFT",
                "TOUCHSHOT",
                "TWOPENCE",
                "TYPEFRAME",
                "Tdrop",
                "Tdrop2",
                "ThreatNeedle",
                "Tiger RAT",
                "TigerRAT",
                "Trojan Manuscript",
                "Troy",
                "TroyRAT",
                "VEILEDSIGNAL",
                "VHD",
                "VHD Ransomware",
                "VIVACIOUSGIFT",
                "VSingle",
                "ValeforBeta",
                "Volgmer",
                "Vyveva",
                "W1_RAT",
                "Wana Decrypt0r",
                "WanaCry",
                "WanaCrypt",
                "WanaCrypt0r",
                "WannaCry",
                "WannaCrypt",
                "WannaCryptor",
                "WbBot",
                "Wcry",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "WinorDLL64",
                "Winsec",
                "WolfRAT",
                "Wormhole",
                "YamaBot",
                "Yort",
                "ZetaNile",
                "concealment_troy",
                "http_troy",
                "httpdr0pper",
                "httpdropper",
                "klovbot",
                "sRDI"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536091,
    "ts_updated_at": 1743041842,
    "ts_creation_date": 1653775126,
    "ts_modification_date": 1653775126,
    "files": {
        "pdf": "https://archive.orkl.eu/945d5aa87d4b390615a49a23961dac1a1d3cb558.pdf",
        "text": "https://archive.orkl.eu/945d5aa87d4b390615a49a23961dac1a1d3cb558.txt",
        "img": "https://archive.orkl.eu/945d5aa87d4b390615a49a23961dac1a1d3cb558.jpg"
    }
}