{
    "id": "9fac4de6-444d-42c2-ac3c-cfeaa593f9f5",
    "created_at": "2023-01-12T15:10:54.169612Z",
    "updated_at": "2025-03-27T02:06:00.992068Z",
    "deleted_at": null,
    "sha1_hash": "faf495536f05e36f5bc1c3929be406eb65ac13f9",
    "title": "2020-10-12 - New action to combat ransomware ahead of U.S. elections",
    "authors": "",
    "file_creation_date": "2022-05-27T22:05:43Z",
    "file_modification_date": "2022-05-27T22:05:43Z",
    "file_size": 482540,
    "plain_text": "# New action to combat ransomware ahead of U.S. elections\n\n**[blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)**\n\nOctober 12, 2020\n\nToday we took action to disrupt a botnet called Trickbot, one of the world’s most infamous\nbotnets and prolific distributors of ransomware.\n\nAs the [United States government and independent experts have warned, ransomware is one](https://www.reuters.com/article/us-usa-cyber-election-exclusive/exclusive-u-s-officials-fear-ransomware-attack-against-2020-election-idUSKCN1VG222)\nof the largest [threats to the upcoming elections. Adversaries can use ransomware to infect a](https://www.nytimes.com/2020/09/27/technology/2020-election-security-threats.html)\ncomputer system used to maintain voter rolls or report on election-night results, seizing those\nsystems at a prescribed hour optimized to sow chaos and distrust.\n\nWe disrupted Trickbot through a court order we obtained as well as technical action we\nexecuted in partnership with telecommunications providers around the world. We have now\ncut off key infrastructure so those operating Trickbot will no longer be able to initiate new\ninfections or activate ransomware already dropped into computer systems.\n\n\n-----\n\nIn addition to protecting election infrastructure from ransomware attacks, today s action will\n[protect a wide range of organizations including financial services institutions, government](https://www.fsisac.com/insights/ransomware-today-a-diversified-business-model)\nagencies, healthcare facilities, businesses and universities from the various malware\ninfections Trickbot enabled.\n\n**The Trickbot botnet**\n\nTrickbot has infected over a million computing devices around the world since late 2016.\nWhile the exact identity of the operators is unknown, research suggests they serve both\nnation-states and criminal networks for a variety of objectives.\n\nIn the course of Microsoft’s investigation into Trickbot, we analyzed approximately 61,000\nsamples of Trickbot malware. What makes it so dangerous is that it has modular capabilities\nthat constantly evolve, infecting victims for the operators’ purposes through a “malware-as-aservice” model. Its operators could provide their customers access to infected machines and\noffer them a delivery mechanism for many forms of malware, including ransomware. Beyond\ninfecting end user computers, Trickbot has also infected a number of “Internet of Things”\ndevices, such as routers, which has extended Trickbot’s reach into households and\norganizations.\n\nIn addition to maintaining modular capabilities for a variety of end purposes, the operators\nhave proven adept at changing techniques based on developments in society. Trickbot’s\nspam and spear phishing campaigns used to distribute malware have included topics such\nas Black Lives Matter and COVID-19, enticing people to click on malicious documents or\nlinks. Based on the data we see through Microsoft Office 365 Advanced Threat Detection,\nTrickbot has been the most prolific malware operation using COVID-19 themed lures.\n\n**Disruption components and new legal strategy**\n\nWe took today’s action after the United States District Court for the Eastern District of\nVirginia granted our request for a court order to halt Trickbot’s operations.\n\nDuring the investigation that underpinned our case, we were able to identify operational\ndetails including the infrastructure Trickbot used to communicate with and control victim\ncomputers, the way infected computers talk with each other, and Trickbot’s mechanisms to\nevade detection and attempts to disrupt its operation. As we observed the infected\ncomputers connect to and receive instructions from command and control servers, we were\nable to identify the precise IP addresses of those servers. With this evidence, the court\ngranted approval for Microsoft and our partners to disable the IP addresses, render the\ncontent stored on the command and control servers inaccessible, suspend all services to the\nbotnet operators, and block any effort by the Trickbot operators to purchase or lease\nadditional servers.\n\n\n-----\n\nTo execute this action, Microsoft formed an international group of industry and\ntelecommunications providers. Our Digital Crimes Unit (DCU) led investigation efforts\nincluding detection, analysis, telemetry, and reverse engineering, with additional data and\ninsights to strengthen our legal case from a global network of partners including FSISAC, [ESET,](https://www.eset.com/int/about/newsroom/press-releases/research/eset-takes-part-in-global-operation-to-disrupt-trickbot-a-botnet-that-has-infected-over-a-million-c/) [Lumen’s Black Lotus Labs,](https://blog.lumen.com/a-look-inside-the-trickbot-botnet) [NTT and](https://hello.global.ntt/) [Symantec, a division of Broadcom, in](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/trickbot-botnet-ransomware-disruption)\n[addition to our Microsoft Defender team. Further action to remediate victims will be](https://aka.ms/trickbot-disrupted)\nsupported by internet service providers (ISPs) and computer emergency readiness teams\n(CERTs) around the world.\n\nThis action also represents a new legal approach that our DCU is using for the first time. Our\ncase includes copyright claims against Trickbot’s malicious use of our software code. This\napproach is an important development in our efforts to stop the spread of malware, allowing\nus to take civil action to protect customers in the large number of countries around the world\nthat have these laws in place.\n\nWe fully anticipate Trickbot’s operators will make efforts to revive their operations, and we\nwill work with our partners to monitor their activities and take additional legal and technical\nsteps to stop them.\n\n**Impact to additional sectors**\n\nIn addition to its threat to elections, Trickbot is known for using malware to reach online\nbanking websites and steal funds from people and financial institutions. Financial institutions\nranging from global banks and payments processors to regional credit unions have been\ntargeted by Trickbot. For this reason, the Financial Services Information Sharing and\nAnalysis Center (FS-ISAC) has been a critical partner and a co-plaintiff in our legal action.\n\nWhen someone using a Trickbot-infected computer attempts to log onto a financial\ninstitutions website, Trickbot executes a series of activities to secretly hijack the user’s web\nbrowser, capture the person’s online financial login credentials and other personal\ninformation, and send that information to the criminal operators. People are unaware of\nTrickbot’s activity as the operators have designed it to hide itself. After Trickbot captures\nlogin credentials and personal information, operators use that information to access people’s\nbank accounts. People experience a normal login process and are typically unaware of the\nunderlying surveillance and theft.\n\nTrickbot is also known to deliver the Ryuk crypto-ransomware that has been used in attacks\nagainst a wide range of public and private institutions. Ransomware can have devastating\neffects. Most recently, it crippled the IT network of a German hospital resulting in the death of\na woman seeking emergency treatment. Ryuk is a sophisticated crypto-ransomware\nbecause it identifies and encrypts network files and disables Windows System Restore to\nprevent people from being able to recover from the attack without external backups. Ryuk\nhas been attacking organizations, including municipal governments, state courts, hospitals,\nnursing homes, enterprises and large universities. For example, Ryuk has been attributed to\n\n\n-----\n\nattacks targeting a contractor for the Department of Defense, the North Carolina city of\nDurham, an IT provider for 110 nursing homes, and a number of hospitals during the COVID19 pandemic.\n\n**Election security and guarding against malware**\n\n[As we shared last month in the Microsoft Digital Defense Report, ransomware is on the rise.](https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/)\nFor organizations involved in the elections wanting protection from ransomware and other\n[threats, we offer the threat notification service AccountGuard at no cost which now protects](https://www.microsoftaccountguard.com/en-us/)\nmore than two million email accounts around the world. We’ve completed more than 1,500\nAccountGuard nation-state attack notifications to AccountGuard enrollees to date. We also\noffer [Microsoft 365 for Campaigns, an easy-to-set-up version of Microsoft 365 that comes](https://m365forcampaigns.microsoft.com/en-us/)\nwith intelligent and secure default settings at an affordable price. Finally, Election Security\nAdvisors provide proactive resiliency services and reactive incident response for campaigns\nand election officials, also at an affordable price.\n\nOur Digital Crimes Unit will also continue to engage in operations to protect organizations\ninvolved in the democratic process and our entire customer base. Since 2010, Microsoft,\nthrough the Digital Crimes Unit, has collaborated with law enforcement and other partners on\n23 malware and nation-state domain disruptions, resulting in over 500 million devices\nrescued from cybercriminals. With this civil action, we have leveraged a new legal strategy\nthat allows us to enforce copyright law to prevent Microsoft infrastructure, in this case our\nsoftware code, from being used to commit crime. As copyright law is more common than\ncomputer crime law, this new approach helps us pursue bad actors in more jurisdictions\naround the world.\n\n[To make sure your computer is free of malware, visit support.microsoft.com/botnets.](https://docs.microsoft.com/en-us/windows/security/threat-protection/intelligence/safety-scanner-download)\n\nTags: [cybersecurity,](https://blogs.microsoft.com/on-the-issues/tag/cybersecurity-2/) [Defending Democracy Program,](https://blogs.microsoft.com/on-the-issues/tag/defending-democracy-program/) [ElectionGuard,](https://blogs.microsoft.com/on-the-issues/tag/electionguard/) [ransomware,](https://blogs.microsoft.com/on-the-issues/tag/ransomware/) [trickbot](https://blogs.microsoft.com/on-the-issues/tag/trickbot/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-12 - New action to combat ransomware ahead of U.S. elections.pdf"
    ],
    "report_names": [
        "2020-10-12 - New action to combat ransomware ahead of U.S. elections.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536254,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653689143,
    "ts_modification_date": 1653689143,
    "files": {
        "pdf": "https://archive.orkl.eu/faf495536f05e36f5bc1c3929be406eb65ac13f9.pdf",
        "text": "https://archive.orkl.eu/faf495536f05e36f5bc1c3929be406eb65ac13f9.txt",
        "img": "https://archive.orkl.eu/faf495536f05e36f5bc1c3929be406eb65ac13f9.jpg"
    }
}