{
    "id": "9fc315ed-207e-4591-a619-f6a4fcfad1ed",
    "created_at": "2023-01-12T15:08:29.779637Z",
    "updated_at": "2025-03-27T02:12:36.948023Z",
    "deleted_at": null,
    "sha1_hash": "95c04c04f53c1883000381722937249ff0bf7e06",
    "title": "2021-06-03 - Necro Python bot adds new exploits and Tezos mining to its bag of tricks",
    "authors": "",
    "file_creation_date": "2022-05-28T21:39:59Z",
    "file_modification_date": "2022-05-28T21:39:59Z",
    "file_size": 1415432,
    "plain_text": "# Necro Python bot adds new exploits and Tezos mining to its bag of tricks\n\n**blog.talosintelligence.com/2021/06/necro-python-bot-adds-new-tricks.html**\n\n_By_ _[Vanja Svajcer, with contributions from](https://twitter.com/vanjasvajcer)_ _[Caitlin Huey and](https://twitter.com/hueylittle_er)_ _[Kendall McKay.](https://twitter.com/kkmckay22)_\n\n## News summary\n\nSome malware families stay static in terms of their functionality. But a newly discovered malware campaign utilizing the\nNecro Python bot shows this actor is adding new functionality and improving its chances of infecting vulnerable systems.\nThe bot contains exploits for more than 10 different web applications and the SMB protocol.\n\n\n-----\n\nCisco Talos recently discovered the increased activity of the bot discovered in January 2021 in Cisco Secure Endpoint\nproduct telemetry, although the bot has been in development since 2015, according to its author.\n[This threat demonstrates several techniques of the MITRE ATT&CK framework, most notably Exploit Public-Facing](https://attack.mitre.org/)\n[Application T1190, Scripting - T1064, PowerShell -](https://attack.mitre.org/techniques/T1190/) [T1059.001, Process Injection -](https://attack.mitre.org/techniques/T1059/001/) [T1055, Non-Standard Port - T1571,](https://attack.mitre.org/techniques/T1055/)\n[Remote Access Software - T1219, Input Capture -](https://attack.mitre.org/techniques/T1219/) [T1056, Obfuscated Files or Information -](https://attack.mitre.org/techniques/T1056/) [T1027 and Registry Run](https://attack.mitre.org/techniques/T1027/)\nKeys/Startup Folder - [T1547.001.](https://attack.mitre.org/techniques/T1547/)\n\n**What's new?**\n\nAlthough the bot was originally discovered earlier this year, the latest activity shows numerous changes to the bot, ranging from\ndifferent command and control (C2) communications and the addition of new exploits for spreading, most notably vulnerabilities\nin VMWare vSphere, SCO OpenServer, Vesta Control Panel and SMB-based exploits that were not present in the earlier\niterations of the code.\n\n**How did it work?**\n\nThe infection starts with successful exploitation of a vulnerability in one of the targeted applications or the operating systems.\nThe bot targets Linux-based and Windows operating systems. A Java-based downloader is also used for the initial infection\nstage. The malware uses a combination of a standalone Python interpreter and a malicious script, as well as ELF executables\ncreated with [pyinstaller.](https://www.pyinstaller.org/)\n\nThe bot can connect to a C2 server using IRC and accepts commands related to exploitation, launching distributed denial-ofservice attacks, configuration changes and RAT functionality to download and execute additional code or sniff network traffic to\nexfiltrate the captured data.\n\nThe bot hides its presence on the system by installing a user-mode rootkit designed to hide the malicious process and\nmalicious registry entries created to ensure that the bot runs every time a user logs into the infected system.\n\nA significant part of the code is dedicated to downloading and running a Monero miner XMRig program. The bot also injects the\ncode to download and execute a JavaScript-based miner from an attacker-controlled server into HTML and PHP files on\ninfected systems. If the user opens the infected application, a JavaScript-based Monero miner will run within their browser's\nprocess space.\n\n**So what?**\n\nNecro Python bot shows an actor that follows the latest development in remote command execution exploits on various web\napplications and includes the new exploits into the bot. This increases its chances of spreading and infecting systems. Users\nneed to make sure to regularly apply the latest security updates to all of the applications, not just operating systems.\n\nHere, we are dealing with a self-replicating, polymorphic bot that attempts to exploit server-side software for spreading. The bot\n[is similar to others, like Mirai, in that it targets small and home office (SOHO) routers. However, this bot uses Python to support](https://blog.talosintelligence.com/2017/06/the-internet-of-vulnerable-things.html)\nmultiple platforms, rather than downloading a binary specifically compiled for the targeted system.\n\n## Technical details\n\n**Necro bot history and introduction**\n\n[CheckPoint first documented the Necro Python bot in January this year, and again by Netlab 360 in March. Necro, also known](https://research.checkpoint.com/2021/freakout-leveraging-newest-vulnerabilities-for-creating-a-botnet/)\nas Necromorph and FreakOut, uses IRC for communication with its C2 server and contains functionality to spread by exploiting\nvulnerabilities in applications, operating systems and by brute-forcing passwords over the SSH protocol.\n\nIts main payloads are DDoS attacks, sniffing and exfiltration of network traffic using a SOCKS proxy and installation of\ncryptocurrency mining software XMRig to mine Monero. The mining functionality also injects itself via JavaScript code to\ndownload and launch script-based Monero miner code.\n\n**Visibility in product telemetry**\n\nWhile researching malicious activity in Cisco Secure products, we spotted a somewhat unusual command line executed on\n[several endpoints running Immunet. Based on the path from where the command was executed, it seemed like the parent](https://www.immunet.com/)\n[process was a web application based on the Oracle WebLogic application server.](https://www.oracle.com/middleware/technologies/weblogic.html)\n\n\n-----\n\n_Necro bot download activity on a Windows system._\n\n[The code uses PowerShell functionality to download and run a statically linked standalone distribution of Python with all the](https://github.com/manthey/pyexe/releases/download/v18/py27.exe)\nmodules required to run the next file, setup.py, included.\n\nThe command is slightly different on a Linux system and uses shell commands to download and install the bot and a variant of\nthe XMRig Monero-mining client to participate in a mining pool. The Monero miner is installed by creating a hidden shell script,\n.bootstrap.sh. The script downloads the XMRig client from the Necro download site and moves it into a hidden folder, \".2,\" with\nthe filename \"sshd\" and launches it with the appropriate parameters.\n\n_Necro activity on a Linux system as seen by Cisco Secure Endpoint._\n\nSetup.py is an obfuscated, mildly polymorphic bot that uses several methods to spread.\n\nOnce the code is opened, it's obvious that the strings are obfuscated while the variable, function and class names are randomly\ngenerated. The obfuscation is relatively easy to remove, and we will describe Necro's polymorphic engine in more detail later.\n\n\n-----\n\n_A snippet of obfuscated Necro bot code._\n\nWhen Necro launches, it creates a mutex that prevents it from running multiple instances of the process on an infected system.\nThe mutex name is \"internationalCyberWarefare\", which became \"internationalCyberWarefareV3\" in newer versions.\n\n**Spreading**\n\nNetwork choice\n\nThe bot spreads by randomly generating network ranges for scanning. The locally allocated network ranges starting with\n10,127,169,172,192,233,234 are excluded from the scanning attempts. Scanning begins when the bot is launched, but it can\nalso be executed by receiving a scanning command over IRC from the C2 server.\n\nThe bot contains a hardcoded list of TCP ports to scan. This list can be augmented by an appropriate command from the C2\nserver. The initial port list in the samples we observed was 22, 80, 443, 7001, 8080, 8081 and 8443.\n\nOnce an IP address is generated, the bot will connect to a list of ports and attempt to spread either by using a hardcoded list of\nSSH credentials and issuing a remote command if a login attempt is successful or by exploiting many vulnerabilities in various\napplications and the Windows operating system (over SMB).\n\nExploitation of applications\n\nEarlier versions of Necro exploited the following vulnerabilities in web applications:\n\n[Lifearay - Liferay Portal - Java Unmarshalling via JSONWS RCE](https://nvd.nist.gov/vuln/detail/CVE-2020-7961)\n[Laravel RCE (CVE-2021-3129)](https://nvd.nist.gov/vuln/detail/CVE-2021-3129)\n[WebLogic RCE (CVE-2020-14882)](https://nvd.nist.gov/vuln/detail/CVE-2020-14882)\n[TerraMaster TOS](https://nvd.nist.gov/vuln/detail/CVE-2020-28188)\n[Laminas Project laminas-http before 2.14.2, and Zend Framework 3.0.0: This vulnerability is disputed but it is still](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3DCVE-2021-3007)\nincluded with the bot code in the latest variants.\n\nThe latest variants, observed on May 11 and 18 include additional exploits in its arsenal:\n\nZeroShell 3.9.0 — ['cgi-bin/kerbynet' Remote Root Command Injection](https://nvd.nist.gov/vuln/detail/CVE-2019-12725)\nSCO Openserver 5.0.7 — ['outputform' Command Injection](https://nvd.nist.gov/vuln/detail/CVE-2020-25494)\n[Genexis PLATINUM 4410 2.1 P4410-V2-1.28 — Remote Command Execution vulnerability](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3DCVE-2021-29003)\nVMWare vCenter — [Remote Command Execution vulnerability](https://www.vmware.com/security/advisories/VMSA-2021-0002.html)\nNrdh.php remote code execution exploit for an app we could not find\n\n_Vesta Control Panel command injection is one of the several newly included exploits._\n\n[The version released on May 18 also included Python versions of EternalBlue (CVE-2017-0144) and EternalRomance (CVE-](https://cve.mitre.org/cgi-bin/cvename.cgi?name%3Dcve-2017-0144)\n2017-0147) exploits with a Windows download command line as the payload.\n\n\n-----\n\nThe addition of new exploits shows that the actor is actively developing new methods of spreading and following the latest\nvulnerabilities with published PoCs.\n\nIn the newest instances discovered on May 22, the bot improved its ability to supply credentials for SMB but excluded it from\nthe main exploit function. The usernames and passwords are now in a separate two arrays and extended to include many other\nusernames and passwords. The exploitation function of this sample does not contain EternalBlue and EternalRomance but\nattempts to connect over SMB (port 445) and create a service remotely to download and run the main bot file.\n\nThis latest sample is a pyinstaller-generated sample but is PE file rather than ELF, which was seen previously.\n\nSSH\n\nThe bot contains a list of credentials used when an SSH login is attempted. The SSH connection attempt will only be executed\nif the [Paramiko Python SSH module is previously successfully installed. For that purpose, Necro will attempt to download and](http://www.paramiko.org/)\ninstall a Python module version of pip package manager which is then used to download and install Paramiko.\n\n_A hardcoded list of credentials is used for SSH brute-forcing attacks._\n\nMultiplatform awareness (Linux, Windows, Linux ELF standalone, Java-based downloader)\n\nApart from being aware of Windows and using Windows for spreading (not mining), we found a truly multi-platform Java class\nthat can run on any operating system but checks if it is running on Windows or Linux. The class simply downloads the Necro\nbot from the download server and launches it appropriately, depending on the underlying operating system.\n\n_Necro also has a Java class downloader_\n\n\n-----\n\ny\n\nIf run on Windows, Necro will ensure that the bot is run when a user logs into the system or when the system is restarted by\nsetting the following registry values to point to the pyinstaller created sample or to the python stand-alone executable which is\nused to run the malicious script setup.py.\n```\nHKCU\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\System explore\nHKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run\\System explore\n\n```\nThe filename is \"$6829.exe\", required for the file to be hidden by the rootkit downloaded and installed by the bot. The file's\nattributes are set to hidden.\n\nOn Linux, the bot first changes the DNS resolver configuration to point to Cloudflare DNS servers, 1.0.0.1 and 1.1.1.1,\npotentially to avoid the detection of its activity in the local DNS server logs.\n\nPersistence is ensured by modifying the /etc/rc.local script to include commands to launch the bot when the system is booted.\n\n**Detection avoidance**\n\nThe author of the bot seems to be keen on making it more difficult to detect. It added a polymorphic engine that changes the\nscript code with every iteration and user mode rootkit to hide the presence of malicious files, processes and registry entries.\nThis approach may work well against rudimentary detection methods such as checksum-based detection but fails when faced\n[with modern detection engines and XDR products.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n\nPolymorphic engine\n\nPython has, by default, a built-in module that allows the developer to view the code in a way it would be seen by the interpreter\nbefore it gets compiled to bytecode. The AST module is relatively poorly documented but generates an abstract syntax tree\nobject from the source code that may allow runtime modification of the code, as it is also implemented by Necro's polymorphic\nengine.\n\nThe engine uses the AST module to find all variables, all function definitions and class definitions and builds a list of names for\neach type of object in the syntax tree. The engine also implements a class which gets called when AST nodes are visited. Its\ntask is to find ascii strings and obfuscate the strings using a simple xor operation. Once obfuscated the strings are converted\nfirst compressed using zlib and then converted into escaped strings, which can be later easily decoded in Python.\n\n\n-----\n\n_Unobfuscated polymorphic engine._\n\nHere, we see the polymorphic engine as reversed, with meaningful variable names and in the second screenshot we see the\nsame engine after it is obfuscated and randomized. This obfuscation method may fool simple checksum-based detection\nmethods but there is still enough static code and some issues with the engine itself that allow for easy detection using simple\npattern matching.\n\n_Identical snippet (as above) of the polymorphic engine after obfuscation._\n\nThe polymorphic engine is run every time the Necro bot is started. It reads its own file and morphs it to create a new variant.\nThe engine can also be invoked from the C2 server.\nA variant of r77 rootkit\n\nIf the infected operating system is Windows, the bot will generate reflective DLL loading shellcode, enumerate all running\n[processes and inject a user mode rootkit DLL based on a variant of r77 rootkit allegedly put together by the Necro bot author.](https://github.com/freakanonymous/r6829/blob/master/r77-src/main.cpp)\n\nThe rootkit first checks for the presence of packet capturing DLLs in memory to detect potential analysis environments and quit\nexecution. Otherwise, the rootkit uses the Hacker disassembler engine to place hooks for the following ntdll.dll functions:\n\nNtUserQueryWindow — Prevent hidden process window enumeration\nNtUserGetForegroundWindow — Prevent hidden process window enumeration, same as the previous hook\nNtOpenProcess — Deny access to the hidden process by process handle\nNtQuerySystemInformation — Prevent process enumeration and hidden process handles access\nNtQueryDirectoryFile — Hide process module on disk\nNtEnumerateValueKey — Hide registry values protected by the rootkit\nNtDeleteValueKey — Prevent deletion of registry values protected by the rootkit\n\nThe default string in the rootkit source code for matching the process, file and registry value names for hiding is \"$6829\", and\nthis is not changed in the binary versions of the rootkit DLL used by Necro.\n\n**Mining**\n\nXmrig\n\nApart from conducting DDoS attacks, the main function of the bot is to install cryptocurrency mining software in order to mine\nMonero cryptocurrency. This is done either by installing a variant of XMRig miner or by injecting JavaScript code to download a\nJavaScript-based miner into script-based files.\n\nThe address used as a username for supportxmr.com mining pool is\n45iHeQwQaunWXryL9YZ2egJxKvWBtWQUE4PKitu1VwYNUqkhHt6nyCTQb2dbvDRqDPXveNq94DG9uTndKcWLYNoG2uonhgH,\nwhich has also been used by some other malware samples, developed predominantly using AutoIt compiled scripts submitted\nto VirusTotal throughout 2020.\n\n\n-----\n\nThe functionality to download XMRig and infect files is only available for Linux based infected systems and not on Windows.\n\nInfecting script files\n\nIf the operating system is not Windows, Necro will traverse the file system to find any files with .htm, .html, .php or .js\nextensions and add code to download and run a miner loader from an attacker-controlled host.\n\n_Necro attempts to inject its code into .htm, .html, .js and .php files._\n\nThe injected code is randomized and the loaded script is heavily obfuscated. Once deobfuscated, the strings reveal the final\nlocation of the mining payload, which is\n\nhxxps://cloud-miner[.]de/tkefrep/tkefrep[.]js?tkefrep=bs?nosaj=faster.xmr2. The attacker-controlled server hosting the miner\nloader as well as C2 for the Javascript portion of the bot on hxxps://ublock-referer[.]dev/. This server also hosts the main loader\ncampaign.js, referenced in the infection code.\n\n_Necro injects randomized code to be served by infected server web serving apps._\n\nApart from installing miner code, the JavaScript-based bot contains additional functionality to accept commands from the C2\nserver and it may be used to steal data from the clipboard, by logging keystrokes and launching DoS attacks on the target\nspecified by the C2 server.\n\n**Necro bot commands and functionality**\n\nCommunication servers\n\nThe bot uses different servers for different functionality, most of the servers are accessed through TOR proxies, apart from the\nfirst download and install server.\n\nThe other servers are used for IRC C2 communication, for configuration purposes and for exfiltration of data collected by the\nTCP sniffer that sniffs traffic proxied through the bot's SOCKS5 proxy.\n\n\n-----\n\n_DNS request activity for the Necro download server bp65pce2vsk7wpvy2fyehel25ovw4v7nve3lknwzta7gtiuy6jm7l4yd.onion.ws_\n_as seen on Cisco Umbrella._\nDDoS\n\nThe bot will accept the following DDoS related commands and attempt to launch a DoS attack against the target specified by\nthe bot master:\n\nUdpflood — Launch UDP flood-based attack\nSynflood — Launch syn packet-based flooding attack\nTcpflood — Launch attack using TCP for flooding the target\nSlowloris — Launch a Slow loris attack\nHttpflood — Launch a HTTP flooder using randomly chosen user-agent string from a hardcoded list\nLoadamp — Download content for reflection in amplification attacks\nReflect — Launch amplification attack using DNS, NTP, SNMP or SSDP reflection\n\nSome earlier Necro variants contained slightly different syntax for commands used in IRC communications.\n\nSniffer command\n\nThe bot contains a sniffer that uses the socks module to proxy the captured traffic to the exfiltration data server. The sniffer\ncaptures the IP version, protocol, source and destination addresses, source and destination ports and the packet payload data.\nThe command for pausing and resuming sniffing is:\n\nSniffer (resume) — If the command contains the parameter resume, then resume sniffing, otherwise, pause.\n\nExploitation commands\n\nThe exploitation commands are primarily used for spreading the bot when it's executed without any parameters. The spreading\ncommand can also be sent from the C2 server:\n\nScanner — Start or stop network scanning\nScannetrange — Supply a network as a parameter and used the parameter as a scan range for exploitation\nScanstats — Send information about the number of scanned and successfully infected endpoints\nClearscan — Clear the status data for the bot\n\nBackdoor commands\n\nThe bot also contains functionality to execute the following remote access trojan (RAT)-related commands:\n\nRevshell — Launch a reverse shell and connect it to the listener set up by the attacker on Linux-based operating systems\nShell — Launch a process using process.popen() function\nDownload — Download a file from a supplied URL\nExecute — First, download, then execute, the downloaded file\nUpdate — Update with a new bot version\nVisit — Visit a supplied URL\nDlexe — Download and execute a file\nKillbypid — Terminate a process with a supplied process ID\n\nConfiguration commands\n\n\n-----\n\nConfiguration commands are targeted to change the configuration of the bot such as changing the list of ports used in scanning\nfor vulnerable systems:\n\nAddport — Add a TCP port to the list of ports to connect to\nDelport — Remove a TCP port from the list of ports to connect to\nKillknight — Terminate the bot process\nDisable — Disable the exploitation module\nEnable — Enable the exploitation module\nGetip — Get external IP address for the bot\nRam — Get the RAM capacity of the infected system\nInfo — Get information about the infected system\nRepack — Call the polymorphic engine to morph the bot script file\n\nAdditional activity observed earlier - Tezos mining and installing ransomware\n\nApart from its usual activity of mining for Monero, we have also observed in our honeypots attempts to mine Tezos, while\ninstalling a Linux based variant. This variant also used a different download server, which has not been used previously\ncan6dodp[.]servepics[.]com.\n\n_Tezos (XTZ) mining was observed in Talos honeypots._\n\nIn a few samples we observed in our honeypot telemetry, after the mining payload is downloaded and executed using bash, we\nidentified mining commands that referenced a Tezos (XTZ) wallet, tz1NfDViBuZwi31WHwmJ4PtSsVtNX2yLnhG7. While this\nactivity was minimal and occurred in a very short timeframe starting on May 9, it represents a newer update to the botnet's\nmining capabilities.\n\nOn February 4, 2021, Talos observed PowerShell download activity in our endpoint telemetry from\nhxxp[:]//193[.]239[.]147[.]224/crytp.exe. Once downloaded, the AutoIT compiled executable file crytp.exe makes HTTP GET\nrequests to several other URLs as it attempts to download additional malware onto the compromised machine. The download\nURLs host two DLL rootkit files, x86.dll and x64.dll as well as two executables, bigRANSOM.exe and x64i.exe.\n\nbigRANSOM.exe is another AutoIT based file and it may have been an attempt of the Necro actor to distribute ransomware.\nThe ransomware was possibly developed by the actor or a member of the group. AutoIT has been used as one of the main\ntools in creation of miners using the same wallet address as the Python based Necro bot. Although we have seen an attempt to\ndistribute ransomware only once, this example points to an actor constantly experimenting with new payloads.\n\n## Summary\n\n\n-----\n\n_High level overview of the Necro bot and its functionality._\n\nThe bot's activity has increased at the beginning of May with additional exploits added to its arsenal. The core functionality\nremained the same, with IRC used for communication with the C2 server and commands designed for launching DDoS,\nbackdoor commands and commands for stealing and exfiltrating data.\n\nThe actors' main focus is Monero mining, which is executed by installing a variant of XMRig and by injecting code into HTML\nand script files to include a JavaScript miner and additional bot functionality for controlling and stealing information from\nparticipating browsers.\n\nNecro bot shows an actor that follows the latest development in remote command execution exploits on various web\napplications and includes the new exploits into the bot. This increases its chances of spreading and affecting systems. Users\nneed to make sure to regularly apply the latest security updates to all of the applications, not just operating systems and\nmonitor logs for signs of infection.\n\nCoverage\n\nWays our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Cisco Secure Endpoint is ideally suited to prevent the execution of the malware detailed in this post. New users can try Cisco](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium%3Dweb-referral%26utm_source%3Dcisco%26utm_campaign%3Damp-free-trial%26utm_term%3Dpgm-talos-trial%26utm_content%3Damp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and detects malware used in these attacks.](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\n\n[Cisco Secure Firewall and](https://www.cisco.com/c/en/us/products/security/firewalls/index.html) [Meraki MX can detect malicious activity associated with this threat.](https://meraki.cisco.com/products/appliances)\n\n[Cisco Secure Malware Analytics helps identify malicious binaries and build protection into all Cisco Security products.](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\n\n[Cisco Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs, and URLs,](https://umbrella.cisco.com/)\nwhether users are on or off the corporate network.\n\nAdditional protections with context to your specific environment and threat data are available from the Cisco Secure Firewall\nManagement Center.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available for\n[purchase on Snort.org.](https://www.snort.org/products)\n\nThe following SIDs have been released to detect this threat: 57693-57717.\n\nThe following ClamAV signatures have been released to detect this threat as well as tools and malware related to these\ncampaigns:\n\nPy.Trojan.NecroBot-9868091-0\nHtml.Trojan.NecroBot-9868092-1\nJs.Trojan.NecroBot-9868093-0\nJava.Trojan.NecroBot-9868094-0\nWin.Trojan.NecroBot-9868095-0\nWin.Trojan.NecroBot-9868096-0\nUnix.Trojan.NecroBot-9868097-0\nUnix.Trojan.NecroBot-9868098-0\nUnix.Trojan.NecroBot-9868099-0\nWin.Trojan.NecroBot-9868100-0\nWin.Trojan.NecroBot-9868102-0\n\n[Cisco Secure Endpoint (AMP) users can use Orbital Advanced Search to run complex OSqueries to see if their endpoints are](https://orbital.amp.cisco.com/help/%23:~:text%3DCisco%2520Orbital%2520(%25E2%2580%259COrbital%25E2%2580%259D),(Creators%2520Update)%2520or%2520later.)\n[infected with this specific threat. For specific OSqueries on this threat, click here and](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_necro_mutex.yaml) [here.](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/malware_necro_registry_key.yaml)\n\n## IOCs\n\nMutexes\n\n\n-----\n\ninternationalCyberWarefareV3\ninternationalCyberWarefare\nExfiltration server\n\no4hlcckwlbcy7qhhohqswpqla6wx7c5xmsvk3k4rohknng4nofvgz5id[.]onion - port 5870 and 587\nConfiguration server\n\np2l44qilgm433bad5gbszb4mluxuejwkjaaon767m5dzuuc7mjqhcead[.]onion - port 42066\nq2p4b6pprex5mvzxm2xdqgo4q3hy2p4if2ljq7fcoavxvab7mpk232id[.]onion - port 52566\nC2\n\n3og7wipgh3ruavi7gd6y3uzhcurazasln55hb6hboiavyk6pugkcdpqd[.]onion - port 6697\nDownloadServer\n\nbp65pce2vsk7wpvy2fyehel25ovw4v7nve3lknwzta7gtiuy6jm7l4yd[.]onion[.]ws\n\ncan6dodp[.]servepics[.]com\n\nJavaScript related servers\n\nublock-referer[.]dev - Javascript bot loader and C2 for Javascript related functionality\nhxxps://cloud-miner[.]de/tkefrep/tkefrep[.]js?tkefrep=bs?nosaj=faster.xmr2 - URL for (legitimate) Javascript based miner\nMining pool details\n\npool[.]supportxmr[.]com 45iHeQwQaunWXryL9YZ2egJxKvWBtWQUE4PKitu1VwYNUqkhHt6nyCTQb2dbvDRqDPXveNq94DG9uTndKcWLYNoG2uonhgH\n\nrx[.]unmineable[.]com - XTZ:tz1NfDViBuZwi31WHwmJ4PtSsVtNX2yLnhG7\n\nURLs\n\nhxxp[:]//can6dodp[.]servepics[.]com/setup.py\nhxxp[:]//can6dodp[.]servepics[.]com/setup\nhxxp[:]//can6dodp[.]servepics[.]com/py.exe\nhxxp[:]//can6dodp[.]servepics[.]com/xmrig\nhxxp[:]//can6dodp[.]servepics[.]com/xmrig1\nhxxp[:]//ngiwge486ln9daoo[.]hopto[.]org/setup.py\nhxxp[:]//ngiwge486ln9daoo[.]hopto[.]org/py.exe\nhxxp[:]//bp65pce2vsk7wpvy2fyehel25ovw4v7nve3lknwzta7gtiuy6jm7l4yd[.]onion[.]ws/setup.py\nhxxp[:]//bp65pce2vsk7wpvy2fyehel25ovw4v7nve3lknwzta7gtiuy6jm7l4yd[.]onion[.]ws/py.exe\n\nSamples\n\nc3fe8058ab46bd21d22f920960caae1f3b22a7aeba8d5315fb62461f4e989a7d - May 18 setup.py\n8797ce228b32d890773d5dbac71cefa505b788cc8b25929be9832db422d8239b - May 11 setup.py\nbc2126c03f2242013f58b43eb91351fba15d300385252423c52a5b18ece6a54f - setup.py\n97ab2092f6b5b1986536a5ba45e487f19c97f52544ff494d43bb1baf31248924 - setup.py\nc3fe8058ab46bd21d22f920960caae1f3b22a7aeba8d5315fb62461f4e989a7d - setup.py\n8130717a3d4053e2924a0393086511a41fc7777c045b45bb4f569bcbe69af8be - setup.py\nd65e874b247dda9845661734d9e74b921f700983fd46c3626a3197f08a3006bf - setup.py\n19c25ce4302050aec3c921dd5cac546e8200a7e951d570b52fe344c421105ea8 - PE pyinstaller, May 22\n606258f10519be325c39900504e50d79e551c7a9399efb9b22a7323da3f6aa7a - PE pyinstaller\n2b77b93b8e1b8ef8650957d15aaf336cf70a7df184da060f86b9892c54eefb65 - ELF pyinstaller\neb8b08e13aba16bd5f0d7c330493be82941210d3a6aa4856858df770f77b747d - ELF pyinstaller\n80659cc37cb7fb831866f7d7b0043edc6918a99590bd9122815e18abb68daa35 - ELF Pyinstaller\n19269ce9a0a44aca9d6b2deed7de71cf576ac611787c2af46819ca2aff44ce2a - 64 bit rootkit DLL\na8bb386fa3a6791e72f5ec6f1dc26359b00d0ee8cb0ce866f452b7fff6dbb319 - x86 rootkit DLL\nd58c3694832812bc168834e2b8b3bfcb92f85a9d4523140ad010497baabc2c3d - Java class downloader\ne884bd4015d1b97227074bcf6cb9e8134b7afcfb6a3db758ca4654088403430a - campaign.js loader\nd6403b9c069f08939fc2f9669dc7d5165ed66a1cae07788c3b27fffb30e890a0 - injected/infected HTML file\n9d6171cf28b5a3572587140ef483739a185895ce2b5af3246a78c2c39beed7b8 - earlier ransomware downloader\nLegitimate files\n\n9ac075ee8e97c06feaa2e9e46e9e27bfbf69337fb3be9fd3f9478be0e06a6db5 - legitimate JavaScript miner downloaded by the\nNecro JavaScript component\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-03 - Necro Python bot adds new exploits and Tezos mining to its bag of tricks.pdf"
    ],
    "report_names": [
        "2021-06-03 - Necro Python bot adds new exploits and Tezos mining to its bag of tricks.pdf"
    ],
    "threat_actors": [
        {
            "id": "33f527a5-a5da-496a-a48c-7807cc858c3e",
            "created_at": "2022-10-25T15:50:23.803657Z",
            "updated_at": "2025-03-27T02:00:55.550132Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "PLATINUM"
            ],
            "source_name": "MITRE:PLATINUM",
            "tools": [
                "JPIN",
                "Dipsind",
                "adbupd"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7d8ef10e-1d7b-49a0-ab6e-f1dae465a1a4",
            "created_at": "2023-01-06T13:46:38.595679Z",
            "updated_at": "2025-03-27T02:00:02.869216Z",
            "deleted_at": null,
            "main_name": "PLATINUM",
            "aliases": [
                "TwoForOne",
                "G0068",
                "ATK33"
            ],
            "source_name": "MISPGALAXY:PLATINUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e61c46f7-88a1-421a-9fed-0cfe2eeb820a",
            "created_at": "2022-10-25T16:07:24.061767Z",
            "updated_at": "2025-03-27T02:02:10.094583Z",
            "deleted_at": null,
            "main_name": "Platinum",
            "aliases": [
                "ATK 33",
                "Operation EasternRoppels",
                "TwoForOne"
            ],
            "source_name": "ETDA:Platinum",
            "tools": [
                "AMTsol",
                "Adupib",
                "Adupihan",
                "Dipsind",
                "DvDupdate.dll",
                "JPIN",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "RedPepper",
                "RedSalt",
                "Titanium",
                "adbupd",
                "psinstrc.ps1"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536109,
    "ts_updated_at": 1743041556,
    "ts_creation_date": 1653773999,
    "ts_modification_date": 1653773999,
    "files": {
        "pdf": "https://archive.orkl.eu/95c04c04f53c1883000381722937249ff0bf7e06.pdf",
        "text": "https://archive.orkl.eu/95c04c04f53c1883000381722937249ff0bf7e06.txt",
        "img": "https://archive.orkl.eu/95c04c04f53c1883000381722937249ff0bf7e06.jpg"
    }
}