{
    "id": "a06d62cb-851d-4489-af55-811e25e151df",
    "created_at": "2023-01-12T15:06:23.592439Z",
    "updated_at": "2025-03-27T02:09:51.014255Z",
    "deleted_at": null,
    "sha1_hash": "1216826365bf9646a6e7e9da3d141d44118af4cf",
    "title": "2017-03-11 - Wikileaks Vault7 JQJSNICKER code leak",
    "authors": "",
    "file_creation_date": "2022-05-28T15:27:21Z",
    "file_modification_date": "2022-05-28T15:27:21Z",
    "file_size": 350420,
    "plain_text": "# Wikileaks Vault7 JQJSNICKER code leak\n\n**marcmaiffret.com/vault7/**\n\n**This is high level and quick analysis to get the ball rolling as there did not seem to be anything public on this binary leak. I**\n**wanted to note a few things so that malware researchers could follow-up. Please feel free to email me corrections and**\n**additions to Marc at the name of this website.com. Twitter updates happen here:** **[https://twitter.com/marcmaiffret](https://twitter.com/marcmaiffret)**\n\n[https://wikileaks.org/ciav7p1/cms/page_41123853.html](https://wikileaks.org/ciav7p1/cms/page_41123853.html)\n\nWikileaks decided to redact all binaries that were part of the CIA leak. There seems to be two binaries however that they either decided\nto not redact or simply made a mistake.\n\nThe first is win32-srv8.zabbix-tech.com.exe which was just simply left for\n[download. https://wikileaks.org/ciav7p1/cms/page_34308128.html This has been referenced in a few places online and I assume](https://wikileaks.org/ciav7p1/cms/page_34308128.html)\nanalyzed by someone somewhere.\n\nThe one I wanted to make a quick note about was in relation to JQJSNICKER\n[(https://wikileaks.org/ciav7p1/cms/page_41123853.html). Wikileaks redacted all binaries on this page by replacing them with a PDF that](https://wikileaks.org/ciav7p1/cms/page_41123853.html)\nmentions the files are still being examined.\n\nThey did however allow the downloading of the file installer.reg. This is a Windows Registry key file that when imported on a system will\ncreate a scheduled task within Windows. After cleaning up the .reg file by replacing # characters with nothing you will then have a key\nvalue Data variable and within that is a base64 encoded DLL executable.\n\nThis decodes to a dll which had been named installer.dll. This is a .NET application that you can decompile in any .NET decompiler\nsuch as Jetbrains dotPeek. The authors did try for some mild .NET code obfuscation by using Redgate's .NET obfuscator\nSmartAssembly.\n\nThe Installer.dll itself has some interesting functionality, including launching a PowerShell command with executionPolicy unrestricted.\n\n\n-----\n\nWhat is more interesting is another encoded .NET DLL within the resources section of Installer.dll. This is also Base64 encoded and\ndecodes to a file Core.dll.\n\nCore.dll appears to be a command and control, or more so, command and execute program. It should be noted that there are\ncharacteristics of this program that fit with implant design recommendations that are documented throughout the Vault7 leaks.\n\nOne notable aspect of Core.dll is it referenced urls at the website notepad.cc.\n\n\n-----\n\nNotepad.cc was a public website like pastebin where people could anonymously post content to later be referenced via static urls. I am\nposting this quick so more time is needed to investigate exactly how those urls are leveraged. It should be noted that the developer of\nNotepad.cc shut down the website in December 2015.\n\nAnother aspect of the call back mechanism is that it appears to have a typo in the user agent header which could be used from a\nsignature perspective.\n\n\n-----\n\nThe UserAgent variable is missing the closing ). It is also worth noting they used a touch enabled device user agent string as signified\n[by the Touch at the end. It is possible they copy and pasted from the touch screen Dell laptops in their labs? :-o](https://wikileaks.org/ciav7p1/cms/page_14587529.html)\n\nThere is more in these binaries but I wanted to get something up quick so that the much better full time malware reverse engineers can\nhave a look.\n\nLastly, it should be noted that when I first uploaded these binaries to Virus Total the detection was 2/59 for the Installer.dll and 1/60 for\nthe Core.dll.\n\n\n-----\n\nWhat is interesting is that Kaspersky was one of the only scanners to have detection so far. This makes sense as it is my understanding\nthat Kaspersky has an internal report on this malware in which they point out this possible Wikileaks binary mistake that I am\ndocumenting here. Not sure that they have made that public yet but did not see anything on their blog at time of writing. Note the\nreason that ZoneAlarm is detecting this also is because they license Kaspersky's engine. It is also interesting to note that Kaspersky, at\nthe time this was written, was not detecting Core.dll (embedded within Installer.dll). I am not sure if that is because they did not see that\nin their analysis or signature updates had just not hit Virus Total yet.\n\n\n-----\n\nThe code has mechanisms to clean itself from a system. There are however artifacts that could possibly be left on accident and or on a\nsystem that never had a cleanup initialized. One of those examples is a registry key that seems unique to this malware:\n\nSOFTWARE\\Microsoft\\DRM\\{cd704ff3-cd05-479e-acf7-6474908031dd}\n\n[You can download the reg file and binaries from here. The password is JQJSNICKER.](https://marcmaiffret.com/vault7/JQJSNICKER.zip)\n\nI will post updates of any additions or corrections that people might send but really my goal is to make sure malware researchers are\nchecking this out and putting out further public analysis.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-11 - Wikileaks Vault7 JQJSNICKER code leak.pdf"
    ],
    "report_names": [
        "2017-03-11 - Wikileaks Vault7 JQJSNICKER code leak.pdf"
    ],
    "threat_actors": [
        {
            "id": "23dfc9f5-1862-4510-a6ae-53d8e51f17b1",
            "created_at": "2024-05-01T02:03:08.146025Z",
            "updated_at": "2025-03-27T02:05:17.420497Z",
            "deleted_at": null,
            "main_name": "PLATINUM TERMINAL",
            "aliases": [
                "Longhorn ",
                "The Lamberts ",
                "Vault7 ",
                "APT-C-39 "
            ],
            "source_name": "Secureworks:PLATINUM TERMINAL",
            "tools": [
                " Assassin",
                " Marble Framework",
                "AfterMidnight"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673535983,
    "ts_updated_at": 1743041391,
    "ts_creation_date": 1653751641,
    "ts_modification_date": 1653751641,
    "files": {
        "pdf": "https://archive.orkl.eu/1216826365bf9646a6e7e9da3d141d44118af4cf.pdf",
        "text": "https://archive.orkl.eu/1216826365bf9646a6e7e9da3d141d44118af4cf.txt",
        "img": "https://archive.orkl.eu/1216826365bf9646a6e7e9da3d141d44118af4cf.jpg"
    }
}