{
    "id": "a0eb0fae-ba48-4410-9d7b-250ff2351f04",
    "created_at": "2023-01-12T15:01:05.697993Z",
    "updated_at": "2025-03-27T02:12:37.811443Z",
    "deleted_at": null,
    "sha1_hash": "b6490e7c2c71c0d75e8063ceaf166a0293fe4331",
    "title": "2021-09-29 - TA544 Targets Italian Organizations with Ursnif Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T05:10:53Z",
    "file_modification_date": "2022-05-28T05:10:53Z",
    "file_size": 369874,
    "plain_text": "# Security Brief: TA544 Targets Italian Organizations with Ursnif Malware\n\n**[proofpoint.com/us/blog/security-briefs/ta544-targets-italian-organizations-ursnif-malware](https://www.proofpoint.com/us/blog/security-briefs/ta544-targets-italian-organizations-ursnif-malware)**\n\nSeptember 28, 2021\n\n\n-----\n\n[Blog](https://www.proofpoint.com/us/blog)\n[Threat Insight](https://www.proofpoint.com/us/blog/threat-insight)\nSecurity Brief: TA544 Targets Italian Organizations with Ursnif Malware\n\n\n-----\n\nSeptember 29, 2021 Selena Larson and Proofpoint Staff\n\nProofpoint threat researchers identified an increase in targeted threats impacting Italian\norganizations in 2021. This spike in observed threats is largely driven by a group called\nTA544 leveraging the Ursnif banking trojan. Proofpoint has observed nearly 20 notable\ncampaigns distributing hundreds of thousands of messages targeting organizations in Italy\nso far this year, which equals 80% of the total number of similar campaigns in the entirety of\n2020. As many as 2,000 organizations were targeted in each of the Italian-language\ncampaigns.\n\n[TA544 is a cybercriminal threat actor that distributes banking malware and other payloads in](https://www.proofpoint.com/us/threat-insight/post/threat-actor-profile-ta544-targets-geographies-italy-japan-range-malware)\nvarious geographic regions including Italy and Japan. Proofpoint has tracked this actor since\n2017. Typically, this group varies its payloads which appear to be targeted by region – for\nexample, in 2021, all TA544 Ursnif campaigns have specifically targeted Italian organizations\nwhile Dridex payloads associated with this threat actor do not have specific geographic\ntargeting.\n\nUrsnif is a trojan that can be used to steal data from websites, with the help of web\ninjections, proxies and VNC connections; steal data such as stored passwords; and\ndownload updates, modules, or other malware. Although this malware is used by multiple\ncybercriminal threat actors, TA544’s activity targeting Italy differentiates it from other actors.\nBetween January and August 2021, the number of observed Ursnif campaigns impacting\nItalian organizations surpassed the total number of observed Ursnif campaigns targeting this\nregion in all of 2020.\n\n**Campaign Details**\n\nIn recently observed campaigns, TA544 purports to be Italian courier or energy organizations\nsoliciting payments from the targeted individual.\n\n\n-----\n\n_Figure 1: Phishing email masquerading as logistics/courier service BRT._\n\nAttached to the emails are malicious Microsoft Office documents containing macros. If the\nmacros are enabled, the document will download Ursnif malware.\n\n\n-----\n\n_Figure 2: Malicious Excel document distributing Ursnif._\n\nIn the observed campaigns, TA544 often uses geofencing techniques to detect whether\nrecipients are in targeted geographic regions before infecting them with the malware. For\nexample, in recent campaigns, the document macro generates and executes an Excel 4\nmacro written in Italian, and the malware conducts location checks on the server side via IP\naddress. If the user was not in the target area, the malware command and control would\nredirect to an adult website. So far in 2021, Proofpoint has observed nearly half a million\nmessages associated with this threat targeting Italian organizations.\n\nAccording to Proofpoint data, Ursnif is currently the most frequently observed malware\ntargeting Italian organizations based on campaign data. Earlier this year, Proofpoint\nresearchers observed multiple Emotet campaigns targeting the region as well – however,\n[following the disruption of the Emotet botnet in January 2021, all Emotet activity has](https://www.justice.gov/opa/pr/emotet-botnet-disrupted-international-cyber-operation)\ndisappeared and this malware is no longer an ongoing threat. Credential phishing is also a\nfrequently observed threat targeting Italian organizations, and threat actors have attempted\nto steal credentials relating to logistics or banking services, for example.\n\n**Web Injects**\n\nRecent TA544 Ursnif campaigns included activity that targeted multiple sites with web injects\nand redirections once the Ursnif payload was installed on the target machine. Web injects\nrefer to malicious code injected to a user’s web browser that attempts to steal data from\ncertain targeted websites. The list included dozens of targeted sites. For example, the list of\nimpacted sites includes login portals related to:\n\n\n-----\n\nUniCredit Group\nAgenziabpb\nING\nBNL\nEbay\nAmazon\nPaypal\nBanca Sella\nCheBanca!\nIBK\n\nThe identified web injects are designed to steal credentials from a wide variety of sites and\nservices likely to be used by Italian users. Although Ursnif has previously leveraged web\ninject capability to infect targeted users. This indicates TA544 is not interested exclusively in\nobtaining banking credentials, but also usernames and passwords affiliated with websites\nassociated with major retailers.\n\n**Conclusion**\n\nToday’s threats – like TA544’s campaigns targeting Italian organizations – target people, not\ninfrastructure. That’s why you must take a people-centric approach to cybersecurity. That\nincludes user-level visibility into vulnerability, attacks and privilege and tailored controls that\naccount for individual user risk.\n\nHere’s what we recommend as a starting point.\n\nTrain users to spot and report malicious email. Regular training and simulated attacks\ncan stop many attacks and help identify people who are especially vulnerable. The best\nsimulations mimic real-world attack techniques. Look for solutions that tie into realworld attack trends and the latest threat intelligence.\nThreat actors frequently distribute documents that require macros to be enabled to\ndeploy the malicious payload. Ensure macros are disabled for all employees and\ninclude macro-laden attack simulations in security training demonstrations.\nAt the same time, assume that users will eventually click some threats. Attackers will\nalways find new ways to exploit human nature. Find a solution that spots and blocks\ninbound email threats targeting employees before they reach the inbox. Invest in a\nsolution can manage the entire spectrum of email threats, not just malware-based\nthreats. Some threats—including business email compromise (BEC) and other forms of\nemail fraud—can be hard to detect with conventional security tools. Your solution\nshould analyze both external and internal email—attackers may use compromised\naccounts to trick users within the same organization. Web isolation can be a critical\nsafeguard for unknows and risky URLs.\n\nSubscribe to the Proofpoint Blog\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-09-29 - TA544 Targets Italian Organizations with Ursnif Malware.pdf"
    ],
    "report_names": [
        "2021-09-29 - TA544 Targets Italian Organizations with Ursnif Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "c91f7778-69aa-45fa-be0e-4ee33daf8fbd",
            "created_at": "2023-01-06T13:46:39.110148Z",
            "updated_at": "2025-03-27T02:00:02.998873Z",
            "deleted_at": null,
            "main_name": "NARWHAL SPIDER",
            "aliases": [
                "GOLD ESSEX",
                "TA544"
            ],
            "source_name": "MISPGALAXY:NARWHAL SPIDER",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1f679d2e-c5c9-49e9-b854-2eca06a870e4",
            "created_at": "2022-10-25T16:07:24.453427Z",
            "updated_at": "2025-03-27T02:02:10.237233Z",
            "deleted_at": null,
            "main_name": "Bamboo Spider",
            "aliases": [
                "Bamboo Spider",
                "TA544"
            ],
            "source_name": "ETDA:Bamboo Spider",
            "tools": [
                "AndroKINS",
                "Bebloh",
                "Chthonic",
                "DELoader",
                "Dofoil",
                "GozNym",
                "Gozi ISFB",
                "ISFB",
                "Nymaim",
                "PandaBanker",
                "Pandemyia",
                "Sharik",
                "Shiotob",
                "Smoke Loader",
                "SmokeLoader",
                "Terdot",
                "URLZone",
                "XSphinx",
                "ZLoader",
                "Zeus OpenSSL",
                "Zeus Panda",
                "Zeus Sphinx",
                "ZeusPanda",
                "nymain"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535665,
    "ts_updated_at": 1743041557,
    "ts_creation_date": 1653714653,
    "ts_modification_date": 1653714653,
    "files": {
        "pdf": "https://archive.orkl.eu/b6490e7c2c71c0d75e8063ceaf166a0293fe4331.pdf",
        "text": "https://archive.orkl.eu/b6490e7c2c71c0d75e8063ceaf166a0293fe4331.txt",
        "img": "https://archive.orkl.eu/b6490e7c2c71c0d75e8063ceaf166a0293fe4331.jpg"
    }
}