{
    "id": "a0fae3bc-3b54-4233-8b58-4e2dcfc2143a",
    "created_at": "2023-01-12T14:59:46.378241Z",
    "updated_at": "2025-03-27T02:16:25.873573Z",
    "deleted_at": null,
    "sha1_hash": "eea25096a5fc187764e59990c71bcfc2c3a7fe78",
    "title": "2020-09-29 - Cerberus and Alien- the malware that has put Android in a tight spot",
    "authors": "",
    "file_creation_date": "2022-05-28T02:16:58Z",
    "file_modification_date": "2022-05-28T02:16:58Z",
    "file_size": 717527,
    "plain_text": "# Cerberus and Alien: the malware that has put Android in a tight spot\n\n**[preyproject.com/blog/en/cerberus-and-alien-the-malware-that-has-put-android-in-a-tight-spot/](https://preyproject.com/blog/en/cerberus-and-alien-the-malware-that-has-put-android-in-a-tight-spot/)**\n\nSeptember 29, 2020\n\n2020 is the year of the rat, and we actually aren’t talking about the Chinese horoscope.\n[According to several cybersecurity researchers, 2020 has seen an explosive increase in](https://www.threatfabric.com/blogs/2020_year_of_the_rat.html)\nRemote access Trojans, or “RATs”.\n\nThis threat is not minor: a RAT can take control of your computer in the same way that a\nremote administrator would normally do, using tools such as TeamViewer or VNC. In this\ncase, it’s a malicious control: a RAT steals your personal information trying to carry out bank\nor identity fraud.\n\nHowever, and with the migration of PC users to the mobile world, hackers changed their\nstrategy. Now there is a whole series of malware focused on bank credentials and identity\ntheft, especially designed for Android mobile devices. These RATs have reached a high level\nof sophistication, and most are offered in the form of “malware as a service”, or MaaS.\n\n\n-----\n\nBetween 2019 and 2020 these attacks have become increasingly common. Names like\nAnubis, Hydra, Ginp, or Gustuff appear on all mobile malware lists on a recurring basis.\nHowever, the one that has dominated the arena this year –for several reasons– is Cerberus:\na nightmare-inducing rodent.\n\n## Cerberus, the king of all RATs\n\nCerberus is a highly sophisticated Android malware, in circulation since 2019. It has been\nactively distributed on dark web forums, in a “malware-as-a-service” (MaaS) format. For a\nsum between $4,000 and $12,000, cybercriminal groups capable of paying it have had all the\nmalware tools at their disposal. And by tools, we mean an arsenal of destruction.\n\nYesterday was released Cerberus v2 (banking Trojan)\n\nI received their master C&C\n\nPlease, don't try to hack it, don't RT so it wont be shared with many skilled whitehat\n[pentesters.#StayHome and don't help to reveal its developers, clients and victims.](https://twitter.com/hashtag/StayHome?src=hash&ref_src=twsrc%5Etfw)\n\n[reil424lawk6u65o .onion pic.twitter.com/3iaXv3ABG2](https://t.co/3iaXv3ABG2)\n\n[— Lukas Stefanko (@LukasStefanko) April 4, 2020](https://twitter.com/LukasStefanko/status/1246393013720530944?ref_src=twsrc%5Etfw)\n\nCerberus was conceived as a run-of-the-mill banking and phishing malware, and seeing\nAnubis’s success with cybercriminals, the team decided to integrate RAT capabilities into\ntheir toolset. Its victim is the banking apps inside your smartphone, but its functionality is\nmuch more complex. Like any Remote Access Trojan worth its salt, Cerberus is capable of\ndeep surveillance within your device, interfering with the encrypted communications the\nphone has with its apps, and outside.\n\nBasically, Cerberus can intercept and steal your phone’s unlock pattern or PIN, as well as\nGoogle Authenticator numbers, and any SMS necessary to perform a two-step verification.\nLikewise, this malware can interpose itself between you and your bank’s app through an\noverlay, the most common method for carrying out a phishing attack. In short, Cerberus can\nenter your computer, extract all the necessary data to perform a bank fraud, and wait for the\nbest moment to take the money from your account. All without you doing anything.\n\n\n-----\n\n## Cerberus and its complex functionality\n\nRegarding what Cerberus can do, it is necessary to point out two possibilities within its\nfunctionality. We already mentioned that Cerberus is a RAT, but to achieve such control of\nthe phone, it is necessary to have control of a vulnerability. In this case, it is the Android\nAccessibility Service.\n\nThis service, which normally assists users with disabilities in certain applications, is abused\nby Cerberus to give itself more permissions without user interaction. Having control of the\nAccessibility Services, the malware proceeds to ensure its persistence in different ways,\neither by disabling Play Protect or by removing itself from the applications in use.\n\nOn the other hand, Cerberus is capable of generating an instance of TeamViewer on mobile,\nand through the aforementioned Accessibility permissions, authorizing said session while the\nequipment is in use, all without user interaction.\n\nFrom that point, and as soon as the C2 server has the computer’s data, the rest of the\nfunctionalities are available to the attackers remotely. Abusing both the Accessibility Service\nand the TeamViewer session, Cerberus is capable of a lot. Its possibilities include:\n\nA keylogger\nListing, retrieval, sending and forwarding of SMS\nForwarding or transferring calls\nInstallation and deletion of apps\nLocking and unlocking the screen (without user interaction)\nCollection of device data\nList of device applications\nDevice file collection and extraction\nPhishing attacks via preloaded overlays\nVarious protection capabilities, such as emulation detection\n\n## The rocky history of Cerberus\n\n\n-----\n\nAs we mentioned, Cerberus has been on the market for a long time, to the detriment of users\nand banks alike. However, there are two reasons why it is now a growing concern: on one\nhand, the rapid evolution of its functionalities and on the other, the release of its source code.\n\nCerberus was born in 2019 as an espionage suite. While its design made it capable of bank\nfraud, at the time the malware lacked the level of sophistication required to steal two-step\nauthentication (2FA) data from apps like Google Authenticator. However, a ThreatFabric\nreport analyzed the second version of the malware in early 2020. Cerberus v2 was still in\ndevelopment by the same Eurasian team that brought it to life, with increasingly powerful\nfunctionality.\n\n[Months later, An Avast team made a disturbing finding. An app for the Spanish market,](https://blog.avast.com/avast-finds-banking-trojan-cerberus-on-google-play-avast)\ncalled “Calculadora de Moneda” (“Currency Calculator”), contained malicious code related to\nCerberus in its APK. The app was hosted on the Google Play Store, which supposedly\ncontains software from legitimate and safe sources.\n\nHowever, after weeks in hibernation, a connection to the attackers’ C2 servers activated\ncode on the app that downloaded another APK containing Cerberus, and the smartphones\nwere infected with the malware.\n\nAs the days passed, the Cerberus team became fragmented. In July, the developers decided\nto leave the project in the hands of anyone who could pay for it. The operators decided to\nauction everything: the servers, the malicious APK’s source code, and the admin panel\ncodes in addition to the modules. With a profit of aproximately $10,000 per customer, the\ncreators of Cerberus promised potential buyers to recover the expense in no time.\n\nHowever, the lack of interest –or buyers willing to pay that sum– put the sale at risk. The\nworst happened a couple of weeks later. Cybersecurity researcher Dmitry Galov revealed\nthat the auction had failed and that Cerberus operators released the source code of the\nmalware. This opened the door to the worst-case scenario: developers taking Cerberus and\ntransforming it into something nasty.\n\n## Alien, the new player\n\n\n-----\n\nIt took less than two weeks for another MaaS to take the crown. Alien, considered by experts\nas a full-blown ‘fork’ of Cerberus, entered the market aggressively after the fall of its\npredecessor.\n\nThe [ThreatFabric report on Alien is concerning. Although Alien comes from a different](https://www.threatfabric.com/blogs/alien_the_story_of_cerberus_demise.html)\nversion than the one released, it retains many of the functions that make this type of malware\ndangerous. First of all, it’s a very streamlined RAT with tons of features. It is also capable of\nrunning its own TeamViewer instance, and of displaying fake logins for more than 226\napplications. These include not only banking apps, but social media, email, and even popular\ncryptocurrency wallets.\n\nAlien is distributed in the same way as Cerberus in its early days: through malware forums\non the dark web. Its price has not yet been published, but it is believed that it would be\nsimilar to Cerberus given the similarity in functionality.\n\n## Conclusions\n\nThe smartphone malware landscape is becoming more complex as 2020 progresses.\nMalicious actors are taking advantage of user-authorized vulnerabilities to access our\nphones, [and then exploit all avenues for financial gain. This practice has generated a very](https://preyproject.com/blog/en/verizon-dbir-2020-4-findings-that-must-shape-security-on-your-organization/)\nprofitable market, one that all Android users can fall victim to.\n\n\n-----\n\nRecommendations for a threat this organized are straightforward. First and foremost, review\nany application installed on our Android devices, especially the requested permissions. Also,\nand even if it is used by many applications in a completely legitimate way, it’s necessary to\npay attention if a suspicious application needs access to Google’s Accessibility Services.\n\nAlong the same lines, there is a need to educate users about the risks of this type of\nmalware, whether personal or work-related. It should not be forgotten: although there are\nstrong economic motivations, malware such as Cerberus is still a powerful spying tool. The\ncoexistence of private data on our mobiles may well be an attack vector for our\norganizations.\n\n**Back to the Basics –** **[What is Cybersecurity?](https://preyproject.com/blog/en/what-is-cyber-security/)**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-09-29 - Cerberus and Alien- the malware that has put Android in a tight spot.pdf"
    ],
    "report_names": [
        "2020-09-29 - Cerberus and Alien- the malware that has put Android in a tight spot.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535586,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653704218,
    "ts_modification_date": 1653704218,
    "files": {
        "pdf": "https://archive.orkl.eu/eea25096a5fc187764e59990c71bcfc2c3a7fe78.pdf",
        "text": "https://archive.orkl.eu/eea25096a5fc187764e59990c71bcfc2c3a7fe78.txt",
        "img": "https://archive.orkl.eu/eea25096a5fc187764e59990c71bcfc2c3a7fe78.jpg"
    }
}