{
    "id": "a10635e2-db1b-4329-aa8e-4ae2712124dd",
    "created_at": "2023-01-12T15:09:23.881286Z",
    "updated_at": "2025-03-27T02:06:05.483731Z",
    "deleted_at": null,
    "sha1_hash": "7dc8cca45febfb0b4b1f60d2353f30d5e90c1fd7",
    "title": "2022-03-22 - Analyzing Exmatter- A Ransomware Data Exfiltration Tool",
    "authors": "",
    "file_creation_date": "2022-05-28T15:37:51Z",
    "file_modification_date": "2022-05-28T15:37:51Z",
    "file_size": 348386,
    "plain_text": "# Analyzing Exmatter: A Ransomware Data Exfiltration Tool\n\n**[kroll.com/en/insights/publications/cyber/analyzing-exmatter-ransomware-data-exfiltration-tool](https://www.kroll.com/en/insights/publications/cyber/analyzing-exmatter-ransomware-data-exfiltration-tool)**\n\nSend Message Send Message\nThank you\n\nOne of our experts will contact you shortly.\n\nSorry, something went wrong :( Please try again later!\n\nPlease try again later!\n\n**About you**\n\n**Contact details**\n\nI would like to receive periodic news, reports, and invitations from Kroll, a Duff & Phelps.\n\n\n-----\n\nHaving conducted more than 3,200 incident response engagements in 2021, Kroll s Threat\nIntelligence team now tracks more than 200 ransomware threat actor groups. Kroll’s global\nIncident Response teams are very familiar with actions traditionally associated with a\nnetwork intrusion, from initial access to lateral movement to privilege escalation to data\nexfiltration—and in the case of financially motivated actors, ransomware deployment. In this\nblog post, we will examine one of those tools, Exmatter.\n\nIn Q4 2021, Kroll analyzed multiple samples of a custom exfiltration tool called Exmatter. It’s\nthe third exfiltration toolset utilized by ransomware operators observed in the wild, after the\nrelease of Ryuk Infostealer in January 2020 and StealBit, which is associated with the\nLockBit 2.0 operator. Both the Ryuk Infostealer and Stealbit are capable of programmatic\nidentification of files of interest, followed by automatic exfiltration of data. Ransomware\ngroups in particular are known to harness custom data exfiltration tools to accelerate the\ninformation theft. Although Exmatter was originally associated with the now-defunct\nBlackMatter Ransomware-as-a-Service (RaaS) operation, Kroll has since observed variants\nof this tool being used by other RaaS groups.\n\nThe use of customized tools like Exmatter puts greater pressure on organizations to use\neffective [endpoint detection and response capabilities along with cyber security best](https://www.kroll.com/en/services/cyber-risk/managed-security/kroll-responder)\npractices.\n\n**Accelerating the Exfiltration Process**\n\nExmatter is designed to steal a range of user files, databases and compressed files\n(including email and zip archive files) from multiple directories and then upload them to a\npreconfigured server via Secure File Transfer Protocol (SFTP). This tool has been observed\nshortly before ransomware deployment on the victim's network. Interestingly, Kroll has\nidentified attackers targeting specific file extensions indicative of web and application source\ncode, shortcuts for Remote Desktop, and CAD/GIS files in their data theft efforts. This\nprocess of reducing data sources to the specific types of business-critical files is designed to\nspeed up the exfiltration process by collecting the data that attackers believe will be of the\ngreatest relevance and/or sensitivity during a ransom negotiation. Kroll assesses that it may\nincrease pressure on an organization to make a ransom settlement when that organization is\npresented with a curated file tree of sensitive files. The expeditious nature of this custom file\ncollection means the activity is more likely to complete successfully while also evading\ndetection by traditional cyber security mechanisms.\n\nKroll’s analysis identified that, upon enumerating the logical drives on a victim's computer,\nExmatter iterates through all its folders but ignores certain directories, including directories\ninside \"C:\\ProgramData\\\" (see Table 1). Kroll assesses that these operating system\ndirectories generally contain files of low value when viewed from the perspective of\ncompelling a ransomware payment. Upon identification of PDFs, Microsoft Office,\nOpenOffice and StarOffice files (including documents, spreadsheets and presentation files,\nalong with other file extensions as described in Table 2), a queue is established to prioritize\n\n\n-----\n\nthe most recently modified files ahead of older files. Kroll has also identified another limiting\nfactor: after identifying file extensions of interest, Exmatter only exfiltrates files larger than\n1,024 bytes.\n\n\n-----\n\n**Anti-Forensic Cleanup & Capability Enhancements**\n\nAs soon as all the selected data has been exfiltrated from the victim’s endpoint, Exmatter\nleverages anti-forensic techniques, removing any traces of itself from the device by invoking\nPowerShell to overwrite the first 65,536 bytes of the malicious file and subsequently delete\n[itself. Kroll’s incident responders have observed multiple variants of the tool adding updates](https://www.kroll.com/en/services/cyber-risk/incident-response-litigation-support/incident-response-management)\nto the inclusion and exclusion list and implementing the use of a WebDav client as a\nsecondary method of exfiltrating data should the primary use of SFTP fail. This suggests that\nattackers are continuing to evolve their tools to overcome defender obstacles while stealing\nvaluable data in the shortest possible time.\n\nMore recently, Kroll’s incident response investigators have observed a new variant of the\nExmatter tool being used for exfiltration prior to Conti ransomware deployment. This variant\nincludes a date range filter for the targeted data, indicating it may still be in development\neven after the alleged shutdown of the BlackMatter actor group in November 2021.\n\n**Exmatter Analysis in Action**\n\n\n-----\n\nIn an analysis of Exmatter, Kroll s Malware Analysis and Reverse Engineering\nteam confirmed the sample was a .NET Windows executable file that had been compiled\nwith Themida, an anti-reverse engineering software protection utility. Through static and\ndynamic analysis, Kroll successfully extracted the unpacked executable embedded within the\nfile.\n\nKroll found that any file matching the conditions in Tables 1 and 2 would be sent via SFTP to\na remote server over TCP port 22 using a hardcoded username and password within the file.\nThe team identified additional embedded configuration data, including a failover WebDav\noption should SFTP fail, as well as a SOCKS5 proxy configuration with the localhost IP\naddress.\n\nKroll also identified that the malicious file would accept command-line arguments as well. If\nthe string “nownd” or “-nownd” was passed to the file on execution, the file would attempt to\nhide its own window in order to avoid visual detection by any end user on the system.\n\n**Recommendations for Detecting Reconnaissance and Lateral Movement**\n\nDuring the early stages of a network intrusion, threat actors frequently utilize tools with\nlegitimate purposes to surreptitiously engage in malicious activities. Tools such as ADFind\nand Advanced IP Scanner, for example, are widely used for network and Active Directory\nadministration but can also be abused to aid in reconnaissance. When able to, attackers also\nuse legitimately signed binaries, such as those belonging in the Windows Sysinternals suite,\nand leverage their capabilities to carry out malicious activities ranging from credential\ndumping (ProcDump) to widespread malware and ransomware deployment (PsExec).\n\nDue to their legitimate purposes, these tools often do not raise suspicion when used in\nenterprise networks and thus provide threat actors with the ability to bypass traditional\nsecurity apparatuses, including antivirus software. Kroll has also observed threat actors\ntampering with Group Policy Objects (GPO) to weaken the technical security posture of an\norganization. Once the initial stages of an attack are successfully carried out using such tools\nand attackers have identified that they’ve not yet been detected, threat actors may then\nintroduce custom and unique tooling to focus on and accomplish their actions on an\nobjective, such as data exfiltration. Kroll recommends the following strategies for detecting\nreconnaissance and lateral movement:\n\nEmploy Next-Generation Antivirus (NGAV) and Endpoint Detection and Response\n(EDR) on all devices within your environment to enable early detection and response to\nthese threats. Based upon available organizational staffing, outsourcing the monitoring\nof your EDR solution may be a prudent approach to risk management given the 24x7\nnature of the current cyber risk environment.\n\nImplement cyber security best practices, including MFA, patching and least privilege. A\nfocus on reliable offline tested immutable backups is also important; you can find more\n[here.](https://www.kroll.com/en/services/cyber-risk/managed-security/kroll-responder)\n\n\n-----\n\n[Map your cyber security posture to a framework. The CIS Top 18 is a great solution for](https://www.cisecurity.org/controls/cis-controls-list)\nmany organizations.\n\nGartner’s [Market Guide for Digital Forensics and Incident Response Services highlights the](https://www.kroll.com/en/about-us/news/gartner-names-kroll-representative-vendor-for-digital-forensics)\ngrowing need for malware analysis as part of effective incident response. If organizations are\n[unable to undertake this type of analysis themselves, they can reach out to Kroll’s security](https://www.kroll.com/en/contactus)\nand cyber risk experts at any time.\n\n## Stay Ahead with Kroll\n\n24x7 Incident Response\n\nEnlist experienced responders to handle the entire security incident lifecycle.\n\nMalware Analysis and Reverse Engineering\n\nKroll’s Malware Analysis and Reverse Engineering team draws from decades of private and\npublic-sector experience, across all industries, to deliver actionable findings through in-depth\ntechnical analysis of benign and malicious code.\n\nComputer Forensics\n\nKroll's computer forensics experts ensure that no digital evidence is overlooked and assist at\nany stage of an investigation or litigation, regardless of the number or location of data\nsources.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-22 - Analyzing Exmatter- A Ransomware Data Exfiltration Tool.pdf"
    ],
    "report_names": [
        "2022-03-22 - Analyzing Exmatter- A Ransomware Data Exfiltration Tool.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536163,
    "ts_updated_at": 1743041165,
    "ts_creation_date": 1653752271,
    "ts_modification_date": 1653752271,
    "files": {
        "pdf": "https://archive.orkl.eu/7dc8cca45febfb0b4b1f60d2353f30d5e90c1fd7.pdf",
        "text": "https://archive.orkl.eu/7dc8cca45febfb0b4b1f60d2353f30d5e90c1fd7.txt",
        "img": "https://archive.orkl.eu/7dc8cca45febfb0b4b1f60d2353f30d5e90c1fd7.jpg"
    }
}