{
    "id": "a11a4301-4f0b-4e5a-ba4b-22080f4ce335",
    "created_at": "2022-10-25T16:48:16.887098Z",
    "updated_at": "2025-03-27T02:17:11.401806Z",
    "deleted_at": null,
    "sha1_hash": "574c252a8177731a7c7df80098a278fdf9e432af",
    "title": "Accenture SNAKEMACKEREL Threat Campaign Likely Targeting NATO Members Defense and Military Outlets",
    "authors": "",
    "file_creation_date": "2019-01-10T11:30:06Z",
    "file_modification_date": "2019-01-31T16:16:46Z",
    "file_size": 1280406,
    "plain_text": "# CYBER\n ADVISORY\n\n## SNAKEMACKEREL: Threat Campaign Likely Targeting NATO Members, Defense and Military Outlets\n\n\n-----\n\nMain Topic from Title Page\n\n### SUMMARY\n\nThis report details iDefense's analysis of a macro-enabled Microsoft Corp. Word document found in\nthe wild that is likely associated with the SNAKEMACKEREL threat group. iDefense assesses with\nmoderate confidence that the actors may be targeting attendees and sponsors of the upcoming\nUnderwater Defence & Security 2019 event occurring March 5-7, 2019, in Southampton, United\nKingdom.[1] This event draws attendees from government, military and private sector entities across\nthe globe, allowing this global event to represent a unique opportunity for SNAKEMACKEREL actors\nto conduct targeted intrusion operations against a wide array of organizations falling under its\ncollection requirements.\n\n### OVERALL ANALYSIS\n\n#### Intended Audience\n\nThis Intelligence Alert (IA) is intended to better inform decision makers operating in targeted regions\nand verticals; such decisionmakers include security operations center (SOC) and intelligence\nanalysts, security engineers and senior leadership.\n\n#### How to Use This Intelligence\n\nThis Intelligence Alert (IA) is intended to provide technical information about SNAKEMACKEREL\nthreat activity to help cybersecurity professionals better understand its threat behavior and help\nidentify indicators of compromise (IoCs). SOC and intelligence analysts may use the information\nprovided in this report for hunting activities, such as infrastructure enumeration and malware\nanalysis. Additionally, security engineers may use this information to create or add to existing\ncapabilities to detect suspicious network activity that may indicate initial compromise by and lateral\nmovement of the adversary. Finally, management and executive leadership may use this information\nto assess the risk associated with the threat described herein to make operational and policy\ndecisions. The information and suggested actions in this IA, however, are general in nature and do\nnot take into account the specific needs of your IT ecosystem and network, which may vary and\nrequire unique action.\n\n#### How This Intelligence Helps Address Existing or Potential Threats\n\nUnderstanding SNAKEMACKEREL tactics, techniques and procedures (TTPs) may help to detect\ninitial compromise and could prevent the spread of malware, ransomware or other threats\nthroughout a company's internal network.\n\n#### Key Assessment and Findings\n\n  - Defense analysts recently discovered a macro-enabled Microsoft Word document that\nappears to reference the Underwater Defence & Security 2019 event, which is scheduled to\noccur March 5-7, 2019, in Southampton, United Kingdom. The specific venue for the event is\nthe Ageas Hilton hotel.\n\n1 [http://www.underwater-defence-security.com/.](http://www.underwater-defence-security.com/)\n\n\n-----\n\nMain Topic from Title Page\n\n  - According to the event website, this is a three-day global event focused on how NATO\nmembers and affiliated nation states can respond to sea-based threats, including what role\nmanned, unmanned and autonomous systems can be effectively used to conduct dangerous\nmission operations.[2]\n\n  - The document is used to drop a DLL file that is believed to be a version of SedUploader, a\nfirst-stage reconnaissance tool thought to be developed and used by SNAKEMACKEREL\nactors.\n\n  - At this time, based on analysis of available malware samples, in addition to the observed TTPs\nused by the actors behind this Word document, iDefense has high confidence that this\nactivity is associated with the SNAKEMACKEREL threat group.\n\n  - This report is intended to provide early indication and warning (I&W) notice to public and\nprivate sector organizations sponsoring or attending this event, as it represents a unique\nopportunity for this adversary to conduct targeted attacks against entities aligned with what\nappears to be its collection requirements.\n\n### MALWARE ANALYSIS\n\nExhibits 1 and 2 show images of the content within the macro-enabled Microsoft Word document,\nwhich has a filename of “UDS 2019 Current Agenda.doc.”[3]\n\n\n**_Exhibit 1: Image within \"UDS 2019 Current Agenda.doc\"_**\n\n\n2 [http://www.underwater-defence-security.com/.](http://www.underwater-defence-security.com/)\n\n3 Rights to trademarks referenced herein, other than Accenture trademarks, belong to their respective owners. Accenture disclaims\nany proprietary interest in the marks and names of third-party companies.\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 2: Image within \"UDS 2019 Current Agenda.doc\"_**\n\n\nThe following are the properties of this Word file:\n\n\n\n- **MD5: f8a778d21003098075c9aef8ed58c6c3**\n\n\n\n- **Filename: UDS 2019 Current Agenda.doc**\n\n\n\n- **File Type: MS Word Document**\n\n\n\n- **Creation Date Stamp: 2018-12-11 14:17:00 (December 11, 2018, 2:17 p.m.)**\n\n\n\n- **Last Saved Date Stamp: 2018-12-12 20:30:00 (December 12, 2018, 8:30 p.m.)**\n\n\nBased upon iDefense analysis, it appears that SNAKEMACKEREL actors stole content for the lure\ndocument directly from the following link, which hosts the official conference agenda for 2019:\n\n\n\n- [http://www.underwater-defence-security.com/files/agenda13.pdf?version=1.0](http://www.underwater-defence-security.com/files/agenda13.pdf?version=1.0)\n\n\nThe document writes two files, which are identical, shown in Exhibit 3.\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 3: Macro Code That Drops SedUploader and Illustrates Document's Two Identical Files_**\n\n\nThis DLL file has the following properties:\n\n\n\n- **MD5: ebdc6098c733b23e99daa60e55cf858b**\n\n\n\n- **Filename: adobe.dll or clnb.dat**\n\n\n\n- **Compiler/Packer: Borland Delphi 3.0**\n\n\n\n- **Compilation Date Stamp: 2018-12-07 20:49:45 (December 7, 2018, 8:49:45 p.m.)**\n\n\nThe macro-based document then executes the clnb.dat file (which is actually a DLL) using rundll32\nand calling the first export. Last, it sets the registry key shown below for persistence; this key will\nstart adobe.dll with the same export upon system reboot:\n\n\n\n- HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\AdobeAcrobat\n\n\nExhibit 4 shows an example of this macro code.\n\n\n**_Exhibit 4: Macro Code that Executes the Malware and Creates Registry Key_**\n\n\n-----\n\nMain Topic from Title Page\n\n#### Adobe.dll\n\nThis DLL file, which is identical to clnb.dat, is believed to be a variant of the SedUploader malware. It\nsends command-and-control (C2) communications to photopoststories[.]com, as shown in Exhibit 5.\n\n\n**_Exhibit 5: Example Connection to C2 Server (values redacted)_**\n\n\n**XOR Encryption**\n\n\nThroughout the execution of this DLL, a method is called that decodes XOR-encoded strings that are\nhardcoded into the malware. This code uses the following XOR key, as shown in Exhibits 6 and 7:\n\n\n\n- 0x5F31215E6C247774693A161E13030A0A0F\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 6: XOR Decoding Routine in Executable_**\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 7: XOR Key Hardcoded into Executable_**\n\n\n**Mutex**\n\n\nThe mutex is one of the strings that is hardcoded into the malware and decrypted using the XOR\nencryption routine referenced previously, as shown in Exhibits 8-10.\n\n**_Exhibit 8: Example of Mutex after Decoding_**\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 9: Code within Executable That Sets Mutex_**\n\n\n-----\n\nMain Topic from Title Page\n\n\n**_Exhibit 10: Mutex Hardcoded in Executable_**\n\n\n#### Infrastructure Enumeration\n\nBased upon available WhoIs data, SNAKEMACKEREL appears to have created the C2 server\nphotopoststories[.]com on December 7, 2018. iDefense analysts also observed another domain\n(proposalprogram[.]com) hosted on the same IP address (185.86.150.193); this domain was listed as\nthe aforementioned C2 server for which clients were advised to proactively monitor network activity,\nalthough iDefense did not observe any malicious content being hosted on this site as of December\n21, 2018.\n\nThe SLL certificate (e979d63a80f96ec06e7308541713d201813927a6) issued for the C2 server also\nappears to be new; it was first observed on December 7, 2018.\n\n\nExhibit 11 shows more information for this SLL certificate.\n\n\n**_Exhibit 11: SLL Certificate Information_**\n\n\n-----\n\nMain Topic from Title Page\n\n### GEOPOLITICAL ANALYSIS\n\nThe Word document was uploaded to a third-party anti-virus vendor on December 20, 2018, by an\nunknown entity likely based in Macedonia. This observation is notable, as Macedonia is currently\npending admission to NATO as its thirtieth member; this admission is expected to become official\nsometime in 2020. This activity aligns with prior SNAKEMACKEREL threat activity, as the group\nallegedly targeted government officials in Montenegro back in 2017 prior to that country's accession\nto NATO.\n\niDefense analysts note that this event draws attendees from government, military, and private sector\nentities across the globe, including those located in the US, Western and Eastern Europe, Middle\nEast and Asia-Pacific regions. As such, this global event represents a unique opportunity for\nSNAKEMACKEREL actors to conduct targeted intrusion operations against a wide array of\norganizations falling under what appear to be its collection requirements.\n\nExhibit 12 provides a brief synopsis of the conference agenda, which appears to emphasize the need\nfor NATO members and affiliate nation states to improve naval capabilities (e.g. fleets and\nsubmarines) to address increasing global instability.\n\n\n**_Exhibit 12: Conference Agenda Synopsis[4]_**\n\n\nThis agenda would likely be of high interest to Russian intelligence agencies for several reasons:\n\n\nIt may provide them with detailed information on how NATO members and its allies plan to develop\nnew underseas capabilities to counter Russia's continued focus on new, stealth classes of\nsubmarines.\n\nIt may provide them with detailed information on new technologies that could be reverse\nengineered and implemented into their current and future classes of submarines, some of which\nhave the capability to launch nuclear-powered ballistic missiles.\n\n### CONCLUSION\n\nAt this time, iDefense has high confidence that this activity is associated with the SNAKEMACKEREL\nthreat group. iDefense analysts will continue to monitor for new activity related to this global event\nand will provide additional updates as necessary.\n\n4 [http://www.underwater-defence-security.com/conference-agenda.php.](http://www.underwater-defence-security.com/conference-agenda.php)\n\n\n-----\n\nMain Topic from Title Page\n\n#### Mitigation\n\n\niDefense suggests monitoring for and blocking network traffic to the following domains:\n\n\n\n- photopoststories[.]com\n\n\n\n- mail.photopoststories[.]com\n\n\n\n- proposalprogram[.]com\n\n\n\n- smtp.proposalprogram[.]com\n\n\nAdditionally, iDefense suggests monitoring for and blocking the following file hashes:\n\n\n\n- f8a778d21003098075c9aef8ed58c6c3\n\n\n\n- ebdc6098c733b23e99daa60e55cf858b\n\n\nFinally, where the ability exists, iDefense suggests hunting for the following malicious artifacts that\nare likely associated with the SedUploader malware:\n\n\n\n- A file named clnb.dat located in Users\\Administrator\\AppData\\Local\\Temp\n\n\n\n- A file named adobe.dll located in C:\\ProgramData\n\n\n\n- The registry key HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\AdobeAcrobat\n\n\n\n- The mutex vBQA5vjd0gKHLwQyJK86NhVS\n\n\nThe information and suggested actions in this IA are general in nature and do not take into account\nthe specific needs of your IT ecosystem and network, which may vary and require unique action.\n\n**_LEGAL NOTICE AND DISCLAIMER: This document is produced by consultants at Accenture as general_**\n_guidance. It is not intended to provide specific advice on your circumstances. If you require advice or further_\n_details on any matters referred to, please contact your Accenture representative._\n\n_Given the inherent nature of threat intelligence, the content contained in this alert is based on information_\n_gathered and understood at the time of its creation. It is subject to change. The information in this report is_\n_general in nature and does not take into account the specific needs of your IT ecosystem and network, which_\n_may vary and require unique action. You should independently assess your specific needs in deciding to use any of_\n_the tools mentioned._\n\n_As such, all information and content set out is provided on an “as-is” basis without representation or warranty_\n_and the reader is responsible for determining whether or not to follow any of the suggestions, recommendations_\n_or potential mitigations set out in this report, entirely at their own discretion. Accenture accepts no liability for_\n_any action or failure to act in response to the information contained or referenced in this alert._\n\n\n-----\n\nMain Topic from Title Page\n\nAccenture, the Accenture logo, and other trademarks, service marks, and designs are registered or\n\nunregistered trademarks of Accenture and its subsidiaries in the United States and in foreign countries.\n\nAll trademarks are properties of their respective owners. All materials are intended for the original\n\nrecipient only. The reproduction and distribution of this material is forbidden without express written\n\npermission from Accenture. The opinions, statements, and assessments in this report are solely those\n\nof the individual author(s) and do not constitute legal advice, nor do they necessarily reflect the\n\nviews of Accenture, its subsidiaries, or affiliates. Given the inherent nature of threat intelligence,\n\nthe content contained in this report is based on information gathered and understood at the time of\n\nits creation. It is subject to change. Accenture provides the information on an “as-is” basis without\n\nrepresentation or warranty and accepts no liability for any action or failure to act taken in response\n\nto the information contained or referenced in this report.\n\nCopyright © 2019 Accenture\n\nAll rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.accenture.com/t20190213T141124Z__w__/us-en/_acnmedia/PDF-94/Accenture-SNAKEMACKEREL-Threat-Campaign-Likely-Targeting-NATO-Members-Defense-and-Military-Outlets.pdf"
    ],
    "report_names": [
        "Accenture-SNAKEMACKEREL-Threat-Campaign-Likely-Targeting-NATO-Members-Defense-and-Military-Outlets.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716496,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1547119806,
    "ts_modification_date": 1548951406,
    "files": {
        "pdf": "https://archive.orkl.eu/574c252a8177731a7c7df80098a278fdf9e432af.pdf",
        "text": "https://archive.orkl.eu/574c252a8177731a7c7df80098a278fdf9e432af.txt",
        "img": "https://archive.orkl.eu/574c252a8177731a7c7df80098a278fdf9e432af.jpg"
    }
}