{
    "id": "a182e1ca-6c41-471f-a3cd-3f9cd0980c19",
    "created_at": "2023-01-12T15:00:14.119549Z",
    "updated_at": "2025-03-27T02:05:18.182521Z",
    "deleted_at": null,
    "sha1_hash": "d898e2677c4a2642083b8223ea3717674e2de268",
    "title": "2022-07-29 - Fake investment scams in Europe How we almost got rich",
    "authors": "",
    "file_creation_date": "2022-09-01T10:08:24Z",
    "file_modification_date": "2022-09-01T10:08:24Z",
    "file_size": 4010498,
    "plain_text": "# Fake investment scams in Europe\n\n**blog.group-ib.com/investment-scams-europe**\n\n29.07.2022\n\nHow we almost got rich\n\n\n-----\n\nReza Rafati\n\nSenior Analyst at Group-IB Computer Emergency Response Team (CERT-GIB) Europe\n\n\n-----\n\nYaroslav Kargalev\n\nDeputy Head of the Group-IB Computer Emergency Response Team (CERT-GIB)\n\nFake investment scams have been around for long enough so that people could recognize\nthem easily. For instance, in 2020, Group-IB Digital Risk Protection Team detected a massive\nbitcoin [scam campaign in Singapore which used the names of local celebrities.](https://www.group-ib.com/media/singapore-bitcoin-scam-campaign/)\nNevertheless, no matter how old the scheme is, it keeps bringing money to fraudsters.\n\nThe Group-IB [Computer Emergency Response Team (CERT-GIB) has been investigating](https://www.group-ib.com/cert.html)\nseveral fake investment schemes which are targeting European citizens. In the course of the\nresearch, a gigantic network infrastructure was uncovered and analyzed, which contained\n\n\n-----\n\nover 10,000 rogue resources, including similar fraudulent ones aimed at the inhabitants of\nthe entire Eurasian continent and North America.\n\nIn our research, we noticed that the following countries are being targeted with the Fake\ninvestment scheme:\n\nUK\nBelgium\nNetherlands\nGermany\nPoland\nPortugal\nNorway\nSweden\nCzech Republic\n\nThe main goal of these fake investment schemes is to convince the victims to repeatedly\ntransfer funds to the fake investment portal. The victims are usually promised huge returns\non their investments and are shown “how I got rich” stories featuring celebrities.\n\nIn this post, Reza Rafati from the [Group-IB Computer Emergency Response Team (CERT-](https://www.group-ib.com/cert.html)\nGIB) in Amsterdam will take a deeper dive into the fake investments schemes, showcase a\ncouple of them including a conversation with the scammers that we managed to record, and\nprovide recommendations for the users. The aim of this research is to raise awareness about\nthe fake investment scheme and ultimately reduce the number of victims. We encourage\ncybersecurity researchers and the general public to join the fight against cybercrime and\n\n\n-----\n\n[share fraudulent domains with us via Report an Incident form at https://www.group-ib.com](https://www.group-ib.com/)\nfor further evaluation and takedown.\n\n## Fake investment schemes\n\nLegitimate looking investment sites are popping up everywhere. We see them on various\nsocial media networks, which include the massive platforms of Youtube and Facebook.\n\nThe message displayed on those platforms makes it seem like there is a bulletproof service\nof making an online income. The messages state that the service is used by famous people\nglobally. This can be from Elon Musk to local Dutch and UK celebrities. The message\ncontinues to state that it is a unique offer and that you just need a minimal deposit of 250\neuros to get started.\n\n\n-----\n\nScreenshot from a rogue Facebook profile which is sharing the scheme\n\nThe scam disseminates deceptive information as though ‘Gert Verhulst’ has surprised\nexperts and is frightening the banks, all because he made an investment. The fake\ninvestment scheme illegally exploits the name and the image of this famous person to lure\nthe victims to click on the link. Gert Tony Hubert Verhulst is a Belgian media entrepreneur,\ntelevision producer, presenter, actor and singer. He is known in the Netherlands for his\ntelevision role in the show 'Samson en Gert'.\n\nAdditionally, the victim will leave a comment below the hyperlink, stating that with 250 euros\nthe victim was able to have a profit of 700 euros in just 3 days.\n\nIn some cases, specially created rogue Facebook pages were being used to spread the fake\ninvestment scheme post via the advertisement capabilities on Facebook.\n\n\n-----\n\nA promoted Facebook message luring victims to the fake investment schemes\n\nThe following footage is taken from Youtube, in this video the fraudster is trying to lure users\nto contact him. Once contacted by the victims, the scammer will assist the victims in creating\nthe needed profile to start with the investment, and also assist in getting the initial minimal\n250 euro deposit.\n\nA [video on Youtube trying to lure the viewers into contacting the actor that is participating in](https://www.youtube.com/watch?v=f2rbRax8X1c)\nthe fake investment schemes.\n\n\n-----\n\nThe ultimate goal is to lure the victims into visiting fake investment portals.\n\n## Your personal account manager\n\nThe scammers behind this scheme try to maximize their impact and set up the same scheme\nwith different templates that cover specific topics. Below you can see a collection of the\ntemplates seen by CERT-GIB in the fake investment schemes.\n\nThe fake sites make use of templates that seem to be of high quality. The color palettes used\nand the code itself makes it look like a legitimate and trustworthy website.\n\nThe main idea of the fake broker sites is to show content to the victims which will trigger\nthem to:\n\nRegister an account\nReplenish the balance on their previously made account\nBombard the victims with success stories\nDraw fictitious stories that profit is being made via the fake broker sites\n\nThe scammers social engineer the victim into making an investment. Once the victim lands\non the fake broker site, they will see various fake messages of people that have had\n“successful” trades and are in the process of cashing out. The fake broker site will for\n\n\n-----\n\nexample state that a random name from your city just has withdrawn a couple of hundred\neuros.\n\nThe scheme is a combination of online and offline techniques. After filling out the form\n(shown below), the victim receives a call from scammers who provide a link to the final\nfraudulent invest-project with a personal account. To start trading, the victim needs to\nreplenish the balance.\n\nOne example of a fake investment scheme form used to target Norwegian users\n\nThis “fake” account manager will assist the victim in making the right decisions on their fake\ninvestment dashboard, increasing the likelihood that the scammers can get more than 250\nEUR of the victim. It also allows the fraudsters to change specific values in the dashboard so\nthe dashboard meets the expectations of the unaware victim.\n\n\n-----\n\nThe final page where the victim is requested to perform a transaction of 250 EUR or more. It\nis at this stage where the credit card details are compromised and the victim loses money.\n\n## How we got scammed (on purpose)\n\nThis scheme makes use of several steps to social engineer the victim into sending out\nmoney. For research and awareness-building purposes we signed up with one of those scam\nwebsites. Shortly after signing up, we received a phone call.\n\nDuring this phone call the scammers asked several questions that you would expect when\ndealing with a legitimate investment service:\n\nWhy do you want to invest?\nHow much can you invest?\nHow do you make your money?\n\n\n-----\n\nHow much time do you spend on work?\n\nOn each answer of these questions the scammer gave a positive response which led to the\nnext step in the call. At the end of the call, the fraudster insisted on giving payment card\ndetails immediately. He was very upset when we refused. Remember, the sense or urgency\nthat the scammers are often trying to induce is one of the red flags. Refer to the\nrecommendations section below for more tips.\n\nBelow you can find the audio recording and the transcript of the conversation with the scam\n\"operator\" that we were able to record. It has been partially muted for the sake of privacy.\n\nTranscript\n\nA: I am calling you from [fake investment platform name]. How are you?\n\nB: I'm good. I'm good. Thank you for calling.\n\nA: I see you have left your details with our platform, Reza.\n\nB: That's correct. That’s correct.\n\nA: Is this your first-time trading?\n\nB: Yes.\n\nA: Okay, then you just start making profits with trading. What would you do with them? Do\nyou have any goals?\n\nB: Man, I think I will buy a nice car, if it goes good.\n\nA: What kind of car you want to buy?\n\nB: Man, you tell me what I can buy. I am interested in what type of money\n\nI can make online.\n\nA: It depends on you and your capital as well. Because, you understand, if your capital is big,\nyour profits will be big as well.\n\nB: Okay. Okay. So…\n\nA: Let’s see. You are a beginner. So, I would like to suggest you something very simple,\nokay?\n\nB: Okay, I am interested. Let me know.\n\n\n-----\n\nA: Let s start trading with the bare minimum for a couple of days so you can check out our\nplatform and the service we provide, check the result. And then you can make your own\neducated decision if you would like to continue. Okay?\n\nB: Okay. Okay.\n\nA: If you like it, we continue trading long term. If you don't like it, you close your account and\nyou take out your money.\n\nB: Sounds like a plan.\n\nA: Sounds fair?\n\nB: Yeah, sound fair.\n\nA: Okay. Then speaking of money, by the way, how do you support yourself right now?\n\nB: Man, I work full time. I work too much. I want to work less. That's why I am also investing\nnow.\n\nA: You work too much. What exactly is your profession?\n\nB: I work in IT management.\n\nA: IT Management?\n\nB: Yeah. So, I do system repair and, you know, I have those customers like that.\n\nA: Like administrator?\n\nB: Yes, exactly. Exactly.\n\nA: Working too much, so you are working over eight hours a day?\n\nB: Man, I work around 40 to 60 hours a week. That’s too much.\n\nA: Every day 40 to 60 hours?\n\nB: Not every day. Every week, every week. I cannot change the hours of the day.\n\nA: 40 to 60 hours is not much for a week.\n\nB: For me it is man. I live in Netherlands; I shouldn’t be working so much.\n\nA: So, you just like to spend your time with yourself, not go to the office. You want to make\nmoney online?\n\n\n-----\n\nB: Exactly. Because my employer is not paying me too much money at this moment. And I\nwant to make some extra money on the side. So at one moment I can tell my employer. “Ok,\nthank you, I will work through this”.\n\nA: Hum, okay. You don't like to work for somebody else. You want to work for you?\n\nB: I want to have freedom.\n\nA: Yes. I understand why you signed up. You want to try a bit … if it is going to work for you.\nAnd let’s say after a couple of months if you build up some confidence and you see if it can\nbe positive for you. Maybe you can achieve this financial freedom.\n\nB: Exactly. Exactly. This is for financial freedom. You say correct.\n\nA: Okay. Reza, so, we are going to do something like this, okay? We are going to start with a\nminimum. We are going to make a deposit, so we can activate the investment account. Then,\nyou are going to have a session with your personal account manager. He is going to show\nyou around the platform, how to use it, how to trade, okay? You will test it out for a couple of\ndays. And then you will make your decision. Okay?\n\nB: Okay. Sounds good, sounds good.\n\nA: Okay. So, usually my clients from Netherlands are using a Visa or a MasterCard for the\ndeposit. What are you using?\n\nB: I have a Visa, but I do not have the card with me right now.\n\nA: What is it?\n\nB: I am at work; I don’t bring the Visa card with me. Is it possible…\n\nA: You leave you card at home?\n\nB: Yes, of course.\n\nA: What do you mean “yes, of course”? Is there somebody close to your house who can help\nyou?\n\nB: No, no. If they go to my house, they have a big problem. No, I don’t have a Visa card with\nme.\n\nA: Okay. You have a banking application on your phone?\n\nB: Yes. Yes.\n\nA: Usually you can check your details as well.\n\n\n-----\n\nB: Okay. I can do that. Man, do you have option to talk to you on WhatsApp or something like\nthat?\n\nA: No, it is not professional to speak on WhatsApp with clients. Reza, I want to be completely\nprofessional with you and every client I speak. So, It is not serious for me to speak on\nWhatsApp.\n\nB: Okay. Okay. Because…\n\nA: My job Reza would be to remind you that once we process the transaction with your Visa\ncard, you are going to receive an SMS on your phone. So, this is 3D security from your bank.\nIn this SMS you are going to see a code with which you are going to approve the transaction,\nokay?\n\nB: Okay. Man, I am a little bit… I am now at work also. I did not expect you to call me so\nquickly. Can you call me back tomorrow, so we finish this tomorrow.\n\nA: Reza, I understand this is your first-time trading and you are not 100% sure if you want to\ndo it.\n\nB: No, no, no, I am. I am. But my manager is looking and he is telling me to go to work.\n\nA: Yeah, but we are speaking only for a couple of minutes. I see you signed up recently on\nour web page. So,it is going to take two minutes to activate the investment account and you\ncan make your appointment with your personal account manager for later today or tomorrow,\nokay?\n\nB: We can do it…can we create the account now and I make the deposit later? Because I\ncannot do this right now.\n\nA: Yes, but you understand, I need to know if you are serious about this, because I cannot\nkeep calling the same client over and over.\n\nB: Of course, I am serious. You just said we’ve been talking already for a couple of minutes. I\nsigned up.\n\nA: How should I know if you serious? There are many people like you telling me “Call me\nlater, call me tomorrow”.\n\nB: Man, that I do not know.\n\nA: Then, they do not pick up the phone!\n\nB: Man, I will pick up the phone for you.\n\nA: How should I be…\n\n\n-----\n\nB: Man, if you want to be be sure, you need to call me back later because I need to go to\nwork now. I cannot do that lke this. This is a little bit weird. if you have bad experience with\nsome clients, I understand, It's f*** up for you. But I am interested. I want to be called back.\n\nA: Yes, but I cannot speak with the same client over and over again. Because, you see,\nevery day there's thousands of clients registering in our platform. So, I am constantly\nspeaking with new clients. If I seat with clients like you who tell me “Call me later, call me\ntomorrow”, I will not be able to speak with new clients.\n\nB: I understand. But I have my work here right now. I need to do my work. Yes?\n\nA: Yes.\n\nB: From other side, there are many, many brokers that can help me like this. And I went to\nyou. So if you want to do business with me, you call me back tomorrow. If you don't want to\ndo business with me, it is over.\n\nA: How do I know if you are serious about this?\n\nB: Man, I’m talking to you right now. Why should I not be serious?\n\nA: Yes. How should I know?\n\nB: Man, you're costing me time right now. I need to go to work. If you call me tomorrow, I will\ncall back to you.\n\nA: But I believe you signed up for a reason with our company. You did not sign up because\nyou wanted to speak with me, you signed up because you wanted to start investing.\n\nB: Exactly. Exactly. And I want to start. But I cannot talk right now. I really need to go. Yes?\n\nA: Okay, Reza.\n\nB: Please call me back tomorrow and we can make next steps.\n\nA: Good luck.\n\nB: Thank you.\n\n## “Fascinating” victim journey\n\nIn a nutshell, the scheme looks as follows:\n\n2\n\n\n-----\n\nThe victim sees the fake investment post and is lured into clicking the post as the post claims\nthat easy profit can be made with a minimal deposit of 250 EUR.\n\n3\n\nThe victim clicks on the post which translates itself into two steps:\n\na. The victim is navigated directly to the fraudulent scheme site or an “advertisement” site\nwhich shows the “profit” famous people are making with the investment plan.\n\nb. The victim is forwarded to an fraudulent investment site which shows successful projects\nand income plans.\n\n4\n\nThe victim is shown a form which asks for contact details.\n\n5\n\nOnce the form is filled, the victim will be contacted by phone by one of the call centers that is\nbeing used for this scheme.\n\n6\n\nDuring the call, the scammer will try to social engineer the victim into believing that the\ninvestment plan is a legitimate plan. It is also in this step that the scammer informs the victim\nthat with a minimum of 250 euro deposit with a credit card the investment can be started.\n\n7\n\nOnce the victim has made a deposit of 250 euro or more, the victim will get a login to a fake\ninvestment dashboard.\n\n8\n\nIn the fake dashboard profit will be shown (while literally there is no profit as all is fake), the\nscammers do this to be able to ask the victim for more money, as the victim believes good\nprofits are being made. No actual trading is taking place on the platform.\n\n9\n\nThe scammer (fake account manager) continues to ask for more deposits so that the victim\ncan increase their profits. If the victim agrees to deposit more, the victim will be sent back to\nstep 8. If the victim denies, and wants to cash out, the victim will be shown step 10.\n\n10\n\n\n-----\n\nThe scammer will state that the victim needs to put another deposit to meet the payout\nthreshold. If the victim agrees to do this, they will be sent to step 8 again, if the victim refuses\nto deposit more, the victim will quickly realize that they have participated in a fake investment\nscheme and that the money has been lost.\n\n## The scale of fake investment schemes\n\n[We used our patented Graph Network Analysis tool within the](https://www.group-ib.com/ti/graph.html) [Threat Intelligence system and](https://www.group-ib.com/products/threat-intelligence/)\nit quickly showed us the immense size of the schemes that have been setup.\nAt the moment of writing, CERT-GIB tracked down 11,197 domains that were used and\nincluded in the general fraudulent infrastructure targeting Europe - this included chains of\nredirects and hosts of fraudulent content.\n\n\n-----\n\nThe lifetime of fraudulent sites varied from several days to several months (the more victims\nthe site brought, the faster it went offline and its mirror was raised on another domain). At the\nmoment of writing, from those 11,197 domains, 5,091 still remain active.\n\nA graph view on one of the domains - leading to a massive forest of fraudulent investment\nscheme sites.\n\nSource: Group-IB Threat Intelligence\n\nThe fraudsters make use of specific keywords and top level domains to trick unaware\ninternet users into their fraudulent scheme. The keywords range from specific investment\ncategories like Bitcoin and gold, but this is not where they stop, they continue to set up\nschemes that target specific countries.\n\nIn our research, we noticed that the following countries are being targeted with the Fake\ninvestment scheme:\n\nUK\nBelgium\nNetherlands\nGermany\nPoland\n\n\n-----\n\nPortugal\nNorway\nSweden\nCzech Republic\n\n## Recommendations\n\nThe earning techniques used in the schemes abuse the trust of the victims, the scammers\nperform social engineering methods to keep the victim hooked.\n\nIn order to protect yourself and your surrounding against these type of threats, we have the\nfollowing recommendations for you:\nInvestments can often be done via legitimate and established brokers. There are many sites\nthat provide detailed information about these legitimate brokers. So don’t simply click and\njoin a site via an advertisement, do your own research online and validate that you are\ndealing with a legitimate broker website.\n\nWhen you start with investments, you don’t need to have a personal account manager telling\nyou what to do by phone. Keep your money in your pocket and educate yourself in regards\nto investing.\n\nSearch for reviews - the established brokers will have reviews. These reviews can help you\nto get a better understanding of the service and the quality that is provided.\n\nOften the fake broker domains have a short lifespan, this means that the domains that have\nbeen registered are quite new. You can report suspicious domains at https://www.groupib.com via “Report an Incident” form. Our team will evaluate and take down fraudulent\nwebsites upon confirmation.\nFinancial organizations are recommended to use Group-IB’s [Fraud Protection to stop](https://www.group-ib.com/products/fraud-protection/)\nfraudulent activity even after its customers share payment details with the scammers.\nGroup-IB [Digital Risk Protection defends the personal brand of individuals by hunting down](https://www.group-ib.com/products/digital-risk-protection/)\nimpersonations and illegal copies of accounts.\n\nLegal disclaimer\n\n1. The material was prepared by Group-IB experts solely for research purposes in order to\nminimize the risk of further use of methods and techniques of committing illegal actions and\ntheir timely prevention.\n\n2. The conclusions do not represent the official position of competent authorities, including\nlaw enforcement agencies, do not contain direct accusations of committing crimes or other\nunlawful actions, and are analytical and informative in nature.\n\n\n-----\n\n3. All personal data including names, images, video and audio records and any other\ninformation on identified or identifiable individuals are published herein for the purposes\nspecified above in the public interest. If you have any questions or requests concerning your\npersonal data contained in our articles or blog posts, please address them to:\n[privacy@group-ib.com.](mailto:%20privacy@group-ib.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-07-29 - Fake investment scams in Europe How we almost got rich.pdf"
    ],
    "report_names": [
        "2022-07-29 - Fake investment scams in Europe How we almost got rich.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535614,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1662026904,
    "ts_modification_date": 1662026904,
    "files": {
        "pdf": "https://archive.orkl.eu/d898e2677c4a2642083b8223ea3717674e2de268.pdf",
        "text": "https://archive.orkl.eu/d898e2677c4a2642083b8223ea3717674e2de268.txt",
        "img": "https://archive.orkl.eu/d898e2677c4a2642083b8223ea3717674e2de268.jpg"
    }
}