{
    "id": "a21cc6fc-7b9e-4662-bde1-db855ed6b5be",
    "created_at": "2022-10-25T16:48:12.213596Z",
    "updated_at": "2025-03-27T02:16:59.238292Z",
    "deleted_at": null,
    "sha1_hash": "6e76324fd3b54f11f5eda90ef40c5eb20c7adf7a",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-09-06T08:29:46Z",
    "file_modification_date": "2021-09-06T08:56:23Z",
    "file_size": 11895822,
    "plain_text": "# TeamTNT: \n###### Cryptomining Explosion\n\n\n-----\n\n##### Agenda\n\n**Zusammenfassung (Executive Summary)** **3**\n\n**Die Einführung (Intro)** **5**\n\n**Der Anfang (The Beginning)** **7**\n\nThe Setup **9**\n\nDDoS Bot Setup **10**\n\nGather Information About the System **11**\n\nCapture SSH Credentials **11**\n\nScan for Other Machines to Compromise **12**\n\nCryptomining **13**\n\nWatchdogd Process **13**\n\nNarrenKappe **13**\n\nRemoving All Traces **15**\n\nFolgen Sie dem Semmelbrösel **15**\n\n**Der Frühling 2020 (Spring 2020)** **16**\n\nmxutzh.sh **17**\n\nInit.sh **18**\n\nClean.sh **19**\n\ndns **20**\n\nConnection to Other Scripts **21**\n\nlan.redis.pwn.sh **21**\n\nminion_worker.sh **21**\n\n**Der Sommer 2020 (Summer 2020)** **22**\n\nDocker Exploitation **23**\n\nSSH Exploitation **25**\n\nDocker Containers **26**\n\n**Der Herbst 2020 (Fall 2020)** **27**\n\n**Der Winter 2021 (Winter 2021)** **30**\n\n\nAttacking Kubernetes **31**\n\nWindows Targeting Attempt? **32**\n\n**Der Frühling 2021 (Spring 2021)** **34**\n\n**Der Sommer 2021 (Summer 2021)** **36**\n\n**Soziale Aktivität (Social Media Activity)** **39**\n\nCopycat **41**\n\n**Werkzeuge (Tools)** **43**\n\nTsunami (Kaiten) **44**\n\nTeamTNT's Configuration **45**\n\nRathole **45**\n\nEzuri **46**\n\nPunk.py **47**\n\nlibprocesshider **48**\n\ntmate **49**\n\nmasscan **49**\n\npnscan **49**\n\nTiny SHell **49**\n\nMimiPenguin **50**\n\nMimipy **50**\n\nBotB **50**\n\nDiamorphine **51**\n\nDocker Escape Tool **52**\n\n**Das Fazit (Conclusion)** **53**\n\n**IoCs** **54**\n\nPre-February Campaign **55**\n\nFiles **55**\n\nNetwork **55**\n\n\nSSH Key **56**\n\nFebruary 2020 Campaign **56**\n\nFiles **56**\n\n32-bit Archive **58**\n\n64-bit Archive **58**\n\nNetwork **59**\n\nWallet **59**\n\nSpring 2020 **59**\n\nFiles **59**\n\nSummer 2020 **60**\n\nFiles **60**\n\nArchives **62**\n\nBinaries **62**\n\nFall 2020 **63**\n\nNetwork **63**\n\nWinter 2021 **64**\n\nAttacking Kubernetes **64**\n\nNetwork **64**\n\nFiles **65**\n\nWindows Targeting **66**\n\nWallet **66**\n\nSpring 2021 **67**\n\nSummer 2021 **68**\n\nFiles **68**\n\nDomains **68**\n\n\n-----\n\nver the past year the TeamTNT threat\n\nactor has been very active. TeamTNT is\n\n### O\n\none of the predominant cryptojacking threat\n\nactors currently targeting Linux servers. This\n\nreport investigates the threat actor’s activity\n\nand their Tactics, Techniques and Procedures\n\n(TTPs)—providing all of this information in one\n\ndocument so security teams can better detect\n\nand prevent attacks from TeamTNT.\n\nBased on our findings, we can conclude that\n\nthey have been active since the Fall of 2019,\n\nsix months before the first public report on\n\nthe threat actor’s activity. As of this writing,\n\nTeamTNT is mainly focused on compromising\n\n[Kubernetes clusters. Prior to this, they used to](https://unit42.paloaltonetworks.com/hildegard-malware-teamtnt/)\n\n[target servers running Docker and Redis. We at](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\n\nIntezer also uncovered Windows binaries hosted\n\non a TeamTNT server that was potentially an\n\nexperiment to target Windows machines.\n\nMuch of the threat actor’s tooling has\n\nstayed consistent throughout their different\n\ncampaigns. The majority of their tools are\n\nbased on shell scripts but they also use\n\nsome “tried and tested” compiled binaries\n\nin the attack chains. For example, the use of\n\nthe Tsunami malware, first documented by\n\n[Trend Micro, has been a staple of TeamTNT’s](https://www.trendmicro.com/en_us/research/20/l/teamtnt-now-deploying-ddos-capable-irc-bot-tntbotinger.html)\n\ncampaigns since October 2019. In addition\n\nto cryptojacking, a second objective for\n\nthe threat actor has been to exfiltrate\n\ninformation about compromised hosts.\n\n\n## Zusammenfassung\n#### (Executive Summary)\n\n\n-----\n\nAs early as the Winter of 2020, Intezer saw the\n\nthreat actor utilizing novel techniques to steal\n\nSSH credentials from the compromised machine\n\nwhen it was being used by administrators.\n\nTeamTNT has employed techniques to hide\n\ntheir activities on compromised machines,\n\nmaking incident response investigations more\n\ndifficult. All of their scripts are designed to\n\nbe executed without being written to disk or\n\nself deleted after execution. They have used\n\n\ntechniques of hiding their running processes\n\nby mounting an empty folder over the process\n\n[entry within the procfs, or by using UserLand](https://cybersecurity.att.com/blogs/labs-research/teamtnt-delivers-malware-with-new-detection-evasion-tool)\n\n[and kernel level rootkits.](https://www.cadosecurity.com/post/team-tnt-the-first-crypto-mining-worm-to-steal-aws-credentials)\n\nThe threat actor maintains a public persona on\n\n[Twitter using the handle HildeTNT. The majority](https://twitter.com/hildeTNT)\n\nof their tweets are written in German and the\n\naccount's location is set to Germany. In addition,\n\nmany comments in the shell scripts used by the\n\nthreat actor are written in German. Therefore,\n\n\nit can be assumed that TeamTNT’s country of\n\norigin is Germany. Much of their interaction\n\nwith the security industry is via commenting\n\non reports covering their campaigns, mostly\n\nto point out incorrect conclusions. During\n\nthe Spring of 2021, TeamTNT refuted some\n\ncampaigns attributed to them. The tools used\n\nin these campaigns were based on some of\n\nTeamTNT’s older scripts but not something they\n\ncurrently were using. This suggests another\n\nthreat actor has started to copy TeamTNT.\n\n\n###### Event timeline\n\n**Winter 2020** **Summer 2020** **Winter 2021** **Summer 2021**\nFebruary August January July\n\nCampaign that targets **Redis** Steals **AWS credentials and** First report on TeamTNT Continues to target\nis uploaded to VirusTotal updates SSH exploitation technique targeting **Kubernetes** + evidence unsecured Docker\n\nof Windows samples and Kubernetes servers\n\n2019 2022\n\n**Fall 2019** **Spring 2020** **Fall 2020** **Spring 2021**\nOctober May September May\n\nFirst evidence of activity First public report on TeamTNT activity. Uses legitimate cloud TeamTNT expands its\n\nTargets exposed **Docker** instances monitoring tool Weave Scope credential stealing\n\nas part of an attack\n\n\n-----\n\n## Die Einführung (Intro)\n\n\na steady migration from on-premise to cloud deployments. As part of\n\nthis migration, the security around services has also changed. On-prem\n\ndeployments can sometimes be more forgiving as a misconfigured\n\nservice would also be behind a corporate firewall, resulting in it not being\n\nexposed to everyone over the internet. A misconfigured cloud service\n\n[can be low-hanging fruit for an attacker. Palo Alto Networks investigated](https://unit42.paloaltonetworks.com/docker-honeypot/)\n\nthe attacks against cloud servers during the Spring of 2021 via a Docker\n\n\nattacks, around 76% were by cryptojacking threat actors. One of the most\n\nactive actors in this field is TeamTNT.\n\n[The first public report on TeamTNT was published in May 2020 by Trend](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\n\n[Micro and covered attacks against servers running exposed Docker](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\n\ninstances.\n\n\n## Die Einführung (Intro)\n\nSince the introduction of Amazon Web Services (AWS), there has been honeypot, finding that it was attacked about every 90 minutes. Of these\n\na steady migration from on-premise to cloud deployments. As part of attacks, around 76% were by cryptojacking threat actors. One of the most\n\n\n-----\n\nWhile this is early activity, it is not the earliest that can be attributed\n\nto the threat actor. As part of this report, we will share our knowledge\n\nabout campaigns that took place during February the same year and also\n\nprovide evidence that TeamTNT has been active since at least October\n\n2019.\n\nThe first set of campaigns by TeamTNT targeted only Redis instances.\n\nThroughout their over a year and a half tenure, they have migrated\n\naway from focusing on Redis to instead target Docker services and most\n\nrecently Kubernetes clusters. This includes the\n\n\nTeamTNT is a bit of an anomaly when it comes to cryptojacking threat\n\nactors. They have a public presence on the clear web while most threat\n\nactors stay hidden in the shadows. The threat actor has a public profile on\n\nTwitter and sometimes interacts with the research community tweeting\n\nabout the success of their current campaigns. Based on their social\n\nmedia account they are located in Germany and the majority of their\n\ntweets are written in German. The threat actor’s interaction with the\n\nresearch community mostly takes the form of commenting on incorrect\n\nconclusions made by analysts.\n\n\n[use of cloud monitoring software to deploy](https://www.intezer.com/blog/cloud-security/attackers-abusing-legitimate-cloud-monitoring-tools-to-conduct-cyber-attacks/)\n\ncryptominers on vulnerable servers.\n\nThe techniques and tools used by the threat\n\nactor have slightly evolved over time but the\n\ngeneral desired outcome has been the same.\n\nThe first campaign that we at Intezer uncovered,\n\ntaking place around February 2020, used\n\ntechniques for stealing credentials and tried to\n\nstay hidden on the compromised system. Many\n\nof the tools that are still used were leveraged in\n\nthe first set of campaigns.\n\n\n###### TeamTNT has a public profile on Twitter and sometimes interacts with the research community.\n\n\nDuring the Spring of 2021, some new campaigns\n\nwere uncovered that looked to have all the\n\nmakings of TeamTNT. In both cases, the threat\n\nactor was quick to point out that it was not their\n\ncampaign but rather someone was reusing their\n\nold scripts to make it look like it was them. Prior\n\nto this, TeamTNT had not refuted any campaigns\n\nattributed to them. Instead, they were mostly\n\nusing Twitter to show off their capabilities.\n\nThe activity from TeamTNT does not appear\n\n\nFor example, the Tsunami Internet Relay Chat (IRC) bot and the backdoor\n\nknown as Rathole were used. The majority of tools used by TeamTNT are\n\neither open-source or source-code-available but we have also identified\n\nsome custom written tools and a possible pivot to targeting Windows\n\nmachines. This is an interesting deviation, since TeamTNT appears to be\n\nheavily invested in targeting *NIX servers. The more recent campaigns\n\nhave targeted Kubernetes and cloud workloads with the goal to steal\n\ncloud-related configurations and credentials, in addition to running\n\ncryptominers.\n\n\nto be slowing down. They continue to reuse their tools in their attacks.\n\nThis may be because their operations are unhampered by security tools.\n\nBecause of this and the potential misinformation about the threat actor,\n\nwe decided to take a deeper dive into TeamTNT’s activities to gain a better\n\nunderstanding of their timeline and Tactics, Techniques, and Procedures\n\n(TTPs). With this knowledge, we aim to organize all of this information\n\nproperly into one resource to help security teams better detect and\n\nprevent attacks from this threat actor.\n\n\n-----\n\n## Der Anfang\n#### (The Beginning)\n\nWinter 2020 Summer 2020 Winter 2021 Summer 2021\n\n**Fall 2019** Spring 2020 Fall 2020 Spring 2021\n\n\n-----\n\nThe first public report on TeamTNT’s activity was\n\n[published by Trend Micro in May 2020. While](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\n\nthis report covers some of the early activities,\n\nit does not include the initial activity that can\n\nbe traced back to the threat actor. One of the\n\nnetwork indicators of compromise in this report\n\nis the domain name teamtnt[.]red. This domain\n\nwas registered on February 10, 2020 and is\n\none of the first references to TeamTNT by the\n\nthreat actor. This infrastructure was used by\n\nthe threat actor against attacks on unprotected\n\nRedis servers. The initial “setup” script used in\n\n[this campaign was uploaded to VirusTotal on](https://www.virustotal.com/gui/file/dad3016b75e89b415e3c7e360ec2ffa31e48b667082843013bbff719add826c7/details)\n\nFebruary 26, 2020. The setup script downloads\n\nthe rest of the modules used in the attack. Many\n\nof them are shell scripts that are directly piped\n\nto either bash or /bin/sh but some files were\n\nalso written to disk. Figure 1 shows a diagram of\n\nall the parts downloaded and executed by the\n\ndifferent modules. The oldest files that we were\n\nable to capture were added to the server four\n\ndays after the domain name was registered,\n\ngiving us a good indication of when the initial\n\n\ncampaign might have started.\n\n\n**Figure 1: Diagram showing how different parts are downloaded and executed**\nwhen the threat actor compromises an unprotected Redis server.\n\n\n-----\n\n###### The Setup\n\nThe infection on the machine started with the execution of the setup.sh\n\nshell script that was located in a subfolder called load. This script is\n\nresponsible for downloading and executing the other parts of the\n\ntoolchain used by TeamTNT. The file has a comment on the top as can\n\nbe seen in Figure 2. According to the comment, the file was the module\n\n**scan/pwn Redis Server Setup.**\n\n**Figure 2: The first few lines of the setup.sh file. The file sets up the machine to scan**\nand infect other Redis servers.\n\nOne of the first things the script does is check if a specific binary is running.\n\nIf it doesn’t run, it downloads a setup script called whois2.irc.sh for this\n\nbinary. The binary installed by this shell script is an instance of the Tsunami\n\nmalware. For more information about this malware, see the Tools section.\n\n\nTwo additional shell scripts were downloaded from the server (hosted at\n\nteamtnt.red), tmp.min.sh and sysinfo.txt. The first shell script installs the\n\nminer on the infected machine while the second collects host information.\n\nFollowing the download and execution of the shell scripts, the scripts try\n\nto hide their process. The shell commands executed are shown in Figure\n\n3. To hide the process, a shell script is created at /bin/hid. The shell script\n\nhides the process by first making a copy of /etc/mtab. After this, it mounts\n\nan empty folder over the process’s folder under /proc. Lastly, it overwrites\n\n\n**Figure 2: The first few lines of the setup.sh file. The file sets up the machine to scan**\nand infect other Redis servers.\n\n\n-----\n\nTo prevent other threat actors from also compromising the Redis instance,\n\nthe setup script added iptables rules to only accept connections on port\n\n6379 from localhost. The shell script also performs a request to the C2\n\nserver that appears to be for logging the infected machine's IP address.\n\nDuring this campaign, the threat actor focused on compromising\n\nunprotected Redis servers. The setup script creates the payload that is\n\nexecuted on the Redis servers. The code is shown in Figure 4. It’s using\n\n[Redis’s FLUSHALL issue to create a cron job that downloads a setup script.](https://redis.io/commands/FLUSHALL)\n\nThis setup script is almost identical to the main setup script, except that it\n\ndoesn’t set up Tsunami.\n\n**Figure 4: Code for creating the Redis payload.**\n\nThe setup script checks if Tsunami and bioset are running. If they are, the\n\nscript restarts the processes to hide them with the hid shell script. If they\n\nare not running, it downloads them followed by starting and hiding them.\n\nTo find other Redis servers to infect, the threat actor uses pnscan. The\n\nsetup script downloads the source code for the scanner and compiles it.\n\nThe scanner is “installed” at /usr/sbin/dbus-daemon. Another shell script\n\nis downloaded that handles scanning and sending the payload to any\n\nfound Redis servers. When all stages have been downloaded and started,\n\nthe setup script removes itself from the infected host.\n\n\n###### DDoS Bot Setup\n\nThis shell script downloads and installs the Tsunami DDoS bot. The\n\nscript installs the binary to two different places based on if the script was\n\nexecuted as root or not, Figure 5. If it is executed as root, the malware is\n\ninstalled to /bin/kthreadd, otherwise, it is installed to /tmp/.tmp. Before\n\ninstalling the malware, the script flushes and deletes all the iptables\n\nchains to ensure it can connect to the C2 server without any resistance.\n\n\n**Figure 4: Code for creating the Redis payload.**\n\n\n-----\n\n###### Gather Information About the System\n\nThe file sysinfo.txt, while disguised as a text file, is a shell script that is\n\nexecuted by the setup script. A “lock” file is created in case the script is\n\nexecuted multiple times on the same machine. Figure 6 shows the check\n\nfor the lock file. If it exists, the script exits early. If this is the first time it’s\n\n\nThe script also collects: username of the user executing the script, CPU\n\nspeed, how long the machine has been running, if it’s 32 or 64-bit, the\n\nnumber of CPU cores, and which Linux distribution. All of this information is\n\nsent to the threat actor’s server via the wget command shown in Figure 7.\n\nWhen the script is done, it deletes itself.\n\n\n**Figure 7: Exfiltration of host information to the actor-controlled server.**\n\n\n-----\n\nThe upload script is relatively simple, shown in Figure 10. It checks if the log\n\nfiles exist. If they do, it uses curl to upload the files before it is removed.\n\n\n###### Scan for Other Machines to Compromise\n\nThe dbus-config file downloaded by the setup script is a Redis exploit/scan\n\nmodule. As can be seen in Figure 11, it uses pnscan that was downloaded\n\nand compiled earlier. It scans the whole IPv4 space for other Redis servers.\n\nIf it finds another server, it uses the Redis client on the machine to send the\n\npayload, which causes the exploited service to set up a cron job that will\n\ndownload the setup script.\n\n**Figure 11: Redis scanning functionality.**\n\nThe results are uploaded to a threat actor-controlled server as can be seen\n\nin Figure 12.\n\n\n**Figure 10: Upload script for the strace logs.**\n\n\n**Figure 12: Scan results uploaded to a threat actor-controlled server**\n\n\n**Figure 9: SSH credential collection via strace. The log files are uploaded every five**\nminutes via a cron job.\n\n\n**Figure 12: Scan results uploaded to a threat actor-controlled server**\n\n\n-----\n\n###### Cryptomining NarrenKappe\n\n\nThe tmp.min.sh shell script’s main job is to set up the mining process. It\n\ndownloads the miner, a watchdog process, and the configuration file. The\n\ninstallation process depends on if the shell scripts have root permissions\n\nor not. If they do, a second stage is downloaded and executed to perform\n\nthe root setup. Otherwise, the scripts download and install the files into\n\nthe temp directory. The configuration is modified to be unique for each\n\ninfected host. A worker ID is created based on the username of the user\n\nexecuting the script and the machine name. The miner used is a fork\n\n[of XMRig called XMRigCC. It provides a dashboard that can be used to](https://github.com/Bendr0id/xmrigCC)\n\ncontrol the miner. The command center used in the campaign was located\n\nat 80.211.206.105.\n\n\nNarrenKappe, which translates to jester hat, is a mining setup script that\n\nis executed if the script has root-level permissions. Since it has higher\n\npermissions, it performs some additional actions than when executed as a\n\nnormal user.\n\nFirst, it checks if the watchdog process is running and exits the setup.\n\nOtherwise, it checks if old files from a previous infection exist on the\n\nmachine and removes them. Following this, it removes all the cron jobs on\n\nthe machine. It tries to clean out other infections using the commands in\n\nFigure 14.\n\n\n**Figure 13: Code reuse analysis of the watchdogd binary.**\n\n\n**Figure 13: Code reuse analysis of the watchdogd binary.**\n\n\n-----\n\nThe script downloads a 64-bit or 32-bit miner depending on what is\n\nsupported as can be seen in Figure 15.\n\n\nThe script ensures the processes are started again if the machine is\n\nrebooted. The script adds either a System V init script or a systemd service\n\ndepending on what is used by the system. The commands executed in\n\n\n**Figure 15: Download and installation steps used by the mining setup script.**\n\n\n**Figure 18: Cron job executed every hour.**\n\n\n-----\n\nIn addition to setting up the mining process, the script also starts another\n\nscript that: scans for Redis servers, downloads and executes a post\n[exploitation tool called punk.py, and exfiltrates SSH keys, bash history,](https://github.com/r3vn/punk.py)\n\nknown SSH hosts, and the host file.\n\n**Figure 20: First submission of the rathole binary to VirusTotal.**\n###### Removing All Traces\n\n\n**Figure 20: First submission of the rathole binary to VirusTotal.**\n\n\nThe cyo.sh script is run by the mining setup script if the watchdog process\n\nis already running. The script is used to clean out the logs on the machine.\n\n[First, it hides the process and downloads a log cleaner written in C. As can](https://packetstormsecurity.com/files/33821/log_clean.c.html)\n\nbe seen in Figure 19, the logs for the users reboot, hilde, and .r00t are\n\ncleared before it uploads the bash history of the root user to the threat\n\nactor’s server.\n\n**Figure 19: Log cleaning for three user accounts and exfiltration of the root user’s bash history.**\n\n###### Folgen Sie dem Semmelbrösel\n\nUsing information that was present in this campaign, we were able to\n\nfind some earlier activity. The rathole binary used in this campaign\n\nwas uploaded to VirusTotal as early as October 2019. Figure 20 shows a\n\nscreenshot of the submission date.\n\n\nA script file that was included in the archive with the miner but not used\n\nin this campaign included the functionality to download punk.py from a\n\nserver located at 116.62.122.90. This IP was found referenced in a shell\n\nscript file called ash.sh that was uploaded to VirusTotal in January 2020.\n\nIt has very similar functionality as observed in this campaign. An out\ncommented line in the file references the URL http[:]//3[.]215[.]110[.]66/\n\n**src/bioset. Additionally, the script adds an SSH key and creates a user**\n\n\n-----\n\n### A\n\nfro\n\nse\n\n## Der Frühling 2020\n#### (Spring 2020)\n\n\nWinter 2020 Summer 2020 Winter 2021\n\n\n[s reported by Trend Micro on May 6,2020,](https://www.trendmicro.com/vinfo/hk-en/security/news/virtualization-and-cloud/coinminer-ddos-bot-attack-docker-daemon-ports)\nTeamTNT targeted Docker daemon ports\n### A\nand abused them to install cryptomining\nmalware and DDoS malware. This is a shift\nfrom their previous targeting of Redis servers\nand appears to be the first documented\nevidence of the group targeting exposed\nDocker daemon ports and using them to\nspread malware.\n\nAs in the previous campaign, the group used\nseveral shell scripts to carry out the attack.\nThe first script mxutzh.sh is used to bootstrap\nthe infection by creating a container from an\nAlpine image. When the container is started,\nit uses the volume functionality to mount the\nhost system’s root filesystem to /mnt inside\nthe container. This gives the root user inside\nthe container the ability to modify the host\nmachine as if it was root on the host machine.\nThe container is set to download and execute\nanother script init.sh which in turn downloads\nand executes several shell scripts.\n\nThe use of scripts that download and execute\nthe malicious functionality evades detection\ntechniques because the image doesn’t contain\nsuspicious/malicious parts, therefore, it will\nnot be detected by static analysis tools such as\nimage scanners.\n\n\n### A\n\nfro\n\nse\n\n\n**Spring 2020** Fall 2020 Spring 2021\n\n\n-----\n\nAs mentioned above, the container\nis mounted to the filesystem of\nthe host so that the scripts are\nexecuted on the host.\nThe init.sh implements the\nfunctionality for deleting other\nminers, installing admin tools\nand cryptomining malware,\nimplementing evasion techniques\nand spreading to other victims.\nMany of the same techniques were\nused in the earlier campaigns.\n\n###### mxutzh.sh\n\nAs can be seen in Figure 23, mxutzh.sh gets an argument in the form\nof an IP address from the victim machine. Using the open-source\n[tool called masscan the script scans a predefined list of ports. The](https://github.com/robertdavidgraham/masscan)\nfunction uses ZGrab to identify if a Docker service is listening on\nthe port. ZGrab is an open-source application scanner created by\n[the individuals behind Censys.io. For all Docker services found, the](https://censys.io/)\nscript uses the exposed port to spawn a new container from the\nAlpine image. Using the bind method, the root directory of the victim\nmachine is mounted to the container filesystem. A shell command to\ndownload and execute the init.sh script is set to be executed using sh\nshell as soon as the container is created.\n\n\n**Figure 22: Overview of the scripts executed in this**\ncampaign (as described by Trend Micro).\n\n\n-----\n\n###### Init.sh\n\nThe init.sh script removes previous cronjobs\nnamed “COVID19” and “SARScov2” and then\nverifies that curl and bash are installed.\nIf not, the script installs them. Next, the script\ndownloads and executes scripts that include\nother functionalities for the attack.\n\nThe container is created with /bin/sh shell (as set\nin mxutzh.sh) but it seems that the group decided\nto use bash for some scripts and sh shell for other\nscripts.\n\nWhen we examined the Uniform Resource Locator\n(URL) http://45.9.148[.]123/COVID19/init.sh in\nVirusTotal we discovered another init.sh file,\nsubmitted on April 30, 2020, about one month\nbefore Trend Micro released their report. At the\ntime of the report the file had four detections.\n\n\n**Figure 24: Screenshot of init.sh**\n\n\n**Figure 26: Screenshot of the second init.sh file.**\n\n\n-----\n\nIt is interesting to note that the group included “COVID19” as part of\nthe URLs used to download scripts. Both init.sh scripts were uploaded\nto VirusTotal on April 30, 2020. Around this time the COVID-19\npandemic was spreading quickly around the world and countries\nentered lockdowns.\n\n**Figure 27: Number of daily new confirmed COVID-19 cases from March to May 2020.**\n[Source: Our World in Data](https://ourworldindata.org/covid-cases?country=IND~GBR~CAN~DEU~FRA~ESP~ISR#country-by-country-data-on-confirmed-cases)\n\nSome threat actors took advantage of the crisis and started abusing it\nas a theme for phishing activity knowing that people were desperate\nfor information related to the global pandemic. It is unclear if the use\nof the term “COVID-19” is part of an evasion technique since the group\ndoesn’t make other attempts to hide its activity.\n\n\n###### Clean.sh\n\n**Figure 28: Screenshot of clean.sh script.**\n\nThis script is responsible for: killing processes of other cryptominers,\ndeleting cron jobs and files used by other threat actors, removing\ncontainers that execute malware, and disabling monitoring services\nsuch as apparmor.\n\n\n**Figure 27: Number of daily new confirmed COVID-19 cases from March to May 2020.**\n[Source: Our World in Data](https://ourworldindata.org/covid-cases?country=IND~GBR~CAN~DEU~FRA~ESP~ISR#country-by-country-data-on-confirmed-cases)\n\n\n-----\n\n###### DNS\n\n**Figure 29: Screenshot of dns script.**\n\nThe init.sh script executes another script named dns. Based on the\n[architecture of the victim system, a tool called dns3 (link to analysis) is](https://analyze.intezer.com/files/07377cac8687a4cde6e29bc00314c265c7ad71a6919de91f689b58efe07770b0)\ndownloaded and masqueraded as part of systemd. Based on the code\nrelation this is Tsunami. It has 32-bit and 64-bit versions,\n\n\nboth versions which were submitted to VirusTotal on April 19, 2020.\nFor more information check the Tools section.\n\n\n**Figure 29: Screenshot of dns script.**\n\n\n-----\n\n###### Connection to Other Scripts\n\nThe IP 45.9.148[.]123 from the init.sh scripts in this campaign was\nresolved to vps.teamtnt[.]red on May 2, 2020 and located in The\nNetherlands. Based on VirusTotal the IP address is related to many\nmalicious scripts, two of these files are: lan.redis.pwn.sh, which was\nsubmitted on the day of the domain resolution, and the second file\n**minion_worker.sh was submitted a couple of days later.**\n\n|ix Fe|Col2|\n|---|---|\n|||\n\n\n**Figure 32: Graph showing the scripts**\nexecuted by lan.redis.pwn.sh\n\n\n###### minion_worker.sh\n\n**Figure 33: Screenshot showing minion_worker.sh**\n\nThe minion-setup.sh script targets Redis and uses the URL\n**http://45.9.148[.]123/MoneroOcean/sh/init.sh to download the**\ninit.sh script that will be executed on the exposed Redis instance.\n\nBoth scripts (minion_worker.sh and lan.redis.pwn.sh) target Redis and\nthey use the tools mentioned in the first campaign (bioset and pnscan).\nBased on similarities in the functionality and behavior of the scripts,\n\n\n**Figure 33: Screenshot showing minion_worker.sh**\n\nThe minion-setup.sh script targets Redis and uses the URL\n\n\n-----\n\n## Der Sommer 2020\n#### (Summer 2020)\n\nWinter 2020 **Summer 2020** Winter 2021 Summer 2021\n\nFall 2019 Spring 2020 Fall 2020 Spring 2021\n\n\n-----\n\nThroughout the Spring and Summer of 2020, TeamTNT targeted\nexposed Docker containers. The exploitation techniques used during\nthe Summer were very similar to the techniques used during the\nSpring. One key addition was the stealing of AWS credentials, as\n[first reported by Cado Security. The threat actor scanned the home](https://www.cadosecurity.com/post/team-tnt-the-first-crypto-mining-worm-to-steal-aws-credentials)\ndirectories of the users on the infected machine for the file ~/.aws/\n**credentials. If the file was found, it would be uploaded together with**\nthe /.aws/config file to a server controlled by the threat actor.\n\nThe threat actor also started to publish information on their website\nthat appears to have been collected during their campaign. The\nscreenshot of TeamTNT’s website, seen in Figure 34, shows a list of\n“free/open” sandboxes available on the internet. Since the earliest\ncampaign we detected, the threat actor has been logging the external\nIP of the machines they have infected. It is possible that they used this\ndata to identify these sandboxes.\n\n\n###### Docker Exploitation\n\nIn the Spring activity, the shell script called mxutzh.sh was used to\nexploit Docker hosts. It would call a function named pwn with three\narguments. The first of these arguments was the same first argument\npassed to the mxutzh.sh file when it is executed. During the Summer,\nthis logic was changed and it instead would get this value from a\ncompromised server. Figure 35 shows the changes. A similar script file\nwas also used to target other machines on the same network. Figure 36\nshows the function in the “lan” file that instead scans the local network.\n\n**Figure 35: Pwn function called. The function uses a URL to determine the range of IPs to**\nscan instead of it being passed onto the parent script file as an argument.\n\nThe pwn function was also\nchanged a bit. During the Spring,\nit would execute a command\nto download an alpine image.\nThe image is started with the\ninstruction to download an\n\n**Figure 36: Pwn function used to scan**\nother Docker servers on the same initialization shell script. In\nnetwork.\n\naddition to this functionality,\nduring the Summer campaign\n\nsetup, the shell script was also passed in as base-64 encoded data in\ncase the first method failed. Figure 37 shows part of the pwn function\nused during Summer. The threat actor also added instructions to\nperform the same attack using an Ubuntu image in addition to the\n**alpine image.**\n\n\n**Figure 36: Pwn function used to scan**\nother Docker servers on the same\nnetwork.\n\n\n**Figure 34: Screenshot from TeamTNT’s website. The website published unprotected**\n[sandboxes (Reproduced with permission from Cado Security: Team TNT – The First](https://www.cadosecurity.com)\n[Crypto-Mining Worm to Steal AWS Credentials 2020).](https://www.cadosecurity.com/post/team-tnt-the-first-crypto-mining-worm-to-steal-aws-credentials)\n\n\n-----\n\n[Palo Alto Networks released a report in August 2020 on a new malware](https://unit42.paloaltonetworks.com/cetus-cryptojacking-worm/)\n\nthat they attributed to TeamTNT. The malware, named Cetus, infected\n\none of the researcher’s Docker honeypots. Cetus essentially has two\n\njobs, start the miner and infect other servers running Docker. This\n\nappears to be the first custom written malware used by the threat actor.\n\nSince the beginning of their activity, TeamTNT has tried to hide their\n\nactivity on infected machines. In the early campaigns, they would mount\n\nan empty directory over a running process’s folder in the procfs to hide\n\nit from outputs with top and ps. In the Summer campaign, they took this\n\nfurther by using a Linux Kernel Module (LKM) rootkit. Figure 38 shows\n\nthe installation of the rootkit. The rootkit called Diamorphine is an\n\n[open-source rootkit hosted on GitHub.](https://github.com/m0nad/Diamorphine)\n\n\n**Figure 38: Setup script for Diamorphine. It installs kernel headers and build tools.**\n\n\nThe script installs the kernel headers and tools needed to compile the\nLKM before it downloads the source code for the rootkit via git. After the\nmodule has been compiled, it loads the module. The rootkit is used to\nhide the miner. This is performed by sending a signal 31 to the process.\nFigure 39 shows an example of this.\n\n\n**Figure 37: Part of the own function that is used to infect Docker servers with containers**\nto mine Monero.\n\n\n-----\n\n###### SSH Exploitation\n\nThe SSH exploitation technique was also updated during this time\nperiod. For example, more SSH related files are exfiltrated from the\ncompromised host, as seen in Figure 40.\nLike many other\nthreat actors that\ntarget Linux servers,\nTeamTNT also uses\nthe known_hosts\nfile to find other\nmachines that it may\n\n**Figure 40:** TeamTNT added more configuration and key files\nto its list to be exfiltrated from the compromised server. spread to. In addition\n\nto this, TeamTNT\n\nscans the networks that the machine is connected to using pnscan,\nto see which other machines have port 22 listening. As can be seen in\nFigure 41, the result is added to the known_hosts file.\n\n**Figure 41: TeamTNT scanning local networks for other machines that are listening on port 22.**\n\nTo find keys that can be used to authenticate to these machines, the\nthreat actor looks for id_rsa files in all home folders and checks for\ndefined IdentityFile configurations. Additionally, the bash history is\nchecked for uses of both SSH and scp. The threat actor uses similar\n\n\ntechniques to find more servers to spread to. As examples, it checks: the\nhost file for other machines, defined HostName in the SSH config files,\nbash history, items in the known_hosts files, and processes connected\nto external IPs on port 22. Similar methods are also used to determine\ndifferent user accounts that can be used to connect to the machines. It’s\nworth noting that since the earliest TeamTNT campaigns we uncovered,\nthe threat actor has exfiltrated the bash history files on machines they\nhave compromised. It is possible that they have used this data to devise\nthese methods for gathering keys and IP addresses from other machines\nthat can be used for lateral movements. Figure 42 shows the different\ncommands used.\n\n**Figure 42: List of commands used by TeamTNT to find SSH keys, machines and user accounts**\nthat can be used to infect other machines.\n\nThe collected data is added to “master” lists that the script enumerates\nthrough. Each username and key is used for all discovered servers. If\na successful login is achieved, a command is executed to download a\nsetup shell script on the machine. This logic can be seen in Figure 43.\n\n\n**Figure 42: List of commands used by TeamTNT to find SSH keys, machines and user accounts**\nthat can be used to infect other machines.\n\n\n-----\n\n###### Docker Containers\n\nIn addition to downloading “base” images from\n[Docker Hub to set up the attack, Aqua](https://blog.aquasec.com/container-security-tnt-container-attack)\n[Security released research on TeamTNT’s](https://blog.aquasec.com/container-security-tnt-container-attack)\nuse of custom images. The images uploaded\nby the user account hildeteamtnt to the\nhub was categorized into two categories:\n“Simple and straightforward” images used for\ncryptomining and “Sophisticated” used for\ncontainer escaping. The sophisticated images\nused the Docker Escape Tool, an open-source\n[tool hosted on GitHub. Much of the techniques](https://github.com/PercussiveElbow/docker-escape-tool)\nand tools used were very similar to the threat\nactor’s previous activity.\n\n\n**In addition to spreading to other machines the following files are downloaded:**\n\n**• docker-update (XMRig)**\n\n**[• tshd (Tiny SHell)](https://github.com/creaktive/tsh)**\n\n**• kube (Tsunami)**\n\n**• bioset (Rathole)**\n\n\nt\n\n###### Figure 43: For each enumerated host, the script tries to log in with the usernames and keys. If successful, the setup script is downloaded and executed on the machine.\n\n\n-----\n\n## Der Herbst 2020\n#### (Fall 2020)\n\nWinter 2020 Summer 2020 Winter 2021 Summer 2021\n\nFall 2019 Spring 2020 **Fall 2020** Spring 2021\n\n\n## Der Herbst 2020\n\n\nOn September 8, 2020 Intezer discovered that TeamTNT abused a\nlegitimate cloud monitoring tool called Weave Scope. The tool gives\nthe user full access to their cloud environment and is integrated with\nDocker, Kubernetes, the Distributed Cloud Operating System (DC/OS),\nand AWS Elastic Compute Cloud (ECS).\n\n\nWeave Scope is a powerful utility for working with microservices-based\napplications, as it has many features including: detailed information\nabout each container and processes running in them, memory usage of\neach container, links and connections between containers, and the\nability to start, stop, and open interactive shells in any of these\ncontainers. Figure 44 shows a screenshot of the Weave Scope dashboard.\n\n\n## Der Herbst 2020\n#### (Fall 2020)\n\nWinter 2020 Summer 2020 Winter 2021 Summer 2021\n\nSpring 2020 **Fall 2020** Spring 2021\n\n\n-----\n\nThis was the first time TeamTNT was found using a legitimate tool\nfor the purpose of gaining control over the victim’s infrastructure. By\ninstalling a legitimate tool such as Weave Scope the attackers gained\nall the benefits as if they had installed a backdoor on the server, with\nsignificantly less effort and without needing to use malware.\n\nWeave Scope is an open-source project and its installation is relatively\neasy. The attackers created a container based on an Ubuntu image\nand used the mount functionality. This method was described in\n\n\n###### Figure 44: Screenshot of Weave Scope dashboard.\n\n\nthe previous section. At this point the attacker had full access to the\nfilesystem of the victim machine, so they downloaded and installed\n[Weave Scope as described in the project’s Git:](https://github.com/weaveworks/scope)\n\n\n###### Figure 45: Commands to install Weave Scope.\n\n\n-----\n\nThe dashboard of Weave Scope is accessible on port\n4040. By exposing this port the attackers gained full\naccess to all of the features of this tool.\n\nThroughout the Fall of 2020, TeamTNT also expanded\ntheir TTPs around credential stealing to not only target\n[stored AWS credentials. In a report published by](https://unit42.paloaltonetworks.com/black-t-cryptojacking-variant/)\n[Palo Alto Networks in October 2020, the researchers](https://unit42.paloaltonetworks.com/black-t-cryptojacking-variant/)\nreported on uses of mimipenguin and mimipy by\nthe threat actor. Both of these tools are designed to\ndump passwords from various processes’ memory.\nThey are essentially the *NIX equivalent of Mimikatz for\nWindows. After the credentials had been dumped, they\nwere exfiltrated to TeamTNT’s C2 server.\n\n[Later the same month, ESET tweeted about a new](https://twitter.com/ESETresearch/status/1321246274570620929)\ntool the threat actor had added to their arsenal. The\nresearchers found a binary written in Go with an AES\nencrypted payload. When the crypter was executed, it\nwould decrypt the payload and write it to a memory\nonly file created with the system call memfd_create.\nThe tool was identified as Ezuri, an open-source project\n[created by a security researcher.](https://twitter.com/guitmz)\n\n\n**Figure 46: Tweet published by ESET research reporting on the initial**\nfinding of TeamTNT’s use of Ezuri to crypt their malware\n\n\n**Figure 46: Tweet published by ESET research reporting on the initial**\n\n\n-----\n\n## Der Winter 2021\n#### (Winter 2021)\n\nWinter 2020 Summer 2020 **Winter 2021** Summer 2021\n\nFall 2019 Spring 2020 Fall 2020 Spring 2021\n\n\n-----\n\n[In January 2021, Lacework Labs released a detailed analysis of Tsunami,](https://www.lacework.com/teamtnt-builds-botnet-from-chinese-cloud-servers/)\n\nthe IRC bot used by TeamTNT. By extracting the configurations embedded\n\nin the malware, they could connect to the IRC server and get more\n\ninformation about the threat actor’s operation and victim information.\n\nAt the time of their analysis, around 200 bots were connected but only\n\n90 unique IP addresses were detected. We have seen that TeamTNT has\n\nemployed techniques to spread to other servers within internal networks.\n\nThis suggests that some of the bots were behind a NAT and shared the\n\nsame external IP address. The majority of the infected machines were\n\nlocated in Asia with servers hosted in cloud\n\n\nKubernetes node has a running agent called kubelet which takes RESTful\n\nrequests and performs operations on the pods accordingly. The default\n\nconfiguration of standard Kubernetes deployments allow anonymous access\n\nto kubelet. TeamTNT used this misconfiguration to gain access to exposed\n\nKubernetes instances and run cryptomining malware in the containers.\n\n[This campaign was reported by Palo Alto Networks who described a](https://unit42.paloaltonetworks.com/hildegard-malware-teamtnt/)\n\nnew malware called Hildegard that was first seen in this campaign.\n\nIn this campaign there was no use of container images. The malicious\n\nfunctionality was carried out using a reverse shell\n\n\nproviders Tencent, Alibaba, and Amazon Network\n\nbeing the largest. Outside of Asia, the United\n\nStates, France, and Germany had the most bots.\n\nThe researchers also uncovered that some of\n\nthese infected machines were used to launch new\n\ncampaigns.\n\nThe threat actor also added more tools to hide\n\ntheir activity on the infected machines. In January\n\n[2021, AT&T Alien Labs released a report on](https://cybersecurity.att.com/blogs/labs-research/teamtnt-delivers-malware-with-new-detection-evasion-tool)\n\nTeamTNT’s use of libprocesshider. The tool is\n\n\n###### The majority of the infected machines were located in Asia. Some of which were used to launch new campaigns.\n\n\nand abusing containers that were already running.\n\nFinding containers and nodes that could be attacked\n\nwas accomplished by two tools: masscan (a tool that\n\nwas described in the previous section) and kubelet.\n\nTo evade detection this campaign uses LD_PRELOAD\n\nas described in the previous section and it deletes\n\nthe scripts immediately after their execution.\n\n[The campaign dropped two files: Peirates, a](https://github.com/inguardians/peirates)\n\npenetration tool for Kubernetes that steals cluster\n\n\nused to hide processes using LD_PRELOAD. The shared object was written\n\nto /usr/local/lib/systemhealt.so by the setup script and directives were\n\nadded to /etc/ld.so.preload to allow the shared object to be loaded with\n\nevery file that is executed. TeamTNT used libprocesshider to hide their\n\nTsunami bot on infected machines.\n\n###### Attacking Kubernetes\n\nThe use of LD_PRELOAD to hide itself was spotted in another campaign\n\nof the group, this time targeting exposed Kubernetes instances. Each\n\n\n[credentials, and BOtB, a tool for performing a container breakout using](https://github.com/brompwnie/botb)\n\nknown vulnerabilities.\n\nTo establish a connection with the Command and control (C2) server the\n\n[malware used tmate or the Tsunami bot. It is unclear how the group](https://analyze.intezer.com/analyses/955136f1-0770-43ef-966e-4cd754462dfb)\n\ndecides which tool to use.\n\nIn this campaign the Tsunami bot was packed using Ezuri in an attempt\n\nto evade detection. The process name of the bot was set to ‘bioset’ to\n\nmasquerade as a legitimate process. This process name was used by the\n\ngroup in previous campaigns.\n\n\n-----\n\n###### Windows Targeting Attempt?\n\nWhile investigating TeamTNT’s infrastructure, we noticed that two Windows\nPE files had been downloaded from one of the domain names according to\nVirusTotal. A screenshot from VirusTotal is shown in Figure 47.\n\n**Figure 47: Windows binaries downloaded from TeamTNT’s infrastructure in February 2021.**\n\n**Figure 48: Part of AutoIT script that uses WinPcap to steal sensitive data transferred over**\n\nThe first file, sniffer.exe, is a compiled AutoIt script. A part of the script the network.\nis shown in Figure 48. The script downloads WinPcap and tries to steal\nsensitive data from network traffic. It looks for keywords of usernames, The second file, svchost2.exe, runs an XMRig Miner. A code reuse\npasswords, credit card information, cookies, etc. analysis of the file is shown in Figure 49. The file “installs” itself to the\nuser’s home folder as the file name notepad.exe. The mining software\nis compiled with CUDA support to take advantage of a NVIDIA graphics\ncard that might be available on the compromised machine.\n\n\n**Figure 47: Windows binaries downloaded from TeamTNT’s infrastructure in February 2021.**\n\nThe first file, , is a compiled script. A part of the script\n\n\n-----\n\nWhen the cryptominer is executed, it drops\na driver to the user’s AppData\\Roaming\\\n**WinCFG\\Libs\\ folder. From gene analysis, this**\ndriver was identified as WinRing0x64 from\n**OpenLibSys. The driver allows user space**\napplications to access ring 0, essentially giving\nthe process unfettered access. This driver is\n[part of XMRig for Windows. The miner uses](https://xmrig.com/docs/miner/randomx-optimization-guide/msr)\nthe driver to access MSR registers to improve\nthe mining performance. While the driver is\npart of a legitimate application, it does provide\na loophole that can be used to bypass a trust\nboundary.\n\n\n**Figure 49: Code reuse analysis of svchost2.exe shows that the file executes a XMRig Miner.**\n\nWhile we were not able to attribute these files to a campaign, the\n\n\n-----\n\nuring the Spring of 2021, TeamTNT\n\nexpanded their credential stealing. In a shell\n\n### D\n\n[script found by Trend Micro, the threat actor](https://www.trendmicro.com/en_gb/research/21/e/teamtnt-extended-credential-harvester-targets-cloud-services-other-software.html)\n\nhad expanded their search to the following\n\napplications and services:\n\n**•** SSH\n\n**•** AWS\n\n**•** Docker\n\n**•** S3\n\n**•** GitHub\n\n**•** Shodan\n\n**•** Google Cloud\n\n**•** Ngrok\n\n**•** Pidgin\n\n**•** FileZilla\n\n**•** HexChat\n\n**•** MoneroGuiWallet\n\n**•** CloudFlared\n\n**•** Davfs2\n\n**•** PostgreSQL\n\n**•** SMB\n\nThe script, shown in Figure 51, searches for\n\nthe files but does not exfiltrate the data. It’s\n\nnot known if and how TeamTNT exfiltrated the\n\nidentified files as part of the campaign.\n\n\n## Der Frühling 2021\n#### (Spring 2021)\n\nSummer 2020 Winter 2021\n\nSpring 2020 Fall 2020 **Spring 2021**\n\n\n### D\n\nh\n\n**•**\n\n**•**\n\n**•**\n\n**•**\n\n\n-----\n\nIn addition to the credential search, the threat actor also started to\n\nenumerate data from the cloud environment that it was running on. Figure\n\n52 shows a snippet of the script grab_aws_data.sh that uses AWS CLI to\n\nextract data.\n\n**Figure 51: Script by TeamTNT searches for files that normally hold credentials.**\n\n[According to Trend Micro, close to 50,000 IP addresses running](https://www.trendmicro.com/en_us/research/21/e/teamtnt-targets-kubernetes--nearly-50-000-ips-compromised.html)\n\n**Kubernetes were compromised between March and May of 2021.**\n\nThe majority of the machines were located in China. The machines are\n\npredominantly hosted by cloud providers. This distribution is similar to\n\nwhat Lacework Labs reported in January the same year but with a much\n\nlarger volume.\n\n\n**Figure 51: Script by TeamTNT searches for files that normally hold credentials.**\n\n\n-----\n\n## Der Sommer 2021\n#### (Summer 2021)\n\nWinter 2020 Summer 2020 Winter 2021 **Summer 2021**\n\nFall 2019 Spring 2020 Fall 2020 Spring 2021\n\n\nWinter 2020 Summer 2020 Winter 2021 **Summer 2021**\n\nSpring 2020 Fall 2020 Spring 2021\n\n\n-----\n\nDuring the Summer of 2021, TeamTNT continued to target unsecured\n\nDocker and Kubernetes servers. Due to other threat actors using some of\n\nTeamTNT’s scripts during the Spring of 2021, TeamTNT added some new\n\nways to identify their scripts. The threat actor announced the changes on\n\ntheir Twitter account as can be seen in Figure 53.\n\n\nFigure 54 shows the first few lines of a script file that was used during the\n\ncampaign. The file includes the information that the threat actor claimed\n\nwould be added. Further down in the file is a URL from where the script\n\nwas downloaded from.\n\n\n**Figure 54: First few lines in the script file used during Summer 2021.**\n\n\n-----\n\n**Figure 56: Function in the scanner script that exploits insecure Docker services.**\n\nTeamTNT also made some changes to the wallet. Instead of having\n\n\nAs in previous campaigns targeting vulnerable Docker instances, the use of\n\nmasscan/pnscan with zgrab was used in the Summer to find the instances.\n\nFigure 56 shows the payload executed on the vulnerable machines.\n\nFirst, it tells Docker to download an alpine image that downloads the\n\nscanning script and infects the machine with a miner. In addition, a Weave\n\nScope probe is installed on the machine.\n\n\n**Figure 57: Added functionality to download the most recent wallet. If the request fails, a hard-**\ncoded backup address is used.\n\n\n-----\n\n## Soziale Aktivität\n#### (Social Media Activity)\n\n\n-----\n\nFor being a threat actor, TeamTNT maintains a\npublic persona on Twitter. The Twitter account\n@HildeTNT, shown in Figure 58, was created in\nAugust 2020. The first campaign of the threat\nactor was reported in May 2020, while we have\nidentified some activity dating back to October\n2019. The account was created during the\nSummer of 2020 when many reports covering\nthe actor's activity were published. Based on\nthe information provided in the profile their\nregion is Germany.\n\n**Figure 58: Screenshot of TeamTNT’s Twitter profile.**\n\nIn the graph presented in Figure 59, the threat\nactor is active on Twitter during all hours of\nthe day. The data presented in the figure has\nbeen adjusted to UTC timezone. If we assume\nTeamTNT is based in a European time zone,\nwe can conclude that the “spike” in number of\ntweets corresponds from late afternoon until\nevening time in Europe.\n\n\nPlotting the activity on a timeline we can see when the threat actor has been most active and any\npotential downtimes. In Figure 60 we can see that the most socially active period was from the\nmiddle of January 2021 until the middle of May 2021. There is a less active period at the end of\n2020 which correlates to the Christmas holidays and New Year. It appears as the activity might be\nslowing down.\n\n\n**Figure 59: A graph showing the correlation between hours of the day (in UTC) and number of tweets.**\n\nPlotting the activity on a timeline we can see when the threat actor has been most active and any\n\n\n**Figure 58: Screenshot of TeamTNT’s Twitter profile.**\n\n\n-----\n\n**Figure 60: Scatter graph representing the date and hour of each tweet.**\n\nMost of TeamTNT’s tweets are in German and the content varies from commenting on political\n\n\n**Figure 61: Tweet by TeamTNT replying to a research article**\nmade about them Translated from German\n\n\n**Figure 62: A reply by TeamTNT to another user on Twitter.**\nTranslated from German.\n\n\n-----\n\nIn June, Palo Alto Networks’ Unit 42 released a\n\n\nThe group responded to other tweets that\nmentioned this blog, saying: “Das ist KEINE\nTeamTNT Kampagne!” (from German: “This is\n\nNOT a TeamTNT campaign!”). The threat actor\nhas a history of commenting on previous reports\ndocumenting their activity. Sometimes they\nretweet the links to the report or comment\non statements. They haven’t refuted previous\ncampaigns which suggests that they want to take\ncredit for their activity. Based on their previous\nbehavior, we assess that the refuted campaign is\nnot by TeamTNT and instead by an imitator.\n\n\n**Figure 64: Script shared by TeamTNT.**\n\n\n-----\n\n## Werkzeuge\n#### (Tools)\n\n\n-----\n\n###### Tsunami (Kaiten)\n\n[TeamTNT uses an IRC bot malware known as Tsunami. Figure 65 shows](https://malpedia.caad.fkie.fraunhofer.de/details/elf.tsunami)\n\nthe code reuse analysis of the bot used in the first set of campaigns.\n\nTsunami allows the operator to perform DDoS attacks against targets or\n\nexecute commands on the infected machine.\n\nThe source code for the bot was published in 2014. A forked and updated\n\nversion called ziggystartux is available on GitHub. Figure 66 shows the\n\nGitHub repository for the project.\n\nThe bot used by TeamTNT does not appear to have been compiled from\n\nthis code. Instead it appears to have been compiled from an earlier version.\n\n[There are multiple repositories in GitHub hosting the original published](https://github.com/search?l=C&p=1&q=%22NOTICE+%25s+%3AKaiten+wa+goraku%22&type=Code)\n\ncode. All of these have the bot version string found in the binary used by\n\nTeamTNT, as well as support for the same commands. The commands\n\nsupported by the bot are shown in the code snippets below.\n\n```\nTSUNAMI <target> <secs>   = A PUSH+ACK flooder       \nPAN <target> <port> <secs> = A SYN flooder         \nUDP <target> <port> <secs> = An UDP flooder         \nUNKNOWN <target> <secs>   = Another non-spoof udp flooder \nNICK <nick>         = Changes the nick of the client \nSERVER <server>       = Changes servers        \nGETSPOOFS          = Gets the current spoofing   \nSPOOFS <subnet>       = Changes spoofing to a subnet  \nDISABLE           = Disables all packeting from this bot\nENABLE           = Enables all packeting from this bot\nKILL            = Kills the knight        \nGET <http address> <save as>  = Downloads a file off the web  \nVERSION           = Requests version of knight   \nKILLALL           = Kills all current packeting  \nHELP            = Displays this         \nIRC <command>        = Sends this command to the server  \nSH <command>        = Executes a command\n\n```\n\n**Figure 66: GitHub repository of ZiggyStarTux.**\n\n\n-----\n\n###### TeamTNT’s Configuration\n\nAs can be seen in Figure 67, the bot is setting a “fake” application name to\n\n**kthreadd, masquerading as a kernel thread.**\n\n\n[Rathole is an open-source Unix backdoor with its code hosted on GitHub](https://github.com/IncSTK/rathole)\n\n(Figure 68). A code reuse analysis is shown in Figure 69. The backdoor\n\ncan be compiled on standard Linux distributions, it supports blowfish\n\nencryption, process name hiding and preferable shell.\n\n\n**Figure 68: GitHub repository hosting the Rathole backdoor.**\n\n\n**Figure 69: Code reuse analysis of Rathole binary used by TeamTNT.**\n\n\n-----\n\n**Figure 72: Ezuri’s main function and decryption logic.**\n\n\n-----\n\n###### Punk.py\n\n[Punk.py is a post-exploitation tool for Unix systems written by Giuseppe Corti. It’s open-source and hosted on GitHub. Figure 74 shows a screenshot of](https://github.com/r3vn/punk.py)\n\nthe GitHub repository. It uses credentials found on the exploited host to try to access other machines that are part of the SSH known_hosts database. It\n\nhas the ability to execute a command on all machines that it manages to log into.\n\n\n-----\n\n###### libprocesshider\n\nThe libprocesshider is a source code-available project on GitHub. A screenshot of the repository is shown in Figure 75. The project is compiled as a\n\nshared object. If it is loaded using LD_PRELOAD it “hooks” some libc functions which allows the library to hide a process from commands like ps, lsof,\n\nand top.\n\n\n-----\n\n###### tmate masscan\n\n\n[Tmate is an open-source tool that provides an easy and secure way to share the terminal. It](https://tmate.io/)\n\nestablishes a secure connection over SSH to the tmate.io website and generates a random URL\n\nfor each session. The user can share the URL with other trusted users. Tmate supports all popular\n\noperating systems, including GNU/Linux, macOS, and BSD systems.\n\n\nMasscan is a TCP port scanner written by\n\nsecurity researcher Robert Graham, also known\n\n[as ErrataRob on Twitter. The scanner has been](https://twitter.com/ErrataRob)\n\ndesigned to scan the IPv4 address space very\n\nquickly and can be used for internet-wide\n\nscanning. To achieve this speed it needs to use a\n\nuserland-based network stack.\n\n###### pnscan\n\nPnscan, also known as Peter’s parallel Network\n\nScanner, is a similar tool to masscan. It can\n\nbe used to scan an IPv4 network for SSH, FTP,\n\nSMTP, Web, IDENT, and other services. The\n\nsource code is hosted on GitHub.\n\n###### Tiny SHell\n\n[Tiny SHell (tsh) is an open-source Unix backdoor,](https://github.com/creaktive/tsh)\n\ndivided into client and server, written in C. It is\n\nsmall in size and supports multiple file transfers.\n\n\n-----\n\n###### MimiPenguin\n\n[MimiPenguin is an open-source tool thal extracts login passwords similar to Mimikatz in Windows. It dumps processes that](https://github.com/huntergregal/mimipenguin)\n\nare loaded into memory and extracts lines that may contain cleartext passwords.\n\n**Figure 77: Screenshot of the GitHub project MimiPenguin.**\n\n###### Mimipy BotB\n\n\n[Mimipy is a cross-platform and open-source tool that dumps passwords from](https://github.com/n1nj4sec/mimipy)\n\nprocesses in memory. It is based on MimiPenguin mentioned above. Mimipy\n\nhas other features that include: extracting credentials from browsers and\n\nHTTP servers, support for lightDM, and overwriting passwords.\n\n\n**Figure 77: Screenshot of the GitHub project MimiPenguin.**\n\n\n[Break out of the Box (BotB) is an open-source tool designed to be](https://github.com/brompwnie/botb)\n\nused by pentesters. It has many capabilities: exploits known container\n\nvulnerabilities to break out of the container, find and use Kubernetes and\n\nGCP secrets, push data to an S3 bucket, and more.\n\n\n-----\n\n###### Diamorphine\n\n[Diamorphine is a Linux Kernel Module rootkit written by Victor Ramos Mello. It’s hosted on GitHub and has support for kernel versions 2.6.x/3.x/4.x/5.x.](https://twitter.com/m0nadlabs)\n\nIt can hide processes, files and elevate a given user to root. Interactions with the rootkit are via signals.\n\n\n-----\n\n###### Docker Escape Tool\n\n[Docker Escape Tool is an open-source tool hosted on GitHub that identifies Docker containers and tries to escape the container using known](https://github.com/PercussiveElbow/docker-escape-tool)\n\ntechniques. The purpose of the tool is to assess the security of containers. Implemented techniques include: mount Docker Unix socket, reach the\n\nDocker daemon on the default ports, and exploit a vulnerability in RunC that allows attackers to overwrite the host RunC binary (CVE-2019-5736).\n\n\n-----\n\n## Das Fazit\n#### (Conclusion)\n\n\nIllicit cryptomining has become the major threat to Linux servers and\n\ncloud environments. TeamTNT is one of the predominant threat actors\n\nin this field. TeamTNT’s activity can be traced back to the Fall of 2019 in\n\nattacks against Redis servers. From this humble beginning, the threat\n\nactor has changed its targets towards servers running Docker and now\n\ncurrently Kubernetes clusters. Most of the tooling and tactics used by the\n\ngroup is similar to other threat actors in the field. They predominantly\n\nstructure their attacks around a set of multiple shell scripts but also use\n\nopen-source and source available tools. The shell scripts are rarely written\n\nto disk, instead they are downloaded using curl or wget and “piped”\n\ndirectly into a shell interpreter. This can make it hard to investigate what\n\nhas happened to a compromised machine as no artifacts on the machine\n\nexist. They also clear logs to make the investigation even harder.\n\nSince they are competing with other cryptojacking-focused threat\n\nactors, TeamTNT employs different techniques to ensure that only their\n\ncryptominer is running. In early campaigns, we have seen them “plug the\n\nhole” used to compromise the machine, for example, by adding firewall\n\nrules to block external network connections to access the vulnerable\n\n\nservice. TeamTNT has also used different techniques for hiding their\n\nprocesses on the machine, including userland rootkits. Some of the scripts\n\nalso include lists of other known cryptominers that the threat actor tries\n\nto kill on the machine. This is a common technique employed by many\n\nother threat actors in this field which essentially turns the compromised\n\nmachine into a game of “King of the Hill.”\n\nWhat separates TeamTNT from other major threat actors in the\n\ncryptojacking field is their public presence on the clear web. They maintain\n\na public appearance on Twitter and frequently tweet. Based on the public\n\npersona, it can be assumed that they are based in Germany. The threat\n\nactor commonly interacts with German politicians, tweets about their\n\nongoing campaigns, and comments on reports by the security industry. The\n\nmajority of these comments are to take credit for their work. During the\n\nSpring of 2021, some campaigns were attributed to TeamTNT but the threat\n\nactor refuted that it was their work. This suggested the emergence of an\n\nimitator reusing some of TeamTNT’s older shell scripts. It remains to be seen\n\nif this will affect their activity and if they will continue to target Kubernetes\n\nclusters or if they will move on and target new cloud infrastructure.\n\n\n## Das Fazit\n#### (Conclusion)\n\n\n-----\n\n# IoCs\n\n\n-----\n\n###### Pre-February Campaign\n\n Files\n\n\n###### Name\n\n\n###### SHA256\n\n\nbsh.sh\n\n\n125dc99b9f94d5548bb68b371cb2ff22134b60b1fef915d1ae85b025f4039be0\n\n\nash.sh\n\nhole64\n\n###### Network\n\n Value\n\n\n561b76684d80084bd4b924e439f7e37683f486ca94fa088f283402dc7443271c\n\n\ndcc96cdc7192a41fb242a680a83969e16247511816dc0f80e63b134059497ad1\n\n\nda43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\n\n36.7.154.124\n\n\n116.62.122.90\n\n\n3.215.110.66\n\n\n125.254.128.200\n\n\n-----\n\n###### SSH Key\n\nssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDIzB9hz7bNT6qtQKCMcitaaxEB9RyJEZuumE+gUMrh6hg3ccSMg9qnAlS/Lmw5Sw\n\nwLJQXMB5WuhclPJsVawuP+pfsm1ZiGF2JnczEW5kBw1o5Fl/6WOV1p9MOaXHAbpi7o/5Zauu3lTktyIWuP5R9l/2pUWcFZInnaiOr1KNt\n\nCBPisNYbZ4FWAQVGwXzUWZ/ZE7SYIoOUm3EJihPPiTulegUmIzc7TzrnEn9M3U8K+LVFye+wDeSC3WNYwfjGQJA4aFsANOiz89olh77\n\nG7IaDR8LghNfVVkRjaJ6onDZwb2CZWSivkFsdYtL6690S407eqoes7wkJudo9Qxsn9wxNv\n\n###### February 2020 Campaign\n\n Files\n\n Name SHA256\n\n\n32bit.tar.gz\n\n\n40c298446a7e53c3775f67deedf5d13b7c2c601de3c744f72fda42f99c156075\n\n\n64bit.tar.gz\n\n\n4f2ee441b35e8e0fe99608a011b632db219bd6631bcda39899b747a0dd38b5c6\n\n\nbioset\n\n\nda43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\n\nconfig.json\n\n\n1470c3100b976ae2d4f9a1def5d6c6715d4f050e7de5e261b5d4e4a2faf9603d\n\n\ncyo.sh\n\n\n77334b8e3c8df468eda2ef93467d63e41dab7beb451a3bbb5637473fabc620d6\n\n\ndbus-config\n\n\nb7225aefd8fb399a7f18639c32c59442daa5401b6164130e316092e8618f667f\n\n\nFullCleanUp.sh\n\n\n6a1221fc82b2bf13dc8112795d3edfb7bab8df7a9d4af69b89da4ac31e0e87e5\n\n\nhfile\n\n\ne5f48ccf07addd83986f5b6f9444d5f91cacbb5c471b815a2b68a9c02727821b\n\n\nhid.sh\n\n\nfe6e522ff266867060fa70d85be299ac5b12f2888935c5fe6e0a07d3ccaa1de2\n\n\nlogs.c\n\n\n59aa2101b05225dd0eb7e7b456eb26357540723e3c1d8a10deca83e9715a10fb\n\n\n-----\n\n###### Name SHA256 Comment\n\n\nsetup.sh\n\n\nb5ba2c86ebf85cbf700c83d7edc034717d7ee08e84fbae440a38139c15ef7a27\n\n\nSetup from minion folder\n\n\nNarrenKappe.sh\n\n\na25a73af06c43a20eb9f4f8b67357cec3c74143ccf97ce666446296a360d93fa\n\n\npnscan-1.11.tar.gz\n\n\n702b123a3abd518ac696c9e340e1aaf4742d271922b8b537d8595ea6486d7aa8\n\n\npunk.py\n\n\na66140870d0a71c7bd42b7631e4a85858e6b33e4a21be637b94d41833dee8383\n\n\nrd.sh\n\n\nd42ee8a001de9b13496f2980de6ca22b544a5a9012e9e97374343411593c2c29\n\n\nsetup.sh\n\n\ndad3016b75e89b415e3c7e360ec2ffa31e48b667082843013bbff719add826c7\n\n\nSetup from load folder\n\n\ns_poor.ssh.sh\n\n\n1eead4f456ed8741d1de821e2fcecb026c1cbbf3477786cc3e637eac05811f46\n\n\nsysinfo.txt\n\n\n53ba0436084f054c9c2c8aaf110f2c89c3c8b1fd9f1e4ca48cedfa86b7dece81\n\n\ntmp.min.sh\n\n\n669ace6d57c68e4a7f2fabcacfecf485a5c90bfc28a809a432e68b53f60836a4\n\n\nwatchdogd.tar.gz\n\n\ne0876231c4829e0c7be4ffe47466b57e17a15e9c1529f332f813ea532716c945\n\n\nwhois2.irc.sh\n\n\n795a3d99c1e8e34a6228d95c4435c5ed7c866dc0e303f9788ea6fe055b1a7ac6\n\n\nwhois.irc\n\n\n205db0ef59cad167c6132916f8f7a1d1963e740b36400419b2e5ba307e9f765c\n\n\n-----\n\n###### 32-bit Archive\n\n Name SHA256\n\n\nwatchdogd\n\n\n69fea980538a12ac0791f0801fc93d8b4d16e8329793d635221a16f935e8ca07\n\n\nXMRig Miner\n\n###### 64-bit Archive\n\n\n4256402fc04e49f3da8d1bf88efdcca6a3b03f4b881777d2c32a8df364cececd\n\n\n###### Name SHA256\n\n\nbioset\n\n\nda43ed194729f82db68b1d91a17cea6afde8ae81357116c35c4c129888a836bf\n\n\nconfig.json\n\n\n285e91d3d578fcaf6665c70de457f602d572203b04c281c03b4bf9103aa5f61f\n\n\ndo.sh\n\n\n9c29d4ecf6a60e7bfc0afbaa7a669a18af163440730711367d1c715042b5f755\n\n\nlo\n\n\n920014ace9add87139db41eb2538b292ad136fde7ac5f683eb3b31e0fed5f808\n\n\nrstart.sh\n\n\n4beaf3edbd1065c0dfd02cf864effe3d1e18d0f39275f0d49cb21951a12976c3\n\n\nsystemd-clean\n\n\n3a2aa7235f0617df430b3d556779bee2ae0af75d7c2f17f052971d3f38fad9e0\n\n\nwatchdogd\n\n\nfdf26ebad48da26be59b5784f43d1e5ee2efa93c59a717fe2ae1d82bf3f016d3\n\n\nwatchdogd.initd\n\n\n16b26d9e4413c2f6d081ca093106935673747d5266aaa33f51c845e65b90e904\n\n\nwatchdogd.service\n\n\n264c9b440f2fbd03000211a92a8bbb190f69c78dc087b8f757b3e8676554df57\n\n\nwatchdogd-stop\n\n\n020ba2a9f603588dbc6498a6e230249c6952daa920a58de89d997b3fcdc4c115\n\n\nXMRig Miner\n\n\nb6f57f8a7fba70d6660335828d2a14029c88079a8176dca2c63281a759fd84ca\n\n\n-----\n\n###### Network\n\n Value Comment\n\n\nicanhazip.com\n\n\nUsed to determine IP\n\n\nteamtnt.red\n\n\nMain server\n\n\n123.56.193.119\n\n\nExfiltration server\n\n\n116.62.122.90\n\n\nOld server still used by some scripts\n\n\n120.26.230.68\n\n\nMiner CC\n\n\n80.211.206.105\n\n###### Wallet\n\n\nCommand center\n\n\n[89X8a5RqKMGLubB19DwVVqPxgF27C8hqpbtWMqNorpsDSu6Qw5uu4iJF8WwoLt2VQGRgALfjEqpq61awRTaBwpciDatbCNB](https://bohemianpool.com/)\n\n###### Spring 2020\n\n Files\n\n Name SHA256\n\n\nclean.sh\n\n\n6b8d828511b479e3278264eff68059f03b3b8011f9a6daaeff2af06b13ba6090\n\n\ndns\n\n\n6c73e45b06544fc43ce0e9164be52810884f317a710978c31462eb5b8ebc30cc\n\n\ndns3\n\n\n07377cac8687a4cde6e29bc00314c265c7ad71a6919de91f689b58efe07770b0\n\n\n-----\n\n###### Name SHA256\n\n\ndns3_32bit\n\n\n3876b58d12e27361bdfebd6efc5423d79b6676ca3b9d800f87098e95c3422e84\n\n\ninit.sh (Trend Micro)\n\n\n459190ba0173640594d9b1fa41d5ba610ecea59fd275d3ff378d4cedb044e26d\n\n\ninit.sh (the second script)\n\n\n5c488d9d6820f859cde5fb5d147cfe584a603152653d12e720b897df60c6f810\n\n\nmxutzh.sh\n\n\n8926672fe6ab2f9229a72e344fcb64a880a40db20f9a71ba0d92def9c14497b6\n\n\nNarrenKappe.sh\n\n\nd791ac65b01008d2be9622095e6020d7a7930b6ce1713de5d713fc3cccfa862\n\n\nsetup.mytoys.sh\n\n\nb60be03a7305946a5b1e2d22aa4f8e3fc93a55e1d7637bebb58bf2de19a6cf4a\n\n\nsetup.xmrig.curl.sh\n\n\nbebaac2a2b1d72aa189c98d00f4988b24c72f72ae9348c49f62d16b433b05332\n\n\nsysinfo\n\n\n3c907087ec77fc1678011f753ddf4531a484009f3c64563d96eff0edea0dcd29\n\n\nlan.redis.pwn.sh\n\n\n25b4c5a3b3bfb1adab66fe17313a9828ef4ed13ea903e603f0ae36f3aa00cab0\n\n\nminion_worker.sh\n\n###### Summer 2020\n\n Files\n\n\n2adb1a298dd4ffd1b4fe2d5f5468363e977c8962dc837dc57219362ee2fc3127\n\n\n###### Name SHA256\n\n\nCarray.jpg\n\n\n230e2a06df2cd7574ee15cb13714d77182f28d50f83a6ed58af39f1966177769\n\n\nclean.jpg\n\n\nc55e4c67ba3cf54360a88980183767522fc05e8bf076f31399ee45efbfbd78e5\n\n\ncron.jpg\n\n\n9f5e14ca8c877b7dff84ffbe018c461233af975654bd5b87431920dfc24568a5\n\n\n-----\n\n###### Name SHA256\n\n\ncron_set.jpg\n\n\n705a22f0266c382c846ee37b8cd544db1ff19980b8a627a4a4f01c1161a71cb0\n\n\nds.jpg\n\n\na386aced768146fecfe81cac214c51c7e575b2c0c27a29c683e3357706f651ba\n\n\ninit.jpg\n\n\n616c3d5b2e1c14f53f8a6cceafe723a91ad9f61b65dd22b247788329a41bc20e\n\n\nlocal.jpg\n\n\nb556d266b154c303bb90db005d7dd4267ed8d0e711e3fd32406c64b1fc977f9e\n\n\nmo.jpg\n\n\n3a377e5baf2c7095db1d7577339e4eb847ded2bfec1c176251e8b8b0b76d393f\n\n\nmos.jpg\n\n\n0742efecbd7af343213a50cc5fd5cd2f8475613cfe6fb51f4296a7ec4533940d\n\n\nssh.jpg\n\n\n929c3017e6391b92b2fbce654cf7f8b0d3d222f96b5b20385059b584975a298b\n\n\ntnt.jpg\n\n\nb3c94173daf8f825dcba80ecc813dd0ca36636851f9fa83901ae3b36af166d78\n\n\nmo.jpg\n\n\n1b7180c7e1f150ba6848e392e8482b83c638b27b37873f7f0948be9914164310\n\n\nmo.jpg\n\n\n3a377e5baf2c7095db1d7577339e4eb847ded2bfec1c176251e8b8b0b76d393f\n\n\ninit.jpg\n\n\n616c3d5b2e1c14f53f8a6cceafe723a91ad9f61b65dd22b247788329a41bc20e\n\n\ncron_set.jpg\n\n\n705a22f0266c382c846ee37b8cd544db1ff19980b8a627a4a4f01c1161a71cb0\n\n\nds.jpg\n\n\na386aced768146fecfe81cac214c51c7e575b2c0c27a29c683e3357706f651ba\n\n\nmo.jpg\n\n\nb6e369f0eb241ffb1b63c8c5b2b8a9131a9b98125ca869165f899026ab2c64ba\n\n\nssh.jpg\n\n\nb9036b471ade3a0ed2c3e7d7c20f0844ee15d67ddcbe3380350944e427a7bf49\n\n\ncron.jpg\n\n\nc4cd9c12d47e5468f6f6e4b27e122f1a3d05dcae958245b59bde07d11c27328e\n\n\n-----\n\n###### Archives\n\n Name SHA256\n\n\n01.jpg\n\n\n78037e2d2e596bd450b99551535fa9c38c4e8346ab75eb424bf9e95316424fbe\n\n\n21.jpg\n\n\n4f115381c17ba1dedb25d35d922feda9a723e206d811ed437b75fd8116ef461b\n\n\n22.jpg\n\n\n4a5d3435cd4a835056b4940e1cea9a25b1619562525bd9953a120b556b305983\n\n\nabout.jpg\n\n\na79d4f5633dbbe98842d5073b41cc25468679c46e011373587ffdbc544d1ea12\n\n\ndet.jpg\n\n\n79a060a0efcf4a1538c58e532b984dcd927fda17ca9fd10c2ff212f9d9d76be6\n\n\nmod.jpg\n\n\nfeb0a0f5ffba9d7b7d6878a8890a6d67d3f8ef6106e4e88719a63c3351e46a06\n\n\nstock.jpg\n\n\n2c40b76408d59f906f60db97ea36503bfc59aed22a154f5d564d8449c300594f\n\n\n###### Binaries\n\n Name SHA256\n\n\nimpressum.jpg\n\n\nf64a828d58ac5bbdde5e982ebb0766c8969cb63b4ab642467392042f2a594295\n\n\njq.jpg\n\n\nbcfa215dec8fe15d4265c508c39c1ebafb7370acc95721e4e7d610b0459eb8dd\n\n\nkube.jpg\n\n\n15dce6f833812b119de9447db49e61f5c238c4e45b0dafbe0b6af0ab50bb329a\n\n\nms.jpg\n\n\n72b1cbfbd87c6cd85b9dc1da48c852768003e7fb4f01d8f6904921474be199ad\n\n\nsocat.jpg\n\n\n71c81cb46dd1903f12f3aef844b0fc559f31e2f613a8ae91ffb5630bc7011ef5\n\n\n-----\n\n###### Name SHA256\n\n\ntshd.jpg\n\n\nba974b31c7e6715b83e9468f72fd5927d560fe80dbcba8c4466bb8ce5b93601d\n\n\nzgrab.jpg\n\n\n1474298ed7a5c63ca8098794cd743a276807cca0e678e046160718626bb038f3\n\n\nportainer\n\n\nb49a3f3cb4c70014e2c35c880d47bc475584b87b7dfcfa6d7341d42a16ebe443\n\n\n[88ZrgnVZ687Wg8ipWyapjCVRWL8yFMRaBDrxtiPSwAQrNz5ZJBRozBSJrCYffurn1Qg7Jn7WpRQSAA3C8aidaeadAn4xi4k](https://moneroocean.stream/)\n\n###### Fall 2020\n\n Network\n\n Value Comment\n\n\n85[.]214.149.236\n\n\nHost malicious scripts and binaries\n\n\nhttps://iplogger[.]org/2Xvkv5\n\n\nUsed to obtain the IP address of the victim\n\n\n###### Name SHA256\n\n\nxmrig\n\n\n3b4ff9aff08a7ca9a36ed997f94adb6b18bb757157cec4f04b53ba67e9377003\n\n\nkdevtmpfsi\n\n\ndd603db3e2c0800d5eaa262b6b8553c68deaa486b545d4965df5dc43217cc839\n\n\nxmrigCCMiner_64Bit\n\n\nb6f57f8a7fba70d6660335828d2a14029c88079a8176dca2c63281a759fd84ca\n\n\nx86_64\n\n\n139f393594aabb20543543bd7d3192422b886f58e04a910637b41f14d0cad375\n\n\nxmrig\n\n\nfdf26ebad48da26be59b5784f43d1e5ee2efa93c59a717fe2ae1d82bf3f016d3\n\n\n-----\n\n###### Winter 2021\n\n Attacking Kubernetes\n\n Network\n\n Value Comment\n\n\nThe.borg[.]wtf (45.9.150.36)\n\n\nHost malicious scripts and binaries\n\n\n147.75.47.199\n\n\nUsed to obtain the IP address of the victim\n\n\nteamtnt.red (45.9.148.108)\n\n\nHost malicious scripts and binaries\n\n\nBorg.wtf (45.9.148.108)\n\n\nHost malicious scripts and binaries\n\n\nIrc.borg.wtf (123.245.9[.]147)\n\n\nC2 server and runs IRC server\n\n\nSampwn.anondns.net (13.245.9[.]147)\n\n\nC2 server and runs IRC server\n\n\n164.68.106.96\n\n\nC2 server and runs IRC server\n\n\n62.234.121.105\n\n\nC2 server and runs IRC server\n\n\n-----\n\n###### Files\n\n Name SHA256\n\n\nTDGG\n\n\n2c1528253656ac09c7473911b24b243f083e60b98a19ba1bbb050979a1f38a0f\n\n\ntt.sh\n\n\n2cde98579162ab165623241719b2ab33ac40f0b5d0a8ba7e7067c7aebc530172\n\n\napi.key\n\n\nb34df4b273b3bedaab531be46a0780d97b87588e93c1818158a47f7add8c7204\n\n\ntmate\n\n\nd2fff992e40ce18ff81b9a92fa1cb93a56fb5a82c1cc428204552d8dfa1bc04f\n\n\nsGAU.sh\n\n\n74e3ccaea4df277e1a9c458a671db74aa47630928a7825f75994756512b09d64\n\n\nkshell\n\n\n8e33496ea00218c07145396c6bcf3e25f4e38a1061f807d2d3653497a291348c\n\n\ninstall_monerod.bash\n\n\n518a19aa2c3c9f895efa0d130e6355af5b5d7edf28e2a2d9b944aa358c23d887\n\n\nsetup_moneroocean_miner.sh\n\n\n5923f20010cb7c1d59aab36ba41c84cd20c25c6e64aace65dc8243ea827b537b\n\n\nxmrig (moneroocean)\n\n\na22c2a6c2fdc5f5b962d2534aaae10d4de0379c9872f07aa10c77210ca652fa9\n\n\npei.sh\n\n\nee6dbbf85a3bb301a2e448c7fddaa4c1c6f234a8c75597ee766c66f52540d015\n\n\npei64\n\n\n937842811b9e2eb87c4c19354a1a790315f2669eea58b63264f751de4da5438d\n\n\npei32\n\n\n72cff62d801c5bcb185aa299eb26f417aad843e617cf9c39c69f9dde6eb82742\n\n\nxmr3.assi\n\n\n12c5c5d556394aa107a433144c185a686aba3bb44389b7241d84bea766e2aea3\n\n\naws2.sh\n\n\n053318adb15cf23075f737daa153b81ab8bd0f2958fa81cd85336ecdf3d7de4e\n\n\nt.sh\n\n\ne6422d97d381f255cd9e9f91f06e5e4921f070b23e4e35edd539a589b1d6aea7\n\n\nx86_64.so\n\n\n77456c099facd775238086e8f9420308be432d461e55e49e1b24d96a8ea585e8\n\n\n-----\n\n###### Name SHA256\n\n\nxmrig\n\n\n78f92857e18107872526feb1ae834edb9b7189df4a2129a4125a3dd8917f9983\n\n\nxmrig.so\n\n\n3de32f315fd01b7b741cfbb7dfee22c30bf7b9a5a01d7ab6690fcb42759a3e9f\n\n\nxmr.sh\n\n\nfe0f5fef4d78db808b9dc4e63eeda9f8626f8ea21b9d03cbd884e37cde9018ee\n\n\nziggy\n\n###### Windows Targeting\n\n\n74f122fb0059977167c5ed34a7e217d9dfe8e8199020e3fe19532be108a7d607\n\n\n###### Name SHA256\n\n\nsniffer.exe\n\n\n42e60ce9f0b7c5260282a7006af0166cd3603a6043d833719586bd1adaece138\n\n\nsvchost2.exe\n\n###### Wallet:\n\n\ndd0a5c62db8403263872716b8b2dfd190fcf9c742e9d13ad2c40ab41df7f2045\n\n\n[84dg9MjSkFvXkqHQuBr6ep6TfhR3pTP8DRyTMN5s8RgYMVRcnce7Day8edLkk3TqAaSHXu2N4W3A3XjKMaSx4X8Q3KQgZnh](https://supportxmr.com/)\n\n\n-----\n\n###### Spring 2021\n\n Name SHA256\n\n\naws.sh\n\n\n8cedd6187439f73675b076d70647ee117ec3a4184a5045499a6172ae6e6c2c39\n\n\ngrab_aws-data.sh\n\n\na1e9cd08073e4af3256b31e4b42f3aa69be40862b3988f964e96228f91236593\n\n\ninit.sh\n\n\n4e059d74e599757226f93ea8ddcfb794d4bcda605f0e553fbbef47b8b7c82d2b\n\n\nsearch.sh\n\n\ned40bce040778e2227c869dac59f54c320944e19f77543954f40019e2f2b0c35\n\n\n-----\n\n###### Summer 2021\n\n Files\n\n Name SHA256\n\n\nSSH.id_rsa.LAN.spread.sh\n\n\n000f9927d2aad73a10d7034cff8308535322e629a75600addfe38202305101ba\n\n\nmo.sh\n\n\n1b72088fc6d780da95465f80ab26ba094d89232ff30a41b1b0113c355cfffa57\n\n\nSSH.id_rsa.LAN.spread.sh\n\n\n3cc54142b5f88d03fb0552a655e32e94f366c9e3bb387404c6f381cfea506867\n\n\nbot_u\n\n\n5e1af7f4e6cf89cff44ee209399a9fab3bfd8f1ca9703fb54cee05cce2b16d4c\n\n\nscan.sh\n\n\n6c8a2ba339141b93c67f9d79d86a469da75bfbc69f128a6ed702a6e3925d5a29\n\n\nsetup.scanner.root.sh\n\n\n8737eb891a80302929a7d2a6ffacd51338705783f250ecbcd62d2d623f9e98fd\n\n\nsx.sh\n\n\na383e770c319b2411ed17775a114b697fb83ab53912266462ad1607c090ca608\n\n\nkbot_x86_64\n\n###### Domains\n\n**•** teamtnt[.]red\n\n**•** chimaera[.]cc\n\n\na46c870d1667a3ee31d2ba8969c9024bdb521ae8aad2079b672ce8416d85e8df\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.intezer.com/wp-content/uploads/2021/09/TeamTNT-Cryptomining-Explosion.pdf"
    ],
    "report_names": [
        "TeamTNT-Cryptomining-Explosion.pdf"
    ],
    "threat_actors": [
        {
            "id": "81dde5cc-c29f-430d-8c6e-e5e92d5015e7",
            "created_at": "2022-10-25T16:07:23.704358Z",
            "updated_at": "2025-03-27T02:02:09.932453Z",
            "deleted_at": null,
            "main_name": "Harvester",
            "aliases": [],
            "source_name": "ETDA:Harvester",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Graphon",
                "Metasploit",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eb3f4e4d-2573-494d-9739-1be5141cf7b2",
            "created_at": "2022-10-25T16:07:24.471018Z",
            "updated_at": "2025-03-27T02:02:10.24394Z",
            "deleted_at": null,
            "main_name": "Cron",
            "aliases": [],
            "source_name": "ETDA:Cron",
            "tools": [
                "Catelites",
                "Catelites Bot",
                "CronBot",
                "TinyZBot"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716492,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1630916986,
    "ts_modification_date": 1630918583,
    "files": {
        "pdf": "https://archive.orkl.eu/6e76324fd3b54f11f5eda90ef40c5eb20c7adf7a.pdf",
        "text": "https://archive.orkl.eu/6e76324fd3b54f11f5eda90ef40c5eb20c7adf7a.txt",
        "img": "https://archive.orkl.eu/6e76324fd3b54f11f5eda90ef40c5eb20c7adf7a.jpg"
    }
}