{
    "id": "a2706a82-0b0b-4c63-b508-787f11440c95",
    "created_at": "2023-01-12T15:01:36.423728Z",
    "updated_at": "2025-03-27T02:06:11.207102Z",
    "deleted_at": null,
    "sha1_hash": "0bea1f4dbee1be326e56c5dbeb0fa7a2ac461b4a",
    "title": "2021-12-07 - New action to combat cyber crime",
    "authors": "",
    "file_creation_date": "2022-05-28T02:26:56Z",
    "file_modification_date": "2022-05-28T02:26:56Z",
    "file_size": 106843,
    "plain_text": "# New action to combat cyber crime\n\n**[blog.google/technology/safety-security/new-action-combat-cyber-crime/](https://blog.google/technology/safety-security/new-action-combat-cyber-crime/)**\n\nRoyal Hansen December 7, 2021\n\nToday, we took action to disrupt Glupteba, a sophisticated botnet which targets Windows\nmachines and protects itself using blockchain technology. Botnets are a real threat to\nInternet users, and require the efforts of industry and law enforcement to deter them. As part\nof our ongoing work to protect people who use Google services via Windows and other IoT\n\n\n-----\n\ndevices, our Threat Analysis Group took steps to detect and track Glupteba s malicious\nactivity over time. Our research and understanding of this botnet’s operations puts us in a\nunique position to disrupt it and safeguard Internet users around the world.\n\nWe’re doing this in two ways. First, we are coordinating with industry partners to take\n[technical action.](https://blog.google/threat-analysis-group/disrupting-glupteba-operation)\n\n[And second, we are using our resources to launch litigation — the first lawsuit against a](https://storage.googleapis.com/gweb-uniblog-publish-prod/documents/1_Complaint.pdf)\nblockchain enabled botnet — which we think will set a precedent, create legal liability for the\nbotnet operators, and help deter future activity.\n\n## About the Glupteba botnet\n\nA botnet is a network of devices connected to the internet that have been infected with a type\nof malware that places them under the control of bad actors. They can then use the infected\ndevices for malicious purposes, such as to steal your sensitive information or commit fraud\nthrough your home network.\n\nAfter a thorough investigation, we determined that the Glupteba botnet currently involves\napproximately one million compromised Windows devices worldwide, and at times, grows at\na rate of thousands of new devices per day. Glupteba is notorious for stealing users’\ncredentials and data, mining cryptocurrencies on infected hosts, and setting up proxies to\nfunnel other people’s internet traffic through infected machines and routers.\n\n## Technical action\n\nWe coordinated with industry partners to take technical action. We have now disrupted key\ncommand and control infrastructure so those operating Glupteba should no longer have\ncontrol of their botnet — for now.\n\nHowever, due to Glupteba’s sophisticated architecture and the recent actions that its\norganizers have taken to maintain the botnet, scale its operations, and conduct widespread\ncriminal activity, we have also decided to take legal action against its operators, which we\nbelieve will make it harder for them to take advantage of unsuspecting users. .\n\n## Legal Strategy & Disruption\n\nOur litigation was filed against the operators of the botnet, who we believe are based in\nRussia. We filed the action in the Southern District of New York for computer fraud and\nabuse, trademark infringement, and other claims. We also filed a temporary restraining order\nto bolster our technical disruption effort. If successful, this action will create real legal liability\nfor the operators.\n\n## Making the Internet Safer\n\n\n-----\n\nUnfortunately, Glupteba s use of blockchain technology as a resiliency mechanism is notable\nhere and is becoming a more common practice among cyber crime organizations. The\ndecentralized nature of blockchain allows the botnet to recover more quickly from\ndisruptions, making them that much harder to shutdown. We are working closely with\nindustry and government as we combat this type of behavior, so that even if Glupteba\nreturns, the internet will be better protected against it.\n\nOur goal is to bring awareness to these issues to protect our users and the broader\necosystem, and to prevent future malicious activity.\n\nWe don’t just plug security holes, we work to eliminate entire classes of threats for\nconsumers and businesses whose work depends on the Internet. We have teams of analysts\nand security experts who are dedicated to identifying and stopping issues like DDoS,\nphishing campaigns, zero-day vulnerabilities, and hacking against Google, our products, and\nour users.\n\nTaking proactive actions like this are critical to our security. We understand and recognize the\nthreats the Internet faces, and we are doing our part to address them.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-07 - New action to combat cyber crime.pdf"
    ],
    "report_names": [
        "2021-12-07 - New action to combat cyber crime.pdf"
    ],
    "threat_actors": [
        {
            "id": "a3687241-9876-477b-aa13-a7c368ffda58",
            "created_at": "2022-10-25T16:07:24.496902Z",
            "updated_at": "2025-03-27T02:02:10.256629Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "ETDA:Hacking Team",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e90c06e4-e3e0-4f46-a3b5-17b84b31da62",
            "created_at": "2023-01-06T13:46:39.018236Z",
            "updated_at": "2025-03-27T02:00:02.978356Z",
            "deleted_at": null,
            "main_name": "Hacking Team",
            "aliases": [],
            "source_name": "MISPGALAXY:Hacking Team",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535696,
    "ts_updated_at": 1743041171,
    "ts_creation_date": 1653704816,
    "ts_modification_date": 1653704816,
    "files": {
        "pdf": "https://archive.orkl.eu/0bea1f4dbee1be326e56c5dbeb0fa7a2ac461b4a.pdf",
        "text": "https://archive.orkl.eu/0bea1f4dbee1be326e56c5dbeb0fa7a2ac461b4a.txt",
        "img": "https://archive.orkl.eu/0bea1f4dbee1be326e56c5dbeb0fa7a2ac461b4a.jpg"
    }
}