{
    "id": "a285dd14-734a-441a-a199-bf0f19d317d1",
    "created_at": "2022-10-25T16:48:10.425087Z",
    "updated_at": "2025-03-27T02:16:25.541733Z",
    "deleted_at": null,
    "sha1_hash": "f2b986148de82beb29662cdb9607697fd4926799",
    "title": "",
    "authors": "",
    "file_creation_date": "2019-02-04T10:28:45Z",
    "file_modification_date": "2019-02-04T10:28:47Z",
    "file_size": 1569153,
    "plain_text": "# ANDROID BANKING MALWARE:\n## SOPHISTICATED TROJANS VS. FAKE BANKING APPS\n\n\n-----\n\n### CONTENTS\n\nINTRODUCTION .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 2\n\nTHE TWO TYPES OF ANDROID BANKING MALWARE .   .   .   .   .   .   .   2\n\nSophisticated banking Trojans .  .  .  .  .  .  .  .  .  .  .  .  .  . 3\n\nFake banking apps .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 11\n\nCOMPARISON OF THE THREATS  .   .   .   .   .   .   .   .   .   .   .   .   .   .  15\n\nHOW TO STAY SAFE FROM ANDROID BANKING MALWARE .  .  .  .  . 16\n\nHow to prevent, spot and remove sophisticated banking Trojans .  . 16\n\nHow to prevent, spot and remove fake banking apps .  .  .  .  .  . 17\n\nCONCLUSION .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 18\n\nIOCS .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 18\n\nSophisticated banking Trojans .  .  .  .  .  .  .  .  .  .  .  .  .  . 18\n\nFake banking apps .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  . 18\n\nAuthor: Lukáš Štefanko, ESET Malware Researcher\n\nJanuary 2019\n\n\n-----\n\n### INTRODUCTION\n\nIn this white paper, we will provide insight into the two most prevalent types of Android banking\n\nmalware to date – sophisticated banking Trojans and fake banking apps – and compare their different\n\napproaches to achieving the same malicious goal.\n\nAt the same time, we will explore the impact of those approaches on potential victims.\n\nHaving identified the tactics of both categories, we will provide advice for users on how to stay safe\n\nfrom Android banking malware.\n\n### THE TWO TYPES OF ANDROID BANKING MALWARE\n\nWith our lives increasingly going mobile, banking apps are rapidly becoming the go-to method of\n\nmanaging finances. Malware authors motivated by financial gain have been quick to adapt their tools\n\nand techniques to profit from this shift. As a result, mobile banking malware – and especially that\n\ntargeting the Android platform – has become a very real and potent, yet often underestimated, threat.\n\nFigure 1 shows the rising trend in Android banking malware detections as seen in ESET telemetry data.\n\nFigure 1 // Android banking malware trend according to ESET’s telemetry\n\nWhile the landscape of Android threats preying on sensitive financial information is undoubtedly\n\ncomplex and ever-evolving, the majority of current Android banking malware falls into one of the\n\nfollowing, broad categories:\n\n##### 1. Sophisticated banking Trojans\n\n 2. Fake banking apps\n\nMalware in both these categories is designed to achieve the same goal: steal credentials for, or money\n\nfrom, their victims’ bank accounts. To achieve that, both sophisticated banking Trojans and fake banking\n\napps need to elicit sensitive banking information from their victims and, if direct theft is the aim,\n\n\n-----\n\ntypically also need to gain access to SMS messages received on the compromised devices[1]. To lure the\n\nvaluable information from potential victims, both types of malware make use of phishing and bogus\n\nlogin forms.\n\nHowever, despite the similarities in their objectives, sophisticated banking Trojans and fake banking\n\napps differ significantly in their strategy for deceiving victims. The following section will explore that\n\ndifference and offer a more detailed look into the modus operandi of each distinct malware type.\n\n#### Sophisticated banking Trojans\n\nMalware in this category is typically complex in architecture, and advanced in functionality and\n\ndetection evasion. MazarBot, BankBot, Anubis and Exobot are some of the most notorious examples of\n\nthis type of Android threat.\n\nAn important point in the evolution of sophisticated Android banking Trojans was the publication of\n\n_[BankBot’s source code on an underground forum in December 2016. The released code led to the creation](https://www.welivesecurity.com/2017/02/23/released-android-malware-source-code-used-run-banking-botnet/)_\n\nof numerous new, hybrid-like, variants, and was likely one of the reasons behind the overall surge in\n\nAndroid banking Trojans observed throughout 2017.\n\n##### Key features and strategy\n\nThe key tactic of Android banking Trojans is the overlay attack – a technique in which the malware\n\noverlays the targeted application with a phishing screen whenever that application is launched on the\n\ncompromised device.\n\nOn the one hand, such phishing screens are very easy to craft nowadays, can be virtually\n\nindistinguishable from the impersonated layouts, and can be dynamically adapted to “fit” individual\n\nvictims. On the other hand, drawing over other applications without the victims’ knowledge gets more\n\ndifficult with each Android version, due to measures taken against exactly this type of threat.\n\nIf we were to describe the strategy of Android banking Trojans in one word, it would be stealth: the\n\npresence of malware on the device and its connection to banking apps is meant to remain hidden for as\n\nlong as possible, ideally keeping the victims in the dark until it is too late.\n\n##### Modus operandi\n\nTo reach their malicious goals, sophisticated Android banking Trojans typically take most or all of the\n\nfollowing steps:\n\n1. Trick the victim into unknowingly installing malware using various disguises (read more in Distribution)\n\n2. Obtain needed permissions (read more in Functionality and permissions and Stealth techniques and\n\ndetection evasion)\n\n3. _Optional: Ensure persistence on the device (read more in Special permissions and persistence and_\n\nStealth techniques and detection evasion)\n\n4. Wait in the background until the targeted, legitimate app is launched or trick the victim into launching\n\nthat app (read more in Targeting)\n\n5. Overlay the legitimate app with a phishing screen requesting login credentials or credit/debit card details\n\n(read more in Functionality and permissions)\n\n6. Harvest entered credentials or credit/debit card details and send them to the C&C server\n\n7. Optional: Use SMS permissions to intercept one-time password (OTP)\n\n8. Carry out fraudulent transactions using the victim’s bank account and/or sell stolen credentials on the\n\nblack market\n\n[1 Obtaining SMS permissions for illicit purposes will likely become more complicated due to the recent change to Google Play terms](https://support.google.com/googleplay/android-developer/answer/9047303)\nrestricting the use of SMS and Call Log permission groups.\n\n\n-----\n\n**Impact on users compared to fake banking apps:**\n\n- The deciding part of this attack is getting to the point of overlaying the targeted, legitimate app\n\nwithout the user noticing, while obtaining intrusive permissions, which has a lower chance of\n\nsucceeding than fake banking apps\n\n- The malicious nature of the app is either revealed in the process of obtaining intrusive\n\npermissions, or when it is too late; the connection to the Trojanized app is not always obvious,\n\nso the apps may have a longer “lifespan” on Google Play than fake banking apps\n\n\n##### Distribution\n\nAndroid banking Trojans are spread through a variety of channels and under many different guises.\n\nThey can be commonly found lurking in unofficial app stores, but from time to time, some also manage\n\n[to sneak into the official Google Play store. Other common distribution methods include compromised](https://www.welivesecurity.com/2018/10/24/banking-trojans-continue-surface-google-play/)\n\nwebsites and malicious download links disseminated through social media, emails or even SMS.\n\n[As their name suggests, Trojans hide behind a seemingly legitimate mask to gain users‘ trust – be](https://www.eset.com/int/trojan-horse/)\n\nit games, handy widgets, power boosters and battery managers, video or Flash players, or even\n\nhoroscope-themed apps (see Figure 2). The apps used as disguise sometimes provide the advertised\n\nfunctionality – that is, work as expected – or provide no functionality other than the (hidden) malicious\n\none. The disguises are frequently changed up, complicating manual spotting and removal of Trojans on\n\ncompromised devices.\n\n[A recent example of a banking Trojan we discovered on Google Play is a Trojanized QRecorder app that](https://www.bleepingcomputer.com/news/security/trojanized-app-in-google-play-steals-bank-customers-euros/)\n\ntargeted German, Polish and Czech banks and was installed more than 10,000 times before being\n\nreported by ESET and taken down from the store (see Figure 3).\n\nFigure 2 // Recent examples of banking Trojans found on Google Play\n\n\n-----\n\nFigure 3 // The Trojanized QRecorder app on Google Play\n\n\n**Impact on users compared to fake banking apps:**\n\n- Malware disguised as legitimate apps have a potentially wider reach than fake banking apps\n\n\n##### Targeting\n\nThe most usual target of Android banking Trojans are, unsurprisingly, banking apps (see Figure 4).\n\nHowever, it is also common for this type of malware to customize its overlay attacks for cryptocurrency\n\nwallets and exchanges as well as various non-banking apps like social media and messaging apps,\n\nbooking apps, app stores, etc. In case of non-banking targets, the bogus overlay screens typically\n\nrequest credit/debit card details under some pretense (see Figure 5).\n\nFrom the technical point of view, the scope of the overlay attacks can either depend on a hardcoded list\n\nof targeted applications, or be dynamically adjusted to impersonate any app of the attacker’s choice.\n\nThe latter is nowadays increasingly prevalent among Android banking Trojans.\n\n\n-----\n\nFigure 4 // Bogus overlay screen (left) indistinguishable from the legitimate banking app (right)\n\nFigure 5 // Bogus overlay screens for various non-banking apps\n\n\n**Impact on users compared to fake banking apps:**\n\n- A potentially wider target group than fake banking apps\n\n\n-----\n\n##### Functionality and permissions\n\nThe malicious functionality of Android banking Trojans typically includes the following capabilities:\n\n- Remote control, using various communication methods with the C&C server\n\n- Obtaining device information\n\n- Downloading and executing additional apps\n\n- Overlaying targeted, legitimate apps with phishing screens, using various techniques\n\n- Harvesting credentials entered into the phishing forms and sending them to the C&C server\n\n - encrypted\n\n - unencrypted\n\n- Intercepting, redirecting, sending and deleting SMS messages, to bypass SMS-based 2-factor\n\nauthentication\n\nDepending on permissions gained during and after installation, sophisticated banking Trojans targeting\n\nthe Android platform are also commonly capable of:\n\n- Displaying fake notifications to prompt victims to launch the targeted banking apps\n\n- Obtaining the list of running applications\n\n- Obtaining and editing the contact list\n\n- Obtaining the phone call log, making and redirecting phone calls\n\n- Accessing device storage\n\n- Opening a browser and navigating to specific websites\n\n- Accessing the camera\n\n- Starting at device boot\n\n- Remotely locking and unlocking the device by setting a lock screen password of the attackers’ choice\n\n- Displaying full-screen activity to cover malicious activity running in the background\n\n- Recording a video of the screen\n\n- Keylogging\n\n- Running as a proxy to route network traffic through the compromised mobile device to fool banks’\n\nfraud detection mechanisms\n\nOptionally, Android banking Trojans deliver the functionality advertised as part of their disguise – for\n\nexample, provide the user with a real, functioning game. Offering legitimate functionality can help keep\n\nthe malicious nature of the Trojan hidden for longer, both from affected users and Google’s security\n\nmechanisms (read more in Stealth techniques and detection evasion).\n\nOn the other hand, the number of advanced techniques used and intrusive permissions requested by\n\nthese Trojans can also work as triggers and thwart the operation before its malicious goals are realized.\n\n\n**Impact on users compared to fake banking apps:**\n\n- More powerful and potentially more damaging than fake banking apps but also more prone\n\nto detection due to advanced techniques acting as triggers for Google’s security measures,\n\nresearchers and users\n\n\n-----\n\n##### Special permissions and persistence\n\nTo secure even greater control over the compromised device and ensure their malware cannot be\n\nuninstalled in one tap, cybercriminals are also interested in gaining elevated privileges and special\n\npermissions.\n\nA very common way to gain a foothold in the system is obtaining device administrator rights for the\n\nmalware – as long as an app is an active device administrator, it cannot be uninstalled. At the same\n\ntime, device administrator rights come with some particularly intrusive permissions, such as changing\n\nthe lock-screen password, locking the device, or wiping all its contents.\n\nWhen requesting the activation of device administrator rights, Android banking Trojans either continue\n\nposing as whatever legitimate app they have been impersonating from the beginning, or employ the\n\nruse of claiming to be a seemingly unrelated process (see Figure 6). Very often, we’ve seen malware\n\nimpersonate Google or Adobe apps, or even the Android operating system itself.\n\nSome Trojans take this persistence method a step further and employ measures to force the activation\n\nor prevent the deactivation of the device administrator, e.g. by having the request pop up in a loop until\n\nthe user clicks „activate“.\n\nFigure 6 // A variant of BankBot posing as a “System update” with the Google Play icon\n\nto obtain device administrator rights\n\nAnother way to take over a device is through the misuse of the Android Accessibility service.\n\nAccessibility service functionality was created to assist users with disabilities in using Android devices by\n\ngiving applications access to actions that would otherwise require physical interaction with the device.\n\nIn practice, this means that an active Accessibility service with enabled accessibility permissions can, for\n\nexample, mimic users‘ taps and swipes and thus navigate through screens on their behalf.\n\nIn the wrong hands, such capabilities can be incredibly dangerous, and enabling an Accessibility\n\nservice belonging to a banking Trojan (or any other malware, for that matter) can have some nasty\n\nconsequences.\n\n\n-----\n\nAs with device administrators, accessibility permissions are also often requested seemingly on behalf of\n\na well-known, legitimate service rather than the actual banking Trojan app (see Figure 7).\n\nFigure 7 // A variant of BankBot requesting the activation of its malicious Accessibility service disguised\n\nas “Google service”, and using a description taken from Google’s original Terms of Service\n\nIn the past few years, we have observed malware abuse Accessibility services mainly to secure further\n\nintrusive permissions without having to rely on victims’ consent.\n\n[In November 2018, we discovered a novel Accessibility-abusing technique in which the permission to](https://www.welivesecurity.com/2018/12/11/android-trojan-steals-money-paypal-accounts-2fa/)\n\nperform clicks on behalf of the user is misused for direct theft with the malware navigating through\n\ntargeted financial apps and transferring funds to its operators. For the technique to work, malware\n\nauthors first need to reverse engineer the targeted, legitimate apps and identify relevant areas of\n\nactivity, such as buttons and text boxes.\n\nBesides legitimate permissions and rights that end up being misused by criminals, there are also special\n\npermissions that have been introduced to the Android platform specifically to counter malware attacks.\n\nFrom Android 6.0, apps that want to overlay the screen while another app is running need to obtain the\n\npermission to Display over other apps. As overlaying other apps with screen activity of their choosing is\n\nprecisely what Android banking Trojans do, they need to either trick users into granting the permission,\n\nor circumvent it. That could mean using a different technique to display screens on top of others, or\n\ntrying their luck with a malicious Accessibility service, which, when active, can carry out almost any\n\naction on the device.\n\n\n**Impact on users compared to fake banking apps:**\n\n- Potentially more damaging and more difficult to remove than fake banking apps but also\n\nmore prone to detection due to advanced techniques acting as triggers for Google’s security\n\nmeasures, security researchers and users\n\n- Failure to gain intrusive permissions may disrupt their whole operation\n\n\n-----\n\n##### Stealth techniques and detection evasion\n\nAs previously mentioned, banking Trojans are all about stealth – be it to remain unnoticed by defenders,\n\nor to keep their intentions hidden from potential victims.\n\nOver the years, malware authors have been using increasingly advanced techniques to prevent their\n\ncode from being detected and analyzed. Among the most commonly used detection evasion and anti\nanalysis measures are code obfuscation, packing, encryption and multi-stage malware architecture, as\n\nwell as emulator and sandbox checks. More recently, timers scheduling the onset of malicious activity\n\nhave been adopted by some sophisticated banking Trojans, with the aim of confusing both detection\n\nengines and affected users.\n\nUsing actual, complex apps built from open source code with added malicious functionality can have a\n\nsimilar effect in fooling both security measures and unsuspecting users – something that many Android\n\nbanking Trojans take advantage of.\n\nDeceiving users is of particular importance for criminals in the Android malware business – even the\n\nmost sophisticated detection evasion measures are no use if a potential victim is alarmed by suspicious\n\napp behavior before the attack takes place. After installation, for example, Trojans often present users\n\nwith fake error messages claiming the app has been uninstalled (see Figure 8), which is followed by the\n\napp’s icon being hidden. To obtain intrusive permissions, banking Trojans commonly impersonate well\nknown, legitimate services. To cover malicious activity running in the background, sophisticated banking\n\nTrojans sometimes display full-screen activity that users cannot remove (see Figure 9).\n\n\nFigure 8 // Fake error message displayed\nby a banking Trojan found on Google Play\n\n\nFigure 9 // Full screen activity covering malicious activity in the background,\n\ndisplayed by a variant of BankBot and Android/Charger.B\n\n\n**Impact on users compared to fake banking apps:**\n\n- Sophisticated banking Trojans employing advanced detection evasion techniques might be\n\nmore successful at bypassing Google’s and AV security measures and thus potentially reach and\n\naffect more users\n\n- Large, legitimate code base may help conceal malicious capabilities, or otherwise be less\n\nsuspicious to heuristic detection methods\n\n\n-----\n\n#### Fake banking apps\n\nContrary to the complex workings of sophisticated banking Trojans, fake banking apps operate in a\n\nmore straightforward way, with functionality usually limited to displaying bogus login screens and\n\nharvesting entered data. This type of malware continued to increase in prevalence throughout 2018.\n\nNote: We refer to this category of malware as fake banking apps because legitimate banking apps are its most\n\n_usual target. However, cryptocurrency exchanges and wallets, as well as other finance-oriented and payment_\n\n_services and/or apps, are also sometimes impersonated by malicious fakes operating similarly to the malware_\n\n_described below._\n\n##### Key features and strategy\n\nFake banking apps bet everything on the success of impersonation – their whole operation stands or falls\n\non how believably they can imitate a legitimate banking application, or stand in for a non-existent one, from\n\nthe very first moment a potential victim comes across them, up to the point when the victim enters sensitive\n\ninformation.\n\nTheir weapon of choice is therefore their presentation – from app name, through app description, to icon\n\nand preview images, the apps need to appear trustworthy to attract unsuspecting users.\n\n##### Modus operandi\n\nTo reach their malicious goals, fake banking apps typically take the following steps:\n\n1. Trick victims into installing malware by posing as a legitimate banking app (read more in Distribution)\n\n2. Obtain needed permissions\n\n3. Upon launch, display a phishing screen mimicking a legitimate banking app and requesting login\n\ncredentials or credit/debit card details (read more in Targeting)\n\n4. Harvest credentials or credit/debit card details entered into the bogus form\n\n5. Display an error/thank-you message; offer no further functionality\n\n6. Optional: Use SMS permissions to intercept one-time password (OTP)\n\n7. Carry out fraudulent transactions using the victim’s account or sell credentials on the black market\n\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- The deciding part of the operation is its beginning – successful impersonation leading to a\n\npotential victim’s decision to install the fake banking app\n\n- People who fall for the impersonation and install the app are likely to become victims as they\n\ninstall these apps believing they are installing legitimate banking apps, and thus expect to see a\n\nlogin screen after launching the app and are willing to enter their credentials\n\n- The malicious nature of the app is revealed when it is too late, but in an obvious manner,\n\nwhich often motivates victims to take action against the app – as a result, the apps may have a\n\nshorter “lifespan” on Google Play than sophisticated banking Trojans\n\n\n-----\n\n##### Distribution\n\nFake banking apps are usually spread through Google Play or unofficial app stores, where they pose as\n\nlegitimate banking, or other finance, applications.\n\nAttackers spreading these malicious fakes try to entice their victims by using legitimate-looking app names\n\nand icons, accompanied by sleek preview images and trustworthy descriptions. What can sometimes serve\n\nas an indicator of something fishy is a mismatched app category (e.g. an apparent banking app placed in the\n\n‘Books & Reference’ category, as seen in Figure 10), or an unfamiliar developer name with no connection to\n\nthe financial institution supposedly issuing the app.\n\nFigure 10 // Malicious app impersonating PostFinance, a Swiss financial institution, on Google Play\n\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- A more limited reach than banking Trojans disguised as various non-banking apps\n\n\n-----\n\n##### Targeting\n\nIn contrast to banking Trojans, fake banking apps typically focus on targeting customers of just one financial\n\ninstitution or service – the one that they impersonate. An exception to this was a fake app claiming to be a\n\n[universal banking tool for Polish users that targeted customers of 19 Polish banks with bogus login screens.](https://twitter.com/LukasStefanko/status/976104291407626240)\n\n[When choosing their target, some malware authors take advantage of the absence of an official mobile app](https://www.welivesecurity.com/2018/09/19/fake-finance-apps-google-play-target-around-world/)\n\nfor the targeted bank or service, while others attempt to fool users by impersonating existing official apps.\n\nOccasionally, the fakes pretend to offer additional, attractive functionality to existing legitimate apps, such\n\n[as offering bank rewards, gifts or offering to increase credit card limits (see Figure 11).](https://www.welivesecurity.com/2018/07/26/fake-banking-apps-google-play-leak-stolen-credit-card-data/)\n\nFigure 11 // Malicious app impersonating Indian Icici bank and claiming to increase credit card limit for its customers\n\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- A more limited target group than sophisticated banking Trojans (depending on the customer\n\nbase of the targeted institution or service)\n\n\n-----\n\n##### Functionality and permissions\n\nAs previously mentioned, these fake apps rely on deception through impersonation, thus their functionality\n\ncomes down to displaying bogus login screens and harvesting credentials entered into the fake forms (see\n\nFigure 12).\n\nAfter the credentials are stolen, some apps display generic messages with a promise to get back to the\n\nvictim, as a cover for not offering any real functionality (see Figure 13). Optionally, depending on permissions\n\ngained during and after installation, fake banking apps can also intercept and redirect SMS messages to\n\nbypass SMS-based 2-factor authentication. As users install these apps believing they are installing real\n\nbanking applications, they are likely to grant the apps SMS permissions without thinking twice about it.\n\nFigure 12 // Bogus login screens displayed by fake banking apps found on Google Play\n\nFigure 13 // Messages displayed by fake banking apps to distract victims from the absence of real functionality\n\n\n-----\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- Less powerful than sophisticated banking Trojans but also less prone to early detection due to a\n\nlack of advanced techniques acting as triggers for Google’s security measures, researchers and\n\nusers\n\n\n##### Special permissions and persistence\n\nIf the operation of fake banking apps goes according to plan, they reach their goal almost immediately\n\nafter being installed and launched by a victim. For this reason, the fraudulent apps typically do not attempt\n\nto obtain extensive permissions on the affected device and can thus be considered less invasive than\n\nsophisticated banking Trojans. Then again, the absence of intrusive techniques may help them fly under the\n\nradar for longer periods of time.\n\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- Less powerful and easier to remove than sophisticated banking Trojans but also less prone\n\nto detection due to a lack of advanced techniques acting as triggers for Google’s security\n\nmeasures, researchers and users\n\n\n##### Stealth techniques and detection evasion\n\nThe stealth techniques used by fake banking apps typically do not go beyond code obfuscation.\n\n\n**Impact on users compared to sophisticated banking Trojans:**\n\n- Less advanced detection evasion techniques than sophisticated banking Trojans, however, the\n\nlack of advanced techniques acting as triggers might balance out the overall effect\n\n\n### COMPARISON OF THE THREATS\n\nTo sum up, sophisticated banking Trojans have a potentially wider target group and reach than fake\n\nbanking apps. They are characterized by extensive capabilities and stealthy operation. However, the\n\nsame attributes that make them powerful also make them prone to being detected – and not just by\n\nsecurity measures and researchers, but also noticed by users before they have fallen victim.\n\nFake banking apps, on the other hand, have a more limited target group and reach and are simpler and\n\nless invasive than sophisticated banking Trojans. However, their strategy ensures that those who fall for\n\nthe initial impersonation and install them are very likely to become victims.\n\n\n-----\n\n### HOW TO STAY SAFE FROM ANDROID BANKING MALWARE\n\nThis section provides advice addressing the most common Android banking malware attack scenarios,\n\nincluding the more advanced persistence techniques used by some sophisticated banking Trojans.\n\n#### How to prevent, spot and remove sophisticated banking Trojans\n\n##### Prevention\n\n- Only install apps from Google Play; this does not ensure the app is not malicious, but apps like these\n\nare much more common in third-party app stores where they are rarely removed once uncovered,\n\nunlike on Google Play\n\n- Before installing an app from Google Play, always check its ratings, content of reviews, number of\n\ninstalls, and permissions requested by the app, specifically paying attention to SMS permissions\n\nin apps that have no reason to require them\n\n- After installing, keep paying attention to further permission requests and be extra cautious\n\nbefore activating any intrusive permissions, specifically paying attention to requests to draw\n\nover other apps, and requests for device administrator rights or accessibility permissions\n\n- Keep your device and applications updated\n\n- Use a reputable mobile security solution\n\n##### Spotting\n\nThe most reliable way to detect banking Trojans on your device is to run a scan using a reputable mobile\n\nsecurity solution.\n\n##### Removing\n\nIf malware is detected on your Android device, you can use a reputable mobile security solution to clean\n\nit.\n\nIn case you wish to remove a banking Trojan from your Android device manually, you need to know the\n\nnames the malware and its further potential payloads use for their various forms and disguises, and\n\nlocate and remove each of them. This may include:\n\n- Malware as a Trojanized app in Apps/Application manager\n\n- Malware as an active device administrator\n\n- An active malicious Accessibility service\n\nIf advanced persistence techniques are used, booting the device in Safe mode and then locating and\n\nremoving the malware might be necessary.\n\n##### Mitigating damage\n\nApart from cleaning your device, it is advisable to take the following measures:\n\n- Change your credit/debit card PIN codes as well as internet banking passwords\n\n- Check your bank account for suspicious transactions\n\n- If there are suspicious transactions, contact your bank\n\n- Consider replacing your credit/debit card\n\n\n-----\n\n#### How to prevent, spot and remove fake banking apps\n\n##### Prevention\n\n- Only trust mobile banking and other finance apps if they are linked from the official website of\n\nyour bank or the financial service\n\n- If you are inclined to download a banking app because it offers some attractive extra features, or\n\nthe bank previously hasn’t offered a mobile app, always check the official website of the bank for\n\na link to the app\n\n- Only enter your sensitive information into online forms if you are sure of their security and legitimacy\n\n- Keep your device updated\n\n- Use a reputable mobile security solution\n\n##### Spotting\n\nThe lack of fuctionality usually makes victims realize they have installed a fraudulent app, so spotting\n\nsuch apps should not be a problem. If you are not sure, we recommend scanning your device using a\n\nreputable mobile security solution.\n\n##### Removing\n\nThe apps usually do not take extra measures to secure persistence on affected devices. In most cases,\n\nthey can be simply uninstalled in Apps/Application manager.\n\n##### Mitigating damage\n\nAs well as cleaning your device, it is advisable to take the following measures:\n\n- Change your credit/debit card PIN codes as well as internet banking passwords\n\n- Check your bank account for suspicious transactions\n\n- If there are suspicious transactions, contact your bank\n\n- Consider replacing your credit/debit card\n\n\n-----\n\n### CONCLUSION\n\nIn this white paper, we have identified the two main categories of banking malware currently preying\n\non Android users.\n\nWhile sophisticated banking Trojans have long been regarded as a serious threat to Android users, fake\n\nbanking apps have sometimes been viewed as “just scams” due to their limited capabilities. Despite not\n\nbeing technically advanced, we believe fake banking apps are a serious threat to Android users.\n\nSure – the damage done by sophisticated banking Trojans can go beyond phished banking credentials,\n\nand they are overall a more worrying threat to cross paths with. But as far as credential and money\n\ntheft are concerned, fake banking apps might be just as effective – and thus dangerous for users – as\n\nsophisticated banking Trojans.\n\nBesides this, fake banking apps are an increasingly prevalent threat, which is not all that surprising as\n\nthe apps are easier to create and confronted with fewer obstacles in their operation – and criminals\n\nmotivated by money tend to favor the easiest path to financial gain.\n\nWe can only speculate what type of malware will dominate the Android threat landscape in the\n\ncoming years. However, it is beyond doubt that mobile devices will continue to be an attractive target\n\nfor cybercriminals – which makes taking extra measures for keeping them safe worthwhile, if not\n\nnecessary.\n\nIt is important to note that all the apps discussed within these categories are detected and blocked by\n\nESET systems.\n\n### IoCs\n\n#### Sophisticated banking Trojans\n\nPackage name Hash ESET detection name\n\njhgfjhgfj.tjgyjgjgjy `1C555B35914ECE5143960FD8935EA564` Android/Spy.Banker.AJZ\n\ncom.puredevlab.powermanager `7C13ADEFC2CABD85AD8F486C3CBDB6379811A097` Android/TrojanDropper.Agent.CIQ\n\ncom.apps.callvoicerecorder `DA926010056A75E7DA0DE1292B0FC7C2DCD727A7` Android/Spy.Banker.AIX\n\ncom.mygamejewelsclassic.app `B556FB1282578FFACDBF2126480A7C221E610F2F` Android/Spy.Banker.LA\n\ncom.flashscary.widget `CA04233F2D896A59B718E19B13E3510017420A6D` Android/Charger.B\n\n#### Fake banking apps\n\nPackage name Hash ESET detection name\n\nch.post.finance `FE1B2799B65D36F19484930FAF0DA17A0DBE9868` Android/Spy.Banker.AIF\n\nau.money.go `DE09F03C401141BEB05F229515ABB64811DDB853` Android/Spy.Banker.AIF\n\n\n-----\n\n### ABOUT ESET\n\n[For 30 years, ESET® has been developing industry-leading IT security software and services for](http://www.eset.com/int/)\n\nbusinesses and consumers worldwide. With solutions ranging from endpoint and mobile security,\n\nto encryption and two-factor authentication, ESET’s high-performing, easy-to-use products give\n\nconsumers and businesses the peace of mind to enjoy the full potential of their technology. ESET\n\nunobtrusively protects and monitors 24/7, updating defenses in real time to keep users safe and\n\nbusinesses running without interruption. Evolving threats require an evolving IT security company.\n\n[Backed by R&D centers worldwide, ESET becomes the first IT security company to earn 100 Virus](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)\n\n_[Bulletin VB100 awards, identifying every single “in-the-wild” malware without interruption since 2003.](https://www.eset.com/int/about/newsroom/awards/eset-first-to-break-magical-100-vb100-awards-threshold/)_\n\n[For more information, visit www.eset.com or follow us on LinkedIn, Facebook and Twitter.](https://www.linkedin.com/company/28967?trk=tyah&trkInfo=tarId%3A1402921556545%2Ctas%3AESET%2Cidx%3A2-1-4)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.welivesecurity.com/wp-content/uploads/2019/02/ESET_Android_Banking_Malware.pdf"
    ],
    "report_names": [
        "ESET_Android_Banking_Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1549276125,
    "ts_modification_date": 1549276127,
    "files": {
        "pdf": "https://archive.orkl.eu/f2b986148de82beb29662cdb9607697fd4926799.pdf",
        "text": "https://archive.orkl.eu/f2b986148de82beb29662cdb9607697fd4926799.txt",
        "img": "https://archive.orkl.eu/f2b986148de82beb29662cdb9607697fd4926799.jpg"
    }
}