{
    "id": "a2e2f8a9-1f82-4c75-a4bc-e3d08f0d51af",
    "created_at": "2023-01-12T15:03:09.263041Z",
    "updated_at": "2025-03-27T02:10:00.694516Z",
    "deleted_at": null,
    "sha1_hash": "c4921f6575872f5c2a39143662a64258ff3e8496",
    "title": "2017-03-21 - Hunt Case Study- Hunting Campaign Indicators on Privacy Protected Attack Infrastructure",
    "authors": "",
    "file_creation_date": "2022-05-27T23:22:23Z",
    "file_modification_date": "2022-05-27T23:22:23Z",
    "file_size": 959288,
    "plain_text": "# Hunt Case Study: Hunting Campaign Indicators on Privacy Protected Attack Infrastructure\n\n**[domaintools.com/resources/blog/case-study-hunting-campaign-indicators-on-privacy-protected-attack-infrastr](https://www.domaintools.com/resources/blog/case-study-hunting-campaign-indicators-on-privacy-protected-attack-infrastr)**\n\nAs a researcher, when I find an attacker working, one of the first places I start to pivot is the\ncommand and control infrastructure. I do this because I want to see if I can find additional\nbinaries, indicators of attack, or additional infrastructure being used by an adversary.\n\nWhen looking at attacker infrastructure, one of the things that annoys analysts the most is\nattackers using Whois protection services for registering domains that are used as attack\ninfrastructure. At first glance, many analysts will abandon an investigation when finding\nprivacy protected domains. So, in this blog, I intend to show just how you can pivot on a\nprivacy protected indicator of attack infrastructure, and ultimately find good intelligence\ndata.\n\nPlease keep in mind, in this blog I will not be attributing this activity to any specific nation\nstate. We have indicators that point to a specific actor group, but nation-state attribution is a\ntricky and near impossible endeavor, therefore we shy away from making any nation-state\nattribution claims.\n\n## Infrastructure Pivots\n\n\n-----\n\n[As part of my daily routine, I check several tools for any triggered YARA rules I m running.](http://yararules.com/)\nOne particular domain stood out, since it triggered on a specific rule looking for attacker\ninfrastructure.\n\n[In this case, I looked at the domain in DomainTools Iris Investigate:](https://www.domaintools.com/products/iris-investigate)\n\n_primeminister-goverment-techcenter[.]tech_\n\nWhen an attacker uses Whois protection, it prevents an analyst from pivoting off registrant\ninformation, making it more difficult to find additional infrastructure or files. But, there is a\nway to help offset this perplexing investigative nuisance.\n\nBecause of the privacy protection on the Whois record, I looked to find the IP that the\ndomain is hosted on. Keep in mind, finding the IP doesn’t have to be the first pivot to\nexecute. There are several potential pivots an investigator could start with. I began my first\npivot with the IP first because I often scour infrastructure of the attacker before I move on to\nanalyzing actor tools and procedures. Also, ideally we will see additional attacker\ninfrastructure on that IP, regardless of who’s hosting the domains. Pivoting off the IP of the\nhosting infrastructure can prove valuable, especially when the hosting provider and the\nprivacy protection service are different entities.\n\nWithin the DomainTools Iris Investigate toolset, I quickly pulled and pivoted off the IP\naddress of the hosting infrastructure- 86[.]105[.]18[.]5.\n\n\n-----\n\nWhen pivoting within Passive DNS on the IP, several additional domains were identified.\nOut of those newly identified domains, one specific one piqued my interest.\n\n_ssl.pmo.gov[.]il-dana-naauthurl1-welcome.cgi.primeminister-goverment-techcenter[.]tech_\n\nAt this point, I Googled the domain and found that there could possibly be a Microsoft Word\nfile hosted on the newly discovered URL.\n\nhttp://ssl.pmo.gov.il-dana-naauthurl1-welcome.cgi.primeminister-govermenttechcenter.tech/%D7%A1%D7%A7%D7%A8%20%D7%A9%D7%A0%D7%AA%D7%99.docx\n\nConverting the .docx file to a readable format, you are given a Hebrew file name\nסקרשנתי.docx, which when translated means “Annual Survey.docx.”\n\n\n-----\n\nAt this point, the hunt was on to find the actual DOCX file. I wanted to download the DOCX\nto not only find any possible communications that could be occurring, but also strings in the\nfile, dropped files, possible build paths, and even communications. In addition, having the\nactual file allows us to pivot and write YARA rules to match any other files in the wild that\nmay be related. (Possibly the same attacker/group or campaign)\n\nUsing the file name and C2, with the help of Google and some additional tools, I was able to\nsubsequently locate and download the DOCX.\n\n## Annual_Survey.docx\n\nLooking closer at the malware document, I noticed that it appeared to come from the\nDirector of the Information Department. The document also makes reference to The\nMinistry of Communications, therefore possibly targeting the Israeli government’s Ministry of\nCommunications.\n\n\n-----\n\nLooking at the Word document, there is an OLE object (oleObject1.bin) directly embedded\nwithin it, making it look like a PDF was actually embedded.\n\nThe OLE object, appearing to be an embedded PDF, and appears to be communicating to a\nC2.\n\n_static.dyn-usr[.]f-login-me.c19.a23.akamaitechnology[.]com_\n\nThis domain has an IP of 212[.]199[.]61[.]51, which, according to pDNS data within Iris\nInvestigate can also be attributed to 212.199.61.51.static.012.net[.]il. It’s important to note\nthat the Top Level Domain (TLD) .il is assigned to the country of Israel.\n\n\n-----\n\nWithin the strings of the original PDF file, there appears to be a build path\n(C:\\Users\\Administrator\\Desktop\\Files\\mfa\\mfaformann) and two file names - fdp.exe and\n**PDFOPENER_CONSOLE.exe.**\n\nWe didn’t investigate these files further, but they could easily be analyzed further for\nadditional pivot points.\n\n## Infection Vector\n\nLooking closer at the domains and files involved in this campaign, while looking for infection\n[vectors, with the help of Eyal Sela from ClearSky, we noticed that the domain](https://www.clearskysec.com/)\n_http://ssl[.]pmo.gov.il-dana-naauthurl1-welcome.cgi.primeminister-goverment-_\n_techcenter[.]tech/% was in fact, the original phishing page to drop the Annual Survey.docx_\n\n\n-----\n\nThis spear phishing page appears to be a near clone of the valid Israeli Prime Minister s\noffice SSL VPN login page; except for a few changes that include the “Plugin installation\ninitiated…”, “Restitution of Jewish Property” and “Please login to start the installation.”\n\n## Conclusion\n\nThere are additional pivots that one could perform on this dataset and possibly find other\ncampaigns targeting Israeli interests. For the sake of this blog, we didn’t go down every\nrabbit hole as this is a large campaign and can be further investigated.\n\nAttribution is not something we typically get involved in. It is extraordinarily difficult to\ndefinitively state where an attacker originates. However, in this case, some of the indicators\nof compromise or attack attribute this activity to a well known attack group called\nCopyKitten*.\n\nAfter reading this blog, one can see the power of pivots, especially off initially identified\nattacker infrastructure. This is even useful when an attacker uses privacy protection when\nregistering domains as part of their infrastructure. As we continue to monitor attacker\ngroups, it’s important to pay attention to the importance of not just pivots, but the\nappropriate pivots to make. Ideally, using a tool like DomainTools can eliminate some of\nthose manual processes, thus reducing the amount of dwell time on a network.\n\n_____________\n\n*http://www.clearskysec.com/report-the-copykittens-are-targeting-israelis/\n\nI’d like to personally thank Eyal Sela from ClearSky Cyber Security who assisted in\nproviding intelligence as we both investigated this actor.\n\n**IOCs/IOAs referenced in this blog**\n\nDomains\n\nprimeminister-goverment-techcenter[.]tech\nhttp://ssl.pmo.gov.il-dana-naauthurl1-welcome.cgi.primeminister-govermenttechcenter[.]tech\nstatic.dyn-usr.f-login-me.c19.a23.akamaitechnology[.]com\n212.199.61.51.static.012.net[.]il\n\nIPs\n\n212[.]199[.]61[.]51\n86[.]105[.]18[.]5\n\nFiles\n\n\n-----\n\nAnnual Survey.docx and/or סקרשנתי.docx\n5fe0e156a308b48fb2f9577ed3e3b09768976fdd99f6b2d2db5658b138676902\nPDFOPENER_CONSOLE.exe:\n4d657793ddc9c49abe7e4afcf9abb43626e91a18a925223555070c53fd672b59\n\noleObject1.bin\n\n7651f0d886e1c1054eb716352468ec6aedab06ed61e1eebd02bca4efbb974fb6\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-21 - Hunt Case Study- Hunting Campaign Indicators on Privacy Protected Attack Infrastructure.pdf"
    ],
    "report_names": [
        "2017-03-21 - Hunt Case Study- Hunting Campaign Indicators on Privacy Protected Attack Infrastructure.pdf"
    ],
    "threat_actors": [
        {
            "id": "467c5e72-55a6-40a9-9b73-bb764889c0a5",
            "created_at": "2022-10-25T16:07:23.486532Z",
            "updated_at": "2025-03-27T02:02:09.829604Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "CopyKittens",
                "Operation Wilted Tulip",
                "Slayer Kitten"
            ],
            "source_name": "ETDA:CopyKittens",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "EmPyre",
                "EmpireProject",
                "Matryoshka",
                "Matryoshka RAT",
                "PowerShell Empire",
                "TDTESS",
                "Vminst",
                "ZPP",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9fb19abe-4035-4f22-a595-641b7f3443a9",
            "created_at": "2022-10-25T15:50:23.748944Z",
            "updated_at": "2025-03-27T02:00:55.537809Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "CopyKittens"
            ],
            "source_name": "MITRE:CopyKittens",
            "tools": [
                "Cobalt Strike",
                "TDTESS",
                "Matryoshka"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4557ed9-2455-44c5-a768-dfb80ccae259",
            "created_at": "2023-01-06T13:46:38.652329Z",
            "updated_at": "2025-03-27T02:00:02.883544Z",
            "deleted_at": null,
            "main_name": "CopyKittens",
            "aliases": [
                "Slayer Kitten",
                "G0052"
            ],
            "source_name": "MISPGALAXY:CopyKittens",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535789,
    "ts_updated_at": 1743041400,
    "ts_creation_date": 1653693743,
    "ts_modification_date": 1653693743,
    "files": {
        "pdf": "https://archive.orkl.eu/c4921f6575872f5c2a39143662a64258ff3e8496.pdf",
        "text": "https://archive.orkl.eu/c4921f6575872f5c2a39143662a64258ff3e8496.txt",
        "img": "https://archive.orkl.eu/c4921f6575872f5c2a39143662a64258ff3e8496.jpg"
    }
}