{
    "id": "a2e5eefd-f45e-47fa-bbe7-7bf70a98497b",
    "created_at": "2023-03-03T02:06:09.447467Z",
    "updated_at": "2025-03-27T02:05:46.714963Z",
    "deleted_at": null,
    "sha1_hash": "09ceb98ca3ab4c42501e5f4554197fa9849e1648",
    "title": "2023-02-14 - Havoc Across the Cyberspace",
    "authors": "",
    "file_creation_date": "2023-03-01T09:19:54Z",
    "file_modification_date": "2023-03-01T09:19:54Z",
    "file_size": 5154644,
    "plain_text": "# Havoc Across the Cyberspace\n\n**[zscaler.com/blogs/security-research/havoc-across-cyberspace](https://www.zscaler.com/blogs/security-research/havoc-across-cyberspace)**\n\nZscaler ThreatLabz research team observed a new campaign targeting a Government\norganization in which the threat actors utilized a new Command & Control (C2) framework\nnamed **[Havoc. While C2 frameworks are prolific, the open-source Havoc framework is an](https://github.com/HavocFramework/Havoc)**\nadvanced post-exploitation command and control framework capable of bypassing the most\ncurrent and updated version of Windows 11 defender due to the implementation of\nadvanced evasion techniques such as indirect syscalls and sleep obfuscation.\n\nThe technical analysis that follows provides an overview of recently discovered attack\ncampaign targeting government organization using Havoc and reveals how it can be\nleveraged by the threat actors in various campaigns.\n\n## Key Observations:\n\nObserved New threat campaign leveraging the open-source Havoc C2 framework\ntargeting Government organization\nAnalysis of Havoc Demon - Implant generated via the Havoc framework\n\nShellCode Loader:\n\nDisables the Event Tracing for Windows (ETW) to evade detection\nmechanisms.\nDecrypts and executes the shellcode via CreateThreadpoolWait()\nKaynLdr Shellcode:\n\nReflectively loads the Havoc’s Demon DLL without the DOS and NT\nheaders to evade detection.\nPerforms API hashing routine to resolve virtual addresses of various\nNTAPI's by using modified DJB2 hashing algorithm\n\n\n-----\n\nDemon DLL:\n\nParsing configuration files\nUsage of Sleep Obfuscation Techniques\nCommunication with the CnC Server - CheckIn Request and Command\nExecution\nPerforms In-Direct Syscalls and Return Address Stack Spoofing and more\nPerformed tracking of the threat actor based on infrastructure analysis and opsec\nblunders where we gathered and analyzed the screenshots of the threat actors\nmachine from the CnC due to self-compromise.\n\n## Table Of Contents:\n\n Campaign:\n\nIn the beginning of January, this year, we discovered an executable named “pics.exe” in the\nZscaler Cloud targeting a Government Organization. The executable was downloaded from\na remote server: “146[.]190[.]48[.]229” as shown in the screenshot below\n\n_Fig 1. Campaign - Zscaler Cloud_\n\nLet us now examine the infection chain used by the threat actors in the following campaign\nto deliver the Havoc Demon on the target machine.\n\n## Infection Chain Analysis:\n\n\n-----\n\n_Fig 2. Infection chain_\n\nThe infection chain utilized by the threat actors for delivering the Havoc Demon on the\ntarget machines commences with a ZIP Archive named “ZeroTwo.zip” consisting of two files\n“character.scr” and “Untitled Document.docx” as shown in the screenshot below.\n\n_Fig 3. ZIP Archive_\n\nHere the “Untitled Document.docx” is a document consisting of paragraphs regarding the\n“ZeroTwo” which is a fictional character in the Japanese anime television series Darling in\nthe Franxx.\n\n\n-----\n\n_Fig 4. Contents of the Document bundled in the ZIP Archive_\n\nFurther the screen saver file “character.scr” is basically a downloader commissioned to\ndownload and execute the Havoc Demon Agent on the victim machine. The Downloader\nbinary is compiled using a BAT to EXE converter “BAT2EXE” which allows users to convert\nBatch scripts into executables as shown in the screenshot below. The BAT2EXE argument\ncan be seen in the downloader binary.\n\n_Fig 5. BAT2EXE argument used in the downloader binary_\n\nOnce executed the BAT2EXE compiled binary loads and decrypts the Batch Script from the\n.rsrc section as shown in the screenshot below.\n\n\n-----\n\n_Fig 6. Decrypted BAT Script_\n\nThe binary then writes and executes the decrypted BAT script from the Temp folder as\nshown in the image below.\n\n_Fig 7. Decrypted BAT Script written in the Temp folder_\n\nThe Decrypted BAT Script upon execution performs the following tasks:\n\nChecks whether “teste.exe” exists in the Temp folder, if not, it downloads the final payload\nfrom http[:]//146[.]190[.]48[.]229/pics.exe and saves it as “seethe.exe” in the Temp folder via\nInvoke-WebRequest and then executes it using “start seethe.exe”\n\n\n-----\n\n_Fig 8. Downloads the final payload “pics.exe” from remote server via Invoke-WebRequest_\n\nThen it checks whether “testv.exe” exists in the Temp folder, if not, it downloads an image\nfrom “https[:]//i[.]pinimg[.]com/originals/d4/20/66/d42066e9f8c4b75a0723b8778c370f1d.jpg”\nand saves it as images.jpg in the Temp folder and opens it using images.jpg.\n\n_Fig 9. Downloads a JPG image from pinimg[.]com_\n\nThe following image of the “Zero Two” character was downloaded from pinimg[.]com &\nexecuted in order to conceal the actual execution and malicious activities performed by the\nfinal payload.\n\n\n-----\n\n_Fig 10. Zero Two Image downloaded from pinimg[.]com_\n\nBefore analyzing the final payload, let’s take a look at another similar Downloader compiled\nvia BAT2EXE named “ihatemylife.exe”, in this case, the decrypted Batch script downloads\nthe final payload from “https[:]//ttwweatterarartgea[.]ga/image[.]exe” using InvokeWebRequest alongside the payload it also downloads an image to conceal the malicious\nactivities as shown in the screenshot below.\n\n\n-----\n\n_Fig 11. Decrypted Batch scripts downloads the final payload from_\n_https[:]//ttwweatterarartgea[.]ga_\n\n_Fig 12. Image Downloaded by the Batch Script to conceal malicious activities_\n\nNow let’s analyze the final In-the-Wild “Havoc Demon” payload which was downloaded via\nthe Downloader named “character.scr” from http[:]//146[.]190[.]48[.]229/pics.exe as\nexplained previously.\n\n**[Havoc Demon is the implant generated via the Havoc Framework - which is a modern and](https://github.com/HavocFramework/Havoc)**\nmalleable post-exploitation command and control framework created by @C5pider.\n\n\n-----\n\n_Fig 13. The Havoc Framework_\n\n_Fig 14. Havoc Framework - Interface_\n\n**Shellcode Loader:**\n\nThe Downloaded payload “pics.exe” is the “Shellcode Loader” which is signed using\nMicrosoft’s Digital certificate as shown in the screenshot below\n\n\n-----\n\n_Fig 15. Microsoft Signed Executable_\n\nUpon execution the Shellcode Loader at first disables the Event Tracing for Windows (ETW)\nby patching the WinApi “EtwEventWrite()” which is responsible for writing an event. ETW\nPatching process:\n\nRetrieves module handle of ntdll.dll via GetModuleHandleA\nRetrieves address of EtwEventWrite via GetProcAddress\n\n_Fig 16. Fetches the address of EtwEventWrite_\n\n\n-----\n\nFurther it changes the protection of the region via VirtualProtect and then overwrites\nthe first 4 bytes of the EtwEventWrite with following bytes: 0x48,0x33,0xc0,0xc3 (xor\nrax,rax | ret)\n\n_Fig 17. Overwriting bytes to patch EtwEventWrite_\n\nBy patching the EtwEventWrite function the ETW will not be able to write any events thus\ndisabling the ETW.\n\nThen the payload AES decrypts the shellcode using CryptDecrypt() as shown in the\nscreenshot below - in this case the Algorithm ID used is “0x00006610” - AES256\n\n\n-----\n\n_Fig 18. AES Decrypts the Shellcode via CryptDecrypt_\n\nOnce the Shellcode is decrypted, the Shellcode is executed via CreateThreadpoolWait()\nwhere at first it creates an event object in a signaled state via CreateEventA(), then\nallocates RWX memory via VirtualAlloc() and writes the Shellcode in the allocated memory.\nFurther it creates a wait object using CreateThreadpoolWait, here the first argument callback function is set to the address of the shellcode. Then it set’s the wait object via the\nNtApi “TpSetWait” and at last calls the WaitForSingleObject which once executed checks if\nthe waitable object is in signaled state, as our event was created in signaled state the\ncallback function is been executed i.e the decrypted shellcode is been executed and the\ncontrol flow is been transferred to the shellcode.\n\n_Fig 19. Shellcode execution via CreateThreadpoolWait_\n\n**KaynLdr - Shellcode**\n\nThe Shellcode in this case is the “KaynLdr” which is commissioned to reflectively load the\nHavoc’s Demon DLL implant by calling its entrypoint function. Once the Shellcode is\nexecuted it retrieves the image base of the Demon DLL which is embedded in the shellcode\nitself by executing the following inline assembly function called KaynCaller.\n\n\n-----\n\n_Fig 20. Retrieves the Image Base of the Embedded Demon DLL_\n\nFurther the KaynLdr performs the API Hashing routine in order to resolve the virtual\naddresses of various NTAPI’s by walking the export address table of the ntdll.dll (Function:\nLdrFunctionAddr) and initially the virtual address of the NTDLL.dll is been retrieved by\nwalking the Process Environment Block (Function: LdrFunctionAddr) as shown in the\nscreenshot below\n\n_Fig 21. API Hashing Routine used by Havoc Demon_\n\nHere the hashing algorithm used is a modified version of “DJB2” algorithm based on the\nconstant “5381” or “0x1505” as shown in the screenshot below.\n\n\n-----\n\n_Fig 22. Modified DJB2 Hashing Algorithm used in the API Hashing Routine_\n\nVirtual Addresses for the following module and NTAPI’s are retrieved by using the API\nHashing routine where the hardcoded DJB2 hashes are compared with the dynamically\ngenerated hash.\n\n0x70e61753 ntdll.dll\n\n0x9e456a43 LdrLoadDll\n\n0xf783b8ec NtAllocateVirtualMemory\n\n0x50e92888 NtProtectVirtualMemory\n\nFurther the Embedded Demon DLL is memory mapped and the base relocations are\ncalculated if required in an allocated memory page procured by calling the\nNtAllocateVirtualMemory(). Also the page protections are changed via multiple calls to\nNtProtectVirtualMemory as shown below.\n\n\n-----\n\n_Fig 23. Memory Mapping of the embedded Demon DLL_\n\nThe Demon DLL is memory mapped in the Allocated memory without the DOS and NT\nHeaders in order to evade detection mechanisms.\n\n\n-----\n\n_Fig 24. Demon DLL is memory mapped without DOS and NT Headers_\n\nNow once the Demon DLL is memory mapped the KaynDllMain i.e the entrypoint of the DLL\nis executed by the KaynLdr as shown below, from there on the control is transferred to the\nHavoc Demon DLL Implant.\n\n\n-----\n\n_Fig 25. Entrypoint of the Demon DLL is been executed by the KaynLdr_\n\n**Analysis of Havoc Demon DLL:**\n\nThe entrypoint of the Havoc Demon DLL is executed by the KaynLdr as discussed\npreviously. Now as the Havoc Demon has many features, we will only focus on a few of\nthem in the following blog, as the features can be deduced from its source at:\n[https://github.com/HavocFramework/Havoc](https://github.com/HavocFramework/Havoc)\n\nSo once the Havoc Demon is been executed there are four functions which are been\nexecuted by the DemonMain():\n\n**DemonInit**\n**DemonMetaData**\n**DemonConfig**\n**DemonRoutine**\n\nThe DemonInit is the initialization function which\n\nRetrieves the virtual addresses of functions from modules such as ntdll.dll/kernel32.dll\nby calling the API Hashing Routine discussed previously.\nRetrevies Syscall stubs for various NTAPI’s\nLoads various Modules via walking the PEB with stacked strings\nInitialize Session and Config Objects such as Demon AgentID, ProcessArch etc.\n\nNow let’s understand how the Configuration is being parsed via the DemonConfig()\nfunction.\n\nThe Demon’s Configuration is been stored in the .data section as shown in the screenshot\nbelow\n\n\n-----\n\n_Fig 26. Demon Configuration stored in the .data section_\n\nThe DemonConfig function parses the configuration by indexing the various required values\nfrom the config. Following is the configuration for the Demon DLL used in the campaign.\n\n**Configuration:**\n\nSleep: 2 (0x2)\nInjection:\n\nAllocate: Native/Syscall (0x2)\nExecute: Native/Syscall (0x2)\nSpawn:\n\nx64: C:\\Windows\\System32\\notepad.exe\nx86: C:\\Windows\\SysWOW64\\notepad.exe\nSleep Obfuscation Technique: Ekko (0x2)\nMethod: POST\nHost: 146[.]190[.]48[.]229\nTransport Secure: TRUE\nUserAgent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537/36 (KHTML, like\nGecko) Chrome/96.0.4664.110 Safari/537.36\n\n\n-----\n\n_Fig 27. Demon Configuration - Host (CnC) and UserAgent parsed_\n\nThe DemonRoutine() function is the main loop for the malware, it is responsible for\nconnecting to the command and control (C2) server, waiting for tasks from the server,\nexecuting those tasks, and then waiting again for more tasks and running indefinitely. It\ndoes the following things:\n\nFirst, it checks if it is connected to the C2 server. If not, it calls TransportInit() to\nconnect to the server.\nIf the connection is successful, it enters the CommandDispatcher() function, which is\nresponsible for a task routine which parses the tasks and executes them until there\nare no more tasks in the queue.\nIf the malware is unable to connect to the C2 server, it will keep trying to connect to\nthe server again\n\nNow let’s understand how it connects to the TransportInit function:\n\nTransportInit() is responsible for connecting to the C2 server and establishing a session. It\nfirst sends the AES encrypted MetaData packet i.e the Check-in request generated via the\nDemonMetaData() function through the PackageTransmit() function, which could be\nsending data over HTTP or SMB, depending on the value of the TRANSPORT_HTTP or\nTRANSPORT_SMB macro. If the transmission is successful, it then decrypts the received\ndata using AES encryption with a given key and initialization vector on the TeamServer. The\ndecrypted data is then checked against the agent's ID, and if they match, the session is\nmarked as connected and the function returns true.\n\n_Fig 28. Metadata Structure - CheckIn Request_\n\n\n-----\n\nTransportSend() is used to send data to the C2 server. It takes a pointer to the data and its\nsize as input, and optionally returns received data and its size.It then creates a buffer with\nthe data to be sent, and depending on the transport method, it either sends the data over\nHTTP or SMB.\n\n_Fig 29. TransportSend Function Arguments With Encrypted Data of the Check In request_\n\nOn the Teamserver end the CheckIn request with the metadata packet is been decrypted\nand showcased on the terminal with both encrypted and decrypted details of packets sent\nand received\n\n\n-----\n\n_Fig 30. Check In Request - Metadata packet parsed by the Team Server_\n\n**Command Execution:**\n\n\n-----\n\nAfter the demon is deployed successfully on the target s machine, the server is able to\nexecute various commands on the target system. If the command \"whoami\" is issued to the\npayload, it would trigger the execution of the command and display the current user running\nthe session.The server logs the command and its response upon execution.\n\n_Fig 31. Command execution using Havoc GUI_\n\nOnce the command is executed on the victim machine, the command output is AES\nEncrypted and then sent to the CnC server, which is then decrypted by the TeamServer as\nshown in the screenshot below.\n\n\n-----\n\n_Fig 32. Command Output Logs parsed by the TeamServer_\n\n**List Of Commands:**\n\nThe specific commands available in Havoc will depend on the version and configuration of\nthe framework, but some common commands that are often included in C2 frameworks\ninclude:\n\n\n-----\n\n_Fig 33. Commands List_\n\nFurther the Demon implements various techniques mentioned below which can be analyzed\nfrom the [source:](https://github.com/HavocFramework/Havoc)\n\nReturn Address Stack Spoofing\nIn-Direct Syscalls\nSleep Masking Techniques\n\nEkko\nFOLIAGE\nWaitForSingleObjectEx\n\n## Tracking the threat actor - Infrastructure and Opsec blunders:\n\nThe domain name “ttwweatterarartgea[.]ga” from where the final havoc demon payload\n“image.exe” is downloaded in this case resolves to the IP Address “146[.]190[.]48[.]229” which is the IP address from where the final payload “pics.exe” was downloaded via the\nURL: http[:]//146[.]190[.]48[.]229/pics.exe previously. Whilst performing the infrastructure\nanalysis we came across an open-directory on the server “ttwweatterarartgea[.]ga” where\nmultiple demon & metasploit payloads along with internal logs and screenshots were hosted\nas shown in the screenshot below.\n\n\n-----\n\n_Fig 34. Open Directory - “ttwweatterarartgea[.]ga”_\n\nWhile examining the files on the open directory, we stumbled upon a HTML file named\n“NFcmoOSI.html”. The file displayed a screenshot of the threat actor’s machine as\nillustrated below.\n\n\n-----\n\n_Fig 35. Tracking the threat actor - Metasploit Screenshare_\n\nBased on our analysis, the threat actor detonated the meterpreter payload on its own\nmachine and then used the CnC Server to initiate the Metasploit screenshare\ncommand.This action generated a file named \"NFcmoOSI.html\" on the server which\ncontained a screenshot of the machine being shared along with the Target IP, Start Time\nand status of the screenshare.\n\nFurther we were able to gather following information from the threat actors machine\nscreenshot as highlighted below where the initial payload used in our campaign was\npresent on the TAs machine along with the Havoc Demon implant and much more.\n\n\n-----\n\n_Fig 36. Tracking the threat actor - Machine Screenshot_\n\nNow based on the Target IP (i.e the threat actors IP) the location of that IP seems to be in\nNew York, USA. Additionally, the temperature at the time of the screenshot: 1/12/2023\n7:28PM was 50° Fahrenheit (Cloudy), after mapping the historical weather data of New York\nat that specific time we found that the average temperature was approx close to 50°\ndegrees Fahrenheit during that time period.\n\n_Fig 37. Tracking the threat actor - Temperature_\n\nAlongside, we came across a log file named “wget-log” which consists of the wget log\nwhere the Document lure “Untitled-document.docx” was downloaded from the DropBox\nURL: “https://www.dropbox.com/scl/fi/hnlvrwbl9v2zadl356mt3/Untitled-document.docx”\n\n\n-----\n\n_Fig 38. Tracking the threat actor - wget logs_\n\nAlso the HTML pages “index.nginx-debian.html” and “login.nginx-debian.html” are underdevelopment Twitter phishing pages as shown in the screenshot below.\n\n_Fig 39. Twitter Phishing Pages hosted on “ttwweatterarartgea[.]ga”_\n\n## Zscaler Cloud Sandbox Report:\n\n\n-----\n\n_Fig 40. Cloud Sandbox Report_\n\nZscaler's multilayered cloud security platform detects indicators, as shown below:\n\n**[Win64.Backdoor.HavocC2](https://threatlibrary.zscaler.com/threats/3e991d3d-0ad0-4188-9315-acca9e3baf4c)**\n\n## Conclusion:\n\nThe Havoc C2 framework campaign highlights the importance of proper cybersecurity\nmeasures in today's digital world. The use of payloads and CnC servers to execute\nmalicious commands and gather sensitive information showcases the ever-present threat of\ncyber attacks. The scenario described in the blog demonstrates the capabilities of such\ncampaigns and the need for organizations to stay vigilant and protect their systems. With\nthe rise of technology, the need for robust security solutions becomes increasingly vital, and\norganizations must take proactive steps to ensure the safety of their systems and data.\n\n## Indicators Of Compromise:\n\n**Havoc CnC:**\n\nIP: 146[.]190[.]48[.]229\n\n\n-----\n\nDomain: ttwweatterarartgea[.]ga\n\n**Hashes:**\n\nPics.exe - 5be4e5115cdf225871a66899b7bc5861\n\nImage.exe - bfa5f1d8df27248d840d1d86121f2169\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-14 - Havoc Across the Cyberspace.pdf"
    ],
    "report_names": [
        "2023-02-14 - Havoc Across the Cyberspace.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1677809169,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1677662394,
    "ts_modification_date": 1677662394,
    "files": {
        "pdf": "https://archive.orkl.eu/09ceb98ca3ab4c42501e5f4554197fa9849e1648.pdf",
        "text": "https://archive.orkl.eu/09ceb98ca3ab4c42501e5f4554197fa9849e1648.txt",
        "img": "https://archive.orkl.eu/09ceb98ca3ab4c42501e5f4554197fa9849e1648.jpg"
    }
}