{
    "id": "a30b59b0-178f-4b8a-8e55-02b76d79fc92",
    "created_at": "2023-01-12T15:06:52.873696Z",
    "updated_at": "2025-03-27T02:16:17.010448Z",
    "deleted_at": null,
    "sha1_hash": "7bf49c76b5c80a1abb9e7bf9e579f091fed706f3",
    "title": "2020-11-12 - Hunting for Barium using Azure Sentinel",
    "authors": "",
    "file_creation_date": "2022-05-28T17:43:42Z",
    "file_modification_date": "2022-05-28T17:43:42Z",
    "file_size": 115810,
    "plain_text": "# Hunting for Barium using Azure Sentinel\n\n**[techcommunity.microsoft.com/t5/azure-sentinel/hunting-for-barium-using-azure-sentinel/ba-p/1875913](https://techcommunity.microsoft.com/t5/azure-sentinel/hunting-for-barium-using-azure-sentinel/ba-p/1875913)**\n\nNovember 11, 2020\n\nLeveraging Indictors of Compromise (IOC) and searching historical data for attack patterns is one of the primary responsibilities of a\nsecurity monitoring team. Relevant security data for threat hunting/investigation related to an enterprise is produced in multiple\nlocations - cloud, on-premises, and being able to analyze all the data from a single point makes it easier to spot trends and attack.\nAzure Sentinel has made it super easy to collect data from multiple logs across different environments and run [KQL queries of](https://docs.microsoft.com/en-us/azure/data-explorer/kql-quick-reference)\nrecently released threat indicators across this entire data set. For example, through its recently released Microsoft 365\nDefender connector security teams can now easily ingest Microsoft 365 data into Azure Sentinel allowing correlation of M365 raw\nlogs with Sentinel’s additional data sources to provide additional insights for investigations, hunting and alerts. In this blog post we\nshare some of the IOC’s related to one such threat actor that Microsoft tracks as Barium and the sample Azure Sentinel\nqueries related to it that leverage multiple logs including those coming from Microsoft 365 Defender connector .\n\nAbout a month and a half ago, the US Department of Justice, Office of Public Affairs, released [documents detailing work done by a](https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connection-computer)\nrange of public and private sector organizations, including Microsoft, to disrupt Barium’s cyberattack infrastructure. Barium\nis intent on compromising research and development (R&D) heavy organizations in telecom, high\ntech, computer, and healthcare; their financially motivated operations have focused primarily on the video game industry. The\ntechniques that the group have used in the past have varied from using malicious .lnk files, Word and PowerPoint macros, to the use\nof open-source tools like Cobalt strike to achieve their objective. The group has been pretty prolific in the use of “supply chain”\nattacks to compromise software providers and then modify the providers’ code to facilitate further intrusions against its customers.\nThey have also been seen using C2 “dead drops,” which are seemingly legitimate web pages that have encoded instructions to their\nmalware. In their campaign they have also been seen using typo-squatted domains to impersonate legitimate companies and\nproducts.\n\nMicrosoft Threat Intelligence Center (MSTIC) along with partner teams have been tracking and gathering information on\nBarium, monitoring the group’s activities as they operate a number of websites, domains and internet-connected computers. You can\nread more about this in the September 2020 [Microsoft Digital Defense report.](https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/)\n\nMSTIC has now shared many of these indicators (IP/domains) so that you can hunt for them in Azure Sentinel using relevant\ndata like the [newly integrated](https://techcommunity.microsoft.com/t5/azure-sentinel/what-s-new-microsoft-365-defender-connector-now-in-public/ba-p/1865651) [Microsoft 365 Defender](https://techcommunity.microsoft.com/t5/azure-sentinel/what-s-new-microsoft-365-defender-connector-now-in-public/ba-p/1865651) data, DNS logs, Firewall data etc. Microsoft 365 E5 customers, now also have\nthe advantage of getting Azure credits towards Microsoft 365 data ingestion into Azure Sentinel - see https://aka.ms/m365-sentineloffer for details. With this new offer, you can take advantage of end-to-end integrated security and save significant costs when\ningesting Microsoft 365 data into Azure Sentinel.\n\nBelow are sample Azure Sentinel queries that you can run to check for Barium activity in your environment.\n\n[Barium IP Indicators](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/BariumIPIOC112020.yaml)\n\nid: 6ee72a9e-2e54-459c-bc9a-9c09a6502a63\n\nname: Known Barium IP\n\ndescription: |\n\n'Identifies a match across various data feeds for IP IOCs related to the Barium activity group.\n\nReferences: [https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-c...'](https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connection-computer)\n\n\n-----\n\ny g\n\nrequiredDataConnectors:\n\n- connectorId: Office365\n\ndataTypes:\n\n- OfficeActivity\n\n- connectorId: DNS\n\ndataTypes:\n\n- DnsEvents\n\n- connectorId: AzureMonitor(VMInsights)\n\ndataTypes:\n\n- VMConnection\n\n- connectorId: CiscoASA\n\ndataTypes:\n\n- CommonSecurityLog\n\n- connectorId: PaloAltoNetworks\n\ndataTypes:\n\n- CommonSecurityLog\n\n- connectorId: SecurityEvents\n\ndataTypes:\n\n- SecurityEvent\n\n- connectorId: AzureActiveDirectory\n\ndataTypes:\n\n- SigninLogs\n\n- connectorId: AzureMonitor(WireData)\n\ndataTypes:\n\n- WireData\n\n- connectorId: AzureMonitor(IIS)\n\ndataTypes:\n\n- W3CIISLog\n\n- connectorId: AzureActivity\n\ndataTypes:\n\n- AzureActivity\n\n- connectorId: AWS\n\ndataTypes:\n\n- AWSCloudTrail\n\n- connectorId: Microsoft 365 Defender\n\ndataTypes:\n\n- DeviceNetworkEvents\n\nqueryFrequency: 1d\n\n\n-----\n\nq y\n\ntriggerOperator: gt\n\ntriggerThreshold: 0\n\ntactics:\n\n- CommandAndControl\n\nquery: |\n\nlet timeframe = 1d;\n\nlet IPList = dynamic([\"216.24.185.74\", \"107.175.189.159\", \"192.210.132.102\", \"67.230.163.214\",\n\n\"199.19.110.240\", \"107.148.130.176\", \"154.212.129.218\", \"172.86.75.54\", \"45.61.136.199\",\n\n\"149.28.150.195\", \"108.61.214.194\", \"144.202.98.198\", \"149.28.84.98\", \"103.99.209.78\",\n\n\"45.61.136.2\", \"176.122.162.149\", \"192.3.80.245\", \"149.28.23.32\", \"107.182.18.149\", \"107.174.45.134\",\n\n\"149.248.18.104\", \"65.49.192.74\", \"156.255.2.154\", \"45.76.6.149\", \"8.9.11.130\", \"140.238.27.255\",\n\n\"107.182.24.70\", \"176.122.188.254\", \"192.161.161.108\", \"64.64.234.24\", \"104.224.185.36\",\n\n\"104.233.224.227\", \"104.36.69.105\", \"119.28.139.120\", \"161.117.39.130\", \"66.42.100.42\", \"45.76.31.159\",\n\n\"149.248.8.134\", \"216.24.182.48\", \"66.42.103.222\", \"218.89.236.11\", \"180.150.227.249\", \"47.75.80.23\",\n\n\"124.156.164.19\", \"149.248.62.83\", \"150.109.76.174\", \"222.209.187.207\", \"218.38.191.38\",\n\n\"119.28.226.59\", \"66.42.98.220\", \"74.82.201.8\", \"173.242.122.198\", \"45.32.130.72\", \"89.35.178.10\",\n\n\"89.43.60.113\"]);\n\n(union isfuzzy=true\n\n(CommonSecurityLog\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(SourceIP) or isnotempty(DestinationIP)\n\n| where SourceIP in (IPList) or DestinationIP in (IPList) or Message has_any (IPList)\n\n| extend IPMatch = case(SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\",\n\n\"Message\")\n\n| summarize StartTimeUtc = min(TimeGenerated), EndTimeUtc = max(TimeGenerated) by\n\nSourceIP, DestinationIP, DeviceProduct, DeviceAction, Message, Protocol, SourcePort, DestinationPort,\n\nDeviceAddress, DeviceName, IPMatch\n\n| extend timestamp = StartTimeUtc, IPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP,\n\nIPMatch == \"DestinationIP\", DestinationIP, \"IP in Message Field\")\n\n),\n\n(OfficeActivity\n\n| where TimeGenerated >= ago(timeframe)\n\n|extend SourceIPAddress = ClientIP, Account = UserId\n\n| where SourceIPAddress in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = SourceIPAddress,\n\nAccountCustomEntity = Account\n\n),\n\n(DnsEvents\n\n\n-----\n\n| g ( )\n\n| extend DestinationIPAddress = IPAddresses, Host = Computer\n\n| where DestinationIPAddress has_any (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = DestinationIPAddress,\n\nHostCustomEntity = Host\n\n),\n\n(VMConnection\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(SourceIp) or isnotempty(DestinationIp)\n\n| where SourceIp in (IPList) or DestinationIp in (IPList)\n\n| extend IPMatch = case( SourceIp in (IPList), \"SourceIP\", DestinationIp in (IPList),\n\n\"DestinationIP\", \"None\")\n\n| extend timestamp = TimeGenerated, IPCustomEntity = case(IPMatch == \"SourceIP\",\n\nSourceIp, IPMatch == \"DestinationIP\", DestinationIp, \"None\"), Host = Computer\n\n),\n\n(Event\n\n| where TimeGenerated >= ago(timeframe)\n\n| where Source == \"Microsoft-Windows-Sysmon\"\n\n| where EventID == 3\n\n| extend EvData = parse_xml(EventData)\n\n| extend EventDetail = EvData.DataItem.EventData.Data\n\n| extend SourceIP = EventDetail.[9].[\"#text\"], DestinationIP = EventDetail.[14].[\"#text\"]\n\n| where SourceIP in (IPList) or DestinationIP in (IPList)\n\n| extend IPMatch = case( SourceIP in (IPList), \"SourceIP\", DestinationIP in (IPList), \"DestinationIP\", \"None\")\n\n| extend timestamp = TimeGenerated, AccountCustomEntity = UserName, HostCustomEntity = Computer,\n\nIPCustomEntity = case(IPMatch == \"SourceIP\", SourceIP, IPMatch == \"DestinationIP\", DestinationIP, \"None\")\n\n),\n\n(WireData\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(RemoteIP)\n\n| where RemoteIP in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP, HostCustomEntity = Computer\n\n),\n\n(SigninLogs\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(IPAddress)\n\n| where IPAddress in (IPList)\n\n| extend timestamp = TimeGenerated, AccountCustomEntity = UserPrincipalName,\n\nIPCustomEntity = IPAddress\n\n\n-----\n\n),\n\n(W3CIISLog\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(cIP)\n\n| where cIP in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = cIP, HostCustomEntity = Computer,\n\nAccountCustomEntity = csUserName\n\n),\n\n(AzureActivity\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(CallerIpAddress)\n\n| where CallerIpAddress in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = CallerIpAddress, AccountCustomEntity = Caller\n\n),\n\n(\n\nAWSCloudTrail\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(SourceIpAddress)\n\n| where SourceIpAddress in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity =\n\nSourceIpAddress, AccountCustomEntity = UserIdentityUserName\n\n),\n\n(\n\nDeviceNetworkEvents\n\n| where TimeGenerated >= ago(timeframe)\n\n| where isnotempty(RemoteIP)\n\n| where RemoteIP in (IPList)\n\n| extend timestamp = TimeGenerated, IPCustomEntity = RemoteIP, HostCustomEntity = DeviceName\n\n)\n\n)\n\n[Barium Domain Indicators](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/BariumDomainIOC112020.yaml)\n\nid: 70b12a3b-4899-42cb-910c-5ffaf9d7997d\n\nname: Known Barium domains\n\ndescription: |\n\n'Identifies a match across various data feeds for domains IOCs related to the Barium activity group.'\n\n[References: https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connectio...](http://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connection-computer'%C2%A0)\nseverity: High\n\nrequiredDataConnectors:\n\n\n-----\n\ndataTypes:\n\n- DnsEvents\n\n- connectorId: AzureMonitor(VMInsights)\n\ndataTypes:\n\n- VMConnection\n\n- connectorId: CiscoASA\n\ndataTypes:\n\n- CommonSecurityLog\n\n- connectorId: PaloAltoNetworks\n\ndataTypes:\n\n- CommonSecurityLog\n\n- connectorId: Microsoft 365 Defender\n\ndataTypes:\n\n- DeviceNetworkEvents\n\nqueryFrequency: 1d\n\nqueryPeriod: 1d\n\ntriggerOperator: gt\n\ntriggerThreshold: 0\n\ntactics:\n\n- CommandAndControl\n\nquery: |\n\nlet timeframe = 1d;\n\nlet DomainNames = dynamic([\"0.ns1.dns-info.gq\", \"1.ns1.dns-info.gq\", \"10.ns1.dns-info.gq\", \"102.ns1.dns-info.gq\",\n\n\"104.ns1.dns-info.gq\", \"11.ns1.dns-info.gq\", \"110.ns1.dns-info.gq\", \"115.ns1.dns-info.gq\", \"116.ns1.dns-info.gq\",\n\n\"117.ns1.dns-info.gq\", \"118.ns1.dns-info.gq\", \"12.ns1.dns-info.gq\", \"120.ns1.dns-info.gq\", \"122.ns1.dns-info.gq\",\n\n\"123.ns1.dns-info.gq\", \"128.ns1.dns-info.gq\", \"13.ns1.dns-info.gq\", \"134.ns1.dns-info.gq\", \"135.ns1.dns-info.gq\",\n\n\"138.ns1.dns-info.gq\", \"14.ns1.dns-info.gq\", \"144.ns1.dns-info.gq\", \"15.ns1.dns-info.gq\", \"153.ns1.dns-info.gq\",\n\n\"157.ns1.dns-info.gq\", \"16.ns1.dns-info.gq\", \"17.ns1.dns-info.gq\", \"18.ns1.dns-info.gq\", \"19.ns1.dns-info.gq\",\n\n\"1a9604fa.ns1.feedsdns.com\", \"1c7606b6.ns1.steamappstore.com\", \"2.ns1.dns-info.gq\", \"20.ns1.dns-info.gq\",\n\n\"201.ns1.dns-info.gq\", \"202.ns1.dns-info.gq\", \"204.ns1.dns-info.gq\", \"207.ns1.dns-info.gq\", \"21.ns1.dns-info.gq\",\n\n\"210.ns1.dns-info.gq\", \"211.ns1.dns-info.gq\", \"216.ns1.dns-info.gq\", \"22.ns1.dns-info.gq\", \"220.ns1.dns-info.gq\",\n\n\"223.ns1.dns-info.gq\", \"23.ns1.dns-info.gq\", \"24.ns1.dns-info.gq\", \"25.ns1.dns-info.gq\", \"26.ns1.dns-info.gq\",\n\n\"27.ns1.dns-info.gq\", \"28.ns1.dns-info.gq\", \"29.ns1.dns-info.gq\", \"3.ns1.dns-info.gq\", \"30.ns1.dns-info.gq\",\n\n\"31.ns1.dns-info.gq\", \"32.ns1.dns-info.gq\", \"33.ns1.dns-info.gq\", \"34.ns1.dns-info.gq\", \"35.ns1.dns-info.gq\",\n\n\"36.ns1.dns-info.gq\", \"37.ns1.dns-info.gq\", \"39.ns1.dns-info.gq\", \"3d6fe4b2.ns1.steamappstore.com\",\n\n\"4.ns1.dns-info.gq\", \"40.ns1.dns-info.gq\", \"42.ns1.dns-info.gq\", \"43.ns1.dns-info.gq\", \"44.ns1.dns-info.gq\",\n\n\"45.ns1.dns-info.gq\", \"46.ns1.dns-info.gq\", \"48.ns1.dns-info.gq\", \"5.ns1.dns-info.gq\", \"50.ns1.dns-info.gq\",\n\n\"50417.service.gstatic.dnset.com\", \"51.ns1.dns-info.gq\", \"52.ns1.dns-info.gq\", \"53.ns1.dns-info.gq\",\n\n\n-----\n\ngq, gq, gq, gq, gq,\n\n\"6.ns1.dns-info.gq\", \"60.ns1.dns-info.gq\", \"62.ns1.dns-info.gq\", \"63.ns1.dns-info.gq\", \"64.ns1.dns-info.gq\",\n\n\"65.ns1.dns-info.gq\", \"67.ns1.dns-info.gq\", \"7.ns1.dns-info.gq\", \"70.ns1.dns-info.gq\", \"71.ns1.dns-info.gq\",\n\n\"73.ns1.dns-info.gq\", \"77.ns1.dns-info.gq\", \"77075.service.gstatic.dnset.com\", \"7c1947fa.ns1.steamappstore.com\",\n\n\"8.ns1.dns-info.gq\", \"81.ns1.dns-info.gq\", \"86.ns1.dns-info.gq\", \"87.ns1.dns-info.gq\", \"9.ns1.dns-info.gq\",\n\n\"94343.service.gstatic.dnset.com\", \"9939.service.gstatic.dnset.com\", \"aa.ns.mircosoftdoc.com\",\n\n\"aaa.feeds.api.ns1.feedsdns.com\", \"aaa.googlepublic.feeds.ns1.dns-info.gq\",\n\n\"aaa.resolution.174547._get.cache.up.sourcedns.tk\", \"acc.microsoftonetravel.com\",\n\n\"accounts.longmusic.com\", \"admin.dnstemplog.com\", \"agent.updatenai.com\",\n\n\"alibaba.zzux.com\", \"api.feedsdns.com\", \"app.portomnail.com\", \"asia.updatenai.com\",\n\n\"battllestategames.com\", \"bguha.serveuser.com\", \"binann-ce.com\", \"bing.dsmtp.com\",\n\n\"blog.cdsend.xyz\", \"brives.minivineyapp.com\", \"bsbana.dynamic-dns.net\",\n\n\"californiaforce.000webhostapp.com\", \"californiafroce.000webhostapp.com\",\n\n\"cdn.freetcp.com\", \"cdsend.xyz\", \"cipla.zzux.com\", \"cloudfeeddns.com\", \"comcleanner.info\",\n\n\"cs.microsoftsonline.net\", \"dns-info.gq\", \"dns05.cf\", \"dns22.ml\", \"dns224.com\",\n\n\"dnsdist.org\", \"dnstemplog.com\", \"doc.mircosoftdoc.com\", \"dropdns.com\",\n\n\"eshop.cdn.freetcp.com\", \"exchange.dumb1.com\", \"exchange.misecure.com\", \"exchange.mrbasic.com\",\n\n\"facebookdocs.com\", \"facebookint.com\", \"facebookvi.com\", \"feed.ns1.dns-info.gq\", \"feedsdns.com\",\n\n\"firejun.freeddns.com\", \"ftp.dns-info.dyndns.pro\", \"goallbandungtravel.com\", \"goodhk.azurewebsites.net\",\n\n\"googlepublic.feed.ns1.dns-info.gq\", \"gp.spotifylite.cloud\", \"gskytop.com\", \"gstatic.dnset.com\",\n\n\"gxxservice.com\", \"helpdesk.cdn.freetcp.com\", \"id.serveuser.com\", \"infestexe.com\", \"item.itemdb.com\",\n\n\"m.mircosoftdoc.com\", \"mail.transferdkim.xyz\", \"mcafee.updatenai.com\", \"mecgjm.mircosoftdoc.com\",\n\n\"microdocs.ga\", \"microsock.website\", \"microsocks.net\", \"microsoft.sendsmtp.com\",\n\n\"microsoftbook.dns05.com\", \"microsoftcontactcenter.com\", \"microsoftdocs.dns05.com\", \"microsoftdocs.ml\",\n\n\"microsoftonetravel.com\", \"microsoftonlines.net\", \"microsoftprod.com\", \"microsofts.dns1.us\", \"microsoftsonline.net\",\n\n\"minivineyapp.com\", \"mircosoftdoc.com\", \"mircosoftdocs.com\", \"mlcrosoft.ninth.biz\", \"mlcrosoft.site\",\n\n\"mm.portomnail.com\", \"msdnupdate.com\", \"msecdn.cloud\", \"mtnl1.dynamic-dns.net\", \"ns.gstatic.dnset.com\",\n\n\"ns.microsoftprod.com\", \"ns.steamappstore.com\", \"ns1.cdn.freetcp.com\", \"ns1.comcleanner.info\", \"ns1.dns-info.gq\",\n\n\"ns1.dns05.cf\", \"ns1.dnstemplog.com\", \"ns1.dropdns.com\", \"ns1.microsoftonetravel.com\",\n\n\"ns1.microsoftonlines.net\", \"ns1.microsoftprod.com\", \"ns1.microsoftsonline.net\", \"ns1.mlcrosoft.site\",\n\n\"ns1.teams.wikaba.com\", \"ns1.windowsdefende.com\", \"ns2.comcleanner.info\", \"ns2.dnstemplog.com\",\n\n\"ns2.microsoftonetravel.com\", \"ns2.microsoftprod.com\", \"ns2.microsoftsonline.net\", \"ns2.mlcrosoft.site\",\n\n\"ns2.windowsdefende.com\", \"ns3.microsoftprod.com\", \"ns3.mlcrosoft.site\", \"nutrition.mrbasic.com\",\n\n\"nutrition.youdontcare.com\", \"online.mlcrosoft.site\", \"online.msdnupdate.com\", \"outlookservce.site\",\n\n\"owa.jetos.com\", \"owa.otzo.com\", \"pornotime.co\", \"portomnail.com\",\n\n\"post.1a0.066e063ac.7c1947fa.ns1.steamappstore.com\", \"pricingdmdk.com\", \"prod.microsoftprod.com\",\n\n\"product.microsoftprod.com\", \"ptcl.yourtrap.com\", \"query.api.sourcedns.tk\", \"rb.itemdb.com\", \"redditcdn.com\",\n\n\"rss.otzo.com\", \"secure.msdnupdate.com\", \"service.dns22.ml\", \"service.gstatic.dnset.com\", \"service04.dns04.com\",\n\n\"settings.teams.wikaba.com\", \"sip.outlookservce.site\", \"sixindent.epizy.com\", \"soft.msdnupdate.com\", \"sourcedns.ml\",\n\n\n-----\n\n, p p, p y,, pp,\n\n\"store.otzo.com\", \"survey.outlookservce.site\", \"team.itemdb.com\", \"temp221.com\", \"test.microsoftprod.com\",\n\n\"thisisaaa.000webhostapp.com\", \"token.dns04.com\", \"token.dns05.com\", \"transferdkim.xyz\",\n\n\"travelsanignacio.com\", \"update08.com\", \"updated08.com\", \"updatenai.com\", \"wantforspeed.com\",\n\n\"web.mircosoftdoc.com\", \"webmail.pornotime.co\", \"webwhois.team.itemdb.com\", \"windowsdefende.com\", \"wnswindows.com\",\n\n\"ashcrack.freetcp.com\", \"battllestategames.com\", \"binannce.com\", \"cdsend.xyz\", \"comcleanner.info\", \"microsock.website\",\n\n\"microsocks.net\", \"microsoftsonline.net\", \"mlcrosoft.site\", \"notify.serveuser.com\", \"ns1.microsoftprod.com\",\n\n\"ns2.microsoftprod.com\", \"pricingdmdk.com\", \"steamappstore.com\", \"update08.com\", \"wnswindows.com\",\n\n\"youtube.dns05.com\", \"z1.zalofilescdn.com\", \"z2.zalofilescdn.com\", \"zalofilescdn.com\"]);\n\n(union isfuzzy=true\n\n(CommonSecurityLog\n\n| where TimeGenerated >= ago(timeframe)\n\n| parse Message with * '(' DNSName ')' *\n\n| where DNSName in~ (DomainNames)\n\n| extend Account = SourceUserID, Computer = DeviceName, IPAddress = DestinationIP\n\n),\n\n(DnsEvents\n\n| where TimeGenerated >= ago(timeframe)\n\n| extend DNSName = Name\n\n| where isnotempty(DNSName)\n\n| where DNSName in~ (DomainNames)\n\n| extend IPAddress = ClientIP\n\n),\n\n(VMConnection\n\n| where TimeGenerated >= ago(timeframe)\n\n| parse RemoteDnsCanonicalNames with * '[\"' DNSName '\"]' *\n\n| where isnotempty(DNSName)\n\n| where DNSName in~ (DomainNames)\n\n| extend IPAddress = RemoteIp\n\n),\n\n(\n\nDeviceNetworkEvents\n\n| where isnotempty(RemoteUrl)\n\n| where RemoteUrl in~ (DomainNames)\n\n| extend IPAddress = RemoteIP\n\n| extend Computer = DeviceName\n\n)\n\n)\n\n| extend timestamp = TimeGenerated, AccountCustomEntity = Account, HostCustomEntity = Computer, IPCustomEntity = IPAddress\n\n\n-----\n\nReferences:\n\n[https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-c...](https://www.justice.gov/opa/pr/seven-international-cyber-defendants-including-apt41-actors-charged-connection-computer)\n\n[https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/](https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-report-cyber-threats/)\n\n[https://docs.microsoft.com/en-us/azure/sentinel/connect-microsoft-365-defender](https://docs.microsoft.com/en-us/azure/sentinel/connect-microsoft-365-defender)\n\n[https://aka.ms/m365-sentinel-offer](https://aka.ms/m365-sentinel-offer)\n\n[https://techcommunity.microsoft.com/t5/azure-sentinel/what-s-new-microsoft-365-defender-connector-no...](https://techcommunity.microsoft.com/t5/azure-sentinel/what-s-new-microsoft-365-defender-connector-now-in-public/ba-p/1865651)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-12 - Hunting for Barium using Azure Sentinel.pdf"
    ],
    "report_names": [
        "2020-11-12 - Hunting for Barium using Azure Sentinel.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "49822165-5541-423d-8808-1c0a9448d588",
            "created_at": "2022-10-25T16:07:23.384093Z",
            "updated_at": "2025-03-27T02:02:09.772829Z",
            "deleted_at": null,
            "main_name": "Barium",
            "aliases": [
                "Brass Typhoon",
                "Pigfish"
            ],
            "source_name": "ETDA:Barium",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Barlaiy",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Destroy RAT",
                "DestroyRAT",
                "Kaba",
                "Korplug",
                "POISONPLUG",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536012,
    "ts_updated_at": 1743041777,
    "ts_creation_date": 1653759822,
    "ts_modification_date": 1653759822,
    "files": {
        "pdf": "https://archive.orkl.eu/7bf49c76b5c80a1abb9e7bf9e579f091fed706f3.pdf",
        "text": "https://archive.orkl.eu/7bf49c76b5c80a1abb9e7bf9e579f091fed706f3.txt",
        "img": "https://archive.orkl.eu/7bf49c76b5c80a1abb9e7bf9e579f091fed706f3.jpg"
    }
}