{
    "id": "a33e69b9-ce23-41e2-bf43-6090b5bb7295",
    "created_at": "2022-10-25T16:48:10.511591Z",
    "updated_at": "2025-03-27T02:16:43.01572Z",
    "deleted_at": null,
    "sha1_hash": "74962bac9526b55dfcd0c6690b2980f7483e587b",
    "title": "KingSlayer A Supply chain attack",
    "authors": "RSA",
    "file_creation_date": "2017-02-10T16:01:16Z",
    "file_modification_date": "2017-02-10T21:39:16Z",
    "file_size": 20006927,
    "plain_text": "### WHITEPAPER\n# KINGSLAYER– A SUPPLY\n CHAIN ATTACK\n\n## RSA RESEARCH\n\n\n-----\n\n#### CONTENTS\n\nContent and liability disclaimer 03\n\nExecutive summary 04\n\nSummary 04\n\nTargeted takedown of Codoso malware 05\n\nUnexpected finding 06\n\nA backdoor in product used by sysadmins 06\n\nTargeted takedown and sinkholing of www.oraclesoft[.]net 08\n\nAn irresistible enticement for Kingslayer actors 08\n\nEleven and a half weeks 09\n\nKingslayer connections to Codoso and Shell_Crew 10\n\nRecalling another software supply-chain attack 11\n\nKingslayer’s memory-resident brother, the K2 Trojan 12\n\nWhy software supply-chain attacks are here to stay 12\n\nSoftware vendors, and sysadmins on notice 13\n\nHow was the Kingslayer investigation informed? 14\n\nDetection of Kingslayer, and the next software supply chain attack 14\n\nHow to investigate if you might have been compromised by Kingslayer 18\n\nConclusion 18\n\nAcknowledgements 19\n\nAnnex 1: Kingslayer Indicators of Compromise (IOCs) 20\n\nAppendix A: Event log analyzer application service executable analysis 21\n\nAppendix B: Select forensic findings from an enterprise admin’s machine\ninfected with Kingslayer and the K2 secondary malware 29\n\n\n-----\n\n**CONTENT AND LIABILITY DISCLAIMER**\n\nThis Research Paper is for general information purposes only, and should not be used as a\nsubstitute for consultation with professional advisors. RSA Security LLC, EMC Corporation,\nDell, Inc. and their affiliates (collectively, “RSA”) have exercised reasonable care in the collecting,\nprocessing, and reporting of this information but have not independently verified, validated, or\naudited the data to verify the accuracy or completeness of the information. RSA shall not be\nresponsible for any errors or omissions contained on this Research Paper, and reserves the right\nto make changes anytime without notice. Mention of non-RSA products or services is provided\nfor informational purposes only and constitutes neither an endorsement nor a recommendation\nby RSA. All RSA and third-party information provided in this Research Paper is provided on an “as\nis” basis. RSA DISCLAIMS ALL WARRANTIES, EXPRESSED OR IMPLIED, WITH REGARD TO ANY\nINFORMATION (INCLUDING ANY SOFTWARE, PRODUCTS, OR SERVICES) PROVIDED IN THIS\nRESEARCH PAPER, INCLUDING THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. Some jurisdictions do\nnot allow the exclusion of implied warranties, so the above exclusion may not apply to you. In no\nevent shall RSA be liable for any damages whatsoever, and in particular RSA shall not be liable for\ndirect, special, indirect, consequential, or incidental damages, or damages for lost profits, loss of\nrevenue or loss of use, cost of replacement goods, loss or damage to data arising out of the use or\ninability to use any RSA website, any RSA product or service. This includes damages arising from\nuse of or in reliance on the documents or information present on this Research Paper, even if RSA\nhas been advised of the possibility of such damages.\n\n\nnot allow the exclusion of implied warranties, so the above exclusion may not apply to you. In no\nevent shall RSA be liable for any damages whatsoever, and in particular RSA shall not be liable for\ndirect, special, indirect, consequential, or incidental damages, or damages for lost profits, loss of\nrevenue or loss of use, cost of replacement goods, loss or damage to data arising out of the use or\ninability to use any RSA website, any RSA product or service. This includes damages arising from\nuse of or in reliance on the documents or information present on this Research Paper, even if RSA\nhas been advised of the possibility of such damages.\n\nCopyright © 2017 Dell Inc. or its subsidiaries. All Rights Reserved. Dell, EMC, RSA and other\ntrademarks are trademarks of Dell Inc. or its subsidiaries. Other trademarks may be the property\nof their respective owners. Published in the USA February 2017.\n\n3\n\n\n-----\n\n### EXECUTIVE SUMMARY\nRSA Research investigated the source of suspicious, observed beaconing\nthought to be associated with targeted malware. In the course of this tac­\ntical hunt for unidentified code, RSA discovered a sophisticated attack on\na software supply-chain involving a Trojan inserted in otherwise legitimate\nsoftware; software that is typically used by enterprise system administrators.\nWe are sharing details of this attack investigation, along with mitigation and\ndetection strategies, to promote awareness and preparation for future or\nongoing software supply-chain attacks.\n\n\nWe are sharing details of this attack investigation, along with mitigation and\ndetection strategies, to promote awareness and preparation for future or\nongoing software supply-chain attacks.\n\n##### SUMMARY\nIn notable aviation incidents, aviation experts are charged to perform an\ninvestigation and share the findings in incident reports. Pilot trainers, airlines\nand aircraft manufacturers dig into the investigation reports with the goal of\npreventing such an incident from happening again. These reports and their\nostensive goal, preventing an incident involving loss of life, have been the\nfoundation of what is arguably the safest form of transportation. Policies, pro­\ncedures and aircraft themselves are now safer than ever. Likewise, network\ndefenders may dig into breach reports with the aim of preventing the next loss\nof valuable business information from the networks for which they are re­\nsponsible. Helping to prevent the next loss of business or mission critical infor­\nmation from a sophisticated exploitation campaign is, at least, one of the major\ngoals of this report. You might notice we did not say prevention of compro­\nmise. After reading this report, it will be obvious that preventing the advanced\nenterprise compromise represented by Kingslayer, would be difficult for any\nnetwork defender. Preventing such types of compromises from sophisticat­\ned actors has always been challenging. The analysts behind this Kingslayer\nresearch project subscribe to the philosophy that detecting and responding to\na compromise, before it leads to business risk, is an achievable goal.\n\nIn this Kingslayer post-mortem report, RSA Research describes a sophisticat­\ned software application supply chain attack that may have otherwise gone\nunnoticed by its targets. This attack is different in that it appears to have\nspecifically targeted Windows[®] operating system administrators of large and,\nperhaps, sensitive organizations. These organizations appeared on a list of\ncustomers still displayed on the formerly subverted software vendor’s web­\nsite. Nearly two years after the Kingslayer campaign was initiated, we still do\nnot know how many of the customers listed on the website may have been\nbreached, or possibly are still compromised, by the Kingslayer perpetrators.\n\n4\n\n\n-----\n\n##### A NOTE ABOUT ATTRIBUTION\n\n_The malware and activities_\n_described in the Kingslayer_\n_post-mortem report shares code,_\n_tactics and unique malware_\n_artifacts with a large amount_\n_of other malware employed by_\n_actors in campaigns attributed to_\n_various named threat groups. RSA_\n_Research has, for years, dubbed_\n_this group of common tools and_\n_tactics Shell_Crew, since the first_\n_RSA Shell_Crew report released_\n\n\n##### TARGETED TAKEDOWN OF CODOSO MALWARE\nEarly in our investigation of, and takedown operation against, a broad exploita­\ntion campaign we call Schoolbell[1], RSA Research observed unidentified bea­\nconing to the URL www.oraclesoft[.]net[2]. We did not know what was causing\nthe beaconing, but we suspected it was malware. This URL resolved to an IP\naddress that, at the time, also resolved to another known malicious domain.\nThis additional, malicious domain, google-dash[.]com[3], was used for command\nand control (C2) by a variant of PGV_PVID malware that had no antivirus (AV)\ncoverage at the time it was submitted to VirusTotal in April 2016 (Figure 1). For\nmore information on the malware behind this broad exploitation campaign, we\nrecommend reading the Schoolbell report.\n\n\n_RSA Shell_Crew report released_ recommend reading the Schoolbell report.\n\n_in 2014._\n\n_However, shared malware_\n_development supply and_\n_infrastructure does not_\n_necessarily indicate that the_\n_espionage-focused actors behind_\n_the keyboards in this campaign,_\n_are all the same people as_\n_campaigns analyzed by other_\n_researchers. Refer to the section_\n_“Kingslayer connections to_\n_Codoso and Shell_Crew” for more_\n_details._\n\n_It’s important to note threat_\n_actors often use domains which_\n_look like popular, well known_\n_domains, even going so far to_\n_temporarily “park” them on IP_\n_addresses associated with the_\n_legitimate entities – but they_\n_have no link to the legitimate_\n_domain or company, as is the case_\n_throughout this research._\n\n_Figure 1. Zero out of fifty five antivirus solutions detected this malware at time of first submission_\n\n[1 http://blogs.rsa.com/schoolbell-class-is-in-session](http://blogs.rsa.com/schoolbell-class-is-in-session)\n\n2 It’s important to note threat actors often use domains which look like well-known domains but\nthey have no link to the legitimate domain or company\n\n3 It’s important to note threat actors often use domains which look like well-known domains but\n\n5 they have no link to the legitimate domain or company\n\n\n-----\n\n##### UNEXPECTED FINDING\nWe did not know what malware type might be using the domain www.oracle­\nsoft[.]net, but through passive analysis, we identified and contacted an infected\norganization. Following some significant monitoring efforts by the cooperat­\ning infected subject, endpoint forensic analysis, and reverse engineering, RSA\nResearch came to an unexpected conclusion. A software application used by\nsystem administrators to analyze Windows logs had been subverted at its dis­\ntribution point with malicious, signed code, back in April 2015. The remaining\nsections of this paper will discuss how that conclusion was made.\n\n\nsoft[.]net, but through passive analysis, we identified and contacted an infected\norganization. Following some significant monitoring efforts by the cooperat­\ning infected subject, endpoint forensic analysis, and reverse engineering, RSA\nResearch came to an unexpected conclusion. A software application used by\nsystem administrators to analyze Windows logs had been subverted at its dis­\ntribution point with malicious, signed code, back in April 2015. The remaining\nsections of this paper will discuss how that conclusion was made.\n\n##### A BACKDOOR IN PRODUCT USED BY SYSADMINS\nFurther research allowed RSA analysts to determine the origin of the offending\nsoftware. For the purposes of this publication, we will refer to the unnamed\nsoftware vendor as “Alpha”. Alpha owns and operates a website designed to help\nWindows system administrators interpret and troubleshoot problems indicated\nin Windows event logs. The website also offers paid subscribers a license to a\ntool that helps with analyzing Windows event logs. It is this software, and its\nupdates, that were subverted.\n\nRSA Research obtained a copy of the software suspected of containing the com­\npromise. Figure 2 gives an overview of the general infection chain and C2.\n\n_Figure 2 Kingslayer compromise infection chain_\n\n6\n\n\n-----\n\nFor purposes of MSI downloads and for auto-updating the application, Alpha\nmaintains multiple websites. During the time these particular websites were\nsubverted, any user who attempted a new install or allowed their current\nversion to auto-update (the default action) received the malicious version of\nthe software. This action occurred via an .htaccess redirect on two of Alpha’s\nwebsites (both MSI download and automated update sites) that pointed to a\nwebsite controlled by the malicious actors. This actor-controlled website host­\ned the subverted, signed versions of the application service executable, and MSI\ncontaining the Trojan. Once the install or update was complete, the software\nwould attempt to load secondary payloads.\n\nRSA Research observed the legitimate application used a valid Authenticode\nsignature issued by Alpha. At least three binaries, as well as an MSI software\ninstallation package, were determined to have been modified for malicious\npurposes using the Alpha application’s original source code, and signed with the\nstolen code signing private key. RSA Research contacted Alpha, who subse­\nquently divulged that their software packaging system was compromised and\nhad delivered this compromised binary from 09 April 2015 to 25 April 2015.\n\n\npurposes using the Alpha application’s original source code, and signed with the\nstolen code signing private key. RSA Research contacted Alpha, who subse­\nquently divulged that their software packaging system was compromised and\nhad delivered this compromised binary from 09 April 2015 to 25 April 2015.\n\nComplicating our initial attempt at dynamic analysis of the suspected backdoor\nin the RSA Research lab was the employment of an unusual diurnal beacon\nsleep algorithm.\n\nThe The backdoor was configured to only beacon to www.oraclesoft[.]net\nbetween the hours of 1500 to 0000 (3 pm to midnight) UTC; a daily window of\n9 hours. It was also configured to only beacon four days a week; on Saturday,\nTuesday, Thursday and Friday.\n\nThe exact intent behind this temporal beaconing algorithm is unclear. More\ndetails on Kingslayer’s backdoor sleep algorithm are found in the Kingslayer\nexecutable analysis in Appendix A.\n\n7\n\n\n-----\n\n##### TARGETED TAKEDOWN AND SINKHOLING OF\n WWW.ORACLESOFT[.]NET\nArmed with the evidence that www.oraclesoft[.]net was being used strictly for\nmalicious purposes, RSA Research sinkholed[4] it to further inform our Kingslayer\ninvestigation.\n\nWithin a few days of the sinkholing, RSA Research identified many of the\ninfected organizations beaconing to our sinkhole and provided compromise\nnotifications. One of the infected organizations, dubbed “Iota” for the purposes\nof this publication, subsequently engaged the RSA Incident Response (IR) team\nfor remediation assistance.\n\n\ninfected organizations beaconing to our sinkhole and provided compromise\nnotifications. One of the infected organizations, dubbed “Iota” for the purposes\nof this publication, subsequently engaged the RSA Incident Response (IR) team\nfor remediation assistance.\n\n##### AN IRRESISTIBLE ENTICEMENT FOR KINGSLAYER ACTORS\nAlthough we do not know the exact reasons the Kingslayer actors chose to\nsubvert Alpha’s software product, the list of possible end-users of the applica­\ntion likely served as a powerful motivator. As stated earlier, a free application\nlicense was offered to subscribers of Alpha’s event log information portal ser­\nvice. While we do not know how many of these subscribers took advantage of\nthe free license and installed the application during the subversion window, it is\nlogical that some did. Organizations who, at some time, subscribed to the event\nlog portal are displayed on Alpha’s website and include:\n\n                       - 4 major telecommunications providers\n\n                       - 10+ western military organizations\n\n                     - 24+ Fortune 500 companies\n\n                       - 5 major defense contractors\n\n                       - 36+ major IT product manufacturers or solutions providers\n\n                      - 24+ western government organizations\n\n                        - 24+ banks and financial institutions\n\n                        - 45+ higher educational institutions\n\n8 [4 https://en wikipedia org/wiki/DNS sinkhole](https://en.wikipedia.org/wiki/DNS_sinkhole)\n\n\n-----\n\n##### ELEVEN AND A HALF WEEKS\nBecause we have an incomplete picture of the successful Kingslayer target set,\nour timeline has some significant gaps. One important gap begging for expla­\nnation was the time between when Alpha’s websites and software distribution\nwere remediated on 26 April 2015, and the time when forensic evidence shows\nthat Kingslayer visited the Iota network on 15 July 2015 (Figure 3).\n\n\n_Figure 3 Kingslayer substantive event timeline_\n\nOne might surmise that if Iota was of particular interest to the Kingslayer\nactors, then less than eleven and a half weeks would pass before exploitation of\ntheir target network. One possible explanation is that Iota was not a preferred\ntarget at all. Rather, the eleven and a half weeks was spent by the actors exploit­\ning potentially more lucrative targets than Iota. In effect, RSA Research pro­\nposes that Iota was an inconsequential target, passed over for some sufficient\ntime for more important exploitation to be executed. This is why a supply chain\nattack is attractive to threat actors; a single compromise within the supply\nchain can yield numerous targets with minimal additional effort.\n\nAlpha issued a Security Notification on their website on 30 June 2016 and up­\ndated the notification on July 17, 2016 at RSA’s request, following findings from\nfurther investigation on Iota’s network compromised by Kingslayer.\n\n9\n\n\n-----\n\n##### KINGSLAYER CONNECTIONS TO CODOSO AND SHELL_CREW\nThe Kingslayer backdoor, discovered during an RSA Research “excavation” into\ncommon C2 infrastructure and malware bytecode, shares tactics previously ob­\nserved used by Shell_Crew, an adversary RSA Research reported on in January\n2014 [5] . The specific infrastructure overlapping with the Kingslayer campaign\nwas tied to an adversary identified as Codoso by Palo Alto [6] and ProofPoint [7] in\nthe first quarter of 2016, and the apparent operational infrastructure harvest­\ning campaign that we call Schoolbell. We do not have high confidence that the\nCodoso perpetrators are directly related to the Shell_Crew activity encoun­\ntered in 2013 and 2014, but we observed that they use common resources and\ntools. For one, Codoso and Shell_Crew use continuously evolving versions of\nmalware for which no builder or source code has been found in the wild. These\ninclude older Derusbi variants, as well as the newly pressed Rekaf, TXER, PGV_\nPVID and Bergard as described by ProofPoint, PaloAlto, and in the Schoolbell\nblog post. This indicates that they have some common, restricted source for this\ndistinctive malware. Consistent common malware bytecode, strings, and en­\ncoding routines were also noted by other researchers such as Proofpoint. These\nattributes are, thus far, unique to the activity groups and have allowed RSA\nResearch and others to track malware clusters as they appear in the wild. For\nconsistency we will attribute the activity in the Kingslayer campaign to King­\nslayer, but acknowledge some risk of erroneously conflating it with other threat\ngroups labeled variously by other researchers as Codoso, as well as historic\nactivity that RSA Research has grouped together as Shell_Crew.\n\n\nThe Kingslayer backdoor, discovered during an RSA Research “excavation” into\ncommon C2 infrastructure and malware bytecode, shares tactics previously ob­\nserved used by Shell_Crew, an adversary RSA Research reported on in January\n2014 [5] . The specific infrastructure overlapping with the Kingslayer campaign\nwas tied to an adversary identified as Codoso by Palo Alto [6] and ProofPoint [7] in\nthe first quarter of 2016, and the apparent operational infrastructure harvest­\ning campaign that we call Schoolbell. We do not have high confidence that the\nCodoso perpetrators are directly related to the Shell_Crew activity encoun­\ntered in 2013 and 2014, but we observed that they use common resources and\ntools. For one, Codoso and Shell_Crew use continuously evolving versions of\nmalware for which no builder or source code has been found in the wild. These\ninclude older Derusbi variants, as well as the newly pressed Rekaf, TXER, PGV_\nPVID and Bergard as described by ProofPoint, PaloAlto, and in the Schoolbell\nblog post. This indicates that they have some common, restricted source for this\ndistinctive malware. Consistent common malware bytecode, strings, and en­\ncoding routines were also noted by other researchers such as Proofpoint. These\nattributes are, thus far, unique to the activity groups and have allowed RSA\nResearch and others to track malware clusters as they appear in the wild. For\nconsistency we will attribute the activity in the Kingslayer campaign to King­\nslayer, but acknowledge some risk of erroneously conflating it with other threat\ngroups labeled variously by other researchers as Codoso, as well as historic\nactivity that RSA Research has grouped together as Shell_Crew.\n\nThe clearest operational links between Kingslayer and other recent campaigns\nattributed to Codoso are overlapping domains and IP addresses used for C2\nin 2015 and 2016. The Kingslayer C2 URL www.oraclesoft[.]net has temporal\noverlaps with identified infrastructure from seven other C2 domains and twelve\nunique C2 IP addresses associated with at least twenty four unique samples of\nmalware attributed to Codoso by ProofPoint and Palo Alto (Figure 4, attached\nalso in Annex), and described in the Schoolbell blogpost by RSA Research.\n\n[5 https://www.emc.com/collateral/white-papers/h12756-wp-shell-crew.pdf](https://www.emc.com/collateral/white-papers/h12756-wp-shell-crew.pdf)\n\n[6 http://researchcenter.paloaltonetworks.com/2016/01/new-attacks-linked-to-c0d0s0-group/](http://researchcenter.paloaltonetworks.com/2016/01/new-attacks-linked-to-c0d0s0-group/)\n\n10 [7 https://www.proofpoint.com/us/exploring-bergard-old-malware-new-tricks](https://www.proofpoint.com/us/exploring-bergard-old-malware-new-tricks)\n\n\n-----\n\n_Figure 4 How Kingslayer backdoor is linked to identified Codoso/Schoolbell campaign infrastructure_\n_(available for download in Annex 1)_\n\n##### RECALLING ANOTHER SOFTWARE SUPPLY-CHAIN ATTACK\nThe Kingslayer campaign shares similarities with another supply-chain attack.\nIn the Monju Incident [8] the attackers subverted an otherwise legitimate soft­\nware server by using a redirect to a different, unrelated website controlled by\nthe actors. Like Kingslayer, the target system with the already installed soft­\nware would attempt to get an update, but instead received a malicious payload\npurporting to be an update that consisted of the original application software\nbundled with a Trojan, instead of a legitimate update. In the Kingslayer attack,\nsystems attempting to get updates to an already installed Windows operating\nsystems log analysis software program were transparently redirected to a web­\nsite controlled by the Kingslayer actors, in which the illegitimate website would\ndownload a subverted update executable. What may have differed from the\nMonju incident was the fact that while all software installations that attempted\nto update during the Kingslayer campaign received a malicious but otherwise\nfunctioning update, we do not know how many of them also received the sec­\nondary malware. It is this secondary malware that has not yet been found in the\nwild.\n\n\nThe Kingslayer campaign shares similarities with another supply-chain attack.\nIn the Monju Incident [8] the attackers subverted an otherwise legitimate soft­\nware server by using a redirect to a different, unrelated website controlled by\nthe actors. Like Kingslayer, the target system with the already installed soft­\nware would attempt to get an update, but instead received a malicious payload\npurporting to be an update that consisted of the original application software\nbundled with a Trojan, instead of a legitimate update. In the Kingslayer attack,\nsystems attempting to get updates to an already installed Windows operating\nsystems log analysis software program were transparently redirected to a web­\nsite controlled by the Kingslayer actors, in which the illegitimate website would\ndownload a subverted update executable. What may have differed from the\nMonju incident was the fact that while all software installations that attempted\nto update during the Kingslayer campaign received a malicious but otherwise\nfunctioning update, we do not know how many of them also received the sec­\nondary malware. It is this secondary malware that has not yet been found in the\nwild.\n\nWe have no evidence to suggest the actors behind the Monju Incident and King­\nslayer are related, other than they used one or more of the same tactics.\n\n[8 http://www.contextis.com/documents/30/TA10009_20140127_-_CTI_Threat_Advisory_-_](http://www.contextis.com/documents/30/TA10009_20140127_-_CTI_Threat_Advisory_-_The_Monju_Incident1.p)\n\n11 [The Monju Incident1.pdf](http://www.contextis.com/documents/30/TA10009_20140127_-_CTI_Threat_Advisory_-_The_Monju_Incident1.p)\n\n\n-----\n\n##### KINGSLAYER’S MEMORY-RESIDENT BROTHER, THE K2 TROJAN\nRSA Research believes all of the particular Alpha application installations at­\ntempting to update during the 17 day Kingslayer subversion window received a\nmalicious but otherwise functioning update. We do not know how many of them\nalso received the secondary malware. Using passive analysis, RSA Research was\nable to identify the probable beaconing activity pattern used by the secondary\nmalware. Like the Kingslayer backdoor loader, the secondary malware used the\ndomain www.oraclesoft[.]net for C2. We have dubbed this secondary malware\n“Kingslayer Two” or “K2.” The beaconing pattern of K2 differed from the King­\nslayer backdoor that loaded it. K2 beacons every ten minutes without a defined\nsleep period. Based on passively observed beacon activity from three different\nK2-infected systems, we believe K2’s HTTP GET beacon pattern is a three to\nfour digit load identifier that may represent the K2 malware load sequence\nassigned to each unique infection. This number appeared to be both unique, and\nstatic for each infected system. So 3423 in Table 1 might represent the 3,423rd\nunique system loaded with the K2 Trojan.\n\n\nmalware. Like the Kingslayer backdoor loader, the secondary malware used the\ndomain www.oraclesoft[.]net for C2. We have dubbed this secondary malware\n“Kingslayer Two” or “K2.” The beaconing pattern of K2 differed from the King­\nslayer backdoor that loaded it. K2 beacons every ten minutes without a defined\nsleep period. Based on passively observed beacon activity from three different\nK2-infected systems, we believe K2’s HTTP GET beacon pattern is a three to\nfour digit load identifier that may represent the K2 malware load sequence\nassigned to each unique infection. This number appeared to be both unique, and\nstatic for each infected system. So 3423 in Table 1 might represent the 3,423rd\nunique system loaded with the K2 Trojan.\n\n_Table 1 Kingslayer secondary malware K2 with possible load identifier highlighted in yellow_\n\nGET /softs/updatecheck.html?3423&464336 HTTP/1.1\n\nUser-Agent: Mozilla/5.0 (compatible; MSIE 10.0; Windows NT 6.1; WOW64; Trident/6.0)\n\nHost: www.oraclesoft.net\n\nRSA Research also has insight into K2 Trojan’s capabilities based on the arti­\nfacts left on a system that had K2 installed. (See Appendix B) From the forensic\nartifacts, RSA Research infers that K2’s capabilities include:\n\n                       - running arbitrary Windows shell commands with SYSTEM-level privileges,\n\n                        - upload and download of files, and\n\n                       - execution of programs uploaded by the attackers.\n\n##### WHY SOFTWARE SUPPLY-CHAIN ATTACKS ARE HERE TO STAY\nSupply-chain attacks provide strategic advantages to attackers for several rea­\nsons. First, they provide one compromise vector to multiple potential targets.\nSecond, supply chain exploitation attacks, by their very nature, are stealthy and\nhave the potential to provide the attacker access to their targets for a much lon­\nger period than malware delivered by other common means, by evading tradi­\ntional network analysis and detection tools. And finally, software supply chain\nattacks offer considerable “bang for the buck” against otherwise hardened\ntargets[9] .\n\n[9 https://www.ncsc.gov.uk/content/files/protected_files/guidance_files/Cyber-security-risks-in-](https://www.ncsc.gov.uk/content/files/protected_files/guidance_files/Cyber-security-risks-in-the-sup)\n\n12 [the-supply-chain.pdf](https://www.ncsc.gov.uk/content/files/protected_files/guidance_files/Cyber-security-risks-in-the-sup)\n\n\n-----\n\nIn the case of Kingslayer, this especially rings true because the specific sys­\ntem-administrator-related systems most likely to be infected offer the ideal\nbeachhead and operational staging environment for systematic exploitation of\na large enterprise.\n\nSubverting an application used almost exclusively by enterprise Windows\nsystem administrators gives the perpetrators direct access to the most sensi­\ntive parts on an organization’s network via a workstation or server used reg­\nularly by the “king of the network.” A system administrator’s workstation and\ncache of credentials invariably provides the most access of any system on an\nenterprise network. In our experience, the credentials maintained by system\nadministrators usually enable extensive access to internal and external network\ninfrastructure of even the most sensitive organization’s enterprise. RSA Re­\nsearch observed Kingslayer installed on the workstation of the senior systems\nadministrator at one organization and on the domain controllers of another\norganization. We assess that installations of the targeted application on work­\nstations or servers with unprivileged users would be exceptions, rather than the\nrule, because the purpose of the targeted log analyzer software is to be used by\nsystem, security, and other privileged administrators.\n\n\nadministrators usually enable extensive access to internal and external network\ninfrastructure of even the most sensitive organization’s enterprise. RSA Re­\nsearch observed Kingslayer installed on the workstation of the senior systems\nadministrator at one organization and on the domain controllers of another\norganization. We assess that installations of the targeted application on work­\nstations or servers with unprivileged users would be exceptions, rather than the\nrule, because the purpose of the targeted log analyzer software is to be used by\nsystem, security, and other privileged administrators.\n\n##### SOFTWARE VENDORS, AND SYSADMINS ON NOTICE\nSubversion of an application preferentially used by enterprise system or secu­\nrity administrators provides an advanced threat group a nearly unprecedented\n“best bang for the buck.” There is no need to craft phishing emails, or sort the\nchaff from successful but unfruitful malware infections. It would not be hard to\nposit that Kingslayer might serve as a template for other attacks on otherwise\nhardened enterprise networks. This should put the developers of applications\nand software aimed for exclusive use by enterprise network administrators on\nnotice. Although the following are good tenants of all software vendors, they\nare especially important when the application in question would disproportion­\nality be used by administrators of a network. These include:\n\n                         - File integrity monitoring\n\n                         - Secure (dedicated or virtually private) hosting\n\n                        - Validated time stamping of digital signatures\n\n                        - Secure storage of and deployment of code-signing keys, ideally employing a\nHigh Security Module (HSM)\n\n                      - Comprehensive network and endpoint visibility of development environment\n\n                         - Breach disclosure policy that ensures timely incident notification to affected\ncustomers\n\n13\n\n\n-----\n\nEnterprise network administrators should take heed that they are perhaps\nthe most important and pivotal target for advanced threats interested in what\nmight be found on those enterprise networks[10] . Network admins should not\nexempt their own systems, or systems to which only they have access, from\nnetwork and endpoint visibility. Sysadmins should also contribute to and follow\na change control policy that evaluates the software vendor and the software\nitself for potential risk, prior to installing it[11] .\n\n\nmight be found on those enterprise networks[10] . Network admins should not\nexempt their own systems, or systems to which only they have access, from\nnetwork and endpoint visibility. Sysadmins should also contribute to and follow\na change control policy that evaluates the software vendor and the software\nitself for potential risk, prior to installing it[11] .\n\n##### HOW WAS THE KINGSLAYER INVESTIGATION\n INFORMED?\nThe analysis that informed the Kingslayer campaign investigation is described\nin general terms as iterative, using “many and any friendly means” employed by\na multi-disciplinary team. While characterizing the purpose, impact and extent\nof the malicious activity perpetrated by the Kingslayer campaign operators,\nRSA Research provided dozens of hours of advanced incident and analysis\nsupport to infected organizations identified by sinkholing and passive means.\nSometimes our support was in exchange for threat intelligence artifacts left\nbehind by the actors. At other times we provided advice and expertise with the\nunderstanding that the infected organization would not or could not provide\nany information in return. We collaborated with many colleagues in the secu­\nrity industry, reached out to new partners as well as called upon the extensive\ncapabilities of SecureWorks, a Dell Technologies company.\n\n##### DETECTION OF KINGSLAYER, AND THE NEXT SOFT­ WARE SUPPLY CHAIN ATTACK\nTechniques deployed by industry-wide antivirus and endpoint prevention tech­\nnologies are decidedly poorly equipped for detecting, much less preventing, a\nremote code-loading backdoor inserted into what would otherwise be a legit­\nimate software product. This is exactly what the Kingslayer actors did in their\ncampaign.\n\nIn our experience, signature or behavior-based antivirus is unable to differenti­\nate between a network-enabled feature and a backdoor in the product. In fact,\nRSA Research first identified the Kingslayer backdoor installed on an enterprise\nsystem that employed next generation antivirus. The antivirus failed to detect\nanything, even when it appeared the backdoor had downloaded and loaded the\nsecondary malware into memory, and opened connections for C2.\n\n[10 http://www.slideshare.net/harmj0y/i-hunt-sys-admins-20](http://www.slideshare.net/harmj0y/i-hunt-sys-admins-20)\n\n[11 http://csrc.nist.gov/scrm/documents/briefings/Workshop-Brief-on-Cyber-Supply-Chain-Best-](http://csrc.nist.gov/scrm/documents/briefings/Workshop-Brief-on-Cyber-Supply-Chain-Best-Practices.pd)\n\n14 [Practices.pdf](http://csrc.nist.gov/scrm/documents/briefings/Workshop-Brief-on-Cyber-Supply-Chain-Best-Practices.pd)\n\n\n-----\n\n**RSA NETWITNESS[®] ENDPOINT EDR TOOL**\nCompare this antivirus failure with RSA NetWitness[®] Endpoint, an Enterprise\nDetection and Response (EDR) tool that is available to RSA customers and\nis notably used by the RSA IR Team in their customer engagements. On a lab\nWindows system, RSA Research recreated the Kingslayer backdoor installa­\ntion, then deployed RSA NetWitness Endpoint. In Figure 5, we see that RSA\nNetWitness Endpoint identified an instance of [FLOATING_CODE], revealing\nthat the backdoored “Service.exe” process established multiple connections.\n\n[FLOATING_CODE] identifies a block of code present in a process private\nexecutable address space, as opposed to a library properly loaded from disk.\nFloating code is missing a normal DLL header. In otherwise, legitimate software\nwith a backdoor such as that employed by Kingslayer, the network connections\nwere established from that allocated block of code, which is suspicious.\n\n\n_Figure 5 RSA NetWitness Endpoint detection of the Kingslayer backdoor_\n\n15\n\n\n-----\n\nIn Figure 6, a threat hunter behind the RSA NetWitness Endpoint console dug\ninto the network details tab, to reveal the multiple connections to a suspicious\ndomain.\n\n\n_Figure 6 RSA Netwitness Endpoint details the network connections kicked off by Kingslayer’s floating code_\n\n**RSA NETWITNESS PACKETS AND LOGS**\nWhile RSA NetWitness Endpoint will flag the floating code of Kingslayer, a\nmethod to detect the network traffic of a backdoor compromise like Kingslayer\nwith network packet visibility is also important. Consider that the RSA IR team\nfound a Kingslayer-compromised organization “enjoyed” multiple weeks of stat­\nic compromise before the actor(s) arrived on scene to begin interactive lateral\nexploitation. Early detection of compromise, then, can be key to dramatically\nreducing business risk.\n\nThe Event Stream Analysis (ESA) capability in RSA NetWitness technology was\ndesigned by researchers in the RSA Data Sciences team after analyzing billions\nof packets of known C2 activity. ESA is the statistical threat hunting machine\nthat never goes to sleep, using machine learning to calculate scores on a very\nlarge number of HTTP sessions and domains. Indeed, even the unusual bea­\nconing patterns of the Kingslayer Trojan were flagged by the ESA as Suspected\nC&C (Figure7).\n\n16\n\n\n-----\n\n_Figure 7 ESA identifies Kingslayer beaconing as Suspected C&C_\n\nEven without the interactive C2 of an “operator behind the keyboard” that\nmight trigger other alerts, consider how a Security Operations Center will be\nalerted to suspicious activity, and stop the compromise before an actor starts\ncontrolling assets inside the network. For more details on how to hunt using\nRSA NetWitness capabilities such as ESA, refer to the RSA NetWitness hunting\nguide[12].\n\n[12 https://community.rsa.com/docs/DOC-62341](https://community.rsa.com/docs/DOC-62341)\n\n17\n\n\n-----\n\n##### HOW TO INVESTIGATE IF YOU MIGHT HAVE BEEN COMPROMISED BY KINGSLAYER\nAn enterprise network finding that the subverted application was installed\nprior to and/or updated during the compromise window of 09-25 April 2015,\nshould initiate an investigation. While prevention of compromise through King­\nslayer might not have been possible without the most stringent change control\npolicy and thorough software analysis and auditing, an investigation of what\nmay have been done by Kingslayer actors should be initiated. It is possible that\nthe actors have established and still maintain avenues of access, especially on\nhigh-value target networks.\n\n\nAn enterprise network finding that the subverted application was installed\nprior to and/or updated during the compromise window of 09-25 April 2015,\nshould initiate an investigation. While prevention of compromise through King­\nslayer might not have been possible without the most stringent change control\npolicy and thorough software analysis and auditing, an investigation of what\nmay have been done by Kingslayer actors should be initiated. It is possible that\nthe actors have established and still maintain avenues of access, especially on\nhigh-value target networks.\n\nHow can you tell if a system has had this subverted software installed? The\nYara signature included in the Kingslayer report annex, combined with a\nYara-capable EDR tool, such as RSA NetWitness Endpoint, will facilitate a rapid\nenterprise survey for Kingslayer artifacts. RSA Research’s Yara signature will\ndetect artifacts from the stolen code-signing key used to sign DLLs and EXEs in\nthe Kingslayer backdoor. While this code-signing key was also used to sign some\nlimited number of legitimate software versions, any hits with this signature\nwarrants investigation. Systems and Windows networks found with any of the\nIndicators of Compromise (IOCs) in the Kingslayer IOC list, should be analyzed\nfor compromise. Enterprise investigation should focus on identifying any ongo­\ning C2 channels and activity, and an assessment of business risk/loss should a\nbreach be indicated.\n\n##### CONCLUSION\nRSA Research observed sustained activity from an advanced threat actor group\nover 18+ months, tied to campaigns attributed to Codoso. There was an evo­\nlutionary deployment of tools characterized by very low (if any) coverage by\nantivirus vendors. In the course of our research and disruption of this malicious\nactivity, RSA was able to uncover an advanced strategic targeting campaign\ninvolving a software supply chain attack aimed at sysadmins of large enterpris­\nes, dubbed Kingslayer. While the entire target set of Kingslayer is unknown,\nRSA Research expects the information contained in this report to be useful\nfor network defenders in determining if they have been Kingslayer subjects of\ncompromise. This may not be the last software supply chain attack from these\nor related actors. We believe Kingslayer, with its inherent enterprise breach\nefficacy and long interlude before discovery, could serve as a template for\nfuture strategic network compromises. We illustrated that it takes keen visibil­\nity and awareness, and the right tools, to discover advanced threat activity like\nKingslayer. Finally, organizations need to have the ability to detect and respond\nto the next supply chain attack, before it has an impact on their business or\nmission.\n\n18\n\n\n-----\n\n##### ACKNOWLEDGEMENTS\nRSA Research would like to thank Chuck Helstein, Darien Huss of ProofPoint,\nLuis Garcia of luisangelgarcia.com, MS-ISAC[13] and CCIRC[14].\n\n\n[13 https://msisac.cisecurity.org](https://msisac.cisecurity.org)\n\n[14 https://www.publicsafety.gc.ca/cnt/ntnl-scrt/cbr-scrt/ccirc-ccric-eng.aspx](https://www.publicsafety.gc.ca/cnt/ntnl-scrt/cbr-scrt/ccirc-ccric-eng.aspx)\n\n19\n\n\n-----\n\n##### ANNEX 1: KINGSLAYER INDICATORS OF  COMPROMISE (IOCS)\nDownload available on rsa.com [15]\n\n\nYara Signature:\n\nrule Kingslayer_codekey\n\n{\n\nmeta:\n\nauthor = “RSA Research”\n\ndate = “03 February 2017”\n\nhash2 = “f97a2744a4964044c60ac241f92e05d7”\n\nhash3 = “76ab4a360b59fe99be1ba7b9488b5188”\n\nhash4 = “1b57396c834d2eb364d28eb0eb28d8e4”\n\nstrings:\n\n$val0 = { 31 33 31 31 30 34 31 39 33 39 31 39 5A 17 0D 31 35 31 31 30 34 31\n39 33 39 31 39 5A }\n\n$ven0 = { 41 6C 74 61 69 72 20 54 65 63 68 6E 6F 6C 6F 67 69 65 73 }\n\nuint16(0) == 0x5A4D and $val0 and $ven0\n\n}\n\n20 15\n\n\n-----\n\n##### APPENDIX A: EVENT LOG ANALYZER APPLICATION SERVICE EXECUTABLE ANALYSIS\nTable 2 shows the basic properties of the Kingslayer backdoored service execut­\nable\n\n\n_Table 2 Malware file properties_\n\nFigure 8 shows the valid Authenticode digital signature of the service execut­\nable\n\n_Figure 8 Valid Authenticode signature_\n\nThe Trojan functionality is initiated when the [Redacted]Service is started. The\n\n[Redacted]ServiceMailCheck class is instantiated as an object and the Init­\nCheck() Method is called. Figure 9 shows the code responsible for the Init­\nCheck().\n\n21\n\n\n-----\n\n_Figure 9 InitCheck() method_\n\nThe [Redacted]ServiceMailCheck class sets a mailID string to a base64 encoded\nvalue. The InitCheck() Method then calls the public Method Run in a new thread\n(Figure 10).\n\n_Figure 10 Encoded string_\n\nThe public Method Run checks the time and uses another encrypted string to\nset localization. This decryption routine, detailed later, decrypts the encrypted\nstring to “Tokyo Standard Time” and will only run on Saturday, Tuesday, Thurs­\nday and Friday, in a nine-hour window prior to midnight. The malware is hard\ncoded to sleep 20 minutes (2 different 10 minute windows) between beacons\n(Figure 11).\n\n22\n\n\n-----\n\n_Figure 11 Beacon timing and interval_\n\nThe malware will decrypt the previously set MailID variable “Ex9TAVIbX­\nghSXAAFSVBLRE8QWU8QVQ8fQQINT0FJSklLEkQeDFEfQA==”). Figure 12\ndepicts the decryption routine.\n\n_Figure 12 Decryption routine_\n\n23\n\n\n-----\n\nThe routine will initially base64 decode the MailID variable, and then hash the\ndecoded data with the MD5 hashing algorithm. It will then set a seed byte based\non the first byte of the decoded text. Each byte of the text is XOR decrypted\nagainst its respective byte in the MD5 sum, and then further XOR decrypted by\nthe seed byte. The python script (Table 3) decodes encoded variables.\n\n\n_Table 3 Python String decrypter to decode Kingslayer’s encoded variables_\n\nThis script will output the decoded C2 URL. The encoded data from this sample\nwill decode to http://www.oraclesoft[.]net/mailcheck.png (Figure 13). This URL\nmatched the traffic that was observed in the beaconing from Iota to the RSA\nsink hole.\n\n_Figure 13 Beacon matches decrypted URL_\n\n24\n\n\n-----\n\nThe LoadImage() Method creates a new thread and calls the ProcessThread()\nMethod, passing the URL and password (Figure 14).\n\n\n_Figure 14 New thread for beacon_\n\nThe ProcessThread() Method connects to the URL and builds the HTTP request\nas observed in network traffic. This function then checks to see if the gzip HTTP\nresponse header is present and decompresses the payload. It then sends the\nbyte string to an unpacking function which writes the file to disk. This activity is\nsimilar to that observed by a ProofPoint analyst in a post on Bergard and Codo­\nso. The ProofPoint analyst observed the Bergard infection to “receive instruc­\ntions from its C2 to retrieve a PNG file (Fig. 15) containing an encoded PlugX\npayload (md5: 5c36e8d5beee7fbc0377db59071b9980)[16].”\n\nWe do not know if the K2 Trojan decoded from the “mailcheck.png” image file\ndiscussed in the main body of this research paper was PlugX, or some other\nTrojan/RAT.\n\n25 [16 https://www.proofpoint.com/us/exploring-bergard-old-malware-new-tricks](https://www.proofpoint.com/us/exploring-bergard-old-malware-new-tricks)\n\n\n-----\n\n_Figure 15 Unpacking method employed to load “K2”_\n\nThe malware then checks the downloaded and unpacked data to verify the first\ntwo bytes are decimal 77 90 (0x4D5A). The malware performs these checks to\nensure the data is a valid executable binary (Figure 16).\n\n_Figure 16 K2 Trojan magic check_\n\n26\n\n\n-----\n\nCloudClimb then calls the RunByML() method which checks if the file is a valid\nexecutable and runs it, then writes the status to the console (Figure 17). Be­\ncause this software is running as a service, it is running in Windows Session 0;\ntherefore the console is hidden from the user.\n\n\n_Figure 17 Additional payload execution_\n\n27\n\n\n-----\n\nThere exists an alternate path and URL to this DLL loading functionality. In\n\n[Redacted]Service.AnalyzeLogs.Execute() email sending functionality there is\nan unencrypted URL and password (Figure 18).\n\n\n_Figure 18 Alternate URL in Kingslayer backdoor_\n\nThe registration date of the domain (Table 4) contained in this URL coincides\nwith the timeframe of the known compromise of Alpha’s source code and web­\nsites in late March, 2015.\n\n_Table 4 2015 timekard.com registration details_\n\nBeaconing to this domain has not been observed and RSA Research believes\nthis code will only execute if the application is configured to send email reports\non logs. In mid-2016 the domain registration for timekard[.]com expired and\nwas registered by a legitimate entity having nothing to do with the malicious\n\n28 activity described in this investigation\n\n\n-----\n\n##### APPENDIX B: SELECT FORENSIC FINDINGS FROM AN ENTERPRISE ADMIN’S MACHINE INFECTED WITH KINGSLAYER AND THE K2 SECONDARY MALWARE\nThe machine investigated was used by Iota’s principal Windows system admin­\nistrator, and had the backdoored event log analysis service installed on 22 April\n2015 at 19:07:18 UTC (Table 5), which was in the known subversion window of\nAlpha’s websites.\n\n\n_Table 5 Event log analysis application service installation_\n\nThe SYSTEM hive contains the Application Compatibility Cache entries. These\nentries track executable files for compatibility purposes between Windows\nupgrades. Several suspicious entries (Table 6) were discovered during the host\ntriage. It is important to note that the timestamps on these entries are the $SI\nMTIME of the file and are not reliable indicators.\n\n_Table 6 Suspicious ShimCache entries_\n\n29\n\n\n-----\n\n##### ANALYSIS OF BP.EXE\nIn this same directory an executable was discovered that will find, decrypt and\ndisplay passwords saved in Chrome and Firefox (Table 7). This file had an $FN\nCTIME of 17 August 2015 12:26:20.292 and did not appear to be executed as it\nwas not in the shimcache. The file was owned by the Windows security identi­\nfier (SID) S-1-5-32-544, the SYSTEM account. This matches with the owner of\nthe running backdoored event log analysis service, which also runs as SYSTEM.\n\n\ndisplay passwords saved in Chrome and Firefox (Table 7). This file had an $FN\nCTIME of 17 August 2015 12:26:20.292 and did not appear to be executed as it\nwas not in the shimcache. The file was owned by the Windows security identi­\nfier (SID) S-1-5-32-544, the SYSTEM account. This matches with the owner of\nthe running backdoored event log analysis service, which also runs as SYSTEM.\n\n_Table 7 Password dumper_\n\nThe password dumper starts by gathering system information about the cur­\nrent logged-on user in order to discover the individual user paths such as C:\\\nUsers\\Usera\\AppData. It then begins reading the SQLlite database files and\ndecrypting saved passwords.\n\n_Figure 19 SQLite database file path_\n\nThe sample has the SQLite libraries statically linked at compile time, which ac­\ncounts for the large size. It then leverages these functions to query the SQLite\ndatabase to retrieve the encrypted stored passwords.\n\n30\n\n\n-----\n\n_Figure 20 Selecting encrypted passwords_\n\nSub_401BA9 leads to a series of calls to get the logged on user, impersonate\nthat user in order to open the Windows key store to retrieve the encryption\nkeys and, finally, decrypts the user’s stored passwords.\n\n_Figure 21 Stored password decryption_\n\nIf the sample was successful, it will print the decrypted URL, Username and\nPassword to the terminal.\n\n31\n\n\n-----\n\n_Figure 22 Terminal output of password dumper_\n\nAfter the sample has finished with Chrome passwords it moves on in a similar\nfashion to stored Firefox passwords and prints them to the terminal.\n\n_Figure 23 Firefox output_\n\n32\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/u4dkqqj56anyzuhxvg890k7d3g0oybyu",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2017/2017.02.03.kingslayer-a-supply-chain-attack/kingslayer-a-supply-chain-attack.pdf"
    ],
    "report_names": [
        "kingslayer-a-supply-chain-attack(02-03-2017)",
        "kingslayer-a-supply-chain-attack"
    ],
    "threat_actors": [
        {
            "id": "1f3cf3d1-4764-4158-a216-dd6352e671bb",
            "created_at": "2022-10-25T15:50:23.837615Z",
            "updated_at": "2025-03-27T02:00:55.556414Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "APT19",
                "Codoso",
                "C0d0so0",
                "Codoso Team",
                "Sunshop Group"
            ],
            "source_name": "MITRE:APT19",
            "tools": [
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "7a9a7873-8e41-40ae-9d06-b27c92bb54e4",
            "created_at": "2022-10-25T16:47:55.568362Z",
            "updated_at": "2025-03-27T02:05:17.264615Z",
            "deleted_at": null,
            "main_name": "BRONZE FIRESTONE",
            "aliases": [
                "C0d0s0",
                "Deep Panda ",
                "Pupa ",
                "TG-3551 ",
                "APT19 "
            ],
            "source_name": "Secureworks:BRONZE FIRESTONE",
            "tools": [
                " Alice's Rabbit Hole",
                " Briba",
                " Cobalt Strike",
                " Derusbi",
                " PlugX",
                " PoisonIvy",
                " Powershell Empire",
                " Zuguo",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fad11c6-4336-4b28-a606-f510eca5452e",
            "created_at": "2022-10-25T16:07:24.346573Z",
            "updated_at": "2025-03-27T02:02:10.183211Z",
            "deleted_at": null,
            "main_name": "Turbine Panda",
            "aliases": [
                "APT 26",
                "Black Vine",
                "Bronze Express",
                "Group 13",
                "JerseyMikes",
                "KungFu Kittens",
                "PinkPanther",
                "Shell Crew",
                "Turbine Panda",
                "WebMasters"
            ],
            "source_name": "ETDA:Turbine Panda",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "FF-RAT",
                "FormerFirstRAT",
                "Hurix",
                "Kaba",
                "Korplug",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mivast",
                "PlugX",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "Sogu",
                "StreamEx",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "cobeacon",
                "ffrat"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "64ca1755-3883-4173-8e0a-6e5cf92faafd",
            "created_at": "2022-10-25T15:50:23.636456Z",
            "updated_at": "2025-03-27T02:00:55.51077Z",
            "deleted_at": null,
            "main_name": "Deep Panda",
            "aliases": [
                "Deep Panda",
                "Shell Crew",
                "KungFu Kittens",
                "PinkPanther",
                "Black Vine"
            ],
            "source_name": "MITRE:Deep Panda",
            "tools": [
                "Mivast",
                "StreamEx",
                "Sakula",
                "Tasklist",
                "Derusbi"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46a151bd-e4c2-46f9-aee9-ee6942b01098",
            "created_at": "2023-01-06T13:46:38.288168Z",
            "updated_at": "2025-03-27T02:00:02.794118Z",
            "deleted_at": null,
            "main_name": "APT19",
            "aliases": [
                "Black Vine",
                "TEMP.Avengers",
                "PinkPanther",
                "G0073",
                "KungFu Kittens",
                "Group 13",
                "Shell Crew",
                "BRONZE FIRESTONE",
                "G0009",
                "Sunshop Group",
                "DEEP PANDA",
                "Codoso"
            ],
            "source_name": "MISPGALAXY:APT19",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "0639667a-fb3f-43d9-a38c-6c123fd19c7f",
            "created_at": "2022-10-25T16:07:23.335869Z",
            "updated_at": "2025-03-27T02:02:09.743237Z",
            "deleted_at": null,
            "main_name": "APT 19",
            "aliases": [
                "APT 19",
                "Bronze Firestone",
                "C0d0so0",
                "Codoso",
                "Deep Panda",
                "Operation Kingslayer",
                "Red Pegasus",
                "Sunshop Group",
                "TG-3551"
            ],
            "source_name": "ETDA:APT 19",
            "tools": [
                "Agentemis",
                "C0d0so0",
                "Cobalt Strike",
                "CobaltStrike",
                "Derusbi",
                "EmPyre",
                "EmpireProject",
                "Fire Chili",
                "PowerShell Empire",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716490,
    "ts_updated_at": 1743041803,
    "ts_creation_date": 1486742476,
    "ts_modification_date": 1486762756,
    "files": {
        "pdf": "https://archive.orkl.eu/74962bac9526b55dfcd0c6690b2980f7483e587b.pdf",
        "text": "https://archive.orkl.eu/74962bac9526b55dfcd0c6690b2980f7483e587b.txt",
        "img": "https://archive.orkl.eu/74962bac9526b55dfcd0c6690b2980f7483e587b.jpg"
    }
}