{
    "id": "a366e35a-d0a8-47b3-8b97-dd2f79fe5e47",
    "created_at": "2023-01-12T15:05:46.763904Z",
    "updated_at": "2025-03-27T02:17:11.450903Z",
    "deleted_at": null,
    "sha1_hash": "33bdcb968cdab16994137cdc4976daf901ce90fd",
    "title": "2016-10-17 - ‘DealersChoice’ is Sofacy’s Flash Player Exploit Platform",
    "authors": "",
    "file_creation_date": "2019-09-11T13:07:17Z",
    "file_modification_date": "2019-09-11T13:07:20Z",
    "file_size": 1640812,
    "plain_text": "# LANDSCAPE \n\n\n# ATTACK  H1 2019\n\n\n-----\n\n## INTRODUCTION\n\nFrom millions to billions. In the first half of 2019, our global network of honeypots measured more\nthan triple the attack traffic of the previous period, to a total of over 2.9 billion events. It’s the first\ntime since we’ve begun publishing data from our honeypot network that traffic has ever hit the\nbillion mark.\n\nOur honeypots are decoy servers that we’ve set up in countries around the world to gauge trends and\npatterns in what’s going on in the global cyber attack landscape. We’ve configured them to look like\nactual servers, inviting the type of traffic that hits actual servers. Honeypots are highly effective tools\nfor collecting information on the methods and target selection processes used by modern attackers.\nThey can also be a good source of malware samples and shell scripts.\n\nTotal Global Honeypot Attacks Per Period\n\n\nH1 2019\n\nH2 2018\n\nH1 2018\n\nH2 2017\n\nH1 2017\n\n\n2.9B\n\n\n813M\n\n\n231M\n\n\n546M\n\n\n246M\n\n\nBecause honeypots are decoys not otherwise meant for real world use, an incoming connection\nregistered by a honeypot is either the result of a mistake (someone typing in a wrong IP address,\nwhich is rather uncommon) or of the service being found during an attacker’s scans of the network\nor the internet.\n\nWe are always improving and upgrading our honeypot network, and doing so can contribute\nto increased traffic measurements. Since our last report from H2 2018[1] we’ve added a few new\nhoneypots. We’ve also made some improvements to our Telnet and SMB plugins, which results in\nbetter recognition of those events. There’s no doubt that these improvements have contributed\nto higher numbers of events, but there’s also no doubt, given the continuing spread in infected IoT\ndevices,[2] the prevalence of Eternal Blue, and increasing numbers of DDoS attacks,[3] that attack traffic is\nalso simply on the increase.\n\n99.9% of traffic to our honeypots is automated traffic coming from bots, malware and other tools.\nAttacks may come from any sort of connected computing device – a traditional computer, malwareinfected smartwatch or IoT toothbrush can be a source.\n\n\n1. https://blog.f-secure.com/attack-landscape-h2-2018/\n2. https://www.openaccessgovernment.org/iot-malware-attacks/69870/\n3. https://www.comparitech.com/blog/information-security/ddos-statistics-facts/\n\n\n2\n\n\n-----\n\n## WHO’S AFTER WHO\n\nWhere in the world are these attacks taking place? Populating the top ten list of attack source\ncountries for H1 2019 are, as usual, the US, Russia, Germany and China. However, this is the first time\nthat traffic volumes from the Chinese IP space has overshadowed other countries to take top spot.\nTraffic from China ballooned to 702 million attacks. (A breakdown of the types of traffic from the top\nthree countries can be found later in this document.)\n\n\nTop Source Countries\n\nH1 2019 H2 2018\n\nAlso, for the first time, the United Kingdom just missed this list, coming in at number 11. India is a new\nentrant to the top ten, lighting up with 44 million attacks, which makes sense given it’s also taken the\n[distinction of being a top botnet-infected country,[4] according to Spamhaus. Philippines, Brazil and](https://www.spamhaus.org/statistics/botnet-cc/)\nArmenia are also newcomers.\n\n\nAs we always point out, the list of source countries must be taken with a grain of salt. Attackers can\nroute their attacks through proxies in countries other than where they themselves are located to\navoid identification by law enforcement. In addition, we do not mean to imply that this activity is\npredominantly nation state behavior. The majority of these attacks are instigated by cyber criminals\nwho are carrying out DDoS attacks and sending malware for financial gain.\n\nAs usual the US heads the list of top attack destinations. And while the rest of the countries on this\nlist commonly appear here, just in varying order, Nigeria is new as a top attack destination. Ukraine is\nprominent on both source and destination lists, not a surprise given its status as a cyber battlefield[5]\nand a target of Russian hackers.\n\n\n4. https://www.spamhaus.org/statistics/botnet-cc/\n5. https://www.politico.eu/article/ukraine-cyber-war-frontline-russia-malware-attacks/\n\n\n3\n\n\n-----\n\nTop Destination Countries\n\nH1 2019 H2 2018\n\nOur who’s-after-who list shows which countries’ IP spaces have the most common aggressor-totarget relationships.\n\n\nTop Sources to Destinations\n\n\nUnited States → United States\n\n\n100M\n\n91M\n\n80M\n\n59M\n\n56M\n\n54M\n\n49M\n\n40M\n\n39M\n\n38M\n\n36M\n\n35M\n\n31M\n\n30M\n\n29M\n\n\nChina → Austria\n\n\nUnited States → Ukraine\n\nChina → United Kingdom\n\nUnited States → Nigeria\n\nRussia → United States\n\n\nChina → Netherlands\n\nRussia → Austria\n\n\nUkraine → Ukraine\n\n\nRussia → Italy\n\nChina → Italy\n\nUnited States → Poland\n\nUnited States → Canada\n\n\nChina → Bulgaria\n\nChina → United States\n\n\n4\n\n\n-----\n\n## PORTS AND PROTOCOLS\n\nOf the 2.9 billion hits, 2.1 billion were on TCP ports. Telnet, which is rarely used anymore outside the\nrealm of IoT devices, saw the greatest volumes during the period. Due to the continuing spread of\ninfected IoT devices perpetrated by malware such as Mirai, Telnet continues the run it began in the\nlast half of 2018. The greatest share of Telnet traffic came from the US IP space, followed by Germany,\nUK and the Netherlands.\n\nTraffic to port 445 was the next most prevalent, representing SMB worms and exploits such as Eternal\nBlue. Since its debut during WannaCry over two years ago, Eternal Blue continues to be used by\ncriminals, and it’s currently at the height of its popularity.[6] Data from our malware labs backs this up,\nas WannaCry is currently one of the most prevalent forms of malware in our telemetry. China was the\nbiggest source of SMB traffic, followed by the Philippines and Russia.\n\nAttacks on SSH port 22 came in third, representing brute force password attempts to gain remote\naccess to a machine, but also IoT malware, which uses SSH as well. Russia was by far the biggest\naggressor when it comes to SSH traffic.\n\nTraffic to SQL-related ports represent database attacks such as are common in data breaches. But\nmore recently in a new trend, attacks are also targeting the server with cryptomining bots[7] or even\nransomware.[8] China was by far the most active country targeting these ports.\n\nTop TCP Ports Targeted\n\n23 - Telnet 760M\n\n\n445 - SMB\n\n22 - SSH\n\n1433 - MSSQL\n\n3306 - MySQL\n\n80 - HTTP\n\n7547 - CWMP\n\n25 - SMTP\n\n20 - FTP\n\n5431 – park-agent\n\n\n556M\n\n\n456M\n\n\n260M\n\n\n7,4M\n\n3,8M\n\n2,3M\n\n1,7M\n\n,6M\n\n,6M\n\n\n6. https://www.welivesecurity.com/2019/05/17/eternalblue-new-heights-wannacryptor/\n7. https://news.sophos.com/en-us/2019/04/30/a-taste-of-the-onslaught-at-the-networks-edge/\n8. https://www.zdnet.com/article/hackers-are-scanning-for-mysql-servers-to-deploy-gandcrab-ransomware/\n\n\n5\n\n\n-----\n\nApart from TCP traffic, the majority of the remaining traffic was to UPD port 1900, with 611 million hits.\n1900 is commonly used for scanning to determine if the target is running UPnP, or plug-and-play\ndevices, which are used for exploitation or in DDoS attacks. (TCP port 5431 is one of the UPnP service\nports.) The heaviest traffic on 1900 came from the IP spaces of China, the US, Australia and Brazil.\n\nTop 5 UDP Ports Targeted\n\n1900 - SSDP, UPnP 611M\n\n\n5355 - LLMNR\n\n137 - NetBIOS\n\n17500 - Dropbox LanSync\n\n32414 - Plex Media Server\n\n\n42M\n\n26M\n\n15M\n\n12M\n\n\nAttack volumes throughout the period\n\n60M\n\n40M\n\n20M\n\n0\n\n01 - 01 02 - 01 03 - 01 04 - 01 05 - 01 06 - 01\n\nThe graph above shows all activity on all ports throughout the period. The peaks on May 7 and May\n29 are due to strong campaigns targeting UDP 1900. The May 7 campaign, which came from the\nAustralian IP space, hit several countries hard, most prominently Austria, Italy and Ukraine, but also the\nUnited Kingdom, Germany, France and India. The May 29 campaign came from the Chinese IP space\nand hit Austria, the UK, US and Ukraine most prominently.\n\nBreaking down the most common ports targeted by the top three attack source countries, it’s\napparent that attackers in all three countries’ IP spaces actively targeted the IoT. On the TCP side,\nattackers using the US and Russian IP spaces heavily targeted ports 22 (SSH) and 23 (Telnet). On UDP,\nattacks from the Chinese IP space directed at port 1900 were likely attempts to attack a vulnerability\ncommon on D-Link routers.\n\n6\n\n\n-----\n\nPorts most commonly targeted by top 3 attack source countries\n\nCHINA\n\nTCP Port UPD Port\n\n\n1433\n\n445\n\n23\n\n22\n\n3306\n\n80\n\n3389\n\n8080\n\nUS\n\n\n207M 1900\n\n5678\n\n137\n\n5060\n\n53\n\n111\n\n1071\n\n123\n\n\nTCP Port UPD Port\n\n\n23\n\n445\n\n22\n\n1433\n\n3306\n\n25\n\n80\n\n20\n\nRUSSIA\n\n\n325M 1900\n\n123\n\n53413\n\n53\n\n69\n\n5060\n\n161\n\n137\n\n\nTCP Port UPD Port\n\n\n22\n\n445\n\n23\n\n1433\n\n80\n\n139\n\n3306\n\n3389\n\n\n304M 1900\n\n11211\n\n5060\n\n137\n\n123\n\n53\n\n161\n\n19\n\n\n7\n\n\n-----\n\n## MALWARE\n\nMalware found in the honeypots is dominated by various versions of Mirai, which is still going strong\nthree years after it first burst onto the scene in 2016. Mirai targets IoT devices such as IP cameras and\nrouters, infects those using default credentials, and co-opts them into botnet armies.\n\nIn a new trend that should concern every business, Mirai has recently spawned variants that are\nspecifically engineered to infect enterprise IoT[9] devices such as wireless presentation systems\nand digital signage TVs. The expansion to enterprise allows attackers access to greater bandwidth\nconnections than are available with consumer devices, affording them greater power\nfor DDoS attacks.\n\nVisualization of the top malware variants found in honeypots\n\nTurning away from honeypots to the actual customer endpoints we protect, the main types of\nmalware we see are still ransomware, banking trojans, and cryptominers.\n\nWe’ve seen some evolving trends in the malware sphere in the first half of the year. First, while\nZIP, PDF, DOC and XLS files are the most commonly used attachment type for spreading malware,\n[we’ve noted[10] an increasingly popular trend of attackers employing disc image files (ISO and IMG).](https://labsblog.f-secure.com/2019/05/08/spam-trends-top-attachments-and-campaigns/)\nCampaigns using this technique delivered the AgentTesla infostealer and the NanoCore RAT.\n\n9. https://www.scmagazine.com/home/security-news/cybercrime/the-infamous-mirai-malware-has-grown-into-morethan-60-known-variants-and-has-since-set-its-sights-on-enterprise-devices/\n10. https://labsblog.f-secure.com/2019/05/08/spam-trends-top-attachments-and-campaigns/\n\n\n8\n\n\n-----\n\nWe’ve also observed a trend of financially motivated attackers abusing the trust users put in the digital\ncertificate system by purchasing certificates to sign their executable files.[11] Traditionally this sort of\ntactic has been limited to the toolbelt of nation states and other highly advanced attackers. It’s just\nanother example of the trickle down in TTPs from the elites down to the common criminals.\n\nWith lower prices of Bitcoin and the shutdown of CoinHive in March, cryptomining appeared to be\non the way out. But recent increases in Bitcoin and other currencies following suit seem to have\nprompted a revival in cryptomining. Security researchers are seeing cases of Eternal Blue being used\nto escort in XMRig, a Monero miner, as well as mining infections in Android devices in Asia, among\nother clues.\n\nAfter an apparent lull in 2018, ransomware is back and has been busy disrupting companies, public\nentities and other organizations over the past several months. Some of the most notable attacks\ninvolved aluminum producer Norsk Hydro,[12] who lost over $35 million in the first week after being hit\nby LockerGaga in March, and global forensic testing provider Eurofins Scientific, whose compromise\nin June affected police work.[13]\n\nThe chart below shows the variety of methods by which threat actors distributed ransomware during\nthe period. The infection vector used by the greatest share of ransomware families was RDP at 31%,\nunderscoring the trend of cyber criminals putting more energy into infecting companies. Email spam\n[was second with 31%; an example is the February and March spam campaigns we noticed[14] which used](https://labsblog.f-secure.com/2019/05/08/spam-trends-top-attachments-and-campaigns/)\nZIP files passed off as photos to deliver GranCrab ransomware.\n\nRansomware distribution methods (January-May 2019)\n\n11%\n\nP2P\n\n9% 12%\n\nExploit kits/ Malvertising\n\nSoftware crack/ Fake installers/\nBundled apps 3%\n\nVulnerable/Compromised\n\n11%\n\nFirmware/Middleware\n\nEmail/Spam\n\nBrute force/RDP\n\n23%\n\n31%\n\nUnconfirmed\n\n\n11. https://www.bleepingcomputer.com/news/security/volume-of-signed-malware-increases-cas-need-better-vetting/\n12. https://www.securityweek.com/ransomware-attack-costs-norsk-hydro-tens-millions-dollars\n13. https://www.helpnetsecurity.com/2019/06/24/eurofins-ransomware-attack/\n14. https://labsblog.f-secure.com/2019/05/08/spam-trends-top-attachments-and-campaigns/\n\n\n9\n\n\n-----\n\n## CONCLUSION\n\nEvery half year it’s a different story. This time, it’s the jump to billions of honeypot attacks, the\nrampant exploitation of IoT devices via Telnet and UPnP, China’s domination of traffic, a comeback\nin ransomware and a rally of cryptominers. The attacks may change, the methods may change and\nthe vulnerabilities may change, but what doesn’t change is that following solid security practices and\nprocedures will keep your business on much safer ground.\n\n   - Map your attack surface. Know what devices and servers you have and why they’re needed.\nRetire old assets that aren’t necessary.\n\n   - Know what you need to protect most, and guard it. Keep your most critical assets protected\nwith a higher level of security.\n\n   - Keep your systems and applications updated with current software and security patches.\n\n   - Be skeptical of unsolicited, unexpected emails and especially of links or attachments in them.\n\n   - Enforce a password policy of changing default passwords to unique, long and strong\npasswords, and of never reusing passwords. Encourage employees to use password managers.\n\n   - Monitor your network with detection and response technology to catch malicious actors\nalready in the network.\n\n10\n\n\n-----\n\n## ABOUT F-SECURE\n\n### Nobody has better visibility into real-life cyber attacks than F-Secure. We’re closing the gap between detection and response, utilizing the unmatched threat intelligence of hundreds of our industry’s best technical consultants, millions of devices running our award-winning software, and ceaseless innovations in artificial intelligence. Top banks, airlines, and enterprises trust our commitment to beating the world’s most potent threats.\n\n Together with our network of the top channel partners and over 200 service providers, we’re on a mission to make sure everyone has the enterprise-grade cyber security we all need. Founded in 1988, F-Secure is listed on the NASDAQ OMX Helsinki Ltd.\n\n**f-secure.com  |  twitter.com/fsecure  |  linkedin.com/ f-secure**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/F-Secure - Attack Landscape - 2019-1H.pdf"
    ],
    "report_names": [
        "F-Secure - Attack Landscape - 2019-1H.pdf"
    ],
    "threat_actors": [
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535946,
    "ts_updated_at": 1743041831,
    "ts_creation_date": 1568207237,
    "ts_modification_date": 1568207240,
    "files": {
        "pdf": "https://archive.orkl.eu/33bdcb968cdab16994137cdc4976daf901ce90fd.pdf",
        "text": "https://archive.orkl.eu/33bdcb968cdab16994137cdc4976daf901ce90fd.txt",
        "img": "https://archive.orkl.eu/33bdcb968cdab16994137cdc4976daf901ce90fd.jpg"
    }
}