{
    "id": "a39c5fae-dbfb-4fc8-8af5-1b36053413ac",
    "created_at": "2023-01-12T15:08:10.519405Z",
    "updated_at": "2025-03-27T02:17:00.812658Z",
    "deleted_at": null,
    "sha1_hash": "eca74fa705027582f22b739a675d2c736943fcae",
    "title": "2022-01-15 - Destructive malware targeting Ukrainian organizations (DEV-0586)",
    "authors": "",
    "file_creation_date": "2022-05-28T16:03:55Z",
    "file_modification_date": "2022-05-28T16:03:55Z",
    "file_size": 950033,
    "plain_text": "# Destructive malware targeting Ukrainian organizations\n\n**[microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/](https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/)**\n\nJanuary 16, 2022\n\nMicrosoft Threat Intelligence Center (MSTIC) has identified evidence of a destructive malware operation\ntargeting multiple organizations in Ukraine. This malware first appeared on victim systems in Ukraine on\n[January 13, 2022. Microsoft is aware of the ongoing geopolitical events in Ukraine and surrounding](https://blogs.microsoft.com/on-the-issues/2022/01/15/mstic-malware-cyberattacks-ukraine-government/)\nregion and encourages organizations to use the information in this post to proactively protect from any\nmalicious activity.\n\nWhile our investigation is continuing, MSTIC has not found any notable associations between this\nobserved activity, tracked as DEV-0586, and other known activity groups. MSTIC assesses that the\nmalware, which is designed to look like ransomware but lacking a ransom recovery mechanism, is\nintended to be destructive and designed to render targeted devices inoperable rather than to obtain a\nransom.\n\nAt present and based on Microsoft visibility, our investigation teams have identified the malware on\ndozens of impacted systems and that number could grow as our investigation continues. These systems\nspan multiple government, non-profit, and information technology organizations, all based in Ukraine. We\ndo not know the current stage of this attacker’s operational cycle or how many other victim organizations\nmay exist in Ukraine or other geographic locations. However, it is unlikely these impacted systems\nrepresent the full scope of impact as other organizations are reporting.\n\n\n-----\n\nGiven the scale of the observed intrusions, MSTIC is not able to assess intent of the identified\ndestructive actions but does believe these actions represent an elevated risk to any government agency,\nnon-profit or enterprise located or with systems in Ukraine. We strongly encourage all organizations to\nimmediately conduct a thorough investigation and to implement defenses using the information provided\nin this post. MSTIC will update this blog as we have additional information to share.\n\nAs with any observed nation-state actor activity, Microsoft directly and proactively notifies customers that\nhave been targeted or compromised, providing them with the information they need to guide their\ninvestigations. MSTIC is also actively working with members of the global security community and other\nstrategic partners to share information that can address this evolving threat through multiple channels.\nMicrosoft uses DEV-#### designations as a temporary name given to an unknown, emerging, or a\ndeveloping cluster of threat activity, allowing MSTIC to track it as a unique set of information until we\nreach a high confidence about the origin or identity of the actor behind the activity. Once it meets the\ncriteria, a DEV is converted to a named actor or merged with existing actors.\n\n## Observed actor activity\n\nOn January 13, Microsoft identified intrusion activity originating from Ukraine that appeared to be\npossible Master Boot Records (MBR) Wiper activity. During our investigation, we found a unique\nmalware capability being used in intrusion attacks against multiple victim organizations in Ukraine.\n\n### Stage 1: Overwrite Master Boot Record to display a faked ransom note\n\nThe malware resides in various working directories, including C:\\PerfLogs, C:\\ProgramData, C:\\, and\n_C:\\temp, and is often named stage1.exe. In the observed intrusions, the malware executes via Impacket,_\na publicly available capability often used by threat actors for lateral movement and execution.\n\nThe two-stage malware overwrites the Master Boot Record (MBR) on victim systems with a ransom note\n(Stage 1). The MBR is the part of a hard drive that tells the computer how to load its operating system.\nThe ransom note contains a Bitcoin wallet and Tox ID (a unique account identifier used in the Tox\nencrypted messaging protocol) that have not been previously observed by MSTIC:\n```\nYour hard drive has been corrupted.\nIn case you want to recover all hard drives\nof your organization,\nYou should pay us $10k via bitcoin wallet\n1AVNM68gj6PGPFcJuftKATa4WLnzg8fpfv and send message via\ntox ID 8BEDC411012A33BA34F49130D0F186993C6A32DAD8976F6A5D82C1ED23054C057ECED5496F65\nwith your organization name.\nWe will contact you to give further instructions.\n\n```\nThe malware executes when the associated device is powered down. Overwriting the MBR is atypical for\ncybercriminal ransomware. In reality, the ransomware note is a ruse and that the malware destructs MBR\nand the contents of the files it targets. There are several reasons why this activity is inconsistent with\ncybercriminal ransomware activity observed by MSTIC, including:\n\nRansomware payloads are typically customized per victim. In this case, the same ransom payload\nwas observed at multiple victims.\nVirtually all ransomware encrypts the contents of files on the filesystem. The malware in this case\noverwrites the MBR with no mechanism for recovery.\n\n\n-----\n\nExplicit payment amounts and cryptocurrency wallet addresses are rarely specified in modern\ncriminal ransom notes, but were specified by DEV-0586. The same Bitcoin wallet address has been\nobserved across all DEV-0586 intrusions and at the time of analysis, the only activity was a small\ntransfer on January 14.\nIt is rare for the communication method to be only a Tox ID, an identifier for use with the Tox\nencrypted messaging protocol. Typically, there are websites with support forums or multiple\nmethods of contact (including email) to make it easy for the victim to successfully make contact.\nMost criminal ransom notes include a custom ID that a victim is instructed to send in their\ncommunications to the attackers. This is an important part of the process where the custom ID\nmaps on the backend of the ransomware operation to a victim-specific decryption key. The ransom\nnote in this case does not include a custom ID.\n\nMicrosoft will continue to monitor DEV-0586 activity and implement protections for our customers. The\ncurrent detections, advanced detections, and IOCs in place across our security products are detailed\nbelow.\n\n### Stage 2: File corrupter malware\n\n_Stage2.exe is a downloader for a malicious file corrupter malware. Upon execution, stage2.exe_\ndownloads the next-stage malware hosted on a Discord channel, with the download link hardcoded in the\ndownloader. The next-stage malware can best be described as a malicious file corrupter. Once executed\nin memory, the corrupter locates files in certain directories on the system with one of the following\nhardcoded file extensions:\n```\n.3DM .3DS .7Z .ACCDB .AI .ARC .ASC .ASM .ASP .ASPX .BACKUP .BAK .BAT .BMP .BRD .BZ .BZ2 .CGM\n.CLASS .CMD .CONFIG .CPP .CRT .CS .CSR .CSV .DB .DBF .DCH .DER .DIF .DIP .DJVU.SH .DOC .DOCB\n.DOCM .DOCX .DOT .DOTM .DOTX .DWG .EDB .EML .FRM .GIF .GO .GZ .HDD .HTM .HTML .HWP .IBD .INC\n.INI .ISO .JAR .JAVA .JPEG .JPG .JS .JSP .KDBX .KEY .LAY .LAY6 .LDF .LOG .MAX .MDB .MDF .MML\n.MSG .MYD .MYI .NEF .NVRAM .ODB .ODG .ODP .ODS .ODT .OGG .ONETOC2 .OST .OTG .OTP .OTS .OTT .P12\n.PAQ .PAS .PDF .PEM .PFX .PHP .PHP3 .PHP4 .PHP5 .PHP6 .PHP7 .PHPS .PHTML .PL .PNG .POT .POTM\n.POTX .PPAM .PPK .PPS .PPSM .PPSX .PPT .PPTM .PPTX .PS1 .PSD .PST .PY .RAR .RAW .RB .RTF .SAV\n.SCH .SHTML .SLDM .SLDX .SLK .SLN .SNT .SQ3 .SQL .SQLITE3 .SQLITEDB .STC .STD .STI .STW .SUO\n.SVG .SXC .SXD .SXI .SXM .SXW .TAR .TBK .TGZ .TIF .TIFF .TXT .UOP .UOT .VB .VBS .VCD .VDI .VHD\n.VMDK .VMEM .VMSD .VMSN .VMSS .VMTM .VMTX .VMX .VMXF .VSD .VSDX .VSWP .WAR .WB2 .WK1 .WKS .XHTML\n.XLC .XLM .XLS .XLSB .XLSM .XLSX .XLT .XLTM .XLTX .XLW .YML .ZIP\n\n```\nIf a file carries one of the extensions above, the corrupter overwrites the contents of the file with a fixed\nnumber of 0xCC bytes (total file size of 1MB). After overwriting the contents, the destructor renames\neach file with a seemingly random four-byte extension. Analysis of this malware is ongoing.\n\n## Recommended customer actions\n\nMSTIC and the Microsoft security teams are working to create and implement detections for this activity.\nTo date, Microsoft has implemented protections to detect this malware family as WhisperGate (e.g.,\nDoS:Win32/WhisperGate.A!dha) via Microsoft Defender Antivirus and Microsoft Defender for Endpoint,\nwherever these are deployed on-premises and cloud environments. We are continuing the investigation\nand will share significant updates with affected customers, as well as public and private sector partners,\nas get more information. The techniques used by the actor and described in the this post can be\nmitigated by adopting the security considerations provided below:\n\nUse the included indicators of compromise to investigate whether they exist in your environment\nand assess for potential intrusion.\n\n\n-----\n\nReview all authentication activity for remote access infrastructure, with a particular focus on\naccounts configured with single factor authentication, to confirm authenticity and investigate any\nanomalous activity.\nEnable multifactor authentication (MFA) to mitigate potentially compromised credentials and ensure\nthat MFA is enforced for all remote connectivity. NOTE: Microsoft strongly encourages all\n[customers download and use password-less solutions like Microsoft Authenticator to secure](https://www.microsoft.com/account/authenticator/)\naccounts.\n[Enable Controlled folder Access (CFA) in Microsoft Defender for Endpoint to prevent MBR/VBR](https://docs.microsoft.com/microsoft-365/security/defender-endpoint/controlled-folders)\nmodification.\n\n## Indicators of compromise (IOCs)\n\nThe following list provides IOCs observed during our investigation. We encourage customers to\ninvestigate these indicators in their environments and implement detections and protections to identify\npast related activity and prevent future attacks against their systems.\n\n**Indicator** **Type** **Description**\n\n[a196c6b8ffcb97ffb276d04f354696e2391311db3841ae16c8c9f56f36a38e92](https://www.virustotal.com/gui/file/a196c6b8ffcb97ffb276d04f354696e2391311db3841ae16c8c9f56f36a38e92) SHA-256 Hash of\ndestructive\nmalware\n_stage1.exe_\n\n[dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5329958d38b58c3fd9384081c9b78](https://www.virustotal.com/gui/file/dcbbae5a1c61dbbbb7dcd6dc5dd1eb1169f5329958d38b58c3fd9384081c9b78) SHA-256 Hash of\n_stage2.exe_\n\n\ncmd.exe /Q /c start c:\\stage1.exe 1> \\\\127.0.0.1\\ADMIN$\\__[TIMESTAMP]\n2>&1\n\n\nCommand\nline\n\n\nExample\nImpacket\ncommand\nline showing\nthe\nexecution of\nthe\ndestructive\nmalware.\nThe working\ndirectory\nhas varied\nin observed\nintrusions.\n\n\nNOTE: These indicators should not be considered exhaustive for this observed activity.\n\n## Detections\n\n### Microsoft 365 Defender\n\n**Antivirus**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-15 - Destructive malware targeting Ukrainian organizations (DEV-0586).pdf"
    ],
    "report_names": [
        "2022-01-15 - Destructive malware targeting Ukrainian organizations (DEV-0586).pdf"
    ],
    "threat_actors": [
        {
            "id": "025b7171-98f8-4391-adc2-66333629c715",
            "created_at": "2023-06-23T02:04:34.120175Z",
            "updated_at": "2025-03-27T02:02:09.797581Z",
            "deleted_at": null,
            "main_name": "Cadet Blizzard",
            "aliases": [
                "DEV-0586",
                "Operation Bleeding Bear",
                "Ruinous Ursa"
            ],
            "source_name": "ETDA:Cadet Blizzard",
            "tools": [
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "P0wnyshell",
                "PAYWIPE",
                "Ponyshell",
                "Pownyshell",
                "WhisperGate",
                "WhisperKill",
                "netcat",
                "reGeorg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bdbf873a-048d-4c5d-9d92-922327cc83a8",
            "created_at": "2023-01-06T13:46:39.387696Z",
            "updated_at": "2025-03-27T02:00:03.071819Z",
            "deleted_at": null,
            "main_name": "DEV-0586",
            "aliases": [
                "Ruinous Ursa",
                "Cadet Blizzard"
            ],
            "source_name": "MISPGALAXY:DEV-0586",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536090,
    "ts_updated_at": 1743041820,
    "ts_creation_date": 1653753835,
    "ts_modification_date": 1653753835,
    "files": {
        "pdf": "https://archive.orkl.eu/eca74fa705027582f22b739a675d2c736943fcae.pdf",
        "text": "https://archive.orkl.eu/eca74fa705027582f22b739a675d2c736943fcae.txt",
        "img": "https://archive.orkl.eu/eca74fa705027582f22b739a675d2c736943fcae.jpg"
    }
}