{
    "id": "a39da4a4-a0fb-4785-937a-90519f07ea3c",
    "created_at": "2023-01-12T15:07:12.395805Z",
    "updated_at": "2025-03-27T02:06:08.569806Z",
    "deleted_at": null,
    "sha1_hash": "5894ef3f907c40aaf119be2c6524569d25fc52bf",
    "title": "2022-02-24 - IBM Security X-Force Research Advisory- New Destructive Malware Used In Cyber Attacks on Ukraine",
    "authors": "",
    "file_creation_date": "2022-05-28T03:36:36Z",
    "file_modification_date": "2022-05-28T03:36:36Z",
    "file_size": 1931537,
    "plain_text": "# New Destructive Malware Used In Cyber Attacks on Ukraine\n\n**[securityintelligence.com/posts/new-destructive-malware-cyber-attacks-ukraine/](https://securityintelligence.com/posts/new-destructive-malware-cyber-attacks-ukraine/)**\n\n[Malware February 24, 2022](https://securityintelligence.com/category/x-force/malware-threat/)\nBy [Christopher Del Fierro co-authored by John Dwyer 8 min read](https://securityintelligence.com/author/christopher-del-fierro/)\n_This post was written with contributions from IBM Security X-Force’s_ _[Anne Jobmann,](https://securityintelligence.com/author/anne-jobmann/)_ _Claire_\n_Zaboeva and_ _[Richard Emerson.](https://securityintelligence.com/author/richard-emerson/)_\n\n\n-----\n\n**February 25, 2022 Update**\n\n[On February 24 2022, Symantec Enterprise reported a ransomware dubbed as PartyTicket](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia)\nwas deployed alongside the HermeticWiper malware. IBM Security X-Force obtained a\nsample of the PartyTicket ransomware and has provided technical analysis, indicators of\ncompromise, and detections within the PartyTicket section of this blog.\n\n[On February 23, 2022, open-source intelligence sources began reporting detections of a](https://www.scmagazine.com/analysis/apt/ukraine-organizations-hit-by-new-wiper-malware?mkt_tok=MTg4LVVOWi02NjAAAAGCyspABLxRb3-W0Sz-oXv-o-8ytkaKIMLOPRQmPiPH9lrb1SyTnanotu3RAjOzbFdMOvva90-VBRY5TjSsGhHV66Dnyrvyy8ZNbJQ_CQ)\nwiper malware — a destructive family of malware designed to permanently destroy data from\n[the target — executing on systems belonging to Ukrainian organizations. IBM Security X-](https://twitter.com/ESETresearch/status/1496581914769207298)\n[Force obtained a sample of the wiper named HermeticWiper. It uses a benign partition](https://www.virustotal.com/gui/file/1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591)\nmanager driver (a copy of empntdrv.sys) to perform its wiping capabilities corrupting all\navailable physical drives’ Master Boot Record (MBR), partition, and file system (FAT or\nNTFS).\n\nThis is not the first wiper malware targeting Ukrainian organizations X-Force has analyzed. In\n[January 2022, X-Force analyzed the WhisperGate malware and did not identify any code](https://www.computerweekly.com/news/252512491/More-intel-emerges-on-WhisperGate-malware-that-hit-Ukraine)\noverlaps between WhisperGate and HermeticWiper.\n\nThis blog post will detail IBM Security X-Force’s insights into the HermeticWiper malware,\ntechnical analysis of the sample, and indicators of compromise (IoC) to help organizations\nprotect themselves from this malware.\n\n## Why This Is Important\n\n[In January 2022, X-Force analyzed the WhisperGate malware. HermeticWIper is the second](https://www.computerweekly.com/news/252512491/More-intel-emerges-on-WhisperGate-malware-that-hit-Ukraine)\nnewly seen destructive malware family observed in the past two months targeting\norganizations in Ukraine, and reportedly other countries in Eastern Europe. No code\noverlaps were identified between WhisperGate and HermeticWiper.\n\nThe pace at which these new, destructive malware families are being deployed and\ndiscovered is unprecedented, and further highlights the need for organizations to have an\nactive and informed defense strategy that expands beyond signature-based defenses.\n\nAs the conflict in the region continues to evolve and given the destructive capabilities of both\nWhisperGate and HermeticWiper, IBM Security X-Force recommends critical infrastructure\norganizations within the targeted region fortify defenses. Those organizations should focus\non preparation for potential attacks that can destroy or encrypt data or otherwise significantly\nimpact operations.\n\nIt is of X-Force’s opinion that destructive cyber attacks will likely continue to be leveraged\nagainst civilian targets in support of hybrid operations. In addition, X-Force believes it is likely\ncyber attacks will continue to escalate and expand in parallel with the scope of the ongoing\n\n\n-----\n\nconflict. It should be noted the increasing number of destructive capabilities focused against\nprivate industry and entities associated with the Ukraine and its perceived allies, will likely\nalter the cyber security environment by creating an elevated threat to regional commerce.\n\n## Analysis Details\n\nThis section contains the results of the analysis performed for the submitted samples. Typical\nanalysis includes both behavioral and static analysis.\n\nBehavioral analysis describes the malware behavior observed on a system during execution.\nBehavioral analysis typically includes actions performed on the system such as files\ndropped, persistence, details surrounding process execution and any C2 communications. It\nshould be noted that behavioral analysis may not capture all notable malware behavior as\ncertain functions may only be performed by the malware under specific conditions.\n\nStatic analysis is a deeper dive into the technical analysis of the malware. Static analysis\ntypically includes further details about the functionality, obfuscation or packing in the sample,\nencryption used by the malware, configuration information or other notable technical detail.\n\n## Behavioral Analysis\n\nUpon execution, HermeticWiper immediately adjusts its process token privileges and\nenables SeBackupPrivilege. This gives the malware read access control to any file,\nregardless of whatever is specified in access control list (ACL).\n\n\n-----\n\nIt then checks for the system’s OS version to know which version copy of a benign partition\nmanagement driver (EaseUS Partition Manager: epmntdrv.sys) it will use. The driver is\ninitially Microsoft compressed (SZDD compression) and embedded in its resource named\nRCDATA.\n\nFor Windows XP:\n\nx86 – it uses DRV_XP_X86\nx64 – it uses DRV_XPX64\n\nFor Windows 7 and up:\n\nx86 – it uses DRV_X86\nx64 – it uses DRV_X64\n\n\n-----\n\nAfter verifying what version it will use, the SZDD compressed benign partition management\ndriver is then dropped in the following directory as:\n```\n%WINDIR%\\system32\\driver\\<random_2chars>dr\nExample: C:\\Windows\\system32\\Drivers\\vfdr\n\n```\nIt then proceeds to decompress it and adds “.sys” as file extension.\n\n```\nExample: C:\\Windows\\system32\\Drivers\\vfdr.sys\n\n```\n\nIt then proceeds to adjust its process token privileges again to enable SeLoadDriverPrivilege.\nThis token enables the process of HermeticWiper have the ability to load and unload device\ndrivers.\n\nNext, it disables crash dumps by modifying the following registry key:\n\n```\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\CrashControl\n\n```\n```\nCrashDumpEnabled = 0\n\n```\n\nNote that crash dumps are memory dumps that contains information why the system stops\nunexpectedly. With this option disabled, the system will be prevented to create any dumps,\nthus successfully covering its tracks.\n\n\n-----\n\nIt also disables Volume Shadow Service (vss) if enabled, and disables ShowCompColor and\n_ShowInfoTip in all HKEY_USERS registry:_\n```\nHKEY_USERS\\<ID>\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\nShowCompColor = 0\nShowInfoTip = 0\n\n```\n_ShowCompColor option displays compressed and encrypted NTFS files in color while_\n_ShowInfoTip shows pop-up descriptions for folder and desktop items._\n\nHermeticWiper then proceeds to add and load the created driver as a service using Windows\nAPIs such as OpenSCManagerW(), OpenServiceW(), CreateServiceW() and\n_StartServiceW()._\n\nExample:\n\nThis creates a service entry in the registry:\n\n```\nHKLM\\SYSTEM\\CurrentControlSet\\services\\<random_2chars>dr\n\n```\n\nOnce the benign driver service is started and loaded in the system, it then proceeds to cover\nits tracks once again by deleting the created driver in %WINDIR%\\system32\\drivers and\ndeleting the created service in the registry.\n\nHermeticWiper enumerates a range of up to 100 Physical Drives by looping 0-100. It uses\nthe benign partition manager, now loaded in the system, to corrupt all Master Boot Record\n(MBR) for every Physical Drive present in the system.\n\nBut it doesn’t stop there, it also corrupts all the available partition even supporting both FAT\nand NTFS file system. For NTFS, it also corrupts the Master File Table (MFT) which holds all\ninformation about a file to ensure that data will be unrecoverable.\n\nOnce all disks are corrupted, the system should result to a crash, but just in case,\nHermeticWiper also created a fail-safe sleeping thread that triggers a system shutdown to\nforce restart the target system.\n\n## Static Analysis\n\n\n-----\n\nAnalysis of the wiper sample revealed it was signed with a digital certificate issued to an\norganization named ‘Hermetica Digital Ltd’ and was created April 15, 2021. A digital\ncertificate is a file or cryptographic signature that proves the authenticity of an item such as a\nfile, server, or user.\n\nHermeticWiper contains the following digital certificate:\n\n## Indicators of Compromise (IOCs)\n\n### Hermeticwiper\n\nFILE SYSTEM:\n\n```\n%WINDIR%\\system32\\driver\\<random_2chars>dr\n\n```\n\nREGISTRY:\n\n\n-----\n\n```\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\CrashControl\nCrashDumpEnabled = 0\nHKEY_USERS\\<ID>\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Advanced\nShowCompColor = 0\nShowInfoTip = 0\nHKLM\\SYSTEM\\CurrentControlSet\\services\\<random_2chars>dr\n\n```\nSERVICE:\n\n```\nservice name: <random_2chars>dr\n\n```\n\n### Hermatic Malware Samples\n\nhttps://www.virustotal.com/gui/file/0385eeab00e946a302b24a91dea4187c1210597b8e\n17cd9e2230450f5ece21da/detection\nhttps://www.virustotal.com/gui/file/1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2\n672d77b9f6928d292591\n\n## Detection\n\nIBM Security X-Force has developed the following Yara signature to detect additional\ninstances of the HermeticWiper.\n```\nimport \"pe\"\nrule XFTI_HermeticWiper : HermeticWiper\n{\nmeta:\nauthor = \"IBM X-Force Threat Intelligence Malware Team\"\ndescription = \"Detects the wiper targeting Ukraine.\"\nthreat_type = \"Malware\"\nrule_category = \"Malware Family\"\nusage = \"Hunting and Identification\"\nticket = \"IRIS-12790\"\nhash = \"1bc44eef75779e3ca1eefb8ff5a64807dbc942b1e4a2672d77b9f6928d292591\"\nyara_version = \"4.0.2\"\ndate_created = \"24 Feb 22\"\ndate_updated = \"\"\nreference = \"\"\nxfti_reference = \"\"\nstrings:\n$s1 = \"\\\\\\\\.\\\\EPMNTDRV\\\\%u\" wide fullword\n$s2 = \"C:\\\\Windows\\\\SYSVOL\" wide fullword\n$s3 = \"DRV_X64\" wide fullword\n$s4 = \"DRV_X86\" wide fullword\n$s5 = \"DRV_XP_X64\" wide fullword\n$s6 = \"DRV_XP_X86\" wide fullword\ncondition:\n\n```\n\n-----\n\n```\nuint16(0) == 0x5A4D and 4 of them and\npe.imports(\"lz32.dll\", \"LZOpenFileW\") and\npe.imports(\"kernel32.dll\", \"FindResourceW\") and\npe.imports(\"advapi32.dll\", \"CryptAcquireContextW\")\n}\n\n## PartyTicket Analysis\n\n```\nThe ransomware sample dubbed as PartyTicket is a Golang compiled ransomware which is\nbelieved to be distributed alongside the HermeticWiper malware that targets Ukraine\norganizations.\n\nPartyTicket ransomware doesn’t include any escalation of privileges and will execute within\nthe context of the current user. This means that if it was executed with a non-privileged\naccount, folders and files requiring higher privileges will not be encrypted.\n\n[PartyTicket adds “.[[email protected]].encryptedJB” as file extension to all files it encrypts.](https://securityintelligence.com/cdn-cgi/l/email-protection)\nIt uses both RSA and AES to encrypt targeted files.\n\nInitial static analysis of the ransomware reveals “Biden” and “Whitehouse” referenced within\nthe code.\n\nUpon execution, PartyTicket ransomware builds a list of files to encrypt by checking for all\navailable drives from A: to Z: and traversing all directories except for those containing\n“Windows” and “Program Files”.\n\nWhile traversing the directory structure, the ransomware enumerates a target list of files\ncontaining the following extensions:\n\n\n-----\n\n```\n.acl, .avi, .bat, .bmp, .cab, .cfg, .chm, .cmd, .com, .crt, .css, .dat,\n.dip, .dll, .doc, .dot, .exe, .gif, .htm, .ico, .iso, .jpg, .mp3, .msi,\n.odt, .one, .ova, .pdf, .png, .ppt, .pub, .rar, .rtf, .sfx, .sql, .txt,\n.url, .vdi, .vsd, .wma, .wmv, .wtv, .xls, .xml, .xps, .zip, .docx, .epub,\n.html, .jpeg, .pptx, .xlsx, .pgsql, .contact, inc\n\n```\nNote that .exe is included in the target file to encrypt, indicating that the ransomware will\nencrypt itself afterwards.\n\nOnce the target list is created, the ransomware will create a copy of itself with a universally\nunique identifier (UUID) name for every file within the target list. The copies are executed\nwith a thirty-second timeout as children of the original PartyTicket process, each responsible\nfor encrypting a file within the target file list.\n\nExample PartyTicket child process execution lifecycle:\n```\nC:\\Windows\\system32\\cmd.exe cmd /c copy <PartyTicket.exe> b6771851-a96811eb-9f9f-000c29fc4fde.exe\nb6771851-a968-11eb-9f9f-000c29fc4fde.exe.exe <target_file_to_encrypt>\ntimeout /t 30 && C:\\Windows\\system32\\cmd.exe /C del <UUID>.exe\n\n## PartyTicket Indicators of Compromise (IOCs)\n\n```\nFILE SYSTEM:\n\n```\n%DESKTOP%\\read_me.html\n\n```\n```\n<encrypted_files>.[[email protected]].encryptedJB\n\n```\n\n## PartyTicket Detection\n\nIBM Security X-Force has developed the following Yara signature to help identify instances\nof the PartyTicket ransomware.\n```\nrule XFTI_PartyTicket : PartyTicket\n{\nmeta:\nauthor = \"IBM Security X-Force \"\ndescription = \"Detects the PartyTicket ransomware deployed alongside the\nHermeticWiper malware. The rule includes notable strings and function\nnames.\"\nthreat_type = \"Malware\"\nrule_category = \"Malware Family\"\nusage = \"Hunting and Identification\"\nhash = \"4dc13bb83a16d4ff9865a51b3e4d24112327c526c1392e14d56f20d6f4eaf382\"\nyara_version = \"4.0.2\"\ndate_created = \"25 Feb 22\"\nstrings:\n\n```\n\n-----\n\n```\n$main_func1 = pr1me\n$main_func2 = \"dtFie\"\n$main_func3 = \"getBoo\"\n$main_func4 = \"selfElect\"\n$main_func5 = \"highWay60\"\n$main_func6 = \"voteFore403\"\n$main_func7 = \"subscribeNewPartyMember\"\n$proj_path = \"/403forBiden/\"\n$file_ext = \".encryptedJB\"\ncondition:\nuint16(0) == 0x5A4D and 7 of them\n}\n\n## Response\n\n```\nAt this time, X-Force recommends organizations implement detections for the file system,\nregistry, and Windows service indicators listed in this report as well as leveraging the\nprovided Yara rule to scan files. Additionally, global businesses should seek to establish\nsound insight into their respective networks, supply chains, third parties, and partnerships\nthat are based in, or serve in-region institutions. It is also advised that organizations open\nlines of communications between relevant information-sharing entities to ensure the receipt\nand exchange of actionable indicators.\n\nIn addition to response measures associated with the indicators of compromise, X-Force\nrecommends organizations consider the following proactive measures:\n\nBlock high-risk protocols on all B2B VPNs\nImplement netflow monitoring at all egress points\nHave contingency plans in place to disconnect B2B VPNs, particularly those that are\nhigh-risk\nPrevent loading of unknown driver files\n\nIf you have questions and want a deeper discussion about the malware and prevention\n[techniques, you can schedule a briefing here. Get the latest updates as more information](https://www.ibm.com/security/services/offensive-security-services?schedulerform.)\n[develops on the IBM Security X-Force Exchange and the](https://exchange.xforce.ibmcloud.com/collection/56ed5d53e7aeca5d1624be2d181f7d0a) [IBM PSIRT blog.](https://www.ibm.com/blogs/psirt/an-update-on-russia-ukraine/)\n\nIf you are experiencing cybersecurity issues or an incident, contact X-Force to help.\n\nUS hotline 1-888-241-9812\n\nGlobal hotline (+001) 312-212-8034\n\n[Christopher Del Fierro](https://securityintelligence.com/author/christopher-del-fierro/)\nX-Force IRIS Malware Reverse Engineer\n\n\n-----\n\nChris is a seasoned malware and threat researcher, certified system security engineer, MCP,\nand ethical hacker (CEHv5). Before joining IBM, Christopher was a...\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-24 - IBM Security X-Force Research Advisory- New Destructive Malware Used In Cyber Attacks on Ukraine.pdf"
    ],
    "report_names": [
        "2022-02-24 - IBM Security X-Force Research Advisory- New Destructive Malware Used In Cyber Attacks on Ukraine.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536032,
    "ts_updated_at": 1743041168,
    "ts_creation_date": 1653708996,
    "ts_modification_date": 1653708996,
    "files": {
        "pdf": "https://archive.orkl.eu/5894ef3f907c40aaf119be2c6524569d25fc52bf.pdf",
        "text": "https://archive.orkl.eu/5894ef3f907c40aaf119be2c6524569d25fc52bf.txt",
        "img": "https://archive.orkl.eu/5894ef3f907c40aaf119be2c6524569d25fc52bf.jpg"
    }
}