{
    "id": "a3b49897-e235-4831-a40a-6c191479bb7e",
    "created_at": "2024-02-16T02:07:25.974287Z",
    "updated_at": "2025-03-27T02:17:05.720045Z",
    "deleted_at": null,
    "sha1_hash": "04235823ae763bc4dffc06bb070a0f2b2942802c",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-02-08T14:08:17Z",
    "file_modification_date": "2024-02-08T14:08:17Z",
    "file_size": 5171395,
    "plain_text": "# Tool of First Resort\n\n###### Israel-Hamas War in Cyber\n\n\n-----\n\n###### About the authors\n\n[Google’s Threat Analysis Group](https://blog.google/threat-analysis-group/) (TAG) is responsible for countering\n\nthreats to Google and our users from government-backed attackers,\n\ntargeted 0-day exploits, coordinated information operations (IO), and\n\nserious cybercrime networks. We apply our intelligence to improve\n\nGoogle’s defenses and protect users.\n\n**[Mandiant, part of Google Cloud, is a recognized leader in dynamic cyber](https://www.mandiant.com/resources/blog)**\n\ndefense, threat intelligence and incident response services. By scaling\n\ndecades of frontline experience, Mandiant helps organizations to defend\n\nagainst and respond to cyber threats.\n\n**Google Trust & Safety safeguards Google products against abuse**\n\nand provides trusted and safe experiences for all users.\n\n\n## Table of contents\n\n###### Executive Summary  4\n```\nSection 1\n\n Iran continues to aggressively target Israel 10\n and US entities, often with mixed results\nSection 2\n\n Cyber attacks on Iran conducted 25\n by “Gonjeshke Darande”\nSection 3\n\n Typical Hamas-linked cyber espionage 28\n prior to October 7\nSection 4\n\n Mobile malware is often a tool-of-choice in 38\n cyber espionage campaigns targeting Israel\n\n Conclusion 46\n\n```\n|Col1|Col2|Col3|\n|---|---|---|\n\n|Col1|Col2|\n|---|---|\n\n\n-----\n\n### Executive Summary\n\n###### This report presents an analysis of cyber\n\n activity before and after the October 7, 2023\n\n start of the Israel-Hamas war and dives into\n\n specific examples that support the following\n\n key observations, drawn from research by\n\n Google’s Threat Analysis Group (TAG) and\n\n Mandiant Intelligence.\n\n\n###### 1\n\n 2\n\n 3\n\n\nIran extensively employed cyber operations to gather information\n\nand cause disruption in the years before the attack and continues\n\nto do so after the attack. Disruptive operations focused on Israel,\n\nwhere Iran has long conducted cyber attacks against key Israeli\n\norganizations, but also affected American critical infrastructure.\n\nIran’s espionage operations likewise focused on Israel and the\n\nUnited States, but also impacted other countries in the region.\n\nHamas-linked groups were active with typical operations through\n\nSeptember 2023, with no observable increase in activity leading\n\nup to October 7, and we have not observed significant activity since\n\nthen. Activity prior to the conflict included mass phishing campaigns\n\ntargeting Palestine and its regional neighbors and persistent efforts\n\nto target Israeli entities with a variety of custom and open-source\n\ncyber capabilities, including Android malware. These campaigns\n\nwere in line with historic cyber activity by Hamas-linked actors.\n\nIranian critical infrastructure was targeted with disruptive\n\nattacks later claimed by the persona “Gonjeshke Darande”\n\n(Predatory Sparrow). The attack on gas stations followed public\n\nwarnings from the persona, which Iran has attributed to Israel.\n\nGonjeshke Darande has been tied to prior attacks in Iran.\n\n\n-----\n\n###### It is clear that cyber will play a role in every major conflict\n\n going forward. We hope the analysis and research contained\n\n in this report serves as a call to action for all defenders, \n\n and provides fresh insights to help every organization better\n\n defend against potential attacks.\n\n At Google, we are committed to doing our part to support\n\n collective defense. We will continue to take action to disrupt\n\n malicious activity to protect Google and our users, and do \n\n our part to support security for all online users. We look\n\n forward to partnering with others to drive continued prog\n ress, and help organizations, businesses, governments, \n\n and users stay safe online.\n\n\n###### Ke y Observations\n\n While we have observed no evidence that Hamas’ initial attack included \n\n a planned cyber component, regional actors immediately engaged in cyber \n\n operations following the assault. These operations served two main goals: \n\n first, gathering operational and strategic intelligence; and second, demonstrating\n\n involvement in the war to multiple target audiences, leveraging the cyber domain\n\n as a vector for aggression short of kinetic activity. As the conflict continues and\n\n the possibility for broader regional instability increases, we want to share deeper\n\n analysis on our key observations to help defenders manage potential risks.\n\n**First, Iran aggressively targeted Israel and the United States in earlier**\n\n**years and this continues after the attack, including destructive cyber**\n\n**attacks against key Israeli organizations and intelligence collection ac-**\n\n**tivities directed at Israeli and** **US** **decision makers. In the six months leading**\n\nup to the October 7 attacks, Iran accounted for approximately 80% of all gov\nernment-backed phishing activity we observed targeting users based in Israel.\n\nAfter October 7, we’ve seen a focused effort to undercut support for the war\n\namong both the Israeli public and the broader global populace, including hack\nand-leak and information operations to demoralize Israeli citizens, erode their\n\ntrust in national organizations, and cast Israel's actions in a negative light.\n\nThese operations are consistent with longstanding Iranian efforts to target\n\n[Western organizations across sectors, including recent attempts to compromise](https://www.cpomagazine.com/cyber-security/iranian-hackers-breached-a-us-water-utility-via-an-israeli-made-scada-system/)\n\n[US critical infrastructure.](https://www.cpomagazine.com/cyber-security/iranian-hackers-breached-a-us-water-utility-via-an-israeli-made-scada-system/)\n\n**Second, Hamas-linked groups were active with typical operations through**\n\n**September 2023, with no observable increase in activity leading up to**\n\n**October 7, and we have not observed significant activity since then. Activity**\n\nprior to the conflict included mass phishing campaigns targeting Palestine and\n\nits regional neighbors, mobile malware, and persistent efforts to target Israeli\n\nentities with a variety of custom and open-source cyber capabilities. These\n\ncampaigns were in line with historic cyber activity by Hamas-linked actors. The\n\ntactics, techniques and procedures (TTPs) favored by these actors tend to be\n\nsimple-but-effective; however, at least one recent campaign by a Hamas-linked\n\ngroup shows advances in their cyber capabilities, including elaborate social en\ngineering campaigns to deliver custom malware to high-value Israeli targets.\n\n**Third, Iranian critical infrastructure was disrupted by an actor who**\n\n**claimed to be responding to the October 7 attacks. The actor “Gonjeshke**\n\nDarande” (Predatory Sparrow), which Iran has attributed to Israel, took credit\n\nfor disruptions to gas stations in the country.\n\n\n-----\n\n##### Cyber capabilities can be \n\n quickly deployed at minimal cost \n\n to regional rivals who may wish \n\n to avoid armed conflict — they\n\n are a tool of first resort.\n\n\n###### Assessments\n\n These observations point to several broader, forward-looking assessments\n\n for the security community for 2024:\n\n**We assess with high confidence that Iran-linked groups are likely**\n\n**to continue to conduct destructive cyber attacks, particularly**\n\nin the event of any perceived escalation to the conflict, which may\n\ninclude kinetic activity against Iranian proxy groups in various countries,\n\nsuch as Lebanon and Yemen.\n\n**We further judge that hack-and-leak and information operations**\n\n**remain a key component in these and related threat actors’ efforts**\n\nto telegraph intent and capability throughout the war, both to their\n\nadversaries and to other audiences that they seek to influence.\n\n**We assess that Hamas intentionally did not use cyber operations**\n\n**to tactically support the October 7 attack. There was no shift in**\n\noperations in the lead-up to the attack, and the majority of identified\n\noperations in the months prior involved intra-Palestinian and regional\n\nMiddle East targeting consistent with their normal activity. This is poten\ntially because the operational security risks from a cyber operation\n\noutweighed the assessed potential benefit.\n\n**While the outlook for future cyber operations by Hamas-linked**\n\n**actors is uncertain in the near term, we anticipate Hamas cyber**\n\n**activity will eventually resume, with a focus on espionage for intelli-**\n\ngence gathering on intra-Palestine affairs, Israel, the US, and other\n\nregional players in the Middle East.\n\n**The Israel-Hamas conflict is very different from other conflicts,**\n\nsuch as the Russian invasion of Ukraine. In the Israel-Gaza region,\n\nwe did not observe a spike in cyber operations against Israeli targets\n\nbefore the attack, in stark contrast to Ukraine, where we saw a large\n\nincrease in Russian cyber threat activity targeting Kyiv in the lead up\n\nto the invasion. In addition, we saw no indication that cyber activity was\n\nintegrated into Hamas battlefield operations, or that cyber was used\n\n[to enable kinetic events. In comparison, we saw Russian cyber threat](https://www.wired.com/story/sandworm-ukraine-third-blackout-cyberattack/)\n\n[actors launch coordinated cyber attacks against Ukrainian targets](https://www.wired.com/story/sandworm-ukraine-third-blackout-cyberattack/)\n\n[before missile strikes.](https://www.wired.com/story/sandworm-ukraine-third-blackout-cyberattack/)\n\n\n-----\n\n###### Section 1\n\n\n### Iran continues to aggressively target  US and Israel entities,  often with mixed results\n\n**Iran aggressively targeted Israel and the United States in the years**\n\n**leading up to Hamas’ attack on October 7 and has continued to target**\n\nthem throughout the subsequent conflict. These consistent strategic\n\npriorities suggest that the war did not fundamentally shift Tehran’s broader\n\ngoals. However, after the attacks took place, we have seen a focused effort\n\nto undercut public support for the war. This includes destructive cyber\n\nattacks against key Israeli organizations; hack-and-leak operations and\n\ntargeted information operations to demoralize Israeli citizens, erode trust\n\nin critical organizations, and turn global public opinion against Israel; and\n\nphishing activity directed at US and Israeli leaders to collect intelligence\n\non key decision makers.\n\n\n##### In the six months leading up \n\n to the October 7 attacks, Iran\n\n accounted for approximately\n\n 80% of all government-backed\n\n phishing activity we observed\n\n targeting users based in Israel.\n\n\n-----\n\n```\nIran and its Proxies\nThreat Actor Overview\n\n```\n\n###### MYSTICDOME\n\n**Aliases**\nUNC1530\nChrono Kitten\nStorm-0133\n\n###### ●\n\n —\n\n —\n\nIsrael\n\n—\n\nMiddle East\n\n—\n\nGovernment\n\nMilitary and\n\nDefense\n\nEnergy\n\n—\n\n—\n\n—\n\nHigh Tech\n\nand Telecom\n\nEducation\n\n—\n\n—\n\n—\n\n—\n\n—\n\n\n###### MARNANBRIDGE\n\n**Aliases**\nEmennet Pasargad\nCoTTon Sandstorm\n\n###### —\n\n ●\n\n —\n\nIsrael\n\nUnited States\n\nMiddle East\n\nEurope\n\nGovernment\n\n—\n\nEnergy\n\nFinancial\n\n—\n\n—\n\nHigh Tech\n\nand Telecom\n\n—\n\n—\n\nNGOs and\n\nCivil Society\n\nShipping and Rail\n\n—\n\n—\n\n\n###### GREATRIFT\n\n**Aliases**\nUNC4453\nPlaid Rain\n\n###### ●\n\n —\n\n —\n\nIsrael\n\n—\n\n—\n\n—\n\n—\n\nMilitary and\n\nDefense\n\n—\n\n—\n\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n\n###### DUSTYCAVE\n\n**Aliases**\nUNC4444\nImperial KiTTen\nCrimson Sandstorm\nTA456\n\n###### ●\n\n —\n\n —\n\nIsrael\n\nUnited States\n\nMiddle East\n\nEurope\n\nGovernment\n\nMilitary and\n\nDefense\n\nEnergy\n\nFinancial\n\nHealthcare and\n\nPharmaceuticals\n\nHeavy Industry\n\nHigh Tech\n\nand Telecom\n\n—\n\nNews Media\n\nNGOs and\n\nCivil Society\n\nShipping and Rail\n\nLegal and\n\nProfessional Services\n\nTransportation\n\n\n###### DUNE\n\n**Aliases**\nBanished Kitten\nStorm-0842\n\n###### ●\n\n ●\n\n ●\n\nIsrael\n\nUnited States\n\nMiddle East\n\nEurope\n\nGovernment\n\n—\n\n—\n\n—\n\nHealthcare and\n\nPharmaceuticals\n\n—\n\nHigh Tech\n\nand Telecom\n\nEducation\n\nNews Media\n\nNGOs and\n\nCivil Society\n\n—\n\n—\n\n—\n\n\n###### Espionage\n\n Information Operations\n\n Destruction\n\n Targeted Nations\n\n Primary Targets\n\n\n###### APT42\n\n**Aliases**\nCALANQUE\nCharming Kitten\nMint Sandstorm\nTA453\n\n###### ●\n\n —\n\n —\n\nIsrael\n\nUnited States\n\nMiddle East\n\nEurope\n\nGovernment\n\nMilitary and\n\nDefense\n\nEnergy\n\nFinancial\n\nHealthcare and\n\nPharmaceuticals\n\nHeavy Industry\n\n—\n\nEducation\n\nNews Media\n\nNGOs and\n\nCivil Society\n\n—\n\nLegal and\n\nProfessional Services\n\n—\n\n\n—\n\n\nHealthcare and\n\nPharmaceuticals\n\nNGOs and\n\nCivil Society\n\n\n-----\n\n###### Cyber oper ations against Isr ael by Ir an and its proxies since october 7\n\nOCTOBER 2023\n\nGREATRIFT distributed malware\n\nvia fake “missing persons” site\n\ntargeting visitors seeking updates\n\non abducted Israelis\n\n“\u0007Cyber Flood” hack-and-leak\n\noperation targeting Israeli\n\nmunicipalities\n\n“\u0007BiBi wiper” destructive attack\n\ntargeting Israeli IT and data hosting\n\ncompanies, defense contractors,\n\nand government organization\n\nGREATRIFT campaign spoofed\n\nan Israeli hospital and used blood\n\ndonation-themed lure documents\n\nto distribute malware\n\nNOVEMBER 2023\n\n“\u0007Cyber Aveng3rs” hack-and-leak\n\noperation against US water utility\n\nthat allegedly used Israeli-made\n\nhardware / software\n\nAPT42 phishing activity targeting\n\nhigh-profile Israel- and US\nbased users\n\n“\u0007Malek Team” hack-and-leak\n\noperation against Ziv hospital\n\nDECEMBER 2023\n\n“\u0007Handala Hack” persona claims\n\ncredit for destructive attack\n\ntargeting Israeli government\n\nand financial sectors\n\n\n###### Disruptive attacks  targeting Israel\n\nIn 2012, a suspected Iranian group used the SHA\nMOON wiper malware to disrupt organizations in\n\nthe Middle East. Since then, Iran-nexus actors\n\nhave continued to demonstrate a capability and\n\nwillingness to conduct destructive and disrup\ntive attacks against targets spanning a range of\n\nregions and sectors, including those in Israel.\n\nIn the weeks following the October 2023 Hamas\n\nattack, we saw an increase of destructive cyber\n\nattacks, including wiper malware deployed in\n\ncampaigns targeting the Israeli government,\n\nfinancial institutions, tech companies, and\n\ndefense contractors. These attacks are not a\n\nmajor shift in Iran’s modus operandi — destructive\n\nactivity, amplified by fabricated personas, has\n\nlong been a feature of Iranian operations target\ning Israel. Following the October 7 Hamas attacks,\n\nIranian actors also leveraged newly created\n\npersonas to incorporate rhetoric intended to\n\nundermine public confidence in Israeli leadership\n\nand promote pro-Palestine messaging.\n\nWhile these attacks have caused temporary\n\ndisruptions to the affected entities, and difficul\nties for everyday Israelis, we assess that they\n\nhave not had a sustained impact across wider\n\nsectors and have not meaningfully interfered\n\nin Israel’s military operations.\n\nWe anticipate Iran will continue to leverage\n\ndestructive capabilities against Israel and its\n\nallies to achieve Tehran’s strategic objectives,\n\nand that they may expand their use of destruc\ntive attacks in response to perceived escalation\n\nagainst Iran and its proxies in the context of the\n\ncurrent conflict. Iran has escalated its use of\n\ndestructive cyber attacks in response to per\nceived threats in the past. In 2022, for example,\n\n[the Iran-backed group DUNE targeted Albania](https://www.mandiant.com/resources/blog/likely-iranian-threat-actor-conducts-politically-motivated-disruptive-activity-against)\n\n— a NATO member state — ahead of a planned\n\nIranian opposition organization’s conference\n\nin the country; an incident reflecting Iran’s risk\n\ntolerance when engaging in such attacks against\n\nits adversaries.\n\n```\nAttackers reportedly\nsent instructions to\nprinters at target\norganizations to\nmass-produce a flyer\n(left) advertising the\nKarma Telegram channel\n(right) and an antiNetanyahu slogan\n\n```\n\n###### Iran-backed attackers deploy BiBi wiper  in late October\n\nIn late October 2023, attackers likely connected to the Iranian government\nbacked group DUNE, targeted Israeli organizations in a destructive attack\n\nleveraging wiper malware for both Linux and Windows. The malware,\n\ndubbed “BiBi wiper,” referenced Israeli Prime Minister Benjamin Netanyahu\n\nand overwrote files with random data including randomly generated\n\n[filenames containing the string “BiBi.” Public reporting noted that attackers](https://www.securityjoes.com/post/mission-data-destruction-a-large-scale-data-wiping-campaign-targeting-israel)\n\n[also changed machine names at affected organizations to “NO2BIBI” and](https://www.securityjoes.com/post/mission-data-destruction-a-large-scale-data-wiping-campaign-targeting-israel)\n\nsent instructions to printers to mass-print an anti-Netanyahu slogan.\n\nThe attack's targets included Israeli IT and data hosting companies, defense\n\ncontractors, and government organizations. Threat actors used a hacktivist\n\npersona on Telegram, “Karma”, to publicize the attacks and post the same\n\nanti-Netanyahu slogan that attackers printed out at victim organizations.\n\n\n-----\n\n```\n                               The persona “Handala\n                               Hack” claimed to be\n                               behind COOLWIPE and\n                               CHILLWIPE activity\n                               targeting Israeli\n                               government and\n                               financial entities\n\n###### December 2023 wiper activity targets  Israeli government, financials\n\n```\nIn mid-December 2023, cyber threat actors leveraged wiper malware for\n\nLinux and Windows to target government and financial institutions in Israel.\n\nPhishing emails impersonated a US-based multi-cloud applications and\n\nsecurity company to entice targets to download and run the malware,\n\ndubbed COOLWIPE and CHILLWIPE, in the guise of a security update;\n\nthe malware overwrites and then deletes files in the system.\n\nA persona named “Handala Hack,” a reference to a symbol of Palestinian\n\nresistance, then publicized the wiper activity associated with COOLWIPE\n\nand CHILLWIPE along with rhetoric citing Palestine. The Israel National\n\n[Cyber Directorate (INCD) attributed the activity to an Iranian attack group,](https://www.gov.il/he/departments/publications/reports/alert_1691)\n\nbut did not provide further information on the attackers’ identity.\n\n\n-----\n\n```\nPosts on Telegram by “Cyber Aveng3rs”\nshowing leaked data from alleged hacks.\nPro-Iran hack-and-leak claims have been\nlargely exaggerated and misleading.\n\n```\n```\nScreenshots from \n“Abnaa Al-Saada”\nTelegram posts\nclaiming to \ncompromise OT\n(Operational Technology) systems\nbelonging to an\nIsraeli company\n\n###### Conducting hack-and-leak and targeted  information operations\n\n```\nOver the past several years, Iran has committed significant resources to\n\n[digital influence efforts, including hack-and-leak and information operations.](https://www.atlanticcouncil.org/in-depth-research-reports/report/iranian-digital-influence-efforts-guerrilla-broadcasting-for-the-twenty-first-century/)\n\nHack-and-leak operations involve a two-step process to compromise poten\ntial victims and subsequently release extracted data with intent to influence.\n\nIranian actors have typically followed a common template: conduct intrusion\n\nactivity against a target; announce the hack using a fictitious persona; and\n\nuse sock puppet accounts on social media to amplify the leak or deface\nment. Recent operations have used personas including Cyber Aveng3rs,\n\nSoldiers of Solomon, Abnaa Al-Saada, Karma, Malek Team, Cyber Flood,\n\nand CyberToufan.\n\nRecent pro-Iran hack-and-leak groups have made claims — largely exagger\nated and misleading — of hacks against Israeli critical infrastructure, including\n\nenergy infrastructure. These groups publicized their claims on social media\n\nand via email, citing evidence demonstrating their alleged access to security\n\ncameras and other webcams in Israel. The claims of attack are likely intended\n\nas much to shape the information environment and create the perception of\n\nweakness in Israeli defenses, as for any tangible physical effect.\n\n\n-----\n\n###### “\u0007Cyber Flood” targets Israeli municipalities following October 7 attack\n\nWe have also observed hack-and-leak operations targeting Israel\n\nby MARNANBRIDGE, an information operations group likely connected\n\n[to the Iranian company Emennet Pasargad. Emennet Pasargad previously](https://blogs.microsoft.com/on-the-issues/2023/05/02/dtac-iran-cyber-influence-operations-digital-threat/)\n\n[carried out attacks that blended cyber and information operations and](https://blogs.microsoft.com/on-the-issues/2023/05/02/dtac-iran-cyber-influence-operations-digital-threat/)\n\n[was sanctioned by the US government for attempts to influence the](https://home.treasury.gov/news/press-releases/jy0494)\n\n2020 US presidential election.\n\nIn mid-October 2023, MARNANBRIDGE compromised and abused Israeli\n\nlocal government email accounts to send emails publicizing a hack-and\nleak operation targeting Israeli municipalities. The operation, designed\n\nprimarily to inspire fear among Israelis by demonstrating access to their\n\nmunicipal systems, also included messaging disseminated via compro\nmised accounts to further sow uncertainty. The emails were intended for\n\nthousands of users in Israel and contained claims that a hacker persona,\n\n“Cyber Flood,” had obtained data including personally identifiable informa\ntion (PII) from Israeli municipalities, alongside a pro-Palestine slogan and\n\nlinks to the persona’s X and Telegram channels, where it posted updates\n\nand “proof” of its activity. Fortunately, Google users were protected\n\nby Gmail, which automatically detected the emails and marked them\n\nas spam. Cyber Flood's Telegram and X accounts also posted claims\n\nthat the persona defaced hundreds of Israeli websites and compromised\n\nthe Israeli Ministry of Education.\n\n\n###### IRGC-linked “Cyber Aveng3rs” targets Israeli- made hardware / software in US water utility\n\n[On November 26, 2023, the Municipal Water Authority of Aliquippa in](https://www.cbsnews.com/pittsburgh/news/municipal-water-authority-of-aliquippa-hacked-iranian-backed-cyber-group/)\n\nPennsylvania announced that attackers had compromised a machine in a\n\nbooster station that regulated water pressure. The machine used a system\n\nthat included software or had components from an Israeli-owned company.\n\n[A Water Authority representative claimed there was never any threat to the](https://cyberscoop.com/pennsylvania-water-facility-hack-iran/#:~:text=The%20hackers%2C%20who%20call%20themselves,of%20just%20over%207%2C000%20people.)\n\n[availability of water, and that once they realized the hack occurred, the utility](https://cyberscoop.com/pennsylvania-water-facility-hack-iran/#:~:text=The%20hackers%2C%20who%20call%20themselves,of%20just%20over%207%2C000%20people.)\n\n[switched to manual operations. “Cyber Aveng3rs” — a hacker persona likely](https://www.ic3.gov/Media/News/2023/231201.pdf)\n\n[backed by Iran’s Islamic Revolutionary Guard Corps (IRGC) — claimed credit](https://www.ic3.gov/Media/News/2023/231201.pdf)\n\nfor the attack, and took over a control panel’s digital display screen to make\n\n[it read: “Every equipment ‘Made in Israel’ is Cyber Av3ngers legal target.”](https://www.politico.com/news/2023/11/28/federal-government-investigating-multiple-hacks-of-us-water-utilities-00128977)\n\nThe Cyber Aveng3rs persona was created in 2020, but it was mostly inactive\n\nfrom July 2020 to July 2023. It has previously targeted critical infrastructure,\n\noil and gas, transportation, and technology companies through distributed\n\ndenial-of-service (DDoS) attacks, hack-and-leak operations, data destruc\ntion and other disruptive activities. Despite multiple broad claims of activity\n\nagainst significant targets, we have not observed significant impact associ\nated with these claims, and we judge that the persona has likely overstated\n\nor fabricated its attacks. As with other pro-Iran hacktivist personas, these\n\nactivities are likely intended primarily to create the perception that Israel\n\nis endangered or besieged, rather than cause significant physical impact.\n```\nCyber Aveng3rs\nclaimed credit \nfor the attack and\ntook over a control\npanel’s digital\ndisplay to amplify\ntheir message\n\n```\n\n-----\n\n###### 80% Iran\n\n 10%  \u0007Palestine-based groups\n\n 5%  North Korea\n\n 3%  China\n\n 2%  \u0007Other\n\n**December 2023**\n\nPhishing preceding\nCOOLWIPE and CHILLWIPE\nwiper attack\n\n\n###### Targeted phishing for intelligence  collection against key targets\n\nIn the six months prior to the October 7 attacks, Iran accounted for\n\napproximately 80% of all government-backed phishing activity we observed\n\n[targeting users based in Israel. APT42 (a.k.a., CALANQUE) and DUSTYCAVE](https://www.mandiant.com/resources/blog/apt42-charms-cons-compromises)\n\n(a.k.a., UNC4444) accounted for the bulk of this activity, with targets including\n\nnational and municipal governments, diplomatic organizations, academia,\n\nthink tanks, NGOs, media, tech companies, aerospace and defense, and\n\nthe shipping sector. Following October 7, phishing activity levels remained\n\nconsistent with what we typically see from Iran-backed actors. Targets\n\nincluded national security think tanks, diplomats, former military, and\n\na crisis-focused NGO — all standard targets for Iranian APT actors, though\n\nthey were likely especially valuable intelligence targets at the time in light\n\nof the ongoing conflict.\n\n###### Likely IRGC-linked activity targets high- profile US and Israeli decision makers  and media, NGOs\n\nIn late October and November 2023, we observed continued phishing\n\n[activity from APT42, an Iranian-sponsored cyber espionage group that we](https://www.mandiant.com/resources/blog/apt42-charms-cons-compromises)\n\nbelieve to operate on behalf of the IRGC. The timing and targets of the cam\npaigns suggested a specific interest in Israeli and US decision making related\n\nto the conflict. In October, APT42 registered new domains likely for use in\n\ncredential harvesting and phishing campaigns. In a separate operation,\n\nUNC2448 distributed POWERPUG, a PowerShell backdoor, via a spear-phish\ning campaign. Targeted industries included media, non-governmental\n\norganizations (NGOs), and policy work associated with US higher education.\n\nDomains and the executable file used in the UNC2448 operation appeared to\n\nmasquerade as a Saudi Arabia-based NGO that focuses on Iranian studies.\n\nSubsequently in November 2023, APT42 conducted phishing activity against\n\nseveral high-profile users based in Israel and the US, including current\n\nand former government officials, diplomats, and individuals who work on\n\nUS-Israel relations. This activity is in line with the group's normal operations,\n\nbut is nonetheless notable for its focus on individuals who are likely to\n\npossess insights into the inner thinking and decision making of the US\n\nand Israeli governments.\n\n\n###### GOVERNMENT-BACKED  PHISHING TARGETING ISR AEL\n\n APRIL 1 – OCTOBER 7, 2023\n\nIran typically accounts\nfor the majority of\ngovernment-backed\nphishing activity TAG\nobserves in Israel.\n\nSource: Google's Threat\n\nAnalysis Group (TAG)\n\n###### TARGETING ISR AEL: PHISHING ACTIVIT Y  BY IR ANIAN GOVERNMENT-BACKED ACTORS\n\n**January** – **December 2023**\n\nConsistent, high tempo targeted phishing campaigns by APT42 (a.k.a., CALANQUE)\n\n**January** – **March 2023**\n\n\n60\n\nStart of Israel-Hamas war\n\n50\n\n**May** – **June 2023** **December 2023**\n\n40 DUSTYCAVE campaigns\n\ntargeting government, defense,\n\nwiper attack\n\naerospace, high tech, policy,\n\n30 finance and other verticals\n\n20\n\n10\n\n0\n\njan feb mar apr may jun jul aug sep oct nov dec\n\nSource: Google's Threat Analysis Group (TAG)\n\n\nDUSTYCAVE campaigns\ntargeting high tech, shipping,\nNGOs, government and\nfinancial services entities\n\n\n-----\n\n###### Section 2\n\n\n###  Cyber attacks on   Iran conducted by  “Gonjeshke Darande”\n\nOn October 10, 2023, the persona “Gonjeshke Darande“ (Predatory Sparrow)\n\nposted a Persian-language message on Telegram claiming to have returned,\n\nstating: “Do you think this is scary? We returned. We hope you're following\n\nwhat is happening in Gaza.“ Previously, Gonjeshke Darande claimed respon\nsibility for multiple attacks in Iran between October 2021 until January 2023\n\n[via Telegram and X (formerly Twitter).](https://t.me/s/GonjeshkeDarande)\n\nIn December 2023, Gonjeshke Darande claimed another major attack, saying\n\nthat they had taken a majority of gas stations in Iran offline. Iran's Oil Minis\nter, who blamed Israel and the US for the attacks, confirmed the impact.\n\nIn the posts claiming these attacks, Gonjeshke Darande said, “This cyber\nattack comes in response to the aggression of the Islamic Republic and its\n\nproxies in the region.” The hacking group has claimed restraint, emphasizing\n\nthat their operations were designed to disrupt and demonstrate capability,\n\nrather than cause lasting damage.\n\nIran has stated that it believes Israel is behind the Gonjeshke Darande\n\nattacks. We do not have sufficient evidence to evaluate claims of attribution\n\nfor Gonjeshke Darande activity.\n\n\n###### Likely Hezbollah-linked group used  conflict-themed phishing lures to  distribute malware\n\n**Iran’s proxy, Hezbollah, also conducted cyber operations targeting**\n\n**Israel immediately following the October 7 attacks. GREATRIFT,**\n\na Lebanon-based group likely linked to Hezbollah, took advantage of the\n\nsurge in interest in emergency services immediately following the initial\n\nattack to impersonate legitimate Israeli services in phishing lures, demon\nstrating its agility to rapidly tailor activity to current events. Masquerading\n\nas critical or emergency services in order to deliver malware could additionally\n\nserve the purpose of undermining trust in public institutions.\n\nIn one instance, GREATRIFT created a fake missing persons website that\n\nprompted visitors to download a likely malicious applet purportedly providing\n\nnotifications on the whereabouts of abducted Israelis. Separately, the group\n\ncreated and used a website impersonating Israel’s Sheba Medical Center\n\nto distribute malware with a blood donation theme. In both cases, we took\n\n[steps to disrupt these activities and added the sites to Safe Browsing’s](https://safebrowsing.google.com/)\n\nblocklist. As the war continues with a possible expansion into kinetic conflict\n\non Lebanese territory, Hezbollah-related actors may both conduct oppor\ntunistic attacks and respond to kinetic attacks in the cyber realm.\n\n```\nFake missing persons\nsite prompted visitors\nto install an applet\nfor updates on\nabducted Israelis\n(image intentionally\nblurred for privacy)\n\n```\n\n-----\n\n###### Iranian critical infrastructure was disrupted\n\n by an actor who referenced the Israel-Hamas\n\n conflict in its messaging. The actor “Gonjeshke\n\n Darande” (Predatory Sparrow) took credit for\n\n disruptions to gas stations and their payment\n\n systems throughout the country. Iran attributes\n\n this activity to Israel.\n\n```\nGonjeshke Darande\nclaimed to compromise gas stations and\ntheir payment systems\nthroughout Iran, including images demonstrating that they\nwere inside the network and its central\ncommunication systems.\n\n```\n\n-----\n\n###### Section 3\n\n```\nHamas-linked Groups\nThreat Actor Overview\n\n```\n\n###### DESERTVARNISH\n\n**Aliases**\nUNC718\nRenegade Jackal\nDesert Falcons\nArid Viper\n\n###### ●\n\n —\n\n —\n\nIsrael\n\nUnited States\n\nPalestine\n\nMiddle East\n\nEurope\n\nGovernment\n\nMilitary and\n\nDefense\n\nEnergy\n\nFinancial\n\n—\n\nHeavy Industry\n\nHigh Tech\n\nand Telecom\n\nEducation\n\nNews Media\n\nNGOs and\n\nCivil Society\n\n—\n\nLegal and\n\nProfessional Services\n\nTransportation\n\n\n###### BLACKATOM\n\n ●\n\n —\n\n —\n\nIsrael\n\n—\n\n—\n\n—\n\n—\n\n—\n\nMilitary and\n\nDefense\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\n—\n\nTransportation\n\n\n### Typical Hamas-linked  cyber espionage prior to October 7\n\n**Hamas-linked groups have shown high levels of interest in Israel**\n\n**in the past and have actively engaged in cyber operations to collect**\n\n**intelligence from targets within the Palestinian Territories and Israel.**\n\nThis includes mass phishing campaigns targeting users in Palestine and\n\nits regional neighbors, and persistent efforts to target Israeli entities with\n\na variety of custom and open-source cyber capabilities, including Android\n\nmalware. Their standard activity includes a steady cadence of intra-Palestine\n\ntargeting, as well as regular targeting of Israel, the United States, Europe,\n\nand countries neighboring Israel and Palestine. Through September 2023,\n\nHamas-linked groups were active with typical operations, with no observable\n\nincrease in activity leading up to October 7, and we have not observed signifi\ncant activity since then. We did not observe a shift in operations in the lead up\n\nto the October 7 attack, and assess that Hamas did not use cyber operations\n\nto tactically support the attack.\n\nHamas-linked cyber actors have historically relied on simple-but-effective\n\nTTPs to conduct their campaigns. They use phishing and malware lures with\n\ntopical political themes, basic custom backdoors and widely available remote\n\naccess tools such as njRAT and Xtreme RAT, and malware obfuscation tools\n\npurchased on underground forums. Mobile spyware is also common, includ\ning custom and open source Android backdoors distributed via phishing.\n\nMore recently, however, we have observed at least one Hamas-linked actor,\n\nBLACKATOM, show signs of more advanced capabilities, including elaborate\n\nsocial engineering tailored to software engineers and custom malware devel\noped for Windows, Mac, and Linux. While the future of Hamas cyber opera\ntions remains uncertain, the recent indications of evolving capabilities\n\nare notable and worth monitoring going forward.\n\n\n###### Espionage\n\n Information Operations\n\n Destruction\n\n Targeted Nations\n\n Primary Targets\n\n\n###### BLACKSTEM\n\n**Aliases**\nMolerats\nExtreme Jackal\n\n###### ●\n\n —\n\n —\n\nIsrael\n\nUnited States\n\nPalestine\n\nMiddle East\n\nEurope\n\nGovernment\n\nMilitary and\n\nDefense\n\nEnergy\n\nFinancial\n\nHealthcare and\n\nPharmaceuticals\n\nHeavy Industry\n\n—\n\nEducation\n\nNews Media\n\nNGOs and\n\nCivil Society\n\n—\n\nLegal and\n\nProfessional Services\n\n—\n\n\n-----\n\n###### Hamas-linked cyber oper ations\n\nsepTEMBER 2023\n\nBLACKSTEM\n\nmass phishing\n\ncampaigns targeting\n\nPalestine, Egypt,\n\nTunisia, and Jordan\n\nBLACKSTEM\n\nOAuth phishing\n\ncampaign targeting\n\nMicrosoft users\n\nBLACKSTEM\n\nexploited XSS bug\n\non Palestinian police\n\nwebsite to deliver\n\nmalware\n\nBLACKSTEM\n\ndeveloped Android\n\nspyware mimicking\n\nan official Palestinian\n\ngovernment app\n\nBLACKATOM\n\ntargeted Israeli\n\nsoftware developers\n\nwith coding\n\nassignment lure\n\nOCTOBER 2023\n\nLast confirmed\n\ncyber activity by\n\nHamas-linked actors\n\non October 4\n\n\n##### Prior to October 7, Hamas-linked\n\n groups were active with mass\n\n phishing campaigns targeting\n\n Palestine and its regional neighbors,\n\n mobile malware, and persistent\n\n efforts to target Israel.\n\n\n###### Conducting phishing  and malware campaigns\n\nIn the weeks leading up to the October 7 attack, we observed\n\nactors associated with Hamas conduct multiple campaigns,\n\nincluding mass phishing to deliver malware and efforts to\n\nsteal email data. In September 2023, for example, Hamas\nlinked group BLACKSTEM (a.k.a., Molerats) sent multiple waves\n\nof phishing emails to over 1,000 users located in Palestine,\n\nEgypt, Tunisia, and Jordan. A small number of users in Israel\n\nwere also targeted. The emails contained links to an imitation\n\nnews site impersonating Al Jazeera that ultimately delivered\n\na backdoor to targets. The payload was MAGNIFI, a simple\n\nbackdoor written in C++. The backdoor supports downloading\n\nand executing additional files that will be saved and periodi\ncally executed from a specific directory.\n\nIn a separate September 2023 campaign, BLACKSTEM sent\n\nphishing emails with a url that redirected to a request via Mic\nrosoft for authentication tokens. Users logged into Microsoft\n\nwould receive a prompt to permit access to an attacker-con\ntrolled Azure / Microsoft app. The requested token included\n\nread / write permissions for mail, and, if granted, the token\n\nwould be sent back to an attacker-controlled url.\n\n\n-----\n\n###### Intra-Palestine targeting\n\n```\nLegitimate Palestine\nPolice website exploited\n\n```\n`via reflected XSS` In the weeks leading up to October 7,\n\n##### Hamas-linked actors launched\n\n\nIn the weeks leading up to October 7, Hamas-linked actors launched multiple\n\ncampaigns targeting users and organizations based in Palestine, including\n\norganizations in the Fatah-led government. Intra-Palestine targeting has long\n\nbeen a focus of Hamas-linked cyber campaigns, and we have consistently\n\nseen such activity, likely at least in part due to longstanding political rivalries\n\nand factionalism. However, the recent campaigns illustrate Hamas’ dedicated\n\nfocus on collecting intelligence about internal Palestinian affairs, even weeks\n\nprior to launching a major attack on Israel.\n\nStarting in early September 2023, BLACKSTEM exploited a reflected cross\nsite scripting (XSS) vulnerability on the website of the Palestinian Civil Police\n\nForce (palpolice[.]ps). The link created a browser popup that redirected\n\nthe visitor to a “news.rar” archive containing an exploit for a known bug\n\n(CVE-2023-38831) in the popular Windows file archiver tool WinRAR.\n\nThe final payload was the MAGNIFI backdoor.\n\nIn September 2023, we also identified initial efforts by BLACKSTEM to\n\ncreate Android spyware that mimicked a legitimate application used by\n\nemployees of Palestine’s Ministry of Interior (MOI). The legitimate app allows\n\nMOI employees to access internal data on their mobile devices. We suspect\n\nthe spyware app was still in early stages of development when discovered.\n\nThe app has not been published to the Google Play store, and we have not\n\nseen any evidence of it being distributed widely.\n\n\n##### multiple campaigns targeting users\n\n and organizations based in Palestine,\n\n including organizations in the Fatah\n led government.\n\n\n-----\n\n###### BLACKATOM targeting Israeli  software engineers with SYSJOKER multi-platform malware\n\nRecent campaigns suggest Hamas-linked actors may be advancing their\n\nTTPs to include intricate social engineering lures specially crafted to\n\nappeal to a niche group of high value targets. In September 2023, a Pales\ntine-based group likely linked to Hamas targeted Israeli software engineers\n\nusing an elaborate social engineering ruse that ultimately installed malware\n\nand stole cookies. The attackers, which Google’s Threat Analysis Group\n\n(TAG) tracks as BLACKATOM, posed as employees of legitimate companies\n\nand reached out via LinkedIn to invite targets to apply for software devel\nopment freelance opportunities. Targets included software engineers in\n\nthe Israeli military, as well as Israel’s aerospace and defense industry.\n\nAfter establishing initial communication, BLACKATOM sent targets a lure\n\ndocument with instructions for participating in a coding assessment. The\n\ninstructions directed targets to download a Visual Studio project from an\n\nattacker-controlled Github or Drive page, add features to the project to\n\nprove their coding skills, and then send it back for evaluation. The project\n\nappeared to be a benign HR management app, but included a function\n\nto download a malicious ZIP, extract the ZIP, and execute malware inside\n\non the target’s system. Pivoting on indicators from the initial activity,\n\nwe also identified trojanized React apps BLACKATOM used in a variation\n\nof the campaign.\n\n```\nBLACKATOM sent targets LinkedIn profile\ninstructions for participating in a coding assignment (image\nintentionally blurred\nfor privacy)\n\n```\n```\n                             Attacker-controlled\n                             LinkedIn profile\n\n```\n\n-----\n\n```\nAttacker-owned\nGithub repositories,\nincluding a malicious\ncoding assignment\n(image intentionally\nblurred for privacy)\n\n```\n\n###### Hamas-linked cyber operations tend to be\n\n simple but effective. However, one recent\n\n campaign demonstrated more advanced\n\n capabilities, including elaborate social\n\n engineering to deliver custom malware \n\n to high-value targets.\n\n\n[The payload was SYSJOKER, a multi-platform backdoor first reported on](https://intezer.com/blog/research/new-backdoor-sysjoker/)\n\n[in 2022, including variants for Windows, Linux and Mac that reached out to](https://intezer.com/blog/research/new-backdoor-sysjoker/)\n\nDrive to retrieve a C2 address. The latest variant from September 2023 used\n\nMicrosoft’s OneDrive to host the C2 address. Upon discovering the activity,\n\nwe disrupted attacker-controlled Drive urls and have deployed updated\n\nmalware signatures for SYSJOKER to protect users.\n\nThis campaign demonstrated more finely tuned operational targeting than\n\nwe’ve typically seen from Hamas-linked groups in the past. We’ve seen\n\nsimilar advances in other clusters of threat actor groups as they mature\n\nand evolve. It is possible we are at the start of a similar evolution with\n\nHamas-linked groups.\n\n\n-----\n\n###### Section 4\n\n\n###### Anatomy of a mobile spy ware campaign\n\n\n### Mobile malware is often a tool-of-choice in cyber espionage campaigns targeting Israel\n\nMobile malware is a key component in the operational toolkit of Iran- and\n\nPalestine-based actors, who use malicious mobile apps to collect intelligence\n\non users’ communications, contacts, real time location, and other device\n\nactivity. Prior to October 7, cyber actors linked to Hamas and Iran targeted\n\nusers based in Israel with Android malware. This activity was in-line with their\n\nstandard operations, and was likely part of ongoing efforts to collect intelli\ngence about targets-of-interest. Immediately following the Hamas attack on\n\nOctober 7, mobile malware was a central part of efforts to collect intelligence\n\non Israel-based users. Just days after the conflict began, unidentified cyber\n\nactors attempted to exploit Israel-based users’ need for real-time emer\ngency alerts, distributing malicious apps that masqueraded as Israel’s\n\n“Red Alert” missile warning app.\n\n\n-----\n\n##### Hamas-linked groups regularly use\n\n mobile spyware in attempts to \n\n gather intelligence on their targets.\n\n In 2023, we discovered and disrupted\n\n multiple Android malware campaigns\n\n tied to Hamas-affiliated actors.\n\n\n###### Hamas-linked actors targeting  Android users in Israel and Palestine\n\nHamas-linked groups regularly use mobile spyware in attempts to gather\n\nintelligence on their targets, and in 2023 we discovered and disrupted\n\nmultiple Android malware campaigns tied to Hamas-affiliated actors.\n\nIn August 2023, for example, Hamas-linked group DESERTVARNISH\n\ndistributed MOAAZDROID Android spyware, which masquerades as Tele\ngram, to users based in Israel and Palestine. The app was not on the Play\n\nstore, and DESERTVARNISH likely distributed it via WhatsApp messages.\n\nMOAAZDROID includes standard mobile spyware functionality, including\n\nthe permissions to read contacts and SMS data. MOAAZDROID also has\n\npermissions to send SMS messages, which may be used for phishing addi\ntional targets. The app stores stolen data in an encrypted file, sends it to\n\nan attacker-controlled command and control infrastructure, and then\n\ndeletes the file from the device.\n\nIn October 2023, we discovered updated versions of LOVELYDROID,\n\nAndroid spyware linked to DESERTVARNISH, including several active infec\ntions impacting devices in Israel. The updated samples had creation times\n\ndating back to mid-2023, and were not published to the Play store. The\n\nupdated LOVELYDROID had a similar code flow to prior versions and included\n\na command and control communications mechanism commonly used by IoT\n\ndevices. It included standard spyware features, including stealing SMS mes\nsages and contacts and the ability to record calls. For impacted users who\n\nwere infected with LOVELYDROID, including several users based in Israel, we\n\nissued a warning to prompt them to uninstall the malware from their device.\n\n\n-----\n\n###### Iran targeting mobile devices  for intelligence collection\n\nFor years, Iran has heavily used mobile spyware for domestic surveillance,\n\ntargeting Iranian dissidents, activists, and perceived threats to regime\n\nstability with a variety of malicious apps. These apps often masquerade as\n\nutilities like VPNs and Telegram clones, but also include standard backdoor\n\nfeatures for monitoring a user’s device. Iranian groups typically distribute\n\nAndroid spyware outside of the Play store through vectors like SMS phishing\n\nand social engineering on social media and chat apps.\n\nIran has also recently targeted mobile devices in Israel, likely for intel\nligence collection. In September 2023, we discovered Android spyware\n\nlinked to Iran-backed group MYSTICDOME (a.k.a., UNC1530). We identified\n\nand disrupted three new samples of MYTHDROID, also known publicly as\n\nAhMyth. MYTHDROID is an Android backdoor with basic functionality that\n\nhas been widely used by various APT actors since it was originally released\n\nin 2017 on Github as an open source research project. To distribute MYTH\nDROID, MYSTICDOME created Israel-themed domains where they hosted\n\nthe malicious APK. We suspect social engineering was used to convince\n\nusers to download the applications. We did not observe distribution via\n\nthe Play store.\n\nMYSTICDOME has also used social engineering to distribute a new Android\n\nspyware tool that we call SOLODROID. Four total instances of SOLODROID\n\nwere observed, all of which masqueraded as social media and dating\n\napplications targeting users in Israel. SOLODROID is capable of collecting\n\nfiles from a user device. MYSTICDOME distributed SOLODROID using Fire\nbase projects that 302-redirected users to the Play store, where they were\n\nprompted to install the spyware. We’ve disrupted this effort by taking down\n\nthe Google Cloud and Firebase projects, while also blocking and removing\n\nthe apps from the Play store. Iran-backed groups typically adapt and retool\n\nin response to defensive measures, and we expect them to continue their\n\nattempts to develop and deploy mobile malware capabilities in the future.\n\n\n###### Protecting users  from mobile spy ware\n\nGoogle continuously monitors for Android spyware, both within and\n\noutside the Play store. We deploy and constantly update detections\n\nthat protect users' devices and prevent malicious actors from publishing\n\nmalware to the Play store. In the event we identify spyware, we take action\n\nto disrupt not just the spyware itself, but the infrastructure supporting the\n\napplication. These actions include:\n\nAdding malicious domains / urls / files to Safe\n\nBrowsing blocklists, which protects users from\n\nexploitation across Chrome and other browsers,\n\nGmail, Search, Ads, Drive, and Android\n\nAuthoring detections to deploy in Google Play\n\nProtect, which offers users protection in and\n\noutside of Google Play, checking devices for\n\npotentially harmful apps regardless of the\n\ninstall source\n\nBanning malicious apps and their developers\n\nfrom Google Play\n\nTakedown of infrastructure connected with\n\nthe spyware, such as attacker-controlled cloud\n\nprojects and Firebase applications\n\nAuthoring detections for spam classifiers\n\nin Gmail and Drive\n\nSafe Browsing also protects Chrome users on Android by showing them\n\nwarnings before they visit dangerous sites. App scanning infrastructure\n\nprotects Google Play and powers Verify Apps to additionally protect users\n\nwho install apps from outside Google Play.\n\n\n-----\n\n#### Malicious “Red Alert” apps impersonating Israel’s air strike alert app\n\nIn October 2023, just days after the October 7 attack, we identified\n\nAndroid malware with themes designed to exploit concerns surrounding\n\nthe Israel-Hamas conflict. In at least two cases, the malware masqueraded\n\nas Israel’s “Red Alert” app, an application that notifies users in Israel of\n\nincoming rocket attacks.\n```\nSMS phishing message\ndistributing REDRUSE,\na trojanized clone \nof Israel’s “Red\nAlert” app\n\n###### REDRUSE: a trojanized clone of Red Alert\n\n```\nWithin days of the outbreak of the conflict, an unidentified actor created\n\na trojanized clone of the Red Alert app. The fake application, distributed\n\nas “redlalerts”, contained a backdoor that exfiltrated contacts, messag\ning data and location. Threat actors targeted Israeli users and spread the\n\ntrojanized Red Alert app via SMS phishing (smishing). The SMS messages\n\nwere sent from a spoofed sender impersonating the police and included\n\na link masquerading as the official rocket alert application. The malware\n\nwas also distributed via a GitHub repository.\n\nWe deployed detections to protect Android devices, and added malicious\n\ndomains associated with the app to Safe Browsing to protect users from\n\nfurther exploitation. The infrastructure was taken down in conjunction\n\nwith partners.\n\n\n###### AHMYTHRAT masquerading as Red Alert app\n\nLater in October 2023, we identified a second Android backdoor imper\nsonating Israel’s Red Alert app. The malware, AHMYTHRAT, is a variant\n\nof the publicly available AhMyth Android backdoor, which is designed\n\nto enable remote control of a compromised device. Its features include\n\nenumerating device location, capturing microphone recordings, retrieving\n\ncontact lists, accessing call data, SMS, and downloading and uploading\n\nfiles. The Red Alert-themed AHMYTHRAT sample was configured to connect\n\nto an attacker-controlled command and control (C2 or C&C) .\n\n```\nGitHub\nrepository\ndistributing\nREDRUSE\n\n```\n\n-----\n\n### Conclusion\n\n###### Cyber operations are a key feature of conflict, \n\n affecting those closest to the epicenter of warfare\n\n as well as those far away. Each conflict is unique,\n\n and the operations detailed here represent \n\n a blueprint for how cyber operations can impact \n\n a region, even when they are not employed by the\n\n belligerents in direct support of the kinetic conflict.\n\n\nAs this report reflects, cyber capabilities can\n\nbe quickly deployed at minimal cost by actors who\n\nmay wish to avoid armed conflict — they are a tool\n\nof first resort. These tools give regional rivals the\n\nability to quickly gather information and disrupt\n\ndaily life — all while remaining below the level of\n\ndirect military action. Adversaries can also use\n\nthese operations to telegraph intent and influence\n\nhow a conflict is perceived, without escalating\n\nor directly taking part in on-the-ground confron\ntation. This limits potential blowback while also\n\ngiving regional players the opportunity to project\n\npower through the cyber domain. We anticipate\n\nthat lessons learned recently will be valuable\n\nin periods of global uncertainty as we work to\ngether to foster a safer and more secure future.\n\n\nGoogle is committed to protecting the safety\n\nand security of online users and our platforms.\n\nAcross all Google products, we incorporate in\ndustry-leading security features and protections\n\nto keep our users safe. We also use the results of\n\nour research to improve the safety and security\n\nof our products. We believe one of the best ways\n\nwe can help is by sharing our findings with the\n\nsecurity community to raise awareness. We hope\n\nthat improved understanding of threats will lead\n\nto stronger protections across the industry.\n\n\nThis report includes extensive research from dozens of sources and comes in\n\nprint and online versions. The online version contains links to relevant sources.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/misc/tool-of-first-resort-israel-hamas-war-cyber.pdf"
    ],
    "report_names": [
        "tool-of-first-resort-israel-hamas-war-cyber.pdf"
    ],
    "threat_actors": [
        {
            "id": "82b92285-4588-48c9-8578-bb39f903cf62",
            "created_at": "2022-10-25T15:50:23.850506Z",
            "updated_at": "2025-03-27T02:00:55.501372Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Charming Kitten"
            ],
            "source_name": "MITRE:Charming Kitten",
            "tools": [
                "DownPaper"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6cfeba14-c84e-4606-88b9-c7a7689c450f",
            "created_at": "2022-10-25T16:07:24.06766Z",
            "updated_at": "2025-03-27T02:02:10.097459Z",
            "deleted_at": null,
            "main_name": "Polonium",
            "aliases": [
                "Plaid Rain"
            ],
            "source_name": "ETDA:Polonium",
            "tools": [
                "CreepyDrive",
                "CreepySnail",
                "DeepCreep",
                "FlipCreep",
                "MegaCreep",
                "PapaCreep",
                "TechnoCreep"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d866a181-c427-43df-9948-a8010a8fdad6",
            "created_at": "2022-10-27T08:27:13.080609Z",
            "updated_at": "2025-03-27T02:00:55.468138Z",
            "deleted_at": null,
            "main_name": "POLONIUM",
            "aliases": [
                "POLONIUM",
                "Plaid Rain"
            ],
            "source_name": "MITRE:POLONIUM",
            "tools": [
                "CreepyDrive",
                "CreepySnail"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "20c759c2-cd02-45bb-85c6-41bde9e6a7cf",
            "created_at": "2024-01-18T02:02:34.189827Z",
            "updated_at": "2025-03-27T02:02:09.937024Z",
            "deleted_at": null,
            "main_name": "HomeLand Justice",
            "aliases": [
                "Karma",
                "Storm-842",
                "Void Manticore"
            ],
            "source_name": "ETDA:HomeLand Justice",
            "tools": [
                "BABYWIPER",
                "BiBi Wiper",
                "BiBi-Linux Wiper",
                "BiBi-Windows Wiper",
                "Cl Wiper",
                "LowEraser",
                "No-Justice Wiper",
                "Plink",
                "PuTTY Link",
                "RevSocks",
                "W2K Res Kit"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "84a3dd71-1d65-4997-80fc-7fbe55b267f2",
            "created_at": "2023-04-26T02:03:02.969306Z",
            "updated_at": "2025-03-27T02:00:55.450032Z",
            "deleted_at": null,
            "main_name": "CURIUM",
            "aliases": [
                "CURIUM",
                "Crimson Sandstorm",
                "TA456",
                "Tortoise Shell",
                "Yellow Liderc"
            ],
            "source_name": "MITRE:CURIUM",
            "tools": [
                "IMAPLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d0e8337e-16a7-48f2-90cf-8fd09a7198d1",
            "created_at": "2023-03-04T02:01:54.091301Z",
            "updated_at": "2025-03-27T02:00:03.119447Z",
            "deleted_at": null,
            "main_name": "APT42",
            "aliases": [
                "UNC788",
                "CALANQUE"
            ],
            "source_name": "MISPGALAXY:APT42",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "ae26d287-8ba7-447e-9391-cf13c02d7481",
            "created_at": "2023-03-04T02:01:54.0962Z",
            "updated_at": "2025-03-27T02:00:03.120665Z",
            "deleted_at": null,
            "main_name": "TA453",
            "aliases": [],
            "source_name": "MISPGALAXY:TA453",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "daf2219f-08f1-44ef-9245-9a062ceff7a4",
            "created_at": "2023-11-08T02:00:07.120507Z",
            "updated_at": "2025-03-27T02:00:03.187017Z",
            "deleted_at": null,
            "main_name": "Cyber Av3ngers",
            "aliases": [],
            "source_name": "MISPGALAXY:Cyber Av3ngers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d8af157e-741b-4933-bb4a-b78490951d97",
            "created_at": "2023-01-06T13:46:38.748929Z",
            "updated_at": "2025-03-27T02:00:02.908256Z",
            "deleted_at": null,
            "main_name": "APT35",
            "aliases": [
                "Newscaster Team",
                "Magic Hound",
                "G0059",
                "Phosphorus",
                "Mint Sandstorm",
                "TunnelVision",
                "COBALT MIRAGE"
            ],
            "source_name": "MISPGALAXY:APT35",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1162e0d4-b69c-423d-a4da-f3080d1d2b0c",
            "created_at": "2023-01-06T13:46:38.508262Z",
            "updated_at": "2025-03-27T02:00:02.851407Z",
            "deleted_at": null,
            "main_name": "Molerats",
            "aliases": [
                "Gaza Hackers Team",
                "Gaza cybergang",
                "Gaza Cybergang",
                "Operation Molerats",
                "Extreme Jackal",
                "ALUMINUM SARATOGA",
                "G0021",
                "BLACKSTEM"
            ],
            "source_name": "MISPGALAXY:Molerats",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0c502f6d-640d-4e69-bfb8-328ba6540d4f",
            "created_at": "2022-10-25T15:50:23.756782Z",
            "updated_at": "2025-03-27T02:00:55.539397Z",
            "deleted_at": null,
            "main_name": "Molerats",
            "aliases": [
                "Molerats",
                "Operation Molerats",
                "Gaza Cybergang"
            ],
            "source_name": "MITRE:Molerats",
            "tools": [
                "MoleNet",
                "DustySky",
                "DropBook",
                "SharpStage",
                "PoisonIvy"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "3ce91297-e4c0-4957-8dd7-9047a3e23dc7",
            "created_at": "2023-01-06T13:46:39.054248Z",
            "updated_at": "2025-03-27T02:00:02.985963Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "IMPERIAL KITTEN",
                "Yellow Liderc",
                "Imperial Kitten",
                "TA456",
                "DUSTYCAVE",
                "Crimson Sandstorm"
            ],
            "source_name": "MISPGALAXY:Tortoiseshell",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9ff60d4d-153b-4ed5-a2f7-18a21d2fa05d",
            "created_at": "2022-10-25T16:07:23.539852Z",
            "updated_at": "2025-03-27T02:02:09.853285Z",
            "deleted_at": null,
            "main_name": "Desert Falcons",
            "aliases": [
                "APT-C-23",
                "ATK 66",
                "Arid Viper",
                "Operation Arid Viper",
                "Operation Bearded Barbie",
                "Operation Rebound",
                "TAG-63",
                "TAG-CT1",
                "Two-tailed Scorpion"
            ],
            "source_name": "ETDA:Desert Falcons",
            "tools": [
                "AridSpy",
                "Barb(ie) Downloader",
                "BarbWire",
                "Desert Scorpion",
                "FrozenCell",
                "GlanceLove",
                "GnatSpy",
                "KasperAgent",
                "Micropsia",
                "PyMICROPSIA",
                "SpyC23",
                "Viper RAT",
                "ViperRAT",
                "VolatileVenom",
                "WinkChat",
                "android.micropsia"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6a0effeb-3ee2-4a67-9a9f-ef5c330b1c3a",
            "created_at": "2023-09-07T02:02:47.827633Z",
            "updated_at": "2025-03-27T02:02:10.114881Z",
            "deleted_at": null,
            "main_name": "RedHotel",
            "aliases": [
                "RedHotel",
                "TAG-22"
            ],
            "source_name": "ETDA:RedHotel",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Brute Ratel",
                "Brute Ratel C4",
                "Cobalt Strike",
                "CobaltStrike",
                "FunnySwitch",
                "POISONPLUG.SHADOW",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "ShadowPad Winnti",
                "Spyder",
                "Winnti",
                "XShellGhost",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "72fea432-77a6-437a-b02d-693e99d81ef9",
            "created_at": "2024-02-17T02:00:03.861221Z",
            "updated_at": "2025-03-27T02:00:03.332415Z",
            "deleted_at": null,
            "main_name": "BANISHED KITTEN",
            "aliases": [
                "Storm-0842"
            ],
            "source_name": "MISPGALAXY:BANISHED KITTEN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "847f600c-cf90-44c0-8b39-fb0d5adfcef4",
            "created_at": "2022-10-25T16:07:23.875541Z",
            "updated_at": "2025-03-27T02:02:10.005591Z",
            "deleted_at": null,
            "main_name": "Molerats",
            "aliases": [
                "ATK 89",
                "Aluminum Saratoga",
                "Extreme Jackal",
                "Gaza Cybergang",
                "Gaza Hackers Team",
                "Molerats",
                "Operation DustySky",
                "Operation DustySky Part 2",
                "Operation Molerats",
                "Operation Moonlight",
                "Operation SneakyPastes",
                "Operation TopHat",
                "TA402",
                "TAG-CT5"
            ],
            "source_name": "ETDA:Molerats",
            "tools": [
                "BadPatch",
                "Bladabindi",
                "BrittleBush",
                "Chymine",
                "CinaRAT",
                "Darkmoon",
                "Downeks",
                "DropBook",
                "DustySky",
                "ExtRat",
                "Gen:Trojan.Heur.PT",
                "H-Worm",
                "H-Worm RAT",
                "Houdini",
                "Houdini RAT",
                "Hworm",
                "Iniduoh",
                "IronWind",
                "Jenxcus",
                "JhoneRAT",
                "Jorik",
                "KasperAgent",
                "Kognito",
                "LastConn",
                "Micropsia",
                "MoleNet",
                "Molerat Loader",
                "NeD Worm",
                "NimbleMamba",
                "Njw0rm",
                "Pierogi",
                "Poison Ivy",
                "Quasar RAT",
                "QuasarRAT",
                "SPIVY",
                "Scote",
                "SharpSploit",
                "SharpStage",
                "WSHRAT",
                "WelcomeChat",
                "Xtreme RAT",
                "XtremeRAT",
                "Yggdrasil",
                "dinihou",
                "dunihi",
                "njRAT",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "89c0c674-c35d-47a6-bd7c-1e6c1b6beacc",
            "created_at": "2024-05-01T02:03:08.042533Z",
            "updated_at": "2025-03-27T02:05:17.3236Z",
            "deleted_at": null,
            "main_name": "COBALT SHADOW",
            "aliases": [
                "AMERICIUM ",
                "Agrius",
                "BlackShadow",
                "DEV-0227 ",
                "Malek Team",
                "Pink Sandstorm ",
                "Agonizing Serpens "
            ],
            "source_name": "Secureworks:COBALT SHADOW",
            "tools": [
                " DEADWOOD",
                " Fantasy wiper",
                " Host2IP",
                " IPsec Helper",
                " Jennlog Loader",
                " MiniDump",
                " Moneybird ransomware",
                " PSexec",
                " Plink",
                " Sandals",
                " SecretsDump",
                " SoftPerfect Network Scanner",
                "Apostle"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b1979c55-037a-415f-b0a3-cab7933f5cd4",
            "created_at": "2024-04-24T02:00:49.561432Z",
            "updated_at": "2025-03-27T02:00:55.493381Z",
            "deleted_at": null,
            "main_name": "APT-C-23",
            "aliases": [
                "APT-C-23",
                "Arid Viper",
                "Desert Falcon",
                "TAG-63",
                "Grey Karkadann",
                "Big Bang APT",
                "Two-tailed Scorpion"
            ],
            "source_name": "MITRE:APT-C-23",
            "tools": [
                "Micropsia"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4134675e-5b72-4b50-8d70-1a8f18aafbb4",
            "created_at": "2024-10-04T02:00:04.766263Z",
            "updated_at": "2025-03-27T02:00:03.429899Z",
            "deleted_at": null,
            "main_name": "Handala",
            "aliases": [],
            "source_name": "MISPGALAXY:Handala",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "583cdac5-eb9d-46e9-a0f9-7594c4b18281",
            "created_at": "2024-05-01T02:03:08.017491Z",
            "updated_at": "2025-03-27T02:05:17.30797Z",
            "deleted_at": null,
            "main_name": "COBALT FIRESIDE",
            "aliases": [
                "CURIUM ",
                "DEV-0228 ",
                "HIVE0095 ",
                "Imperial Kitten ",
                "TA456 ",
                "Tortoiseshell ",
                "UNC3890 ",
                "Yellow Liderc ",
                "Crimson Sandstorm "
            ],
            "source_name": "Secureworks:COBALT FIRESIDE",
            "tools": [
                " LEMPO",
                " LiderBird",
                "FireBAK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "04888f75-158b-47f9-8ad9-4ff83f618ece",
            "created_at": "2024-05-01T02:03:08.03763Z",
            "updated_at": "2025-03-27T02:05:17.319276Z",
            "deleted_at": null,
            "main_name": "COBALT MIRAGE",
            "aliases": [
                "Nemesis Kitten ",
                "PHOSPHORUS ",
                "TunnelVision ",
                "UNC2448 ",
                "DEV-0270 "
            ],
            "source_name": "Secureworks:COBALT MIRAGE",
            "tools": [
                " Custom powershell scripts",
                " DiskCryptor",
                " Drokbk",
                " FRPC",
                " Fast Reverse Proxy (FRP)",
                " Impacket wmiexec",
                " Ngrok",
                " Plink",
                " PowerLessCLR",
                " TunnelFish",
                "BitLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "77c08a4a-b3f9-43ee-9d84-04ba572b7564",
            "created_at": "2024-05-01T02:03:07.927023Z",
            "updated_at": "2025-03-27T02:05:17.248836Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SHADYSIDE",
            "aliases": [
                "Arid Viper ",
                "Desert Falcon ",
                "APT-C-23 "
            ],
            "source_name": "Secureworks:ALUMINUM SHADYSIDE",
            "tools": [
                " SpyC23",
                "Micropsia"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "efe6ff9a-822d-41a6-90c3-45265cac696b",
            "created_at": "2024-05-01T02:03:07.920302Z",
            "updated_at": "2025-03-27T02:05:17.246342Z",
            "deleted_at": null,
            "main_name": "ALUMINUM SARATOGA",
            "aliases": [
                "Arid Viper",
                "Desert Falcon",
                "Extreme Jackal ",
                "Gaza CyberGang",
                "Gaza CyberGang",
                "Molerats ",
                "Operation DustySky ",
                "TA402",
                "APT-C-23"
            ],
            "source_name": "Secureworks:ALUMINUM SARATOGA",
            "tools": [
                " BrittleBush",
                " DarkComet",
                " LastConn",
                " Micropsia",
                " NimbleMamba",
                " PoisonIvy",
                " QuasarRAT",
                " XtremeRat",
                "BlackShades"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8ccee1d2-a873-4724-8616-b6429e7b0449",
            "created_at": "2024-02-16T02:00:04.616888Z",
            "updated_at": "2025-03-27T02:00:03.331682Z",
            "deleted_at": null,
            "main_name": "Blackatom",
            "aliases": [],
            "source_name": "MISPGALAXY:Blackatom",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "029625d2-9734-44f9-9e10-b894b4f57f08",
            "created_at": "2023-01-06T13:46:38.364105Z",
            "updated_at": "2025-03-27T02:00:02.815023Z",
            "deleted_at": null,
            "main_name": "Charming Kitten",
            "aliases": [
                "Parastoo",
                "iKittens",
                "Group 83",
                "NewsBeef",
                "G0058",
                "CharmingCypress"
            ],
            "source_name": "MISPGALAXY:Charming Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "929d794b-0e1d-4d10-93a6-29408a527cc2",
            "created_at": "2023-01-06T13:46:38.70844Z",
            "updated_at": "2025-03-27T02:00:02.897573Z",
            "deleted_at": null,
            "main_name": "AridViper",
            "aliases": [
                "Arid Viper",
                "APT-C-23",
                "Bearded Barbie",
                "Desert Falcon"
            ],
            "source_name": "MISPGALAXY:AridViper",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "fb8f3a5f-01a9-498e-9396-52f844424c33",
            "created_at": "2023-01-06T13:46:39.045338Z",
            "updated_at": "2025-03-27T02:00:02.984648Z",
            "deleted_at": null,
            "main_name": "LYCEUM",
            "aliases": [
                "siamesekitten",
                "Chrono Kitten",
                "Storm-0133",
                "COBALT LYCEUM",
                "UNC1530",
                "Spirlin",
                "MYSTICDOME"
            ],
            "source_name": "MISPGALAXY:LYCEUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b7823339-891d-4ded-b01d-1f142a88bc64",
            "created_at": "2023-01-06T13:46:39.381591Z",
            "updated_at": "2025-03-27T02:00:03.069535Z",
            "deleted_at": null,
            "main_name": "POLONIUM",
            "aliases": [
                "Plaid Rain",
                "UNC4453",
                "GREATRIFT"
            ],
            "source_name": "MISPGALAXY:POLONIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b5b24083-7ba6-44cc-9d11-a6274e2eee00",
            "created_at": "2022-10-25T16:07:24.337332Z",
            "updated_at": "2025-03-27T02:02:10.177597Z",
            "deleted_at": null,
            "main_name": "Tortoiseshell",
            "aliases": [
                "Crimson Sandstorm",
                "Curium",
                "Houseblend",
                "Imperial Kitten",
                "Marcella Flores",
                "Operation Fata Morgana",
                "TA456",
                "Yellow Liderc"
            ],
            "source_name": "ETDA:Tortoiseshell",
            "tools": [
                "IMAPLoader",
                "Infostealer",
                "IvizTech",
                "LEMPO",
                "MANGOPUNCH",
                "SysKit",
                "get-logon-history.ps1",
                "liderc",
                "stereoversioncontrol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1699fb41-b83f-42ff-a6ec-984ae4a1031f",
            "created_at": "2022-10-25T16:07:23.83826Z",
            "updated_at": "2025-03-27T02:02:09.995863Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "APT 35",
                "Ballistic Bobcat",
                "Charming Kitten",
                "CharmingCypress",
                "Cobalt Illusion",
                "Cobalt Mirage",
                "Educated Manticore",
                "Magic Hound",
                "Mint Sandstorm",
                "Operation BadBlood",
                "Operation Sponsoring Access",
                "Operation SpoofedScholars",
                "Operation Thamar Reservoir",
                "Phosphorus",
                "TA453",
                "TEMP.Beanie",
                "Tarh Andishan",
                "Timberworm",
                "TunnelVision",
                "UNC788",
                "Yellow Garuda"
            ],
            "source_name": "ETDA:Magic Hound",
            "tools": [
                "7-Zip",
                "AnvilEcho",
                "BASICSTAR",
                "CORRUPT KITTEN",
                "CWoolger",
                "CharmPower",
                "ChromeHistoryView",
                "CommandCam",
                "DistTrack",
                "DownPaper",
                "FRP",
                "Fast Reverse Proxy",
                "FireMalv",
                "Ghambar",
                "GoProxy",
                "GorjolEcho",
                "HYPERSCRAPE",
                "Havij",
                "MPK",
                "MPKBot",
                "Matryoshka",
                "Matryoshka RAT",
                "MediaPl",
                "Mimikatz",
                "MischiefTut",
                "NETWoolger",
                "NOKNOK",
                "PINEFLOWER",
                "POWERSTAR",
                "PowerLess Backdoor",
                "PsList",
                "Pupy",
                "PupyRAT",
                "SNAILPROXY",
                "Shamoon",
                "TDTESS",
                "WinRAR",
                "WoolenLogger",
                "Woolger",
                "pupy",
                "sqlmap"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "07131850-5161-48b8-98be-6b0271d44d0e",
            "created_at": "2024-01-23T13:22:35.085803Z",
            "updated_at": "2025-03-27T02:00:03.287403Z",
            "deleted_at": null,
            "main_name": "Cotton Sandstorm",
            "aliases": [
                "MARNANBRIDGE",
                "NEPTUNIUM",
                "Emennet Pasargad",
                "Holy Souls"
            ],
            "source_name": "MISPGALAXY:Cotton Sandstorm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "52127588-6072-43b5-898a-7dcad415b59f",
            "created_at": "2024-11-08T02:04:52.012895Z",
            "updated_at": "2025-03-27T02:05:17.320758Z",
            "deleted_at": null,
            "main_name": "COBALT OBELISK",
            "aliases": [
                "Cotton Sandstorm ",
                "Haywire Kitten ",
                "Marnanbridge ",
                "ChaoticOrchestra "
            ],
            "source_name": "Secureworks:COBALT OBELISK",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "219ddb41-2ea8-4121-8b63-8c762f7e15df",
            "created_at": "2023-01-06T13:46:39.384442Z",
            "updated_at": "2025-03-27T02:00:03.07071Z",
            "deleted_at": null,
            "main_name": "Predatory Sparrow",
            "aliases": [
                "Indra",
                "Gonjeshke Darande"
            ],
            "source_name": "MISPGALAXY:Predatory Sparrow",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7bd810cb-d674-4763-86eb-2cc182d24ea0",
            "created_at": "2022-10-25T16:07:24.1537Z",
            "updated_at": "2025-03-27T02:02:10.126127Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "APT 44",
                "ATK 14",
                "BE2",
                "Blue Echidna",
                "CTG-7263",
                "FROZENBARENTS",
                "IRIDIUM",
                "Iron Viking",
                "Quedagh",
                "Sandworm",
                "Sandworm Team",
                "Seashell Blizzard",
                "TEMP.Noble",
                "UAC-0082",
                "UAC-0113",
                "UAC-0125",
                "UAC-0133",
                "Voodoo Bear"
            ],
            "source_name": "ETDA:Sandworm Team",
            "tools": [
                "AWFULSHRED",
                "ArguePatch",
                "BIASBOAT",
                "Black Energy",
                "BlackEnergy",
                "CaddyWiper",
                "Colibri Loader",
                "Cyclops Blink",
                "CyclopsBlink",
                "DCRat",
                "DarkCrystal RAT",
                "Fobushell",
                "GOSSIPFLOW",
                "Gcat",
                "IcyWell",
                "Industroyer2",
                "JaguarBlade",
                "JuicyPotato",
                "Kapeka",
                "KillDisk.NCX",
                "LOADGRIP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "ORCSHRED",
                "P.A.S.",
                "PassKillDisk",
                "Pitvotnacci",
                "PsList",
                "QUEUESEED",
                "RansomBoggs",
                "RottenPotato",
                "SOLOSHRED",
                "SwiftSlicer",
                "VPNFilter",
                "Warzone",
                "Warzone RAT",
                "Weevly"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1708049245,
    "ts_updated_at": 1743041825,
    "ts_creation_date": 1707401297,
    "ts_modification_date": 1707401297,
    "files": {
        "pdf": "https://archive.orkl.eu/04235823ae763bc4dffc06bb070a0f2b2942802c.pdf",
        "text": "https://archive.orkl.eu/04235823ae763bc4dffc06bb070a0f2b2942802c.txt",
        "img": "https://archive.orkl.eu/04235823ae763bc4dffc06bb070a0f2b2942802c.jpg"
    }
}