{
    "id": "a3de2d31-8845-4845-9278-12b85e6d0059",
    "created_at": "2022-10-25T16:48:24.701543Z",
    "updated_at": "2025-03-27T02:09:29.713605Z",
    "deleted_at": null,
    "sha1_hash": "c8c216936ab67e42fe240e50ae1e0edb42c445c9",
    "title": "",
    "authors": "",
    "file_creation_date": "2022-03-02T02:24:31Z",
    "file_modification_date": "2022-03-02T02:24:31Z",
    "file_size": 4263347,
    "plain_text": "# #NoFilter: Exposing the Tactics of Instagram Account Hackers\n\n**[trendmicro.com/en_us/research/21/g/no-filter--exposing-the-tactics-of-instagram-account-hackers.html](https://www.trendmicro.com/en_us/research/21/g/no-filter--exposing-the-tactics-of-instagram-account-hackers.html)**\n\nJuly 12, 2021\n\nCyber Threats\n\nWhat tactics do Instagram account hackers use? What do these cybercriminals do with\nstolen accounts? How can users protect their accounts? We look into Instagram account\nhacking incidents from a security researcher’s perspective and share recommendations\nfor users of Instagram and other social media platforms.\n\nBy: Jindrich Karasek\nJuly 12, 2021\nRead time: 7 min (1898 words)\n\n**_Updated July 19, 2021: Added information on Instagram’s new Security Checkup_**\n_feature._\n\n[Numerous people use social networking sites such as Facebook, Twitter, and Instagram](https://www.trendmicro.com/vinfo/tmr/?/us/security/definition/social-networking)\n[for both personal and business purposes. Instagram alone has over a billion users every](https://blog.hootsuite.com/instagram-statistics/)\n[month — roughly an eighth of the world’s current population.](https://www.worldometers.info/world-population/)\n\nAnd like bees to nectar, cybercriminals also flock to these popular sites as they hunt for\n[hacking and extortion prey. In recent years, we have observed various groups and baits](https://www.trendmicro.com/en_us/research/19/b/how-a-hacking-group-is-stealing-popular-instagram-profiles.html)\nlinked to such schemes.\n\nIn this article, we examine another Instagram account hacking campaign carried out by\nindividual actors or by hacking groups. For maximum impact, the hackers behind this\n[campaign hound social media influencers, a pattern that has also been seen in past](https://neilpatel.com/blog/guide-to-influencer-targeting/)\ncampaigns. Having amassed thousands, if not millions, of followers and often earning\n[from brand deals, affiliate marketing, and other means, influencers have so much to lose](https://www.businessinsider.com/how-much-money-instagram-influencers-earn-examples-2021-6)\nshould their accounts get compromised.\n\nWhy is it important to investigate such a campaign? As the adage goes, “Knowing is half\nthe battle,” and the same can be said of this scheme. A heightened awareness of the\ntactics used in the campaign means fewer people will be fooled into practically handing\nover their account credentials to cybercriminals. Also, examining this and other, similar\nschemes reminds users to never take proper cybersecurity hygiene for granted.\n\n## How cybercriminals hack Instagram accounts\n\nTo bait targets, hackers often disguise their accounts as technical support accounts.\nSometimes, they assume the identity of a friend of the target account owner.\n\n\n-----\n\n[They then use phishing emails, messaging apps such as Telegram and WhatsApp, or](https://www.trendmicro.com/en_us/what-is/phishing.html)\nInstagram itself to reach out to the potential victim. They either create new accounts or\nreuse stolen accounts for this purpose. Their initial message doesn’t address the account\nowner by name. Instead, the message opens with a generic greeting, which is one of the\ntelltale signs of a scam.\n\nAs in a campaign we observed in the\npast, the content of the hackers’\nmessages claims either that the account\nowner has committed a copyright\nviolation or that they can provide a\n[verified badge. According to the hackers’](https://help.instagram.com/854227311295302)\nmessage, the account will be deleted if\nthe user will not verify their account by\nentering their information in a webpage\nto which a link is included by the\nhackers in the message. The link leads to\na phishing site that mimics the official\nInstagram user interface.\n\nFigure 1. A message from the hackers to a target\n\naccount owner\n\n\n-----\n\nFigure 2. A phishing page claiming that the target account owner has committed a copyright violation\n\nAfter selecting “Next” in the phishing page, the user is asked to enter the username of\nthe account in question. It should be noted that the phishing site does not verify whether\nthe username indeed belongs to a valid Instagram account.\n\nFigure 3. A phishing page requesting the target account owner’s username\n\nThe user is then asked to enter the password for the Instagram account, the email\naddress associated with the account, and the password for the email address. Again, the\nphishing site accepts even invalid and incorrect credentials The “Continue with\n\n\n-----\n\nFacebook” button also does not work.\n\nFigure 4. A phishing page requesting the target account owner’s password, email address, and email\n\npassword\n\nAfter the user selects “Continue As,” the site shows a confirmation page. The page also\ninstructs the user to not change their account information, ostensibly to give the hackers\nsufficient time for the withdrawal of the copyright infringement claim. But actually this\nmessage is included by the hackers so that they can buy enough time for logging in to the\naccount using the credentials provided by the user.\n\n\n-----\n\nFigure 5. A phishing page showing a confirmation message after the target account owner enters the\n\nrequested credentials\n\nSelecting “Continue” in the confirmation page leads to the section on copyright on the\nactual Instagram support site. This is included by the hackers in the phishing site\nsupposedly in a bid to lend some credence to their scheme.\n\nFigure 6. The section on copyright on the actual Instagram support site, to which the phishing site’s\n\nconfirmation page leads\n\nIf the user unwittingly hands over their real credentials, the cybercriminals proceed to\nchange the account’s password so that the original owner loses access to the account.\nThey then mine the account by downloading all images and messages either manually or\n\n\n-----\n\nthrough Instagram’s data backup feature. The hackers might even modify the account\nbio, share content via the stories feature, or reach out to the victim’s contacts.\n\nAt the same time, the hackers start to negotiate with the victim. They usually operate the\nhacked account while the victim talks with them using a different account. They then\ndemand payment in the form of bitcoin, prepaid credit cards, or vouchers in exchange\n[for the restoration of access. Based on the activity spotted in some of the bitcoin wallets](https://www.blockchain.com/btc/address/32nnJCbAmqJrMLaTT9L9ucgzbgdUQfge6L)\nrelated to this campaign, it seems that some targets might have paid up.\n\nHowever, the negotiation is merely a ruse. They do this only so that the victim will not be\ncompelled to report the incident via the proper channels, and so that they can buy some\ntime, as downloading all the data from the account can take up to two days. After the\nvictim pays up, the hackers will not give back the account. On the contrary, they will just\nask for more payment.\n\nOn many occasions, a single malicious actor is manually compromising several accounts\nat once. There are also cases where each malicious actor belonging to a group has a\ndesignated role in the campaign, such as the operator of the hack, the collector of\npayment, or the leader who oversees the operation.\n\nOf the stolen accounts that the hackers choose to keep, those with at least 50,000\nfollowers are used to keep the scams operational, while those with followers numbering\nbetween 10,000 and 20,000 are used as proof to show among peers that a hacker is part\nof the crew.\n\nSome hackers also sell their hacking know-how in the cybercriminal underground.\n\n## How cybercriminals lure potential victims with promises of a verified badge\n\nIn another version of the scam, hackers use a fake application form for an Instagram\nverified badge as a lure. The verified badge is a blue check mark that appears beside the\naccount names of most influencers, celebrities, brands, companies, and other popular\nentities on Instagram. The badge shows that Instagram has verified the account owner’s\nidentity and legitimacy.\n\n\n-----\n\nFigure 7. The verified badge as shown on Instagram’s official account\n\nTo bait a potential victim, the hackers pose as staff members of Instagram (under its\nparent company, Facebook) and reach out to the target account owner with a message\nthat, unsurprisingly, doesn’t address the account owner by name but instead opens with\na generic greeting. The message claims that the account owner can apply for a “blue\nbadge” (verified badge) by filling out an application form, which can be accessed through\na URL.\n\nFigure 8. A message from the hackers supposedly offering a target account owner the chance to apply\n\nfor a verified badge\n\nThe URL leads to a page that requests the potential victim’s username. As in the\npreviously discussed scheme, here the page also doesn’t verify whether the username is\nfrom an actual Instagram account.\n\n\n-----\n\nFigure 9. A phishing page that requests the target account owner’s username\n\nSelecting “Next” on the page leads to another page that requests the user’s password.\nThis supposedly logs the user into their own account. However, this doesn’t actually\nhappen and the page aims only to harvest the user’s password. The page likewise doesn’t\nverify whether the password is valid.\n\n\n-----\n\nFigure 10. A phishing page that requests the target account owner’s password\n\nSelecting “Login” leads to a “Blue Badge Form” that requests the user’s full name, email\naddress, and phone number. The form also shows the previously entered username.\n\n\n-----\n\nFigure 11. A phishing page that requests the target account owner’s full name, email address, and\n\npassword\n\nSelecting “Send” leads to a page that supposedly confirms for the user that their\napplication for a verified badge has been submitted.\n\n\n-----\n\nFigure 12. A fake confirmation page for the target account owner’s supposed application for a verified\n\nbadge\n\nSelecting “OK” leads to the section on copyright on the actual Instagram support site, as\nin the previously discussed scheme.\n\n[Interestingly, upon investigating the phishing URL through VirusTotal, we found out](https://www.virustotal.com/gui/domain/covidhelpservice.com/detection)\nthat the IP address used for the scheme is also linked to a URL that’s apparently related\nto a Covid-19 scam\n\nFigure 13. URLs related to the IP address linked to this scheme (Source: VirusTotal)\n\n## How cybercriminals abuse a hacked Instagram account\n\nHackers can exploit a stolen account in many ways, including:\n\n\n-----\n\nDemanding payment supposedly in exchange for account restoration. As\nmentioned earlier, the hackers can demand payment, after which they will\n(supposedly) give the account back to the owner.\n**Scamming the victim’s contacts. The hackers can assume the identity of the**\nvictim and reach out to the victim’s contacts to send phishing links or directly\nsolicit money.\n**Selling the account in illicit markets. Interested buyers can purchase the**\naccount to propagate their own scams or to push their propaganda.\n**Using the account for their operations. The hackers canchange the name of**\nthe account into something that resembles Instagram’s tech support and take\nadvantage of its huge following to convey credibility.\n**Asking for lewd photos or videos from the account owner. The hackers**\ncan demand obscene content from the victim. They can then use this content for\n[extortion, selling, or catfishing on online dating sites.](https://blogs.scientificamerican.com/anthropology-in-practice/catfishing-the-truth-about-deception-online/)\n**Brandishing the account as a trophy. The hackers can simply use the account**\nasproof of their success that they can show to their crew or to future victims.\n\n## How to keep accounts secure\n\nCybercriminals never run out of tricks for deceiving their targets. Fortunately, many\nplatforms are introducing more security features to safeguard users’ accounts. Instagram\n[for one has recently launched its Security Checkup feature, which guides users through a](https://about.instagram.com/blog/announcements/keeping-instagram-safe-and-secure)\nseries of steps that can help protect their accounts. These steps include reviewing login\nactivity, profile information, accounts that share login information, and recovery contact\ninformation.\n\nBesides efforts from the teams behind apps and websites, users can secure their\naccounts by following basic security recommendations.\n\n[Users are advised to set up two-factor or multifactor authentication. With this enabled,](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/online-privacy/how-to-set-up-2fa-layered-security-for-online-accounts)\nhackers would not be able to gain access to an account even if they have the password.\n[Instagram and many other sites have configurable settings for this.](https://help.instagram.com/566810106808145)\n\nUsers are also advised to never open links in emails and messages from unfamiliar\nsources, as these links may lead to phishing sites.\n\nUsers can check the affected service or website’s official support page for more\n[information in case of account hacking or deactivation.](https://help.instagram.com/149494825257596)\n\nUsers can also employ solutions for added layers of security. Trend Micro™ Cloud App\nSecurity enhances the security of Microsoft Office 365, Google Workspace, and other\ncloud services by detecting malicious URLs (such as phishing sites) hidden in the\n[contents and attachments of emails. Trend Micro™ Worry-Free™ Services prevents](https://www.trendmicro.com/en_us/small-business/worry-free-services-suites.html)\n\n\n-----\n\ncredential-phishing messages and other email threats from reaching the network by\n[employing machine learning and other techniques. Trend Micro Security offers](https://www.trendmicro.com/en_us/forHome/products.html)\nprotection for home users against email, file, and web threats on their devices.\n\n## Indicators of compromise\n\n**URL**\n\nhelpappealsupport[.]com\nigcreativeservice[.]com/5313646785/\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.07.12.NoFilter/%23NoFilter_%20Exposing%20the%20Tactics%20of%20Instagram%20Account%20Hackers.pdf"
    ],
    "report_names": [
        "#NoFilter_ Exposing the Tactics of Instagram Account Hackers"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041369,
    "ts_creation_date": 1646187871,
    "ts_modification_date": 1646187871,
    "files": {
        "pdf": "https://archive.orkl.eu/c8c216936ab67e42fe240e50ae1e0edb42c445c9.pdf",
        "text": "https://archive.orkl.eu/c8c216936ab67e42fe240e50ae1e0edb42c445c9.txt",
        "img": "https://archive.orkl.eu/c8c216936ab67e42fe240e50ae1e0edb42c445c9.jpg"
    }
}