{
    "id": "a4042543-e00b-4793-9afb-2197f8bff7ab",
    "created_at": "2023-01-12T15:06:05.73805Z",
    "updated_at": "2025-03-27T02:16:25.904258Z",
    "deleted_at": null,
    "sha1_hash": "11d0f884eb914d7dc497db3356b2050aa804be6e",
    "title": "2021-11-11 - Stopping Cybersecurity Threats- Why Databases Matter",
    "authors": "",
    "file_creation_date": "2022-05-28T00:23:50Z",
    "file_modification_date": "2022-05-28T00:23:50Z",
    "file_size": 1261899,
    "plain_text": "# Stopping Cybersecurity Threats: Why Databases Matter\n\n**[scylladb.com/2021/11/11/stopping-cybersecurity-threats-why-databases-matter/](https://www.scylladb.com/2021/11/11/stopping-cybersecurity-threats-why-databases-matter/)**\n\nNovember 11, 2021\n\nFrom intrusion detection, to threat analysis, to endpoint security, the effectiveness of\ncybersecurity efforts often boils down to how much data can be processed — in real time —\nwith the most advanced algorithms and models.\n\nMany factors are obviously involved in stopping cybersecurity threats effectively. However,\nthe databases responsible for processing the billions or trillions of events per day (from\n[millions of endpoints) play a particularly crucial role. High throughput and low latency directly](https://www.scylladb.com/glossary/low-latency-database/)\ncorrelate with better insights as well as more threats discovered and mitigated in near real\ntime. But cybersecurity data-intensive systems are incredibly complex; many span 4+ data\ncenters with database clusters exceeding 1000 nodes and petabytes of heterogeneous data\nunder active management.\n\nHow do expert engineers and architects at leading cybersecurity companies design,\nmanage, and evolve data architectures that are up to the task? Here’s a look at 3 specific\nexamples.\n\n## Accelerating real-time threat analysis by 1000% at FireEye\n\n### Cybersecurity use case\n\n\n-----\n\n[FireEye s Threat Intelligence application centralizes, organizes, and processes threat](https://www.fireeye.com/)\nintelligence data to support analysts. It does so by grouping threats using analytical\ncorrelation, and by processing and recording vast quantities of data, including DNS data,\nRSS feeds, domain names, and URLs. Using this array of billions of properties, FireEye’s\ncybersecurity analysts can explore trillions of questions to provide unparalleled visibility into\nthe threats that matter most.\n\n### Database challenge\n\n[Their legacy system used PostgreSQL with a custom graph database system to store and](https://en.wikipedia.org/wiki/PostgreSQL)\nfacilitate the analysis of threat intelligence data. As the team of analysts grew into the\nhundreds, system limitations emerged. The graph size grew to 500M nodes, with around\n1.5B edges connecting them. Each node had more than 100 associated properties\naccumulated over several years. The PostgreSQL-based system became slow, proved\ndifficult to scale, and was not distributed or highly available. FireEye needed to re-architect\ntheir system on a new technology base to serve the growing number of analysts and the\nbusinesses that rely on them.\n\n### Database strategy\n\n[To start, the team evaluated several graph databases and selected JanusGraph. FireEye’s](https://github.com/JanusGraph/janusgraph)\nfunctional criteria included traversing speed, full/free text search, and concurrent user\n[support. Non-functional criteria included requirements for high availability and disaster](https://www.scylladb.com/glossary/high-availability-database/)\nrecovery, plus a pluggable storage backend for flexibility. The team felt that JanusGraph met\nthese criteria well, and also appreciated its user-controllable indexing, schema management,\ntriggers, and OLAP capabilities for distributed graph processing.\n\nNext, they shifted focus to evaluating compatible backend storage solutions. With analysis\n[speed top of mind, they looked past Java-based options. FireEye selected ScyllaDB based](https://www.scylladb.com/product/)\non its raw performance and manageability. The FireEye team chose to run ScyllaDB\nthemselves within a secure enclave guarded by an NGINX gateway. Today, the ScyllaDB\nsolution is deployed on AWS i3.8xlarge instances in 7-node clusters. Each node is\nprovisioned with 32 CPUs, 244MB of memory, and 16TB SSD storage.\n\n\n-----\n\n_System architecture diagram – provided by FireEye_\n\n### Impact\n\nWith the new JanusGraph + ScyllaDB system, FireEye achieved a performance\nimprovement of 100X. For example, a query traversing 15,000 graph nodes now returns\nresults in 300ms (vs 30 seconds to 3 minutes).\n\n_Query execution comparison diagram – provided by FireEye_\n\n\n-----\n\nMoreover, they were able to dramatically slash the storage footprint while preserving the\n1000-2000% performance increase they had experienced by switching to ScyllaDB.\nUltimately, they reduced AWS spend to 10% of the original cost.\n\nWatch Video At:\n\nhttps://youtu.be/3CuOXfuORAg\n\n[Read more about the role of databases in FireEye’s cybersecurity efforts](https://www.scylladb.com/2020/02/04/fireeye-providing-real-time-threat-analysis-using-a-graph-database)\n\n## Scaling security from 1.5M to 100M devices at Lookout\n\n### Cybersecurity use case\n\n[Lookout leverages artificial intelligence to provide visibility and protection from network](https://www.lookout.com/)\nthreats, web-based threats, vulnerabilities, and other risks. To protect an enterprise’s mobile\ndevices, they ingest device telemetry and feed it across a network of services to identify\nrisks. Low-latency is key: if a user installs an app with malware and it takes minutes to\ndetect, that device’s information is already compromised.\n\n### Database challenge\n\nLookout needed to scale from supporting 1.5 million devices to 100 million devices without\nsubstantially increasing costs. This required ingesting more and more telemetry as it came\nin. They needed a highly scalable and fault-tolerant streaming framework that could process\ndevice telemetry messages and persist these messages into a scalable, fault-tolerant\npersistent store with support for operational queries.\n\n\n-----\n\n[Their existing solution involved Spark,](https://spark.apache.org/) [DynamoDB, and](https://aws.amazon.com/dynamodb/) [ElasticSearch. However, DynamoDB](https://www.elastic.co/)\nalone would cost them about $1M per month if they scaled it for 100M devices. Also,\nDynamoDB lacked the required level of sorting for time series data. With DynamoDB, they\nhad to use a query API that introduced a significant performance hit, impacting latency.\n\n### Database strategy\n\n[Lookout replaced Spark with Kafka and migrated from DynamoDB to ScyllaDB. Kafka](https://kafka.apache.org/)\nConnect servers send data from Kafka into ScyllaDB, then it’s pushed into ElasticSearch.\n\n_System architecture diagram – provided by Lookout_\n\nThey also discovered that Kafka’s default partitioner became less and less efficient with\nsharding as the number of partitions grew, so they replaced the default Kafka sharding\nfunction with a murmur3 hash and put it through a consistent hashing algorithm (jump hash)\nto get an even distribution across all partitions.\n\n### Impact\n\nLookout met its goal of growing from 1.5 million devices to 100 million devices while reining\nin costs. What would have cost them nearly $1M per month with DynamoDB cost them under\n$50K per month with ScyllaDB. They also achieved the low latency vital to effective threat\ndetection. Their message latency is currently in the milliseconds, on average.\n\n\n-----\n\nWatch Video At:\n\nhttps://youtu.be/VHIIjLMAT5s\n\n## Achieving database independence at ReversingLabs\n\n### Cybersecurity use case\n\n[ReversingLabs is a complete advanced malware analysis platform that speeds destructive](https://www.reversinglabs.com/)\nfile detection through automated static analysis — enabling analysts to prioritize the highest\nrisks with actionable detail in milliseconds. Their TitaniumCloud Reputation Services\nprovides powerful threat intelligence solutions with up-to-date threat classification and rich\ncontext on over 20B goodware and malware files.\n\n### Database challenge\n\nReversingLabs’ database stores the outcome of multiple analyses on billions of files so that\nend users can perform malware detection “in the wild”: immediately checking if a file they\nencounter is known to be safe or suspected to be malware. If the file’s status is unknown, it\nneeds to be analyzed then entered into the ReversingLabs database. 50+ APIs and\nspecialized feeds connect end users to that database.\n\n\n-----\n\n_System architecture diagram – provided by ReversingLabs_\n\nYears ago, ReversingLabs built their own highly available database for this application. It’s a\nkey-value store, based on the LSM Tree architecture. The database needed to insert/update\nand read large amounts of data with low latency and stable response times, and it achieved\nthose goals.\n\nHowever, as their business expanded, they wanted “database independence” to eliminate\ndependencies on the aging legacy database. They built a library that enabled them to\nconnect to other databases without modifying their application layer. But connecting OSS or\nCOTS solutions to meet their specialized needs wasn’t exactly a plug-and-play endeavor.\nFor example, they needed:\n\nKey-value native protobuf format\nLZ4 compression for reduced storage size\nLatency <2 ms\nSupport for record sizes tanging from 1K to 500M\n\n### Database strategy\n\nThe first test of their database independence strategy was adopting ScyllaDB, with an 8\nnode cluster, for their 2 large volumes APIs. They were able to meet their specialized needs\nby applying strategies like:\n\nUsing blobs for keys as well as values\nTuning the chunk size to improve compression 49%\nImproving performance by using NVMe disks in RAID 0 configuration and doing\ninserts/updates and reads at consistency level quorum\n\n\n-----\n\n### Impact\n\nReversingLabs successfully moved beyond their legacy database, with a highly available\nand scalable system that meets their specialized needs. Within the ScyllaDB database, file\nreputation queries had average writes latencies of <6 milliseconds and sub-millisecond\naverage reads. For p99 (long-tail) latencies, they achieved <12 millisecond writes, and <7\nmillisecond reads.\n\nIn end-to-end workflow testing (including and beyond the database), average latencies were\nless than 120 milliseconds, and p99 latencies were 166 milliseconds. This included the user\nrequest, authentication process, request validation, the round-trip time to query the\ndatabase, to format and then finally send the response to the application, scaled to 32\nworkers, all in parallel.\n\nWatch Video At:\n\nhttps://youtu.be/TJyThkl3-0s\n\n[Read more about the role of databases in ReversingLabs’ cybersecurity efforts](https://www.scylladb.com/2020/04/29/reversinglabs-serving-file-reputation-for-twenty-billion-files/)\n\n## Databases: what’s essential for cybersecurity\n\nTo wrap up, here’s a quick recap of the core database capabilities that have helped these\nand many other companies stop cybersecurity threats faster and more accurately:\n\nConsistent low-latency performance for real-time streaming analytics — to identify and\nprevent digital threats in real-time\nExtreme throughput and rapid scaling — to ingest billions of events across threat\nanalysis, malware protection, and intrusion detection\n\n\n-----\n\nLower total cost of ownership, reduced complexity, automated tuning, and DevOpsfriendly operational capabilities — to free resources for strategic cybersecurity projects\nThe ability to run at extremely high levels of utilization — to ensure consistent\nperformance and ultra-low latency without overprovisioning and waste\nCloud, on-premises, and a variety of hybrid topologies to support data distribution and\ngeographic replication — for high availability, resilience, and instant access to critical\ndata anywhere in the world\n\nWant advice on whether a database like ScyllaDB is a good fit for your environment and your\nuse case? [Chat with us or sign up for a free technical 1:1 consultation with one of our](https://www.scylladb.com/company/contact-us/#chat-now)\nsolution architects.\n\n[Schedule a technical consultation](https://www.scylladb.com/product/technical-consultation/)\n\n[JanusGraphelasticsearchDynamoDBApache Sparkcybersecurityintrusion](https://www.scylladb.com/tag/janusgraph/)\n[detectionPostgreSQLFireEyeLookoutReversingLabsApache Kafkathreat intelligencethreat](https://www.scylladb.com/tag/postgresql/)\nanalytics\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-11-11 - Stopping Cybersecurity Threats- Why Databases Matter.pdf"
    ],
    "report_names": [
        "2021-11-11 - Stopping Cybersecurity Threats- Why Databases Matter.pdf"
    ],
    "threat_actors": [
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535965,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653697430,
    "ts_modification_date": 1653697430,
    "files": {
        "pdf": "https://archive.orkl.eu/11d0f884eb914d7dc497db3356b2050aa804be6e.pdf",
        "text": "https://archive.orkl.eu/11d0f884eb914d7dc497db3356b2050aa804be6e.txt",
        "img": "https://archive.orkl.eu/11d0f884eb914d7dc497db3356b2050aa804be6e.jpg"
    }
}