{
    "id": "a48fb241-d179-426d-ad27-f65955060685",
    "created_at": "2023-01-12T15:02:55.447642Z",
    "updated_at": "2025-03-27T02:05:51.603201Z",
    "deleted_at": null,
    "sha1_hash": "f2128e73151bcddfdd904fb2ccc9b783657d2657",
    "title": "2021-02-28 - Finding Evil Go Packages",
    "authors": "",
    "file_creation_date": "2022-05-28T02:36:10Z",
    "file_modification_date": "2022-05-28T02:36:10Z",
    "file_size": 938241,
    "plain_text": "# Finding Evil Go Packages\n\n**michenriksen.com/blog/finding-evil-go-packages/**\n\nmichenriksen February 28, 2021\n\n[Home](https://michenriksen.com/)\n[Blog](https://michenriksen.com/blog)\n[Projects](https://michenriksen.com/projects)\n\nSunday, February 28, 2021 - 8 mins\n\n[Because of the big SolarWinds hack and the recent blog post describing a new Dependency](https://en.wikipedia.org/wiki/2020_United_States_federal_government_data_breach)\nConfusion attack, there has been a lot of talk lately about supply chain attacks, the sneaky\ntechnique of compromising less secure elements in a supply chain to compromise more\nsecure targets.\n\nA popular target for supply chain attacks has always been the many package management\nsystems for popular programming languages such as NPM for JavaScript, Rubygems for\nRuby, and PyPI for Python. These systems have been plagued for years by malicious actors\nuploading malicious packages and waiting for victims to install them.\n\nI haven’t heard much talk about how the situation looks for the Go ecosystem, and since Go\nis my new language of choice, I decided to do some investigation.\n\nThe novel [Dependency Confusion attack vector is luckily not something a Go developer has](https://medium.com/@alex.birsan/dependency-confusion-4a5d60fec610)\nto worry about since the source is always explicitly specified when importing a package, so\nwhen Go fetches the external dependency, it can’t be confused about where to fetch it:\n```\nimport \"github.com/stretchr/testify\"\n\n```\n[There is however still a possible attack vector via simple typosquatting where the attacker](https://en.wikipedia.org/wiki/Typosquatting)\nexploits the fact that people often hit the wrong keys when typing on their keyboard. This\ncould both be done on the host domain where the attacker registers a common typo of\n\n\n-----\n\ngithub.com, but even easier would be to simply register a new user on GitHub, or any other\nopen package host, with a common typo of the package owner’s username.\n\nWith this in mind, I set out to build a tool that would help me uncover potential typosquat\npackages in the wild:\n\n1. Take a large list of Go package import paths (e.g. `github.com/stretchr/testify )`\n2. Permutate the username of every unique package owner to get a list of potential\n\ntyposquats\n3. Check if any of the typosquat users exists on the platform\n4. If a potential typosquat user is found, retrieve all of their repositories\n5. Log any of the repositories that have a name equal to the original packages being\n\nchecked\n\nThis resulted in a new tool I call `pkgtwist which is available on GitLab (the name is`\n[inspired by the awesome dnstwist tool) if you are interested in doing your own evil Go](https://github.com/elceef/dnstwist)\npackage hunting.\n\n## Permutations\n\nProbably the most important part of `pkgtwist was the generation of good username`\npermutations in order to have the best chance of detecting typosquats. A bit of research led\nme to [zntrio/typogenerater which looked like the perfect package for generating potential](https://github.com/zntrio/typogenerator)\nusername typos. The package implements a pretty long list of permutation strategies that I\npicked a few from so that pkgtwist only spends time on checking what I feel are the most\nlikely typosquats:\n\n**Omission: removal of a single character (missing a keypress,** `stretchr =>`\n```\n   strechr )\n\n```\n**Repetition: repetition of characters (pressing a key twice,** `gobuffalo =>`\n```\n   gobuffallo )\n\n```\n**[Bitsquatting: possible bit-flip errors ( stretchr =>](https://en.wikipedia.org/wiki/Bitsquatting)** `strftchr )`\n**Transposition: swapping of adjacent characters (pressing keys in the wrong order,**\n```\n   stretchr => strethcr )\n\n```\nThis means that if pkgtwist is given the package `github.com/stretchr/testify as input,`\nit will check if any of the of following users exist on GitHub, and if they do, check if they have\nalso have a repository called `testify :`\n\n\n-----\n\n```\nsttetchr stuetchr strdtchr strgtchr strftchr stratchr strctchr\nstrbtchr streuchr strevchr strewchr strepchr streqchr strerchr\nstreschr stretbhr stretahr stretghr stretfhr stretehr stretdhr\nstretcir stretcjr stretckr stretclr stretcmr stretcnr stretcor\nstretchs stretchp stretchq stretchv stretchw stretcht stretchu\ntsretchr srtetchr stertchr strtechr strecthr strethcr stretcrh\n\n## Subjects\n\n```\nNext up was to find a list of packages to check. Initially, I thought about finding some sort of\n“Top X Go packages” list, but I couldn’t really find a good resource for that, so I ended up\nrunning pkgtwist against every github.com and gitlab.com hosted packages from the Go\nModule Index (731 packages in all).\n\n## Results\n\npkgtwist running in verbose mode.\nAfter several hours of crunching through the 731 packages, pkgtwist finished with a list of 7\npotential typosquat packages to investigate further. I honestly expected the list to be bigger,\nbut I was of course happy to see that the Go ecosystem isn’t completely infested (yet) with\nmalicious typosquat packages.\n\nThere were however a couple of typosquat packages that jumped out at me…\n\n\n-----\n\n### github.com/siruspen/logrus ⚠\n\nThe [logrus package by](https://github.com/sirupsen/logrus/) [sirupsen is a very popular logging package (17.3k stars on GitHub)](https://github.com/sirupsen)\nthat many Go projects use, which obviously makes it a target for a typosquat supply chain\nattack. So when I saw that the user `siruspen (notice the letter swapping) had a similarly`\nnamed repository, I quickly checked out what it was doing.\n\nIt turns out that the project is a fork of the original `logrus repository, so doing a`\ncomparison to find the differences was pretty easy. At the time of writing, the only thing that\nis added to the potential typosquat repository, [is a small init function with a single](https://github.com/sirupsen/logrus/compare/master...siruspen:master#diff-ff87b7c4777a35588053a509583d66c9f404ccbea9e1c71d2a5f224d7ad1323eR13-R16) `Println`\ncall:\n\nComparing siruspen/logrus with the original repository.\nWhile this is not malicious in any way it could very quickly be changed by the owner in the\nfuture, so I will definitely keep an eye on this repository. I would also recommend doublechecking your projects if you use `logrus to make sure you’re not using this package`\ninstead of the real one!\n\n### github.com/utfave/cli ⚠\n\n[urfave/cli is another popular Go package (15.4k stars on GitHub) for building CLI projects. So](https://github.com/urfave/cli)\nwhen I saw the user `utfave also had a repository called` `cli, my alarm bells went off and`\nI investigated further.\n\nIt turns out that the [second-last commit introduces a highly suspicious](https://github.com/utfave/cli/commit/4af15496c49f613503d37d43b99df767f831bae1#diff-8d9ca23280f24fe6444d03ae46e7a15dd152170f32f57f978dfbdfd3cfe8ff55L26-R36) `init function:`\n\n\n-----\n\nOhai there, 122.51.124.140...\nIt looks like the author `utfave wants to know the hostname, operating system, and`\narchitecture of all the machines using their version of `urfave/cli . The function extracts`\nthe system information and then calls out to the IP address `122.51.124.140 belonging to`\nthe Chinese company Shenzhen Tencent Computer Systems via HTTP with the system\ninformation added as URL parameters.\n\nWhile this code won’t give them any access to systems, it’s highly suspicious that they collect\nthis information and the actor can quickly change this code to call back with a reverse shell if\nthey identify a system to be valuable or interesting.\n\nI reported this repository to GitHub and hope to see it taken down in the near future. Until\nthen, I recommend double-checking your projects if you use the `urfave/cli to make sure`\nyou’re not using the typosquatted version.\n\n## Conclusion\n\nWhile my little research project didn’t cover every single Go package out there, I feel it\ncovered enough to give a rough picture of what the supply chain attack situation looks like for\nthe Go ecosystem. The two repositories `siruspen/logrus and` `utfave/cli, were the`\nonly ones out of the 7 flagged repos that really worried me, but I will keep a close eye on the\nrest as they could in theory become malicious at any time.\n\nI think Go is in a better situation than other programming languages because the source of\npackages is always explicitly written every time they are used, but code editor automation\ncould make typosquat attacks more likely to happen as the developer doesn’t write the\n[import paths manually as often. As an example, if the popular Go extension for](https://marketplace.visualstudio.com/items?itemName=golang.Go) [VS Code is](https://code.visualstudio.com/)\ninstalled, a developer will typically only type a package import on the first usage, and then\nthe editor will automatically add the import in any other files as soon as the package name is\nused. If the developer mistypes the import path the first time, a malicious package could be\nintroduced and live for a long time in a Go project before it’s discovered.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-28 - Finding Evil Go Packages.pdf"
    ],
    "report_names": [
        "2021-02-28 - Finding Evil Go Packages.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535775,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653705370,
    "ts_modification_date": 1653705370,
    "files": {
        "pdf": "https://archive.orkl.eu/f2128e73151bcddfdd904fb2ccc9b783657d2657.pdf",
        "text": "https://archive.orkl.eu/f2128e73151bcddfdd904fb2ccc9b783657d2657.txt",
        "img": "https://archive.orkl.eu/f2128e73151bcddfdd904fb2ccc9b783657d2657.jpg"
    }
}