{
    "id": "a4a13215-540f-47d0-834b-bd7836c1330e",
    "created_at": "2023-01-12T15:05:01.739631Z",
    "updated_at": "2025-03-27T02:08:41.496703Z",
    "deleted_at": null,
    "sha1_hash": "347eebb91b144d02e89a8a82a01972d20a718dbd",
    "title": "2021-05-12 - Executive Order on Improving the Nation’s Cybersecurity",
    "authors": "",
    "file_creation_date": "2022-05-27T02:11:53Z",
    "file_modification_date": "2022-05-27T02:11:53Z",
    "file_size": 590743,
    "plain_text": "## Executive Order on Improving the Nation’s Cybersecurity\n\n**[whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/](https://www.whitehouse.gov/briefing-room/presidential-actions/2021/05/12/executive-order-on-improving-the-nations-cybersecurity/)**\n\nMay 12, 2021\n\n[Briefing Room](https://www.whitehouse.gov/briefing-room/)\n\n - [Presidential Actions](https://www.whitehouse.gov/briefing-room/presidential-actions/)\n\nBy the authority vested in me as President by the Constitution and the laws of the United\nStates of America, it is hereby ordered as follows:\n\nSection 1. Policy. The United States faces persistent and increasingly sophisticated\nmalicious cyber campaigns that threaten the public sector, the private sector, and ultimately\nthe American people’s security and privacy. The Federal Government must improve its\nefforts to identify, deter, protect against, detect, and respond to these actions and actors.\nThe Federal Government must also carefully examine what occurred during any major cyber\nincident and apply lessons learned. But cybersecurity requires more than government\naction. Protecting our Nation from malicious cyber actors requires the Federal Government\nto partner with the private sector. The private sector must adapt to the continuously\nchanging threat environment, ensure its products are built and operate securely, and partner\nwith the Federal Government to foster a more secure cyberspace. In the end, the trust we\nplace in our digital infrastructure should be proportional to how trustworthy and transparent\nthat infrastructure is, and to the consequences we will incur if that trust is misplaced.\n\n\n-----\n\nIncremental improvements will not give us the security we need; instead, the Federal\nGovernment needs to make bold changes and significant investments in order to defend the\nvital institutions that underpin the American way of life. The Federal Government must bring\nto bear the full scope of its authorities and resources to protect and secure its computer\nsystems, whether they are cloud-based, on-premises, or hybrid. The scope of protection and\nsecurity must include systems that process data (information technology (IT)) and those that\nrun the vital machinery that ensures our safety (operational technology (OT)).\n\nIt is the policy of my Administration that the prevention, detection, assessment, and\nremediation of cyber incidents is a top priority and essential to national and economic\nsecurity. The Federal Government must lead by example. All Federal Information Systems\nshould meet or exceed the standards and requirements for cybersecurity set forth in and\nissued pursuant to this order.\nSec. 2. Removing Barriers to Sharing Threat Information.\n(a) The Federal Government contracts with IT and OT service providers to conduct an\narray of day-to-day functions on Federal Information Systems. These service providers,\nincluding cloud service providers, have unique access to and insight into cyber threat and\nincident information on Federal Information Systems. At the same time, current contract\nterms or restrictions may limit the sharing of such threat or incident information with\nexecutive departments and agencies (agencies) that are responsible for investigating or\nremediating cyber incidents, such as the Cybersecurity and Infrastructure Security Agency\n(CISA), the Federal Bureau of Investigation (FBI), and other elements of the Intelligence\nCommunity (IC). Removing these contractual barriers and increasing the sharing of\ninformation about such threats, incidents, and risks are necessary steps to accelerating\nincident deterrence, prevention, and response efforts and to enabling more effective defense\nof agencies’ systems and of information collected, processed, and maintained by or for\nthe Federal Government.\n(b) Within 60 days of the date of this order, the Director of the Office of Management and\nBudget (OMB), in consultation with the Secretary of Defense, the Attorney General, the\nSecretary of Homeland Security, and the Director of National Intelligence, shall review the\nFederal Acquisition Regulation (FAR) and the Defense Federal Acquisition Regulation\nSupplement contract requirements and language for contracting with IT and OT service\nproviders and recommend updates to such requirements and language to the FAR Council\nand other appropriate agencies. The recommendations shall include descriptions of\ncontractors to be covered by the proposed contract language.\n(c) The recommended contract language and requirements described in subsection (b) of\nthis section shall be designed to ensure that:\n(i)  service providers collect and preserve data, information, and reporting relevant to\ncybersecurity event prevention, detection, response, and investigation on all information\nsystems over which they have control, including systems operated on behalf of agencies,\nconsistent with agencies’ requirements;\n(ii)  service providers share such data, information, and reporting, as they relate to\ncyber incidents or potential incidents relevant to any agency with which they have\n\n\n-----\n\ncontracted, directly with such agency and any other agency that the Director of OMB, in\nconsultation with the Secretary of Defense, the Attorney General, the Secretary of Homeland\nSecurity, and the Director of National Intelligence, deems appropriate, consistent with\napplicable privacy laws, regulations, and policies;\n(iii) service providers collaborate with Federal cybersecurity or investigative agencies\nin their investigations of and responses to incidents or potential incidents on Federal\nInformation Systems, including by implementing technical capabilities, such as monitoring\nnetworks for threats in collaboration with agencies they support, as needed; and\n(iv)  service providers share cyber threat and incident information with agencies, doing\nso, where possible, in industry-recognized formats for incident response and remediation.\n(d) Within 90 days of receipt of the recommendations described in subsection (b) of this\nsection, the FAR Council shall review the proposed contract language and conditions and, as\nappropriate, shall publish for public comment proposed updates to the FAR.\n(e) Within 120 days of the date of this order, the Secretary of Homeland Security and the\nDirector of OMB shall take appropriate steps to ensure to the greatest extent possible that\nservice providers share data with agencies, CISA, and the FBI as may be necessary for the\nFederal Government to respond to cyber threats, incidents, and risks.\n(f) It is the policy of the Federal Government that:\n(i)  information and communications technology (ICT) service providers entering into\ncontracts with agencies must promptly report to such agencies when they discover a cyber\nincident involving a software product or service provided to such agencies or involving a\nsupport system for a software product or service provided to such agencies;\n(ii)  ICT service providers must also directly report to CISA whenever they report\nunder subsection (f)(i) of this section to Federal Civilian Executive Branch (FCEB) Agencies,\nand CISA must centrally collect and manage such information; and\n(iii) reports pertaining to National Security Systems, as defined in section 10(h) of this\norder, must be received and managed by the appropriate agency as to be determined under\nsubsection (g)(i)(E) of this section.\n(g) To implement the policy set forth in subsection (f) of this section:\n(i) Within 45 days of the date of this order, the Secretary of Homeland Security, in\nconsultation with the Secretary of Defense acting through the Director of the National\nSecurity Agency (NSA), the Attorney General, and the Director of OMB, shall recommend to\nthe FAR Council contract language that identifies:\n(A) the nature of cyber incidents that require reporting;\n(B) the types of information regarding cyber incidents that require reporting to\nfacilitate effective cyber incident response and remediation;\n(C) appropriate and effective protections for privacy and civil liberties;\n(D) the time periods within which contractors must report cyber incidents based on\na graduated scale of severity, with reporting on the most severe cyber incidents not to\nexceed 3 days after initial detection;\n(E) National Security Systems reporting requirements; and\n(F) the type of contractors and associated service providers to be covered by the\n\n\n-----\n\nproposed contract language.\n(ii)  Within 90 days of receipt of the recommendations described in subsection (g)(i) of\nthis section, the FAR Council shall review the recommendations and publish for public\ncomment proposed updates to the FAR.\n(iii) Within 90 days of the date of this order, the Secretary of Defense acting through\nthe Director of the NSA, the Attorney General, the Secretary of Homeland Security, and the\nDirector of National Intelligence shall jointly develop procedures for ensuring that cyber\nincident reports are promptly and appropriately shared among agencies.\n(h) Current cybersecurity requirements for unclassified system contracts are largely\nimplemented through agency-specific policies and regulations, including cloud-service\ncybersecurity requirements. Standardizing common cybersecurity contractual requirements\nacross agencies will streamline and improve compliance for vendors and the Federal\nGovernment.\n(i) Within 60 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA, in consultation with the Secretary of Defense acting through\nthe Director of the NSA, the Director of OMB, and the Administrator of General Services,\nshall review agency-specific cybersecurity requirements that currently exist as a matter of\nlaw, policy, or contract and recommend to the FAR Council standardized contract language\nfor appropriate cybersecurity requirements. Such recommendations shall include\nconsideration of the scope of contractors and associated service providers to be covered by\nthe proposed contract language.\n(j) Within 60 days of receiving the recommended contract language developed pursuant\nto subsection (i) of this section, the FAR Council shall review the recommended contract\nlanguage and publish for public comment proposed updates to the FAR.\n(k) Following any updates to the FAR made by the FAR Council after the public comment\nperiod described in subsection (j) of this section, agencies shall update their agency-specific\ncybersecurity requirements to remove any requirements that are duplicative of such FAR\nupdates.\n(l) The Director of OMB shall incorporate into the annual budget process a cost analysis\nof all recommendations developed under this section.\n\nSec. 3. Modernizing Federal Government Cybersecurity.\n(a) To keep pace with today’s dynamic and increasingly sophisticated cyber threat\nenvironment, the Federal Government must take decisive steps to modernize its approach to\ncybersecurity, including by increasing the Federal Government’s visibility into threats, while\nprotecting privacy and civil liberties. The Federal Government must adopt security best\npractices; advance toward Zero Trust Architecture; accelerate movement to secure cloud\nservices, including Software as a Service (SaaS), Infrastructure as a Service (IaaS), and\nPlatform as a Service (PaaS); centralize and streamline access to cybersecurity data to drive\nanalytics for identifying and managing cybersecurity risks; and invest in both technology and\npersonnel to match these modernization goals.\n(b) Within 60 days of the date of this order, the head of each agency shall:\n\n(i) update existing agency plans to prioritize resources for the adoption and use of\n\n\n-----\n\ncloud technology as outlined in relevant OMB guidance;\n(ii)  develop a plan to implement Zero Trust Architecture, which shall incorporate, as\nappropriate, the migration steps that the National Institute of Standards and Technology\n(NIST) within the Department of Commerce has outlined in standards and guidance,\ndescribe any such steps that have already been completed, identify activities that will have\nthe most immediate security impact, and include a schedule to implement them; and\n(iii) provide a report to the Director of OMB and the Assistant to the President and\nNational Security Advisor (APNSA) discussing the plans required pursuant to subsection (b)\n(i) and (ii) of this section.\n(c) As agencies continue to use cloud technology, they shall do so in a coordinated,\ndeliberate way that allows the Federal Government to prevent, detect, assess, and\nremediate cyber incidents. To facilitate this approach, the migration to cloud technology shall\nadopt Zero Trust Architecture, as practicable. The CISA shall modernize its current\ncybersecurity programs, services, and capabilities to be fully functional with cloud-computing\nenvironments with Zero Trust Architecture. The Secretary of Homeland Security acting\nthrough the Director of CISA, in consultation with the Administrator of General Services\nacting through the Federal Risk and Authorization Management Program (FedRAMP) within\nthe General Services Administration, shall develop security principles governing Cloud\nService Providers (CSPs) for incorporation into agency modernization efforts. To facilitate\nthis work:\n(i)  Within 90 days of the date of this order, the Director of OMB, in consultation with\nthe Secretary of Homeland Security acting through the Director of CISA, and the\nAdministrator of General Services acting through FedRAMP, shall develop a Federal cloudsecurity strategy and provide guidance to agencies accordingly. Such guidance shall seek to\nensure that risks to the FCEB from using cloud-based services are broadly understood and\neffectively addressed, and that FCEB Agencies move closer to Zero Trust Architecture.\n(ii)  Within 90 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA, in consultation with the Director of OMB and the Administrator\nof General Services acting through FedRAMP, shall develop and issue, for the FCEB, cloudsecurity technical reference architecture documentation that illustrates recommended\napproaches to cloud migration and data protection for agency data collection and reporting.\n(iii) Within 60 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA shall develop and issue, for FCEB Agencies, a cloud-service\ngovernance framework. That framework shall identify a range of services and protections\navailable to agencies based on incident severity. That framework shall also identify data\nand processing activities associated with those services and protections.\n(iv)  Within 90 days of the date of this order, the heads of FCEB Agencies, in\nconsultation with the Secretary of Homeland Security acting through the Director of CISA,\nshall evaluate the types and sensitivity of their respective agency’s unclassified data, and\nshall provide to the Secretary of Homeland Security through the Director of CISA and to the\nDirector of OMB a report based on such evaluation. The evaluation shall prioritize\nidentification of the unclassified data considered by the agency to be the most sensitive and\n\n\n-----\n\nunder the greatest threat, and appropriate processing and storage solutions for those data.\n(d) Within 180 days of the date of this order, agencies shall adopt multi-factor\nauthentication and encryption for data at rest and in transit, to the maximum extent\nconsistent with Federal records laws and other applicable laws. To that end:\n(i)  Heads of FCEB Agencies shall provide reports to the Secretary of Homeland\nSecurity through the Director of CISA, the Director of OMB, and the APNSA on their\nrespective agency’s progress in adopting multifactor authentication and encryption of data at\nrest and in transit. Such agencies shall provide such reports every 60 days after the date of\nthis order until the agency has fully adopted, agency-wide, multi-factor authentication and\ndata encryption.\n(ii)  Based on identified gaps in agency implementation, CISA shall take all\nappropriate steps to maximize adoption by FCEB Agencies of technologies and processes to\nimplement multifactor authentication and encryption for data at rest and in transit.\n(iii) Heads of FCEB Agencies that are unable to fully adopt multi-factor authentication\nand data encryption within 180 days of the date of this order shall, at the end of the 180-day\nperiod, provide a written rationale to the Secretary of Homeland Security through the Director\nof CISA, the Director of OMB, and the APNSA.\n(e) Within 90 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA, in consultation with the Attorney General, the Director of the\nFBI, and the Administrator of General Services acting through the Director of FedRAMP,\nshall establish a framework to collaborate on cybersecurity and incident response activities\nrelated to FCEB cloud technology, in order to ensure effective information sharing among\nagencies and between agencies and CSPs.\n(f) Within 60 days of the date of this order, the Administrator of General Services, in\nconsultation with the Director of OMB and the heads of other agencies as the Administrator\nof General Services deems appropriate, shall begin modernizing FedRAMP by:\n(i)  establishing a training program to ensure agencies are effectively trained and\nequipped to manage FedRAMP requests, and providing access to training materials,\nincluding videos-on-demand;\n(ii)  improving communication with CSPs through automation and standardization of\nmessages at each stage of authorization. These communications may include status\nupdates, requirements to complete a vendor’s current stage, next steps, and points of\ncontact for questions;\n(iii) incorporating automation throughout the lifecycle of FedRAMP, including\nassessment, authorization, continuous monitoring, and compliance;\n(iv)  digitizing and streamlining documentation that vendors are required to complete,\nincluding through online accessibility and pre-populated forms; and\n(v)  identifying relevant compliance frameworks, mapping those frameworks onto\nrequirements in the FedRAMP authorization process, and allowing those frameworks to be\nused as a substitute for the relevant portion of the authorization process, as appropriate.\n\nSec. 4. Enhancing Software Supply Chain Security.\n\n(a) The security of software used by the Federal Government is vital to the Federal\n\n\n-----\n\nGovernment s ability to perform its critical functions. The development of commercial\nsoftware often lacks transparency, sufficient focus on the ability of the software to resist\nattack, and adequate controls to prevent tampering by malicious actors. There is a pressing\nneed to implement more rigorous and predictable mechanisms for ensuring that products\nfunction securely, and as intended. The security and integrity of “critical software” —\nsoftware that performs functions critical to trust (such as affording or requiring elevated\nsystem privileges or direct access to networking and computing resources) — is a particular\nconcern. Accordingly, the Federal Government must take action to rapidly improve the\nsecurity and integrity of the software supply chain, with a priority on addressing critical\nsoftware.\n(b) Within 30 days of the date of this order, the Secretary of Commerce acting through\nthe Director of NIST shall solicit input from the Federal Government, private sector,\nacademia, and other appropriate actors to identify existing or develop new standards, tools,\nand best practices for complying with the standards, procedures, or criteria in subsection (e)\nof this section. The guidelines shall include criteria that can be used to evaluate software\nsecurity, include criteria to evaluate the security practices of the developers and suppliers\nthemselves, and identify innovative tools or methods to demonstrate conformance with\nsecure practices.\n(c) Within 180 days of the date of this order, the Director of NIST shall publish preliminary\nguidelines, based on the consultations described in subsection (b) of this section and\ndrawing on existing documents as practicable, for enhancing software supply chain security\nand meeting the requirements of this section.\n(d) Within 360 days of the date of this order, the Director of NIST shall publish additional\nguidelines that include procedures for periodic review and updating of the guidelines\ndescribed in subsection (c) of this section.\n(e) Within 90 days of publication of the preliminary guidelines pursuant to subsection (c)\nof this section, the Secretary of Commerce acting through the Director of NIST, in\nconsultation with the heads of such agencies as the Director of NIST deems appropriate,\nshall issue guidance identifying practices that enhance the security of the software supply\nchain. Such guidance may incorporate the guidelines published pursuant to subsections (c)\nand (i) of this section. Such guidance shall include standards, procedures, or criteria\nregarding:\n(i)   secure software development environments, including such actions as:\n(A) using administratively separate build environments;\n(B) auditing trust relationships;\n(C) establishing multi-factor, risk-based authentication and conditional access\nacross the enterprise;\n(D) documenting and minimizing dependencies on enterprise products that are part\nof the environments used to develop, build, and edit software;\n(E) employing encryption for data; and\n(F) monitoring operations and alerts and responding to attempted and actual cyber\nincidents;\n\n\n-----\n\n(ii)  generating and, when requested by a purchaser, providing artifacts that\ndemonstrate conformance to the processes set forth in subsection (e)(i) of this section;\n(iii)  employing automated tools, or comparable processes, to maintain trusted source\ncode supply chains, thereby ensuring the integrity of the code;\n(iv)  employing automated tools, or comparable processes, that check for known and\npotential vulnerabilities and remediate them, which shall operate regularly, or at a minimum\nprior to product, version, or update release;\n(v)   providing, when requested by a purchaser, artifacts of the execution of the tools\nand processes described in subsection (e)(iii) and (iv) of this section, and making publicly\navailable summary information on completion of these actions, to include a summary\ndescription of the risks assessed and mitigated;\n(vi)  maintaining accurate and up-to-date data, provenance (i.e., origin) of software\ncode or components, and controls on internal and third-party software components, tools,\nand services present in software development processes, and performing audits and\nenforcement of these controls on a recurring basis;\n(vii)  providing a purchaser a Software Bill of Materials (SBOM) for each product\ndirectly or by publishing it on a public website;\n(viii) participating in a vulnerability disclosure program that includes a reporting and\ndisclosure process;\n(ix)  attesting to conformity with secure software development practices; and\n(x)   ensuring and attesting, to the extent practicable, to the integrity and provenance\nof open source software used within any portion of a product.\n(f) Within 60 days of the date of this order, the Secretary of Commerce, in coordination\nwith the Assistant Secretary for Communications and Information and the Administrator of\nthe National Telecommunications and Information Administration, shall publish minimum\nelements for an SBOM.\n(g) Within 45 days of the date of this order, the Secretary of Commerce, acting through\nthe Director of NIST, in consultation with the Secretary of Defense acting through the Director\nof the NSA, the Secretary of Homeland Security acting through the Director of CISA, the\nDirector of OMB, and the Director of National Intelligence, shall publish a definition of the\nterm “critical software” for inclusion in the guidance issued pursuant to subsection (e) of this\nsection. That definition shall reflect the level of privilege or access required to function,\nintegration and dependencies with other software, direct access to networking and\ncomputing resources, performance of a function critical to trust, and potential for harm if\ncompromised.\n(h) Within 30 days of the publication of the definition required by subsection (g) of this\nsection, the Secretary of Homeland Security acting through the Director of CISA, in\nconsultation with the Secretary of Commerce acting through the Director of NIST, shall\nidentify and make available to agencies a list of categories of software and software products\nin use or in the acquisition process meeting the definition of critical software issued pursuant\nto subsection (g) of this section.\n(i) Within 60 days of the date of this order, the Secretary of Commerce acting through the\n\n\n-----\n\nDirector of NIST, in consultation with the Secretary of Homeland Security acting through the\nDirector of CISA and with the Director of OMB, shall publish guidance outlining security\nmeasures for critical software as defined in subsection (g) of this section, including applying\npractices of least privilege, network segmentation, and proper configuration.\n(j) Within 30 days of the issuance of the guidance described in subsection (i) of this\nsection, the Director of OMB acting through the Administrator of the Office of Electronic\nGovernment within OMB shall take appropriate steps to require that agencies comply with\nsuch guidance.\n(k) Within 30 days of issuance of the guidance described in subsection (e) of this section,\nthe Director of OMB acting through the Administrator of the Office of Electronic Government\nwithin OMB shall take appropriate steps to require that agencies comply with such guidelines\nwith respect to software procured after the date of this order.\n(l) Agencies may request an extension for complying with any requirements issued\npursuant to subsection (k) of this section. Any such request shall be considered by the\nDirector of OMB on a case-by-case basis, and only if accompanied by a plan for meeting the\nunderlying requirements. The Director of OMB shall on a quarterly basis provide a report to\nthe APNSA identifying and explaining all extensions granted.\n(m) Agencies may request a waiver as to any requirements issued pursuant to\nsubsection (k) of this section. Waivers shall be considered by the Director of OMB, in\nconsultation with the APNSA, on a case-by-case basis, and shall be granted only in\nexceptional circumstances and for limited duration, and only if there is an accompanying plan\nfor mitigating any potential risks.\n(n) Within 1 year of the date of this order, the Secretary of Homeland Security, in\nconsultation with the Secretary of Defense, the Attorney General, the Director of OMB, and\nthe Administrator of the Office of Electronic Government within OMB, shall recommend to the\nFAR Council contract language requiring suppliers of software available for purchase by\nagencies to comply with, and attest to complying with, any requirements issued pursuant to\nsubsections (g) through (k) of this section.\n(o) After receiving the recommendations described in subsection (n) of this section, the\nFAR Council shall review the recommendations and, as appropriate and consistent with\napplicable law, amend the FAR.\n(p) Following the issuance of any final rule amending the FAR as described in subsection\n(o) of this section, agencies shall, as appropriate and consistent with applicable law, remove\nsoftware products that do not meet the requirements of the amended FAR from all indefinite\ndelivery indefinite quantity contracts; Federal Supply Schedules; Federal Government-wide\nAcquisition Contracts; Blanket Purchase Agreements; and Multiple Award Contracts.\n(q) The Director of OMB, acting through the Administrator of the Office of Electronic\nGovernment within OMB, shall require agencies employing software developed and\nprocured prior to the date of this order (legacy software) either to comply with any\nrequirements issued pursuant to subsection (k) of this section or to provide a plan outlining\nactions to remediate or meet those requirements, and shall further require agencies seeking\nrenewals of software contracts, including legacy software, to comply with any requirements\n\n\n-----\n\nissued pursuant to subsection (k) of this section, unless an extension or waiver is granted in\naccordance with subsection (l) or (m) of this section.\n(r) Within 60 days of the date of this order, the Secretary of Commerce acting through the\nDirector of NIST, in consultation with the Secretary of Defense acting through the Director of\nthe NSA, shall publish guidelines recommending minimum standards for vendors’ testing of\ntheir software source code, including identifying recommended types of manual or\nautomated testing (such as code review tools, static and dynamic analysis, software\ncomposition tools, and penetration testing).\n(s) The Secretary of Commerce acting through the Director of NIST, in coordination with\nrepresentatives of other agencies as the Director of NIST deems appropriate, shall initiate\npilot programs informed by existing consumer product labeling programs to educate the\npublic on the security capabilities of Internet-of-Things (IoT) devices and software\ndevelopment practices, and shall consider ways to incentivize manufacturers and developers\nto participate in these programs.\n(t) Within 270 days of the date of this order, the Secretary of Commerce acting through\nthe Director of NIST, in coordination with the Chair of the Federal Trade Commission (FTC)\nand representatives of other agencies as the Director of NIST deems appropriate, shall\nidentify IoT cybersecurity criteria for a consumer labeling program, and shall consider\nwhether such a consumer labeling program may be operated in conjunction with or modeled\nafter any similar existing government programs consistent with applicable law. The criteria\nshall reflect increasingly comprehensive levels of testing and assessment that a product may\nhave undergone, and shall use or be compatible with existing labeling schemes that\nmanufacturers use to inform consumers about the security of their products. The Director of\nNIST shall examine all relevant information, labeling, and incentive programs and employ\nbest practices. This review shall focus on ease of use for consumers and a determination of\nwhat measures can be taken to maximize manufacturer participation.\n(u) Within 270 days of the date of this order, the Secretary of Commerce acting through\nthe Director of NIST, in coordination with the Chair of the FTC and representatives from other\nagencies as the Director of NIST deems appropriate, shall identify secure software\ndevelopment practices or criteria for a consumer software labeling program, and shall\nconsider whether such a consumer software labeling program may be operated in\nconjunction with or modeled after any similar existing government programs, consistent with\napplicable law. The criteria shall reflect a baseline level of secure practices, and if\npracticable, shall reflect increasingly comprehensive levels of testing and assessment that a\nproduct may have undergone. The Director of NIST shall examine all relevant information,\nlabeling, and incentive programs, employ best practices, and identify, modify, or develop\na recommended label or, if practicable, a tiered software security rating system. This review\nshall focus on ease of use for consumers and a determination of what measures can be\ntaken to maximize participation.\n(v) These pilot programs shall be conducted in a manner consistent with OMB Circular A119 and NIST Special Publication 2000-02 (Conformity Assessment Considerations for\nFederal Agencies).\n\n\n-----\n\n(w) Within 1 year of the date of this order, the Director of NIST shall conduct a review of\nthe pilot programs, consult with the private sector and relevant agencies to assess the\neffectiveness of the programs, determine what improvements can be made going forward,\nand submit a summary report to the APNSA.\n(x) Within 1 year of the date of this order, the Secretary of Commerce, in consultation\nwith the heads of other agencies as the Secretary of Commerce deems appropriate, shall\nprovide to the President, through the APNSA, a report that reviews the progress made under\nthis section and outlines additional steps needed to secure the software supply chain.\nSec. 5. Establishing a Cyber Safety Review Board.\n(a) The Secretary of Homeland Security, in consultation with the Attorney General, shall\nestablish the Cyber Safety Review Board (Board), pursuant to section 871 of the Homeland\nSecurity Act of 2002 (6 U.S.C. 451).\n(b) The Board shall review and assess, with respect to significant cyber incidents (as\ndefined under Presidential Policy Directive 41 of July 26, 2016 (United States Cyber Incident\nCoordination) (PPD 41)) affecting FCEB Information Systems or non-Federal systems, threat\nactivity, vulnerabilities, mitigation activities, and agency responses.\n(c) The Secretary of Homeland Security shall convene the Board following a significant\ncyber incident triggering the establishment of a Cyber Unified Coordination Group (UCG) as\nprovided by section V(B)(2) of PPD-41; at any time as directed by the President acting\nthrough the APNSA; or at any time the Secretary of Homeland Security deems necessary.\n(d) The Board’s initial review shall relate to the cyber activities that prompted the\nestablishment of a UCG in December 2020, and the Board shall, within 90 days of the\nBoard’s establishment, provide recommendations to the Secretary of Homeland Security for\nimproving cybersecurity and incident response practices, as outlined in subsection (i) of this\nsection.\n(e) The Board’s membership shall include Federal officials and representatives from\nprivate-sector entities. The Board shall comprise representatives of the Department of\nDefense, the Department of Justice, CISA, the NSA, and the FBI, as well as representatives\nfrom appropriate private-sector cybersecurity or software suppliers as determined by the\nSecretary of Homeland Security. A representative from OMB shall participate in Board\nactivities when an incident under review involves FCEB Information Systems, as determined\nby the Secretary of Homeland Security. The Secretary of Homeland Security may invite the\nparticipation of others on a case-by-case basis depending on the nature of the incident under\nreview.\n(f) The Secretary of Homeland Security shall biennially designate a Chair and Deputy\nChair of the Board from among the members of the Board, to include one Federal and one\nprivate-sector member.\n(g) The Board shall protect sensitive law enforcement, operational, business, and other\nconfidential information that has been shared with it, consistent with applicable law.\n(h) The Secretary of Homeland Security shall provide to the President through the\nAPNSA any advice, information, or recommendations of the Board for improving\ncybersecurity and incident response practices and policy upon completion of its review of an\n\n\n-----\n\napplicable incident.\n(i) Within 30 days of completion of the initial review described in subsection (d) of this\nsection, the Secretary of Homeland Security shall provide to the President through the\nAPNSA the recommendations of the Board based on the initial review. These\nrecommendations shall describe:\n(i)   identified gaps in, and options for, the Board’s composition or authorities;\n(ii)  the Board’s proposed mission, scope, and responsibilities;\n(iii)  membership eligibility criteria for private sector representatives;\n(iv)  Board governance structure including interaction with the executive branch and\nthe Executive Office of the President;\n(v)   thresholds and criteria for the types of cyber incidents to be evaluated;\n(vi)  sources of information that should be made available to the Board, consistent\nwith applicable law and policy;\n(vii)  an approach for protecting the information provided to the Board and securing\nthe cooperation of affected United States individuals and entities for the purpose of the\nBoard’s review of incidents; and\n(viii) administrative and budgetary considerations required for operation of the Board.\n(j) The Secretary of Homeland Security, in consultation with the Attorney General and the\nAPNSA, shall review the recommendations provided to the President through the APNSA\npursuant to subsection (i) of this section and take steps to implement them as appropriate.\n(k) Unless otherwise directed by the President, the Secretary of Homeland Security shall\nextend the life of the Board every 2 years as the Secretary of Homeland Security deems\nappropriate, pursuant to section 871 of the Homeland Security Act of 2002.\n\nSec. 6. Standardizing the Federal Government’s Playbook for Responding to Cybersecurity\nVulnerabilities and Incidents.\n(a) The cybersecurity vulnerability and incident response procedures currently used to\nidentify, remediate, and recover from vulnerabilities and incidents affecting their systems vary\nacross agencies, hindering the ability of lead agencies to analyze vulnerabilities and\nincidents more comprehensively across agencies. Standardized response processes ensure\na more coordinated and centralized cataloging of incidents and tracking of agencies’\nprogress toward successful responses.\n(b) Within 120 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA, in consultation with the Director of OMB, the Federal Chief\nInformation Officers Council, and the Federal Chief Information Security Council, and in\ncoordination with the Secretary of Defense acting through the Director of the NSA, the\nAttorney General, and the Director of National Intelligence, shall develop a standard set of\noperational procedures (playbook) to be used in planning and conducting a cybersecurity\nvulnerability and incident response activity respecting FCEB Information Systems. The\nplaybook shall:\n(i)  incorporate all appropriate NIST standards;\n(ii)  be used by FCEB Agencies; and\n\n(iii) articulate progress and completion through all phases of an incident response,\n\n\n-----\n\nwhile allowing flexibility so it may be used in support of various response activities.\n(c) The Director of OMB shall issue guidance on agency use of the playbook.\n(d) Agencies with cybersecurity vulnerability or incident response procedures that deviate\nfrom the playbook may use such procedures only after consulting with the Director of OMB\nand the APNSA and demonstrating that these procedures meet or exceed the standards\nproposed in the playbook.\n(e) The Director of CISA, in consultation with the Director of the NSA, shall review and\nupdate the playbook annually, and provide information to the Director of OMB for\nincorporation in guidance updates.\n(f) To ensure comprehensiveness of incident response activities and build confidence that\nunauthorized cyber actors no longer have access to FCEB Information Systems, the\nplaybook shall establish, consistent with applicable law, a requirement that the Director of\nCISA review and validate FCEB Agencies’ incident response and remediation results upon\nan agency’s completion of its incident response. The Director of CISA may recommend use\nof another agency or a third-party incident response team as appropriate.\n(g) To ensure a common understanding of cyber incidents and the cybersecurity status of\nan agency, the playbook shall define key terms and use such terms consistently with any\nstatutory definitions of those terms, to the extent practicable, thereby providing a shared\nlexicon among agencies using the playbook.\n\nSec. 7. Improving Detection of Cybersecurity Vulnerabilities and Incidents on Federal\nGovernment Networks.\n(a) The Federal Government shall employ all appropriate resources and authorities to\nmaximize the early detection of cybersecurity vulnerabilities and incidents on its networks.\nThis approach shall include increasing the Federal Government’s visibility into and detection\nof cybersecurity vulnerabilities and threats to agency networks in order to bolster the Federal\nGovernment’s cybersecurity efforts.\n(b) FCEB Agencies shall deploy an Endpoint Detection and Response (EDR) initiative to\nsupport proactive detection of cybersecurity incidents within Federal Government\ninfrastructure, active cyber hunting, containment and remediation, and incident response.\n(c) Within 30 days of the date of this order, the Secretary of Homeland Security acting\nthrough the Director of CISA shall provide to the Director of OMB recommendations on\noptions for implementing an EDR initiative, centrally located to support host-level visibility,\nattribution, and response regarding FCEB Information Systems.\n(d) Within 90 days of receiving the recommendations described in subsection (c) of this\nsection, the Director of OMB, in consultation with Secretary of Homeland Security, shall issue\nrequirements for FCEB Agencies to adopt Federal Government-wide EDR approaches.\nThose requirements shall support a capability of the Secretary of Homeland Secretary,\nacting through the Director of CISA, to engage in cyber hunt, detection, and response\nactivities.\n(e) The Director of OMB shall work with the Secretary of Homeland Security and agency\nheads to ensure that agencies have adequate resources to comply with the requirements\nissued pursuant to subsection (d) of this section.\n\n\n-----\n\n(f) Defending FCEB Information Systems requires that the Secretary of Homeland\nSecurity acting through the Director of CISA have access to agency data that are relevant to\na threat and vulnerability analysis, as well as for assessment and threat-hunting purposes.\nWithin 75 days of the date of this order, agencies shall establish or update Memoranda of\nAgreement (MOA) with CISA for the Continuous Diagnostics and Mitigation Program to\nensure object level data, as defined in the MOA, are available and accessible to CISA,\nconsistent with applicable law.\n(g) Within 45 days of the date of this order, the Director of the NSA as the National\nManager for National Security Systems (National Manager) shall recommend to the\nSecretary of Defense, the Director of National Intelligence, and the Committee on National\nSecurity Systems (CNSS) appropriate actions for improving detection of cyber incidents\naffecting National Security Systems, to the extent permitted by applicable law, including\nrecommendations concerning EDR approaches and whether such measures should be\noperated by agencies or through a centralized service of common concern provided by the\nNational Manager.\n(h) Within 90 days of the date of this order, the Secretary of Defense, the Director of\nNational Intelligence, and the CNSS shall review the recommendations submitted under\nsubsection (g) of this section and, as appropriate, establish policies that effectuate those\nrecommendations, consistent with applicable law.\n(i) Within 90 days of the date of this order, the Director of CISA shall provide to the\nDirector of OMB and the APNSA a report describing how authorities granted under section\n1705 of Public Law 116-283, to conduct threat-hunting activities on FCEB networks without\nprior authorization from agencies, are being implemented. This report shall also recommend\nprocedures to ensure that mission-critical systems are not disrupted, procedures for notifying\nsystem owners of vulnerable government systems, and the range of techniques that can be\nused during testing of FCEB Information Systems. The Director of CISA shall provide\nquarterly reports to the APNSA and the Director of OMB regarding actions taken under\nsection 1705 of Public Law 116-283.\n(j) To ensure alignment between Department of Defense Information Network (DODIN)\ndirectives and FCEB Information Systems directives, the Secretary of Defense and the\nSecretary of Homeland Security, in consultation with the Director of OMB, shall:\n(i)  within 60 days of the date of this order, establish procedures for the Department of\nDefense and the Department of Homeland Security to immediately share with each other\nDepartment of Defense Incident Response Orders or Department of Homeland Security\nEmergency Directives and Binding Operational Directives applying to their respective\ninformation networks;\n(ii)  evaluate whether to adopt any guidance contained in an Order or Directive issued\nby the other Department, consistent with regulations concerning sharing of classified\ninformation; and\n(iii) within 7 days of receiving notice of an Order or Directive issued pursuant to the\nprocedures established under subsection (j)(i) of this section, notify the APNSA and\nAdministrator of the Office of Electronic Government within OMB of the evaluation described\n\n\n-----\n\nin subsection (j)(ii) of this section, including a determination whether to adopt guidance\nissued by the other Department, the rationale for that determination, and a timeline for\napplication of the directive, if applicable.\n\nSec. 8. Improving the Federal Government’s Investigative and Remediation Capabilities.\n(a) Information from network and system logs on Federal Information Systems (for both\non-premises systems and connections hosted by third parties, such as CSPs) is invaluable\nfor both investigation and remediation purposes. It is essential that agencies and their IT\nservice providers collect and maintain such data and, when necessary to address a cyber\nincident on FCEB Information Systems, provide them upon request to the Secretary of\nHomeland Security through the Director of CISA and to the FBI, consistent with applicable\nlaw.\n(b) Within 14 days of the date of this order, the Secretary of Homeland Security, in\nconsultation with the Attorney General and the Administrator of the Office of Electronic\nGovernment within OMB, shall provide to the Director of OMB recommendations on\nrequirements for logging events and retaining other relevant data within an agency’s systems\nand networks. Such recommendations shall include the types of logs to be maintained, the\ntime periods to retain the logs and other relevant data, the time periods for agencies to\nenable recommended logging and security requirements, and how to protect logs. Logs\nshall be protected by cryptographic methods to ensure integrity once collected and\nperiodically verified against the hashes throughout their retention. Data shall be retained in a\nmanner consistent with all applicable privacy laws and regulations. Such recommendations\nshall also be considered by the FAR Council when promulgating rules pursuant to section 2\nof this order.\n(c) Within 90 days of receiving the recommendations described in subsection (b) of this\nsection, the Director of OMB, in consultation with the Secretary of Commerce and the\nSecretary of Homeland Security, shall formulate policies for agencies to establish\nrequirements for logging, log retention, and log management, which shall ensure centralized\naccess and visibility for the highest level security operations center of each agency.\n(d) The Director of OMB shall work with agency heads to ensure that agencies have\nadequate resources to comply with the requirements identified in subsection (c) of this\nsection.\n(e) To address cyber risks or incidents, including potential cyber risks or incidents, the\nproposed recommendations issued pursuant to subsection (b) of this section shall include\nrequirements to ensure that, upon request, agencies provide logs to the Secretary of\nHomeland Security through the Director of CISA and to the FBI, consistent with applicable\nlaw. These requirements should be designed to permit agencies to share log information, as\nneeded and appropriate, with other Federal agencies for cyber risks or incidents.\n\nSec. 9. National Security Systems.\n(a) Within 60 days of the date of this order, the Secretary of Defense acting through the\nNational Manager, in coordination with the Director of National Intelligence and the CNSS,\nand in consultation with the APNSA, shall adopt National Security Systems requirements that\n\n\n-----\n\nare equivalent to or exceed the cybersecurity requirements set forth in this order that are\notherwise not applicable to National Security Systems. Such requirements may provide for\nexceptions in circumstances necessitated by unique mission needs. Such requirements\nshall be codified in a National Security Memorandum (NSM). Until such time as that NSM is\nissued, programs, standards, or requirements established pursuant to this order shall not\napply with respect to National Security Systems.\n(b) Nothing in this order shall alter the authority of the National Manager with respect to\nNational Security Systems as defined in National Security Directive 42 of July 5, 1990\n(National Policy for the Security of National Security Telecommunications and Information\nSystems) (NSD-42). The FCEB network shall continue to be within the authority of the\nSecretary of Homeland Security acting through the Director of CISA.\n\nSec. 10. Definitions. For purposes of this order:\n(a) the term “agency” has the meaning ascribed to it under 44 U.S.C. 3502.\n(b) the term “auditing trust relationship” means an agreed-upon relationship between two\nor more system elements that is governed by criteria for secure interaction, behavior, and\noutcomes relative to the protection of assets.\n(c) the term “cyber incident” has the meaning ascribed to an “incident” under 44 U.S.C.\n3552(b)(2).\n(d) the term “Federal Civilian Executive Branch Agencies” or “FCEB Agencies” includes\nall agencies except for the Department of Defense and agencies in the Intelligence\nCommunity.\n(e) the term “Federal Civilian Executive Branch Information Systems” or “FCEB\nInformation Systems” means those information systems operated by Federal Civilian\nExecutive Branch Agencies, but excludes National Security Systems.\n(f) the term “Federal Information Systems” means an information system used or\noperated by an agency or by a contractor of an agency or by another organization on behalf\nof an agency, including FCEB Information Systems and National Security Systems.\n(g) the term “Intelligence Community” or “IC” has the meaning ascribed to it under 50\nU.S.C. 3003(4).\n(h) the term “National Security Systems” means information systems as defined in 44\nU.S.C. 3552(b)(6), 3553(e)(2), and 3553(e)(3).\n(i) the term “logs” means records of the events occurring within an organization’s systems\nand networks. Logs are composed of log entries, and each entry contains information\nrelated to a specific event that has occurred within a system or network.\n(j) the term “Software Bill of Materials” or “SBOM” means a formal record containing the\ndetails and supply chain relationships of various components used in building software.\nSoftware developers and vendors often create products by assembling existing open source\nand commercial software components. The SBOM enumerates these components in a\nproduct. It is analogous to a list of ingredients on food packaging. An SBOM is useful to\nthose who develop or manufacture software, those who select or purchase software, and\nthose who operate software. Developers often use available open source and third-party\nsoftware components to create a product; an SBOM allows the builder to make sure those\n\n\n-----\n\ncomponents are up to date and to respond quickly to new vulnerabilities. Buyers can use an\nSBOM to perform vulnerability or license analysis, both of which can be used to evaluate risk\nin a product. Those who operate software can use SBOMs to quickly and easily determine\nwhether they are at potential risk of a newly discovered vulnerability.  A widely used,\nmachine-readable SBOM format allows for greater benefits through automation and tool\nintegration. The SBOMs gain greater value when collectively stored in a repository that can\nbe easily queried by other applications and systems. Understanding the supply chain of\nsoftware, obtaining an SBOM, and using it to analyze known vulnerabilities are crucial in\nmanaging risk.\n(k) the term “Zero Trust Architecture” means a security model, a set of system design\nprinciples, and a coordinated cybersecurity and system management strategy based on an\nacknowledgement that threats exist both inside and outside traditional network boundaries.\nThe Zero Trust security model eliminates implicit trust in any one element, node, or service\nand instead requires continuous verification of the operational picture via real-time\ninformation from multiple sources to determine access and other system responses. In\nessence, a Zero Trust Architecture allows users full access but only to the bare minimum\nthey need to perform their jobs. If a device is compromised, zero trust can ensure that the\ndamage is contained. The Zero Trust Architecture security model assumes that a breach is\ninevitable or has likely already occurred, so it constantly limits access to only what is needed\nand looks for anomalous or malicious activity. Zero Trust Architecture embeds\ncomprehensive security monitoring; granular risk-based access controls; and system security\nautomation in a coordinated manner throughout all aspects of the infrastructure in order to\nfocus on protecting data in real-time within a dynamic threat environment. This data-centric\nsecurity model allows the concept of least-privileged access to be applied for every access\ndecision, where the answers to the questions of who, what, when, where, and how are\ncritical for appropriately allowing or denying access to resources based on the combination\nof sever.\n\nSec. 11. General Provisions.\n(a) Upon the appointment of the National Cyber Director (NCD) and the establishment of\nthe related Office within the Executive Office of the President, pursuant to section 1752 of\nPublic Law 116-283, portions of this order may be modified to enable the NCD to fully\nexecute its duties and responsibilities.\n(b) Nothing in this order shall be construed to impair or otherwise affect:\n(i)  the authority granted by law to an executive department or agency, or the head\nthereof; or\n(ii) the functions of the Director of the Office of Management and Budget relating to\nbudgetary, administrative, or legislative proposals.\n(c) This order shall be implemented in a manner consistent with applicable law and\nsubject to the availability of appropriations.\n(d) This order is not intended to, and does not, create any right or benefit, substantive or\nprocedural, enforceable at law or in equity by any party against the United States, its\ndepartments, agencies, or entities, its officers, employees, or agents, or any other person.\n\n\n-----\n\n(e) Nothing in this order confers authority to interfere with or to direct a criminal or national\nsecurity investigation, arrest, search, seizure, or disruption operation or to alter a legal\nrestriction that requires an agency to protect information learned in the course of a criminal\nor national security investigation.\n\nJOSEPH R. BIDEN JR.\n\nTHE WHITE HOUSE,\nMay 12, 2021.\n\nNext Post: FACT SHEET: President Signs Executive Order Charting New Course to\n\nImprove the Nation’s Cybersecurity and Protect Federal Government Networks FACT\n# SHEET: President Signs Executive Order Charting New Course to Improve the Nation’s Cybersecurity and Protect Federal Government Networks\nMay 12, 2021 • Statements and Releases\n\nNext Post\n\n### Stay Connected\n\nWe'll be in touch with the latest information on how President Biden and his administration\nare working for the American people, as well as ways you can get involved and help our\ncountry build back better.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-12 - Executive Order on Improving the Nation’s Cybersecurity.pdf"
    ],
    "report_names": [
        "2021-05-12 - Executive Order on Improving the Nation’s Cybersecurity.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535901,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653617513,
    "ts_modification_date": 1653617513,
    "files": {
        "pdf": "https://archive.orkl.eu/347eebb91b144d02e89a8a82a01972d20a718dbd.pdf",
        "text": "https://archive.orkl.eu/347eebb91b144d02e89a8a82a01972d20a718dbd.txt",
        "img": "https://archive.orkl.eu/347eebb91b144d02e89a8a82a01972d20a718dbd.jpg"
    }
}