{
    "id": "a4ce0ac9-7646-4f13-8525-6ddba214a944",
    "created_at": "2023-01-12T15:08:07.573234Z",
    "updated_at": "2025-03-27T02:11:39.906826Z",
    "deleted_at": null,
    "sha1_hash": "a266b70e51c6a9089c402203cfd7416986f879fa",
    "title": "2020-05-07 - We Chat, They Watch- How International Users Unwittingly Build up WeChat’s Chinese Censorship Apparatus",
    "authors": "",
    "file_creation_date": "2022-05-28T04:01:40Z",
    "file_modification_date": "2022-05-28T04:01:40Z",
    "file_size": 2314880,
    "plain_text": "# We Chat, They Watch How International Users Unwittingly Build up WeChat’s Chinese Censorship Apparatus\n\n**citizenlab.ca/2020/05/we-chat-they-watch/**\n\nMay 7, 2020\n\n[Research](https://citizenlab.ca/category/research/)\n\n\n-----\n\n[Free Expression Online](https://citizenlab.ca/category/research/free-expression-online/)\nBy [Jeffrey Knockel,](https://citizenlab.ca/author/jknockel/) [Christopher Parsons,](https://citizenlab.ca/author/cparsons/) [Lotus Ruan,](https://citizenlab.ca/author/lotus/) [Ruohan Xiong,](https://citizenlab.ca/author/ruohan-xiong/) [Jedidiah Crandall, and](https://citizenlab.ca/author/jedidiah-crandall/) Ron\nDeibert\nMay 7, 2020\n[Download this report](https://tspace.library.utoronto.ca/bitstream/1807/101395/1/Report%23127--wechattheywatch-web.pdf)\n[Have questions about this report? Read our WeChat guide that provides a summary of research](https://citizenlab.ca/2020/05/wechat-surveillance-explained/)\nfindings as well as questions and answers from the research team.\n\n## Key Findings\n\nWe present results from technical experiments which reveal that WeChat communications\nconducted entirely among non-China-registered accounts are subject to pervasive content\nsurveillance that was previously thought to be exclusively reserved for China-registered\naccounts.\nDocuments and images transmitted entirely among non-China-registered accounts undergo\ncontent surveillance wherein these files are analyzed for content that is politically sensitive in\nChina.\nUpon analysis, files deemed politically sensitive are used to invisibly train and build up WeChat’s\nChinese political censorship system.\n\n\n-----\n\nFrom public information, it is unclear how Tencent uses non-Chinese-registered users data to\nenable content blocking or which policy rationale permits the sharing of data used for blocking\nbetween international and China regions of WeChat.\nTencent’s responses to data access requests failed to clarify how data from international users is\nused to enable political censorship of the platform in China.\n\n## Introduction\n\nA significant body of research over the past decade has shown how online platforms in China are\nroutinely censored to comply with government regulations. As Chinese companies grow into markets\nbeyond China, their activities are also coming under scrutiny. For example, TikTok, a video-based\nsocial media company, has been accused of censoring content on its platform that would be sensitive\nin China.1 Grindr, a Chinese-owned online dating platform for gay, bi, trans, and queer people, fell\nunder suspicion that it could be used to monitor, track, or otherwise endanger American users.2\n\n\nWeChat is the most popular social media platform in China and third in the world.3 While the platform\ndominates the market in China, it also has made efforts to internationalize and attract users globally.\nLike any other Internet platform operating in China, WeChat is expected to follow rules and regulations\nfrom Chinese authorities around prohibited content. Previous Citizen Lab research shows the\nbalancing act WeChat must maintain as it attempts to keep within government red lines in China and\nattract users internationally. WeChat implements censorship for users with accounts registered to\nmainland China phone numbers. This censorship is done without notification to users and is\ndynamically updated, often in response to current events.4\n\nIn previous work, there was no evidence that these censorship features affected users with accounts\nthat are not registered to China-based phone numbers. These users could send and receive\nmessages that users with China-registered accounts could not. In this report, we show that documents\nand images shared among non-China-registered accounts are subject to content surveillance and are\nused to build up the database WeChat uses to censor China-registered accounts.5 By engaging in\nanalysis of WeChat privacy agreements and policy documents, we find that the company provides no\nclear reference or explanation of the content surveillance features and therefore absent performing\ntheir own technical experiments, users cannot determine if, and why, content surveillance was being\napplied. Consequently, non-China-based users who send sensitive content over WeChat may be\nunwittingly contributing to political censorship in China.\n\nThe report proceeds as follows:\n\n\n**Part 1: Background**\n\nProvides background on WeChat and an overview of previous research on surveillance and\ncensorship on the platform.\n\n**Part 2: Technical Assessment**\n\nPresents our technical experiments, including the side-channel methods which were used to\nuncover the surveillance to which non-China-registered accounts are subjected, as well as the\nfindings and discussion emergent from the analysis.\n\n\n-----\n\n**Part 3: Policy Assessment**\nPresents results from policy analysis, which involved interrogating Tencent’s public-facing policy\ndocuments and directly contacting the company about how it treated international users’\ncommunications content.\n\n**Part 4: Data Access Request Assessment**\nRecounts what we did, and did not, learn from issuing a data access request for our WeChat\ndata, and shows that this method failed to reveal content surveillance on the platform.\n\n**Part 5: Conclusion**\nProvides a brief conclusion, discusses the broad significance of our findings, and provides\navenues for future research.\n\n## Part 1 – Background\n\nWeChat (Weixin 微信 in Chinese) is one of the most popular social media apps in China, with 1.15\nbillion monthly active users in China and overseas as of late 2019.6 The application is owned and\noperated by Tencent, one of China’s largest technology companies, and was launched in 2011 as a\nmobile instant messaging app. Since then, Tencent’s WeChat/Weixin Group7 has developed a variety\nof communication functionalities in WeChat including instant messaging (e.g., one-to-one private chat,\ngroup chat), WeChat Moments (i.e., a functionality that resembles Facebook’s Timeline where users\ncan share text-based updates, upload images, and share short videos or articles with their friends),\nand the Public Account platform (i.e., a blogging-like platform that allows individual writers as well as\nbusinesses to write for general audiences). Forty-five billion messages are reportedly sent using\nWeChat on a daily basis.8\n\n\nThe Chinese market presents unique challenges for Internet platform providers due to laws and\nregulations that hold companies accountable for the content published or transmitted on their\nplatforms. Companies are expected to invest in human resources and technologies to moderate\ncontent and comply with government regulations on content controls. Companies which do not\nundertake such moderation and compliance activities can be fined or have their business licenses\nrevoked. Meanwhile, China’s laws and regulations on content controls are broadly defined, with\nprohibited topics ranging from “disrupting social order and stability” or “damaging state honor and\ninterests,” to crossing “the bottom line of socialism.”9 Previous research has shown that these vaguely\ndefined guidelines often lead companies and individuals alike to engage in self-censorship.10\n\n[Previous work shows that WeChat conducts pervasive political censorship for users whose accounts](https://citizenlab.ca/2016/11/wechat-china-censorship-one-app-two-systems/)\noperate under WeChat China’s terms of service; we refer to these accounts, generally, as Chinaregistered accounts.11 Accounts which were originally registered to mainland China phone numbers\nfall under these terms of service, and they remain under them even if the user later links their account\nto a non-Chinese phone number. Files and communications which are sent to, or from, Chinaregistered accounts are assessed for political sensitivity among other content categories. If the\ncontent of the communications is found to be sensitive, it is censored for all China-registered accounts\non the platform.\n\n\n-----\n\nFigure 1: Evidence of image censorship in WeChat’s one-to-one chat feature from Citizen Lab testing\nconducted in July 2017.[12]\n\n\n-----\n\nFigure 2: Evidence of image censorship in a WeChat group Chat from Citizen Lab testing conducted in\nJanuary 2017.13 A user with a China account (on the left) attempted to send a sensitive image, which\nwas censored.\nPrevious work has found that WeChat placed images which are sent by China-registered accounts\nunder two different kinds of surveillance.14 Due to the computationally expensive and time-consuming\nmethods required to analyze an image for sensitivity, these methods are not easily adapted to run in\nreal-time. As a result, WeChat first subjects these images to file hash surveillance to assess whether\nthe image has previously been categorized as sensitive, which is determined by checking to see if the\nfile’s hash is present in a hash index of known sensitive file hashes. This hash index check is\nperformed in real time. If the image’s file hash is in the hash index, it is censored in real time. Images\nthat are not in the hash index of known sensitive files undergo content surveillance. Such surveillance\ninvolves the image being analyzed for whether it is visually similar to that of any blacklisted image.\nFurther, text that is in the image is extracted and analyzed to determine if any of the text is blacklisted.\nIf the image is found to be sensitive, then its file hash is added to the hash index to enable future realtime censorship. Of note, previous testing found that content surveillance was never performed in real\ntime and that the first time that a sensitive image file is transmitted it was not censored.\n\n\n-----\n\nIn this report, we revisit how WeChat implements image surveillance. For the first time, we examine\nhow WeChat conducts surveillance and censorship of documents sent over the platform. Moreover,\nwe examine whether images and documents communicated entirely among non-China-registered\naccounts are subject to the same surveillance practices which were previously found to apply to\ncommunication to, or from, China-registered accounts.\n\n**What is an MD5 hash?Hash functions are designed to map a data input, such as a message or a file,**\ninto a short, fixed-size output called a hash. The MD5 hash function is a cryptographic hash function,\nwhich is a hash function with special cryptographic properties. Cryptographic hash functions have\nmany additional properties over ordinary hash functions, but one such property is that it should be\ninfeasible to find two different inputs such that the hash function maps them to the same output. That\nis, it should be infeasible to find two different inputs with the same hash. MD5 is an older cryptographic\nhash function designed in 1991.\n\nThe diagram below illustrates the process of mapping a file (e.g., a document or an image) to an MD5\nhash. In this example, two different images are inputted to a cryptographic hash function resulting in\ntwo unique MD5 hashes.\n\n## Part 2 – Technical Assessment\n\nMeasuring communications surveillance can be challenging due to its inherently invisible nature. In\nthe absence of censorship, which restricts communication in a way that has a measurable effect (e.g.,\na message fails to be delivered), surveillance can be difficult to detect. To detect the communications\nsurveillance of non-China-registered accounts, we developed and ran two side-channel experiments.\nIn both experiments, we employ two channels, one communicating entirely among non-Chinaregistered accounts and a second communicating with a China-registered account. By utilizing the\nhash index that censors China-registered WeChat accounts as a side channel, we were able to infer\nthat content surveillance was occurring in the first channel by measuring for censorship in the second.\nWe develop and performed a third experiment testing whether recalling a message containing a file\nremoves that file’s hash from the hash index.\n\nIn short, while we did not detect censorship in communications among non-China-registered accounts,\nwe did demonstrate that such accounts are nevertheless subject to content surveillance. Such\nsurveillance was discovered by confirming that politically sensitive content which was sent exclusively\nbetween non-China-registered accounts was identified as politically sensitive and subsequently\n\n\n-----\n\ncensored when transmitted between China-registered accounts, without having previously been sent\nto, or between, China-registered accounts. In the remainder of this section, we explain our preexperiment analysis, our experimental designs, and we present our experiment’s results.\n\n## 2.1 Background\n\nBefore designing our side-channel experiments, we first explored whether sensitive documents sent\nto, or from, China-registered accounts were surveilled and censored using a hash index. By sending\nsensitive documents to a China-registered account, we could observe which files were censored. We\nfound that documents such as UTF8-encoded plain text (*.txt), Microsoft Word (*.docx), and Portable\nDocument Format (*.pdf) documents which contained certain sensitive keyword combinations such as\n“法輪功 [+] 法輪大法” (Falun Gong + Falun Dafa) were censored. As part of our investigation, we sent\nmultiple documents across multiple days. Of particular note, we sent over 50 during November 25–26,\nwhich was immediately before our experiment, as well as over 50 during December 3–5, which was\nduring our experiment. We found that all sent documents were subject to surveillance and censored in\nthe same way as images had been found to be surveilled and censored in previous work.15 Namely,\nwe confirmed that documents underwent file hash surveillance and that such files were not censored\nin real time until they had undergone non-real time content surveillance and their file hash had been\nadded to the hash index.\n\n\nWe also sought to confirm whether images were still subject to surveillance and censored as\ndescribed in previous work16. We found that, unlike in previous work where content surveillance of\nimages was not performed in real time, images were now sometimes censored in real time even if\nthey had never been sent over the platform before. Because of this new capability of WeChat’s\ncensorship implementation, we designed our experiment to send a large number of images such that\nwe expected, with high probability, that at least one would not be censored in real time.\n\n## 2.2 Statistical Experiment\n\nIn this section, we present our first side-channel experiment which tests for content surveillance of\nsensitive documents and images transmitted over WeChat. We call this experiment the statistical\n_experiment because of this experiment’s use of statistical analysis._\n\n### 2.2.1 Methodology\n\nIn this experiment, we use two WeChat group chat conversations to serve as our two communication\nchannels:\n\n1. Non-China group chat. This group chat contains three non-China-registered WeChat accounts\n\nwhich were registered to Canadian phone numbers. In this group chat, a non-China-registered\naccount sends content entirely among other non-China-registered accounts.\n2. China group chat. This group chat contains two non-China-registered WeChat accounts which\n\nwere registered to Canadian phone numbers and one WeChat account that was registered to a\nmainland China phone number. In this group chat, a non-China-registered account\nsimultaneously sends content to both a non-China-registered and a China-registered account. In\nthis group chat, we are interested in whether the China-registered account receives the content\nor if the content is instead censored.\n\n\n-----\n\nOur experiments rely on testing for the presence of a file s hash in WeChat s censorship hash index.\nBy sending a file in the China group chat and measuring whether that file is censored in real time, we\ncan test whether its hash is already in the hash index. However, as a consequence of this test, we\nintroduce the hash into the hash index if it was not already present. Thus, it is important that,\nwhenever we perform a new test, we send a unique file with a hash that has never been sent over\nWeChat before. We call such a file a novel file, since its hash is novel to the WeChat platform.\n\nIn the remainder of this section, we explain the design of our side-channel experiment to test for\ncontent surveillance of document and image files when sent entirely among non-China-registered\naccounts.\n\nFigure 3: In the case of no content surveillance, the hash index is not updated when non-Chinaregistered accounts send a novel, sensitive document to other non-China-registered accounts (top).\nThus, when the same document is sent to China-registered accounts, the document is not censored\n(bottom).\n\n\n-----\n\nFigure 4: In the case of content surveillance, the hash index is updated when non-China-registered\naccounts send a novel, sensitive document to other non-China-registered accounts (top). Thus, when\nthe same document is sent to China-registered accounts, the document is censored (bottom).\nWe performed the following test to evaluate whether document content surveillance takes place\namong non-China-registered accounts:\n\n**Document side-channel test. We first send a novel, sensitive document in the non-China**\n**group chat and then send the same document in the China group chat. If the document is**\ncensored in real time when sent to the China-registered account, then we conclude there was\nsurveillance of the sensitive document during the communication among the non-China group\n**chat.**\n\nIn this document side-channel test, the hash index serves as a side-channel by leaking information\nabout whether the non-China group chat is under content surveillance by measuring for censorship\nin the China group chat. This method is sufficient for testing for the existence of document\nsurveillance because, at the time of testing, WeChat did not censor documents in real time. Thus,\nwhenever we observe real-time document censorship, we can conclude that the document had\npreviously been subject to surveillance.\n\nIn the case of image files, we observed that sometimes WeChat censors them in real time even if they\nhave not previously undergone content surveillance on the platform. To accommodate this behaviour,\nwe send a sufficiently large number of images such that, if images sent entirely among non-Chinaregistered accounts undergo content surveillance, then we will still be able to distinguish the effect this\nsurveillance has on real-time censorship even if real-time censorship sometimes happens in the\nabsence of content surveillance. Specifically, we first conduct the following test:\n\n\n-----\n\n1. Image side-channel test. We first send n novel, sensitive images in the non-China group chat\n\nand then send the same images in the China group chat one minute later. We count how many\nimages were not received by the China-registered account.\n\nWe then compare the number of censored images from the previous test to that of the following test:\n\n1. Image control test. We send n novel, sensitive images in the China group chat. We count how\n\nmany were not received by the China-registered account.\n\nThe difference between these two tests is that in the image side-channel test, we first send an image\namong the non-China-registered accounts before sending it to a China-registered account, whereas in\nthe image control test, we send the image to a China-registered account without sending it to nonChina-registered accounts first. If there is a significantly larger number of images censored in the\n**image side-channel test, then we can conclude that sending images among non-China-registered**\naccounts is facilitating real-time Chinese censorship.\n\nWe use statistical hypothesis testing to determine whether there is a statistically significant increase in\nthe number of images censored in the image side-channel test than in the image control test.\nNamely, we perform a chi-squared test17 under the null hypothesis that sending images from nonChina-registered accounts to non-China-registered accounts does not affect the probability that they\nwill be censored in real-time when they are later sent to a China-registered account. If, according to\nthe chi-squared test, we may reject the null hypothesis, then we can conclude that images sent\nentirely among non-China-registered accounts are under content surveillance and are contributing to\nWeChat’s Chinese censorship system.\n\n\nFor each image test, we send n novel images. Our desire is to choose an n high enough that our\nstatistical test has sufficient power to determine whether content surveillance between non-Chinaregistered accounts exists. However, we also want n to be sufficiently low to minimize the risk of\nWeChat taking adverse action against our testing accounts (e.g., WeChat has been known to suspend\nor ban accounts in response to censorship testing18). In our experiment, we will evaluate choosing n =\n60.\n\nFor both document and image testing, each test requires that we send novel, sensitive documents or\nimages that have not previously been sent over the platform to ensure that the sensitive files’ hashes\nare not already in the hash index. In principle, we could use entirely different sensitive documents and\nimages. However, this approach would limit us to only performing as many file transmissions as we\nhave known sensitive files. Thus, to facilitate testing, we generate novel, sensitive files by performing\nsubtle modifications to a single sensitive document and a single sensitive image; we call each of these\n_seed files. These modifications are designed to change these files’ hashes without changing their_\nability to be recognized as sensitive and, thus, let us generate an indefinite number of sensitive\ndocuments and images. In the remainder of this section, we explain, for both documents and images,\nwhich seed file we use and how we generate novel copies of a seed file such that the derivative files\nremain sensitive.\n\nLorem ipsum\n法轮大法\n法輪大法\n法轮功\n\n\n-----\n\n法輪功\nLorem ipsum\nFigure 5: The text of the sensitive seed document.\n\nFor documents, we use as our seed document a *.docx file which contains the characters for Falun\nDafa and Falun Gong in both simplified and traditional Chinese, as well as some filler text (see Figure\n5). To create a novel, still-sensitive copy of it, we then append 64 alphanumeric characters chosen\nuniformly at random.\n\nFigure 6: Our sensitive seed image, a cartoon memorializing the passing of Nobel Peace Prize\nawardee Liu Xiaobo.\nFor images, we use as our seed file a cartoon of Liu Xiaobo (see Figure 6) that was found to be\ncensored on WeChat in previous work19. To create a novel, still-sensitive copy of it, we append 24 KiB\nof random bytes to it. Since the seed file we used was a JPEG-encoded image, all data past the JPEG\nend-of-file marker is ignored when rendering the image; however, the appended data still causes the\nfile to hash to a different value.\n\n### 2.2.2 Experimental Setup\n\nWe ran our experiment to test for document and image file surveillance across three separate days:\nNovember 27, December 2, and December 6, 2019. We spread the experiment across three days to\nensure that the behaviour we observed was consistent across time and to reduce the risk of adverse\naction taken against our test accounts All measurements were performed from a University of Toronto\n\n\n-----\n\nnetwork in Toronto, Canada. For each test, on each day, we transmitted novel, sensitive documents or\nimages which had never previously been communicated over the platform. In the remainder of this\nsection, we present the results of these experiments.\n\n### 2.2.3 Results\n\n**Test** **Nov. 25–26** **Nov. 27** **Dec. 2** **Dec. 3–5** **Dec. 6** **Total**\n\n**Document side-channel** 1/1 1/1 1/1 3/3\n\n**Document control** 0/≥50 0/≥50 0/≥100\n\n**Image side-channel** 20/20 20/20 20/20 60/60\n\n**Image control** 17/20 14/20 18/20 49/60\n\nTable 1: For each test, the number of files which were censored on each date\n\nTable 1 shows the results of our experiment testing for document and image surveillance on each of\nthe three days it was conducted. Although our experimental design did not explicitly contain a\n**document control test, we reference one to be consistent with our presentation of the image test**\nresults. Specifically, this test refers to our implicit results from investigating how document censorship\nworked on WeChat, which confirmed that WeChat lacked the capability to censor documents in real\ntime (see Section 2.1).\n\nOur results show that on each day of testing, if a sensitive document is first sent from a non-Chinaregistered account to non-China-registered accounts, before sending it to a China-registered account,\nthey are censored in real time when sent to a China-registered account. This finding shows that\ndocuments sent even entirely among non-China-registered accounts undergo content surveillance\nand that these documents are used to build-up the censorship system to which China-registered\naccounts are subjected.\n\nUnlike with documents, we observed that WeChat can sometimes censor images in real time.20 Out of\n60 images sent across three days, 49 images were censored in real time when only sending them to\nChina-registered accounts. However, if we first sent them from a non-China-registered account to\nother non-China-registered accounts, then all 60 out of 60 images were censored in real-time when\nsent to a China-registered account. To confirm that the difference in these two results are statistically\nsignificant, we performed a chi-squared test under the null hypothesis that sending images from nonChina-registered accounts to non-China-registered accounts does not affect the probability that they\nwill be censored in real time when they are later sent to a China-registered account. We reject the null\nhypothesis because we found that there is only a p = 0.00078 probability of observing at least as large\nof a difference by chance. This result shows that, in addition to documents, images sent even entirely\namong non-China-registered accounts also undergo content surveillance, and that images sent\namong non-China-registered accounts are also used to build-up the censorship system to which\nChina-registered accounts are subjected.\n\nFinally, for our image testing, we evaluate our choice of sending n = 60 images across each image\ntest. At no point during testing were any of our test accounts banned for sending this number of\nimages. Moreover, choosing this number yielded highly significant results. These findings show that\n\n\n-----\n\nsending 60 images across three different days is powerful enough to result in statistically significant\nresults and suggests that an even smaller value of n could be used in future experiments to further\nminimize risk of account closure.\n\n## 2.3 Collision Experiment\n\nIn Section 2.2, we presented a side-channel experiment that confirmed that documents and images\nwhich are communicated entirely among non-China-registered accounts undergo content surveillance.\nUnlike documents, novel images were sometimes censored in real time when sent over WeChat for\nthe first time. Consequently, we used statistical methods to show that such images were increasingly\ncensored when previously exposed to surveillance. In this section, we present an alternative\nexperiment that does not require statistical analysis and which further confirms the findings of the past\nexperiment. The method of our follow-up experiment, the collision experiment, takes advantage of the\nfact that WeChat uses MD5 as its file hash algorithm and that this hash function has known\nvulnerabilities relating to hash collisions.\n\n### 2.3.1 Methodology\n\nOur method in the collision experiment is similar to the statistical experiment described in Section 2.2,\nbut with one significant difference. In this experiment, we never send a sensitive image in the China\n**group chat. Instead, we send a non-sensitive image that has been specially crafted to have the same**\nMD5 hash as that of a novel, sensitive image. As we have demonstrated in previous work21, due to a\nvulnerability22 in the MD5 hash algorithm, given any two images, we can modify the images’ metadata\nsuch that they have the same MD5 hash.\n\n\nTable 2: The sensitive (left) and non-sensitive (right) seed images used in our experiment. Examples\nof MD5 hash collisions are here23 (left) and here24 (right)\n\nSpecifically, we conduct the following two tests:\n\n\n-----\n\n1. Collision side-channel test. We first generate 20 novel, sensitive images with the same MD5\n\nhashes as 20 non-sensitive images. We send the 20 sensitive images in the non-China group\n**chat and then send the 20 non-sensitive images in the China group chat one minute later. We**\ncount how many of the non-sensitive images were not received by the China-registered account.\n\nWe then compare the number of censored images from the image collision side-channel test to that of\nthe following test:\n\n1. Collision control test. We first generate 20 novel, sensitive images with the same MD5 hashes\n\nas 20 non-sensitive images. We send the 20 non-sensitive images in the China group chat. We\ncount how many were not received by the China-registered account.\n\nLike in the image experiment performed in Section 2.2, if there is content surveillance of\ncommunications sent entirely among non-China accounts, then we would expect a larger number of\nimages to be censored in the collision side-channel test than in the collision control test. In fact, in\nthis experiment, since we send only non-sensitive images in the collision control test, if there is\nsurveillance, then we expect that all non-sensitive images will be censored in the collision side**channel test and that none of the non-sensitive images will be censored in the collision control test.**\n\n### 2.3.2 Experimental Setup\n\nWe performed this experiment on January 30, 2020, on a University of Toronto network in Toronto,\nCanada. Unlike with our statistical experiment, we performed the collision experiment on a single day\nbecause this experiment does not require measuring a large number of image transmissions.\n\n### 2.3.3 Results\n\n**Test** **Jan. 30, 2020**\n\n**Collision side-channel** 20/20\n\n**Collision control** 0/20\n\nTable 3: For each test, the number of non-sensitive images which were censored\n\nIn the collision side-channel test, all 20 of the 20 non-sensitive images were censored, whereas in\nthe collision control test none of the 20 non-sensitive images were censored. Without the use of\nstatistics, these results demonstrate that images are under content surveillance even when sent\nentirely among non-China-registered accounts, and that they are used to invisibly build up WeChat’s\ncensorship system.25\n\n## 2.4 Retention Experiment\n\nWeChat provides a feature to recall26 a message which lets users delete a chat message that has\nbeen sent within the last two minutes to prevent users from viewing it if they have not viewed the\nmessage already. The international version of WeChat’s privacy policy contains links to support\ndocumentation27 that advises users based in the European Union to use the recall feature to remove\n\n\n-----\n\npersonal information from chat messages. In this section, we design and perform an experiment to\nevaluate whether, after a chat message containing a file is recalled, WeChat still retains its hash in the\nhash index.\n\n### 2.4.1 Methodology\n\nTo test whether WeChat retains a hash of a recalled file, we perform the following test:\n\n**Hash retention test. We send a novel, sensitive document in the non-China group chat in a**\ngroup chat and then immediately recall the document. One hour later, we send the same\ndocument in the China group chat. If the document is censored in real time when sent to the\nChina-registered account, then recalling the document did not remove the hash from the file\nindex.\n\nFor this test, we generate novel, sensitive documents as described in Section 2.2.1.\n\n### 2.4.2 Experimental setup\n\nWe performed this experiment on January 7, 2020, on a University of Toronto network in Toronto,\nCanada. To test if the results would be different for European Union users, we repeated this\nexperiment on January 9, 2020, using a WeChat account registered to a Belgian phone number and\nusing a VPN server in Belgium. On each day of testing, we ran the test five times.\n\n### 2.4.3 Results\n\n**Test** **Jan. 7, 2020** **Jan. 9, 2020**\n\n**Hash retention** 5/5 5/5\n\nTable 4: The number of recalled images which were censored on each day\n\nFor both days of testing, in all five tests, the recalled document was never received by the Chinaregistered account. This result shows that recalling a document after it is sent does not remove that\nfile’s MD5 hash from WeChat’s hash index, either for users outside or inside the European Union.\n\n## 2.5 Summary\n\nOur experiments reveal that content surveillance is applied to both China-registered accounts as well\nas to non-China-registered accounts. Content surveillance between users of non-China-registered\naccounts is functionally undetectable unless those users conduct their own side-channel research to\ndetect whether the documents or images that they shared have both been hashed for censorship\npurposes and, also, that the hashed documents or images are actually being censored. Put another\nway, in cases where documents or images are hashed but the files themselves are not presently\ncensored, it would not be possible to know which, if any, files had been analyzed and hashed for\npotential censorship activities using the experiments we performed.\n\nWhile there is a system in place to monitor and generate hashes for the documents and images\ntransmitted between non-China-registered accounts for content which raises social or political\nconcerns in China, our research has not demonstrated that there is an equivalent application of a\n\n\n-----\n\ncensorship system in place for the communications which take place between non-China-registered\naccounts. Put plainly, we have not witnessed censorship between non-China-registered accounts of\nmaterials which are censored among China-registered accounts. By conducting our side-channel\nexperiment, we were nevertheless able to measure the existence of content surveillance for such\nmaterials transmitted among non-China-registered accounts.\n\nMoreover, the experiments show that non-China-registered accounts cannot remove hashes of\nsensitive content which they have sent when communicating entirely with other international users as\na side effect of recalling their content. Consequently, while it may appear to users that they can recall\nthe content of their communications, at least some of the metadata associated with such\ncommunications—such as the hashes of sensitive files—are disassociated from the retraction system.\nIt is unclear based on our technical findings whether such a hash register would be associated with\nindividual accounts. Nevertheless, these hashes will be used to build-up WeChat’s censorship system.\n\nFinally, our experiments conducted on multiple days across November 2019 – January 2020\nconsistently show content surveillance of documents and images sent among non-China-registered\nusers. However, our data cannot answer for how long non-China registered users’ files have been\nsubject to such surveillance, and we cannot distinguish between this surveillance behaviour being a\nrecent addition versus a long-standing behaviour. Although such surveillance was consistently\nobserved on each day of testing, we cannot speak to whether such surveillance was consistently\napplied across days which were not tested.\n\n## Part 3 – Policy Assessment\n\nBefore a company can make their application available on the Google Play store or Apple’s App store,\nthey must first develop and publish a privacy policy to accompany the given application. These publicfacing documents are intended to inform users about how their data will be used and protected. Quite\noften, privacy policies and accompanying terms of service documents will include information such as\nwhat is, and is not, considered personal information or sensitive information, as well as detailed\ninformation concerning the kinds of activities a company may take towards a user’s data.\n\nFor this report, we analyzed the international (i.e., Singapore) as well as the mainland China (i.e.,\nShenzhen) privacy policies and terms of service documents that were associated with WeChat. The\nanalysis was meant to help us understand how the company asserts that it handles personal\ninformation and, through this analysis, better understand whether Tencent’s international policy\ndocumentation suggests that international users’ communication might be used to develop, enhance,\nor maintain the hash index which is used to censor communications between China-registered\nWeChat accounts. We also sent detailed questions to Tencent’s international data protection office to\nseek clarity concerning the company’s privacy policy and terms of service documentation. We also\nhoped that responses from the office would confirm the report’s technical findings and disclose the\nrationales for which content transmitted between non-China-registered accounts was used to develop,\nenhance, or maintain the censorship system which is applied to China-registered accounts.\n\nOverall, we found, first, that neither the China nor international public policy documents made clear to\nusers that non-China accounts could have their content surveilled and the resulting hashes used to\ncensor content for China-registered accounts. Second, we found it was plausible that the international\npolicy documents could permit content surveillance of international users’ communications, but the\n\n\n-----\n\ncompany did not respond to these questions. Third, we found that it was unclear on what basis the\nhashes of international users’ communications could be shared with WeChat China, and the company\ndid not respond to these questions.\n\n## 3.1 Methodology\n\nWe undertook three related activities to assess Tencent’s mainland China and international privacy\npolicies and terms of service documents for WeChat28: downloading relevant policies (e.g., privacy\npolicies and terms of service agreements); assessing the aforementioned policies using a predetermined series of structured questions; and contacting the company’s international data protection\noffice with questions about whether content transmitted between non-China-registered accounts was\never used to develop, enhance, or maintain the censorship system applied to China-registered\naccounts.\n\n### 3.1.1 Obtaining Relevant Public-Facing Policies\n\nRelevant policies were downloaded from Tencent’s websites in December 2019. We specifically\ndownloaded the following policies which apply to China-registered WeChat accounts:\n\n\nAgreement on Software License and Services of Tencent Weixin (Simplified Chinese29 and\nEnglish30 versions)\nWeixin Privacy Policy Protection Guidelines (Simplified Chinese31 and English32 versions)\nStandards of Weixin Account Usage (Simplified Chinese33 and English34 versions)\n\nEach of these documents are available in several languages, including English, simplified Chinese,\nand traditional Chinese.\n\nWe downloaded the following policies which applied to non-China WeChat accounts:\n\n\nWeChat Privacy Protection Summary\nWeChat – Terms of Service36\nWeChat Acceptable Use Policy37\n\n\n35\n\n\nWe primarily analyzed WeChat China’s documents in English to facilitate comparing them directly with\nWeChat’s international policies. We did, however, also examine the simplified Chinese version of\nWeChat China’s documents to determine if there were significant differences between the Chinese\nand English; such discrepancies could potentially be notable because the Chinese version of the\ndocuments prevails over any versions of the documents in case of any inconsistency and\ndiscrepancy.38\n\n### 3.1.2 Structured Question Set\n\nWe assessed the collected privacy policies, terms of service documents, and acceptable use policies\nusing a structured question set. This question set is based on similar assessments that Citizen Lab\nresearchers have conducted in the past of telecommunications companies, fitness tracker companies,\nonline dating companies, and stalkerware companies.39 Assessment categories were divided into\nspecific questions pertaining to:\n\n\n-----\n\n**How Tencent presents and has developed its privacy policy: e.g., Is there a link to a privacy**\npolicy on the company’s webpage?,” “Is there a reference to compliance with: national privacy\nlaws, international guidelines, and/or self-regulatory instruments from associations?,” “Is there a\nstatement concerning which nation/court proceedings must go through?”\n**How Tencent addresses questions from its users of WeChat: e.g., “Is there a contact to a**\nprivacy officer listed?” and “Is there a description/discussion of who you can complain to if you’re\nunsatisfied with the information provided by the company?”\n**How Tencent captures personally identifiable information (PII): e.g., “Is there specification**\nabout the kinds of PII (i.e., information about the ‘users’) collected? If so, what types of\ncategories are listed?,” “Is there any distinction made between sensitive and non-sensitive PII?,”\nand “Are there specifications for where the information is stored?”\n**How, or under what conditions, Tencent might disclose collected data: e.g., “Is there a**\nspecification on the kinds of organizations that users’ information may be disclosed to?,” Does\nthe company use the term ‘sharing’ or ‘selling’ information to third parties?,” and “Does the\ncompany reserve the right to share information with other parties in the case that they suspect a\nlaw has been violated or to exercise the company’s own legal rights, or to remain compliant with\nthe law?”\n**Are there rationales under which Tencent might ‘hash’ the content of international users’**\n**communications?**\n**Are there rationales under which Tencent might block or censor content?**\n\nCombined, these questions were designed to help us understand the company’s compliance with laws\ndesigned to protect persons’ privacy, whether the company has processes in place to help individuals\nanswer questions about their privacy or business practices, the kinds of data that the company asserts\nit does collect and disclose to other parties, and specifically whether the policies permit or justify\nTencent’s hashing of communications content transmitted between non-China-registered accounts.\n\n### 3.1.3 Communication with Data Protection Office\n\nWe contacted Tencent’s international data protection office to seek further clarity concerning the\nprivacy policy and terms of use policies which applied to international users. We adopted this\nmethodology to better understand how the company interpreted its policies as well as to seek\nconfirmation or denial that it hashed the content of its international users’ communications. The letter\ncontained eight core questions; a copy of the letter is available in Appendix A.\n\nIn addition to seeking clarity concerning the company’s public policy documentation, we also sought to\nbetter understand the extent to which persons who were involved in Tencent’s international policy work\nunderstood, or were made aware of, how WeChat functionally operated. Specifically, we contacted the\ncompany after completing our experiments that showed communications between non-China\nregistered accounts were used to develop, enhance, or maintain the hash index that is used to censor\ncontent between China-registered account users. Additionally, we wanted to understand if the\ninternational data protection officer was aware of such surveillance of international users’\ncommunications content.\n\n## 3.2 Results\n\nThe following sections present the most significant findings that emerged from our policy assessment.\n\n\n-----\n\n### 3.2.1 General Policy Questions\n\nWeChat China’s and WeChat International’s websites both provided links to their respective services’\nprivacy policies or terms of service on the homepage of their respective websites. Links on WeChat\nChina’s homepage directed users to the Chinese versions of respective policies, and from there users\ncould choose to view the policies in other languages.\n\nWeChat China and WeChat International both included references to the national laws and regulations\nwith which the respective entities comply. In the case of WeChat China, the policies included general\nreferences to “relevant laws and regulations” without specifying the specific ones the company\ncomplied with, with exception of policies concerning content moderation.40 In the case of disputes,\nusers must submit them to the local people’s court41 in Nanshan District, Shenzhen City, Guangdong\nProvince of the People’s Republic of China.42\n\n\nIn contrast, WeChat International’s policies made reference to the Digital Millennium Copyright Act\n(DMCA) (i.e., US copyright law) and broad references to European laws, though the policies did not\nexplicitly cite the General Data Protection Regulation (GDPR). WeChat International’s policies\nasserted that the governing jurisdiction for any disputes or claims, with the exception of those that\npertained to US- and EU-based users, was the Hong Kong Special Administrative Region. The Hong\nKong International Arbitration Centre was responsible for conducting any arbitration between users\nand WeChat International. However, in cases of US-based users, the governing law and dispute\nresolution would take place in the state or federal courts of California, with trial by jury and class action\nlegal proceedings waived as a condition of using the service. For EU-based users, if the person was\nclassified as a “consumer” (per EU Direction 83/2011/EU) then disputes were to be referred to, and\nresolved by, “the court of the person’s place or residence of domicile.”43\n\nBoth WeChat China’s and WeChat International’s privacy policies made partial references to their\nterms of services and other applicable documents, including the Standards of Weixin Account Usage\nfor WeChat China users and the Acceptable Use Policy for WeChat International users. However, the\nentities did not always provide links to the relevant documents to which they referred. While WeChat\nChina linked to its terms of services in its privacy policy, its privacy policy did not provide links to the\nterms of services. In the case of WeChat International, its terms of service included links to the privacy\npolicy, and vice versa.\n\nWeChat China noted when the last updated date and effective date were for its privacy policy but it did\nnot do so for its terms of service. WeChat International provided information about when each of the\nrespective documents was last updated. Neither of the two entities provided access to historical\nversions of any of their policies.\n\n### 3.2.2 Engaging with Company Through Questions or Complaints\n\nWe examined whether WeChat China and WeChat International provided specific contact information\nso that users could communicate with the company, which they may want to do in order to better\nunderstand how the platform captures, processes, or stores their personal information.\n\nBoth WeChat China and WeChat International had dedicated legal contact information, though neither\nidentified a specific named privacy officer or point of contact. WeChat International explicitly noted that\nEU residents “have the right to lodge a complaint with [their] country’s data protection authority.”\n\n\n-----\n\nWhile WeChat China and WeChat International promised to protect users rights to access, correct,\nand delete personal information, they both included caveats.44 WeChat China provided a detailed\noperational guide in its privacy policy on how users can access, amend, or delete personal information\nand on how to withdraw permission within the application. In addition to data access, correction, and\nerasure, WeChat International outlined data portability features which were exclusively reserved for\nEU users.45\n\n### 3.2.3 Capture of Personal Information\n\nMany social media services are designed to collect vast quantities of personal information, some of\nwhich is intimately sensitive in nature. We examined whether WeChat China and WeChat International\nclearly indicated the types of information that they collected as well as whether they provided\nrationales for the collections. We also examined if there were specifications for where information was\nstored in these policies.\n\n\nWeChat China and WeChat International policies distinguished between sensitive personal\ninformation and non-personal information. WeChat China’s policy did not provide a definition of\npersonal information but did indicate the types of information it collected and, from among those,\nwhich constituted sensitive information.46 Notably, WeChat China asserted that in addition to the types\nof data it outlined in its policies, the company could collect and process relevant personal information\nwithout asking for users’ content under various circumstances.47 WeChat International defined\npersonal information as “any information, or combination of information, that relates to you, that can\nbe used (directly or indirectly) to identify you.”48 WeChat International further specified what types of\ninformation were regarded as “shared information” (i.e., “information about you or relating to you that\nis voluntarily shared by you on WeChat”). Of particular note, WeChat International recognized a\ndifference between ‘regular’ personal information and ‘sensitive’ personal information. Sensitive\npersonal information included that about “your race or ethnic origin, religious or philosophical views or\npersonal health” and “is subject to stricter regulation than other types of Personal Information…Before\ncommunicating any Personal Information of a sensitive nature within WeChat, please consider\nwhether it is appropriate to do so.”49 The WeChat International’s definition of sensitive personal\ninformation is contrasted against that in WeChat China’s, where sensitive information includes a user’s\nmobile phone number, voice biometrics, location information, movement (e.g., number of steps),\ncontact/friends information, and payment records.50 Furthermore, whereas search data were explicitly\ndefined as personal information in WeChat International’s policies, WeChat China did not make an\nequivalent specification.\n\nWeChat International stated that chat data, which constitutes “[c]ontent of communications between\nyou and another user or group of users” is “stored on your device and the devices of the users that\nyou have sent communications to. We do not permanently store this information on our servers and it\nonly passes through our servers so that it can be distributed to users you have chosen to send\ncommunications to.”51 WeChat China’s statement on the duration of data retention was relatively\nvague, noting that “in general, we will only keep your personal information for the time necessary to\nachieve a specific purpose.”52 Whereas WeChat International explained it only retained chat data for\n120 hours,53 WeChat China cited only two examples (i.e., “mobile phone number” and “information in\nMoments”54) to show how long it stored personal information. Specifically, users’ mobile phone\nnumbers are stored for as long as they use WeChat, and information in Moments is stored until a user\ndeletes the corresponding information.\n\n\n-----\n\nWeChat China noted that all personal information collected within the territory in China would be\nstored in China. For users of WeChat International, the personal information would be transferred to,\nstored, or processed in Ontario, Canada or in Hong Kong. The company provided justifications noted\nfor the choice of each location.55\n\n### 3.2.4 Disclosures of Information\n\nOne of the growing concerns over the global expansion of Chinese Internet companies which have\noperational entities in mainland China and overseas is whether user data collected outside of China is\nshared with members and affiliates of the company in China, China-based third-parties, or Chinese\nauthorities.56 The prospect of such sharing is particularly significant given that technical research,\ndiscussed in Section 2, revealed that non-China-registered accounts’ information was being subject to\ncontent surveillance for the purpose of extending what was censored for China-registered accounts.\nAs such, we examined WeChat China’s and WeChat International’s policies to determine the extent to\nwhich the companies asserted their rights to disclose collected information to third-parties and the\nconditions under which such disclosures were authorized.\n\n\nWe found that the clarification varied between the two entities with respect to the disclosure of\ninformation to third-parties and members or affiliates of Tencent. WeChat China made it clear that it\nwould not share users’ personal information with third-parties outside of Tencent.57 However, it was\nleft unclear how personal information would be shared among services owned by Tencent. We found\nthe opposite in WeChat International’s policies, where there were sometimes very clear specifications\nabout which Tencent-related group companies the application could share personal information.58\nWeChat International acknowledged that it shared user data with certain third-party service providers,\nas well, without specifying with whom or what types of information were shared.\n\nWeChat China and WeChat International acknowledged that they may share information with law\nenforcement organizations under certain conditions, though the level of specificity varies between the\ntwo companies. WeChat China strongly implied that it would disclose the user’s personal information\nto law enforcement organizations without specifying whether such disclosure would be conducted\nunder a court order or which organizations would potentially receive information (e.g., police\ndepartment based in the signing place of WeChat China agreements versus police departments based\nin any part of China).59 Moreover, the circumstances under which the company “may share, transfer,\nor publicly disclose personal information without prior consent of the subject of the personal\ninformation” were broadly defined.60 Though the entity did not specify which jurisdictions it would not\nshare information with, WeChat China did acknowledge that the governing jurisdiction was mainland\nChina.\n\n\nIn contrast, WeChat International stated that any disclosure of information to “government, public,\nregulatory, judicial and law enforcement bodies or authorities” would be carried out where the\ncompany “[is] required to comply with applicable laws or regulation, a court order, subpoena or other\nlegal process, or otherwise have a legal basis to respond to a request for data from such bodies, and\nthe requesting entity has valid jurisdiction to obtain [the user’s] personal information.”61 The company\ndid not commit to informing users about such disclosures. Similar to WeChat China’s policies, WeChat\nInternational did not specify any countries with whom data would not be shared.\n\n### 3.2.5 Behaviours of Hashing and Blocking User-Generated Content\n\n\n-----\n\nSocial media companies operating in China are known to control sensitive information in compliance\nwith local laws and regulations.62 As of early 2020, there are increasing concerns about how Chineseowned companies might exploit data generated outside mainland China or among their international\nusers in the face of domestic political pressure, such as to block the availability of certain content, or\nconduct surveillance of particular persons or classes of communications. We examined whether there\nwas any mention of, or justification for, performing hashing of communications content for the purpose\nof facilitating blocking access to content in either of WeChat China’s or WeChat International’s\npolicies.\n\nWe found that both companies discussed the possibility of retaining and using content for several\npurposes. WeChina China acknowledged that it “may use information collected by certain features for\n\n[…] other services” and that such practices were justified on the basis of enabling performance and\nservice optimization.63 In addition to stating that WeChat International and its affiliate companies “are\nallowed to retain and continue to use Your Content after you stop using WeChat,” WeChat\nInternational wrote in its terms of services that:\n\n“you are giving us and our affiliate companies a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide licence to use Your Content (with no fees or charges payable\nby us to you) for the purposes of providing, promoting, developing and trying to improve WeChat\nand our other services, including new services that we may provide in the future… As part of this\nlicence, we and our affiliate companies may, subject to the our WeChat Privacy Policy, copy,\nreproduce, host, store, process, adapt, modify, translate, perform, distribute and publish Your\nContent worldwide in all media and by all distribution methods, including those that are\ndeveloped in the future.”\n\n\nFurther, WeChat International might justify its hashing of content on the basis that doing so constitutes\nservices improvement and security protections. Specifically, the company’s policies stated that\nWeChat “may be required to retain or disclose Your Content in order to enforce these Terms or to\nprotect any rights, property or safety of ours, our affiliate companies or other users of WeChat.”64\n\nIn terms of blocking content, WeChat China asserted that Tencent would act in accordance with laws\nand regulations based on its “reasonable judgement” to “remove or obscure relevant contents at any\ntime without notice, impose punishment on the violating account including but not limited to warning,\nrestriction or prohibition of the use of some or all of the functions, account banning or cancellation, and\nannounce the results of treatment.”65 Similarly, WeChat International stated that it “may review (but\nmake no commitment to review) content (including any content posted by WeChat users) or third party\nprograms or services made available through WeChat to determine whether or not they comply with\nour policies, applicable laws and regulations or are otherwise objectionable. We may remove or refuse\nto make available or link to certain content or third party programs or services if they infringe\nintellectual property rights, are obscene, defamatory or abusive, violate any rights or pose any risk to\nthe security or performance of WeChat.”\n\n### 3.2.6 Data Protection Office Non-Response\n\n\nWe contacted WeChat’s international data protection office on January 20, 2020, using the contact\nemail that was provided in the company’s international Privacy Policy.66 We did not receive a\nresponse from the Office, including even an acknowledgment that they received our initial letter, by\n\n\n-----\n\nFebruary 3, 2020. As a result, we sent a reminder email on February 3, 2020; as of writing, we have\nstill not received any response from WeChat’s international data protection office to the questions\nposed to them.\n\n## 3.3 Discussion\n\nIt was easy to identify and access the international and China-specific versions of the privacy policies,\nterms of service, and associated documents linked with the WeChat service. Both China-registered\nand non-China-registered accounts were presented with data access, correction, and deletion\ncapabilities, indicating that the company was compliant with basic rights afforded under the Personal\nInformation Protection and Electronic Documents Act (PIPEDA), Canada’s data privacy legislation.\nSimilar rights are extended to persons living in European countries which are subject to the GDPR, or\ncountries with GDPR-like legislation.\n\nWhile it is clear from public information that content may be blocked for China-registered accounts, it\nis unclear how international data is used to enable content blocking or the policy rationale which\npermits the sharing of data used for blocking between international and China regions of WeChat. As\nper their policies, WeChat International does reserve the right to block content for its international\nusers. Specifically the company:\n\n“may review (but make no commitment to review) content (including any content posted by\nWeChat users) or third party programs or services made available through WeChat to determine\nwhether or not they comply with our policies, applicable laws and regulations or are otherwise\nobjectionable. We may remove or refuse to make available or link to certain content or third\nparty programs or services if they infringe intellectual property rights, are obscene, defamatory\nor abusive, violate any rights or pose any risk to the security or performance of WeChat.”67\n\nWhile WeChat China’s policy documents clearly permit a wide range of blocking and WeChat\nInternational’s policies appear to permit some sort of blocking, these policies at best explain the\nmotivation for content surveillance of non-China-registered users but do not enable it. In the remainder\nof this section, we discuss whether according to policy documents WeChat International is permitted\nto analyze non-China-registered users’ data for political sensitivity and whether WeChat International\nis permitted to share users’ data or the results of this analysis to entities in China.\n\n### 3.3.1 Enabling Content Surveillance\n\n\nThe international public-facing policy documents do include language that could permit\ncommunications content surveillance and, therefore, prospectively the hashing of the contents of\ncommunications for the purposes of developing or enhancing WeChat’s censorship system.\nSpecifically, the international policy documentation reveals that WeChat might review content, which\ncould be interpreted as permitting the company to assess content to derive hashes from it. The\ncompany, elsewhere, acknowledges that individuals may share “sensitive information” on WeChat,\n“such as information about your race or ethnic origin, religious or philosophical views or personal\nhealth” and that “content and information that you input to WeChat, such as photographs or\ninformation about your school or social activities, may reveal your sensitive Personal Information to\nothers.”68 WeChat is not providing an exclusive listing of what constitutes sensitive information; even\nwhat is listed, however, might be inclusive of political speech where it is aligned with philosophical\n\n\n-----\n\nviews. Further, sensitive information exists in multiple kinds of shared content and not just the text that\nis typed. As such, sensitive information—including communicating certain philosophical views—might\nbe found in photos and, presumably, documents or other kinds of files.\n\nAnalysis of international users’ communications are also authorized in the privacy policy and terms of\nservice documents that they agree to. WeChat International includes a standard, broadly\nencompassing, class of language which authorizes them to transmit users’ communications without\nrunning afoul of copyright claims. Specifically, the company’s public-facing documentation includes:\n\n“you are giving us and our affiliate companies a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide licence to use Your Content (with no fees or charges payable\nby us to you) for the purposes of providing, promoting, developing and trying to improve WeChat\nand our other services, including new services that we may provide in the future… As part of this\nlicence, we and our affiliate companies may, subject to the our WeChat Privacy Policy, copy,\nreproduce, host, store, process, adapt, modify, translate, perform, distribute and publish Your\nContent worldwide in all media and by all distribution methods, including those that are\ndeveloped in the future.”69\n\n\nWeChat might further justify analyzing content based on the assertion that the company “may be\nrequired to retain or disclose Your Content in order to enforce these Terms or to protect any rights,\nproperty or safety of ours, our affiliate companies or other users of WeChat.”70 Content might be\nretained per this language, as well as assessed, if it is found to infringe upon “any rights, property or\nsafety of ours” or the company’s “affiliate companies or other users of WeChat.” Specifically, without a\nbetter understanding of the way(s) in which WeChat’s international and China operations are\nassociated, such as whether they constitute affiliate companies or China-registered WeChat accounts\nare “other users of WeChat” per the international company’s terms of service and privacy policy, it is\nchallenging to definitively know if these elements of the company’s international public policy\ndocumentation authorize the analysis the content of international users’ communications for that which\nis ‘sensitive’ in China, or the hashing of such content of communications, or the sharing the results\nwith the Shenzhen-domiciled element of the company.\n\nIn contrast, the terms of services and privacy policies WeChat enforces on its China-registered\naccounts include a clear statement that would authorize the company to conduct content surveillance\nfor the purpose of content blocking. Specifically, WeChat China’s terms of services state that:\n\n“If Tencent finds or receives any report or complaint from others against the user on violation to\nthis Agreement, Tencent is entitled to remove or obscure relevant contents at any time without\nnotice, impose punishment on the violating account including but not limited to warning,\nrestriction or prohibition of the use of some or all of the functions, account banning or\ncancellation, and announce the results of treatment.” 71\n\n\nIn line with WeChat International’s documents which justify the analysis of international users’\ncommunications for security and performance improvement reasons, the language used in the policy\ndocuments pertaining to WeChat’s China-registered accounts allows Tencent to read and analyze\nusers’ communications.72\n\n\n-----\n\nIn conclusion, it remains highly plausible that WeChat could attempt to justify subjecting its\ninternational users’ communications to content surveillance based on the contents of the company’s\npublic-facing policy document. Moreover, the company can clearly engage in content surveillance of\nthe communications transmitted using China-registered accounts. To be entirely certain about the\npolicy rationale undergirding content surveillance of international users’ communications, however, the\ncompany’s international data protection officer would have needed to reply to our letter. We have not\nreceived a response as of this report’s publication date.\n\n### 3.3.2 Enabling Content or Metadata Disclosure\n\nIn specifically assessing the policies to ascertain whether they do, or do not, permit the disclosure of\ninternational users’ communications content or metadata to parties in China, we found that the\npermissibility of such disclosures remained ambiguous. On the one hand, the international entity\ndenoted a specific list of subsidiary international organizations with whom it might disclose\ninformation, and then more broadly identified classes of external organizations—such as those that\nenable SMS delivery or VoIP functionality—that might receive information about the user or their\nusage of WeChat. It is possible that these subsidiary or third-party organizations might, themselves,\nhave disclosure policies that include sharing information about international users’ communications\nwith a China-based organization that ultimately routes data to WeChat’s China-based entity. However,\nif this is the case, and presuming it is typical behaviour, then the failure to specify such practices\nwould be misleading to someone who had read the privacy policy and terms of service with the intent\nof learning how the company typically handled users’ communications. Should such disclosures be\nsufficiently irregular that they do not merit including information about them in the public-facing policy\ndocuments, then WeChat could and should notify individuals that data is being disclosed when it takes\nplace, such as through in-app dialogues or automated chat sessions initiated by the company.\nUltimately, then, while it is possible that the public-facing policy documents might authorize the sharing\nof international users’ data with WeChat China, the prospect of this sharing is not clear or apparent\nfrom reading these policies.\n\nSimilarly ambiguous is how WeChat’s China-based entity handles communications between its China\nand international users. The policy documents pertaining to WeChat’s users with a China-registered\naccount state that the company “may use information collected by certain features for our other\nservices.” Whereas these policy documents make it clear that Tencent does not share or transfer\npersonal information to third parties outside of Tencent, it is left unclear how or whether information\nand contents of internationally-based users of Tencent-affiliated services are shared within the\ncompany.\n\nIn summary, it remains unclear on what basis the hashes of international users’ communications might\nbe disclosed to WeChat China. To be certain on what basis, if any, WeChat justifies the sharing of\nhashes between the international and China-specific iterations of WeChat, the company’s international\ndata protection officer would have had to reply to the letter we issued to them. As of publication,\nhowever, the company has failed to even acknowledge their receipt of the messages we have sent\nthem, let alone respond to the questions we posed to the company.\n\n## Part 4. Data Access Request Assessment\n\n\n-----\n\nTencent is subjected to the Personal Information Protection and Electronic Documents Act (PIPEDA)\nbecause it has a substantial commercial connection to Canada by merit of doing business with\npersons residing in Canada and because some of the company’s data centres are located in\nCanada.73 Principle 4.9 of PIPEDA outlines Canadians’ access and correction rights; Canadians have\na right to “be informed of the existence, use, and disclosure of their personal information and be given\naccess to that information.”74 Individuals may have to prove their identity so that companies can\nretrieve their information. Organizations must provide some response to the requester within thirty\ndays and may (as part of that response) inform requesters that the company is availing itself of an\nadditional thirty days to prepare a response. Access should be provided at a minimum, or zero, cost.\n\nIn this section of the report, we discuss and assess the findings which emerged from filing a PIPEDAbased data access request upon Tencent’s international business. Overall, while we found that there\nwas a limited data export tool that employees were quick to help us use, the employees would not\nrespond to questions about data not contained in the export tool, inclusive of how images were\nhashed, or whether such hashes were shared with WeChat China.\n\n## 4.1 Methodology\n\n\nOne of the project researchers created a non-China-registered WeChat account. From this account,\nthe researcher communicated with other accounts which our team created, all of which were\nregistered internationally.75 Specifically, the researcher transmitted unique and sensitive chat\nmessages, documents, and images in a group chat which contained two other non-China-registered\naccounts. To confirm that the hashes of the documents and images were added to the hash index, a\npair of experiments were conducted, as discussed in Section 2.\n\nWe used PIPEDA-based data access requests to better understand the kinds of personal information\nthat Tencent collects when an international user installs WeChat and uses the service. In particular, we\nexplored whether such requests could be used to reveal to international users that the content of their\ncommunications were being used to develop the hash index which was used to censor the\ncommunications of China-registered accounts.\n\nThe researcher filed two rounds of personal information requests. The first round entailed two\nseparate emails: one to Tencent’s international data protection office, and the second to Tencent’s\nChina-based data protection office. The second round entailed a single follow-up email to Tencent’s\ninternational data protection office.\n\n### 4.1.1 Round One Data Access Request\n\nThe first request asked questions about the different kinds of data which might be collected in the\ncourse of using WeChat, inclusive of geolocation information, IP address logs, subscriber information,\npersonally identifiable information, as well as any information pertaining to communications between\nusers, any MD5 hashes of the content of communications exchanged using WeChat, or whether any\ncommunications sent using WeChat had been found to violate Tencent’s terms of service and, if so,\nwhether such violations pertained to violations associated with users who were located in China. The\nrequest also asked the company to disclose whether the content of any communications, or hashes\nderived from such communications, had been used to enable or optimize the detection of terms of\nservice violations for users located in the People’s Republic of China or any other jurisdiction. The\nrequest, finally, asked Tencent to disclose if any personal information, or information about the\n\n\n-----\n\nresearcher s account or devices, had been shared with any other third-parties and, in the request\nmade to Tencent Singapore, specifically whether it had been shared or disclosed with Shenzhen\nTencent Computer Systems Company Limited. Shenzhen Tencent Computer Systems Company\nLimited is the portion of the company that is domiciled in the People’s Republic of China and, thus, is\nrequired to comply with Chinese law that mandates the blocking of particular content that is\ncommunicated using WeChat. The letter cited PIPEDA and informed Tencent of its requirement to\nrespond within thirty days and at a minimal cost.\n\nCopies of this request as sent to the Tencent Shenzhen and Tencent Singapore data protection offices\nare available in Appendices B and C, respectively.\n\n### 4.1.2 Round Two Data Access Request\n\nAfter receiving an initial response—discussed in Section 4.2—another letter was sent which reiterated\nrequests for the below data:\n\nCommunications between the researcher and other users.\nThe geographic location where data which the researcher contributed to the WeChat social\nnetwork was stored and, more specifically, whether any of the data was stored in the People’s\nRepublic of China.\nSocial networking information, inclusive of MD5 hashes or other hashes computed upon the\nresearcher’s chat messages, images, or files sent using the service.\nResults indicating whether any of the chat messages, images, or files sent using the service had\nbeen determined to violate the company’s terms of service and, if so, the basis for which these\nmessages were categorized as violating the terms of service.\n\nIn cases where the data was not retained, the researcher asked that Tencent positively confirm that\nthe data was not retained.\n\nThe follow-up letter also asked Tencent to disclose “whether (and, if so, which of) any of my chat\nmessages, images, or files sent using your service, or any hashes computed upon these items, have\nbeen used for the purposes of detecting terms of service violations for users located in the People’s\nRepublic of China or any other jurisdiction” as well as “whether (and, if so, which of) any of my chat\nmessages, images, or files sent using your service, or any hashes computed upon these items, have\nbeen shared with, or disclosed to, Shenzhen Tencent Computer Systems Company Limited either by\nTencent International Service Pte. Ltd. or a subsidiary, and to which other parties in China or outside\nChina (inclusive of all subsidiaries) with whom this data has been shared.”\n\nA copy of this letter is in Appendix D.\n\n## 4.2 Data\n\nThe first data access request (“PIPEDA request”) was sent on November 29, 2019, to the email\naddress associated with the Tencent Shenzhen and Tencent Singapore data protection offices. Our\ninteractions with Tencent Singapore took place according to the following timeline:\n\nDecember 2: Tencent provided instructions to access and use WeChat’s “Export Personal Data”\ntool\n\n\n-----\n\nDecember 2: Researcher informed Tencent that, although they were using the latest version of\nthe app, they could not find an “Export Personal Data” tool using the provided instructions\nDecember 5: Tencent responded that they can facilitate the data export but, to do so, the\nresearcher had to verify their identity. Identity verification was based on providing eight different\nitems for verification. Tencent requested that the researcher provide as many as possible\nDecember 5: Researcher provided Tencent with the eight items for verification\nDecember 16: Tencent responded by directing the researcher to paste a link76 into a WeChat\nchat and to open the URL in WeChat to export the personal data\nDecember 18: The researcher followed the instructions. Using the export tool accessible from\nthe link, the researcher was required to confirm their email address. After confirming their email\naddress, the researcher was automatically emailed a link to a web page that provided a\ndownloadable *.zip file that contained information pertaining to the researcher’s use of the\napplication\n\nThe *.zip included the following information:\n\nPersonal account information: WeChat ID, Registration Region, Linked Accounts (i.e., email\nattached to the account), Registration Time, and Phone Number.\nContact Data: Friends and Group Chat Contacts. No accounts were listed under the latter\ncategory.77\nMoments Data: My Moments, My Comments and Likes, Hide My Moments, and Hide User’s\nMoments. No information was provided in this category, presumably because the researcher did\nnot use these aspects of WeChat.\nLocation and Login Information: Location Information and Login Devices. The latter identified the\nmobile device the researcher used while interacting with WeChat, whereas no information was\npresented for the former category.\n\nInformation which was requested in the initial letter but not provided in the response included:\n\nIP address log information\nInformation pertaining to whether and, if so, how the researcher’s communications data was\nused to generate the censorship index for China-registered accounts\nInformation of whether information about the researcher—inclusive of account information,\ncommunications content, or MD5 hashes of their content—had been shared with any thirdparties\n\nThe second round of the data access request sent on December 18 reiterated that the researcher\nsought access to information discussed in Section 4.1.2. No subsequent communications have been\nreceived by Tencent Singapore as of the time of publication.\n\nAt no point did the researcher receive a response to the letter that they issued to Tencent Shenzhen.\n\n## 4.3 Discussion\n\nThe data which Tencent Singapore provided to the researcher fell short of the information which had\nbeen requested. Most notably, it excluded information that was principally sought concerning the\nextent to which, and rationales upon which, derived elements of the researcher’s communications\nmight have been communicated to other parties such as Tencent Shenzhen. This failure took place\n\n\n-----\n\ndespite the researcher s repeated engagements with Tencent Singapore employees; they were\nactively involved in communicating with the researcher to guide them to the Export Personal Data tool,\nbut failed to provide substantive communications concerning the most pressing of the researcher’s\nquestions about the company’s data handling practices.\n\nTencent Singapore’s response, which directed users to a data export tool, parallels past experiences\nof researchers who have sought access to information retained by other companies, including fitness\ntracker companies and social media companies. Specifically, data export tools have been shown to\nnot include all of the information that users provide to services, and companies routinely fail to answer\nquestions about data collection, processing, and storage beyond what is presented through data\nexport tools.78 However, in the case of Tencent there is evidence—as denoted in Section 2—that\neither the Singapore or Shenzhen part(s) of the company are using non-China-registered users’\ncommunications to develop a hash index that is subsequently applied to censor communications\nbetween a subset of Tencent’s user base: those who have registered their accounts in China.\n\n\nMoreover, in cases where individuals are specifically asking about how their communications are\ntreated—in this case, whether and why the contents of communications are subject to content\nsurveillance and where the content of communications are stored—it is reasonable for a company to\nprovide such information in a good faith effort to explain its data processing practices. The terms of\nservice and privacy policy which applied to the service were ambiguous in how the company handled\nusers’ data. Thus, the questions that were posed by our researcher constituted the sole remaining\nnon-technical method that individuals might use to understand WeChat’s international data collection,\nprocessing, and storage activities.79\n\nTo explain the company’s handling of user data, it might have crafted a specific letter or other\ncommunication to a user. It might also have directed the user to a specific part of a company’s privacy\npolicy or terms of service document to clarify how the company might interact with the contents of\nusers’ communications. Tencent Singapore did not engage in either of these types of clarifying\nactivities, preventing international users of the WeChat service from understanding how the company\ntreats the contents of their communications, knowing who has access to or obtains the contents of\ntheir communications or derivations of them, or even where data is being stored.\n\n## Part 5 – Conclusion\n\nIn this report, we present technical experiments which reveal that WeChat communications that are\nconducted entirely among non-China-registered accounts are subject to content surveillance. We\nfound that documents and images that were transmitted entirely among non-China-registered\naccounts were analyzed for Chinese political sensitivity. Upon analysis, files deemed politically\nsensitive were used to invisibly train and build up WeChat’s Chinese political censorship system. We\nalso conducted analysis of WeChat’s public-facing policy documents, made data access requests, and\nengaged with Tencent data protection representatives to assess whether those methods could also\nexplain, or uncover, the content surveillance carried out towards international users’ communications.\nWe found that none of the information WeChat makes available to users explains the rationales for\nsuch surveillance or the transmission of content hashes from WeChat International to WeChat China.\n\nThe failure of data protection officials to respond to our questions regarding WeChat’s privacy policies\nis particularly notable given that Tencent staff were initially quick to assist our researchers in using an\nautomated data-export tool associated with WeChat’s commitment to facilitate access, modification,\n\n\n-----\n\nand removal of international users content. Perhaps, however, the failure is less surprising given that\nthe same staff were unwilling to provide any assistance or information above and beyond helping us\nuse this tool: our more specific data access request questions were never acknowledged, let alone\nresponded to.\n\nCompanies operating around the world staff their companies with privacy and data protection\nprofessionals to, in part, ensure that questions about companies’ policies can be addressed. In the\ncase of WeChat’s international operations, however, it remains unclear to whom users can turn if they\nwant to understand the company’s policies. In the case of WeChat’s failure to explain its content\nsurveillance policies, as well as the apparent retention of hashes of content even after a user has\nrecalled it, makes clear that the company must more meaningfully communicate with its users.\nHowever, as of today, individuals clearly cannot turn to the designated staff working at WeChat\ninternational and speak to individuals that users would rightly expect to be able to answer these kinds\nof questions.\n\nTencent has not only failed to explain to its international users how their communications content is\nbeing used to facilitate the censorship apparatus that is applied to China-registered WeChat accounts,\nbut the company has also failed to explain, or clarify, whether international users’ communications\ncontent are subject to surveillance that is not associated with the censorship of content that is deemed\nsensitive in China. Put another way, the content surveillance and hashing system we discuss in this\nreport is at least part of the broader censorship system which has been fully deployed towards Chinaregistered accounts. The infrastructure for hashing communications between internationally registered\naccounts exists and could, in theory, be (re)purposed to hash additional kinds of sensitive files (e.g.,\nfiles associated with terrorism or child abuse imagery or leaked documents which governments do not\nwant to have circulated about their operations). It is unclear how challenging it would be to repurpose\nthe existing system(s) for determining what is, and is not, sensitive content, nor whether significant\nengineering efforts would be required to integrate the censorship system that is currently applied to\nChina-registered accounts to internationally registered accounts.\n\nGranted, social media surveillance and content moderations are not unique to WeChat. Surveillance\nconstitutes a fundamental feature of all mainstream profit-oriented social media businesses.80 As\ncompanies push to grow products internationally, they will inevitably experience pressures from\ngovernments to remove content or provide user data, as demonstrated by the requests documented in\nannual corporate transparency reports.81 In the case of China, attention is typically centered on\nforeign companies that are attempting to enter the Chinese market and must decide whether and how\nto comply with the government’s strict content regulations. Recent revelations of Google working on a\nsearch engine to enable geographically-based filtering features in an effort to re-enter China is but the\nlatest example.82\n\n\nWhile content surveillance and content moderation are ubiquitous across social media platforms, our\nresearch findings point to a worrying situation where globalized companies extend information controls\nbeyond the borders of their home country and incorporate these practices into general product\ndesigns and business operations. There are at least three potential reasons why Tencent has\ndesigned its surveillance and censorship system in such a way. First, it may have been an intentional\ndesign decision for the purpose of complying with China’s political and regulatory restrictions (e.g.,\nonly using communications among China-registered accounts to train their censorship system may be\nineffective if those users are prevented from engaging in the very censored topics needed to train the\nsystem) Second it may be a side effect of technical efficiency considerations (e g it may be simpler\n\n\n-----\n\nto engineer a platform that performs political content surveillance on all communication versus only on\nsome). Finally, it may be a side effect of a content blocking system enabled for non-China-registered\nusers which does not block Chinese political content but possibly does block other kinds (e.g.,\npossibly terrorism content or pornography). In the case of our findings, there is no evidence attributing\nTencent’s surveillance behaviours enforced on international WeChat users to the direction of the\nChinese government. We cannot conclusively determine which of these scenarios is true and it is\npossible there are other explanations that we have not considered. Regardless of the reasons, the\nimplications of our research are clear: users of WeChat are not provided sufficient transparency into\nhow their data is used to understand whether and how their data enables political censorship in other\njurisdictions.\n\nBuilding on the findings in this report, there are multiple avenues for future research. The technical\nexperiments that we developed are capable of detecting content surveillance of documents and\nimages on WeChat. However, our methodology, insofar as it relies on using WeChat’s censorship\nhash index as a side channel, cannot be used to test whether there is surveillance of chat message\ntext sent entirely among non-China-registered accounts. WeChat automatically censors chat message\ncontents from or to China-registered accounts if they contain a blacklisted keyword combination, but it\nis currently an open question as to how WeChat generates or maintains these keyword combination\nblacklists. These keyword blacklists may be generated from users’ communications similarly to how\nthe hashes of users’ images and documents populate WeChat’s censorship hash index. Further\nresearch is required to explore if these keyword blacklists are built up from chat text sent among nonChina-registered users in the same way as these users’ communications contribute to the document\nand image hash index.\n\nFurthermore, our report looked at one platform, Tencent’s WeChat, and found that Tencent uses nonChina-registered users’ communications to build up its censorship system. Future work is required to\nunderstand if this behaviour is unique to Tencent or if it is common for internationally operating\nChinese social media companies to use communications among their non-Chinese users to\nimplement Chinese political censorship.\n\n## Acknowledgments\n\nWe would like to thank Abbas Razaghpanah for valuable external feedback and Mari Zhou for\ngraphics design. We would also like to thank Miles Kenyon, Masashi Crete-Nishihata, and Mari Zhou\nfor editing, design, and comments.\n\nThis project was supported by Open Society Foundations.\n\n## Appendix\n\n A. Letter to WeChat Data Protection Office\n\nAttn: Data Protection Officer\n\nTencent International Service Pte. Ltd.\n\n10 Anson Road\n\n\n-----\n\n#21-07 International Plaza\n\nSingapore\n\n079903\n\nDear Tencent Data Protection Officer,\n\nI am writing to you to learn more about how Tencent International handles and manages the data\nwhich is communicated by its users. Specifically, and in light of allegations concerning how competing\nservices such as TikTok may be censoring certain classes of content, I want to better understand the\ndivision of the communications services provided to domestic Chinese users of WeChat versus the\nservices provided to international users of WeChat’s communications services.\n\nI am particularly curious to know whether any of the communications content or metadata that\nWeChat’s international users send to other international users is ever used to update, modify, or\notherwise interact with the blocklists that Tencent is lawfully required to apply to communications\nbetween domestic Chinese WeChat users. In reading your company’s international terms of service\nand privacy policy, it seemed like the respective policies might permit such activities. The specific\nquestions that I have about Tencent International’s communications service offerings follow.\n\n1. In the discussion of “Types of Information We Process”, Tencent International acknowledges that\n\nit collects log information such as metadata, which is “information related to items you have\nmade available through WeChat, such as the date, time or location that a shared photograph or\nvideo was taken or posted.” Would such metadata include a hash of the files or other contents\nshared using WeChat communications services? And, if so, could such hashes be used in the\ndevelopment or maintenance of the domestic blocklist system that WeChat is lawfully obligated\nto apply to its domestic Chinese users?\n2. In the discussion on how Tencent International processes its users’ information, there is a\n\nsection entitled “Pseudonymised and Aggregated Data”, which notes that some activities are\nundertaken within the app to facilitate fraud detection and undertake account safety analysis.\nDoes, or would, this section authorize Tencent International to process communications between\nits international users for the purpose of developing the domestic blocklist system that Tencent is\nlawfully obligated to apply to its domestic Chinese users?\n3. In the WeChat Privacy Policy, Tencent International acknowledges that it may share information\n\nwith government, public, regulatory, judicial and law enforcement bodies or authorities “where we\nare required to comply with applicable laws or regulations, a court order, subpoena or other legal\nprocess, or otherwise have a legal basis to respond to a request for data from such bodies, and\nthe requesting entity has valid jurisdiction to obtain your personal information”. Has Tencent\nInternational ever, or does Tencent International currently, disclose information pertaining to\ninternational WeChat users to such bodies in China, for the purposes of complying with legal\nrequests directed at enhancing, developing, or maintaining the blocklists that Tencent is lawfully\nobliged to apply to its domestic Chinese users?\n\n\n-----\n\n4. The WeChat Privacy Policy denotes a range of international Tencent subsidiaries with whom\n\ninternational WeChat users’ information might be shared. Is it the case that no log data, nonpersonal data, personal information, or shared information is disclosed to Tencent’s Shenzhenoperated domestic business? If information is shared between the Tencent international\nbusinesses which are involved in the operation of the communications service offered to\ninternational users, can you clarify which specific information is provided and how it is classified\nby the company (i.e., as log data, non-personal data, personal information, or shared\ninformation)?\n5. The WeChat Terms of Service document indicates that Tencent International’s business may\n\n“share Your Content with third parties that we work with to help provide, promote, develop and\nimprove WeChat in accordance with the WeChat Privacy Policy”. Can you confirm that such\nsharing does not include the disclosure of log data, non-personal data, personal information, or\nshared information with Tencent’s China-domiciled business operations? If some data is shared\nfrom the international business with the China-domiciled business operations, can you clarify\nwhat data is specifically shared and the purposes behind such sharing processes?\n6. The WeChat Terms of Service document indicates that Tencent International “may be required to\n\nretain or disclose Your Content in order to enforce these Terms or to protect any rights, property\nor safety of ours, our affiliate companies or other users of WeChat.” Can you clarify whether,\nunder these terms, Tencent International would be permitted to share an international user’s\ncontent with the China-domiciled elements of Tencent’s business operations? And, if these terms\nwould authorize such sharing, whether and under what conditions such sharing would take\nplace?\n7. The WeChat Terms of Service document denotes that Tencent International’s international users\n\nprovide the company and its affiliate companies “a perpetual, non-exclusive, transferable, sublicensable, royalty-free, worldwide license to use Your Content (with no fees or charges payable\nby us to you) for the purposes of providing, promoting, developing and trying to improve WeChat\nand other services … As part of this license, we and our affiliate companies may, subject to the\nWeChat Privacy Policy, copy, reproduce, host, store, process, adapt, modify, translate, perform,\ndistribute and publish Your Content worldwide in all media and by all distribution methods[.]” Can\nyou clarify whether, under these terms, Tencent International would be permitted to share an\ninternational user’s content with the China-domiciled elements of Tencent’s business\noperations? And, should these elements of the Terms of Service document authorize such\nsharing of an international user’s data with the China-domiciled elements of Tencent’s business\noperations, would such data ever be shared for the purposes of enhancing, developing, or\nmaintaining the blocklists that Tencent is lawfully obliged to apply to its domestic Chinese users?\n8. The aforementioned questions have, generally, sought to understand whether there are terms,\n\nconditions, or policies which would authorize Tencent International’s businesses to share\ninternational user’s log data, non-personal information, personal information, shared information,\nor other classes of information to Tencent’s China-domiciled businesses, or any other Tencent\nbusinesses operating within the People’s Republic of China. Is it the case that such international\nusers’ information is never transmitted to the China-domiciled businesses, or any other Tencent\nbusinesses or affiliates operating within the People’s Republic of China, for the purposes of\nenhancing, developing, or maintaining the blocklists that Tencent is lawfully obliged to apply to\nits domestic Chinese users?\n\n\n-----\n\nThank you for your attention to these questions, and in advance for the time that you may commit in\nresponding to these questions. If you have any additional questions regarding this letter, please feel\nwelcome to contact me at: [Researcher email address].\n\nBest Regards,\n\n[Name]\n\n## B. PIPEDA Data Request to Shenzhen Tencent Computer Systems Company Limited\n\nNovember 29 2019\n\nShenzhen Tencent Computer Systems Company Limited\n\nTencent Legal Department (Privacy & Data Protection Centre)\n\nTencent Building, Kejizhongyi Avenue, Hi-tech Park, Nanshan District, 518057 Shenzhen, People’s\nRepublic of China\n\nRe: Subject access request\n\nDear Sir or Madam,\n\nI am a customer of WeChat, and I am interested in both learning more about your data management\npractices and the personal data you process about me. This is a request to access my personal data\nunder Principle 4.9 of Schedule 1 and section 8 of Canada’s federal privacy legislation, the Personal\nInformation Protection and Electronic Documents Act (PIPEDA).\n\nI am requesting a copy of all records which contain my personal information from your organization.\n\nThe following is a non-exclusive listing of all information that your organization may hold about me,\nincluding the following:\n\n**Mobile app data: Information collected about me, or persons/devices associated with my**\naccount, using one of your company’s mobile device applications\n**Geolocation data: collected about me, my devices, and/or associated with my account (e.g.**\nGPS information, cell tower information)\n**IP address logs: associated with me, my devices, and/or my account (e.g. IP addresses**\nassigned to my devices/router, IP addresses or domain names of sites I visit and the times,\ndates, and port numbers)\n**Subscriber information: that you store about me, my devices, and/or my account**\n**Personally identifying information: that is unique to me, my devices, and/or my account, such**\nas name, email addresses, phone numbers, responses to relationship questions, or device\nidentifiers.\n\n\n-----\n\n**Any additional kinds of information: that you have collected, retained, or derived from the**\nmobile or website services you provide, including but not limited to:\n\ncommunications between myself and other users;\nsocial networking information, inclusive of MD5 hashes or other hashes computed upon\nmy chat messages, images, or files sent using your service;\nwhether any of the chat messages, images, or files sent using your service have been\ndetermined to violate your terms of service and, if so, whether any such terms of service\nviolations pertain to violations associated with users who are located in the People’s\nRepublic of China; and\nwhether any of my chat messages, images, or files sent using your service, or any hashes\ncomputed upon these items, have been used to enable/optimize detecting terms of service\nviolations for users located in the People’s Republic of China or any other jurisdiction.\n**Disclosures to third parties: Any information about disclosures of my personal information, or**\ninformation about my account or devices, to other parties, including law enforcement and other\nstate agencies. I am specifically interested in knowing whether and which of my information has\nbeen shared with, or disclosed to, Tencent International Service Pte. Ltd., and to which parties in\nChina or outside China with whom my data has been shared.\n\nIf your organization has other information in addition to these items, I formally request access to that\nas well. If your service includes a data export tool, please direct me to it, and ensure that in your\nresponse to this letter, you provide all information associated with me that is not included in the output\nof this tool. Please ensure that you include all information that is directly associated with my name,\nphone number, e-mail, or account number, as well as any other account identifiers that your company\nmay associate with my personal information. Finally, please provide this data, where possible, in a\nstructured and non-proprietary digital format.\n\nYou are obligated to provide copies at a free or minimal cost within thirty (30) days of receipt of this\nmessage. If you choose to deny this request, you must provide a valid reason for doing so under\nCanada’s PIPEDA. Ignoring a written request is the same as refusing access. See the guide from the\n[Office of the Privacy Commissioner at: http://www.priv.gc.ca/information/guide_e.asp#014. The](http://www.priv.gc.ca/information/guide_e.asp#014)\nCommissioner is an independent oversight body that handles privacy complaints from the public.\n\nPlease let me know if your organization requires additional information from me before proceeding\nwith my request.\n\nHere is my information that may help you identify my records:\n\nFirst Name: [name]\nLast Name: [name]\nEmail Address: [email address]\nTelephone Number: [phone number]\n\nSincerely,\n\n[name]\n\n## C. PIPEDA Data Request to Tencent International Service Pte. Ltd., #1\n\nNovember 29 2019\n\n\n-----\n\nTencent International Service Pte. Ltd.\n\n10 Anson Road, #21-07 International Plaza, Singapore 079903\n\nRe: Subject access request\n\nDear Sir or Madam,\n\nI am a customer of WeChat, and I am interested in both learning more about your data management\npractices and the personal data you process about me. This is a request to access my personal data\nunder Principle 4.9 of Schedule 1 and section 8 of Canada’s federal privacy legislation, the Personal\nInformation Protection and Electronic Documents Act (PIPEDA).\n\nI am requesting a copy of all records which contain my personal information from your organization.\n\nThe following is a non-exclusive listing of all information that your organization may hold about me,\nincluding the following:\n\n**Mobile app data: Information collected about me, or persons/devices associated with my**\naccount, using one of your company’s mobile device applications\n**Geolocation data: collected about me, my devices, and/or associated with my account (e.g.**\nGPS information, cell tower information)\n**IP address logs: associated with me, my devices, and/or my account (e.g. IP addresses**\nassigned to my devices/router, IP addresses or domain names of sites I visit and the times,\ndates, and port numbers)\n**Subscriber information: that you store about me, my devices, and/or my account**\n**Personally identifying information: that is unique to me, my devices, and/or my account, such**\nas name, email addresses, phone numbers, responses to relationship questions, or device\nidentifiers.\n**Any additional kinds of information: that you have collected, retained, or derived from the**\nmobile or website services you provide, including but not limited to:\n\ncommunications between myself and other users;\nsocial networking information, inclusive of MD5 hashes or other hashes computed upon\nmy chat messages, images, or files sent using your service;\nwhether any of the chat messages, images, or files sent using your service have been\ndetermined to violate your terms of service and, if so, whether any such terms of service\nviolations pertain to violations associated with users who are located in the People’s\nRepublic of China; and\nwhether any of my chat messages, images, or files sent using your service, or any hashes\ncomputed upon these items, have been used to enable/optimize detecting terms of service\nviolations for users located in the People’s Republic of China or any other jurisdiction.\n**Disclosures to third parties: Any information about disclosures of my personal information, or**\ninformation about my account or devices, to other parties, including law enforcement and other\nstate agencies. I am specifically interested in knowing whether and which of my information has\nbeen shared with, or disclosed to, Shenzhen Tencent Computer Systems Company Limited, and\nto which other parties in China or outside China with whom my data has been shared.\n\n\n-----\n\nIf your organization has other information in addition to these items, I formally request access to that\nas well. If your service includes a data export tool, please direct me to it, and ensure that in your\nresponse to this letter, you provide all information associated with me that is not included in the output\nof this tool. Please ensure that you include all information that is directly associated with my name,\nphone number, e-mail, or account number, as well as any other account identifiers that your company\nmay associate with my personal information. Finally, please provide this data, where possible, in a\nstructured and non-proprietary digital format.\n\nYou are obligated to provide copies at a free or minimal cost within thirty (30) days of receipt of this\nmessage. If you choose to deny this request, you must provide a valid reason for doing so under\nCanada’s PIPEDA. Ignoring a written request is the same as refusing access. See the guide from the\n[Office of the Privacy Commissioner at: http://www.priv.gc.ca/information/guide_e.asp#014. The](http://www.priv.gc.ca/information/guide_e.asp#014)\nCommissioner is an independent oversight body that handles privacy complaints from the public.\n\nPlease let me know if your organization requires additional information from me before proceeding\nwith my request.\n\nHere is my information that may help you identify my records:\n\nFirst Name: [name]\nLast Name: [name]\nEmail Address: [email address]\nTelephone Number: [phone number]\n\nSincerely,\n\n[name]\n\n## D. PIPEDA Data Request to Tencent International Service Pte. Ltd., #2\n\n\nNovember 29 2019\n\n\n83\n\n\nTencent International Service Pte. Ltd.\n\n10 Anson Road, #21-07 International Plaza, Singapore 079903\n\nDear Data Protection/Privacy Officer,\n\nThank you for providing me access to your data export tool. However, the data provided by this tool\ndid not include all of the data that I requested.\n\nFor the following items, please provide a copy of all retained data:\n\ncommunications between myself and other users;\nwhere data which I contribute to the WeChat social network is stored and, more specifically,\nwhether any of my data is stored in the People’s Republic of China;\nsocial networking information, inclusive of MD5 hashes or other hashes computed upon my chat\nmessages, images, or files sent using your service; and\n\n\n-----\n\nresults indicating whether any of the chat messages, images, or files sent using your service\nhave been determined to violate your terms of service and, if so, the basis for which these\nmessages were categorized as violating the terms of service;\n\nFor any listed items for which you do not retain data, please explicitly indicate that you do not retain\nthis data.\n\nI am also interested in how my personal information is being used. Specifically, I wish to know whether\n(and, if so, which of) any of my chat messages, images, or files sent using your service, or any hashes\ncomputed upon these items, have been used for the purposes of detecting terms of service violations\nfor users located in the People’s Republic of China or any other jurisdiction. For any of these items not\nused for this purpose, please explicitly indicate that you do not use this data for this purpose.\n\nFinally, I am interested in knowing how my personal information is being shared. I am specifically\ninterested in knowing whether (and, if so, which of) any of my chat messages, images, or files sent\nusing your service, or any hashes computed upon these items, have been shared with, or disclosed\nto, Shenzhen Tencent Computer Systems Company Limited either by Tencent International Service\nPte. Ltd. or a subsidiary, and to which other parties in China or outside China (inclusive of all\nsubsidiaries) with whom this data has been shared. For any of these items not shared with other\nparties, please explicitly indicate that you do not share this data with other parties.\n\nFor your convenience I have attached a copy of my original letter.\n\nSincerely,\n\n[name]\n\n1. Greg Roumeliotis, Yingzhi Yang, Echo Wang and Alexandra Alper, (2019), “US opens national\n\nsecurity investigation into TikTok,” CNBC (November 1, 2019)\n<https://www.cnbc.com/2019/11/01/us-to-investigate-tiktok-over-national-security-concernssources-say.html>; Raymond Zhong, (2019), “TikTok’s Chief Is on a Mission to Prove It’s Not a\nMenace,” New York Times (November 18, 2019)\n<https://www.nytimes.com/2019/11/18/technology/tiktok-alex-zhu-interview.html>; William Feuer,\n(2019), “TikTok says it doesn’t censor content, but a user was just locked out after a viral post\ncriticizing China,” CNBC (November 26, 2019) <https://www.cnbc.com/2019/11/26/tiktok-says-itdoesnt-censor-but-a-user-who-criticized-china-was-locked-out.html>; Drew Harwell and Tony\nRomm, (2019), “Inside TikTok: A culture clash where U.S. views about censorship often were\noverridden by the Chinese bosses,” Washington Post (November 5, 2019)\n<https://www.washingtonpost.com/technology/2019/11/05/inside-tiktok-culture-clash-where-usviews-about-censorship-often-were-overridden-by-chinese-bosses/>.↩\n2. Georgia Well and Kate O’Keeffe, (2019), “U.S. Orders Chinese Firm to Sell Dating App Grindr\n\nOver Blackmail Risk,” Wall Street Journal (March 27, 2019) <https://www.wsj.com/articles/u-sorders-chinese-company-to-sell-grindr-app-11553717942>; Jacob Rosenberg, (2019), “The\nTrump Administration Apparently Considers Grindr a National Security Threat. What Is Going\nOn?,” Mother Jones (April 4, 2019) <https://www.motherjones.com/politics/2019/04/the-trumpadministration-apparently-considers-grindr-a-national-security-threat-what-is-going-on/>.↩\n\n\n-----\n\n3. Bucher, Birg, (2020), WhatsApp, WeChat and Facebook Messenger Apps – Global Messenger\n\nUsage, Penetration and Statistics,” Messenger People\n<https://www.messengerpeople.com/global-messenger-usage-statistics/>.↩\n4. Lotus Ruan, Jeffrey Knockel, Jason Q. Ng, and Masashi Crete-Nishihata. (2016) One App, Two\n\nSystems: “One App, Two Systems: How WeChat uses one censorship policy in China and\nanother internationally,” Citizen Lab, <https://citizenlab.ca/2016/11/wechat-china-censorship-oneapp-two-systems/>.↩\n5. We define surveillance as the focused, systematic and routine attention to personal details for\n\nthe purposes of influence, management, protection or direction. See: David Lyon (2007),\n_Surveillance Studies: An Overview. (Polity Press: 2007) at 14.↩_\n6. Tencent (2019), “Tencent Announces 2019 Third Quarter Results,” Tencent, <https://cdc-tencent\ncom1258344706.image.myqcloud.com/uploads/2019/11/13/8b98062831f2f28d9cb4616222a4d3c3.pdf>.\n↩\n7. Tencent Holdings Limited has six business groups that oversee different products and aspects of\n\nthe company. The Weixin Group (WXG) is the one that develops and operates WeChat and\nrelated services. Tencent (n.d.), “Get To Know Tencent,” Tencent,\n[<https://join.qq.com/business.php>.↩](https://join.qq.com/business.php)\n8. Yicai News (2019), “Here Comes WeChat’s Big Data [in Chinese],” Yicai,\n\n<https://www.yicai.com/news/100095261.html>.↩\n9. Cyberspace Administration of China (2014), “The Interim Provisions on the Administration of the\n\nDevelopment of the Public Information Services of Instant Messaging Tools,” Cyberspace\n_Administration of China <https://www.cac.gov.cn/2014-08/07/c_1111983456.htm>.↩_\n10. Perry Link (2002), “China: The Anaconda in the Chandelier,” China File\n\n<http://www.chinafile.com/library/nyrb-china-archive/china-anaconda-chandelier>.↩\n11. We use the terms WeChat China and WeChat International to distinguish WeChat’s China\nbased and internationally-based operations. We follow Tencent’s definition of the scope of its\nChina-based services. That is, WeChat China’s technical and policy infrastructures apply to\nusers who “register by binding a mobile number that is made available to you in the People’s\nRepublic of China (except for Taiwan, Hong Kong or Macau) (i.e., a contact number that uses\ninternational dialing code +86).” WeChat (2018), “WeChat Privacy Protection Summary,”\n_WeChat (May 10, 2018) <https://www.wechat.com/en/privacy_policy.html>.↩_\n12. Crete-Nishihata, Masashi, Jeffrey Knockel, Blake Miller, Jason Q. Ng, Lotus Ruan, Lokman Tsui,\n\nand Ruohan Xiong (2017), “Remembering Liu Xiaobo: Analyzing Censorship of the Death of Liu\nXiaobo on WeChat and Weibo,” Citizen Lab <https://citizenlab.ca/2017/07/analyzing-censorshipof-the-death-of-liu-xiaobo-on-wechat-and-weibo/>.↩\n13. Ruan, Lotus, Jeffrey Knockel, and Masashi Crete-Nishihata (2017), “We (can’t)Chat: “709\n\nCrackdown” Discussions Blocked on Weibo and WeChat,” Citizen Lab\n<https://citizenlab.ca/2017/04/we-cant-chat-709-crackdown-discussions-blocked-on-weibo-andwechat/>.↩\n14. Knockel, Jeffrey and Ruohan Xiong (2019), “(Can’t) Picture This 2: An Analysis of WeChat’s\n\nRealtime Image Filtering in Chats,” Citizen Lab (July 15, 2019)↩\n15. Knockel, Jeffrey and Ruohan Xiong (2019), “(Can’t) Picture This 2: An Analysis of WeChat’s\n\nRealtime Image Filtering in Chats,” Citizen Lab (July 15, 2019)\n<https://citizenlab.ca/2019/07/cant-picture-this-2-an-analysis-of-wechats-realtime-image-filteringin-chats/>↩\n\n\n-----\n\n16. Knockel, Jeffrey and Ruohan Xiong (2019), (Can t) Picture This 2: An Analysis of WeChat s\n\nRealtime Image Filtering in Chats,” Citizen Lab (July 15, 2019)\n<https://citizenlab.ca/2019/07/cant-picture-this-2-an-analysis-of-wechats-realtime-image-filteringin-chats/>↩\n17. Wikipedia (2020), “Chi-squared test,” Wikipedia (Last updated February 14, 2020)\n\n<https://en.wikipedia.org/wiki/Chi-squared_test>.↩\n18. Xiong, Ruohan and Jeffrey Knockel (2019). “An Efficient Method to Determine which\n\nCombination of Keywords Triggered Automatic Filtering of a Message,” FOCI 2019\n<https://www.usenix.org/system/files/foci19-paper_xiong.pdf>.↩\n19. Knockel, Jeffrey and Ruohan Xiong (2019), “(Can’t) Picture This 2: An Analysis of WeChat’s\n\nRealtime Image Filtering in Chats,” Citizen Lab (July 15, 2019)\n<https://citizenlab.ca/2019/07/cant-picture-this-2-an-analysis-of-wechats-realtime-image-filteringin-chats/>↩\n20. As of now, it is unclear why certain images are censored in real time while others are not.↩\n21. Knockel, Jeffrey and Ruohan Xiong (2019), “(Can’t) Picture This 2: An Analysis of WeChat’s\n\nRealtime Image Filtering in Chats,” Citizen Lab (July 15, 2019)\n<https://citizenlab.ca/2019/07/cant-picture-this-2-an-analysis-of-wechats-realtime-image-filteringin-chats/>↩\n22. Albertini, Ange and Marc Stevens (2019), “Hash collisions and their exploitations,”\n\n<https://github.com/corkami/collisions>↩\n23. n.d.. <https://raw.githubusercontent.com/citizenlab/chat-censorship/master/md5-collision\nexample/lxb-afa92a14854d6ac92d8a8446145b4d1b.jpeg>↩\n24. n.d.. <https://raw.githubusercontent.com/citizenlab/chat-censorship/master/md5-collision\nexample/citlab-afa92a14854d6ac92d8a8446145b4d1b.jpeg>↩\n25. As a secondary consequence, these results also show that WeChat still uses the MD5 hash\n\nfunction for hashing files for its hash index.↩\n26. WeChat (n.d.), “How do I recall a sent message?” WeChat <https://help.wechat.com/cgi\nbin/micromsg-bin/oshelpcenter?\nopcode=2&plat=2&lang=en&id=120813euEJVf1410236fI7RB&Channel=helpcenter>.↩\n27. WeChat (n.d.), “How do I manage my account including how to export my personal data or\n\nrequest my account to be deleted?” WeChat <https://help.wechat.com/cgi-bin/micromsgbin/oshelpcenter?\nopcode=2&lang=en&plat=ios&id=180323e2Ermm180323yqauAZ&Channel=helpcenter>.↩\n28. In this section we refer to policy documents applicable to WeChat’s China-registered accounts\n\nas WeChat China documents and those to non-China-registered accounts as WeChat\nInternational documents.↩\n29. Weixin (2019), “Weixin Privacy Protection Guidelines [in Chinese],”, Weixin (September 30,\n\n2019) <https://weixin.qq.com/cgi-bin/readtemplate?\nlang=zh_CN&t=weixin_agreement&s=privacy> [https://perma.cc/UG33-CYTP]↩\n30. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>\n\n[https://perma.cc/DJB5-U7DD]↩\n\n\n-----\n\n31. https://weixin.qq.com/cgi-bin/readtemplate?lang=zh_CN&t=weixin_agreement&s=privacy\n\n[https://perma.cc/UG33-CYTP]. Our analysis is based on the Privacy Policy Protection\nGuidelines published on September 30, 2019. WeChat has updated the document on January\n21, 2020, whose changes pertain to primarily a new functionality WeChat introduces to its\nplatform.↩\n32. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=privacy&cc=CN>\n\n[https://perma.cc/WD5C-J3ZR]↩\n33. https://weixin.qq.com/cgi-bin/readtemplate?\n\n&t=page/agreement/personal_account&lang=zh_CN↩\n34. Weixin (n.d.), “Standards of Weixin Account Usage,” Weixin (n.d.) <https://weixin.qq.com/cgi\nbin/readtemplate?&t=page/agreement/personal_account&lang=en_US>.↩\n35. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 1, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html> [https://perma.cc/3S76-6MCX]↩\n36. WeChat (2018), “WeChat — Terms of Service,” WeChat (March 21, 2018)\n\n<https://www.wechat.com/en/service_terms.html> [https://perma.cc/ZH6Y-GJWK]↩\n37. WeChat (2015), “WeChat — Acceptable Use Policy,” WeChat (November 13, 2015)\n\n<https://www.wechat.com/en/acceptable_use_policy.html> [https://perma.cc/2FUB-7J94]↩\n38. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>\n\n[https://perma.cc/5KRJ-28NE]. Section 12.6 of the Agreement on Software License and Service\nof Tencent Weixin reads, “In case of any inconsistency and discrepancy between the Chinese\nversion and any version of other language, the Chinese version shall prevail.”↩\n39. Parsons, Christopher, Adam Molnar, Jakub Dalek, Jeffrey Knockel, Miles Kenyon, Bennett\n\nHaselton, Cynthia Khoo, Ron Deibert (2019), “The Predator in Your Pocket: A Multidisciplinary\nAssessment of the Stalkerware Application Industry,” Citizen Lab\n<https://citizenlab.ca/docs/stalkerware-holistic.pdf>; Hilts, Andrew, Christopher Parsons, and\nJeffrey Knockel (2016), “Every Step You Fake: A Comparative Analysis of Fitness Tracker\nPrivacy and Security,” Open Effect <https://openeffect.ca/re- ports/Every_Step_You_Fake.pdf>;\nParsons, Christopher, Andrew Hilts, and Masashi Crete-Nishihata (2017), “Approaching Access:\nA comparative analysis of company responses to data access requests in Canada,” Citizen Lab\n<https://citizenlab.ca/wp-content/uploads/2018/02/approaching_access.pdf>; Parsons,\nChristopher (2015), “The Governance of Telecommunications Surveillance: How Opaque and\nUnaccountable Practices and Policies Threaten Canadians,” Telecom Transparency Project\n<http://www.telecomtransparency.org/release-the-governance-of-telecommunicationssurveillance/>.↩\n40. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>;\nhttps://perma.cc/5KRJ-28NE. In the case of content regulation, WeChat China specified that\nusers must not, among other things, “violate the basic principles established by the Constitution”,\nor “contradict to Interim Provisions on the Administration of the Development of Public\n_Information Services of Instant Messaging Tools and comply with the requirements of ‘seven_\nbottom lines’ including laws and regulations, socialist systems, national interests, legitimate\ninterests of citizens, public order, social morality and information authenticity.” Italics in\noriginal.↩\n\n\n-----\n\n41. The Supreme People s Court of the People s Republic of China (2009), Constitute of the\n\nPeople’s Republic of China,” China Court <http://en.chinacourt.gov.cn/public/detail.php?\nid=4446>.↩\n42. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n43. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n44. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. For specificity, WeChat International defined\npersonal information as “any information, or combination of information, that relates to you, that\ncan be used (directly or indirectly) to identify you.” Types of personal information WeChat\nInternational identified included “Registration Data and Log-in Data” (i.e., a user’s “name, user\nalias, mobile phone number, password, gender, and IP address”) and “user profile search data”\n(i.e., “record of search inquires”).↩\n45. WeChat (n.d.), “How do I manage my account including how to export my personal data or\n\nrequest my account to be deleted?,” WeChat <https://help.wechat.com/cgi-bin/micromsgbin/oshelpcenter?\nopcode=2&lang=en&plat=ios&id=180323e2Ermm180323yqauAZ&Channel=helpcenter>.↩\n46. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?\nlang=en&t=weixin_agreement&s=privacy&cc=CN>;https://weixin.qq.com/cgi-bin/readtemplate?\nlang=zh_CN&t=weixin_agreement&s=privacy. Types of sensitive information included mobile\nphone numbers, voice biometrics, location information, the number of steps users recorded in\nWeChat China’s movement function, bank account information, and “recommended\ncontacts/friends” information.↩\n47. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?\nlang=en&t=weixin_agreement&s=privacy&cc=CN>;https://weixin.qq.com/cgi-bin/readtemplate?\nlang=zh_CN&t=weixin_agreement&s=privacy. WeChat China broadly named 10 scenarios in\nwhich such instances might happen. For instance, “when it is directly related to national interests\nsuch as national security and national defense, or it is directly related to major public interests\nsuch as public safety, public health, and public knowledge.”↩\n48. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. Types of personal information WeChat\nInternational identified included “Registration Data and Log-in Data” (i.e., a user’s “name, user\nalias, mobile phone number, password, gender, and IP address”) and “user profile search data”\n(i.e., “record of search inquires”).↩\n49. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n50. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>; Weixin (2019), “Weixin Privacy Protection\nGuidelines,” Weixin (September 30, 2019) < https://weixin.qq.com/cgi-bin/readtemplate?\nlang=en&t=weixin_agreement&s=privacy&cc=CN> ;https://weixin.qq.com/cgi-bin/readtemplate?\nlang=zh_CN&t=weixin_agreement&s=privacy.↩\n51. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n\n\n-----\n\n52. Weixin (2019), Weixin Privacy Protection Guidelines, Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?\nlang=en&t=weixin_agreement&s=privacy&cc=CN>;https://weixin.qq.com/cgi-bin/readtemplate?\n_lang=zh_CN&t=weixin_agreement&s=privacy at Section 2.2.↩_\n53. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n54. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=privacy&cc=CN>.\nWeChat China noted that it would store a user’s phone number for as long as he or she uses\nWeChat services. As for information in WeChat Moments, information would be saved “to ensure\nyour normal use of the Moments functions” and would be deleted if a user deletes corresponding\ninformation in Moments.↩\n55. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. WeChat International noted that Ontario\nCanada “was found to have an adequate level of protection for Personal Information under\nCommission Decision 2002/2/EC of 20 December 2001).” In the case of Hong Kong, WeChat\nInternational “rely on the European Commission’s model contracts for the transfer of personal\ndata to third countries (i.e., the standard contractual clauses), pursuant to Decision 2001/497/EC\n(in the case of transfers to a controller) and Decision 2004/915/EC (in the case of transfers to a\nprocessor).”↩\n56. See, for example, an ongoing class action lawsuit in the US against Chinese-owned TikTok that\n\nclaims it transferred “vast quantities” of user data to China: BBC News (2019), “TikTok sent US\nuser data to China, lawsuit claims,” BBC News (December 3, 2019)\n<https://www.bbc.com/news/business-50640110>.↩\n57. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?\nlang=en&t=weixin_agreement&s=privacy&cc=CN>;https://weixin.qq.com/cgi-bin/readtemplate?\nlang=zh_CN&t=weixin_agreement&s=privacy. WeChat China stated that “at present, [Tencent]\nwill not actively share or transfer [the user’s] personal information to a third party outside of\nTencent” and that if there was any disclosure, Tencent would “directly obtain or verify the third\nparty has obtained [the user’s] prior express consent to such share or transfer of [the user’s]\npersonal information.”↩\n58. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. For Tencent-related group companies,\nWeChat International stated that it shared personal information “our group of companies,\nincluding Tencent International Service Europe BV (located in the Netherlands), Tencent\nInternational Service Pte. Ltd (located in Singapore), WeChat International Pte Ltd (located in\nSingapore) and Oriental Power Holdings Limited (located in Hong Kong) and WeChat\nInternational (Canada) Limited (located in Canada) that run the Hong Kong and Canadian\nServers,” Additionally, “in the event of an internal restructuring of our or our affiliates businesses,\nor the sale of WeChat or any of its assets to a third party, the entity that consequently operates\nWeChat may be a different entity to us and we will transfer your information accordingly so that\nyour service can continue.”↩\n\n\n-----\n\n59. Weixin (2019), Weixin Privacy Protection Guidelines, Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=privacy&cc=CN>.\nFor clarity, WeChat China stated that, “Except for the circumstances prescribed by laws and\nregulations, Tencent will not make public or disclose the user’s personal information to any third\nparty without permission of the users.”↩\n60. Weixin Privacy Protection Guidelines Section 5 noted at least six circumstances under which it\n\nmay disclose personal information without seeking prior consent. Without citing specific laws and\nregulations, these circumstances included vaguely defined and potentially overarching terms\nsuch as “national security or national defense,” and “public safety, public health, or major public\ninterests.”↩\n61. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>.↩\n62. MacKinnon, Rebecca (2009), “China’s Censorship 2.0: How companies censor bloggers,” First\n\n_Monday <https://firstmonday.org/article/view/2378/2089>.↩_\n63. Weixin (2019), “Weixin Privacy Protection Guidelines,” Weixin (September 30, 2019) <\n\nhttps://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=privacy&cc=CN>.\nIn particular, WeChat China stated that, “Tencent is granted to use the non-confidential contents\nuploaded or published by you (such as video published via Time Capsule, selfie stickers) for\nachieving the performance of the Software and Services, including without limited to storage,\ndisplaying to relevant users, granting and allowing other use.”↩\n64. WeChat (2018), “WeChat — Terms of Service,” WeChat (March 21, 2018)\n\n<https://www.wechat.com/en/service_terms.html>.↩\n65. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>\n\n[https://perma.cc/5KRJ-28NE>] at Section 8.5.1.↩\n66. The email address was: dataprotection[@]wechat[.]com.↩\n67. WeChat (2018), “WeChat — Terms of Service,” WeChat (March 21, 2018)\n\n<https://www.wechat.com/en/service_terms.html>.↩\n68. WeChat (2018), “WeChat Privacy Protection Summary,” WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. See “Sensitive Personal Information.”↩\n69. WeChat (2018), “WeChat — Terms of Service,” WeChat (March 21, 2018)\n\n<https://www.wechat.com/en/service_terms.html>.↩\n70. WeChat (2018), “WeChat — Terms of Service,” WeChat (March 21, 2018)\n\n<https://www.wechat.com/en/service_terms.html>.↩\n71. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>\n\n[https://perma.cc/5KRJ-28NE]↩\n72. Weixin (n.d.), “Agreement on Software License and Service of Tencent Weixin,” Weixin (n.d.)\n\n<https://weixin.qq.com/cgi-bin/readtemplate?lang=en&t=weixin_agreement&s=default&cc=CN>\n\n[https://perma.cc/5KRJ-28NE]. According to the Agreement of Software License and Service of\nTencent Weixin, “to the extent permitted by laws, Tencent is granted to use the non-confidential\ncontents uploaded or published by you (such as video published via Time Capsule, selfie\nstickers) for achieving the performance of the Software and Services, including without limited to\nstorage, displaying to relevant users, granting and allowing other use.”↩\n\n\n-----\n\n73. WeChat (2018), WeChat Privacy Protection Summary, WeChat (May 10, 2018)\n\n<https://www.wechat.com/en/privacy_policy.html>. See “Where do we process your data”; see\nalso: Office of the Privacy Commissioner of Canada (2017), “Commercial Activity,” Office of the\n_Privacy Commissioner of Canada (January 30, 2017) <https://www.priv.gc.ca/en/privacy-_\ntopics/privacy-laws-in-canada/the-personal-information-protection-and-electronic-documentsact-pipeda/pipeda-compliance-help/pipeda-interpretation-bulletins/interpretations_03_ca/>.↩\n74. Office of the Privacy Commissioner of Canada (2013), “Access to Personal Information,” Office\n\n_of the Privacy Commissioner of Canada (May 16, 2013)_\n<https://www.priv.gc.ca/leg_c/interpretations_05_access_e.asp>.↩\n75. The contents of these communications are detailed in Section 2.↩\n76. The URL we were provided was: https://support.weixin.qq.com/security/readtemplate?\n\nt=exportdata/index↩\n77. We did not explore how WeChat differentiated between Friends and Group Chat Contacts.↩\n78. Parsons, Christopher, Andrew Hilts, and Masashi Crete-Nishihata (2018), “Approaching Access:\n\nA comparative analysis of company responses to data access requests in Canada,” Citizen Lab\n(February 12, 2018) <https://citizenlab.ca/wpcontent/uploads/2018/02/approaching_access.pdf>; Tsui, Lokman and Stuart Hargreaves\n(2019), “Who Decides What Is Personal Data? Testing the Access Principle with\nTelecommunication Companies and Internet Providers in Hong Kong,” International Journal of\n_Communication 13.↩_\n79. For details on how, and why, the terms of service and privacy policy were ambiguous on the\n\nissues of data collection, processing, and storage, see Section 3 of this report.↩\n80. Ronald Deibert (2019), “The Road to Digital Unfreedom: Three Painful Truths About Social\n\nMedia,” Journal of Democracy 30(1).↩\n81. Parsons, Christopher (2016), “Transparency in Surveillance: Role of various intermediaries in\n\nfacilitating state surveillance transparency,” Centre for Law and Democracy <http://responsibletech.org/wp-content/uploads/2016/06/Parsons.pdf>. Transparency reports may not, however, be\nparticularly effective in genuinely expressing the regularity at which governments attempt to\nblock, or have content taken down. For more, see Parsons, Christopher (2017), “The\n(In)effectiveness of Voluntarily Produced Transparency Reports,” Business & Society\n_<http://journals.sagepub.com/doi/full/10.1177/0007650317717957>.↩_\n82. McKune, Sarah, Ronald Deibert (2018), “Google’s Dragonfly: A Bellwether for Human Rights in\n\nthe Digital Age,” Just Society <https://www.justsecurity.org/59941/googles-dragonfly-bellwetherhuman-rights-digital-age/>.↩\n83. The second letter issued to Tencent Singapore was mistakenly dated November 29, 2019, but\n\nsent by email on December 18, 2019.↩\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-07 - We Chat, They Watch- How International Users Unwittingly Build up WeChat’s Chinese Censorship Apparatus.pdf"
    ],
    "report_names": [
        "2020-05-07 - We Chat, They Watch- How International Users Unwittingly Build up WeChat’s Chinese Censorship Apparatus.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536087,
    "ts_updated_at": 1743041499,
    "ts_creation_date": 1653710500,
    "ts_modification_date": 1653710500,
    "files": {
        "pdf": "https://archive.orkl.eu/a266b70e51c6a9089c402203cfd7416986f879fa.pdf",
        "text": "https://archive.orkl.eu/a266b70e51c6a9089c402203cfd7416986f879fa.txt",
        "img": "https://archive.orkl.eu/a266b70e51c6a9089c402203cfd7416986f879fa.jpg"
    }
}