{
    "id": "a4fcd6f4-a0ea-4939-90b3-51c15a3e5335",
    "created_at": "2023-01-12T15:02:37.87534Z",
    "updated_at": "2025-03-27T02:16:25.818714Z",
    "deleted_at": null,
    "sha1_hash": "8d1c2c05da05a4f5f94ae7873275e7e4f7908856",
    "title": "2016-09-27 - New Voldemort-Nagini Ransomware Virus Infection",
    "authors": "",
    "file_creation_date": "2011-07-14T10:38:48Z",
    "file_modification_date": "2011-07-14T10:38:52Z",
    "file_size": 703860,
    "plain_text": "## The IT Security Situation in  Germany in 2011\n\nFederal Office for Information Security\nwww.bsi.bund.de\n\n\n-----\n\n-----\n\n### Contents\n\n##### Preface 5\n\n Overview 6\n\n 1  Security Vulnerabilities 8\n\n 2  Drive-By Exploits 11\n\n 3  Botnets 14\n\n 4  Spam 17\n\n 5  Identity Theft and Identity Fraud 21\n\n 6  Malware 24\n\n 7  Stuxnet 28\n\n 8  Domain Name System and Routing 30\n\n 9  Mobile Communication 33\n\n 10  Cloud Computing 38\n\n 11  Smart Grid / Smart Meter 40\n\n Conclusion 42\n\n BSI – Focusing on IT Security 43\n\n Bibliography 46\n\n List of Illustrations 47\n\n\n-----\n\n-----\n\n### Preface\n\nThe opportunities offered by present-day IT in both our private and professional lives\n\nare many and varied. Just as many and varied, however, are the risks we face as we in\ncreasingly shift our business transactions and social interaction into the virtual world.\n\nFor attackers also keep tabs on developments and are constantly working out sophisti\ncated ways of staying one step ahead of their potential victims. Authors of malware are\n\nusing ever more diverse technical measures to make their programs harder to detect or\n\nanalyze. For example, there is malware out there that can scan its target system to pick\n\nup on features of an analysis environment. If it detects any, it will stop trying to infect\n\nthe system. This makes it harder for specialists to analyze the program. It also increases\n\nthe demands on users; it is becoming more crucial for them to play an active role than\n\never before. There is need to be every bit as alert and curious in the online lives as there\n\nis in the offline world.\n\nInternet criminals have long since created a market for their services which helps to\n\nincrease their “earning potential”. A botnet consisting of 10,000 bot PCs, for example,\n\ncan be rented for around US$ 200 a day. And as botnets can consist of several millions\n\nof PCs, the financial potential of such attacks is something we can only guess at.\n\nBut we will not allow this to discourage us: on the upside there have been plenty of\n\nsuccesses. Like the dismantling of large-scale botnets, for example. Often this is achieved\n\nthrough the joint efforts of many companies, IT security organizations and investi\ngators all over the world. This worldwide network is constantly expanding. April 1 saw\n\nthe opening of the National Cyber Defense Center, a joint venture of German federal\n\nsecurity departments operating under the auspices of the BSI, tasked with defending\n\ncritical federal government and industrial IT infrastructures against electronic attacks.\n\nMy employees and I are doing our bit to make the online world safer for all of us. And\n\nthis is something we are fully committed to.\n\nBonn, May 2011\n\nMichael Hange\n\n\nMichael Hange\nPresident of the Federal\nOffice for Information\nSecurity\n\n\nMichael Hange\n\n\n-----\n\n### Overview\n\nCountless processes and tasks in the public and private\n\nsectors are supported by IT nowadays. Even in our pri\nvate lives, it is hard for most Germans to imagine doing\n\nwithout their PC and cell phone. Business and industry,\n\nthe public sector and private individuals are therefore\n\nall highly dependent on properly functioning informa\ntion technology and secure information infrastructures.\n\nOrganized criminals, but also intelligence services, are\n\ncarrying out highly professional IT attacks on compa\nnies, authorities and even private individuals. The meth\nods the attackers are using are becoming ever more\n\nsophisticated, making them increasingly expensive\n\nand complicated to defend against. A recent example\n\nwas the Stuxnet Trojan horse which targeted industrial\n\nprocess control systems. Its programming was highly\n\ncomplex and was done by people who were experts in\n\ntheir field. There have always been attacks on IT systems,\n\nbut their intensity and nature have changed. Alongside\n\nmass attacks, we are also beginning to see a new quality\n\nof specifically targeted attack. Mass attacks mainly ex\nploit standard vulnerabilities like banner ads, whereas\n\ntargeted cyber attacks use secret or as yet undiscovered\n\nweak points. The attackers do not “waste” their knowl\nedge; their methods have become ever more devious\n\nsince we published our last report in 2009. Besides vul\nnerabilities in operating systems, attackers exploit weak\n\nspots in third-party applications and software compo\n\nnents. Targeted attacks geared towards specific individu\nals that use highly sophisticated social engineering to\n\ndisguise themselves are also on the increase.\n\nThe number of new malicious programs is also continu\ning to rise dramatically. But malware is no longer being\n\nspread randomly across the internet in massive waves. A\n\nmalware program will often only infect a small number\n\nof computers worldwide, making it extremely difficult\n\nto detect.\n\n“Conventional” phishing is much less common these\n\ndays. But that does not mean that identity theft no lon\nger poses a threat: in fact, quite the opposite. A criminal\n\nfield of activity has developed in this area which has all\n\nthe hallmarks of highly professionalized structures.\n\nAs far as spam is concerned, attackers are seemingly\n\nopting for a much less random approach nowadays.\n\nThe volume of spam e-mail may have reduced, but it is\n\nbecoming increasingly targeted, so the risk potential\n\nremains just as high.\n\nSecurity experts involved in malicious code analysis\n\nare finding their work turning increasingly into a race\n\nagainst the attackers. One positive outcome of this is\n\nthat cooperation between manufacturers, providers and\n\nsecurity experts is constantly improving. For example,\n\n\n-----\n\nsome dangerous botnets have been disabled as a result\n\nof joint initiatives. An international network has also\n\nbeen set up for CERTs: the Forum of Incident Response\n\nand Security Teams (FIRST). There is now a general reali\nzation that working together can benefit everyone con\ncerned – but we will all need to continue to up our game\n\nin order to keep the overall situation under control.\n\nThe rapid expansion of smartphones, netbooks and tab\nlet PCs also presents a growing challenge, as it signifi\ncantly increases the number of potential vulnerabilities\n\nopen to cyber criminals. Assuming that internet attacks\n\ncan potentially be financially rewarding and that the\n\nrisk of being caught is relatively low, it is likely that they\n\nwill continue to increase.\n\nThe much-talked-about topic of Cloud Computing is set\n\nto become ever more widespread in view of its potential\n\nfor cost-cutting and increasing availability. Ensuring\n\ninformation security will therefore take on a new inter\nnational dimension as data leave the jurisdiction of the\n\nFederal Republic of Germany. Stronger international\n\ncooperation is becoming increasingly necessary. Just as\n\nwith the omnipresence of IT systems in our everyday lives\n\n– and with the imminent introduction of the Smart Grid/\n\nSmart Meter – IT managers are facing growing organiza\ntional challenges in areas such as risk management.\n\n\n##### Risk trends\n\n**Threat** **2009** **2011** **Forecast**\n\nDDoS attacks\n\nUnsolicited e-mails (spam)\n\nBotnets\n\nIdentity theft\n\nSecurity vulnerabilities –\n\nDrive-By Exploits –\n\nMalware –\n\n_Source: BSI_\n_Fig. 1: Development of IT threats as assessed by BSI [7]_\n\n##### Risk potential of attack opportunities in  selected applications and technologies\n\n**Technology/Applications** **2009** **2011** **Forecast**\n\nMobile communication\n\nSCADA\n\nDNS and BGP\n\nInterfaces and storage media\n\n_Source: BSI_\n_Fig. 2: Risk potential of attack opportunities in selected applications and_\n_technologies as assessed by BSI [7]_\n\n##### Risk profile of innovative applications  and technologies\n\n**Technology/Applications** **2009** **2011** **Forecast**\n\nCloud Computing –\n\nSmart Grid/Smart Meter –\n\n_Source: BSI_\n_Fig. 3: Risk profile of innovative applications and technologies as_\n_assessed by BSI [7 ]_\n\nrising falling unchanged\n\n\n-----\n\n### Security Vulnerabilities\n# 1\n\n\n-----\n\nThe number of published security vulnerabilities was once\n\nagain at a high level in 2010. It remains to be seen whether\n\nthis trend will continue through 2011. It is difficult to estab\nlish exact numbers, as we do not know how many cases\n\nof vulnerabilities go unreported. What is more, some\n\nmanufacturers fix vulnerabilities on the quiet with so\ncalled Silent Fixes which are not counted in the statistics.\n\n##### Software vulnerabilities on the rise\n\nAs far as the typical end-user PC is concerned, the ratio\n\nbetween the number of vulnerabilities in the operating\n\nsystem and in third-party software is changing. While\n\nvulnerabilities in operating systems such as Microsoft\n\nWindows are becoming less and less attractive to attack\ners, the number of security weaknesses in third-party\n\nsoftware rose significantly in 2010.[1] This is particularly\n\n##### Security vulnerabilities reported\n\n\ncritical given the high prevalence of many applications.\n\nFor example, Adobe Flash Player is found on more than\n\n99% of all PCs in Europe, according to the manufactur\ners, and CVE reports that it was affected by 60 vulnera\nbilities in 2010, 53 of which were able to be exploited for\n\nrunning malcode. Mozilla Firefox now has the biggest\n\nweb browser market share in Europe.[2] According\n\nto CVE it had 107 vulnerabilities in 2010, 60 of which\n\nenabled malcode to be executed. The potential scope\n\nfor attacks therefore increases with every application\n\nthat is used.\n\nThe BSI's alert and information service, Bürger-CERT, is\n\nissuing increasing numbers of alerts about time-critical\n\nvulnerabilities. In the 2010 special edition of its newslet\nter, for example, it published 13 alerts – more than in pre\nvious years. Since 2008 there has also been a constant rise\n\nin the number of technical alerts issued by Bürger-CERT.\n\n\n16 150\n\n14 127\n\n125\n\n13\n\n12\n\n100\n\n10\n\n8 75\n\n7\n\n6 56 57\n\n6 50\n\n4\n\n25\n\n2\n\n0 0\n\n2008 2009 2010 2008 2009 2010\n\n\n_Source: BSI_\n_Fig. 4: Number of time-critical security vulnerabilities reported by Bürger-CERT and Technical Warnings issued by CERT-Bund [7]_\n\n1\n\n\n-----\n\nSoftware manufacturers have acknowledged the fact\n\nthat they share responsibility for IT security and are\n\nworking actively on improving their products. So it is no\n\nlonger only third parties who are discovering vulnerabil\nities: the manufacturers themselves are also reporting\n\nthem. But time is and remains a critical factor. Zero-day\n\nattacks, in which vulnerabilities are exploited on the day\n\nthey are discovered, are now the rule. At the same time,\n\nso many vulnerabilities are being discovered all the time\n\nthat manufacturers risk not being able to keep pace with\n\nthis development, potentially resulting in vulnerabilities\n\nremaining in place over long periods of time. Accord\ning to CVE, for example, on February 15 this year more\n\nthan 20 vulnerabilities in various Microsoft products\n\n(Windows, Office, Internet Explorer) were known about,\n\n16 of which enabled malcode to be run. Many of these\n\nhad been described several weeks earlier.\n\n##### Central patches help\n\nAgainst this backdrop, users must call for effective\n\nupdate mechanisms to eliminate security vulnerabilities\n\neffectively and fast. Automatic update functions have\n\nproved very helpful in this regard. They enable a user\n\nto keep their software up to date without any involve\nment on their part; security-relevant updates are simply\n\ndownloaded and installed as soon as they become\n\navailable. Most common applications have these func\ntions nowadays. But this system is also not without its\n\nproblems. Because there are no central update function\nalities, applications typically have their own specific\n\nupdate mechanisms and cycles. And there can even be\n\nbig differences between an individual manufacturer's\n\nproducts. In addition, some manufacturers do not\n\nprovide their updates as they develop them but have set\n\npatch days on which they publish their patches. In the\n\nworst case scenario, vulnerabilities can then exist for\n\n\nanything between one month (Microsoft's current patch\n\ncycle) and three months (Adobe's current cycle). So\n\nmanufacturers are increasingly being forced to respond\n\nto critical vulnerabilities with workarounds – temporary\n\nmeasures which involve additional effort on the part of\n\nthe user and the administrator. However, patch releases\n\nare sometimes brought forward when a particularly\n\ncritical vulnerability is discovered.\n\nThe BSI is therefore in constant contact with the major\n\nsoftware manufacturers with a view to driving forward\n\nthe development of central update mechanisms and\n\nensuring that updates are made available promptly. The\n\naim going forward is to have updates downloaded fully\n\nautomatically as soon as they are available so as to keep\n\npace with the security threat caused by the discovery\n\nof new vulnerabilities. In administered environments,\n\nthese mechanisms need to be put in place by the admin\nistrators.\n\n\n-----\n\n### Drive-by Exploits\n# 2\n\n\n-----\n\nHow vital it is to fix vulnerabilities in software straight\n\naway is illustrated by the fact that you can infect your\n\nown computer simply by \"surfing\" to a website contain\ning one of these drive-bys. In the past, similar malware\n\nwas predominantly spread through shady websites. In\n\nanother variant, attackers would set up specially crafted\n\nwebsites and lure users to visit them by sending out spam\n\ne-mail containing links to these websites. Today, mal\nware distribution via drive-by exploits almost exclusively\n\nhappens using compromised legitimate websites.\n\nEvery day, attackers manipulate several thousand web\nsites across the world and inject malicious code which\n\nleads to drive-by exploits. These websites are usually\n\ncompromised using stolen FTP login credentials for\n\nthe web servers that have been previously harvested by\n\nmalware on the website operators' computers. Analysts\n\ninvestigating attackers' servers regularly come across\n\nlists with 30,000 or more stolen login credentials for FTP\n\nservers. Additionally, security vulnerabilities in content\n\nmanagement systems and other server software are\n\noften used by attackers for manipulating websites.\n\n##### Infected without clicking\n\nCERT-Bund, the German Governmental Computer Emer\ngency Response Team, currently receives reports from\n\nvarious sources on more than 20 German websites per\n\nweek that have been manipulated by attackers and lead\n\nto drive-by exploits. But this is just the tip of the iceberg,\n\nas the BSI is not actively looking out for compromised\n\nwebsites. CERT-Bund asks the operators of the websites\n\nconcerned to remove the injected malicious code and\n\n\nfix the vulnerabilities being exploited by the attackers.\n\nA user’s PC can also be infected through specially ma\nnipulated banner ads on reputable websites. Attackers\n\nregularly compromise marketing service providers'\n\nserver applications to get them to deliver a malicious\n\npayload that leads to drive-by exploits. And the user does\n\nnot even have to click on the banner ad to activate the\n\npayload. Simply having a manipulated banner displayed\n\non a website is enough to trigger automatic exploitation\n\nof vulnerabilities on the user's PC. In 2010, CERT-Bund\n\nnotified more than 100 operators of banner ad servers in\n\nGermany of these kinds of manipulations. Some of the\n\ninfected banners were displayed on the websites of well\nknown companies, popular online magazines and TV/\n\nradio stations.\n\n##### Exploit kits: malicious software packages\n\nMalicious code injected by attackers into compromised\n\nwebsites usually does not target only one single vulnera\nbility. Instead, it leads to a so-called exploit kit. An exploit\n\nkit (or exploit pack) is a software package that automates\n\nthe exploitation of vulnerabilities on users’ PCs using\n\ndrive-by exploits subsequently infecting them with mal\nware. Besides a collection of exploits for various vulner\nabilities (typically more than 10), an exploit kit usually\n\nalso contains a web-based management interface that\n\nallows for easy configuration and generation of statistics.\n\nExploit kits are traded by cyber criminals for between\n\nUS$ 400 and US$ 2,000, depending on the number and\n\nup-to-dateness of the exploits they contain. In-depth\n\ntechnical expertise is not usually needed to install and\n\noperate an exploit kit.\n\n\n-----\n\nOver the past few months, attackers have focused their\n\nattention primarily on weaknesses in older versions of\n\nthe widely used software products Adobe Reader and\n\nFlash and in the Java Runtime Environment. However,\n\nexploit kits are also still successful at exploiting vulnera\nbilities in Internet Explorer and the Windows Operating\n\nSystem, many of which have been around for years, since\n\nmany users have not yet installed the security updates\n\nthat fix these vulnerabilities.\n\nIt gets particularly critical when the attackers use zero\nday exploits that target vulnerable software for which\n\nthe vendor has not yet issued a security update.\n\n\n-----\n\n### Botnets\n# 3\n\n\n-----\n\nThe threat presented by botnets has continued to rise dra\nmatically over the past two years, partly as a result of the\n\nrisk of infection by drive-by exploits. Botnets are now also\n\nbeing rented out professionally, and their “customers”\n\nuse them to take revenge, gain competitive advantages\n\nand for criminal purposes like extortion. Attacks may also\n\nbe politically or religiously motivated. Another trend\n\nbegan to emerge in 2010: “hacktivism”. This is a mixture of\n\nhacking and activism, in which internet users voluntarily\n\nmake their PCs available for attacks like DDoS on compa\nnies. A botnet can also be formed in this way.\n\nBotnet operators can potentially infect an increasing\n\nnumber of PCs, because more and more users have\n\nbroadband internet access and leave their computers\n\nconnected to the internet 24/7. As a result, the intensity\n\nof cyber-attacks is also on the rise: according to BSI\n\nestimates, it already exceeds individual providers'\n\nservice bandwidths, which can lead to network outages.\n\nUsers do not usually notice that their PC is part of a\n\nbotnet, as the malcode runs in the background. This is\n\nconfirmed by a security firm who analyzed 100 million\n\ncompromised IP addresses worldwide. They discovered\n\nthat 80 per cent of IP addresses of infected PCs appeared\n\nin the statistics for more than a month, and 50 per cent\n\nfor at least 300 days.[3] One of the reasons for this is\n\nthat some bot software deactivates antivirus software\n\nto prevent itself from being discovered. Computers\n\nwithout antivirus software or running outdated versions\n\nsimply exacerbate the problem. Often the infection is\n\nonly discovered when the user is informed about it by\n\ntheir provider. The number of multiple bot software\n\ninfections has also risen. This is confirmed by an analysis\n\nin which multiple infection was observed in 35 per cent\n\nof cases.[4]\n\n\n##### Intensity of DDoS attacks\n\n100\n\n90\n\n80\n\n70\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\n2005 2006 2007 2008\n\n_Source: Arbor Networks_\n\n_Fig. 5: Bandwidth increase in DDoS attacks [9]_\n\n\n100\n100 GBps\n\n90\n\n80\n\n70\n\n60\n\n50\n\n40\n\n30\n\n20\n\n10\n\n0\n\n2005 2006 2007 2008 2009 2010\n\n\n-----\n\n##### Anti-botnet initiative permanently knocks the bottom out of infections\n\n\n_According to BSI analyses, in 2010 Germany was_\n\n_among the top 5 source countries for botnets that send_\n\n_out spam e-mail. The BSI is therefore supporting the_\n\n_Anti-Botnet Advisory Center set up by eco-Association_\n\n_of the German Internet Industry. This initiative is being_\n\n_financed with start-up funding from the Federal Min-_\n\n_istry of the Interior’s IT Investment Program and aims_\n\n_to help rid computers of bot infections. This initiative,_\n\n_which was officially unveiled on September 15, 2010,_\n\n_is intended to make life more secure for the end user_\n\n_and knock the bottom out of botnets operating in or_\n\n_out of Germany for good wherever possible. The first_\n\n_step in the initiative is to identify infected computers._\n\n_This is done by the Internet Service Provider (ISP) using_\n\n_honeypots and spam traps. Honeypot systems reside_\n\n\n_in the provider's network area and are attacked by the in-_\n\n_fected computers. The spam traps receive the spam e-mail_\n\n_sent from there. Then the ISPs inform the identified users_\n\n_that their PCs are infected. To eliminate the infection, they_\n\n_can obtain help in the form of information and tools from_\n\n_the central website, www.botfrei.de. Users who need addi-_\n\n_tional help are pointed by their ISP towards the Anti-Botnet_\n\n_Advisory Service telephone advice hotline. Between Sep-_\n\n_tember 15, 2010, when the project was launched, and April_\n\n_30 this year, more than 994,000 visitors used the website._\n\n_During this time, the DE Cleaners – special tools designed_\n\n_to remove bot software from computers – were used more_\n\n_than 522,000 times. The ISPs involved alerted more than_\n\n_200,000 customers about infections on their computers._\n\n\n-----\n\n### Spam\n# 4\n\n\n-----\n\nThe number of unsolicited e-mails (spam) has fallen\n\ncompared with the record year 2008. However, spam still\n\naccounts for an extremely high proportion of all e-mail:\n\n96.1% in 2010. Spam also seems to be being targeted more\n\nprecisely of late. For example, the proportion of German\n\nlanguage spam e-mails sent specifically to German e-mail\n\nrecipients by international botnets is growing.\n\n##### Development of spam in Germany\n\n_Source: BSI_\n\n_Fig. 6: Development of spam volume in Germany since January 2010 [7]_\n\n\nThe vast majority of spam e-mails are sent by botnets.\n\nIn a single hour, the BSI observed individual spam waves\n\nwith over 100,000 different sources (sender systems with\n\nunique IP addresses). The Rustock botnet has been found\n\nto be the most prolific sender of this spam. As can be seen\n\nin the graphic below, the volume of spam in Germany\n\ndropped dramatically by nearly 75 per cent in Rustock’s\n\ntwo-week silent period at the end of 2010 and when its\n\ncomand and control server in the USA were taken down\n\nin mid-march.\n\n\n-----\n\n##### Sending spam via private PCs Weekly spam volume\n\nSpamming shows regularities both on a day-to-day and\n\na week-to-week basis. It is also particularly interesting\n\nto look at the sources by country.\n\nThe following diagram shows a weekly pattern, accu\nmulated over several months, of spam and solicited\n\ne-mail sent from Germany at different times of the day,\n\nmeasured against the BSI's e-mail early warning system.\n\nAccording to BSI findings, most of the Spam sent in\n\nGermany originates from compromised private PCs.\n\nThese are probably being used by schoolchildren in the\n\nafternoon, but mostly by adults in the evening after Monday Tuesday Wednesday\n\nwork. Fewer of the infected PCs are being used on Friday\n\nand Saturday evenings as people are more likely to have\n\nother plans at these times. In an international compa- Cumulative weekly volume of spam\n\nrison, it is striking that there are countries in which the\n\n\nMonday Tuesday Wednesday Thursday Friday Saturday Sunday\n\nCumulative weekly volume of spam Solicited e-mails\n\n\ndaily maximum falls within the working hours for that\n\ntime zone and with a much lower volume at evenings\n\nand weekends. In these countries, spam is obviously\n\nbeing sent predominantly from workplace PCs.\n\nIn the league table of spam-sending countries, Germany\n\nwas in fourth place in 2010 with 5.77%, behind the USA\n\n(9.32%), Brazil (8.36%) and India (7.28%). The German\n\nshare drops during the course of the year. The data refer\n\nto the distribution of spam in the Federal Republic of\n\nGermany.\n\nThe BSI expects Germany to be overtaken by some coun\ntries as a source of spam in 2011.\n\n\n_Source: BSI_\n_Fig. 7: Cumulative weekly volume of spam and solicited e-mails_\n_sent from Germany [7]_\n\n#### Spam distribution by country\n\n26,68 % Rest\n\n1,28 % Israel\n1,45 % Argentina\n1,47 % Columbia\n1,57 % China\n1,85 % Saudi Arabia\n1,91 % Spain\n2,01 % Indonesia\n2,52 % Italy\n2,69 % Ukraine\n2,76 % South Korea\n2,92 % France\n\n3,20 % Romania\n\n_Source: BSI_\n\n_Fig. 8: Spam distribution in Germany in 2010 by country_\n_of origin [7]_\n\n\n9,32 % USA\n\n8,36 % Brazil\n\n26,68 % Rest\n\n7,28 % India\n\n1,28 % Israel\n1,45 % Argentina 5,77 % Germany\n1,47 % Columbia\n1,57 % China\n1,85 % Saudi Arabia\n1,91 % Spain 5,30 % Vietnam\n2,01 % Indonesia\n2,52 % Italy 4,38 % Russia\n2,69 % Ukraine\n2,76 % South Korea 4,06 % UK\n2,92 % France\n\n3,20 % Romania 3,23 % Poland\n\n\n-----\n\n##### German-language casino spam waves from thousands of sources\n\nOne of the most distinctive and longlasting Spam cam\npaigns is German-language casino advertising. The BSI\n\nmonitors it since May 2009. It occurs roughly in hourly\n\nwaves and increases the volume of spam by more than\n\n100 per cent. Several thousand sources per hour from\n\nalmost all countries in the world have been identified\n\nas the senders – mainly in Brazil, followed by Vietnam,\n\nIndia, Indonesia, China and Germany. They are most\n\nlikely part of the Maazben botnet. From the variations in\n\ntime, it can be concluded that large parts of this botnet\n\nconcentrate simultaneously on one country domain and\n\nits language.\n\n##### Casino spam\n\nSpam (total) Casino spam\n\n_Source: BSI_\n\n_Fig. 9: Casino waves and total spam volume over a typical day [7]_\n\n\n##### Internet users being recruited for  criminal purposes\n\nSince March 2010, a spam wave has been observed\n\nwhich recruits “manpower”. These “money mules” or\n\n“agents” are then used to forward illegally acquired\n\ngoods or money. To increase the credibility of this offer\ning, the spam often lists the German Federal Employ\nment Agency (Bundesagentur für Arbeit, BA) as the\n\nsupplier of the addresses. Several thousand sources per\n\nhour from almost all countries in the world have been\n\ndetected as the senders of this spam – mainly in Brazil,\n\nfollowed by India, South Korea, Germany and Poland.\n\nFor this spam variant, the attackers started by perform\ning a small-scale and obviously highly successful test\n\nin mid-March 2010. From the end of April to the end\n\nof August 2010 this form of e-mail was a firm fixture in\n\nthe German spam landscape. Thereafter, the messages\n\nstopped mentioning the Federal Employment Agency.\n\nAnother wave appeared at the end of the year. In the\n\nopening sentence it made it perfectly clear that people\n\nwere being recruited for criminal purposes: “A job for\n\nsomeone who is quite clear that if anything goes wrong\n\nthey can at best expect a suspended sentence, and at\n\nworst…” This example shows that the attackers are not\n\nafraid to involve large swathes of the population in crim\ninal acts. Immediately after being alerted by the BSI,\n\nthe Federal Employment Agency issued a series of press\n\nreleases on this subject.\n\n\nSpam (total) Casino spam\n\n\n-----\n\n### Identity Theft and Identity Fraud\n# 5\n\n\n-----\n\nIdentity theft and identity fraud are not new crimes: they\n\nwere happening long before we started using electronic\n\nmedia. In the past, the perpetrator and the victim would\n\nnearly always be in close geographical proximity to one\n\nanother, and there would usually only be a few people\n\ninvolved. But as internet usage has increased, the situ\nation has changed radically: nowadays there is usually\n\nno geographical link between perpetrator and victim\n\nwhatsoever. What is more, a perpetrator can obtain data\n\nfrom hundreds or thousands of victims with very little ef\nfort using malware, as analyses of datasets captured from\n\nperpetrators have shown.\n\n##### Malware steals personal data\n\nIdentity theft takes place using malware which transfers\n\nthe stolen data to “drop zones”, servers controlled by the\n\nperpetrators. Once there they can be deployed for iden\ntity fraud purposes. Occasionally data being transferred\n\nby malware to drop zones can be intercepted. When this\n\nhappens, the owners of the stolen identities are usual\nly protected by the operators of the internet services\n\nconcerned, such as by preventatively changing their\n\npassword or temporarily deactivating access.\n\n##### Drop zone datasets\n\n50,000\n\n45,000\n\n40,000\n\n35,000\n\n30,000\n\n25,000\n\n20,000\n\n15,000\n\n10,000\n\n5,000\n\n0\n\nJanuary 2010 February 2010 March 2010\n\n_Source: BSI_\n\n\nIn 2010 data from approximately 200 drop zones were\n\nanalyzed. Of particular interest to the BSI are datasets\n\nthat relate directly to Germany, such as with a domain\n\nname ending in “.de”, for example.\n\n##### Particularly common on webmail  and online marketplaces\n\nAnalyses of examples of drop zone datasets from 2010\n\nshow that the perpetrators were particularly successful\n\nin gaining login credentials for German webmail service\n\nproviders and widely used online marketplaces. When\n\nsubsequently deployed for identity fraud, they may\n\nnot be able to be turned directly into money but they\n\nnonetheless harbor considerable potential for dam\nage. For many users, the e-mail account represents the\n\ncentral trust anchor for a range of other online activities,\n\nmaking it easy for the perpetrators to get hold of other\n\nlogin credentials. Stolen identities for online market\nplaces provide the perfect basis for fraudulent buying\n\nand selling transactions.\n\n\n50,000\n\n45,000\n\n40,000\n\n35,000\n\n30,000\n\n25,000\n\n20,000\n\n15,000\n\n10,000\n\n5,000\n\n0\n\nJanuary 2010 February 2010 March 2010 April 2010 May 2010 Juny 2010 July 2010\n\n\n-----\n\nOnline banking data, on the other hand, can be exploit\ned directly. In 2010 around 86,000 identities were found\n\nin the drop zones investigated. These login credentials\n\ndo not lead directly to a transaction on their own. But as\n\nthe malware on the target systems is usually still active,\n\nthe attackers can often overcome the banks’ other pro\ntective mechanisms such as transaction codes.\n\n##### Trojan horses scour private PCs\n\nThese days, perpetrators almost always use Trojan hors\nes that cover their tracks on their victims’ computers\n\nvery effectively. They use them to track the owners’ login\n\nor transaction keystroke combinations or to search their\n\nfiles for particular keywords. The data are then transfer\nred to the drop zones.\n\nConventional phishing, on the other hand – luring\n\nunsuspecting users to fraudulent bank websites and\n\nasking them to enter their credentials, for example – is\n\nnow relatively rare. But the increasing use of powerful\n\nTrojan horses has meant that the number of cases – and\n\ntherefore the levels of losses – are once again on the rise\n\ncompared with previous years.\n\n\nToday’s perpetrators divide up their tasks in a highly\n\norchestrated way. First one group will produce the mal\nware – a Trojan horse, for example. The next group will\n\ndistribute it across the internet and use it, and a third\n\ngroup will collect the mined data from the drop zones\n\nand prepare it for the next stage, identity fraud. The next\n\nset of perpetrators will then use the data for criminal\n\npurposes.\n\nAs banks and service providers have tightened up securi\nty on money transfers abroad, financial agents with\n\naccounts in the home country are used. Recruitment\n\nand maintenance of these agents is also organized in a\n\nsophisticated way, including by sending out spam (see\n\nChapter 4).\n\n\n300,000\n\n**Drop zone datasets**\n\n250,000 **1,107,371**\n\n200,000\n\n150,000 Webmailers\n\nOnline marketplaces\n\n100,000 Online stores\n\nSocial networks\nOnline banking\n\n50,000 Internet providers\n\nTravel portals\n\n0 Other\n\nAugust 2010 September 2010 October 2010 November 2010 December 2010 **Total 2010**\n\n\n-----\n\n### Malware\n# 6\n\n\n-----\n\nIn our 2009 status report we observed that the number\n\nof malicious programs was rising constantly, they were\n\nbecoming easier to produce and the attacks were in\ncreasingly being targeted at specific victims. These\n\ntrends have intensified since then.\n\n##### Malware much harder to detect\n\nThe number of new malicious programs is continuing\n\nto rise dramatically. A new one is launched every one or\n\ntwo seconds. However, they are no longer being spread\n\nrandomly in large waves across the internet. Whereas in\n\nthe past one single malicious program could have sever\nal thousands or even hundreds of thousands of victims,\n\ntoday as few as 20 computers worldwide will be affected.\n\nSometimes people visiting a manipulated website\n\ninfected with a drive-by download may even pick up an\n\nindividual malicious code. Particularly problematic are\n\nmalware programs that can only run on the computer\n\nthey first infected, as these are completely undetectable\n\nin an analysis.\n\nPreviously, a malicious program would be used actively\n\nover several months. These days they will be used for just\n\na few days before being replaced by a new variant that\n\ncannot be traced by antivirus software.\n\nA direct consequence of these trends is that it is becom\ning increasingly difficult to detect malware in the usual\n\nway based on signatures and checksums. Manufacturers\n\nof antivirus programs have severe problems localizing\n\nthe large numbers of different malware and producing\n\ndetection signatures.\n\n\nThere are two main causes for the spate of new malware.\n\nFirstly, exploit kits and virus construction kits are widely\n\navailable. They can be expanded to accommodate newly\n\npublished vulnerabilities and attack methods in just a\n\nfew days, and they are easy for semi-professional attack\ners to use. Secondly, highly efficient techniques exist for\n\nautomatically producing a thousand new variants of an\n\nindividual malware with only very minor differences\n\nand different checksums.\n\n##### Malware spread mainly by drive-by  downloads\n\nDistribution of malware via e-mail is dwindling. The BSI\n\nassumes that most malware is now distributed via drive\nby downloads. More and more malicious programs that\n\nhave infected a computer via the internet are being\n\nspread on USB sticks or internal networks. Manipulated\n\nMicrosoft Office or Adobe PDF documents are increas\ningly being used. In addition, malware for mobile\n\ndevices is on the advance: it is no longer a technical\n\nproblem for malware to move between PCs and mobile\n\ndevices during data transmission, although such cases\n\nare rarely observed at present.\n\nOne reason for the decline in e-mail-based attacks is\n\nthe constant improvement in spam filters which stop\n\ninfected e-mails being delivered.\n\n\n-----\n\n##### Infected e-mails on government network\n\nThe total number of infected e-mails on the government\n\nnetwork is falling. But at the same time the BSI is discov\nering increasing numbers of harmful e-mails that are\n\nnot being picked up by virus scanners. The BSI currently\n\ndetects about four or five targeted attacks per day.[2]\n\nIn 2004 more than 100,000 infected e-mails per month\n\n– many containing the same malware – were blocked\n\nby a standard virus scanner. On average there were 1.6\n\nmillion harmful e-mails per month in 2004. Over the\n\npast five years there have only been six months in which\n\nmore than 100,000 infected e-mails were detected. In\n\nrelative terms, the number of harmful e-mails detected\n\nby the virus scanner has fallen even further, as around\n\nfour times as many e-mails were received in 2010 as in\n\n2004. The all-clear? Sadly not. Whereas infected e-mails\n\nwere relatively easy to detect with antivirus software\n\nin 2004, the BSI is discovering more and more harmful\n\ne-mails with its own detection systems which were not\n\npicked up by the virus scanner. These numbers illustrate\n\nthe benefits of central protective measures in the gov\nernment network. The entire federal administration is\n\ntherefore profiting from the high levels of technological\n\nexpertise and manpower used by the BSI to protect the\n\ngovernment network.\n\n\n##### Room for improvement\n\nThe race between the authors of malware and the\n\nmanufacturers of protection programs is hotting up,\n\nand this is not without consequences. An internal BSI\n\nanalysis has shown that the rate at which virus scanners\n\ndetect documents with embedded malicious functions\n\nneeds to be improved dramatically. On average, less\n\nthan 50 per cent of malicious documents were iden\ntified in on-demand mode (i.e. without executing the\n\nfile). Only a combination of at least three different virus\n\nscanners was able to identify more than 90 per cent\n\nof the infected documents. On-access virus scanners,\n\nwhich use additional detection processes when a file is\n\nopened, deliver better results. Antivirus programs on\n\ndesktop PCs are therefore far superior to those on gate\nways which only work in on-demand mode – provided\n\nall behavior-based and heuristic detection processes are\n\nactive.\n\nBesides the use of antivirus programs, which offer\n\ninadequate security in many scenarios, what measures\n\nhelp? Virtualization techniques can protect against\n\ndrive-by downloads collected during surfing. These\n\nencapsulate the browser in a virtual environment so\n\nthat it is effectively separated off from the rest of the\n\ncomputer and the intranet, at least providing effective\n\nprotection against data loss or sabotage actions by\n\nmalware. Protection against the spread of malware via\n\nUSB sticks is increasingly taking the form of programs\n\nthat control computer interfaces, although their use can\n\ngo hand in hand with considerable loss of convenience\n\nand function. To protect against malware in e-mails,\n\n\n2 The BSI refers to a “targeted” attack when the attacker tailors it individually to a particular person and uses a high degree of social engineering to disguise\nthemselves. The malicious programs they use are changed repeatedly until current antivirus programs no longer recognize them.\n\n\n-----\n\nthere are virtually no measures one can take other than\n\nusing several different antivirus programs. E-mails are\n\nsuch an integral part of typical work processes that it is\n\nnot possible to virtualize e-mail clients. The IT security\n\nindustry has responded to this situation and offers man\naged security services such as a central e-mail scan or\n\nspam defense. For many companies, but also for private\n\nindividuals, security services provided by specialist firms\n\nor providers will in future be an attractive alternative\n\nto doing it yourself with protection software. The ever\n\nexpanding use of mobile devices for processing and\n\nstoring confidential information continues to present\n\nproblems. Mobile devices are often poorly protected.\n\nCloser cooperation between manufacturers of mobile\n\ndevices, operating systems and protection software is\n\ntherefore urgently needed.\n\n\n-----\n\n### Stuxnet\n# 7\n\n\n-----\n\nIT attacks on process control systems have long been the\n\nsubject of discussion in specialist circles. But now Stuxnet\n\nhas impressively demonstrated the real threat. This mal\nware features some outstanding infection mechanisms\n\nand, unlike most Trojan horses, does not target “normal”\n\nPCs but industrial process control systems. These are the\n\nbrains and nerve centers of many processes: they monitor,\n\ncontrol, and regulate complex systems as diverse as refin\neries, pipelines, electricity grids, industrial bakeries, and\n\nassembly lines. With the speculation surrounding poten\ntial attack targets in the nuclear industry, the subject of\n\nStuxnet has been raised and discussed in many media.\n\nUnder the surface, Stuxnet is in fact less alarming as a\n\npiece of actual malware; rather, its relevance lies in the\n\nfact that it clearly demonstrates the potential of attacks\n\nof this quality. It proves that there are people out there\n\nwho will spare neither expense nor effort to attack what\n\nthey perceive to be key targets and sabotage them un\nnoticed. Whereas attacks on critical infrastructure and\n\ntheir process control systems have often been accepted\n\nas a residual risk in the past because of their presumed\n\nunlikelihood, this risk now has to be reevaluated.\n\n\n##### Separating process control systems  from other networks\n\nStuxnet was programmed for a particular purpose and\n\ngeared specifically towards it. A similarly high-quality\n\nattack on another target would require the same level\n\nof programming expense and effort. And yet there is a\n\nsignificant risk that Stuxnet is just the tip of the iceberg\n\nand that similar attacks could follow. It cannot be ruled\n\nout that comparable malware may already be being\n\nprogrammed and used both for the process control\n\nsystems of other operators and manufacturers and\n\nfor other critical information infrastructures with as\n\nyet unknown infection channels and highly complex\n\nmalicious functions. Besides such highly specialized and\n\ntargeted attacks, there is also the risk of free-riders who\n\ncould attempt to damage process control systems with\n\na lot less expense and effort. It is therefore important to\n\nisolate these systems from other networks as strictly as\n\npossible and protect and monitor any key interfaces as\n\neffectively as possible. In some cases the BSI has proved\n\nthat process control systems are directly visible and ac\ncessible via the internet. And if something can be seen,\n\nit can be attacked.\n\n\n-----\n\n### Domain Name System and Routing\n# 8\n\n\n-----\n\n### Domain Name System\n\nThe protocol used for communication between DNS\n\nservers for exchanging data has design flaws. Attacks on\n\nthe protocol can result in DNS information on the internet\n\nbeing manipulated by third parties. In 2010 this problem\n\ncontinued unabated, and there were several incidents\n\nof data being corrupted. For example, some traffic to\n\npopular websites like YouTube, Twitter and Facebook was\n\ndiverted to servers in China. To improve the underlying\n\nprotocol, the Internet Engineering Task Force (IETF) speci\nfied the DNSSEC (Domain Name System Security Exten\nsion) protocol extension to enable both digital signing\n\nand validation of domain data.\n\n##### Operators responding\n\nTo implement the improvements introduced with\n\nDNSSEC, however, it is necessary to roll out this exten\nsion actively throughout the whole DNS infrastructure.\n\nWhile both the domain registrars and the ISPs are still\n\nhesitant when it comes to implementing DNSSEC, last\n\nyear some fundamental changes were made to the un\nderlying basic infrastructures. For example, since July 15,\n\n2010 DNSSEC has been supported by the Domain Name\n\nSystem root zone. Acceptance by top level domains has\n\nalso risen strongly over the past two years. Between ear\nly 2009 and May 2011, the number of top level domains\n\naccepting the DNSSEC extensions rose from five to 72\n\nout of 310. Fortunately, apart from China (.cn), the ten\n\nlargest top level domains have already implemented\n\nDNSSEC. These include the German top level domain,\n\n.de, whose operators DENIC eG introduced DNSSEC on\n\nMay 31, 2011.\n\n\n##### Top Level Domains\n\n\n**Top level domain** **Number of second level** **DNSSEC support**\n**domains**\n\n.com 95,006,677 yes\n\n.de 14,369,495 yes\n\n.net 14,003,416 yes\n\n.org 9,639,660 yes\n\n.uk 9,373,754 yes\n\n.info 8,200,168 yes\n\n.nl 4,442,413 yes\n\n.cn 3,379,441 (on 28/02/2011) no\n\n.eu 3,341,775 yes\n\n.biz 2,254,683 yes\n\n_Source: BSI_\n\n_Fig. 11: The ten biggest top level domains [7]_\n\n\n-----\n\n### Routing\n\n##### Attack on internet infrastructure  availability\n\nAnother opportunity to use internet structures for\n\nattacks is in routing between connected systems. The\n\nstructure of the internet is based on different providers’\n\nnetworks interconnecting with one another. Informa\ntion on how the connected systems can be reached using\n\nnetworks and lines (routing) is exchanged via the Border\n\nGateway Protocol (BGP). Some of, there are very few\n\ncontrol mechanisms in existence that enable reliable\n\nverification of the information being exchanged. So\n\nanyone with access to the BGP infrastructure can mani\npulate the routing information being transmitted.\n\nA potential consequence of a manipulation of this\n\nkind could be that a network is no longer accessible.\n\nThere have often been disruptions in internet routing in\n\nthe past. The last major incident, which affected as many\n\nas 37,000 networks, happened on April 8, 2010. Some\n\nof the data packages addressed to these networks were\n\ndiverted to China.\n\n\n-----\n\n### Mobile Communication\n# 9\n\n\n-----\n\nAs the use of mobile devices for reading, using and trans\nmitting important business data on the move increases,\n\nthe BSI anticipates a rise in the number of attacks on\n\nthese devices in the future. Around 10 million people in\n\nGermany regularly use their cell phone to go online.[5]\n\nThe number of apps downloaded onto cell phones had\n\nreached the 900 million mark by the end of 2010.[6]\n\n##### Mobile Apps\n\n1,000\n\n900 Mio.\n\n900 (+112%)\n\n800\n\n700\n\n600\n\n500\n\n425 Mio.\n\n400 357 Mio.\n\n(+88%)\n\n300\n\n190 Mio.\n\n200\n\n100\n\n0\n\n2009 2010 2009 2010\n\nMobile apps down- Mobile apps sales in\nloads in Germany Germany in euros\n\n_Source: Bitkom_\n\n_Fig. 12: Development of downloads and sales of mobile apps for_\n_smartphones in Germany [6]_\n\n\nNot all smartphone users are aware of the risks of using\n\nmobile operating systems. According to a survey of\n\nsmartphone users by the BSI, around 60 per cent know\n\nthat their mobile devices have the same security re\nquirements in terms of security updates and protection\n\nsoftware as a PC. But 47 per cent of users have never\n\ndownloaded security updates onto their cell phones,\n\nonly 20 per cent do so at least once a week, and 11 per\n\ncent at least once a month.[7]\n\n##### Risks at the mobile interface\n\n GSM STANDARD\n\n_Originally named after the Groupe Spéciale Mobile,_\n\n_today GSM stands for Global System for Mobile Com-_\n\n_munications and is the world’s most widespread digital_\n\n_mobile network standard. A GSM network consists of_\n\n_four subsystems: the Mobile Station (MS), the Base Sta-_\n\n_tion Subsystem (BSS), the Operations and Support System_\n\n_(OSS) and the Network Switching Subsystem (NSS). The_\n\n_Mobile Station integrates into the GSM network by set-_\n\n_ting up a communication connection with a BSS via the_\n\n_air interface, i.e. via the wireless interface between the_\n\n_Mobile Equipment (ME) and a Base Transceiver Station_\n\n_(BTS) on the GSM mobile network (Um interface)._\n\n\n1,000\n\n900 Mio.\n\n900 (+112%)\n\n800\n\n700\n\n600\n\n500\n\n425 Mio.\n\n400 357 Mio.\n\n(+88%)\n\n300\n\n190 Mio.\n\n200\n\n100\n\n0\n\n2009 2010 2009 2010\n\nMobile apps down- Mobile apps sales in\nloads in Germany Germany in euros\n\n\n-----\n\nThe insecurity of the GSM interface is a particularly\n\nsignificant threat to the use of smartphones. Users who\n\nare inadequately protected need to be aware that their\n\nconnection data (telephone numbers and call times)\n\nand usage data (e.g. call data, e-mails and text messages)\n\ncan be intercepted or that an attacker can find out their\n\nwhereabouts and their movement profile.\n\nAll usage data crossing the GSM air interface are en\ncoded according to the GSM standard. But this code is\n\nno longer up to date, and tools for intercepting GSM\n\ncommunication have been available for some time.\n\nME\n\nBTS\n\nSIM\n\n**MS**\n\nBSC\n\nTE\n\nBTS\n\n**BSS**\n\n_Source: BSI_\n\n_Fig. 13: Simplified diagram of a GSM mobile network [7]_\n\n\nThus a data thief can work out the GSM code if they\n\nmanage to intercept data communication on the GSM\n\nair interface. Once they have this code, they can then\n\ndecode GSM call data and sometimes even text mes\nsages. Data connections via UMTS (Universal Mobile\n\nTelecommunications System), GPRS (General Packet\n\nRadio Service) and EDGE (Enhanced Data Rates for\n\nGSM Evolution) and calls via UMTS are unaffected.\n\n|ME SIM MS|Col2|\n|---|---|\n|||\n\n\nME\n\n**PSTN**\n\nBTS\n\nSIM\n\n**MS**\n\nBSC MSC/ GMSC\nVLR\n\nTE\n\nEIR **SS7**\n\nBTS\n\nOMC/\nNMC HLR AuC\n\n**BSS** **OSS** **NSS**\n\n\n-----\n\nOther security risks in the use of mobile devices are:\n\n» \u0007Back-end eavesdropping: the attacker captures\n\nthe call data on a cable that transmits the calls\n\nunencrypted.\n\n» \u0007Loading and installation of malware from the inter\nnet and manipulability of mobile devices by Trojan\n\nsoftware. Malware can render a smartphone unusable\n\nand use it to infect IT systems that are networked with\n\nthe phone. Mobile phones infected with a Trojan horse\n\ncan even be used as a phone tap that is operated re\nmotely via the mobile interface. Finally, user data\n\ncan be mined and sent to the data thief.\n\n» \u0007If a cell phone user’s itemized bill shows evidence of\n\nadditional or even missing calls, this may also be an\n\nindication of an attack, e.g. by a Trojan horse.\n\n» \u0007Man-in-the-Middle attack: in this case, the attacker\n\nmimics a GSM base station. This is relatively easy to do,\n\nas no authentication to the mobile device is required.\n\nThe attacker assumes a position between the mobile\n\ndevice and the mobile network and deactivates the\n\nGSM encryption.\n\n\n_provide better protection when using mobile devices, the_\n\n\n-----\n\n### Issues of the Future\n# 10/11\n\n\n-----\n\n### Cloud Computing\n# 10\n\n\n-----\n\nThe subject of Cloud Computing is very topical in the » \u0007If the interfaces provided by a cloud provider are\n\nworld of IT at the moment and has been gaining in signifi- insecure, vulnerabilities can be exploited to gain un-\n\ncance worldwide in recent years. In Germany too, market authorized access to data.\n\nresearchers expect expenditure on cloud services to grow » \u0007Because of the extremely high complexity of Cloud\n\nrapidly over the next few years. It is estimated that sales Computing platforms, numerous security problems\n\nof cloud services in Germany will rise from €1.14 billion in can arise such as data loss, unauthorized access to\n\n2010 to as much as €8.2 billion by 2015. This corresponds information, impairment of availability or even loss\n\nto an average annual growth in sales of 48 per cent.[8] of services.\n\nThere are many reasons why interest in Cloud Com- The BSI believes that the concept of Cloud Computing\n\nputing and the use of Cloud Services are on the rise. will gain a foothold in the market because of its tech-\n\nCloud Computing offers enormous flexibility in terms of nical and economic potential, provided the issue of\n\nbooking, using and shutting down computer center ca- reasonable information security is resolved. For as it\n\npacity in line with actual demand. There is also massive becomes more widespread, the concept will become\n\npotential for savings on IT systems that would other- more attractive to attackers as resources are concentra-\n\nwise have to be operated and maintained locally and ted in central locations. Cloud Computing platforms are\n\nreplaced regularly. Another advantage is the ubiquitous already being used to set up botnets, deposit malware,\n\navailability of business applications regardless of the send spam or carry out brute force attacks on passwords.\n\nuser's geographical location. In addition, some cases have emerged of Cloud Compu-\n\nting platforms being targeted by DDoS attacks.\n\n##### Opportunities versus risks\n\nThese potential benefits are offset by a series of risks Summary:\n\nassociated with storing data and applications in a Public\n\nCloud, including the following: _The risk potential is expected to increase. For this rea-_\n\n» \u0007Data and applications are kept off site and are there- _son, there is an urgent need to draw up and establish_\n\nfore no longer accessible directly to in-house IT. _internationally recognized standards on the basis of_\n\n» \u0007Applicable guidelines and regulations such as data _which Cloud Computing platforms can be used and_\n\nprotection requirements could potentially be in- _operated more securely and can be monitored and_\n\nfringed if sensitive data is stored in a Public Cloud. _certified._\n\n» \u0007Large numbers of unknown users share a joint in-\n\nfrastructure. This increases the risk of infringing the\n\nfundamental values of information security.\n\n» \u0007Data and applications are accessed via the internet,\n\nso they cannot be accessed if the internet connection\n\nfails.\n\n\n-----\n\n### Smart Grid / Smart Meter\n# 11\n\n\n-----\n\nThe worldwide market volume for Smart Grid technol- are already being designed, built and even implemen-\n\nogies could potentially be 100 times bigger than the ted. The BSI provides support for the development of the\n\ninternet, according to estimates by the US company Cisco fundamental principles of intelligent electricity supply\n\nSystems. The increasing complexity of electricity net- systems, thus ensuring that the most important aspects\n\nworks furthermore calls for new forms of whole-system of IT security are taken into account. The introduction of\n\nprotection against outages. These mechanisms are smart meters will be a key element of supply infrastruc-\n\nsupposed to use networked IT systems, which in parts still ture improvement . Because the smart meter processes\n\nneed additional development and implementation work. and forwards personal consumption data and due to\n\npotential negative repercussions for the energy supply,\n\nAs energy and water supply systems are indispensable, there are high requirements for data protection and\n\nthe current very high level of security of supply will need data security.\n\nto be maintained during this work. Supplies must not be\n\nput at risk by outages, faults or attacks on the IT infra-\n\nstructures being implemented – and must be sufficiently\n\nrobust even in crisis situations. Specific risks may also Summary:\n\narise in future due to the fact that certain parts of the\n\ninfrastructures will be networked in a complex way _Recent known hacking attacks on smart meters in the_\n\nbetween different operators. This applies in particular if _USA and hazards like Stuxnet have shown that urgent_\n\nthis networking takes place via information infrastruc- _action needs to be taken in Germany to ensure that_\n\ntures that are used for very different applications with a _smart metering solutions are secure. The BSI will there-_\n\nlarge number of communication participants, or if the _fore be working with industry associations and relevant_\n\ninformation is exchanged via the public internet. _authorities such as the German Federal Network Agency_\n\n_(BNetzA) and the Physikalisch Technische Bundes-_\n\n_anstalt (the National Metrology Institute Providing_\n\n##### Smart meters Scientific and Technical Services – PTB) to bring together\n\n_the security requirements for smart meters in a spe-_\n\nGiven the above, designing and setting up networks that _cial protection profile with a view to ensuring that all_\n\ncan be controlled flexibly is the order of the day. We still _market participants meet compulsory data protection_\n\nhave a long way to go before we see the introduction of _and security requirements. The intention is to publish a_\n\nintegrated, intelligent supply systems: there is still a lot _BSI-certified version of the protection profile by Sep-_\n\nof fundamental development work to do in the sectors _tember 2011. The BSI will also be publishing a Technical_\n\nconcerned. But the first steps are already being taken in _Guideline which will set out the requirements for smart_\n\nthe supply infrastructures, where various technologies _meter interoperability._\n\n\n-----\n\n### Conclusion\n\nAs IT penetrates into all areas of our lives and networks become ever\n\nmore interconnected, we depend on it operating flawlessly. The BSI and\n\nother security agencies believe that the new hazards arising in parallel\n\nto this development, such as cyber attacks, attacks on mobile devices\n\nand attacks extending beyond conventional IT, represent a new, joint\n\nchallenge to politics, industry and society in general.\n\nOffers that provide reactive help to the federal administration, industry\n\nand private individuals are necessary and fulfill an important role. In or-\n\nder to effectively combat the threat potential, we will need to focus even\n\nmore strongly on prevention going forward. In order to ensure a basic\n\nlevel of IT security and anticipate risks in advance as far as possible, it is\n\nbecoming increasingly important to formulate security requirements\n\nfor products and services and make these transparent to the general\n\npublic. The BSI pursues this approach by formulating minimum stan-\n\ndards, such as for Cloud Computing. This will create the technical basis\n\nfor trusting secure IT and benefiting from its potential. Furthermore,\n\nmanufacturer and service provider responsibility is increasingly in the\n\nspotlight.\n\nImproving IT security is a goal that can only be achieved by working to-\n\ngether effectively. Success in this area depends on cooperation between\n\nmanufacturers, providers, security experts, security officers and, not\n\nleast, users, whose awareness plays an important role in implementing\n\nwidespread security measures.\n\n\n-----\n\n### BSI – Focusing on IT Security\n\n\n-----\n\nWith the coalition agreement and the BSI Act of August\n\n2009, the German federal government has responded\n\nto the demands of IT security and has assigned the BSI a\n\nstronger role as a designer and provider of IT security ser\nvices. The coalition agreement also emphasizes the BSI's\n\nduty to promote self protection and encourage the use\n\nof secure IT products.\n\n**Education and Awareness Raising**\n\nThe BSI has been active in Education and Awareness\n\nRaising for many years. For example, it operates the BSI\n\nInformation Portal for the general public: the website\n\nwww.bsi-fuer-buerger.de is still the BSI's most important\n\nsource of information for private users. Since February\n\n2011, the public has had access to a revised and improved\n\noffering which provides detailed and easy to understand\n\ninformation on IT security and makes it easier for people\n\nto protect their computers.\n\n**Working Together**\n\nEducation and awareness raising on the subject of IT\n\nsecurity has many different faces. Exchanging infor\nmation and ideas and cooperating with partners and\n\ndisseminators are therefore particularly significant.\n\nFor this reason, the BSI is represented on the advisory\n\nboard of Deutschland sicher im Netz e.V. and supports\n\nthe Anti-Botnet Advisory Center run by the eco-Associ\nation of the German Internet Industry, which opened\n\nin the fall of 2010. At the international level, the BSI is a\n\nmember of the Awareness Raising Community of ENISA\n\n(European Network and Information Security Agency),\n\nand takes part in the European Union's annual Safer\n\nInternet Day with awareness-raising campaigns.\n\n\n**IT Security Provider to the**\n\n**German Federal Government**\n\nAs the central IT Security service provider to the German\n\nfederal government, the BSI is improving the level of IT\n\nsecurity within the federal administration. In particular\n\nin the event of IT crises of national significance, it is vital\n\nto ensure that the federal government can continue\n\nto operate and take decisions by providing prepared\n\ninformation and competent analyses. With this in mind,\n\nseveral steps have been taken: an IT Crisis Response\n\nCenter for the federal government has been set up at the\n\nBSI, the amendment to the BSI Act has established the\n\nBSI as a central reporting point for IT security incidents,\n\nand an IT crisis management department has been set\n\nup for the federal administration. So the administration\n\nnow has an early warning system in place which enables\n\nassessments to be made and crisis response processes\n\nto be defined and practiced in accordance with crisis\n\nmanagement principles.\n\n**Working Together in IT Crises**\n\nA targeted and complex attack like Stuxnet has long\n\nsince been the subject of theoretical discussion. But now,\n\nfor the first time, there is actual proof of the fact that\n\nwith the right financial input and technical preparation,\n\nprotective mechanisms can be evaded and circumven\nted. We need to be able to respond to this new quality\n\nof attack, since attack mechanisms as used by Stuxnet\n\nare not oriented towards the conventional task-sharing\n\nof German authorities. Stuxnet proves that even closer\n\ncoordination between authorities and more intensive\n\ncollaboration with business and industry is needed. For\n\nthis reason, in 2011 the federal government adopted the\n\nCyber Security Strategy, which provides for the estab\nlishment of a Cyber Defense Center headed by the BSI\n\nand with the direct participation of the Federal Office\n\nfor the Protection of the Constitution and the Federal\n\n\n-----\n\nOffice of Civil Protection and Disaster Assistance, along\n\nwith other authorities. There are also plans to expand\n\ncooperation with business and industry.\n\n**Trusting the Security of Technology**\n\nPeople will only use the possibilities and potential\n\noffered by IT and the internet if they trust the security of\n\nthe technology concerned. Quality marks from author\nitative sources and established IT security standards\n\nform the basis for this trust. With IT security standards in\n\nmind, the BSI is taking part in forward-looking projects\n\nlike smart meters (intelligent energy supply meters) and\n\nCloud Computing. For smart meters, the BSI is working\n\nwith industry and data and consumer protection orga\nnizations to develop a joint protection profile. The aim\n\nof this profile is to achieve a reasonable level of security\n\nwhich adequately takes account of functionality as well\n\nas data protection and IT security. It is also working with\n\nmanufacturers to produce minimum security standards\n\nfor Cloud Computing. In addition to this, BSI certifi\ncation ensures that compulsory safety standards for\n\nproducts are guaranteed and implemented.\n\nTwo important projects in which the BSI played a key role\n\non the technical implementation side and which repre\nsent a step forward in terms of secure online communi\ncation and interaction are the new German ID card and\n\nDe-Mail. De-Mail enables legally binding documents\n\nand messages to be sent confidentially via the internet. It\n\nincreases the security of electronic communication com\npared with conventional methods. The main security\n\ngoals of confidentiality, integrity and authenticity in De\nMail communication are guaranteed with defined secu\nrity measures. De-Mail enables the identity of the com\nmunication partners and the delivery of the De-Mail to be\n\nproved. The content of a De-Mail cannot be intercepted or\n\nchanged on its journey through the ether.\n\n\nIn the new ID card introduced in November 2010,\n\nGerman citizens have more than just a new credit-card\n\nformat identity document. This card also has various\n\nelectronic functions which greatly improve security on\n\nthe internet. These include the eID, electronic ID which\n\npeople can use to prove their identity beyond doubt.\n\nA radio frequency chip (RF chip) integrated into the\n\ncard contains all the information that is also displayed\n\nvisually on the document. In addition, the QES (Qualified\n\nElectronic Signature) function enables the user to sign\n\ndocuments and declarations of intent online in a legally\n\nbinding way.\n\n**Critical Infrastructures (KRITIS)**\n\nA particular focus of our collaboration with industry\n\nconcerns the protection of critical infrastructures – a\n\nresponsibility shared by the operators and the state. The\n\nBSI and operators of critical infrastructures in Germany\n\nhave been working closely together since 2007 within\n\nthe framework of the KRITIS Implementation Plan to\n\ndiscuss new threats and strategies and implement new\n\nmeasures. Exercises are held regularly to prepare for\n\nincidents. One of the most important exercise formats is\n\nthe LÜKEX (National Crisis Management Exercise). The\n\nKRITIS companies will be working intensively on this in\n\n2011, as an exercise on the loss of major IT systems and\n\ncrisis management in this emergency situation is due to\n\ntake place this year.\n\n\n-----\n\n### Bibliography\n\n[1] Secunia Yearly Report 2010\n\n[2] http://gs.statcounter.com/press/firefox-overtakes-internet-explorer-in-europe-in-browser-wars\n\n[3] Trend Micro September 16, 2009 http://blog.trendmicro.com/the-internet-infestation-how-bad-is-it-really/\n\n[4] Damballa 14 February 2011 http://www.damballa.com/knowledge/Feb2011report.php\n\n[5] BITKOM press release, August 15, 2010\n\n[6] BITKOM press release, February 14, 2011\n\n[7] BSI surveys\n\n[8] BITKOM press release, October 6, 2010\n\n[9]  Arbor Worldwide Infrastructure Security Report 2010\n\n\n-----\n\n### List of illustrations\n\nFig. 1: Development of IT threats as assessed by BSI[7] 7\n\nFig. 2: Risk potential of attack opportunities in selected applications and technologies as assessed by BSI [7 ] 7\n\nFig. 3: Risk profile of innovative applications and technologies as assessed by BSI [7 ] 7\n\nFig. 4: Number of time-critical security vulnerabilities reported by Bürger-CERT and\n\nTechnical Warnings issued by CERT-Bund [7] 9\n\nFig. 5: Bandwidth increase in DDoS attacks [9] 15\n\nFig. 6: Development of spam volume in Germany since January 2010 [7] 18\n\nFig. 7: Cumulative weekly volume of spam and solicited e-mails sent from Germany [7] 19\n\nFig. 8: Spam distribution in Germany in 2010 by country of origin [7] 19\n\nFig. 9: Casino waves and total spam volume over a typical day [7] 20\n\nFig. 10: Drop zone datasets in 2010 from approx. 200 drop zones with direct link to .de domains [7] 22\n\nFig. 11: The ten biggest top level domains [7] 31\n\nFig. 12: Development of downloads and use of mobile apps for\n\nsmartphones in Germany [6] 34\n\nFig. 13: Simplified diagram of a GSM mobile network [7] 35\n\n\n-----\n\n**Published by**\n\nFederal Office for Information Security – BSI\n\n53175 Bonn, Germany\n\n**Text and Editorial Staff**\n\nFederal Office for Information Security\n\nDauthKaun Public Relations\n\n**Layout and Design**\n\nDauthKaun Werbeagentur\n\n**Printed by**\n\nDruckpartner Moser, Rheinbach, Germany\n\n**Date**\n\nMay 2011\n\n**Article Number**\n\nBSI-LB11502e\n\n**Distribution Office**\n\nFederal Office for Information Security – BSI\n\nGodesberger Allee 185 – 189, 53175 Bonn, Germany\n\nSection 321, Information and Communication, Public Relations\n\nTel.: +49 228 99 9582-0, E-mail: publikationen@bsi.bund.de\n\ninternet: www.bsi.bund.de\n\nThis brochure is part of the public relations work of the German Government.\n\nIt is distributed free of charge and is not intended to be sold.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/BSI - IT Security Situation in Germany - 2011.pdf"
    ],
    "report_names": [
        "BSI - IT Security Situation in Germany - 2011.pdf"
    ],
    "threat_actors": [
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535757,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1310639928,
    "ts_modification_date": 1310639932,
    "files": {
        "pdf": "https://archive.orkl.eu/8d1c2c05da05a4f5f94ae7873275e7e4f7908856.pdf",
        "text": "https://archive.orkl.eu/8d1c2c05da05a4f5f94ae7873275e7e4f7908856.txt",
        "img": "https://archive.orkl.eu/8d1c2c05da05a4f5f94ae7873275e7e4f7908856.jpg"
    }
}