{
    "id": "a5136100-af79-41f9-ac9a-ae86090cdb94",
    "created_at": "2023-01-12T14:59:24.035507Z",
    "updated_at": "2025-03-27T02:13:09.64501Z",
    "deleted_at": null,
    "sha1_hash": "9458d3a7042c2a4433132107c77f6386ed349223",
    "title": "2018-03-14 - Inception Framework- Alive and Well, and Hiding Behind Proxies",
    "authors": "",
    "file_creation_date": "2022-05-28T21:56:31Z",
    "file_modification_date": "2022-05-28T21:56:31Z",
    "file_size": 1031509,
    "plain_text": "# Inception Framework: Alive and Well, and Hiding Behind Proxies\n\n**[symantec.com/blogs/threat-intelligence/inception-framework-hiding-behind-proxies](https://www.symantec.com/blogs/threat-intelligence/inception-framework-hiding-behind-proxies)**\n\n## Espionage group has remained active over the past three years, using cloud and IoT to hide in plain sight.\n\nThe cyber espionage group known as the Inception Framework has significantly developed\nits operations over the past three years, rolling out stealthy new tools and cleverly leveraging\nthe cloud and the Internet of Things (IoT) in order to make its activities harder to detect.\n\nSince 2014, Symantec has found evidence of a steady stream of attacks from the Inception\nFramework targeted at organizations on several continents. As time has gone by, the group\nhas become ever more secretive, hiding behind an increasingly complex framework of\nproxies and cloud services.\n\n## History of stealthy attacks\n\nThe Inception Framework has been active since at least May 2014 and its activities were first\nexposed by Blue Coat (now part of Symantec) in December 2014. Right from the start, the\ngroup stood out because of its use of an advanced, highly automated framework to support\nits targeted attacks. This level of sophistication is rarely seen, even in the targeted attacks\nsphere. The nature of Inception’s targets, from 2014 right through to today, along with the\ncapabilities of its tools, indicate that espionage is the primary motive of this groups\n\n\n-----\n\nIn 2014, Inception was compromising targeted organizations using spear-phishing emails,\nwhich masqueraded as legitimate emails concerning international policy, upcoming\nconferences, and specific sectoral interests of the targeted organization.\n\nMore than half of the group’s earlier targets were in the Energy or Defense sectors, but it\nalso targeted organizations in the Consultancy/Security, Aerospace, Research, and Media\nsectors, in addition to embassies. Its activities ranged across the globe, with targets located\nin South Africa, Kenya, the United Kingdom, Malaysia, Suriname, along with several other\nEuropean and Middle Eastern countries.\n\nWord documents attached to Inception’s spear-phishing emails leveraged two Microsoft\n[Office vulnerabilities (CVE-2014-1761 and](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-1761) [CVE-2012-0158) to install malware on the](http://cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2012-0158)\nrecipient’s computer. The malware had a multi-staged structure that began with a malicious\nRTF document and ended with an in-memory DLL payload that communicated, via the\nWebDAV protocol, with a command and control (C&C) address from a legitimate cloud\nservice provider (CloudMe.com). The name “Inception” comes from the group’s many levels\nof obfuscation and indirection it employed in delivering this payload.\n\nFurther layers of obfuscation emerged when Blue Coat was able to determine that the\nattackers were communicating with CloudMe.com through a hacked network of\ncompromised routers, the majority of which were located in South Korea.\n\n## Stepping out of the shadows once again\n\nFollowing its exposure in late 2014, Inception fell quiet. However, this turned out to be only a\nbrief hiatus and, by April 2015, there had been a resurgence in activity. Attacks have\ncontinued since then, right through to 2017.\n\n\n-----\n\nFigure 1. Inception Framework attacks 2015-2017\nIn the intervening years, the Inception Framework has evolved, adding additional layers of\nobfuscation in a bid to avoid detection. The group is using new types of lure documents in its\nspear-phishing campaigns and its malware has expanded to use new types of plugins.\nInception has also increased its use of the cloud, and diversified the range of cloud providers\nit uses for C&C purposes.\n\n\n-----\n\nFigure 2. Locations of organizations targeted by Inception, 2015-2017\nThe locations of Inception’s targets have shifted since 2014, but the group continues to have\na global reach. Russia accounted for the largest number of attacks between 2015 and 2017,\nfollowed by Ukraine, Moldova, Belgium, Iran, and France.\n\n## An evolved attack framework\n\nSince 2014, the Inception Framework has steadily changed its tools and techniques. In its\nearly attacks, the group’s malware payload (with the exception of plugins) was fully\ncontained within an exploit document emailed to the victim. In more recent activity, these\nspear-phishing attacks are now a two-stage process. The group will first email the target a\n[malicious “Reconnaissance document” which, if opened, will fingerprint the target computer,](https://securelist.com/an-undocumented-word-feature-abused-by-attackers/81899/)\ngathering information on what software it is running and whether that software is up to date.\n\nSeveral days later, Inception will send a second spear-phishing email to the target, with\nanother malicious document attached. This document is designed to retrieve a remote RTF\nfile, which contains the exploit, and open it on the target’s computer.\n\nShortly after this RTF document is opened, the remaining stages of the Inception malware\nare found executing on the system. The loader DLL is responsible for decrypting and\ninjecting the core payload DLL into memory, from an encrypted file present on disk. The core\n\n\n-----\n\npayload DLL s main function is to gather system information, execute other malware in the\nform of plugins, and update itself. It accesses C&C via WebDAV hosted on legitimate cloud\nstorage providers.\n\nThe use of an initial reconnaissance document allows Inception to profile the target’s\ncomputer and potentially customize any subsequent malicious document to exploit known\nvulnerabilities in unpatched software on the computer.\n\nBy breaking its attacks up into distinct stages, Inception also makes them harder to detect.\nFor investigators to trace an attack, each stage will have be uncovered and referenced to the\nother stages.\n\n## Modular malware\n\nInception’s malware is modular and the attackers will load plugins based on requirements for\neach attack. The group has used a range of plugins in recent attacks, some of which are\nimproved versions of plugins used in 2014, while others were previously unseen.\n\n**File hunting plugin: The most frequently used plugin, similar to one used in 2014.**\nOften used to collect Office files from temporary internet history.\n**Detailed survey plugin: Used to gather domain membership, processes/loaded**\nmodules, hardware enumeration, installed products, logical and mapped drive\ninformation. Evolution of earlier plugin used in 2014.\n**Browser plugin: Used to steal browser history, stored passwords and sessions. Works**\nwith Internet Explorer, Chrome, Opera, Firefox, Torch, and Yandex.\n**File listing plugin: Works on local or remote drives and can map additional paths**\nwhen given credentials.\n\n## Expanding use of the cloud\n\nSince 2014, Inception has widened its use of cloud service providers for C&C purposes.\nWhereas previously it relied on one service provider (CloudMe.com), more recently it has\nemployed a least five cloud service providers\n\nLeveraging the cloud for C&C has a number of advantages for groups like Inception. Any\nC&C communications will involve encrypted traffic to a known website, meaning it is less\nlikely to raise flags on targeted networks. Legitimate cloud services are not likely to be\nblacklisted.\n\nVarying the cloud service provider used adds a further degree of stealth. Once it became\nknown Inception was using a single provider, any traffic to that provider may have attracted\nadditional scrutiny.\n\n\n-----\n\nSymantec has notified all cloud providers affected. Where possible Symantec has provided\ndetails on the C&C accounts used by Inception to the affected cloud providers. The accounts\nin questions have been deleted or disabled.\n\n## Using IoT to hide behind proxies\n\nInception is continuing to use chains of infected routers to act as proxies and mask\ncommunications between the attackers and the cloud service providers they use. Certain\nrouter manufacturers have UPnP listening on WAN as a default configuration. Akamai\nresearch has found that there are 765,000 devices vulnerable to this attack. These routers\nare hijacked by Inception and configured to forward traffic from one port to another host on\nthe internet. Abuse of this service requires no custom malware to be injected on the routers\nand can be used at scale very easily. Inception strings chains of these routers together to\ncreate multiple proxies to hide behind.\n\n\"#InceptionFramework evolved, rolling out new tools & hiding behind increasingly complex\narray of proxies & cloud services symc.ly/2GsqXra\"\n[Click to Tweet](https://twitter.com/intent/tweet?text=%23InceptionFramework%20evolved,%20rolling%20out%20new%20tools%20%26%20hiding%20behind%20increasingly%20complex%20array%20of%20proxies%20%26%20cloud%20services%20symc.ly/2GsqXra&via=threatintel&hashtags=undefined)\nEvery connection builds different chains of infected routers and once the connection is\ncomplete, it cleans up after itself. In several cases, Symantec has been able to follow the\nentire chain of compromised routers and found it led to a virtual private server (VPS),\nmeaning the attackers have employed an additional layer of security by routing\ncommunications through rented hosting servers.\n\n\n-----\n\n## Mobile devices targeted\n\nInception has an ongoing interest in mobile devices and has previously developed malware\n[to infect Android (Android.Lastacloud), iOS (IOS.Lastaccoud) and BlackBerry devices](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121216-4334-99)\n[(BBOS.Lastacloud).](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121913-0103-99)\n\n\n-----\n\nMobile malware continues to be deployed and the group has made some modifications to its\nAndroid malware. The malware is spread via SMS messages and emails containing\nmalicious links. Once installed, it uses user profile pages on online forums as dead drops for\nits C&C.\n\nFigure 3. Malicious SMS message\n\nused by Inception to spread Android malware\n\n## Persistence, stealth, and global reach\n\nEven prior to its discovery in 2014, Inception went to great lengths both to avoid detection\nand conceal its location. Exposure hasn’t deterred the group. Instead, it has redoubled its\nefforts, adding more layers of obfuscation to an already complex attack framework. Its\npersistence, stealth, and global reach mean the group continues to pose an ongoing risk to\norganizations, particularly in its areas of interest, which include defense, aerospace, energy,\ngovernments, telecoms, media, and finance.\n\nAside from a suite of advanced modular malware, the group is notable for its ability to make\nuse of new platforms such as the cloud, IoT, and mobile to facilitate its attacks. An “early\nadopter”, Inception’s tactics may point the way towards how other espionage groups may\nmodify their methods in years to come.\n\n## Protection\n\nSymantec has had protection for all of the Inception Framework tools since the initial\nemergence of the group in 2014. The following detections are in place today:\n\n**File-based protection**\n\n[Infostealer.Rodagose](https://www.symantec.com/security_response/writeup.jsp?docid=2014-120814-2005-99)\n[Trojan.Rodagose!g1](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121010-5835-99)\n[Trojan.Rodagose!g2](https://www.symantec.com/security_response/writeup.jsp?docid=2017-102416-2407-99)\n[Trojan.MDropper](https://www.symantec.com/security_response/writeup.jsp?docid=2005-031911-0600-99)\n\n**Mobile**\n\n[Android Lastacloud](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121216-4334-99)\n\n\n-----\n\n[BBOS.Lastacloud](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121913-0103-99)\n[IOS.Lastacloud](https://www.symantec.com/security_response/writeup.jsp?docid=2014-121216-5858-99)\n\n**Network Protection Products**\n\nMalware Analysis Appliance detects activity associated with Inception\n\nCustomers with Webpulse-enabled products are protected against activity associated with\nInception\n\n## About the Author\n\n### Threat Hunter Team\n\n**Symantec**\n\nThe Threat Hunter Team is a group of security experts within Symantec whose mission is to\ninvestigate targeted attacks, drive enhanced protection in Symantec products, and offer\nanalysis that helps customers respond to attacks.\n\n## About the Author\n\n### Network Protection Security Labs\n\nNetwork Protection Security Labs is a group of security experts within Network Protection\nProducts doing advanced security research to continuously improve Symantec Network\nProducts.\n\n## Want to comment on this post?\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-14 - Inception Framework- Alive and Well, and Hiding Behind Proxies.pdf"
    ],
    "report_names": [
        "2018-03-14 - Inception Framework- Alive and Well, and Hiding Behind Proxies.pdf"
    ],
    "threat_actors": [
        {
            "id": "02c9f3f6-5d10-456b-9e63-750286048149",
            "created_at": "2022-10-25T16:07:23.722884Z",
            "updated_at": "2025-03-27T02:02:09.945869Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK 116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "Inception Framework",
                "Operation Cloud Atlas",
                "Operation RedOctober",
                "The Rocra"
            ],
            "source_name": "ETDA:Inception Framework",
            "tools": [
                "Lastacloud",
                "PowerShower",
                "VBShower"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04a7ebaa-ebb1-4971-b513-a0c86886d932",
            "created_at": "2023-01-06T13:46:38.784965Z",
            "updated_at": "2025-03-27T02:00:02.91817Z",
            "deleted_at": null,
            "main_name": "Inception Framework",
            "aliases": [
                "ATK116",
                "Blue Odin",
                "Clean Ursa",
                "Cloud Atlas",
                "G0100"
            ],
            "source_name": "MISPGALAXY:Inception Framework",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535564,
    "ts_updated_at": 1743041589,
    "ts_creation_date": 1653774991,
    "ts_modification_date": 1653774991,
    "files": {
        "pdf": "https://archive.orkl.eu/9458d3a7042c2a4433132107c77f6386ed349223.pdf",
        "text": "https://archive.orkl.eu/9458d3a7042c2a4433132107c77f6386ed349223.txt",
        "img": "https://archive.orkl.eu/9458d3a7042c2a4433132107c77f6386ed349223.jpg"
    }
}