{
    "id": "a6023d4a-7988-4b3c-9fb8-925e94491633",
    "created_at": "2023-01-12T15:04:39.446901Z",
    "updated_at": "2025-03-27T02:16:34.822355Z",
    "deleted_at": null,
    "sha1_hash": "2666ba48d5a18bb785940c8720b4ccf628f72a30",
    "title": "2021-07-06 - Understanding Russia’s Cyber Strategy",
    "authors": "",
    "file_creation_date": "2022-05-29T01:31:57Z",
    "file_modification_date": "2022-05-29T01:31:57Z",
    "file_size": 393899,
    "plain_text": "# Understanding Russia’s Cyber Strategy\n\n**[fpri.org/article/2021/07/understanding-russias-cyber-strategy/](https://www.fpri.org/article/2021/07/understanding-russias-cyber-strategy/)**\n\nThe Russian Federation’s willingness to engage in offensive cyber operations has caused\nenormous harm, including massive financial losses, interruptions to the operation of critical\ninfrastructure, and disruptions of crucial software supply chains. The variety and frequency\nof these operations, as well as the resulting attribution efforts, have offered an unusually\nvivid picture of Russia’s cyber capabilities and tactics. While many other countries have\nrelied heavily on vague strategies and threats to signal their emerging cyber powers, Russia\nhas exercised its technical capabilities with relative impunity for more than a decade. This\nmakes it possible to chart Moscow’s increasingly bold forays into the cyber domain\nalongside the increasingly technically sophisticated specific vulnerabilities, techniques, and\ntactics that Russia has leveraged. This timeline reveals a shift towards more covert,\ntargeted cyber capabilities in recent years, as well as an evolution away from phishingbased compromises to supply chain and service provider intrusions, in conjunction with a\ncontinued reliance on and reuse of the same infrastructure and malware across multiple\noperations.\n\n## Emphasis on Covert Capabilities\n\nGoing all the way back to the 2007 denial-of-service attacks directed at Estonian\ninfrastructure, Russia’s cyber activities have been more high-profile and deliberately publicly\nvisible than those attributed to any other country, with the possible exception of North\nKorea. Many countries, including the People’s Republic of China and the United States,\nhave relied primarily on cyber capabilities for covert espionage or sabotage efforts that\ncould be executed over the course of months, or even years, without detection. By contrast,\nRussia’s exploits in cyberspace, including the 2016 breaches of the Democratic National\nCommittee and the Democratic Congressional Campaign Committee and the 2017\nNotPetya attacks, often drew immediate attention, by design. Bilyana Lilly and Joe\n\n\n-----\n\n[Cheravitch describe how the visibility of Russia s cyber operations increased over time with](https://ccdcoe.org/uploads/2020/05/CyCon_2020_8_Lilly_Cheravitch.pdf)\nthe gradual shift in leadership of those operations from the FSB, Russia’s domestic security\nagency, to the GRU, Russia’s military intelligence agency, which “brought with it a culture of\naggression and recklessness” and a “high tolerance for operational risk” that was unusual in\nthe cyber domain.\n\nMore recently, [increased activity from Russia’s civilian foreign intelligence service, SVR, has](https://adversary.crowdstrike.com/en-US/adversary/cozy-bear/)\nsuggested a growing emphasis on long-term, covert cyberespionage operations. For\n[instance, the SolarWinds compromise discovered in late 2020 went undetected for at least](https://www.nytimes.com/2021/01/02/us/politics/russian-hacking-government.html)\nnine months, probably in large part because Russia exercised uncharacteristic restraint in\ntargeting only a small subset of the victims that it had compromised. The malicious\nSolarWinds Orion software update that was used to establish an initial foothold in victims’\ncomputer systems was downloaded by roughly 18,000 SolarWinds customers, according to\n[a December 2020 SolarWinds Securities and Exchange Commission filing. That initial](https://www.sec.gov/ix?doc=/Archives/edgar/data/1739942/000162828020017451/swi-20201214.htm)\nfoothold only offered very preliminary access to computer systems, and many of the\norganizations that did download the compromised software update have not reported\nfurther exploitation.\n\n[Speaking at an event in March 2021, Silverado Policy Accelerator Chairman Dmitri](https://www.csis.org/events/evolution-russian-cyber-tactics-and-operations)\nAlperovitch referred to the SolarWinds compromise as “a very precise operation” because\nRussia “did not exploit the vast majority of the 18,000 victims.” He continued, “I don’t think\nthey did this to do us any favors, I think the primary reason for doing that was to actually\nremain stealthy.” Stealth typically requires not just restraint in cyber operations, but also\ngreater technical sophistication to avoid the growing number of intrusion detection and\nnetwork monitoring tools. Furthermore, it can be difficult to carry out these types of longterm covert cyber operations alongside more destructive, public-facing ones like NotPetya,\nwhich tend to trigger increased scrutiny and attention to sensitive networks.\n\nIt’s possible that the Russian shift to more covert cyber activity is merely a byproduct of the\nSVR finally developing the tools and techniques that it needed to carry out cyberespionage\ncampaigns, rather than an indication of a long-term shift in Russia’s overall cyber strategy.\nIt’s also plausible that the relative inactivity of the GRU in the cyber domain since 2018,\n[when the SVR began ramping up its efforts to access cloud resources, is a deliberate,](https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\nstrategic choice on Moscow’s part to draw less attention to its online operations. In the\nfuture, that balance could swing back in the other direction, with the GRU executing more\ndisruptive cyberattacks, but given the shared reliance on some of the same infrastructure,\nmalware, and techniques, such a shift might well jeopardize some of the SVR’s operations.\n\n## Tactics, Vulnerabilities, and Technical Sophistication\n\nRussia’s shift to more covert operations means that it is relying less heavily on techniques\nlike traditional phishing and denial-of-service attacks. Instead, the focus is on more\nadvanced intrusion tactics like credential harvesting, supply chain compromises, and\n\n\n-----\n\ninfiltrating critical service provider platforms. Russia s growing technical sophistication is\nevident in its growing reliance on customized malware rather than tools and programs\npurchased from the black market. Security firm Crowdstrike has traced this progression\nacross different Russian groups, identifying how Russian threat actors have developed\ncustom plug-ins for commodity malware products like Black Energy and then moved to\n[developing entire families of custom malware, including Snake, Chinch, Skipper, Kazuar,](https://adversary.crowdstrike.com/en-US/adversary/venomous-bear/)\nand Gayzer.\n\nRecent custom malware has also exhibited advanced implementation of cryptographic\ntechniques as well as anti-analysis protections to help shield it from detection by anti-virus\nsoftware. Russia has leveraged existing popular platforms, including social media sites and\nthe Tor relay network, in designing and delivering its malware to victims. This suggests an\nincreasing ability and willingness to make use of the broader online ecosystem in cyber\noperations. Still, Russian cyberattacks continue to use open source and commercially\n[available tools with a recent Department of Homeland Security alert flagging the SVR’s use](https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\nof both the open-source credential dumping tool Mimikatz and the commercially available\nexploitation tool Cobalt Strike.\n\nAs Russian malware has become increasingly complex, so too have the vulnerabilities that\nRussia is able to exploit in victims’ computer systems. The 2017 NotPetya attacks famously\nrelied on the exploitation of the EternalBlue vulnerability in Windows’ Server Message Block\nprotocol that was [developed by the National Security Agency and then leaked in April 2017](https://www.nytimes.com/2019/05/25/us/nsa-hacking-tool-baltimore.html)\nby a group calling itself the Shadow Brokers. Not only did Russia not identify the\nEternalBlue vulnerability, but it also was not even the first to exploit the vulnerability—North\nKorea launched the WannaCry attacks that made use of the same vulnerability earlier in\n2017, though the later NotPetya attacks proved much more damaging. Similarly, attempts\nby Russia to compromise computer networks in 2020 through virtual private network (VPN)\n[infrastructure used some previously identified and patched vulnerabilities, rather than novel](https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2021GTR.pdf)\nzero-day vulnerabilities. This move suggests that Russia had not devoted significant\nresources to develop or purchase its own vulnerabilities, choosing instead to rely largely on\nthose already identified. This model limited the reach of Russia’s cyberattacks, in some\ncases, and perhaps partly motivated the shift to relying on supply chain and service\nprovider-based infiltration tactics that enabled broader access to a larger number of victims.\n\nExpanding the reach, as well as the covertness, of its online intrusion activities has been a\ncentral theme of Russia’s cyber operations in 2020, accomplished largely through infiltrating\nthird parties, rather than targeting victims directly. These third-party intrusions make\ncompromises more difficult for breached entities to detect—because they are introduced\nthrough trusted sources like a company’s security dashboard or email provider—and allow\nfor targeting many more victims simultaneously, through the compromise of a single\ncompany. In its [2021 Global Threat Report, Crowdstrike notes that targeted malware and](https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2021GTR.pdf)\nphishing campaigns have become less central components of Russian cyber operations.\nAccording to the report, “While various Russian adversaries continue to employ malware as\n\n\n-----\n\npart of their operational toolkits, they have also increasingly sought to shortcut traditional\noperational workflows and focus directly on intelligence collection from third-party services\nused by their targets, including direct access to cloud-based network resources such as\nemail servers.”\n\n[In May 2021, six months after the discovery of SolarWinds, Microsoft announced that it had](https://blogs.microsoft.com/on-the-issues/2021/05/27/nobelium-cyberattack-nativezone-solarwinds/)\nidentified another Russian espionage campaign that relied on accessing a United States\nAgency for International Development (USAID) account. The attack distributed phishing\nemails to 3,000 email accounts at more than 150 different government agencies, think\ntanks, consultants, and non-governmental organizations. Unlike traditional email phishing\nattacks that rely on tricking a recipient into believing they’ve received an email from\nsomeone they know or trust based on a spoofed or misleading sender address, the Russian\n[campaign that Microsoft identified made use of an intermediary service for email marketing](https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/)\ncalled Constant Contact. This tactic makes it more difficult for recipients to identify the true\nsender and easier to disguise malicious links and attachments. Just as the compromise of\nSolarWinds’ Orion software update allowed Russian adversaries to infiltrate thousands of\nvictims undetected, the Constant Contact email compromise enabled a similarly large-scale,\ncovert intrusion by relying on a widely used third-party service.\n\n## Infrastructure and Malware Reuse\n\nWhile the technical tactics and sophistication of Russian cyber operations have evolved,\nmany of these exploits continue to rely on shared infrastructure and malware families that\nenable attribution of new attacks and suggest that Russia relies on a limited circle of\nsuppliers and software developers in this domain. Executing cyber operations often requires\nconsiderable infrastructure deployed across many countries. For instance, Russia registers\ndomain names that are very close to the names of legitimate websites in order to set up\n[phishing websites. It also rents virtual private servers (VPS) to conduct password spraying](https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\nattacks, in which commonly used passwords are tested on different accounts to see if any\nof them work. Since login attempts from foreign countries are often flagged as suspicious,\nthis infrastructure generally must be in the same country as the victim, so that the login\n[attempts go undetected. The Department of Homeland Security noted that this local VPS](https://us-cert.cisa.gov/ncas/alerts/aa21-116a)\ninfrastructure was typically procured from a network of VPS resellers by Russian threat\nactors using false identities. The temporary email accounts and Voice over IP (VoIP)\nnumbers associated with those identities could often be traced back to a small number of\n“low reputation infrastructure” providers and domains, so there were clear, persistent\npatterns across these efforts even as the technical implementation of Russia’s cyber\ncapabilities expanded and evolved.\n\nRussia’s growing emphasis on covert capabilities in recent years has necessitated the\ndevelopment of more sophisticated and novel intrusion capabilities, particularly those\nfocused on compromising third-party companies that could then be used as a platform for\ninfiltrating other victims. However, Russia’s development of more technically sophisticated\n\n\n-----\n\nintrusion tactics and malware has not yet been matched by similarly advanced detection\nand exploitation of novel vulnerabilities or the establishment of more robust underlying\ninfrastructure for these compromises. This has enabled continued attribution of\ncybersecurity incidents to Russia and has provided an unusually detailed picture of where\nexactly Russia has chosen to invest its resources in developing cyber capabilities and\nwhich elements of its online tactics and techniques are most—and least—advanced.\n\nMoving forward, it will be interesting to watch whether the Russian government continues to\navoid directly targeting critical infrastructure in favor of operating covert cyberespionage\ncampaigns. If this trend does continue, then it will also be important to track whether Russia\ncontinues to allow criminal organizations based within its borders to launch destructive\nattacks on overseas critical infrastructure targets, as happened in May 2021 when the\n[DarkSide cybercrime group hit Colonial Pipeline with a ransomware attack, causing a](https://www.nytimes.com/2021/05/14/business/darkside-pipeline-hack.html)\nshutdown of thousands of miles of a pipeline, and when the REvil group hit meatpacking\ncompany JBS with a similarly disruptive ransomware attack. In some ways, these attacks\nare reminiscent of NotPetya in their impacts, except that they are financially motivated and\ntherefore comparatively more narrowly targeted and more easily reversible. If Russia’s\ngovernment agencies back off initiating destructive cyberattacks but continue to condone\nRussian cybercriminals launching similar attacks, then it’s unlikely that the tensions\nbetween the United States and Russia over the acceptable use of cyber capabilities will\nease, despite some small signals that the two countries may be willing to try to reach an\nagreement on not targeting critical infrastructure. That agreement would have to include a\nserious commitment by Russia to police cybercriminals and cooperate with international law\nenforcement investigations to stem destructive cyberattacks in any meaningful way. So far,\nat least, there are no clear signs that Russia is interested in making any such commitment.\n\n_The views expressed in this article are those of the author alone and do not necessarily_\n_reflect the position of the Foreign Policy Research Institute, a non-partisan organization that_\n_seeks to publish well-argued, policy-oriented articles on American foreign policy and_\n_national security priorities._\n\n\n-----\n\n**[Josephine Wolff](https://www.fpri.org/contributor/josephine-wolff/)**\nJosephine Wolff is Assistant Professor at The Fletcher School of Tufts University.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-06 - Understanding Russia’s Cyber Strategy.pdf"
    ],
    "report_names": [
        "2021-07-06 - Understanding Russia’s Cyber Strategy.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535879,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653787917,
    "ts_modification_date": 1653787917,
    "files": {
        "pdf": "https://archive.orkl.eu/2666ba48d5a18bb785940c8720b4ccf628f72a30.pdf",
        "text": "https://archive.orkl.eu/2666ba48d5a18bb785940c8720b4ccf628f72a30.txt",
        "img": "https://archive.orkl.eu/2666ba48d5a18bb785940c8720b4ccf628f72a30.jpg"
    }
}