{
    "id": "a67431e5-1cda-4507-8cb0-753ab3313f4d",
    "created_at": "2023-01-12T15:05:56.276223Z",
    "updated_at": "2025-03-27T02:16:34.722378Z",
    "deleted_at": null,
    "sha1_hash": "1af2cd0b666afeba9b56c9bbac1b86dd58eda2aa",
    "title": "2021-05-28 - Breaking down NOBELIUM’s latest early-stage toolset",
    "authors": "",
    "file_creation_date": "2022-05-28T16:14:53Z",
    "file_modification_date": "2022-05-28T16:14:53Z",
    "file_size": 3721128,
    "plain_text": "# Breaking down NOBELIUM’s latest early-stage toolset\n\n**[microsoft.com/security/blog/2021/05/28/breaking-down-nobeliums-latest-early-stage-toolset/](https://www.microsoft.com/security/blog/2021/05/28/breaking-down-nobeliums-latest-early-stage-toolset/)**\n\nMay 28, 2021\n\n[As we reported in earlier blog posts, the threat actor NOBELIUM recently intensified an](https://blogs.microsoft.com/on-the-issues/2021/05/27/nobelium-cyberattack-nativezone-solarwinds/)\n[email-based attack that it has been operating and evolving since early 2021. We continue to](https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/)\nmonitor this active attack and intend to post additional details as they become available. In\nthis blog, we highlight four tools representing a unique infection chain utilized by NOBELIUM:\nEnvyScout, BoomBox, NativeZone, and VaporRage. These tools have been observed being\nused in the wild as early as February 2021, attempting to gain a foothold on a variety of\nsensitive diplomatic and government entities.\n\nAs part of this blog, Microsoft Threat Intelligence Center (MSTIC) is releasing an appendix of\nindicators of compromise (IOCs) for the community to better investigate and understand\nNOBELIUM’s most recent operations.\n\nNote: The NOBELIUM indicators of compromise (IOCs) associated with this activity are\n[available in CSV on the MSTIC GitHub.](https://raw.githubusercontent.com/microsoft/mstic/master/Indicators/May21-NOBELIUM/May21NOBELIUMIoCs.csv)\n\n**_[Update [06/01/2021]: We updated the NOBELIUM IOCs to include MD5 hashes.](https://raw.githubusercontent.com/microsoft/mstic/master/Indicators/May21-NOBELIUM/May21NOBELIUMIoCs.csv)_**\n\n\n-----\n\nThis sophisticated NOBELIUM attack requires a comprehensive incident response to identify,\ninvestigate, and respond. Get the latest information and guidance from Microsoft at\n[https://aka.ms/nobelium. We have also outlined related alerts in Microsoft 365 Defender, so](https://aka.ms/nobelium)\nthat security teams can check to see if activity has been flagged for investigation.\n\nEach of the NOBELIUM tools discussed in this blog is designed for flexibility, enabling the\nactor to adapt to operational challenges over time. While its technical specifics are not\nunprecedented, NOBELIUM’s operational security priorities have likely influenced the design\nof this toolset, which demonstrate preferable features for an actor operating in potentially\nhigh-risk and high-visibility environments. These attacker security priorities are:\n\n**Use of trusted channels: BoomBox is a uniquely developed downloader used to**\nobtain a later-stage payload from an actor-controlled Dropbox account. All initial\ncommunications leverage the Dropbox API via HTTPS.\n**Opportunity for restraint: Consistent with other tools utilized by NOBELIUM,**\nBoomBox, VaporRage, and some variants of NativeZone conduct some level of\nprofiling on an affected system’s environment. MSTIC is currently unaware if these\ntools benefit from any server-side component. It is plausible that this design may allow\nNOBELIUM to selectively choose its targets and gain a level of understanding of\npotential discovery should the implant be run in environments unfamiliar to the actor.\n**Ambiguity: VaporRage is a unique shellcode loader seen as the third-stage payload.**\nVaporRage can download, decode, and execute an arbitrary payload fully in-memory.\nSuch design and deployment patterns, which also include staging of payloads on a\ncompromised website, hamper traditional artifacts and forensic investigations, allowing\nfor unique payloads to remain undiscovered.\n\nNOBELIUM is an actor that operates with rapid operational tempo, often leveraging\ntemporary infrastructure, payloads, and methods to obfuscate their activities. We suspect\nthat NOBELIUM can draw from significant operational resources that are often showcased in\ntheir periodic campaigns. Since December, the security community has identified a growing\ncollection of payloads attributed to the actor, including the GoldMax, GoldFinder, and Sibot\n[malware identified by Microsoft, as well as TEARDROP (FireEye), SUNSPOT (CrowdStrike),](https://www.fireeye.com/blog/threat-research/2021/03/sunshuttle-second-stage-backdoor-targeting-us-based-entity.html)\n[Raindrop (Symantec) and, most recently, FLIPFLOP (Volexity).](https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/solarwinds-raindrop-malware)\n\nDespite growing community visibility since the exposure of the SolarWinds attack in late\n2020, NOBELIUM has continued to target government and diplomatic entities across the\nglobe. We anticipate that as these operations progress, NOBELIUM will continue to mature\ntheir tools and tactics to target a global audience.\n\nWhile this post focuses on a single wave of the campaign comprised of the mentioned four\nmalware families, it also highlights variations in the campaign wherein methodologies were\naltered per wave. The list of indicators in the appendix expands beyond this single wave.\n\n## EnvyScout: NV.html (malicious HTML file)\n\n\n-----\n\n_NV.html, tracked by Microsoft as EnvyScout, can be best described as a malicious dropper_\ncapable of de-obfuscating and writing a malicious ISO file to disk. EnvyScout is chiefly\ndelivered to targets of NOBELIUM by way of an attachment to spear-phishing emails.\n\nThe HTML <body> section of NV.html contains four notable components:\n\n**Component #1: Tracking and credential-harvesting URLs**\n\nIn one variant of EnvyScout, the <body> section contains two URLs, as shown above.\n\nThe first, prefixed with a file:// protocol handler, is indicative of an attempt to coax the\noperating system to send sensitive NTLMv2 material to the specified actor-controlled IP\naddress over port 445. It is likely that the attacker is running a credential capturing service,\nsuch as Responder, at the other end of these transactions. Later, brute-forcing of these\ncredentials may result in their exposure.\n\nThe second URL, which resolves to the same IP address as the former at the time of\nanalysis, remotely sources an image that is part of the HTML lure. This technique,\nsometimes referred to as a “web bug”, serves as a read receipt of sorts to NOBELIUM,\nvalidating that the prospective target followed through with opening the malicious\nattachment.\n\n**Component #2: FileSaver JavaScript helper code**\n\n[The second portion of EnvyScout is a modified version of the open-source tool FileSaver,](https://github.com/eligrey/FileSaver.js)\nwhich is intended to assist in the writing of files to disk via JavaScript. The code is borrowed\ndirectly from the publicly available variants with minor alterations, including whitespace\nremoval, conversion of hex parameters to decimal, and renamed variables. By combining\nthis code with components #3 and #4 detailed below, NOBELIUM effectively implements a\n\n\n-----\n\n[methodology known as HTML smuggling. This methodology may circumvent static analysis](https://outflank.nl/blog/2018/08/14/html-smuggling-explained/)\nof known malicious file types by obscuring them within dynamically altered content upon\nexecution. When combined with dynamic analysis guardrails, this can be an effective way to\nsubvert detections of both types.\n\n**Component #3: Obfuscated ISO file**\n\nThe third section of EnvyScout contains a payload stored as an encoded blob. This payload\nis decoded by XOR’ng each character with a single-byte key, which then leads to a Base64\npayload that is then decoded and written to disk via components #2 and #4.\n\n**Component #4: De-obfuscator and dropper script**\n\nThe final component of EnvyScout is a short code snippet responsible for decoding the ISO\nin the Base64 encoded/XOR’d blob, and saving it to disk as NV.img with a mime type of\n“application/octet-stream”. At this stage of infection, the user is expected to open the\ndownloaded ISO, NV.img, by double clicking it.\n\nAs Microsoft has been tracking waves of this campaign for months, we have identified\nvarious modifications to the actor’s toolkit that were not present in every instance of\nEnvyScount but are nonetheless notable for defenders:\n\n**EnvyScout variation #1:**\n\n\n-----\n\nIn some iterations of the actor’s phishing campaigns, EnvyScout contained execution\nguardrails wherein window.location.pathname was called, and its values were leveraged to\nensure that the first two entries in the array of characters returned were “C” and “:”. If this\ncondition was not met—indicating the sample was not being executed from the C: drive—the\nembedded ISO was not written to disk.\n\nAs the attacker had gathered qualities from detonations of previous entries in the campaign\n[via the Firebase fingerprinting JavaScript detailed in a prior blog post, this was assessed to](https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/)\nbe an execution guardrail to deter analysis and dynamic execution of the samples bearing\nthese guardrails. Having witnessed both iterations of EnvyScout in the wild allows us to infer\nthe intent of some of the information gathered from earlier instances.\n\n**EnvyScout variation #2:**\n\n\n-----\n\nIn at least one instance of EnvyScout delivery, we observed further enumeration of the\nexecuting browser’s environment, wherein the user-agent was used to determine whether a\nWindows machine received an ISO payload. If the visitor arrived via iOS, they were\nredirected to external infrastructure.\n\n### NV.img (malicious ISO file)\n\nWhen a target user opens NV.img (dropped by EnvyScout) by double-clicking it, the default\nbehavior on Windows 10 is to mount the ISO image at the next available drive letter.\nWindows Explorer subsequently displays the contents of the mounted ISO in a window,\nsimilar to what users see when they open folders or compressed archives.\n\nAs shown above, the mounted ISO contains a single visible file, a shortcut file named NV.\nHowever, adjusting the file and folder settings in Windows to show hidden files and folders\nexposes a hidden folder named NV and a hidden executable named BOOM.exe:\n\nThe user is likely expected to interact with NV.lnk, but manual execution of the hidden file\n_BOOM.exe also results in the infection of the system. The individual contents of each file are_\ndetailed below.\n\nThe use of ISO as a vessel for malicious payloads is further notable due to the lack of mark\nof the web propagation on the contents, which may impact both host-based detections and\nreduce friction to user interaction with the contents.\n\n\n-----\n\n### NV.pdf (decoy document)\n\nThe hidden NV directory in the mounted ISO contains a decoy PDF file named NV.pdf which\ncontains a decoy advisory:\n\nAs described later in this analysis, the contents of the NV directory are displayed to the user\nby BOOM.exe.\n\n### NV.lnk (malicious shortcut)\n\n_NV.lnk is a shortcut/launcher for the hidden file BOOM.exe. As shown below, the shortcut_\nleverages a living-off-the-land binary (LOLBin) and technique to proxy the execution of\n_BOOM.exe using the following hardcoded shortcut target value:_\n_C:\\Windows\\System32\\rundll32.exe c:\\windows\\system32\\advpack.dll,RegisterOCX_\n_BOOM.exe._\n\n\n-----\n\nNote that Microsoft also saw a variation of this LNK file containing the following shortcut\ntarget value: C:\\Windows\\System32\\cmd.exe /c start BOOM.exe.\n\nNumerous other LNKs were identified and are referenced in the appendix linked in this post.\nMethodologies varied, as did metadata in the LNKs themselves. For instance, the sample\nwith the SHA-256:\n48b5fb3fa3ea67c2bc0086c41ec755c39d748a7100d71b81f618e82bf1c479f0 contained a\ntarget of “%windir%/system32/explorer.exe Documents.dll,Open”, while the absolute path in\nthe sample was “C:\\Windows\\system32\\rundll32.exe”.\n\nAs referenced in Volexity’s [blog post on the latest campaign, the LNK metadata was widely](https://www.volexity.com/blog/2021/05/27/suspected-apt29-operation-launches-election-fraud-themed-phishing-campaigns/)\nremoved, and what remained varied between waves. Icons were often folders, meant to trick\ntargets into thinking they were opening a shortcut to a folder.\n\nMicrosoft also observed the following targets for known LNK files:\n\n_C:\\Windows\\System32\\rundll32 exe IMGMountingService dll MountImgHelper_\n\n\n-----\n\n_C:\\Windows\\System32\\rundll32.exe diassvcs.dll InitializeComponent_\n_C:\\Windows\\System32\\rundll32.exe MsDiskMountService.dll DiskDriveIni_\n_C:\\Windows\\system32\\rundll32.exe data/mstu.dll,MicrosoftUpdateService_\n\n## BoomBox: BOOM.exe (malicious downloader)\n\n_BOOM.exe, tracked by Microsoft as “BoomBox”, can be best described as a malicious_\ndownloader. The downloader is responsible for downloading and executing the next-stage\ncomponents of the infection. These components are downloaded from Dropbox (using a\nhardcoded Dropbox Bearer/Access token).\n\nWhen executed, BoomBox ensures that a directory named NV is present in its current\nworking directory; otherwise it terminates. If the directory is present, BoomBox displays the\ncontents of the NV directory in a new Windows Explorer window (leaving it up to the user to\nopen the PDF file).\n\nNext, BoomBox ensures that the following file is not present on the system (if so, it\nterminates): %AppData%\\Microsoft\\NativeCache\\NativeCacheSvc.dll (this file is covered\nlater in this analysis). BoomBox performs enumeration of various victim host qualities, such\nas hostname, domain name, IP address, and username of the victim system to compile the\nfollowing string (using example values):\n\nNext, BoomBox AES-encrypts the host information string above using the hardcoded\nencryption key “123do3y4r378o5t34onf7t3o573tfo73” and initialization vector (IV) value\n“1233t04p7jn3n4rg”. To masquerade the data as contents of a PDF file, BoomBox prepends\nand appends the magic markers for PDF to the AES-encrypted host information string\nabove:\n\n\n-----\n\nBoomBox proceeds to upload the data above (masquerading as a PDF file) to a dedicatedper-victim-system folder in Dropbox. For demonstration purposes, an example HTTP(s)\nPOST request used to upload the file/data to Dropbox is included below.\n\nTo ensure the file has been successfully uploaded to Dropbox, BoomBox utilizes a set of\nregular expression values to check the HTTP response from Dropbox. As shown below, the\nregular expressions are used to check the presence of the is_downloadable, path_lower,\n_content_hash, and size fields (not their values) in the HTTP response received from_\nDropbox. Notably, BoomBox disregards the outcome of this check and proceeds, even if the\nupload operation is unsuccessful.\n\n\n-----\n\nNext, BoomBox downloads an encrypted file from Dropbox. For demonstration purposes, an\nexample HTTP(s) POST request used to download the encrypted file from Dropbox is shown\nbelow.\n\nAfter successfully downloading the encrypted file from Dropbox, BoomBox discards the first\n10 bytes from the header and 7 bytes from the footer of the encrypted file, and then AESdecrypts the rest of the file using the hardcoded encryption key\n“123do3y4r378o5t34onf7t3o573tfo73” and IV value “1233t04p7jn3n4rg”. BoomBox writes the\ndecrypted file to the file system at %AppData%\\Microsoft\\NativeCache\\NativeCacheSvc.dll.\nIt then establishes persistence for NativeCacheSvc.dll by creating a Run registry value\nnamed MicroNativeCacheSvc:\n\n_HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\MicroNativeCacheSvc_\n\n\n-----\n\nThe Run registry value is populated with the following command, which is used to execute\n_NativeCacheSvc.dll using rundll32.exe and by calling its export function named_\n“_configNativeCache”:\n\n_rundll32.exe %AppData%\\Microsoft\\NativeCache\\NativeCacheSvc.dll _configNativeCache_\n\nNext, BoomBox downloads a second encrypted file from the Dropbox path /tmp/readme.pdf,\ndiscards the first 10 bytes from the header and 7 bytes from the footer of the encrypted file,\nand then AES-decrypts the rest of the file (using the same AES IV and key as above). It\nwrites the decrypted file at %AppData%\\SystemCertificates\\CertPKIProvider.dll and\nproceeds to execute the previously dropped file NativeCacheSvc.dll using the same\n_rundll32.exe command as above._\n\nAs the final reconnaissance step, if the system is domain-joined, BoomBox executes an\nLDAP query to gather data such as distinguished name, SAM account name, email, and\ndisplay name of all domain users via the filter (&(objectClass=user)\n_(objectCategory=person))._\n\nThe enumerated data is AES-encrypted (using the same IV and key as before),\nencapsulated in a fake PDF file (as previously described), and uploaded to the Dropbox path\n_/new/<Victim_ID>, where <Victim_ID> is the MD5 hash of the victim’s system name, for_\nexample: /new/432B65EF29F84E6043A80C15EBA12FD2.\n\n## NativeZone: NativeCacheSvc.dll (malicious loader)\n\n\n-----\n\n_NativeCacheSvc.dll, tracked by Microsoft as NativeZone can best be described as a_\nmalicious loader responsible for utilizing rundll32.exe to load the malicious downloader\ncomponent CertPKIProvider.dll.\n\nThe malicious functionality of NativeCacheSvc.dll is located inside a DLL export named\n_configNativeCache._\n\nAs shown above, the export function executes rundll32.exe to load\n_%AppData%\\SystemCertificates\\Lib\\CertPKIProvider.dll by calling its export function named_\n_eglGetConfigs._\n\n## VaporRage: CertPKIProvider.dll (malicious downloader)\n\n_CertPKIProvider.dll, tracked by Microsoft as “VaporRage” can best be described as a_\nshellcode downloader. This version of VaporRage contains 11 export functions including\n_eglGetConfigs, which houses the malicious functionality of the DLL._\n\n\n-----\n\nAs mentioned in the previous section, NativeZone utilizes rundll32.exe to execute the\n_eglGetConfigs export function of CertPKIProvider.dll. Upon execution, the export function_\nfirst ensures the NativeZone DLL %AppData%\\Microsoft\\NativeCache\\NativeCacheSvc.dll is\npresent on the system (else it terminates). Next, the export function issues an HTTP(s) GET\nrequest to a legitimate but compromised WordPress site holescontracting[.]com. The GET\nrequest is comprised of the dynamically generated and hardcoded values, for example:\n\nThe purpose of the GET request is to first register the system as compromised and then to\ndownload an XOR-encoded shellcode blob from the WordPress site (only if the system is of\ninterest to the actor). Once successfully downloaded, the export function XOR decodes the\nshellcode blob (using a hardcoded multi-byte XOR key “346hrfyfsvvu235632542834”).\n\n\n-----\n\nIt then proceeds to execute the decoded shellcode in memory by jumping to the beginning of\nthe shellcode blob in an executable memory region. The download-decode-execute process\nis repeated indefinitely, approximately every hour, until the DLL is unloaded from memory.\nVaporRage can execute any compatible shellcode provided by its C2 server, including a\nCobalt Strike stage shellcode.\n\n**Additional Custom Cobalt Strike loader from NOBELIUM**\n\n[As described in a previous blog, NOBELIUM has used multiple custom Cobalt Strike Beacon](https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/)\nloaders (likely generated using custom Artifact Kit templates) to enable their malicious\nactivities. These include TEARDROP, Raindrop, and other custom loaders.\n\nSince our last publication, we have identified additional variants of NOBELIUM’s custom\nCobalt Strike loaders. Instead of assigning a name to each short-lived and disposable\nvariant, Microsoft will be tracking NOBELIUM’s custom Cobalt Strike loaders and\n\n\n-----\n\ndownloaders for the loaders under the name NativeZone. As seen in previous custom\nNOBELIUM Cobalt Strike loaders, the new loader DLLs also contain decoy export names\nand function, as well as code and strings borrowed from legitimate applications.\n\nThe new NativeZone loaders can be grouped into two variants:\n\nVariant #1: These loaders embed an encoded/encrypted Cobalt Strike Beacon stage\nshellcode\nVariant #2: These loaders load an encoded/encrypted Cobalt Strike Beacon stage\nshellcode from another accompanying file (e.g., an RTF file).\n\nIn the succeeding sections, we discuss some of the new NativeZone Cobalt Strike Beacon\nvariants we have observed in our investigation.\n\n**NativeZone variant #1**\n\nSimilar to the previous NOBELIUM custom Cobalt Strike loaders, such as TEARDROP and\nRaindrop, these NativeZone loaders are responsible for decoding/decrypting an embedded\nCobalt Strike Beacon stage shellcode and executing it in memory. Some of the NativeZone\nloaders feature anti-analysis guardrails to thwart analysis of the samples.\n\nIn these versions of NativeZone, the actor has used a variety of encoding and encryption\nmethodologies to obfuscate the embedded shellcode. For example, in the example below,\nthe NativeZone variant uses a simple byte-swap decoding algorithm to decode the\nembedded shellcode:\n\n\n-----\n\nAnother sample featuring a different decoding methodology to decode the embedded\nshellcode is shown below:\n\nAnother sample, featuring a de-obfuscation methodology leveraging AES encryption\nalgorithm to decrypt the embedded shellcode, is shown below:\n\nYet another NativeZone sample leveraging AES for decrypting an embedded Cobalt Strike\nshellcode blob is shown below (note the syntax differences compared to the sample above):\n\n\n-----\n\nAnother sample featuring a different decoding methodology along with leveraging\n_CreateThreadpoolWait() to execute the decoded shellcode blob is below:_\n\nBelow is an example of anti-analysis technique showing the loader checking if the victim\nsystem is a Vmware or VirtualBox VM:\n\n\n-----\n\n**NativeZone variant #2**\n\nUnlike variant #1, the NativeZone variant #2 samples do not contain the encoded/encrypted\nCobalt Strike Beacon stage shellcode. Instead, these samples read the shellcode from an\naccompanying file that is shipped with the sample. For example, one NativeZone variant #2\nsample was observed alongside an RTF file. The RTF file doubles as both a decoy\ndocument and a shellcode carrier file. The RTF file contains the proper RTF file structure and\ndata followed by an encoded shellcode blob (starting at offset 0x658):\n\n\n-----\n\nWhen the NativeZone DLL is loaded/executed, it first displays the RTF document to the user.\n\nAs mentioned above, the same RTF also contains the encoded Cobalt Strike stage\nshellcode. As shown below, the NativeZone DLL proceeds to extract the shellcode from the\nRTF file (starting at file offset 0x658 as shown above), decode the shellcode and execute it\non the victim system:\n\n**Notes on new and old NOBELIUM PDB paths**\n\nThe following example PDB paths were observed in the samples analyzed in this blog:\n\nBoomBox:\n_C:\\Users\\dev10vs\\Desktop\\Prog\\Obj\\BOOM\\BOOM\\BOOM\\obj\\Release\\BOOM.pdb_\nNativeZone: c:\\users\\devuser\\documents\\visual studio\n_2013\\Projects\\DLL_stageless\\Release\\DLL_stageless.pdb_\nNativeZone: C:\\Users\\DevUser\\Documents\\Visual Studio\n_2013\\Projects\\DLL_stageless\\Release\\DLL_stageless.pdb_\nNativeZone: C:\\Users\\dev\\Desktop\\나타나게하다\\Dll6\\x64\\Release\\Dll6.pdb\n\nNote the presence of ‘dev’ user in the PDB paths above. A ‘dev’ username was previously\nobserved in the PDB path of a NOBELIUM Cobalt Strike loader mentioned in our previous\nblog: c:\\build\\workspace\\cobalt_cryptor_far\n_(dev071)\\farmanager\\far\\platform.concurrency.hpp._\n\n\n-----\n\n## Comprehensive protections for persistence techniques\n\nThe sophisticated NOBELIUM attack requires a comprehensive incident response to identify,\ninvestigate, and respond. Get the latest information and guidance from Microsoft at\n[https://aka.ms/nobelium.](https://aka.ms/nobelium)\n\n**Microsoft Defender Antivirus**\n\nMicrosoft Defender Antivirus detects the new NOBELIUM components discussed in this blog\nas the following malware:\n\nTrojanDropper:JS/EnvyScout.A!dha\nTrojanDownloader:Win32/BoomBox.A!dha\nTrojan:Win32/NativeZone.A!dha\nTrojan:Win32/NativeZone.B!dha\nTrojan:Win32/NativeZone.C!dha\nTrojan:Win32/NativeZone.D!dha\nTrojanDownloader:Win32/VaporRage.A!dha\n\n**Microsoft Defender for Endpoint (EDR)**\n\nAlerts with the following titles in the Security Center can indicate threat activity on your\nnetwork:\n\nMalicious ISO File used by NOBELIUM\nCobalt Strike Beacon used by NOBELIUM\nCobalt Strike network infrastructure used by NOBELIUM\nEnvyScout malware\nBoomBox malware\nNativeZone malware\nVaporRage malware\n\nThe following alerts might also indicate threat activity associated with this threat, but they can\nalso be triggered by unrelated threat activity:\n\nAn uncommon file was created and added to startup folder\nA link file (LNK) with unusual characteristics was opened\n\n**Azure Sentinel**\n\nWe have updated the related Azure Sentinel query to include these additional indicators.\n[Azure Sentinel customers can access this query in this GitHub repository.](https://github.com/Azure/Azure-Sentinel/blob/master/Detections/MultipleDataSources/NOBELIUM_IOCsMay2021.yaml)\n\n## Indicators of compromise (IOCs)\n\n\n-----\n\nThe NOBELIUM IOCs associated with this activity are available in CSV on the MSTIC\nGitHub.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-28 - Breaking down NOBELIUM’s latest early-stage toolset.pdf"
    ],
    "report_names": [
        "2021-05-28 - Breaking down NOBELIUM’s latest early-stage toolset.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535956,
    "ts_updated_at": 1743041794,
    "ts_creation_date": 1653754493,
    "ts_modification_date": 1653754493,
    "files": {
        "pdf": "https://archive.orkl.eu/1af2cd0b666afeba9b56c9bbac1b86dd58eda2aa.pdf",
        "text": "https://archive.orkl.eu/1af2cd0b666afeba9b56c9bbac1b86dd58eda2aa.txt",
        "img": "https://archive.orkl.eu/1af2cd0b666afeba9b56c9bbac1b86dd58eda2aa.jpg"
    }
}