{
    "id": "a6a90b15-327b-4399-87be-e918409c1cad",
    "created_at": "2023-01-12T15:01:39.124126Z",
    "updated_at": "2025-03-27T02:05:24.336292Z",
    "deleted_at": null,
    "sha1_hash": "b16d4a5f1898bc9473f412fe2ec7552f3f5673f6",
    "title": "2020-10-23 - Exclusive- National Guard called in to thwart cyberattack in Louisiana weeks before election",
    "authors": "",
    "file_creation_date": "2022-05-27T21:35:41Z",
    "file_modification_date": "2022-05-27T21:35:41Z",
    "file_size": 169020,
    "plain_text": "# Exclusive: National Guard called in to thwart cyberattack in Louisiana weeks before election\n\n**reuters.com/article/us-usa-election-cyber-louisiana-exclusiv/exclusive-national-guard-called-in-to-thwart-cyberattack-in-**\nlouisiana-weeks-before-election-idUSKBN27823F\n\nChristopher Bing\n\n[Technology News](https://www.reuters.com/news/archive/technologyNews)\nUpdated\n\nBy [Christopher Bing](https://www.reuters.com/journalists/christopher-bing)\n\n6 Min Read\n\n(Reuters) - The Louisiana National Guard was called in to stop a series of cyberattacks\naimed at small government offices across the state in recent weeks, according to two people\nwith knowledge of the events, highlighting the cyber threat facing local governments in the\nrun up to the 2020 U.S. presidential election.\n\nFILE PHOTO: Silhouettes of laptop users are seen next to a screen projection of binary code\nare seen in this picture illustration taken March 28, 2018. REUTERS/Dado\nRuvic/Illustration/File Photo\n\n\n-----\n\nThe situation in Louisiana follows a similar case in Washington state, according to a\ncybersecurity consultant familiar with the matter, where hackers infected some government\noffices with a type of malware known for deploying ransomware, which locks up systems and\ndemands payment to regain access.\n\n[Senior U.S. security officials have warned here since at least 2019 that ransomware poses a](https://www.reuters.com/article/us-usa-cyber-election-exclusive/exclusive-u-s-officials-fear-ransomware-attack-against-2020-election-idUSKCN1VG222)\nrisk to the U.S. election, namely that an attack against certain state government offices\naround the election could disrupt systems needed to administer aspects of the vote.\n\nIt is unclear if the hackers sought to target systems tied to the election in Louisiana or were\nsimply hoping for a payday. Yet the attacks raised alarms because of the potential harm it\ncould have led to and due to evidence suggesting a sophisticated hacking group was\ninvolved.\n\nExperts investigating the Louisiana incidents found a tool used by the hackers that was\npreviously linked to a group associated with the North Korean government, according to a\nperson familiar with the investigation.\n\nThat tool was described to Reuters as a remote access trojan, or RAT, used to infiltrate\ncomputer networks. But cybersecurity analysts who have examined this RAT - known as\n“KimJongRat” - say some of its code had been publicized in a computer virus repository,\nwhere hackers could copy it; making attribution to North Korea less certain.\n\nWhile staff at several government offices in northern Louisiana were successfully\ncompromised as part of the campaign, according to the two people familiar with the incident\nresponse, the cyberattack was stopped in its early stages before significant harm was done.\n\nThe Louisiana National Guard declined to comment on the incidents. A spokesman for the\nLouisiana State Police said they were called in to investigate the cyberattacks, but declined\nfurther comment. The Governor’s office said they could not comment on an ongoing\ninvestigation.\n\nTyler Brey, a spokesman for the Louisiana Secretary of State’s office, said Louisiana is a “top\ndown state,” where election data is centrally stored at the secretary of state’s office, which\ncan make it easier for election officials to recover from cyberattacks.\n\nOne person familiar with the events said they assessed the hacker’s objective was to infect\ncomputers with ransomware, but added that it was difficult to determine because the attack\nwas stopped in its early phases.\n\nIf so, Louisiana wouldn’t be the first. Over the last year, several U.S. cities have been\nvictimized by ransomware, including: incidents in Baltimore, Maryland, and Durham, North\nCarolina.\n\n## THE BIG QUESTION\n\n\n-----\n\nJen Miller Osborn, deputy director of threat intelligence for U.S. cybersecurity company Palo\nAlto Networks, tracked a hacking group last year that used KimJongRat. She said it would be\n“atypical” for the group she’s studied to conduct a cyber operation for financial gain.\n\nA prior cybersecurity research report in 2013 by Luxembourg firm iTrust Consulting noted\nthat KimJongRat was written with Korean computer code which carried references to the\nNorth Korean leader’s family members.\n\nEmotet, an increasingly common trojan often used against banks, was also deployed by the\nattackers and found on computers in Louisiana. When staff were hacked, their email\naccounts would sometimes be co-opted by the hackers to send malware to other colleagues.\n\nOn October 6, the Homeland Security Department’s cybersecurity division, known as CISA,\npublished an alert saying Emotet was being used to target numerous local government\noffices across the country.\n\nIn recent cases where cybercriminals have gone after local government offices as the\nelection approaches, like in Washington, U.S. officials along with technology companies such\nas Microsoft Corp are racing to better understand if the hackers share connections with\nforeign intelligence agencies from Russia, Iran, China and North Korea.\n\n“It’s a very interesting question and something we are digging into and trying to find data,\ninformation, and intelligence that would help us understand that better,” Microsoft Vice\nPresident Tom Burt said in a recent interview.\n\n“There are a small number of criminal groups who are responsible for the majority of the\nransomware attacks and so understanding who they are, how they’re organized, who they\nwork with, where they are operating from, is something we’re working on,” Burt added.\n\nMicrosoft is among a select group of cybersecurity companies helping respond to the attacks\nin Washington, where they’ve offered cybersecurity protection software for free to local\ngovernment officials until the election, according to a person familiar with their response.\n\nA Microsoft spokesperson declined to comment on the company’s work there.\n\nReporting by Christopher Bing; editing by Chris Sanders and Edward Tobin\n\nOur Standards: [The Thomson Reuters Trust Principles.](http://thomsonreuters.com/en/about-us/trust-principles.html)\n\nfor-phone-onlyfor-tablet-portrait-upfor-tablet-landscape-upfor-desktop-upfor-wide-desktop-up\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-10-23 - Exclusive- National Guard called in to thwart cyberattack in Louisiana weeks before election.pdf"
    ],
    "report_names": [
        "2020-10-23 - Exclusive- National Guard called in to thwart cyberattack in Louisiana weeks before election.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535699,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653687341,
    "ts_modification_date": 1653687341,
    "files": {
        "pdf": "https://archive.orkl.eu/b16d4a5f1898bc9473f412fe2ec7552f3f5673f6.pdf",
        "text": "https://archive.orkl.eu/b16d4a5f1898bc9473f412fe2ec7552f3f5673f6.txt",
        "img": "https://archive.orkl.eu/b16d4a5f1898bc9473f412fe2ec7552f3f5673f6.jpg"
    }
}