{
    "id": "a6c1bf30-25fb-4696-9072-4fdeeea4b6ce",
    "created_at": "2022-10-25T16:48:22.042049Z",
    "updated_at": "2025-03-27T02:06:12.972558Z",
    "deleted_at": null,
    "sha1_hash": "6c8e211cb8b0749a93ae5b1ee8387e37c7621793",
    "title": "Microsoft Word - Getting In Bed With Robin Sage v1.0",
    "authors": "",
    "file_creation_date": "2010-07-14T12:22:55Z",
    "file_modification_date": "2010-07-14T12:22:55Z",
    "file_size": 176193,
    "plain_text": "# “Getting In Bed with Robin Sage.”\n\n\n## By Thomas Ryan\n_Co-Founder & Managing Partner_\n_Provide Security, LLC._\n\n\n-----\n\n### Contents\n\n**Abstract ................................................................... 2**\n\n**Creating the Persona ............................................. 3**\n\n**Analysis Details ...................................................... 4**\n\n**Looking Ahead ....................................................... 6**\n\n**References .............................................................. 7**\n\n**Project Contributors .............................................. 7**\n\n\n### Abstract\n\nGiven the vast number of security breaches via the\ninternet, The Robin Sage Experiment seeks to exploit\nthe fundamental levels of information leakage—the\noutflow of information as a result of people’s hap‐\nhazard and unquestioned trust. The experiment was\nconducted by creating a blatantly false identity and\nenrolling on various social networking websites. By\njoining networks, registering on mailing lists, and listing\nfalse credentials, the conditions were then set to\nresearch people’s decisions to trust and share\ninformation with the false identity. The main factors\nobserved were: the ability to exploit other individuals’\nlevel of trust based on gender, occupation,\neducation/credentials, and friends (connections).\n\nBy the end of this experiment, Robin finished the\nmonth having accumulated hundreds of connections\nthrough various social networking sites. Contacts\nincluded executives at government entities such as the\nNSA, DOD and Military Intelligence groups. Other\nfriends came from Global 500 corporations.\nThroughout the experiment Robin was offered gifts,\ngovernment and corporate jobs, and options to speak\nat a variety of security conferences.\n\nThrough this 28‐day experiment, it became evident\nthat the propagation of a false identity via social\nnetworking websites can be rampant and viral. Much\nof the information revealed to Robin Sage violated\nOPSEC and PERSEC procedures. The deliberate choice\nof an attractive young female appears to have exposed\nthe role that sex and appearance plays in trust and\npeople’s eagerness to connect with someone. In\nconjunction with her look, Robin Sage’s credentials\nlisted on her profile resulted in selection perception;\npeople’s tendency to draw unwarranted conclusions in\ntheir attempt to make a quick decision. By acquiring a\nlarge number of connections, Robin had the ability to\nidentify the individual who was positioned to provide\nthe most intelligence based on their involvement in\nmultiple government agencies. The false identity\ncombined with carefully chosen false credentials led to\na false trust that could have resulted in the breach of\nmultiple security protocols.\n\n\nProvide Security | Getting In Bed With Robin Sage B l a c k H a t U S A | 2\n\n\n-----\n\n### g\n\n_The success of the Robin Sage Experiment relied_\n_heavily on the calculated creation of Robin’s_\n_gender, occupation, education, credentials, and_\n_friends (connections). Determining the false_\n_identity’s characteristics directly led to the wide_\n_variety of reasons people chose to connect._\n_Moreover, as Robin’s network grew, so did the_\n_potential gain for her new connections?_\n\n#### Gender\nChoosing a young, attractive, and edgy female\nwas a deliberate decision on the part of the\ncreator. Today, the vast majority of the\nsecurity industry is comprised of males. The\nheavily male dominated sector allows women\nto be a commodity in more ways than one. For\nexample, just as women have proven to offer\nfresh new perspectives in the fields of\nmarketing, journalism, and business, they are\nalso able to assess security matters with a\ndifferent outlook.\n\nSome of Robin’s male connections took a more\nassertive approach by offering her tickets to\nsecurity conferences, complimenting her\npictures, and presenting available job\nopportunities. Whether these same reactions\nwould have been elicited towards another male\nis questionable. It can be put forth that Robin’s\nappearance and gender played a key role in\nmany people’s comfort level. Furthermore,\nflirtatious gestures’ regarding her picture\nreveals that her attractiveness led to the\nsuccess of her propagation. One connection\ncommented, “Greeeat pics,” while another\ncharmed her with, “You have to forgive me but\nI never forget a face (esp. one as pretty as\nyours).\" These overt compliments develop the\ninitial sense of trust that Robin established with\nher newly formed “friends.”\n\n\n#### Occupation\nRobin Sage’s present job was listed as “Cyber Threat\nAnalyst” at Naval Network Warfare Command. This\nposition suggested that she not only had seasoned\nexpertise, but she also had passed the trusted\nbackground checks of the government. Many security\nprofessionals made these quick, yet inaccurate\nassumptions when considering Sage’s occupation. This\ngreen light in terms of trust led her “friends” to offer\nfurther advancements in her career.\n\nWith no experience at all, Robin was asked to review\npapers written by professionals with over 10 years\nexperience. For example, a fellow lecturer at the NASA\nAmes Research Center sought out Sage’s knowledge\nand opinions pertaining to some of his papers and\npresentations. One professional introduces himself on\nLinkedIn with, “I am a Senior Business\nDevelopment/Marketing/Sales Executive Consultant\nwith 20 years+ in the Federal Government Homeland\nSecurity/Civilian/DoD Security Marketplace.” While his\nintroduction may suggest he is well acquainted with\nthe security world, his fall for Robin Sage proved\notherwise. Though he claims to have “expertise in the\nCyber‐Security [field],” he not only trusted Robin\nenough to connect with her, but he also privately\nmessaged her with the hopes of a phone conversation\nto discuss her cyber intelligence background. Open\nrequests such as these have the serious potential of\nopening a means of communication for private and/or\ninformation to be exchanged.\n\n#### Education & Credentials\n**The power of one’s network is only as strong as the**\n**people within it. Robin’s first class education**\ncombined with her certifications proved her worthy of\nany security professional’s web of connections.\nBecause her experience demonstrated an expansive\nknowledge of the security field, the benefits of\nconnecting with Robin included possible job\nopportunities, knowledge growth, and helpful\ncontacts.\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  3\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----\n\nprofessionals approached Robin regarding job\nopportunities. Again, it can be surmised that\nthese invitations were a result of her false\neducation and credentials. The methodical\ncreation of the identity’s background played a\npivotal role in the confidence people had in her\nactual existence.\n\nFellow alumni from her high school network, St.\nPaul’s School, and her college network,\nMassachusetts Institute of Technology (MIT),\nchose to link to her on the basis of common\neducational ties. With no actual verification of\nher attendance, people entered into another\nlevel of trust based on no facts whatsoever.\n\n#### “Friends”, “Connections”, and “Followers”\nRobin Sage’s friends served as her largest basis\nof garnering trust from her targeted\nprofessionals. After acquiring just a few\nrespected friends, Robin had what she needed\nto propagate the security field. The creator\ncarefully chose security experts such as\nJeremiah Grossman (Co‐Founder and CTO of\nWhiteHat Security), Dan Kaminsky (Director of\nPenetration Testing at IOActive), and Marc\nMaffrett (Chief Security Architect at FireEye).\nBy successfully fooling some of the most\nrespected specialists in the security sector,\nRobin’s credibility rapidly soared.\n\nThe success of a network is directly tied to the\npeople and connections that one forms.\nEffectively targeting a person can be done in\nvarious indirect ways. For example, one\nconnection messaged Robin, “I've never met\nyou, but I saw you had Marty on your Facebook\nlist, so that was good enough for me.” This\nmessage encompasses the dangers of social\nnetworking when people fail to do their own\nresearch and instead, rely on other’s judgment.\n\n\n### y\n\n_A closer look at the creation of Robin’s profile reveals_\n_that there were many opportunities for people to_\n_realize that this was a false identity. This section will_\n_first explore the oversights on behalf of the people that_\n_chose to connect to Robin Sage. It will then delve into_\n_the implications that develop when the initial trust is_\n_granted to a cyber predator._\n\n#### Gender Implications\nDrawing conclusions based on Robin Sage’s\nappearance and gender is the initial mistake on the\npart of the target. Using advanced facial recognition\nsoftware, the victim could have traced the profile\npicture to its origin‐a pornographic website, and\ndetermined that the identity undoubtedly did not\nmatch. While getting your hands on software like this\nis not always so simple, there are other ways the target\ncould have examined these pictures to conclude that\nthe profile was counterfeit.\n\nRobin Sage, on first glance, fit the profile of a young\nprofessional; fashionable in style, and flirtatious in\npersonality. However, red flags should have been\nraised in assessing her number of pictures. Why would\nsomeone who appeared so social, have such few\npictures? And, why would someone who touted their\nprofessional background on each social networking\nforum, use such unprofessional photographs?\n\nIt can certainly be argued that social networking\nwebsites stand as platforms for more relaxed\nprofessional networking. Robin’s identity, had it been\nreal, may have just posted her casual pictures because\nthis type of connecting resembles nothing of a cocktail\nparty. However, the profile viewer should have asked\nthese questions and perhaps after assessing her other\ncharacteristics, he or she would have rendered a more\naccurate answer towards the question of her actual\nexistence.\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  4\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----\n\nCareful attention to Robin’s work experience\nand a few searches in Google, would have\nrevealed that her occupational title does not\neven exist. This should have immediately\nraised skepticism on the part of the profile\nviewer. Moreover, her LinkedIn introduction\nspeaks to her ten years of cyber security\nexperience. However, this time frame would\nhave put the young professional into the\nsecurity field at the age of fifteen. Though\nthere are anomalies of young teenagers\nmastering computer hacking skills at\nexceptionally young ages, the likelihood of\nthese cases are small and incredibly rare.\n\nAs people sought Robin’s professional advice,\nthey placed themselves in an extremely\nvulnerable position. If the creator behind Robin\nhad intentions other than to perform a social\nexperiment, he would have had means to\nmislead experts in their studies and even steal\ntheir research. As noted in the previous\nsection, the fellow lecturer at the NASA Ames\nResearch Center offered to share his paper with\nSage. Had his paper not yet been published,\nRobin would have gathered information and\nstatistical data that she could have turned\naround and claimed to be her own.\nFurthermore, if Robin wanted to misguide the\nexpert, she could have pointed the lecturer in\nan entirely different direction, and because he\nhad already made the decision to trust her, he\nmay have fallen prey to her tactics.\n\nProfessionals can also waste a considerable\namount of their time pursuing false identities\nsuch as Robin’s in order to fill positions. For\nexample, Sage received messages from one job\nrecruiter with the hopes of placing her in a\nSenior Research Analyst Position in Atlanta,\nGeorgia. Not only did the recruiter spend time\nexplaining the position, but she also requested\nRobin’s resume for review. Opening up this\n\n\ntype of communication would allow someone to learn\nmore about the company’s goals, security, and\nsalaries. Had Robin submitted a false resume and been\noffered a phone screening interview, the person\nbehind the false identity would have had the\nopportunity to inquire more about the company.\nThough simple questions about a company may not\ninitially appear threatening, the emergence of social\nengineering suggests otherwise. Pointed and carefully\nworded questions can often reveal far more\ninformation than what may appear on the surface.\nThe only solution to avoiding these types of situations\nis to not befriend a false identity in the first place.\n\n#### Education/Credentials Implications\nRobin’s education and credentials complimented her\nfalse occupation and helped grow her number of\nconnections. Often times, peripheral information like\nthis plays a critical role in developing trust. While a\npicture or an occupation may initially appear\nunconvincing, an identity’s education and training\nbackground may all one need’s to be swayed.\n\nIt is important to note that some security experts\nproperly vetted Robin Sage’s background. Perhaps by\npracticing these techniques, other professionals may\navoid making the same mistake in the future. One\nsecurity specialist, who goes by the name Simple\nNomad, reached out to a friend who was an MIT\nalumnus. By asking a trusted friend to review his MIT\nalumni network, Simple Nomad was able to conclude\nthat Robin Sage was neither an MIT alumnus, nor an\nactual person.  University networks are significantly\nmore reliable than networks such as LinkedIn,\nFacebook, and Twitter. Their alumni offices keep\nofficial records of current and previous students. By\nconsulting a trusted friend and fact checking with a\nreliable network, Robin Sage’s identity was proven\nfalse.\n\nJohn Tierney, a security professional based out of New\nYork, called Robin Sage’s bluff by researching her NSA\nIAM (INFOSEC Assessment Methodology) credentials.\nBy reviewing public information, Tierney managed to\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  5\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----\n\ninformation includes a rating program and\nprovides a list of every individual that passed\nthe NSA IAM courses. The absence of Robin\nSage’s name or any name similar to Sage’s\nconfirmed that she did not exist. More often\nthan not, public information that is readily\navailable is all that is needed to prove a false\nidentity.\n\nThe risk in trusting qualifications to voluntarily\nseems obvious. Sage’s multiple security\ncredentials combined with her occupation\nwould lead one to believe that she had TS/SCI\n(Top Secret/Sensitive Compartment\nInformation) Clearance with Polygraph.\nPeople’s trust in this identity could have very\neasily led to the sharing of information under\nthe false premise that Robin Sage had expertise\nin the field.\n\n#### Friends, “Connections,” and Followers  Implications\nMany social networking websites have a\nsection to show users who their mutual friends\nare with another person. LinkedIn uses\nnumbers to show the degrees of separation\nbetween connections. These strategies\nencourage people to grow their network by\nestablishing trust based on mutual friends. For\nexample, though someone may not have\nknown Robin Sage, their decision to link to\nthem may have been based on the fact that five\nof their other respectable friends chose to do\nthe same. As discussed in a previous example,\none professional (Senior Attack Pattern Analyst\nfor CAPEC at MITRE) accepted Robin’s\nfriendship request because his peer had done\nso.\n\nCyber predators are aware of this “mutual\nfriends” oversight that social networking users\nfrequently make. To exploit the weakness,\nlurkers pinpoint the person they are pursuing\nand indirectly track them. By connecting with a\n\n\na line of trust with his target without the victim even\nknowing. Therefore, when it comes time to connect\nwith the targeted individual, mutual friends stand as a\ncomfort factor for the target. Because his or her\nfriends trusted this false identity, it is more likely that\nthe request to connect will be accepted.\n\nTo avoid being fooled by a fictitious individual on\naccount of the “mutual friend” tactic, it is important to\ntake a closer at the identity’s profile. In the case of\nRobin Sage, users should have noticed that all of her\nfriends/connections were formed in a very small time\nspan. In the duration of one week, the identity formed\na Twitter, LinkedIn, and Facebook and was rapidly\nmaking connections with people. Furthermore, mutual\nfriends often sprout from a single common tie that two\nusers have. However, if the mutual friends seem\ndisconnected and unrelated, it is imperative that the\nuser investigates further. The best‐suited defense is to\nreach out to the mutual friends and ask about their\nrelationship with the questioned identity. A simple\ninquiry regarding the profile may confirm or deny the\nindividual’s authenticity.\n\n### Looking Ahead\n\nBefore moving into the future, it is essential that\nappropriate lessons be derived from mistakes in the\npast. The Robin Sage experiment was created with the\nintentions of bringing awareness to the risks that social\nnetworking can pose when proper vetting is not\nperformed.\n\nIn the past, Facebook required users to provide emails\nthat verified their attendance to universities and\ninstitutions. However, since Facebook opened its\ngates to the greater public on September 26, 2006, it\ndrastically increased the ways in which predators can\ncreate false identities. In the future, it is imperative\nthat social networking sites explore sounder and more\neffective ways to prohibit the creation of fictitious\nprofiles. As these websites continue to grow, they\nmust take responsibility for the safety of their millions\nof users. While Facebook, LinkedIn, and Twitter may\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  6\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----\n\nperson who can entirely insure their own safety\nis you.\n\nThis paper has adequately outlined various\nways to properly examine profiles prior to\naccepting connection requests. Careful reviews\nof small details such as pictures, work\nexperience, and credentials may provide just\nenough insight to refrain from linking to\nharmful individuals. Take the extra time to\nconsult mutual friends or quickly perform your\nown research through the use of any common\nsearch engine. More often than not, false\nidentities, just like Robin Sage, intentionally and\nunintentionally, leave simple clues for you\nalong the way.\n\n### References\n\n_Perez, Richard, and Timm, Carl . Seven_\n_Deadliest Social Network Attacks. Syngress,_\n_May 2010._\n\n_Brenner, Bill. \"Seven Deadly Sins of Social_\n_Networking Security\". CSO Online. June 30,_\n_2009_\n_(http://www.csoonline.com/article/496314/seven_\n_-deadly-sins-of-social-networking-security)._\n\n_Schneier, Bruce. \"CIA Invests in Social-Network_\n_Datamining\". Schneier on Security. October 26,_\n_2009_\n_(http://www.schneier.com/blog/archives/2009/1_\n_0/cia_invests_in.html)._\n\n_Nathan Hamiel, Shawn Moyer. \"Fail 2.0:_\n_Further_ _Musings_ _on_ _Attacking_ _Social_\n_Networks\"._ _Shmoocon._ _February,_ _2009_\n_(http://www.shmoocon.org/2009/presentations-_\n_all.html)._\n\n\n_interpretations_ _of_ _self-presentation_ _through_\n_Facebook_ _profile_ _images\"._ _Cyberpsychology:_\n_Journal of Psychosocial Research on Cyberspace._\n_http://www.cyberpsychology.eu/view.php?cisloclan_\n_ku=2008110402&article=(search%20in%20Issues)_\n_. February 20, 2009._\n\n_Lenhart, Amanda . \"Adults and Social Network_\n_Websites by Amanda Lenhart\". PEW Internet and_\n_American_ _Life_ _Project,_ _January_ _14,_ _2009_\n_(http://www.pewinternet.org/Reports/2009/Adults-_\n_and-Social-Network-Websites.aspx)_\n\n### Project Contributors\n\n_Authors: Thomas Ryan & Gabriella Mauch_\n\n_Contributors: Guy Fawkes, Pete Herzog, Omachonu_\n_Ogali, Jon Miller, Simple Nomad, Timothy \"Thor\"_\n_Mullen, John Tierney, Jacqueline Singh, Chris_\n_Nickerson, Tom Brennan, Dr. Kevin Schatzle_\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  7\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----\n\nPROVIDE SECURITY® CONSULTANTS ARE HANDPICKED\nBASED UPON THEIR EXTENSIVE TRAINING AND VAST\nHANDS‐ON EXPERIENCE IN CYBER SECURITY, PHYSICAL\nSECURITY, EXECUTIVE PROTECTION AND INVESTIGATIONS.\nOUR PROFESSIONALS ARE UNIQUELY SKILLED AND WELL\nVERSED IN THE LATEST CONCEPTS OF CONVERGENCE IN\nTHE SECURITY FIELD.\n\n\n#### www.providesecurity.com\n\n\n#### www.blackhat.com\n\n\nProvide Security  |  Getting In Bed With Robin Sage B l a c k H a t U S A |  8\n\n\n©2010 P id S i LLC | P id S i i i d d k f P id S i LLC All h d d\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "http://media.blackhat.com/bh-us-10/whitepapers/Ryan/BlackHat-USA-2010-Ryan-Getting-In-Bed-With-Robin-Sage-v1.0.pdf"
    ],
    "report_names": [
        "BlackHat-USA-2010-Ryan-Getting-In-Bed-With-Robin-Sage-v1.0.pdf"
    ],
    "threat_actors": [
        {
            "id": "c91e335e-42be-48d9-96b5-ba56749a723b",
            "created_at": "2022-10-25T16:07:23.458346Z",
            "updated_at": "2025-03-27T02:02:09.813395Z",
            "deleted_at": null,
            "main_name": "CIA",
            "aliases": [
                "Central Intelligence Agency"
            ],
            "source_name": "ETDA:CIA",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041172,
    "ts_creation_date": 1279110175,
    "ts_modification_date": 1279110175,
    "files": {
        "pdf": "https://archive.orkl.eu/6c8e211cb8b0749a93ae5b1ee8387e37c7621793.pdf",
        "text": "https://archive.orkl.eu/6c8e211cb8b0749a93ae5b1ee8387e37c7621793.txt",
        "img": "https://archive.orkl.eu/6c8e211cb8b0749a93ae5b1ee8387e37c7621793.jpg"
    }
}