{
    "id": "a6ced880-edc7-43a5-b767-e4bd347b1593",
    "created_at": "2023-01-12T15:10:02.926491Z",
    "updated_at": "2025-03-27T02:05:19.356572Z",
    "deleted_at": null,
    "sha1_hash": "878a5fbef29160a0cf501bccec9605027f1218ab",
    "title": "2021-07-20 - Alert (AA21-201A)- Chinese Gas Pipeline Intrusion Campaign, 2011 to 2013",
    "authors": "",
    "file_creation_date": "2022-05-29T01:07:11Z",
    "file_modification_date": "2022-05-29T01:07:11Z",
    "file_size": 132793,
    "plain_text": "# Chinese Gas Pipeline Intrusion Campaign, 2011 to 2013\n\n**us-cert.cisa.gov/ncas/alerts/aa21-201a**\n\n## Summary\n\n_This Advisory uses the MITRE Adversarial Tactics, Techniques, and Common Knowledge (ATT&CK®) framework, Version 9. See the_\n_[ATT&CK for Enterprise for all referenced threat actor tactics and techniques.](https://attack.mitre.org/versions/v9/techniques/enterprise/)_\n\n**_Note: CISA released technical information, including indicators of compromise (IOCs), provided in this advisory in 2012 to affected_**\n**_organizations and stakeholders._**\n\nThis Joint Cybersecurity Advisory—coauthored by the Cybersecurity and Infrastructure Security Agency (CISA) and the Federal Bureau of\nInvestigation (FBI)—provides information on a spearphishing and intrusion campaign conducted by state-sponsored Chinese actors that\noccurred from December 2011 to 2013, targeting U.S. oil and natural gas (ONG) pipeline companies.\n\nCISA and the FBI provided incident response and remediation support to a number of victims of this activity. Overall, the U.S. Government\nidentified and tracked 23 U.S. natural gas pipeline operators targeted from 2011 to 2013 in this spearphishing and intrusion campaign. Of the\nknown targeted entities, 13 were confirmed compromises, 3 were near misses, and 7 had an unknown depth of intrusion.\n\nThe U.S. Government has attributed this activity to Chinese state-sponsored actors. CISA and the FBI assess that these actors were\nspecifically targeting U.S. pipeline infrastructure for the purpose of holding U.S. pipeline infrastructure at risk. Additionally, CISA and the FBI\nassess that this activity was ultimately intended to help China develop cyberattack capabilities against U.S. pipelines to physically damage\npipelines or disrupt pipeline operations.\n\nThis advisory provides information on this campaign, including tactics, techniques, and procedures (TTPs) and IOCs. The TTPs remain\nrelevant to help network defenders protect against intrusions. The IOCs are provided for historical awareness.\n\nCISA and the FBI urge owners and operators of Energy Sector and other critical infrastructure (CI) networks to adopt a heightened state of\nawareness and implement the recommendations listed in the Mitigations section of this advisory, which include implementing network\nsegmentation between IT and industrial control system (ICS)/operational technology (OT) networks. These mitigations will improve a CI\nentity’s defensive cyber posture and functional resilience by reducing the risk of compromise or severe operational degradation if the system\nis compromised by malicious cyber actors, including but not limited to actors associated with the campaign described in this advisory.\n\nFor more information on Chinese malicious cyber activity, see [us-cert.cisa.gov/china.](https://us-cert.cisa.gov/china)\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/publications/AA21-201A_Chinese_Gas_Pipeline_Intrusion_Campaign_2011_to_2013%20(1).pdf)\n\n## Technical Details\n\nIn April 2012, CISA received reports about targeted attacks directed at multiple ONG pipeline sites; CISA (via a predecessor organization)\nand FBI provided incident response and remediation support to a number of victims from 2012 to 2013. CISA and FBI’s analysis of the\nmalware and threat actor techniques identified that this activity was related to a spearphishing campaign. The U.S. Government identified\nand tracked 23 U.S. natural gas pipeline operators targeted in this campaign. Of the 23 known targeted entities, 13 were confirmed\ncompromises, 3 were near misses, and 7 had an unknown depth of intrusion.\n\n**Threat Actor Activity**\n\nThe spearphishing activity appears to have started in late December 2011. From December 9, 2011, through at least February 29, 2012,\n[ONG organizations received spearphishing emails [T1566.002] specifically targeting their employees. The emails were at constructed with a](https://attack.mitre.org/versions/v9/techniques/T1566/002)\n[high level of sophistication to convince employees to view malicious files [T1204.002]. Note: see the appendix for a table of the MITRE](https://attack.mitre.org/versions/v9/techniques/T1204/002)\nATT&CK tactics and techniques observed in this campaign.\n\nIn addition to spearphishing, CISA and the FBI were made aware of social engineering attempts by malicious actors believed to be\n[associated with this campaign. The apparent goal was to gain sensitive information from asset owners [T1598]. One asset owner reported](https://attack.mitre.org/versions/v9/techniques/T1598)\nthat individuals in their network engineering department, including managers, received multiple phone calls requesting information about\ntheir recent network security practices. Other employees in other departments were not targeted. The asset owner also reported that these\ncalls began immediately after they had identified and removed the malicious intruder from their network and performed a system-wide\ncredential reset. The caller identified himself as an employee of a large computer security firm performing a national survey about network\ncybersecurity practices. He inquired about the organization’s policy and practices for firewall use and settings, types of software used to\nprotect their network, and the use and type of intrusion detection and/or prevention systems. The caller was blocking his caller ID and when\nthe targeted organization tried to return the call, they reached a number that was not in service.\n\nDuring the investigation of these compromises, CISA and FBI personnel discovered that Chinese state-sponsored actors specifically\n[collected [TA0009] and exfiltrated [TA0010] ICS-related information. The Chinese state-sponsored actors searched document repositories](https://attack.mitre.org/versions/v9/tactics/TA0009)\n\n[[T1213] for the following data types:](https://attack.mitre.org/versions/v9/techniques/T1213)\n\n\n-----\n\nDocument searches: SCAD\nPersonnel lists\nUsernames/passwords\nDial-up access information\nSystem manuals\n\nBased on incident data, CISA and FBI assessed that Chinese state-sponsored actors also compromised various authorized remote access\nchannels, including systems designed to transfer data and/or allow access between corporate and ICS networks. Though designed for\nlegitimate business purposes, these systems have the potential to be manipulated by malicious cyber actors if unmitigated. With this access,\nthe Chinese state-sponsored actors could have impersonated legitimate system operators to conduct unauthorized operations. According to\nthe evidence obtained by CISA and FBI, the Chinese state-sponsored actors made no attempts to modify the pipeline operations of systems\nthey accessed. Note: there was a significant number of cases where log data was not available, and the depth of intrusion and persistent\nimpacts were unable to be determined; at least 8 of 23 cases (35 percent) identified in the campaign were assessed as having an unknown\ndepth of intrusion due to the lack of log data.\n\nCISA and FBI assess that during these intrusions, China was successful in accessing the supervisory control and data acquisition (SCADA)\nnetworks at several U.S. natural gas pipeline companies.\n\n[Chinese actors also gained information specific to dial-up access, including phone numbers, usernames, and passwords [T1120]. Dial-up](https://attack.mitre.org/versions/v9/techniques/T1120)\nmodems continue to be prevalent in the Energy Sector, providing direct access into the ICS environment with little or no security and no\nmonitoring, which makes them an optimal vector for hold-at-risk operations. The exfiltrated data provided the capabilities for the Chinese\ncyber actors to access ONG operational systems at a level where they could potentially conduct unauthorized operations.\n\n**Exfiltrated Information and Assessed Motives**\n\nThe Chinese actors specifically targeted information that pertained to access of ICSs. Searches were made for terms involving “SCAD*,” and\nthe actors exfiltrated documents, including personnel lists, usernames and passwords, dial-up access information, remote terminal unit\n(RTU) sites, and systems manuals. The Chinese actors also exfiltrated information pertaining to ICS permission groups and compromised\njump points between corporate and ICS networks. The totality of this information would allow the actors to access ICS networks via multiple\nchannels and would provide sufficient access to allow them to remotely perform unauthorized operations on the pipeline with physical\nconsequences.\n\nCISA and FBI assess that these intrusions were likely intended to gain strategic access to the ICS networks for future operations rather than\nfor intellectual property theft. This assessment was based on the content of the data that was being exfiltrated and the TTPs used to gain\nthat access. One victim organization set up a honeypot that contained decoy documents with content that appeared to be SCADA-related\ndata and sensitive organizational information. According to this organization, the SCADA-related decoy content was exfiltrated within 15\nminutes of the time it was made available in the honeypot. Other sensitive decoy information, including financial and business-related\ninformation, was ignored.\n\nCISA and FBI assess that this activity was ultimately intended to help China develop cyberattack capabilities against U.S. pipelines to\nphysically damage pipelines or disrupt pipeline operations.\n\n## Indicators of Compromise\n\nTable 1 lists indicators related to this spearphishing and intrusion campaign as of May 7, 2012, which are provided in this alert for historical\ncompleteness.\n\n_Table 1: IOCs from Chinese Gas Pipeline Intrusion Campaign, 2011 to 2013_\n\n**Type** **Indicator** **Filename**\n\nMalware MD5:84873fae9cdecb84452fff9cca171004\nntshrui.dll\n\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\n\nfpso.bigish[.]net\n\n\nMalware MD5:e12ce62cf7de42581c2fe1d7f36d521c\nntshrui.dll\n\n\n-----\n\nUser agent\nstring\n\nUser agent\nstring\n\n\nMozilla/4.0 (compatible; MSIE 6.0;\nWindows NT 5.2; SV1; .NET CLR\n1.1.4322; .NET CLR 2.0.50727)\n\nMozilla/4.0 (compatible; MSIE 8.0;\nWindows NT 5.1; Trident/4.0; .NET CLR\n2.0.50727; .NET CLR 3.0.4506.2152; .NET\nCLR 3.5.30729)\n\n\nNamed pipe ssnp\n\n\nPossible\ncommand\nand control\n(C2)\ndomain\n\n\n<xxx>.arrowservice[.]net\n\nWhere xxx is the targeted company name\nabbreviation\n\n\nMalware MD5:7361a1f33d48802d061605f34bf08fb0\n\n\nspoolsvd.exe\n\n\nMalware 5e6a033fa01739d9b517a468bd812162 AdobeUpdater.exe\n\nMalware e62afe2273986240746203f9d55496db ins.exe\n\nMalware ed92d1242c0017668b93a72865b0876b px.exe\n\nMalware 6818a9aef22c0c2084293c82935e84fe gh.exe\n\nMalware fcbbfadc992e265c351e54598a6f6dfb fslist.exe\n\nMalware 05476307f4beb3c0d9099270c504f055 u.exe\n\nMalware 54db65a27472c9f3126df5bf91a773ea slm.exe\n\nMalware a46a7045c0a3350c5a4c919fff2831a0 niu.exe\n\nMalware 60456fe206a87f5422b214369af4260e ccApp1.exe\n\nMalware d6eaadcbcf9ea9192db1bd5bb7462bf8 ntshrui.dll\n\nMalware 52294de74a80beb1e579e5bca7c7248a moonclient2.exe\n\nMalware e62afe2273986240746203f9d55496db inn.exe\n\nMalware 5e6a033fa01739d9b517a468bd812162 kkk.exe\n\nMalware 4a8854363044e4d66bf34a0cd331d93d inn.exe\n\nMalware 124ad1778c65a83208dbefcec7706dc6 AcroRD32.exe\n\nMalware 17199ddac616938f383a0339f416c890 iass.dll\n\n\nMalicious\nemail\nsender\naddress\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\nhyperlinked\nprobable\nmalware\n\nMalicious\nemail\nsignature\nblock\n\n\n“(name of victim company\nofficial)@yahoo.com”\n\n“If not read this paper, pay attention.”\n\nThe hyperlink indicated a “.zip” file and\ncontained the words “quality specifications”\nin reference to a particular component or\nproduct unique to the victim U.S.\ncorporation.\n\nContained the name, title, phone number,\nand corporate email address of an actual\nvictim company official.\n\n\n-----\n\nMalicious\nattachment\nname\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\n\nProject-seems-clear-for-takeoff.zip\n\n\n<xxx>.arrowservice[dot]net\n\nWhere <xxx> may be the full name of the\ntargeted company\n\n<xxx>.federalres[.]org\n\n<xxx>.businessconsults[.]net\n\nWhere <xxx> may be the targeted\ncompany name abbreviation or full name\n\nidahoanad[dot]org\n\nenergyreview.strangled[.]net\n\nblackcake[.]net\n\ninfosupports[.]com\n\n\nMalware 7caf4dbf53ff1dcd5bd5be92462b2995 iTunesHelper.exe\n\nMalware 99b58e416c5e8e0bcdcd39ba417a08ed Solarworldsummary.exe\n\nMalware f0a00cfd891059b70af96b807e9f9ab8 smss.exe\n\nMalware ea1b46fab56e7f12c4c2e36cce63d593 AcroRD32.exe\n\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\nPossible C2\ndomain\n\n\n3d28651bb2d16eeaa6a35099c886fbaa Election_2012_Analysis.pdf\n\nbalancefitstudio[.]com\n\nres.federalres[.]org\n\n18center[.]com\n\nmilk.crabdance[.]com\n\nbargainblog[.com[.]au\n\netrace-it[.]com\n\npicture.wintersline[.]com\n\nwish.happyforever[.]com\n\nmitchellsrus[.]com\n\nun.linuxd[.]org\n\n\n-----\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\n\nHow_Can_Steelmakers_Compete_for_Growth_in_the_Steel_Sector_in_2012.zip\n\n(Company Name)_Summary.zip\n\nf5369e59a1ddca9b97ede327e98d8ffe Solarworldsummary.zip\n\n(Company Name)_to_Sell_RNGMS_to_(Company Name).zip\n\nGift-Winter.zip\n\nHappy_New_Year.zip\n\nDebt_Crisis_Hits_US.zip\n\n\n-----\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\nMalicious\nemail\ncontent,\nincluding\nany\nattachments\nand/or\nmessage\nbody\n\n## Mitigations\n\n\n01-12-RATEALERT.zip\n\n\nfni.itgamezone[.]net\n\n\nCISA and the FBI urge Energy Sector and other CI owners and operators to apply the following mitigations to implement a layered, defensein-depth cyber posture. By implementing a layered approach, administrators will enhance the defensive cyber posture of their OT/ICS\nnetworks, reducing the risk of compromise or severe operational degradation if their system is compromised by malicious cyber actors.\n\n**Harden the IT/corporate network to reduce the risk of initial compromise.**\n\n**Update all software, including operating systems, applications, and firmware, in a timely manner. Consider using a centralized**\npatch management system.\n**Replace all end-of-life software and hardware devices.**\n**Restrict and manage remote access software. Remote access tools are a common method for threat actors to gain initial**\naccess and persistence on target networks.\n\nManage and restrict users and groups who are permitted to access remote capabilities. Permissions should be limited to\nusers that require the capability to complete their duties.\nRequire multi-factor authentication (MFA) for remote access.\nLimit access to resources over networks, especially by restricting Remote Desktop Protocol (RDP). If RDP is operationally\nnecessary, restrict the originating sources and require MFA.\n**Enable strong spam filters to prevent phishing emails from reaching end users.**\n**Implement unauthorized execution prevention by:**\n\nDisabling macro scrips from Microsoft Office files transmitted via email.\nImplementing application allowlisting, which only allows systems to execute programs known and permitted by security\npolicy. Implement software restriction policies (SRPs) or other controls to prevent programs from executing from common\nmalware locations, such as temporary folders supporting popular internet browsers.\n**Filter network traffic to prohibit ingress and egress communications with known malicious IP addresses. Prevent users from**\naccessing malicious websites by implementing URL blocklists and/or allow lists.\n**Set antivirus/antimalware programs to regularly scan IT network assets using up-to-date signatures.**\n\n**Implement and ensure robust network segmentation between IT and ICS networks to limit the ability of cyber threat actors to**\nmove laterally to ICS networks if the IT network is compromised.\n\n**Implement a network topology for ICS that has multiple layers, with the most critical communications occurring in the most**\nsecure and reliable layer. For more information refer to National Institute of Standard and Technology (NIST) Special Publication\n800-82: Guide to ICS Security.\n**Use one-way communication diodes to prevent external access, whenever possible.**\n**Set up demilitarized zones (DMZs) to create a physical and logical subnetwork that acts as an intermediary for connected**\nsecurity devices to avoid exposure.\n**Employ reliable network security protocols and services where feasible.**\n**Consider using virtual local area networks (VLANs) for additional network segmentation, for example, by placing all printers**\nin separate, dedicated VLANs and restricting users’ direct printer access.\n\n\n-----\n\n**Implement perimeter security between network segments to limit the ability of cyber threat actors to move laterally.**\n\n**Control traffic between network segments by using firewalls, intrusion detection systems (IDSs), and filter routers and**\nswitches.\n**Implement network monitoring at key chokepoints—including egress points to the internet, between network segments, core**\nswitch locations—and at key assets or services (e.g., remote access services).\n**Configure an IDS to create alarms for any ICS traffic outside normal operations (after establishing a baseline of normal**\noperations and network traffic).\n**Configure security incident and event monitoring (SIEM) to monitor, analyze, and correlate event logs from across the ICS**\nnetwork to identify intrusion attempts.\n\nImplement the following additional ICS environment best practices:\n\n**Update all software. Use a risk-based assessment strategy to determine which ICS network and assets and zones should**\nparticipate in the patch management program.\n\nTest all patches in off-line text environments before implementation.\nImplement application allowlisting on human machine interfaces.\n**Harden field devices, including tablets and smartphones.**\n**Replace all end-of-life software and hardware devices.**\n**Disable unused ports and services on ICS devices (after testing to ensure this will not affect ICS operation).**\n**Restrict and manage remote access software. Require MFA for remote access to ICS networks.**\n**Configure encryption and security for ICS protocols.**\n**Use a risk-based asset inventory strategy to determine how OT network assets are identified and evaluated for the**\n**presence of malware.**\n**Do not allow vendors to connect their devices to the ICS network. Use of a compromised device could introduce malware.**\n**Maintain an ICS asset inventory of all hardware, software, and supporting infrastructure technologies.**\n**Ensure robust physical security is in place to prevent unauthorized personal from accessing controlled spaces that house ICS**\nequipment.\n**Regularly test manual controls so that critical functions can be kept running if ICS/OT networks need to be taken offline.**\n**Manage the supply chain by adjusting the ICS procurement process to weigh cybersecurity heavily as part of the scoring and**\nevaluation methodology. Additionally, establish contractual agreements for all outsourced services that ensure proper incident\nhandling and reporting, security of interconnections, and remote access specifications and processes.\n\nImplement the following additional best practices:\n\n**Implement IP geo-blocking, as appropriate.**\n**Implement regular, frequent data backup procedures on both the IT and ICS networks. Data backup procedures should**\naddress the following best practices:\n\nEnsure backups are regularly tested.\nStore backups separately, i.e., backups should be isolated from network connections that could enable spread of malware\nor lateral movement.\nMaintain regularly updated “gold images” of critical systems in the event they need to be rebuilt.\nRetain backup hardware to rebuild systems in the even rebuilding the primary system is not preferred.\n**Implement a user training program to train employees to recognize spearphishing attempts, discourage users from visiting**\nmalicious websites or opening malicious attachments, and re-enforce appropriate user response to spearphishing emails.\n\n## APPENDIX: Tactics and Techniques\n\nTable 2 provides a summary of the MITRE ATT&CK tactics and techniques observed in this campaign.\n\n_Table 2: Observed MITRE ATT&CK tactics and techniques_\n\n**Tactic** **Technique**\n\n[Reconnaissance [TA0043]](https://attack.mitre.org/versions/v9/tactics/TA0043) [Phishing for Information [T1598]](https://attack.mitre.org/versions/v9/techniques/T1598)\n\n[Initial Access [TA0001]](https://attack.mitre.org/versions/v9/tactics/TA0001) [Phishing: Spearphishing Link [T1566.002]](https://attack.mitre.org/versions/v9/techniques/T1566/002)\n\n[Execution [TA0002]](https://attack.mitre.org/versions/v9/tactics/TA0002) [User Execution: Malicious File [T1204.002]](https://attack.mitre.org/versions/v9/techniques/T1204/002)\n\n[Discovery [TA0007]](https://attack.mitre.org/versions/v9/tactics/TA0007) [Peripheral Device Discovery [T1120]](https://attack.mitre.org/versions/v9/techniques/T1120)\n\n[Collection [TA0009]](https://attack.mitre.org/versions/v9/tactics/TA0009) [Information from Document Repositories [T1213]](https://attack.mitre.org/versions/v9/techniques/T1213)\n\n[Exfiltration [TA0010]](https://attack.mitre.org/versions/v9/tactics/TA0010)\n\n## Revisions\n\nInitial Version: July 20, 2021\n\n\n-----\n\nJuly 20, 2021: Corrected unknown depth of intrusion in Technical Details from 8 to 7.\n\nJuly 20, 2021: Removed \"Office Viewer\" recommendation since it's deprecated.\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa21-201a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-20 - Alert (AA21-201A)- Chinese Gas Pipeline Intrusion Campaign, 2011 to 2013.pdf"
    ],
    "report_names": [
        "2021-07-20 - Alert (AA21-201A)- Chinese Gas Pipeline Intrusion Campaign, 2011 to 2013.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536202,
    "ts_updated_at": 1743041119,
    "ts_creation_date": 1653786431,
    "ts_modification_date": 1653786431,
    "files": {
        "pdf": "https://archive.orkl.eu/878a5fbef29160a0cf501bccec9605027f1218ab.pdf",
        "text": "https://archive.orkl.eu/878a5fbef29160a0cf501bccec9605027f1218ab.txt",
        "img": "https://archive.orkl.eu/878a5fbef29160a0cf501bccec9605027f1218ab.jpg"
    }
}