{
    "id": "a6df5790-1c53-4010-bb40-e25b6241adaf",
    "created_at": "2025-01-24T02:05:33.876468Z",
    "updated_at": "2025-03-27T02:13:50.565711Z",
    "deleted_at": null,
    "sha1_hash": "0c7a21f107e42339587a2e2a3014b059afb70404",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-04-20T11:07:33Z",
    "file_modification_date": "2021-04-20T11:07:33Z",
    "file_size": 1890562,
    "plain_text": "# WINDIGO \n\n FOOTPRINTS FOUND\n\n**TLP:WHITE                                              April 2021**\n\n\n-----\n\nTLP: White\n\n### Table of Contents\n\n#### EXECUTIVE SUMMARY ............................................................................ 3\n\n EVOLUTION .............................................................................................. 4\n\nVERSION < 1.2 ......................................................................................................................................... 4\n\nVERSION 1.2.1  - 1.3.3 ............................................................................................................................ 4\n\nVERSION 1.5.0 – 1.6.2 ............................................................................................................................ 5\n\nVERSION 1.7.1 – 1.7.3 ............................................................................................................................ 5\n\n#### TECHNICAL ANALYSIS ............................................................................. 6\n\nDYNAMIC FUNCTIONS RESOLUTION ........................................................................................................ 6\n\nFUNCTIONS HOOKING .............................................................................................................................. 7\n\nBACKDOOR FUNCTIONALITIES ............................................................................................................... 11\n\nDAEMON & SOCKET COMMUNICATION ............................................................................................... 14\n\nDGA & C2 ............................................................................................................................................. 16\n\n#### DETECTION AND MITIGATION ............................................................ 18\n\n CONCLUSIONS ...................................................................................... 20\n\n MITRE ATT&CK TTPS............................................................................ 21\n\n INDICATORS OF COMPROMISE .......................................................... 22\n\nHASHES ................................................................................................................................................... 22\n\nIPS ........................................................................................................................................................... 22\n\nC2 ........................................................................................................................................................... 22\n\nYARA RULE .............................................................................................................................................. 23\n\n\n-----\n\nTLP: White\n### Executive Summary\n\nEbury is a well-known Linux OpenSSH backdoor and credential stealer created by\n\ncyber-criminal gang, which ESET researchers named Operation Windigo[1]. The first\n\nsample was spotted in 2011, and in 2014 a joint research between CERT-Bund, the\n\nSwedish National Infrastructure for Computing, the CERN and ESET was published\n\nabout this threat. In 2017 ESET issued an in-depth technical update about Windigo\n\ngang operations, showing lots of new features introduced in the modern variants. As\n\na result of ESET analysis effort, the Russian citizen Maxim Senakh was arrested and\n\nsentenced to 46 months by FBI[2]. Not many updates about this threat were published\n\nsince then. In this technical report we analyze a brand-new variant spotted for the first\n\ntime in October 2020. We try to uncover complex functionalities of the backdoor,\n\ngoing deep into the most recent introduced capabilities and evidencing the differences\n\nwith respect to older versions. Its main focus is to remain stealth and avoid detection\n\nfrom infected systems, providing persistent remote access to threat actor and the\n\nability to exfiltrate sensitive information, such as users credentials. These findings show\n\nthat Windigo crew’s infamous operation has probably undergone a partial slowdown\n\ndue to Senakh’s arrest, but is anything but dead.\n\n1https://www.welivesecurity.com/2014/03/18/operation-windigo-the-vivisection-of-a-large-linux-server-side\ncredential-stealing-malware-campaign/\n2 https://www.welivesecurity.com/2017/10/30/esets-research-fbi-windigo-maxim-senakh/\n\n\n-----\n\nTLP: White\n### Evolution\n\nEbury’s authors used to embed version number into each sample, that simplify its\n\nevolution tracking process. Ebury evolves along with version ups, including adding\n\nfeatures and changing existing ones. Now we introduce a brief overview of all different\n\nversions discovered.\n\nv1.2 v1.5.0 v1.7.2\n\nv1.5.1 v1.7.3\n\nv1.5.5\n\nv1.5.6\n\n2014 v1.6.2 2019\n\n2011 2017 2020\n\nv1.2.1\n\nv1.3.2\n\nv1.3.3 v1.7.0\n\nv1.3.4 v1.7.1\n\n_Figure 1 - Ebury’s evolution timeline_\n\n##### Version < 1.2\n\nWe know little about very first versions. It seems that Ebury was spotted for the first\n\ntime in 2011 by a security researcher[3]. In its primitive variant, Ebury replaces ssh, sshd\n\nand `ssh-add` Linux binaries with its modified versions, aiming to steal users’\n\ncredentials and enable to login without entering the password. To enhance\n\npersistence, attackers also modified the RPM database of the victims with the hashes\n\nof their malicious executables.\n\n##### Version 1.2.1 - 1.3.3\n\nAttackers abandoned `ssh binary patching, and transferred previously implemented`\n\nmalicious capabilities to `libkeyutils.so, a shared object dynamically loaded by`\n\nOpenSSH binaries[4]. They added a constructor function to the library with the aim of\n\npatching original code and hijacking original functions. In order to discover the original\n\naddress of functions, they made a massive use of `dlopen,` `dlsym` and `dlinfo`\n\n3 https://plog.sesse.net/blog/tech/2011-11-15-21-44_ebury_a_new_ssh_trojan.html\n\n4 https://www.welivesecurity.com/2014/02/21/an-in-depth-analysis-of-linuxebury/\n\n\n2017\n\n\n2011\n\n\n2019\n\n\n-----\n\nTLP: White\nprimitives. Once installed, Ebury gives the ability to remote login with a specially\ncrafted ssh packet and credential stealing.\n\n##### Version 1.5.0 – 1.6.2\n\nIn these versions, malicious actor added hooks to other functions, such as `readdir,`\n\n`open, open64 and` `fgets` in order to remain stealth: in fact, as already mentioned by\n\nESET researchers[5], this feature gives Ebury the shape of a userland rookit. They\n\nhijacked such functions, by introducing checks when a user tries to open\n\n`/proc/self/environ` or to accesso to `.ssh/authorized_keys. Moreover, the`\n\nmalware was able to inject its own configuration into `sshd` and use attacker’s\n\nhardcoded public key for authentication. Lastly, many network peculiarities were\n\nadded: for example, a DGA for C2 communication and a validation control on the\n\ndomain using encrypted DNS TXT record.\n\n##### Version 1.7.1 – 1.7.3\n\nFirst samples were spotted in 2019 by CERN Computer Security Team[6]. This report\n\nwould be an immersive investigation about the latest versions, still active nowadays.\n\n5 https://www.welivesecurity.com/2017/10/30/windigo-ebury-update-2/\n\n6 https://security.web.cern.ch/advisories/windigo/windigo.shtml\n\n\n-----\n\nTLP: White\n### Technical analysis\n\nLatest variants appeared online is 1.7, available in three different sub-versions: 1.7.1.c,\n\n1.7.2, and 1.7.3. The first one is smaller than latters (~38 KB vs ~50 KB), and it is\n\ndistributed as a Linux shared object with the name libtsq.so. Instead, latest variants\n\n1.7.2-3 were observed in second half of 2020 and spread as libkeyutils.so.1. It is\n\na well-known library, loaded by ssh-related binaries, and consists in a set of utilities\n\nfor managing and preserving authorization and encryption keys required to perform\n\nsecure operations. From now on, we focus the analysis effort on versions 1.7.2 and\n\n1.7.3, for which every statement applies due to their high similarity.\n\nLatest samples are an incremental update of the previous versions, where several new\n\nfeatures were added. Authors still implemented the majority of malicious code in\n\n`.ctors` (constructors) section, which contains function pointer to initialization code\n\nthat is executed before the victim program runs into main() function. Actual versions,\n\nlike older ones, do not contain many strings in cleartext, but rather they are encrypted\n\nwith a XOR cipher using a pseudo-random generated key that changes every round of\n\nthe loop. The algorithm used to generate the one-time key seems based on srand(),\n\na well-known glibc function commonly called to initialize a pseudo-random number\n\ngenerator.\n\n_Figure 2 - Decryption routine for strings._\n\n##### Dynamic functions resolution\n\nIn order to hinder the auto-analysis of the disassemblers and its external parameter\n\npropagation capability, Ebury dynamically resolves both all functions and global\n\nvariables in the constructor. For this purpose, it parses the dynamic segment,\n\ncorresponding to the `.dynamic` section, that consists in an array of `Elf64_Dyn`\n\nstructures. Looping through all structures of this section, it searches for the one with\n\n\n-----\n\nTLP: White\n`d_tag` of type `DT_PLTGOT, namely the address of the section .got.plt. Its value is`\n\nthe address of the Global Offset Table (GOT), referred to the Procedure Linkage Table\n\n(PLT). Recovering GOT base address allows Ebury to calculate the offset GOT[1], which\n\npoints to the link_map chain, the linked list used by the operating system loader to\n\nresolve external symbols. The algorithm Ebury uses to convert strings to the\n\ncorresponding external symbols is a re-implementation of the one used by the\n\noperating system's dynamic linker, and supports symbol lookup by both standard hash\n\ntables[7], based on PJW hash function, and GNU hash tables[8], based on DJB2. The\n\nanalysis is quite difficult but allows to understand the malicious actor's in-depth\n\nknowledge of ELF file loading mechanisms on Linux systems.\n\n_Figure 3 - Ebury's dynamic linking implementation with standard hash table (above) and GNU hash table (below)._\n\n##### Functions hooking\n\nEbury uses two different methods for hooking libraries: the first one targets the victim\n\nprogram, the second one aims to spread itself across every command launched by the\n\nvictim program:\n\n Using PLT/GOT Redirection. In this case it sets hooks by overwriting the PLT ad\ndresses in the .got.plt section of the victim program. We will describe it better\nwith an example. Let x.bin be the victim program, f() the legitimate function to\nhook and mal_f() the malicious function which Ebury wants to hook to f(). Then:\n\n7 https://flapenguin.me/elf-dt-hash\n\n8 https://flapenguin.me/elf-dt-gnu-hash\n\n\n-----\n\nTLP: White\n\n    - Ebury iterates over the relocation table looking for the Elf64_Rela struc\nture that refers to the symbol whose name is f();\n\n    - Once found, the offset is copied and dynamically relocated, simulating what\n\nthe loader does in an ASLR-enabled environment. The result is an address\nthat points to the legitimate function f(), existing in the x.bin PLT;\n\n    - Ebury now changes the access permission of the memory pointed by the\n\naddress found, to make it writeable;\n\n    - Now Ebury replaces the legitimate address with mal_f()’s address;\n\n_Figure 4 – Example of PLT/GOT redirection implementation in Ebury._\n\n Using `LD_PRELOAD` environment variable, by setting its value to `lib-`\n```\n  keyutils.so.1, right before execution of a program. In this way it is able to per\n```\nform runtime patching by redirecting many shared glibc functions, because the\ngiven library takes precedence over any other loaded shared libraries. Since it does\nnot work on existing processes, the shared library must be loaded upon execution\nof a program: in this case when a client connects to the infected machine in SSH,\nthe malware compromises every command executed by the victim by prepending\n```\n  LD_PRELOAD.\n\n```\nIn particular, it hooks:\n```\n   o execl\n   o execve\n   o execvp\n   o execvpe (not seen in previous versions)\n   o fopen\n   o fopen64\n   o open\n   o open64\n   o openat \n   o openat64\n   o opendir (not seen in previous versions)\n   o popen\n   o prctl (not seen in previous versions)\n   o readdir\n   o readdir64\n\n```\n\n-----\n\nTLP: White\n```\n   o seccomp_load (not seen in previous versions)\n   o system (not seen in previous versions)\n\n```\nFor example, hooked system() function first checks if LD_PRELOAD or LD_DEBUG\n\nenvironment variables are set: if not, it appends LD_PRELOAD, so it can hijack other\n\nprocesses calls to system functions.\n\n_Figure 5 – Ebury’s implementation of hooked libc system() function._\n\nFurthermore, Ebury is able to heuristically understand from which binary it has been\n\nlaunched, by searching the existence of specific libraries and functions. To do that, it\n\nmakes use of a global variable that it sets with a value between 0 and 4. First of all,\n\ntypes 1 to 4 identify a program which must have loaded libc.so and libcrypto.so\n\nand contain `RSA_sign` or `EVP_SignFinal` functions in `.reloc` section. Then, the\n\nspecific assigned value is decided according to the conditions of the following table:\n\n\n-----\n\nTLP: White\n\n**connect()** **prctl()** **EVP_CipherInit()** **deflateInit_()** **logout()** **tcpsendbreak()** **PEM_read_*()**\n\n**Type 1** ✓  or ✕ ✓ ✓ ✓   or ✓ −\n\n**Type 2** ✓ − ✓ ✓ ✕ ✕ ✓\n\n**Type 3** ✓  or ✕ ✓ ✕ − − −\n\n**Type 4** ✕ ✓ − − − − −\n\n_Table 1 – Conditions through which Ebury detects which running binary it has compromised._\n\nFollowing our tests, the associations between types and victim programs have been\n\nlisted below:\n\n `Type 1: SSHD;`\n\n `Type 2: SSH / RSH / RLOGIN / SLOGIN;`\n\n `Type 3: SSH-AGENT / SSH-KEYGEN / OPENSSL;`\n\n `Type 4: CLAMONACC;`\n\n `Type 0: matches any other case. This includes any other application launched`\n\nin a compromised ssh session by using LD_PRELOAD environment variable, like\n\n`cd` and ls.\n\nBased on which binary loaded Ebury, it hooks different functions: for example, scanf\n\nand sscanf are hijacked only when original process is `sshd. It is noteworthy what`\n\nhappens when it does not recognize one of previous known binaries: at this point,\n\nmalware checks whether /curl.so is dynamically loaded or the binary name contains\n```\n“php”. In this case it substitutes every curl-related function with its own malicious\n\n```\nversion, that performs a POST request to its C2, containing contacted URL and original\n\nrequest body in POST data, every time a curl request is made. The destination FQDN\n\naddress can be dynamically set by the attacker using commands described in\n\n“Backdoor functionalities” section of this report.\n\n|Col1|connect()|prctl()|EVP_CipherInit()|deflateInit_()|logout()|tcpsendbreak()|PEM_read_*()|\n|---|---|---|---|---|---|---|---|\n|Type 1|✓ ✕ or||✓|✓|✓ ✓ or||−|\n|Type 2|✓|−|✓|✓|✕|✕|✓|\n|Type 3|✓ ✕ or||✓|✕|−|−|−|\n|Type 4|✕|✓|−|−|−|−|−|\n\n\n-----\n\nTLP: White\n\n_Figure 6 – Hooked curl function that sends POST data to C&C._\n\n##### Backdoor functionalities\n\nAs already found in previous versions, a tailored SSH data packet allows attackers to\n\nbypass standard authentication mechanisms and remotely connect to infected targets.\n\nEbury intercepts SSH’s sscanf() calls that is responsible to parse version number: in\n\nthe malicious routine, it takes the twenty-two (22) characters string sent as version\n\nnumber, decodes them from base64, decrypt them using host remote IP address in\n\nbinary format xor-ed with `0x1010101, and then calculates the SHA-1 hashsum`\n\ncomparing it with a hardcoded value\n\n(DB44994ED1ED262B044D9AD0303E1A4ED2FC0372). If every condition is met, the\n\nmalicious actor gets into the victim.\n\n_Figure 7 - Original call to sscanf() by sshd, hooked by Ebury._\n\n\n-----\n\nTLP: White\n\n_Figure 8 – Hooked sscanf() in Ebury._\n\nMoreover, this mechanism lets the malicious actor send custom commands to infected\n\nmachines, specified by the following scheme:\n```\nSSH-<protocol>-<base64encoded-password>X<command><command_argument>\n\n```\nVersion 1.7.2 supports seven (7) different commands; 1.7.3 even one more. The full list\n\nas follows:\n\n `ver: write to output Ebury’s hardcoded version number and exit. It also takes an`\n\noptional input parameter in order to set the exfiltration server IP address;\n `cat: write to standard output all passwords stored in the global buffer and exit. It`\n\nalso takes an optional input parameter in order to set the exfiltration server IP address;\n `bnd: it takes an input parameter to set an IPv4 address. Whenever sshd creates a`\n\ntunnel to a remote host, binds the client socket to the specified address;\n `psw: seems not to be implemented yet, for now it behaves like ver;`\n `xsh: set user’s login shell to the default value (commonly /bin/sh);`\n `csh: is the combination of commands cat and xsh;`\n `crl: it takes an input parameter in order to set the FQDN of the exfiltration server`\n\nused to hijack curl/php communications;\n `cls: only available in 1.7.3, is the combination of commands xsh and crl.`\n\nVariant 1.7.3 also introduced an unseen mechanism in order to make its presence\n\nstealthier and tougher to detect: while hooking `execve(), it ensures to delete the`\n\ncontent of `SSH_CLIENT and` `SSH_CONNECTION environment variables, that are`\n\nresponsible to show ssh information about address and open incoming/outgoing\n\n\n-----\n\nTLP: White\nports. Furthermore, it sets POSIXLY_CORRECT=y when the attackers is currently logged\n\nin using `xsh command.`\n\n_Figure 9 – Hiding techniques seen in v1.7.3._\n\nMalicious actor hardcoded a SSH public key, that can be used to remotely authenticate.\n\nIn order to accomplish the goal, malware first injects a custom sshd configuration to\n\nenable Public Key authentication and bypass Linux\n\nPluggable Authentication Modules (PAM), changes the default authorized key file to\n\n`/proc/self/environ, and then patches` `fgets() and` `__getdelim()` functions,\n\nforcing them to add the hardcoded Public Key to authorized keys and making it\n\npossible to authenticate with related private key owned by attackers.\n\n\n-----\n\nTLP: White\n\n```\nPrintLastLog no\nPrintMotd no\nPasswordAuthentication no\nPermitRootLogin yes\nUseLogin no\nUsePAM no\nUseDNS no\nChallengeResponseAuthentication no\nLogLevel QUIET\nStrictModes no\nPubkeyAuthentication yes\nAllowUsers n\nAllowGroups n\nDenyUsers n\nDenyGroups n\nAuthorizedKeysFile /proc/self/environ\nBanner /dev/null\nPermitTunnel yes\nAllowTcpForwarding yes\nPermitOpen any\nAuthenticationMethods publickey\n\n```\n\n_Figure 10 – Ebury ssh public key._\n\n```\nssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDSEuS/A5HLzAwCbs+fqxCv1rLZ+x4vCdzcfLppJuCHnD2EO58W4aNDxtn2IBooyr4zylBJrNa64\nnQ3L7MvxckQMMLWkN6owZPtJs7+BPIsljX+Kz0svqGHDYk5KyQQ+O/uWVUU96X4NkyE4BxeQnH6jCYw2FCcnudsS5GLseBUozQvQlQEErRq3ma3skzZGB4kOq6He7ksaEUFjzgyfAQHzr1hPX5KJ/du4z7fX0KqUphK4AXbPL4Pqkusw4PeQLDjZGO8hRkDMVjnaPNliAS2pV9Guw+L7SLvXGHsz1Q+tT54JaSHkJoN6a0lJ/L3IehVTi/ZLLh4GgZ1WpWH7EqL\n\n```\n\n_Figure 11 – Ebury sshd configuration._\n\nIt is worth to mention how attackers can use two environment variables G and S. The\n\nformer is used to disable the hook to function write(), which hides possible errors\n\nwritten to stderr, the latter to disable glibc functions hooking through LD_PRELOAD.\n\nProbably, these two variables are used for debug purpose when the operator logs in\n\ninto an infected machine.\n\n##### Daemon & socket communication\n\nAmong the Unix binaries targets, sshd is certainly the most complex and interesting\n\none. In this case, Ebury distributes the business logic of the backdoor on two different\n\n\n-----\n\nTLP: White\nprocesses, and use a local socket for communicating with each other. The source\n\nprocess (sshd) sends commands, while a Linux executable is started as a daemon and\n\nlisten for incoming local connections and commands. Communications take place via\n\na Unix socket, created and managed by this daemon. The victim program uses it mainly\n\nfor storage operations: in fact, it creates a memory structure, whose size is ~3 MB, to\n\nsave logs created by the malware itself and victims’ passwords to be exfiltrated. This\n\nbuffer is periodically filled with the content of a second smaller buffer (32 KB), also\n\ncontrolled by the process sshd. It is not clear why the attacker choses this strategy,\n\nbut he forks sshd multiple times (e.g., each time a client connects), so this probably\n\nrequires the implementation of a custom shared storage.\n\nThe most interesting commands accepted by the daemon have been simplified and\n\nlisted below:\n\n `append: adds content to the buffer;`\n `flush: asks the daemon to send the entire big buffer;`\n `parse: receives the command (e.g., ver or cat) sent by the attacker;`\n `put: saves a string into a dedicated buffer;`\n `get: extracts the string previously set with put.`\n\nIt is also noteworthy how the demon is instantiated. The victim program at startup,\n\nduring the loading and hooking routines performed in the constructor, creates a child\n\nprocess with a call to fork(). The parent process continues to run previously, while\n\nthe child spawns all the following legitimate Linux executables:\n```\n  - /bin/sync\n  - /bin/hostname\n  - /usr/sbin/atd\n\n```\nand five (5) randomly chosen from the list below:\n```\n  - /sbin/auditd\n  - /usr/sbin/crond\n  - /usr/sbin/anacron\n  - /usr/sbin/arpd\n  - /usr/sbin/acpid\n  - /sbin/rsyslogd\n  - /sbin/udevd\n  - /usr/lib/systemd/systemd-udevd\n\n```\nIn order to backdoor them, each of the above processes is run with `LD_PRELOAD`\n\nenvironment variable set, and libcrypto.so and libkeyutils.so full paths as value.\n\nThereafter, each of them will try to create a Unix socket on /run/systemd/log and\n\nstart listening on it: clearly, only one of them will succeed, while others processes will\n\nfail with error EADDRINUSE and exit. The “winner” process finally creates the daemon\n\nwith a call to daemon() and then terminates.\n\n\n-----\n\nTLP: White\n##### DGA & C2\n\nDomain Generation Algorithm (DGA) is similar to older versions implementations,\n\nspawned with a `fork() call. Attackers added a 300 milliseconds sleep whenever a`\n\ndomain is generated, that is increased to 1 second after the 63th failed attempt.\n\nChosen alphabet is abcdefghijklmnopqrstuvwxyz123456. If the generated domain\n\nstarts with a digit, it is replaced with the character ”a” in order to make it valid. TLDs\n\nalso remain the same of older variants: `.info,` `.net` and `.biz.`\n\n_Figure 12 – DGA algorithm._\n\nThe DGA is circular: in fact, even if total iterations are more than 30.000, there are only\n\nninety-six (96) unique domains. Whenever a domain is created, the malware performs\n\ntwo DNS requests: the first for retrieving the “A record” and a second one for “TXT\n\nrecord”. In the former request, malware also adds the current timestamp in front of the\n\ndomain, but discards the response. Instead, every valid TXT record response is verified\n\nand decrypted through a hardcoded RSA Public Key to authenticate the domain.\n\n```\n          -----BEGIN RSA PUBLIC KEY-----MIG JAoGBAOadSGBGG9x/f1/U6KdwxfGzqSj5Bcy4aZpKv77uN4xYdS5HWmEub5Rj\nnAvtKybupWb3AUWwN7UPIO+2R+v6hrF+Gh2apcs9I9G7VEBiToi2B6BiZ3Ly68kj\n 1ojemjtrG+g//Ckw/osESWweSWY4nJFKa5QJzT39ErUZim2FPDmvAgMBAAE=\n           -----END RSA PUBLIC KEY----\n```\n\n_Figure 13 – Hardcoded RSA Public Key._\n\n\n-----\n\nTLP: White\n\n_Figure 14 – Decryption and parsing of the TXT record value using the hardcoded RSA Public Key._\n\nThe decrypted content is composed of colon-separated text, as already seen in\n\nprevious versions. The first chunk represents the domain, the second one is the decimal\n\nrepresentation of the C2 IP address (e.g., `3005980741 =>` `179.43.160[.]69) and`\n\nthe last one is a timestamp that represents an expiration date, after which the C2 is not\n\nvalid anymore (e.g., `1622505600 =` `2021/06/01 00:00 UTC). This validation`\n\nmechanism tries to avoid possible sink-hole attempts. Then, data exfiltration takes\n\nplace using a DNS request (port 53) toward the received IP address.\n\nAs we can see from Table 1, attackers are constantly switching IP addresses in TXT\n\nrecord in the last two (2) years. However, by decrypting the content of the TXT record,\n\nit is possible to predict the next update, that should be on 2021/06/01 00:00 UTC.\n\nAt the time of writing, latest version has `op3f1libgh[.]biz as the only currently`\n\nactive domain generated by DGA with a valid TXT record, last updated on 02/02/2021.\n\n|ENCRYPTED TXT Record DECRYPTED TXT Record First Seen Last Seen|Col2|Col3|Col4|\n|---|---|---|---|\n|P999MR0e//emIov0Z2qtoKKKhFtb1F6l+zMxn9a 3q2p18ZWeaTyPXMAlXDAQI3bz6pxmeQzGCuz1P1 ms25AiPKGuqhZ+etJXVnjy9Ir4zc2UU3jyeFZhs 7UEfGAcZut5LY9dt5tCJKhPhYwbz4s2ZixBVUWP bFDuODCJIi4L3fw=|op3f1libgh.biz: 3005980741: 1622505600|2021/02/02||\n|pusSmJ8IKds+IwzH3oUJV6MmT/f8/9DKwMk68/E rzMDdkTbbOrVwrUicuIjFgTlyJSY1unZJM1HYa6 N6bXFxs/Nzn+v8yrqv95XNjQiKky4kGvD0qqZQK|op3f1libgh.biz: 3005980741:|2020/09/10|2021/02/02|\n\n\n-----\n\nTLP: White\n```\n TV1Sw1PbjgevpmgtnrXj39Redu8yeTe7uFCKHrn 1612137600\n vvWVfzuDiAutNcI=\n EHqSM8Jnzef4+1cEYTqVINho6bGaPbGmLOEkk6F\n                        op3f1libgh.biz:\n HAUfFZEQQuTYYMNLiugkA4SmkHmSylxOqWbkS/e\n\n```\n`Lt7YTcA9x3imeDFTUOVwK01SN/hNl02FxXuaEOg` `3005980741:` 2020/03/16 2020/09/10\n```\n 9WPw6J0rH9r4pOhVp1PHDYoUpItUgjyf++p+pNx\n                         1598745600\n m4oWVEsCsB5/nXI=\n n+/C/igV2NksBM36nL+GiehFxwfvAXlRPMV2hvu\n                        op3f1libgh.biz:\n OPbtyJyItjaPTwR9/ziViDtvo9EDGFRr1mEFBGe\n\n```\n`fXWvaEfkbN0SCkW+FJ5ja4fN3SONTQ3/8LcKgRE` `760855987:` 2019/10/15 2020/03/16\n```\n /g96JOq3ZiyLBfFphCcLdYfmEfkVoQbhNLb/FFD\n                         1585526400\n QDzelIkHLBMHO5w=\n NZ8YHsqY6bk6QdJSEIBkh8ifSTnOUhrDGAcat43\n                        op3f1libgh.biz:\n Y7pgKhkVGjb6EQMHDdvhxF8ZpTDni0U5bRK8Wq9\n\n```\n`1kkd3NV4uzXDTZTFpsWDEzD5h4lxcLQodK8d9eL` `3238048588:` 2019/06/05 2019/10/15\n```\n kxjLbYR6w4nJhUDMjfI3ou96FFZPX4GQKuWG435\n                         1575072000\n XvHlNeyPEchF3vk=\n WZVphrenIo1fkomSS8WKDp5Qw0E66Mg6si+XUYS\n                        op3f1libgh.biz:\n f/J1IklHKGkgSdJ5zbafwkx6DQFRuvr0sGMuDI8\n\n```\n`RsV8LPrC8k9l836NG9DNl+++G4bm4ULolQrp6KY` `3238048588:` 2019/04/05 2019/06/03\n```\n neVeOb39wLzG+YYG6fm8OdSjc5rqtcqOm2SUZag\n                         1559174400\n HxC3tDkYq0EGH/s=\n\n```\n_Table 2 – List DNS TXT resolutions of Ebury’s C2, with decrypted content._\n\nThe only active C&C domain found in this version, `op3f1libgh[.]biz, resolves on`\n```\n78.140.134.9, appears to be hosted in Netherland by WEBZILLA. Related to this\n\n```\ndomain and already observed in older versions of Ebury, there is also\n```\nlarfj7g1vaz3y[.]net, resolving on the same subnet on IP 78.140.134.7,\n\n```\nregistered on September 22, 2016 from the same provider.\n\nA couple of things to notice for both domains: the malicious actor uses an uncommon\n\nDNS TTL (Time To Live) value, configured to 1799, and hides the WHOIS record.\n\n### Detection and Mitigation\n\nTo quickly detect if your Linux system has been infected by Ebury, you can try this\n\nsimple command:\n\n|TLP: White|Col2|Col3|Col4|\n|---|---|---|---|\n|TV1Sw1PbjgevpmgtnrXj39Redu8yeTe7uFCKHrn vvWVfzuDiAutNcI=|1612137600|||\n|EHqSM8Jnzef4+1cEYTqVINho6bGaPbGmLOEkk6F HAUfFZEQQuTYYMNLiugkA4SmkHmSylxOqWbkS/e Lt7YTcA9x3imeDFTUOVwK01SN/hNl02FxXuaEOg 9WPw6J0rH9r4pOhVp1PHDYoUpItUgjyf++p+pNx m4oWVEsCsB5/nXI=|op3f1libgh.biz: 3005980741: 1598745600|2020/03/16|2020/09/10|\n|n+/C/igV2NksBM36nL+GiehFxwfvAXlRPMV2hvu OPbtyJyItjaPTwR9/ziViDtvo9EDGFRr1mEFBGe fXWvaEfkbN0SCkW+FJ5ja4fN3SONTQ3/8LcKgRE /g96JOq3ZiyLBfFphCcLdYfmEfkVoQbhNLb/FFD QDzelIkHLBMHO5w=|op3f1libgh.biz: 760855987: 1585526400|2019/10/15|2020/03/16|\n|NZ8YHsqY6bk6QdJSEIBkh8ifSTnOUhrDGAcat43 Y7pgKhkVGjb6EQMHDdvhxF8ZpTDni0U5bRK8Wq9 1kkd3NV4uzXDTZTFpsWDEzD5h4lxcLQodK8d9eL kxjLbYR6w4nJhUDMjfI3ou96FFZPX4GQKuWG435 XvHlNeyPEchF3vk=|op3f1libgh.biz: 3238048588: 1575072000|2019/06/05|2019/10/15|\n|WZVphrenIo1fkomSS8WKDp5Qw0E66Mg6si+XUYS f/J1IklHKGkgSdJ5zbafwkx6DQFRuvr0sGMuDI8 RsV8LPrC8k9l836NG9DNl+++G4bm4ULolQrp6KY neVeOb39wLzG+YYG6fm8OdSjc5rqtcqOm2SUZag HxC3tDkYq0EGH/s=|op3f1libgh.biz: 3238048588: 1559174400|2019/04/05|2019/06/03|\n\n\n-----\n\nTLP: White\n```\n ssh -G 2>&1 | grep -e illegal -e unknown > /dev/null && echo\n \"System clean\" || echo \"System clean\"[9]\n\n```\nIn fact, ssh `-G behaves differently in Ebury infected systems with respect to standard`\n\nones: in clean hosts, system will inform you the use of the illegal option “G”, while in\n\ncompromised servers no error will arise.\n\nAnother simple verification step could be checking libkeyutils.so size: if greater\n\nthan 30 KB, there is a good chance that your machine has been compromised.\n\nIt is also possible to detect whether any process has a Unix socket opened and in listen\n\nstate on /run/systemd/log. Just run the following and check eventual output:\n```\n         ss -lpn | grep @/run/systemd/log\n\n```\nAs well as host indicators, it is possible to check network ones on your perimetral\n\nsystems, using indicators of compromise attached to this report.\n\nIn the unfortunate case your system shows infection evidences, the best thing to do is\n\nperform a revert to clean state, wherever possible, and change SSH users’ passwords.\n\n9 https://github.com/eset/malware-ioc/tree/master/windigo\n\n\n-----\n\nTLP: White\n### Conclusions\n\nApproximately ten years have passed since first Ebury sample was spotted, and\n\nWindigo gang is still active nowadays. During these years it was possible to follow\n\nEbury’s evolution, observing its continuous improvement through every released\n\nversion, and outlining its growth in terms of features and complexity. Its development\n\ndemonstrates attackers’ wide knowledge of Linux internals, and especially a great\n\nexpertise of SSH network protocol and its related binaries. Furthermore, Ebury’s\n\nmaintenance shows the ability to keep up with operating systems releases.\n\nIn this report we tried to dissect remarkable functionalities, both old and ones\n\nintroduced in newest version. Due to its nature, Ebury appears to be only one of the\n\nweapons at disposal of the threat actor: it acts as a backdoor with explicit persistence\n\nand exfiltration purposes, while not much is known about its delivery and initial access\n\nphases.\n\nWe also provided simple checks to audit the state of your Linux environments, in order\n\nto detect eventual Ebury’s traces.\n\nThe usage of almost the same network indicators within the last two years suggests\n\nthat until now probably little action have been undertaken to restrict and mitigate such\n\nthreat, which rather proves its uninterrupted development and maintenance.\n\n\n-----\n\nTLP: White\n### MITRE ATT&CK TTPs\n\n|MITRE ATT&CK TTPs|Col2|Col3|Col4|\n|---|---|---|---|\n|Tactic Technique Name Comment||||\n|Execution|T1129|Shared Modules|Uses a .so file|\n|Persistence|T1554|Compromise Client Software Binary|Changes a library used by OpenSSH binaries|\n|Defense Evasion|T1027|Obfuscated Files or Information|Strings are XOR encrypted|\n|Defense Evasion|T1562|Impair Defenses|Disables logging on target|\n|Credential Access|T1556|Modify Authentication Process|Attackers can login used a well-crafted password|\n|Collection|T1056.004|Input Capture: Credential API Hooking|Steals legit passwords|\n|Command And Control|T1071.004|Application Layer Protocol - DNS|Performs DNS requests|\n|Command And Control|T1568.002|Dynamic Resolution: Domain Generation Algorithms|Uses a DGA to generate C&C|\n\n\n-----\n\nTLP: White\n### Indicators of Compromise\n\n##### Hashes\n```\n  v1.7.2\n   171DC0A24A59CDFDA8135F766D973399\n   70F238D148CC68F302D6572CCF4E06D5D7AD85D8 \n   25EB6B951A7FEF71899907D726AC608EAAED6AE5495C308BF51E7F70E12BA49F\n  v1.7.3\n   6144F41503D7CDF5D9469EA024237507\n   44B04CFC095F93D17B1BD4F8820C16843FCBAC3E\n   998F74471BB96102781EB62713F57483DC6A6D1F27C429A957EB23BB124D7709\n\n```\n\n##### IPs\n```\n  78.140.134[.]7\n  78.140.134[.]9\n  179.43.160[.]69\n  45.89.189[.]179\n  193.0.179[.]76\n\n C2\na6mvk2yrwx[.]biz k2yrwxenct[.]biz\na6mvk2yrwx[.]info k2yrwxenct[.]info\na6mvk2yrwx[.]net k2yrwxenct[.]net\naf1libghu4sd[.]biz libghu4sdaz[.]biz\naf1libghu4sd[.]info  libghu4sdaz[.]info\naf1libghu4sd[.]net libghu4sdaz[.]net\nalibghu4sd[.]biz mvk2yrwxenct[.]biz\nalibghu4sd[.]info mvk2yrwxenct[.]info\nalibghu4sd[.]net mvk2yrwxenct[.]net\namvk2yrwxen[.]biz nctqjop3f[.]biz\namvk2yrwxen[.]info nctqjop3f[.]info\namvk2yrwxen[.]net nctqjop3f[.]net\nasdaz56mv[.]biz op3f1libgh[.]biz\nasdaz56mv[.]info op3f1libgh[.]info\nasdaz56mv[.]net op3f1libgh[.]net\nayrwxenctqj[.]biz p3f1libghu4[.]biz\nayrwxenctqj[.]info p3f1libghu4[.]info\nayrwxenctqj[.]net p3f1libghu4[.]net\naz56mvk2yrwx[.]biz qjop3f1libgh[.]biz\naz56mvk2yrwx[.]info  qjop3f1libgh[.]info\naz56mvk2yrwx[.]net qjop3f1libgh[.]net\nbghu4sdaz[.]biz rwxenctqj[.]biz\nbghu4sdaz[.]info rwxenctqj[.]info\n\n```\n\n-----\n\nTLP: White\n```\nbghu4sdaz[.]net rwxenctqj[.]net\nctqjop3f1l[.]biz sdaz56mvk2[.]biz\nctqjop3f1l[.]info sdaz56mvk2[.]info\nctqjop3f1l[.]net sdaz56mvk2[.]net\ndaz56mvk2yr[.]biz tqjop3f1lib[.]biz\ndaz56mvk2yr[.]info tqjop3f1lib[.]info\ndaz56mvk2yr[.]net tqjop3f1lib[.]net\nenctqjop3f1l[.]biz u4sdaz56mvk2[.]biz\nenctqjop3f1l[.]info  u4sdaz56mvk2[.]info\nenctqjop3f1l[.]net u4sdaz56mvk2[.]net\nf1libghu4[.]biz vk2yrwxen[.]biz\nf1libghu4[.]info vk2yrwxen[.]info\nf1libghu4[.]net vk2yrwxen[.]net\nghu4sdaz56[.]biz wxenctqjop[.]biz\nghu4sdaz56[.]info wxenctqjop[.]info\nghu4sdaz56[.]net wxenctqjop[.]net\nhu4sdaz56mv[.]biz xenctqjop3f[.]biz\nhu4sdaz56mv[.]info xenctqjop3f[.]info\nhu4sdaz56mv[.]net xenctqjop3f[.]net\nibghu4sdaz56[.]biz yrwxenctqjop[.]biz\nibghu4sdaz56[.]info  yrwxenctqjop[.]info\nibghu4sdaz56[.]net yrwxenctqjop[.]net\njop3f1lib[.]biz z56mvk2yr[.]biz\njop3f1lib[.]info z56mvk2yr[.]info\njop3f1lib[.]net z56mvk2yr[.]net\n\n##### Yara rule\n  1. rule Linux_Ebury_172_173_Apr2021 { \n  2.  meta:\n  3.   description = \"Detects Linux/Ebury 1.7.2-3\"\n  4.   date = \" 2021\"\n  5.   author = \"CSIRT Italy\"\n  6.  strings:\n  7.   $a1 = \"ctors\"\n  8.   $a2 = \"seccomp_load\"\n  9.   $a3 = \"popen\"\n  10.   $a4 = \"system\"\n  11.   $a5 = \"keyctl_\"\n  12.  condition:\n  13.   uint32(0) == 0x464c457f // Generic ELF header\n  14. and uint8(16) == 0x0003 // Shared object file\n  15. and all of them \n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.acn.gov.it/portale/documents/20119/586040/CSIRT_Italiano_Windigo_Ebury_Variant.pdf"
    ],
    "report_names": [
        "CSIRT_Italiano_Windigo_Ebury_Variant.pdf"
    ],
    "threat_actors": [
        {
            "id": "3844202f-b24a-4e16-b7b9-dfe8c0a44d5d",
            "created_at": "2022-10-25T16:07:24.526179Z",
            "updated_at": "2025-03-27T02:02:10.27234Z",
            "deleted_at": null,
            "main_name": "Operation Windigo",
            "aliases": [],
            "source_name": "ETDA:Operation Windigo",
            "tools": [
                "CDorked",
                "CDorked.A",
                "Calfbot",
                "Ebury"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1934b371-2525-4615-a90a-772182bc4184",
            "created_at": "2022-10-25T15:50:23.396576Z",
            "updated_at": "2025-03-27T02:00:55.460522Z",
            "deleted_at": null,
            "main_name": "Windigo",
            "aliases": [
                "Windigo"
            ],
            "source_name": "MITRE:Windigo",
            "tools": [
                "Ebury"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1737684333,
    "ts_updated_at": 1743041630,
    "ts_creation_date": 1618916853,
    "ts_modification_date": 1618916853,
    "files": {
        "pdf": "https://archive.orkl.eu/0c7a21f107e42339587a2e2a3014b059afb70404.pdf",
        "text": "https://archive.orkl.eu/0c7a21f107e42339587a2e2a3014b059afb70404.txt",
        "img": "https://archive.orkl.eu/0c7a21f107e42339587a2e2a3014b059afb70404.jpg"
    }
}