{
    "id": "a7cec489-40f2-4383-b3ec-964753f382ed",
    "created_at": "2023-01-12T15:04:11.321156Z",
    "updated_at": "2025-03-27T02:05:38.428406Z",
    "deleted_at": null,
    "sha1_hash": "fc579ee17f2fdd08e1e71aafb779529c9cbe7f1a",
    "title": "2020-06-19 - zloader- VBA, R1C1 References, and Other Tomfoolery",
    "authors": "",
    "file_creation_date": "2022-05-28T03:31:48Z",
    "file_modification_date": "2022-05-28T03:31:48Z",
    "file_size": 823293,
    "plain_text": "# zloader: VBA, R1C1 References, and Other Tomfoolery\n\n**[clickallthethings.wordpress.com/2020/06/19/zloader-vba-r1c1-references-and-other-tomfoolery/](https://clickallthethings.wordpress.com/2020/06/19/zloader-vba-r1c1-references-and-other-tomfoolery/)**\n\nView all posts by Jamie June 19, 2020\n\nThe other day, [@reecDeep tweeted about new behavior from zloader documents. Another](https://twitter.com/reecdeep/status/1273665225070444548)\ndocument from the same campaign crossed my path and I decided to take a crack at it.\n\n**[order_93711.xls](https://app.any.run/tasks/a03dbd65-7949-4570-8ebf-89c060244b46)**\n\nSHA256:\nB29C145D4B78DAED34DEA28A0A11BAB857D5583DC6A00578A877511D0D01D3D2\n\nURLS:\n\nhttps[:]//wireborg.com/wp-keys.php\n\nhttp[:]//zmedia.shwetech.com/wp-keys.php\n\nhttps[:]//datalibacbi.ml/wp-keys.php\n\nhttps[:]//procacardenla.ga/wp-keys.php\n\n## Row and Column References\n\nOne of the first things you may notice is that this document doesn’t have the typical letters\ndesignating the columns. Instead, this document is using the R1C1 reference style. This was\nnot done by accident. The Excel 4.0 macros used throughout this document depend upon\nthis format.\n\n\n-----\n\n## Getting around Enable content\n\nThe first sticking point was getting the ability to control execution of the macro. This proved\nto be a bit difficult. If the ‘Enable Content’ button is showing up, this means that some\nmacros must exist, right? However, the VBAProject contents showed both Sheet1 and\nThisWorkbook as blank.\n\nSo there were no macros… yet we were still being prompted to enable them. If you did\nenable them, the macro would execute with no opportunity to interrupt anything before the\ndocument would close. I decided to add a simple macro to the project to see if that would\nhelp me control execution.\n\nI noticed that when I saved my changes, the size of the document changed.\n\nOpening the copy while holding down the shift key brought up this security notification.\nChoosing “Enable Macros” allowed me to control execution and continue the analysis.\n\n\n-----\n\n## Finding the Entry Point – R27455C174\n\nAs this is an XLM 4.0 macro document, the macro commands in the cells will execute\nsequentially until the commands send execution path elsewhere. Possible commands for\nwhich to search would be =FORMULA or =GOTO. I started by searching for =FORMULA.\nOnce I found one, I started to step through the macro code to see what would happen. It took\na few tries, but the entry point for this document is R27455C174. From here, you can rightclick that cell and select Run.\n\nWe can also see how this document makes use of the R1C1 notation. From what I\nunderstand so far, a positive number means you add that number of rows/cells to the current\nrow/cell, and a negative number means you subtract that number of rows/cells to the current\nrow/cell. In this case, it seems that the row being referenced is 51762 rows down and 81\ncolumns to the left. However, I tried going to that cell but found it to be empty. I might be\nmissing something obvious, but in the grand scheme of things, knowing exactly how this\n_particular cell works is more of an academic exercise._\n\nEither way, you could just right-click on the cell, choose Run, Step Into, and then Evaluate a\nfew times get the code execution rolling. You’ll see that =GOTO(”) ends up moving you to cell\nR46304C95.\n\n## BLOCK 1 – R46304C95\n\n\n-----\n\nThis cell is where characters from other cells are assembled into a string. We can see that\nthe first one is “=CLOSE(FALSE)”. We can continue evaluating all of these until we get to the\n=GOTO() at the bottom.\n\n## BLOCK 2 – R48037C63\n\nThat =GOTO() takes us to R48037C63. This cell fills in the cells below with the same string.\nThe commands in the following cells take the strings from Block 1 and write them to a new\nlocation. For example, let’s look at R48038C63. It says to take the information in a cell that is\n1734 rows up and 32 columns to the right and move it 14892 rows up and 20 columns to the\nleft. This continues on until the =GOTO() at the bottom of this block.\n\n## BLOCK 3 – R33147C43 – Evasion checks\n\n\n-----\n\nThe next block starts at R33147C43. It contains everything that was written above. Let s\nanalyze it in pieces. The first portion contains the familiar sandbox checks. Notice how if any\nof those checks fail, you GOTO(R33146C43). That cell contains =CLOSE(FALSE) which\nimmediately stops execution.\n\nA .vbs file is then created in the C:\\Users\\Public folder. The lines in cells 33160-65 are\nwritten to that file which is then closed.\n\nThe next section executes the .vbs file. This file reads information from the system registry\ncontaining VBAWarnings. The output is returned to the .txt file. The .vbs file is then deleted,\nthe .txt file is opened, read, and deleted. If the .txt file contains a 1, go back to\n=CLOSE(FALSE). If not, check environment. If it has a 32 in the results (which it does),\nGOTO(R13419C196).\n\n## BLOCK 4 – R13419C196\n\nThis brings us to yet another series of cells getting assembled into strings. We can step\nthrough them as before to the =GOTO(”).\n\n\n-----\n\n## BLOCK 5 – R28840C118\n\nOnce again, this block takes the strings from above and copies them elsewhere.\n\n## BLOCK 6 – R38562C99\n\nAnd finally, we can see the final execution commands in this document. There are four URLs\nfrom which to download a file to C:\\Users\\Public\\lxlGZ4A.html and execute it using\nrundll32.exe. Notice that if it fails the size check, it doesn’t go through the rest of the URLs.\nInstead, it immediately jumps down to the ALERT message. I’m guessing this helps to hide\nthe rest of the URLs from showing up in Wireshark or something.\n\n\n-----\n\n## CONCLUSION\n\nMany of the sandbox evasion techniques used are the same as before. The added difficulty\nwas the use of (nonexistent) VBA macros, more ways to disguise the commands being run,\nand ways to hide the other URLs.\n\nAs always, thanks for reading.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-19 - zloader- VBA, R1C1 References, and Other Tomfoolery.pdf"
    ],
    "report_names": [
        "2020-06-19 - zloader- VBA, R1C1 References, and Other Tomfoolery.pdf"
    ],
    "threat_actors": [
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535851,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653708708,
    "ts_modification_date": 1653708708,
    "files": {
        "pdf": "https://archive.orkl.eu/fc579ee17f2fdd08e1e71aafb779529c9cbe7f1a.pdf",
        "text": "https://archive.orkl.eu/fc579ee17f2fdd08e1e71aafb779529c9cbe7f1a.txt",
        "img": "https://archive.orkl.eu/fc579ee17f2fdd08e1e71aafb779529c9cbe7f1a.jpg"
    }
}