{
    "id": "a8abd841-a9d1-4128-9f4a-f8b596dacec3",
    "created_at": "2023-01-12T15:05:52.860662Z",
    "updated_at": "2025-03-27T02:09:18.377336Z",
    "deleted_at": null,
    "sha1_hash": "88a7c9c5a7625d18ec6831ed8bc31da6c95a8d3d",
    "title": "2022-02-15 - Increase in Emotet Activity and Cobalt Strike Deployment",
    "authors": "",
    "file_creation_date": "2022-05-29T00:53:17Z",
    "file_modification_date": "2022-05-29T00:53:17Z",
    "file_size": 251361,
    "plain_text": "# Increase in Emotet Activity and Cobalt Strike Deployment\n\n**[esentire.com/blog/increase-in-emotet-activity-and-cobalt-strike-deployment](https://www.esentire.com/blog/increase-in-emotet-activity-and-cobalt-strike-deployment)**\n\n[Adversaries don’t work 9-5 and neither do we. At eSentire, our 24/7 SOCs are staffed with](https://www.esentire.com/what-we-do/security-operations-center)\nElite Threat Hunters and Cyber Analysts who hunt, investigate, contain and respond to\nthreats within minutes.\n\nWe have discovered some of the most dangerous threats and nation state attacks in our\nspace – including the Kaseya MSP breach and the more_eggs malware.\n\nOur Security Operations Centers are supported with Threat Intelligence, Tactical Threat\nResponse and Advanced Threat Analytics driven by our Threat Response Unit – the TRU\nteam.\n\nIn TRU Positives, eSentire’s Threat Response Unit (TRU) provides a summary of a recent\nthreat investigation. We outline how we responded to the confirmed threat and what\nrecommendations we have going forward.\n\n**Here’s the latest from our TRU Team…**\n\n## What did we find?\n\n\n-----\n\nWe found Emotet, a former banking malware, now focused on loading or delivering\nfollow-on malware.\n\n[Emotet was disrupted in early 2021 but made a comeback in November 2021.](https://www.esentire.com/security-advisories/emotet-activity-identified)\nHistorically, Emotet has installed malware such as Trickbot or Qakbot, which in\nturn have led to hands-on-keyboard adversaries and ransomware deployment.\n[In December 2021, researchers closely monitoring Emotet reported instances of the](https://twitter.com/Cryptolaemus1/status/1468266929014157316)\nmalware deploying the Cobalt Strike intrusion tool.\n[In February 2022, other researchers have reported Cobalt Strike deployment within 5](https://isc.sans.edu/forums/diary/Example+of+Cobalt+Strike+from+Emotet+infection/28318/)\nhours of an Emotet infection originating from the Epoch 5 botnet.\nThe direct deployment of the intrusion tool is a concern considering its use in handson-intrusions linked to ransomware deployment and extortion attacks.\n\nDeploying the tool directly expedites network intrusion actions, requiring\ndefenders to act swiftly to contain patient zero or risk the attacker expanding the\nscope of their access.\neSentire security teams have identified and disrupted multiple Emotet infections across\nour customers in recent weeks, none of which escalated to Cobalt Strike deployment.\nThese incidents followed the typical Emotet trajectory with macro-laced office files\narriving via email resulting in code execution through VBScript and PowerShell.\n\n## How did we find it?\n\nRecent activity has been identified through a mix of threat hunting activity and\ndetections from BlueSteel, our machine-learning PowerShell classifier.\n\n## What did we do?\n\nIn instances where Emotet activity was identified, our team of 24/7 SOC Cyber\nAnalysts isolated the host(s) and worked with the customer to remediate the threat.\nTRU deployed additional detection content based on the analysis of recent incident\nobservations.\n\n## What can you learn from this TRU positive?\n\nGiven the threat of the direct deployment of Cobalt Strike, rapid identification and\ncontainment of hosts infected with Emotet is critical now more than ever.\nInfected systems should be examined for presence of Cobalt Strike or other follow-on\nmalware. Emotet stores a copy of itself and Cobalt Strike in\nC:\\Users\\user\\AppData\\Local\\Temp\\random-directory-name\\.\n\n## Recommendations from our Threat Response Unit (TRU) Team:\n\nLoader malware attempts to install other malware, so the first priority should be to identify\nand investigate the presence of follow-on malware on systems. In addition, we recommend:\n\n\n-----\n\nEmploy email filtering and protection measures.\n\nBlock or quarantine email attachments such as EXEs, Password Protected ZIPs,\nJavaScript, Visual Basic scripts.\nImplement anti-spoofing measures such as DMARC and SPF.\nEmploy an MFA solution to reduce impact of compromised credentials.\nTrain users to identify and report suspicious emails and documents, even if\nopened.\nProtect your endpoints against malware.\n\nEnsure antivirus signatures are up to date.\nUse a Next-Gen AV (NGAV) or Endpoint Detection and Response (EDR) product\nto detect and contain threats.\nLimit or disable macros across the organization. See UK's National Cyber\nCentre guidance on Macro Security.\n\n## Ask Yourself…\n\nIs your malware identification and remediation process agile enough to disrupt followon attacks stemming from loader malware?\n\nIf you’re not currently engaged with a Managed Detection and Response provider, we highly\nrecommend you partner with us for security services in order to disrupt threats before they\nimpact your business.\n\n[Want to learn more? Connect with an eSentire Security Specialist.](https://www.esentire.com/get-started)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-15 - Increase in Emotet Activity and Cobalt Strike Deployment.pdf"
    ],
    "report_names": [
        "2022-02-15 - Increase in Emotet Activity and Cobalt Strike Deployment.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535952,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653785597,
    "ts_modification_date": 1653785597,
    "files": {
        "pdf": "https://archive.orkl.eu/88a7c9c5a7625d18ec6831ed8bc31da6c95a8d3d.pdf",
        "text": "https://archive.orkl.eu/88a7c9c5a7625d18ec6831ed8bc31da6c95a8d3d.txt",
        "img": "https://archive.orkl.eu/88a7c9c5a7625d18ec6831ed8bc31da6c95a8d3d.jpg"
    }
}