{
    "id": "a8c6d37f-9232-4906-94fd-6b908ebeb582",
    "created_at": "2022-10-25T16:48:22.208215Z",
    "updated_at": "2025-03-27T02:16:44.319604Z",
    "deleted_at": null,
    "sha1_hash": "3d59c8aa0a808193f9f5676f07f2e7a5c64fbee5",
    "title": "“Beijing One Pass” Employee Benefits Software Exhibits Spyware Characteristics",
    "authors": "",
    "file_creation_date": "2021-07-29T10:50:26Z",
    "file_modification_date": "2021-07-29T10:54:26Z",
    "file_size": 1699033,
    "plain_text": "### CYBER\n\n THREAT\n\n ANALYSIS By Insikt Group®\n\n**CHINA**\n\nJuly 29, 2021\n\n# “Beijing One Pass” Employee Benefits Software Exhibits\n\n\n-----\n\n#### Executive Summary\n\nA Recorded Future client provided information to\nInsikt Group relating to a potential security incident\ntriggered by a software application called “Beijing One\nPass”. This Chinese government-backed application\nenables access to state benefits information and was\ndownloaded by employees of the Recorded Future\nclient after they were informed that paper copies of the\ninformation would no longer be available.\n\nInsikt Group independently verified that the installed\napplication exhibits characteristics consistent with\npotentially unwanted applications (PUA) and spyware.\nThe software is associated with the Beijing Certificate\nAuthority (北京数字认证股份有限公司), which is a Chinese\nstate-owned enterprise (BJCA, www.bjca[.]cn).\n\nSome notable suspicious behaviors relate to several\ndropped files and subsequent processes initiated from\nthe primary application. These behaviors include a\npersistence mechanism, the collection of user data such\nas screenshots and keystrokes, a backdoor functionality,\nand other behaviors commonly associated with malicious\ntools, such as disabling security and backup-related\nservices.\n\nWe cannot confirm the intent behind Beijing One\nPass’s containing spyware-like capabilities; however,\nthe presence of software with similar spyware-like\nfunctionality, developed by at least one other Chinese\nregion, the Shaanxi CA, is notable. These capabilities\ncould be evidence of a deliberate attempt to gain access\n[to devices (such as in support of China’s Cybersecurity](https://www.recordedfuture.com/china-cybersecurity-measures/)\n[Law that allows security organizations to inspect](https://www.recordedfuture.com/china-cybersecurity-measures/)\ncorporate networks remotely), the result of lax security\npractices by the certificate authorities (CA) and\ndevelopers, or features designed to comply with Chinese\nlaws and regulations.\n\n\nWhatever the motive, installing such software\non devices that have access to sensitive data is not\nadvised. Recorded Future recommends that companies\nwith China-based employees who need access to state\nbenefit information using “One Pass” software not use\nit on devices with access to sensitive corporate data.\n\n#### Analysis\n\nDuring preliminary analysis, Insikt Group found that\nthe “Beijing One Pass” PC client exhibits behaviors\nsimilar to spyware applications. The software contains\nbuilt-in functionality that, taken in aggregation, raise\nconsiderable suspicions about the implication of its data\ncollection capabilities:\n\n  - Ability to autorun at Windows startup to ensure\n\npersistence\n\n  - Checking periodically for human interaction with\n\nthe operating system as the file is run\n\n  - Attempting to read, create, or modify system\n\nregistry ROOT certificates\n\n  - Disabling security and backup services on the\n\nhost device\n\n  - Allowlisting domains for ActiveX use, which\n\npotentially allows it to connect to additional\ninternet resources\n\n  - Reading data from the clipboard\n\n  - Recording screenshots\n\n  - Capturing and retrieving keystrokes\n\nThere is also some indication that the file contains\nbackdoor functionality to open a port and listen for\nincoming connections. This functionality is present in\na driver that accompanies the CertAppEnv installation\ncalled “wmControl.exe”. We also observed anti-analysis\ncapability within the application, which is typically\nassociated with malware.\n\n\n-----\n\nBased on data provided by the Recorded Future client, the\n“Beijing One Pass” application requires the installation of the\n“Certificate Application Environment” software. This software\nappears to be developed by the Chinese state-owned enterprise\nBeijing Certificate Authority (北京数字认证股份有限公司). Upon\ninstallation of the One Pass PC client, the subsequent process\ntree that is spawned is detailed in Figure 1 and was investigated\nfurther by Insikt Group analysts.\n\n##### “Beijing One Pass” Process Tree\n\n_Figure 1: Investigated process tree for Beijing One Pass application (Source: Recorded Future client)_\n\n\n##### Stage 1 — Services.exe\n\nThe parent process, services.exe, is a benign executable\nfound on Windows machines that launches the Services Control\nManager, responsible for starting, interacting with, and ending\nservices. Common processes such as svchost.exe and taskhost.\nexe are often spawned by services.exe. This particular version\nof services.exe was first released by Microsoft on April 13, 2021,\nin a Windows 10 security update (KB5001337), indicating that\nthe One Pass process infection chain may have been adapted\nsince then to include this file as the initial loader.\n\n\n-----\n\n##### Stage 2 — BJCAUpdate.exe\n\nBJCAUpdate.exe was spawned from the parent services.\nexe process, which led to the execution of the subsequent\nCertAppEnv_UpdateV2.14.2toV2.14.3.exe file that contained\nPUA-like functionality. BJCAUpdate.exe is detected by several\nAV engines in a malware multiscanner repository as suspected\nBoxore adware. The file was first seen in the wild in February\n2017 and has been observed with several different file names:\n\n  - [bjcaupdate.exe](https://www.virustotal.com/gui/search/name%253Abjcaupdate.exe)\n\n  - [BJCAUpdate.exe](https://www.virustotal.com/gui/search/name%253ABJCAUpdate.exe)\n\n  - [lWiOzQzFiNaJbRvUvVtR](https://www.virustotal.com/gui/search/name%253AlWiOzQzFiNaJbRvUvVtR)\n\n  - [BJCA Update](https://www.virustotal.com/gui/search/name%253A%2522BJCA%2520Update%2522)\n\n  - [BJCACrashHandler.exe](https://www.virustotal.com/gui/search/name%253ABJCACrashHandler.exe)\n\n  - [bjcacrashhandler.exe](https://www.virustotal.com/gui/search/name%253Abjcacrashhandler.exe)\n\n  - [gKARRFUVz.xlsx](https://www.virustotal.com/gui/search/name%253AgKARRFUVz.xlsx)\n\nThe file is signed with a code-signing certificate issued by\nthe Beijing Certificate Authority (BJCA, www.bjca[.]cn). BJCA\nis a leading provider of information security solutions in China,\nand one of its key business lines is digital certification services.\n\nThree separate files, all tagged as malicious by AV engine\nvendors, had also dropped the same BJCAUpdate.exe file\npreviously:\n\n - BJCAUpdateSetup.exe\n\n  - Certappenv_setupv3.3.01.19082.exe\n\n - BJCAV2.14.exe\n\n[BJCAUpdateSetup.exe, flagged as adware by AV engines,](https://www.virustotal.com/gui/file/1c03f092ea658270e295806ec1c07c84e12e4520b4344eb60aeeb6ae227fe8c4)\ndrops several additional temporary files that attempt to call out\nto update.bjca.org[.]cn, tied to the BJCA certificate authority.\nSeveral subdomains associated with bjca.org[.]cn have been\n[flagged in public sandboxing services and open source material](https://any.run/report/0c01c0f0aae269a6adfbdab8f6e4329f7946ccc17fee99321bcca51345493430/ef37fa17-1b73-4b36-a797-be458d1cd386)\nas being affiliated with malicious potentially unwanted application\n[(PUA) activity, including in an application called BjTax analyzed](https://www.sophos.com/en-us/threat-center/threat-analyses/adware-and-puas/BjTax/detailed-analysis.aspx)\nby Sophos.\n\n[File BJCAV2.14.exe is picked up by Microsoft as a PUA, labeling](https://www.virustotal.com/gui/file/bed0d1139adcec9292841b7315289bb43960f2c7a4ff1bbab536528b1317b075)\nthe file as PUA:Win32/ZfkeyMonitoring. This “ZfkeyMonitoring”\nsignature is likely linked to the “zfkeymonitor.exe” file, which\n[open source information indicates could be a signed loader used](https://jyj850714.tistory.com/152)\nto deploy malware onto networks.\n\n\nAdditionally, a file on public malware sandboxing service\n[HybridAnalysis entitled “一证通客户端“ (“One Pass Client”), also](https://www.hybrid-analysis.com/search?query=context:a94d56067aa15f28f66a139eecc90e49b008bfa1f0faf7d65721ecfb68a6a6a2&block_redirect=1)\ntagged as “ZFKeyMonitor”, has a significant functional overlap with\nBJCAV2.14.exe. The sandbox report lists 2 hostnames contacted\nby the application when executed: old.snca[.]com[.]cn and cayzt.\nsnyzt[.]org. A spawned child process file path containing the\nstring “snca.reg” was also observed. These hostnames relate\nto the Shaanxi Provincial Digital Certificate Certification Center\n(Shaanxi CA or SNCA for short), an electronic certification\n[service organization established per the “Electronic Signature](http://www.asianlii.org/cn/legis/cen/laws/lotprocoes516/)\n[Law of the People’s Republic of China” (《中华人民共和国电子签名](http://www.asianlii.org/cn/legis/cen/laws/lotprocoes516/)\n法》). The sample calls out to the domain uniplatform[.]snyzt[.]\n[org, which is also linked to the same Shaanxi CA organization,](https://webcache.googleusercontent.com/search?q=cache:m-po6pxhn18J:https://m.ddrjxz.com/wlrj/wlqt/103373.html+&cd=2&hl=en&ct=clnk&gl=us)\nspecifically the Shaanxi Enterprise Digital Certificate “One-Pass\nClient” (陕西省企业数字证书一证通客户端).\n\nThe file can read RDP-related keys and open the clipboard\nand retrieve keystrokes, as well as POST files to a webserver.\nThe filename, “一证通客户端”, translates to “One Pass Client”,\nsimilar to the colloquially named “Beijing One Pass” application\nthat the employees of the Recorded Future client have been\nasked to install. A child process spawned from “一证通客户端”\ninitiates a further installation — this time, an application called\nUniClient.exe:\n\n_[Figure 2: Setup window for UniClient.exe (Source: Hybrid Analysis)](https://www.hybrid-analysis.com/sample/a94d56067aa15f28f66a139eecc90e49b008bfa1f0faf7d65721ecfb68a6a6a2?environmentId=100)_\n\n\n-----\n\n##### Stage 3 — CertAppEnv_UpdateV2.14.2toV2.14.3.exe\n\nP e r c l i e n t - p r o v i d e d d a t a, “ C e r t A p p E n v_\nUpdateV2.14.2toV2.14.3.exe” was spawned from “BJCAUpdate.\nexe” and is almost certainly an installer for the “Certificate\nApplication Environment” software developed by BJCA\nbased on a comparison of the filename, functionality, and\nshared artifacts such as the file import hash (imphash:\n7fa974366048f9c551ef45714595665e). AV engines tag this file\nas malicious in malware multiscanner repositories, specifically as\n“PUA.ZfkeyMonitoring!8.F694”, further indicating “zfkeymonitor.\nexe” involvement.\n\nOther suspicious characteristics of the process include\ninstalling itself to autorun at Windows startup to ensure\npersistence and checking for human interaction with the\noperating system as the file is run. The process also attempts\nto connect to domain time.bjca[.]org[.]cn due to the presence\nof the BJCA code signing certificate in the file.\n\n_Figure 3: Setup window for the “Certificate Application Environment V2.14.1” installer (Source:_\n_[AlienVault OTX)](https://otx.alienvault.com/indicator/file/d9c3f00e4351fff1aba9e72b320dbecdbcb001f553ba3ce3401e7c6f1a471469)_\n\nPivoting through malware multiscanner repositories,\nit is clear that there are dozens if not more versions of both\n“BJCAUpdate.exe” and “CertAppEnv_Update” in circulation.\nWhile some appear to be benign based on clean verdicts from AV\nengines, a significant proportion trigger AV for PUA or spyware\napplications based on behavioral malware analysis of the files.\nThe varying AV detections for different versions could be due\nto inconsistent overly restrictive signaturing methods or could\nindicate that certain functionality was introduced into updated\nsoftware versions that forced the AV engine detections.\n\n\nFor example, file CertAppEnv_SetupV2.14.1.exe (see Figure\n3) is a previous version of the same “Certificate Application\nEnvironment” installer that attempted to read, create, or modify\nsystem registry ROOT certificates as shown in Table 1, which\n[contributed towards a malicious verdict by malware sandboxing](https://otx.alienvault.com/indicator/file/d9c3f00e4351fff1aba9e72b320dbecdbcb001f553ba3ce3401e7c6f1a471469)\n[service](https://otx.alienvault.com/indicator/file/d9c3f00e4351fff1aba9e72b320dbecdbcb001f553ba3ce3401e7c6f1a471469)\n\n\n-----\n\nEC98F4A5096282FB192FFB168A574236C5A7DC6C\\Blob\n\n_[Table 1: Read and write actions conducted on Windows Registry ROOT certificates upon installation of “Certificate Application Environment V2.14.1 (Source: Alienvault OTX)](https://otx.alienvault.com/indicator/file/d9c3f00e4351fff1aba9e72b320dbecdbcb001f553ba3ce3401e7c6f1a471469)_\n\n|Windows Registry Status|Windows Registry Key|\n|---|---|\n|Read|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\23\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,- 103|\n|Read|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab. dll,-8042|\n|Read|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\23\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab. dll,-8042|\n|Read|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,- 103|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\ Certificates\\0e7559ecd1a8793fc2f78628328a60bb8b728150\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\ Certificates\\81C240D9A20887F3FBE596BB314882E7EE76691A\\Blob|\n|Write|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab. dll,-8042|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ DC3D7D38C1C26CCF6AAA1BA52FB448F5ED3B4431\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ B1BC968BD4F49D622AA89A81F2150152A41D829C\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ DE28F4A4FFE5B92FA3C503D1A349A7F9962A8212\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ A71052B091253A90CA3D423C8A1C0D56E75939AF\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\ Certificates\\5070a0e2fa1db04c2ed63461ece36307ab3a863b\\Blob|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ B4ED58F24E2D40B68DA3BB6D5FD2453BDCF3CAF4\\Blob|\n|Write|HKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,- 103|\n|Write|HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\ EC98F4A5096282FB192FFB168A574236C5A7DC6C\\Blob|\n\n\n-----\n\n##### Stage 4 — CertAppEnv_ForUpdate_ SetupV2.14.2toV2.14.3.exe\n\nThe child process “Cer tAppEnv_ForUpdate_\nSetupV2.14.2toV2.14.3.exe” is spawned by CertAppEnv_\nUpdateV2.14.2toV2.14.3.exe and exhibits malicious properties\nsuch as backdoor functionality and keystroke capture.\n\nFirst, the file attempts to disable security and backup-related\nservices on the host device. It then allowlists domains for ActiveX\nuse, which potentially allows it to connect to additional internet\nresources. Despite the vast reduction in support for ActiveX\ncontrols due to a proliferation of related application abuse, it\nis still an optional extension available for Google Chrome, and\nMicrosoft continues to include it within Internet Explorer 11 while\npromoting Microsoft Edge as its primary browser.\n\nSecond, the file contains functionality to open a port and listen\nto incoming connections, typically associated with backdoor\ncapabilities. This is present in a driver that accompanies the\nCertAppEnv installation called “wmControl.exe”.\n\nThe application can also read data from the clipboard, record\nscreenshots, and capture and retrieve keystrokes. This behavior\nis considered suspicious for a benefits software application.\nFinally, the application has some anti-analysis capabilities, which\nare typically associated with malware. The dropped executable\nfile also contains functionality to detect sandboxes, such as\nchecking for mouse cursor movement or introducing arbitrary\nsleep commands to hinder dynamic analysis.\n\n\n##### Stage 5 — RegSvr32_x86.exe\n\nBoth RegSvr32_x86.exe and RegSvr32_x64.exe are dropped\nby the “CertAppEnv_ForUpdate_SetupV2.14.2to2.14.3.exe”\nprocess. The 2 files were created within 8 seconds of each\nother, shared the same contained resource hashes, and were\nconfigured with identical code signing certificates named “北\n京数字认证股份有限公司” (serial number: 11 21 8E A9 71 3D BB\nAE 32 7B 49 15 AA 3D 7F CD 15 81), which strongly points to\nthem being closely-linked, renamed versions of the Windows\ncommand-line utility RegSvr32. RegSvr32 is typically used to\nregister and unregister DLLs and ActiveX controls in the Windows\nRegistry. Renaming this utility is a red flag in most instances, as\nthis technique can be employed to bypass application controls\non a host operating system or hide the utility. The locations of\nthe 2 renamed RegSvr32 instances are as follows:\n\n  - C:\\Program Files (x86)\\BJCAClient\\CertAppEnvV2.14.3\\\n\nBjcaCertAide\\RegSvr32_x86.exe\n\n  - C:\\Program Files (x86)\\BJCAClient\\CertAppEnvV2.14.3\\\n\nProgram\\RegSvr32_x64.exe\n\n\n-----\n\n#### Outlook\n\nIt remains to be seen if this new policy change is corroborated\nby other international companies based in China, but the potential\nramifications of having employees install state-backed software\nthat exhibits spyware-type characteristics raise concern.\n\nGiven the exceptional circumstances brought about by the\nCOVID-19 pandemic and the need for governments to devise\nnew policy and benefit programs to support their citizens during\nlockdowns, introducing digital platforms to manage state benefits\nis a reasonable step to reduce inefficiencies. However, Recorded\nFuture’s analysis of “Beijing One Pass” and associated software\nintrinsically tied to Provincial/Municipality certificate authorities\nin China highlights suspicious spyware-like functionalities that\ninclude a persistence mechanism, collection of user data such as\nscreenshots and keystrokes, backdoor functionality, and other\nbehaviors commonly associated with malicious tools, such as\ndisabling security and backup-related services.\n\nWhile we cannot confirm the intent behind Beijing One Pass\ncontaining spyware-like capabilities, installing such software\non devices that have access to sensitive data is not advised.\nRecorded Future recommends that companies with Chinabased employees who need access to state benefit information\nusing “One Pass” software not use it on devices with access to\nsensitive corporate data.\n\n\n-----\n\n#### Appendix A — Indicators\n\n\nHost Indicators\n\nSHA256: 1ade2588a552f715758ed74cf0c6da2bac5eeaafde27cb9e74cf14e56f1c7f12 - services.exe\n\nSHA256: 4b6539eaebc10c14605f61e709be08f0246cec46f2662c496db8b2847aa4c887 - BJCAUpdate.exe\n\nSHA256: 918d6561fea3589a050e2462a488df82418811c00b72fe8997c991765864b1d0 - CertAppEnv_UpdateV2.14.2toV2.14.3.exe\n\nSHA256: 4fe2e6d9686df2cbde98f78297c3b5640c743832812aed2a729213072cb3ab6f - CertAppEnv_ForUpdate_SetupV2.14.2to2.14.3.exe\n\nSHA256: 44e16d47c0ed74b28b7b3dfa3679a1db01f034b2a9108ea3bc2237125ddd52bd - RegSvr32_x86.exe\n\nSHA256: D9c3f00e4351fff1aba9e72b320dbecdbcb001f553ba3ce3401e7c6f1a471469 - CertAppEnv_SetupV2.14.1.exe\n\nSHA256: 6DC9413628655092E93EBE970C8A9E4D2CBD07B69B5B18BBD483508BB96AA7B3 - RegSvr32_x64.exe\n\n[SHA256: 1c03f092ea658270e295806ec1c07c84e12e4520b4344eb60aeeb6ae227fe8c4 - BJCAUpdateSetup.exe](https://www.virustotal.com/gui/file/1c03f092ea658270e295806ec1c07c84e12e4520b4344eb60aeeb6ae227fe8c4)\n\n[SHA256: edfad91d7587e6206459db71205c23869ac028c429b24d359ee75c85cfd7f713 - BJCAV2.14.exe](https://www.virustotal.com/gui/file/bed0d1139adcec9292841b7315289bb43960f2c7a4ff1bbab536528b1317b075)\n\nSHA256: bed0d1139adcec9292841b7315289bb43960f2c7a4ff1bbab536528b1317b075 - Certappenv_setupv3.3.01.19082.exe\n\nSHA256: a94d56067aa15f28f66a139eecc90e49b008bfa1f0faf7d65721ecfb68a6a6a2 - “一证通客户端” - ZFKeyMonitor\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\23\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,-103\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab.dll,-8042\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\23\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab.dll,-8042\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,-103\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\0e7559ecd1a8793fc2f78628328a60bb8b728150\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\81C240D9A20887F3FBE596BB314882E7EE76691A\\Blob\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\p2pcollab.dll,-8042\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\DC3D7D38C1C26CCF6AAA1BA52FB448F5ED3B4431\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\B1BC968BD4F49D622AA89A81F2150152A41D829C\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\DE28F4A4FFE5B92FA3C503D1A349A7F9962A8212\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\A71052B091253A90CA3D423C8A1C0D56E75939AF\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\5070a0e2fa1db04c2ed63461ece36307ab3a863b\\Blob\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\B4ED58F24E2D40B68DA3BB6D5FD2453BDCF3CAF4\\Blob\n\nHKEY_CURRENT_USER\\Local Settings\\MuiCache\\24\\52C64B7E\\@%SystemRoot%\\system32\\dnsapi.dll,-103\n\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\SystemCertificates\\ROOT\\Certificates\\EC98F4A5096282FB192FFB168A574236C5A7DC6C\\Blob\n\nNetwork Indicators\n\nupdate[.]bjca[.]org[.]cn\n\nbjca[.]org[.]cn\n\ntime[.]bjca[.]org[.]cn\n\nold[.]snca[.]com[.]cn\n\ncayzt[.]snyzt[.]org\n\n\n-----\n\n#### Recorded Future Threat Activity Group and Malware Taxonomy\n\nRecorded Future’s research group, Insikt, tracks threat\nactors and their activity, focusing on state actors from China,\nIran, Russia, and North Korea, as well as cybercriminals —\nindividuals and groups — from Russia, CIS states, China,\nIran, and Brazil. We emphasize tracking activity groups and\nwhere possible, attributing them to nation state government,\norganizations, or affiliate institutions.\n\nOur coverage includes:\n\n\n**ADVERSARY**\n\n\n\n   - Government organizations and intelligence\nagencies, their associated laboratories, partners,\nindustry collaborators, proxy entities, and\nindividual threat actors\n\n   - Recorded Future-identified, suspected nationstate activity groups, such as RedAlpha,\nRedBravo, Red Delta, and BlueAlpha and many\nother industry established groups\n\n   - Cybercriminal individuals and groups established\nand named by Recorded Future\n\n   - Newly emerging malware, as well as prolific,\npersistent commodity malware\n\nInsikt Group publicly names a new threat activity group\nor campaign, such as RedFoxtrot, when analysts typically\nhave data corresponding to at least three points on the\nDiamond Model of Intrusion Analysis with at least medium\nconfidence. We will occasionally report on significant activity\nusing a temporary activity clustering name such as TAG-21\nwhere the activity is new and significant but doesn't map\nto existing groupings and hasn't yet graduated or merged\ninto an established activity group. We tie this to a threat\nactor only when we can point to a handle, persona, person,\nor organization responsible. We will write about the activity\nas a campaign in the absence of this level of adversary\ndata. We use the most widely used or recognized name for a\nparticular group when the public body of empirical evidence\nis clear the activity corresponds to a known group.\n\nInsikt Group uses a simple color and phonetic alphabet\nnaming convention for new nation-state threat actor groups\nor campaigns. The color generally corresponds to that\nnation’s flag colors, with more color/nation pairings to be\nadded as we identify and attribute new threat actor groups\nassociated with new nations.\n\nFor newly identified cybercriminal groups, Insikt\nGroup uses a naming convention corresponding to the\nGreek alphabet. Where we have identified a criminal entity\nconnected to a particular country, we will use the appropriate\ncountry color, and where that group may be tied to a specific\ngovernment organization, tie it to that entity specifically.\n\nInsikt Group uses mathematical terms when naming\nnewly identified malware.\n\n\n**INFRASTRUCTURE** **CAPABILITY**\n\n**VICTIM**\n\n\n-----\n\nAbout Recorded Future\n\nRecorded Future is the world’s largest provider of intelligence for enterprise\n\nsecurity. By combining persistent and pervasive automated data collection and analytics\n\nwith human analysis, Recorded Future delivers intelligence that is timely, accurate,\n\nand actionable. In a world of ever-increasing chaos and uncertainty, Recorded Future\n\nempowers organizations with the visibility they need to identify and detect threats\n\nfaster; take proactive action to disrupt adversaries; and protect their people, systems,\n\nand assets, so business can be conducted with confidence. Recorded Future is trusted\n\nby more than 1,000 businesses and government organizations around the world.\n\nLearn more at recordedfuture.com and follow us on Twitter at @RecordedFuture.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        }
    ],
    "references": [
        "https://go.recordedfuture.com/hubfs/reports/cta-2021-0729.pdf"
    ],
    "report_names": [
        "cta-2021-0729.pdf"
    ],
    "threat_actors": [
        {
            "id": "b5449533-0ff1-4048-999d-7d4bfd8e6da6",
            "created_at": "2022-10-25T16:07:24.114365Z",
            "updated_at": "2025-03-27T02:02:10.111256Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [
                "Operation Dianxun",
                "TA416"
            ],
            "source_name": "ETDA:RedDelta",
            "tools": [
                "Agent.dhwf",
                "Agentemis",
                "Chymine",
                "Cobalt Strike",
                "CobaltStrike",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Xamtrav",
                "cobeacon",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1aead86d-0c57-4e3b-b464-a69f6de20cde",
            "created_at": "2023-01-06T13:46:38.318176Z",
            "updated_at": "2025-03-27T02:00:02.803684Z",
            "deleted_at": null,
            "main_name": "DAGGER PANDA",
            "aliases": [
                "IceFog",
                "RedFoxtrot",
                "Red Wendigo",
                "PLA Unit 69010"
            ],
            "source_name": "MISPGALAXY:DAGGER PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aa90ad17-8852-4732-9dba-72ffb64db493",
            "created_at": "2023-07-11T02:00:10.067957Z",
            "updated_at": "2025-03-27T02:00:03.134199Z",
            "deleted_at": null,
            "main_name": "RedDelta",
            "aliases": [],
            "source_name": "MISPGALAXY:RedDelta",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9381a9dc-8d8e-453a-9fe5-301136ff0f83",
            "created_at": "2023-01-06T13:46:38.775762Z",
            "updated_at": "2025-03-27T02:00:02.915732Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "MISPGALAXY:RedAlpha",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9baa7519-772a-4862-b412-6f0463691b89",
            "created_at": "2022-10-25T15:50:23.354429Z",
            "updated_at": "2025-03-27T02:00:55.45162Z",
            "deleted_at": null,
            "main_name": "Mustang Panda",
            "aliases": [
                "Mustang Panda",
                "TA416",
                "RedDelta",
                "BRONZE PRESIDENT"
            ],
            "source_name": "MITRE:Mustang Panda",
            "tools": [
                "Cobalt Strike",
                "RCSession",
                "NBTscan",
                "PoisonIvy",
                "PlugX"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "cc8271a3-471f-4b8c-9da6-7d50f8ccabaa",
            "created_at": "2022-10-25T16:07:24.107066Z",
            "updated_at": "2025-03-27T02:02:10.109521Z",
            "deleted_at": null,
            "main_name": "RedAlpha",
            "aliases": [
                "DeepCliff",
                "Red Dev 3"
            ],
            "source_name": "ETDA:RedAlpha",
            "tools": [
                "AngryRebel",
                "Bladabindi",
                "FF-RAT",
                "Farfli",
                "FormerFirstRAT",
                "Gh0st RAT",
                "Ghost RAT",
                "Jorik",
                "Moudour",
                "Mydoor",
                "NetHelp Infostealer",
                "NetHelp Striker",
                "PCRat",
                "RedAlpha",
                "ffrat",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bbb1ee4e-bbe9-44de-8f46-8e7fec09f695",
            "created_at": "2022-10-25T16:07:24.120424Z",
            "updated_at": "2025-03-27T02:02:10.112981Z",
            "deleted_at": null,
            "main_name": "RedFoxtrot",
            "aliases": [
                "Moshen Dragon",
                "Nomad Panda",
                "TEMP.Trident"
            ],
            "source_name": "ETDA:RedFoxtrot",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Chymine",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Fucobha",
                "GUNTERS",
                "Gen:Trojan.Heur.PT",
                "Icefog",
                "Impacket",
                "Kaba",
                "Korplug",
                "PCShare",
                "POISONPLUG.SHADOW",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "XShellGhost",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "dc7ee503-9494-4fb6-a678-440c68fd31d8",
            "created_at": "2022-10-25T16:07:23.349177Z",
            "updated_at": "2025-03-27T02:02:09.748159Z",
            "deleted_at": null,
            "main_name": "APT 31",
            "aliases": [
                "APT 31",
                "Bronze Vinewood",
                "Judgment Panda",
                "Red Keres",
                "RedBravo",
                "TA412",
                "Violet Typhoon",
                "Zirconium"
            ],
            "source_name": "ETDA:APT 31",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "CHINACHOPPER",
                "China Chopper",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "GrewApacha",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PlugX",
                "RedDelta",
                "Roarur",
                "Sakula",
                "Sakula RAT",
                "Sakurel",
                "SinoChopper",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Trochilus RAT",
                "Xamtrav"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041804,
    "ts_creation_date": 1627555826,
    "ts_modification_date": 1627556066,
    "files": {
        "pdf": "https://archive.orkl.eu/3d59c8aa0a808193f9f5676f07f2e7a5c64fbee5.pdf",
        "text": "https://archive.orkl.eu/3d59c8aa0a808193f9f5676f07f2e7a5c64fbee5.txt",
        "img": "https://archive.orkl.eu/3d59c8aa0a808193f9f5676f07f2e7a5c64fbee5.jpg"
    }
}