{
    "id": "a8d609cb-9841-46f6-98a6-735c0d97fc19",
    "created_at": "2023-12-13T02:07:10.119318Z",
    "updated_at": "2025-03-27T02:17:27.63846Z",
    "deleted_at": null,
    "sha1_hash": "18c0a89c955b06ef112a48590e14879c919c72b4",
    "title": "From Albania To The Middle East: The Scarred Manticore Is Listening",
    "authors": "Checkpoint",
    "file_creation_date": "2023-12-12T04:41:39Z",
    "file_modification_date": "2023-12-12T04:41:39Z",
    "file_size": 10085051,
    "plain_text": "# From Albania to the Middle East: The Scarred Manticore is Listening\n\n**[research.checkpoint.com/2023/from-albania-to-the-middle-east-the-scarred-manticore-is-listening](https://research.checkpoint.com/2023/from-albania-to-the-middle-east-the-scarred-manticore-is-listening/)**\n\nOctober 31, 2023\n\n## Key Findings\n\nCheck Point Research (CPR) is monitoring an ongoing Iranian espionage campaign by\n**Scarred Manticore, an actor affiliated with the Ministry of Intelligence and Security**\n(MOIS).\nThe attacks rely on LIONTAIL, an advanced passive malware framework installed on\nWindows servers. For stealth purposes, LIONTIAL implants utilize direct calls to\nWindows HTTP stack driver HTTP.sys to load memory-residents payloads.\nAs part of mutual efforts with [Sygnia‘s Incident Response team, multiple forensics tools](https://www.sygnia.co/)\nand techniques were leveraged to uncover additional stages of the intrusions and the\nLIONTAIL framework.\nThe current campaign peaked in mid-2023, going under the radar for at least a year.\nThe campaign targets high-profile organizations in the Middle East with a focus on\n**government, military, and telecommunications sectors, in addition to IT service**\nproviders, financial organizations and NGOs.\nScarred Manticore has been pursuing high-value targets **for years, utilizing a variety**\nof IIS-based backdoors to attack Windows servers. These include a variety of custom\nweb shells, custom DLL backdoors, and driver-based implants.\nWhile the main motivation behind Scarred Manticore’s operation is espionage, some of\nthe tools described in this report have been associated with the MOIS-sponsored\n**destructive attack against Albanian government infrastructure (referred to as DEV-**\n**0861).**\n\n## Introduction\n\n[Check Point Research, in collaboration with Sygnia’s Incident Response Team, has been](https://www.sygnia.co/)\ntracking and responding to the activities of Scarred Manticore, an Iranian nation-state threat\nactor that primarily targets government and telecommunication sectors in the Middle East.\nScarred Manticore, linked to the prolific Iranian actor OilRig (a.k.a APT34, EUROPIUM,\nHazel Sandstorm), has persistently pursued high-profile organizations, leveraging access to\nsystematically exfiltrate data using tailor-made tools.\n\nIn the latest campaign, the threat actor leveraged the LIONTAIL framework, a sophisticated\nset of custom loaders and memory resident shellcode payloads. LIONSTAIL’s implants utilize\nundocumented functionalities of the HTTP.sys driver to extract payloads from incoming HTTP\n\n\n-----\n\ntraffic. Multiple observed variants of LIONTAIL-associated malware suggest Scarred\nManticore generates a tailor-made implant for each compromised server, allowing the\nmalicious activities to blend into and be undiscernible from legitimate network traffic.\n\nWe currently track this activity as Scarred Manticore, an Iranian threat actor that is most\n[closely aligned with DEV-0861. Although the LIONTAIL framework itself appears to be](http://microsoft.com/en-us/security/blog/2022/09/08/microsoft-investigates-iranian-attacks-against-the-albanian-government/)\nunique and bears no clear code overlaps with any known malware family, other tools used in\nthose attacks overlap with previously reported activities. Most notably, some of those were\neventually linked back to historic OilRig or OilRig-affiliated clusters. However, we do not have\nsufficient data to properly attribute the Scarred Manticore to OilRig, even though we do\nbelieve they’re likely related.\n\nThe evolution in the tools and capabilities of Scarred Manticore demonstrates the progress\nthe Iranian actors have undergone over the last few years. The techniques utilized in recent\nScarred Manticore operations are notably more sophisticated compared to previous activities\nCPR has tied to Iran.\n\nIn this article, we provide a technical analysis of the latest tools and the evolution of Scarred\nManticore’s activity over time. This report details our understanding of Scarred Manticore,\nmost notably its novel malware framework LIONTAIL, but also provides an overview of other\ntoolsets we believe are used by the same actor, some of which were publicly exposed in the\npast. This includes, but is not limited to, tools used in the intrusion into the Albanian\ngovernment infrastructure, web shells observed in high-profile attacks in the Middle East,\nand recently reported WINTAPIX driver-based implants.\n\n_[While we finalized this blog post, a technical analysis of part of this activity was published by](https://blog.talosintelligence.com/introducing-shrouded-snooper/)_\n_fellow researchers from Cisco Talos. While it overlaps with our findings to some extent, our_\n_report provides additional extended information, in-depth insights, and a broader_\n_retrospective regarding the threat actor behind this operation._\n\n## LIONTAIL Framework\n\nLIONTAIL is a malware framework that includes a set of custom shellcode loaders and\nmemory resident shellcode payloads. One of its components is the LIONTAIL backdoor,\nwritten in C. It is a lightweight but rather sophisticated passive backdoor installed on\nWindows servers that enables attackers to execute commands remotely through HTTP\nrequests. The backdoor sets up listeners for the list of URLs provided in its configuration and\nexecutes payloads from requests sent by attackers to those URLs.\n\nThe LIONTAIL backdoor components are the main implants utilized in the latest Scarred\nManticore intrusions. Utilizing access from a publicly facing server, the threat actor chains a\nset of passive implants to access internal resources. The internal instances of the LIONTAIL\n\n\n-----\n\nbackdoors we ve seen so far either listen on HTTP(s), similar to the internet-facing instances,\nor in some cases use named pipes to facilitate remote code execution.\n\nFigure 1 – Overview of the LIONTAIL malware framework.\n\n## LIONTAIL Loaders\n\n### Installation\n\nWe observed 2 methods of backdoor installation on the compromised Windows servers:\nstandalone executables, and DLLs loaded through search order hijacking by Windows\nservices or legitimate processes.\n\nWhen installed as a DLL, the malware exploits the absence of some DLLs on Windows\nServer OS distributions: the backdoor is dropped to the system\nfolder C:\\windows\\system32 as wlanapi.dll or wlbsctrl.dll. By default, neither of\nthese exist on Windows Server installations. Depending on the Windows Server version, the\nmalicious DLL is then loaded either directly by other processes, such as Explorer.exe, or the\nthreat actors enable specific services, disabled by default, that require those DLLs.\n\nIn the case of wlbsctrl.dll, the DLL is loaded at the start of the IKE and AuthIP IPsec\n**Keying Modules service. For wlanapi.dll, the actors enable Extensible Authentication**\n**Protocol:**\n```\nsc.exe config Eaphost start=auto\nsc.exe start Eaphost\n\n```\nIn instances where LIONTAIL is deployed as an executable, a noteworthy characteristic\nobserved in some is the attempt to disguise the executable as Cyvera Console, a\ncomponent of Cortex XDR.\n\n\n-----\n\n### Configuration\n\nThe malware starts by performing a one-byte XOR decryption of a structure containing the\nmalware configuration, which is represented with the following structure:\n\nQWORD var_0\n\nQWORD var_8\n\nQWORD magic_number\n\nDWORD num_of_end_string\n\nDWORD num_of_listen_urls\n\nSTRING end_string\n\nSTRING[] listen_urls\n\n[The field listen_urls defines particular URL prefixes to which the malware listens for](https://learn.microsoft.com/en-us/windows/win32/http/urlprefix-strings)\nincoming requests.\n\nAll of the samples’ URL lists include the http://+:80/Temporary_Listen_Addresses/ URL\n[prefix, a default WCF URL reservation that allows any user to receive messages from this](https://learn.microsoft.com/en-us/dotnet/framework/wcf/feature-details/how-to-replace-the-wcf-url-reservation-with-a-restricted-reservation)\nURL. Other samples include multiple URLs on ports 80, 443, and 444 (on Exchange servers)\nmimicking existing services, such as:\n```\nhttps://+:443/autodiscover/autodiscovers/\nhttps://+:443/ews/exchanges/\nhttps://+:444/ews/ews/\n\n```\nMany LIONTAIL samples contain tailor-made configurations, which add multiple other\ncustom URLs that match existing web folders on the compromised server. As the URLs for\nthe existing folders are already taken by the actual IIS service, the generated payloads\ncontain additional random dictionary words in the path. These ensure the malware\ncommunication blends into legitimate traffic, helping to make it more inconspicuous.\n\nThe host element of all prefixes in the configuration consists of a single plus sign (+), a\n“strong wildcard” that matches all possible host names. A strong wildcard is useful when an\napplication needs to serve requests addressed to one or more relative URLs, regardless of\nhow those requests arrive on the machine or what site (host or IP address) they specify in\ntheir Host headers.\n\nTo understand how the malware configures listeners on those prefixes and how the approach\nchanges with time, we pause for a short introduction to the Windows HTTP stack.\n\n### Windows HTTP Stack components\n\n\n-----\n\nA port-sharing mechanism, which allows multiple HTTP services to share the same TCP port\nand IP address, was introduced in Windows Server 2003. This mechanism is encapsulated\nwithin HTTP.sys, a kernel-mode driver that assumes the responsibility of processing HTTP\nrequests, listens to incoming HTTP requests, and directs them to the relevant user-mode\nprocesses or services for further handling.\n\n[On top of the driver layer, Windows provides the HTTP Server API, a user-mode component](https://learn.microsoft.com/en-us/windows/win32/Http/http-api-start-page)\nthat provides the interface for interacting with HTTP.sys. In addition, the Internet Information\nServices (IIS) under the hood relies on HTTP API to interact with the HTTP.sys driver. In a\n[similar fashion, the HttpListener class within the .NET framework is a simple wrapper](https://learn.microsoft.com/en-us/dotnet/api/system.net.httplistener?view=net-8.0)\naround the HTTP Server API.\n\n[Figure 2 – Schema of HTTP stack components on Windows Servers (source).](https://pingec.si/blog/articles/HttpListener-port-sharing-with-IIS-or-another-process/)\n\nThe process of receiving and processing requests for specific URL prefixes by an application\n(or, in our case, malware) can be outlined as follows:\n\n1. The malware registers one or more URL prefixes with HTTP.sys by any of the means\n\nprovided by the Windows operating system.\n2. When an HTTP request is received, HTTP.sys identifies the application associated with\n\nthe request’s prefix and forwards the request to the malware if it’s responsible for that\nprefix.\n3. The malware’s request handler then receives the request intercepted by HTTP.sys and\n\ngenerates a response for it.\n\n### C&C Communication\n\nAfter extracting the configuration, the malware uses the same one-byte XOR to decrypt a\nshellcode responsible for establishing the C&C communication channel by listening to the\nprovided URL prefixes list. While the concept of passive backdoors on web-facing Windows\n[servers is not new and was observed in the wild hijacking the same Windows](https://cyberweek.ae/materials/2019/D1%20COMMSEC%20-%20Discover%20Invisible%20Fileless%20Webshell%20in%20the%20APT%20Attack%20-%20Tim%20Yeh%20%26%20Dove%20Chiu.pdf)\n[DLL wblsctrl.dll as early as 2019 (by Chinese-linked Operation ShadowHammer), the](https://securelist.com/operation-shadowhammer/89992/)\n\n\n-----\n\nLIONTAIL developers elevated their approach. Instead of using the HTTP API, the malware\nuses IOCTLs to interact directly with the underlying HTTP.sys driver. This approach is\nstealthier as it doesn’t involve IIS or HTTP API, which are usually closely monitored by\nsecurity solutions, but is not a straightforward task given that the IOCTLs for HTTP.sys are\nundocumented and require additional research efforts by the threat actors.\n\nFirst, the shellcode registers the URL prefixes with HTTP.sys using the following IOCTLs:\n\n0x128000 – UlCreateServerSessionIoctl – Creates an HTTP/2.0 session.\n0x128010 – UlCreateUrlGroupIoctl – Creates a new UrlGroup. UrlGroups are\nconfiguration containers for a set of URLs created under the server session and inherit\nits configuration settings.\n0x12801d – UlSetUrlGroupIoctl – Associates the UrlGroup with the request queue by\nsetting HttpServerBindingProperty.\n0x128020 – UlAddUrlToUrlGroupIoctl – Adds the array of listen_urls to the newly\ncreated UrlGroup.\n\n\n-----\n\nFigure 3 – HTTP.sys IOCTL table.\n\nAfter registering the URL prefixes, the backdoor initiates a loop responsible for handling the\nincoming requests. The loop continues until it gets the request from a URL equal to\nthe end_string provided in the backdoor’s configuration.\n\nThe backdoor receives requests from HTTP.sys using 0x124036 –\n```\nUlReceiveHttpRequestIoctl IOCTL.\n\n```\nDepending on the version of the compromised server, the body of the request is received\nusing 0x12403B – UlReceiveEntityBodyIoctl or (if higher than 20348) 0x12403A –\n```\nUlReceiveEntityBodyFastIo. It is then base64-decoded and decrypted by XORing the\n\n```\nwhole data with the first byte of the data. This is a common method of encryption observed in\nmultiple malware families, including but not limited to DEV-0861’s web-deployed Reverse\nproxy.\n\n\n-----\n\nFigure 4 – C&C decryption scheme from the LIONTAIL payload.\n\nThe decrypted payload has the following structure:\n\nQWORD shellcode_size\n\n_BYTE[] shellcode\n\nQWORD shellcode_output (should be 0 in the incoming msg)\n\nQWORD shellcode_output_size (should be 0 in the incoming msg)\n\nQWORD MAGIC_NUM (has to be 0x18)\n\n_BYTE[] argument\n\nThe malware creates a new thread and runs the shellcode in memory. For some reason, it\nuses shellcode_output and shellcode_output_size in the request message as pointers to\nthe respective data in memory.\n\nTo encrypt the response, the malware chooses a random byte, XOR-encodes the data using\nit as a key, prepends the key to the result, and then base64-encodes the entire result before\nsending it back to the C&C server using the IOCTL 0x12403F – UlSendHttpResponseIoctl.\n\n### LIONTAIL web shell\n\nIn addition to PE implant, Scarred Manticore uses a web shell-based version of the\nLIONTAIL shellcode loader. The web shell is obfuscated in a similar manner to other Scarred\nManticore .NET payloads and web shells.\n\n\n-----\n\nFigure 5 – The main function of the LIONTAIL web shell (formatted, with obfuscations preserved).\n\nThe web shell gets requests with 2 parameters:\n\nThe shellcode to execute.\nThe argument for the shellcode to use.\n\nBoth parameters are encrypted the same way as other communication: XOR with the first\nbyte followed by base64 encoding.\n\nThe structure of shellcodes and of arguments sent to the web shell-based shellcode loader is\nidentical to those used in the LIONTAIL backdoor, which suggests that the artifacts observed\nare part of a bigger framework that allows the dynamic building of loaders and payloads\ndepending on the actor’s access and needs.\n\n### LIONTAIL version using named pipes\n\nDuring our research, we also found loaders that have a similar internal structure to the\nLIONTAIL samples. Instead of listening on URL prefixes, this version gets its payloads from a\nnamed pipe and likely is designated to be installed on internal servers with no access to the\npublic web. The configuration of the malware is a bit different:\n\nQWORD var_0\n\n\n-----\n\nQWORD var_8\n\nQWORD var_10\n\nDWORD var_18\n\nDWORD dwOpenMode\n\nDWORD dwPipeMode\n\nDWORD nMaxInstances\n\nDWORD nOutBufferSize\n\nDWORD nInBufferSize\n\nDWORD nDefaultTimeOut\n\nSTRING pipe_name\n\n[The main shellcode starts with converting the string security descriptor \"D:](https://learn.microsoft.com/en-us/windows/win32/api/sddl/nf-sddl-convertstringsecuritydescriptortosecuritydescriptora)\n```\n(A;;FA;;;WD)” into a valid, functional security descriptor. As the string starts with “D”, it\n\n```\nindicates a DACL (discretionary access control list) entry, which typically has the following\nformat: entry_type:inheritance_flags(ACE_type; ACE_flags; rights; object_GUID;\n```\ninherit_object_GUID; account_SID). In this case, the security descriptor allows (A) File All\n\n```\nAccess (FA) to everyone (WD).\n\n[The security descriptor is then used to create a named pipe based on the values provided in](https://learn.microsoft.com/en-us/windows/win32/api/winbase/nf-winbase-createnamedpipea)\nthe configuration. In the samples we observed, the name of the pipe used is \\\\.\\pipe\\test```\npipe.\n\n```\nIt’s noteworthy that, unlike the HTTP version, the malware doesn’t employ any more\nadvanced techniques for connecting to the named pipe, reading from it, and writing to it.\nInstead, it relies on standard kernel32.dll APIs such as CreateNamedPipe,\nand ReadFileWriteFile.\n\nThe communication of named pipes-based LIONTAIL is identical to the HTTP version, with\nthe same encryption mechanism and the same structure of the payload which runs as a\nshellcode in memory.\n\n## LIONTAIL in-memory components\n\n### Types of payloads\n\n\n-----\n\nAfter the LIONTAIL loader decrypts the payload and its argument received from the\nattackers’ C&C server, it starts with parsing the argument. It is a structure that describes a\ntype of payload for the shellcode to execute and it is built differently depending on the type of\npayload:\n\nTYPE = 1 – Execute another shellcode:\n\nDWORD type // 1\n\nQWORD shellcode_size\n\n_BYTE[] Shellcode\n\nTYPE = 2 – Execute the specified API function:\n\nDWORD type // 2\n\nCHAR[] library_name\n\nCHAR[] api_name\n\nThe argument for the API execution has the following structure:\n\nDWORD need_to_be_freed_flag\n\nQWORD argument_size\n\n_BYTE[] argument\n\n### Next stages\n\nTo make things more complicated, Scarred Manticore wraps the final payload in nested\nshellcodes. For example, one of the shellcodes received from the attackers runs another\nalmost identical shellcode, which in turn runs a final shellcode responsible for machine\nfingerprinting.\n\nThe data gathered by this payload is collected by running specific Windows APIs or\nenumerating the registry keys, and includes these components:\n\nComputer Name (using GetComputerNameW API) and Domain Name\n(using GetEnvironmentVariableA API)\nFlag if the system is 64-bit (using GetNativeSystemInfo API, the check is done with\n```\n   wProcessorArchitecture == 9)\n\n```\nNumber of processors (dwNumberOfProcessors using GetNativeSystemInfo API)\nPhysical RAM (GetPhysicallyInstalledSystemMemory)\nData from CurrentVersion registry key (Type, Name length, Name, Data length, Data)\n\n\n-----\n\nData fromSecureBoot\\State registry key (the same data)\nData from System\\Bios registry key (the same data)\n\nThe final structure, which contains all the gathered information, also has a place for error\ncodes for the threat actor to use to figure out why some of the APIs they use don’t work as\nexpected:\n\nDWORD last_error (GetComputerNameW)\n\nDWORD last_error (GetPhysicallyInstalledSystemMemory)\n\nDWORD last_error (GetEnvironmentVariableA)\n\nDWORD last_error (NtOpenKey CurrentVersion)\n\nDWORD last_error (NtQueryKey CurrentVersion)\n\nDWORD num_of_values (CurrentVersion)\n\nDWORD last_error (NtOpenKey SecureBoot\\State)\n\nDWORD last_error (NtQueryKey SecureBoot\\State)\n\nDWORD num_of_values (SecureBoot\\State)\n\nDWORD last_error (NtOpenKey System\\Bios)\n\nDWORD last_error (NtQueryKey System\\Bios)\n\nDWORD num_of_values (System\\Bios)\n\nQWORD num_of_proccesors\n\nQWORD total_RAM\n\nQWORD tick_count\n\nQWORD is_64_bit\n\n_CHAR[0X10] computer_name\n\n_CHAR[0X10] domain_name\n\n_BYTE[] CurrentVersion_data\n\n_BYTE[] SecureBootState_data\n\n_BYTE[] SystemBios_data\n\n\n-----\n\n## Additional Tools\n\nIn addition to using LIONTAIL, Scarred Manticore was observed leveraging other custom\ncomponents.\n\n### LIONHEAD web forwarder\n\nOn some of the compromised exchange servers, the actors deployed LIONHEAD, a tiny web\nforwarder. LIONHEAD is also installed as a service using the same phantom DLL hijacking\ntechnique as LIONTAIL and utilizes similar mechanisms to forward the traffic directly to\nExchange Web Services (EWS) endpoints.\n\nLIONHEAD’s configuration is different from LIONTAIL:\n\nDWORD timeout 0x493E0\n\nDWORD forward_port 444\n\nSTRING end_string '<redacted>'\n\nSTRING forward_server 'localhost'\n\nSTRING forward_path '/ews/exchange.asmx'\n\nSTRING[] listen_urls 'https://+:443/<redacted>/'\n\nThe backdoor registers the listen_urls prefixes in the same way as LIONTAIL and listens\nfor requests. For each request, the backdoor copies the content type, cookie, and body and\nforwards it to the <forward_server>/<forward_path>:<forward port> specified in the\nconfiguration. Next, the backdoor gets a response from forward_server and sends it back to\nthe URL that received the original request.\n\nThis forwarder might be used to bypass the restrictions on external connections to EWS,\nhide the real consumer of EWS data being external, and consequently conceal data\nexfiltration.\n\n### Web shells\n\nScarred Manticore deploys multiple web shells, including those\n[previously attributed indirectly to OilRig. Some of these web shells stand out due to their](https://www.secureworks.com/blog/ongoing-campaign-leveraging-exchange-vulnerability-potentially-linked-to-iran)\nobfuscations, naming conventions and artifacts. The web shells retain class and method\nobfuscation and a similar string encryption algorithm (XOR with one byte, the key is derived\nfrom the first byte or from the first 2 bytes) to many other web shells and .NET-based tools\nused by Scarred Manticore in their attacks over the past few years.\n\n\n-----\n\nOne of those shells is a heavily obfuscated and slightly modified version of an open-source\n[XML/XSL transform web shell, Xsl Exec Shell. This web shell also contains two obfuscated](https://evi1cg.me/archives/Xsl_Exec_Webshell.html)\nfunctions that return the string “~/1.aspx”. These functions are never called and likely are\nremnants from other versions, as we observed them in tools used previously by Scarred\nManticore, such as FOXSHELL, which is discussed later:\n\nFigure 6 – Unused strings remained from the FOXSHELL web shell versions.\n\n## Targeting\n\nBased on our visibility into the latest wave of attacks that utilize LIONTAIL, the observed\nvictims are located across the Middle East region, including Saudi Arabia, the United Arab\nEmirates, Jordan, Kuwait, Oman, Iraq, and Israel. The majority of the impacted entities\nbelong to government, telecommunications, military, and financial sectors, as well as IT\nservices providers. However, we also observed the infection on the Exchange servers\nbelonging to a regional affiliate of a global non-profit humanitarian network.\n\nThe geographic region and the targeted profile are aligned with Iranian interests and in line\nwith the typical victim profile that MOIS-affiliated clusters usually target in espionage\noperations.\n\n\n-----\n\nFigure 7 – Targeted countries.\n\nPreviously, DEV-0861, a cluster we believed aligns with Scarred Manticore, was\n[publicly exposed for the initial access to and data exfiltration from the Albanian government](https://www.microsoft.com/en-us/security/blog/2022/09/08/microsoft-investigates-iranian-attacks-against-the-albanian-government/)\nnetworks, as well as email exfiltration from multiple organizations in the Middle Eastern\ncountries such as Kuwait, Saudi Arabia, Turkey, UAE, and Jordan.\n\n## Attribution and Historical Activity\n\nSince at least 2019, Scarred Manticore deployed unique tools on compromised Internetfacing Windows servers in the Middle East region. During these years, their toolset went\nthrough significant development. It began as open-source-based web-deployed proxies and\n\n\n-----\n\nover time evolved to become a diverse and powerful toolset that utilizes both custom-written\nand open-source components.\n\nFigure 8 – Overview of code and capabilities evolution of multiple malware versions used by Scarred\n\nManticore.\n\n### Tunna-based web shell\n\nOne of the earliest samples related to the threat actor’s activity is based on a web shell\nfrom [Tunna, an open-source tool designed to tunnel any TCP communication over HTTP.](https://github.com/SECFORCE/Tunna/tree/master)\nThe Tunna web shell allows to connect from the outside to any service on the remote host,\nincluding those that are blocked on the firewall, as all the external communication to the web\nshell is done via HTTP. The IP and the port of the remote host are sent to the web shell in\nthe configuration stage, and in many cases, Tunna is mostly used to proxy RDP connections.\n\nThe web shell used by the threat actor has the internal version Tunna v1.1g (only version\n1.1a is available on Github). The most significant change from the open-source version is the\nencryption of requests and responses by XORing the data with the pre-defined\nstring szEncryptionKey and appending the constant string K_SUFFIX at the end:\n\n\n-----\n\nFigure 9 – Encryption function in “Tunna 1.1g” proxy used by the threat actors.\n\nFigure 10 – Decryption and encryption of data by Tunna proxy.\n\n### FOXSHELL: XORO version\n\nOver time, the code was refactored and lost its resemblance to Tunna. We track this and all\nfurther versions as FOXSHELL.\n\n\n-----\n\nThe biggest changes resulted from organizing multiple entities into classes using an\nobjective-oriented approach. The following class structure persists in most of the FOXSHELL\nversions:\n\nFigure 11 – Classes within FOXSHELL.\n\nAll the functionality responsible for encrypting the traffic moved to a\nseparate EncryptionModule class. This class loads a .NET DLL embedded in a base64encoded string inside the body of FOXSHELL and invokes\nits encrypt and decrypt methods:\n\n\n-----\n\nFigure 12 – Base64-encoded EncryptionDll inside the web shell.\n\nFigure 13 – EncryptionModule class responsible for the encrypt and decrypt method invocation.\n\nThe embedded encryption module’s name is XORO.dll, and its\nclass Encryption.XORO implements decrypt and encrypt methods the same way as the\nTunna-based web shell, using the same hardcoded values:\n\n\n-----\n\nFigure 14 – Encryption constants and decryption function inside XORO.dll.\n\nAll requests to the web shell are also encapsulated within a class called Package, which\nhandles different PackageTypes: Data, Config, OK, Dispose, or Error. The PackageType is\ndefined by the first byte of the package, and depending on the type of Package, the web\nshell parses the package and applies the configuration (opens a new socket to the remote\nmachine specified in the configuration and applies a new EncryptionDll if provided), or\ndisposes of the existing socket, or proxies the connection if the package is type Data:\n\n\n-----\n\nFigure 15 – Package handling in FOXSHELL.\n\n### FOXSHELL: Bsae64 version (not a typo)\n\nThis version of the web shell is still unobfuscated, and its internal version is specified in the\ncode:\n\nconst string Version = \"1.5\"\n\nThe web shell also contains the default EncryptionDll embedded inside. The module’s name\nis Base64.dll, and the encryption class, which is misspelled as Bsae64, exposes the encrypt\nand decrypt methods. However, both are just simple base64 encoding:\n\n\n-----\n\nFigure 16 – Encrypt and decrypt methods in Base64.dll.\n\nAlthough this simple encoding could be done in the code of the web shell itself, the existence\nof other embedded DLLs, such as XORO.dll (described previously), and the ability to provide\nyet another EncryptionDll on the configuration stage, implies that the attackers prefer to\ncontrol which specific type of encryption they want to use by default in certain environments.\n\nOther changes in this version are the renaming of the PackageType Config to RDPconfig,\nand ConfigPackage to RDPConfigPackage, indicating the actors are focused on proxying\nRDP connections. The code of these classes remains the same:\n\nFigure 17 – RDP Configuration class.\n\n\n-----\n\nFinally, another condition in the code handles the case of the web shell receiving a nonempty parameter WV-RESET, which calls a function to shut down the proxy socket and sends\nan OK response back to the attackers:\n\nFigure 18 – “Close proxy” WV-RESET parameter.\n\n### Web shell within a web shell: compiled FOXSHELL\n\nThe versions that were described above, targeted entities in Middle Eastern countries, such\nas Saudi Arabia, Qatar, and the United Arab Emirates. This version, in addition to being\n[leveraged against Middle Eastern governmental entities, was part of the attack against the](https://www.cisa.gov/news-events/cybersecurity-advisories/aa22-264a)\nAlbanian government in May 2021. Through the exploitation of an Internet-facing Microsoft\nSharePoint server, the actors deployed ClientBin.aspx on the compromised server to proxy\nexternal connections and thus facilitate lateral movement throughout the victim’s\nenvironment.\n\nThe details of the samples may vary but in all of them, the FOXHELL is compiled as DLL and\nembedded inside the base web shell in base64. The compiled DLL is loaded\nwith System.Reflection.Assembly.Load, and then the ProcessRequest method from it is\ninvoked. The DLL is written in .NET and has the name pattern App_Web_<random>.dll,\nwhich indicates an ASP.NET dynamically compiled DLL.\n\nFigure 19 – A web shell loading App_Web_*.dll.\n\nThe App_Web* DLL is affected by the class and method obfuscation, and all the strings are\nencrypted with a combination of Base64, XOR with the first byte, and AES:\n\n\n-----\n\nFigure 20 – The inchpublic function, responsible for string encryption, showcases obfuscations of methods\n\nand classes.\n\nWhen the web shell is compiled into DLL, it contains the initialization stub, which ensures\nthat the web shell listens on the correct URI. In this case, the initialization happens in the\nfollowing piece of code:\n\nFigure 21 – Initialization stub in the web shell App_Web_*.dll.\n\nOr, after deobfuscation:\n\npublic concertthis_medal() {\n\nbase.AppRelativeVirtualPath = \"~/1.aspx\"\n\n\n-----\n\nif (!concertthis_medal.__initialized) {\n\nconcertthis_medal.__fileDependencies = base.GetWrappedFileDependencies(new\nstring{\"~/1.aspx\"});\n\nconcertthis_medal.__initialized = true; }\n\nThis initialization sets the FOXSHELL to listen to the requests on the relative path ~/1.aspx,\nwhich we observed as an unused artifact in other web shells related to attacks involving\nLIONTAIL.\n\nInternally, the DLL has the same “1.5” version of FOXSHELL, which includes the WV```\nRESET parameter to stop the proxy and the same default Bsae64 Encryption DLL as in\n\n```\nprevious versions.\n\n### Standalone backdoor based on IIS ServerManager and HTTPListener\n\nSince mid-2020, in addition to the FOXSHELL as a means to proxy the traffic, we also\nobserved a rather sophisticated standalone passive backdoor, written in .NET and meant to\nbe deployed on IIS servers. It is obfuscated with similar techniques as FOXSHELL and\nmasquerades as System.Drawing.Design.dll. The SDD backdoor was\n[previously analyzed by a Saudi researcher but was never attributed to a specific threat actor](https://darksys0x.net/Sdd-backdoor/)\nor campaign.\n\n**C&C Communication**\n\nThe SSD backdoor sets up C&C communication through an HTTP listener on the infected\nmachine. It is achieved using two classes:\n\n**[ServerManager – A part of the System.Web.Administration namespace in .NET used](https://learn.microsoft.com/en-us/dotnet/api/microsoft.web.administration.servermanager?view=iis-dotnet)**\nfor managing and configuring Internet Information Services (IIS) on a Windows server,\nsuch as get configuration, create, modify, or delete IIS sites, applications, and\napplication pools.\n**[HTTPListener – A class in the .NET Framework used for creating custom HTTP](https://learn.microsoft.com/en-us/dotnet/api/system.net.httplistener?view=net-7.0)**\nservers, independent of IIS and based on HTTP API.\n\nServerManager is used to extract the sites hosted by the IIS server and build the HashSet of\nURL prefixes to listen on:\n\n\n-----\n\nFigure 22 – Obfuscated code of angleoppose_river function that builds HashSet of URL prefixes\n\nbased on sites and bindings configured on the IIS server (Illdefy array provides the relative URls).\n\nIn this specific case, the only relative URI configured in the malware sample is\n```\nTemporary_Listen_Addresses. The malware then uses the HttpListener class to start\n\n```\nlistening on the specified URL prefixes:\n\nFigure 23 – The HttpListener start code.\n\n**C&C command execution**\n\nThe backdoor has several capabilities: execute commands using cmd.exe, upload and\ndownload files, execute processes with specified arguments, and run additional .NET\nassemblies.\n\n\n-----\n\nFigure 24 – Request handler of the SDD backdoor.\n\nFirst, if the POST request body contains data, the malware parses it and handles the\nmessage as one of the 4 commands it supports. Otherwise, if the request contains a\nparameter Vet, the malware simply decodes its value from base64 and executes it with cmd\n```\n/c. If none of these is true, then the malware handles the heartbeat mechanism: if the\n\n```\nrequest URL contains the string wOxhuoSBgpGcnLQZxipa in lowercase, then the malware\nsends back UsEPTIkCRUwarKZfRnyjcG13DFA along with a 200 OK response.\n\nThe data from the POST request is encrypted using Base64 and simple XOR-based\nencryption:\n\nFigure 25 – Command decryption algorithm.\n\nAfter decrypting the data of the message, the malware parses it according to the following\norder:\n\nDWORD command_type\n\nDWORD command_name_length\n\nSTRING command_name\n\n\n-----\n\nSTRING data\n\nFigure 26 – Switch that handles possible SDD backdoor command types.\n\nThe possible commands, as named by the threat actors, include:\n```\n   “Command” – Executes a process with a specified argument. In this case, the data is\n\n```\nparsed to extract the process name and its argument.\n```\n   “Upload” – Uploads a file to the specified path in the infected system.\n   “Download” – Sends a specified file to the threat actors.\n   “Rundll” – Loads assembly and runs it with specified parameter (if exists).\n\n```\nThe response data is built the same way as the request (returns command type, command\nname, and output) and then encrypted with the same XOR-based algorithm as the request.\n\n### WINTAPIX driver\n\nRecently, Fortinet [revealed a wave of attacks against Middle Eastern targets (mostly Saudi](https://www.fortinet.com/blog/threat-research/wintapix-kernal-driver-middle-east-countries)\nArabia, but also Jordan, Qatar, and the United Arab Emirates) that involve kernel mode\ndrivers that the researchers named WINTAPIX. Although the exact infection chain to install\nthe drivers is unknown, they target only IIS servers as they use the IIS ServerManager\nobject. The high-level execution flow is the following:\n\n1. WINTAPIX driver is loaded in the kernel.\n2. WINTAPIX driver enumerates user-mode processes to find a suitable process with\n\nlocal system privileges.\n3. WINTAPIX driver injects an embedded shellcode into a previously found process. The\n\n[shellcode is generated using the open-source Donut project, which allows the creation](https://github.com/TheWover/donut)\nof a position-independent shellcode capable of loading and executing .NET assemblies\nfrom memory.\n4. The injected shellcode loads and executes an encrypted .NET payload.\n\n\n-----\n\nThe final payload is obfuscated with a commercial obfuscator in addition to already familiar\nclass, method, and string obfuscations, and it combines the functionality of the SDD\nbackdoor and FOXSHELL proxy. To achieve both, it listens on two sets of URL prefixes,\nusing ServerManager and HTTPListener similarly to the SSD backdoor.\n\nThe FOXSHELL version used within the driver payload is set to 1.7. The main enhancement\n[introduced in this version is the Event Log bypass using a known technique of suspending](https://github.com/hack2fun/EventLogBypass)\nEventLog Service threads. The default EncryptionDll hardcoded in the driver is the same\n```\nBsae64.dll, and the core proxy structure remains largely unaltered when compared to\n\n```\nFOXSHELL version 1.5.\n\nFigure 27 – Version hardcoded in the .NET payload.\n\nFigure 28 – FOXSHELL 1.7 class structure.\n\n[As an extensive analysis of the WINTAPIX driver and its version SRVNET2 was already](https://darksys0x.net/Analysis-and-Reversing-of-srvnet2sys/)\nprovided, here we only highlight the main overlaps between those and other discussed tools\nthat strengthen their affiliation:\n\nThe same code base as the SDD backdoor, including the heartbeat based on the same\nstring values wOxhuoSBgpGcnLQZxipa and UsEPTIkCRUwarKZfRnyjcG13DFA.\nThe same supported backdoor command types and encryption with the same key.\nThe same codebase as FOXSHELL, structure, and functionality.\nThe same obfuscation and encryption methods.\n\n### Outlook\n\nLIONTAIL framework components share similar obfuscation and string artifacts with\nFOXSHELL, SDD backdoor, and WINTAPIX drivers. Currently, we are not aware of any other\nthreat actors utilizing these tools, and we attribute them all to Scarred Manticore based on\nmultiple code overlaps and shared victimology.\n\n\n-----\n\n## Conclusion\n\nFor the last few years, Scarred Manticore has been observed carrying out multiple stealthy\noperations in Middle Eastern countries, including gaining access to telecommunications and\ngovernment organizations in the region, and maintaining and leveraging this access for\nmonths to systematically exfiltrate data from the victims’ systems. Examining the history of\ntheir activities, it becomes evident how far the threat actor has come in improving their\nattacks and enhancing their approach which relies on passive implants.\n\nWhile LIONTAIL represents a logical progression in the evolution of FOXSHELL and still\nbears some distinctive characteristics that allow us to attribute attacks involving LIONTAIL to\nScarred Manticore, it stands out from other observed variants. The LIONTAIL framework\ndoes not use common, usually monitored methods for implementing listeners: it no longer\ndepends on Internet Information Services (IIS), its modules, or any other options and\nlibraries provided by the .NET framework to manage IIS programmatically. Instead, it utilizes\nthe lowest level of Windows HTTP Stack by interacting directly with the HTTP.sys driver. In\naddition, it apparently allows the threat actors to customize the implants, their configuration\nparameters, and loaders’ file delivery type. All those have enhanced the stealth ability of the\nimplants, enabling them to evade detection for an extended period.\n\nWe expect that Scarred Manticore operations will persist and may spread into other regions\nas per Iranian long-term interests. While most of the recent activity of Scarred Manticore is\nprimarily focused on maintaining covert access and data extraction, the troubling example of\nthe attack on the Albanian government networks serves as a reminder that nation-state\nactors may collaborate and share access with their counterparts in intelligence agencies.\n\n## Check Point Customers Remain Protected\n\nCheck Point Customers remain protected against attacks detailed in this report, while using\n[IPS, Check Point](https://www.checkpoint.com/quantum/intrusion-prevention-system-ips/) [Harmony Endpoint and](https://www.checkpoint.com/harmony/advanced-endpoint-protection/) [Threat Emulation.](https://www.checkpoint.com/infinity/zero-day-protection/)\n\n**IPS:**\n\nBackdoor.WIN32.Liontail.A/B\n\n**Threat Emulation:**\n\nAPT.Wins.Liontail.C/D\n\n## IOCs\n\n\n-----\n\n```\ndaa362f070ba121b9a2fa3567abc345edcde33c54cabefa71dd2faad78c10c33\nf4639c63fb01875946a4272c3515f005d558823311d0ee4c34896c2b66122596\n2097320e71990865f04b9484858d279875cf5c66a5f6d12c819a34e2385da838\n67560e05383e38b2fcc30df84f0792ad095d5594838087076b214d849cde9542\n4f6351b8fb3f49ff0061ee6f338cd1af88893ed20e71e211e8adb6b90e50a3b8\nf6c316e2385f2694d47e936b0ac4bc9b55e279d530dd5e805f0d963cb47c3c0d\n1485c0ed3e875cbdfc6786a5bd26d18ea9d31727deb8df290a1c00c780419a4e\n8578bff36e3b02cc71495b647db88c67c3c5ca710b5a2bd539148550595d0330\nc5b4542d61af74cf7454d7f1c8d96218d709de38f94ccfa7c16b15f726dc08c0\n9117bd328e37be121fb497596a2d0619a0eaca44752a1854523b8af46a5b0ceb\ne1ad173e49eee1194f2a55afa681cef7c3b8f6c26572f474dec7a42e9f0cdc9d\na2598161e1efff623de6128ad8aafba9da0300b6f86e8c951e616bd19f0a572b\n7495c1ea421063845eb8f4599a1c17c105f700ca0671ca874c5aa5aef3764c1c\n6f0a38c9eb9171cd323b0f599b74ee571620bc3f34aa07435e7c5822663de605\n3875ed58c0d42e05c83843b32ed33d6ba5e94e18ffe8fb1bf34fd7dedf3f82a7\n1146b1f38e420936b7c5f6b22212f3aa93515f3738c861f499ed1047865549cb\nb71aa5f27611a2089a5bbe34fd1aafb45bd71824b4f8c2465cf4754db746aa79\nda450c639c9a50377233c0f195c3f6162beb253f320ed57d5c9bb9c7f0e83999\n\n```\nGO UP\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/7xa41s13wmuno6koqkuknexpsffehzdt"
    ],
    "report_names": [
        "Checkpoint_Fro-Albania-to-MiddleEast-Scarred-Manticore(10-31-2023)"
    ],
    "threat_actors": [
        {
            "id": "ce10c1bd-4467-45f9-af83-28fc88e35ca4",
            "created_at": "2022-10-25T15:50:23.458833Z",
            "updated_at": "2025-03-27T02:00:55.475188Z",
            "deleted_at": null,
            "main_name": "APT34",
            "aliases": null,
            "source_name": "MITRE:APT34",
            "tools": [
                "netstat",
                "Systeminfo",
                "PsExec",
                "SEASHARPEE",
                "Tasklist",
                "Mimikatz",
                "POWRUNER",
                "certutil"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1c97ccfd-1888-492c-b7b9-bb52c4c3809b",
            "created_at": "2023-01-06T13:46:38.940529Z",
            "updated_at": "2025-03-27T02:00:02.957652Z",
            "deleted_at": null,
            "main_name": "Operation ShadowHammer",
            "aliases": [],
            "source_name": "MISPGALAXY:Operation ShadowHammer",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9df96153-0450-4cbb-8a13-b737f16394ef",
            "created_at": "2023-11-03T02:00:07.788769Z",
            "updated_at": "2025-03-27T02:00:03.145707Z",
            "deleted_at": null,
            "main_name": "Scarred Manticore",
            "aliases": [],
            "source_name": "MISPGALAXY:Scarred Manticore",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2864e40a-f233-4618-ac61-b03760a41cbb",
            "created_at": "2023-12-01T02:02:34.272108Z",
            "updated_at": "2025-03-27T02:02:10.209072Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "ETDA:WildCard",
            "tools": [
                "RustDown",
                "SysJoker"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f8dddd06-da24-4184-9e24-4c22bdd1cbbf",
            "created_at": "2023-01-06T13:46:38.626906Z",
            "updated_at": "2025-03-27T02:00:02.877001Z",
            "deleted_at": null,
            "main_name": "Tick",
            "aliases": [
                "Stalker Taurus",
                "PLA Unit 61419",
                "Nian",
                "BRONZE BUTLER",
                "REDBALDKNIGHT",
                "STALKER PANDA",
                "G0060"
            ],
            "source_name": "MISPGALAXY:Tick",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "cffb3c01-038f-4527-9cfd-57ad5a035c22",
            "created_at": "2022-10-25T15:50:23.38055Z",
            "updated_at": "2025-03-27T02:00:55.459558Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "COBALT GYPSY",
                "IRN2",
                "APT34",
                "Helix Kitten",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "EUROPIUM",
                "ITG13"
            ],
            "source_name": "MITRE:OilRig",
            "tools": [
                "ISMInjector",
                "RDAT",
                "Systeminfo",
                "QUADAGENT",
                "OopsIE",
                "Tasklist",
                "certutil",
                "ZeroCleare",
                "POWRUNER",
                "netstat",
                "ipconfig",
                "LaZagne",
                "BONDUPDATER",
                "SideTwist",
                "PsExec",
                "SEASHARPEE",
                "Mimikatz",
                "RGDoor",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "67709937-2186-4a32-b64c-a5693d40ac77",
            "created_at": "2023-01-06T13:46:38.495593Z",
            "updated_at": "2025-03-27T02:00:02.848206Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "IRN2",
                "Hazel Sandstorm",
                "EUROPIUM",
                "TA452",
                "Earth Simnavaz",
                "Cobalt Gypsy",
                "Crambus",
                "Helix Kitten",
                "APT 34",
                "APT34",
                "ATK40",
                "G0049",
                "Evasive Serpens",
                "Twisted Kitten"
            ],
            "source_name": "MISPGALAXY:OilRig",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8f9c8a6e-f6b6-431b-bedd-94fdeea5474a",
            "created_at": "2024-05-01T02:03:08.022974Z",
            "updated_at": "2025-03-27T02:05:17.310877Z",
            "deleted_at": null,
            "main_name": "COBALT GYPSY",
            "aliases": [
                "CHRYSENE ",
                "Crambus ",
                "EUROPIUM ",
                "Hazel Sandstorm ",
                "Helix Kitten ",
                "ITG13 ",
                "OilRig ",
                "Yellow Maero ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT GYPSY",
            "tools": [
                " Helminth",
                " Jason",
                " MacDownloader",
                " PoisonFrog",
                " RGDoor",
                " ThreeDollars",
                " TinyZbot",
                " Toxocara",
                " Trichuris",
                " TwoFace",
                "Glimpse"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4e7cd9a-2290-4f89-a645-85b9a46d004b",
            "created_at": "2022-10-25T16:07:23.419513Z",
            "updated_at": "2025-03-27T02:02:09.790389Z",
            "deleted_at": null,
            "main_name": "Bronze Butler",
            "aliases": [
                "Bronze Butler",
                "CTG-2006",
                "Operation ENDTRADE",
                "RedBaldNight",
                "Stalker Panda",
                "Stalker Taurus",
                "TEMP.Tick",
                "Tick"
            ],
            "source_name": "ETDA:Bronze Butler",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "9002 RAT",
                "AngryRebel",
                "Blogspot",
                "Daserf",
                "Datper",
                "Elirks",
                "Farfli",
                "Gh0st RAT",
                "Ghost RAT",
                "HOMEUNIX",
                "HidraQ",
                "HomamDownloader",
                "Homux",
                "Hydraq",
                "Lilith",
                "Lilith RAT",
                "McRAT",
                "MdmBot",
                "Mimikatz",
                "Minzen",
                "Moudour",
                "Muirim",
                "Mydoor",
                "Nioupale",
                "PCRat",
                "POISONPLUG.SHADOW",
                "Roarur",
                "RoyalRoad",
                "ShadowPad Winnti",
                "ShadowWali",
                "ShadowWalker",
                "SymonLoader",
                "WCE",
                "Wali",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "XShellGhost",
                "XXMM",
                "gsecdump",
                "rarstar"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bf0489c5-1c07-41e6-91c9-855ad96ccc6a",
            "created_at": "2022-10-25T16:47:55.541639Z",
            "updated_at": "2025-03-27T02:05:17.253496Z",
            "deleted_at": null,
            "main_name": "BRONZE BUTLER",
            "aliases": [
                "Daserf",
                "Stalker Panda ",
                "Tick ",
                "CTG-2006 "
            ],
            "source_name": "Secureworks:BRONZE BUTLER",
            "tools": [
                " DGet",
                " Daserf",
                " Datper",
                " Gofarer",
                " MSGet",
                " Mimikatz",
                " RarStar",
                " Screen Capture Tool",
                " ShadowPad",
                " T-SMB",
                " WinRAR",
                " Windows Credential Editor",
                " gsecdump",
                " xmm downloader",
                " xxmm",
                "ABK"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "256a6a2d-e8a2-4497-b399-628a7fad4b3e",
            "created_at": "2023-11-30T02:00:07.299845Z",
            "updated_at": "2025-03-27T02:00:03.257794Z",
            "deleted_at": null,
            "main_name": "WildCard",
            "aliases": [],
            "source_name": "MISPGALAXY:WildCard",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b6436f7b-6012-4969-aed1-d440e2e8b238",
            "created_at": "2022-10-25T16:07:23.91517Z",
            "updated_at": "2025-03-27T02:02:10.027531Z",
            "deleted_at": null,
            "main_name": "OilRig",
            "aliases": [
                "APT 34",
                "ATK 40",
                "Chrysene",
                "Cobalt Gypsy",
                "Crambus",
                "DEV-0861",
                "EUROPIUM",
                "Earth Simnavaz",
                "Evasive Serpens",
                "Hazel Sandstorm",
                "Helix Kitten",
                "IRN2",
                "ITG13",
                "Scarred Manticore",
                "Storm-0861",
                "TA452",
                "Twisted Kitten",
                "UNC1860",
                "Yellow Maero"
            ],
            "source_name": "ETDA:OilRig",
            "tools": [
                "AMATIAS",
                "Agent Drable",
                "Agent Injector",
                "AgentDrable",
                "Alma Communicator",
                "BONDUPDATER",
                "CACTUSPIPE",
                "Clayslide",
                "CypherRat",
                "DNSExfitrator",
                "DNSpionage",
                "DROPSHOT",
                "DistTrack",
                "DropperBackdoor",
                "Fox Panel",
                "GREYSTUFF",
                "GoogleDrive RAT",
                "HighShell",
                "HyperShell",
                "ISMAgent",
                "ISMDoor",
                "ISMInjector",
                "Jason",
                "Karkoff",
                "LIONTAIL",
                "LOLBAS",
                "LOLBins",
                "LONGWATCH",
                "LaZagne",
                "Living off the Land",
                "MailDropper",
                "Mimikatz",
                "MrPerfectInstaller",
                "OILYFACE",
                "OopsIE",
                "POWBAT",
                "POWRUNER",
                "Plink",
                "Poison Frog",
                "PowerExchange",
                "PsList",
                "PuTTY Link",
                "QUADAGENT",
                "RDAT",
                "RGDoor",
                "SEASHARPEE",
                "Saitama",
                "Saitama Backdoor",
                "Shamoon",
                "SideTwist",
                "SpyNote",
                "SpyNote RAT",
                "StoneDrill",
                "TONEDEAF",
                "TONEDEAF 2.0",
                "ThreeDollars",
                "TwoFace",
                "VALUEVAULT",
                "Webmask",
                "WinRAR",
                "ZEROCLEAR",
                "ZeroCleare",
                "certutil",
                "certutil.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1702433230,
    "ts_updated_at": 1743041847,
    "ts_creation_date": 1702356099,
    "ts_modification_date": 1702356099,
    "files": {
        "pdf": "https://archive.orkl.eu/18c0a89c955b06ef112a48590e14879c919c72b4.pdf",
        "text": "https://archive.orkl.eu/18c0a89c955b06ef112a48590e14879c919c72b4.txt",
        "img": "https://archive.orkl.eu/18c0a89c955b06ef112a48590e14879c919c72b4.jpg"
    }
}