{
    "id": "a8f0a318-b435-4921-a04c-06326293fbe6",
    "created_at": "2023-01-07T02:06:34.044533Z",
    "updated_at": "2025-03-27T02:16:55.384624Z",
    "deleted_at": null,
    "sha1_hash": "52bb248d45e9ae7a8c0a0c804d528c18b780bfdc",
    "title": "Threat Horizons - September 2022",
    "authors": "Google's Cybersecurity Action Team (GCAT)",
    "file_creation_date": "2022-09-26T15:09:41Z",
    "file_modification_date": "2022-09-26T15:09:41Z",
    "file_size": 3114344,
    "plain_text": "Threat\nHorizons\nSeptember 2022 Threat Horizons Report\n\nSeptember 2022\nFor more information, visit gcat.google.com\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nTable of contents\n\nMission statement\n\n03\n\nLetter from the editor\nStrategic perspective: The impact of intelligence\nsharing on adversary operational planning\n\n04\n\nSummary\nView from the frontlines: Threat actors use weak or\ncompromised creds to target SSH, WordPress in Q2\n\n06\n\nThreat trends\nSocial engineering campaign disrupted and moved off of Google\n\n08\n\nMalicious files and URLs slipping by IT governance controls\n\n09\n\nCloud and SaaS-enabled environments increasingly vulnerable to the connectedness of SSO\n\n14\n\nCloud application security reviews and data discovery\n\n17\n\nHijack of cloud infrastructure service accounts set to rise\n\n22\n\nResponding to the next SolarWinds: Logging tools\n\n26\n\n2\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nMission statement\nThe Google Cloud Threat Horizons Report\nbrings decision-makers strategic intelligence\non current and likely future threats to cloud\nenterprise users and the best original\ncloud-relevant research and security\nrecommendations from across Google’s\nintelligence and security teams.\n\n3\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nLetter from the editor\n\nStrategic perspective: The impact\nof intelligence sharing on adversary\noperational planning\nWhen you face a compromise from an Advanced\nPersistent Threat (APT) group, it can feel overwhelming\nfacing off alone against hackers working for a major\nmilitary or intelligence agency or organized crime\ngroup. Moreover, those threat groups are often multidisciplinary, with the resources to recruit insiders,\nconduct sophisticated open source research, and\nexecute social engineering activities, using teams of\ndevelopers creating or adapting their own exploits and\ntool sets, and ready to exploit any gains with a robust\npropaganda apparatus. They bring all the scale of a\nnation-state to bear on a single, outmatched victim.\nBut that very sense of scale also gives network\ndefenders certain advantages, especially in\ncloud deployments.\nGovernment-backed hackers often attempt to collect\nintelligence or prepare for attacks against a wide variety\nof networks to meet a single requirement common\nto all their victims. For example, multiple government\nministries in several different countries might be\nhacked, with the common underlying goal of obtaining\nintelligence on foreign diplomatic efforts or military\nactivities in the region. Private companies of various\nsizes and locations might all be compromised because\nof their importance to an entire sector to enhance the\neconomic competitiveness of the country sponsoring\nthe operation. Personally identifying information (PII)\n\nfrom hotels, healthcare, and financial institutions\ncould all be stolen in order to support\ncounterintelligence investigations or the targeting\nof dissidents.\nEach victim organization feels specifically targeted,\nbut from the government sponsor’s point of view,\nthese are all just single points of information\ngathering in a much larger collection plan that\nprobably involves other tools as well. To meet their\ngovernment mission, state-sponsored malicious\ncyber actors often need to be ready to collect\nimportant information on short notice, and they want\nto be pre-positioned on as many victims’ networks\nas possible to ensure the loss of access to any one\nnetwork doesn’t prevent them from accomplishing\nthat mission.\n\nPersonally identifying\ninformation (PII) from\nhotels, healthcare, and\nfinancial institutions could\nall be stolen in order to\nsupport counterintelligence\ninvestigations or the targeting\nof dissidents.\n\n4\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Letter from the editor, cont’d.)\nIn many cases, these networks will be targeted with\na common tool set, with operations launched from\nsome overlapping infrastructure. They might even have\ndeveloped their own 0-day exploits in an attempt to\ngain access to as many critical targets as possible\nbefore victims patch their systems. As we have seen\nin recent years with log4j and Microsoft Exchange\nvulnerabilities, state-sponsored actors are also skilled\nat rapidly adapting new vulnerabilities discovered by\nothers for their own purposes.\nWhat this means for network defenders is simple:\nBecause these adversaries are attempting to operate\nat scale and as part of a larger intelligence apparatus,\nthreat-intelligence sharing and patching impairs the\nscale at which even the most sophisticated threat\ngroups can gain access with their latest tools. Attackers\nmight feel confident that they can gain access to any\nparticular victim with a new exploit, but the very power\nand usefulness of that exploit means they also face\nhigh opportunity costs: if their first targets rapidly warn\nother would-be targets, who then inoculate themselves,\nthose future operations won’t be as successful.\n\nMoving infrastructure to the cloud can improve\nresilience as enterprises gain visibility into their\nown systems and defense strategies can be\ndeployed more reliably than on-premises\ntechniques. The defensive advantages of scale in\nthe cloud also apply to stopping less sophisticated\nbut more widespread threats from cybercriminals,\nskilled individuals, and less-spectacular nationstate efforts. Distributed denial-of-service attacks,\nespecially if targeted against time-critical services\nor on key dates, can cause significant financial\ndamage. To paraphrase National Cyber Director\nChris Inglis, we want to create a situation where\nthreat actors have “to beat all of us to beat any\nof us.”\nChristopher Porter is the Head of Threat\nIntelligence for Google Cloud.\n\nWith enough persistence, these APT groups can\neventually gain access to some of even the bestdefended networks. Turning an operation from one that\naffects 1,000 organizations to one that only impacts\n10, while still very serious, is an achievable and real\nimprovement for defenders as a community. Rapid\nsharing and analysis of intelligence on new operations\nand exploits through ISACs, community-driven efforts,\nwith commercial security providers, with built-in\nsecurity tools like Chronicle’s integration with BigQuery,\nand with public-sector partners turns the assumptions\nof the benefits of scale on their head. Together, we can\nmake the bad guys make tough choices.\n\n5\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nSummary\nCloud Compromise Factors (Q2 2022)\n\nView from the frontlines: Threat\nactors use weak or compromised\ncreds to target SSH, WordPress in Q2\nDespite relative incidents being down due to customer\ncontrols overall, in Q2 threat actors frequently\ntargeted weak and default-password issues for\ninitial compromise, factoring in over half of identified\nincidents. A wide array of software suites were targeted\nfor exploitation, with SSH, WordPress, and RDP software\nall frequently targeted. Once inside, threat actors\nfrequently engaged in cryptomining, accounting for\nnearly two-thirds of incidents (65%).\nTargeting password issues is a low bar for entry for\nthreat actors, making it an often-successful technique\nfor malicious actors that vary greatly in terms of their\ntechnical sophistication. The use of cryptominers\nindicates that the actors behind this type of targeting\nfrequently expect to be promptly found and blocked\n\nand they rely on volume of compromises rather than\nthe potential longevity of any specific compromise.\nIn addition, cryptominer attacks are often partially\nor fully automated, dramatically reducing their time\nto exploit an available vulnerability. As a result, while\nprevention is always paramount, clients should\nalso be focused on minimizing their response and\nmitigation time metrics, as the longer a cryptominer\ninfection persists the greater the potential cost. The\nhigh level of SSH activity suggests that organizations\nare using either no credentials or default credentials\nwhen spinning up cloud instances. Adjusting this\napproach via policy shifts can substantially improve\nan organization’s cyber risk exposure while using\ncloud services.\n\n6\n\nThreat Horizons\nFor\nFormore\nmoreinformation,\ninformation visit gcat.google.com\n\nThreat trends\n\n7\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nSocial engineering campaign\ndisrupted and moved off of Google\nIn June 2022, Google’s Threat Analysis Group (TAG), in\ncoordination with the Trust and Safety team, mitigated\na social engineering campaign hosted on Google Cloud\nStorage. The group had been tracked by TAG since mid\n2021 as COLEUS and is known externally as the “Stolen\nImages Evidence” campaign.\nThe campaign involved actors sending social\nengineering emails with legal threats for copyright\ninfringement through the contact forms on various\ncompany websites. The malicious emails alleged they\ncontained proof of stolen content and directed users\nto a file hosted on Google Cloud Storage or Firebase\nStorage which masqueraded as a Google Drive\npage. The file contained a malware payload and it is\nsuspected that this initial access broker operates a\ndistribution-as-a-service model catering to both APT\nand cybercrime groups.\n\nScreenshot of the file download hosted on Firebase Storage\ndisguised as a Google Drive page.\n\nCustomers can report spam, malware, or phishing by\nreporting suspected abuse on Google Cloud, phishing\nwebsites to Safe Browsing, and requesting content be\ninvestigated and removed from Google.\n\n8\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nMalicious files and URLs slipping\nby IT governance controls\nIssue description\nCloud and on-premises users can be harmed by\nmalicious files and URLs attempting to hide from\norganizations’ IT governance protocols. A recent\nreport from VirusTotal, analyzing 2021 through the\nmiddle of 2022, demonstrates how malware and\nphishing websites bypass corporate IT security controls.\nThe controls fail to identify the malware assets’\nnefarious nature as they check the assets’ context\nand external characteristics, instead of exploring their\ncontent in more depth. The report doesn’t describe\ntrends for each evasion technique, but two described\ntrends are becoming more popular: how malware\nincorporates icons visually similar to legitimate Windows\nsoftware, and how malware embeds and subsequently\nexecutes, from its packaging, installation programs\nfor legitimate software. We further found, via separate\nraw VT data searches, evidence of these suspect\ntechniques involving Google Cloud-related and more\ngeneral Google software.\n\n9\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Malicious files and URLS, cont’d.)\nThe VT report discusses four methods of how malicious\nfiles and URLs avoid detection.\nA. First, 10% of well-known, popular websites are seen\nto be distributing malware. Malware “legitimacy” is\ninherited from credible hosts.\nB. VT also found over 1 million signed malware\nsamples, 87% of which were signed via legitimate\ncertificates (the rest used revoked certificates, and\nso on). Apparently, attackers often fraudulently\naccessed signing workflows or signing authorities\nto sign their code – increasing the likelihood of its\ndownstream acceptance.\n\nD. Finally, attackers also incorporated malware\ninto legitimate software installers, or included\nlegitimate software installers in their own malware\n“packaging” – again, to encourage installation via\n“good” association.\nSuch techniques can impact Cloud clients. We reviewed\nvarious Google-related VT data in the context of\nthe techniques described above. We found seven\nmalware packages that included the Cloud-executable\nGoogleCloudSDKInstaller.exe, which installs the Google\nCloud CLI capability on Windows machines.\n\nC. Attackers also created malicious applications\nincorporating icons visually similar to popular\nWindows applications, and designed malicious\nwebsites using URL favicons visually similar to wellknown websites – for example, to build trust via\n“similarity.” For example, below is a graphic from\nthe report on the growing number of submitted\nmalicious samples with icons similar to popular\nWindows software.\n\n10\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Malicious files and URLS, cont’d.)\n\nHere is VT data from one such package, Synaptics.exe,\nand the legitimate GoogleCloudSDKInstaller.exe as one\nof its dropped files.\nWe found several Google non-Cloud examples of such\n“file inclusion” in our VT data searches as well. Other\nlegitimate Cloud files could also be packaged with other\nmalicious installers.\n\nby” authenticated users. Using logged-in employees as,\neffectively, “conduits,” malware could mount Cross-Site\nRequest Forgery-type attacks via HTTP, CLI, or similar\nchannels, undermining Cloud resources. Use vigilance\nregarding the techniques discussed in the VT report.\n\nOther Cloud-related attacks are also possible. For\nexample, it is possible for websites to contain credible,\nalmost-indistinguishable logs compared to Google\nWorkspace logs – and therefore become phishing\nattack-vectors against Cloud clients. (Our preliminary\nVT data analysis did not find any Cloud URL favicons\nimitated by URLs submitted to VT. Of course, as VT\ndoesn’t contain all URLs, this may happen with other\nwebsites.) Also, if an organization has weak VM/\ncontainer governance controls (for instance, not using\nantivirus software on VMs ingesting internet-originating\nfiles), or user (or administrator) access has been\ncompromised, the malicious software described in the\nVT report could be downloaded into Google Cloud VMs\n– potentially leading to container abuse. Finally, if any of\nsuch malware infects on-premises environments, it may\nalso compromise Cloud services via commands “issued\n\n11\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Malicious files and URLS, cont’d.\n\nSuggested mitigations for Google Cloud clients\nGiven the variety of potential attack vectors arising from\nthe malware assets, as discussed earlier, the controls\nrecommended below provide for a multilayer defensein-depth strategy. The detective and preventive controls\nshould help monitor and block the malware assets.\nThey look more deeply into assets’ operations so as to\nbetter comprehend behavior. And while all the controls\nin the following list are suggested, the top three are\nparticularly recommended.\n1.\n\n2.\n\n3.\n\nOnly install software from trusted hosting locations\nand manufacturers. Use VirusTotal, check the\nsoftware’s hash code, and security-test files as\nfurther validations when installing software.\nConsider turning on the Advanced Protection\nProgram (APP) to protect cloud users from different\nonline attacks. The APP protects against phishing\nattacks by requiring users to log in to Google\nAccounts using their security keys, flags or blocks\nusers from downloading potentially malicious files,\nand offers other safeguards. The APP might have an\nimpact on user experience – such as via additional\ninteractions with security keys – but should still\nbe seriously considered, at least for staff with\nsignificant sensitive data access.\nUse Chrome Enterprise (CE) to secure users’\ninteractions with general Cloud services. CE\ncomponents include the Chrome browser, with\nits many security features against malicious URLs\n(for example, for this post, arising from a “similar\nfavicon” attack) – such as site isolation, which\nprevents malicious sites from stealing data from\nthe other websites a user is working with. CE also\nincludes ChromeOS, which, among its security\nfeatures, is a read-only OS, thereby substantially\npreventing local\n\nmalware installation.\n4. Use Chronicle for threat analysis. Chronicle\nmerges the significant security and network\ntelemetry generated within a customer’s Google\nCloud instance with Google and non-Google\nthreat intelligence feeds to show individualized\nthreats within each customer’s environment.\nUse Siemplify, Google’s recently acquired SOAR\nplatform, to automate responses for specific\nthreats (for example, shutting down a rogue VM\ninstance if certain conditions were met).\n5. The Event Threat Detection (ETD) capability\nwithin the Security Command Center (SCC) can\nbe turned on to quickly detect Google Cloud\nthreats based on logged cloud events. ETD\nmonitors the Cloud Logging stream as well as\nGoogle Workspace logs, analyzing the creation,\nmodification, and so on, of Google Cloud instance\nresources, Google Workspace domain user\nsign-ins, and many other activities. ETD deduces\nthreats from logged event patterns.\n6. Control which third-party and internal apps can\naccess Google Workspace data. Using Google\nAdmin console settings, customers can permit,\nrestrict, or block connectivity to third-party\nand internally made cloud apps by, respectively,\nrelaxing or restricting the OAuth 2.0 scopes if/as\nused by such apps. Cloud data can be protected\nshould such apps become compromised.\n7.\n\nUse Container Analysis to perform vulnerability\nscans on container images in Google Cloud’s\nContainer Registry, the newer Artifact Registry,\n\n12\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Malicious files and URLS, cont’d.)\nor on local images customers build to place into\nthese two repositories. Scans produce severity\nlevels, including CVSS scores, permitting prioritized\nremediation.\n8. Ensure that the Security Health Analytics\nscanner within the SCC is turned on. The Security\nHealth Analytics scanner probes a variety of\nparameters in the Google Cloud environment\nat an asset-dependent cadence, and when the\nconfiguration for certain assets change, identifying\nconfiguration deficiencies. The scanner looks for\nmisconfigurations in containers, IAM settings, and\nother assets.\n\n13\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nCloud and SaaS-enabled\nenvironments increasingly vulnerable\nto the connectedness of SSO\nAs cloud hosting becomes more prevalent, and the\nvolume of cloud-optimized cross-application capabilities\nincreases, it is our assessment that the volume of cloudtargeted attacks leveraging corporate single-sign-on\n(SSO) logins will rise. This is true of SSO for enterprise in\nmany forms, including those with Software/Security-asa-Service (SaaS), but especially impactful to cloud due\nto the ability to access and provision cloud resources.\nKimsuky, a nation-state threat actor, has been observed\nby researchers at Volexity accessing user Gmail account\ndata through a hidden Chrome browser extension\nknown as SHARPEXT.1 The group, which reportedly\nworks toward Democratic People’s Republic of Korea\n(DPRK) interests – according to members of the Korea\nInternet & Security Agency2 – was able to install a\nmalicious browser extension via phishing, leveraging\npre-authenticated browser activity to read and exfiltrate\ndata from other services such as Gmail content.3 The\nconvergence of technologies, enabled by SSO, should\nbe a point of concern for those transitioning to a cloudcentric environment, as the increased productivity\nprovided by seamless SSO also provides broader access\nfor attackers to otherwise confidential data.\n\nFigure 1. Legitimate Google-account SSO user flows can be\ntriggered by an application (such as a browser extension) or\naccessing a website.\n\nRascagneres, Paul, and Thomas Lancaster. “SharpTongue Deploys Clever Mail-Stealing Browser Extension “SHARPEXT.”” Volexity, Jul 28, 2022, https://www.volexity.com/blog/2022/07/28/\nsharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/. Accessed Aug 9, 2022.\n2\nLee, Taewoo, et al. “Kimsuky, STOLEN PENCIL, Thallium, Black Banshee, Velvet Chollima, Group G0094 | MITRE ATT&CK®.” MITRE ATT&CK®, Aug 26, 2019, https://attack.mitre.org/groups/\nG0094/. Accessed Aug 9, 2022.\n3\nGoodin, Dan. “North Korea-backed hackers have a clever way to read your Gmail.” Ars Technica, Aug 3, 2022, https://arstechnica.com/information-technology/2022/08/north-korea-backedhackers-have-a-clever-way-to-read-your-gmail/. Accessed Aug 9, 2022.\n1\n\n14\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud and SaaS-enabled environments, cont’d.)\n\nObservations\nIn this case, the initial infection vector is via phishing\nand results in the installation of a developer-mode\nbrowser extension which, through a DevTools\nworkaround, has its security warnings suppressed and\ntargets a user’s cloud-accessed data (such as online\nemail applications).\nWhile this malware specifically targets certain resources\n(Gmail and AOL mail), this is a design feature to reduce\nthe likelihood of detection and need not be so targeted.\nThe value of this method is to embed with the browser,\nwhich maintains the SSO and allows permission to the\napps to leverage that access. This could theoretically\nbe achieved with any application and it is assessed\nthat future Trojans may use similar techniques to evade\ndetection and inherit the valuable SSO accesses.\n\nKey risks\nAttackers gaining legitimate user account verification\ncan cause serious problems:\n1.\n\nLegitimate access credentials. The initial\ncompromise leverages existing credentials, which\nmakes it difficult to distinguish from legitimate\nadmin access.\n\n2.\n\nMulti-factor authentication (MFA) is ineffective.\nSince the user has already logged in and is simply\nallowing access permissions, traditional MFA\nmethods do not protect the user.\n\n3.\n\nEase of user permission flow. A user login\n(inputting a password) may have already been\nconducted, so providing permission to the malicious\napplication is single-click.\n\n4. Expected and trusted application. Access\nrequests are only submitted as part of an access to\na web app, browser plugin, or similar that the user\nintends to access. Hence, the access request is\nexpected and has high trust with the user.\n5. Third-party data leakage. Apps and browser\nextensions that leverage these permissions may\nalso be retaining user account data to third-party\nhosting, resulting in unintended data leaks.\n6. Single point of access and failure. The potential\nbreadth of an SSO compromise is vast and, without\nswift remediation, can result in an unknown level\nof compromise as the attacker can access a wide\nrange of company infrastructure and data.\n7.\n\nLack of user awareness. Depending on the initial\ninfection vector, the user may be unaware of the\napplication’s activity on their device, as warnings\nmay be suppressed.\n\nFigure 2. Javascript module of Kimsuky’s “SHARPEXT” Chrome\nextension malware, which specifically searches for SSOauthenticated email account access. (Image: Volexity4)\n\nRascagneres, Paul, and Thomas Lancaster. “SharpTongue Deploys Clever Mail-Stealing Browser Extension “SHARPEXT.”” Volexity, 28 July 2022, https://www.volexity.com/blog/2022/07/28/\nsharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/. Accessed 9 August 2022.\n4\n\n15\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud and SaaS-enabled environments, cont’d.)\n\nMitigations\n1.\n\nRaise user awareness. We are yet to normalize\nuser awareness around SSO access permissions to\nthe same level as link verification in phishing emails,\nand it is an important addition to any SSO-enabled\nenvironments’ user security training.\n\n2.\n\nSSO account and access monitoring. It is vital\nto implement effective monitoring of SSO account\nactivity and automated remediation methods as\na standard in order to detect and remediate SSO\naccount compromise.\n\n3.\n\nManaging SSO-enabled software installation.\nAvoid allowing installation of unvetted software\non corporate devices that could erroneously\nrequest user access permissions. Manage such\nsoftware through centralized software provisioning\nprocesses that allow for the verification of\nlegitimate software, and regularly review and verify\ninstalled software. Zero-trust environments such as\nBeyondCorp Enterprise implement these sorts of\npolicies at a fundamental level.\n\n4. Enterprise browser management. This attack, as\nwith many that target the browser, succeeds due\nto stealthy manipulation of the users’ settings and\nthe ability to run scripts based on browser activity.\nCorrectly configured, implementing an enterprisewide browser management solution (such as\nthat implemented in Chrome Enterprise) can\nhelp prevent the successful running of malicious\nextensions.\n\n16\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nCloud application security\nreviews and data discovery\nIssue description\nA mid-2021 International Data Corporation (IDC) survey\nindicated that almost three-fifths of organizations felt\nthat inadequate visibility and identity management\nwere major cloud infrastructure concerns,5 as attackers\ntypically exploit excessive application access rights,\nmisconfigured data-sharing capabilities, and similar\nattack vectors to abuse cloud assets. The IDC survey\nhighlighted a key impact from such vulnerabilities:\n63% of the organizations actually had sensitive\ndata exposed.\n\nCloud application\nsecurity reviews and a\ndata discovery process\nfacilitate secure cloud\nworkloads and user\ninteractions and effective\ndata use.\nAnd this grew to 85% for firms spending at least $50M\nannually on cloud infrastructure. Cloud application\n\nsecurity reviews and a data discovery process\nfacilitate secure cloud workloads and user\ninteractions and effective data use. Understanding\napplication security threats – and having more\nvisibility into cloud data locations and purpose –\nreduces vulnerabilities and permits effective data\nanalysis.\n\nCloud threats\nOrganizations continue to upload diverse data, such\nas business documents, PII, and healthcare data –\nas well as onboard more applications – to the cloud.\nThe goal is to use the cloud’s scalability, analytics,\nand other features. But security issues can arise\nwithout appropriate IT governance:\n•\n\nIn Q1 2022, according to the FBI, Russianstate-supported attackers gained access to a\nnon-governmental organization (NGO) cloud\ninstance as they brute-forced the instance’s\npassword and enrolled their own device in\nthe NGO’s multi-factor authentication (MFA)\nprocess.6 Capturing the password and using\ntheir “own” MFA device, the attackers ultimately\nexfiltrated the NGO’s data.\n\nErmetic, “IDC Survey Report: State of Cloud Security 2021,” Ermetic [web survey access], 2021, https://l.ermetic.com/wp-idc-survey-results-2021, (accessed May 12, 2022).\nGatlan, Sergiu, “FBI warns of MFA flaw used by state hackers for lateral movement,” BleepingComputer, Mar 15, 2022, https://www.bleepingcomputer.com/news/security/fbi-warns-ofmfa-flaw-used-by-state-hackers-for-lateral-movement/, (accessed Jul 29, 2022).\n5\n6\n\n17\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud application, cont’d.)\n•\n\n•\n\nAccording to a security publication, and security\nvendor TrendMicro, in 2021, cybercriminal\ngroup TeamTNT launched a campaign against\nmisconfigured Docker REST APIs exposed in\nmany public cloud instances. 7 Exploiting weak\nAPI passwords, promiscuous instance firewall\nrules, and other flaws, the threat actor pulled and\ninstalled malicious container images from the\nDocker Hub central repository into these cloud\ninstances. The malicious container code then\ntried stealing AWS login credentials, installed\ncryptomining software, and tried other means\nof VM/container abuse. By late 2021, 150K of\nTeamTNT’s malicious images were downloaded\nvia Docker Hub, suggesting relatively widespread\ncompromise.\n\nexamined the financial implications stemming from\ncertain cloud architecture choices. For instance:\n•\n\nThe NY Department of Financial Services\n(NYDFS) Cybersecurity Regulation, 23 NYCRR\n500, requires banks, insurance companies, and\nother financial institutions operating in NY State\nto maintain an information security program.\nProviding sufficient funding to implement\nmodern data security standards, maintaining\nan incident response process, and other tenets\nare the requirements. If there is a breach due to\nimproper implementation of such requirements,\nfinancial penalties can rise to $1,000 per user\nper violation – which could be significant if many\nusers or records are compromised. In June 2022,\nfor example, the NYDFS fined several Carnival\nCruise Line companies (CCLC) a total of $5M.\nDuring years 2019-2021, CCLC was impacted by\nransomware, phishing, and other data breaches\nand a NYDFS examination indicated that CCLC\nlacked MFA processes, procedures for monitoring\nunauthorized network traffic, and other key\nsecurity controls.9\n\n•\n\nWithout a data oversight process, a firm may\nalso overspend on data storage. If data-access\nfrequency is not examined, companies may\nstore data in a CSP’s more expensive “standard”\nstorage tier. However, storing infrequently used\ndata in the “cold” or “archive” storage tiers would\ncost less. It costs more to retrieve data from such\ntiers, but storing infrequently used data in such\ntiers leads to considerably higher savings overall.\n\nIn a Q4 2021 security-industry survey sponsored\nby vendor CyberArk, security leaders indicated\nthat over 80% of an organization’s internal\napplications – including Google Cloud and other\ncloud-based platforms such as AWS, Salesforce,\nand ServiceNow – experienced access abuse from\ninternal staff over the past 12 months.8\n\nRegulatory and business risk\nImproper cloud oversight leads to regulatory and\nbusiness risks, too. Some organizations have not\ndevoted proportional security resources to understand\ncorresponding vulnerabilities. For example, they may\nforget that operations by low-skill cybercriminal groups\ncan lead to much larger fines on the organization than\npotentially anticipated. Or organizations might not have\n\nGatlan, Sergiu, “Cryptojacking worm steals AWS credentials from Docker systems,” BleepingComputer, Aug 18, 2020, https://www.bleepingcomputer.com/news/security/cryptojacking-wormsteals-aws-credentials-from-docker-systems/, accessed Jul 27, 2022; and Trend Micro Research, “Compromised Docker Hub Accounts Abused for Cryptomining Linked to TeamTNT,” TrendMicro,\nNov 9, 2011, https://www.trendmicro.com/en_us/research/21/k/compromised-docker-hub-accounts-abused-for-cryptomining-linked-t.html, accessed Jul 26, 2022.\n8\nCyberArk, “CyberArk Research: Lack of Security Controls and Visibility Into User Activity Continue to Put Organizations at Risk,” CyberArk, Nov 2, 2021, https://www.cyberark.com/press/cyberarkresearch-lack-of-security-controls-and-visibility-into-user-activity-continue-to-put-organizations-at-risk/. Accessed Jul 12, 2022.\n9\nPeter Baldwin, Bob Mancuso, and Jane Blaney, “New York Department of Financial Services Announces $5 Million Penalty in Most Recent Cybersecurity Enforcement Action,” Faegre Drinker\nBiddle & Reath LLP, Jul 11, 2022, https://www.discerningdata.com/2022/new-york-department-of-financial-services-announces-5-million-penalty-in-most-recent-cybersecurity-enforcement-action/.\nAccessed Sep 2, 2022.\n7\n\n18\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud application, cont’d.)\n\nProviding governance\nAppropriate cloud governance can address the risks\ndiscussed earlier. As data volumes and application\ncapabilities grow, cloud administrators are interested in\nunderstanding:\n•\n\nThe cloud data’s location, including the projects it is\nbeing shared with\n\n•\n\nIf the data contains any sensitive information, and\nhow data contents are changing over time\n\n•\n\nIf applications and workloads are implementing\nappropriate security controls, given data\nclassifications, including providing support for\nregulations – like data residency – as required\n\nApplication security reviews, which examine application\narchitecture, data security controls, likely threat\nscenarios, and similar aspects can answer such queries.\nHowever, given the considerable manual effort involved,\nsuch assessments are performed less frequently and\non a smaller number of key applications. When there\nare many applications to examine, or for real-time\nmonitoring, a more automated security process should\nbe created.\n\nThis process matches the effort of application\nsecurity reviews to the risk that different\nworkloads present. It also permits data to be\nannotated with its “characteristics” (like backup\nlocations, and so on), and redacted – at a\nregular cadence. This kind of an approach (with\nsuggested Google Cloud tools mentioned on the\nnext page), lets IT owners:\n•\n\nKeep enterprise asset and application\ninventories (for example: CMDB) up to date\n\n•\n\nKeep data classifications current, including\nas sensitive data is added/removed from\nrepositories\n\n•\n\nAlign application security controls – including\ndata redaction – to better-understood\ninformation security risks, including\nadhering to regulations such as data-breach\nnotification laws when in-scope data has been\nidentified\n\nOne “cost-effective” cloud governance process to\nassess different kinds of application workloads based\non known a priori risks is shown below.\n\nLLP, Jul 11, 2022, https://www.discerningdata.com/2022/new-york-department-of-financialservices-announces-5-million-penalty-in-most-recent-cybersecurity-enforcement-action/,\n(accessed Sep 2, 2022).\n\n19\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud application, cont’d.)\n\nGoogle Cloud mitigations\nThe following are suggestions for Google Cloud\ncustomers:\n1.\n\nPerform cloud application security reviews based\non the risk of onboarded applications, workloads, or\ndata feeds. For high-sensitivity and key moderatesensitivity assets, in-depth security reviews should\nbe carried out annually. Less sensitive or less\ncritical assets can be assessed less frequently\n– such as every two, three, or more years. Such\nreviews can reduce risk. In 2018, a financial firm\ncorrelated BitSight’s Security Ratings, which track\norganizations’ publicly facing security controls\n(like patched web servers and so on) with security\nbreaches affecting over 3,000+ firms.10 Compared\nto firms with higher Security Ratings, those with\nlow Security Ratings were four times as likely to\nbe breached. Application security reviews would\nimprove an organization’s security controls, thereby\nincreasing its Security Ratings. This in turn should\nreduce the firm’s susceptibility to breaches, as per\nthe study.\n\n2.\n\n10\n\nUse a DLP solution that supports automated\nscanning and classifying of sensitive data, and\nreal-time data redaction and de-identification using\ntokenization or other techniques. Tokenization\nconverts a sensitive data element, like a Social\nSecurity Number, into an obfuscated string. The\nprocess is consistent – for example, the same data\nelement is converted into identical tokens and basic\ndatabase operations, like JOINs or search, continue\nto work despite the “anonymized” tokens. For\nGoogle Cloud customers, Google has introduced\nCloud Data Loss Prevention to address such needs.\nCloud DLP can automatically classify and de-\n\nidentify data within Cloud Storage, BigQuery,\nand Datastore. It can also support additional\ndata sources. Cloud DLP’s ability to tokenize\nand do other data redactions will reduce the\npotential for data abuse, as inappropriate data\naccess will yield, effectively, relatively valueless\ninformation.\n3.\n\nUse Dataplex to search for and tag Google\nCloud data with technical and business\nmetadata, such as its lineage, freshness, any\ntransformation process modifying it, and so\non. Such visibility gives users data “context”\nto answer various governance questions.\nFor example, if a data set’s confidentiality\nis compromised, knowing its lineage would\nidentify related data assets that also need to be\ninspected/secured as they’re at risk now, too.\nFurther, cataloging data also reduces breach\npotential – as knowing the data’s sensitivity and\nusage allows for its selected security controls to\nmatch its likely abuse scenarios.\n\n4. Use Data Access audit logs and Admin Activity\naudit logs within the Google Cloud Logging\ntool set to determine which users or accounts\nare viewing or writing data, or changing data\npermissions. Monitoring what data access\nevents are occurring this way also reduces\nbreach potential, as organizations can detect\nmisuse by monitoring for unexpected logged\nevent patterns. Such audit logs may also\nassist with forensic analysis, and could\nprevent a repeat of prior data security\nincidents by understanding why they were\nsuccessful originally.\n\nResearch Signals, “Cybersecurity factors powered by BitSight,” IHS Markit, Mar 31, 2022, https://cdn.ihs.com/www/blog/Cybersecurity-factors-powered-by-BitSight.pdf, (Accessed Jul 14, 2022).\n\n20\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Cloud application, cont’d.)\n5. Follow GCAT’s policy intelligence tool\nrecommendations to optimize different Google\nCloud user identity and data management controls,\nincluding helping automate user access recertifications, placing data into cold storage if it\nhasn’t been accessed in 30 days, and improving\nanalogous capabilities. Google Cloud permits\nexpressing various security policies as code so\nadministrators can monitor, and action, policy drifts\nin a more automated manner. For example, the\nrole recommendations tool uses machine learning\nto recommend user-permission modifications by\nreviewing a user’s prior 90-day resource access\npatterns. If permissions haven’t been used, the tool\nmay recommend their removal. An administrator can\n“apply” such recommendations via Google Console\nor API calls, to therefore enforce least-privilege in\na more streamlined manner. Other policy tools that\nstreamline Google Cloud end-to-end user access\nand data management can be found here.\n6. The GCAT Risk Governance of Digital Transformation\nin the Cloud guide suggests how cloud security\ncontrol effectiveness can be more readily\nmeasured. Data-driven analysis can occur because\nthe controls cover the entire cloud environment, due\nto the creation of standardized, widely deployable\nworkloads with relevant integrated controls –\nthe embedding of which can also be measured\n– and the integration of security into software\ndevelopment, ensuring that appropriate controls are\nintegrated into code (which can also be measured\nbefore code release). Using such “metrics,” Google\nCloud customers can manage control effectiveness\n(for example, after application security and datadiscovery assessments have completed). They can\ncheck if controls operate properly after the need for\nthem is established.\n\n21\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nHijack of cloud infrastructure\nservice accounts set to rise\nCyberthreat groups can reduce the risk their attack\nwill be detected by leveraging poorly defended and\ntrusted servers, domains, or applications. The use of\ncompromised legitimate infrastructure allows actors\nto disguise their operations as legitimate traffic11\nand has been observed as an effective technique\nagainst even the most experienced of security\nprofessionals.12 Leveraging this attack vector can be\nmuch simpler for the attacker if they can manipulate\nthe infrastructure to better fit the disguised approach.\nAs organizations increasingly transition toward cloud\nhosted, this presents a new attack surface that can\noffer an even greater effect for an even lower exposure:\ncompromising the service-account credentials for the\nunderlying cloud project that hosts an organization’s\nenterprise network itself, allowing architectural\ncontrol over trusted infrastructure in a target’s supply\nchain, and the potential for cloud admin access to go\nundetected for long periods of time. Threat groups\nhave been observed leveraging compromised serviceaccount credentials to run expensive cryptomining\nworkloads in customer environments, but greater\nconcern would arise should they choose to keep these\nactions covert and leverage the access for other\nnefarious activities. During May–July inclusive,\n\nGoogle Cloud has detected projects affected and\ntheir corresponding exposed service-account\ncredentials. These compromises often get detected\nand remediated before they provision high volumes\nof resource, but even the few that avoid detection\ncan cause significant impact. The disproportionate\nreturn on investment for such attacks is assessed to\nincrease their prevalence in the coming years and\nhas the potential to impact across all platforms where\ncredential exposure is a risk.\n\nFigure 1. Accessing the legitimate infrastructure’s underlying cloud\nhosting environment provides greater opportunities for attack tailoring.\n\nGalloway, Jeremy, and Mitre. “Compromise Infrastructure, Technique T1584 - Enterprise | MITRE ATT&CK®.” MITRE ATT&CK®, Apr 20, 2022, https://attack.mitre.org/techniques/T1584/.\nAccessed Aug 8, 2022.\n12\nKopeytsev, Vyacheslav, and Seongsu Park. “Lazarus targets defense industry with ThreatNeedle.” Securelist, Feb 25, 2021, https://securelist.com/lazarus-threatneedle/100803/. Accessed\nAug 8, 2022\n11\n\n22\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Hijack of cloud infrastructure, cont’d.)\n\nKey risks\nThe combination of techniques provides several\nadvantages to the attacker:\n1.\n\nLegitimate access credentials. The initial\ncompromise leverages existing credentials, which\nmakes it difficult to differentiate from legitimate\nadmin access.\n\n2. Cloud-access keys in public code repositories.\nWhile capabilities to protect access credentials\nexist for cloud (such as Google Cloud Secret\nManager), they are not always implemented\nin infrastructure-as-code deployments and\ncredentials may be exposed through public code\nrepositories.\n3. Customization of onward attack. With cloud\nadmin access, the fake web server (or equivalent\ninfrastructure) can be customized to further\nobfuscate the malicious activity or improve the\ntechnical implementation of the attack, increasing\nthe chances of successful compromise.\n4. Stealthy pre-positioning. Once initial cloud\nadmin access is confirmed – provided that the\nadmin credentials are not changed – there is very\nlittle detectable “presence” of the attacker in the\nenvironment, which could allow them to remain\nhidden for long periods.\n5. Maskable persistence. Cloud infrastructure\nprovides an additional layer of persistence options\nfor an attacker as they can create cloud access\naccounts, account reset options, and – as a\nfallback – traditional persistence on new network\ninfrastructure (such as the new fake web server).\nThe increased scope of access and low\ndetectable presence increases the complexity\nof persistence detection.\n\n23\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Hijack of cloud infrastructure, cont’d.)\n\nObserved events\nA recent incident we tracked observed threat actors\nleveraging compromised service-account credentials\nto abuse targets’ infrastructure by provisioning cloud\nresources. These resources can be used for any\npurpose, including but not limited to cryptomining,\nhosting malicious content, or pre-positioning for an\nonward attack.\nIn this instance, the use of service-account access was\nlimited only to provisioning vast amounts of resources. It\nis very feasible, however, that more sophisticated actors\ncould leverage this access for less detectable and\nlonger-term goals, such as establishing “jump boxes” in\nvictim environments to avoid detection or the creation\nof additional service accounts as a form of persistence.\n\nFigure 2. CPU resource usage over time showing a threat actor provisioning cloud resources in a customer environment using stolen\nservice-account credentials.\n\n24\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Hijack of cloud infrastructure, cont’d.)\n\nMitigations\nTaking the time to implement good security\nconfiguration in cloud environments is vital:\n•\n\nSet up private connectivity for your service\naccounts so that, even if compromised, your\nservice-account credentials can only be accessed\nthrough approved connections and connectivity\nis restricted from IP ranges not in pre-approved\nranges\n\n•\n\nMaintain a policy of least privileged access for all\nof your accounts, including service accounts, to\nreduce the impact of a successful compromise\n\n•\n\nMonitor for leaked service-account credentials in\npublic code repositories and similar data stores\nwhere cloud API development may occur\n\n•\n\nEnsure that service-account credentials are\ntreated with appropriate levels of protections:\nEncourage best-practice Secret Manager usage\nfor development work and ensure that developer\nworkflows avoid leaking those credentials to public\nrepositories\n\n•\n\nAs a further indicator of anomalous activity, ensure\nappropriate budget alerts to signal where your\norganization may be billed for resources that it did\nnot use\n\n25\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\nResponding to the next\nSolarWinds: Logging tools\nOne of the key lessons learned from the SolarWinds\nincident was the importance of logging. In response,\nthe US government later published a memorandum of\nlogging requirements with a three-tier maturity model.\nThe SolarWinds incident went undetected for months\nand impacted over 18,000 of its customers.\n•\n\nDNS logs, when available, proved valuable in\nidentifying instances of SolarWinds Orion talking to\ncommand-and-control servers. Organizations can\nreview their DNS logs for connections to known IP\nand domain Indicators of Compromise (IOCs).\n\n•\n\nAuthentication and authorization logs uncovered\nthe attacker successfully authenticating through\nthe identity provider and later using this access for\nprivilege escalation.\n\n•\n\nEmail logs captured changes to email-forwarding\nrules. Robust logging, monitoring, and alerting\ncan help organizations prevent and mitigate email\nexfiltration.\n\nreconnaissance to identify privileged accounts and\nmove laterally. Organizations can improve detection\nof anomalous behaviors by reviewing and enabling\nsecurity-related logs and using pre-built queries for\nBigQuery and YARA rules for Chronicle to regularly\nmonitor cloud security threats such as enumeration\nof cloud resources and IAM permissions, or attempts\nto export service-account keys or edit the metadata\non compute instances. Google Cloud also provides\nlateral movement insights to help identify roles that\ngive a service account from one project the ability to\nimpersonate service accounts on another project.\nThe SolarWinds incident demonstrated attackers’\ntactics searching for and compromising privileged\naccounts to move laterally. When working with\nGoogle Cloud Identity and Access Management\n(IAM), organizations should be aware that broad\npermissions of basic roles such as Project Viewer,\nProject Editor, and Project Owner include thousands\n\nDuring the SolarWinds incident, attacks enumerated a\nlist of Active Directory (AD) accounts during\n\n26\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Responding to the next SolarWinds, cont’d.)\n#\n\nCloud Security Threat\n\n1\n\nLogin & Access Patterns\n\n1.01\n\nLogin from a highly-privileged account\n\nGoogle Workspace Login\nAudit (Cloud Identity Logs)\n\nT1078.004\n\n1.02\n\nSuspicious login attempt flagged by Google\nWorkspace\n\nWorkspace Login Audit\n(Cloud Identity Logs)\n\nT1078.004\n\n2\n\nIAM, Keys & Secrets Changes\nAudit Logs - Admin Activity\n\nT1484.002\n\nAudit Logs - Admin Activity\n\nT1484.002\n\n2.21\n\nPermissions granted to impersonate Service\nAccount\n\nLog Source\n\nAudit\n\nDetect\n\nATT&CK® Techniques\n\n2.22\n\nPermissions granted to create or manage Service\nAccount Keys\n\n3\n\nCloud Provisioning Activity\n\n3.01\n\nChanges made to logging settings\n\nAudit Logs - Admin Activity\n\nT1562.008\n\n3.11\n\nUnusual number of firewall rules modified in the last\n7 days\n\nAudit Logs - Admin Activity\n\nT1562.007\n\nSample use cases of the security analytics\n\nof permissions and can give attackers the ability to\ndelete log sinks, filter logs, delete the log bucket,\nor exfiltrate log data. Following the principle of\nleast privilege, utilize either pre-defined roles and\npermissions for Cloud Logging or create custom roles\nwith fine-grained permissions – rather than using the\navailable basic roles. When using a group for IAM rules,\norganizations should implement a directory-syncing\nmechanism with their source of truth to remove access\n\nand permissions for accounts that are suspended\nor deleted. Orphaned accounts with IAM roles and\npermissions create more opportunities for attackers\nto achieve lateral movement within an organization.\n\n27\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n(Responding to the next SolarWinds, cont’d.)\n\nGoogle Cloud Mitigations\n•\n\nConfigure Google Workspace logs to be sent to\nCloud Logging to centralize your visibility. Review\nGoogle Workspace Login Audit logs for events such\nas email forwarding outside your domain\n\n•\n\nCentralize logs and at the organizational level,\nwhich not only protects logs from being tampered\nwith by attackers but also gives defenders visibility\nacross the entire organization, making it easier to\nidentify threats and anomalous events\n\n•\n\nUtilize infrastructure as code to reduce\nconfiguration errors and automate deployments\nof logging agents for VMs, apply IAM roles and\npermissions, and even validate their scripts\n\n•\n\nReview Cloud Audit Log best practices, which\ninclude key actions to minimize your\norganization’s risk\n\n28\n\nThreat Horizons\nFor more information, visit gcat.google.com\n\n29",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        }
    ],
    "references": [
        "https://services.google.com/fh/files/blogs/gcat_threathorizons_full_sept2022.pdf"
    ],
    "report_names": [
        "gcat_threathorizons_full_sept2022.pdf"
    ],
    "threat_actors": [
        {
            "id": "a02bb810-5dd2-46c1-a609-b44d984d96d0",
            "created_at": "2022-10-25T15:50:23.505735Z",
            "updated_at": "2025-03-27T02:00:55.487109Z",
            "deleted_at": null,
            "main_name": "Stolen Pencil",
            "aliases": [
                "Stolen Pencil"
            ],
            "source_name": "MITRE:Stolen Pencil",
            "tools": [
                "Mimikatz",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f809bfcb-b200-4988-80a8-be78ef6a52ef",
            "created_at": "2023-01-06T13:46:39.186988Z",
            "updated_at": "2025-03-27T02:00:03.016358Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "Adept Libra"
            ],
            "source_name": "MISPGALAXY:TeamTNT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "c3ca592f-0669-49bd-ab5c-310007ab2fb4",
            "created_at": "2022-10-25T15:50:23.334495Z",
            "updated_at": "2025-03-27T02:00:55.445098Z",
            "deleted_at": null,
            "main_name": "TeamTNT",
            "aliases": [
                "TeamTNT"
            ],
            "source_name": "MITRE:TeamTNT",
            "tools": [
                "Peirates",
                "MimiPenguin",
                "LaZagne",
                "Hildegard"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dc78f675-b309-431d-8160-b8dcff037d4f",
            "created_at": "2024-05-01T02:03:08.142224Z",
            "updated_at": "2025-03-27T02:05:17.417972Z",
            "deleted_at": null,
            "main_name": "NICKEL KIMBALL",
            "aliases": [
                "Black Banshee ",
                "Crooked Pisces ",
                "Emerald Sleet ",
                "Kimsuky ",
                "Opal Sleet ",
                "SharpTongue ",
                "TA427 ",
                "THALLIUM ",
                "Velvet Chollima ",
                "APT43 "
            ],
            "source_name": "Secureworks:NICKEL KIMBALL",
            "tools": [
                " KONNI",
                " KimJongRAT",
                " Kimsuky",
                "BabyShark"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "760f2827-1718-4eed-8234-4027c1346145",
            "created_at": "2023-01-06T13:46:38.670947Z",
            "updated_at": "2025-03-27T02:00:02.888195Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Thallium",
                "G0086",
                "APT43",
                "Springtail",
                "Sparkling Pisces",
                "Velvet Chollima",
                "Black Banshee",
                "Operation Stolen Pencil",
                "Emerald Sleet",
                "THALLIUM"
            ],
            "source_name": "MISPGALAXY:Kimsuky",
            "tools": [
                "RevClient",
                "xrat",
                "QUASARRAT",
                "RDP Wrapper",
                "TightVNC",
                "BabyShark"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "191d7f9a-8c3c-442a-9f13-debe259d4cc2",
            "created_at": "2022-10-25T15:50:23.280374Z",
            "updated_at": "2025-03-27T02:00:55.423485Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "Kimsuky",
                "Black Banshee",
                "Velvet Chollima",
                "Emerald Sleet",
                "THALLIUM",
                "APT43",
                "TA427"
            ],
            "source_name": "MITRE:Kimsuky",
            "tools": [
                "schtasks",
                "Amadey",
                "Brave Prince",
                "CSPY Downloader",
                "gh0st RAT",
                "AppleSeed",
                "NOKKI",
                "QuasarRAT",
                "Gold Dragon",
                "PsExec",
                "KGH_SPY",
                "Mimikatz",
                "BabyShark"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "71a1e16c-3ba6-4193-be62-be53527817bc",
            "created_at": "2022-10-25T16:07:23.753455Z",
            "updated_at": "2025-03-27T02:02:09.963016Z",
            "deleted_at": null,
            "main_name": "Kimsuky",
            "aliases": [
                "APT 43",
                "Black Banshee",
                "Emerald Sleet",
                "ITG16",
                "KTA082",
                "Kimsuky",
                "Larva-24005",
                "Operation Baby Coin",
                "Operation Covert Stalker",
                "Operation DEEP#DRIVE",
                "Operation DEEP#GOSU",
                "Operation Kabar Cobra",
                "Operation Mystery Baby",
                "Operation Red Salt",
                "Operation Smoke Screen",
                "Operation Stealth Power",
                "Operation Stolen Pencil",
                "SharpTongue",
                "Sparkling Pisces",
                "Springtail",
                "TA406",
                "TA427",
                "Thallium",
                "UAT-5394",
                "Velvet Chollima"
            ],
            "source_name": "ETDA:Kimsuky",
            "tools": [
                "AngryRebel",
                "AppleSeed",
                "BITTERSWEET",
                "BabyShark",
                "BoBoStealer",
                "CSPY Downloader",
                "Farfli",
                "FlowerPower",
                "Gh0st RAT",
                "Ghost RAT",
                "Gold Dragon",
                "GoldDragon",
                "GoldStamp",
                "JamBog",
                "KGH Spyware Suite",
                "KGH_SPY",
                "KPortScan",
                "KimJongRAT",
                "Kimsuky",
                "LATEOP",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Lovexxx",
                "MailPassView",
                "Mechanical",
                "Mimikatz",
                "MoonPeak",
                "Moudour",
                "MyDogs",
                "Mydoor",
                "Network Password Recovery",
                "PCRat",
                "ProcDump",
                "PsExec",
                "ReconShark",
                "Remote Desktop PassView",
                "SHARPEXT",
                "SWEETDROP",
                "SmallTiger",
                "SniffPass",
                "TODDLERSHARK",
                "TRANSLATEXT",
                "Troll Stealer",
                "TrollAgent",
                "VENOMBITE",
                "WebBrowserPassView",
                "xRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673057194,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1664204981,
    "ts_modification_date": 1664204981,
    "files": {
        "pdf": "https://archive.orkl.eu/52bb248d45e9ae7a8c0a0c804d528c18b780bfdc.pdf",
        "text": "https://archive.orkl.eu/52bb248d45e9ae7a8c0a0c804d528c18b780bfdc.txt",
        "img": "https://archive.orkl.eu/52bb248d45e9ae7a8c0a0c804d528c18b780bfdc.jpg"
    }
}