{
    "id": "a8f1170b-a72d-4ac7-b6c5-9d5067fd681a",
    "created_at": "2023-01-12T15:03:09.165123Z",
    "updated_at": "2025-03-27T02:13:33.72091Z",
    "deleted_at": null,
    "sha1_hash": "4c72c13848e42154d494b084ccce59df7eb42f8e",
    "title": "2016-10-10 - Remsec driver analysis - Part 2",
    "authors": "",
    "file_creation_date": "2017-07-05T12:19:58Z",
    "file_modification_date": "2017-07-05T12:20:18Z",
    "file_size": 4047785,
    "plain_text": "### THE CIPHER BRIEF ANNUAL THREAT REPORT\n\n# 2017\n\n##### The world may have been more dangerous in the past, but our experts tell us it has never been more complicated.\n\n\n# 2017\n\n\n-----\n\n## Letter from the CEO\n\nHello,\n\nThank you for downloading The Cipher Brief Annual Threat Report.\n\nI launched The Cipher Brief in 2015, after spending a career as a journalist,\nwhich included working as an international news anchor, an Intelligence\nCorrespondent for a global news network, and an author. While I enjoyed\nthe mainstream network news mission of telling the public what happened, I\nwanted more time to focus on talking about what the news events of the day\nactually meant to them.\n\nI always knew, as most journalists do, that sources are a key part of\nunderstanding a story. To be blunt, the quality of sourcing across various\nnews platforms today is varied, which makes it difficult to know how good\nthe information that you’re getting is. Who you choose as your source of\ninformation is critical to how you think about the context of global events. That’s why I built The Cipher Brief with\nsourcing in mind. Many of the people we tap for insight have led intelligence agencies. Many of them have spent their\n[careers undercover in dangerous parts of the world. They all share their insights and expertise on thecipherbrief.com.](https://www.thecipherbrief.com/)\n\nWe are truly unique in the market, with more than 75 proven national security expert contributors and more than\n900 global contributors. We curate incredibly high-level thinking in combination with on-the-ground perspectives on\nevents, and pull it together for our readers in an easily-digestible format. We tell you where the experts agree, where\nthey disagree, and the likely path ahead.\n\nThis report is based on the extensive daily reporting and analysis that The Cipher Brief produces and publishes on our\nwebsite, as well as the specific polling of experts we conduct on security issues.\n\nWe are a strictly non-partisan media company, which means we do not take political sides in thinking about security\nissues. In the daily content we produce on our website, we focus on innovation and on the critical contributions that\nthe private sector makes to the overall global security picture. In short, whether in our reports or on our website, we\nproduce content that focuses on harnessing the smartest thinking on the issues, not on the politics of the day.\n\nIf you’d like to learn more about The Cipher Brief, you can find a detailed list of our offerings at the end of this report.\nYou can also sign up, for a limited-time, for a free subscription to our daily newsletter.\n\nWe hope you find this report easy to digest and useful in terms of understanding the complex, global security world\nrapidly unfolding before us and we’d love to include you in our future thought leadership-driven events. For more\n[information on that, please email us at feedback@thecipherbrief.com.](mailto:feedback%40thecipherbrief.com?subject=)\n\nThank you,\n\nSuzanne\nCEO & Publisher\nThe Cipher Brief\n\n\n-----\n\n###### The Cipher Brief polled its Network of more than 70 national security experts on what they view as the top 5 threats in the coming year – and why.\n\n 1. China\n\n 2. Russia\n\n 3. Terrorism\n\n 4. Nuclear Aspirants – North Korea and Iran\n\n 5. Cybersecurity\n\n\n-----\n\n## China\n\n###### Xi Jinping: The Most Powerful Leader Since Mao? Nationalist fervor, a more aggressive military posture, and curbs on free speech in China today are the hallmarks of one man: President Xi Jinping.\n\n Our Experts Agree:\n\n[Chinese President Xi Jinping’s consolidation of](https://www.thecipherbrief.com/article/asia/china%E2%80%99s-supremo-1090)\npower, combined with China’s growing wealth and\nglobal influence, affords Beijing an advantageous\nnegotiating position on the world stage. But, with Xi’s\ngreater standing and influence over Chinese policy, he\nwill be held responsible not only for China’s successes but also its failures.\n\nSource: AP Images\n\n  - Rather than expand consensus and transparency, Xi has sought to draw more and more power into\nChina’s Communist Party, and specifically, into his role as leader of it.\n\n  - His rationale is that strong leadership is necessary for China to weather the existential problems it now\nfaces.\n\nChina’s behavior in the South and East China Seas is troubling, but here to stay. Much like North Korea’s\nnuclear weapons, our experts feel that it is too late to change the state of play of Chinese militarization of\n[islands in the South China Sea – instead, the only](https://www.thecipherbrief.com/article/asia/little-margin-error-south-china-sea-policy-1090)\npathway that remains is to convince Beijing to\nadhere to international norms, such as Freedom\nof Navigation.\n\n  - While China is not the only country\nreclaiming land in the South China Sea\nVietnam and Taiwan do the same—the\nscale and resources that only China can\nbring to bear make others in the region\nnervous.\n\n###### Our Experts Disagree:\n\nOver whether China can step into the global leadership role alongside – or in place of – the United\nStates. [China, despite its public acts of largesse, is managing multiple demographic, economic and political](https://www.thecipherbrief.com/article/asia/china-solution-beijing-aims-global-leadership-1095)\nchallenges, each of which is further complicated by centralized control by the CCP. So, despite fears\nof China “filling the vacuum” ostensibly left by the United States’ recent withdrawal from international\nagreements such as the Paris Climate Accord or the Trans-Pacific Partnership, it is unclear whether the\nPRC will be able to do so.\n\n  - China’s political stability is tied, inextricably, to its economic success, which has suffered not only a\nslowdown but also the effects of centralized mismanagement by the CCP.\n\n\n-----\n\n###### Move It Forward:\n\nThe U.S. must address the forgotten “pivot to Asia” of the Obama Administration and endorse, replace,\nrevise – or terminate it. Our experts tell us that treating China as an afterthought – after terrorism or\nNorth Korea, for example – is a dangerous game to play. Rather, U.S. actions must be part of a larger,\nholistic strategy to address a rising China not only in East Asia, but around the world.\n\nThe U.S. must decide if it will compete with China on the world stage on global issues such as climate\nchange, clean energy, free trade, and freedom of navigation. Each of these issues will determine the\napproach to sub- issues such the South China Sea.\n\n  - In the South China Sea, the U.S. cannot rely on Freedom of Navigation Operations (FONOPs) alone.\nWhen used as a “singular messaging tool,” FONOPs can confuse other countries about Washington’s\nintent.\n\n  - As Admiral Jonathan Greenert, former Chief of Naval Operations for the U.S. Navy, told The Cipher\nBrief, “FONOPs should be a tool in a regional tool bag, but not the only tool in the regional tool\nbag. When that happens, the program’s purpose and intent become corrupted,” and creates a\nmisperception that freedom of navigation may be negotiable.\n\n[U.S. – China relations require delicacy and firmness all at once. It also requires leaders who can deliver on](https://www.thecipherbrief.com/column/state-play/china-greatest-disruptive-force-today-1090)\nnegotiated terms. Xi Jinping has clearly established himself as a power center in China, but has President\nDonald Trump?\n\n###### Where Does the Administration Stand?\n\nAt their first meeting in April, Trump and Xi\ndiscussed trade and cooperation on North\nKorea, but sidestepped several other issues\nimportant to the bilateral relationship,\nsuch as tensions in the South China Sea\nand climate change. The summit was short\non deliverables—with the only one being a\n100-day plan to find ways to reduce the U.S.\ntrade deficit to China—but served as an\nimportant personal introduction between the\nworld’s two most powerful heads of state\nand a reversal in Trump’s attitude on China.\nIn the weeks after the summit, Trump voiced\nhis praise of Xi as a leader and reversed his Source: AP Images\ndecision to label China a currency manipulator,\nand the two leaders had several phone calls over managing tensions with North Korea.\n\nHowever, it would appear recent events have eroded the good will fostered at the summit. Beijing’s\nreluctance to increase pressure on North Korea and U.S. actions—sanctions targeting Chinese firms with\nties to North Korea, two Freedom of Navigation Operations, and a $1.3 billion arms sale to Taiwan—have\nput the two nations back where they started, or perhaps in an even worse position.\n\n\n-----\n\n###### p\n\n\n###### “If we don’t get this right, nothing else matters.”\n\n– General Michael Hayden, Former Director, CIA and NSA\n\n###### “Xi has now identified his interests as the same as the Party’s and the Party’s as the same as China’s. Therefore, the People’s Republic of China will, in all likelihood, rise or fall with him.”\n\n– Gordon Chang, Author, The Coming Collapse of China\n\n###### “In my opinion, it is too late to reverse or undo occupancy [in the South China Sea], without risking a conflict. Our future strategy should assume these facilities are in place and active, and pursue limiting their use.”\n\n– ADM Jonathan Greenert, Former Chief of Naval Operations\n\nSource: The White House Flickr\n\n\n-----\n\n## Russia\n\n_“Russian leaders, and Putin is no exception, respect strength and conviction…as history has_\n_illustrated, Kremlin aggressiveness can be checked when confronted with unshakable resolve.”_\n\n– Michael Sulick, Former Director of the Clandestine Service, CIA\n\n###### Our Experts Agree:\n\nRussian President Vladimir Putin has framed himself as the leader of a global anti-U.S. movement, and\nseeks to return Russia to the status of a global power, with the according prestige and respect. Russia\nremains an existential threat to the U.S. – an adversary state with nuclear weapons.\n\n  - Putin will continually act to change the post-WWII global order and the structures that support it, such\nas NATO. This comes at a time when European unity is already in a fragile state.\n\n[• While Putin will attempt to counter the U.S. at every opportunity, it is unlikely he would do so in such](https://www.thecipherbrief.com/column/network-take/presidents-vs-kremlin-1090)\na dramatic a way that it would demand open response. Aggression on the periphery – Ukraine, Syria,\ncyberspace – will likely continue.\n\n[But Russian success has its limits. Moscow’s foreign adventurism may be flashy, but the domestic](https://www.thecipherbrief.com/article/asia/thorns-bears-paw-putins-vulnerabilities-1091)\n[challenges Putin faces are grim; troubles at home partially explain Russian posturing abroad.](https://www.thecipherbrief.com/article/asia/thorns-bears-paw-putins-vulnerabilities-1091)\n\n###### Our Experts Disagree:\n\nOver what ’standing up to Putin’ looks\nlike. Suggested policy paths range from\nstrengthening allies and partners around\nthe world to hardening cyber defenses to\nconfronting Putin. All options require close\ncoordination from Congress, the White House,\nand U.S. allies and partners; agreement which is\nnot currently happening.\n\n  - The U.S. placed missile defense structures\nin multiple countries in Eastern Europe\nand deployed troops to Poland.\n\n  - The Trump Administration says it will Source: AP Images\ncontinue to call out Russia for its support of\nBashar al-Assad in Syria and actions in Ukraine. However, how the statements of Secretaries of State\nRex Tillerson and John Kerry or UN Ambassadors Nikki Haley and Samantha Power differ remains\nunclear, as does what U.S. actions will follow the statements of Tillerson and Haley.\n\n###### Move It Forward:\n\n[Don’t count on détente anytime soon. The way ahead will likely consist of increased sanctions and](https://www.thecipherbrief.com/column/expert-view/putin-aiming-our-democracy-1090)\n“unshakeable resolve.” Short of surrendering to Putin’s view of the world, no U.S. Administration is likely to\nmeaningfully change Russian behavior, particularly given Moscow’s recent successes.\n\n\n-----\n\nSource: iStock\n\n###### Where Does the Administration Stand?\n\n\nhaving witnessed the color\nrevolutions in Russia’s near abroad,\nPutin understands that his hold on\npower is subject to threat, should the\nRussian economy fail. Domestic public\nprotests in recent months, triggered\nby government corruption and a\nweakened economy, strike fear in the\nPutin government. Mike Sulick, Cipher\nBrief Expert and former Director of\nthe National Clandestine Service told\nThe Cipher Brief, “despite Russian\ninterference in U.S. elections, overall,\nPutin’s policies have backfired -- and\nhe may be more dangerous as a result.”\n\n\nQuestions remain over the Trump Administration’s commitment to Article 5 of the NATO Treaty. Trump\nspent his first days in office calling NATO “obsolete” and pressing members to meet the two percent of GDP\ndefense spending goal, or else. A few months in, Trump reversed course. At a news conference with NATO\nSecretary General Jens Stoltenberg in Washington in April, Trump called NATO “the bulwark of international\npeace and security.”\n\n  - Still, at the NATO heads of state meeting in Brussels in May, Trump noticeably did not reaffirm\nAmerica’s commitment to Article 5, the bloc’s collective defense clause, leaving many allies bewildered.\n\n  - Then, in a statement in the Rose Garden in June, he affirmed the U.S.’ commitment to Article 5.\n\nThe Administration has struggled to put forward a comprehensive strategy to address Russian\nadventurism in the world, or even a response to the interference in the 2016 U.S. presidential election,\n[an action that former Acting Director of the CIA Michael Morell told the Cipher Brief was “the political](https://www.thecipherbrief.com/article/exclusive/fmr-cia-acting-dir-michael-morell-political-equivalent-911-1091)\n[equivalent of 9/11.” Trump policy, according to Former Vice Chief of Staff of the U.S. Army General Jack](https://www.thecipherbrief.com/article/exclusive/fmr-cia-acting-dir-michael-morell-political-equivalent-911-1091)\n[Keane, “has shifted from simply engagement and diplomacy to a willingness to confront. I think that is a](https://www.thecipherbrief.com/column/expert-view/inside-trumps-long-game-russia-1090)\nmajor policy shift and one that is warranted.”\n\n  - Though 17 U.S. intelligence agencies concluded unanimously, with high confidence, that the highest\nlevels of the Russian government interfered with the American presidential election to delegitimize the\nU.S. electoral system, the White House has wavered on its support for this finding.\n\n  - In June, the U.S. Senate passed a sanctions bill that specifically included measures to prevent the\nWhite House from easing them; the bill is meeting resistance in the House of Representatives.\n\n\n-----\n\n**October 7,**\n**2016**\n\n\n-----\n\n|National Sec Michael Flyn|urity Advisor n resigns.|\n|---|---|\n\n\nIn a CBS interview airing on Trump’s\n100th day in office, Trump says “The\nconcept of Russia with respect to us\n\n[the Trump campaign] is a total phony\nstory.” When asked if he believed the\nhack was phony, Trump responded\n**May 9,** “That I don’t know,” and later said “I’d\n**2017** love to find out what happened.”\n\n|In a CBS interview 100th day in office, concept of Russia w [the Trump campai story.” When asked hack was phony, Tr “Taht I don’t know,” love to find out wha|airing on Trump’s Trump says “Teh ith respect to us gn] is a total phony if he believed the ump responded and later said “I’d t happened.”|\n|---|---|\n\n|Trump fires FBI stating that the d nothing to do wit as lead investigat intervention in th|Director Comey, ismissal has h Comey’s role or into Russia’s e 2016 election.|\n|---|---|\n\n\n-----\n\n###### p\n\n\n###### “It is an attack on our very democracy. It’s an attack on who we are as a people. A foreign government messing around in our elections is, I think, an existential threat to our way of life. To me, and this is to me not an overstatement, this is the political equivalent of 9/11.”\n\n– Michael Morell, Former Acting Director, CIA\n\n###### “Still the only country that can destroy every major American city in a morning with a corrupt dictatorial leader whose strategic vision is restoring Russian influence and reducing American influence.”\n\n– John Bennett, Former Director of the Clandestine Service, CIA\n\n###### “Russian leaders, and Putin is no exception, respect strength and conviction...as history has illustrated, Kremlin aggressiveness can be checked when confronted with unshakable resolve.”\n\n– Michael Sulick, Former Director of the Clandestine Service, CIA\n\nSource: AP Images\n\n\n-----\n\n_“We cannot accept the current state as “the new normal.” The American people will not accept_\n_it. We need to continue to disrupt and attack the threat as far from the homeland as possible while_\n_enlisting partner nations who have some creditability in the Muslim world to lead the messaging.”_\n\n– John Bennett, Former Director of the Clandestine Service, CIA\n\n###### Our Experts Agree:\n\nRemoving terrorist groups’ control of physical\nterritory is a necessary, but not sufficient\n[condition for defeating them. In the case of ISIS,](https://www.thecipherbrief.com/article/middle-east/war-against-isis-has-just-begun-1089)\nthe “caliphate” in Iraq and Syria is fundamental\nto the group’s narrative. For al Qaeda and other\nterrorist organizations, ungoverned spaces in\ncountries such as Afghanistan, Syria, Somalia, and\nYemen provide safe havens where terrorist groups\ncan recover, recruit, plan, and launch attacks\nglobally. However:\n\n  - Resiliency is a primary military objective of\n[terrorist groups. ISIS and al Qaeda have proven able to lose territory and subsequently morph into](https://www.thecipherbrief.com/article/middle-east/quietly-and-patiently-rebuilding-1089)\ndifferent, but equally dangerous, enemies.\n\n  - ISIS and al Qaeda affiliates have proliferated across the Middle East, South and Southeast Asia, Africa,\nand cyberspace.\n\n  - As terrorist groups come under increasing pressure on the physical battlefield, the threat of lone-wolf\nattacks inspired by online propaganda increases.\n\nThe West has failed not only to discredit the narratives and propaganda put forth by ISIS and other\nterrorist groups, but also, perhaps more importantly, to communicate a powerful ‘big idea’ that is more\nattractive to those susceptible to terrorist messaging. Terrorist groups, and ISIS in particular, exist both\non and off the physical battlefield. Via cyberspace, ISIS has disseminated its message into the consciousness\nof populations around the world.\n\n\n-----\n\n###### p g\n\nOn how to measure success in this fight. As ISIS loses its caliphate, it has spread to disparate locations\n[around the globe because the fundamental drivers of its rise have not been addressed. A string of “tactical](https://www.thecipherbrief.com/article/tactical-victories-strategic-defeats-1089)\n[victories, but strategic defeats” has distracted from the larger question: is this fight about stopping](https://www.thecipherbrief.com/article/tactical-victories-strategic-defeats-1089)\nterrorists or fixing the Middle East?\n\nDespite agreement on the necessity to deny terrorist groups access to territory, there is no agreement\non what comes next in Iraq and Syria or in Afghanistan. The “Day After” debate has found no answers,\neven after over 15 years of war.\n\n  - Some propose increasing support for good governance and credible power sharing agreements, as well\nas pan-Arab oversight of places such as Iraq, while establishing countering violent-extremism programs\nand community outreach in the West.\n\n  - Others propose a withdrawal from such problematic regions and an increase in use of airstrikes,\nsurgical Special Operations Forces raids, and an end to “nation-building.”\n\n###### Move It Forward:\n\nSolving the technology puzzle will be key, but again,\nnot sufficient. Technology has transformed from a\ncritical advantage for governments to a double-edged\nsword. As social media and encryption technology\nproliferate, they can serve as powerful messaging tools\n– or weapons – depending on who uses them.\n\n  - Terrorist groups’ use of applications that obscure\ncommunications via end-to-end encryption\nwill force governments around the world to\neither come to an agreement with technology Source: AP Images\ncompanies to access that information or determine other ways to obtain the information.\n\n\n-----\n\namong them – to effectively counter radical extremist messaging. But no technological solution will\nreplace the need for a coherent, legitimate counter message.\n\n###### Where Does the Administration Stand?\n\nThe Trump Administration’s travel ban has been\nuntested in counterterror efforts due to legal\nchallenges preventing its enforcement; its existence,\nhowever, has been damaging in the countermessaging campaign. One week into the Trump\npresidency, the Administration issued an executive\norder banning citizens from Iraq, Syria, Iran, Libya,\nSomalia, Sudan and Yemen from entry into the U.S.\nfor 90 days. Protests at airports around the country\nand at the White House erupted; legal suits halted\nimplementation. The Administration issued a second\n\nSource: AP Images travel ban in early March, barring foreign nationals from\n\nthe same countries – excluding Iraq – from entering\nthe U.S. for 90 days. In late June, the Supreme Court allowed certain elements of the ban to enter into\neffect; the full case will be heard in the fall of 2017.\n\nThe Trump Administration has accelerated the war against ISIS in Syria, deploying several hundred\nMarines and Special Operations Forces to the country to support the Syrian Democratic Forces’ assault on\nRaqqa.\n\n  - In response to a deadly chemical weapons attack launched by Syrian President Bashar al-Assad, Trump\n\n[ordered a Tomahawk missile strike on the Shayat military air base, stating the retaliatory strike was](https://www.thecipherbrief.com/article/middle-east/trump-draws-line-syria-1091)\n“in [the] vital national security interest of the U.S.,” and adding that “years of previous attempts at\nchanging Assad’s behavior have all failed.”\n\n  - The strike on Shayat was an abrupt about-face for the Administration. A week before, White House\nPress Secretary Sean Spicer said the Administration “accepts the political reality” of Assad’s rule.\n\n[• The strike was the most significant U.S. military action against Assad since the Syrian civil war started](https://www.thecipherbrief.com/article/middle-east/syrias-tangled-trilateral-road-peace-1091)\nsix years ago. But despite mixed statements from administration officials, there has been no word from\nTrump himself on what his ideal future for Syria looks like, or whether that future includes Assad.\n\n\n-----\n\n###### p\n\n\n###### “The region today is torn by no fewer than five dimensions of conflict: Persian vs. Arab; Shia vs. Sunni; democrats vs. authoritarians; terrorists vs. regimes; and terrorists vs. terrorists. Maneuvering through all of this requires unprecedented agility.”\n\n– John McLaughlin, Former Acting Director, CIA\n\n###### “Even though the strength of al Qaeda and the Islamic State as standard bearers of the movement has waned in recent years, violent, militant Islam is spreading and deepening, globally...consequently, we can expect militant Islam to continue to grow as it morphs into new and violent forms.”\n\n– Rolf Mowatt-Larssen, Former Director of Intelligence and\nCounterintelligence, Department of Energy\n\n###### “In the end, the scorecard is mixed: great tactical successes coupled with tragic strategic losses. We have won a lot of battles, but unless we shift course soon, we may lose the war.”\n\n– Kevin Hulbert, Former Chief of Station, CIA\n\nSource: AP Images\n\n\n-----\n\n## Nuclear North Korea\n\n###### “Two rather irascible, semi-cogent leaders facing each other down in very unpredictable ways. Mistakes are almost bound to happen.”\n\n– Michael Leiter, Former Director, National Counterterrorism Center\n\n###### Our Experts Agree:\n\n[The North Korean nuclear threat is a threat of today, not tomorrow. Despite sanctions and international](https://www.thecipherbrief.com/column/network-take/realism-and-north-korea-1090)\noutcry, the pace of development in both missile and nuclear technology is only increasing. North Korea\nhas deployed or is developing more than a dozen different missile types that vary in range, payload size,\nlaunch vehicle, and fuel type. Several of these have the range to strike South Korea and Japan, where the\nU.S. has tens of thousands of troops stationed.\n\nChina must play an equal, if not greater, role in managing the North Korean threat. China has long been\na patron of the Kim regime in Pyongyang, and represents majority proportions of North Korean external\ntrade, as well as oil and food supplies. The international community has long called on Beijing to exert greater\npressure on North Korea.\n\n###### Our Experts Disagree:\n\nOn not only China’s willingness – but more importantly its ability – to reign in the Kim regime. And,\n[even if China is willing to cooperate, it is unclear whether Beijing has quite as much leverage as seems to be](https://www.thecipherbrief.com/article/asia/can-china-actually-restrain-kim-jong-un-1091)\ncommon wisdom.\n\nOn one side, our experts point out that China provides one key measure of support to Pyongyang\nbeyond oil, food and other trade: Pyongyang acts with confidence that Beijing will remain its\nprotector. [North Korean leader Kim Jong-un relies on hardline elements in China’s political system who](https://www.thecipherbrief.com/article/asia/china-can-disarm-north-korea-blink-eye-1091)\nhave long ensured China’s support\nof Pyongyang. Should this support\nappear to waver, or be used to exploit\nfactionalism in the North Korean\nregime, China could wield greater\ninfluence than it does currently.\n\nOn the other side, many note that\nChina has real, strategic reasons to\nprevent action that hastens the fall\nof the Kim regime – and Kim knows\nit. Fears of massive refugee flows\ninto the northeast provinces of China\nas well as the arrival of U.S. forces –\nsupporting South Korean troops – on\nthe Chinese border guide Beijing in all\nactions regarding North Korea. Source: iStock\n\n\n-----\n\n###### Move It Forward:\n\nThe international community will not be able to denuclearize North Korea; it should instead focus on\npreventing North Korea from using the weapons it already has or proliferating nuclear technology. As\nFormer Vice Chairman of the Joint Chiefs of Staff Admiral Sandy Winnefeld and Former Acting Director of\nthe CIA Michael Morell told The Cipher Brief, “the first responsibility of a leader is to face reality. Setting\naside our previous belief that we can convince North Korea to abandon its nuclear program will unlock the\ndoor to a different policy.”\n\n  - The U.S. must reaffirm and demonstrate its support for South Korea and Japan.\n\n  - Sanctions – especially multilateral sanctions - should continue, if only to show commitment and deter\nother rogue nations seeking a nuclear weapon.\n\nTime is a factor. Years of negotiations and sanctions have made little to no progress, and the Kim\nregime is under pressure. Recent purges by the young ruler as well as the assassination – allegedly ordered\nfrom Pyongyang – of Kim’s older brother in Malaysia demonstrate instability in Kim Jong-un’s rule that could\ndrive increasingly provocative acts internationally.\n\n  - However, any negotiations must not be rushed to meet a political timeline.\n\n  - Negotiators should not trade items such as food, money or fuel in exchange for concessions the\nregime can easily renege on after delivery.\n\n\n-----\n\nThe Administration\nhas strongly reassured\nregional allies Japan and\nSouth Korea that it takes\nthe North Korean threat\nseriously. Since entering\noffice, Trump repeatedly\ndenounced North Korean\nprovocations. Secretary of\nState Rex Tillerson, Secretary\nof Defense James Mattis, CIA\nDirector Mike Pompeo and\nVice President Mike Pence\nhave traveled to the region.\n\n  - The Administration\nreleased a statement\nin April on its policy:\n\nSource: iStock\n\n“pressure North\nKorea into dismantling its nuclear, ballistic missile, and proliferation programs by tightening economic\nsanctions and pursuing diplomatic measures with our allies and regional partners,” while leaving the\noption of negotiations open.\n\nWhile Trump has expressed strong statements - that have exacerbated already high tensions with\nNorth Korea - much of Trump’s stated policy is not new. “Tightening sanctions” and “diplomatic pressure”\nhave been the hallmarks of previous policies toward North Korea.\n\n  - So far, remaining open to negotiations is the only major departure from Obama-era North Korea policy.\n\n  - According to Cipher Brief Expert and former Director of National Intelligence James Clapper, “the\n‘threat’ has been profoundly and unnecessarily amplified by our own ill-advised rhetoric, which only\nserves to promote hyperventilation.”\n\n\n-----\n\n## Nuclear Iran\n\n_“It is increasingly evident that the nuclear agreement with Iran has, at best, delayed but not_\n_dissuaded Tehran in its aspirations to develop a nuclear weapon.”_\n\n– Mark Kelton, Former Deputy Director for Counterintelligence, CIA National Clandestine Service\n\n###### Our Experts Agree:\n\nIran’s strategic goals remain the same: expanding its influence in the Middle East, reducing U.S. clout\nand presence in the region, and countering Saudi Arabia and Israel. Because Iran’s military capabilities and\nresources have been limited by years of sanctions, it relies on the Islamic Revolutionary Guard Corps (IRGC),\nproxies in Lebanon, Yemen, Iraq, Syria, and Bahrain, and cyber attacks to carry out its objectives.\n\nIran’s pursuit of a nuclear weapon, though temporarily restrained by the Joint Comprehensive Plan of\nAction, is fundamentally tied to its larger aims to influence the Middle East. Iran’s broader behavior and\nengagement with the world cannot be controlled by the JCPOA.\n\n###### Our Experts Disagree:\n\nOver whether the recent re-election\nof President Hassan Rouhani\ndemonstrated an eagerness in Iran for\nreform and engagement with the West,\nwhich directly impacts the future of\nthe nuclear deal. While there is no doubt\nthat Ayatollah Khameini and the IRGC –\nthe so-called “Guardians of Orthodoxy”\n– still firmly hold power in Iran, questions\n[remain about the depth of polarization](https://www.thecipherbrief.com/column/strategic-view/punch-nose-iran-1090)\nin Iran and whether there are credible\nmoderates that should be supported.\n\nThe impact of the JCPOA and its Source: AP Images\nchances of successfully preventing Iran from obtaining a nuclear weapon remain to be seen. The Office\nof the Director of National Intelligence’s 2016 Worldwide Threat Assessment stated that “Iran does not face\nany insurmountable technical barriers to producing a nuclear weapon, making Iran’s political will the central\nissue.”\n\n[• On one side, our experts feel that the deal has failed to truly restrain Iran’s pursuit of a nuclear weapon](https://www.thecipherbrief.com/column/expert-view/iran-nuke-deal-finances-tehrans-ambitions-dominate-mideast-1090)\nand has simultaneously freed billions of dollars that Tehran is using to dictate events in the Middle East.\nMany also feel that Iran cannot be trusted to adhere to the terms of the agreement.\n\n  - On the other side, proponents of the JCPOA point to the stringent international monitoring measures\ninstituted by the deal, which create transparency and therefore minimize any attempts at cheating\nby Iran. Moreover, the money and sanctions relief were meant as carrots to bolster the “political will”\nnecessary for Iran to move away from its pursuit of a nuclear weapon.\n\n\n-----\n\nWhile there will be little change in Iran’s behavior in the short-term, non-nuclear related sanctions\nshould remain in place. The U.S. must remain willing to confront Iran for its support for terrorism and\negregious human rights violations. Moreover, consideration should be given to identifying and supporting a\n[moderate, democratic opposition in Tehran.](https://www.thecipherbrief.com/article/middle-east/could-irans-elections-indicate-new-future-1090)\n\nThe U.S. must continue to back key partners in the region, such as Saudi Arabia and Israel. By showing\na willingness to confront Iranian behavior, as well as bolster its partners, the U.S. can enable an alliance to\ncounter Iran’s influence in the region.\n\n###### Where Does the Administration Stand?\n\nDespite “officially putting Iran on notice,”\nthe Trump Administration has retained\nthe JCPOA. While on the campaign trail,\nthen-presidential candidate Donald Trump\nstated that his “number-one priority is to\ndismantle the disastrous deal with Iran.”\nInstead, President Trump has pledged to\nstrictly enforce and monitor Iranian behavior\nrelating to the agreement.\n\nWhile the U.S. has maintained JCPOArelated sanctions relief for Iran, the\nU.S. Treasury Department enacted new\nsanctions on individuals and entities\nconnected to Iran’s ballistic missile\n\nSource: Getty Images\n\nprogram. In May, the Department of State\nissued a statement that the U.S. will “continue countering Iran’s destabilizing activity in the region, whether\nit be supporting the Assad regime, backing terrorist organizations like Hezbollah, or supporting violent\nmilitias that undermine governments in Iraq and Yemen.”\n\nThe Trump Administration sent a clear message to Iran\nduring a visit to Saudi Arabia in May 2017. Not only did\nPresident Trump demonstrate a willingness to call out Iran\nfor its behavior, but he also communicated support for the\n[U.S.’ Arab partners in the region. During his first trip overseas](https://www.thecipherbrief.com/article/middle-east/would-arab-nato-help-or-hurt-middle-east-security-1093)\nas President, Donald Trump delivered a speech at the\nArab Islamic American Summit in Riyadh where he harshly\ncriticized Iranian behavior in the Middle East, calling the\nIranian government a leading state sponsor of terrorism.\n\n\n\n- In the speech, Trump noted that “from Lebanon to Iraq\n\nSource: iStock\n\nto Yemen, Iran funds, arms, and trains terrorists, militias,\nand other extremist groups that spread destruction and chaos across the region.”\n\n- According to Cipher Brief Expert General Jack Keane, “that was really quite extraordinary. No\nAmerican President has ever spoken like that. Leaders in the Middle East and North Africa feel very\nstrongly that the U S now has their back”\n\n\n-----\n\n###### p p g\n\n “[The Iran nuclear deal] is financing Iran’s strategy and ambitions to dominate the Middle East.”\n\n– General Jack Keane, Former Vice Chief of Staff, U.S. Army\n\n###### “The U.S. objective needs to shift from denuclearization to deterring [North Korea] from ever using or proliferating its nuclear weapons.”\n\n– ADM Sandy Winnefeld, Former Vice Chairman of the Joint Chiefs of Staff\nand Michael Morell, Former Acting Director, CIA\n\n###### “Korea: Have to list it, but the “threat” has been profoundly and unnecessarily amplified by our own ill-advised rhetoric, which only serves to promote hyperventilation.”\n\n– James Clapper, Former Director of National Intelligence\n\nSource: Missile Defense Agency\n\n\n-----\n\n## The Cyber Threat\n\n_“The new administration should learn an important lesson from all prior attempts_\n_to develop a comprehensive national cyber strategy: time is the enemy.”_\n\n  - Gilman Louie, Founder and Former CEO, In-Q-Tel\n\n###### Our Experts Agree:\n\nVulnerability to cyberattacks by both nation-states and\ncriminals cannot be solved without a paradigm shift in how\ngovernments, businesses and individuals share information\nand educate themselves about the security risks inherent\nin a technology-dependent world. Massive breaches and\nransomware attacks, compromising the data of millions, will\ncontinue.\n\n\nGovernments cannot solve this crisis alone. Government\nover-classification and industry concerns over proprietary\n[information, however, have hindered information-sharing](https://www.thecipherbrief.com/article/tech/allying-public-and-private-forces-front-lines-cybersecurity-1092)\nbetween the public and private sectors.\n\n\nSource: iStock\n\n\nTechnology is a double-edged sword and both sides are racing to find the next advantage. In the past,\ngovernments and established industry enjoyed a vast technological advantage. But, with the pervasive\ngrowth of internet access and ready-made cyber capabilities abundantly available, the barrier for entry into\nthe virtual battlefield has never been lower. Even so, our experts agree that further innovation in technology\nwill offer solutions for both government and the private sector.\n\n###### Our Experts Disagree:\n\n[Over what comprises effective deterrence and response to attack in cyberspace. There seems to be](https://www.thecipherbrief.com/article/tech/laying-down-marker-1092)\nstrong agreement that governments and business need to raise the cost to attackers in cyberspace, but no\nconsensus on what those actions look like – and whether they work.\n\n  - A 2015 agreement – reinforced by the threat of sanctions - between then-President Barack Obama\nand Chinese President Xi Jinping seemed to limit Chinese economic espionage, but many believe\nBeijing simply moved on to other priorities, including military hacking.\n\n  - To date, the only public response to Russian hacking during the 2016 Presidential election has been\neconomic sanctions. Multiple current and former U.S. intelligence and law enforcement officials have\nwarned that Russian hacking will be back in 2018 and will, in the meantime, target elections in allied\ncountries throughout Europe.\n\nThe stalemate between privacy and security remains an Achilles’ Heel for both governments and\nindustry. States are attempting to exert national sovereignty over cyberspace – to combat both criminals\nand emboldened adversary nation states - via controversial new laws. From battles over encryption\n[technology to government disclosure of vulnerabilities, the rift between Washington, DC and Silicon Valley –](https://www.thecipherbrief.com/article/tech/wannacry-attack-us-intelligence-responsible-1092)\nrepresented in our experts’ disagreements - limits the cooperation necessary to confront a common enemy.\n\n\n-----\n\nThe importance of public-private partnerships in solving cybersecurity issues will only increase. In\n[this challenge, time is the enemy. Because time is a critical variable in protection against and response](https://www.thecipherbrief.com/article/tech/cybersecurity-time-action-1092)\nto cyberattack, information sharing between the public and private sectors must be as seamless as\npossible. The Cyber Threat Information Integration Center under the Office of the Director of National\nIntelligence could be given an expanded role similar to that of the National Counterterrorism Center to\ncreate a comprehensive understanding of cyber threats. The Department of Homeland Security’s National\nCybersecurity and Communications Integration Center can act as a necessary storefront between the\nnation’s intelligence engine and the businesses that require pertinent and timely exchange of intelligence on\ncyber adversaries.\n\n  - In a conversation with The Cipher Brief’s CEO and Publisher Suzanne Kelly, Rob Joyce, the White\nHouse cybersecurity coordinator and former head of the National Security Agency’s elite Tailored\nAccess Operations unit, highlighted the government’s goals of securing federal networks and creating\npartnerships with industry so that malicious actors cannot hold U.S. critical infrastructure at risk.\n\n  - “We as the government have to be able to bring our capabilities to addressing the threats they are\nfacing. We will know things that will inform companies on the threat, and must help them through\nprocess and regulation, and equip them with the tools the federal government brings,” says Joyce.\n\nHardening the defenses of key U.S.\nnetworks is critical, but so too is\nengagement with other countries. The\nUnited States has an opportunity to\nlead global efforts to refine and uphold\nconventions and standards – “rules of the\nroad” so to speak – for cyber activity in the\ninternational order. Applying international\nnorms to cyberspace, while difficult, will\nformalize and ease the development of\nproper deterrence and response policy.\n\n###### Where Does the Administration Stand?\n\nSource: iStock The long-anticipated Executive Order\n\non Strengthening the Cybersecurity of\nFederal Networks and Critical Infrastructure signed by President Trump in mid-May emphasized one\nkey element: resilience. Described by our experts as “a plan for a plan” the order increased accountability\nof federal agencies regarding ensuring proper protection against cyberattacks, called on all agencies to\nuse the National Institute of Standards and Technology framework, and ordered reports on multiple critical\nvariables in cyber protection.\n\n  - According to Cipher Brief Expert James Lewis, “Like the references to risk management, resilience\nsuggests an acceptance that we cannot now prevent cyber attacks, that we cannot keep attackers\nout, and instead must be prepared to deal with compromise and disruption when they inevitably occur.”\n\n\n-----\n\n###### p y y\n\n “The Empowered Individual: What was once limited to technologically enabled nation states is now available to groups and individuals with whom traditional deterrence is ineffective.”\n\n– General Stanley McChrystal, Former Commander,\nInternational Security Assistance Force\n\n###### “General economic and technological trends...will help alleviate the challenge of encryption.”\n\n– Matthew Olsen, Former Director, National Counterterrorism Center\n\n###### “The new administration should learn an important lesson from all prior attempts to develop a comprehensive national cyber strategy: time is the enemy.”\n\n– Gilman Louie, Founder and Former CEO, In-Q-Tel\n\nSource: iStock\n\n\n-----\n\n## “The Worst of the Rest”\n\n\n###### 1. Pandemic\n\n\n###### 6. Populism\n\n\nSource: Getty Images Source: iStock\n\n\n###### 2. European Implosion\n\n\n###### 7. Demographic Change\n\n\nSource: iStock Source: Getty Images\n\n\n###### 3. Climate Change\n\n\n###### 8. The Refugee Crisis\n\n\nSource: Getty Images Source: Getty Images\n\n\n###### 4. Failed States and Ungoverned Space\n\n\n###### 9. Economic Collapse\n\n\nSource: AP Images Source: Getty Images\n\n\n###### 5. Afghanistan\n\n\n###### 10. Transnational Organized Crime\n\n\nSource: iStock Source: Rodrigo Abd\n\n\n-----\n\n## An Unexpected Threat: Ourselves\n\nSource: iStock\n\n\n-----\n\n###### g g\n\nMany members of the Cipher Brief’s Expert Network expressed that in addition to their “Top 5” threats,\nthey also had great concern regarding the United States’ ability to focus and react to a global crisis given its\nown internal divisions and domestic issues.\n\n  - Weakening of U.S. Alliances and Leadership\n\n  - A “Broken” Education System\n\n  - Executive and Legislative Branch Dysfunction\n\n  - A Drug Epidemic\n\n_“Internal Threat: Hugely damaging to our capabilities; unfortunately, we’ll have more such losses.”_\n– James Clapper, Former U.S. Director of National Intelligence\n\n_“Congress’s inability to get out of its own way, along with politicians’ prioritizing politics over patriotism,_\n_has tied the government’s budgeting processes in knots.”_\n– Admiral James ‘Sandy’ Winnefeld, Former Vice Chairman, Joint Chiefs of Staff\n\n_“America’s internal polarization: Why? [It] diminishes the U.S. image as a model to emulate, and makes us_\n_less reliable as partners to combat a range of national security threats, thus emboldening adversaries.”_\n– Michael Sulick, Former Director, CIA National Clandestine Service\n\n_“I believe our most enduring threat is “fake news” and the struggle over what is fake and what is not, which_\n_then breeds distrust in factual/real news. Over time we will have an increasingly uninformed electorate and_\n_it’s also likely that this distrust in news overall will generate an apathy for the democratic process.”_\n– Doug Wise, Former Deputy Director, Defense Intelligence Agency\n\n_“The post-WW II order with both US-led military and political/economic alliances has brought us greater_\n_wealth and security than any period in global history. The weakening/fracturing of institutions like the_\n_EU, NATO, as well as a lack of U.S. leadership on efforts like the TTP will provide our adversaries with_\n_opportunities that we will have trouble countering alone.”_\n– Michael Leiter, Former Director, National Counterterrorism Center\n\n_“The End of Trust. Despite all its complaining, most governments relied on strong and reliable U.S._\n_leadership in the world as a guarantor of the global system. The current administration’s America First_\n_foreign policy and unconventional and unpredictable behavior will affect the decision making of other_\n_governments…A less trusting and predictable world is also a more dangerous one.”_\n– Carmen Medina, Former CIA Deputy Director of Intelligence\n\n_“We have a drug poisoning epidemic in this country, which doesn’t get the focus it should. 129 people a day_\n_die of drug poisoning. One might contemplate that, in contrast to how people in the U.S. have been killed by_\n_terrorism.”_\n– James Clapper, Former U.S. Director of National Intelligence\n\n_“Ayn Rand-think and strategic bankruptcy.”_\n– James Lewis, Senior Vice President and Program Director, CSIS\n\n\n-----\n\n## Thank You\n\nThank you for your purchase of The Cipher Brief Annual Threat Report. The conversation about these\n[threats continues daily on thecipherbrief.com with an expanding list of global experts.](https://www.thecipherbrief.com)\n\nFor more information about The 2018 Cipher Brief Annual Threat Conference, an invite-only event,\nproviding high-level engagement opportunities with Cipher Brief experts, please contact us at\n[info@tcbconference.com.](mailto:info%40tcbconference.com?subject=)\n\nFor information about getting your company brand in front of The Cipher Brief’s influential readership,\nvia our digital platform, newsletters, podcasts or in-person briefings and events, please contact us at\n[sponsorship@thecipherbrief.com.](mailto:sponsorship%40thecipherbrief.com?subject=)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/ICS SCADA/Threat Intelligence Reports/Cypher Brief - Annual Threat Report - 2017.pdf"
    ],
    "report_names": [
        "Cypher Brief - Annual Threat Report - 2017.pdf"
    ],
    "threat_actors": [
        {
            "id": "cfdd35af-bd12-4c03-8737-08fca638346d",
            "created_at": "2022-10-25T16:07:24.165595Z",
            "updated_at": "2025-03-27T02:02:10.128957Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "Cosmic Wolf",
                "Marbled Dust",
                "Silicon",
                "Teal Kurma",
                "UNC1326"
            ],
            "source_name": "ETDA:Sea Turtle",
            "tools": [
                "Drupalgeddon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "f276b8a6-73c9-494a-8ab2-13e2f1da4c53",
            "created_at": "2022-10-25T16:07:24.441133Z",
            "updated_at": "2025-03-27T02:02:10.231958Z",
            "deleted_at": null,
            "main_name": "Achilles",
            "aliases": [],
            "source_name": "ETDA:Achilles",
            "tools": [
                "RDP",
                "Remote Desktop Protocol"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "33ae2a40-02cd-4dba-8461-d0a50e75578b",
            "created_at": "2023-01-06T13:46:38.947314Z",
            "updated_at": "2025-03-27T02:00:02.959421Z",
            "deleted_at": null,
            "main_name": "Sea Turtle",
            "aliases": [
                "SILICON",
                "Teal Kurma",
                "UNC1326",
                "COSMIC WOLF",
                "Marbled Dust"
            ],
            "source_name": "MISPGALAXY:Sea Turtle",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e3767160-695d-4360-8b2e-d5274db3f7cd",
            "created_at": "2022-10-25T16:47:55.914348Z",
            "updated_at": "2025-03-27T02:05:17.411172Z",
            "deleted_at": null,
            "main_name": "IRON TWILIGHT",
            "aliases": [
                "ATK5 ",
                "Blue Athena ",
                "BlueDelta ",
                "FROZENLAKE ",
                "Fancy Bear ",
                "Fighting Ursa ",
                "Forest Blizzard ",
                "GRAPHITE ",
                "Group 74 ",
                "PawnStorm ",
                "STRONTIUM ",
                "Sednit ",
                "Snakemackerel ",
                "Sofacy ",
                "TG-4127 ",
                "Tsar Team ",
                "APT28 "
            ],
            "source_name": "Secureworks:IRON TWILIGHT",
            "tools": [
                " Downdelph",
                " Drovorub",
                " EVILTOSS",
                " HIDEDRV",
                " Headlace",
                " LoJack",
                " Powershell Empire",
                " SCONATO",
                " SEDUPLOADER",
                " SHARPFRONT",
                " Scaramouche",
                " Sedkit Exploit Kit",
                " Sofacy downloader",
                " X-Agent",
                " X-Tunnel",
                " Zebrocy",
                " reGeorg",
                "DEALERSCHOICE"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "730dfa6e-572d-473c-9267-ea1597d1a42b",
            "created_at": "2023-01-06T13:46:38.389985Z",
            "updated_at": "2025-03-27T02:00:02.821388Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "FROZENLAKE",
                "BlueDelta",
                "SNAKEMACKEREL",
                "TG-4127",
                "ITG05",
                "TA422",
                "Fancy Bear",
                "FANCY BEAR",
                "Sednit",
                "IRON TWILIGHT",
                "G0007",
                "Sofacy",
                "Forest Blizzard",
                "GruesomeLarch",
                "Pawn Storm",
                "Tsar Team",
                "STRONTIUM",
                "ATK5",
                "Blue Athena",
                "APT-C-20",
                "Group 74",
                "SIG40",
                "Grizzly Steppe",
                "Fighting Ursa",
                "T-APT-12",
                "UAC-0028"
            ],
            "source_name": "MISPGALAXY:APT28",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ae320ed7-9a63-42ed-944b-44ada7313495",
            "created_at": "2022-10-25T15:50:23.671663Z",
            "updated_at": "2025-03-27T02:00:55.518748Z",
            "deleted_at": null,
            "main_name": "APT28",
            "aliases": [
                "APT28",
                "IRON TWILIGHT",
                "SNAKEMACKEREL",
                "Group 74",
                "Sednit",
                "Sofacy",
                "Pawn Storm",
                "Fancy Bear",
                "STRONTIUM",
                "Tsar Team",
                "Threat Group-4127",
                "TG-4127",
                "Forest Blizzard",
                "FROZENLAKE"
            ],
            "source_name": "MITRE:APT28",
            "tools": [
                "Wevtutil",
                "certutil",
                "Forfiles",
                "DealersChoice",
                "Mimikatz",
                "ADVSTORESHELL",
                "Komplex",
                "HIDEDRV",
                "JHUHUGIT",
                "Koadic",
                "Winexe",
                "XTunnel",
                "Drovorub",
                "CORESHELL",
                "OLDBAIT",
                "Downdelph",
                "XAgentOSX",
                "USBStealer",
                "Zebrocy",
                "Fysbis",
                "LoJax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d2516b8e-e74f-490d-8a15-43ad6763c7ab",
            "created_at": "2022-10-25T16:07:24.212584Z",
            "updated_at": "2025-03-27T02:02:10.141001Z",
            "deleted_at": null,
            "main_name": "Sofacy",
            "aliases": [
                "APT 28",
                "ATK 5",
                "Blue Athena",
                "BlueDelta",
                "FROZENLAKE",
                "Fancy Bear",
                "Fighting Ursa",
                "Forest Blizzard",
                "Grey-Cloud",
                "Grizzly Steppe",
                "Group 74",
                "GruesomeLarch",
                "ITG05",
                "Iron Twilight",
                "Operation DealersChoice",
                "Operation Dear Joohn",
                "Operation Komplex",
                "Operation Pawn Storm",
                "Operation Russian Doll",
                "Operation Steal-It",
                "Pawn Storm",
                "SIG40",
                "Sednit",
                "Snakemackerel",
                "Sofacy",
                "Strontium",
                "T-APT-12",
                "TA422",
                "TAG-0700",
                "TAG-110",
                "TG-4127",
                "Tsar Team",
                "UAC-0028",
                "UAC-0063"
            ],
            "source_name": "ETDA:Sofacy",
            "tools": [
                "ADVSTORESHELL",
                "AZZY",
                "Backdoor.SofacyX",
                "CHERRYSPY",
                "CORESHELL",
                "Carberp",
                "Computrace",
                "DealersChoice",
                "Delphacy",
                "Downdelph",
                "Downrage",
                "Drovorub",
                "EVILTOSS",
                "Foozer",
                "GAMEFISH",
                "GooseEgg",
                "Graphite",
                "HATVIBE",
                "HIDEDRV",
                "Headlace",
                "Impacket",
                "JHUHUGIT",
                "JKEYSKW",
                "Koadic",
                "Komplex",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "LoJack",
                "LoJax",
                "MASEPIE",
                "Mimikatz",
                "NETUI",
                "Nimcy",
                "OCEANMAP",
                "OLDBAIT",
                "PocoDown",
                "PocoDownloader",
                "Popr-d30",
                "ProcDump",
                "PythocyDbg",
                "SMBExec",
                "SOURFACE",
                "SPLM",
                "STEELHOOK",
                "Sasfis",
                "Sedkit",
                "Sednit",
                "Sedreco",
                "Seduploader",
                "Shunnael",
                "SkinnyBoy",
                "Sofacy",
                "SofacyCarberp",
                "SpiderLabs Responder",
                "Trojan.Shunnael",
                "Trojan.Sofacy",
                "USB Stealer",
                "USBStealer",
                "VPNFilter",
                "Win32/USBStealer",
                "WinIDS",
                "Winexe",
                "X-Agent",
                "X-Tunnel",
                "XAPS",
                "XTunnel",
                "Xagent",
                "Zebrocy",
                "Zekapab",
                "carberplike",
                "certutil",
                "certutil.exe",
                "fysbis",
                "webhp"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535789,
    "ts_updated_at": 1743041613,
    "ts_creation_date": 1499257198,
    "ts_modification_date": 1499257218,
    "files": {
        "pdf": "https://archive.orkl.eu/4c72c13848e42154d494b084ccce59df7eb42f8e.pdf",
        "text": "https://archive.orkl.eu/4c72c13848e42154d494b084ccce59df7eb42f8e.txt",
        "img": "https://archive.orkl.eu/4c72c13848e42154d494b084ccce59df7eb42f8e.jpg"
    }
}