{
    "id": "a9038fa8-153b-4093-a500-c7bc50e6c62f",
    "created_at": "2023-01-12T15:05:44.11127Z",
    "updated_at": "2025-03-27T02:15:26.116998Z",
    "deleted_at": null,
    "sha1_hash": "0c87d3863b4e5a55a2841a01afb524ad2e005ec0",
    "title": "2022-05-20 - DisCONTInued The End of Contis Brand Marks New Chapter For Cybercrime Landscape",
    "authors": "",
    "file_creation_date": "2022-05-25T18:05:46Z",
    "file_modification_date": "2022-05-25T18:05:46Z",
    "file_size": 3203320,
    "plain_text": "# DisCONTInued: The End of Conti’s Brand Marks New Chapter For Cybercrime Landscape\n\n**[advintel.io/post/discontinued-the-end-of-conti-s-brand-marks-new-chapter-for-cybercrime-landscape](https://www.advintel.io/post/discontinued-the-end-of-conti-s-brand-marks-new-chapter-for-cybercrime-landscape)**\n\nMay 20, 2022\n\n_By Yelisey Bogusalvskiy & Vitali Kremez (with special thanks to AdvIntel Intel Production_\n_Analyst Marley Smith)_\n\n\n-----\n\n_This is a redacted report that is based on our internal investigations. The full version of the_\n_report includes additional information, evidence, IOCs, and commentary for AdvIntel_\n_customers and Law Enforcement._\n\n**_Conti’s Death Notice_**\n\n**On May 19, 2022, the admin panel of the Conti ransomware gang's official**\n**website, Conti News, was shut down.** The negotiations service site was also down,\nwhile the rest of the infrastructure: from chatrooms to messengers, and from servers to proxy\nhosts was going through a massive reset.\n\n\n-----\n\n**_Conti News - a shame blog is the last beacon of the group s public operation where victim_**\n_data was published. It also served as a media tool that Conti used for their endless public_\nstatements (one of which led to the gang's downfall).\n\nThis publicity function of the blog is still technically active (and this activity, as shown below,\nis highly strategized). At the time of this publication - May 20, 2022, Conti was even\nuploading anti-Americanist hate speech claiming the USA to be “a cancer on the body of the\n_earth”. This, however, only manifests that the website became an empty shell. At the same_\ntime, the crucial operational function of Conti News which was to upload new\n**data in order to intimidate victims to pay is defunct, as all the infrastructure related**\nto negotiations, data uploads, and hosting of stolen data was shut down.\n\n_The message published today is strikingly different from previous Conti’s political_\n_statements written in properly edited English. The extremely low quality of writing also_\n_suggests that even the public side of the Conti blog is not treated seriously by the leadership_\n\n\n-----\n\nAnd this shutdown highlights a simple truth that has been evident for the Conti leadership\nsince early Spring 2022 - the group can no longer sufficiently support and obtain extortion.\nThe blog's key and only valid purpose are to leak new datasets, and this operation is now\ngone.\n\nThis was not a spontaneous decision, instead, it was a calculated move, signs of which were\n[evident since late April. Two weeks ago, on May 6, AdvIntel explained that the Conti brand,](https://www.bleepingcomputer.com/news/security/the-week-in-ransomware-may-6th-2022-an-evolving-landscape/)\nand not the organization itself, was in the process of the final shutdown. As of May 19, 2022,\nour exclusive source intelligence confirms that today is Conti’s official date of death.\n\nIn this retrospective analysis, we will not only take an in-depth look into the reasons\n**behind the Conti shutdown but perhaps most importantly, assess and project the**\n**future of a new threat landscape that is already on the horizon. But first, we need**\nto review how Conti prepared for its own demise, and how this group, notable for its\nsophistry, continued to utilize information warfare techniques to orchestrate the\nshutdown until its final days, in order to ensure the legacy of its surviving members.\n\n**_Mr. “R” & Conti’s Final Performance_**\n\n_Shutting down ransomware’s iconic criminal brand is a long and complicated venture. A_\nnotorious and prolific threat group cannot simply turn off its servers, only to pop back up the\nfollowing week with a new name and logo design. Even a whisper of novel threat group\nactivity following the announcement of Conti’s demise would likely spark immediate\naccusations of poorly executed identity theft. At best, immediate comparisons between the\ntwo would permanently leave the new group in Conti’s ghostly shadow: the collective that fell\n_and the one which emerged._\n\n**REvil, DarkSide, and countless other collectives attempted the disappearing act; the**\nsimple approach failed, and miserably. As what was one of the dominant ransomware group\nactive at the time, Conti realized that an element of performativity would need to be\ninvolved. Where other groups had been attempting a grand stunt with smoke and mirrors,\nConti would try a sleight of hand.\n\n\n-----\n\nConti would not be itself without its project frontman - an individual operating under the\nalias “reshaev” aka “cybergangster”. Besides being a talented coder (they were behind the\noriginal Ryuk payload), this person was an outstanding organizer. It was “resahev” who set\nthe foundation for Conti’s dominance in the cybercrime business, by creating an\norganizational system based on skill, teamwork, clear business processes, hierarchy, and\nclear foresight.\n\nIt is not surprising that “reshaev” was the first who saw Conti’s structural challenges - due to\n**the group’s public allegiance to Russia in the first days of the Russian invasion**\n**into Ukraine, Conti was not able to be paid. Since February 2022 almost no payments**\nwere given to the group, while Conti’s locker became highly detectable and was rarely\ndeployed. The only possible decision was to rebrand.\n\nFor over two months, Conti collective had been silently creating subdivisions that\nbegan operations before the start of the shutdown process. These subgroups either utilized\n**existing Conti alter egos and locker malware, or took the opportunity to create new**\n**ones.**\n\nThis decision was convenient for Conti, as they already had a couple of subsidiaries operating\nunder different names: KaraKurt, BlackByte, BlackBasta. The rebranded version of\nConti—the monster splitting into pieces still very much alive—ensured that whatever form\nConti’s ex-affiliates chose to take, they would emerge into the public eye before news\n**of Conti’s obsolescence could spread, controlling the narrative around the dissolution**\nas well as significantly complicating any future threat attributions.\n\n**_Weekend at Conti’s_**\n\n_“All warfare is based on deception. Hence, when we are able to attack, we must seem_\n_unable; when using our forces, we must appear inactive; when we are near, we must make_\n_the enemy believe we are far away; when far away, we must make him believe we are_\n_near.”_\n\n**_-Sun Tzu, The Art of War_**\n\n\n-----\n\n_This is where the plans for what was left of Conti became increasingly complex._\n\nIn order to hide the fact that Conti was now dispersed and operating via smaller, more novel\nbrands, the former affiliates of the gang had to now convincingly simulate the actions of a\ndead brand.\n\nConti’s remaining infrastructure operated like an army preparing for an ambush. Lingering\nactors were left to keep their fires lit, visible from behind enemy lines. Meanwhile, hidden\nfrom view, Conti’s most skilled agents were instead laid low in a nearby encampment, biding\ntheir time while watching their great and empty camp send out smoke signals, meticulously\nemulating the movements of an active group.\n\nConti continued to publish documents stolen from victims (most likely targets hit earlier with\nattacks and lined up in a sort of “queue” for public release) and “campaigned” hard for\nthemselves on criminal forums. Their public persona boasted a strong and enduring\nfoundation, even one that was willing to further expand the group’s operations. From the\nperspective of Conti’s post history, the group was stronger than ever.\n\n\n-----\n\n_In a March 30 post to the RAMP underground forum, a Conti representative talks up the_\n_[group's success, even seeking to recruit new affiliates. [Source - ISMG]](https://www.databreachtoday.com/leaks-fail-to-dent-contis-successful-ransomware-operation-a-18938)_\n\nHowever, in order to pull off their ultimate tactical maneuver, the agents left behind to\noperate from within Conti’s massive, empty shell had to ensure that their antics would\nsuccessfully lure attention away from their escaping comrades. To do this, they had to be\ncertain that they left bait big enough to satisfy all of their opposing forces. Conti would\n**have to perform a grand finale—one big enough to live up to the group’s name.**\n\n**_‘Out With A Bang’: Conti’s Grand Finale_**\n\nAnd finally, on May 8, 2021, Costa Rican President Rodrigo Chaves declared **a national**\n**emergency as the result of a major cyber attack executed by the Conti**\n**ransomware gang. The massive attack, which took place against multiple Costa Rican**\ngovernment agencies, seems almost like a last-ditch effort by the group to squeeze a few more\ndrops of riches from foreign government funds.\n\nHowever, AdvIntel’s unique adversarial visibility and intelligence findings led to, what was in\nfact, the opposite conclusion: The only goal Conti had wanted to meet with this final\n**attack was to use the platform as a tool of publicity performing their own death**\n\n\n-----\n\n**and subsequent rebirth in the most plausible way it could have been conceived.**\n\n_The president of Costa Rica Rodrigo Chaves declared that the country is \"at war\", as Conti_\n_[caused major disruption to IT systems of numerous government ministries. (Source: BBC)](https://www.bbc.com/news/technology-61323402)_\n\n\n-----\n\n**AdvIntel has been tracking the preparations for this attack since April 14, 2022**\n— days before even the initial compromise. Our prevention alert was sent on April 15,\n**[2022, three days before the first incident compromising Costa Rica’s Ministry of Finance](https://twitter.com/HaciendaCR/status/1516190939114803203)**\noccurred.\n\n\n-----\n\n-----\n\n-----\n\n-----\n\n_Screenshot of AdvIntel’s 2022-04-15 Breach Pulse, detailing one of the Costa Rican attacks._\n\n_In our pre-and-post attack investigation, we have found:_\n\nThe agenda to conduct the attack on Costa Rica for the purpose of publicity\ninstead of ransom was declared internally by the Conti leadership.\n\nInternal communications between group members suggested that the requested\n**ransom payment was far below $1 million USD (despite unverified claims of the**\nransom being $10 million USD, followed by Conti’s own claims that the sum was $20\nmillion USD). A low demand such as this, made to a state entity no less, was only made\nwith the knowledge that the group would never see payment for the ransom.\n\nConti was very vocal about the attack, constantly adding new political\n**statements, any and all political statements being banned within Conti as of**\nMarch 2022, resulting from private chat leaks.\n\n**_The attack on Costa Rica indeed brought Conti into the spotlight and helped them_**\nto maintain the illusion of life for just a bit longer, while the real restructuring was\n**taking place.**\n\n**_Disposing of a Toxic Brand: Conti’s Afterlife_**\n\nWhile Conti had been busy with its diversion tactics, other brands such as KaraKurt,\n**BlackByte, and numerous other groups which existed as extensions of Conti but without**\n_taking the group’s name were extremely operationally active, although they worked in_\nsilence. Working concurrently with them, talented infiltration specialists, who were\n\n\n-----\n\nultimately the backbone of Conti s gang, were also more active than ever, forming alliances\nwith BlackCat, AvosLocker, HIVE, HelloKitty/FiveHands, and a whole other cadre of\nransomware groups. These pen-testers maintain personal loyalty to the people who\n**created Conti but ultimately continued their work with other gangs in order to finally shed**\nConti’s name and image.\n\nThis situation presents the first, and foremost reason for Conti’s timely end—toxic\n**branding. Indeed, the first two months of 2022 left a major mark on the Conti name. While**\nthere is no tangible evidence to suggest that the well-known Conti leaks had any impact on\nthe group’s operations, the event which provoked the leak— Conti’s claim to support the\n**_Russian government, seems to have been the fatal blow for the group, despite being_**\n_revoked almost immediately._\n\nThe statement had several key\nconsequences, all of which\ncompletely reshaped the\nenvironment Conti was operating\nwithin.\n\n_First, by engaging in_\n**political discourse, Conti**\nbroke the first unspoken rule\nof the Russian-speaking\ncybercrime community—not\n**_to intervene in state_**\n**_matters._**\n\nIn AdvIntel’s **public**\n**blogregarding REvil’s ultimate**\ntakedown by the Russian\ngovernment, AdvIntel provided an\nin-depth analysis of this unspoken\nagreement, making case studies of\nthe two most notable groups to\nbreak it—Avaddon and REvil. With the ongoing Russian invasion of Ukraine, it may be\nvery plausible that Russia’s state security apparatus is attempting to exert\n**governmental control over its cyberspace, even taking down groups that appear to**\nhave been allies, but who exhibited undue independence with their actions.\n\n\n-----\n\nAdvIntel had seen internal\ncommunication of the Conti\nleadership suggesting that the\nRussian FSB had been pressuring\nthe group, and even though nonfactual evidence was involved, the\n**REvil scenario may have**\n**simply repeated itself with**\n**Conti, the group’s brand**\n**becoming a target for Russian**\n**authorities despite their**\n**pledged loyalties.**\n\n_Second, Conti’s allegiance_\n**to the Russian invasion of**\n**Ukraine provoked**\n**internal conflict, and**\n**brought shame on the**\n**Conti name from members**\nwho were either ethnically\n_Ukrainian, or were Russian_\n_but supported Ukraine, or simply wanted to maintain an anti-war ethic._\n\nConsidering that one of these members decided to betray the gang and leak private Conti\nchat logs not long after, this conflict illustrated the final nail in Conti’s self-made coffin:\n\nThe third, and most important factor—by pledging their allegiance to the Russian\ngovernment, Conti as a brand became associated with the Russian state—a\n**state that is currently undergoing extreme sanctions.**\n\nIn the eyes of the state, each ransom payment going to Conti may have potentially gone to an\nindividual under sanction, turning simple data extortion into a violation of OFAC regulation\nand sanction policies against Russia. This liability came to a head on May 6, 2022, whenthe\n**US State Department offered rewards up to $10 million USD for information**\n**that led to the takedown of the Conti group.**\n\n\n-----\n\n_Conti decided to revoke their support of the Russian government immediately, turning it_\n_into an anti-war statement backed by anti-western sentiments, but this did not repair the_\n_damage that had been done to their reputation._ _[[Source]](https://twitter.com/y_advintel/status/1497293187798507525)_\n\nAs a result of these limitations, Conti had essentially cut itself from the main source of\nincome. Our sensitive source intelligence shows that many victims were prohibited to pay\nransom to Conti. Other victims and companies who would have negotiated\n**ransomware payments were more ready to risk the financial damage of not**\n**paying the ransom than they were to make payments to a state-sanctioned**\n**entity.**\n\n**_The Villian With a Thousand Faces_**\n\n\n-----\n\n-----\n\n**As AdvIntel previously stated, the end of the Conti brand does not equal the end**\n**_of Conti as an organization. As seen with the Costa Rica case, Conti has been planning_**\nthe rebranding for several months and prepared a comprehensive strategy to execute it. This\nstrategy is based on two pillars:\n\n_First, Conti is adopting a network organizational structure, more horizontal and_\n_decentralized than the previously rigid Conti hierarchy. This structure will be a coalition of_\nseveral equal subdivisions, some of which will be independent, and some existing within\nanother ransomware collective. However, they will all be united by internal loyalty to\n**both each other and the Conti leadership, especially “reshaev”.**\n\n_At this point, this network includes the following groups:_\n\n**_TYPE1. Fully autonomous: No locker involved, pure data-stealing:_**\n\n_Karakurt_\n\n_BlackBasta_\n\n_BlackByte_\n\n**_TYPE2. Semi-autonomous: Acting as Conti-loyal collective affiliates within_**\n**other collectives in order to use their locker:**\n\n_AlphV/BlackCat_\n\n_HIVE_\n\n_HelloKitty/FiveHands_\n\n_AvosLocker_\n\n**_TYPE3. Independent affiliates: Working individually, but keeping their loyalty_**\n**to the organization**\n\n**_TYPE4. Mergers & Acquisitions: Conti leadership infiltrates an already-existing small_**\nbrand and consumes it entirely, keeping the small brand name. The small group's leader\nloses independence, but receives a massive influx of manpower, while Conti receives a new\n\n\n-----\n\nsubsidiary group. (for this type, Groups names are obfuscated for security\n**_[reasons. Please contact AdvIntel with questions).](mailto:support@advintel.tech)_**\n\nThis is different from Ransomware-as-a-Service, since this network, at least at the time of\nwriting, does not seem to be accepting new members as part of its structure. Moreover,\nunlike RaaS, this model seems to value operations being executed in an organized, team-led\n_manner. Finally, unlike RaaS, all the members know each other very well personally and are_\nable to leverage these personal connections and the loyalty that comes with them.\n\n**_This model is more flexible and adaptive than the previous Conti hierarchy but_**\n**_is more secure and resilient than RaaS._**\n\nThe other major development for this new ransomware model is the transition from data\n**encryption to data exfiltration, covered extensively by AdvIntel in our analysis of**\nKarakurt and BlackByte. In a nutshell, relying on pure data exfiltration maintains most major\n_benefits of a data encryption operation, while avoiding the issues of a locker altogether. Most_\nlikely, this will become the most important outcome of Conti's re-brand.\n\n**Conclusion**\n\nWithin the short but tumultuous timeline of ransomware’s history, May 19, 2022, the day\n_that Conti died, will leave a mark that severs the threat landscape from its past and casts a_\nshadow on its future. However, in the grand scheme of the group’s existence, this day is not\nsomething new.\n\nLooking back, a trail of similar marks lead from the group’s days as the organization Ryuk to\ntheir first rebranding from the collective’s Overdose division. Each mark represents a shift in\nthe threat landscape, a series of tics that, only when viewed from a great distance, show the\ndramatic impact the group has made on ransomware’s very existence. However, the actors\nthat formed and worked under the Conti name have not, and will not cease to move forward\nwith the threat landscape—their impact will simply leave a different shape.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-05-20 - DisCONTInued The End of Contis Brand Marks New Chapter For Cybercrime Landscape.pdf"
    ],
    "report_names": [
        "2022-05-20 - DisCONTInued The End of Contis Brand Marks New Chapter For Cybercrime Landscape.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "079e3d6e-24ef-42b0-b555-75c288f9efd8",
            "created_at": "2023-03-04T02:01:54.105946Z",
            "updated_at": "2025-03-27T02:00:03.122936Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [
                "Karakurt Lair"
            ],
            "source_name": "MISPGALAXY:Karakurt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4e453d66-9ecd-47d9-b63a-32fa5450f071",
            "created_at": "2024-06-19T02:03:08.077075Z",
            "updated_at": "2025-03-27T02:05:17.381141Z",
            "deleted_at": null,
            "main_name": "GOLD LOTUS",
            "aliases": [
                "Hecamede ",
                "BlackByte"
            ],
            "source_name": "Secureworks:GOLD LOTUS",
            "tools": [
                " Cobalt Strike",
                " ExByte",
                " MEGA",
                " RDP",
                " SoftPerfect Network Scanner",
                "BlackByte"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535944,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653501946,
    "ts_modification_date": 1653501946,
    "files": {
        "pdf": "https://archive.orkl.eu/0c87d3863b4e5a55a2841a01afb524ad2e005ec0.pdf",
        "text": "https://archive.orkl.eu/0c87d3863b4e5a55a2841a01afb524ad2e005ec0.txt",
        "img": "https://archive.orkl.eu/0c87d3863b4e5a55a2841a01afb524ad2e005ec0.jpg"
    }
}