{
    "id": "a9115a7e-5538-4549-9215-6ed5ca1c7556",
    "created_at": "2023-04-05T02:08:26.9408Z",
    "updated_at": "2025-03-27T02:09:53.979378Z",
    "deleted_at": null,
    "sha1_hash": "16b88fb935be952baa1c800b45be31406b6e577a",
    "title": "2023-03-16 - IPFS- A New Data Frontier or a New Cybercriminal Hideout-",
    "authors": "",
    "file_creation_date": "2023-04-03T08:32:22Z",
    "file_modification_date": "2023-04-03T08:32:22Z",
    "file_size": 2895761,
    "plain_text": "# IPFS: A New Data Frontier or a New Cybercriminal Hideout?\n\n**trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/ipfs-a-new-data-frontier-or-a-new-cybercriminal-**\nhideout\n\n**By CSS Team Researchers:**\n\n**Cedric Pernet, Jaromir Horejsi, Loseway Lu**\n\nWith the rise of new technologies, innovations keep appearing that help us with our various\n[activities. A notable system that has emerged in recent years is IPFS system, a](https://ipfs.tech/#how)\ndecentralized storage and delivery network based on peer-to-peer (P2P) networking and\n[belonging to the emerging “Web3 technologies.”](https://en.wikipedia.org/wiki/Web3)\n\nIPFS allows users to host or share content on the internet at a more affordable price, with\navailability and resiliency capabilities. Unfortunately, it also provides opportunities for another\npart of the population: cybercriminals.\n\nIn this article, we briefly detail what IPFS is and how it works at the user level, before\nproviding up to date statistics about the current usage of IPFS by cybercriminals, especially\nfor hosting phishing content. We will also discuss emerging new cybercrime activities\nabusing the IPFS protocol and detail how cybercriminals already consider IPFS for their\ndeeds.\n\n## What is IPFS?\n\nIPFS stands for Interplanetary File System. It is a decentralized storage and delivery\nnetwork, which is built on the principles of P2P networking and content-based addressing.\n\nLet’s try comparing it to the way the usual web works. Most of the actual content hosted on\nthe web is served via web servers. In a very simplified view, the way it works on the internet\nis that different computers request data from different web servers. This data can be web\npages, files, or just any content that is accessible via an internet browser. Most of the time,\nthat content is hosted on a single web server, which serves its content to every computer\nrequesting it.\n\n\n-----\n\nFigure 1. Simplified HTTP(S) protocol\n\nIPFS is a bit different, in the way that there is no central web server providing the data: it can\nbe provided by any of the peers (also called nodes) hosting the data.\n\n\n-----\n\nFigure 2. IPFS peer-to-peer based model.\n\nTo start sharing files on IPFS, users can download and use an IPFS Desktop client, API or\nuse online services.\n\nOnce a file is requested by a node that does not have it, the file is copied so it can be shared\nfor others later. This way, more nodes can provide the file. This method makes it possible for\nany user, including cybercriminals, to create a free account on an online service and start\nhosting content on the IPFS network, without necessarily running a node on their own\ninfrastructure.\n\n## IPFS content identifier (CID)\n\nWhen browsing the internet, users generally access URLs, such as trendmicro.com, for\nexample. The users’ computer requests the DNS system to know where the data is located\nand fetches it from that location. Therefore, the client-server model of the web is said to be\nlocation-addressed.\n\nIn the P2P model adopted by IPFS, a given file might be located on a number of different\nIPFS peers. The storage of those files is addressed by a cryptographic hash of its content,\nknown as the content identifier (also called CID). The CID is a string of letters and numbers\nunique to files. A file will always have the same CID, no matter where it is stored. This is why\nIPFS is said to be content-addressed.\n\n\n-----\n\nIt should also be noted that a file will have a different CID if it is modified in any way.\n\nTwo versions of the CID exist. The CID v0 format is made of 46 characters and always start\nwith the characters “Qm”, while the CID v1 format uses base32.\n\nIt is possible to convert CID v0 to the CID v1 format:\n\nFigure 3. Converting CID v0 to CID v1\n\n## IPFS data browsing\n\nCIDs and their corresponding files can be accessed via two ways.\n\nThe first way consists of using a browser that handles the IPFS protocol natively. Currently,\nonly Brave browser supports IPFS. The computer runs an IPFS daemon in the background,\nwhich the browser uses to natively access the IPFS content.\n\nThe second way consists of accessing content via so-called “IPFS gateways.” These\ngateways are used to provide workarounds for applications that don’t natively support IPFS.\nTo summarize, a gateway is an IPFS peer that accepts HTTP requests for IPFS CIDs,\nallowing users to use their default browsers to access the IPFS content.\n\nThe global formats look like this:\n\nA list of current gateways and their status can be found online at: https://ipfs.github.io/publicgateway-checker/\n\n\n-----\n\nFigure 4. Screen capture from the public gateway checker\n\nAn example of a complete path to access an IPFS content via the ipfs.io gateway looks like\nthis:\n\nhttps://gateway.ipfs.io/ipfs/{randomly generated string}\n\nTo access the same content via the CloudFlare gateway, the URL would become:\n\nhttps://{same randomly generated string}.ipfs.cf-ipfs.com/\n\nNotice how the URL changes because we use a different gateway, but the CID (the randomly\ngenerated string) from this example does not change.\n\nAdditional parameters might follow that kind of URL depending on the case, just like any web\nlink.\n\n## IPFS pinning\n\nNodes handle the files stored on the IPFS network by caching them and making them\navailable for other nodes on the network. As every node only has a finite cache storage\namount, it is sometimes necessary to clean the cache used by the node, which is an\n\n\n-----\n\noperation called the IPFS Garbage collection process. During the operation, cached\ncontent that it considers no longer needed is removed. This is where IPFS pinning comes in.\n\nIPFS pinning consists of pinning data to ensure that it is not removed from the cache and is\nalways accessible.\n\nIPFS pinning can be done on locally hosted nodes, but pinning services exist to ensure longterm storage. It is interesting for cybercriminals who might use it to have their content stay\naccessible for longer periods.\n\n## IPNS – Interplanetary Name System\n\n[IPNS is another protocol, the Interplanetary Name System. It can be seen as a kind of DNS](https://docs.ipfs.tech/concepts/ipns/)\nsystem, but for IPFS. IPNS records are signed using a private key and contain IPFS content\npath and some other information, such as expiration or version number. IPNS records are\npublished over the Distributed Hash Table (DHT) protocol. Therefore, it needs republishing\non a regular basis not to be forgotten by the DHT peers over time.\n\nTo summarize, here is an example of an IPNS record:\n\n- /ipns/k2k4r8oid7ncjwgnpoy979brx3r9ellvvwofht57mc9q4jzlxtydalvf\n\npoints to\n\n- /ipfs/QmYr5ExzJJncpMNhqzhLjkCrRNgm4UmyX28gcYjt5RLYY8\n\nThe IPNS address might be reassigned later to point to other content.\n\n## DNSLink\n\nDNSLink uses the TXT records from the DNS protocol to map a DNS name to an IPFS\naddress. This makes it easier for administrators to maintain links to IPFS resources as the\nDNS TXT record can be changed easily.\n\nDNSLink addresses look like IPNS addresses, except that it uses a DNS name to replace\nthe hashed public key.\n\nAs an example, a DNSLink could look like this:\n\n_/ipns/example.org_\n\nTo map the relation, the DNS TXT record needs to be prefixed with dnslink, followed by the\nhostname.\n\nTo further elaborate, here is an example of a DNS TXT record for _dnslink.en/Wikipedia-on_ipfs.org, which resolves as_\n_dnslink=/ipfs/bafybeiaysi4s6lnjev27ln5icwm6tueaw2vdykrtjkwiphwekaywqhcjze._\n\n\n-----\n\n## IPFS usage\n\nIPFS can be used for a variety of reasons, including but not limited to:\n\n**Data storage and resilience**\n\nResilience relates to the adaptability of a network against isolation. It is also the ability to\nprovide and maintain a service in the case of faults. IPFS provides it in the sense that data is\ngenerally stored on several different nodes, making the data less prone to becoming\nunavailable.\n\nIt is also possible to store any kind of data at a very low price on IPFS via services such as\n[Filecoin, for example.](https://filecoin.io/)\n\n**Smart contracts and non-fungible tokens**\n\nSmart contracts are programs stored on the blockchain that can be triggered by transactions.\nWhile saving data on the blockchain can be expensive, using decentralized storage such as\nIPFS as the database can reduce costs. For example, one of the common implementations\nof NFT projects involves storing the metadata and the images (can also be a video, clip,\nmusic, etc.) on IPFS, then accessing the data using smart contracts.\n\n**Voting**\n\n[Voting platforms such as Snapshot allows users or companies to use IPFS for storing](https://snapshot.org/#/)\nproposals and user votes or polls.\n\n**Document signing**\n\nSome online services are available for decentralized versions of document signing. Users\ncan “sign” documents with their wallets. In this usage, the document files are stored on IPFS,\nand the signatures are stored on the Ethereum blockchain.\n\n**Fighting censorship**\n\nIPFS might be used by people living in countries that have active censorship technologies.\nThe ability to access the same content via multiple different gateways makes it easier to find\na way to reach data without it being blocked. The blocking solutions deployed in such\ncountries might just block one specific gateway and not others, for example.\n\n**Paste tools**\n\nJust as the website, pastebin.com, is located on the clear web, some paste services do exist\non IPFS, like hardbin.com, for example.\n\n**Decentralized apps**\n\n\n-----\n\nDecentralized apps or dApps can be built and hosted on IPFS. Available frameworks, such\nas Fleek, can help developers create such apps.\n\nThere are just as many different uses of dApps for IPFS than for the usual clear web.\n\n**Ecommerce**\n\nIPFS can be used to run ecommerce websites. During our research, we discovered one\necommerce framework. This particular framework provides hosting on IPFS, and works with\ncryptocurrencies, which makes it particularly interesting for cybercriminals.\n\nFigure 5. Banner for an ecommerce platform using IPFS and cryptocurrencies.\n\n## Cybercrime statistics\n\nWe have analyzed several months of IPFS-related cybercriminal activity from our telemetry.\n\nFor a few reasons, the method is not exhaustive, and the numbers provided might be lower\nthan reality, yet we still find them very interesting. The first limitation in analyzing our data\ncomes from the fact that some IPFS URLs were just not working at the time of our analysis.\nAnother limitation comes from the data themselves: URLs leading to password-protected\nfiles (mostly archive files) could not be analyzed, thus we cannot know the content of those\narchives. Finally, some of our customers do not want to send back any detection data, so our\nanalysis can’t be 100% accurate.\n\nThe results we obtained seem fairly constant from one month to the other in the observed\nrange, from May to September 2022.\n\n\n-----\n\nFigure 6. IPFS URL hit statistics\n\nAs can be seen in figure 6, the total number of IPFS analyzed in our telemetry per month\nranges from 5.5 million to 7.9 million hits.\n\nThe number of threats posed by IPFS in our data steadily increases. While it represented\n1.8% of the global IPFS traffic in May 2022, it now counts for almost 6% of the traffic. We\nbelieve with high confidence that it is still going to increase in the future\n\n**Scams**\n\nWe found very few IPFS-hosted content related to scams. The content we found, which was\nnever more than 0.02% of the threats, consists of images used by scammers such as those\nused for lottery scams, or more recently, in Bored Ape NFT scams. They are all related to\nlong-time existing types of fraud.\n\n**Phishing**\n\n[Phishing consists of enticing unsuspecting users into providing their credentials to](https://www.trendmicro.com/vinfo/us/security/definition/phishing/#:~:text=Phishing%20is%20a%20form%20of,or%20other%20sensitive%20personal%20information.)\ncybercriminals, generally via phishing emails, SMS, messages on social networks, private\nmessages, etc. leading to phishing pages hosted on the internet.\n\n\n-----\n\nThose phishing pages generally pretend to be a mailbox access or just any kind of online\nservices in order to make victims fill it with their login credentials, which cybercriminals can\nlater use for different fraudulent purposes.\n\nWhile phishing pages are relatively easy to set up, its main weakness resides in the hosting\nof such pages. As soon as a phishing page is reported, it is generally blocked within minutes\nby security solutions and taken down by the hosting company.\n\nUsing IPFS to host such phishing pages makes sense since the pages will be harder to take\ndown.\n\nFigure 7. Some gateways do take down phishing content, but simply switching the gateway\nallows access to the same phishing site\n\nThe majority of IPFS threats we analyzed are phishing threats. As can be seen in Figure 6,\nphishing occurs in more than 90% of the global IPFS threats for every month we analyzed,\nreaching 98.78% in September 2022.\n\n**Phishing statistics: IPFS vs non-IPFS**\n\nFigure 8. IPFS vs non-IPFS phishing pages hosting\n\n\n-----\n\nTo fully understand the threat of IPFS phishing, it needs to be compared to usual phishing\nusing the web. While percentage of IPFS vs. non-IPFS might seem low (between 3.5% and\n9% of phishing threats), the volume is a growing concern.\n\nIn October 2022, unique IPFS CIDs represented 9% of the global phishing threat, yet it still\nrepresents more than 23,000 unique pages hosted on IPFS for that month. We believe these\nnumbers are still going to increase in the future, and confident that IPFS phishing will count\nfor more than 10% of the phishing threat in the coming months.\n\nIt is also difficult to determine the real impact of IPFS phishing, as these statistics only reflect\na number of unique domains/CIDs, but not the number of emails spreading each of those. A\nunique domain might be triggered by millions of emails while another one might only spread\nto a few thousand victims.\n\n## IPFS phishing: stolen data still on the usual web\n\nFigure 9 shows an example of a phishing page we have seen in the wild, available on IPFS:\n\nFigure 9. Phishing example hosted on IPFS (Recipients email address has been removed)\n\n\n-----\n\nUnsuspecting users are led to that page via an initial email that contains an IPFS link to the\npage. The link contains one parameter transmitted to the page, which is the email address of\nthe target.\n\nbafybeicsapdb6iapble5huh6ph5gkjl75ugck7gnx4ih4w25zb[.]ipfs[.]w3s.link/aws.html?email=\n\nYet when analyzing the HTTP POST request headers sent by a victim who would click on the\n“Sign In” button, we see the data goes to a usual URL on the web:\n\nPOST /wp-content/plugins/ioptimization/awy/df.php HTTP/2\n\nHost: < REDACTED >.immo\n\nUser-Agent: < REDACTED >\n\nAccept: application/json, text/javascript, */*; q=0.01\n\nAccept-Language: fr,fr-FR;q=0.8,en-US;q=0.5,en;q=0.3\n\nAccept-Encoding: gzip, deflate, br\n\nContent-Type: application/x-www-form-urlencoded; charset=UTF-8\n\nContent-Length: 90\n\nOrigin: https://bafybeicsapdb6iapble5huh6ph5gkjl75ugck7gnx4ih4w25zb[.]ipfs[.]w3s.link\n\nDNT: 1\n\nConnection: keep-alive\n\nReferer: https://bafybeicsapdb6iapble5huh6ph5gkjl75ugck7gnx4ih4w25zb[.]ipfs[.]w3s.link/\n\nSec-Fetch-Dest: empty\n\nSec-Fetch-Mode: cors\n\nSec-Fetch-Site: cross-site\n\nThe data sent by the user is actually transmitted to a PHP script hosted on a compromised\nwebsite .immo, which is a website that is not hosted on IPFS.\n\nThis might be our most interesting discovery here: we found no IPFS phishing page that\nwould send the data to IPFS. All of the phishing pages we analyzed do send the stolen data\nto usual servers on the web.\n\n**Phishing emails**\n\nOur telemetry reports a daily activity of about 27,000 unique emails containing phishing IPFS\nlinks, leading to phishing pages hosted on IPFS. This activity covers approximately 30\ndifferent phishing campaigns per day.\n\n< TARGET EMAIL ADDRESS > Download your documents via WeTransfer < DATE >\n\nReminder: Please DocuSign:XXXXXX DRAFT XXXXX.docx\n\nMail Password Update Notification For < TARGET EMAIL ADDRESS >\n\nCompleted: Letter of Acceptance for Contract Ref. No. 2022/XXX/XXXXXXXXXXXX\n\n< COMPANY NAME > Insurance Renewal Quote\n\n\n-----\n\n< TARGET EMAIL ADDRESS > you have new shared Invoice document\nPassword for < TARGET EMAIL ADDRESS > expires today < DATE >\n\nYour < COMPANY WEBSITE URL > Account storage is 99% full\n\nAs can be seen in Figure 12, the phishing email topics are no different from the ones on the\nclear web that use common social engineering methods.\n\n## Malware\n\nSo far, we have seen very few cybercriminals making use of IPFS to host malware.\n\nWe found 180 different malware samples through the last five months, which is incredibly low\ncompared to the numerous samples we see every month.\n\nWe found very few ransomware on IPFS, most of those we found were older ransomware\nfamilies.\n\nAmongst the usual low-level malware that you might expect on the internet, such as adware\nand potentially unwanted applications (PUA), we found a few more serious threats on IPFS.\n\n## Information stealers and remote administration tools\n\n[Info stealers and malicious RATs are amongst the biggest threats on the internet, and we](https://www.trendmicro.com/vinfo/us/security/definition/Info-stealer)\nfound a few families on IPFS.\n\n**Malware Family** **Number of unique**\n**samples**\n\n[Agent Tesla (Trojan.MSIL.AGENTTESLA.THCOCBO)](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Trojan.MSIL.AGENTTESLA.THCOCBO) 55 samples\n\n\n[Formbook (Trojan.Win32.FORMBOOK.EPX](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/trojan.win32.formbook.epx/)\n\n[,Trojan.W97M.FORMBOOK.AQ)](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/Trojan.W97M.FORMBOOK.AQ/)\n\n\n10 samples\n\n\n[Remcos RAT (Backdoor.Win32.REMCOS.TICOGBZ)](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/backdoor.win32.remcos.ticogbz) 9 samples\n\n\nRedline Stealer\n[(TrojanSpy.MSIL.REDLINESTEALER.YXBDN,](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/trojanspy.msil.redlinestealer.yxbdn)\n\n[TrojanSpy.Win32.REDLINE.X,](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/trojanspy.win32.redline.x/)\n\n[TrojanSpy.MSIL.REDLINESTEALER.N)](https://www.trendmicro.com/vinfo/us/threat-encyclopedia/malware/TrojanSpy.MSIL.REDLINESTEALER.N/)\n\n\n6 samples\n\n\nOther various RATs/infostealers 3 samples\n\nTable 1. Malware family and their samples on IPFS\n\nIn addition to malware, we also found common tools used for legitimate and non-legitimate\npurposes hosted on IPFS, such as proxying tools or scamming tools, and file binders.\n\n\n-----\n\nFinally, we could find seven cryptominer samples that are hosted on IPFS, which might be\nused for legitimate or illegitimate purpose, depending if they are run legally or on\ncompromised machines.\n\n## IPFS in underground forums\n\n**IPFS discussions**\n\nJust as with any new technology, IPFS is being discussed in cybercriminal underground\nforums. The discussions range from non-technical topics, often produced by low skilled\ncybercriminals with questions like “what is IPFS?” to real technical conversations about IPFS\ninfrastructure.\n\nSome of those cybercriminals were criticizing the protocol, mostly by emphasizing that it is\nreally slow and cannot be used for all purposes, while others were more enthusiastic and\nalready using it.\n\n[One of the IPFS adopters asked on the Lapsu$ Chat on Telegram, however, did not get an](https://news.trendmicro.com/tag/lapsus/)\nanswer:\n\n_“Lapsus team, how feasible would it be to setup an ipfs node on the server you’re currently_\n_seeding from? Data would be quickly cached on cloudflare for free and downloads would be_\n_super fast.”_\n\n**IPFS for data sharing amongst cybercriminals**\n\nCybercriminals often need to share files, cybercrime methods/tutorials, or even just\nscreenshots on the underground forums, and use free data hosting services such as\nMediaFire or Mega for these purposes. Some might also use hosting on the Tor union\nnetwork.\n\nWe have seen an increasing number of cybercriminals using IPFS to store such content and\nshare it with their peers since 2021.\n\nAs an example, we saw one user share a PDF file on IPFS in November 2022 that is actually\na tutorial on “How to build a website/shop that cannot be shut down by Law enforcement.”\n\n\n-----\n\nFigure 10: Sample content from a PDF file hosted on IPFS and shared amongst\ncybercriminals\n\n**IPFS for illegal content hosting**\n\nWe found advertisements in underground forums for a few illegal commercial services that\nwere hosted on IPFS.\n\nFigure 11. Entrance page for a website that sells illegal drugs hosted on IPFS.\n\n\n-----\n\nFigure 12. Screenshot of a website that sells drugs found on IPFS\n\nThe website owners describe themselves as veterans from the Darknet interested in new\ntechnologies.\n\nFigure 13. Description from the website’s About us page\n\n## Conclusion\n\nIPFS and its related IPNS are protocols that can be abused by cybercriminals, just like any\nother protocol.\n\nCybercriminals with average or low skill levels will probably not use much of the technology,\nmostly because it needs some preparation and knowledge to be used efficiently. Yet, the\nmore advanced malicious actors might see opportunities in it. Backed by the fact that they\nare already talking about it in their underground forums. Additionally, some of them are\nalready using it for hosting and conducting their deeds.\n\nEcommerce looks to be growing in the IPFS environment and this has definitely been\nexploited by the cybercriminals. They have set up stores selling illegal goods, and in the\nevent that one node is down, another will take its place, providing resiliency. However, we\nshould also take note of the increase of phishing sites and how it works well in IPFS. Other\n\n\n-----\n\nthreat actors are also using the system to host malware. We also expect some threat actors\nto create their own IPFS gateways and run nodes to keep their content online as much as\npossible.\n\nWhile IPFS is a popular choice when it comes to Web 3.0 decentralized storage, there are\nmore options. We expect threat actors to explore other Web3 storages for their operations\nmoving forward. In this sense, we must become more vigilant whenever a new technology\nappears, because while it can benefit a lot of people, cybercriminals can also see\nopportunities.\n\nHIDE\n\n**Like it? Add this infographic to your site:**\n\n1. Click on the box below.  2. Press Ctrl+A to select all.  3. Press Ctrl+C to copy.  4. Paste\nthe code into your page (Ctrl+V).\n\nImage will appear the same size as you see above.\n\n[Posted in Cybercrime & Digital Threats](https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-16 - IPFS- A New Data Frontier or a New Cybercriminal Hideout-.pdf"
    ],
    "report_names": [
        "2023-03-16 - IPFS- A New Data Frontier or a New Cybercriminal Hideout-.pdf"
    ],
    "threat_actors": [
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1680660506,
    "ts_updated_at": 1743041393,
    "ts_creation_date": 1680510742,
    "ts_modification_date": 1680510742,
    "files": {
        "pdf": "https://archive.orkl.eu/16b88fb935be952baa1c800b45be31406b6e577a.pdf",
        "text": "https://archive.orkl.eu/16b88fb935be952baa1c800b45be31406b6e577a.txt",
        "img": "https://archive.orkl.eu/16b88fb935be952baa1c800b45be31406b6e577a.jpg"
    }
}