{
    "id": "a954cc0e-e24b-4521-9046-3c32816e4372",
    "created_at": "2024-10-25T02:06:29.307109Z",
    "updated_at": "2025-03-27T02:16:35.044431Z",
    "deleted_at": null,
    "sha1_hash": "c147de3d6da2aac981297370d926273da239bf9d",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-10-09T16:11:43Z",
    "file_modification_date": "2024-10-09T16:11:43Z",
    "file_size": 453807,
    "plain_text": "_Co-Authored by:_ **TLP:CLEAR** Product ID: JCSA-20241010-001\n\n\nOctober 10, 2024\n\n\n# Update on SVR Cyber Operations and Vulnerability Exploitation\n\n## SUMMARY\n\n\nThe Federal Bureau of Investigation (FBI), the\nNational Security Agency (NSA), Cyber National\nMission Force (CNMF), and the United\nKingdom’s National Cyber Security Centre\n(NCSC-UK) are releasing this joint Cybersecurity\nAdvisory (CSA) to highlight the tactics,\ntechniques, and procedures (TTPs) employed by\nthe Russian Federation’s Foreign Intelligence\nService (SVR) in recent cyber operations and\nprovide network defenders with information to\nhelp counter SVR cyber threats.\n\n\nThe authoring agencies recommend the\nfollowing mitigations to protect their networks.\nSee the Mitigations section for the complete\nlist.\n\n\nAdvisory (CSA) to highlight the tactics, - Reduce attack surface by disabling\ntechniques, and procedures (TTPs) employed by Internet-accessible services that you do\nthe Russian Federation’s Foreign Intelligence not need, or restrict access to trusted\nService (SVR) in recent cyber operations and networks, and removing unused\nprovide network defenders with information to applications and utilities from\nhelp counter SVR cyber threats. workstations and development\n\nenvironments.\n\nSince at least 2021, Russian SVR cyber actors –\n\n                           - Require and enforce multi-factor\n\nalso tracked as APT29, Midnight Blizzard\n\nauthentication whenever possible.\n\n(formerly Nobelium), Cozy Bear, and the Dukes\n\n                           - Regularly audit cloud-based accounts\n\n– have consistently targeted US, European, and\n\nand applications with administrative\n\nglobal entities in the defense, technology, and\n\naccess to email for unusual activity.\n\nfinance sectors to collect foreign intelligence and\nenable future cyber operations, including in\nsupport of Russia’s ongoing invasion of Ukraine since February 2022. Their operations continue to\npose a global threat to government and private sector organizations.\n\n\nThe authoring agencies are releasing this CSA to warn network defenders that SVR cyber actors are\n[highly capable of and interested in exploiting software vulnerabilities for initial access [T1190] and](https://attack.mitre.org/techniques/T1190/)\n[escalation of privileges [T1068]. Organizations should prioritize rapid patch deployment and keep](https://attack.mitre.org/techniques/T1068/)\n[software up to date. The SVR continues using TTPs such as spearphishing [T1566], password](https://attack.mitre.org/techniques/T1566/)\n[spraying [T1078], abuse of supply chain [T1195] and trusted relationships [T1199], custom and](https://attack.mitre.org/techniques/T1078/)\n\n_To report suspicious or criminal activity related to information found in this Joint Cybersecurity Advisory, contact_\n_[your local FBI field office. When available, please include the following information regarding the incident: date,](https://www.fbi.gov/contact-us/field-offices)_\n_time, and location of the incident; type of activity; number of people affected; type of equipment used for the_\n_activity; the name of the submitting company or organization; and a designated point of contact. For NSA_\n_[cybersecurity reporting inquiries, contact CybersecurityReports@nsa.gov.](mailto:CybersecurityReports@nsa.gov)_\n\n_This document is marked TLP:CLEAR. Disclosure is not limited. Sources may use TLP:CLEAR when information_\n_carries minimal or no foreseeable risk of misuse, in accordance with applicable rules and procedures for public_\n_release. Subject to standard copyright rules, TLP:CLEAR information may be distributed without restriction. For_\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\nbespoke malware, cloud exploitation, and living-off-the-land techniques to gain initial access, escalate\nprivileges, move laterally, maintain persistence in victim networks and cloud environments, and\nexfiltrate information. SVR actors often use The Onion Router (TOR) network, leased and\ncompromised infrastructure, and proxies to obfuscate activity.\n\n## TECHNICAL DETAILS\n\n**[Note: This advisory uses the MITRE ATT&CK® for Enterprise](https://attack.mitre.org/matrices/enterprise/)** framework, version 15.1. See the\nATT&CK Tactics and Techniques section for a table of the threat actors’ activity mapped to ATT&CK\ntactics and techniques. For assistance with mapping malicious cyber activity to the ATT&CK\n[framework, see Best Practices for MITRE ATT&CK Mapping](https://www.cisa.gov/news-events/news/best-practices-mitre-attckr-mapping) [and Decider Tool.](https://github.com/cisagov/Decider/)\n\n### Victims\n\nSVR cyber operations generally have two types of intended victims: targets of intent and targets of\nopportunity.\n\nTargets of intent include government and diplomatic entities, technology companies, think tanks,\ninternational organizations, and cleared defense contractors. These groups are targeted for the\npurpose of collecting foreign intelligence and technical data as well as establishing accesses to\nenable subsequent downstream/supply chain compromises. These targets include governments and\norganizations in North America and Western Europe as well as public and private sector\norganizations in Asia, Africa, Russia’s near abroad, and South America. Since 2021, SVR cyber\noperations have continued against Ukraine, likely in support of Russian war efforts.\n\nTargets of opportunity represent entities with Internet-accessible infrastructure vulnerable to\nexploitation through publicly disclosed vulnerabilities, weak authentication controls, or system\nmisconfigurations. SVR cyber operators consistently scan Internet-facing systems for unpatched\nvulnerabilities. This mass scanning and opportunistic exploitation of vulnerable systems, as opposed\nto more targeted operations, increase the threat surface to include virtually any organization with\nvulnerable systems. The SVR takes advantage of opportunistic victims to host malicious\ninfrastructure, conduct follow-on operations from compromised accounts, or to attempt to pivot to\nother networks.\n\n     - In 2023, SVR cyber actors conducted opportunistic exploitation of a JetBrains TeamCity CVE\nto target an energy trade association, software development firms, hosting companies, tools\nmanufacturers, and information technology companies.\n\n     - Also in 2023, SVR cyber actors used Microsoft Teams accounts impersonating technical\n[support entities to send spearphishing messages [T1566] via Microsoft Teams Chat to socially](https://attack.mitre.org/techniques/T1566/)\nengineer the victims to grant the actors account access. The campaign was enabled by\ncompromises of poorly secured Microsoft customer tenants operated by numerous small\n[businesses [T1584.005]. After obtaining access to those small businesses’ accounts, the SVR](https://attack.mitre.org/techniques/T1584/005/)\ncreated platforms in those victim environments to enable operations targeting their intended\nvictim organizations, which included government agencies, technology and manufacturing\nfirms, and non-governmental organizations.\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n### Infrastructure\n\nSVR cyber intrusions include a heavy focus on remaining anonymous and undetected. The actors\nuse TOR extensively throughout intrusions – from initial targeting to data collection – and across\nnetwork infrastructure. The actors lease operational infrastructure using a variety of fake identities\n[and low reputation email accounts [T1583]. The SVR obtains infrastructure from resellers of major](https://attack.mitre.org/techniques/T1583/)\nhosting providers.\n\nWhen the SVR suspects their intrusions have been identified by their victim or law enforcement, they\nquickly attempt to destroy their infrastructure and any evidence on it. To remain undetected, the SVR\nfrequently uses tools and programs already on victim networks to avoid anti-virus software. During\nintrusions into cloud environments, the SVR exploits misconfigurations and weak access controls to\naccess information without the need for additional software.\n\nAdditionally, SVR infrastructure used to directly interact with victims located in North America almost\n[exclusively consists of endpoints associated with one or more proxy networks [T1665]. These proxy](https://attack.mitre.org/techniques/T1665/)\nnetworks, which frequently use networks associated with mobile telephone providers or residential\nInternet services, are used to attempt to blend in with legitimate users of the victims’ network and\navoid connections originating from IP addresses associated with datacenters or commercial VPN\nproviders.\n\nTo disrupt this activity, organizations should baseline authorized devices and apply additional scrutiny\nto systems accessing their network resources that do not adhere to the baseline.\n\n#### Vulnerability Exploitation\nIn April 2021, the US, UK, and Canadian governments published a joint CSA highlighting the SVR’s\nexploitation of CVEs for initial access. Since then, SVR cyber actors have exploited vulnerabilities at a\nmass scale to target victims worldwide across a variety of sectors, including:\n\n     - **[CVE-2022-27924: CVE-2022-2794 is a command injection vulnerability [CWE-74] that allows](https://cwe.mitre.org/data/definitions/74.html)**\nan unauthenticated attacker to inject arbitrary memcache commands into a targeted Zimbra\ninstance, causing an overwrite of arbitrary cached entries. SVR cyber actors exploited Zimbra\nmail servers targeting hundreds of domains worldwide, including through exploitation of the\nCVE. This allowed the actors to access user credentials and mailboxes without victim\ninteraction. Following the exploitation of those systems, the SVR deployed infrastructure to\nenable collection from the victims.\n\n     - **CVE-2023-42793: Starting in September 2023, SVR cyber actors have exploited JetBrains**\nTeamCity CVE-2023-42793, which enabled arbitrary code execution via insecure handling of\nspecific paths allowing for authentication bypass.\n\nBased on the SVR cyber actors’ TTPs and previous targeting, the authoring agencies assess they\nhave the capability and interest to exploit additional CVEs for initial access, remote code execution,\nand privilege escalation, including the ones listed below. The below CVEs have all been publicly\ndisclosed; organizations should implement vendor-issued security patches if they have not already.\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n_Table 1: CVEs_\n\n|CVE|Vendor/Product|Details|\n|---|---|---|\n|CVE-2023-20198|Cisco IOS XE Software web UI feature|Privilege escalation vulnerability [CWE-269] that allows an attacker to create a local user and password combination|\n|CVE-2023-4911|RHSA GNU C Library's dynamic loader ld.so|Buffer overflow vulnerability [CWE- 122] that could allow a local attacker to execute code with elevated privileges|\n|CVE-2023-38545|Haxx Libcurl|SOCKS5 heap buffer overflow vulnerability [CWE-122]|\n|CVE-2023-38546|Haxx Libcurl|Missing authorization vulnerability [CWE-862] that allows an attacker to insert cookies in a running program if certain conditions are met|\n|CVE-2023-40289|Supermicro X11SSM-F, X11SAE-F, and X11SSE- F 1.66|Command injection vulnerability [CWE-74] that allows an attacker to elevate privileges|\n|CVE-2023-24023|Bluetooth BR/EDR devices with Secure Simple Pairing and Secure Connections pairing in Bluetooth Core Specification 4.2 through 5.4|Allows certain man-in-the-middle attacks [CWE-300] that force a short key length [CWE-326], and might lead to discovery of the encryption key and live injection, aka BLUFFS.|\n|CVE-2023-40088|Android|Use after free [CWE-416] vulnerability that could lead to remote (proximal, adjacent) code execution|\n|CVE-2023-40076|Google Android 14.0|Permissions bypass vulnerability [CWE-200] that allows an attacker to access credentials and escalate local privileges|\n|CVE-2023-40077|Google Android 11-14|Use after free [CWE-416] vulnerability that can lead to escalation of privileges|\n|CVE-2023-45866|Bluetooth HID Hosts in BlueZ|Improper authentication vulnerability [CWE-287] that could allow an attacker in close proximity to inject keystrokes and carry out arbitrary commands|\n|CVE-2022-40507|Qualcomm|Double free vulnerability [CWE-415]|\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n[CVE-2023-36745](https://nvd.nist.gov/vuln/detail/CVE-2023-36745) Microsoft Exchange [Remote code execution [CWE-502]](https://cwe.mitre.org/data/definitions/502.html)\nServer\n\n[CVE-2023-4966](https://nvd.nist.gov/vuln/detail/CVE-2023-4966) Citrix NetScaler ADC, [Buffer overflow vulnerability [CWE-](https://cwe.mitre.org/data/definitions/119.html)\nNetScaler Gateway [119]](https://cwe.mitre.org/data/definitions/119.html)\n\n[CVE-2023-6345](https://nvd.nist.gov/vuln/detail/CVE-2023-6345) Google Chrome [Integer overflow vulnerability [CWE-](https://cwe.mitre.org/data/definitions/190.html)\n[190] that allows a remote attacker to](https://cwe.mitre.org/data/definitions/190.html)\npotentially perform a sandbox escape\nvia a malicious file\n[CVE-2023-37580](https://nvd.nist.gov/vuln/detail/CVE-2023-37580) Zimbra Cross-site scripting (XSS) vulnerability\n\n[[CWE-79]](https://cwe.mitre.org/data/definitions/79.html)\n[CVE-2021-27850](https://nvd.nist.gov/vuln/detail/CVE-2021-27850) Apache Tapestry Critical unauthenticated remote code\n[execution vulnerability [CWE-502]](https://cwe.mitre.org/data/definitions/502.html)\n[CVE-2021-41773](https://nvd.nist.gov/vuln/detail/CVE-2021-41773) Apache HTTP server [Directory traversal vulnerability [CWE-](https://cwe.mitre.org/data/definitions/35.html)\n2.4.99 [35]](https://cwe.mitre.org/data/definitions/35.html)\n\n[CVE-2021-42013](https://nvd.nist.gov/vuln/detail/CVE-2021-42013) Apache HTTP server Remote code execution vulnerability\n2.4.50 [[CWE-22]](https://cwe.mitre.org/data/definitions/22.html)\n\n[CVE-2018-13379](https://nvd.nist.gov/vuln/detail/CVE-2018-13379) Fortinet FortiGate SSL [Path traversal vulnerability [CWE-35]](https://cwe.mitre.org/data/definitions/35.html)\nVPN\n\n[CVE-2023-42793](https://nvd.nist.gov/vuln/detail/CVE-2023-42793) JetBrains TeamCity Authentication bypass vulnerability\n\n[[CWE-288]](https://cwe.mitre.org/data/definitions/288.html)\n[CVE-2023-29357](https://nvd.nist.gov/vuln/detail/CVE-2023-29357) SharePoint Server Elevation of privilege vulnerability\n\n[[CWE-303]](https://cwe.mitre.org/data/definitions/303.html)\n[CVE-2023-24955](https://nvd.nist.gov/vuln/detail/CVE-2023-24955) SharePoint Server Remote code execution vulnerability\n\n[[CWE-94]](https://cwe.mitre.org/data/definitions/94.html)\n[CVE-2023-35078](https://nvd.nist.gov/vuln/detail/CVE-2023-35078) Ivanti Endpoint Manager Authentication bypass vulnerability\nMobile versions through [[CWE-288]](https://cwe.mitre.org/data/definitions/288.html)\n11.10\n\n[CVE-2023-5044](https://nvd.nist.gov/vuln/detail/CVE-2023-5044) Kubernetes Ingress-nginx [Code injection vulnerability [CWE-94]](https://cwe.mitre.org/data/definitions/94.html)\n\n|CVE-2023-36745|Microsoft Exchange Server|Remote code execution [CWE-502]|\n|---|---|---|\n|CVE-2023-4966|Citrix NetScaler ADC, NetScaler Gateway|Buffer overflow vulnerability [CWE- 119]|\n|CVE-2023-6345|Google Chrome|Integer overflow vulnerability [CWE- 190] that allows a remote attacker to potentially perform a sandbox escape via a malicious file|\n|CVE-2023-37580|Zimbra|Cross-site scripting (XSS) vulnerability [CWE-79]|\n|CVE-2021-27850|Apache Tapestry|Critical unauthenticated remote code execution vulnerability [CWE-502]|\n|CVE-2021-41773|Apache HTTP server 2.4.99|Directory traversal vulnerability [CWE- 35]|\n|CVE-2021-42013|Apache HTTP server 2.4.50|Remote code execution vulnerability [CWE-22]|\n|CVE-2018-13379|Fortinet FortiGate SSL VPN|Path traversal vulnerability [CWE-35]|\n|CVE-2023-42793|JetBrains TeamCity|Authentication bypass vulnerability [CWE-288]|\n|CVE-2023-29357|SharePoint Server|Elevation of privilege vulnerability [CWE-303]|\n|CVE-2023-24955|SharePoint Server|Remote code execution vulnerability [CWE-94]|\n|CVE-2023-35078|Ivanti Endpoint Manager Mobile versions through 11.10|Authentication bypass vulnerability [CWE-288]|\n|CVE-2023-5044|Kubernetes Ingress-nginx|Code injection vulnerability [CWE-94]|\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n## ATT&CK TACTICS AND TECHNIQUES \n\nSee table 2 for all referenced threat actor tactics and techniques in this advisory.\n\n_Table 2: SVR ATT&CK Techniques for Enterprise_\n\n|Technique Title|ID|Use|\n|---|---|---|\n|Exploit Public- Facing Application|T1190|The actors exploit multiple CVEs for initial access and/or privilege escalation.|\n|Escalation of privileges|T1068|The actors escalate privileges on a compromised host.|\n|Phishing|T1566|The actors commonly conduct spear phishing campaigns.|\n|Valid accounts|T1078|The actors conduct password spraying to access victim environments.|\n|Compromise software supply chain|T1195.002|The actors use trojanized software updates to compromise downstream customers.|\n|Trusted Relationship|T1199|The actors abuse trusted relationships to target other connections.|\n|Compromise Infrastructure|T1584|The actors compromise infrastructure to incorporate in future operations.|\n|Hide Infrastructure|T1665|The actors use residential proxies and TOR to obfuscate infrastructure.|\n|Acquire Infrastructure|T1583|The actors use cryptocurrencies, fake identities, and low reputation email accounts to lease infrastructure.|\n|Compromise Infrastructure: Botnet|T1584.005|The actors compromise numerous third-party systems to form a botnet.|\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n## MITIGATIONS\n\nThe authoring agencies recommend organizations implement the mitigations below to improve your\norganization’s cybersecurity posture on the basis of the threat actor’s activity.\n\n     - Prioritize rapid deployment of patches and software updates as soon as they become\navailable. Enable automatic updates where possible.\n\n     - Reduce attack surface by disabling Internet-accessible services that you do not need, or\nrestrict access to trusted networks, and removing unused applications and utilities from\nworkstations and development environments.\n\n     - Perform continuous threat hunting activities.\n\n     - Ensure proper configuration of systems – check for open ports and obsolete or unused\nprotocols, especially on Internet-facing systems.\n\n     - Isolate Internet-facing services in a network Demilitarized Zone (DMZ) to reduce exposure of\ninternal networks.\n\n     - Require and enforce multi-factor authentication whenever possible.\n\n     - Require additional identity challenges for enrollment of new devices when users are permitted\nto self-enroll multi-factor authentication mechanisms or register devices on the corporate\nnetwork.\n\n     - Notify users across multiple platforms when devices have been successfully registered to help\nidentify unexpected registrations. Train and encourage users to notice and report unexpected\nregistrations.\n\n     - Enable robust logging for authentication services and Internet-facing functions.\n\n     - Regularly audit cloud-based accounts and applications with administrative access to email for\nunusual activity.\n\n     - Limit token access lifetimes and monitor for evidence of token reuse.\n\n     - Enforce least-privileged access and disable external management capabilities.\n\n     - Baseline authorized devices and apply additional scrutiny to systems accessing network\nresources that do not adhere to the baseline.\n\n     - Disable remote downloading of information to non-enrolled devices when possible.\n\nThe authoring agencies recommend testing your existing security controls to assess how they\nperform against the techniques described in this advisory.\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n## REFERENCES\n\n**NSA, FBI, CISA Cybersecurity Advisory** [Russian SVR Targets U.S. and Allied Networks](https://media.defense.gov/2021/Apr/15/2002621240/-1/-1/0/CSA_SVR_TARGETS_US_ALLIES_UOO13234021.PDF)\n\n**FBI, DHS Joint Cybersecurity Advisory** [Russian Foreign Intelligence Service (SVR) Cyber](https://www.ic3.gov/Media/News/2021/210426.pdf)\n[Operations: Trends and Best Practices for Network Defenders](https://www.ic3.gov/Media/News/2021/210426.pdf)\n\n**UK NCSC, CISA, FBI, NSA Advisory** [Further TTPs associated with SVR cyber actors](http://www.ncsc.gov.uk/news/joint-advisory-further-ttps-associated-with-svr-cyber-actors)\n\n**UK NCSC, CISA, CNMF, FBI, NSA, ASD ACSC, CCCS, NZ NCSC Joint Cybersecurity Advisory**\n[SVR Cyber Actors Adapt Tactics for Initial Cloud Access (AA24-057A)](https://www.ncsc.gov.uk/news/svr-cyber-actors-adapt-tactics-for-initial-cloud-access)\n\n**FBI, CISA, NSA, UK NCSC, SKW, CERT.PL Joint Cybersecurity Advisory** [Russian Foreign](https://www.ic3.gov/Media/News/2023/231213.PDF)\n[Intelligence Service (SVR) Exploiting JetBrains TeamCity CVE Globally (AA23-347A)](https://www.ic3.gov/Media/News/2023/231213.PDF)\n\n## DISCLAIMER\n\nThe information in this report is being provided “as is” for informational purposes only. The authoring\nagencies do not endorse any commercial entity, product, company, or service, including any entities,\nproducts, or services linked within this document. Any reference to specific commercial entities,\nproducts, processes, or services by service mark, trademark, manufacturer, or otherwise, does not\nconstitute or imply endorsement, recommendation, or favoring by the authoring agencies.\n\n## VERSION HISTORY\n\nOctober 10, 2024: Initial version.\n\n\nFBI | NSA | CNMF | NCSC\n**TLP:CLEAR**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        }
    ],
    "references": [
        "https://www.ic3.gov/CSA/2024/241010.pdf"
    ],
    "report_names": [
        "241010.pdf"
    ],
    "threat_actors": [
        {
            "id": "b43e5ea9-d8c8-4efa-b5bf-f1efb37174ba",
            "created_at": "2022-10-25T16:07:24.36191Z",
            "updated_at": "2025-03-27T02:02:10.1909Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "Dark Halo",
                "Nobelium",
                "SolarStorm",
                "StellarParticle",
                "UNC2452"
            ],
            "source_name": "ETDA:UNC2452",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "70872c3a-e788-4b55-a7d6-b2df52001ad0",
            "created_at": "2023-01-06T13:46:39.18401Z",
            "updated_at": "2025-03-27T02:00:03.01553Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "DarkHalo",
                "StellarParticle",
                "NOBELIUM",
                "Solar Phoenix",
                "Midnight Blizzard"
            ],
            "source_name": "MISPGALAXY:UNC2452",
            "tools": [
                "SNOWYAMBER",
                "HALFRIG",
                "QUARTERRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "1d3f9dec-b033-48a5-8b1e-f67a29429e89",
            "created_at": "2022-10-25T15:50:23.739197Z",
            "updated_at": "2025-03-27T02:00:55.536417Z",
            "deleted_at": null,
            "main_name": "UNC2452",
            "aliases": [
                "UNC2452",
                "NOBELIUM",
                "StellarParticle",
                "Dark Halo"
            ],
            "source_name": "MITRE:UNC2452",
            "tools": [
                "Sibot",
                "Mimikatz",
                "Cobalt Strike",
                "AdFind",
                "GoldMax"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5b748f86-ac32-4715-be9f-6cf25ae48a4e",
            "created_at": "2024-06-04T02:03:07.956135Z",
            "updated_at": "2025-03-27T02:05:17.407352Z",
            "deleted_at": null,
            "main_name": "IRON HEMLOCK",
            "aliases": [
                "ATK7 ",
                "Blue Kitsune ",
                "Cozy Bear ",
                "The Dukes",
                "UNC2452 ",
                "YTTRIUM ",
                "APT29 "
            ],
            "source_name": "Secureworks:IRON HEMLOCK",
            "tools": [
                " CozyCar",
                " CozyDuke",
                " DiefenDuke",
                " FatDuke",
                " HAMMERTOSS",
                " LiteDuke",
                " MiniDuke",
                " OnionDuke",
                " PolyglotDuke",
                " RegDuke",
                " RegDuke Loader",
                " SeaDuke",
                " Sliver",
                "CosmicDuke"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a241a1ca-2bc9-450b-a07b-aae747ee2710",
            "created_at": "2024-06-19T02:03:08.150052Z",
            "updated_at": "2025-03-27T02:05:17.409596Z",
            "deleted_at": null,
            "main_name": "IRON RITUAL",
            "aliases": [
                "Blue Dev 5 ",
                "BlueBravo ",
                "Cloaked Ursa ",
                "CozyLarch ",
                "Dark Halo ",
                "Midnight Blizzard ",
                "NOBELIUM ",
                "StellarParticle ",
                "UNC2452 ",
                "APT29"
            ],
            "source_name": "Secureworks:IRON RITUAL",
            "tools": [
                " Cobalt Strike",
                " EnvyScout",
                " GoldFinder",
                " GoldMax",
                " NativeZone",
                " RAINDROP",
                " SUNBURST",
                " Sibot",
                " TEARDROP",
                " VaporRage",
                "Brute Ratel C4"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "20d3a08a-3b97-4b2f-90b8-92a89089a57a",
            "created_at": "2022-10-25T15:50:23.548494Z",
            "updated_at": "2025-03-27T02:00:55.49688Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "APT29",
                "IRON RITUAL",
                "IRON HEMLOCK",
                "NobleBaron",
                "Dark Halo",
                "NOBELIUM",
                "UNC2452",
                "YTTRIUM",
                "The Dukes",
                "Cozy Bear",
                "CozyDuke",
                "SolarStorm",
                "Blue Kitsune",
                "UNC3524",
                "Midnight Blizzard"
            ],
            "source_name": "MITRE:APT29",
            "tools": [
                "PinchDuke",
                "ROADTools",
                "WellMail",
                "CozyCar",
                "Mimikatz",
                "Tasklist",
                "OnionDuke",
                "FatDuke",
                "POSHSPY",
                "EnvyScout",
                "SoreFang",
                "GeminiDuke",
                "GoldMax",
                "FoggyWeb",
                "SDelete",
                "PolyglotDuke",
                "AADInternals",
                "MiniDuke",
                "SeaDuke",
                "Sibot",
                "RegDuke",
                "CloudDuke",
                "GoldFinder",
                "AdFind",
                "PsExec",
                "NativeZone",
                "Systeminfo",
                "ipconfig",
                "Impacket",
                "Cobalt Strike",
                "PowerDuke",
                "QUIETEXIT",
                "HAMMERTOSS",
                "BoomBox",
                "CosmicDuke",
                "WellMess",
                "VaporRage",
                "LiteDuke"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "46b3c0fc-fa0c-4d63-a38a-b33a524561fb",
            "created_at": "2023-01-06T13:46:38.393409Z",
            "updated_at": "2025-03-27T02:00:02.822155Z",
            "deleted_at": null,
            "main_name": "APT29",
            "aliases": [
                "The Dukes",
                "Minidionis",
                "Grizzly Steppe",
                "G0016",
                "Blue Kitsune",
                "BlueBravo",
                "SeaDuke",
                "Cloaked Ursa",
                "YTTRIUM",
                "ATK7",
                "Nobelium",
                "UAC-0029",
                "Group 100",
                "COZY BEAR",
                "IRON HEMLOCK",
                "TA421",
                "ITG11"
            ],
            "source_name": "MISPGALAXY:APT29",
            "tools": [
                "QUARTERRIG",
                "SNOWYAMBER",
                "HALFRIG"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f27790ff-4ee0-40a5-9c84-2b523a9d3270",
            "created_at": "2022-10-25T16:07:23.341684Z",
            "updated_at": "2025-03-27T02:02:09.74554Z",
            "deleted_at": null,
            "main_name": "APT 29",
            "aliases": [
                "APT 29",
                "ATK 7",
                "Blue Dev 5",
                "BlueBravo",
                "Cloaked Ursa",
                "CloudLook",
                "Cozy Bear",
                "Dark Halo",
                "Earth Koshchei",
                "Grizzly Steppe",
                "Group 100",
                "ITG11",
                "Iron Hemlock",
                "Iron Ritual",
                "Midnight Blizzard",
                "Minidionis",
                "Nobelium",
                "NobleBaron",
                "Operation Ghost",
                "Operation Office monkeys",
                "Operation StellarParticle",
                "SilverFish",
                "Solar Phoenix",
                "SolarStorm",
                "StellarParticle",
                "TEMP.Monkeys",
                "The Dukes",
                "UNC2452",
                "UNC3524",
                "Yttrium"
            ],
            "source_name": "ETDA:APT 29",
            "tools": [
                "7-Zip",
                "ATI-Agent",
                "AdFind",
                "Agentemis",
                "AtNow",
                "BEATDROP",
                "BotgenStudios",
                "CEELOADER",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobalt Strike",
                "CobaltStrike",
                "CosmicDuke",
                "Cozer",
                "CozyBear",
                "CozyCar",
                "CozyDuke",
                "Danfuan",
                "EnvyScout",
                "EuroAPT",
                "FatDuke",
                "FoggyWeb",
                "GeminiDuke",
                "Geppei",
                "GoldFinder",
                "GoldMax",
                "GraphDrop",
                "GraphicalNeutrino",
                "GraphicalProton",
                "HAMMERTOSS",
                "HammerDuke",
                "LOLBAS",
                "LOLBins",
                "LiteDuke",
                "Living off the Land",
                "MagicWeb",
                "Mimikatz",
                "MiniDionis",
                "MiniDuke",
                "NemesisGemina",
                "NetDuke",
                "OnionDuke",
                "POSHSPY",
                "PinchDuke",
                "PolyglotDuke",
                "PowerDuke",
                "QUIETEXIT",
                "ROOTSAW",
                "RegDuke",
                "Rubeus",
                "SNOWYAMBER",
                "SPICYBEAT",
                "SUNSHUTTLE",
                "SeaDaddy",
                "SeaDask",
                "SeaDesk",
                "SeaDuke",
                "Sharp-SMBExec",
                "SharpView",
                "Sibot",
                "Solorigate",
                "SoreFang",
                "TinyBaron",
                "WINELOADER",
                "WellMail",
                "WellMess",
                "cobeacon",
                "elf.wellmess",
                "reGeorg",
                "tDiscoverer"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1729821989,
    "ts_updated_at": 1743041795,
    "ts_creation_date": 1728490303,
    "ts_modification_date": 1728490303,
    "files": {
        "pdf": "https://archive.orkl.eu/c147de3d6da2aac981297370d926273da239bf9d.pdf",
        "text": "https://archive.orkl.eu/c147de3d6da2aac981297370d926273da239bf9d.txt",
        "img": "https://archive.orkl.eu/c147de3d6da2aac981297370d926273da239bf9d.jpg"
    }
}