{
    "id": "aa0e7642-33ea-42c4-9e90-aa52650ac233",
    "created_at": "2023-05-06T02:09:11.921205Z",
    "updated_at": "2025-03-27T02:17:02.106123Z",
    "deleted_at": null,
    "sha1_hash": "a60b4aea5be6b4f5d2b144247ea88c4efa8fbd85",
    "title": "2023-03-22 - The 5x5—Conflict in Ukraine’s information environment",
    "authors": "",
    "file_creation_date": "2023-05-05T02:04:16Z",
    "file_modification_date": "2023-05-05T02:04:16Z",
    "file_size": 598347,
    "plain_text": "# The 5×5—Conflict in Ukraine’s information environment\n\n**[atlanticcouncil.org/content-series/the-5x5/the-5x5-conflict-in-ukraines-information-environment/](https://www.atlanticcouncil.org/content-series/the-5x5/the-5x5-conflict-in-ukraines-information-environment/)**\n\nMarch 22, 2023\n\n[Conflict](https://www.atlanticcouncil.org/issue/conflict/) [Cybersecurity](https://www.atlanticcouncil.org/issue/cybersecurity/) [Defense Industry](https://www.atlanticcouncil.org/issue/defense-industry/) [Defense Technologies](https://www.atlanticcouncil.org/issue/defense-technologies/) [Disinformation](https://www.atlanticcouncil.org/issue/disinformation/) Europe &\nEurasia [Infrastructure Protection](https://www.atlanticcouncil.org/issue/infrastructure-protection/) [Intelligence](https://www.atlanticcouncil.org/issue/intelligence/) [Internet](https://www.atlanticcouncil.org/issue/internet/) [National Security](https://www.atlanticcouncil.org/issue/national-security/) [Russia](https://www.atlanticcouncil.org/region/russia/) Security &\nDefense [Technology & Innovation](https://www.atlanticcouncil.org/issue/technology-innovation/) [Ukraine](https://www.atlanticcouncil.org/region/ukraine/)\nBy [Simon Handler](https://www.atlanticcouncil.org/expert/simon-handler/)\n\n_This article is part of_ _[The 5×5, a monthly series by the Cyber Statecraft Initiative, in which](https://www.atlanticcouncil.org/csi5x5-series/?preview=true&_thumbnail_id=250438)_\n_five featured experts answer five questions on a common theme, trend, or current event in_\n_the world of cyber. Interested in the 5×5 and want to see a particular topic, event, or question_\n_[covered? Contact Simon Handler with the Cyber Statecraft Initiative at](https://www.atlanticcouncil.org/expert/simon-handler/)_ _[[email protected].](https://www.atlanticcouncil.org/cdn-cgi/l/email-protection#7c2f341d121810190e3c1d08101d1208151f1f1309121f151052130e1b)_\n[Just over one year ago, on February 24, 2022, Russia launched a full-scale invasion of](https://www.cnn.com/europe/live-news/ukraine-russia-news-02-23-22/h_82bf44af2f01ad57f81c0760c6cb697c)\nneighboring Ukraine. The ensuing conflict, Europe’s largest since World War II, has not only\nbesieged Ukraine physically, but also through the information environment. Through kinetic,\ncyber, and influence operations, Russia has placed Ukraine’s digital and physical information\ninfrastructure—including its cell towers, networks, data, and the ideas that traverse them—in\nits crosshairs as it seeks to cripple Ukraine’s defenses and bring its population under\nRussian control.\n\nGiven the privately owned underpinnings of the cyber and information domains by\ntechnology companies, a range of local and global companies have played a significant role\nin defending the information environment in Ukraine. From Ukrainian telecommunications\noperators to global cloud and satellite internet providers, the private sector has been woven\ninto Ukrainian defense and resilience. For example, Google’s Threat Analysis Group\n[reported having disrupted over 1,950 instances in 2022 of Russian information operations](https://blog.google/threat-analysis-group/fog-of-war-how-the-ukraine-conflict-transformed-the-cyber-threat-landscape/)\naimed at degrading support for Ukraine, undermining its government, and building support\nfor the war within Russia. The present conflict in Ukraine offers lessons for states as well as\nprivate companies on why public-private cooperation is essential to building resilience in this\nspace, and how these entities can work together more effectively.\n\nWe brought together a group of experts to provide insights on the war being waged through\nthe Ukrainian information environment and take away lessons for the United States and its\nallies for the future.\n\n**#1 How has conflict in the information environment associated with the war in Ukraine**\n**compared to your prior expectations?**\n\n\n-----\n\n**[Nika Aleksejeva, resident fellow, Baltics, Digital Forensic Research Lab (DFRLab), Atlantic](https://www.atlanticcouncil.org/expert/nika-aleksejeva/)**\n_Council:_\n\n“As the war in Ukraine started, everyone was expecting to see Russia conducting offensive\ninformation influence operations targeting Europe. Yes, we have identified and researched\nRussia’s coordinated information influence campaigns on Meta’s platforms and Telegram.\nThese campaigns targeted primarily European countries, and their execution was\nunprofessional, sloppy, and without much engagement on respective platforms.”\n\n**[Silas Cutler, senior director for cyber threat research, Institute for Security and Technology](https://securityandtechnology.org/team/core-team/silas-cutler/)**\n_(IST):_\n\n“A remarkable aspect of this conflict has been how Ukraine has maintained communication\nwith the rest of the world. In the days leading up to the conflict, there was a significant\nconcern that Russia would disrupt Ukraine’s ability to report on events as they unfolded.\nInstead of losing communication, Ukraine has thrived while continuously highlighting through\nsocial media its ingenuity within the conflict space. Both the mobilization of its technical\nworkforce through the volunteer IT_Army and its ability to leverage consumer technology,\nsuch as drones, have shown the incredible resilience and creativity of the Ukrainian people.”\n\n**[Roman Osadchuk, research associate, Eurasia, Digital Forensic Research Lab (DFRLab),](https://www.atlanticcouncil.org/expert/roman-osadchuk/)**\nAtlantic Council:\n\n“The information environment was chaotic and tense even before the invasion, as Russia\nwaged a hybrid war since at least the annexation of Crimea and war in Eastern Ukraine in\n2014. Therefore, the after-invasion dynamic did not bring significant surprises, but intensified\ntension and resistance from Ukrainian civil society and government toward Russia’s attempts\nto explain its unprovoked invasion and muddle the water around its war crimes. The only\n[things that exceeded expectations were the abuse of fact-checking toolbox WarOnFakes and](https://medium.com/dfrlab/how-russia-employs-fake-fact-checking-in-its-disinformation-arsenal-b1790d5f5442)\nthe intensified globalization of the Kremlin’s attempts to [tailor messages about the war to](https://www.atlanticcouncil.org/in-depth-research-reports/report/undermining-ukraine/)\ntheir favor globally.”\n\n**[Emma Schroeder, associate director, Cyber Statecraft Initiative, Digital Forensic Research](https://www.atlanticcouncil.org/expert/emma-schroeder/)**\n_Lab (DFRLab), Atlantic Council:_\n\n“The [information environment has been a central space and pathway throughout which this](https://www.atlanticcouncil.org/in-depth-research-reports/report/a-parallel-terrain-public-private-defense-of-the-ukrainian-information-environment/)\nwar is being fought. Russian forces are reaching through that space to attack and spread\nmisinformation, as well as attacking the physical infrastructure underpinning this\nenvironment. The behavior, while novel in its scale, is the continuation of Russian strategy in\nCrimea, and is very much living up to expectations set in that context. What has surpassed\nexpectations is the effectiveness of Ukrainian defenses, in coordination with allies and\nprivate sector partners. The degree to which the international community has sprung forward\nto provide aid and assistance is incredible, especially in the information environment where\nsuch global involvement can be so immediate and transformative.”\n\n\n-----\n\n**[Gavin Wilde, senior fellow, Technology and International Affairs Program, Carnegie](https://carnegieendowment.org/experts/2183)**\n_Endowment for International Peace:_\n\n“The volume and intensity of cyber and information operations has roughly been in line with\nmy prior expectations, though the degree of private and commercial activity was something\nthat I might not have predicted a year ago. From self-selecting out of the Russian market to\nswarming to defend Ukrainian networks and infrastructure, the outpouring of support from\nWestern technology and cybersecurity firms was not on my bingo card. Sustaining it and\nmodeling for similar crises are now key.”\n\n**#2 What risks do private companies assume in offering support or partnership to**\n**states engaged in active conflict?**\n\n**Aleksejeva: “Fewer and fewer businesses are betting on Russia’s successful economical**\nfuture. Additionally, supporting Russia in this conflict in any way is morally unacceptable for\nmost Western companies. Chinese and Iranian companies are different. As for Ukraine,\nsupporting it is morally encouraged, but is limited by many practicalities, such as supply\nchain disruptions amid Russia’s attacks.”\n\n**Cutler: “By providing support during conflict, companies risk becoming a target themselves.**\nTechnology companies such as Microsoft, SentinelOne, and Cloudflare, which have publicly\nreported their support for Ukraine, have been historically targeted by Russian cyber\noperations and are already familiar with the increased risk. Organizations with pre-conflict\ncommercial relationships may fall under new scrutiny by nationally-aligned hacktivist groups\nsuch as Killnet. This support for one side over the other—whether actual or perceived—may\nresult in additional risk.”\n\n**Osadchuk: “An important risk of continuing business as usual [in Russia] is that it may**\ndamage a company’s public image and test its declared values, since the continuation of\npaying taxes within the country-aggressor makes the private company a sponsor of these\nactions. Another risk for a private company is financial, since the companies that leave a\nparticular market are losing their profits, but this is incomparable to human suffering and\nlosses caused by the aggression. In the case of a Russian invasion, one of the ways to stop\nthe war is to cut funding for and, thus, undermine the Russian war machine and support\nUkraine.”\n\n**Schroeder: “Private companies have long provided goods and services to combatants**\n[outside of the information environment. The international legal framework restricting](https://www.refworld.org/docid/3ae6b36b4.html)\ncombatants to targeting ‘military objects’ provides normative protection, as objects are\ndefined as those ‘whose total or partial destruction, capture or neutralization, in the\ncircumstances ruling at the time, offers a definite military advantage’ in a manner proportional\nto the military gain foreseen by the operation. This definition, however, is still subject to the\nrealities of conflict, wherein combatants will make those decisions to their own best\n\n\n-----\n\nadvantage. In the information environment, this question becomes more complicated, as\ncyber products and services often do not fall neatly within standard categories and where\nprivate companies themselves own and operate the very infrastructure over and through\nwhich combatants engage. The United States and its allies, whether on a unilateral of\n[supranational basis, work to better define the boundaries of civilian ‘participation’ in war and](https://www.atlanticcouncil.org/in-depth-research-reports/report/a-parallel-terrain-public-private-defense-of-the-ukrainian-information-environment/#defineaid)\nconflict, as the very nature of the space means that their involvement will only increase.”\n\n**Wilde: “On one hand, it is important not to falsely mirror onto others the constraints of**\ninternational legal and normative frameworks around armed conflict to which responsible\nstates strive to adhere. Like Russia, some states show no scruples about violating these\nframeworks in letter or spirit, and seem unlikely to be inhibited by claims of neutrality from\ncompanies offering support to victimized states. That said, clarity about where goods and\nservices might be used for civilian versus military objectives is advisable to avoid the\nthresholds of ‘direct participation’ in war outlined in International Humanitarian Law.”\n\n**#3 What useful lessons should the United States and its allies take away from the**\n**successes and/or failures of cyber and information operations in Ukraine?**\n\n**Aleksejeva: “As for cyber operations, so far, we have not seen successful disruptions**\nachieved by Russia of Ukraine and its Western allies. Yes, we are seeing constant attacks,\nbut cyber defense is much more developed on both sides than before 2014. As for\ninformation operations, the United States and its allies should become less self-centered and\nhave a clear view of Russia’s influence activities in the so-called Global South where much of\nthe narratives are rooted in anti-Western sentiment.”\n\n**Cutler: “Prior to the start of the conflict, it was strongly believed that a cyber operation,**\nspecifically against energy and communication sectors, would act as a precursor to kinetic\naction. While a [WannaCry or](https://www.csoonline.com/article/3227906/wannacry-explained-a-perfect-ransomware-storm.html) [NotPetya-scale attack did not occur, the](https://www.wired.com/story/notpetya-cyberattack-ukraine-russia-code-crashed-the-world/) [AcidRain attack](https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/)\nagainst the Viasat satellite communication network and other attacks targeting Ukraine’s\nenergy sector highlight that cyber operations of varying effectiveness will play a role in the\nlead up to a military conflict.”\n\n**[Osadchuk: “First, cyber operations coordinate with other attack types, like kinetic operations](https://cip.gov.ua/en/news/kiberataki-artileriya-propaganda-zagalnii-oglyad-vimiriv-rosiiskoyi-agresiyi)**\non the ground, disinformation, and influence operations. Therefore, cyberattacks might be a\nprecursor of an upcoming missile strike, information operation, or any other action in the\nphysical and informational dimensions, so allies could use cyber to model and analyze multidomain operations. Finally, preparation for and resilience to information and cyber operations\nare vital in mitigating the consequences of such attacks; thus, updating defense doctrines\nand improving cyber infrastructure and social resilience are necessary.”\n\n**Schroeder: “Expectations for operations in this environment have exposed clear fractures in**\nthe ways that different communities define as success in a wartime operation. Specifically,\nthere is a tendency to equate success with direct or kinetic battlefield impact. One of the\nbiggest lessons that has been both a success and a failure throughout this war is the role\n\n\n-----\n\nthat this environment can play. Those at war, from ancient to modern times, have leveraged\nevery asset at their disposal and chosen the tool they see as the best fit for each challenge\nthat arises—cyber is no different. While there is ongoing debate surrounding this question, if\ncyber operations have not been effective on a battlefield, that does not mean that cyber is\nineffective, just that expectations were misplaced. Understanding the myriad roles that cyber\ncan and does play in defense, national security, and conflict is key to creating an effective\ncross-domain force.\n\n**Wilde: “Foremost is the need to check the assumption that these operations can have**\ndecisive utility, particularly in a kinetic wartime context. Moscow placed great faith in its ability\nto convert widespread digital and societal disruption into geopolitical advantage, only to find\nyears of effort backfiring catastrophically. In other contexts, better trained and resourced\nmilitaries might be able to blend cyber and information operations into combined arms\ncampaigns more effectively to achieve discrete objectives. However, it is worth reevaluating\nthe degree to which we assume offensive cyber and information operations can reliably be\ncounted on to play pivotal roles in hot war.”\n\n**More from the Cyber Statecraft Initiative:**\n\n**#4 How do comparisons to other domains of conflict help and/or hurt understanding**\n**of conflict in the information domain?**\n\n**Aleksejeva: “Unlike conventional warfare, information warfare uses information and**\npsychological operations during peace time as well. By masking behind sock puppet or\nanonymous social media accounts, information influence operations might be perceived as\nlegitimate internal issues that polarize society. A country might be unaware that it is under\nattack. At the same time, as the goal of conventional warfare is to break an adversary’s\ndefense line, information warfare fights societal resilience by breaking its unity. ‘Divide and\nrule’ is one of the basic information warfare strategies.”\n\n**Cutler: “When looking at the role of cyber in this conflict, I think it is critical to examine the**\nhistory of Hacktivist movements. This can be incredibly useful for understanding the\ninfluences and capabilities of groups like the IT_Army and Killnet.”\n\n**Osadchuk: “The information domain sometimes reflects the kinetic events on the ground, so**\ncomparing these two is helpful and could serve as a behavior predictor. For instance, when\nthe Armed Forces of Ukraine liberate new territories, they also expose war crimes, civilian\ncasualties, and damages inflicted by occupation forces. In reaction to these revelations, the\nKremlin propaganda machine usually launches multiple campaigns to distance themselves,\nblame the victim, or even denounce allegations as staged to muddy the waters for certain\nobservers.”\n\n\n-----\n\n**Schroeder:** It is often tricky to carry comparisons over different environments and context,\nbut the practice persists because, well, that is just what people do—look for patterns. The\nability to carry over patterns and lessons is essential, especially in new environments and\nwith the constant developments of new tools and technologies. Where these comparisons\ncause problems is when they are used not as a starting point, but as a predetermined\nanswer.”\n\n**Wilde: “It is problematic, in my view, to consider information a warfighting ‘domain,’**\nparticularly because its physical and metaphorical boundaries are endlessly vague and\nevolving—certainly relative to air, land, sea, and space. The complexities and contingencies\nin the information environment are infinitely more than those in the latter domains. However\ntalented we may be at collecting and analyzing millions of relevant datapoints with advanced\ntechnology, these capabilities may lend us a false sense of our ability to control or subvert\nthe information environment during wartime—from hearts and minds to bits and bytes.”\n\n**#5 What conditions might make the current conflict exceptional and not**\n**generalizable?**\n\n**Aleksejeva: “This war is neither ideological nor a war for territories and resources. Russia**\ndoes not have any ideology that backs up its invasion of Ukraine. It also has a hard time\nmaintaining control of its occupied territories. Instead, Russia has many disinformation-based\nnarratives or stories that justify the invasion to as many Russian citizens as possible\nincluding Kremlin officials. Narratives are general and diverse enough, so everyone can find\nan explanation of the current invasion—be it the alleged rebirth of Nazism in Ukraine, the\nfight against US hegemony, or the alleged historical right to bring Ukraine back to Russia’s\nsphere of influence. Though local, the war has global impact and makes countries around\nthe world pick sides. Online and social media platforms, machine translation tools, and big\ndata products provide a great opportunity to bombard any internet user in any part of the\nworld with pro-Russia massaging often tailored to echo historical, racial, and economic\nresentments especially rooted in colonial past.”\n\n**Cutler: “During the Gulf War, CNN and other cable news networks were able to provide live**\ncoverage of military action as it was unfolding. Now, real-time information from conflict areas\nis more broadly accessible. Telegram and social media have directly shaped the information\nand narratives from the conflict zone.”\n\n**Osadchuk: “The main difference is the enormous amount of war content, ranging from**\nprofessional pictures and amateur videos after missile strikes to drone footage of artillery\nsalvos and bodycam footage of fighting in the frontline trenches—all making this conflict the\nmost documented. Second, this war demonstrates the need for drones, satellite imagery, and\nopen-source intelligence for successful operations, which distances it from previous conflicts\nand wars. Finally, it is exceptional due to the participation of Ukrainian civil society in\n\n\n-----\n\ndeveloping applications, like the one alerting people about incoming shelling or helping find\nshelter; launching crowdfunding campaigns for vehicles, medical equipment, and even\n[satellite image services; and debunking Russian disinformation on social media.”](https://english.nv.ua/nation/people-s-satellite-already-proving-its-value-50309561.html)\n\n**[Schroeder: “One of the key lessons we can take from this war is the centrality of the global](https://www.atlanticcouncil.org/in-depth-research-reports/report/a-parallel-terrain-public-private-defense-of-the-ukrainian-information-environment/)**\nprivate sector to conflict in and through the information environment. From expedited\nconstruction of cloud infrastructure for the Ukrainian government to Ukrainian\ntelecommunications companies defending and restoring services along the front lines to\ndistributed satellite devices, providing flexible connectivity to civilians and soldiers alike,\nprivate companies have undoubtedly played an important role in shaping both the\ncapabilities of the Ukrainian state and the information battlespace itself. While we do not\n[entirely understand the incentives that drove these actions, an undeniable motivation that will](https://www.atlanticcouncil.org/in-depth-research-reports/report/a-parallel-terrain-public-private-defense-of-the-ukrainian-information-environment/#incentives)\nbe difficult to replicate in other contexts is the combination of Russian outright aggression\nand comparative economic weakness. Companies and their directors felt motivated to act\ndue to the first and, likely, free to act due to the second. Private sector centrality is unlikely to\ndiminish and, in future conflicts, it will be imperative for combatants to understand the\n[opportunities and dependencies that exist in this space within their own unique context.”](https://www.atlanticcouncil.org/in-depth-research-reports/report/a-parallel-terrain-public-private-defense-of-the-ukrainian-information-environment/#dependencies)\n\n**Wilde: “My sense is that post-war, transatlantic dynamics—from shared norms to politico-**\nmilitary ties—lent significant tailwinds to marshal resource and support to Ukraine (though\nnot as quickly or amply from some quarters as I had hoped). The shared memory of the fight\nfor self-determination in Central and Eastern Europe in the late 1980s to early 1990s still has\ndeep resonance among the publics and capitals of the West. These are unique dynamics,\nand the degree to which they could be replicated in other theaters of potential conflict is a\npretty open question.”\n\n**_Simon Handler is a fellow at the Atlantic Council’s Cyber Statecraft Initiative within the_**\n_Digital Forensic Research Lab (DFRLab). He is also the editor-in-chief of The 5×5, a series_\n_on trends and themes in cyber policy. Follow him on Twitter_ _[@SimonPHandler.](https://twitter.com/SimonPHandler)_\n\n\n-----\n\nThe Atlantic Council’s **[Cyber Statecraft Initiative, under the Digital Forensic Research Lab](https://www.atlanticcouncil.org/programs/scowcroft-center-for-strategy-and-security/cyber-statecraft-initiative/)**\n(DFRLab), works at the nexus of geopolitics and cybersecurity to craft strategies to help\nshape the conduct of statecraft and to better inform and secure users of technology.\n\n[learn more](https://www.atlanticcouncil.org/programs/scowcroft-center-for-strategy-and-security/cyber-statecraft-initiative/)\nRelated Experts: [Nika Aleksejeva,](https://www.atlanticcouncil.org/expert/nika-aleksejeva/) [Roman Osadchuk, and](https://www.atlanticcouncil.org/expert/roman-osadchuk/) [Emma Schroeder](https://www.atlanticcouncil.org/expert/emma-schroeder/)\n\nImage: Russian bombardment of telecommunications antennas in Kyiv.\nCredit: Ministry of\nInternal Affairs of Ukraine (licensed under the Creative Commons Attribution 4.0 International\nLicense)\n\nThis website or its third-party tools use cookies, which are necessary for its functioning and\nrequired to achieve the purposes illustrated in the cookie policy. You accept the use of\n[cookies as per our Cookie Policy and](https://www.atlanticcouncil.org/cookie-policy/) [Privacy Policy by closing or dismissing this notice, by](https://www.atlanticcouncil.org/privacy-policy/)\nscrolling this page, by clicking a link or button or by continuing to browse otherwise.Ok\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-03-22 - The 5x5—Conflict in Ukraine’s information environment.pdf"
    ],
    "report_names": [
        "2023-03-22 - The 5x5—Conflict in Ukraine’s information environment.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1683338951,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1683252256,
    "ts_modification_date": 1683252256,
    "files": {
        "pdf": "https://archive.orkl.eu/a60b4aea5be6b4f5d2b144247ea88c4efa8fbd85.pdf",
        "text": "https://archive.orkl.eu/a60b4aea5be6b4f5d2b144247ea88c4efa8fbd85.txt",
        "img": "https://archive.orkl.eu/a60b4aea5be6b4f5d2b144247ea88c4efa8fbd85.jpg"
    }
}