{
    "id": "aa258c0a-8e77-40e7-908b-75aafd8e74a0",
    "created_at": "2024-01-17T02:05:03.047179Z",
    "updated_at": "2025-03-27T02:06:09.510294Z",
    "deleted_at": null,
    "sha1_hash": "746840e505e79254363b985feb4398670af1a6dd",
    "title": "",
    "authors": "",
    "file_creation_date": "2024-01-16T04:16:31Z",
    "file_modification_date": "2024-01-16T04:16:31Z",
    "file_size": 3331293,
    "plain_text": "# New SugarGh0st RAT targets Uzbekistan government and South Korea\n\n**blog.talosintelligence.com/new-sugargh0st-rat**\n\nAshley Shen November 30, 2023\n\n[By Ashley Shen, Chetan Raghuprasad](https://blog.talosintelligence.com/author/ashley/)\n\nThursday, November 30, 2023 08:00\n\n[Threats SecureX RAT](https://blog.talosintelligence.com/category/threats/)\n\nCisco Talos recently discovered a malicious campaign that likely started as early\nas August 2023, delivering a new remote access trojan (RAT) we dubbed\n“SugarGh0st.”\nWe found evidence suggesting the threat actor is targeting the Uzbekistan Ministry\nof Foreign Affairs and users in South Korea.\nWe assess with high confidence that the SugarGh0st RAT is a new customized\nvariant of Gh0st RAT, an infamous trojan that’s been active for more than a\ndecade, with customized commands to facilitate the remote administration tasks as\ndirected by the C2 and modified communication protocol based on the similarity of\nthe command structure and the strings used in the code.\nWe observed two infection chains leveraging Windows Shortcut embedded with\nmalicious JavaScript to deliver the components to drop and launch the SugarGh0st\npayload.\n\n\n-----\n\nIn one infection chain, the actor leverages the DynamixWrapperX tool to enable\nWindows API function calls in malicious JavaScript for running the shellcode.\nTalos assesses with low confidence that a Chinese-speaking threat actor is\noperating this campaign based on the artifacts we found in the attack samples.\n\n## Suspected Chinese Actor targeting Uzbekistan and South Korea\n\nTalos discovered four samples deployed in this campaign that are likely targeting users\nin Uzbekistan and South Korea based on the language of the decoy documents, the lure\ncontent, and distribution indicators Talos found in the wild.\n\nOne of the samples is sent to users in the Ministry of Foreign Affairs of Uzbekistan. The\nsample is an archive embedded with a Windows ShortCut LNK file which, upon opening,\ndrops the decoy document “Investment project details.docx'' with Uzbek content about a\npresidential decree in Uzbekistan focused on enhancing state administration in technical\nregulation. The lure content of the decoy document was published in multiple Uzbekistan\nsources in 2021. The initial vector of the campaign is likely a phishing email with an\nattached malicious RAR archive file sent to an employee of the Ministry of Foreign\nAffairs.\n\nDecoy document in Uzbek language.\n\n\n-----\n\nBesides Uzbekistan, we also observed indications of targets in South Korea. We found\nthree other decoy documents written in Korean dropped by the malicious JavaScript file\nembedded in the Windows Shortcut, seemingly distributed in South Korea. The decoy\ndocument named “Account.pdf” was forged as a Microsoft account security notification\nfor confirming an account registration with a generated password. Another decoy named\n“MakerDAO MKR approaches highest since August.docx'' uses the copied content from\n코인데스크코리아 (CoinDesk Korea, a Korean news outlet that covers the blockchain).\nThe third decoy document, named “Equipment_Repair_Guide.docx,” has the lure\ninformation with instructions for computer maintenance in an organization. To reinforce\nour assessment of South Korean targets, we also observed C2 domain requests from\nIPs originating from South Korea.\n\nThe decoy documents found in the samples collected by Talos.\n\nDuring our analysis, we observed a couple of artifacts that suggested the actor might be\nChinese-speaking. Two of the decoy files we found have the “last modified by” names\nshown as “浅唱丶低吟” (Sing lightly, croon) and “琴玖辞” (seems to be the name of a\nChinese novel author), which are both Simplified Chinese.\n\nThe author and last editor’s information on decoy documents.\n\n\n-----\n\nBesides the decoy document metadata, the actor prefers using SugarGh0st, a Gh0st\nRAT variant. The Gh0st RAT malware is a mainstay in the Chinese threat actors’ arsenal\nand has been active since at least 2008. Chinese actors also have a history of targeting\nUzbekistan. The targeting of the Uzbekistan Ministry of Foreign Affairs also aligns with\nthe scope of Chinese intelligence activity abroad.\n\n## SugarGh0st is a new Gh0st RAT variant\n\nTalos discovered a RAT that we call SugarGh0st delivered as a payload in this\ncampaign. Talos assesses with high confidence that SugarGh0st is a customized variant\nof the Gh0st RAT. Gh0st RAT was developed by a Chinese group called 红狼小组\n(C.Rufus Security Team), and its source code was publicly released in 2008. The public\nrelease of the source code has made it easy for threat actors to get access to it and\ntailor it to fulfill their malicious intentions. There are several variants of Gh0st RAT in the\nthreat landscape, and it remains a preferred tool for many Chinese-speaking actors,\nallowing them to conduct surveillance and espionage attacks.\n\nCompared with the original Gh0st malware, SugarGh0st is equipped with some\ncustomized features in its reconnaissance capability in looking for specific Open\nDatabase Connectivity (ODBC) registry keys, loading library files with specific file\nextensions and function name, customized commands to facilitate the remote\nadministration tasks directed by the C2, and to evade earlier detections. The C2\ncommunication protocol is also modified. The first eight bytes of the network packet\nheader are reserved as magic bytes versus the first five in the earlier Gh0st RAT\nvariants. The remaining features, including taking full remote control of the infected\nmachine, providing real-time and offline keylogging, hooks to the webcam of an infected\nmachine, and downloading and running other arbitrary binaries on the infected host are\naligned with the features of earlier Gh0st RAT variants.\n\n## A multi-stage infection chain\n\nTalos discovered two different infection chains employed by the threat actor to target the\nvictims in this campaign. One of the infection chains decrypts and executes the\nSugarGh0st RAT payload, the customized variant of the Gh0st RAT. Another infection\nchain leverages the DynamicWrapperX loader to inject and run the shellcode that\ndecrypts and executes SugarGh0st.\n\n## Infection Chain No. 1\n\nThe first infection chain starts with a malicious RAR file containing a Windows Shortcut\nfile with a double extension. When a victim opens the shortcut file, it runs a command to\ndrop and execute an embedded JavaScript file. The JavaScript eventually drops a\ndecoy, an encrypted SugarGh0st payload, DLL loader and batch script. Then, the\n\n\n-----\n\nJavaScript executes the batch script to run the dropped DLL loader by sideloading it with\na copied rundll32. The DLL loader will decrypt the encrypted SugarGh0st payload in\nmemory and run it reflectively.\n\n### Shortcut file embedded with malicious JavaScript dropper\n\nThe Windows shortcut file discovered in this attack is embedded with JavaScript and\nhas command line arguments to drop and execute it. Upon the victim opening the LNK\nfile, the command line argument of the LNK file runs to locate and load the JavaScript\nwith the string start of “var onm=” which is the beginning of the JavaScript dropper and\ndrops the JavaScript into the %temp% location. After that, the dropped JavaScript is\nexecuted using the living-off-the-land binary (LoLBin) cscript.\n\n\n-----\n\nSample of malicious LNK file.\n\n### JavaScript dropper\n\nThe JavaScript dropper is a heavily obfuscated script embedded with base64 encoded\ndata of the other components of the attack. The JavaScript decodes and drops the\nembedded files into the %TEMP% folder, including a batch script, a customized DLL\nloader, an encrypted SugarGh0st payload, and a decoy document. It first opens the\ndecoy document to masquerade as legitimate action, then copies the legitimate rundll32\nexecutable from the “Windows\\SysWow64” folder into the %TEMP% folder. Finally, it\nexecutes the batch script loader from the %TEMP% location and runs the customized\nDLL loader. The JavaScript deleted itself from the file system afterward.\n\n\n-----\n\nThe JavaScript dropper.\n\n### Batch script loader\n\nThe batch script, in this instance, is named “ctfmon.bat” and has the commands to run\nthe dropped customized DLL loader. When executed, it sideloads the DLL loader with\nrundll32.exe and executes the function which is DllUnregisterServer, typically used by\nCOM (Component Object Model) DLLs.\n\nThe batch script loader.\n\n### DLL Loader decrypts and reflectively loads the SugarGh0st payload\n\nThe customized DLL loader named “MSADOCG.DLL” (name of the DLL associated with\nMicrosoft's ActiveX Data Objects (ADO) technology) is a 32-bit DLL written in C++ and\nimplemented as a COM object component. The loader includes packed code that is\n\n\n-----\n\nunpacked with custom unpacking code. When the DLL is run, it unpacks the code to\nread the dropped encrypted SugarGh0st payload file named “DPLAY.LIB '' from the\n%TEMP% location, decrypts it and runs it in the memory.\n\nStub code to unpack code.\n\nFunction to load the encrypted payload.\n\n## Infection chain No. 2\n\nSimilar to the first infection chain, this attack also starts with a RAR archive file\ncontaining a malicious Windows Shortcut file forged as the decoy document. The\nWindows shortcut file, by executing the embedded commands, drops the JavaScript\ndropper file into the %TEMP% location and executes it with cscript. The JavaScript in\nthis attack drops a decoy document, a legitimate DynamicWrapperX DLL, and the\nencrypted SugarGh0st. The JavaScript uses the legitimate DLL to enable running the\nembedded shellcode for running the SugarGh0st payload.\n\n\n-----\n\n### JavaScript leverages DynamicWrapperX to run shellcode that launches SugarGh0st\n\nThe JavaScript used in this infection chain is also heavily obfuscated and is embedded\nwith base64-encoded data of other components of the attack, including a shellcode.\nWhen the JavaScript is executed, it drops an encrypted SugarGh0st, a DLL called\n“libeay32.dll” and the decoy document. The JavaScript opens the decoy document and\ncopies Wscript.exe to the %TEMP% folder as dllhost.exe. It runs the dropped JavaScript\nagain using the dllhost.exe and creates a registry subkey called “CTFMON.exe” in the\nRun registry key to establish persistence.\n\n\nRegistry\nKey\n\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\n\nSubkey CTFMON.exe\n\nValue “cmd /c start C:\\Users\\user\\AppData\\Local\\Temp\\dllhost.exe\nC:\\Users\\user\\AppData\\Local\\Temp\\~204158968.js”\n\n[The file “libeay32.dll” is a tool called DynamicWrapperX (originally named](https://dynwrapx.script-coding.com/dwx/pages/dynwrapx.php?lang=en)\n“dynwrapx.dll”) developed by Yuri Popov. This tool is an ActiveX component that enables\nWindows API function calls in scripts (JScript, VBScript, etc.). The attacker can use this\nto run shellcode via the JavaScript dropper. But, they must first run regsvr.exe to install\nthe component.\n\nC:\\Windows\\system32\\regsvr32 /i /s\nC:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\libeay32.dll\n\nThe DynamicWrapperX DLL registers its member functions in the victim’s machine by\ncreating a registry subkey CLSID with the value “89565275-A714-4a43-912E978B935EDCCC” in Software\\Classes\\DynamicWrapperX registry key. The JavaScript\ncontaining the ActiveX components executes the embedded shellcode using the\nDynamixWrapperX DLL.\n\n\n-----\n\nThe shellcode has the API hashes and instructions to load and map to the functions\nnecessary for process injection from Kernel32.dll. It also loads two other DLLs,\nUser32.dll and shlwapi.dll. Then, it loads the encrypted SugarGh0st “libeay32.lib” from\nthe %TEMP% location, decrypts it, and reflectively loads it into the memory space\nallocated in the dllhost.exe process.\n\nShellcode that loads and decrypts the encrypted SugarGh0st.\n\n## Analysis of SugarGh0st \n\nThe SugarGh0st sample analyzed by Cisco Talos is a 32-bit dynamic link library in C++\ncompiled on Aug. 23, 2023. During its initial execution, SugarGh0st creates a mutex on\nthe victim’s machine using the hard-coded C2 domain as an infection marker and starts\nthe keylogging function. The keylogger module creates a folder “WinRAR'' in the location\n%Program Files% and writes the keylogger file “WinLog.txt.”\n\n\n-----\n\nThe Keylogging function of SugarGh0st.\n\nSugarGh0st uses “WSAStartup” functions, a hardcoded C2 domain and port to establish\nthe connection to the C2 server. Talos discovered two C2 domains, login[.]drive-googlecom[.]tk and account[.]drive-google-com[.]tk, used by the threat actor in this campaign.\n\n\n-----\n\nThe C2 communication function of SugarGh0st.\n\nAfter launching, SugarGh0st attempts to establish the connection to C2 every 10\nseconds. If successful, the first outgoing packet always consists of the same eight bytes\n“0x000011A40100” as a heartbeat. After the heartbeat is successfully sent, SugarGh0st\nsends the buffer data, which includes the following:\n\nComputer name\nOperating system version\nRoot and other drive information of victim machine\nRegistry key “HKEY_LOCAL_MACHINE\\Software\\ODBC\\H” if exist\nCampaign codes 1 (Month and Year) and code 2 (in our samples are “default”)\nWindows version number\nRoot drive’s volume serial number\n\nA sample packet that was sent by SugarGh0st to C2.\n\n\n-----\n\nSugarGh0st is a fully functional backdoor that can execute most remote control\nfunctionalities. It can launch the reverse shell and run the arbitrary commands sent from\nC2 as strings using the command shell.\n\nThe Reverse shell function.\n\nSugarGh0st can collect the victim’s machine hostname, filesystem, logical drive and\noperating system information. It can access the running process information of the\nvictim’s machine and control the environment by accessing the process information and\nterminating the process as directed by the C2 server.\n\nIt can also manage the machine’s service manager by accessing the configuration files\nof the running services and can start, terminate or delete the services.\n\n\n-----\n\nFunction to operate services.\n\nSugarGh0st can take screenshots of the victim machine’s current desktop and switch to\nmultiple windows. It can access the victim’s machine camera to capture the screen and\ncompress the captured data before sending it to the C2 server. SugarGh0st can perform\nvarious file operations, including searching, copying, moving and deleting the files on the\nvictim’s machine.\n\nIt also clears the machine’s Application, Security and System event logs to hide the\nmalicious operations logged to evade detection.\n\n\n-----\n\nFunction to clean event logs.\n\nSugarGh0st performs the remote control functionalities, including those discussed\nearlier, as directed by the C2 server with the four-byte hex commands and\naccompanying data.\n\n**Command** **Action**\n\n0x20000001 Adjust process privilege to “SeShutdownPrivilege” and force shut\ndown the host.\n\n0x20000002 Adjust process privilege to “SeShutdownPrivilege” and force reboot\nthe host.\n\n0x20000003 Adjust process privilege to “SeShutdownPrivilege” and force\nterminate the processes.\n\n0x20000004 Clear event log\n\n0x20000005 Create register key HKEY_LOCAL_MACHINE\\Software\\ODBC\\H\n\n0x20000011 Press a key in the default window\n\n0x20000012 Release a key in the default window\n\n\n-----\n\n0x20000013 Set mouse cursor position\n\n0x20000014 Click mouse left button\n\n0x20000015 Release mouse left button\n\n0x20000016 Double click the mouse left button\n\n0x20000017 Click mouse right button\n\n0x20000018 Release mouse right button\n\n0x20000019 Double click the mouse left button\n\n0x21000002 Get the logical drive information of the victim's machine.\n\n0x21000003 Search files on the victims machine filesystem\n\n0x21000004 Delete files on the victim's machine file system\n\n0x21000005 Moves files to the %TEMP% location\n\n0x21000006 Runs arbitrary shell commands\n\n0x21000007 Copies files on the victim machine\n\n0x21000008 Move files on the victim's machine\n\n0x21000009 Sends files to the C2 server\n\n0x2100000A Sends the data to the windows socket\n\n0x2100000B Receives files from the C2 server\n\n\n-----\n\n0x22000001 Sends the screenshot to the C2 server\n\n0x24000001 Read file %ProgramFiles%/WinRAR/~temp.dat (which is encoded\nwith XOR 0x62)\n\n0x24000002 Delete file %ProgramFiles%/WinRAR/~temp.dat\n\n0x23000000 Provides the reverse shell access to the C2 server\n\n0x25000000 Gets the process information and terminates the process\n\n0x25000001 Enumerate process information\n\n0x25000002 Terminate Process\n\n0x25000003 Access the victims machine service manager\n\n0x25000004 Access the configuration files of the running services\n\n0x25000005 Starting service\n\n0x25000006 Terminating and deleting the services.\n\n0x25000010 Performs the Windows operations\n\n0x25000011 Get window list\n\n0x25000012 Get message from Window\n\n0x28000000 Capture window and perform a series of Window operations based\non the command with SendMessage API.\n\n0x28000002 Find a . OLE file under “%PROGRAMFILES%\\\\Common\nFiles\\\\DESIGNER'' and launch\n\n\n-----\n\n## Coverage\n\n[Cisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/index.html)\n[execution of the malware detailed in this post. Try Secure Endpoint for free here.](https://www.cisco.com/c/en/us/products/security/amp-for-endpoints/free-trial.html?utm_medium=web-referral?utm_source=cisco&utm_campaign=amp-free-trial&utm_term=pgm-talos-trial&utm_content=amp-free-trial)\n\n[Cisco Secure Web Appliance web scanning prevents access to malicious websites and](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\ndetects malware used in these attacks.\n\n[Cisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by](https://www.cisco.com/c/en/us/products/security/email-security/index.html)\n[threat actors as part of their campaign. You can try Secure Email for free here.](https://www.cisco.com/c/en/us/products/security/cloud-mailbox-defense?utm_medium=web-referral&utm_source=cisco&utm_campaign=cmd-free-trial-request&utm_term=pgm-talos-trial)\n\n[Cisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW)](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\nappliances such as [Threat Defense Virtual,](https://www.cisco.com/c/en/us/products/collateral/security/firepower-ngfw-virtual/datasheet-c78-742858.html) [Adaptive Security Appliance and Meraki MX](https://www.cisco.com/c/en/us/products/security/adaptive-security-appliance-asa-software/index.html)\ncan detect malicious activity associated with this threat.\n\n[Cisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds](https://www.cisco.com/c/en/us/products/security/threat-grid/index.html)\nprotection into all Cisco Secure products.\n\n[Umbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to](https://umbrella.cisco.com/)\nmalicious domains, IPs, and URLs, whether users are on or off the corporate network.\n[Sign up for a free trial of Umbrella here.](https://signup.umbrella.com/?utm_medium=web-referral?utm_source=cisco&utm_campaign=umbrella-free-trial&utm_term=pgm-talos-trial&utm_content=automated-free-trial)\n\n[Cisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\npotentially dangerous sites and tests suspicious sites before users access them.\n\nAdditional protections with context to your specific environment and threat data are\n[available from the Firewall Management Center.](https://www.cisco.com/c/en/us/products/security/firepower-management-center/index.html)\n\n[Cisco Duo provides multi-factor authentication for users to ensure only those authorized](https://signup.duo.com/?utm_source=talos&utm_medium=referral&utm_campaign=duo-free-trial)\nare accessing your network.\n\nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading\n[the latest rule pack available for purchase on Snort.org. Snort SIDs for this threat is](https://www.snort.org/products)\n62647.\n\nClamAV detections available for this threat:\n\nWin.Trojan.SugarGh0stRAT-10014937-0\n\nWin.Tool.DynamicWrapperX-10014938-0\n\n\n-----\n\nTxt.Loader.SugarGh0st_Bat-10014939-0\n\nWin.Trojan.SugarGh0stRAT-10014940-0\n\nLnk.Dropper.SugarGh0stRAT-10014941-0\n\nJs.Trojan.SugarGh0stRAT-10014942-1\n\nWin.Loader.Ramnit-10014943-1\n\nWin.Backdoor.SugarGh0stRAT-10014944-0\n\n### Orbital Queries\n\n[Cisco Secure Endpoint users can use Orbital Advanced Search to run complex](https://orbital.amp.cisco.com/help/)\nOSqueries to see if their endpoints are infected with this specific threat. For specific\nOSqueries related to this threat, please follow the links:\n\n[SugarGh0st RAT file detected](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/sugargh0st_rat_file_path.yaml)\n[SugarGh0st RAT Registry key](https://github.com/Cisco-Talos/osquery_queries/blob/master/win_malware/sugargh0st_rat_registry_key.yaml)\n\n## Indicators of Compromise\n\n[Indicators of Compromise associated with this threat can be found here.](https://github.com/Cisco-Talos/IOCs/tree/main/2023/11/new-sugargh0st-rat.txt)\n\n[© 2024 Cisco Systems, Inc. and/or its affiliates. All rights reserved. View our Privacy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n[Policy](https://www.cisco.com/web/siteassets/legal/privacy_full.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2023/2023.11.30.New_SugarGh0st_RAT/New%20SugarGh0st%20RAT%20targets%20Uzbekistan%20government%20and%20South%20Korea.pdf"
    ],
    "report_names": [
        "New SugarGh0st RAT targets Uzbekistan government and South Korea"
    ],
    "threat_actors": [],
    "ts_created_at": 1705457103,
    "ts_updated_at": 1743041169,
    "ts_creation_date": 1705378591,
    "ts_modification_date": 1705378591,
    "files": {
        "pdf": "https://archive.orkl.eu/746840e505e79254363b985feb4398670af1a6dd.pdf",
        "text": "https://archive.orkl.eu/746840e505e79254363b985feb4398670af1a6dd.txt",
        "img": "https://archive.orkl.eu/746840e505e79254363b985feb4398670af1a6dd.jpg"
    }
}