{
    "id": "aa33faf8-6d9e-4d4e-a805-28be01aaf67c",
    "created_at": "2023-01-12T15:10:36.793346Z",
    "updated_at": "2025-03-27T02:16:53.004446Z",
    "deleted_at": null,
    "sha1_hash": "33fae8bfc6127d5d86e1390165261ce94a14dfd0",
    "title": "2020-11-16 - PoorWeb - Hitching a Ride on Hangul",
    "authors": "",
    "file_creation_date": "2022-05-28T19:32:43Z",
    "file_modification_date": "2022-05-28T19:32:43Z",
    "file_size": 5824107,
    "plain_text": "# PoorWeb - Hitching a Ride on Hangul\n\n**[blog.reversinglabs.com/blog/poorweb-exploiting-document-formats](https://blog.reversinglabs.com/blog/poorweb-exploiting-document-formats)**\n\n[Threat Research | November 16, 2020](https://blog.reversinglabs.com/blog/tag/threat-research)\n\n\n-----\n\nBlog Author\nRobert Simmons, Independent malware researcher and threat researcher at\n[ReversingLabs. Read More...](https://blog.reversinglabs.com/blog/author/robert-simmons)\n\n\n-----\n\nHangul Office is a popular office software suite in South Korea. 1 It shares the same\ncompound file format as older versions of Microsoft Office, but has unique features that are\nabused to form malicious documents. The landscape of this type of attack has been\nanalyzed closely in the VirusBulletin talk \"DOKKAEBI: Documents of Korean and Evil\nBinary\". 2 This type of malicious document is the first stage of an attack chain often leading\nto a PE executable trojan. Here we start with a set of three malicious Hangul Word Processor\n(HWP) documents targeting one victim organization, each with a slightly different set of\nstages, but ultimately leading to payloads in one malware family: PoorWeb. 3 Pivoting\noutwards from these three, a large number of related attacks is found. This amount of data\ncan be confusing especially when the attacks are so similar. However, looking at similarities\nand differences in malware behavior and code, delineations can be drawn between\ncampaigns. Armed with this knowledge, the PoorWeb payloads and the various stages that\ndeliver them are distinct from previous campaigns operated by the same adversary. Within\nthis campaign, the earliest sample 4 was first seen on March 19, 2019 and the most recent\nsample on September 16, 2020. 5\n\n## HWP Summary Information Stream\n\n\nHWP files use the Microsoft compound file format specification. This means they are made\nup of various streams. For the samples analyzed here, two types of streams are very\nimportant to analyze: \"HwpSummaryInformation\" and \"BinData\". The purpose of the former is\nto store metadata about the document and can include information about the title and author\nof the document. Starting with one HWP document, 6 Figure 1 shows the stream that\ncontains the string \"HighExpert\" as extracted by Cerbero Profiler.7\n\n\n-----\n\n**Figure 1: \"HighExpert\" String in HwpSummaryInfomation Stream**\n\nAccording to an ESTsecurity blog, this string appears in a variety of samples in a campaign\ndubbed \"Operation High Expert\".8 As shown below, this string appears in more than one\nlocation in a variety of samples related to this one.\n\n\nThe Hwp Summary Information (HSI) stream is derived from the specifications for the\nDocument Summary Information stream seen in other types of compound files. 9 Therefore,\nrather than writing YARA rules that detect text strings, one needs to use hexadecimal strings\nthat include the structure of the HSI property in addition to the string. The rule starts with the\ntext string \"HighExpert\" in wide ASCII:\n\nPrepended to these bytes are two components of the HSI property: 1F 00 00 00 and 0B 00\n00 00. The former signifies the start of the property record. The latter is the character length\nof the property data plus one trailing null byte terminator. In the example here, the string\n\"HighExpert\" has 10 characters and 0x0B is 11 in decimal. The resulting YARA rule is shown\nin Figure 2. The rule is provided at the end of the blog.\n\n\n-----\n\n**Figure 2: HighExpert HWP YARA Rule**\n\nUsing this rule, 11 other HWP files are identified. These files are shown in the Titanium\nPlatform in Figure 3. File hashes for these samples are provided at the end of the blog.\n\n**Figure 3: HighExpert HWP Samples**\n\nHowever, these are not a complete picture of all the malicious HWP files that are used to\ndeliver the same payload as the one we started with. To find more, a wider net must be cast.\nTo find those additional files, we start with all the HWP documents in the Titanium Platform\nfile lake that are detected as malicious and search among them for files with the same\nstructure as the ones we just identified. From the list of files above, there are two general\ntypes of file. The first type is similar to the sample we started with which has a malicious\nencapsulated PostScript BinData stream. The second type contains an embedded\ncompound file in a BinData stream that in turn contains the PE executable dropper.\n\n## PostScript Shellcode Loader\n\nThe first general type of malicious HWP document is one that contains an encapsulated\nPostScript BinData stream. The stream is zlib compressed, so the first step is to extract it.\nThis step is shown in Figure 4.\n\n\n-----\n\n**Figure 4: Extract Encapsulated PostScript Stream**\n\nInstructions for analysis of these types of HWP files can be found here10 and here .11 Once\nthe encapsulated PostScript (EPS) has been extracted, one can see that there is a large\nchunk of data encoded as hexadecimal ASCII as well as an XOR key. A truncated image of\nthis EPS is shown in Figure 5.\n\n\n**Figure 5: Encapsulated PostScript with XOR Encoded Data**\n\nNext, one needs to decode the XOR encoded data. This can be done using Ghostscript as\nshown in the blog above by replacing the \"exec\" instruction with a \"print\" instruction. The\nresulting output is a shellcode loader as can be seen in Figure 6 with calls to VirtualProtect\nand ExitProcess highlighted. This image is also truncated.\n\n\n-----\n\n**Figure 6: PostScript Shellcode Loader**\n\nAn alternative method for extracting the shellcode loader is to use CyberChef12 to convert\nthe data from hexadecimal representation and then apply the XOR key. This is shown in\nFigure 7.\n\n\n**Figure 7: CyberChef XOR Decoding**\n\n\n-----\n\nIn addition to this sample, the other two HWP files analyzed use variants of this same\nshellcode loader. The latter, in fact, contains the exact same loader and shellcode as the file\nanalyzed. This loader appears to be a template reused in other malicious HWP files that do\nnot deliver the same eventual PE payload as these three. Figure 8 shows the change in\nvariable names from one of these different samples to the variable names used in the\nsample analyzed above. The string \"label\" in one sample is \"Y\" in the other sample.\n\n**Figure 8: PostScript Shellcode Loader Template**\n\nAn ESTsecurity analysis of the sample15 with the string \"label\" can be read here.16 The other\nsample 17 that uses this same template also uses the same variable name \"Y\", but it does\nnot deliver the same payload as the samples analyzed here.\n\n\n## Shellcodes\n\nAcross these three samples, there are two different shellcodes loaded by the PostScript\nanalyzed above. One of the two shellcodes is very simple with the download URL visible18.\nThis shellcode is seen in the hex editor Hex Fiend19 in Figure 9. An analysis of this file can\nbe found on ESTsecurity's blog20.\n\n\n**Figure 9: Smaller Shellcode with Visible Download URL**\n\nThe other shellcode is much larger and more complex. It begins with a tiny decoder stub\nwhich decodes the rest of the shellcode in place. It additionally contains two URLs that\nappear to be download URLs, but are in fact decoys that dress the shellcode up to look like\nothers attributed to a different adversary. Details of this subterfuge found in a similar sample\ncan be read in another ESTsecurity blog here21. These decoy URLs can be seen in Figure\n10.\n\n\n-----\n\n**Figure 10: Decoy Download URLs**\n\nSo that this shellcode is easier to analyze, it needs to be converted to a full PE executable.\nOne method for making this conversion is detailed here22. The output of this conversion is\nseen in Figure 11.\n\n**Figure 11: Conversion of Shellcode to PE Executable**\n\nThe new executable's process of extracting the rest of the malicious code can best be seen\nin Figure 12.\n\n\n-----\n\n**Figure 12: Video of Stub Extracting Malicious Code**\n\nThe next stage is downloaded from a URL hosted on hpc[.]kau[.]ac[.]kr.23 This action is\nshown in Figure 13. The download is performed by URLDownloadToFileA24.\n\n\n**Figure 13: Download Next Stage**\n\nOnce the download is complete, the shellcode executes the file using the WinExec API. This\nis MITRE ATT&CK technique \"Native API\" (T1106)25. This API is executed via a jump rather\nthan a call instruction This can be seen in Figure 14\n\n\n-----\n\n**Figure 14: Execution via WinExec**\n\nIn a lab environment, this shellcode is observed executing the default binary downloaded\nfrom Inetsim26. This can be seen in Figure 15.\n\n**Figure 15: Shellcode Execution of Dummy Binary in Lab Environment**\n\n## Droppers\n\n\n-----\n\nReturning to the set of HighExpert HWP documents, there is a second pattern in addition to\nthe encapsulated PostScript stream with the shellcode loader seen above. This second\npattern is a pure dropper. The first stage PE executable is nested inside a second compound\nfile which is located in another BinData stream. Figure 16 shows this malicious stream with\nthe compound file magic number 0xD0CF11E0A1B11AE1 highlighted. The file shown here\nhas the same PE27 embedded as was downloaded from the URL28 shown above.\n\n**Figure 16: BinData Stream with Compound File**\n\nGoing one more layer deep, this compound file is not very complex, but it does contain a\npath that includes a user directory name in DOS short name format. The full directory name\nis almost certainly \"HighExpert\". These bytes are followed immediately by the malicious PE.\nBoth of these are highlighted in Figure 17. A full list of files from the large group of malicious\nHWP documents that match either of the two patterns of structure, shellcode/downloader\nand dropper, is provided at the end of the blog.\n\n**Figure 17: Path with Username and Embedded PE**\n\nAll of the droppers have a similar execution pattern. One example of this pattern from the\nembedded PE29 shown above can be seen in Figure 18.\n\n\n-----\n\n**Figure 18: Execution Graph**\n\n## Cast a Wide Net\n\nWith the malicious HWP files enumerated, the next step is to find more droppers,\ndownloaders, and payloads that are potentially related to the ones found during HWP\nanalysis. One avenue of inquiry is to find files that call out to the same infrastructure as the\nknown samples. Another is to look at files that share one or more AV detection names. The\nresults of one of these infrastructure searches in the Titanium Platform is shown in Figure 19\nand an example of the results from a search for threat name is shown in Figure 20.\n\n**Figure 19: Domain Search**\n\n\n-----\n\n**Figure 20: Threat Name Search**\n\n## Behavior\n\nOnce a wide enough net has been cast, the resulting file set must be whittled down to just\nthe files that have similar behavior or structure to the ones analyzed above. First step is to\nsend all the samples to a sandbox to observe the dynamic behavior. Fortunately, this can be\ndone automatically in the Titanium Platform in the Cuckoo Sandbox feature. Some of the files\nfrom this large set have a very similar behavior pattern. One example30 of this is shown in\nFigure 21. The main difference is the filename of the dropped file, sorvices.exe.\n\n**Figure 21: Behavioral Analyses**\n\n\n-----\n\n## Structure\n\nBehavioral analysis shows which samples are related, but may not be precisely the same\nmalware. Two variants or revisions of a particular malware may exhibit identical or similar\nbehavior patterns. To really create more accurate groupings, one examines the control flow\ngraphs of the PE executables. To make sure that apples are compared to apples and\noranges to oranges, all the control flow graphs are generated using radare2 and Cutter32.\nFocusing on the main function as detected by radare231 or the very first subroutine with\nadversary code, a set of thumbnail images were generated and the resulting graphs\nseparated into groups based on similar control flow. For the payload files as identified via\nautomated dynamic analysis, there emerge three basic patterns of control flow. These three\ngraphs are shown in Figure 22.\n\n\n**Figure 22: Control Flow Graph Comparison**\n\nUsing this same process on the droppers and downloaders, sets of similar control flow are\ngrouped together. A full list of hashes of these groups are provided at the end of the blog.\n\n\n-----\n\n## Programming Errors\n\nDuring dynamic analysis of the set of droppers, downloaders, and payloads, a specific,\nrepeated programming error is observed within one set of droppers that all share similar\ncontrol flow and execution graphs. The very first string that the malware decodes is treated\nlike a download URL and is used as a call parameter to the InternetOpenUrlA33 function.\nThis flaw is divided into two groups. In the first group, the string is a command line\ncommand. An example of this in one file34 is shown in Figure 23.\n\n\n**Figure 23: Not a URL**\n\nThe second pattern is a bit better effort, but is still not a complete URL. This other pattern\ncan be seen in Figure 24 in a different file35.\n\n**Figure 24: URL Fragment Not a URL**\n\nIn the Titanium Platform, these same failed API calls can be surfaced easily by navigating to\nthe Cuckoo Sandbox Behavioral Analysis, and then sorting the resulting table by status.\nFailed API calls will then be visible at the top of the table. The same two failed API calls\nshown above can be seen in Figures 25 and 26 in the Titanium Platform.\n\n\n-----\n\n**Figure 25: Failed API Call to InternetOpenUrlA**\n\n**Figure 26: Failed API Call to InternetOpenUrlA**\n\nThe file above which has a URL fragment rather than a full URL also is observed to drop a\npayload that is not in the group 1 according to control flow. This file is the odd one out and\nthe only dropper within its group of similar control flow that drops a payload with a different\ncontrol flow than the rest in the group. All groups and file hashes are provided at the end of\nthe blog.\n\n\n-----\n\n## Evolution of String Obfuscation\n\nExamining control flow is a decent method for differentiating among samples at a macro\nlevel, but one must also dig down to the code level to see what other similarities and\ndifferences can be found. As a rule of thumb, loops and code that obfuscates or decodes\nadversary strings are excellent locations to focus on. With this in mind, there are two basic\npatterns that can be seen in the groups of samples. Looking first at the group of samples that\ninclude the payloads from the HWP files analyzed above (control flow pattern 1), a two stage\ndecoding and deobfuscation process is observed. An example of this process being used to\ndecode a C2 hostname in one file from control flow group 1 is shown in Figure 27.  An\nexample of this process being used to decode a C2 hostname in one file36 from control flow\ngroup 3 is shown in Figure 27.\n\n\n-----\n\n**Figure 27: C2 Hostname Decoding Process**\n\nA very similar process is used in payloads from control flow group 2 and 3, but it is a single\nXOR step applied to chunks data rather than character by character as seen above.\nExamples of these are shown in Figures 28 and 29. These two examples are from control\nflow group 2 and 3 respectively. Both are slight modifications of a single theme.\n\n\n-----\n\n**Figure 28: String Decoding Process**\n\n**Figure 29: String Decoding Process**\n\nThe two-step XOR pattern appears in a few different variants among control flow group 3.\n\n## Conclusion\n\nAccording to the September 2020 Microsoft Digital Defense Report regarding nation state\nthreats, \"the most frequently targeted sector has been non-governmental organizations\n(NGOs), such as advocacy groups, human rights organizations, nonprofit organizations, and\nthink tanks focused on public policy, international affairs, or security.\"37 This may explain why\nmalware families such as the one analyzed above do not garner as much focus in the media\ntoday as do ransomware or attacks targeting critical infrastructure. However, these attacks\n\n\n-----\n\nare very important. Hopefully, the processes shown above can assist in enumerating and\ncategorizing samples from this type of attack with the goal of detecting and preventing future\nattacks.\n\n## Campaign Indicators38\n\n**HWP Documents (Droppers)**\n\n73069aa5890b22b79e03ef7bd86ce15e2a26270fc011f27ed3eb15b329bd9b97\n\n11c1d41668667220b50ec436f7325af1fffa43a40a1c3a227b69d6ffa98fa97d\n\n4b249546ff2cab9ea49a98a10b200f7ebef76a5de116cdf31af31a045e743bfa\n\n4c8be817d4de798bb541640894aa153dbf37bb03fd788d04e1461f184c631cf7\n\nf3e65b66e03fcd15e00e67a0f756ec9fdc95cfe111e7bc4ce6cc176525836e49\n\n252e9f7856f221338ade8756849871d009b53e7f624bbbac879b8346cd657b02\n656d0dc4e7d1da530397b7b140559ea404ba66f6d9694f72a553f0255f13fb0b\n\n99a6b3b15f0e805a5ae98048dea41d5ed9c94e2de1500d7d8250e4ce36deb8b1\n\n24983121690aaf2e648a9e19860e9e55f3105aa8f1b0549f2ab239b25c97022b\n\n65e821470779cd13297a6ecdfd6a263ee0bec5acf1b3a80d8f2f3946e7d33329\n\n80f566efbdceac356a09e3e97e128966e773db43b3a81c460ca35747445ef17b\n\nd2fe12893b35d775830aa0ef25a81748d6a669188709303aa404405c466f9fff\n\n7ac5311e3f81ea20951b19b9315e26923f2b340b67322e29f439f120898d4f16\n\n6f1881c6809982ce9de4dac20ce6cbcc9aa8841db6f81df37f815621c1970f85\n\n12c5f8c63803403859268f000135dbb9c2c104d480705819447464c5439f6efa\n\n2cc52400575174c0eb132e349c26a7ea0e5ec673fa504d12f9089a9039bbd703\n\n3c0024f6066376415acdb01d55e0b332ce462ef2ca065d5d3843686e5e140c71\n\n**HWP Documents (Downloaders)**\n\nea91f1e475ab4eb54971a0e7adbd61d690136abf1b2ab76b94a246515f65b9a3\n\n6f111be4a0cb4f033639f906f512b7feb1632630bec58285c9cd5969ae8a6ff3\n\naa461e70ab464a503d1e647e693df7ececfff86d497ee0c57c9448302878a05a\n\n\n942baec89b2474f41fa6c7b1bc085ac5c62c97fc1cadd56e4d3d6ff7b45e4368\n\n**Executables (Downloaders)**\n\n0a960dd9c015545c2fe4d4f39bae6f9e7af1afb1933900f105c5ae9ec51a446d\n\n**Executables (Droppers)**\n\n\n39\n\n\nec8cf2570f869c897ca9d898279d10b9c3b137eb4db6b7d68c7f524dc5332af9\n\n1958b75e2ef787fdb9938053f117da9ba9866509000af547e700dfb6a806d721\n\nd6a0444a111227650902c5b1229347824e0317b7842f085b826787d1e9ea5165\n\n836df87c3a87d8308075edb7aaec3ed13502ecefe0b7136791246295c459fa41\n\n87ebae83d90f49d5232266d5c27ac3be2fcf7e692332a235045cf8075c1b3b91\n\n\n-----\n\n9a316c168e3bc0f27a6884e44f5beff0587debcdcea5a662783a856d4a244437\n7510b511093b09fe2bb0e9f7b60b80a40fabde9a6914842e10cf702b51393298\nb5453db394ce8c22330fe620ab62a8a40ab491992e93d7f495d0370b93bf9688\n73d65cd0b513cadaaa76b559ada28996eb06b68954538fc628e03893f5ff85e8\n3c844c1d7060aa6d063f71081df5f49e3a205e398b7a719939b04f9e260200f1\nfa8f890514fe0ff1559d7ba760ebbbdb5de4658fae3e53a5704294a270f8926a\n7c46ed90abba6913b6770926d7562df1a926a91e55e36f20838df07c5eba621e\n59c70843d1791d40be632196851c355e7f14104bff24233b243f7cfed3f3f47341\n\n**Executables (Payloads)**\n\n\n40\n\n\n6882ba20ca9e7c34897123931488007741987eb805f40b13f23ed1a221d21c5e\n6a36a82767ba11ce6f313c0895da41d8dcf373b18b9efa0639e8fd76d639c987\nad3fada660f40b5d3ce2c6187dffc07507e7461a3d3ac249fbb6850e6028d517\n9e2d374bfc9e099d376f5255f194608dcedbba68ac16611ed3eb8fdc1e030586\n90f0582453f49d3b38da03b289d0ffcad4f691ab89f6acb922511e081d472667\nd074bbb7d821a58edfcf5fb20b6d632357779bd6554d9033b11859fc95262650\nfa7c09036e545cb4898df21e284d81aded9d1d86e85af899bfb14d16a19b625c\n\n## Outgroup Indicators\n\n**Executables (Droppers)**\n\n0455e0788715ba74503ce23784de9d9839ce80418ed8abac758f18983feeec8e\n\na1a4cc7ff9c58c07fb3cbd1799809ccd2ca46f961c6baf9eb5d2f847eb5dae3c\n\nf9f95afaecc0b3ee6cb0828f9fb9c8af0e025e06e66bc85fb1a34d1520306b33\n\nce5cbdc387a4b988b8ed3caacc4ac2414e80258d2ee9b7889d6064c4cb436a23\n\nf5e1ced1f2c52980ce54a50212b5bc89eaa5870078a5b12e1c738857052c8978\n\n**Executables (Payloads)**\n\na201ae69d8c84d1c95f87dced704a38ad4e131c7e36d60b88ff859ba3bf7aab1\n\ne452536f98446f54c6527106c7b123de12f010d3f1fcb25812f533d797253128\n\n142f8cd20af1065eed8685056977b16f3e3b3c6da877abdd244f1519cd4b3b32\n\nd057088d0de3d920ea0939217c756274018b6e89cbfc74f66f50a9d27a384b09\n\n**Executables (Payloads)**\n\n7a3ab8b865f9581806f259d8a165ad7517294e9d576792d293d2be6922548047\n\nf007369641e5eed5f575bfe57ebea68132a6963793a3fda520f31b4870b1cab6\n\nc9d1c5bab22f16cb06a9ca9209710c2f92a250903c2119750c220bfb8aaff348\n\n9fe2c4af5b7a80ae8d714908db4039cc3eafb4ca122e331a7b397aef41f6752f\n\n2fa25c729c8cf1a0e4b7ce71d1840837013682dc704c1ddccc385a3960868ac9\n\nc73ff2398ee0a564830508f1766cdbb2662037593db669d2fa1bc74af93525ed\n\n\n-----\n\n5d88596be0e998340e12c885645bbca7a57f0d80110a312b71bb6f2df443c7b0\n9f01dd87c28a9789a7730c6675995527cd5c2fdfd5b539d84b027e1107121a2c\n2c1d693401930b455759fe8ab580d3ca7c47c574a1c67cabdfbe91fd01377f13\n\n## YARA Rules\n\nrule HighExpert_HWP_HSIProp\n\n{\nmeta:\n\nauthor = \"Malware Utkonos\"\n\ndate = \"2020-08-24\"\n\ndescription = \"HWP summary information property entry in malicious Hangul Word Processor\ndocument: Operation High Expert.\"\n\nreference = \"https://blog.alyac.co.kr/2226\"\n\nstrings:\n\n$a = { 1F 00 00 00 0B 00 00 00 48 00 69 00 67 00 68 00 45 00 78 00 70 00 65 00 72 00 74\n00 }\n\ncondition:\n\nuint32(0) == 0xE011CFD0 and uint32(4) == 0xE11AB1A1 and $a\n\n}\n\nReferences:\n\n1 [https://en.wikipedia.org/wiki/Hangul_(word_processor)](https://en.wikipedia.org/wiki/Hangul_(word_processor))\n\n2 https://www.virusbulletin.com/conference/vb2018/abstracts/dokkaebi-documents-koreanand-evil-binary\n\n3 [https://malpedia.caad.fkie.fraunhofer.de/details/win.poorweb](https://malpedia.caad.fkie.fraunhofer.de/details/win.poorweb)\n\n4 fa7c09036e545cb4898df21e284d81aded9d1d86e85af899bfb14d16a19b625c\n\n5 ec8cf2570f869c897ca9d898279d10b9c3b137eb4db6b7d68c7f524dc5332af9\n\n6 ea91f1e475ab4eb54971a0e7adbd61d690136abf1b2ab76b94a246515f65b9a3\n\n7 [https://cerbero-blog.com/](https://cerbero-blog.com/)\n\n8 [https://blog.alyac.co.kr/2226](https://blog.alyac.co.kr/2226)\n\n9 https://docs.microsoft.com/en-us/openspecs/office_file_formats/ms-doc/7dc15eb9-c84d4eb5-844b-0e78e072214f\n\n10 https://norfolkinfosec.com/how-to-analyzing-a-malicious-hangul-word-processordocument-from-a-dprk-th\n\n[reat-actor-group/](https://norfolkinfosec.com/how-to-analyzing-a-malicious-hangul-word-processor-document-from-a-dprk-th%20reat-actor-group/)\n\n11 [https://www.fortinet.com/blog/threat-research/debugging-postscript-with-ghostscript](https://www.fortinet.com/blog/threat-research/debugging-postscript-with-ghostscript)\n\n12 [https://github.com/gchq/CyberChef](https://github.com/gchq/CyberChef)\n\n13 aa461e70ab464a503d1e647e693df7ececfff86d497ee0c57c9448302878a05a\n\n14 6f111be4a0cb4f033639f906f512b7feb1632630bec58285c9cd5969ae8a6ff3\n\n\n-----\n\n15 7c5db78537f3a28b9bcfe8f75e86c36038e5929d2206d59827fca4fb524d41c1\n16 [https://blog.alyac.co.kr/m/2336](https://blog.alyac.co.kr/m/2336)\n17 2196a88f27c3f813e5b359b9be31ed5122a678bcec447827a98e5f2078b2d666\n18 hxxp[://]ub-farm[.]com/admin/tmp/banner.gif\n19 [https://ridiculousfish.com/hexfiend/](https://ridiculousfish.com/hexfiend/)\n20 [https://blog.alyac.co.kr/2281](https://blog.alyac.co.kr/2281)\n21 [https://blog.alyac.co.kr/2453](https://blog.alyac.co.kr/2453)\n22 https://www.hexacorn.com/blog/2015/12/10/converting-shellcode-to-portable-executable32-and-64-bit/\n23 hxxp[://]hpc[.]kau[.]ac[.]kr/rolling_banner/tmp4c5ae3[.]p3a\n24 https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/iedeveloper/platform-apis/\n[ms775123(v=vs.85)](https://docs.microsoft.com/en-us/previous-versions/windows/internet-explorer/ie-developer/platform-apis/ms775123(v=vs.85))\n25 [https://attack.mitre.org/techniques/T1106/](https://attack.mitre.org/techniques/T1106/)\n26 [https://www.inetsim.org/](https://www.inetsim.org/)\n27 4b249546ff2cab9ea49a98a10b200f7ebef76a5de116cdf31af31a045e743bfa\n28 hxxp[://]hpc[.]kau[.]ac[.]kr/rolling_banner/tmp4c5ae3[.]p3a\n29 73d65cd0b513cadaaa76b559ada28996eb06b68954538fc628e03893f5ff85e8\n30 ce5cbdc387a4b988b8ed3caacc4ac2414e80258d2ee9b7889d6064c4cb436a23\n31 [https://github.com/radareorg/radare2](https://github.com/radareorg/radare2)\n32 [https://github.com/radareorg/cutter](https://github.com/radareorg/cutter)\n33 [https://docs.microsoft.com/en-us/windows/win32/api/wininet/nf-wininet-internetopenurla](https://docs.microsoft.com/en-us/windows/win32/api/wininet/nf-wininet-internetopenurla)\n34 7510b511093b09fe2bb0e9f7b60b80a40fabde9a6914842e10cf702b51393298\n35 dc69b98da87a7b6b683359082b63d1e945cbef17a32d432d11c5f488399460ab\n36 90f0582453f49d3b38da03b289d0ffcad4f691ab89f6acb922511e081d472667\n37 https://blogs.microsoft.com/on-the-issues/2020/09/29/microsoft-digital-defense-reportcyber-threats/\n38 This grouping of indicators is based on the payloads of type 1 and the stages that deliver\nthem.\n39 This file is only associated with the campaign through OSINT, not behavioral observation.\nThe two\n[sources of this association are https://otx.alienvault.com/pulse/5c99ee9aa9e60a68a9b55aec](https://otx.alienvault.com/pulse/5c99ee9aa9e60a68a9b55aec)\nand\n[https://otx.alienvault.com/pulse/5c914fcb2a0f7c3043d01d5e](https://otx.alienvault.com/pulse/5c914fcb2a0f7c3043d01d5e)\n40 This file is structurally different from the majority of the others in this grouping.\n41 Ibid.\n\nWatch our Webinar: **[Understanding attacks like Ryuk before it’s too late](https://register.reversinglabs.com/understanding-attacks-like-ryuk-before-its-too-late-thank-you)**\n\n### MORE BLOG ARTICLES\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-16 - PoorWeb - Hitching a Ride on Hangul.pdf"
    ],
    "report_names": [
        "2020-11-16 - PoorWeb - Hitching a Ride on Hangul.pdf"
    ],
    "threat_actors": [
        {
            "id": "5d2bd376-fcdc-4c6a-bc2c-17ebbb5b81a4",
            "created_at": "2022-10-25T16:07:23.667223Z",
            "updated_at": "2025-03-27T02:02:09.916086Z",
            "deleted_at": null,
            "main_name": "GCHQ",
            "aliases": [
                "Government Communications Headquarters",
                "Operation Socialist"
            ],
            "source_name": "ETDA:GCHQ",
            "tools": [
                "Prax",
                "Regin",
                "WarriorPride"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "cf7fc640-acfe-41c4-9f3d-5515d53a3ffb",
            "created_at": "2023-01-06T13:46:38.228042Z",
            "updated_at": "2025-03-27T02:00:02.775905Z",
            "deleted_at": null,
            "main_name": "APT1",
            "aliases": [
                "GIF89a",
                "G0006",
                "PLA Unit 61398",
                "Group 3",
                "TG-8223",
                "Comment Group",
                "ShadyRAT",
                "COMMENT PANDA",
                "Comment Crew",
                "Byzantine Candor",
                "Brown Fox"
            ],
            "source_name": "MISPGALAXY:APT1",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3aaf0755-5c9b-4612-9f0e-e266ef1bdb4b",
            "created_at": "2022-10-25T16:07:23.480196Z",
            "updated_at": "2025-03-27T02:02:09.826059Z",
            "deleted_at": null,
            "main_name": "Comment Crew",
            "aliases": [
                "APT 1",
                "BrownFox",
                "Byzantine Candor",
                "Byzantine Hades",
                "Comment Crew",
                "Comment Panda",
                "GIF89a",
                "Group 3",
                "Operation Oceansalt",
                "Operation Seasalt",
                "Operation Siesta",
                "Shanghai Group",
                "TG-8223"
            ],
            "source_name": "ETDA:Comment Crew",
            "tools": [
                "Auriga",
                "Cachedump",
                "Chymine",
                "CookieBag",
                "Darkmoon",
                "GDOCUPLOAD",
                "GLOOXMAIL",
                "GREENCAT",
                "Gen:Trojan.Heur.PT",
                "GetMail",
                "Hackfase",
                "Hacksfase",
                "Helauto",
                "Kurton",
                "LETSGO",
                "LIGHTBOLT",
                "LIGHTDART",
                "LOLBAS",
                "LOLBins",
                "LONGRUN",
                "Living off the Land",
                "Lslsass",
                "MAPIget",
                "ManItsMe",
                "Mimikatz",
                "MiniASP",
                "Oceansalt",
                "Pass-The-Hash Toolkit",
                "Poison Ivy",
                "ProcDump",
                "Riodrv",
                "SPIVY",
                "Seasalt",
                "ShadyRAT",
                "StarsyPound",
                "TROJAN.COOKIES",
                "TROJAN.FOXY",
                "TabMsgSQL",
                "Tarsip",
                "Trojan.GTALK",
                "WebC2",
                "WebC2-AdSpace",
                "WebC2-Ausov",
                "WebC2-Bolid",
                "WebC2-Cson",
                "WebC2-DIV",
                "WebC2-GreenCat",
                "WebC2-Head",
                "WebC2-Kt3",
                "WebC2-Qbp",
                "WebC2-Rave",
                "WebC2-Table",
                "WebC2-UGX",
                "WebC2-Yahoo",
                "Wordpress Bruteforcer",
                "bangat",
                "gsecdump",
                "pivy",
                "poisonivy",
                "pwdump",
                "zxdosml"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536236,
    "ts_updated_at": 1743041813,
    "ts_creation_date": 1653766363,
    "ts_modification_date": 1653766363,
    "files": {
        "pdf": "https://archive.orkl.eu/33fae8bfc6127d5d86e1390165261ce94a14dfd0.pdf",
        "text": "https://archive.orkl.eu/33fae8bfc6127d5d86e1390165261ce94a14dfd0.txt",
        "img": "https://archive.orkl.eu/33fae8bfc6127d5d86e1390165261ce94a14dfd0.jpg"
    }
}