{
    "id": "aa3b7e5f-871c-42f0-a917-20b005bbc36b",
    "created_at": "2023-01-12T14:59:57.267385Z",
    "updated_at": "2025-03-27T02:16:59.332999Z",
    "deleted_at": null,
    "sha1_hash": "f1e656266a92943252848e2e7dce387c53785045",
    "title": "2021-06-04 - The Sysrv-hello Cryptojacking Botnet- Here’s What’s New",
    "authors": "",
    "file_creation_date": "2022-05-28T18:23:21Z",
    "file_modification_date": "2022-05-28T18:23:21Z",
    "file_size": 426727,
    "plain_text": "# The Sysrv-hello Cryptojacking Botnet: Here’s What’s New\n\n**[riskiq.com/blog/external-threat-management/sysrv-hello-cryptojacking-botnet/](https://www.riskiq.com/blog/external-threat-management/sysrv-hello-cryptojacking-botnet/)**\n\nJune 4, 2021\n\nExternal Threat Management Labs\n\nJune 04, 2021\n\nBy Team RiskIQ\n\nCryptojacking botnets can earn their operators millions by discretely stealing CPUs on\ninfected machines to mine coins, especially with the sky-high value of today's\n[cryptocurrencies. Sysrv-hello, a cryptojacking botnet first identified by Alibaba Cloud Security](https://developer.aliyun.com/article/780758)\nin late December 2020, is another of these money-making malware variants.\n\nThe Sysrv-hello botnet is deployed on both Windows and Linux systems by exploiting\nmultiple vulnerabilities and deployed via shell scripts. Like many of the threat actor tools\nwe've covered, it continuously evolves to fit the needs of its operators and stay ahead of\nsecurity researchers and law enforcement.\n\nOver time, there have been several slight changes in the shell scripts that install the Sysrvhello implant on machines. There have also been incremental changes in how the\nexecutable gets deployed on host systems. In our latest threat intel analysis, RiskIQ\nresearchers have identified one of its latest developments, including the use of drive-by\ndownloads and two new Monero wallets.\n\n## Evolution of ldr.sh Shell Script\n\n\n-----\n\nThe latest iteration of Sysrv-hello is deployed via drive-by-downloads from an empty iframe\nthat points to an executable that will download to the host system when a user visits that web\npage. The iframe was set up via a Python script.\n\nMost observed versions of Sysrv-hello are deployed via shell script. On Linux systems, the\nhost is initially infected with the bash script before downloading the second stage ELF binary.\nYou can see the list of files as observed by RiskIQ, many not previously reported on in open\nsource, by visiting our complete analysis article in the Threat IntelligencePortal.\n\nThe first shell scripting file had more basic functionality than later observed files. Its functions\nincluded killing prior versions of Sysrv, killing other miners, and, after they reported on Sysrvhello in December 2020, removing Ali Baba (aka Aliyun) services. All of these samples\nspecified a specific crypto wallet, which you can explore in the complete analysis.\n\nRiskIQ also observed additional files about which we have less information than those\nmentioned above. However, from a shared IP address, MD5 hashes listed in the response\nbanners collected by RiskIQ systems were found in VirusTotal—three out of the five were\nflagged as Linux Coinminers.\n\nIn April 2021, RiskIQ identified two more files on known Sysrv-hello C2 servers with much\nmore extensive shell scripts than any previously observed. We are in the process of\nperforming more analysis on these scripts, but both used a wallet that had never been\nreported in opensource.\n\n[As observed within the RiskIQ OSINT tab of our Threat Intelligence Portal, Palo Alto reported](https://community.riskiq.com/search/py2web.store/osint)\nthat one of these C2s is associated with the \"WatchDog\" mining operation. No further\ninformation is known about any relationships between the \"WatchDog\" and the \"Sysrv-hello\"\nmining operations. Still, a function of one of the Sysrv-hello scripts mentioned above included\na function that killed processes called “watchdogs.\"\n\nThe scripting files obtained by RiskIQ include both a Sysrv IP reported on by Juniper\nNetworks, and a WatchDog domain reported on by Palo Alto. More research is needed to\ndetermine the relationship between these two IOCs and compare the shell scrip[t deployed\nby both mining operations.\n\n## Say Goodbye to Sysrv-hello\n\n[RiskIQ's Internet Intelligence Graph gives security teams a universal view of the internet,](https://www.riskiq.com/blog/external-threat-management/internet-intelligence-graph/)\nenabling our customers to detect many of the CVE's that Sysrv-hello exploited reported on\nby Juniper and Laceworks. With RiskIQ's Enterprise Digital Footprint, customers can identify\nassets that may be vulnerable to many of these exploits.\n\nVisit our Threat Intelligence Portal for our full technical analysis of Sysrv-hello and more\ninformation about its ties to other cryptojacking campaigns. To find out how RiskIQ can\n[defend your organization's digital attack surface, get started today.](https://www.riskiq.com/get-started/)\n\n\n-----\n\n## Subscribe to Our Newsletter\n\nSubscribe to the RiskIQ newsletter to stay up-to-date on our latest content, headlines,\nresearch, events, and more.\n\nBase Editor\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-04 - The Sysrv-hello Cryptojacking Botnet- Here’s What’s New.pdf"
    ],
    "report_names": [
        "2021-06-04 - The Sysrv-hello Cryptojacking Botnet- Here’s What’s New.pdf"
    ],
    "threat_actors": [
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "f9806b99-e392-46f1-9c13-885e376b239f",
            "created_at": "2023-01-06T13:46:39.431871Z",
            "updated_at": "2025-03-27T02:00:03.08926Z",
            "deleted_at": null,
            "main_name": "Watchdog",
            "aliases": [
                "Thief Libra"
            ],
            "source_name": "MISPGALAXY:Watchdog",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535597,
    "ts_updated_at": 1743041819,
    "ts_creation_date": 1653762201,
    "ts_modification_date": 1653762201,
    "files": {
        "pdf": "https://archive.orkl.eu/f1e656266a92943252848e2e7dce387c53785045.pdf",
        "text": "https://archive.orkl.eu/f1e656266a92943252848e2e7dce387c53785045.txt",
        "img": "https://archive.orkl.eu/f1e656266a92943252848e2e7dce387c53785045.jpg"
    }
}