{
    "id": "aa97a3f5-1d16-434f-9db6-b6400602a312",
    "created_at": "2023-01-12T15:04:47.094836Z",
    "updated_at": "2025-03-27T02:05:56.470713Z",
    "deleted_at": null,
    "sha1_hash": "c112ce8ae985cf44a4e4c25ba3be15bc0fd8229c",
    "title": "2020-11-18 - Android Mischief Dataset",
    "authors": "",
    "file_creation_date": "2022-05-28T04:58:52Z",
    "file_modification_date": "2022-05-28T04:58:52Z",
    "file_size": 80445,
    "plain_text": "# Android Mischief Dataset\n\n**[stratosphereips.org/blog/2020/11/10/android-mischief-rats-dataset](https://www.stratosphereips.org/blog/2020/11/10/android-mischief-rats-dataset)**\n\nKamila Babayeva November 18, 2020\n\n## Introduction\n\nA Remote Access Trojan (RAT) is a type of malware that allows the attacker (client) to gain\ncontrol of the target’s device (server) to remotely control it. RATs are one of the most\nimportant threats nowadays since they are used as part of most attacks, from APTs to\nRansomware. It is not an easy task to detect RATs in the network traffic, especially when it\ncomes to Android RATs in phones. Why? The main problem is that there are no easy ways\nto look at the network traffic on our mobile devices. Our phones are much harder to protect\nthan our computers. Even in cases where there are external network traffic analyzers, there\nare no good RAT detectors. To approach the problem of the lack of Android RATs detection\nin the network traffic, we want to help the community by creating the Android Mischief\n**Dataset, which contains network traffic from mobile phones infected with real and working**\nAndroid RATs.\n\n_The Android Mischief Dataset is part of the Civilsphere Project_\n_[(https://www.civilsphereproject.org/), which aims to protect the civil society at risk by](https://www.civilsphereproject.org/)_\n_understanding how the attacks work and how we can stop them. Check the webpage for_\n_more information._\n\n**Download the version 1 of the dataset from here:**\n[https://mcfp.felk.cvut.cz/publicDatasets/Android-Mischief-Dataset/ (short link](https://mcfp.felk.cvut.cz/publicDatasets/Android-Mischief-Dataset/)\n[https://bit.ly/AndroidMischief)](https://bit.ly/AndroidMischief)\n\n## The Android Mischief Dataset\n\nThe Android Mischief Dataset is a dataset of network traffic from mobile phones infected\nwith Android RATs. Its goal is to offer the community a dataset to learn and analyze the\nnetwork behaviour of RATs, in order to propose new detections to protect our devices. The\ncurrent version of the dataset includes 7 packet captures from 7 executed Android RATs.\nThe Android Mischief Dataset was done in the Stratosphere Laboratory, Czech Technical\nUniversity in Prague\n\n\n-----\n\n## Execution Methodology\n\nTo create this dataset, we followed a methodology for each of the RATs. The methodology\nconsists of the following 4 steps: (i) Installation, (ii) Execution, (iii) Traffic Capture, and (iv)\nDataset Logging\n\n1. Installation. This step consists of searching for the code of the RAT on the Internet,\n\ndownloading it, installing an appropriate virtual machine for execution of the RAT’s\ncontroller, including all the library requirements on the virtual machine (e.g .NET\nFramework, JRE), and finally preparing the physical phone or phone virtual emulator\nas a victim to infect.\n\n2. Execution. In this step we execute the downloaded RAT in these steps. First, use the\n\nBuilder app in the Windows VM to create and build a new APK file. Second, start the\nRAT Controller in the Windows VM so it is ready to receive victims. Third, send the\nAPK to the phone\n\n3. Traffic Capture. When performing actions in the controller and the server, we capture\n\nthe network traffic using our own VPN server, or in case of Android virtual emulator,\nwe can use the computer network interface.\n\n4. Dataset Logging. When performing actions in the client and the server, we also write\n\na log file of the performed actions and take screenshots for each action in the\nController and the phone. As a result, each RAT in the dataset includes an APK file, a\nlog file, screenshots files, a pcap file and a README.md.\n\n## Dataset files for each executed RAT\n\nEach RAT of the dataset contains the following files:\n\n1. README.md - This file is the generic description of the execution, containing the\n\nname of the executed RAT, details of the RAT execution environment, details of the\npcap (client’s IP and server’s IP, time of start of the infection).\n\n2. APK - The APK file generated by the RAT’s builder. Be aware that the APK was built\n\nfor our own servers, so it can not be used in a real attack.\n\n3. log - very detailed and specific time log of all the actions performed in the client and\n\nthe server during the experiment, e.g “2020-08-11 10:20:21 controller: execute\ncommand ‘Take Photo - Back Camera’”. The purpose of this log is to let the\nresearchers match the actions with the packets in the pcap.\n\n4. pcap - network traffic of the whole infection. Sometimes captured on the host\n\ncomputer running the controller VM, sometimes using the Emergency VPN software.\n\n\n-----\n\n5. screenshots - a folder with screenshots of the mobile device and controller while\n\nperforming the actions on the client and the server.\n\n## Executed RATs and Download\n\nThe first version of the Android Mischief Dataset, v1, includes the following 7 RATs: Android\nTester v6.4.6, DroidJack v4.4, HawkShaw, SpyMax v2.0, AndroRAT, Saefko Attack Systems\nv4.9 and AhMyth.\n\nThe Android Mischief Dataset can be downloaded in two ways, as one zip file containing all\nthe RATs together, or it can be downloaded each RAT individually.\n\n### Download the whole Android Mischief Dataset all together as one zip file from here: https://mcfp.felk.cvut.cz/publicDatasets/Android-Mischief- Dataset/\n\nTo download each RAT execution individually:, use these links\n\n### RAT01 - Android Tester v.6.4.6 [download here]\n\n RAT02 - DroidJack v4.4 [download here]\n\n RAT03 - HawkShaw [download here]\n\n RAT04 - SpyMAX v2.0 [download here]\n\n RAT05 - AndroRAT [download here]\n\n RAT06 - Saefko Attack Systems v4.9 [still not available]\n\n RAT07 - AhMyth [download here]\n\n## Citation\n\nIf you are using this dataset for your research, please reference it as “Stratosphere\nLaboratory. Android Mischief Dataset v1. November 18th. Kamila Babayeva.\nhttps://www.stratosphereips.org/android-mischief-dataset”\n\n\n-----\n\n## Contacts\n\nif you have any questions or you want the source code of RATs and their requirements, do\nnot hesitate to contact kamifai14@gmail.com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-18 - Android Mischief Dataset.pdf"
    ],
    "report_names": [
        "2020-11-18 - Android Mischief Dataset.pdf"
    ],
    "threat_actors": [
        {
            "id": "9041c438-4bc0-4863-b89c-a32bba33903c",
            "created_at": "2023-01-06T13:46:38.232751Z",
            "updated_at": "2025-03-27T02:00:02.778714Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove"
            ],
            "source_name": "MISPGALAXY:Nitro",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a2b44a04-a080-4465-973d-976ce53777de",
            "created_at": "2022-10-25T16:07:23.911791Z",
            "updated_at": "2025-03-27T02:02:10.025108Z",
            "deleted_at": null,
            "main_name": "Nitro",
            "aliases": [
                "Covert Grove",
                "Nitro"
            ],
            "source_name": "ETDA:Nitro",
            "tools": [
                "AngryRebel",
                "Backdoor.Apocalipto",
                "Chymine",
                "Darkmoon",
                "Farfli",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Moudour",
                "Mydoor",
                "PCClient",
                "PCRat",
                "Poison Ivy",
                "SPIVY",
                "Spindest",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535887,
    "ts_updated_at": 1743041156,
    "ts_creation_date": 1653713932,
    "ts_modification_date": 1653713932,
    "files": {
        "pdf": "https://archive.orkl.eu/c112ce8ae985cf44a4e4c25ba3be15bc0fd8229c.pdf",
        "text": "https://archive.orkl.eu/c112ce8ae985cf44a4e4c25ba3be15bc0fd8229c.txt",
        "img": "https://archive.orkl.eu/c112ce8ae985cf44a4e4c25ba3be15bc0fd8229c.jpg"
    }
}