{
    "id": "aaa058c3-9037-4fca-b844-8af8d96c44bd",
    "created_at": "2023-01-12T15:01:53.503881Z",
    "updated_at": "2025-03-27T02:05:55.075011Z",
    "deleted_at": null,
    "sha1_hash": "9d2c370ed0e6884dce4f2c114cca0853a4244dac",
    "title": "2021-01-25 - Fake Office 365 Used for Phishing Attacks on C-Suite Targets",
    "authors": "",
    "file_creation_date": "2022-05-27T21:11:06Z",
    "file_modification_date": "2022-05-27T21:11:06Z",
    "file_size": 6451940,
    "plain_text": "# Fake Office 365 Used for Phishing Attacks on C-Suite Targets\n\n**[trendmicro.com/en_us/research/21/a/fake-office-365-used-for-phishing-attacks-on-c-suite-targets.html](https://www.trendmicro.com/en_us/research/21/a/fake-office-365-used-for-phishing-attacks-on-c-suite-targets.html)**\n\nJanuary 25, 2021\n\nWe have been following an evolving phishing campaign that targets high-ranking company\nexecutives since 2019, reusing compromised credentials and URLs to target more.\n\nBy: Matsukawa Bakuei, Marshall Chen, Vladimir Kropotov, Loseway Lu, Fyodor Yarochkin\nJanuary 25, 2021 Read time: ( words)\n\nWe have been following an evolving phishing campaign that targets high-ranking company\nexecutives since May 2020. The attackers reuse compromised hosts for the phishing pages\ntargeting organizations in the manufacturing, real estate, finance, government, and\ntechnological industries in several countries such as Japan, the United States, UK, Canada,\nAustralia, and Europe. As of this writing, we found over 300 unique compromised URLs and\n70 email addresses from eight compromised sites, including 40 legitimate emails of company\nCEOs, directors, owners, and founders, among other enterprise employee targets. We are\nnow working with the respective authorities for further investigation.\n\nLuring victims with compromised infrastructure\n\nWe observed the attackers targeting potential victims with emails containing fake Office 365\npassword expiration reports as lures. They prompt the targets to click the embedded link in\n\n\n-----\n\nthe email if they want to continue using the same password; choosing the Keep Password\noption leads the user to the phishing page.\n\nFigure 1. An MS Office365 password reset email and link is used as the phishing campaign\nlure.\nThe attackers are reusing compromised infrastructure and victims’ account credentials to\n[host phishing pages and gain more victims, as briefly reported last year. The kit, which is](https://www.odi-x.com/exrobotos-old-phishing-kit-resurfaces-with-new-life/)\navailable for sale, can validate the credentials’ details and accuracy once the victim interacts\nwith the embedded link.\n\nRelated to this, during examination of underground activities we identified several\nadvertisements by cybercriminals selling account credentials of CEOs, chief financial officers\n(CFOs), and finance department members, among others. Those posts were seen in multiple\n\n\n-----\n\nEnglish- and Russian-speaking forums, including an underground forum that seemingly\nmatched with another user’s . Notably, all posts on the Russian-speaking forums were done\nin English and using recently registered accounts. We observed these users offering\ncompromised MS Office 365 account credentials and the employees’ respective company\npositions.\n\nFigure 2. Underground forum message offering compromised account credentials.\nPhishing kit\n\nThe campaign orchestrators used the same phishing kit during the campaigns. We observed\nthat some of the sites that hosted the phishing kit were not configured properly. This exposed\ncontent of the directory, allowing the download of the phishing kit and associated log files\nwithout authentication. This also allowed us to get additional insights on the campaign and\nfind evidence for potential attribution of the kits in their different deployment locations.\n\nThis discovery led us to believe that the kit developer’s previous projects served as precursor\nfeatures that contributed to the Office 365 phishing kit versions subsequently sold in the\nunderground. However, as we further examined the developer’s profile, we found odd\nbehaviors that may warrant further technical and legal investigation.\n\nFigure 3. Potential attribution found in log files.\n\n\n-----\n\nFigure 4. Improperly configured log files detailing the phishing sites to which the victims were\nredirected and their personally identifiable information (emails, passwords, city, and system\ninformation).\n**Emailing using third-party RDP**\n\nWe looked at the email headers of the lure email samples, examined the SMTP headers,\nand found an interesting detail: most of the phishing emails were sent using a virtual private\nserver (VPS) from FireVPS.\n\nfrom FireVPS-RDP (XX.X.XXX.XX) by\n\nfrom FireVPS-RDP (XXX.XXX.XX.XXX) by\n\nfrom FireVPS-RDP (XX.XXX.XXX.XX) by\nOL1P279CA0064.NORP279.PROD.OUTLOOK.COM (2603:10a6:e10:15::15) with\nMicrosoft SMTP\n\n[FireVPS is a virtual private server (VPS) offering a range of Windows remote desktop](https://firevps.net/)\nprotocol (RDP) plans for their respective customers. The emails sent to the victims are sent\nfrom the RDP service. We have alerted FireVPS of this and have yet to hear from them.\n\nWhile scanning other email samples for emails sent from a FireVPS-RDP machine, we found\nsimilar phishing email templates and the URL that was sent to a financial department\nmember also contained the recipient’s information and credentials. An online search\n\n\n-----\n\nrevealed that the recipient s profile and email address matched the accurate information\nlisted on his LinkedIn account.\n\n**Phishing kit blocklist**\n\nWe think the phishing kit developer spent considerable time compiling the blocklist included\nin the kit. It uses an extensive list of domain names and IP address ranges to ensure that\naccess is blocked when accessed by security companies or large cloud providers. We\nassume the intention is to evade detection by security vendors as the list includes a number\nof antivirus companies; Google, Microsoft, VirusTotal, and a long list of other cybersecurity\nand technology companies, as well as public blocklisting sites.\n\nFigure 5. The phishing kit developer made an effort to add specific IP addresses to a\nblocklist evade detection.\nKeeping this in mind, we find it ironic that the kit developer would take this much time to\ncreate a blocklist while actively marketing the kit on social network site(s).\n\n**Previous versions of the phishing kit**\n\nThe phishing kit we observed in this campaign is the fourth iteration of the toolkit. Previous\nversions were noticed and are known to the cybersecurity community, since it was widely\nadvertised in the underground and on social media.\n\nAccording to the malware developer’s “business” Facebook page, the first version of the\nphishing kit was released on July 4, 2019, shortly followed by the second version (V2) 15\ndays after. The third version (V3) was not officially announced on the Facebook page but\nwas observed to be in circulation and could be found through a simple online search.\n\n\n-----\n\nFigure 6. Malware developer advertising the second version of the fake Office365 phishing\nkit on his social media page.\n\n\n-----\n\nFigure 7. V2 and V3 of the phishing kit were reported in previous months and known among\ncybersecurity researchers.\nMost of the lure’s content theme focuses on prompting the victims to keep their current\npasswords. A look at the campaigns' pattern shows that the first layer of the phishing link\nincludes the recipient’s email domain in the compromised URLs' subdomain, followed by the\n\n\n-----\n\nBase64 encoded string of the recipient s email. (The email does not always have to be\nbase64 encoded, we also have seen landing pages with email being included in plaintext).\n\nAs the user chooses the link to keep their password, they are redirected to the phishing\npages. We noticed that the current version the compromised URLs’ landing pages started\nincluding the keyword “OfficeV4” in August.\n\nBy September, the victims’ domain names were still included, but the prefixes were changed\nfrom “sg” to “pl,” “00,” and/or “ag.” In another development in October, the victim’s names\nwere being included in the subdomain instead of the respective domain names.\n\nFigure 8. Tracking part of the campaigns’ domain developments\n\nFigure 9. A common theme for all the versions: Messages that prompt the victim to click on\nthe embedded link to keep their current password.\n**Notable features of the latest phishing kit**\n\n\n-----\n\nAside from the blocklist, V4 s other features supposedly make the detection of this kit harder.\nAmong them the capability to detect bot scanning or crawling attempts, and provide\nalternative content when bots are detected. Below are some of the features of V4 as listed by\nthe kit developer on his Facebook page.\n\nFigure 10. Features of the Office365 V4 phishing kit, as posted on social media.\nFurthermore, the phishing kit is sold with a license, and the obfuscated PHP script calls back\nto the developer’s system to verify the license’s validity. The phishing page calls back to the\nlicense server to check the license key's availability, and a URL/IP to access the license\nserver is seen in config.PHP. Interestingly, config.PHP file is readable on an actual phishing\nsite and contains the license key and the email address in it.\n\n\n-----\n\nFigure 11. Checking the license’s validity via PHP\n\nFigure 12. Config file readable on the phishing site\nWe continue to study the features of this phishing campaign to track the current and potential\ndevelopments this routine may further include, and to anticipate the changes in its evasion\ntechniques.\n\n## Tracking the kit developer\n\n\n-----\n\nThe alleged developer of Office365 announced the V4 phishing kit s availability on their\n“business” Facebook page in mid-2020.\n\nFigure\n\n13. The potential developer of the phishing kit announcing its availability on their business\nFacebook page.\n\n\n-----\n\nWe also observed logs of test traffic from the phishing kit one day before the announcement\nof V4, wherein almost all logs recorded were from different IP addresses from Morocco.\n\nFigure 14. Access logs allowed us to determine the IP addresses used the day before the\nannouncement. The top five IP addresses used were tracked to Morocco.\nSeveral days after the announcement of the V4’s availability, we found an email lure sample;\na look at the details of the header revealed that it matched the phishing samples we saw in\nNovember and December.\n\nSubject: ID:4563|| Request is under Process on Friday, July 17, 2020\n\nReceived: FireVPS-RDP (XX.X.XXX.XX) by VI1PR08CA0138.eurprd08.prod.outlook.com\n(2603:10a6:800:d5::16) with Microsoft SMTP Server (version=TLS1_2,\ncipher=TLS_ECDHE_RSA_WITH_AES_256_GCM_SHA384) id XX.XX.XXXX.XX via\nFrontend Transport; Fri, 17 Jul 2020 16:46:44 +0000……\n\nLooking further at the previous posts in the account also revealed announcements that\nclaimed the user responsible for the fake Office 365 versions as the developer of other\ncredential harvesting kits. While no longer available, the latter kit was capable of rapidly\nverifying the validity of email addresses; it could have been a predecessor project that\npotentially contributed to the features of the phishing kit versions sold. Based on other posts\non the actor’s social media page, this user also continues to sell harvested credentials aside\nfrom the phishing kit itself.\n\n\n-----\n\nFigure 15. The malware actor’s previous project with features that are similar to some of the\ncurrent phishing kit’s features\nWe were able to match the cybercriminal’s business Facebook page to personal pages while\nscanning for information online. We have informed the appropriate authorities of these\ndetails for this investigation.\n\n**Possible link to online sellers of C-level accounts**\n\n\n-----\n\nThere are numerous users in underground forums selling C-Level accounts. We identified\nthese user handles as sellers of some relevant C-level accounts across different forums,\npricing these credentials ranging from $250 to $500.\n\n\n-----\n\nFigure 16. Some sellers of company executives’ compromised credentials in underground\nforums\n\n\n-----\n\nWe found it interesting that the user mentioned the published article regarding selling C-level\ncredentials and requests to deal only with users or customers he had previous transactions\nwith. New customers are automatically prohibited from viewing the list of affected companies\nand credentials. The user also sells a phishing routine targeting servers and identifies its\nfeatures such as cookie capture and multi-factor authentication bypass. Interestingly, the\nsame handle sells both; the tool for credential harvesting and (two) collected accounts are\npriced approximately the same, similar to the alleged phishing kit developer’s offers on social\nmedia.\n\nFigure 17. Underground seller issuing a disclaimer on who he will transact with (above), and\nanother post selling a phishing malware (below).\n\n## Potential targets and victims’ data\n\n\n-----\n\nAnalysis of the data from the misconfigured sites collected log files revealed that the stolen\ncredentials came from eight compromised phishing sites hosting the malicious Office 365 V4\nkit as of this writing. We found each site to be possibly made by different phishers for\ndifferent phishing campaigns of varying scale and scope. One campaign targeted only\ncompany CEOs, presidents, and founders in the US, while another campaign targeted\ndirectors and managers from various countries such as the US, UK, Canada, Hungary, the\nNetherlands, and Israel. In addition, it appeared that the phishers mostly collected targeted\nemail addresses from LinkedIn.\n\nFigure 18. Victims’ company positions identified from LinkedIn\n\n\n-----\n\nFigure 19. Country distribution of victims\nBased on the data distribution, CEOs in the US are obviously the main targets of the threat\nactors that use the Office 365 V4 phishing kit. In the underground markets, CEO email\naddress lists are often sold and bought for the purpose of conducting additional phishing\nattacks, gaining access to sensitive information or conducting other social engineering\nattacks, such as business email compromise (BEC) and impersonation.\n\nA look at different underground forums and pages also revealed specific offers for\ncompromised credentials which are categorized according to year, industry, company\nposition, and social media platform credentials. In addition, the forum messages were written\nin English, even in non-English forums such as those catering to Russian-speaking users\nand groups. While not uncommon, the accounts were notably created to post those specific\nmessages selling the data and phishing kit to potential customers. This is emphasized in one\nforum where the actor bought an account for use in one of the forums just to sell data.\n\nTo start a target list, there are a number of platforms available that sell lists of CFO/CEO\nemails, Facebook profiles and more, categorized by region and country. The attackers could\nhave purchased target lists from one of these websites.\n\n\n-----\n\nFigure 20 A marketing website offering CEO/CFO email and Facebook page lists\n\n\n-----\n\nFigure 21. A marketing website offering lists for Japan sorted by year, company position, and\n\n\n-----\n\nsocial media platform\n\n## Conclusion\n\nPhishing attacks and attackers often target employees — usually the weakest link in an\norganization’s security chain. As seen in this particular campaign, the attackers target high\nprofile employees who may not be as technically or cybersecurity savvy, and may be more\nlikely to be deceived into clicking on malicious links. By selectively targeting C-level\nemployees, the attacker significantly increases the value of obtained credentials as they\ncould lead to further access to sensitive personal and organizational information, and used in\nother attacks.\n\nThe scale and accuracy of the emails and credentials show that the attacker possesses an\naccurate dataset of victims and potential targets. While the attacker could have simply\ncompiled the emails from the targeted organizations’ websites, they went a step further to\nvalidate these to make sure it complements data collected from the public domain.\n\nWhile organizations are aware and wary of the information they include in public-facing\nwebsites and platforms, their respective employees should be constantly reminded to be\nmindful of the details they disclose on personal pages. These can be easily used against\nthem for attacks using social engineering techniques. All employees, regardless of company\nrank, should exercise caution when reviewing and acting on email prompts for specific\nactions, especially from unknown sources.\n\nConsidering this, legitimate service providers and vendors will never ask individual\nconsumers and enterprise users for details such as account access credentials, and\nespecially not to retain dated passwords. These details are susceptible to abuse among\nunauthorized and malicious individuals and are left for customization by vendors to\nrespective security and IT teams following organizational policies.\n\n## Indicators of Compromise (IoCs)\n\n[Please click on the link to find our list of IoCs.](https://documents.trendmicro.com/assets/pdf/appendix_IoCs_fake-office365-used-for-phishing-attacks-on-csuite-targets.pdf)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-25 - Fake Office 365 Used for Phishing Attacks on C-Suite Targets.pdf"
    ],
    "report_names": [
        "2021-01-25 - Fake Office 365 Used for Phishing Attacks on C-Suite Targets.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535713,
    "ts_updated_at": 1743041155,
    "ts_creation_date": 1653685866,
    "ts_modification_date": 1653685866,
    "files": {
        "pdf": "https://archive.orkl.eu/9d2c370ed0e6884dce4f2c114cca0853a4244dac.pdf",
        "text": "https://archive.orkl.eu/9d2c370ed0e6884dce4f2c114cca0853a4244dac.txt",
        "img": "https://archive.orkl.eu/9d2c370ed0e6884dce4f2c114cca0853a4244dac.jpg"
    }
}