{
    "id": "aad11fcc-ce12-42e7-bb07-3d3baadf919a",
    "created_at": "2022-10-25T16:48:20.162298Z",
    "updated_at": "2025-03-27T02:12:07.605451Z",
    "deleted_at": null,
    "sha1_hash": "59e37b1b95367583cc5cc181fee309b96f786fd0",
    "title": "",
    "authors": "",
    "file_creation_date": "2020-01-21T03:27:51Z",
    "file_modification_date": "2020-01-21T03:27:51Z",
    "file_size": 2951598,
    "plain_text": "# JhoneRAT: Cloud based python RAT targeting Middle Eastern countries\n\n**blog.talosintelligence.com/2020/01/jhonerat.html**\n\n_[By Warren Mercer, Paul Rascagneres and Vitor Ventura with contributions from Eric Kuhla.](https://twitter.com/securitybeard?lang%3Den)_\n\n**_Updated January 17th: the documents do not exploit the CVE-2017-0199 vulnerability._**\n\n## Executive Summary\n\nToday, Cisco Talos is unveiling the details of a new RAT we have identified we're calling\n\"JhoneRAT.\" This new RAT is dropped to the victims via malicious Microsoft Office documents.\nThe dropper, along with the Python RAT, attempts to gather information on the victim's machine\nand then uses multiple cloud services: Google Drive, Twitter, ImgBB and Google Forms. The RAT\nattempts to download additional payloads and upload the information gathered during the\nreconnaissance phase. This particular RAT attempts to target a very specific set of Arabicspeaking countries. The filtering is performed by checking the keyboard layout of the infected\nsystems. Based on the analysed sample, JhoneRAT targets Saudi Arabia, Iraq, Egypt, Libya,\nAlgeria, Morocco, Tunisia, Oman, Yemen, Syria, UAE, Kuwait, Bahrain and Lebanon.\n\n**What's new? The campaign shows an actor that developed a homemade RAT that works in**\nmultiple layers hosted on cloud providers. JhoneRAT is developed in Python but not based on\npublic source code, as it is often the case for this type of malware. The attackers put great effort\nto carefully select the targets located in specific countries based on the victim's keyboard layout.\n\n**How did it work? Everything starts with a malicious document using a well-known vulnerability to**\ndownload a malicious document hosted on the internet. For this campaign, the attacker chose to\nuse a cloud provider (Google) with a good reputation to avoid URL blacklisting. The malware is\n\n\n-----\n\ndivided into a couple of layers — each layer downloads a new payload on a cloud provider to get\nthe final RAT developed in Python and that uses additional providers such as Twitter and ImgBB.\n\n**So what? This RAT is a good example of how a highly focused attack that tries to blend its**\nnetwork traffic into the crowd can be highly effective. In this campaign, focusing detection of the\nnetwork is not the best approach. Instead, the detection must be based on the behaviour on the\noperating system. Attackers can abuse well-known cloud providers and abuse their reputations in\norder to avoid detection.\n\n## Opsec and targeted countries\n\nThe fact that this attacker decided to leverage cloud services and four different services — and\nnot their own infrastructure — is smart from an opsec point of view. It is hard for the targets to\nidentify legitimate and malicious traffic to cloud provider infrastructure. Moreover, this kind of\ninfrastructure uses HTTPS and the flow is encrypted that makes man-in-the-middle interception\nmore complicated for the defender. It is not the first time an attacker used only cloud providers.\n\n_User-agent #1_\n\n_User-agent #2_\n\n_User-agent #3_\n\nEven while using these services, the authors of this JhoneRAT went further and used different\nuser-agent strings depending on the request, and even on the downloaders the authors used\n\n\n-----\n\nother user-agent strings.\n\n[We already published a couple of articles about ROKRAT (here, here, here and here) where](https://blog.talosintelligence.com/2017/04/introducing-rokrat.html)\nanother unrelated actor, Group123, made the same choice but with different providers.\n\nThe attacker implemented filtering based on the keyboard's layout.\n\n_Keyboard layout check_\n\nThe malware is executed only for the following layout, the country is based on the Microsoft\nwebsite:\n\n'0401' -> Saudi Arabia\n'0801' -> Iraq\n'0c01' -> Egypt\n'1001' -> Libya\n'1401' -> Algeria\n'1801' -> Morocco\n'1c01' -> Tunisia\n'2001' -> Oman\n'2401' -> Yemen\n'2801' -> Syria\n'3801' -> UAE\n'3401' -> Kuwait\n'3c01' -> Bahrain\n'3001' -> Lebanon\n\n\n-----\n\n## Malicious documents\n\n### Decoy document\n\nWe identified three malicious Microsoft Office documents that download and load an additional\nOffice document with a Macro. The oldest one from November 2019, named \"Urgent.docx,\" is\nshown below:\n\nInitial decoy document\n\n\n-----\n\nThe author of the document asks to enable editing in English and in Arabic.\n\nThe second document from the beginning of January is named \"fb.docx\" and contains usernames\nand passwords from an alleged \"Facebook\" leak:\n\nSecond decoy document\n\nThe more recent document is from mid-January and alleged to be from a United Arab Emirate\norganization. The author blurred the content and asks the user to enable editing to see the\ncontent:\n\nThird decoy document\n\n\n-----\n\n### Macro loading\n\nIn the three documents, an additional Office document containing a Macro is downloaded and\nexecuted. The documents are located on Google Drive.\n\nMalicious documents on Google Drive\n\n## Infection workflow\n\n### Stage No. 1: Malicious template on Google Drive\n\nThe template located on Google Drive contains a macro. The macro contains a virtual machine\ndetection technique based on the serial number of the disks available in the victim environment.\nIndeed, some VMs do not have serial numbers and the macro is executed only if a serial number\nexists. A WMIC command is executed to get this information on the targeted system.\n\nMacro WMI check\n\n\n-----\n\nIf a serial number exists, the rest of the code is executed. The purpose is to download an image\nfrom a new Google Drive link:\n\nImage download\n\nIt is interesting to note that the filename of the downloaded image is randomly generated based\non a dictionary: Array (\"cartoon,\" \"img,\" \"photo\"). The filename will be cartoon.jpg or img.jpg or\nphoto.jpg and the image usually depicts a cartoon.\n\n### Stage No. 2: Image file on Google Drive\n\nThe image file is a real image with a base64-encoded binary appended at the end.\n\n_Image No. 1_\n\nThe malware author has a curious sense of humor.\n\n\n-----\n\n_Image No. 2_\n\nThe base64 data and image are separated by the \"****\" string:\n\nImage and payload separation\n\nThe decoded binary filename is also randomly generated based on a dictionary: Array (\"proc\",\n\"chrome\", \"winrar\"). It can be proc.exe or chrome.exe or winrar.exe.\n\n### Stage No. 3: Autoit file\n\nThe decoded base64 data is an AutoIT binary. This binary downloads a new file on Google Drive.\n\n\n-----\n\nAutoIT downloader\n\nThe filename is also randomly generated based on a dictionary $ARRAY[5]=\n\n[\"prc\",\"winrar\",\"chrome\",\"sync\",\"COM surr\"].\n\n### Stage No. 4: Python RAT using cloud providers\n\nThe final payload is a remote access tool (RAT) written in Python. We named this RAT\n\"JhoneRAT.\" The Python code is wrapped into an executable using pyinstaller. It uses minimal\nobfuscation applied only on variables and function naming.\n\nRAT startup\n\nThe RAT starts by launching three threads. The first is responsible for checking if the system has\nthe targeted keyboard layout — this is exclusively in Arabic-speaking countries. The second will\ncreate the persistence and, finally, the last one to be started is the main cycle for the RAT. As we\nexplained before, the RAT targets specific countries by checking the keyboard's layout. In fact,\nthis is one of the first checks it performs when it is executed. The persistence is achieved by\nadding an entry with the name \"ChromeUpdater\" to the\n'Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run' .\n\n#### Command and control communications\n\n\n-----\n\nThis RAT uses three different cloud services to perform all its command and control (C2)\nactivities. It checks for new commands in the tweets from the handle @jhone87438316\n(suspended by Twitter) every 10 seconds using the BeautifulSoup HTML parser to identify new\ntweets. These commands can be issued to a specific victim based on the UID generated on each\ntarget (by using the disk serial and contextual information such as the hostname, the antivirus and\nthe OS) or to all of them:\n\nCommand fetching\n\nCommand parsing\n\nThe exfiltration, however, is done via other cloud providers. The screenshots are exfiltrated via\nthe ImgBB website:\n\n\n-----\n\nThe remaining commands send feedback by posting data into Google Forms:\n\nFinally, the RAT is able to download files encoded in base64 on Google Drive:\n\nFeature-wise, the RAT has three commands:\n\nTake a screenshot and upload it to ImgBB.\nDownload binary disguised has a picture from Google Drive and execute it.\nExecute a command and send the output to Google Forms.\n\n## Anti-VM, anti-decompiler and no header\n\nThe attacker put a couple of tricks in place to avoid execution on virtual machines (sandbox). The\nfirst trick is the check of the serial number of the disk. The actor used the same technique in the\nmacro and in the JhoneRAT. By default, most of the virtual machines do not have a serial number\non the disk.\n\n\n-----\n\nThe attacker used a second trick to avoid analysis of the Python code. The actor used the same\n[trick that FireEye in the Flare-On 6: Challenge 7: They removed the header of the Python](https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/FlareOn6_Challenge7_Solution_WOPR.pdf)\nbytecode. It can be perfectly executed without the header, but tools such as uncompyle6 need\nthis header:\n\n$ uncompyle6 final2\n\nImportError: Unknown magic number 227 in final2\n\nAdditionally, the generated code by uncompyle6 varies depending on the version and the impact\nis important.\n\nHere is a condition generated with uncompyle6 version 3.3.5:\n\nThe same code generated with uncompyle6 version 3.6.2:\n\nBased on our analysis and the behaviour of the executed malware, the correct interpretation is\nthe first one based on the oldest version of uncompyle6.\n\nFor this specific condition, it is important because it's filtering on the keyboard layout to identify\nthe targets.\n\n## Conclusion\n\n\n-----\n\nThis campaign shows a threat actor interested in specific Middle Eastern and Arabic-speaking\ncountries. It also shows us an actor that puts effort in opsec by only using cloud providers. The\nmalicious documents, the droppers and the RAT itself are developed around cloud providers.\nAdditionally the attackers implemented anti-VM (and sandbox) and anti-analysis tricks to hide the\nmalicious activities to the analyst. For example, the VM or the sandbox must have the keyboard\nlayout of the targeted countries and a disk serial number. This campaign started in November\n2019 and it is still ongoing. At this time, the API key is revoked and the Twitter account is\nsuspended. However, the attacker can easily create new accounts and update the malicious files\nin order to still work. This campaign shows us that network-based detection is important but must\nbe completed by system behaviour analysis.\n\n## IOCs\n\n### Docx:\n\n273aa20c4857d98cfa51ae52a1c21bf871c0f9cd0bf55d5e58caba5d1829846f\n29886dbbe81ead9e9999281e62ecf95d07acb24b9b0906b28beb65a84e894091\nd5f10a0b5c103100a3e74aa9014032c47aa8973b564b3ab03ae817744e74d079\n\n### Template:\n\n6cc0c11c754e1e82bca8572785c27a364a18b0822c07ad9aa2dc26b3817b8aa4\n\n### Image:\n\n7e1121fca3ac7c2a447b61cda997f3a8202a36bf9bb08cca3402df95debafa69\n\n### PE Autoit:\n\nb4a43b108989d1dde87e58f1fd6f81252ef6ae19d2a5e8cd76440135e0fd6366\n\n### PE Python:\n\n4228a5719a75be2d6658758fc063bd07c1774b44c10b00b958434421616f1548\n\n### URL:\n\nhxxps://drive[.]google[.]com/uc?\nexport=download&amp;id=1vED0wN0arm9yu7C7XrbCdspLjpoPKfrQ\n\nhxxps://drive[.]google[.]com/uc?\nexport=download&amp;id=1LVdv4bjcQegPdKrc5WLb4W7ad6Zt80zl\n\nhxxps://drive[.]google[.]com/uc?\nexport=download&amp;id=1OlQssMvjb7gI175qDx8SqTgRJIEp5Ypd\n\n\n-----\n\nhxxps://drive[.]google[.]com/uc?export=download&id=1d-toE89QnN5ZhuNZIc2iF4-cbKWtk0FD\n\nhxxps://drive[.]google[.]com/uc?export=download&id=1kbHVkvPIjX49qJ62TBz6drW2YPiiaX2a\n\nhxxps://twitter[.]com/jhone87438316\n\n### Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nideally suited to prevent the execution of the\nmalware used by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or Web](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html)\nSecurity Appliance (WSA) web scanning\nprevents access to malicious websites and\ndetects malware used in these attacks.\n\n[Email Security can block malicious emails](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\nsent by threat actors as part of their\ncampaign.\n\nNetwork Security appliances such as Next[Generation Firewall (NGFW), Next-](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Generation Intrusion Prevention System](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\n[(NGIPS), andMeraki MX can detect malicious](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nactivity associated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious domains,](https://umbrella.cisco.com/)\nIPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the latest\n[rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2020/2020.01.16.JhoneRAT/JhoneRAT_%20Cloud%20based%20python%20RAT%20targeting%20Middle%20Eastern%20countries.pdf"
    ],
    "report_names": [
        "JhoneRAT_ Cloud based python RAT targeting Middle Eastern countries"
    ],
    "threat_actors": [
        {
            "id": "bbe36874-34b7-4bfb-b38b-84a00b07042e",
            "created_at": "2022-10-25T15:50:23.375277Z",
            "updated_at": "2025-03-27T02:00:55.457787Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "APT37",
                "InkySquid",
                "ScarCruft",
                "Group123",
                "TEMP.Reaper",
                "Ricochet Chollima"
            ],
            "source_name": "MITRE:APT37",
            "tools": [
                "BLUELIGHT",
                "CORALDECK",
                "KARAE",
                "SLOWDRIFT",
                "ROKRAT",
                "SHUTTERSPEED",
                "POORAIM",
                "HAPPYWORK",
                "Final1stspy",
                "Cobalt Strike",
                "NavRAT",
                "DOGCALL",
                "WINERACK"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "552ff939-52c3-421b-b6c9-749cbc21a794",
            "created_at": "2023-01-06T13:46:38.742547Z",
            "updated_at": "2025-03-27T02:00:02.906537Z",
            "deleted_at": null,
            "main_name": "APT37",
            "aliases": [
                "ScarCruft",
                "Venus 121",
                "Moldy Pisces",
                "Group 123",
                "APT 37",
                "Group123",
                "Operation Daybreak",
                "Operation Erebus",
                "Red Eyes",
                "TA-RedAnt",
                "InkySquid",
                "Reaper Group",
                "Ricochet Chollima",
                "ATK4",
                "G0067"
            ],
            "source_name": "MISPGALAXY:APT37",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041527,
    "ts_creation_date": 1579577271,
    "ts_modification_date": 1579577271,
    "files": {
        "pdf": "https://archive.orkl.eu/59e37b1b95367583cc5cc181fee309b96f786fd0.pdf",
        "text": "https://archive.orkl.eu/59e37b1b95367583cc5cc181fee309b96f786fd0.txt",
        "img": "https://archive.orkl.eu/59e37b1b95367583cc5cc181fee309b96f786fd0.jpg"
    }
}