{
    "id": "aaddaee6-c6f0-4713-a7ff-551ffb4896a9",
    "created_at": "2023-01-12T15:10:51.530383Z",
    "updated_at": "2025-03-27T02:16:55.779318Z",
    "deleted_at": null,
    "sha1_hash": "baaa50a550f74db5437f8734a2a07f9e3ea7a6f1",
    "title": "2021-05-12 - Anatomy of a $2 Million Darkside Ransomware Breach",
    "authors": "",
    "file_creation_date": "2022-05-29T10:40:11Z",
    "file_modification_date": "2022-05-29T10:40:11Z",
    "file_size": 1320812,
    "plain_text": "# Anatomy of a $2 Million Darkside Ransomware Breach\n\n**[zetter.substack.com/p/anatomy-of-one-of-the-first-darkside](https://zetter.substack.com/p/anatomy-of-one-of-the-first-darkside)**\n\nKim Zetter\n\n## Days before the Darkside ransomware creators formally launched their business with a press release last August, a U.S. victim was already preparing to pay them a $2 million ransom.\n\n[Kim Zetter](https://substack.com/profile/9134384-kim-zetter)\nMay 12, 2021\n\nPress release the Darkside developers published last year announcing the debut of their new\n[ransomware tool. (Screenshot via Bleeping Computer)](https://www.bleepingcomputer.com/news/security/darkside-new-targeted-ransomware-demands-million-dollar-ransoms/)\nOne of the first known cases involving Darkside ransomware occurred in late August 2020.\n\n\n-----\n\nThe victim, reportedly [Brookfield Residential Properties, a Calgary-based home builder and](https://www.itworldcanada.com/article/brookfield-admits-residential-unit-suffered-a-data-security-incident/434947)\nland developer for residences in Canada and the U.S., evidently refused to pay the ransom\nand instead restored their data and systems from backups. For this brazen act, the hackers\n[victim-shamed Brookfield on their Darkside blog on August 21, 2020.](https://www.itworldcanada.com/article/new-ransomware-group-claims-to-have-hit-canadian-corporate-giant/434880)\n\nAnother company, hit with the Darkside ransomware around the same time as Brookfield, did\npay the ransom — $2 million, according to Stephen Boyce, an incident responder who led\nthe team that investigated the infection. For this reason the public has never learned of the\nbreach.\n\n“Our victim paid, so they were not publicly named and/or shamed,” says Boyce.\n\nBoyce is a former FBI investigator in the bureau’s digital media exploitation unit who was\nworking at the time for a Virginia-based security company called Crypsis. He says the victim\nwas a privately held U.S.-based holding company, which he declined to name. The firm — an\ninternational conglomerate — may have been one of Darkside’s early beta victims, used to\ntest the gang’s methods as well as the efficacy of their ransomware and decryption tools (the\ntool given to victims to unlock their computers and data after they pay a ransom).\n\nThe Darkside ransomware locked about 5,000 of the company’s computers and servers —\nincluding data backups that they’d kept online — and also spread to five of the holding\ncompany’s subsidiaries.\n\nWhat happened next provides a stark illustration of the calculations companies make when\ndeciding to pay a ransom.\n\nIn both cases Brookfield and the holding company didn’t just lose access to data, they also\nlost control of it. With Brookfield, the hackers claimed they swiped 200 gigabytes of data\nbefore locking the company’s systems with the Darkside ransomware — this included\nfinance and payroll records, business plans and employee files. They threatened to publish\n[the data if the company didn't pay the ransom. But Brookfield downplayed the incident, telling](https://www.thestar.com/business/2020/08/25/canadian-real-estate-company-brookfield-residential-suffers-data-breach-by-new-ransomware-group-darkside.html)\nreporters the hackers only got a “limited subset of files” related to employees, and declined\nto confirm the incident involved ransomware.\n\nIn the case of the U.S. holding company, the hackers stole 100 gigabytes of data —\n“indiscriminate grabbing,” as Boyce called it — and made the same threats. Despite the fact\nthat the company had a second, offline backup of its data that wasn’t affected by the\nransomware — and therefore they didn’t need to pay the hackers — the holding company\nforked over the $2 million.\n\n“From a business-continuity perspective,” and calculations about the maximum amount of\ntime the business could afford to be down — restoring backed-up data can take weeks for a\nlarge firm and months for a company to return to normal — the holding company decided it\n\n\n-----\n\nwould be more expedient to just pay the ransom, Boyce says, and get quick access to the\nfiles they needed. They paid it the way many victims do — through their ransomware\ninsurance.\n\nAccording to a chart published last year by Coveware, a company that negotiates ransoms\non behalf of victims, the holding company paid well above the average rate for ransomware\nextortion, which last year was about $234,000.\n\n## Dark Beginnings\n\nThe developers behind Darkside first went public with their new ransomware tool on August\n[10, 2020, when they announced it with a press release. This was three days after the](https://www.bleepingcomputer.com/news/security/darkside-new-targeted-ransomware-demands-million-dollar-ransoms/)\nDarkside ransomware struck the U.S. holding company’s systems.\n\n“We are a new product on the market, but that does not mean that we have no experience\nand we came from nowhere,” the person or group behind the ransomware code wrote in their\nrelease. “We created Darkside because we didn’t find the perfect product for us. Now we\nhave it.”\n\nThe group is believed to have prior experience with other ransomware groups and is also\nbelieved to be Russian or East European since they advertise on Russian-speaking forums,\nand their code looks at the language configuration of a system and won’t deploy if the\n\n\n-----\n\nsystem appears to belong to someone from Russia, Ukraine, Belarus or other former Sovietbloc nations.\n\nDarkside began as just a ransomware tool, but over time it morphed into ransomware-as-aservice (RaaS), meaning the developers behind the code don’t necessarily conduct the\nintrusions that use the tool. Instead they provide their malicious tools and services to other\ncriminal affiliates or partners, who then use them to infect and extort victims, giving a\npercentage of the paid ransoms to the Darkside developers. According to Mandiant, the\ndevelopers take a 25 percent cut for ransoms less than $500,000 and a 10 percent cut for\nones exceeding $5 million.\n\nThe services provided in exchange for this fee include infrastructure for communicating with\ninfected systems and storing data stolen from victims, as well as a “customer help center”\nwith online chat and a phone line for desperate victims needing to communicate with their\nattackers.\n\nMore recently they have added new extortion features for their criminal affiliates to increase\nthe pressure on victims: a call service that will phone victims and pressure them into paying\nthe ransom and a DDoS feature for attacking the web sites of victims not inclined to pay,\n[according to journalist Brian Krebs. And last month, in an announcement about hacking](https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/)\npublicly traded companies listed on stock exchanges, the ransomware hackers indicated\nthey’d be willing to sell advance information about victims to investors who want to short a\ncompany's stock before the hackers publicly announce the company has been breached and\npublish their stolen data online.\n\nThe group began advertising their ransomware-as-a service business three months after the\n[holding company was compromised, according to the security firms Intel 471 and](https://www.intel471.com/blog/darkside-ransomware-colonial-pipeline-attack) [Mandiant](https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html)\nwhen a Russian-speaking actor using the name \"darksupp\" advertised on two Russianlanguage criminal forums that he was “looking for partners” to launch an affiliate model for\nhis business. Soon after, the Darkside ransomware started showing up in infections targeting\nmanufacturers and law firms in Europe and the U.S.\n\n\n-----\n\nChart from\n\n[Mandiant report on Darkside](https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html)\nIt’s not known how many victims have paid ransoms or how much the Darkside developers\nand their affiliates have earned from their criminal enterprise, but by any measure they’ve\n[been very successful. Intel 471 reports that one victim hit in January 2021 was ordered to](https://www.intel471.com/)\npay a $30 million ransom. Although they managed to negotiate it down to about a third of\nthis, the payment would have made the recipients very rich. They’ve achieved such stellar\nsuccess in part by being picky about their victims. Darkside’s administrators say that, out of\nprinciple, they won’t let their affiliates infect hospitals, schools and universities, non-profit\norganizations or government entities. But these restrictions have probably less to do with\nethical considerations than monetary; these aren’t the kind of victims who can pay big\nransoms.\n\n“Before we attack we carefully analyze your accountancy and determine how much you can\npay based on your net income,” the Darkside team notes in one of their posts.\n\nMark Arena, CEO of Intel 471 says the group is also picky about who can purchase its\nservices, which means they have more control over how it’s used. The developers advertise\nonly on Russian-language cybercriminal forums and \"specifically say they don't want to work\nwith English speakers,” Arena says. This means that most or all of the criminals purchasing\nDarkside’s services to extort victims are Russian-speaking. Arena provided the text from one\nDarkside advertisement, which was written in Russian:\n\n**Who are we NOT looking for**\n\nEnglish-speaking individuals.\n\n\n-----\n\nDodgy individuals, employees of intelligence agencies, and analysts of information\nsecurity companies.\n\nThose who set up RDP hosts and do things other than supplying networks.\n\nAny projects or offers that are not related to this post.\n\nThose who want to learn pentesting and earn millions.\n\nThose who demand a 100-M ransom for 3.5 servers.\n\nIt’s not clear how many victims the Darkside actors infected before they hit the U.S. holding\ncompany in August 2020. By the time they publicly debuted their new tool on August 10, they\nhad already been infecting victims for months or longer with the tool. They, or one of their\naffiliates, had hacked the holding company three to six months before the August 10\nannouncement. And a recent report from the security firm Mandiant suggests the group had\n[been active even longer than this. Mandiant describes a group it calls UNC2465 that was](https://www.fireeye.com/blog/threat-research/2021/05/shining-a-light-on-darkside-ransomware-operations.html)\ninfecting victims with Darkside ransomware as early as April 2019.\n\nRegardless of this, it appears their quality-assurance team was still working out kinks in their\nnew product because Boyce says the decryption tool the hackers provided the holding\ncompany after it paid the ransom was buggy and had to be tweaked to get it to unlock all of\nthe victim’s systems.\n\n“The initial victims were essentially [Darkside’s] beta testers,” says Boyce.\n\n## Anatomy of a Recovery\n\nIt was the evening of Friday August 7 when the holding company’s 5,000 systems froze,\nalerting them to the presence of intruders in their network. The next morning, the company\ncontacted Crypsis to investigate. Boyce, who headed Crypsis’ incident-response team at the\ntime, spent most of that day at a wedding, glued to his phone.\n\n“There’s a picture of me at the wedding in my suit, cocktail hour, on the phone talking to the\nvictim,” he recalls.\n\nIt was immediately clear that they were dealing with a new ransomware strain that hadn’t\nbeen written about before.\n\n“[T]here was nothing out there on Darkside at all,” he said, indicating an absence of prior\nreports about the ransomware from other digital forensic investigators.\n\nTheir first task was to map the holding company’s network to understand its architecture —\nhow many systems were connected and how they were connected to each other. Saturday\nnight they began pulling system logs to investigate. Ransomware only encrypts user files, not\n\n\n-----\n\nsystem files, so logs tracking activity on the network — what occurred, when it occurred, and\nwho did it — are preserved, as long as the attackers haven’t deleted them to hide their\ntracks.\n\nIn this case, the holding company’s logs provided a good chart for Boyce and his team to\ntrace the breach back to a phishing email. The email contained a link to a malicious web site\nthat, when an employee visited the site, downloaded malware to their computer. The hackers\nthen moved from that machine through the network to install a backdoor that gave them inand-out access. In the context of everyday ransomware intrusions, it was nothing special.\n\n“We didn't see anything sophisticated at all. It was normal ransomware by the playbook,”\nBoyce says. “Easy entry from a user computer, [aided by] poor IT practices.”\n\nThe latter included network administrators who shared and re-used administrative\npasswords. Once the intruders grabbed these credentials, they were able to access servers\nthey needed to deploy the ransomware across systems company-wide. But they didn’t\ndeploy their tool immediately. Instead they went silent for months.\n\n“There was no active reconnaissance in the months between initial point-of-access and\nransomware deployment,” Boyce says. “They got access, maintained their backdoor and\npersistence [on the network], and then once they were ready to launch their ransomware, it\nwas launched.”\n\nWhile Boyce's team investigated the breach, the payment negotiations were handled by\nCoveware.\n\n“Payment [occurred] about five to seven days after a lot of back-and-forth [with the\ncriminals],” Boyce says.\n\nA separate recovery team hired by the holding company worked with the company’s own\nstaff to set up a new network and decrypt the locked systems.\n\nBut once they got the decryption tool from the Darkside hackers, the recovery team found it\ndidn’t work to unlock all of the systems owned by the company’s infected subsidiaries. This\nisn’t unusual says Boyce; sometimes ransomware developers will only make a decryption\ntool that works for computers using Windows 10 but not Windows XP. The recovery team\nhad to troubleshoot with the criminal gang to get it to work.\n\nThe recovery team made sure the decryption tool didn’t contain malicious code, then began\nunlocking and restoring the holding company’s data — focusing on business-critical files first.\nIt took four to six weeks to get every system, including those belonging to subsidiaries,\ndecrypted, Boyce says.\n\n\n-----\n\nIn any ransomware infection, recovery teams advise victims to start from scratch with a new\nnetwork — hardware and software — which can be created almost instantaneously, Boyce\nsays. Once that network is in place, teams can populate the new network with files restored\nfrom trustworthy backups, not from servers that had been encrypted.\n\nRansomware actors are unlikely to alter or corrupt data on systems before encrypting them\n— since victims would be less likely to pay if it were known they were doing this — but even\nif the hackers didn’t manipulate data, the process of decrypting files can sometimes corrupt\nthem or undermine their integrity, Boyce says.\n\n“With decrypting, you’re relying on the criminal enterprise to essentially write good code to\ndecrypt [your files],” Boyce says. “Often the program they give you to decrypt doesn't\nnecessarily work one-hundred percent of the time.”\n\nCompany backups rarely include personal and individual work files from an employee’s\ndesktop computer — they generally include only files that are essential to the core business\nand operations. This means that restoration from backups doesn’t recover everything, which\nis why a victim would still want to get access to machines that were locked by the\nransomware.\n\nAfter a ransomware infection, Boyce says recovery teams never re-connect infected systems\nto the new network or put those infected systems online. Instead they decrypt and recover\nfiles from them based on priority, scanning them for malware before loading them onto\nsystems on the new network. It can take years, Boyce says, to fully recover from a\nransomware infection, and companies infected with ransomware have to hold on to the data\nfrom their decrypted systems because they never know when they might need a file.\n\n“You almost need to operate two infrastructures probably for years, and [gradually] segment\nout the impacted systems,” Boyce says.\n\nAsked if the holding company felt they’d made a good decision in paying the ransom, Boyce\nsays they did.\n\n“In terms of the outcome, given that they weren’t named on the [Darkside] web site, they\nwere pleased,” he says.\n\n_If you found this story valuable, please consider sharing it._\n\n[Share](https://zetter.substack.com/p/anatomy-of-one-of-the-first-darkside?utm_source=substack&utm_medium=email&utm_content=share&action=share)\n\n_If you’d like to receive other stories like this, please consider subscribing._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-12 - Anatomy of a $2 Million Darkside Ransomware Breach.pdf"
    ],
    "report_names": [
        "2021-05-12 - Anatomy of a $2 Million Darkside Ransomware Breach.pdf"
    ],
    "threat_actors": [
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e9f7f836-b77f-4f95-aa02-9e99d32faf1d",
            "created_at": "2024-12-21T02:00:02.857057Z",
            "updated_at": "2025-03-27T02:00:03.472472Z",
            "deleted_at": null,
            "main_name": "UNC2465",
            "aliases": [],
            "source_name": "MISPGALAXY:UNC2465",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536251,
    "ts_updated_at": 1743041815,
    "ts_creation_date": 1653820811,
    "ts_modification_date": 1653820811,
    "files": {
        "pdf": "https://archive.orkl.eu/baaa50a550f74db5437f8734a2a07f9e3ea7a6f1.pdf",
        "text": "https://archive.orkl.eu/baaa50a550f74db5437f8734a2a07f9e3ea7a6f1.txt",
        "img": "https://archive.orkl.eu/baaa50a550f74db5437f8734a2a07f9e3ea7a6f1.jpg"
    }
}