{
    "id": "ab218408-586a-4ae1-b3cf-0938845f0ed2",
    "created_at": "2023-01-12T15:09:54.291705Z",
    "updated_at": "2025-03-27T02:08:40.178382Z",
    "deleted_at": null,
    "sha1_hash": "d25d235213e5c221db9696abe45a08d8f3d2a4fc",
    "title": "2015-05-26 - Moose – the router worm with an appetite for social networks",
    "authors": "",
    "file_creation_date": "2022-05-27T22:52:32Z",
    "file_modification_date": "2022-05-27T22:52:32Z",
    "file_size": 243122,
    "plain_text": "# Moose – the router worm with an appetite for social networks\n\n**welivesecurity.com/2015/05/26/moose-router-worm/**\n\nMay 26, 2015\n\nA new worm is infecting routers in order to commit social networking fraud, hijacking victims'\ninternet connections in order to \"like\" posts and pages, \"view\" videos and \"follow\" other\naccounts.\n\n26 May 2015 - 12:45PM\n\nA new worm is infecting routers in order to commit social networking fraud, hijacking\nvictims’ internet connections in order to “like” posts and pages, “view” videos and “follow”\nother accounts.\n\n[ESET researchers have issued a technical paper today, analyzing a new worm that is](http://www.welivesecurity.com/wp-content/uploads/2015/05/Dissecting-LinuxMoose.pdf)\ninfecting routers in order to commit social networking fraud, hijacking victims’ internet\nconnections in order to “like” posts and pages, “view” videos and “follow” other accounts.\n\n\n-----\n\nThe malware, dubbed Linux/Moose by researchers Olivier Bilodeau and Thomas Dupuy,\ninfects Linux-based routers and other Linux-based devices, eradicating existing malware\ninfections it might find competing for the router’s limited resources, and automatically finding\nother routers to infect.\n\nHowever, the Moose worm does not rely upon any underlying vulnerability in the routers – it\nis simply taking advantage of devices that have been weakly configured with poorly chosen\nlogin credentials.\n\nUnfortunately, this means that devices other than routers can be impacted by the worm in\nthe form of accidental collateral damage. ESET’s team believes that even medical devices,\nsuch as the Hospira drug infusion pump, could be infected by the Linux/Moose worm.\n\nBut the principal victims are likely to be routers – with devices from Actiontec, Hik Vision,\nNetgear, Synology, TP-Link, ZyXEL, and Zhone already identified as vulnerable.\n\nESET’s detailed technical report provides an indepth analysis of the Moose worm, methods\nby which users can determine if they might have had their routers compromised, and\ncleaning instructions. Importantly, the technical report provides prevention advice to avoid\nreinfection.\n\n\n-----\n\nPerhaps most interesting of all, however, is to try to understand the purpose of the Moose\nworm.\n\nIn their investigation, ESET’s team observed the worm creating bogus accounts on sites\nsuch as Instagram, and automatically following users. In many cases the rise in followers\nwas carefully staggered over some days, seemingly to avoid raising alarms in automated\nsystems built by the social networks to identify suspicious behavior.\n\nThe sad truth is that there are many individuals and companies out there who are keen to\nmanipulate their social media standing, and have no qualms about hiring third-parties who\nclaim to have methods to bump up the number of views of a corporate video, boost the\nfollowers on a Twitter feed or get you more Facebook fans.\n\nOften these third-parties will themselves contract the work out to other companies, and the\ndanger is that one of these might – perhaps unwittingly – hire criminals with access to the\nbotnet of Moose-compromised routers to conduct the social media fraud on their behalf.\n\nThe fact that these aren’t *real* fans, or *real* views of the video is likely to go unnoticed or\nbe swept under the carpet by marketing teams keen to impress their bosses.\n\n\n-----\n\nAs well as social networking fraud, ESET s paper considers that the malware could\npotentially be used for other activities – such as distributed denial-of-service attacks,\ntargeted network exploration (where it works hard to dig deep past firewalls) and\neavesdropping and DNS hijacking (which could lead itself to phishing and further malware\nattacks).\n\nOnce again, consumers are advised to be on their guard, ensure that they install the latest\nsecurity patches and never use default or easy-to-crack passwords on their internetconnected devices.\n\nFor much more information about the threat, and how to protect yourself against it, read the\ntechnical paper from ESET’s team of experts: “Dissecting Linux/Moose”.\n\n26 May 2015 - 12:45PM\n\n## Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-05-26 - Moose – the router worm with an appetite for social networks.pdf"
    ],
    "report_names": [
        "2015-05-26 - Moose – the router worm with an appetite for social networks.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536194,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653691952,
    "ts_modification_date": 1653691952,
    "files": {
        "pdf": "https://archive.orkl.eu/d25d235213e5c221db9696abe45a08d8f3d2a4fc.pdf",
        "text": "https://archive.orkl.eu/d25d235213e5c221db9696abe45a08d8f3d2a4fc.txt",
        "img": "https://archive.orkl.eu/d25d235213e5c221db9696abe45a08d8f3d2a4fc.jpg"
    }
}