{
    "id": "ab9ac77b-c048-48e0-b3ea-4bfe47f478a3",
    "created_at": "2023-10-25T02:04:25.689857Z",
    "updated_at": "2025-03-27T02:16:09.299886Z",
    "deleted_at": null,
    "sha1_hash": "2beb7533b870621d6679e026348296ebddbb95e9",
    "title": "Microsoft Word - EC-2022-049_Campañas_de_distribución_Malware_Ecuador_V1.docx",
    "authors": "",
    "file_creation_date": "2022-03-23T09:25:23Z",
    "file_modification_date": "2022-03-23T09:25:23Z",
    "file_size": 3399134,
    "plain_text": "### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n## I. DATOS GENERALES:\n\n\n## Clase de alerta: Código Malicioso / Phishing Tipo de incidente: Malware Nivel de riesgo: Alta\n II. ALERTA\n\nDurante el primer trimestre de 2022, a través del monitoreo realizado por EcuCERT, se ha\ndetectado la presencia de la campaña APT-C-36 (Amenaza Avanzada Persistente) en Ecuador, a\ntravés de la que, ciberdelincuentes envían correos electrónicos, haciéndose pasar por Instituciones\nPúblicas de Ecuador, adjuntando archivos de tipo malicioso, los que al ser descargados y\nejecutados, instalan malware de tipo RAT/Crypter, con el objetivo de obtener acceso y control\nremoto a los dispositivos infectados, para posteriormente, apoderarse de\ninformación/datos/archivos/contraseñas de carácter sensible, con la finalidad de obtener alguna\nganancia económica a través de los mismos.\n\n**Figura 1.** Ciclo de una Amenaza Avanzada Persistente APT. Fuente: B-SECURE\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n## III. INTRODUCCIÓN \n\n\nLos ciberdelincuentes, emplean diferentes técnicas y herramientas para captar información de sus\nvíctimas; en este sentido, una APT o Advanced Persistent Attack o Amenaza Avanzada\nPersistente; utilizan diferentes técnicas de “hacking” continuas y avanzadas para acceder al\nsistema y robar información. Según las etapas descritas en la Figura Nro. 1.\n\nAPT-C-36 también conocido como Blind Eagle / Águila Ciega es un actor de amenaza,\nprobablemente con centro de operaciones en Sur América; ha estado activo desde al menos 2018.\nEl grupo se dirigía principalmente a instituciones gubernamentales colombianas en un inicio; sin\nembargo, al parecer han empezado a incrementar su actividad en otros países de la región, entre\nellos, Ecuador.\n\nHasta la presente fecha, se ha rastreado como su principal objetivo, la suplantación de identidad\nde Instituciones ecuatorianas como: La Función Judicial, Fiscalía General del Estado, Procuraduría\nGeneral del Estado y la Agencia Nacional de Tránsito; podrían estar siendo suplantadas más\nInstituciones inclusive.\n\nEl modo de ataque empleado por APT-C-36, es a través del envío de correos electrónicos de\nphishing, a través de los que, se adjuntan archivos que contienen código malicioso, o archivos que\ncontienen malware de tipo RAT (troyano de acceso remoto) de naturaleza Crypter (malware\nespecializado cuyo código fuente e encuentra encriptado con el objetivo de evadir sistemas de\ndetección de amenazas), dirigido a varios usuarios/posibles víctimas, con el objetivo de obtener\nacceso y control remoto de dispositivos, para posteriormente, apoderarse de información y datos\npersonales de carácter sensible, con la finalidad de obtener alguna ganancia económica.\n\n\nAPT-C-36, emplea diferentes tipos de RAT; entre los que se destacan:\n\n\n\n- njRAT\n\n- Monitoreo inminente\n\n- Un ProyectoRAT modificado a medida\n\n- RAT de zona de guerra\n\n- RAT asíncrona\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n\n    - RAT CAL\n\n    - RAT Remcos\n\n    - BitRAT\n\n## IV. VECTOR DE ATAQUE\n Phishing\n V. IMPACTO\n\nEn la actualidad, la campaña de correos electrónicos maliciosos por parte de APT-C-36, para la\ndistribución de malware, circula a nivel nacional. Los actores maliciosos emplean un señuelo en el\nasunto del correo electrónico; señalando que existe un supuesto “Proceso Judicial Abierto (…)”\n\nEn el cuerpo del mensaje, se incluye un anexo en el que supuestamente se encuentra más\ninformación del proceso judicial en cuestión; siendo la característica en común, el uso de una clave\npara descomprimir el archivo adjunto.\n\nLos anexos previamente mencionados, pueden tener extensiones de archivo .VBS (script de\nejecución de Visual Basic), .EXE (archivo de ejecución de Windows), entre otros. Archivos que,\nuna vez ejecutados, empiezan a realizar un sin número de procesos y subprocesos en el sistema\noperativo Microsoft Windows, a nivel de registro, con el objetivo de descargar y ejecutar archivos\ncomplementarios para el desarrollo del ciberataque al dispositivo.\n\nEn la siguiente figura, se observan las muestras de correo electrónico que incluye archivos\nmaliciosos:\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nA continuación, se procede a realizar el análisis y trazabilidad de lo que ocurre una vez que el\ndocumento/archivo adjunto malicioso, es ejecutado en el sistema operativo Windows:\n\n**ITEM** **MÉTODO DE ENTREGA** **DESCRIPCIÓN DEL ARCHIVO ADJUNTO**\n\n**1** **Muestra Uno** **Nombre de Archivo:**\n\nDESCARGOS PENALES PROCESO N°1193490-3\n\nCorreo electrónico, el archivo\nmalicioso se adjunta al **Extensión del Archivo: .vbs**\ncorreo.\n\n**Tabla 1. Archivo adjunto en distribución de correo electrónico posible APT-C-36. Fuente: Propia**\n\nRespecto a la muestra número uno, se evidencia que, una vez ejecutado el archivo\n“DESCARGOS PENALES PROCESO N°1193490-3.vbs”, se realizan conexiones a las direcciones\nIP: 91[.]241[.]19[.]49, y 188[.]114[.]96[.]7 a través de las que, se descargan los archivos\n“estrellasdll.txt”, “estrellasPe.txt” y “va.txt”.\n\n**Figura 3. Conexiones y descarga de archivos de tipo malicioso. Fuente: Análisis en SandBox AnyRun**\n\n|ITEM MÉTODO DE ENTREGA DESCRIPCIÓN DEL ARCHIVO ADJUNTO|Col2|Col3|\n|---|---|---|\n|1|Muestra Uno Correo electrónico, el archivo malicioso se adjunta al correo.|Nombre de Archivo: DESCARGOS PENALES PROCESO N°1193490-3 Extensión del Archivo: .vbs|\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nCompleta la descarga de lo descrito en la figura Nro. 3, se empiezan a ejecutar siete (7) subprocesos\nen el sistema Operativo, los que, modifican el sistema a nivel de registro, y, al finalizar, se establece\nuna conexión con la dirección IP 181[.]130[.]9[.]146, a través del puerto 33889, dirección que, podría\nencontrarse en modo escucha a la espera de una víctima, para conectarse remotamente al equipo,\npermitiendo al ciberdelincuente acceder al equipo infectado para robar\ninformación/datos/contraseñas de carácter sensible.\n\n\n**Figura 4. Ejecución a nivel de registro de archivo malicioso. Fuente: Análisis en SandBox AnyRun**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nA continuación, se muestra el diagrama general de conexiones, correspondientes al archivo\n“DESCARGOS PENALES PROCESO N°1193490-3.vbs”: Conexión a tres direcciones IP y descarga de\ntres archivos de tipo malicioso:\n\n**Figura 5. Diagrama de conexiones de archivo malicioso. Fuente: Virus Total**\n\n\n**ITEM** **MÉTODO DE ENTREGA** **DESCRIPCIÓN DEL ARCHIVO ADJUNTO**\n\n\n**Extensión del Archivo: .exe**\n**Tabla 2. Archivo adjunto en distribución de correo electrónico posible APT-C-36. Fuente: Propia**\n\n|ITEM MÉTODO DE ENTREGA DESCRIPCIÓN DEL ARCHIVO ADJUNTO|Col2|Col3|\n|---|---|---|\n|2|Muestra Dos Correo electrónico, el archivo malicioso se remite a través de link.|Link de descarga: https://drive[.]google[.]com/uc?id=1yD30FbVQBrUyXUN6zxsz- JM8nAM9XPCy&export=download&authuser=0 Nombre de Archivo: Citacion Funcion Judicial Republica De Ecuador 2 Extensión del Archivo: .exe|\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nRespecto a la muestra número dos, correspondiente al archivo “Citación Función Judicial Republica De\nEcuador.exe”, el comportamiento es similar; sin embargo, la extensión del archivo está en formato\nejecutable, con lo que, una vez ejecutada la aplicación, se conecta a la dirección IP 31[.]42[.]177[.]191,\na través de la que, se descargan siete (7) archivos: “versionx64.dll”, “kifoasadx64.exe”,\n“amsipatcherx64.dll”, “stage1x64.ps1”, “stage1x32.ps1”,” NetCrypter.txt”, “sicv2.ps1”, los mismos que\ncorresponden a la carga útil del archivo malicioso original “Citación Función Judicial Republica De\nEcuador.exe”.\n\n**Figura 6. Conexiones y descarga de archivos de tipo malicioso. Fuente: Análisis en SandBox AnyRun**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nUna vez descargados los siete archivos de carga útil mencionados con anterioridad, se\nproceden a ejecutar subrutinas a nivel de registro de sistema operativo Windows, al igual que\nel caso de la muestra número 1, se realiza una conexión a la dirección IP: 181[.]130[.]5[.]112,\ndirección IP que, podría encontrarse en modo escucha a la espera de una víctima, para conectarse\nremotamente al equipo, permitiendo al ciberdelincuente, acceder al equipo infectado para robar\ninformación/datos/contraseñas de carácter sensible.\n\nA continuación, se muestra el diagrama general de conexiones, correspondientes al archivo “Citación\nFunción Judicial Republica De Ecuador.exe”: conexión a dos direccione IP y descarga de siete\narchivos de tipo malicioso:\n\n\n**Figura 7. Diagrama de conexiones de archivo malicioso. Fuente: Virus Total**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nUna vez finalizados los análisis de las muestras números uno y dos, surge la pregunta de ¿Cómo\ndeterminar que ambas muestras pertenecen a la amenaza avanzada persistente de APT-C-36?.\n\nEl análisis e investigación, a través del que se logró relacionar las muestras expuestas en el presente\ndocumento, se desarrolló a través de la indexación en fuentes abiertas de las direcciones IP\ninvolucradas, logrando determinar que, archivos maliciosos similares, ya habían sido distribuidos en\notros países de la región, entre los cuales resalta Colombia.\n\nA través de una muestra encontrada en el software de sandbox (réplica del área operativa de un\ncomputador, sin acceso al resto de la red) Any Run, correspondiente al archivo de nombre\n“36b25672f.vbs”, el que, una vez ejecutado, se conecta a las direcciones IP: 91[.]241[.]19[.]49,\n185[.]136[.]171[.]110 y 181[.]130[.]5[.]112, con el objetivo de descargar tres archivos archivos (carga\nútil del malware): “F3runpe.txt”, “33889%20send.txt” y “F3dll.txt”\n\n**Figura 8. Conexiones y descarga de archivos de tipo malicioso. Fuente: Análisis en SandBox AnyRun**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nCompleta la descarga de lo descrito en la figura Nro. 8, se empiezan a ejecutar siete (7) subprocesos\nen el sistema Operativo, los que, modifican el sistema a nivel de registro, y, al finalizar, se establece\nuna conexión con la dirección IP 181[.]130[.]5[.]112, a través del puerto 33889, dirección que, podría\nencontrarse en modo escucha a la espera de una víctima, para conectarse remotamente al equipo,\npermitiendo al ciberdelincuente, acceder al equipo infectado para robar\ninformación/datos/contraseñas de carácter sensible.\n\n\n**Figura 9. Ejecución a nivel de registro de archivo malicioso. Fuente: Análisis en SandBox AnyRun**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nA continuación, se muestra el diagrama general de conexiones, correspondientes al archivo\n“36b25672f.vbs”: conexión a tres direccione IP y descarga de tres archivos de tipo malicioso.\n\n\n**Figura 10. Diagrama de conexiones de archivo malicioso. Fuente: Virus Total**\n\n\nEn contexto, al tener un archivo de tipo malicioso similar como muestra, se puede evidenciar que las\ndirecciones IP 91[.]241[.]19[.]49 y 181[.]130[.]5[.]112, son el factor común tanto para la muestra\nnúmero uno “Juicio No 9802201800411 Litigante FUNCION JUDICIAL.vbs”, como para la muestra\nnúmero dos “Citación Función Judicial Republica De Ecuador.exe” respectivamente.\n\nEn referencia a lo establecido en el párrafo anterior, podemos evidenciar que se trata del mismo\nciberdelincuente, o grupo de ciberdelincuentes, realizando ataques similares, a través de varios\nmétodos de ejecución de malware, ya sea a través de ofuscación de código, o, archivos\nmaliciosos de tipo ejecutable, con el objetivo de no ser detectados.\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n**Figura 11. Árbol de conexiones comunes entre muestras uno y dos presentes en Ecuador. Fuente: Propia/Virus Total**\n\nAdicionalmente, se debe aclarar que, aunque los métodos de ataque sean similares a los presentes\npor el grupo APT-C-36, se debe considerar que también podría tratarse de un solo individuo, o,\nconjunto de individuos imitadores del grupo APT-C-36 original, toda vez que el código fuente\nofuscado presente en los archivos, pudo haber sido descargado, modificado y adaptado a nuevas\nfuncionalidades.\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nA continuación, se adjunta una tercera evidencia de malware de tipo Crypter, es decir, malware\nespecializado, cuyo código fuente se codifica para evitar ser detectados por los diferentes métodos\ny motores de búsqueda de vulnerabilidades, reportado en Ecuador; corresponde a un correo\nelectrónico de la Procuraduría General del Estado, el mismo que contiene un archivo adjunto de\nextensión tipo “.UUE”, y, una vez ejecutado, se conecta a la dirección IP 212[.]193[.]30[.]240, con el\nobjetivo de realizar la descarga de archivos maliciosos (carga útil), para posteriormente infectar el\ncomputador de la víctima. El correo electrónico previamente mencionado, podría también estar\nrelacionado a la misma campaña APT-C-36, toda vez que tiene la misma estructura y comparte la\nmisma relación de dominio Web con la muestra número dos (Tabla Nro. 2): “polycomusa[.]com”\n\n**Figura 12. Correo electrónico de PGE posiblemente asociado a APT-C-36. Fuente: Twitter**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n**Figura 13. Parte del código fuente de adjunto al Correo electrónico malicioso de PGE. Fuente: Twitter**\n\n**Figura 14. Árbol de conexiones asociado al archivo adjunto del Correo electrónico malicioso de PGE. Fuente: Twitter**\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n## VI. INDICADORES DE COMPROMISO:\n\n\n**Ítem** **Parámetro** **IOC Muestra Uno** **IOC Muestra Dos**\n\n\n**Nombre de**\n### 1\n\n**Archivo**\n\n\nDESCARGOS PENALES\nPROCESO N°1193490-3\n\n\nCitación Función Judicial Republica De\n\nEcuador\n\n\nJuicio No 9802201800411 Litigante\n### 2 Descripción kifoasad.exe\n\nFUNCION JUDICIAL.vbs\n\n\n### 3\n\n\n**Nro. de anti**\n\n**virus que**\n\n**detectan**\n\n\n12 de 53 31 de 70\n\n\n### 4 Threat Name njRAT njRAT\n\n\n852f32efe7a6ecd4ce3b1c9356418\n### 5 MD5 216e41dd8889798a65852249394a62ad\n\n0ac\n\n\ne7362c2ba384a8c15990b0858b89\n### 6 SHA-1\n\ne461f43e022c\n\n\n606fb46526b2c6187b00a94b2adb28817179\n\n7127\n\nebbc37e280f15408a2ff17bec1151cc64d151e\n\n20c1e59209a76b9eb3944d6704\n\n\n### 7 SHA-256\n\n\ndc7b8494eaf9230372e53e1e822cc\n\n6f23982afdace7f7c80076a769f466\n\nbefa8\n\n\ndefenderav.con-ip[.]com\n\nCreated: 2014-03-31\n\nIONOS SE\n\n\ndefenderav.con-ip[.]com\n\nCreated: 2014-03-31\n\nIONOS SE\n\n\n### 8 Dominios\n\n\npasteio[.]com\nCreated: 2017-07-05\n\nNAMECHEAP INC\n\n\nsicariop[.]polycomusa[.]com\n\nCreated: 2022-02-12\n\nRegistro:-\n\npolycomusa[.]com\nCreated: 2022-02-12\n\nRegistro:-\n\n### 9 IP Traffic\n\n\n104[.]21[.]57[.]139\n\nCountry: -- 31[.]42[.]177[.]191\n\n\n172[.]67[.]164[.]22 Country: PL\n\nCountry: US\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n**Ítem** **Parámetro** **IOC Muestra Uno** **IOC Muestra Dos**\n\n\n181[.]130[.]9[.]145\n\nCountry: CO\n\n\n192.168.0.1 181[.]130[.]5[.]112\n\nCountry: -- Country: CO\n91[.]241[.]19[.]49\n\nCountry: RU\n**Tabla 3. IOC de archivos adjuntos de posible APT-C-36.** **Fuente: Análisis en Virus Total.**\n\nConsiderando la Tabla 3, se observa que el tipo de malware identificado es: njRAT; es decir, los\nactores de amenaza APT-C-36 emplean RATs. En la siguiente gráfica se observa la identificación\nde la amenaza en los archivos adjuntos:\n\n**Figura 15.** Threat Name de Muestra Uno. Fuente: Análisis en Virus Total.\n\n|Col1|Col2|91[.]241[.]19[.]49 Country: RU|Col4|\n|---|---|---|---|\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n**Figura 16.** Threat Name de Muestra Dos. Fuente: Análisis en Virus Total.\n\n“njRAT” es un troyano de accesos remoto (RAT), también conocido como Bladabindi, un programa\nmalicioso que permite a un atacante controlar remotamente un equipo comprometido y realizar diversas\nacciones. “njRAT” presenta diferentes modificaciones; sin embargo, el troyano original presenta las\nsiguientes características:\n\n  - Desarrollado en el lenguaje de programación C#\n\n  - Captura de pantalla, captura de cámara y audio\n\n  - Captura de pulsaciones de teclado (keylogging)\n\n  - Persistencia en el registro de Windows\n\n  - Manipulación, descarga, extracción, y ejecución de archivos\n\n  - Manipulación del registro de Windows\n\n  - Robo de credenciales\n\n  - Agrega una excepción en el Firewall de Windows para poder comunicarse\n\n  - Conexión al servidor de C&C via Socket TCP y datos codificados en Base64\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n## VII. RECOMENDACIONES:\n\n\nEl EcuCert recomienda a su comunidad objetivo:\n\n\n\n- No abrir, manipular, o interactuar, con correos electrónicos altamente sospechosos que\nlleguen a las bandejas de correo electrónico personal o Institucional, así como también,\nmensajes directos en redes sociales, procedente de remitentes desconocidos.\n\n- Implementar técnicas de navegación segura en toda la Institución/Organización, como por\nejemplo, utilizar y visitar únicamente sitios Web con certificados SSL, y, de origen no\nsospechoso.\n\n- Blindar los sistemas de correo electrónico, así como también, el acceso a los mismos, a\ntravés de plataformas de autentificación de doble factor, y, uso de contraseñas robustas.\n\n- Monitorear los sistemas de correo electrónico, a través del uso de plataformas de seguridad\nperimetral, así como también, implementar la correcta configuración a nivel de SPF, DKIM\ny DMARC de lo mismos, con el objetivo de evitar una posible suplantación de identidad\nInstitucional a nivel de correo electrónico.\n\n- Otorgar privilegios de usuario al mínimo dependiendo del tipo de labor a realizar.\n\n- Descargar programas, archivos y actualizaciones, solamente desde fuentes oficiales y\nverificadas.\n\n- Implementar y monitorear, plataformas de seguridad perimetral para identificar posible\ntráfico malicioso tanto a nivel interno como externo la infraestructura de red de la\norganización/Institución\n\n- Descargar programas, archivos y actualizaciones, solamente desde fuentes oficiales\nverificadas.\n\n- Cerrar todo tipo de conexión/protocolo de acceso remoto a infraestructuras críticas en la\nOrganización/Institución, en el caso de requerir su implementación, realizarlo bajo estrictas\nnormas de seguridad apalancados en plataformas de seguridad perimetral y, uso de una\nVPN.\n\n- Mantener actualizados, y, bajo licenciamiento, (ya sea a nivel de software libre o de paga,\nde ser el caso), todos y cada uno de los sistemas y subsistemas de software y hardware de\ntoda la infraestructura de IT y OT de la Institución, esto es, incluido a nivel de Firmware de\ntodos los componentes.\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\nCapacitar a todos los usuarios, mediante la concientización y simulaciones para reconocer\ne informar sobre intentos de phishing e ingeniería social.\n\n   - Tener actualizado y utilizar, un software anti-virus.\n\n   - Realizar copias de seguridad regularmente de archivos personales y críticos para la\nOrganización.\n\n   - Implementar un plan de respuesta a emergencias de la Organización/Institución.\n\n   - En el caso de sufrir un ataque de proporciones mayores, contacte a las Autoridades\ncompetentes en base a la Normativa Legal Vigente a nivel Nacional.\n\n## VIII. REFERENCIAS: \n\n### Fileextension. (s.f.). File Extension. Obtenido de File Extension: \n https://www.file-extension.info/es/format/vbs\n Horejsi, J., & Lunghi, D. (13 de 9 de 2021). TREND MICRO. Obtenido de TREND MICRO:\n https://www.trendmicro.com/en_us/research/21/i/apt-c-36-updates-its-long-term-spam- campaign-against-south-ameri.html\n IONO, D. G. (s.f.). Digital Guide IONO. Obtenido de Digital Guide IONO:\n https://www.ionos.es/digitalguide/servidores/know-how/archivos-exe/\n Malpedia. (s.f.). Malpedia. Obtenido de Malpedia:\n https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat\n MALPEDIA. (s.f.). MALPEDIA. Obtenido de MALPEDIA:\n https://malpedia.caad.fkie.fraunhofer.de/actor/apt-c-36\n Total, V. (s.f.). Virus Total. Obtenido de Virus Total:\n https://www.virustotal.com/gui/file/ebbc37e280f15408a2ff17bec1151cc64d151e20c1e59 209a76b9eb3944d6704/relations\n\n\n-----\n\n### EC-2022-049\nNro. Alerta:\n\n\nCENTRO DE RESPUESTA A INCIDENTES INFORMÁTICOS DEL\n\n\nTLP:\n\n\nECUADOR\n\n# ALERTAS DE SEGURIDAD\n\n|Fecha:|22-marzo-2022|Campaña de Amenaza Avanzada Persistente APT-C-36 podría estar presente en Ecuador|V 1.1|\n|---|---|---|---|\n\n\n### Total, V. (s.f.). Virus Total. Obtenido de Virus Total:\n https://www.virustotal.com/gui/file/dc7b8494eaf9230372e53e1e822cc6f23982afdace7f7 c80076a769f466befa8/relations\n WELIVESECURITY. (29 de 09 de 2021). ESET. Obtenido de ESET:\n https://www.welivesecurity.com/la-es/2021/09/29/que-es-njrat-troyano-acceso-remoto- utilizado-cibercriminales/\n MALPEDIA. (s.f.). MALPEDIA. Obtenido de MALPEDIA: \n https://www.b-secure.co/recursos/infografias/pasos-de-las-amenazas-persistentes- avanzadas\n Sandbox AnyRun. (17 de febrero de 2022). Any Run. Obtenido de Any Run:\n https://app.any.run/tasks/e3bb8f70-847c-45dc-990a-181b4d29ed7e/\n Steck Mera. (18 de marzo de 2022). SteckMera. Obtenido de Twitter:\n https://twitter.com/SteckMera/status/1504892999498715139/\n B-SECURE. (s.f.). B-SECURE. Obtenido de B-SECURE:\n https://www.b-secure.co/recursos/infografias/pasos-de-las-amenazas-persistentes- avanzadas\n\n\n-----",
    "language": "ES",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://www.ecucert.gob.ec/wp-content/uploads/2022/03/alerta-APTs-2022-03-23.pdf"
    ],
    "report_names": [
        "alerta-APTs-2022-03-23.pdf"
    ],
    "threat_actors": [
        {
            "id": "98b22fd7-bf1b-41a6-b51c-0e33a0ffd813",
            "created_at": "2022-10-25T15:50:23.688973Z",
            "updated_at": "2025-03-27T02:00:55.524322Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "APT-C-36",
                "Blind Eagle"
            ],
            "source_name": "MITRE:APT-C-36",
            "tools": [
                "Imminent Monitor"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bd43391b-b835-4cb3-839a-d830aa1a3410",
            "created_at": "2023-01-06T13:46:38.925525Z",
            "updated_at": "2025-03-27T02:00:02.95302Z",
            "deleted_at": null,
            "main_name": "APT-C-36",
            "aliases": [
                "Blind Eagle"
            ],
            "source_name": "MISPGALAXY:APT-C-36",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "be597b07-0cde-47bc-80c3-790a8df34af4",
            "created_at": "2022-10-25T16:07:23.407484Z",
            "updated_at": "2025-03-27T02:02:09.784411Z",
            "deleted_at": null,
            "main_name": "Blind Eagle",
            "aliases": [
                "APT-C-36",
                "APT-Q-98",
                "AguilaCiega"
            ],
            "source_name": "ETDA:Blind Eagle",
            "tools": [
                "AsyncRAT",
                "BitRAT",
                "Bladabindi",
                "BlotchyQuasar",
                "Imminent Monitor",
                "Imminent Monitor RAT",
                "Jorik",
                "LimeRAT",
                "Remcos",
                "RemcosRAT",
                "Remvio",
                "Socmer",
                "Warzone",
                "Warzone RAT",
                "njRAT"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1698199465,
    "ts_updated_at": 1743041769,
    "ts_creation_date": 1648027523,
    "ts_modification_date": 1648027523,
    "files": {
        "pdf": "https://archive.orkl.eu/2beb7533b870621d6679e026348296ebddbb95e9.pdf",
        "text": "https://archive.orkl.eu/2beb7533b870621d6679e026348296ebddbb95e9.txt",
        "img": "https://archive.orkl.eu/2beb7533b870621d6679e026348296ebddbb95e9.jpg"
    }
}