{
    "id": "aba009a3-eb68-4937-86c3-3585ca062352",
    "created_at": "2023-02-02T02:07:41.386608Z",
    "updated_at": "2025-03-27T02:16:20.796545Z",
    "deleted_at": null,
    "sha1_hash": "e886c3657a755386bbd85e13c5733580e487da1b",
    "title": "2023-01-24 - Cyberattacks Targeting Ukraine Increase 20-fold at End of 2022 Fueled by Russia-linked Gamaredon Activity",
    "authors": "",
    "file_creation_date": "2023-02-01T07:52:17Z",
    "file_modification_date": "2023-02-01T07:52:17Z",
    "file_size": 627144,
    "plain_text": "## Cyberattacks Targeting Ukraine Increase 20-fold at End of 2022 Fueled by Russia-linked Gamaredon Activity\n\n**[trellix.com/en-us/about/newsroom/stories/research/cyberattacks-targeting-ukraine-increase.html](https://www.trellix.com/en-us/about/newsroom/stories/research/cyberattacks-targeting-ukraine-increase.html)**\n\n#### ARIA Resort & Casino | Las Vegas\n September 27-29, 2022\n\n[Register Now](https://trellix.g2planet.com/xpand_live_2022/register) [Learn More](https://www.trellix.com/en-us/about/events/2022/trellix-xpand-live-2022.html)\n\n### Stories\n\nThe latest cybersecurity trends, best practices,\n\nsecurity vulnerabilities, and more\n\n[By Daksh Kapur Tomer Shloman Robert Venal and John Fokker · January 24 2023](https://www.trellix.com/en-us/about/newsroom/stories/contributors/daksh-kapur.html)\n\n\n-----\n\nFigure 1\n\nIt has been almost a year since Russia invaded Ukraine in a major escalation of the RussoUkrainian War, which began in 2014. It has caused Europe's largest refugee crisis since\nWorld War II. The war is not just occurring on land but also through technology systems:\nUkraine public, energy, media, financial, business and non-profit sectors have suffered the\nmost through repeated, targeted cyberattacks. Since Feb 2022, cyberattacks have\nundermined the distribution of medicines, food and relief supplies. Their impact has ranged\nfrom preventing access to basic services to data theft and disinformation. In our previous\n[blog we described the different attacks against Ukraine that we observed through our](https://www.trellix.com/en-us/about/newsroom/stories/research/growling-bears-make-thunderous-noise.html)\ntelemetry.\n\nOur team has been following the cyberthreat landscape closely, supporting our global\ngovernment and enterprise customers with the latest threat intelligence and indicators. In\nthis blog, we outline our latest findings around cyberactivity targeting Ukraine. From\nmalicious email and URLs to nation-state backed use of malware, cyberactivity continues to\naccompany kinetic military activity and social discontent.\n\n\n-----\n\n### Malicious email\n\nA year later, and the Trellix Advanced Research Center team has noticed a 20-fold increase\nin email based cyberattacks on Ukraine’s public and private sectors. Our email security\nresearchers observed a surge of attacks in the third week of November ‘22 which remained\nconsistently high until they descended at the end of December ‘22.\n\nFigure 2 – Email based Attacks on Ukraine in 2022\n\nThe majority of these attacks were found to be aimed towards subdomains of “gov.ua”\nwebsite which is the parent domain for Ukrainian government and military sites. The most\npopular attacks were attachment-based in which emails with minimal body content along\nwith an attachment were sent to the victim. The subject is usually something to catch\ninterest like “References regarding receivables and payables,” “Please urgently submit an\napplication for a work permit for January 2022.”\n\nDifferent types of attachments were used to deliver malware. Some examples include xlsx,\nshtml, doc, xlsm, jar, lnk and cmg, of which xlsm was the most prevalent. The large majority\nof the observed malicious emails directed at the Ukrainian government had a nefarious\nsender, based on the analysis of the malicious attachments we believe with a high level of\nconfidence that these can be attributed to the state sponsored group Gamaredon.\n\n### Email campaigns\n\nTrellix Advanced Research Center researchers found different styles of campaigns utilized\nto target Ukrainian websites:\n\n\n-----\n\nSample 1: The email is a fake inbound Shipment Notification containing a html file opening\nwhich redirects the victim to a customized phishing page.\n\nSample 2: An email pretending to be from the “Accounts Team” that contains a malicious\nattachment masqueraded as an invoice\n\nSample 3: An email pretending to be from the Ministry of Foreign Affairs of Estonia looking\nto share contacts of embassy officers, and containing a link redirecting the user to a Google\ndrive link containing a malicious file\n\nSample 4: An email pretending to be from “Ministry of Defense of Ukraine” and contains a\ncompressed archive as an attachment, the email also utilizes the name of a logistic\ncompany, DNI Pro LLC which actively works in Ukraine. The archive is used to deliver\nmalware to the victim.\n\nSample 5: A fake notification email from an Administrator for mil.gov.ua notifying the victim\nof issues with their mailbox that require verification to resolve, and containing a link that\nredirects the user to a malicious website\n\n\n-----\n\n-----\n\nFigure 3 - Malicious Emails targeting Ukraine\n\n### Malicious URLs\n\nThe following are some of the malicious web pages being utilized to target Ukraine which\nwere found by Trellix Advanced Research Center’s email researchers:\n\nCustomized pages that appear to be genuine and look like the legitimate pages they\nspoof make it difficult for the victim to recognize any suspicious activity\nCapitalizing on user’s sense of urgency like by presenting a blurry document as a\nbackground of the phishing page, the document is designed to look important hence\ncapitalizing on the feeling of urgency to convince victim to log in.\nThe pages also make use of a combination of techniques to attempt to evade\ndetection by security products and make it harder to analyze by security\nprofessionals.\n\n\n-----\n\nFigure 4 - Malicious URLs targeting Ukraine\n\n### Malware and suspicious behavior\n\n\n-----\n\nTrellix Advanced Research Center telemetry has identified several malware families and\nobserved suspicious behavior targeting Ukraine organizations. The following are some of\nthe malware families and behaviors observed by our researchers:\n\n**Garmaredon: Gamaredon – A Russian APT group and one of the most active State**\nsponsored groups targeting Ukraine. The name Gamaredon Group comes from a\nmisspelling of the word \"Armageddon\", which was detected in the adversary's early\ncampaigns. Trellix researchers observed three different styles of malware related to\nGarmaredon.\n\nThe first which contained malicious LNK downloaders contained in archive files\nof various formats. These are trojans that abuse the Windows MSHTA utility to\ndownload further stages of malware.\nThe second was doc files using template injection attacks. This type of attack is\na Word document with fake template references to external malware payloads.\nThe third were XLL downloaders. These are trojanized Excel add-in DLLs that\nare programmed to instead download and install further malware.\n**H-Worm: also known as Houdini Rat is a Visual Basic Script based Remote Access**\nTrojan (RAT) first spotted in 2013. Command and Control infrastructure is shared with\nother malware families such as NjW0rm, njRat, XtremeRAT, and PoisonIvy. The RAT\ncontains various capabilities including stealing system information, capturing\nscreenshots, logging keystrokes, viewing the webcam, deleting files, and uninstalling\nitself. H-Worm was deployed in targeted attacks against the international energy\nindustry. We have also seen it used in a wider context for run-of-the-mill attacks\nexecuted through spammed email attachments and malicious links.\n**Formbook: An info stealer malware used to steal several types of data from infected**\nsystems, including credentials cached in web browsers, screenshots, and keystrokes.\nIt can also act as a downloader, enabling it to download and execute additional\nmalicious files.\n**Remcos: A Remote Access Software used to remotely control computers, which once**\ninstalled, opens a backdoor on the computer, granting full access to the remote user.\n**Andromeda: A commodity trojan developed in 2011 currently targeting Ukraine public**\nsector networks. This re-emergence of Andromeda was previously reported by\n[Mandiant, and Trellix can confirm this Andromeda activity.](https://www.mandiant.com/resources/blog/turla-galaxy-opportunity)\n**Potentially Unwanted Program (PuP) detections: From October 2022 till January**\n2023, we observed an abnormally large amount of PUP detections in Ukraine linked\nto a single software activation program aimed at activating Adobe. However, this PuP\nwas actually malware aimed at creating a backdoor on the infected system. The\nusage of PuPs and pirated license activators is something we continue to observe in\nour telemetry. We strongly discourage this behaviour as it increases the risk of serious\nmalware infections.\n\n\n-----\n\nFigure 5 Abnormal amount of PUP detections from Ukraine\n\n**CVE-2021-3438: We have observed multiple privilege escalation attempts at a**\nfinancial Institution where the threat actor attempted to launch an exploit for a known\nHP printer vulnerability (CVE-2021-3438) via Rundll32.\n**Suspected MSIEXEC.exe activity: Our researchers observed suspicious behavior**\nwhere msiexec.exe was spawned from an Excel file and attempted to download a\nbinary from a potentially compromised Qnap NAS device exposed to the Internet.\nLeveraging MSIEXEC.EXE is a common techniques, however, have observed this\nspecific behavior previously in a Raspberry Robin campaign as well as a older\nGamaredon campaign. More definitive attribution wasn’t possible as the final payload\nwas no longer available for additional analysis.\n\n### Indicators of compromise\n\nThe following link contains examples of malicious URLs, binaries and email addresses used\n[in the campaigns being carried against Ukraine.](https://www.trellix.com/en-us/assets/docs/misc/ukraine-blog-ioc.pdf)\n\n### Trellix security protection\n\nTrellix provides reliable detection from such campaigns by preventing emails from ever\nreaching your system. In addition, Trellix also detects campaigns on other levels like\nnetwork, URL and binary to provide complete protection to our customers.\n\n\n-----\n\nThe following is a subset of the Trellix Security detections that have been observed for the\nmalware in these campaigns:\n\nEmail Based Detections \nFE_EMAIL_PASSWORD_RESET_PHISH_1\nFE_Trojan_HTM_Phish_198.FEC2\nFEC_Trojan_JS_Generic_14\nFEC_Dropper_HTML_Generic_18\n\nEndpoint Based Detections \nAPT.Gamaredon.DNS\nWorm.Houdini\nFE_Backdoor_Win32_REMCOS_2\nTrojan.Formbook\nFE_Worm_Win32_Andromeda\n\n### Conclusion\n\nAs the Ukraine-Russia war continues, the cyber-attacks on Ukraine energy, government\nand transportation, infrastructure, financial sector etc. are going on consistently. In times of\nsuch panic and unrest, the attackers aim to capitalize on the distraction and stress of the\nvictims to successfully exploit them. As the attacks continue, we suggest everyone stay\nvigilant. Government and defense personnel are advised to stay extra-careful as they would\nbe the most promising targets for the attacks.\n\nTo review previous research on threat activity targeting Ukraine, check out our Trellix\n[Advanced Research Center’s previous blogs on Wiper malware and the evolution of](https://www.trellix.com/en-us/about/newsroom/stories/research/wipermania-an-all-you-can-wipe-buffet.html)\n[Russian cyber activity targeting Ukraine.](https://www.trellix.com/en-us/about/newsroom/stories/research/growling-bears-make-thunderous-noise.html)\n\n_This document and the information contained herein describes computer security research_\n_for educational purposes only and the convenience of Trellix customers._\n\n# Get the latest\n\nWe’re no strangers to cybersecurity. But we are a new company.\n\nStay up to date as we evolve.\n\nPlease enter a valid email address.\n\n\n-----\n\nZero spam. Unsubscribe at any time.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-01-24 - Cyberattacks Targeting Ukraine Increase 20-fold at End of 2022 Fueled by Russia-linked Gamaredon Activity.pdf"
    ],
    "report_names": [
        "2023-01-24 - Cyberattacks Targeting Ukraine Increase 20-fold at End of 2022 Fueled by Russia-linked Gamaredon Activity.pdf"
    ],
    "threat_actors": [
        {
            "id": "81bd7107-6b2d-45c9-9eea-1843d4b9b308",
            "created_at": "2022-10-25T15:50:23.320841Z",
            "updated_at": "2025-03-27T02:00:55.441723Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Gamaredon Group",
                "IRON TILDEN",
                "Primitive Bear",
                "ACTINIUM",
                "Armageddon",
                "Shuckworm",
                "DEV-0157",
                "Aqua Blizzard"
            ],
            "source_name": "MITRE:Gamaredon Group",
            "tools": [
                "QuietSieve",
                "Pteranodon",
                "PowerPunch"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d5156b55-5d7d-4fb2-836f-861d2e868147",
            "created_at": "2023-01-06T13:46:38.557326Z",
            "updated_at": "2025-03-27T02:00:02.861124Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Aqua Blizzard",
                "Actinium",
                "DEV-0157",
                "Blue Otso",
                "G0047",
                "PRIMITIVE BEAR",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder",
                "ACTINIUM",
                "BlueAlpha",
                "IRON TILDEN"
            ],
            "source_name": "MISPGALAXY:Gamaredon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "61940e18-8f90-4ecc-bc06-416c54bc60f9",
            "created_at": "2022-10-25T16:07:23.659529Z",
            "updated_at": "2025-03-27T02:02:09.912404Z",
            "deleted_at": null,
            "main_name": "Gamaredon Group",
            "aliases": [
                "Actinium",
                "Aqua Blizzard",
                "Armageddon",
                "Blue Otso",
                "BlueAlpha",
                "Callisto",
                "DEV-0157",
                "Iron Tilden",
                "Operation STEADY#URSA",
                "Primitive Bear",
                "SectorC08",
                "Shuckworm",
                "Trident Ursa",
                "UAC-0010",
                "Winterflounder"
            ],
            "source_name": "ETDA:Gamaredon Group",
            "tools": [
                "Aversome infector",
                "BoneSpy",
                "DessertDown",
                "DilongTrash",
                "DinoTrain",
                "EvilGnome",
                "FRAUDROP",
                "Gamaredon",
                "GammaDrop",
                "GammaLoad",
                "GammaSteel",
                "Gussdoor",
                "ObfuBerry",
                "ObfuMerry",
                "PlainGnome",
                "PowerPunch",
                "Pteranodon",
                "Pterodo",
                "QuietSieve",
                "Remote Manipulator System",
                "Resetter",
                "RuRAT",
                "SUBTLE-PAWS",
                "UltraVNC"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "236a8303-bf12-4787-b6d0-549b44271a19",
            "created_at": "2024-06-04T02:03:07.966137Z",
            "updated_at": "2025-03-27T02:05:17.410356Z",
            "deleted_at": null,
            "main_name": "IRON TILDEN",
            "aliases": [
                "Aqua Blizzard ",
                "Armageddon",
                "Blue Otso ",
                "BlueAlpha ",
                "Dancing Salome ",
                "Gamaredon",
                "Gamaredon Group",
                "Hive0051 ",
                "Primitive Bear ",
                "Shuckworm ",
                "Trident Ursa ",
                "UAC-0010 ",
                "UNC530 ",
                "WinterFlounder ",
                "ACTINIUM "
            ],
            "source_name": "Secureworks:IRON TILDEN",
            "tools": [
                "Pterodo"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1675303661,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1675237937,
    "ts_modification_date": 1675237937,
    "files": {
        "pdf": "https://archive.orkl.eu/e886c3657a755386bbd85e13c5733580e487da1b.pdf",
        "text": "https://archive.orkl.eu/e886c3657a755386bbd85e13c5733580e487da1b.txt",
        "img": "https://archive.orkl.eu/e886c3657a755386bbd85e13c5733580e487da1b.jpg"
    }
}