{
    "id": "abca7142-6475-4584-a143-6c5213e70551",
    "created_at": "2022-10-25T16:48:24.736019Z",
    "updated_at": "2025-03-27T02:14:02.884555Z",
    "deleted_at": null,
    "sha1_hash": "b2470335bf38bddcffac494b053edf80751d74d9",
    "title": "",
    "authors": "",
    "file_creation_date": "2021-03-12T03:26:39Z",
    "file_modification_date": "2021-03-12T03:26:39Z",
    "file_size": 2038534,
    "plain_text": "# New Linux Backdoor RedXOR Likely Operated by Chinese Nation-State Actor\n\n**[intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor](https://www.intezer.com/blog/malware-analysis/new-linux-backdoor-redxor-likely-operated-by-chinese-nation-state-actor/)**\n\nMarch 10, 2021\n\n[Written by Avigayil Mechtinger and Joakim Kennedy - 10 March 2021](https://www.intezer.com/author/aviygayil/)\n\n[Subscribe to Our Blog](javascript:void(0))\nJoin our free community\n\n[Get started](https://www.intezer.com/get-started/)\n\nWe discovered a new sophisticated backdoor targeting Linux endpoints and\nservers\n\nBased on Tactics, Techniques, and Procedures (TTPs) the backdoor is believed to\nbe developed by Chinese nation-state actors\n\nThe backdoor masquerades itself as polkit daemon. We named it RedXOR for its\nnetwork data encoding scheme based on XOR. The malware was compiled on Red\nHat Enterprise Linux\n\nWe provide recommendations for detecting and responding to this threat below\n\nMonitor your cloud environments for RedXOR and other Linux malware. Protect 10\n[servers for free with the Intezer Protect community edition.](https://protect.intezer.com/signup)\n\n## Intro\n\n\n-----\n\n[2020 set a record for new Linux malware families. New malware families targeting](https://www.intezer.com/blog/cloud-security/2020-set-record-for-new-linux-malware-families/)\nLinux systems are being discovered on a regular basis. Backdoors attributed to advanced\nthreat actors are disclosed less frequently.\n\nWe have discovered an undocumented backdoor targeting Linux systems, masqueraded\n[as polkit daemon. We named it RedXOR for its network data encoding scheme based](https://linux.die.net/man/8/polkitd)\non XOR.\n\nBased on victimology, as well as similar components and Tactics, Techniques, and\nProcedures (TTPs), we believe RedXOR was developed by high profile Chinese threat\nactors. The samples, which have low detection rates in VirusTotal, were uploaded from\nIndonesia and Taiwan, countries known to be targeted by Chinese threat actors. The\nsamples are compiled with a legacy GCC compiler on an old release of Red Hat\nEnterprise Linux, hinting that RedXOR is used in targeted attacks against legacy Linux\nsystems.\n\nDuring our investigation we experienced an “on and off” availability of the Command\nand Control (C2) server indicating that the operation is still active.\n\n## Connections to Chinese Threat Actors\n\nWe uncovered key similarities between RedXOR and previously reported malware\nassociated with Winnti umbrella threat group. These malware are PWNLNX backdoor\n[and XOR.DDOS and Groundhog, two botnets attributed to Winnti by BlackBerry.](https://www.blackberry.com/us/en/pdfviewer?file=/content/dam/blackberry-com/asset/enterprise/pdf/direct/report-bb-decade-of-the-rats.pdf)\n\nThe below samples can be used for reference:\n\nSimilarities between the samples:\n\n1. Use of old open-source kernel rootkits: RedXOR uses an open-source LKM\n\n[rootkit called “Adore-ng” to hide its process. Based on a FireEye report Winnti](https://github.com/yaoyumeng/adore-ng)\nused this rootkit in their “ADORE.XSE” Linux backdoor. Embedding open-source\nLKM rootkits is a common Winnti technique. The group has been documented\n[using Azazel and Suterusu.](https://medium.com/chronicle-blog/winnti-more-than-just-windows-and-gates-e4f03436031a)\n\n2. The CheckLKM function name used by RedXOR has also been used in PWNLNX\n\nand XOR.DDOS.\n\n3. Provides the operator with a pseudo-terminal: RedXOR uses Python pty\n\n[shell by importing the python pty library. PWNLNX implements the pty shell](https://docs.python.org/3/library/pty.html)\nfunction in c.\n\n\n-----\n\n_Figure 1: Python pty shell used in RedXOR_\n\n4. Encoding network with XOR: The backdoor encodes its network data with a\n\nscheme based on XOR. Encoding network data with XOR has been used in\nprevious Winnti malware including PWNLNX.\n\n5. Persistence service name: As part of its persistence methods, RedXOR\n\nattempts to create a service under rc.d. The developer added “S99” before the\nname of the service to lower its priority and make it run last on system initiation.\nThis technique was used in XOR.DDOS and Groundhog samples where the\nmalware developer added “S90” to the service name.\n\n6. Main functions flow: PWNLX and RedXOR have a main function which is in\n\ncharge of initialization. In both backdoors, the main function calls another\nfunction which is in charge of the main logic. The main logic function names are\n_main_process in RedXOR and MainThread in PWLNX. Both main functions_\ndaemonize the process to detach from the terminal and run in the background.\n\n\n-----\n\n7. XML for file listing: RedXOR’s directory function and PWNLNX’s getfiles\n\nfunction are both in charge of directory listing. Their code flow implementation is\ndifferent, however, as both malware send the directory listing as an XML file to the\nC2 server. Figure 2 shows the XML structure used in PWNLNX and RedXOR. The\nfile’s data used in both functions are: path, name, type, user, permission, size,\ntime.\n\n_Figure 2: The XML structure used by PWNLNX’s getfiles function and RedXOR’s_\n_directory function_\n\n8. Legacy Red Hat compilers: RedXOR and PWNLNX were both compiled with a\n\nRed Hat 4.4.7 compiler. This compiler is the default GCC compiler on RHEL6.\n\n9. Chown similarity: Both PWNLNX and RedXOR change the file’s user and group\n\nowner to a large ID. The same technique has been used by the XOR.DDoS malware\n[as referenced in the analysis by MalwareMustDie.](https://blog.malwaremustdie.org/2014/09/mmd-0028-2014-fuzzy-reversing-new-china.html)\n\n_Figure 3: Similarity between PWNLNX and RedXOR of the UID and GID used_\n_with “lchown” function call_\n\n10. Overall flow and functionalities: The overall code flow, behavior, and\n\ncapabilities of RedXOR are very similar to PWNLNX. Both have file uploading and\ndownloading functionalities together with a running shell. The network tunneling\nfunctionality in both families is called “PortMap”.\n\n11. Unstripped ELF binaries: Malware developers will often tamper with a file’s\n\nsymbols and/or sections, making it harder for researchers to analyze them.\nHowever, RedXOR and various Winnti malware, including PWNLNX and\nXOR.DDOS, are unstripped.\n\n## Technical Analysis\n\nThe samples are both unstripped 64-bit ELF files called po1kitd-update-k. Uploaded\nto VirusTotal from Taiwan and Indonesia, they are low detected at the time of this\nwriting.\n\n\n-----\n\n_Figure 4: 2bd6e2f8c1a97347b1e499e29a1d9b7c in VirusTotal_\n\n## Malware Installation\n\nUpon execution RedXOR forks off a child process allowing the parent process to exit.\nThe purpose is to detach the process from the shell. The new child determines if it has\nbeen executed as the root user or as another user on the system. It does this to create a\nhidden folder, called “.po1kitd.thumb”, inside the user’s home folder which is used to\nstore files related to the malware. The malware creates a hidden file called “.po1kitd2a4D53” inside the folder. The file is locked to the current running process, seen in\nFigure 5, essentially creating a mutex. If another instance of the malware is executed, it\nalso tries to obtain the lock but ultimately fails. Upon this failure the process exits.\n\n\n-----\n\n_Figure 5: The malware creates a “mutex” file locking it to the process ID_\n\nAfter the malware creates the mutex, it installs itself on the infected machine. As shown\nin Figure 6, the malware looks up its current path and moves the binary to the created\nfolder. It hides the file by naming it “.po1kitd-update-k”.\n\n\n-----\n\n_Figure 6: Malware moves the binary to the hidden folder “po1kitd.thumb” created_\n_earlier. It first tries to use the “rename” function provided by libc. If this fails, it_\n_executes an “mv” shell command via the “system” function_\n\nAfter installing the binary to the hidden folder, the malware sets up persistence via “init”\nscripts. The following files are created after executing the malware on boot:\n\n/usr/syno/etc/rc.d/S99po1kitd-update.sh\n/etc/init.d/po1kitd-update\n/etc/rc2.d/S99po1kitd-update\n\nThe malware checks if the rootkit is active by creating a file and removing it. Then, the\nmalware compares the “saved set-user-ID” of the process to the user ID. If they don’t\nmatch, the rootkit is enabled. If they match, it looks to see if the user ID is “10”. If this is\nthe case, the rootkit is enabled. This logic is shown in Figure 7.\n\n\n-----\n\n_Figure 7: Logic used by RedXOR to check if the rootkit is enabled_\n\n[The “CheckLKM” logic is almost identical to the “adore_init” function in the “adore-ng”](https://github.com/yaoyumeng/adore-ng/blob/522c80a2dc043c2d523256472becc88c90d66337/libinvisible.c#L61)\nrootkit. Afore-ng is a Chinese open-source LKM (Loadable Kernel Module) rootkit. This\ntechnique allows the malware to stay under the radar by hiding its processes. The code\nfor the init function is shown in Figure 8.\n\n\n-----\n\n_Figure 8: Client authentication code for the adore-ng rootkit_\n\n## Configuration\n\nThe malware stores the configuration encrypted within the binary. In addition to the\nCommand and control (C2) IP address and port it can also be configured to use a proxy.\nThe configuration includes a password, as can be seen in Figure 9. This password is used\nby the malware to authenticate to the C2 server.\n\n\n-----\n\n_Figure 9: Configuration options for the malware_\n\nThe configuration values are decrypted by the “doXor” function. A pseudo-code\nrepresentation of the function is shown in Figure 10. The decryption logic is a simple\nXOR against a byte key. The byte key is incremented by a constant for each item in the\nbuffer. The only configuration value that is not encrypted is the server port. The port\nvalue is used to derive the key and the adder. The key is derived from bit shifting the\nport value eight steps to the right. The constant uses the port value.\n\n_Figure 10: Decryption logic of the configuration data. The data is XORed against a key_\n_byte that is incremented by a constant for each entry in the buffer_\n\n\n-----\n\n## Communication with the C2\n\nThe malware communicates with the C2 server over a TCP socket. The traffic is made to\nlook like HTTP traffic. Figure 11 shows a pseudo-code representation of the function\nused by the malware to prepare data that is to be sent to the C2 server. First, it fills the\nbuffer with null bytes. The request body is XORed against a key. The malware uses the\nbuffer length as the key. This value is also passed into the function as the “total_length”\nargument.\n\n_Figure 11: Function for preparing data to be sent to the C2 server_\n\nThe same logic is used to decrypt the response body from the C2 server. From the\nresponse, the malware extracts “JSESSIONID”, “Content-Length”, “Total-Length” and\nthe response body. The data is added to a struct with the following layout:\n\n0x0 JSESSIONID as int\n\n0x8 Content-Length as long\n\n0x10 Total-Length as long\n\n0x18 Response body\n\n\n-----\n\nThe content length is the length of the response body but also used as the key. The total\nlength value is used as a constant which is added to the key in each iteration. The\nJSESSIONID value holds the command ID for the job the C2 wants the malware to\nperform.\n\n## Commands\n\nThe C2 server tells the malware to execute different commands via a command code that\nis returned in the “JSESSIONID” cookie. The codes are encoded as decimal integers. A\nfull list of commands supported by the analyzed malware sample are shown in the table\nbelow. They can be grouped into command types. Commands in the 2000 range provide\n“filesystem” interaction, 3000 handle “shell” commands, and 4000 handle network\ntunneling.\n\n**Table 1: List of commands supported by the malware**\n\n\n-----\n\n**Code** **Command**\n\n0000 System information\n\n0008 Update\n\n0009 Uninstall\n\n1000 Ping\n\n1010 Install LKM\n\n2049 List folder\n\n2054 Upload file\n\n2055 Open file\n\n2056 Execute with system\n\n2058 Remove file\n\n2060 Remove folder\n\n2061 Rename\n\n2062 Create new folder\n\n2066 Write content to file\n\n3000 Start shell\n\n3058 Exec shell command\n\n3999 Close tty\n\n4001 Portmap (Proxy)\n\n\n-----\n\n4002 Kill portmap\n\n## System Information\n\nWhen the malware first contacts the C2 server it sends a password encoded in the\nrequest body. The C2 server responds with the command code 0 to collect system\ninformation. The data collected about the system by the malware is listed in the table\nbelow. The data is serialized into a URL query-like string, encrypted and then sent as the\nrequest body.\n\n**Table 2: Data collected by the malware and sent back to the C2 server**\n\n**URL key** **Description** **Comment**\n\nhostip IP Hardcoded to 127.0.0.1\n\nsofttype Hardcoded to “Linux”\n\npscaddr MAC address\n\nhostname Machine name\n\nhosttar Username Possibly “host target”\n\nhostos Distribution Extracted from /etc/issue or /etc/redhat-release\n\nhostcpu Clock speed /proc/cpuinfo\n\nhostmem Amount of memory /proc/meminfo\n\nhostpack Hardcoded to “Linux”\n\nlkmtag Is rootkit enabled\n\nkernel Kernel version Extracted from uname\n\nFigure 12 shows the communication between RedXOR and the C2. The malware sends\nthe password “pd=admin” and C2 responds with “all right” (JSESSIONID=0000). Next,\nthe malware sends the system information and the C2 replies with the ping command\n\n\n-----\n\n(JSESSIONID=1000).\n\n_Figure 12: RedXOR communication with C2_\n\n## Update Functionality\n\nThe malware can be updated by the threat actor. This is performed by sending command\ncode 8 to the malware. When the malware receives this code the following actions are\ntaken:\n\nThe malware opens the mutex file for writing.\nIt sends a request with the command code 8 and an empty request body to the C2\nserver.\nThe response body from the server is written to the mutex file. The response body\nis not encrypted.\nThe lock is released on the mutex file.\nThe malware executes “chmod” to set the execution flag on the file via the libc\nsystem function.\n\n\n-----\n\nThe malware sleeps and tries to obtain the lock on the file again when it wakes up.\nIf it fails, it assumes the update was successful, closes the connection to the C2\nserver and exits.\n\n## Shell Functionality\n\nThe malware has the ability to provide its operator with a “tty” shell. If a shell is\nrequested via the command code 3000, the malware creates a new thread executing\n“/bin/sh”. In the new spawned shell, the malware executes python -c “import\n_pty;pty.spawn(‘/bin/sh’)” to get a pseudo-terminal (pty) interface. Any shell commands_\nsent to the malware with the command code of 3058 are executed in the pty and the\nresponse is returned to the operator.\n\n## Network Tunneling\n\nNetwork tunneling is enabled by sending the command code 4001 to the malware. As\npart of the request, a “configuration” is sent as part of the response body. The\nconfiguration consists of three items separated by a “#” character. The items are: a port\nto bind to, the IP to connect to, and a port to connect to. The malware uses a modified\n[version of the open-source project Rinetd for the tunneling logic. Rinetd is designed to](http://www.rinetd.com/)\nuse a configuration file stored on the machine. To get around this, the malware author\nhas modified the function that parses the configuration in order to directly take the\nrequired values normally found in the configuration file.\n\n## Detection & Response\n\n Detect if a Machine in Your Network Has Been Compromised\n\n[Use a Cloud Workload Protection Platform like Intezer Protect to gain full runtime](https://www.intezer.com/intezer-protect)\nvisibility over the code in your Linux-based systems and get alerted on any malicious or\nunauthorized code or commands.\n\n[Try our free community edition](https://protect.intezer.com/signup)\n\nFigure 13 emphasizes an Intezer Protect alert on a compromised machine. The alert\nprovides additional context about the malicious code including threat classification\n(RedXOR), binary’s path on the disk, process tree, command, and hash.\n\n\n-----\n\n_Figure 13: Intezer Protect alerts on RedXOR_\n\nWe also recommend using the IOCs section below to ensure that the RedXOR process\nand the files it creates do not exist on your system.\n\nIntezer Protect defends all types of compute resources—including VMs, containers and\n[Kubernetes—against the latest Linux threats in runtime. Try our free community edition](https://protect.intezer.com/signup)\n\n## Response\n\nIf you are a victim of this operation, take the following steps:\n\n1. Kill the process and delete all files related to the malware.\n\n2. Make sure your machine is clean and running only trusted code using a Cloud\n\nWorkload Protection Platform like Intezer Protect.\n\n## Wrap Up\n\nLinux systems are under constant attack given that Linux runs on most of the public\n[cloud workload. A survey conducted by Sophos found that 70% of organizations using](https://secure2.sophos.com/en-us/content/state-of-cloud-security.aspx)\nthe public cloud to host data or workloads experienced a security incident in the past\nyear.\n\nAlong with botnets and cryptominers, the Linux threat landscape is also home to\n[sophisticated threats like RedXOR developed by nation-state actors.](https://www.intezer.com/blog/malware-analysis/looking-back-on-the-last-decade-of-linux-apt-attacks/)\n\n[RedXOR samples are indexed in Intezer Analyze so that you can detect any suspicious](https://analyze.intezer.com/families/2eab395c-1d17-4119-b2cc-c92d01fdf285)\nfile that shares code with this malware.\n\n\n-----\n\n_Figure 14: RedXOR sample in Intezer Analyze_\n\n## IoCs\n\n RedXOR\n\n0a76c55fa88d4c134012a5136c09fb938b4be88a382f88bf2804043253b0559f\n\n0423258b94e8a9af58ad63ea493818618de2d8c60cf75ec7980edcaa34dcc919\n\n## Network\n\nupdate[.]cloudjscdn[.]com\n\n158[.]247[.]208[.]230\n\n34[.]92[.]228[].216\n\n## Process name\n\npo1kitd-update-k\n\n## File and directories created on disk\n\n.po1kitd-update-k\n\n.po1kitd.thumb\n\n.po1kitd-2a4D53\n\n.po1kitd-k3i86dfv\n\n.po1kitd-nrkSh7d6\n\n.po1kitd-2sAq14\n\n.2sAq14\n\n\n-----\n\n.2a4D53\n\npo1kitd.ko\n\npo1kitd-update.desktop\n\nS99po1kitd-update.sh\n\n**Avigayil Mechtinger**\nAvigayil is a security researcher at Intezer specializing in malware analysis. Formerly\nAvigayil was a cyber analyst at Check Point.\n\n**Joakim Kennedy**\nDr. Joakim Kennedy is a Security Researcher at Intezer. His job involves analyzing\nmalware and tracking threat actors. He has been a featured speaker at multiple BSides\nand other industry events. Prior to joining Intezer, Joakim managed Anomali's Threat\nResearch Team.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2021/2021.03.10.RedXOR/Linux%20Backdoor%20RedXOR%20Likely%20Operated%20by%20Chinese%20Nation-State.pdf"
    ],
    "report_names": [
        "Linux Backdoor RedXOR Likely Operated by Chinese Nation-State"
    ],
    "threat_actors": [
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "c7d9878a-e691-4c6f-81ae-84fb115a1345",
            "created_at": "2022-10-25T16:07:23.359506Z",
            "updated_at": "2025-03-27T02:02:09.752427Z",
            "deleted_at": null,
            "main_name": "APT 41",
            "aliases": [
                "BrazenBamboo",
                "Bronze Atlas",
                "Double Dragon",
                "Earth Baku",
                "Grayfly",
                "Operation ColunmTK",
                "Operation CuckooBees",
                "Operation ShadowHammer",
                "Red Kelpie",
                "SparklingGoblin",
                "TA415",
                "TG-2633"
            ],
            "source_name": "ETDA:APT 41",
            "tools": [
                "9002 RAT",
                "ADORE.XSEC",
                "ASPXSpy",
                "ASPXTool",
                "AceHash",
                "Agent.dhwf",
                "Agentemis",
                "AndroidControl",
                "AngryRebel",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BLUEBEAM",
                "Barlaiy",
                "BlackCoffee",
                "Bladabindi",
                "BleDoor",
                "CCleaner Backdoor",
                "CHINACHOPPER",
                "COLDJAVA",
                "China Chopper",
                "ChyNode",
                "Cobalt Strike",
                "CobaltStrike",
                "Crackshot",
                "CrossWalk",
                "CurveLast",
                "CurveLoad",
                "DAYJOB",
                "DBoxAgent",
                "DEADEYE",
                "DEADEYE.APPEND",
                "DEADEYE.EMBED",
                "DEPLOYLOG",
                "DIRTCLEANER",
                "DUSTTRAP",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "DodgeBox",
                "DragonEgg",
                "ELFSHELF",
                "EasyNight",
                "Farfli",
                "FunnySwitch",
                "Gh0st RAT",
                "Ghost RAT",
                "HDD Rootkit",
                "HDRoot",
                "HKDOOR",
                "HOMEUNIX",
                "HUI Loader",
                "HidraQ",
                "HighNoon",
                "HighNote",
                "Homux",
                "Hydraq",
                "Jorik",
                "Jumpall",
                "KEYPLUG",
                "Kaba",
                "Korplug",
                "LATELUNCH",
                "LOLBAS",
                "LOLBins",
                "LightSpy",
                "Living off the Land",
                "Lowkey",
                "McRAT",
                "MdmBot",
                "MessageTap",
                "Meterpreter",
                "Mimikatz",
                "MoonBounce",
                "MoonWalk",
                "Motnug",
                "Moudour",
                "Mydoor",
                "NTDSDump",
                "PACMAN",
                "PCRat",
                "PINEGROVE",
                "PNGRAT",
                "POISONPLUG",
                "POISONPLUG.SHADOW",
                "POTROAST",
                "PRIVATELOG",
                "PipeMon",
                "PlugX",
                "PortReuse",
                "ProxIP",
                "ROCKBOOT",
                "RbDoor",
                "RedDelta",
                "RedXOR",
                "RibDoor",
                "Roarur",
                "RouterGod",
                "SAGEHIRE",
                "SPARKLOG",
                "SQLULDR2",
                "STASHLOG",
                "SWEETCANDLE",
                "ScrambleCross",
                "Sensocode",
                "SerialVlogger",
                "ShadowHammer",
                "ShadowPad Winnti",
                "SinoChopper",
                "Skip-2.0",
                "SneakCross",
                "Sogu",
                "Speculoos",
                "Spyder",
                "StealthReacher",
                "StealthVector",
                "TERA",
                "TIDYELF",
                "TIGERPLUG",
                "TOMMYGUN",
                "TVT",
                "Thoper",
                "Voldemort",
                "WIDETONE",
                "WINNKIT",
                "WINTERLOVE",
                "Winnti",
                "WyrmSpy",
                "X-Door",
                "XDOOR",
                "XMRig",
                "XShellGhost",
                "Xamtrav",
                "ZXShell",
                "ZoxPNG",
                "certutil",
                "certutil.exe",
                "cobeacon",
                "gresim",
                "njRAT",
                "pwdump",
                "xDll"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041642,
    "ts_creation_date": 1615519599,
    "ts_modification_date": 1615519599,
    "files": {
        "pdf": "https://archive.orkl.eu/b2470335bf38bddcffac494b053edf80751d74d9.pdf",
        "text": "https://archive.orkl.eu/b2470335bf38bddcffac494b053edf80751d74d9.txt",
        "img": "https://archive.orkl.eu/b2470335bf38bddcffac494b053edf80751d74d9.jpg"
    }
}