{
    "id": "ac6b4b84-e8d8-4484-84e2-b34e7128eeaa",
    "created_at": "2023-01-12T15:07:34.077293Z",
    "updated_at": "2025-03-27T02:16:25.880652Z",
    "deleted_at": null,
    "sha1_hash": "cbe3bcb7233761efea49885d7c1897289a4821fc",
    "title": "2015-02-18 - Babar- espionage software finally found and put under the microscope",
    "authors": "",
    "file_creation_date": "2022-05-27T23:13:18Z",
    "file_modification_date": "2022-05-27T23:13:18Z",
    "file_size": 683660,
    "plain_text": "# Babar: espionage software finally found and put under the microscope\n\n**[gdatasoftware.com/blog/2015/02/24270-babar-espionage-software-finally-found-and-put-under-the-microscope](https://www.gdatasoftware.com/blog/2015/02/24270-babar-espionage-software-finally-found-and-put-under-the-microscope)**\n\nAlmost a year after Operation SNOWGLOBE was publicly mentioned for the first time by the\nfamous French newspaper Le Monde, security experts have now laid hands on malware samples\nthat match the descriptions made by the Communication Security Establishment Canada (CSEC).\nThe following analysis is the first report about the espionage malware dubbed Babar, which the\nwhole computer security community searched for. After the disclosure about EvilBunny [1], Babar\nis now a second component identified to be related to Operation SNOWGLOBE and is believed to\nbe coded by the same developers. Babar’s feature set includes keystroke logging, clipboard\nlogging and, most interesting, the possibility to log audio conversations – the elephant has big\nears!\n\n## Background\n\nThe revelation about the existence of yet another potentially nation-state driven spyware occurred\n[in March 2014 when Le Monde first published information about top secret slides originating from](http://www.lemonde.fr/international/article/2014/03/21/quand-les-canadiens-partent-en-chasse-de-babar_4387233_3210.html)\n2011 and part of their content . But the slides Le Monde published revealed only a small part of\nthe picture – several slides were cut out, some information was redacted. Germany’s Der Spiegel\nre-published the slide set with far less deletions recently, in January 2015, and therefore gave a\ndeeper insight about what CSEC actually says they have tracked down.\n\nThe newly published documents reveal: the so called operation SNOWGLOBE, was discovered in\n2009 (slide 9) and consists of three different “implants”, two were dubbed snowballs and one\n“more sophisticated implant, discovered in mid-2010” is tagged as snowman (slide 7). According\nto slide 22, “CSEC assesses, with moderate certainty, SNOWGLOBE to be a state-sponsored\nCNO [Cyber Network Operation] effort, put forth by a French intelligence agency.” The information\ngiven dates back to 2011 and nothing else has been published since. Now that specific Babar\nsamples have been identified and analyzed, there might be new information, also with regards to\nsimilarities or differences between the two Remote Administration Tools (RATs) EvilBunny and\nBabar.\n\nWe’d like to express special thanks to Marion Marschalek, Joan Calvet and the CIRCL Luxemburg\nteam for their contributions for this report! We recommend reading Marion’s report “Shooting\nElephants”, a complementary piece of work regarding the Babar malware.\n\n## The samples\n\nEvilBunny-Samples (SHA256)\n\nc6a182f410b4cda0665cd792f00177c56338018fbc31bb34e41b72f8195c20cc\n\n7d1e5c4afb1682087d86e793b3fc5a8371dc7c28e27e7196e3b258934f6bafb5\n\n\n-----\n\n7bfc135194d3e5b85cbe46ed1c6f5e21dbe8f62c0a3ef56245b2d6500fc3a618\nbe14d781b85125a6074724964622ab05f89f41e6bacbda398bc7709d1d98a2ef\n\nBabar-Samples (SHA256, Dropper and Payload)\nc72a055b677cd9e5e2b2dcbba520425d023d906e6ee609b79c643d9034938ebf: Dropper\n82e6f9c10c7ba737f8c79deae4132b9ff82090ccd220eb3d3739365b5276c3c8: Dropper\n\naa73634ca325022dd6daff2df30484ec9031939044cf4c2a004cbdb66108281d: Payload\n(perf_585.dll)\n57437a675cae8e71ac33cd2e001ca7ef1b206b028f3c810e884223a0369d2f8a: Payload:\n(dump21cb.dll)\n\nG DATA’s security solutions detect all analyzed samples.\n\n## The malware names: are the coders cartoonists?\n\nLooking at the compilation path stored in the binary, we can identify the internal name of the\nprojects:\n\nC:\\Users\\user\\Desktop\\bunny 2.3.2\\Release\\Transporter2.pdb\n\nC:\\Documents and Settings\\admin\\Desktop\\Babar64\\Babar64\\obj\\DllWrapper\nRelease\\Release.pdb\n\nFurthermore, a command and control server of an EvilBunny sample also mentioned the sample\nproject name: hxxp://1.9.32.11/bunny/test.php?rec=nvista.\n\n## Identifying the malware described in CSEC slides\n\nThe following indicators underline the assumption that the EvilBunny and Babar samples analyzed\nmatch the ones described in the leaked Snowden documents, in the order of the slides.\nNevertheless, some differences are listed at the end:\n\n### Match: Typographical error – slide 8\n\nCSEC mentioned a typo, committed by the malware authors. In the user agent, instead of using\nthe string MSIE (MicroSoft Internet Explorer), the malware uses the string MSI. The malware does\nnot use the browser to communicate; the request was inserted manually by the developer who\nmade a mistake. We found this exact same mistake in EvilBunny and Babar samples:\n```\npaul@gdata:~/babar$ strings -a perf_585.dll | grep \"MSI \"\nUser-Agent: Mozilla/4.0 (compatible; MSI 6.0; Windows NT 5.1; .NET CLR 1.0.3705; .NET CLR\n1.1.4322)\nUser-Agent: Mozilla/4.0 (compatible; MSI 6.0; Windows NT 5.1; .NET CLR 1.0.3705; .NET CLR\n1.1.4322)\n\n```\n\n-----\n\nCSEC Operation SNOWGLOBE, slide #8, discovered by Edward Snowden - Click to enlarge\n\n### Match: Internal name: Babar – slide 18\n\nWithin the documents leaked by Snowden, the CSEC mentioned the internal name of the\nmalware: Babar. In the malware samples analyzed the internal name is the same, as mentioned\nbefore.\n\n\n-----\n\nCSEC Operation SNOWGLOBE, slide #18, discovered by Edward Snowden - Click to enlarge\n\n### Match: Locale option – slide 19\n\nThe CSEC mentioned the locale option “fr_FR” during the spear-phishing attack. In the EvilBunny\nsamples, during the HTTP queries to the command and control servers the Accept-Language\nparameter is set to “fr”.\n\n\n-----\n\nCSEC Operation SNOWGLOBE, slide #19, discovered by Edward Snowden - Click to enlarge\n\n### Match: English language – slide 19\n\nAlso on the slide 19, the CSEC mentioned that the command and control interface is in English\nbut the choice of words is not typical for a native English speaker. We found English mistakes in\nEvilBunny and Babar samples, such as this example from Babar:\n\n!!!EXTRACT ERROR!!!File Does Not Exists-->[%s]\n\n### Difference: Infrastructure – slide 10\n\nThe CSEC documents reveal that scripts called “outbase.php“ and “register.php” were found on\ninfrastructure domains, “in a directory under root domain”. The scripts found in the samples\nanalyzed were named “index.php” in a deeper directory.\n\n### Difference: Developer username: titi – slide 18\n\nThe developer’s username in the Babar samples analyzed is admin instead of titi as mentioned in\nthe Snowden documents. The Bunny samples reveal user as the developer’s username.\n\n## Comparing EvilBunny to Babar\n\n\n-----\n\nWe believe that both malware species belong to the mentioned operation SNOWGLOBE and the\nfollowing chapter will describe similarities and differences:\n\n### Typing error\n\nAs mentioned previously, a typo has been found within EvilBunny and Babar, within the user\nagent string. This mistake can be the result of a copy/paste error or due to the use of the same\nlibrary inside the two samples.\n\n### Antivirus detection\n\nThe first task for both, EvilBunny and Babar, is to list the installed antivirus software. They use the\nexact same technique to fulfill this task: WMI, the Windows Management Instrumentation.\n\nWMI is an interface provided by Microsoft to get information about and notifications from the\nsystem. The users can use WMI by using VBScript, PowerShell or C++ language. To detect the\nname of the antivirus solution installed and registered, the malware opens one of the following\nWindows Security Center WMI providers:\n\n**ROOT\\SecurityCenter (for operating systems before Windows Vista)**\n**ROOT\\SecurityCenter2 (Windows Vista and newer OS)**\n\nThe analyzed malware includes the two providers and the two versions of operating system (preVista and post-Vista). Microsoft provides an SQL-like system to perform queries using the WMI.\nThis system is called WMI Query Language (short WQL). The malware performs the following\nquery:\n```\nSELECT * FROM AntiVirusProduct\n\n```\n**Here is the description of the antivirus object:**\n```\nclass AntiVirusProduct\n{\nstring companyName; // Vendor name\nstring displayNam; // Application name\nstring instanceGuid; // Unique identifier\nboolean onAccessScanningEnabled; // Real-time protection\nboolean productUptoDate; // Definition state\nstring versionNumber; // Application version\n}\n\n```\nThe malware checks the following entries: productUpToDate, versionNumber and the\n**displayName. The malware checks whether the SHA-256 of the first word of the displayName is**\nequal to a predefined list. Looking at several samples, the content of this list varies. Here is one\nexample of a list [Updated on February 19, 2015):\n\nab6ed3db3c243254294cfe431a8aeada28e5741dfa3b9c8aeb54291fddc4f8c3 (AhnLab)\n\nb3fe0e3a3e3befa152c4237b0f3a96ffaa44a2d7e1aa6d379d3a1ab4659e1676 (AntiVir)\n\n\n-----\n\nc0ffcaf63c2ca2974f44138b0956fed657073fde0adeb0b1c940b5c45e8a5cab (avast!)\n\n249a90b07ed10bd0cd2bcc9819827267428261fb08e181f43e90807c63c65e80 (AVG)\n\n4b650e5c4785025dee7bd65e3c5c527356717d7a1c0bfef5b4ada8ca1e9cbe17 (CA)\n\nc8e8248940830e9f1dc600c189640e91c40f95caae4f3187fb04427980cdc479 (DoctorWeb)\n\n97010f4c9ec0c01b8048dbad5f0c382a9269e22080ccd6f3f1d07e4909fac1a5 (F-PROT)\n\naa0ad154f949a518cc2be8a588d5e3523488c20c23b8eb8fafb7d8c34fa87145 (F-Secure)\n\n333e0a1e27815d0ceee55c473fe3dc93d56c63e3bee2b3b4aee8eed6d70191a3 (G)\n\nd4634c9d57c06983e1d2d6dc92e74e6103c132a97f8dc3e7158fa89420647ec3 (InternetSecurity)\n\n977781971f7998ff4dbe47f3e1d679f1941b3237d0ba0fdca90178a15aec1f52 (Jiangmin)\n\nf1761a5e3856dceb3e14d4555af92d3d1ac47604841f69fc72328b53ab45ca56 (Kaspersky)\n\na48be88bed64eff941be52590c07045b896bc3e87e7cf62985651bbc8484f945 (McAfee)\n\n2bc42b202817bdab7d49506d291e3d9624ae0069087a8949c8fcb583c73772b1 (Norton)\n\n0d21bd52022ca7f7e97109d28d327da1e68cc0bedd9713b2dc2b49d3aa104392 (Online)\n\n0d21bd52022ca7f7e97109d28d327da1e68cc0bedd9713b2dc2b49d3aa104392 (Online)\n\nf7d9ea7f3980635237d6ea58048057c33a218f2670e0ff45af5f4f670e9aa6f4 (Panda)\n\n522e5549af01c747329d923110c058b7bb7e112816de64bd7919d7b9194fba5b (Rising)\n\n4db3801a45802041baa44334303e0498c2640cd5dfd6892545487bf7c8c9219f (ThreatFire)\n\n9e217716c4e03eee7a7e44590344d37252b0ae75966a7f8c34531cd7bed1aca7 (Trend)\n\ne1625a7f2f6947ea8e9328e66562a8b255bc4d5721d427f943002bb2b9fc5645 (VirusBuster)\n\n588730213eb6ace35caadcb651217bfbde3f615d94a9cca41a31ee9fa09b186c (ZoneAlarm)\n\nb39be67ae54b99c5b05fa82a9313606c75bfc8b5c64f29c6037a32bf900926dd ()\n\na7f9b61169b52926bb364e557a52c07b34c9fbdcd692f249cd27de5f4169e700 ()\n\n1ba035db418ad6acc8e0c173a49d124f3fcc89d0637496954a70e28ec6983ad7 ()\n\nThe identified hashes correspond to the strings of well-known commercial antivirus products. The\nhash (G) stands for G DATA software solutions. The hashes mentioned before the empty brackets\nhave not yet been identified.\n\n## API obfuscation\n\n### Both cases:\n\n\n-----\n\nThe two malicious programs both use API obfuscation in order to make the analysis more\ncomplicated. The purpose is to execute a Microsoft Windows API without naming it. On our cases,\nthe approach is the same in both malware families: when the malware needs to execute an\nexternal function (from a dynamic library), it uses a kind of “hash” instead of using the function\nname. The “hash” is provided to an internal function, this function establishes the relation between\nthe “hash” and the address of the function. At the end, the address is executed. The only\ndifference between EvilBunny and Babar, when it comes to API obfuscation, is the internal\nfunction used to establish the relation. An example below (where the “hash” is 0x46318AD1):\n\n### EvilBunny case:\n\nOn EvilBunny samples, the malware realized a kind of Cyclic Redundancy Check (short CRC) of\nevery exported function name of the desired dynamic library. If the “CRC” of a function’s name\nmatches the value of the “hash”, the malware knows that it is the function to be executed. Here is\nthe “CRC” loop:\n\n\n-----\n\n**This loop can be represented by the following python script:**\n```\n#!/usr/bin/python\nCRC = 0\nfunction = “CreateProcessW”\nfor i in list(function)\nkey = rol32 (CRC, 7)\nCRC = ord(i)^key\nprint function+”: 0x%08x” % (CRC)\n\n```\n**Here is the output of the script:**\n```\nCreateProcessW: 0x46318ad1\n\n```\nThe hexadecimal value is the same as the value in our screenshot, so the executed function will\nbe CreateProcessW(). With this script, we can easily create a correlation table to generate the\nhexadecimal value for each and every function available in the library kernel32.dll:\n\n\n-----\n\n```\npaul@gdata: /$ cat API.py\n#!/usr/bin/python\nimport sys\nimport pefile\ndef rol32 (num, count): num1 = (num << count) & 0xFFFFFFFF num2 = (num >> (0x20 - count))\n& 0xFFFFFFFF return num1 | num2\npe = pefile.PE(sys.argv[1])\nfor exp in pe.DIRECTORY_ENTRY_EXPORT.symbols: cpt = 0 for i in list(exp.name): key =\nrol32(cpt,7) cpt=ord(i)^key print exp.name+\": 0x%08x\" % (cpt)\npaul@gdata:~/babar$ ./API.py kernel32.dll\nActivateActCtx: 0x5147f60f\nAddAtomA: 0x1e1865e5\nAddAtomW: 0x1e1865f3\nAddConsoleAliasA: 0x06dc97e5\nAddConsoleAliasW: 0x06dc97f3\nAddLocalAlternateComputerNameA: 0xedbafee8\nAddLocalAlternateComputerNameW: 0xedbafefe\n...\n\n### Babar case:\n\n```\nThe Babar malware does not perform a kind of “CRC” regarding the function name. The algorithm\nis more complex. However, the philosophy is the same: for each exported function name, the\nmalware applies an algorithm in order to verify if the calculated “hash” matches the wanted “hash”.\n\nTo create the correlation table in this case, our approach was to instrument the debugger using\nPython. On our samples, the instruction at 0x10040930 (CMP ECX, [EAX]) is really interesting\nbecause ECXcontains the desired “hash”, [EAX] contains the calculated “hash” of the current\nexported function and finally [EBX] contains the current exported function name. So we can create\na short Immunity Debugger Python script to calculate these values for each exported function\nname and create the table:\n```\nfrom immlib import *\nfrom immutils import *\ndef main(args): imm = Debugger() imm.setBreakpoint(0x10040930) imm.run() while True:\nregs=imm.getRegs() fct = imm.readString(regs['EBX']) value = imm.readMemory(regs['EAX'],\n4)[::-1] imm.log(fct+\":\"+value.encode('hex')) imm.run()\n\n```\n**And the output:**\n```\nAcquireSRWLockExclusive:333bab35\nAcquireSRWLockShared:567cb604\nActivateActCtx:4e17a661\nAddAtomA:3b9ce8fb\nAddAtomW:236e73a4\nAddConsoleAliasA:42b5c543\nAddConsoleAliasW:e566de2b\nAddDllDirectory:94debd22\nAddIntegrityLabelToBoundaryDescriptor:b4107a12\nAddLocalAlternateComputerNameA:1f6ed911\n…\n\n```\nIf you are interested in the complete correlation tables, please contact us at\nintelligence@gdata.de\n\n\n-----\n\n## Babar configuration extraction and analysis\n\nThe configuration of the malware is encrypted with the AES algorithm. The key and the offset\nwhere the configuration is stored are located at the end of the Babar payloads (the .dll files). Once\ndecrypted, we can identify the following content, which reveals information about command and\ncontrol servers as well as certain process names and file name extensions the malware will keep\nan eye on:\n\n**Sample: 5da5079754d975d5b04342abf9d60bd0bae181a0**\n```\nexcel.exe, winword.exe, powerpnt.exe, visio.exe, acrord32.exe, notepad.exe, wordpad.exe\ntxt, rtf, xls, xlsx, ppt, ppts, doc, docx, pdf, vsd\nskype.exe, msnmsgr.exe, oovoo.exe, nimbuzz.exe, googletalk.exe, yahoomessenger.exe, xlite.exe\nhxxp://www.alexpetro.com/images/training/courses/bb212/index.php\nhxxp://www.etehadyie.ir/images/public/bb212/index.php\n\n```\n**Sample: efbe18eb8a66e4b6289a5c53f22254f76e3a29db:**\n```\nexcel.exe, winword.exe, powerpnt.exe, visio.exe, acrord32.exe, notepad.exe, wordpad.exe\ntxt, rtf, xls, xlsx, ppt, ppts, doc, docx, pdf, vsd\nskype.exe, msnmsgr.exe, oovoo.exe, nimbuzz.exe, googletalk.exe, yahoomessenger.exe, xlite.exe\nhxxp://www.horizons-tourisme.com/_vti_bin/_vti_msc/bb/index.php\nhxxp://www.gezelimmi.com/wp-includes/misc/bb/index.php\n\n```\nThe first line contains document viewer processes, the second line contains media document\nextensions and the third line contains instant messaging processes. The use of this information\nwill be described below in the chapter Babar’s spy features.\n\nFinally, the last line contains the URLs of the command and control servers. The following\ninformation is available at the time of writing this article:\n\nwww.alexpetro.com\n\nWebsite topic: Service company for drilling equipment (oil and gas), located in Egypt\nDomain registrant's origin: Website hosted in: Texas, USA\n\nwww.etehadyie.ir (not available during investigation)\n\nWebsite topic: Home appliances (according to Google translator)\nDomain registrant's origin: Tehran, Iran\nWebsite hosted in: \nwww.horizons-tourisme.com\n\nWebsite topic: travel agency, located in Algeria\nDomain registrant's origin: Algiers, Algeria\nWebsite hosted in: Ohio, USA\n\n\n-----\n\nwww.gezelimmi.com (not available during investigation)\n\nWebsite topic: Turkish website to promote tourism in Turkey\nDomain registrant's origin: Merkez, Turkey\nWebsite hosted in: New York, USA\n\nWe do not know whether the command and controls were compromised legitimate websites,\nduring the campaign, or servers dedicated to the attacks. Slide 23 mentions that C&C nodes were\nfound “worldwide (including Canada, US, UK)”.\n\n## Babar’s espionage features\n\nThe RAT has common features such as code execution, code injection into running processes, file\nstealing (the extensions listed in the configuration file come into play at this pint). However, Babar\nhas additional features such as being a key logger in order to record key strokes and it also has\nthe possibility to steal the clipboard content (frequently used to store passwords in case the user\nuses password storage application such as KeePass). The data is stored in the file\n**%COMMON_APPDATA%\\MSI\\update.msi. Here are two screenshots of the key logger API:**\n\n\n-----\n\nAnd the following is a snippet of the clipboard stealer API:\n\nBabar is also able to take screenshots of the infected desktop (thanks to the GdiPlus API). Here is\na snippet of the GdiPlus API:\n\n\n-----\n\n-----\n\nAnd finally, as every elephant, Babar has big ears and the malware is able to listen to\nconversations and log them by using the dsound and winmm libraries. We assume that the\nprocess list of the instant messaging services, seen in the configuration, is used to identify when\nthe malware should enable this feature. The following screenshot shows the use of the wave* API\nto record the audio flow:\n\nLooking at the feature list, we can identify that this malware is meant to be a pure espionage tool.\nIt is, regarding the current information, not harming the computer system itself but represents an\nelaborate instrument to function as wiretap and to exfiltrated data from computers infected. This\nleads to the assumption that the number of infected machines is rather small and chosen.\n\n\n-----\n\n## Conclusion\n\nAfter having more information about the malware attributed to operation SNOWGLOBE, taken\nfrom the re-published slides, the G DATA experts are sure to have found samples which match\nthe descriptions. EvilBunny and Babar might correspond to two of the three “implants” mentioned\nas Snowballs and Snowman.\n\nThe G DATA SecurityLabs are convinced that the number of similarities identified between\nEvilBunny and Babar show that both malware families originate from the same developers. The\nevil cartoon malware families share part of their code. The analyses suggest that the samples\nidentified are newer versions of the malware CSEC described in the slides. This may be one\nreason for the absence of certain indications CSEC has mentioned.\n\nNevertheless, unfortunately, the experts cannot contribute further information with regards to the\nmalware’s origin nor the list of victims. The information CSEC provided was partly supported by\nindications found in the code, but no clue has been identified. The assertion of a “French\nintelligence community” being responsible remains unchanged. Attributing malware to any origin,\nespecially when dealing with specialized and professional malware, has always been difficult.\n\n\n-----\n\nWith a possible nation-state background, this espionage software would not be spread as mass\nmalware but activated against specific and chosen targets only. The main functions of this\nmalware are data exfiltration and wiretapping.\n\nEven if many questions still remain unanswered, the analyses present mark an important step\ntowards the validation of the slides leaked.\n\n### Links to the articel:\n\n[Marion Marschalek's report about EvilBunny](http://0x1338.blogspot.co.at/2014/11/hunting-bunnies.html)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-02-18 - Babar- espionage software finally found and put under the microscope.pdf"
    ],
    "report_names": [
        "2015-02-18 - Babar- espionage software finally found and put under the microscope.pdf"
    ],
    "threat_actors": [
        {
            "id": "e09a7338-fb16-4e39-b579-c3bfc3140c47",
            "created_at": "2022-10-25T16:07:24.207294Z",
            "updated_at": "2025-03-27T02:02:10.140203Z",
            "deleted_at": null,
            "main_name": "Snowglobe",
            "aliases": [
                "ATK 8",
                "Animal Farm",
                "SIG20",
                "Snowglobe"
            ],
            "source_name": "ETDA:Snowglobe",
            "tools": [
                "Babar",
                "Casper",
                "Chocopop",
                "Dino",
                "EvilBunny",
                "Nbot",
                "TFC",
                "Tafacalou"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "08c8f238-1df5-4e75-b4d8-276ebead502d",
            "created_at": "2023-01-06T13:46:39.344081Z",
            "updated_at": "2025-03-27T02:00:03.056208Z",
            "deleted_at": null,
            "main_name": "Copy-Paste",
            "aliases": [],
            "source_name": "MISPGALAXY:Copy-Paste",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "548a4081-aa8f-4e2a-bcb3-0c9dfa61944f",
            "created_at": "2023-01-06T13:46:38.443779Z",
            "updated_at": "2025-03-27T02:00:02.835042Z",
            "deleted_at": null,
            "main_name": "SNOWGLOBE",
            "aliases": [
                "Snowglobe",
                "ATK8",
                "Animal Farm"
            ],
            "source_name": "MISPGALAXY:SNOWGLOBE",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536054,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653693198,
    "ts_modification_date": 1653693198,
    "files": {
        "pdf": "https://archive.orkl.eu/cbe3bcb7233761efea49885d7c1897289a4821fc.pdf",
        "text": "https://archive.orkl.eu/cbe3bcb7233761efea49885d7c1897289a4821fc.txt",
        "img": "https://archive.orkl.eu/cbe3bcb7233761efea49885d7c1897289a4821fc.jpg"
    }
}