{
    "id": "ac792493-db01-4215-9743-0d3715a624c6",
    "created_at": "2023-01-12T15:09:01.011047Z",
    "updated_at": "2025-03-27T02:05:39.349022Z",
    "deleted_at": null,
    "sha1_hash": "bfe6cd3dcde0d85faf0262819dbf5f1eaace6cc0",
    "title": "2015-03-07 - Slave, Banatrix and ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:32:03Z",
    "file_modification_date": "2022-05-28T19:32:03Z",
    "file_size": 135780,
    "plain_text": "# Slave, Banatrix and ransomware | CERT Polska\n\n**cert.pl/en/news/single/slave-banatrix-and-ransomware/**\n\nIn March 2015, S21sec published their analysis of the new ebanking trojan horse targetting Polish users. They named it\n“Slave”, because such a string was part of a path to one of the\nshared libraries. We think (in part thanks to the kernelmode.info\nthread) that Slave was made by the same group of authors that\n[are responsible for previously described Banatrix and a](http://www.cert.pl/news/9565)\n[ransomware/Android malware campaign. This means that those](http://www.cert.pl/news/10180)\nauthors are most certainly fluent in Polish.\n\n## History of Polish banking trojan malware\n\nThe first Polish malware that we discovered was VBKlip. Its purpose was to replace a bank\naccount number that was copied to Windows clipboard. Then, because this method was\nwidely publicized in Poland, another author started to make knock-offs. This malware, written\nin a few lines of .NET or C++ code, was even simpler. All of those simpler versions were\nmade by the same person, known from earlier phishing attempts.\n\nNext, Banatrix came on the scene. It was a really advanced trojan horse, which was able to\nexecute any code on the infected machine, but was mainly used to steal password data from\nthe Firefox web browser and replace the bank account number, when user tried to paste it on\nthe e-banking website. The Banatrix infrastructure used Tor network and Bitcoins to make\nthe botnet owners more anonymous.\n\n\n-----\n\nThe\n\nmost recent Polish malware is Slave – e-banking trojan horse discovered by S21sec. We\nhave multiple reasons to believe that the same group is responsible for creating Slave and\nBanatrix. Slave is based on webinjects – HTML or JavaScript snippets added to the website,\nwhen a user tries to display it in the browser. This code is responsible for e.g. extracting login\ninformation or performing a social engineering attack.\n\n## Technical details\n\nSlave is dropped by another malware called “Andromeda”. This malware is only used as a\nmechanism for dropping the actual payload. Andromeda is sent using e-mail messages that\nsuggest that the attachment is an outstanding invoice. Andromeda and Slave are two very\ndifferent strains of malware and do not communicate with each other. The attacker however\ncreated a system in which only a machine infected with Andromeda first may download\nSlave malware. This most probably is a countermeasure to make the analysis more difficult –\nyou cannot just download Slave using URL extracted from Andromeda.\n\nSlave for the most part is no different than other trojan horses based on webinjects.\nHowever, there are some features that make it stand out. First, it only targets Polish banks\nand runs only after a specified date – 1st of April, 2015. Slave injects its code to Internet\nExplorer, Firefox and Chrome. However, Opera is currently unsupported. Content Security\nPolicy headers are also stripped from server responses, so that the violation report will not\nbe sent back to the bank.\n\nAnother interesting feature is the Bitcoin address replacement. Whenever there is a Bitcoin\naddress in the clipboard, it is replaced with another one, hardcoded in the sample. Below is\nthe code that does the switch.\n\n\n-----\n\n[The replaced address, 1NoKsR7jcTTufgrvh6zyvyJmL2z73aQXQP does not hold any assets](https://blockchain.info/address/1NoKsR7jcTTufgrvh6zyvyJmL2z73aQXQP)\nat the moment.\nMalware configuration is downloaded from a URI\n\n<span class=\"text\">/info.php?key=[value]</span>\n\n, where\n\n<span class=\"text\">value</span>\n\n\n-----\n\nis a part of a Bitcoin address, used for an unknown purpose. This configuration specified\nURLs to which specific external JavaScript code should be added. These scripts are used to\nexfiltrate login info and perform different kinds of social engineering attacks.\n\n[We also have information that the recently described Android/Windows malware campaign is](http://www.cert.pl/news/10180)\nalso authored by the same group. This only shows that the attackers are very versatile and\nuse several different methods to steal money from users.\n\n## Summary\n\nIt appears Polish malware authors are constantly working and upgrading their malware.\nDifferent groups present different technical abilities and different modi operandi. There is only\na couple of different malware authors, and we are far away from having a cybercrime\n“malware writing” business in our country, but even so, we should take all of these kinds of\nthreats seriously.\n\n## Sample hashes and VirusTotal scores\n\nb92710a9a65e62accb5e6772704b20606d7f00a4f5e8d44758e0868a9cdd43af      22 / 56\n\nffc119b8eaff94b62810b82ab456e1e3f71b86d72e57cb45781878f5199fccbc      20 / 56\n\n35c4b500b4c94f3dae0ce3604759787384ef7de9708add2c8de86dcf7e4b0322      38 / 55\n\nca7947dea43c200ce0c521b54baf60b973990af421b4cbafaba7eaddadb496f3      23 / 56\n\n751866cb3f85e9c991187ff415010faba84903072cef2bf29bb24596fd1e6eca      35 / 55\n\n**P.S. Attribution is hard**\n\nCode attribution is a really hard task. Most of the authors – contradictory to what TV series\nand movies lead us to believe – do not “sign” their code in any way. However, some of the\nsamples may contain some telltale signs – whether it is a specific object name or path to a\nlocal file. Based on this, researchers try to connect two different malware families and imply\nthat they were made by the same author. However, this link is usually really limited. After all,\nmalware authors can use this data to manipulate the researcher into thinking that they know\nthe attacker. The most famous case of this is the string\n\n<span class=\"text\">Coded by BRIAN KREBS for personal use only. I love my job and my\nwife</span>\n\npresent in some of the Citadel samples. Of course, Brian Krebs, renowned cybersecurity\njournalist, is not the author of Citadel code.\n\nThey are of course other sources providing a link between different malware families. One of\nthem is information obtained from anonymous sources that sometimes disclose particular\nfacts about the malware, which only people close to the author may know. However, this\n\n\n-----\n\ninformation is really hard to verify and must be used with caution. Lastly, the other popular\nlink is the usage of the same infrastructure – whether it is the same hosting or even the same\nserver.\n\nAll of these information are only small clues, which have to be combined in order to create a\nsolid link between two malware strains. However, almost always we are not sure that there is\nin fact a connection. On the other hand, we cannot always disclose all of the information that\nwe have. This creates an environment that is prone to the manipulation and may be used for\na PR gain. That is why all of this kind of revelations, even the ones described here, have to\nbe taken with a grain of salt.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-03-07 - Slave, Banatrix and ransomware.pdf"
    ],
    "report_names": [
        "2015-03-07 - Slave, Banatrix and ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536141,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653766323,
    "ts_modification_date": 1653766323,
    "files": {
        "pdf": "https://archive.orkl.eu/bfe6cd3dcde0d85faf0262819dbf5f1eaace6cc0.pdf",
        "text": "https://archive.orkl.eu/bfe6cd3dcde0d85faf0262819dbf5f1eaace6cc0.txt",
        "img": "https://archive.orkl.eu/bfe6cd3dcde0d85faf0262819dbf5f1eaace6cc0.jpg"
    }
}