{
    "id": "ac95ab24-2793-411e-8c50-1f2a9257a810",
    "created_at": "2023-01-12T15:07:56.607435Z",
    "updated_at": "2025-03-27T02:13:22.366681Z",
    "deleted_at": null,
    "sha1_hash": "61c7415d8ad43d07dc789446ad1836b1566df18d",
    "title": "2018-03-09 - From Russia(-) with Code",
    "authors": "",
    "file_creation_date": "2022-05-28T21:56:28Z",
    "file_modification_date": "2022-05-28T21:56:28Z",
    "file_size": 2243828,
    "plain_text": "# From Russia(?) with Code\n\n**lastline.com/labsblog/attribution-from-russia-with-code/**\n\nMarch 9, 2018\n\nPosted by [Labs Team ON MAR 9, 2018](https://www.lastline.com/author/labs-team/)\nThe Olympic Destroyer cyberattack is a very recent and notable attack by sophisticated\nthreat actors against a globally renowned 2-week sporting event that takes place once every\nfour years in a different part of the world. Successfully attacking the Winter Olympics requires\nmotivation, planning, resources and time.\n\nCyberattack campaigns are often a reflection of real world tensions and provide insight into\nthe possible suspects in the attack. Much has been written about the perpetrators behind\nOlympic Destroyer emanating from either North Korea or Russia. Both have motivations.\nNorth Korea would like to embarrass its sibling South Korea, the holders of the 23rd Winter\nOlympics. Russia could be seeking revenge for the IOC ban on their team. And Russia has\nprecedence, having previously been blamed for attacks on other sporting organizations, such\nas the intrusion at the World Anti Doping Agency that was targeted via a stolen International\nOlympic Committee account.\n\n[There has been much said about attribution, with accusations of misleading false flags and](https://arstechnica.com/information-technology/2018/02/russia-accused-of-false-flag-attack-on-olympic-opening/)\n[anti-forensics built into the malware. As Talos points out in their report, attribution is hard.](https://blog.talosintelligence.com/2018/02/who-wasnt-responsible-for-olympic.html)\n\nBut attribution is not just hard, it’s often a wilderness of mirrors and, more often than not, a bit\nanticlimactic.\n\n\n-----\n\nThe motivation of our following analysis is not to point the finger of blame about who did the\nattacking, but to utilize our expertise in analyzing malware code and understanding the\nbehaviors it exhibits to highlight the heritage, evolution and commonalities we found in the\ncode of the Olympic Destroyer malware.\n\n## Initial Samples of Code Reuse\n\nBesides analyzing the behavior of a sample, our sandbox performs several levels of code\nanalysis, eventually extracting all code components, regardless if they are run at run-time or\n[not. As we described in a blog post a few years ago, this technique is essential if we are to](https://www.lastline.com/labsblog/awakening-dormant-functionality-in-malware-programs/)\ndetect any dormant functionality that might be present within the sample.\n\nAfter decomposing the code components in normalized basic blocks, the sandbox computes\nsmart code hashes that are stored and indexed in our threat intelligence knowledge base.\nOver the last 3 years we have been collecting code hashes for millions of files, so when we\nwant to hunt for other samples related to the same actor, we are able to query our backend\nfor any other binaries that have been reusing significant amounts of code.\n\nThe rationale being that actors usually build up their code base over time, and reuse it over\nand over again across different campaigns. Code surely might evolve, but some components\nare bound to remain the same. This is the intuition that drove our investigation on Olympic\nDestroyer further. The first results were obviously some variants of the Olympic Destroyer\n[binaries which we have already mentioned in our previous post. However, it quickly got way](https://www.lastline.com/labsblog/olympic-destroyer-south-korea/)\nmore interesting.\n\nA very specific code hash led us through this process:\n**7CE26E95118044757D3C7A97CF9D240A (Lastline customers can use it to query our**\nGlobal Threat Intelligence Network). This rare code hash surprisingly linked\n21ca710ed3bc536bd5394f0bff6d6140809156cf, a payload of the Olympic Destroyer\ncampaign, with some other samples of a remote access trojan, “TVSpy.” Though the actual\ninternal name of the threat is TVRAT, the malware is known and labelled in VirusTotal as\nTrojan.Pavica or Trojan.Mezzo, none of which were previously connected to the original\nOlympic Destroyer campaign.\n\nFigure 1 shows the actual code referenced by the code hash: it is a function used to read a\nbuffer, and subsequently parse PE header from it.\n\n\n-----\n\nFigure 1: The code referenced by the code hash 7CE26E95118044757D3C7A97CF9D240A shared\n\nby both the Olympic Destroyer sample 21ca710ed3bc536bd5394f0bff6d6140809156cf sha1 and\n\nTVSpy sample a61b8258e080857adc2d7da3bd78871f88edec2c.\n\nThis is not where code re-usage ends, as the actual function referencing and invoking the\nfollowing fragment (see Figure 2) also shares almost all of the same logic. This function is\nresponsible for loading PE file from the memory buffer and executing an entry point.\n\n\n-----\n\nFigure 2: Function responsible for loading PE file from memory reused in both Olympic Destroyer\n\nand TV Spy\n\n## A Deeper Dive Based on Unusual Code\n\nWe decided to further investigate this piece of code since loading PE from memory is not all\nthat common. Its origin opened several questions:\n\n\n-----\n\n1. Why is that piece of code the only link between the two samples?\n2. Were there any other samples sharing the same code?\n\nOur first discovery was a Remote Access trojan called TVSpy, mentioned above. This family\nhas been the subject of a few previous research investigations, and a recent Benkow Lab\n[blog post (from November 2017) even reported that the source code was available on github.](https://benkowlab.blogspot.com/2017/11/)\n\nUnfortunately, all links to github are now dead. But that didn’t stop us from finding the actual\nsource code (or at least evidence that it was indeed published at some point). Apparently it\nwas sold for $US500 on an underground Russian forum in 2015. Even though the original\npost and links are gone, a Russian information security forum kept a copy of the source code\npackage alongside a description of the original sale announcement (see Figure 3).\n\n\n-----\n\nFigure 3: TVSpy code as sold in an underground forum (according to researchers from ru-sfera.org)\n\n## Not Enough – The Investigation Continued\n\nAlthough interesting, this connection was eventually not enough to connect Olympic\nDestroyer to Russia or to TVSpy. So we kept digging. Further research finally identified the\ncode in Figures 1 and 2 to be part of an open source project called LoadDLL (see Figure 4)\nand available on codeproject.com (first published back in March 2014).\n\n\n-----\n\nFigure 4: Fragment of LoadDLL source code from LoadDLL project\n\nHowever, a couple things still didn’t add up: why had we only managed to identify samples\nfrom 2017 even if the source code was released in 2014? What about older versions of\nTVSpy? How come our search didn’t return any of those samples? Were Olympic Destroyer\nand TVSpy samples from 2017 sharing more than just the LoadDLL code?\n\nApparently TVSpy went through a few transformations. Samples from 2015 did embed and\nuse the LoadDLL code, but the compiler did some specific optimizations that made the code\nunique (see Figure 5). In particular the compiler optimized out both “flags” (not used in the\nfunction) and “read_proc” (statically link function) from the parameters of LoadDll, but it\ncouldn’t optimize out a “if (read_proc)” check even though it is useless since “read_proc” is\nnot passed as a parameter anymore.\n\n\n-----\n\nFigure 5. Reconstructed source code of LoadDll from TVSpy dated back to 2015\n\nThe “read_proc” function itself is also identical to one from source code (see Figures 6 and\n7) and as you can see in Figure 8, it also gets called exactly the same way as the original\nsource code from codeproject.com.\n\n\n-----\n\nFigure 6: read_proc function implementation\n\nFigure 7: read_proc function implementation\n\nThe most interesting aspect for us is in fact the version of TVSpy that dates back to 20172018 and shares with Olympic Destroyer almost the exact binary code of LoadDLL. You can\nsee LoadDll_LoadHeaders for those samples in Figure 9: as you might notice the function\nlooks different then the one from the older version (see Figure 8).\n\n\n-----\n\nFigure 8. Reconstructed source code of LoadDLL_LoadHeaders function from TVSpy dated back to\n\n2015\n\nFirst, we thought that the authors added new checks before calling read_proc function,\nmaking clear link between Olympic Destroyer and TVSpy (how, after all, could there be the\nsame code modifications if the authors were not the same?). However, after further review\nwe figured that read_proc didn’t exist anymore. Instead it was compiled inline resulting in a\nstatically linked memcpy function.\n\n\n-----\n\nFigure 9. Reconstructed LoadDLL_LoadHeaders from TVSpy and OlympicDestroyer samples,\n\nincluding additional check due to inlining of the read_proc function.\n\nAlso the meaningless check in LoadDll (“if (read_proc)”) we mentioned before has\ndisappeared in the new version of the code (see Figure 10).\n\n\n-----\n\nFigure 10. Reconstructed LoadDLL_LoadHeaders from TVSpy and Olympic Destroyer samples,\n\nincluding additional check due to inlining of the read_proc function.\n\n## The Bottom Line – Evidence is Inconclusive\n\nIn conclusion, we believe that this is not enough evidence to substantiate a claim that\nOlympic Destroyer and new versions of TVSpy using the same modified source code are\nbuilt by the same author.\n\nThe more probable version for us is that the sample was built on a new compiler that further\noptimized the code. It would still mean that both new version of TVSpy and Olympic\nDestroyer are built using the same toolchain configured in the very same way (to enable full\n\n\n-----\n\noptimization and link C++ runtime statically). We actually went to the extent of compiling the\nLoadDLL on MS Visual Studio 2017 with C++ runtime statically linked, and we managed to\nget the very same code as the one included in both Olympic Destroyer and TVSpy.\n\nAlthough we would have liked to finally solve the dilemma, and unveil which were the actors\nbehind the Olympic Destroyer attack, we ended up with more questions than answers, but\nadmittedly, that’s what research sometimes is about.\n\nFirst, why would the authors of an allegedly state sponsored malware use an old LoadDLL\nproject from an open source project from 2014? It is hard to believe that they could not come\nup with their own implementation or use much more advanced open-source projects for that,\nand definitely not relying on an educational prototype buried way beyond the first page of\nresults in Google.\n\nOr maybe the actors were not that much advanced as we would like to think, maybe seeing\nthis as a one-time job, without enough resources to avoid using publicly available source\ncode to quickly build their malware? Or maybe it’s just another red flag, and the real authors\ndecided to use the TVSpy source code as released in 2015 to leave a “Russian fingerprint”?\n\nMaybe all of the above?\n\nAt the beginning of this article we stated that attribution is not just hard, it’s often a\nwilderness of mirrors and more often than not, a bit anticlimactic. As a matter of fact, that\nwas quite a precise prediction.\n\nAbout\nLatest Posts\n\n## Labs Team\n\nLastline Labs is where some of the most brilliant minds in the threat prevention community\ncollaborate to develop advanced cyber security solutions. Our research team tracks the\nevolution, proliferation, and impact of advanced malware. The Lastline Labs Team\ncontinually monitors the threat landscape and analyzes new security threats and\nvulnerabilities.\n\n\n-----\n\n**[Latest posts by Labs Team (see all)](https://www.lastline.com/author/labs-team/)**\n\n[Threat Actor “Cold River”: Network Traffic Analysis and a Deep Dive on Agent Drable -](https://www.lastline.com/labsblog/threat-actor-cold-river-network-traffic-analysis-and-a-deep-dive-on-agent-drable/)\nJanuary 11, 2019\n[Tales From the Field: The Surge of Agent Tesla - August 28, 2018](https://www.lastline.com/labsblog/surge-of-agent-tesla-threat-report/)\n[From Russia(?) with Code - March 9, 2018](https://www.lastline.com/labsblog/attribution-from-russia-with-code/)\n\nTags:\n\n[APT,](https://www.lastline.com/tag/apt/) [attribution,](https://www.lastline.com/tag/attribution/) [code hash,](https://www.lastline.com/tag/code-hash/) [code re-usage,](https://www.lastline.com/tag/code-re-usage/) [code re-use,](https://www.lastline.com/tag/code-re-use/) [Global Threat Intelligence Network,](https://www.lastline.com/tag/global-threat-intelligence-network/)\n[Olympic Destroyer,](https://www.lastline.com/tag/olympic-destroyer/) [TVSpy](https://www.lastline.com/tag/tvspy/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-03-09 - From Russia(-) with Code.pdf"
    ],
    "report_names": [
        "2018-03-09 - From Russia(-) with Code.pdf"
    ],
    "threat_actors": [
        {
            "id": "68d50d91-7569-4e09-b155-98b23b23918a",
            "created_at": "2023-01-06T13:46:38.877268Z",
            "updated_at": "2025-03-27T02:00:02.941236Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Nahr Elbard",
                "Nahr el bared"
            ],
            "source_name": "MISPGALAXY:Cold River",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d06d270-acfd-4db8-83a8-4ff68b9b1ada",
            "created_at": "2022-10-25T16:07:23.477794Z",
            "updated_at": "2025-03-27T02:02:09.824281Z",
            "deleted_at": null,
            "main_name": "Cold River",
            "aliases": [
                "Blue Callisto",
                "BlueCharlie",
                "Calisto",
                "Cobalt Edgewater",
                "Nahr Elbard",
                "Nahr el bared",
                "Seaborgium",
                "Star Blizzard",
                "TA446",
                "TAG-53",
                "UNC4057"
            ],
            "source_name": "ETDA:Cold River",
            "tools": [
                "Agent Drable",
                "AgentDrable",
                "DNSpionage",
                "SPICA"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3eebdb3f-f4e3-42e5-bb4d-f02a13328316",
            "created_at": "2024-05-01T02:03:08.014303Z",
            "updated_at": "2025-03-27T02:05:17.306592Z",
            "deleted_at": null,
            "main_name": "COBALT EDGEWATER",
            "aliases": [
                "Cold River ",
                "DNSpionage ",
                "APT34 "
            ],
            "source_name": "Secureworks:COBALT EDGEWATER",
            "tools": [
                " DNSpionage",
                " Karkoff",
                " MailDropper",
                " SideTwist",
                " TWOTONE",
                "AgentDrable"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536076,
    "ts_updated_at": 1743041602,
    "ts_creation_date": 1653774988,
    "ts_modification_date": 1653774988,
    "files": {
        "pdf": "https://archive.orkl.eu/61c7415d8ad43d07dc789446ad1836b1566df18d.pdf",
        "text": "https://archive.orkl.eu/61c7415d8ad43d07dc789446ad1836b1566df18d.txt",
        "img": "https://archive.orkl.eu/61c7415d8ad43d07dc789446ad1836b1566df18d.jpg"
    }
}