{
    "id": "acabafc3-8e8e-44e2-bd7e-b026dd6ae03e",
    "created_at": "2023-01-12T15:00:47.952498Z",
    "updated_at": "2025-03-27T02:05:36.638597Z",
    "deleted_at": null,
    "sha1_hash": "e07ca7387d15a8c0af3434c563f64235d620f14e",
    "title": "2017-08-29 - Jimmy Nukebot- from Neutrino with love",
    "authors": "",
    "file_creation_date": "2022-05-29T10:35:09Z",
    "file_modification_date": "2022-05-29T10:35:09Z",
    "file_size": 699545,
    "plain_text": "# Jimmy Nukebot: from Neutrino with love\n\n**[securelist.com/jimmy-nukebot-from-neutrino-with-love/81667/](https://securelist.com/jimmy-nukebot-from-neutrino-with-love/81667/)**\n\nAuthors\n\n[Sergey Yunakovsky](https://securelist.com/author/sergeyyunakovsky/)\n\n_“You FOOL! This isn’t even my final form!”_\n\nIn one of our [previous articles, we analyzed the NeutrinoPOS banker as an example of a](https://securelist.com/neutrino-modification-for-pos-terminals/78839/)\nconstantly evolving malware family. A week after publication, this Neutrino modification\ndelivered up a new malicious program classified by Kaspersky Lab as TrojanBanker.Win32.Jimmy.\n\n## NeutrinoPOS vs Jimmy\n\nThe authors seriously rewrote the Trojan – the main body was restructured, the functions\nwere moved to the modules. One small difference that immediately stands out is in the\ncalculation of checksums from the names of API functions/libraries and strings. In the first\ncase the checksums are used to find the necessary API calls; in the second case for a\n\n\n-----\n\ncomparison of strings (commands, process names). This approach makes static analysis\nmuch more complicated: for example, to identify which detected process halts the Trojan\noperation, it’s necessary to calculate the checksums from a huge list of strings, or to\nbruteforce the symbols in a certain length range. NeutrinoPOS uses two different algorithms\nto calculate checksums for the names of API calls, libraries and for the strings. They look like\nthis:\n\n_Restored NeutrinoPOS code to calculate checksums for arbitrary strings and for API calls_\n\nIn Jimmy, only one algorithm is used for these purposes – a slight modification of CalcCS\nfrom NeutrinoPOS. The final XOR with the fixed two-byte value was added to the pseudorandom generator.\n\n_Calculation of checksums in Jimmy_\n\nThe Trojan has completely lost the functionality for stealing bank card data from the memory\nof an infected device; now, its task is limited solely to receiving modules from a remote node\nand installing them into the system. The scan of the infected host has been extended: in\n\n\n-----\n\n[addition to the checks inherited from Neutrino, the Trojan also examines its own name – it](https://blog.malwarebytes.com/threat-analysis/2017/02/new-neutrino-bot-comes-in-a-protective-loader/)\nshould not be a checksum in the MD5, SHA-1, SHA-256 format. Or, alternatively, it should\ncontain the ‘.’ symbol, indicating a subsequent extension (for example, ‘exe’). Plus, by using\nthe assembly command cpuid, the Trojan gets information about the processor and\ncompares it with the list of checksums “embedded” into it.\n\n_Additional Jimmy checks_\n\nThe communication protocol with the C&C server also remains unchanged: the same\nexchange of “enter”, “success” in base64 commands is used, but now the answer is\nencrypted with RC4 beforehand and the key hardcoded in the body of the Trojan\n(a8A5QfZk3r7FHy9o6C2WpBc44TiXg93Y for the sample in question). The code for\n[extracting the encryption key is here](https://pastebin.com/5VPn7x2k)\n\n\n-----\n\n## Analysis of modules\n\nAs mentioned above, the main body of the Trojan only receives modules – these contain the\npayload. We managed to get hold of new modules for web-injects, mining and a large\nnumber of updates for the main module in various droppers.\n\nThe miner is designed to extract the Monero currency (XMR). In the module code there is an\nidentifier associated with a wallet for which the crypto currency is extracted, as well as the\naddress of the pool. Monero is very popular with virus writers – it’s mined by SambaCry,\n[which we described in June and Trojan.Win32.DiscordiaMiner that appeared shortly](https://securelist.com/sambacry-is-coming/78674/)\nafterwards. By the way, the source code of the latter was made publicly available by the\nauthor. The reason for doing so was the same that prompted the author of NukeBot to do\nlikewise: an attempt to stifle disagreements in forums and to avoid accusations of fraud (the\nrepository with the code is currently unavailable).\n\nThanks to the identifier/pool pair, we got statistics on all the nodes working for this wallet.\nThe start date of mining – 4 July – coincides with the compilation of the main body of the first\ndiscovered sample and is extremely close to the date of compilation of the dropper (06 July\n13:14:55 2017 UTC), the main body (02 July 14:19:03 2017 UTC) and the modules for web\ninjects (July 02, 14:18:39 2017 UTC). So it’s safe to say that Jimmy began to proliferate in\nearly July.\n\nIt’s worth noting that the amount of money in the wallet is small – only ~ 0.55 XMR, which as\nof 21 August is only $45. Judging by the general decline and absence of payments, the\nauthors quickly abandoned the use of miners or changed their wallet.\n\n\n-----\n\nThe web-inject modules are so called for their primary intended use, although they are also\nable to perform functions similar to those in NeutrinoPOS, i.e., take screenshots, set up\nproxy servers, etc. These modules are distributed in the form of libraries and their functions\nvary depending on the name of the process in which they are located. As you can see from\nthe screenshot below, in three cases out of five the ChromeHook procedure is called for\nbrowsers. This is not surprising, considering the large number of Chrome-based browsers.\nUnfortunately, it was possible to restore the name from the checksum for only one of them –\nchrome.exe (0xFC0C7619). Checksums are calculated using the algorithm described in the\nprevious section.\n\n\n-----\n\n_Restored code of the main procedure in the module of Jimmy web injects_\n\n\n-----\n\nLike NeutrinoPOS, Jimmy stores a number of parameters in the registry. In the sample in\nquestion, the data is in the HKEY_CURRENT_USER\\Software\\c2Fsb21vbkBleHBsb2l0Lmlt\nbranch. For example, this is where the web-inject module receives the address of the\ncurrently used DNS server from – this is critical when using NamCoin-like addresses as a\nC&C server.\n\nFor Firefox and Internet Explorer, the function hook is performed by the straightforward\nsubstitution of the called function addresses in the loaded libraries (etc. InternetConnectW /\nPR_Read). With Chrome, things are a bit more complicated – the necessary libraries are\nlinked statically. But the subsequent substitution of data using web injects coincides.\n\n_Restored web-inject processing code_\n\n\n-----\n\nSo far we have only managed to get a test sample of the web injects (in the screenshot\n[below); in the future the Trojan will most likely acquire ‘combat’ versions. Here you can find](https://pastebin.com/VczkKyJP)\nexamples of web injects and the keys used. To recap, decryption entails decoding the string\nusing base64 and then decrypting with RC4.\n\n_Request from Jimmy for web injects_\n\n\n-----\n\n_Example of the Jimmy test web injects_\n\nIn the pictures below several procedures in the source code of NukeBot and the restored\ncode of Jimmy are compared. It can clearly be seen that they completely coincide.\n\n\n-----\n\n## Conclusion\n\nIn isolation from the previous modifications, the newly created Jimmy would not be of much\ninterest to researchers. However, in this context, it is an excellent example of what can be\ndone with the source code of a quality Trojan, namely, flexibly adapt to the goals and tasks\nset before a botnet to take advantage of a new source.\n\n## MD5\n\n**Droppers**\n\nc989d501460a8e8e381b81b807ccbe90\n\nE584C6E999A509AC21583D9543492EF4\n\n2e55bd0d409bf9658887e02a7c578019\n\nbccd77cf0269da7dc914885cda626c6c\n\n86d7d3b50e4dc4181c28ccbaafb89ab3\n\n**Main body**\n\n174256b5f1ee80be1b847d428c5180e2\n\n336841d91c37b07134adba135828e66e\n\n\n-----\n\nFE9A46CEFDB41095F10D459BB9943682\n\n**Modules**\n380356b8297893b4fc9273d42f15e9db\n2fa18456e14bea53ec0d7c898d94043b\n7040b5ac432064780a17024ab0a3792a\n629a4d2b79abe48fb21afd625f674354\n05846839DAA851006B119A2B4F9687BF\n2362E3BEBAD1089DDFE40C8996B0BF45\n380356B8297893B4FC9273D42F15E9DB\n4042C27F082F48E253BE66528938640C\n443831A3057E9A62455D4BD3C7E04144\n4762B90C0305A2681CE42B9D05B9E741\nCB01E3A0799D4C318F74E439CCE0413F\nD9F58167A9A22BD1FA9AA0F991AEAF11\nE991936E09697DE8495D05B484F3A3E2\n\n[Cryptocurrencies](https://securelist.com/tag/cryptocurrencies/)\n[Malware Descriptions](https://securelist.com/tag/malware-descriptions/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Trojan Banker](https://securelist.com/tag/trojan-banker/)\n\nAuthors\n\n[Sergey Yunakovsky](https://securelist.com/author/sergeyyunakovsky/)\n\nJimmy Nukebot: from Neutrino with love\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-08-29 - Jimmy Nukebot- from Neutrino with love.pdf"
    ],
    "report_names": [
        "2017-08-29 - Jimmy Nukebot- from Neutrino with love.pdf"
    ],
    "threat_actors": [
        {
            "id": "484c5fed-029e-4504-b75a-bbdbc9460595",
            "created_at": "2022-10-25T16:07:24.529893Z",
            "updated_at": "2025-03-27T02:02:10.273182Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "ETDA:Pacha Group",
            "tools": [
                "Antd",
                "DDG",
                "GreedyAntd",
                "Korkerds",
                "XMRig"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "18bcbaa6-8e7b-43c4-9db7-8b0b315ee5a3",
            "created_at": "2023-01-06T13:46:39.024086Z",
            "updated_at": "2025-03-27T02:00:02.980081Z",
            "deleted_at": null,
            "main_name": "Pacha Group",
            "aliases": [],
            "source_name": "MISPGALAXY:Pacha Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535647,
    "ts_updated_at": 1743041136,
    "ts_creation_date": 1653820509,
    "ts_modification_date": 1653820509,
    "files": {
        "pdf": "https://archive.orkl.eu/e07ca7387d15a8c0af3434c563f64235d620f14e.pdf",
        "text": "https://archive.orkl.eu/e07ca7387d15a8c0af3434c563f64235d620f14e.txt",
        "img": "https://archive.orkl.eu/e07ca7387d15a8c0af3434c563f64235d620f14e.jpg"
    }
}