{
    "id": "acb9d046-c05d-41b9-8eaf-1319d6a21f40",
    "created_at": "2023-01-12T15:04:51.331306Z",
    "updated_at": "2025-03-27T02:05:29.520045Z",
    "deleted_at": null,
    "sha1_hash": "e8c7de318a71307491a1632f0ac320430c7fb3d2",
    "title": "2017-04-10 - DOJ moves to topple Kelihos, one of the world's largest botnets",
    "authors": "",
    "file_creation_date": "2022-05-28T17:07:01Z",
    "file_modification_date": "2022-05-28T17:07:01Z",
    "file_size": 630654,
    "plain_text": "# Related news\n\n**[cyberscoop.com/doj-kelihos-botnet-peter-levashov-severa/](https://www.cyberscoop.com/doj-kelihos-botnet-peter-levashov-severa/)**\n\ngovernment\n\n\nApril 10, 2017\n\n\n## DOJ moves to topple Kelihos, one of the world's largest botnets\n\nPhoto by Tristan Schmurr (Flickr/CC BY 2.0)\nWritten by [Patrick Howell O'Neill](https://www.cyberscoop.com/author/oneill/)\n\nApr 10, 2017 | CYBERSCOOP\nThe Department of Justice announced Monday an effort to take down a global network of\nover 100,000 enslaved computers under the control of Peter Yuryevich Levashov.\n\nLevashov, also known as Peter Severa, was known as one of the world’s most prolific and\n[long-reigning kings of spam. A citizen of Russia, he was arrested in Spain earlier this week.](https://www.buzzfeed.com/sheerafrenkel/this-is-the-russian-hacker-detained-in-spain-for-helping?utm_term=.qdorgRjdpz#.lul5Xlr7aL)\n\nThe network, known as the Kelihos botnet, has been in operation since 2010, targeting\nMicrosoft Windows machines for infection. The result was millions of spam emails, pumpand-dump schemes to illegally profit off stocks, mass password theft and the spreading of\n\n\n-----\n\nmalware, according to the DOJ. Roughly 5 percent to 10 percent of Kelihos victims reside in\nthe United States, according to the Justice Department.\n\n“The ability of botnets like Kelihos to be weaponized quickly for vast and varied types of\nharms is a dangerous and deep threat to all Americans, driving at the core of how we\ncommunicate, network, earn a living and live our everyday lives,” said acting Assistant\nAttorney General Kenneth Blanco.\n\nLevashov was first indicted over a decade ago by U.S. authorities on charges of email and\nwire fraud for allegedly using spam to promote profitable pump-and-dump penny stock\nschemes.\n\nHe was charged again in 2009 for allegedly operating the Storm botnet, another spam\nbehemoth and a predecessor to Kelihos.\n\nThis week’s arrest was made possible because the FBI learned just last month that\nLevashov was going to leave his home in Russia, a country without extradition to the United\nStates, to spend several weeks in Spain. The details about how the FBI came into that\ninformation remain unknown.\n\nLevashov was connected to Kelihos by the FBI by connecting IP addresses used to operate\nthe botnet that was also used by email and other online accounts under the name of Pete\nLevashov, a web programmer in Russia.\n\nLevashov regularly used the same addresses to commit crime. To connect the dots, the FBI\nobtained Levashov’s records from companies including Google, Apple, WebMonkey and\nFoursquare.\n\nThe operation against Kelihos is global in scale, according to the DOJ, who worked in\nconcert with law enforcement around the world. The department cited the newly amended\nRule 41 as the source of authorization for the botnet’s disruption.\n\n“Let me emphasize that there was no entry into the computers to take information using this\nwarrant,” a Justice Department official said during a call with reporters. “This was merely\nused as a disruption technique against this botnet, it was not a search warrant against the\ncomputers that were part of the botnet.”\n\nThe FBI worked with CrowdStrike, a private security company, and Shadowserver\nFoundation, a volunteer group of information security experts, to deploy a sinkhole attack to\nsever the communication networks between criminal directors and infected computers. The\nDOJ cautioned that, as is normal in offensives against large botnets, the operation against\nKelihos will not be 100 percent complete for some time to come.\n\n\n-----\n\nThis isn t an operation where you can throw a switch and turn off the botnet, a Justice\nDepartment official said. “There is a lag time. We’ll continue our operation to have the most\nimpact we can on this particular botnet. So far the signs are very good that we’ve had a\nsignificant disruption of this botnet.”\n\n[You can read the criminal complaint and](http://www.documentcloud.org/documents/3549535-Dkt-1-Complaint-0.html) [application for a search warrant below:](http://www.documentcloud.org/documents/3549532-Signed-Application-for-Search-Warrant-Redacted-0.html)\n\n[documentcloud url=”http://www.documentcloud.org/documents/3549532-Signed-Applicationfor-Search-Warrant-Redacted-0.html” responsive=true sidebar=false text=false pdf=false]\n\n[documentcloud url=”http://www.documentcloud.org/documents/3549535-Dkt-1-Complaint0.html” responsive=true sidebar=false text=false pdf=false]\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-04-10 - DOJ moves to topple Kelihos, one of the world's largest botnets.pdf"
    ],
    "report_names": [
        "2017-04-10 - DOJ moves to topple Kelihos, one of the world's largest botnets.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535891,
    "ts_updated_at": 1743041129,
    "ts_creation_date": 1653757621,
    "ts_modification_date": 1653757621,
    "files": {
        "pdf": "https://archive.orkl.eu/e8c7de318a71307491a1632f0ac320430c7fb3d2.pdf",
        "text": "https://archive.orkl.eu/e8c7de318a71307491a1632f0ac320430c7fb3d2.txt",
        "img": "https://archive.orkl.eu/e8c7de318a71307491a1632f0ac320430c7fb3d2.jpg"
    }
}