{
    "id": "ace92fd3-9943-4707-9446-d71ee856c76c",
    "created_at": "2023-01-12T15:10:35.502725Z",
    "updated_at": "2025-03-27T02:06:02.173921Z",
    "deleted_at": null,
    "sha1_hash": "ea719b265cf21a48ff1258c9c1ed1ca6dbeabcd8",
    "title": "2019-12-09 - TrickBot Campaign Uses Fake Payroll Emails to Conduct Phishing Attacks",
    "authors": "",
    "file_creation_date": "2022-05-28T15:08:27Z",
    "file_modification_date": "2022-05-28T15:08:27Z",
    "file_size": 1010857,
    "plain_text": "# TrickBot Campaign Uses Fake Payroll Emails to Conduct Phishing Attacks\n\n**[unit42.paloaltonetworks.com/trickbot-campaign-uses-fake-payroll-emails-to-conduct-phishing-attacks/](https://unit42.paloaltonetworks.com/trickbot-campaign-uses-fake-payroll-emails-to-conduct-phishing-attacks/)**\n\nBryan Lee, Brittany Barbehenn, Mike Harbison December 9, 2019\n\nBy [Bryan Lee,](https://unit42.paloaltonetworks.com/author/bryanlee/) [Brittany Barbehenn and](https://unit42.paloaltonetworks.com/author/brittany-ash/) [Mike Harbison](https://unit42.paloaltonetworks.com/author/mike-harbison/)\n\nDecember 9, 2019 at 6:00 AM\n\n[Category: Cloud,](https://unit42.paloaltonetworks.com/category/cloud/) [Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Bot,](https://unit42.paloaltonetworks.com/tag/bot/) [cloud malware,](https://unit42.paloaltonetworks.com/tag/cloud-malware/) [Cybercrime,](https://unit42.paloaltonetworks.com/tag/cybercrime/) [GSuite,](https://unit42.paloaltonetworks.com/tag/gsuite/) [Phishing,](https://unit42.paloaltonetworks.com/tag/phishing/) [Trickbot](https://unit42.paloaltonetworks.com/tag/trickbot/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/trickbot-campaign-uses-fake-payroll-emails-to-conduct-phishing-attacks/)\n\n## Executive Summary\n\n[By using a combination of Cortex XDR and the](https://www.paloaltonetworks.com/cortex/cortex-xdr) [AutoFocus contextual threat intelligence service, Unit 42 discovered a recent Trickbot](https://www.paloaltonetworks.com/cortex/autofocus)\ncampaign leveraging legitimate cloud service providers to obfuscate malicious delivery behavior.\n\n[Trickbot is a well-known, modular credential stealer first discovered in 2016. It has been thought to be a descendent of another well-known](https://blog.malwarebytes.com/threat-analysis/2016/10/trick-bot-dyrezas-successor/)\ncredential stealer called Dyreza, or Dyre, due to similarities in functionalities and codebase. Due to its modularity, operators of Trickbot are\nable to gain access to different functions and capabilities by retrieving additional modules from the command and control (C2) servers. These\ninclude capabilities such as a worming function (i.e. copying itself to other devices), email inbox parser, and network reconnaissance.\n\nBetween November 7 - 8, 2019, Unit 42 identified a Trickbot distribution campaign delivered via phishing emails with subject lines using topics\naround payroll or annual bonuses shown below.\n\n“Re: <Company Name> annual bonus document is ready”\n“Re: annual bonus form for <name>”\n“RE: <name> Payroll notification”\n“RE: <Company Name>Payroll notification”\n\nGenerally, Trickbot and similar tools have been largely associated with using malspam with malicious document attachments as the delivery\nmechanism of choice by their operators likely due to ease-of-use, relatively low resource cost, and high success rates. In this campaign,\ninstead of solely relying on email attachments, the adversaries included links to what appeared to be a legitimate Google Docs document\nwhich itself contained links to malicious files hosted on Google Drive. To further obfuscate the malicious activity, the adversaries leveraged a\nlegitimate Email Delivery Service (EDS) called SendGrid to distribute the initial emails, and also hide the Google Drive links in the documents\nbehind a SendGrid URL.\n\nOnce the user is fully redirected to the file hosted on Google Drive, an executable file is downloaded. This executable is a downloader tool\n[designed to retrieve a Trickbot payload. Similar behavior was observed in August 2019 by Cofense.](https://cofense.com/trickbot-using-google-docs-trick-proofpoints-gateway/)\n\n**Attack Details**\n\n\n-----\n\ne e a s se t by t e attac e s appea ed to o g ate o d dua s at edu e a add esses c e e e y co p o sed by t e\nadversary. They then used SendGrid’s EDS to distribute the actual emails. This would have increased their likelihood of bypassing email filters,\nas it is a popular service used by organizations around the world. The body of the emails contained lure text consistent with the subject lines\nand links that utilized a SendGrid function called Click Tracking which sends a notification back to the sender of the email for tracking\npurposes. The following screenshots show a sampling of the emails received:\n\n_Figure 1. Screenshots of Trickbot phishing emails_\n\nOnce the victim clicks on the links, they are redirected to a Google Doc document which has a link to a file hosted on Google Drive. This file is\na simple downloader which has a single function of retrieving the Trickbot payload then executing it on the victim host. The attack flow can be\nseen in Figure 2.\n\n_Figure 2. Trickbot attack chain_\n\nIn this campaign, we identified two downloaders:\n\n**Phishing Theme** **File Name** **SHA256**\n\n\n-----\n\nAnnual bonus StatementReport.exe b8c2329906b4712caa0f8ca7941553b3ed6da1cd1f5cb70f1409df5bc1f0ee4a\n\nPayroll Preview_Report.exe f8aaf313cc213258c6976cd55c8c0d048f61b0f3b196d768fbf51779786b6ac6\n\n_Table 1. Trickbot downloader files_\n\nBoth of these downloaders are signed by PERISMOUNT LIMITED and appear as Microsoft Word documents to Windows users, as shown in\nFigure 3. Due to default settings in most Windows deployments of not displaying file extensions, these files will not appear as obvious\nexecutables to a victim. Once these files are executed by the victim, a decoy pop-up is displayed to reduce suspicion of any malicious\nbehavior. Regardless of whether or not the user hits “OK” or closes the pop-up window, the file will still proceed with the download and\ninstallation of the Trickbot payload. The payload in this case is a file named MHk6kyiq.Z6O and is saved in the user’s temp directory where it is\neventually executed.\n\n_Figure 3. Downloaders using Microsoft Word icons_\n\n_Figure 4. Decoy pop-up from downloader_\n\nUsing Cortex XDR and AutoFocus, we observed that once the files were executed by the victim, they would then retrieve the corresponding\nTrickbot payload from a first stage C2 server. Analyzing these domains indicate that they are owned by legitimate organizations which\nsuggests the adversaries were able to compromise the legitimate servers and hijack them to be a part of their delivery infrastructure. This\ntactic further increases the chance of evasion by the adversary as it is unlikely these domains would be categorized as malicious and in some\ncases, may actually have legitimate business use cases for the targeted organizations. Table 2 below depicts the downloader and URL used\nfor each Trickbot payload.\n\n\n**Downloader** **C2** **Trickbot**\n**Payload File**\n\n\n**SHA256**\n\n\nStatementReport.exe savute[.]in/supp.php nfdsus12.exe d1e0902fd1e8b3951e2aec057a938db9eebe4a0efa573343d897\n\nPreview_Report.exe lindaspryinteriordesign[.]com/supp.php nfdusdarm.exe 7d6ff8baebedba414c9f15060f0a8470965369cbc1088e9f21e2b\n\n_Table 2. Trickbot Payload Download Locations_\n\nThe two payloads, nfdsus12.exe and nfdusdarm.exe, were immediately identified as Trickbot by the AutoFocus threat intelligence service via\nthe tagging system. AutoFocus tags are groupings of behaviors that are designed to immediately identify specific malware families, threat\nactors, campaigns, or exploits. These tags are developed and maintained by the Unit 42 research team and are continuously updated as\nthreats evolve.\n\n\n-----\n\n_Figure 5. Trickbot payload tagging in AutoFocus_\n\nThis specific variant appeared to be a newer version of Trickbot, using the file path %APPDATA%\\cashcore to store its files and configurations.\nOnce the payload is executed, it will spawn a child process (svchost.exe) in a suspended state, replace the memory with malicious code, and\nresume the process. The technique is known as process hollowing. From there, basic system information is collected, and it will attempt to\ncommunicate to its second-stage C2 infrastructure to retrieve additional modules.\n\nUsing Cortex XDR and its data analytics processing engine, we were able to validate this activity via the causality chain function as shown in\nFigure 6.\n\n_Figure 6. Cortex XDR causality chain_\n\nThis workflow illustrates the described attack chain:\n\n1. Initial downloader, statementreport.exe is executed by the user\n2. Performs an HTTPS GET request to savute[.]in/supp.php\n3. Payload file MHk6kyiq.Z6O is downloaded to the victim and saved in the user’s temp folder.\n4. Payload is executed by the downloader and the downloader terminates\n5. Payload is renamed to дввшгаоа.exe and copied to the users %APPDATA%\\cashcore directory\n6. File versioninfo.iniis created in the %APPDATA%\\cashcore directory. This file is similar to older Trickbot variants that use the file\n\nsettings.ini. Unlike settings.ini, versioninfo.ini is not encrypted or obfuscated, but contains random data to appear like a legitimate ini file.\n7. дввшгаоа.exe spawns an instance of svchost.exe which spawns another instance of svchost.exe which is then injected with the Trickbot\n\npayload. In this example, a built-in network recon module was run, which enumerated the victim host and network.\n8. For persistence, this Trickbot variant created a scheduled task named System cache service which is scheduled to run at user logon and\n\nupon initial execution checks itself every 11 minutes to see if it is already running.\n\n**The Wider Campaign**\n\nUsing AutoFocus, we used the string supp.php within the URL as a pivot point to search for any other files that were delivered from that URL.\nAn additional five samples were discovered that were also all tagged as Trickbot, making a total of seven samples. These samples used a\ndifferent C2 delivery server, but behaviorally were the same. The two additional C2 servers also appeared to be legitimate domains which had\nlikely been compromised and hijacked by the adversaries. Details about these samples can be seen in Table 3.\n\n\n-----\n\necut g a ot e sea c uto ocus oo g o t e occu e ce o t e st g cas co e t a y e ct ty e ea ed o e 800 add t o a\nsamples, also all tagged as Trickbot. These samples were all ingested into our WildFire malware analysis platform between November 4 - 22,\n2019, suggesting that this specific variant was first found earlier this month and is currently still in use. These samples also encompassed a\nrange of Trickbot related files, from the Trickbot payload itself as well as various Trickbot modules. All known indicators for this variant of\nTrickbot is available in the indicators section of this blog.\n\n**Date Observed** **C2** **Trickbot Payload** **SHA256**\n\n11/7/19 clementeolmos[.]com/supp.php erfd1.exe 24e3fa3\n\ne9fd22631de9c918ac834eb14e01c76aa4d33069c7622daafcd03b4f1574aad0\n\nd7687e1d98484b093e8da7fb666b2d644197fc3ea22b3931a6150c259479b0c\n\n11/19/19 maisonmarielouise[.]org/supp.php SetupDesktop.exe dc8f259\n\nb3d2e7158620ece90fbc062892db55bf564c6154eb85facab57a459e3bd1156f\n\n_Table 3. Additional Trickbot payloads observed_\n\n## Conclusion\n\nBy using a combination of Cortex XDR and AutoFocus, Unit 42 researchers were able to rapidly identify and discover behaviors associated\nwith a newer Trickbot campaign without significant manual analysis. In this campaign, we discovered the adversaries leveraging legitimate\nservices such as SendGrid and GSuite in an effort to obfuscate malicious activity. With the wider adoption of various cloud services by most\norganizations, these types of tactics should be expected to occur with even more frequency as these are additional avenues that can be\nabused by an adversary to evade detection.\n\nIn this campaign, due to the abuse of legitimate cloud services, the detection and prevention of the initial delivery may have been more\nchallenging than if the adversaries had used their own infrastructure. However, having a policy, such as preventing unknown executable files to\nbe downloaded or executed on the endpoint, may help prevent these attacks from succeeding against businesses.\n\n[Palo Alto Networks customers may learn more via AutoFocus and the Trickbot tag.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.Trickbot)\nAll Trickbot samples are properly detected as malware in WildFire\nTrickbot C2 URLs have been added to URL Filtering\n\nPalo Alto Networks has shared our findings, including file samples and indicators of compromise, in this report with our fellow Cyber Threat\nAlliance members. CTA members use this intelligence to rapidly deploy protections to their customers and to systematically disrupt malicious\n[cyber actors. For more information on the Cyber Threat Alliance, visit www.cyberthreatalliance.org. (This is added to blogs pre-shared with the](http://www.cyberthreatalliance.org/)\n_CTA, when loaded into WordPress it will be added when appropriate)._\n\nIndicators of Compromise\n\n**Trickbot Downloader Samples**\n\nf8aaf313cc213258c6976cd55c8c0d048f61b0f3b196d768fbf51779786b6ac6\n\nb8c2329906b4712caa0f8ca7941553b3ed6da1cd1f5cb70f1409df5bc1f0ee4a\n\n**Trickbot Payload Samples**\n\n7d6ff8baebedba414c9f15060f0a8470965369cbc1088e9f21e2b5289b42a747\n\nd1e0902fd1e8b3951e2aec057a938db9eebe4a0efa573343d89703482cafb2d8\n24e3fa3fb1df9bd70071e5b957d180cd51bcf10bab690fa7db7425ca6652c47c\n\ne9fd22631de9c918ac834eb14e01c76aa4d33069c7622daafcd03b4f1574aad0\n\nd7687e1d98484b093e8da7fb666b2d644197fc3ea22b3931a6150c259479b0c6\n\ndc8f259fb55a330d1a8e51d913404651b8d785d4ae8c9c655c57b4efbfe71a64\n\nb3d2e7158620ece90fbc062892db55bf564c6154eb85facab57a459e3bd1156f\n\n**Trickbot Payload URLs**\n\nsavute[.]in/supp.php\n\nlindaspryinteriordesign[.]com/supp.php\n\nmaisonmarielouise[.]org/supp.php\n\nclementeolmos[.]com/supp.php\n\n**Related Trickbot SHA 256**\n\n[List of hashes on GitHub](https://github.com/pan-unit42/iocs/blob/master/Trickbot/trickbot_cashcore_hashes.txt)\n\n\n-----\n\n**p**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy Statement.](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-09 - TrickBot Campaign Uses Fake Payroll Emails to Conduct Phishing Attacks.pdf"
    ],
    "report_names": [
        "2019-12-09 - TrickBot Campaign Uses Fake Payroll Emails to Conduct Phishing Attacks.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536235,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653750507,
    "ts_modification_date": 1653750507,
    "files": {
        "pdf": "https://archive.orkl.eu/ea719b265cf21a48ff1258c9c1ed1ca6dbeabcd8.pdf",
        "text": "https://archive.orkl.eu/ea719b265cf21a48ff1258c9c1ed1ca6dbeabcd8.txt",
        "img": "https://archive.orkl.eu/ea719b265cf21a48ff1258c9c1ed1ca6dbeabcd8.jpg"
    }
}