{
    "id": "ad1636e8-15bd-42ef-9a05-452321b5135d",
    "created_at": "2023-01-12T15:10:42.311454Z",
    "updated_at": "2025-03-27T02:16:37.23352Z",
    "deleted_at": null,
    "sha1_hash": "601fb779c0bd7d44301fb02556b8cf6bdd4d2b84",
    "title": "2018-04-16 - Searching for the Reuse of Mirai Code- Hide ‘N Seek Bot",
    "authors": "",
    "file_creation_date": "2022-05-28T15:39:04Z",
    "file_modification_date": "2022-05-28T15:39:04Z",
    "file_size": 137611,
    "plain_text": "# Searching for the Reuse of Mirai Code: Hide ‘N Seek Bot\n\n**[fortinet.com/blog/threat-research/searching-for-the-reuse-of-mirai-code--hide--n-seek-bot.html](https://www.fortinet.com/blog/threat-research/searching-for-the-reuse-of-mirai-code--hide--n-seek-bot.html)**\n\nApril 16, 2018\n\nThreat Research\n\nBy [Jasper Manuel | April 16, 2018](https://www.fortinet.com/blog/search?author=Jasper+Manuel)\n\nIt’s a common practice in mainstream software development to reuse codes that were made\navailable on the internet. This practice is no different with malware development. Many\nmalware source codes have been leaked and they enable many wannabe hackers and\nmalware authors to learn and make their own malware.\n\n[In September 2016, the Mirai source code was leaked on the hacking community](https://krebsonsecurity.com/2016/10/source-code-for-iot-botnet-mirai-released/)\nHackforums. Mirai is known to have been used to temporarily cripple high profile services via\nmassive distributed denial of service (DDoS) attacks. Since the release of this code online,\nmany have tried to modify it and as a result many variants and derivations have emerged\ntrying to get a slice of the IoT threat pie. On March 3, 2018, my colleague Dario Durando had\nthe opportunity to [present our research about these variants at the RootedCon Security](https://fortiguard.com/events/2139/internet-of-things-battle-of-the-bots)\nConference in Madrid, Spain. We identified variants that were derived from the original Mirai\nsource code. From simple modifications (such as just adding additional credentials to the list\nof credentials available for a brute force attack) to more complex approaches (such as using\nexploits) to spread the malware to IoT devices, these variants all still use the main Mirai code\nbase\n\n\n-----\n\nWith this knowledge that leaked malware source codes are used by many malware authors\nin their own malware programming, we here at FortiGuard Labs became interested into\nsearching out other malware that leverages Mirai code modules. Interestingly, one of the\nfamilies that showed up in our search was the Hide ‘N Seek (HNS) bot, which was\n[discovered in January of 2018. HNS is a complex botnet that uses P2P to communicate with](https://www.securityweek.com/hide-n-seek-iot-botnet-ensnares-20000-devices-days)\npeers/other infected devices to receive commands. In this article, I will discuss how the Mirai\nbot code was used in this HNS bot.\n\n**A Quick Review of the Mirai Bot**\n\nThe original Mirai malware has the following components:\n\nBot – infects and spreads to IoT devices through a brute-force attack and contacts the\ncommand and control server (C2) to receive commands from the botnet master/users\nto launch DoS attacks against specified targets.\nCommand and Control server – used to control the infected IoT devices to launch\nDDoS attacks against specified targets.\nReport server – listens for reports from an infected IoT device to report that a new\npotential victim IoT device. This report contains the IP and login credentials of the new\nvictim.\nLoader – loads the bot to the new victim device.\n\nFig 1. How Mirai Works\n\nIn this article, we will just focus on the bot. The Mirai bot has 3 main modules:\n\n-   Attack – the attack module contains various DoS attack methods (UDP, TCP, HTTP).\n\n-   Killer – kills processes (telnet, SSH, HTTP, other bots).\n\n-   Scanner – generates a list of random IP addresses to brute force to use within the\nbotnet.\n\nFig 2. Mirai’s main modules\n\n**The Hide ‘N Seek Bot and How Mirai Code Was Used**\n\nHNS was discovered in January 2018. This IoT malware is more complex than Mirai in the\nsense that it communicates in a complex and decentralized manner (custom-built peer-topeer (P2P) communication) in order to receive commands to perform its various malicious\nroutines. HNS doesn’t launch DoS attacks, but was found to have the capability to exfiltrate\ndata and execute additional code.\n\nAt first glance, it’s hard to notice that Hide ‘N Seek is using some Mirai modules, especially if\nyou haven’t read the Mirai source code or haven’t analyzed Mirai binaries before. There are\nsome awesome IDA plugins, however, that you can use to identify functions in a binary that\n\n\n-----\n\nhave similar functions in another binary. However, they did not work for the samples I\nanalyzed so I had to do the identification manually.\n\nIf you try to compile the Mirai source code, you will notice that its encrypted strings are\nstored in the read-only data segment (.rodata) of the compiled ELF binary. With this in mind, I\nstarted to check the .rodata segment of the HNS binary for possible encrypted strings.\n\nFig 3. .rodata segment containing possibly encrypted strings\n\nWhen I checked the code reference to one of the sets of data, I was brought to the part of\nthe binary where pointers to this data are passed as the first parameter to the same function.\nThis gave me the idea that the function might be a decryption function.\n\nFig 4. Code snippet showing the pointers to the data passed as a parameter to the same\nfunction\n\nGoing into the function reveals that it is, in fact, a decryption routine. The decryption starts\nwith a hardcoded single-byte XOR key. This key is XORed with the first byte of the string,\nand the result is then added to the key. The sum of the XOR result and the key is used as\nthe key for the second byte. The same procedure applies to the next bytes. I saw two\ndifferent keys (0xA (ARM) and 0xA0 (x64)) from the binaries I analyzed, but this key can be\neasily changed.\n\nFig 5. Decryption function\n\nTo make the string decryption easier, a simple IDA python script can be written to\nautomatically find the addresses of the encrypted strings and then apply the decryption\nalgorithm. We can also use it to add comments to contain the decrypted strings.\n\nFig 6. Decrypted strings\n\nNow that we can see them, some of these strings look familiar. Some of these same strings\nare also found in Mirai.\n\nFig 7. The Mirai configuration table\n\nWith these strings decrypted, it’s easier to identify the Mirai functions used by HNS by just\nchecking the references to these strings and then comparing them with the functions in the\noriginal Mirai source code.\n\nFig 8. The Mirai “consume_pass_prompt” function\n\nFig 9. The HNS “consume_pass_prompt” function implementation\n\n\n-----\n\nWhile many functions look like they are directly copied, there are also many functions that\nwere clearly modified to fit the needs of this new malware. The HNS bot has three main\nmodules: a scanner, a process killer, and a function to wait for a connection from its peers.\n\nFig 10. 3 The main modules of HNS: scanner, killer, P2P\n\nTwo of the modules, the scanner and the killer, have a very similar code structure to that of\nthe Mirai scanner and killer modules.\n\nFor the killer module, they both kill processes associated with other bot,s like QBOT, Zollard,\nand even Mirai itself.\n\nFig 11. HNS kills other bots\n\nOne difference is that HNS doesn’t directly kill processes (by port number) related to HTTP,\ntelnet, and SSH. Instead, the attacker can specify at runtime a port number. The process\nassociated with this port will be killed.\n\nFig 12. HNS kills the process related to a port specified at runtime\n\nFor the scanner, they both generate a list of random set of IP addresses to search for\npotential victims. Major differences are around the ports to scan and compromise methods to\nbe used. HNS scans ports 80, 8080, 2323, 9527, 23 randomly by initiating a raw socket SYN\nconnection. Once a connection is established, like Mirai, it will try to brute-force its way into\nthe device via telnet using a hardcoded list of credentials. Once successful, it can load itself\nto the device through several methods, such as echo, HTTP, and TFTP. Unlike with HNS, in\nthe original Mirai the loader is a separate binary, while other Mirai modifications embed the\nloader into their body.\n\nFig 13. HNS randomly selects which port to scan\n\nHNS uses at least three exploits on the samples I analyzed. Two are used for propagation.\nOne of these targets Netgear DGN DSL modems/routers (also used by Reaper bot) while the\nother targets TP-Link routers. While the original Mirai doesn’t use exploits to propagate,\nother modifications use other various exploits to spread.\n\nFig 14. Netgear DGN DSL modem/router exploit in the HNS implementation\n\nFig 15. TP-Link router exploit HNS implementation\n\nAfter logging in successfully via telnet into a ZyXEL PK5001Z modem, the third one (CVE2016-10401) is used to escalate the user to root using ‘su’ with password ‘zyad5001’.\n\nFig 16. CVE-2016-10401 HNS implementation\n\n\n-----\n\n**Other HNS Details**\n\nThis article doesn’t focus on the HNS malware itself. Instead, this article describes how Mirai\ncode was used in HNS. This allows us to study how we can use this technique to hunt for\nother malware that uses Mirai code. However, some very interesting features of HNS must\nalso be mentioned here. For example, HNS uses a custom-built P2P communication with\npeers and/or other infected devices using a randomly generated UDP port or a port specified\nat runtime. Unlike Mirai, which was designed to launch DoS attacks against certain targets,\nthis IoT malware receives commands through peers to exfiltrate data and execute additional\ncode. This P2P communication makes the malware more complicated to analyze. The\ndecentralized manner of receiving commands also makes it hard to identify where the\ncommands are issued from and where the data drop points are located.\n\nFig 17. Code snippet showing P2P commands\n\n**Conclusion**\n\nAs we have seen in the past, malware source code leaks result in more malware being\ncreated. We are now seeing that the Mirai source code leak is going through this same\nprocess, and so we expect to see new malware families emerge that leverage the Mirai\nsource code.\n\nAs always, by using the knowledge we gained from this study, we here at FortiGuard Labs\nwill continue to watch, and even hunt for malware that uses the Mirai source code.\n\n**Solution**\n\nFortinet detects the HNS samples as Linux/Hns.A!tr and the exploits used as\nZyXEL.PK5001Z.Modem.Backdoor,\nNETGEAR.DGN1000.CGI.Unauthenticated.Remote.Code.Execution, and TPLink.Wireless.Router.Backdoor .\n\n-= FortiGuard Lion Team =\nSamples analyzed:\n\n8cb5cb204eab172befcdd5c923c128dd1016c21aaab72e7b31c0359a48d1357e (x64)\n095c13175e0908e67289bd5c619745ea905a73600ccb9c3f12df3e1c018e1346 (ARM)\n2da20a90a52e51897113438ac819362e5e04f8a7435c578d7d306afb482ac71e (MIPS)\n\n_Check out our latest_ _[Quarterly Threat Landscape Report for more details about recent](http://go.fortinet.com/LP=4272?utm_source=social&utm_medium=blog&utm_campaign=GEN-WP-Q4-2017-Fortinet-Threat-Landscape-Report&elq_src=Social&elq_cid=70134000001CrlBAAS&elq_staid=10&elq_eid=9168&elq_sid=9780)_\n_threats._\n\n_[Sign up for our weekly FortiGuard intel briefs or for our FortiGuard Threat Intelligence](https://www.fortinet.com/fortiguard/threat-intelligence/threat-research.html)_\n_Service._\n\n\n-----\n\n## Related Posts\n\nCopyright © 2022 Fortinet, Inc. All Rights Reserved\n\n[Terms of ServicesPrivacy Policy](https://www.fortinet.com/corporate/about-us/legal.html)\n| Cookie Settings\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-04-16 - Searching for the Reuse of Mirai Code- Hide ‘N Seek Bot.pdf"
    ],
    "report_names": [
        "2018-04-16 - Searching for the Reuse of Mirai Code- Hide ‘N Seek Bot.pdf"
    ],
    "threat_actors": [
        {
            "id": "f0bccc3d-ad77-49c4-8dfd-8a8a8d6fba26",
            "created_at": "2024-05-01T02:03:08.134022Z",
            "updated_at": "2025-03-27T02:05:17.415028Z",
            "deleted_at": null,
            "main_name": "NICKEL FOXCROFT",
            "aliases": [
                "Group 123 ",
                "Moldy Pisces ",
                "RICOCHET CHOLLIMA ",
                "Reaper ",
                "ScarCruft ",
                "APT37 "
            ],
            "source_name": "Secureworks:NICKEL FOXCROFT",
            "tools": [
                "ROKRAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9b02c527-5077-489e-9a80-5d88947fddab",
            "created_at": "2022-10-25T16:07:24.103499Z",
            "updated_at": "2025-03-27T02:02:10.108504Z",
            "deleted_at": null,
            "main_name": "Reaper",
            "aliases": [
                "APT 37",
                "ATK 4",
                "Cerium",
                "Crooked Pisces",
                "Geumseong121",
                "Group 123",
                "ITG10",
                "InkySquid",
                "Moldy Pisces",
                "Opal Sleet",
                "Operation Are You Happy?",
                "Operation Battle Cruiser",
                "Operation Black Banner",
                "Operation Daybreak",
                "Operation Dragon messenger",
                "Operation Erebus",
                "Operation Evil New Year",
                "Operation Evil New Year 2018",
                "Operation Fractured Block",
                "Operation Fractured Statue",
                "Operation FreeMilk",
                "Operation Golden Bird",
                "Operation Golden Time",
                "Operation High Expert",
                "Operation Holiday Wiper",
                "Operation Korean Sword",
                "Operation North Korean Human Right",
                "Operation Onezero",
                "Operation Rocket Man",
                "Operation SHROUDED#SLEEP",
                "Operation STARK#MULE",
                "Operation STIFF#BIZON",
                "Operation Spy Cloud",
                "Operation Star Cruiser",
                "Osmium",
                "Red Eyes",
                "Ricochet Chollima",
                "Ruby Sleet",
                "ScarCruft",
                "TA-RedAnt",
                "TEMP.Reaper",
                "Venus 121"
            ],
            "source_name": "ETDA:Reaper",
            "tools": [
                "Agentemis",
                "BLUELIGHT",
                "Backdoor.APT.POORAIM",
                "CARROTBALL",
                "CARROTBAT",
                "CORALDECK",
                "Cobalt Strike",
                "CobaltStrike",
                "DOGCALL",
                "Erebus",
                "Exploit.APT.RICECURRY",
                "Final1stSpy",
                "Freenki Loader",
                "GELCAPSULE",
                "GOLDBACKDOOR",
                "GreezeBackdoor",
                "HAPPYWORK",
                "JinhoSpy",
                "KARAE",
                "KevDroid",
                "Konni",
                "MILKDROP",
                "N1stAgent",
                "NavRAT",
                "Nokki",
                "Oceansalt",
                "POORAIM",
                "PoohMilk",
                "PoohMilk Loader",
                "RICECURRY",
                "RUHAPPY",
                "RokRAT",
                "SHUTTERSPEED",
                "SLOWDRIFT",
                "SOUNDWAVE",
                "SYSCON",
                "Sanny",
                "ScarCruft",
                "StarCruft",
                "Syscon",
                "VeilShell",
                "WINERACK",
                "ZUMKONG",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536242,
    "ts_updated_at": 1743041797,
    "ts_creation_date": 1653752344,
    "ts_modification_date": 1653752344,
    "files": {
        "pdf": "https://archive.orkl.eu/601fb779c0bd7d44301fb02556b8cf6bdd4d2b84.pdf",
        "text": "https://archive.orkl.eu/601fb779c0bd7d44301fb02556b8cf6bdd4d2b84.txt",
        "img": "https://archive.orkl.eu/601fb779c0bd7d44301fb02556b8cf6bdd4d2b84.jpg"
    }
}