{
    "id": "ad2d02a5-c280-4547-8aab-d87ef4f15cbb",
    "created_at": "2023-01-12T15:07:39.410367Z",
    "updated_at": "2025-03-27T02:09:10.98484Z",
    "deleted_at": null,
    "sha1_hash": "6a122a7bab7f18e9d5b201499d7057db6c671967",
    "title": "2017-03-21 - Inside the Hunt for Russia’s Most Notorious Hacker",
    "authors": "",
    "file_creation_date": "2022-05-28T01:59:18Z",
    "file_modification_date": "2022-05-28T01:59:18Z",
    "file_size": 10366209,
    "plain_text": "## Inside the Hunt for Russia’s Most Notorious Hacker\n\n**wired.com/2017/03/russian-hacker-spy-botnet/**\n\nGarrett M. Graff March 21, 2017\n\n\n-----\n\n# THE\n\n\n-----\n\n-----\n\nInside the Hunt\n\nfor Russia’s Most\n\nNotorious Hacker\n\nInside the Hunt for Russia’s Most Notorious Hacker\n\nby Garrett M. Graff | illustrations by Chad Hagen3.21.17\n\n[On the morning of December 30, the day after Barack Obama imposed sanctions on Russia](https://www.wired.com/2016/12/obama-russia-hacking-sanctions-diplomats/)\nfor interfering in the 2016 US election, Tillmann Werner was sitting down to breakfast in\nBonn, Germany. He spread some jam on a slice of rye bread, poured himself a cup of coffee,\nand settled in to check Twitter at his dining room table.\n\nThe news about the sanctions had broken overnight, so Werner, a researcher with the\ncybersecurity firm CrowdStrike, was still catching up on details. Following a link to an official\nstatement, Werner saw that the White House had targeted a short parade’s worth of Russian\nnames and institutions—two intelligence agencies, four senior intelligence officials, 35\n\n\n-----\n\ndiplomats, three tech companies, two hackers. Most of the details were a blur. Then Werner\nstopped scrolling. His eyes locked on one name buried among the targets: Evgeniy\nMikhailovich Bogachev.\n\nWerner, as it happened, knew quite a bit about Evgeniy Bogachev. He knew in precise,\ntechnical detail how Bogachev had managed to loot and terrorize the world’s financial\nsystems with impunity for years. He knew what it was like to do battle with him.\n\nBut Werner had no idea what role Bogachev might have played in the US election hack.\nBogachev wasn’t like the other targets—he was a bank robber. Maybe the most prolific bank\nrobber in the world.\n“What on earth is he doing on this list?” Werner wondered.\n\nAmerica’s war with Russia’s greatest cybercriminal began in the spring of 2009, when special\nagent James Craig, a rookie in the FBI’s Omaha, Nebraska, field office, began looking into a\nstrange pair of electronic thefts. A square-jawed former marine, Craig had been an agent for\njust six months, but his superiors tapped him for the case anyway, because of his\nbackground: For years, he’d been an IT guy for the FBI. One of his nicknames in college was\n“the silent geek.”\n\nWhile you log into seemingly secure websites, the malware modifies pages before they load,\nsiphoning away your credentials and your account balance.\n\nThe leading victim in the case was a subsidiary of the payments-processing giant First Data,\nwhich lost $450,000 that May. That was quickly followed by a $100,000 theft from a client of\nthe First National Bank of Omaha. What was odd, Craig noticed, was that the thefts seemed\nto have been executed from the victims’ own IP addresses, using their own logins and\npasswords. Examining their computers, he saw that they were infected with the same\nmalware: something called the Zeus Trojan horse.\n\nIn online security circles, Craig discovered, Zeus was notorious. Having first appeared in\n2006, the malware had a reputation among both criminals and security experts as a\nmasterpiece—smooth, effective, versatile. Its author was a phantom. He was only known\nonline, where he went by the handle Slavik, or lucky12345, or a half-dozen other names.\n\n\n-----\n\n[April 2017. Subscribe to WIRED.](https://subscribe.wired.com/subscribe/wired/103354?source=AMS_WIR_MAG_CARVEOUT&pos_name=AMS_WIR_MAG_CARVEOUT)\n\n\n-----\n\nZeus infected computers through fairly typical means: fake IRS emails, say, or illegitimate\nUPS shipping notices that tricked recipients into downloading a file. But once it was on your\ncomputer, Zeus let hackers play God: They could hijack websites and use a keystroke logger\nto record usernames, passwords, and PINs. Hackers could even modify login forms to\nrequest further valuable security information: a mother’s maiden name, a Social Security\nnumber. The ruse is known as a “man in the browser” attack. While you sit at your computer\nlogging into seemingly secure websites, the malware modifies pages before they load,\nsiphoning away your credentials and your account balance. Only when you log in from a\ndifferent computer do you even realize the money is gone.\n\nBy the time Craig started his investigation, Zeus had become the digital underground’s\nmalware of choice—the Microsoft Office of online fraud. Slavik was something rare in the\nmalware world: a genuine professional. He regularly updated the Zeus code, beta-testing\nnew features. His product was endlessly adaptable, with variants optimized for different kinds\nof attacks and targets. A computer infected with Zeus could even be folded into a botnet, a\nnetwork of infected computers that can be harnessed together to run spam servers or\ndistributed denial-of-service attacks, or send out more deceptive emails to spread the\nmalware further.\n\nBut sometime shortly before Craig picked up his case in 2009, Slavik had begun to change\ntack. He started cultivating an inner circle of online criminals, providing a select group with a\nvariant of his malware, called Jabber Zeus. It came equipped with a Jabber instant-message\nplug-in, allowing the group to communicate and coordinate attacks—like in the two Omaha\nthefts. Rather than rely on broad infection campaigns, they began to specifically target\ncorporate accountants and people with access to financial systems.\n\nAs Slavik turned increasingly to organized crime, he dramatically narrowed his retail malware\nbusiness. In 2010 he announced his “retirement” online and then released what security\nresearchers came to call Zeus 2.1, an advanced version of his malware protected by an\nencryption key—effectively tying each copy to a specific user—with a price tag upwards of\n$10,000 per copy. Now, Slavik was only dealing with an elite, ambitious group of criminals.\n\n“We had no idea how big this case was,” Craig says. “The amount of activity from these guys\nwas phenomenal.” Other institutions began to come forward with losses and accounts of\nfraud. Lots of them. Craig realized that, from his desk in suburban Omaha, he was chasing a\nwell-organized international criminal network. “The victims started falling out of the sky,”\nCraig says. It dwarfed any other cybercrime the FBI had tackled before.\n\n\n-----\n\nCraig s first major break in the case came in September 2009. With the help of some industry\nexperts, he identified a New York–based server that seemed to play some sort of role in the\nZeus network. He obtained a search warrant, and an FBI forensics team copied the server’s\ndata onto a hard drive, then overnighted it to Nebraska. When an engineer in Omaha\nexamined the results, he sat in awe for a moment. The hard drive contained tens of\nthousands of lines of instant message chat logs in Russian and Ukrainian. Looking over at\nCraig, the engineer said: “You have their Jabber server.”\n\nThis was the gang’s whole digital operation—a road map to the entire case. The\ncybersecurity firm Mandiant dispatched an engineer to Omaha for months just to help\nuntangle the Jabber Zeus code, while the FBI began cycling in agents from other regions on\n30- or 90-day assignments. Linguists across the country pitched in to decipher the logs. “The\nslang was a challenge,” Craig says.\n\nOne woman explained that she’d become a money mule after a job at a grocery store fell\nthrough, telling an agent: “I could strip, or I could do this.”\n\nThe messages contained references to hundreds of victims, their stolen credentials scattered\nin English throughout the files. Craig and other agents started cold-calling institutions, telling\nthem they had been hit by cyberfraud. He found that several businesses had terminated\nemployees they suspected of the thefts—not realizing that the individuals’ computers had\nbeen infected by malware and their logins stolen.\n\nThe case also expanded beyond the virtual world. In New York one day in 2009, three young\nwomen from Kazakhstan walked into the FBI field office there with a strange story. The\nwomen had come to the States to look for work and found themselves participating in a\ncurious scheme: A man would drive them to a local bank and tell them to go inside and open\na new account. They were to explain to the teller that they were students visiting for the\nsummer. A few days later, the man had them return to the bank and withdraw all of the\nmoney in the account; they kept a small cut and passed the rest on to him. Agents pieced\n[together that the women were “money mules”: Their job was to cash out the funds that Slavik](https://www.wired.com/2015/10/online-dating-made-woman-pawn-global-crime-plot/)\nand his comrades had siphoned from legitimate accounts.\n\nBy the summer of 2010, New York investigators had put banks across the region on alert for\nsuspicious cash-outs and told them to summon FBI agents as they occurred. The alert\nturned up dozens of mules withdrawing tens of thousands of dollars. Most were students or\nnewly arrived immigrants in Brighton Beach. One woman explained that she’d become a\nmule after a job at a grocery store fell through, telling an agent: “I could strip, or I could do\nthis.” Another man explained that he’d be picked up at 9 am, do cash-out runs until 3 pm,\nand then spend the rest of the day at the beach. Most cash-outs ran around $9,000, just\nenough to stay under federal reporting limits. The mule would receive 5 to 10 percent of the\ntotal, with another cut going to the recruiter. The rest of the money would be sent overseas.\n\n\n-----\n\nThe amount of organization these kids—they re in their twenties—were able to pull together\nwould’ve impressed any Fortune 100 company,” the FBI’s James Craig says.\n\nThe United States, moreover, was just one market in what investigators soon realized was a\nmultinational reign of fraud. Officials traced similar mule routes in Romania, the Czech\nRepublic, the United Kingdom, Ukraine, and Russia. All told, investigators could attribute\naround $70 million to $80 million in thefts to the group—but they suspected the total was far\nmore than that.\n\nBanks howled at the FBI to shut the fraud down and stanch the losses. Over the summer,\nNew York agents began to close in on high-ranking recruiters and the scheme’s masterminds\nin the US. Two Moldovans were arrested at a Milwaukee hotel at 11 pm following a tip; one\nsuspect in Boston tried to flee a raid on his girlfriend’s apartment and had to be rescued from\nthe fire escape.\n\nMeanwhile, Craig’s case in Omaha advanced against the broader Jabber Zeus gang. The\nFBI and the Justice Department had zeroed in on an area in eastern Ukraine around the city\nof Donetsk, where several of the Jabber Zeus leaders seemed to live. Alexey Bron, known\nonline as “thehead,” specialized in moving the gang’s money around the world. Ivan\nViktorvich Klepikov, who went by the moniker “petr0vich,” ran the group’s IT management,\nweb hosting, and domain names. And Vyacheslav Igorevich Penchukov, a well-known local\nDJ who went by the nickname “tank,” managed the whole scheme, putting him second in\ncommand to Slavik. “The amount of organization these kids—they’re in their twenties—were\nable to pull together would’ve impressed any Fortune 100 company,” Craig says. The gang\npoured their huge profits into expensive cars (Penchukov had a penchant for high-end\nBMWs and Porsches, while Klepikov preferred Subaru WRX sports sedans), and the chat\nlogs were filled with discussions of fancy vacations across Turkey, Crimea, and the United\nArab Emirates.\n\nBy the fall of 2010, the FBI was ready to take down the network. As officials in Washington\ncalled a high-profile press conference, Craig found himself on a rickety 12-hour train ride\nacross Ukraine to Donetsk, where he met up with agents from the country’s security service\nto raid tank’s and petr0 vich’s homes. Standing in petr0vich’s living room, a Ukrainian agent\ntold Craig to flash his FBI badge. “Show him it’s not just us,” he urged. Craig was stunned by\nthe scene: The hacker, wearing a purple velvet smoking jacket, seemed unperturbed as\nagents searched his messy apartment in a Soviet- style concrete building; his wife held their\nbaby in the kitchen, laughing with investigators. “This is the gang I’ve been chasing?” Craig\nthought. The raids lasted well into the night, and Craig didn’t return to his hotel until 3 am. He\ntook nearly 20 terabytes of seized data back to Omaha.\n\nWith 39 arrests around the world—stretching across four nations—investigators managed to\ndisrupt the network. But crucial players slipped away. One top mule recruiter in the US fled\nwest, staying a step ahead of investigators in Las Vegas and Los Angeles before finally\nescaping the country inside a shipping container. More important, Slavik, the mastermind\n\n\n-----\n\nhimself, remained almost a complete cipher. Investigators assumed he was based in Russia.\nAnd once, in an online chat, they saw him reference that he was married. Other than that,\nthey had nothing. The formal indictment referred to the creator of the Zeus malware using his\nonline pseu do nym. Craig didn’t even know what his prime suspect looked like. “We have\nthousands of photos from tank, petr0 vich—not once did we see Slavik’s mug,” Craig says.\nSoon even the criminal’s online traces vanished. Slavik, whoever he was, went dark. And\nafter seven years of chasing Jabber Zeus, James Craig moved on to other cases.\n\nAbout a year after the FBI shut down the Jabber Zeus ring, the small community of online\ncybersecurity researchers who watch for malware and botnets began to notice a new variant\nof Zeus emerge. The malware’s source code had been leaked online in 2011—perhaps\npurposefully, perhaps not—effectively turning Zeus into an open source project and setting\noff an explosion of new variants. But the version that caught the eyes of researchers was\ndifferent: more powerful and more sophisticated, particularly in its approach to assembling\nbotnets.\n\nUntil then, most botnets used a hub-and-spoke system—a hacker would program a single\ncommand server to distribute orders directly to infected machines, known as zombie\ncomputers. The undead army could then be directed to send out spam emails, distribute\nmalware, or target websites for denial -of-service attacks. That hub-and-spoke design,\nthough, made botnets relatively easy for law enforcement or security researchers to\ndismantle. If you could knock the command server offline, seize it, or disrupt a hacker’s\nability to communicate with it, you could usually break the botnet.\n\nThe gang’s strategy represented an evolutionary leap in organized crime: Now they could do\neverything remotely, never touching a US jurisdiction.\n\nThis new Zeus variant, however, relied on both traditional command servers and peer-topeer communication between zombie machines, making it extremely difficult to knock down.\nInfected machines kept a constantly updated list of other infected machines. If one device\nsensed that its connection with the command server had been interrupted, it would rely on\nthe peer-to-peer network to find a new command server.\n\nThe network, in effect, was designed from the start to be takedown-proof; as soon as one\ncommand server was knocked offline, the botnet owner could just set up a new server\nsomewhere else and redirect the peer-to-peer network to it. The new version became known\nas GameOver Zeus, after one of its file names, gameover2.php. The name also lent itself\nnaturally to gallows humor: Once this thing infects your computer, went a joke among\nsecurity experts, it’s game over for your bank accounts.\n\n\n-----\n\nAs far as anyone could tell, GameOver Zeus was controlled by a very elite group of hackers\n—and the group’s leader was Slavik. He had reemerged, more powerful than ever. Slavik’s\nnew crime ring came to be called the Business Club. A September 2011 internal\nannouncement to the group—introducing members to a new suite of online tools for\norganizing money transfers and mules—concluded with a warm welcome to Slavik’s select\nrecipients: “We wish you all successful and productive work.”\n\nLike the Jabber Zeus network, the Business Club’s prime directive was knocking over banks,\nwhich it did with even more ruthless inventiveness than its predecessor. The scheme was\nmultipronged: First, the GameOver Zeus malware would steal a user’s banking credentials,\nintercepting them as soon as someone with an infected computer logged into an online\naccount. Then the Business Club would drain the bank account, transferring its funds into\nother accounts they controlled overseas. With the theft complete, the group would use its\npowerful botnet to hit the targeted financial institutions with a denial-of-service attack to\ndistract bank employees and prevent customers from realizing their accounts had been\nemptied until after the money had cleared. On November 6, 2012, the FBI watched as the\nGameOver network stole $6.9 million in a single transaction, then hit the bank with a\nmultiday denial-of- service attack.\n\nUnlike the earlier Jabber Zeus gang, the more advanced network behind GameOver focused\non larger six- and seven-figure bank thefts—a scale that made bank withdrawals in Brooklyn\nobsolete. Instead, they used the globe’s interconnected banking system against itself, hiding\ntheir massive thefts inside the trillions of dollars of legitimate commerce that slosh around the\nworld each day. Investigators specifically identified two areas in far eastern China, close to\nthe Russian city of Vladivostok, from which mules funneled huge amounts of stolen money\ninto Business Club accounts. The strategy, investigators realized, represented an\nevolutionary leap in organized crime: Bank robbers no longer had to have a footprint inside\nthe US. Now they could do everything remotely, never touching a US jurisdiction. “That’s all it\ntakes to operate with impunity,” says Leo Taddeo, a former top FBI official.\n\n\n-----\n\nChad Hagan\n\n\n-----\n\nBanks weren t the gang s only targets. They also raided the accounts of nonfinancial\nbusinesses large and small, nonprofits, and even individuals. In October 2013, Slavik’s group\nbegan deploying malware known as CryptoLocker, a form of ransomware that would encrypt\nthe files upon an infected machine and force its owner to pay a small fee, say, $300 to $500,\nto unlock the files. It quickly became a favorite tool of the cybercrime ring, in part because it\nhelped transform dead weight into profit. The trouble with building a massive botnet focused\non high-level financial fraud, it turns out, is that most zombie computers don’t connect to fat\ncorporate accounts; Slavik and his associates found themselves with tens of thousands of\nmostly idle zombie machines. Though ransomware didn’t yield huge amounts, it afforded the\ncriminals a way to monetize these otherwise worthless infected computers.\n\nThe concept of ransomware had been around since the 1990s, but CryptoLocker took it\nmainstream. Typically arriving on a victim’s machine under the cover of an unassuming email\nattachment, the Business Club’s ransomware used strong encryption and forced victims to\npay using bitcoin. It was embarrassing and inconvenient, but many relented. The Swansea,\nMassachusetts, police department grumpily ponied up $750 to get back one of its computers\nin November 2013; the virus “is so complicated and successful that you have to buy these\nbitcoins, which we had never heard of,” Swansea police lieutenant Gregory Ryan told his\nlocal newspaper.\n\n“When a bank gets attacked en masse—100 transactions a week—you stop caring about the\nspecific malware and the individual attacks; you just need to stop the bleeding,” says one\nDutch security expert.\n\nThe following month, the security firm Dell SecureWorks estimated that as many as 250,000\nmachines worldwide had been infected with CryptoLocker that year. One researcher traced\n771 ransoms that netted Slavik’s crew a total of $1.1 million. “He was one of the first to\nrealize how desperate people would be to regain access to their files,” Brett Stone-Gross, a\nresearcher with Dell SecureWorks at the time, says of Slavik. “He didn’t charge an exorbitant\namount, but he made a lot of money and created a new type of online crime.”\n\nAs the GameOver network continued to gain strength, its operators kept adding revenue\nstreams—renting out their network to other criminals to deliver malware and spam or to carry\nout projects like click fraud, ordering zombie machines to generate revenue by clicking on\nads on fake websites.\n\nWith each passing week, the cost to banks, businesses, and individuals from GameOver\ngrew. For businesses, the thefts could easily wipe out a year’s profits, or worse.\nDomestically, victims ranged from a regional bank in north Florida to a Native American tribe\nin Washington state. As it haunted large swathes of the private sector, GameOver absorbed\nmore and more of the efforts of the private cybersecurity industry. The sums involved were\nstaggering. “I don’t think anyone has a grasp of the full extent—one $5 million theft\novershadows hundreds of smaller thefts,” explains Michael Sandee, a security expert at the\n\n\n-----\n\nDutch firm Fox-IT. When a bank gets attacked en masse—100 transactions a week—you\nstop caring about the specific malware and the individual attacks; you just need to stop the\nbleeding.”\n\nMany tried. From 2011 through 2013, cybersecurity researchers and various firms mounted\nthree attempts to take down GameOver Zeus. Three European security researchers teamed\nup to make a first assault in the spring of 2012. Slavik easily repelled their attack. Then, in\nMarch 2012, Microsoft’s Digital Crimes Unit took civil legal action against the network, relying\nupon US marshals to raid data centers in Illinois and Pennsylvania that housed Zeus\ncommand- and-control servers and aiming legal action against 39 individuals thought to be\nassociated with the Zeus networks. (Slavik was first on the list.) But Microsoft’s plan failed to\nput a dent in GameOver. Instead it merely clued Slavik in to what investigators knew about\nhis network and allowed him to refine his tactics.\n\nBotnet fighters are a small, proud group of engineers and security researchers—selfproclaimed “internet janitors” who work to keep online networks running smoothly. Within that\ngroup, Tillmann Werner—the tall, lanky German researcher with the security firm\nCrowdStrike—had become known for his flair and enthusiasm for the work. In February 2013\nhe seized control of the Kelihos botnet, an infamous malware network built on Viagra spam,\nlive onstage during a presentation at the cybersecurity industry’s biggest conference. But\nKelihos, he knew, was no GameOver Zeus. Werner had been watching GameOver since its\ninception, marveling at its strength and resilience.\n\nIn 2012 he had linked up with Stone-Gross—who was just a few months out of graduate\nschool and was based in California—plus a few other researchers to map out an effort to\nattack GameOver. Working across two continents largely in their spare time, the men plotted\ntheir attack via online chat. They carefully studied the previous European effort, identifying\nwhere it had failed, and spent a year preparing their offensive.\n\nAt the peak of their attack, the researchers controlled 99 percent of Slavik’s network—but\nthey’d overlooked a critical source of resilience in GameOver’s structure.\n\nIn January 2013, they were ready: They stocked up on pizza, assuming they were in for a\nlong siege against Slavik’s network. (When you go against a botnet, Werner says, “you have\none shot. It either goes right or wrong.”) Their plan was to reroute GameOver’s peer-to-peer\nnetwork, centralize it, and then redirect the traffic to a new server under their control—a\nprocess known as “sinkholing.” In doing so, they hoped to sever the botnet’s communication\nlink to Slavik. And at first, everything went well. Slavik showed no signs of fighting back, and\nWerner and Stone-Gross watched as more and more infected computers connected to their\nsinkhole by the hour.\n\n\n-----\n\nAt the peak of their attack, the researchers controlled 99 percent of Slavik s network—but\nthey’d overlooked a critical source of resilience in GameOver’s structure: a small subset of\ninfected computers were still secretly communicating with Slavik’s command servers. “We\nmissed that there’s a second layer of control,” Stone-Gross says. By the second week, Slavik\nwas able to push a software update to his whole network and reassert his authority. The\nresearchers watched with dawning horror as a new version of GameOver Zeus propagated\nacross the internet and Slavik’s peer-to-peer network began to reassemble. “We immediately\nsaw what happened—we’d completely neglected this other channel of communication,”\nWerner says.\n\nThe researchers’ ploy—nine months in the making—had failed. Slavik had won. In a trollish\nonline chat with a Polish security team, he crowed about how all the efforts to seize his\nnetwork had come to naught. “I don’t think he thought it was possible to take down his\nbotnet,” Werner says. Dejected, the two researchers were eager to try again. But they\nneeded help—from Pittsburgh.\n\nOver the past decade, the FBI’s Pittsburgh field office has emerged as the source of the\ngovernment’s biggest cybercrime indictments, thanks in no small part to the head of the local\ncybersquad there, a onetime furniture salesman named J. Keith Mularski.\n\nAn excitable and gregarious agent who grew up around Pittsburgh, Mularski has become\nsomething of a celebrity in cyber security circles. He joined the FBI in the late ’90s and spent\nhis first seven years in the bureau working espionage and terrorism cases in Washington,\nDC. Jumping at the chance to return home to Pittsburgh, he joined a new cyber initiative\nthere in 2005, despite the fact that he knew little about computers. Mularski trained on the\njob during a two-year undercover investigation chasing identity thieves deep in the online\nforum DarkMarket. Under the screen name Master Splyntr—a handle inspired by Teenage\nMutant Ninja Turtles—Mularski managed to become a DarkMarket administrator, putting\nhimself at the center of a burgeoning online criminal community. In his guise, he even\nchatted online with Slavik and reviewed an early version of the Zeus malware program. His\nDarkMarket access eventually helped investigators arrest 60 people across three continents.\n\nEven after millions of dollars in thefts, neither the FBI nor the security industry had so much\nas a single Business Club member’s name.\n\nIn the years that followed, the head of the Pittsburgh office decided to invest aggressively in\ncombating cybercrime—a bet on its increasing importance. By 2014, the FBI agents in\nMularski’s squad, together with another squad assigned to a little-known Pittsburgh\ninstitution called the National Cyber-Forensics and Training Alliance, were prosecuting some\nof the Justice Department’s biggest cases. Two of Mularski’s agents, Elliott Peterson and\n\n\n-----\n\nSteven J. Lampo, were chasing the hackers behind GameOver Zeus, even as their deskmates simultaneously investigated a case that would ultimately indict five Chinese army\nhackers who had penetrated computer systems at Westinghouse, US Steel, and other\ncompanies to benefit Chinese industry.\n\nThe FBI’s GameOver case had been under way for about a year by the time Werner and\nStone-Gross offered to join forces with the Pittsburgh squad to take down Slavik’s botnet. If\nthey had approached any other law-enforcement agency, the response might have been\ndifferent. Government cooperation with industry was still a relatively rare phenomenon; the\nFeds’ style in cyber cases was, by reputation, to hoover up industry leads without sharing\ninformation. But the team in Pittsburgh was unusually practiced at collaboration, and they\nknew that the two researchers were the best in the field. “We jumped at the chance,”\nMularski says.\n\nBoth sides realized that in order to tackle the botnet, they needed to work on three\nsimultaneous fronts. First, they had to figure out once and for all who was running\nGameOver—what investigators call “attribution”—and build up a criminal prosecution; even\nafter millions of dollars in thefts, neither the FBI nor the security industry had so much as a\nsingle Business Club member’s name. Second, they needed to take down the digital\ninfrastructure of GameOver itself; that’s where Werner and Stone-Gross came in. And third,\nthey needed to disable the botnet’s physical infrastructure by assembling court orders and\nenlisting the help of other governments to seize its servers across the globe. Once all that\nwas done, they needed partners in the private sector to be ready with software updates and\nsecurity patches to help recover infected computers the moment the good guys had control\nof the botnet. Absent any one of those moves, the next effort to take down GameOver Zeus\nwas likely to fail just as the previous ones had.\n\nThe network was run through two password-protected British websites, which contained\ncareful records, FAQs, and a “ticket” system for resolving technical issues.\n\nWith that, Mularski’s squad began to stitch together an international partnership unlike\nanything the US government had ever undertaken, enlisting the UK’s National Crime Agency,\nofficials in Switzerland, the Netherlands, Ukraine, Luxembourg, and a dozen other countries,\nas well as industry experts at Microsoft, CrowdStrike, McAfee, Dell SecureWorks, and other\ncompanies.\n\nFirst, to help nail down Slavik’s identity and get intelligence on the Business Club, the FBI\nteamed up with Fox-IT, a Dutch outfit renowned for its expertise in cyber- forensics. The\nDutch researchers got to work tracing old usernames and email addresses associated with\nSlavik’s ring to piece together an understanding of how the group operated.\n\nThe Business Club, it turned out, was a loose confederation of about 50 criminals, who each\npaid an initiation fee to access GameOver’s advanced control panels. The network was run\nthrough two password-protected British websites, Visitcoastweekend.com and\n\n\n-----\n\nWork.businessclub.so, which contained careful records, FAQs, and a ticket system for\nresolving technical issues. When investigators got legal permission to penetrate the\nBusiness Club server, they found a highly detailed ledger tracking the group’s various\nongoing frauds. “Everything radiated professionalism,” Fox-IT’s Michael Sandee explains.\nWhen it came to pinpointing the precise timing of transactions between financial institutions,\nhe says, “they probably knew better than the banks.”\n\n\n-----\n\nChad Hagan\n\n\n-----\n\nOne Day, after months of following leads, the investigators at Fox-IT got a tip from a source\nabout an email address they might want to look into. It was one of many similar tips they’d\nchased down. “We had a lot of bread crumbs,” Mularski says. But this one led to something\nvital: The team was able to trace the email address to a British server that Slavik used to run\nthe Business Club’s websites. More investigative work and more court orders eventually led\nauthorities to Russian social media sites where the email address was connected to a real\nname: Evgeniy Mikhailovich Bogachev. At first it was meaningless to the group. It took\nweeks’ more effort to realize that the name actually belonged to the phantom who had\ninvented Zeus and created the Business Club.\n\nSlavik, it turned out, was a 30-year-old who lived an upper-middle-class existence in Anapa,\na Russian resort city on the Black Sea. Online photos showed that he enjoyed boating with\nhis wife. The couple had a young daughter. One photo showed Bogachev posing in leopardprint pajamas and dark sunglasses, holding a large cat. The investigative team realized that\nhe had written the first draft of Zeus when he was just 22 years old.\n\nThe team couldn’t find specific evidence of a link between Bogachev and the Russian state,\nbut some entity seemed to be feeding Slavik specific terms to search for in his vast network\nof zombie computers.\n\nBut that wasn’t the most astounding revelation that the Dutch investigators turned up. As\nthey continued their analysis, they noticed that someone at the helm of GameOver had been\nregularly searching tens of thousands of the botnet’s infected computers in certain countries\nfor things like email addresses belonging to Georgian intelligence officers or leaders of elite\nTurkish police units, or documents that bore markings designating classified Ukrainian\nsecrets. Whoever it was was also searching for classified material linked to the Syrian\nconflict and Russian arms dealing. At some point, a light bulb went off. “These are espionage\ncommands,” Sandee says.\n\nGameOver wasn’t merely a sophisticated piece of criminal malware; it was a sophisticated\nintelligence- gathering tool. And as best as the investigators could determine, Bogachev was\nthe only member of the Business Club who knew about this particular feature of the botnet.\nHe appeared to be running a covert operation right under the noses of the world’s most\nprolific bank robbers. The FBI and Fox-IT team couldn’t find specific evidence of a link\nbetween Bogachev and the Russian state, but some entity seemed to be feeding Slavik\nspecific terms to search for in his vast network of zombie computers. Bogachev, it appeared,\nwas a Russian intelligence asset.\n\nIn March 2014, investigators could even watch as an international crisis played out live inside\nthe snow globe of Bogachev’s criminal botnet. Weeks after the Sochi Olympics, Russian\nforces seized the Ukrainian region of Crimea and began efforts to destabilize the country’s\neastern border. Right in step with the Russian campaign, Bogachev redirected a section of\n\n\n-----\n\nhis botnet to search for politically sensitive information on infected Ukrainian computers—\ntrawling for intelligence that might help the Russians anticipate their adversaries’ next\nmoves.\n\nThe team was able to construct a tentative theory and history of Bogachev’s spycraft. The\napparent state connection helped explain why Bogachev had been able to operate a major\ncriminal enterprise with such impunity, but it also shed new light on some of the milestones in\nthe life of Zeus. The system that Slavik used to make his intelligence queries dated back\napproximately to the moment in 2010 when he faked his retirement and made access to his\nmalware far more exclusive. Perhaps Slavik had appeared on the radar of the Russian\nsecurity services at some point that year, and in exchange for a license to commit fraud\nwithout prosecution—outside Russia, of course—the state made certain demands. To carry\nthem out with maximum efficacy and secrecy, Slavik asserted tighter control over his criminal\nnetwork.\n\nThe discovery of Bogachev’s likely intelligence ties introduced some trickiness to the\noperation to take down GameOver—especially when it came to the prospect of enlisting\nRussian cooperation. Otherwise, the plan was rumbling along. Now that the investigators\nhad zeroed in on Bogachev, a grand jury could finally indict him as the mastermind behind\nGameOver Zeus. American prosecutors scrambled to bring together civil court orders to\nseize and disrupt the network. “When we were really running, we had nine people working\nthis—and we only have 55 total,” says Michael Comber of the US Attorney’s office in\nPittsburgh. Over a span of months, the team painstakingly went to internet service providers\nto ask permission to seize GameOver’s existing proxy servers, ensuring that at the right\nmoment, they could flip those servers and disable Slavik’s control. Meanwhile, the\nDepartment of Homeland Security, Carnegie Mellon, and a number of antivirus companies\nreadied themselves to help customers regain access to their infected computers. Weekly\nconference calls spanned continents as officials coordinated action in Britain, the US, and\nelsewhere.\n\nBy late spring 2014, as pro-Russian forces fought in Ukraine proper, the American- led forces\ngot ready to move in on GameOver. They’d been plotting to take down the network for more\nthan a year, carefully reverse-engineering the malware, covertly reading the criminal gang’s\nchat logs to understand the group’s psychology, and tracing the physical infrastructure of\nservers that allowed the network to propagate around the globe. “By this point, these\nresearchers knew the malware better than the author,” says Elliott Peterson, one of the lead\nFBI agents on the case. As Mularski recalls, the team checked off all the crucial boxes:\n“Criminally, we can do it. Civilly, we can do it. Technically we can do it.” Working with a cast\nof dozens, communicating with more than 70 internet service providers and a dozen other\nlaw enforcement agencies from Canada to the United Kingdom to Japan to Italy, the team\nreadied an attack to commence on Friday, May 30.\n\n\n-----\n\nThe week leading up to the attack was a frantic scramble. When Werner and Stone-Gross\narrived in Pittsburgh, Peterson had them over to his family’s apartment, where his kids\ngawked at Werner and his German accent. Over dinner and Fathead beer, they took stock of\ntheir looming attempt. They were running way behind—Werner’s code wasn’t close to being\nready. Over the rest of the week, as Werner and Stone-Gross raced to finish writing, another\nteam assembled the last court orders, and still others ran herd on the ad hoc group of two\ndozen governments, companies, and consultants who were helping to take GameOver Zeus\ndown. The White House had been briefed on the plan and was waiting for results. But the\neffort seemed to be coming apart at the seams.\n\nFor instance, the team had known for months that the GameOver botnet was controlled by a\nserver in Canada. But then, just days before the attack, they discovered that there was a\nsecond command server in Ukraine. The realization made hearts drop. “If you’re not even\naware of the second box,” Werner says, “how sure are you that there’s not a third box?”\n\nBogachev readied for battle—wrestling for control of his network, testing it, redirecting traffic\nto new servers, and deciphering the Pittsburgh team’s method of attack.\n\nOn Thursday, Stone-Gross carefully talked more than a dozen internet service providers\nthrough the procedures they needed to follow as the attack launched. At the last minute, one\nkey service provider backed out, fearful that it would incur Slavik’s wrath. Then, on Friday\nmorning, Werner and Stone-Gross arrived at their office building on the banks of the\nMonongahela River to find that one of the operation’s partners, McAfee, had prematurely\npublished a blog post announcing the attack on the botnet, titled “It’s ‘Game Over’ for Zeus\nand Cryptolocker.”\n\nAfter frantic calls to get the post taken down, the attack finally began. Canadian and\nUkrainian authorities shut down GameOver’s command servers, knocking each offline in\nturn. And Werner and Stone-Gross began redirecting the zombie computers into a carefully\nbuilt “sinkhole” that would absorb the nefarious traffic, blocking the Business Club’s access to\nits own systems. For hours, the attack went nowhere; the researchers struggled to figure out\nwhere the bugs lay in their code.\n\nBy 1 pm, their sinkhole had drawn in only about a hundred infected computers, an\ninfinitesimal percentage of the botnet that had grown to as many as half a million machines.\nA line of officials stood behind Werner and Stone-Gross in a conference room, literally\nwatching over their shoulders as the two engineers debugged their code. “Not to put any\npressure on you,” Mularski urged at one point, “but it’d be great if you could get it running.”\n\n\n-----\n\nFinally, by evening Pittsburgh time, the traffic to their sinkhole began to climb. On the other\nside of the world, Bogachev came online. The attack had interrupted his weekend. Perhaps\nhe didn’t think much of it at first, given that he had easily weathered other attempts to seize\ncontrol of his botnet. “Right away, he’s kicking the tires. He doesn’t know what we’ve done,”\nPeterson recalls. That night, yet again, Bogachev readied for battle—wrestling for control of\nhis network, testing it, redirecting traffic to new servers, and deciphering the Pittsburgh\nteam’s method of attack. “It was cyber-hand-to-hand combat,” recalls Pittsburgh US attorney\nDavid Hickton. “It was amazing to watch.”\n\nThe team was able to monitor Bogachev’s communication channels without his knowledge\nand knock out his Turkish proxy server. Then they watched as he tried to come back online\nusing the anonymizing service Tor, desperate to get some visibility into his losses. Finally,\nafter hours of losing battles, Slavik went silent. The attack, it appeared, was more than he\nhad bargained for. The Pittsburgh team powered on through the night. “He must’ve realized it\nwas law enforcement. It wasn’t just the normal researcher attack,” Stone-Gross says.\n\nBy Sunday night, nearly 60 hours in, the Pittsburgh team knew they’d won. On Monday, June\n2, the FBI and Justice Department announced the takedown and unsealed a 14-count\nindictment against Bogachev.\n\nOver the coming weeks, Slavik and the researchers continued to do occasional battle—\nSlavik timed one counter attack for a moment when Werner and Stone-Gross were\npresenting at a conference in Montreal—but ultimately the duo prevailed. Amazingly, more\nthan two years later, the success has largely stuck: The botnet has never reassembled,\nthough about 5,000 computers worldwide remain infected with Zeus malware. The industry\npartners are still maintaining the server sinkhole that’s swallowing up the traffic from those\ninfected computers.\n\nFor about a year after the attack, so-called account-takeover fraud all but disappeared in the\nUS. Researchers and investigators had long assumed that dozens of gangs must have been\nresponsible for the criminal onslaught that the industry endured between 2012 and 2014. But\nnearly all of the thefts came from just a small group of highly skilled criminals—the so-called\nBusiness Club. “You come into this and hear they’re everywhere,” Peterson says, “and\nactually it’s a very tiny network, and they’re much easier to disrupt than you think.”\n\nIn 2015, the State Department put a $3 million bounty on Bogachev’s head, the highest\nreward the US has ever posted for a cyber criminal. But he remains at large. According to US\nintelligence sources, the government does not, in fact, suspect that Bogachev took part in\nthe Russian campaign to influence the US election. Rather, the Obama administration\nincluded him in the sanctions to put pressure on the Russian government. The hope is that\n\n\n-----\n\nthe Russians might be willing to hand over Bogachev as a sign of good faith, since the botnet\nthat made him so useful to them is defunct. Or maybe, with the added attention, someone\nwill decide they want the $3 million reward and tip off the FBI.\n\nThe uncomfortable truth is that Bogachev and other Russian cybercriminals lie pretty far\nbeyond America’s reach.\n\nBut the uncomfortable truth is that Bogachev and other Russian cybercriminals lie pretty far\nbeyond America’s reach. The huge questions that linger over the GameOver case—like\nthose surrounding Bogachev’s precise relationship to Russian intelligence and the full tally of\nhis thefts, which officials can only round to the nearest $100 million or so—foreshadow the\nchallenges that face the analysts looking into the election hacks. Fortunately, the agents on\nthe case have experience to draw from: The DNC breach is reportedly being investigated by\nthe FBI’s Pittsburgh office.\n\nIn the meantime, Mularski’s squad and the cybersecurity industry have also moved on to new\nthreats. The criminal tactics that were so novel when Bogachev helped pioneer them have\nnow grown commonplace. The spread of ransomware is accelerating. And today’s botnets—\n[especially Mirai, a network of infected Internet of Things devices—are even more dangerous](https://www.wired.com/2016/11/web-shaking-mirai-botnet-splintering-also-evolving/)\nthan Bogachev’s creations.\n\nNobody knows what Bogachev himself might be cooking up next. Tips continue to arrive\nregularly in Pittsburgh regarding his whereabouts. But there are no real signs he has\nreemerged. At least not yet.\n\nGarrett M. Graff _[(@vermontgmg) wrote about James Clapper in issue 24.12.](http://twitter.com/vermontgmg)_\n\n_[This article appears in the April issue. Subscribe now.](https://subscribe.wired.com/subscribe/wired/105121?source=AMS_WIR_EndofArticle_TextLink_MagContent&pos_name=AMS_WIR_EndofArticle_TextLink_MagContent)_\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-03-21 - Inside the Hunt for Russia’s Most Notorious Hacker.pdf"
    ],
    "report_names": [
        "2017-03-21 - Inside the Hunt for Russia’s Most Notorious Hacker.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "dfee8b2e-d6b9-4143-a0d9-ca39396dd3bf",
            "created_at": "2022-10-25T16:07:24.467088Z",
            "updated_at": "2025-03-27T02:02:10.241387Z",
            "deleted_at": null,
            "main_name": "Circles",
            "aliases": [],
            "source_name": "ETDA:Circles",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "91ff2504-6c1a-4eaa-832b-2c5e297426c5",
            "created_at": "2022-10-25T16:47:55.740817Z",
            "updated_at": "2025-03-27T02:05:17.358938Z",
            "deleted_at": null,
            "main_name": "GOLD EVERGREEN",
            "aliases": [
                "The Business Club"
            ],
            "source_name": "Secureworks:GOLD EVERGREEN",
            "tools": [
                " JabberZeus",
                " Pony",
                " Zeus",
                "CryptoLocker"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536059,
    "ts_updated_at": 1743041350,
    "ts_creation_date": 1653703158,
    "ts_modification_date": 1653703158,
    "files": {
        "pdf": "https://archive.orkl.eu/6a122a7bab7f18e9d5b201499d7057db6c671967.pdf",
        "text": "https://archive.orkl.eu/6a122a7bab7f18e9d5b201499d7057db6c671967.txt",
        "img": "https://archive.orkl.eu/6a122a7bab7f18e9d5b201499d7057db6c671967.jpg"
    }
}