{
    "id": "ad6e8a17-9268-42cd-8492-c38500afd999",
    "created_at": "2022-10-25T16:48:22.157508Z",
    "updated_at": "2025-03-27T02:06:00.792752Z",
    "deleted_at": null,
    "sha1_hash": "0b792ff94ca71eeb71aba780286f7c4bf9f75b40",
    "title": "New Version Of Osx.Sabpub & Confirmed Mac Apt Attacks",
    "authors": "Kaspersky",
    "file_creation_date": "2014-12-11T15:29:16Z",
    "file_modification_date": "2014-12-11T15:29:16Z",
    "file_size": 193283,
    "plain_text": "[Late last week, we found evidence of a possible link between a Mac OS X backdoor trojan and an APT](https://www.securelist.com/en/blog/208193467/SabPub_Mac_OS_X_Backdoor_Java_Exploits_Targeted_Attacks_and_Possible_APT_link)\n\n[attack known as LuckyCat. The IP address of the C&C to which this bot connects (199.192.152.*) was also](http://t.co/BYJ1lnBX)\n\nused in other Windows malware samples during 2011, which made us believe we were looking at the same\n\nentity behind these attacks.\n\nFor the past two days, we have been monitoring a “fake” infected system - which is a typical procedure we\n\ndo for APT bots. We were extremely surprised when during the weekend, the APT controllers took over\n\nour “goat” infected machine and started exploring it.\n\nOn Friday Apri 13, port 80 on the C&C server located at rt*****.onedumb.com and hosted on a VPS in\n\nFremont, U.S. was closed. Saturday, the port was opened and bot started communicating with the C&C\n\nserver. For the entire day, the traffic was just basic handshakes and exchanges, nothing more.\n\nOn the morning of Sunday April 15, the traffic generated by the C&C changed. The attackers took over the\n\nconnection and started analysing our fake victim machine. They listed the contents of the root and home\n\nfolders and even stole some of the goat documents we put in there!\n\n\n-----\n\n_Encoded communication between C&C and our fake victim_\n\n_Packet above, decoded - attacker is listing folders content_\n\n\n-----\n\nmanually checks the infected machines and extracts data from them.\n\n**We can therefore confirm SabPub as APT in active stage.**\n\nOn Sunday midday, the C&C domain was shutdown and the bot lost connection to it; this appears to be an\n\ninitiative from the free DNS service onedumb.com and it was no doubt triggered by the media attention.\n\nInterestingly, the VPS used as the C&C is still active.\n\nWhile analysing SabPub, we discovered another version of the backdoor which seems to have been created\n\nearlier. This version differs from the original one only slightly -- the hardcoded C&C address is different -\ninstead of the onedumb.com subdomain used by the original sample (hardcoded in the bot as\n\n“e3SCNUA2Om97ZXJ1fGI+Y4Bt”), this one simply contains the IP address of the VPS (hardcoded as\n\n“OjlDLjw5Pi4+NUAuQDBA”), meaning, it should still be operational. Its size is 42556 bytes vs 42580\n\nfor the original one.\n\nOne of the biggest mysteries is the infection vector of these attacks. Given the highly targeted nature of the\n\nattack, there are very few traces. Nevertheless, we found an important detail which is the missing link: Six\n\nMicrosoft Word documents, which we detect as Exploit.MSWord.CVE-2009-0563.a. In total we have\n\nsix relevant Word .docs with this verdict -- with four dropping the MaControl bot. The remaining two\n\n**drop SabPub.**\n\nThe most interesting thing here is the history of the second SabPub variant. In our virus collection, it is\n\nnamed “8958.doc”. This suggests iit was extracted from a Word document or was distributed as a Doc-file.\n\nWe performed an analysis of the same and traced its origin by the MD5\n\n(40C8786A4887A763D8F3E5243724D1C9). The results were fascinating:\n\n- The sample was uploaded to VirusTotal on February 25, 2012 – from two sources in the U.S.\n\n- In both cases, the original file name was “10th March Statemnet” (yes, with the typo and without\n\nextension)\n\n- Zero detections on VirusTotal at that time (0/40)\n\nIn case you are wondering, the name of the file (“10th March Statemnet”) is directly linked with the Dalai\nLama and Tibetan community. On March 10, 2011, the Dalai-Lama released a special statement related to\n\nAnniversary of the Tibetan People’s National Uprising Day -- hence the name.\n\n\n-----\n\n_Properties field of a document used to spread SabPub_\n\nUnfortunately there is little information in the doc files, but the Author field and the creation date are\n\ninteresting. In particular, if we trust the creation date, this means the container DOC was created in\n\nAugust 2010 and it was updated in 2012 with the SabPub sample. This is quite normal for such attacks\n\nand we have seen it in other cases, for instance, Duqu.\n\nWe think the above facts show a direct connection between the SabPub and Luckycat APT attacks. We are\n\npretty sure the SabPub backdoor was created as far back as February 2012 and was distributed via spear\nphishing emails.\n\n[It is also important to point that SabPub isn’t backdoor MaControl (the case was described here) but still](http://labs.alienvault.com/labs/index.php/2012/ms-office-exploit-that-targets-macos-x-seen-in-the-wild-delivers-mac-control-rat/)\n\n\n-----\n\nremained undetected for almost two months!\n\nThe second variant of SabPub was created in March and the attackers are using Java exploits to infect\n\ntarget Mac OS X machines.\n\nSabPub is still an active attack and we expect the attackers will release new variants of the bot with new\n\nC2s over the next days/weeks.\n\n**To summarize:**\n\n- At least two variants of the SabPub bot exist today.\n\n- The earliest version of the bot appears to have been created and used in February 2012.\n\n[- The malware is being spread through Word documents that exploit the CVE-2009-0563 vulnerability.](http://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2009-0563)\n\n- SabPub is different from MaControl, another bot used in APT attacks in February 2012; SabPub was\n\nmore effective because it stayed undetected for more than 1.5 months.\n\n- the APT behind SabPub is active at the time of writing.\n\n- Thanks to Aleks Gostev and Igor Soumenkov for the analysis.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/ew3h0mve5lf5x69ydjd1sm1r380rqy4k",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2012/2012.04.16.OSX.SabPub/OSX_SabPub.pdf"
    ],
    "report_names": [
        "OSX_SabPub"
    ],
    "threat_actors": [
        {
            "id": "1a651080-cb2f-49bb-87cb-b9c6f6f99ce9",
            "created_at": "2022-10-25T16:07:23.809467Z",
            "updated_at": "2025-03-27T02:02:09.988548Z",
            "deleted_at": null,
            "main_name": "Lucky Cat",
            "aliases": [],
            "source_name": "ETDA:Lucky Cat",
            "tools": [
                "Comfoo",
                "Comfoo RAT",
                "Lucky Cat",
                "LuckyCat",
                "Sojax",
                "Syndicasec",
                "WMI Ghost",
                "Wimmie"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "9792e41f-4165-474b-99fa-e74ec332bd87",
            "created_at": "2023-01-06T13:46:38.986789Z",
            "updated_at": "2025-03-27T02:00:02.970288Z",
            "deleted_at": null,
            "main_name": "Lucky Cat",
            "aliases": [
                "White Dev 9",
                "TA413"
            ],
            "source_name": "MISPGALAXY:Lucky Cat",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716502,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1418311756,
    "ts_modification_date": 1418311756,
    "files": {
        "pdf": "https://archive.orkl.eu/0b792ff94ca71eeb71aba780286f7c4bf9f75b40.pdf",
        "text": "https://archive.orkl.eu/0b792ff94ca71eeb71aba780286f7c4bf9f75b40.txt",
        "img": "https://archive.orkl.eu/0b792ff94ca71eeb71aba780286f7c4bf9f75b40.jpg"
    }
}