{
    "id": "ad7c1b23-2ae8-4b1a-a20f-ab2900d38d87",
    "created_at": "2023-01-12T14:59:44.784899Z",
    "updated_at": "2025-03-27T02:05:38.696364Z",
    "deleted_at": null,
    "sha1_hash": "945a7311f6b695eb373736b63db17e7b757ddbe2",
    "title": "2019-12-17 - Nuclear Bot Author Arrested in Sextortion Case",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:16Z",
    "file_modification_date": "2022-05-28T04:10:16Z",
    "file_size": 526708,
    "plain_text": "# Nuclear Bot Author Arrested in Sextortion Case\n\n**[krebsonsecurity.com/2019/12/nuclear-bot-author-arrested-in-sextortion-case/](https://krebsonsecurity.com/2019/12/nuclear-bot-author-arrested-in-sextortion-case/)**\n\nLast summer, [a wave of sextortion emails began flooding inboxes around the world. The](https://krebsonsecurity.com/2018/07/sextortion-scam-uses-recipients-hacked-passwords/)\nspammers behind this scheme claimed they’d hacked your computer and recorded videos of\nyou watching porn, and promised to release the embarrassing footage to all your contacts\nunless a bitcoin demand was paid. Now, French authorities say they’ve charged two men\nthey believe are responsible for masterminding this scam. One of them is a 21-year-old\nhacker interviewed by KrebsOnSecurity in 2017 who openly admitted to authoring a banking\ntrojan called “Nuclear Bot.”\n\nOn Dec. 15, the French news daily Le Parisien [published a report stating that French](http://www.leparisien.fr/faits-divers/l-incroyable-cyber-escroquerie-au-porno-d-un-francais-de-21-ans-14-12-2019-8217375.php)\nauthorities had arrested and charged two men in the sextortion scheme. The story doesn’t\nname either individual, but rather refers to one of the accused only by the pseudonym\n“Antoine I.,” noting that his first had been changed (presumably to protect his identity\nbecause he hasn’t yet been convicted of a crime).\n\n“According to sources close to the investigation, Antoine I. surrendered to the French\nauthorities at the beginning of the month, after being hunted down all over Europe,” the story\nnotes. “The young Frenchman, who lived between Ukraine, Poland and the Baltic countries,\nwas indicted on 6 December for ‘extortion by organized gang, fraudulent access to a data\nprocessing system and money laundering.’ He was placed in pre-trial detention.”\n\nAccording to Le Parisien, Antoine I. admitted to being the inventor of the initial 2018\n[sextortion scam, which was subsequently imitated by countless other ne’er-do-wells. The](https://krebsonsecurity.com/2018/08/whos-behind-the-screencam-extortion-scam/)\nstory says the two men deployed malware to compromise at least 2,000 computers that were\nused to blast out the sextortion emails.\n\n[While that story is light on details about the identities of the accused, an earlier version of it](http://www.leparisien.fr/faits-divers/escroquerie-au-crypto-porno-un-pirate-doue-mais-instable-psychologiquement-14-12-2019-8217504.php)\npublished Dec. 14 includes more helpful clues. The Dec. 14 piece said Antoine I. had been\ninterviewed by KrebsOnSecurity in April 2017, where he boasted about having created\nNuclear Bot, a malware strain designed to steal banking credentials from victims.\n\n[My April 2017 exposé featured an interview with Augustin Inzirillo, a young man who came](https://krebsonsecurity.com/2017/04/self-proclaimed-nuclear-bot-author-weighs-u-s-job-offer/)\nacross as deeply conflicted about his chosen career path. That path became traceable after\nhe released the computer code for Nuclear Bot on GitHub. Inzirillo outed himself by\n\n\n-----\n\ndefending the sophistication of his malware after it was ridiculed by both security researchers\nand denizens of the cybercrime underground, where copies of the code wound up for sale.\nFrom that story:\n\n“It was a big mistake, because now I know people will reuse my code to steal money\nfrom other people,” Inzirillo told KrebsOnSecurity in an online chat.\n\nInzirillo released the code on GitHub with a short note explaining his motivations, and\nincluded a contact email address at a domain (inzirillo.com) set up long ago by his\nfather, Daniel Inzirillo.\n\nKrebsOnSecurity also reached out to Daniel, and heard back from him roughly an hour\nbefore Augustin replied to requests for an interview. Inzirillo the elder said his son used\nthe family domain name in his source code release as part of a misguided attempt to\nimpress him.\n\n“He didn’t do it for money,” said Daniel Inzirillo, whose CV shows he has built an\nimpressive career in computer programming and working for various financial\ninstitutions. “He did it to spite all the cyber shitheads. The idea was that they wouldn’t\nbe able to sell his software anymore because it was now free for grabs.”\n\nIf Augustin Inzirillo ever did truly desire to change his ways, it wasn’t clear from his apparent\nactions last summer: The Le Parisien story says the sextortion scams netted the Frenchman\nand his co-conspirator at least a million Euros.\n\nIn August 2018, KrebsOnSecurity was contacted by a researcher working with French\nauthorities on the investigation who said he suspected the young man was bragging on\nTwitter that he used a custom version of Nuclear Bot dubbed “TinyNuke” to steal funds from\ncustomers of French and Polish banks.\n\n\n-----\n\nThe source said this individual used the now-defunct Twitter account @tiny_gang1 to taunt\nFrench authorities, while showing off a fan of 100-Euro notes allegedly gained from his illicit\nactivities (see image above). It seemed to the source that Inzirillo wanted to get caught,\nbecause at one point @tiny_gang1 even privately shared a copy of Inzirillo’s French\npassport to prove his identity and accomplishments to the researcher.\n\n“He modified the Tinynuke’s config several times, and we saw numerous modifications in the\nmalware code too,” the source said. “We tried to compare his samples with the leaked code\navailable on GitHub and we noticed that the guy actually was using a more advanced version\nwith features that don’t exist in the publicly available repositories. As an example, custom\nsamples have video recording functionality, socks proxy and other features. So the guy\nclearly improved the source code and recompiled a new version for every new campaign.”\n\n\n-----\n\nThe source said the person behind the @tiny_gang Twitter account attacked French targets\nwith custom versions of TinyNuke in one to three campaigns per week earlier this year,\n[harvesting French bank accounts and laundering the stolen funds via a money mule network](https://krebsonsecurity.com/?s=money+mule&x=0&y=0)\nbased mostly in the United Kingdom.\n\n“If the guy behind this campaign is the malware author, it could easily explain the\nmodifications happening with the malware, and his French is pretty good,” the researcher\ntold KrebsOnSecurity. “He’s really provocative and I think he wants to be arrested in France\nbecause it could be a good way to become famous and maybe prove that his malware works\n(to resell it after?).”\n\nThe source said the TinyNuke author threatened him with physical harm after the researcher\ninsulted his intelligence while trying to goad him into disclosing more details about his\ncybercrime activities.\n\n“The guy has a serious ego problem,” the researcher said. “He likes when we talk about him\nand he hates when we mock him. He got really angry as time went by and started personally\nthreatening me. In the last [TinyNuke malware configuration file] targeting Poland we found a\nlong message dedicated to me with clear physical threats.”\n\nAll of the above is consistent with the findings detailed in the Le Parisien report, which\nquoted French investigators saying Antoine I. in October 2019 used a now-deleted Twitter\naccount to taunt the authorities into looking for him. In one such post, he included a picture of\nhimself holding a beer, saying: “On the train to Naples. You should send me a registered\nletter instead of threatening guys informally.”\n\nThe Le Parisien story also said Antoine I. threatened a researcher working with French\nauthorities on the investigation (the researcher is referred to pseudonymously as “Marc”).\n\n“I make a lot more money than you, I am younger, more intelligent,” Antoine I. reportedly\nwrote in July 2018 to Marc. “If you do not stop playing with me, I will put a bullet in your\nhead. ”\n\nFrench authorities say the defendant managed his extortion operations while traveling\nthroughout Ukraine and other parts of Eastern Europe. But at some point he decided to\nreturn home to France, despite knowing investigators there were hunting him. According to\nLe Parisien, he told the French authorities he wanted to cooperate in the investigation and\nthat he no longer wished to live like a fugitive.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-12-17 - Nuclear Bot Author Arrested in Sextortion Case.pdf"
    ],
    "report_names": [
        "2019-12-17 - Nuclear Bot Author Arrested in Sextortion Case.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535584,
    "ts_updated_at": 1743041138,
    "ts_creation_date": 1653711016,
    "ts_modification_date": 1653711016,
    "files": {
        "pdf": "https://archive.orkl.eu/945a7311f6b695eb373736b63db17e7b757ddbe2.pdf",
        "text": "https://archive.orkl.eu/945a7311f6b695eb373736b63db17e7b757ddbe2.txt",
        "img": "https://archive.orkl.eu/945a7311f6b695eb373736b63db17e7b757ddbe2.jpg"
    }
}