{
    "id": "ada92fc3-39e9-4263-87f2-d7c50b08afce",
    "created_at": "2023-01-12T15:07:45.498122Z",
    "updated_at": "2025-03-27T02:14:42.917382Z",
    "deleted_at": null,
    "sha1_hash": "1fbccc80a678cefb70b9dfe29d8d69e3f7ed465c",
    "title": "2014-10-02 - Occupy Central- The Umbrella Revolution and Chinese Intelligence",
    "authors": "",
    "file_creation_date": "2022-05-28T04:05:38Z",
    "file_modification_date": "2022-05-28T04:05:38Z",
    "file_size": 621636,
    "plain_text": "# Occupy Central: The Umbrella Revolution and Chinese Intelligence\n\n**[crowdstrike.com/blog/occupy-central-the-umbrella-revolution-and-chinese-intelligence/](https://www.crowdstrike.com/blog/occupy-central-the-umbrella-revolution-and-chinese-intelligence/)**\n\nOctober 2, 2014\n\nOctober 2, 2014\n\n[Adam Kozy](https://www.crowdstrike.com/blog/author/kozy/) [Research & Threat Intel](https://www.crowdstrike.com/blog/category/threat-intel-research/)\n\nFirst observed in late 2013, the People’s Republic of China (PRC) has steadily increased\nthe use of its intelligence services and cyber operations in Hong Kong as part of a response\nto the growing protests supporting universal suffrage and democracy headed by Occupy\nCentral (和平占中). The Hong Kong protests fueled fears in the Chinese Communist Party\n(CCP), which perceives them as a threat to its one-party rule in mainland China. This\nperceived threat likely prompted the flurry of malicious cyber activity taken against various\norganizations and citizens operating in support of the protests within Hong Kong.\n\nMake no mistake, the CCP, which made public protests illegal following the brutal\nTiananmen Square crackdown in 1989, likely sees the situation in Hong Kong as one of the\nbiggest threats it has faced in recent history, as the protests have the potential to inspire\nmainland Chinese to take similar action against perceived injustices. The observed multi\n\n-----\n\npronged approach Beijing has taken to collect information on the protests, disrupt\ncommunications between protestors, and block media coverage of the events in the PRC\ndemonstrates how seriously the CCP regards the unfolding events.\n\nThe methods used have been a smattering of cyber tactics and HUMINT (on the ground)\nmethods to collect information about leaders of the Occupy Central Movement, locations of\nits supporters, and to gain an overall picture of Hong Kong citizens’ perception of the\nprotests. This began with strategic web compromises of key websites associated with\nOccupy Central in late 2013, followed by extensive HUMINT activities carried out by\nsuspected Ministry of State Security (MSS) officers likely designed to elicit information from\ninfluential figures in Hong Kong and pressure them to support Beijing’s stance in exchange\nfor gifts.\n\nFollowing a PRC white paper stating that candidates for Hong Kong’s Chief Executive “must\nlove China”, the Occupy Central movement organized an online referendum, which drew\nover 780,000 votes. At the height of voting, a massive DDoS attack attempted to take down\nthe voting platform, Popvote, via a variety increasingly persistent Layer 3 and 4 network\nattacks, as well as more advanced Layer 7 attacks. Although the attack traffic came from\neverywhere BUT China, the recent appearance of a new Chinese DDoS tool and observed\nChina-based targeted intrusion activity connected to the attacks indicates some sloppy\ncover-ups from what was likely PRC involvement. CrowdStrike Intelligence customers have\naccess to additional reporting on this subject.\n\nMore recently, in late September, Android mobile malware disguised as an Occupy Central\nsupport application was actually designed to target Hong Kong users associated with the\nmovement. The malware collected call information and texts of the users, and also mapped\ntheir GPS locations. One of the Command-and-Control (C2) servers for this malware\nconnected back to a user with ties to legacy Chinese hackers and the current Chinese\nhacking underground. Another malware variant targeting users of the iOS mobile platform\nwas recently discovered that is believed to serve a similar purpose.\n\nIn addition, a decoy document using Occupy Central as a lure was discovered around the\nsame time and shares a callback with previously observed SABRE PANDA activity, which is\nbelieved to have a mandate of targeting dissidents and perceived threats to CCP rule.\nAdditional targeted intrusion activity likely targeting organizations related to this prodemocracy movement have also been identified. CrowdStrike Intelligence customers have\naccess to additional reporting on this subject.\n\nDespite the attempted sabotage and information collection operations, Occupy Central has\ncontinued to gain momentum over the past week, receiving an unexpected boon in the form\nof student protests beginning Friday, 26 September 2014, which lasted through the\nweekend. Occupy Central had originally stated its mass protests would coincide with the\n\n\n-----\n\npublic holiday China National Day, beginning on Wednesday, 1 October, however, studentled protests and the storming of Hong Kong government buildings prompted the group to\ntake action earlier than anticipated.\n\nMany of the protestors are aware of the surveillance activities taking place and have\nresorted to peer-to-peer messaging services such as Firechat, which uses either Bluetooth\nor Apple’s Multipeer Connectivity feature to exchange messages to other users within 200\nfeet. Although the messages are public and not encrypted, they allow protestors to\ncommunicate even without Internet connectivity. It is almost certain that MSS officers are in\nplace to intercept some of these messages, although the sheer numbers associated with\nthe protests likely make full coverage difficult.\n\nThe conglomeration of student and Occupy Central protestors, currently christened the\nUmbrella Revolution for their use of umbrellas to block tear gas canisters fired by Hong\nKong Police, demanded the resignation of current Chief Executive LEUNG Chun-ying (梁振\n英), which LEUNG declined to do. In response, the protestors have occupied more\ngovernment buildings.\n\nFor now, LEUNG and the Hong Kong government appear content with playing the waiting\ngame in order to outlast the protestors (weeks if necessary), as they see defying Beijing’s\nwishes as an infeasible option. However, increasingly assertive activity by the Umbrella\nRevolution will likely push this timeline up significantly. Keeping Central shut down for\nweeks would be detrimental to Hong Kong’s economy and much of the world’s financial\nhealth given Hong Kong’s status as the world’s third most important financial center.\nConsidering that the protestors have been extremely peaceful thus far, LEUNG has\nrefrained from mobilizing more riot police, realizing that the first use of riot police and tear\ngas against protestors only spurred more Hong Kongers to join the Umbrella Revolution.\n\nFor its part, Beijing has been fairly reserved in its overt response, with the mainland media\nand CCP mouthpieces sticking to the rhetoric that the protests are illegal and organized by\n“radicals”. But Beijing is in a precarious position – on the one hand, it absolutely cannot\nacquiesce to the protestors demands and give up its control over the current electoral\nprocess in Hong Kong, but the CCP is also feeling the pressure as it desperately tries to\nkeep news of the democratic protests away from curious mainlanders via its censorship\njuggernaut, relying instead on the Hong Kong government to handle the situation for the\nmoment. Although it is projecting an image of calm, measured responses to the unfolding\nevents, the balancing act may not be sustainable for much longer.\n\nSupport for the Umbrella Revolution has spread to Taiwan and Macau, confirming the\nCCP’s fears that the movement could carry enough potency to eventually infiltrate the\nmainland. In addition to massive amounts of censorship, the Chinese Ministry of Public\nSecurity (MPS) has already rounded up the mainland political activists supporting the\nmovement.\n\n\n-----\n\nThe movements of the PRC s intelligence services and cyber forces show that the CCP is\nanything but calm about the protests, and they are engaged in ongoing operations to\ndiscredit the movement and collect information about its supporters. Sending the Chinese\nPeople’s Liberation Army (PLA) soldiers into Central is a last-resort option for Beijing, as the\ninternational backlash would be swift without proper predication.\n\nThe collection efforts underway may be staging for forthcoming disinformation campaigns\ndesigned to show the leaders of the Umbrella Revolution as radicals capable of violence.\nGiven that the protestors have been remarkably peaceful, the goal may be to initiate a\ncatalyst of sort to spark violence. This would become predication for further PRC\ninvolvement, echoing the ongoing situation in Ukraine, where Russian “peacekeeping\noperations” have become a frequent mantra. Already there are almost laughable attempts\nby both the PRC and Russia to credit the protests as being elaborate operations carried out\nby American and British intelligence services.\n\nAs the Umbrella Revolution continues, expect more cyber activity from China-based\nadversaries and their proxies to occur in the background until the standoff reaches a climax,\nafter which there may be entirely different sets of activity with more damaging\nconsequences.\n\nCrowdStrike Intelligence provides customers with actionable threat intelligence about\nadversaries, including but not limited to those mentioned in this post. For further information\nand technical indicators on observed activity surrounding the protests in Hong Kong, please\ncontact [intelligence@crowdstrike.com and inquire about Falcon Intelligence, our Cyber](http://10.10.0.46/mailto:intelligence@crowdstrike.com)\nThreat Intelligence subscription.\n\nRelated Content\n\n\n-----\n\nWho is EMBER BEAR?\n\n\n-----\n\nA Tale of Two Cookies: How to Pwn2Own the Cisco RV340 Router\n\nPROPHET SPIDER Exploits Citrix ShareFile Remote Code Execution Vulnerability CVE-2021-22941 to\nDeliver Webshell\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2014/2014-10-02 - Occupy Central- The Umbrella Revolution and Chinese Intelligence.pdf"
    ],
    "report_names": [
        "2014-10-02 - Occupy Central- The Umbrella Revolution and Chinese Intelligence.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a6d9dd5d-b19c-4d48-b842-e34893e72a06",
            "created_at": "2022-10-25T16:07:23.273213Z",
            "updated_at": "2025-03-27T02:02:09.711826Z",
            "deleted_at": null,
            "main_name": "Sabre Panda",
            "aliases": [],
            "source_name": "ETDA:Sabre Panda",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c28760b2-5ec6-42ad-852f-be00372a7ce4",
            "created_at": "2022-10-27T08:27:13.172734Z",
            "updated_at": "2025-03-27T02:00:55.511386Z",
            "deleted_at": null,
            "main_name": "Ember Bear",
            "aliases": [
                "Ember Bear",
                "UNC2589",
                "Bleeding Bear",
                "DEV-0586",
                "Cadet Blizzard",
                "Frozenvista",
                "UAC-0056"
            ],
            "source_name": "MITRE:Ember Bear",
            "tools": [
                "P.A.S. Webshell",
                "CrackMapExec",
                "ngrok",
                "WhisperGate",
                "Saint Bot",
                "PsExec",
                "Rclone",
                "Impacket",
                "OutSteel"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "056826cb-6e17-4954-a9b4-2cc8c6ae3cb8",
            "created_at": "2023-03-04T02:01:54.115678Z",
            "updated_at": "2025-03-27T02:00:03.125249Z",
            "deleted_at": null,
            "main_name": "Prophet Spider",
            "aliases": [
                "GOLD MELODY",
                "UNC961"
            ],
            "source_name": "MISPGALAXY:Prophet Spider",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "083d63b2-3eee-42a8-b1bd-54e657a229e8",
            "created_at": "2022-10-25T16:07:24.143338Z",
            "updated_at": "2025-03-27T02:02:10.12138Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "Ember Bear",
                "FROZENVISTA",
                "Lorec53",
                "Nascent Ursa",
                "Nodaria",
                "SaintBear",
                "Storm-0587",
                "TA471",
                "UAC-0056",
                "UNC2589"
            ],
            "source_name": "ETDA:SaintBear",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Elephant Client",
                "Elephant Implant",
                "GraphSteel",
                "Graphiron",
                "GrimPlant",
                "OutSteel",
                "Saint Bot",
                "SaintBot",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "eecf54a2-2deb-41e5-9857-fed94a53f858",
            "created_at": "2023-01-06T13:46:39.349959Z",
            "updated_at": "2025-03-27T02:00:03.057647Z",
            "deleted_at": null,
            "main_name": "SaintBear",
            "aliases": [
                "UAC-0056",
                "Nascent Ursa",
                "Nodaria",
                "FROZENVISTA",
                "Storm-0587",
                "Lorec53",
                "Lorec Bear",
                "UNC2589",
                "TA471",
                "DEV-0587",
                "Saint Bear",
                "EMBER BEAR",
                "Bleeding Bear"
            ],
            "source_name": "MISPGALAXY:SaintBear",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "47b52642-e5b8-4502-b714-b625002d86aa",
            "created_at": "2024-06-19T02:03:08.086579Z",
            "updated_at": "2025-03-27T02:05:17.385492Z",
            "deleted_at": null,
            "main_name": "GOLD MELODY",
            "aliases": [
                "UNC961",
                "PROPHET SPIDER"
            ],
            "source_name": "Secureworks:GOLD MELODY",
            "tools": [
                " 7-ZIP",
                " AUDITUNNEL",
                " BURP Suite",
                " GOTROJ",
                " JSP webshells",
                " Mimikatz",
                " Wget",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d4fa3dd1-7c2b-46c0-b90f-2741410572b5",
            "created_at": "2023-01-06T13:46:38.633201Z",
            "updated_at": "2025-03-27T02:00:02.878664Z",
            "deleted_at": null,
            "main_name": "SABRE PANDA",
            "aliases": [],
            "source_name": "MISPGALAXY:SABRE PANDA",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536065,
    "ts_updated_at": 1743041682,
    "ts_creation_date": 1653710738,
    "ts_modification_date": 1653710738,
    "files": {
        "pdf": "https://archive.orkl.eu/1fbccc80a678cefb70b9dfe29d8d69e3f7ed465c.pdf",
        "text": "https://archive.orkl.eu/1fbccc80a678cefb70b9dfe29d8d69e3f7ed465c.txt",
        "img": "https://archive.orkl.eu/1fbccc80a678cefb70b9dfe29d8d69e3f7ed465c.jpg"
    }
}