{
    "id": "ae0930c8-3683-41f8-803a-532cd284f394",
    "created_at": "2023-01-12T15:06:54.391009Z",
    "updated_at": "2025-03-27T02:09:18.042274Z",
    "deleted_at": null,
    "sha1_hash": "f06e0f96ccab7be81621c50b41f6bc3e09fb9403",
    "title": "2020-11-10 - Trickbot down but is it out",
    "authors": "",
    "file_creation_date": "2022-05-25T12:14:41Z",
    "file_modification_date": "2022-05-25T12:14:41Z",
    "file_size": 374346,
    "plain_text": "# Trickbot down, but is it out?\n\n**[intel471.com/blog/trickbot-update-november-2020-bazar-loader-microsoft](https://intel471.com/blog/trickbot-update-november-2020-bazar-loader-microsoft)**\n\nNov 10, 2020\n\n## Summary\n\nSince the separate and independent actions taken against Trickbot, we have observed\nsuccessful disruption of its command and control infrastructure. However, the actors linked\nto Trickbot have not ceased their criminal activities. These actors have continued engaging in\nransomware activity, using BazarLoader instead of Trickbot. We are unable to assess the\nlong-term impact of the Trickbot disruption activity or whether Trickbot will continue to be\nused by cybercrime groups. This analysis covers the period from Sept. 22, 2020 until Nov. 6,\n2020.\n\n## The battle begins: Sept. 22 - Oct. 12, 2020\n\n[The first blow Intel 471 observed was believed to be struck by the U.S. Cyber Command [1] on](https://www.washingtonpost.com/national-security/cyber-command-trickbot-disrupt/2020/10/09/19587aae-0a32-11eb-a166-dc429b380d10_story.html)\nSept. 22, 2020. Utilizing their access to Trickbot command and control servers, Cyber\nCommand operators are believed to have modified several Trickbot configuration files that\nwere sent by their C&C infrastructure to Trickbot-infected systems. Their actions were\nbelieved to be intended to render the bots unable to communicate with Trickbot’s control\nservers. Responding to this disruption, Trickbot operators stabilized their operation within\n24 hours, restoring working configuration files on their command and control servers. Cyber\nCommand struck again, poisoning the Trickbot configuration files for a second time. This\ntime the botnet operators needed more time to restore their servers. The impact of this action\nwas a loss of an unknown number of bots from their botnet. However, the actors linked to\nTrickbot are efficient at identifying high-value targets from within their pool of already\ncompromised systems and using second-stage tools such as Cobalt Strike to maintain\npersistent access to these networks. As a result, the actors maintained access to systems\nwhere they already were engaged in follow-on intrusion activity.\n\n\n-----\n\nThe image reflects the poisoned Trickbot plug-in server configuration.\n\n## Microsoft joins the fray: Oct. 12, 2020\n\nIt was unclear exactly when Microsoft began their own action against Trickbot, but they\n[announced their action publicly on Oct. 12, 2020 [2]. Unsealed indictments contained a list](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)\nof IP addresses that Intel 471 identified as belonging to Trickbot or Bazar control server\n[infrastructure [3]. In that indictment, Microsoft appealed to the court to order U.S. hosting](https://noticeofpleadings.com/trickbot/)\ncompanies responsible for hosting Trickbot controller infrastructure to shut down the\ninfrastructure and “transfer any content and software hosted at the IP addresses” to\nMicrosoft. However, we believe Microsoft also successfully impacted Trickbot’s\ninfrastructure that was outside the jurisdiction of U.S. courts.\n\n## War of attrition: Oct. 13 - Nov. 1, 2020\n\nFrom Oct. 13, 2020, to Nov. 1, 2020, we began to see the impact of Microsoft's takedown\nactions against Trickbot’s infrastructure. During this period, we observed that a significant\namount of Trickbot’s infrastructure was rendered inoperable while the Trickbot operators\nwere setting up new infrastructure in response. This allowed Trickbot to maintain an active\nand working command and control infrastructure, which was degraded significantly\ncompared to the previous month prior to any action. During this time, Trickbot operators\nalso initiated new infection campaigns via the Emotet malware-as-a-service (MaaS) (see:\nscreenshot below) and other mass-spam sources to rebuild their botnet.\n\n\n-----\n\nTrickbot was distributed by the Emotet service Oct. 19, 2020.\n\n## Current state of affairs: Oct. 28 - Nov. 6, 2020\n\nBetween Oct. 28, 2020 and Nov. 6, 2020, we have not seen any new Trickbot infection\ncampaigns in our monitoring nor in open source reporting. We observed the number of\nactive and working Trickbot control servers being reduced over time and we were unable to\nidentify any working Trickbot control servers as of Nov. 6.\n\n\n-----\n\nThe number of active Trickbot control servers diminished in October 2020.\n\n## BazarLoader instead of Trickbot?\n\n[Reports from security researchers [4][5] and the U.S. Cybersecurity and Infrastructure](https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/)\nSecurity Agency (CISA) indicate a recent resurgence of ransomware incidents involving the\nRyuk ransomware. This strain of ransomware was frequently linked to Trickbot by security\n[researchers [6]. In these recent Ryuk attacks, incident responders have reported that instead](https://unit42.paloaltonetworks.com/ryuk-ransomware/)\nof seeing Trickbot in the initial stages of an incident, they saw a different malware known as\nBazarLoader aka KEGTAP. BazarLoader is linked to the Trickbot operators in many ways,\nincluding shared infrastructure and code similarities. This indicates the actors linked to\nTrickbot continue to launch targeted ransomware attacks successfully despite the disruption\nof the Trickbot infrastructure. It was unclear whether the Trickbot operators will return to\nusing Trickbot or will completely move to using BazarLoader as a replacement.\n\nRegardless of the switch from Trickbot to BazarLoader, we are encouraged by the overall\nimpact of disruption activity against Trickbot’s infrastructure. At the very least, this\ndisruption activity caused the actors behind Trickbot to spend time and effort setting up new\n\n\n-----\n\ninfrastructure instead of impacting and ransoming victims.\n\n## Update - Nov. 10, 2020\n\nThis blog post covers the period Sep 22, 2020 to Nov 6, 2020. On Nov 9, 2020, we did see a\nnew version of Trickbot that was distributed via a spam campaign (gtag tar2).\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-10 - Trickbot down but is it out.pdf"
    ],
    "report_names": [
        "2020-11-10 - Trickbot down but is it out.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536014,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653480881,
    "ts_modification_date": 1653480881,
    "files": {
        "pdf": "https://archive.orkl.eu/f06e0f96ccab7be81621c50b41f6bc3e09fb9403.pdf",
        "text": "https://archive.orkl.eu/f06e0f96ccab7be81621c50b41f6bc3e09fb9403.txt",
        "img": "https://archive.orkl.eu/f06e0f96ccab7be81621c50b41f6bc3e09fb9403.jpg"
    }
}