{
    "id": "ae46aa03-8633-4457-9e34-04e7cea0e7c6",
    "created_at": "2023-01-12T15:03:11.47752Z",
    "updated_at": "2025-03-27T02:08:00.241322Z",
    "deleted_at": null,
    "sha1_hash": "caafb0918cfac47c221409800694f3947a6769f9",
    "title": "2019-04-15 - New HawkEye Reborn Variant Emerges Following Ownership Change",
    "authors": "",
    "file_creation_date": "2022-05-27T21:58:16Z",
    "file_modification_date": "2022-05-27T21:58:16Z",
    "file_size": 3833311,
    "plain_text": "# New HawkEye Reborn Variant Emerges Following Ownership Change\n\n**[blog.talosintelligence.com/2019/04/hawkeye-reborn.html](https://blog.talosintelligence.com/2019/04/hawkeye-reborn.html)**\n\n_[Edmund Brumaghin and](https://www.blogger.com/profile/10442669663667294759)_ _[Holger Unterbrink authored this blog post.](https://blogs.cisco.com/author/holgerunterbrink)_\n\n## Executive summary\n\n\n-----\n\nMalware designed to steal sensitive information has been a threat to organizations around\nthe world for a long time. The emergence of the greyware market and the increased\ncommercialization of keyloggers, stealers, and remote access trojans (RATs) has magnified\nthis threat by reducing the barrier to entry for attackers. In many cases, the adversaries\nleveraging these tools do not need to possess programming skills or in-depth computer\nscience expertise, as they are now being provided as commercial offerings across the\ncybercriminal underground. We have previously released in-depth analyses of these types of\nthreats and how malicious attackers are leveraging them to attack organizations\nwith [Remcos in August and](https://blog.talosintelligence.com/2018/08/picking-apart-remcos.html) [Agent Tesla in October.](https://blog.talosintelligence.com/2018/10/old-dog-new-tricks-analysing-new-rtf_15.html)\n\nHawkEye is another example of a malware kit that is actively being marketed across various\nhacking forums. Over the past several months, Talos observed ongoing malware distribution\ncampaigns attempting to leverage the latest version of the HawkEye keylogger/stealer,\nHawkEye Reborn v9, against organizations to steal sensitive information and account\ncredentials for use in additional attacks and account compromise.\n\n## History of HawkEye\n\nHawkEye is a malware kit that has been around for several years and has seen continuous\ndevelopment and iterations since at least 2013. It is commonly sold on various hacking\nforums as a keylogger and stealer that can be used to monitor systems and exfiltrate\ninformation from those systems. It features robust stealing capabilities as it can be used to\nobtain sensitive information from a variety of different applications. This information can then\nbe transmitted to the attacker using protocols such as FTP, HTTP, and SMTP. Talos has\nrecently identified several changes concerning HawkEye Reborn in the latest version,\nHawkEye Reborn v9.\n\nIn December 2018, a thread on HackForums described a change in the ownership and\nongoing development of the HawkEye keylogger.\n\nShortly following this exchange, new posts began to appear that were attempting to market\nand sell new versions of HawkEye (HawkEye Reborn v9), with these new posts also\nreferencing the change in ownership of the project moving forward.\n\n\n-----\n\nHawkEye Reborn v9 is currently marketed as an \"Advance Monitoring Solution.\" It is\ncurrently being sold using a licensing model, with purchasers gaining access to the software\nand updates for different periods based on a tiered pricing model.\n\nHawkEye Reborn v9 also features a Terms of Service agreement that provides some\nadditional insight. While the seller specifies that HawkEye Reborn should only be used on\nsystems with permission, they also explicitly forbid scanning of HawkEye Reborn\nexecutables using antivirus software, likely an attempt to minimize the likelihood that antimalware solutions will detect HawkEye Reborn binaries.\n\n\n-----\n\nFollowing these changes, the new developer of HawkEye Reborn has continued to make\nchanges and we expect this to continue as long as the developer can monetize their efforts.\n\nAs with other malware that we wrote about last year, while the developer claims that the\nsoftware should only be used on systems with permission, or \"for educational purposes,\"\nmalicious attackers have been continuously leveraging it against various targets around the\nworld.\n\n## Distribution campaigns\n\nFor several months during the last half of 2018 and continuing into 2019, Cisco Talos has\nobserved ongoing malicious email campaigns that are being used to distribute versions of\nthe HawkEye Reborn keylogger/stealer. The current version, HawkEye Reborn v9 has been\nmodified from earlier versions and heavily obfuscated to make analysis more difficult.\n\n\n-----\n\nThe email campaigns that have been observed feature characteristics that are consistent\nwith what is commonly seen with malspam campaigns, with the emails purporting to be\nassociated with various documents such as invoices, bills of materials, order confirmations,\nand other corporate functions. An example of one of these emails is below:\n\n**Figure 1: Example email message**\n\nWhile the current email contains leverage malicious Microsoft Excel files, earlier campaigns\nhave also been observed leveraging RTF and DOC files. Additionally, a small number of\ncampaigns over this same period also made use of various file-sharing platforms like\nDropbox for hosting the malicious documents rather than directly attaching them to the\nmessages themselves.\n\n\n-----\n\n**Figure 2: Example malicious Excel document**\n\n[Similar to the technique described in our previous blog about Remcos, the contents of the](https://blog.talosintelligence.com/2018/08/picking-apart-remcos.html)\ndocuments have been intentionally made to appear as if they are blurry, with the user being\nprompted to enable editing to have a clearer view of the contents.\n\nAnother interesting characteristic of the malicious documents is that the metadata associated\nwith the document files themselves also matches that found in many of the malicious\ndocuments that were previously being used to spread Remcos.\n\n\n-----\n\n**Figure 3: Document metadata**\n\nAdditionally, the creation and modification dates associated with these documents are shortly\nafter we released a detailed analysis of Remcos distribution campaigns that were being\nobserved throughout 2018.\n\nAssuming the victim opens the attachment, the infection process begins as described in the\nfollowing section.\n\nMany of the distribution servers that are being used to host the HawkEye keylogger binaries\nthat are retrieved during the infection process are hosting large numbers of malicious\nbinaries and, in many cases, contain open directory listings that can be used to identify the\nscope of the infections that they are being used to facilitate. In many cases, additional\nstealers, RATs, and other malware were observed being hosted on the same web servers.\n\n\n-----\n\n## Analysis of HawkEye Reborn\n\nThe campaign starts with sending the aforementioned Excel sheets that exploit the wellknown [CVE-2017-11882 vulnerability, an arbitrary code execution bug in Microsoft Office.](https://nvd.nist.gov/vuln/detail/CVE-2017-11882)\n[The exploit works similarly to what we saw with Agent Tesla in October. It leverages a buffer](https://blog.talosintelligence.com/2018/10/old-dog-new-tricks-analysing-new-rtf_15.html)\noverflow in the Equation Editor, which occurs if someone hands over a font name that's too\nlong. The shellcode starts after the MTEF font tag \"08 13 36\" in this case.\n\nAfter execution in the Equation Editor (EQNEDT32.EXE) context, it downloads the malicious\ndata from the malware server as you can see in the ThreatGrid Process Timeline screenshot\nbelow. After a successful download, it creates and starts the RegAsm.exe process.\n\n\n-----\n\nThis RegAsm.exe process is a heavily obfuscated AutoIT script compiled into a PE. After\ndecompiling it from the PE file, it is heavily obfuscated and still almost unreadable.\n\nWe deobfuscated the script to understand how the infection process works. It first creates the\n\"winrshost\" mutex. Then, it extracts the final payload malware from two objects in the PE\nresource section (capisp1, appsruprov2).\n\n\n-----\n\nIt concatenates them and uses AES to decrypt the result, using the hardcoded key\n\"pydbdio…\" which is handed over to the DecryptData function (see above). The screen\ncapture below shows the decryption function.\n\nIt then calls the StartAndPatchRegAsm function.\n\nThis function tries to find the original Microsoft RegAsm executable path. It hands over the\ndecrypted buffer extracted from the resource section and the path from the original RegAsm\nexecutable to the start_protect_hexcode function.\n\n\n-----\n\nThen it starts the process-hollowing shellcode, which is stored in the HEXCODE1 variable.\nThis shellcode injects the final payload taken from the resource section into the original\n[RegAsm.exe process. The shellcode in HEXCODE1 is very similar to this RunPE example.](https://github.com/Zer0Mem0ry/RunPE/blob/master/RunPE.cpp)\n\nThe AutoIT script is offering a lot of other functions which are not used in this campaign, like\nanti-virtual machine detection, USB drive infection and others.\n\nThe final payload — which we found in the AutoIT PE file resource section and was started\nby the process-hollowing shellcode — is a .NET PE file that's obfuscated with ConfuserEx.\n\n\n-----\n\nDeobfuscated, we can see it is the HawkEye Keylogger — Reborn v9, Version=9.0.1.6.\n\nWhen HawkEye is executed, in line 34,\n```\nbyte[] byte_ = gclass.method_0()[\"0\", GClass30.GEnum3.RCDATA].Byte_0;\n\n```\nit reads the encrypted configuration from the RCDATA resource and in line 33,\n```\nbyte[] byte_2 = GClass29.smethod_12(byte_, GClass12.string_0);\n\n```\nand then decrypts this data with the Rijndael algorithm you can see below in the\nRijndaelManaged function to initialize the HawkEye configuration settings.\n\n\n-----\n\nThe decrypted configuration shows us the account used for exfiltration:\n\nThe main loop of HawkEye has the following functions:\n\nThis shows the rich feature set of HawkEye. The adversaries can get detailed information\nabout the victim's machine, as you can see in the screenshot below.\n\n\n-----\n\nBeside the system information, it steals passwords from common web browsers, Filezilla,\nBeyluxe Messenger, CoreFTP and the video game \"Minecraft.\" It also starts a keylogger,\nsteals clipboard content, takes screenshots from the desktop and pictures from the webcam.\n\nVersion 9 is still using the well-known MailPassView and WebBrowserPassView freeware\ntools from [Nirsoft to steal web and email passwords. These tools are embedded in the PE](https://www.nirsoft.net/)\nfile in the form of data which is decoded at runtime and added to the local resources. Then,\nthey are using the process hollowing technique to hide the execution of these tools inside of\nthe original Microsoft vbc.exe (VisualBasic Compiler) process. They are starting an instance\nof vbc.exe via ProcessCreate, injecting the tool and resume the threat. The stolen passwords\nare ending up in a temporary file, which is read in and added to the list of data to be\nexfiltrated. HawkEye offers the following exfiltration options based on the configuration:\nemail, FTP, SFTP, HTTP POST to PanelURL API or ProxyURL.\n\n\n-----\n\nAs mentioned above, in the comments of the main loop section, it also comes with several\nanti-analysis features, including starting an anti-debugging thread or disabling certain AVrelated programs via the Image File Execution Options (IFEO) evasion technique by\nregistering invalid debuggers that redirect and effectively disable various system and security\napplications.\n\n\n-----\n\nThe following diagram summarizes the full infection process:\n\n\n-----\n\n## Conclusion\n\nRecent changes in both the ownership and development efforts of the HawkEye Reborn\nkeylogger/stealer demonstrate that this is a threat that will continue to experience ongoing\ndevelopment and improvement moving forward. HawkEye has been active across the threat\nlandscape for a long time and will likely continue to be leveraged in the future as long as the\ndeveloper of this kit can monetize their efforts. While the Terms of Service have been written\nin an attempt to absolve the developer of any wrongdoing, it is actively leveraged by\nmalicious adversaries. Organizations should be aware of this and similar threats and deploy\n[countermeasures such as Multi-Factor Authentication (MFA) solutions such as Duo, to help](https://www.cisco.com/c/en/us/products/security/adaptive-multi-factor-authentication.html)\nreduce the impact of credential theft within their environments. Talos continues to monitor\nthis threat as it changes to ensure that customers remain protected from this and other\nthreats as they continue to emerge and evolve.\n\n## Coverage\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n\n-----\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), andMeraki MX can detect malicious activity](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## Indicators of compromise\n\nThe following IOCs are associated with various malware distribution campaigns that were\nobserved during the analysis of Hawkeye Reborn v9 activity.\n\n### Attachment hashes (SHA256)\n\nA list of hashes observed to be associated with malicious email attachments can be found\n[here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5cb4afcf1be50.txt)\n\n\n-----\n\n### PE32 hashes (SHA256)\n\nA list of hashes observed to be associated with malicious PE32 executables can be found\n[here.](https://alln-extcloud-storage.cisco.com/ciscoblogs/5cb4b004a5a27.txt)\n\n### Domains\n\nThe following domains have been observed to be associated with malware campaigns.\n\ntfvn[.]com[.]vn\n\nshirkeswitch[.]net\n\nguideofgeorgia[.]org\n\ngulfclouds[.]site\n\njhssourcingltd[.]com\n\nkamagra4uk[.]com\n\npioneerfitting[.]com\n\npositronicsindia[.]com\n\nscseguros[.]pt\n\nspldernet[.]com\n\ntoshioco[.]com\n\nwww[.]happytohelpyou[.]in\n\n### IP addresses\n\nThe following IP addresses have been observed to be associated with malware campaigns.\n\n112.213.89[.]40\n\n67.23.254[.]61\n\n62.212.33[.]98\n\n153.92.5[.]124\n\n185.117.22[.]197\n\n23.94.188[.]246\n\n67.23.254[.]170\n\n72.52.150[.]218\n\n148.66.136[.]62\n\n107.180.24[.]253\n\n108.179.246[.]138\n\n18.221.35[.]214\n\n94.46.15[.]200\n\n66.23.237[.]186\n\n72.52.150[.]218\n\n\n-----\n\n### URLs:\n\nThe following URLs have been observed to be associated with malware campaigns.\n\nhttps[:]//a[.]pomf[.]cat/\n\nhttp[:]//pomf[.]cat/upload[.]php\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-15 - New HawkEye Reborn Variant Emerges Following Ownership Change.pdf"
    ],
    "report_names": [
        "2019-04-15 - New HawkEye Reborn Variant Emerges Following Ownership Change.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535791,
    "ts_updated_at": 1743041280,
    "ts_creation_date": 1653688696,
    "ts_modification_date": 1653688696,
    "files": {
        "pdf": "https://archive.orkl.eu/caafb0918cfac47c221409800694f3947a6769f9.pdf",
        "text": "https://archive.orkl.eu/caafb0918cfac47c221409800694f3947a6769f9.txt",
        "img": "https://archive.orkl.eu/caafb0918cfac47c221409800694f3947a6769f9.jpg"
    }
}