{
    "id": "ae4fd708-90e8-423f-84b5-2e6b107b7475",
    "created_at": "2023-01-12T15:09:49.585237Z",
    "updated_at": "2025-03-27T02:09:18.361713Z",
    "deleted_at": null,
    "sha1_hash": "8ce0424aa25c325610d662fc2a1e6984485fe43c",
    "title": "2020-11-06 - When Threat Actors Fly Under the Radar- Vatet, PyXie and Defray777",
    "authors": "",
    "file_creation_date": "2022-05-28T23:47:43Z",
    "file_modification_date": "2022-05-28T23:47:43Z",
    "file_size": 997520,
    "plain_text": "# When Threat Actors Fly Under the Radar: Vatet, PyXie and Defray777\n\n**unit42.paloaltonetworks.com/vatet-pyxie-defray777/**\n\nRyan Tracey, Drew Schmitt November 7, 2020\n\nBy [Ryan Tracey and](https://unit42.paloaltonetworks.com/author/ryan-tracey/) [Drew Schmitt](https://unit42.paloaltonetworks.com/author/drew-schmitt/)\n\nNovember 6, 2020 at 6:15 PM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Ransomware,](https://unit42.paloaltonetworks.com/category/ransomware/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [Defray777,](https://unit42.paloaltonetworks.com/tag/defray777/) [PyXie,](https://unit42.paloaltonetworks.com/tag/pyxie/) [Vatet](https://unit42.paloaltonetworks.com/tag/vatet/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/vatet-pyxie-defray777/)\n\n## Executive Summary\n\nAs security practitioners, we spend a lot of time focusing on the threat actors and malware\nfamilies that leverage the most impactful exploits or affect the highest number of victims. But\nwhat happens when a threat actor goes “low and slow” to fly under the radar? One could\nargue that, in that situation, the threat actor may end up having more impact than some of\nthe more prolific threat groups.\n\nWe first noticed that there may be a relationship between the Vatet loader, PyXie Remote\nAccess Tool (RAT) and Defray777 ransomware when there were remnants and/or detections\n[of all three in various Incident Response and Managed Threat Hunting engagements After](https://www.crypsisgroup.com/)\n\n\n-----\n\ndigging deep into each malware family, it became apparent that Vatet, PyXie and Defray777\nare all associated with the same financially motivated threat group that has been operating\nsince as early as 2018.\n\n[That threat group, sometimes referred to as PyXie by BlackBerry Cylance and GOLD](https://blogs.blackberry.com/en/2019/12/meet-pyxie-a-nefarious-new-python-rat)\nDUPONT by SecureWorks, has been actively conducting successful ransomware operations\nthat have impacted organizations in a number of sectors including healthcare, education,\ngovernment and technology while remaining under the radar. This blog aims to shed light on\nthis threat group and to disrupt their operations through awareness of their malware families\nand operating methodologies. In essence, we want to get them on the radar.\n\nDuring our research, we discovered that this threat group has developed and maintained the\nVatet loader. This loader has evolved as this threat group has taken advantage of multiple\nopen source tools by altering the original application to execute payloads such as PyXie\nand/or Cobalt Strike. Next, the threat group uses a tailored version of PyXie, which we call\nPyXie Lite, to conduct reconnaissance and to find and exfiltrate files that are likely sensitive\nto the victim organization. In a number of incidents we investigated, the actors established an\ninitial foothold into the victim's network through common banking trojans such as IcedID or\n[Trickbot. From there, they deployed Vatet, PyXie and Cobalt Strike before executing](https://unit42.paloaltonetworks.com/tag/trickbot/)\nDefray777 ransomware entirely in memory. This results in encrypted files on local drives and\nfile shares before exiting. Additionally, the ransomware leaves no evidence of execution\nexcept for the encrypted files and ransom notes. In regard to Defray777, the group behind\nthis malware has also ported their ransomware from Windows to Linux, something that,\nbefore Defray777, has yet to be seen in the targeted ransomware space. Before this\ndiscovery, ransomware that had the ability to impact both Windows and Linux systems was\nlimited to cross-functional ransomware written in Java or scripting languages such as\nPython. With the port to Linux, Defray777 ransomware has become the first ransomware\nvariant to have standalone executables for Windows and Linux.\n\nWith three different malware families to cover, we realize there is a lot of content to digest.\nWe have a lot of great details on each of these, but we also realize that you may be\ninterested in one malware family over the others, or you may just prefer to choose your own\nadventure. If desired, use the links below to skip to the malware family that interests you\nmost, or to get right to the IOCs that will get you hunting for, and detecting, this threat group\nin action.\n\nTable of Contents\n\nFirst Up: Vatet Loader\n[Next Up: PyXie Lite](https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/2)\n[Last, but Not Least: Defray777](https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/3)\n[Linking Vatet, PyXie and Defray777](https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/4)\n[Indicators of Compromise (IOCs)](https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/5)\n\n\n-----\n\n## First Up: Vatet Loader\n\nVatet is a custom loader that executes XOR encoded shellcode from the local disk or a\nnetwork share. The loaders are typically open source applications found on GitHub, or other\nrepositories, that the actors modify to load their shellcode. In most cases, the payload winds\nup being Cobalt Strike beacons and/or stagers, but some of the more recent payloads have\nbeen an updated version of the PyXie RAT. Vatet is often a precursor to enterprise-wide\nransomware attacks.\n\n[Microsoft wrote about the Vatet loader in April 2020 and said the loader had been in use as](https://www.microsoft.com/security/blog/2020/04/28/ransomware-groups-continue-to-target-healthcare-critical-services-heres-how-to-reduce-risk/)\nearly as November 2018 for the purpose of loading Cobalt Strike into memory for execution.\nThis loader continues to be seen in the wild using multiple versions of open source\napplications to load shellcode including:\n\nVersion First Seen\n\n[Recompiled Tetris game](https://github.com/VincentJYZhang/tetris-game) 2019-06-28\n\n[Recompiled Notepad](https://github.com/wine-mirror/wine/tree/master/programs/notepad) 2020-05-03\n\n[Recompiled desktop customization app, Rainmeter](https://github.com/rainmeter/rainmeter) 2020-06-24\n\nRecompiled Notepad++ 2020-09-24\n\n_Table 1. Vatet versions._\n\nIn our research, we have seen Vatet samples with compile times as early as 2019, although\nthis variant has implemented several variations since then.\n\nIn the earliest versions of Vatet that we analyzed, the malicious payload was loaded via a\nnetwork share using a path with the following format: \\\\{IP}\\{EPOCHTIME}\\{PAYLOAD}.dat.\nHowever, in the latest samples analyzed, the malicious payload was loaded locally from disk.\nAdditionally, we have seen variations in the XOR keys used to decode the payload during\nexecution time. Our research also determined that the Vatet loader has expanded its payload\ncapabilities to load PyXie in addition to the previously seen Cobalt Strike beacons and\nstagers. Finally, the Vatet loaders we analyzed have evolved and begun taking steps to\nimprove their anti-forensics capabilities by deleting malicious payloads after they have been\nloaded into memory for execution.\n\n\n-----\n\nFigure 1. Vatet execution flow.\nLet’s take a deeper look at Vatet using a malicious version of Rainmeter.\n\n**Inner Workings of the Vatet Loader: A Rainmeter Review**\n\nRainmeter is a desktop customization tool that allows users to customize their desktops\nthrough the use of “skins.” During a legitimate installation, Rainmeter creates an executable,\nrainmeter.exe, and a corresponding DLL, rainmeter.dll. Under normal conditions,\nrainmeter.dll is responsible for reading configuration files and facilitating a customized\ndesktop. Under the observed circumstances, a signed, legitimate version of rainmeter.exe\nand a malicious version of rainmeter.dll could be simply copied onto the victim system, then\nused to load and execute a Cobalt Strike beacon in memory under the context of a signed,\nlegitimate executable.\n\n**Taking a Look at the Static Properties**\n\nWe first reviewed the suspicious rainmeter.exe and rainmeter.dll files and compared them to\nversions that would be installed on a system through the official September 2019 release of\n[the Rainmeter installer, which can be found on its public GitHub page.](https://github.com/rainmeter/rainmeter)\n\nReviewing rainmeter.exe did not produce many interesting findings. Examining both\n[executables in PEStudio confirmed that the sample recovered during a ransomware scenario](https://www.winitor.com/)\nwas the same executable generated by the standard Rainmeter installer, based on the\nSHA256 hash. We also verified that both executables had the same valid digital signature.\n\n\n-----\n\nFigure 2. Initial comparison of static properties of “rainmeter.exe”.\nComparing the rainmeter.dll samples provided more interesting findings. Initially, it was\nobvious that the two samples were not the same, since the hashes did not line up. The sizes\nof the files were significantly different from one another and the compile dates were also\nquite different. Additionally, there was some variability in the imports, exports, strings and\nother properties. Further, the suspected malicious DLL was not digitally signed and had\nadditional sections not present in the legitimate Rainmeter DLL.\n\nFigure 3. Comparing the two versions of “rainmeter.dll”.\n\nFigure 4 Comparing sections between “rainmeter dll” samples\n\n\n-----\n\nIt is important to note that the [code base for Rainmeter is publicly available on GitHub under](https://github.com/rainmeter/rainmeter)\nthe GNU General Public License v2.0. This would have allowed the threat actor to openly\nreview/modify the existing rainmeter.dll file contents and compile it into the suspected\nmalicious DLL we saw during our investigation.\n\nAfter completing these comparisons to confirm that the Rainmeter DLL was likely malicious,\nit was time for a deeper and more focused look at the samples using a debugger for dynamic\nanalysis.\n\n**Dynamic Analysis of the Malicious Rainmeter Sample**\n\nNow that we had identified samples for deeper inspection, we stopped the comparisons to\nthe legitimate Rainmeter application and focused on the analysis of the suspicious samples\nrecovered. We placed the samples of rainmeter.exe and rainmeter.dll recovered from the\ninvestigation into our analysis environment and began debugging Rainmeter. Shortly after\nstarting analysis, rainmeter.exe loaded rainmeter.dll as expected, and subsequently called its\nordinal 1 exported function. Continuing the execution, there were calls to CreateFileA, where\nthe sample was looking for the hardcoded path C:\\Windows\\help\\options.dat.\n\nFigure 5. Call to “CreateFileA” for a hardcoded path.\nAfter the call to CreateFileA, there is a comparison of the result of the call to CreateFileA to\nFFFFFFFF to determine if it has a valid handle to the file or not. If there is no valid handle,\nthe program exits.\n\nOriginally it was not obvious that options.dat was necessary for the analysis of the malicious\nRainmeter sample as .dat files are not part of the normal Rainmeter application. However, a\nversion of options.dat was recovered in order to continue analysis. Once the “dat” file was\nplaced in the expected location, the program then allocated space on the heap and read the\ncontents of options.dat into memory. After the contents of options.dat were read into memory,\nthe sample performed a first-level decoding of the contents by XOR-ing the contents with the\nvalue FE.\n\nFigure 6. Initial XOR decoding loop.\n\n\n-----\n\nOnce the first decoding routine is completed, the malicious Rainmeter application closes the\nhandle to options.dat. When the program closes the handle to options.dat, it is removed from\nthe file system. This is a built-in anti-analysis technique employed to hinder recovery of the\n.dat file for analysis. At this point, the data read into the program was still a blob of\nunrecognizable code. However, at the end of the XOR decoding routine, there is a CALL\nEBX instruction that transfers execution to the recently decoded data. Following EBX in the\ndisassembled view shows that this is valid code. At this stage of analysis, Rainmeter has\ndecoded its options.dat payload, loaded it into memory and executed it. Future analysis\nconfirmed that this was the end of the Vatet loader routine, and execution was passed to the\nCobalt Strike shellcode loader.\n\nFigure 7. Transfer of execution to valid code after XOR decoding.\nBy this point, we realized that the Vatet loading mechanism was completed, but we wanted\nto validate the identity of the final payload, so we pressed on. Further along in the execution,\nthere is a second decoding routine where an additional dynamic XOR loop is used to decode\nand rewrite the contents of the executable code. If this routine looks familiar, it’s probably\nbecause you are noticing the Cobalt Strike decoding mechanism. This routine begins by\nobtaining a pointer to the first four bytes of the imported executable code and setting it as the\nstarting XOR key. The code then executes a loop acting on four bytes at a time, XORing the\nimported code with the starting XOR key. Next, the loop writes the XOR’d value back into the\ndata segment, followed by setting a new XOR key. The new XOR key is determined by\nXOR’ing the current XOR key with the value decoded by the current key. Once this loop is\nfinished, the sample then uses JMP ECX to transfer execution to the recently decoded\nexecutable contents.\n\n\n-----\n\nFigure 8. Entering into the second decoding loop. Note the memory space in Dump 1.\n\n\n-----\n\nFigure 9. After the completion of the second decoding routine, note the executable contents\nnow decoded in Dump 2.\nAt this stage of analysis, we confirmed the content included in options.dat was shellcode that\nwas later decoded via a dynamic XOR routine to create executable code in Rainmeter’s\nprocess memory.\n\nNow that we had the executable contents of the XOR’d executable code from options.dat\n[available in memory, we dumped the contents from the memory map section in x64bdg for](https://x64dbg.com/#start)\nadditional analysis to determine this code’s potential functionality.\n\nMoving to our dumped sample of the executable code, we conducted an analysis of the\nstrings to determine if there was anything obvious to correlate dynamic analysis findings. In\ndoing this, we identified a reference to beacon.dll, which is most often associated with the\nDLL version of Cobalt Strike’s beacon. Additionally, loading the isolated PE into PeStudio\nshowed the following references to an exported function _ReflectiveLoader@4, which is a\nknown exported function of Cobalt Strike.\n\n\n-----\n\nFigure 10. Extracted PE analysis in PeStudio.\nTo confirm whether the extracted payload was a Cobalt Strike beacon or not, we utilized a\nCobalt Strike beacon parser, which dumped the beacon’s decoded configuration.\n\n\n-----\n\nFigure 11. Cobalt Strike beacon configuration.\nThe confirmed Cobalt Strike beacon shows a typical implementation of Cobalt Strike’s\nHTTPS beacon using malleable C2 profiles. Specifically, the [Amazon browsing traffic profile](https://raw.githubusercontent.com/rsmudge/Malleable-C2-Profiles/master/normal/amazon.profile)\ncreated by harmjoy was used in this beacon.\n\n[Continue reading: Next Up: \"PyXie Lite\"](https://unit42.paloaltonetworks.com/vatet-pyxie-defray777/2)\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-06 - When Threat Actors Fly Under the Radar- Vatet, PyXie and Defray777.pdf"
    ],
    "report_names": [
        "2020-11-06 - When Threat Actors Fly Under the Radar- Vatet, PyXie and Defray777.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "7268a08d-d4d0-4ebc-bffe-3d35b3ead368",
            "created_at": "2022-10-25T16:07:24.225216Z",
            "updated_at": "2025-03-27T02:02:10.144446Z",
            "deleted_at": null,
            "main_name": "Sprite Spider",
            "aliases": [
                "Gold Dupont",
                "Sprite Spider"
            ],
            "source_name": "ETDA:Sprite Spider",
            "tools": [
                "Agentemis",
                "Cobalt Strike",
                "CobaltStrike",
                "Coroxy",
                "Defray 2018",
                "Defray777",
                "DroxiDat",
                "Glushkov",
                "LaZagne",
                "Metasploit",
                "PyXie",
                "PyXie RAT",
                "Ransom X",
                "RansomExx",
                "SharpHound",
                "Shifu",
                "SystemBC",
                "Target777",
                "Vatet",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "27e51b73-410e-4a33-93a1-49cf8a743cf7",
            "created_at": "2023-01-06T13:46:39.210675Z",
            "updated_at": "2025-03-27T02:00:03.022315Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "SPRITE SPIDER"
            ],
            "source_name": "MISPGALAXY:GOLD DUPONT",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "07775b09-acd9-498e-895f-f10063115629",
            "created_at": "2024-06-04T02:03:07.817613Z",
            "updated_at": "2025-03-27T02:05:17.351811Z",
            "deleted_at": null,
            "main_name": "GOLD DUPONT",
            "aliases": [
                "Sprite Spider "
            ],
            "source_name": "Secureworks:GOLD DUPONT",
            "tools": [
                " ArtifactExx",
                " Cobalt Strike",
                " Defray",
                " Metasploit",
                " PyXie",
                " Shifu",
                " SystemBC",
                " Vatet",
                "777"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536189,
    "ts_updated_at": 1743041358,
    "ts_creation_date": 1653781663,
    "ts_modification_date": 1653781663,
    "files": {
        "pdf": "https://archive.orkl.eu/8ce0424aa25c325610d662fc2a1e6984485fe43c.pdf",
        "text": "https://archive.orkl.eu/8ce0424aa25c325610d662fc2a1e6984485fe43c.txt",
        "img": "https://archive.orkl.eu/8ce0424aa25c325610d662fc2a1e6984485fe43c.jpg"
    }
}