{
    "id": "ae53a331-dd44-49cc-8ac1-a1cff5755534",
    "created_at": "2023-03-03T02:07:05.41344Z",
    "updated_at": "2025-03-27T02:17:02.11186Z",
    "deleted_at": null,
    "sha1_hash": "6db15367d0fe3790f5cb04e3283a0717cba32f64",
    "title": "2023-01-12 - NoName057(16) – The Pro-Russian Hacktivist Group Targeting NATO",
    "authors": "",
    "file_creation_date": "2023-03-01T09:20:45Z",
    "file_modification_date": "2023-03-01T09:20:45Z",
    "file_size": 979795,
    "plain_text": "# NoName057(16) – The Pro-Russian Hacktivist Group Targeting NATO\n\n**[sentinelone.com/labs/noname05716-the-pro-russian-hacktivist-group-targeting-nato/](https://www.sentinelone.com/labs/noname05716-the-pro-russian-hacktivist-group-targeting-nato/)**\n\nTom Hegel\n\n**By Tom Hegel and Aleksandar Milenkoski**\n\n## Executive Summary\n\nPro-Russia hacktivist group NoName057(16) is conducting a campaign of DDoS\nattacks on Ukraine and NATO organizations that began in the early days of the war in\nUkraine. Targets have included government organizations and critical infrastructure.\nNoName057(16) was responsible for disrupting services across the financial sector of\nDenmark this week. Other recent attacks include organizations and businesses across\nPoland, Lithuania and others.\nOn January 11th, we observed NoName057(16) begin targeting 2023 Czech\npresidential election candidates’ websites.\nSentinelLabs has identified how the group operates over public Telegram channels, a\nvolunteer-fueled DDoS payment program, a multi-OS supported toolkit, and GitHub.\n\n## What is NoName057(16)\n\n\n-----\n\nNoName057(16), also known as NoName05716, 05716nnm or Nnm05716, is a relatively\nunderreported hacktivist group supporting Russia since March 2022, alongside Killnet and\nother pro-Russian groups. In December 2022, the group was responsible for disrupting the\n[Polish government website. As noted by the Polish government, the incident was in](https://www.gov.pl/web/special-services/russian-cyberattacks)\nresponse to the Sejm of the Republic of Poland officially recognizing Russia as a state\nsponsor of terrorism in mid December 2022. More recently, the group targeted the Danish\n[financial sector, impacting leading financial institutions as reported by Reuters.](https://www.reuters.com/technology/denmarks-central-bank-website-hit-by-cyberattack-2023-01-10/)\n\n## Motivations and Objectives\n\nThe NoName057(16) group is primarily focused on disrupting websites important to nations\ncritical of Russia’s invasion of Ukraine. Distributed Denial of Service (DDoS) attacks act as\nthe method to conduct such disruption efforts.\n\nInitial attacks focused on Ukrainian news websites, while later shifting to NATO associated\ntargets. For example, the first disruption the group claimed responsibility for were the March\n2022 DDoS attacks on Ukraine news and media websites Zaxid, Fakty UA, and others.\nOverall the motivations center around silencing what the group deems to be anti-Russian.\n\n## Operating Methods – Telegram Channel\n\nNoName057(16) operate through Telegram to claim responsibility for their attacks, mock\ntargets, make threats, and generally justify their actions as a group. Interestingly,\nNoName057(16) makes attempts to teach their followers through educational content such\nas explaining basic industry jargon and attack concepts.\n\nWith an average of six posts per day, the overall engagement of NoName057(16)’s Telegram\nefforts has slowly declined over time. Peak viewership of their posts occurred in July 2022,\nwhen they reached approximately 14,000 readers with nearly 100% engagement rate. Today,\ndaily average reach is roughly 2-3,000 and engagement in the range of 10-20%, signifying\nthat the group is becoming less relevant to their followers and to Telegram users as a whole.\nThis may be explained in part by the fact that many similar hacktivist groups exist, have\ngained more attention, and are often more impactful in their objectives.\n\n\n-----\n\nViews and engagement rate of NoName057(16) Telegram Posts (telemetr.io)\nEvidence from NoName057(16)’s Telegram channel indicates that the group values the\nrecognition their attacks achieve through being referenced online including in Wikipedia\narticles. The channel also posts pro-Russian memes, motivational posts, and general status\nupdates around the holidays. The observed Telegram activity makes it clear that the group\nconsiders itself a top tier Russian threat actor when in reality the impact of their DDoS\nattacks is short-lived disruption with little to no wider consequence.\n\n[caption]\n\nNoName057(16) New Year Update\nWe have reported the associated accounts/channels to the Telegram Abuse team.\n\n## Tool Hosting on GitHub\n\n\n-----\n\nThe group has also made use of GitHub to host a variety of illicit activity. This includes using\n[GitHub Pages for freely hosting their DDoS tool website dddosia.github[.]io, and the](https://pages.github.com/)\nassociated GitHub repositories for hosting the latest version of their tools as advertised in the\nTelegram channel. Two GitHub profiles of interest are dddosia and kintechi341. Early\ncommits to the ddos_config repo were made in the name of “Роман Омельченко”.\n\nAssociated dddosia GitHub Profile\n\nAssociated kintechi341 GitHub Profile\nWe reported the abuse of these services to the GitHub Trust & Safety team, who quickly took\naction as a violation of GitHub’s Terms of Service.\n\n## Network\n\nThe C2 services are primarily hosted through Neterra, the Bulgarian telecommunications\norganization, while also making use of No-IP Dynamic DNS services. The current C2 is\n```\nzig35m48zur14nel40[.]myftp.org at 31.13.195.87. This server is active as of this release.\n\n```\n\n-----\n\n## Targets\n\nThroughout the life of the group, NoName057(16) has focused on targeting Ukraine and\nNATO member countries. Organizations targeted are commonly critical infrastructure sectors\nwhose operations are vital to the target nation.\n\nTarget selection shifts according to current political events. As previously noted, the Polish\ngovernment was a December target following the Sejm of the Republic of Poland officially\nrecognizing Russia as a state sponsor of terrorism in mid December 2022. At the start of\nJanuary 2023, a large focus was placed on targeting Lithuanian organizations, primarily in\nthe cargo and shipping sectors. Most recently the actor began focusing on targeting leading\nDanish financial institutions including Danske Bank, Danmarks Nationalbank, and others\n[reported in the media this week.](https://www.reuters.com/technology/denmarks-central-bank-website-hit-by-cyberattack-2023-01-10/)\n\nOn January 11th 2023, we observed the actor begin targeting websites owned by multiple\n2023 Czech presidential election candidates. The election is occurring on January 13th and\n14th 2023, so timing of the disruption efforts can not be ignored. Specific targets include\ndomains for candidates Pavel Fischer, Marek Hilšer, Jaroslav Bašta, General Petr Pavel, and\nDanuše Nerudová. Additionally, the Ministry of Foreign Affairs of the Czech Republic website\nwas also targeted at the same time. We have notified Czech CERT upon discovery of the\nnew target list.\n\n## Attack Toolkit\n\nNoName057(16) has made use of a number of different tools to conduct their attacks\n[throughout 2022. In September, Avast reported on the threat actor using the Bobik botnet to](https://decoded.avast.io/martinchlumecky/bobik/)\nconduct their DDoS attacks. However, the group appears to primarily seek participation\nvoluntarily through their DDOSIA tool – also referred to by its developer as Dosia and Go\nStresser, depending on versioning.\n\nWe analyzed two different implementations of DDOSIA: a Python and a Golang\nimplementation. The Python DDOSIA implementation is delivered as a PyInstaller package.\nThe Golang implementation refers to itself internally as Go Stresser.\n\nThe internal DDOSIA reference Go Stresser\n\nDDOSIA is a multi-threaded application that conducts denial-of-service attacks against target\nsites by repeatedly issuing network requests. DDOSIA issues requests as instructed by a\nconfiguration file that the malware receives from a C2 server when started. The configuration\nfile is in JSON format and resides at the /client/get_targets URL path on the C2 server.\n[Historical configuration files can be reviewed in archived October and](https://web.archive.org/web/20221015142308/http://109.107.181.130:5001/client/get_targets) [December 2022 server](https://web.archive.org/web/20221215130455/http://77.91.122.69:5001/client/get_targets)\nresponses.\n\n\n-----\n\nDDOSIA\n\nconfiguration file (a snippet)\nFor each target site, the configuration file specifies:\n\nA unique target identifier in the field id.\nTarget network endpoint information in the fields host, address, and port – a\nhostname, an IP address, and a port.\nA network request type and method pairs in the fields type and method. The DDOSIA\nsamples and configuration files we analyzed indicate that the malware supports the\nrequest types http, http2, and tcp, and the request methods – HTTP verbs – GET and\n```\n   POST (for the request types http or http2) and syn (for the request type tcp). Based on\n\n```\na configured type and method, DDOSIA constructs HTTP or TCP network packets\n(requests) for sending to a target site.\nA URL path and request body in the fields path and body for network requests of type\n```\n   http or http2. If the path and/or body fields have values, DDOSIA constructs and\n\n```\nissues requests with the configured request body to the configured URL path at the\ntarget site.\n\n\n-----\n\nA Python DDOSIA implementation\n\nconstructs a TCP SYN packet\n\nA Golang DDOSIA implementation constructs an HTTP POST request\n\n\n-----\n\nDDOSIA replaces $_{number} substrings specified in the configuration file with random\nvalues that the malware generates when constructing a network request. In a DDOSIA\nconfiguration file, $_{number} substrings are typically placed in path fields. The Python\nimplementation of DDOSIA uses templates defined in the randoms field in the configuration\nfile for generating random string values.\n\nA $_{number} substring in a DDOSIA configuration file\n\nThe randoms field in a DDOSIA configuration file\n\n(a snippet)\n\nA\n\nPython DDOSIA implementation generates random values\nA DDOSIA configuration file specifies URL paths and request bodies that are valid at the\nrespective target sites. This indicates that the DDOSIA operators construct configuration files\nby first exploring target sites For example the URL\n\n\n-----\n\n```\nhttps://www.defensie[.]nl/actueel/nieuws?pagina={number} is a valid news page\n\n```\niterator at the website of the Dutch Ministry of Defense.\n\nDDOSIA configuration for targeting the Dutch\n\nMinistry of Defense\nThere are additional DDOSIA features to those above that a configuration file may instruct\nthe malware to enable. For example, the use_random_user_agent field instructs DDOSIA to\nrandomly select a user agent from a list of predefined user agents when constructing an\nHTTP request. Also, the fields activate_by_schedule, started_at and finished_at\nindicate that a DDOSIA sample can be configured to schedule the sending of network\nrequests over specific date-time intervals. The samples we analyzed do not make use of\nthese configuration parameters but repeatedly send network requests to each target site until\nterminated.\n\nPredefined DDOSIA user agents\nWe note that there are differences regarding what configuration values and features are\nsupported by different DDOSIA builds and implementations. This indicates that DDOSIA is\nunder continuous development and is subject to frequent changes.\n\nFor example, the Golang DDOSIA implementations we analyzed support the network\nrequest type http2, whereas their Python counterparts do not implement this support.\n\n\n-----\n\nAn implementation of the\n\n_http2 network request type_\nIn addition, Golang DDOSIA implementations authenticate themselves to C2 servers by\nissuing an HTTP POST request to the /login_new URL path at the servers and terminate if\nthe authentication fails. The Python DDOSIA implementations that we analyzed do not\nsupport this feature.\n\nDDOSIA authenticates itself to a C2 server (‘Авторизация пройдена успешно’ translates\nfrom Russian to ‘Authorization completed successfully’)\nDDOSIA maintains statistics about its operation and success rate – the malware counts the\ntotal and the number of successful network requests sent to each target site. In the context\nof network requests of type http or http2, a request is considered successful if the target\nsite returns the HTTP code 200 (OK).\n\nDDOSIA counts\n\nsuccessful HTTP network requests\n\n\n-----\n\nDDOSIA sends the statistics to the C2 server at regular time intervals – this informs the\nDDOSIA operators about the overall progress and success of the denial-of-service campaign\nthat the malware conducts. This is likely associated with how the group makes use of a\nvolunteer profit program. They distribute cryptocurrency to the top DDoS contributors,\nencouraging people to contribute more technical resources for a more powerful attack.\n\nVersions of the tool for macOS and Linux have also been developed. Android versions of the\ntool can also be found; however, the primary distribution of the group has not officially\nsupported mobile.\n\n## Conclusion\n\nNoName057(16) is yet another hacktivist group to emerge following the war in Ukraine.\nWhile not technically sophisticated, they can have an impact on service availability– even\nwhen generally short lived. What this group represents is an increased interest in volunteerfueled attacks, while now adding in payments to its most impactful contributors. We expect\nsuch groups to continue to thrive in today’s highly contentious political climate.\n\nWe would like to thank GitHub’s Trust & Safety team for a quick response following our\nabuse notification. The actors’ accounts and pages are no longer online.\n\n## Indicators of Compromise\n\n**Indicator** **Description**\n\n94d7653ff2f4348ff38ff80098682242ece6c407 DDosia.py encoded installer\n\ne786c3a60e591dec8f4c15571dbb536a44f861c5 DDosia.py encoded installer\n\nc86ae9efcd838d7e0e6d5845908f7d09aa2c09f5 December 2022 DDosia PyInstaller\n\ne78ac830ddc7105290af4c1610482a41771d753f December 2022 DDosia PyInstaller\n\n09a3b689a5077bd89331acd157ebe621c8714a89 July 2022 DDosia PyInstaller\n\n8f0b4a8c8829a9a944b8417e1609812b2a0ebbbd dosia_v2_macOSx64 – May 2022\n\n717a034becc125e88dbc85de13e8d650bee907ea dosia_v2_macOSarm64 – May 2022\n\nef7b0c626f55e0b13fb1dcf8f6601068b75dc205 dosia_v2_linux_x64 – May 2022\n\nb63ce73842e7662f3d48c5b6f60a47e7e2437a11 dosia_v2.0.1.exe – May 2022\n\n5880d25a8fbe14fe7e20d2751c2b963c85c7d8aa dosia_v2.0.1 – May 2022\n\n78248539792bfad732c57c4eec814531642e72a0 dosia_v2.exe – May 2022\n\n\n-----\n\n1dfc6f6c35e76239a35bfaf0b5a9ec65f8f50522 dosia_win_x64.exe – January 2023\n\n2.57.122.82 C2 Server – Overlaps with Avasts\nBobik findings\n\n2.57.122.243 C2 Server – Overlaps with Avasts\nBobik findings\n\n109.107.181.130 C2 Server – October 2022 and earlier.\nOverlaps with Avasts Bobik findings\n\n77.91.122.69 C2 Server – December 2022\n\n31.13.195.87 C2 Server – Mid December to\nPresent Day\n\ntom56gaz6poh13f28[.]myftp.org C2 Domain\n\nzig35m48zur14nel40[.]myftp.org C2 Domain\n\n[[email protected][.]me](https://www.sentinelone.com/cdn-cgi/l/email-protection) NoName057(16) Email Address\n\nhxxps://t[.]me/noname05716 NoName057(16) Primary Telegram\nChannel (open group)\n\nhxxps://t[.]me/nn05716chat NoName057(16) Secondary Telegram\nChannel (closed group)\n\nhxxps://github[.]com/dddosia Account hosting DDOSIA\ndownloading GitHub Pages site.\n\ndddosia[.]github.io Official DDOSIA download site linked\nto on actors telegram page.\n\nhxxps://github[.]com/kintechi341 Contributor to the DDOSIA toolkit\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-01-12 - NoName057(16) – The Pro-Russian Hacktivist Group Targeting NATO.pdf"
    ],
    "report_names": [
        "2023-01-12 - NoName057(16) – The Pro-Russian Hacktivist Group Targeting NATO.pdf"
    ],
    "threat_actors": [
        {
            "id": "b4a6d558-3cba-499c-b58a-f15d65b7a604",
            "created_at": "2023-01-06T13:46:39.346924Z",
            "updated_at": "2025-03-27T02:00:03.056948Z",
            "deleted_at": null,
            "main_name": "Killnet",
            "aliases": [],
            "source_name": "MISPGALAXY:Killnet",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "b05a0147-3a98-44d3-9b42-90d43f626a8b",
            "created_at": "2023-01-06T13:46:39.467088Z",
            "updated_at": "2025-03-27T02:00:03.100909Z",
            "deleted_at": null,
            "main_name": "NoName057(16)",
            "aliases": [
                "Nnm05716",
                "NoName057",
                "NoName05716",
                "05716nnm"
            ],
            "source_name": "MISPGALAXY:NoName057(16)",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1677809225,
    "ts_updated_at": 1743041822,
    "ts_creation_date": 1677662445,
    "ts_modification_date": 1677662445,
    "files": {
        "pdf": "https://archive.orkl.eu/6db15367d0fe3790f5cb04e3283a0717cba32f64.pdf",
        "text": "https://archive.orkl.eu/6db15367d0fe3790f5cb04e3283a0717cba32f64.txt",
        "img": "https://archive.orkl.eu/6db15367d0fe3790f5cb04e3283a0717cba32f64.jpg"
    }
}