{
    "id": "ae7a28f9-7ce7-436a-8799-134a4ad41554",
    "created_at": "2023-01-12T15:04:20.714711Z",
    "updated_at": "2025-03-27T02:15:26.220454Z",
    "deleted_at": null,
    "sha1_hash": "06ed7d16cc99956259497598eb6565cbedb71805",
    "title": "2019-01-30 - New LockerGoga Ransomware Allegedly Used in Altran Attack",
    "authors": "",
    "file_creation_date": "2022-05-28T03:09:07Z",
    "file_modification_date": "2022-05-28T03:09:07Z",
    "file_size": 1764012,
    "plain_text": "# New LockerGoga Ransomware Allegedly Used in Altran Attack\n\n**[bleepingcomputer.com/news/security/new-lockergoga-ransomware-allegedly-used-in-altran-attack/](https://www.bleepingcomputer.com/news/security/new-lockergoga-ransomware-allegedly-used-in-altran-attack/)**\n\nIonut Ilascu\n\nBy\n[Ionut Ilascu](https://www.bleepingcomputer.com/author/ionut-ilascu/)\n\nJanuary 30, 2019\n03:03 AM\n2\n\nHackers have infected the systems of Altran Technologies with malware that spread\nthrough the company network, affecting operations in some European countries. To protect\nclient data and their own assets, Altran decided to shut down its network and applications.\n\nThe attack occurred on January 24, but the French engineering consultancy released a\n[public statement only yesterday and kept details to a bare minimum, saying that third-party](https://resource.globenewswire.com/Resource/Download/0663f8d4-0acf-4463-b0fd-bb05042d1373)\ntechnical experts and digital forensics specialists are on the case.\n\nTo protect our clients, employees and partners, we immediately shut down our IT network\nand all applications. The security of our clients and of data is and will always be our top\npriority. We have mobilized leading global third-party technical experts and forensics, and\nthe investigation we have conducted with them has not identified any stolen data nor\ninstances of a propagation of the incident to our clients\n\n## Altran allegedly hit with new LockerGoga ransomware\n\nAltran made no reference to the type of malware affecting their network, but security\nresearcher have been following the trail of public breadcrumbs found sufficient evidence to\ndetermine that it's a ransomware attack.\n\n\n-----\n\nThe first public mention of the cyberattack against Altran came in a tweet on January 25. A\nreply from computer security researcher V hinted that behind the incident is a malware\nsample uploaded to VirusTotal.\n\n(link: [https://t.co/udeToPYHPo)](https://t.co/udeToPYHPo) [https://t.co/17btK8Kc6g…](https://t.co/17btK8Kc6g)\n\n— V (@vxsh4d0w) [January 25, 2019](https://twitter.com/vxsh4d0w/status/1088832926639407104?ref_src=twsrc%5Etfw)\n\nThis sample has an initial detection rate of 26 engines out of 69, but the file was quickly\npicked up by other antivirus products on VirusTotal and now 43 of them recognize the\nmalware. The sample was first uploaded to VirusTotal on January 24 from Romania and\nlater that day it was added from the Netherlands.\n\nIf the file uploaded to Google's scanning service is same one that struck Altran's computers,\nthen it is a ransomware called LockerGoga. This name of the threat comes from the path\n[used for compiling the source code into an executable discovered by MalwareHunterTeam.](https://twitter.com/malwrhunterteam)\n```\nX:\\work\\Projects\\LockerGoga\\cl-src-last\\cryptopp\\src\\rijndael_simd.cpp\n\n```\nWhen BleepingComputer tested the ransomware, we found that it was very slow due to to\nhow it spawned another process each time it encrypted a file. When discussing this with a\n[security researcher named Valthek, we were told that the code was sloppy, slow, and made](https://twitter.com/ValthekOn)\nno effort to evade detection.\n\n[According to security research SwitHak, the ransomware will normally target DOC, DOT,](https://twitter.com/SwitHak)\nWBK, DOCX, DOTX, DOCB, XLM, XLSX, XLTX, XLSB, XLW, PPT, POT, PPS, PPTX,\nPOTX, PPSX, SLDX, and PDF files.\n\nHowever, if launched with the '-w' command line argument, it will target all file types. Other\nswitches supported are '-k' and '-m' for base 64 encoding and for providing the emails\naddresses to show in the ransom note.\n\nIn BleepingComputer's test, the ransomware sample launched itself with the -w argument\nand also spawned a new process for each file it encrypted. This caused the encryption\nprocess to be very slow.\n\nWhen encrypting files, the ransomware will append the .locked extension to the processed\nfiles. This means that a file named test.jpg would be encrypted and then renamed to\ntest.jpg.locked as illustrated in the image below.\n\n\n-----\n\nFurthermore, reports indicate that the sample may not wipe shadow volume copies, but we\nwere not able to confirm that.\n\nWhen done encrypting data on the computer, it will drop a ransom note named README**NOW.txt on the desktop, which includes instructions to contact the**\nCottleAkela@protonmail.com or QyavauZehyco1994@o2.pl email addresses for payment\ninstructions.\n\nAs you can see, the ransom note suggests that the malware operators target companies\nand offer to unlock a few files for free to prove that they have the decryption key\n\n\n-----\n\nLockerGoga s ransom note was also seen by security researcher MalwareHunterTeam in\nearly January, although it included different ProtonMail and O2 addresses.\n\nWe first seen this note (name and content), with different email addresses (but still\none ProtonMail & one O2) on 6th evening. From then we seen victims from more than\n5 countries. First victim/uploader was from Netherlands...\n\n[— MalwareHunterTeam (@malwrhunterteam) January 26, 2019](https://twitter.com/malwrhunterteam/status/1089149350872338432?ref_src=twsrc%5Etfw)\n\nAccording to SwitHak's attack scenario, the Romanian local team noticed the threat and\nchecked it on VirusTotal. The network connection and network shares mounted on\nemployee systems allowed LockerGoga to spread to offices in other countries, thus\nexplaining the sample upload from the Netherlands.\n\n[#Altran alleged attack timeline based on facts, hypothesis part based on our thoughts.](https://twitter.com/hashtag/Altran?src=hash&ref_src=twsrc%5Etfw)\n[pic.twitter.com/cxBrG8UY84](https://t.co/cxBrG8UY84)\n\n[— SwitHak (@SwitHak) January 26, 2019](https://twitter.com/SwitHak/status/1089140026166988800?ref_src=twsrc%5Etfw)\n\nOf course, this is all conjecture and there is no hard proof to indicate that this is what\nhappened.\n\nAnother interesting bit of information is that the \"Goga\" in the ransomware's moniker is a\nRomanian family name. This info tidbit coupled with the location it was first uploaded from\ncould make one wonder if the strain had its origin in Romania.\n\n## LockerGoga uses valid certificate\n\n[Analysis from Thomas Roccia, reverse engineer at McAfee, shows that the LockerGoga](https://twitter.com/fr0gger_/status/1089541211784953856)\nstrain was signed with a valid certificate, which would increase the chances of its\ndeployment on the victim hosts without raising suspicion in most cases.\n\nHowever, someone paying attention to the Windows alert asking for authorization of the\ncertificate would notice that something is not right, because it is for a host process for\nWindows Services and the signature is from MIKL Limited.\n\n\n-----\n\nThe certificate, issued by Comodo Certificate Authority (acquired by Francisco Partners and\nknown by its new brand name Sectigo) for code signing, has been revoked.\n\nA cursory check reveals that MIKL Limited is an IT consultancy firm incorporated in the UK\non December 17, 2014.\n\nKnown file samples for LockerGoga ransomware are 'worker' and 'worker32.' The malware\nlaunches a process with a name similar to what Microsoft uses for its Windows Services,\nsuch as 'svch0st' or 'svchub.'\n\n[For those looking to detect it this family of infections using Yara, security researcher V wrote](https://twitter.com/vxsh4d0w)\nthe [first rule that can help organizations protect their systems from getting hit by](https://pastebin.com/2wZWV4EU)\nLockerGoga ransomware.\n\nWe were told at the time of writing, that the global information systems of\nAltran Technologies continue to be unavailable. BleepingComputer reached out to the\nParis-based company to provide more information about the nature of the cyberattack that\nimpacted its operations but has not heard back by publishing time.\n\n### Related Articles:\n\n[Austin Peay State University resumes after ransomware cyber attack](https://www.bleepingcomputer.com/news/security/austin-peay-state-university-resumes-after-ransomware-cyber-attack/)\n\n[LockBit ransomware gang lurked in a U.S. gov network for months](https://www.bleepingcomputer.com/news/security/lockbit-ransomware-gang-lurked-in-a-us-gov-network-for-months/)\n\n[BlackCat/ALPHV ransomware asks $5 million to unlock Austrian state](https://www.bleepingcomputer.com/news/security/blackcat-alphv-ransomware-asks-5-million-to-unlock-austrian-state/)\n\n[Windows 11 KB5014019 breaks Trend Micro ransomware protection](https://www.bleepingcomputer.com/news/security/windows-11-kb5014019-breaks-trend-micro-ransomware-protection/)\n\n[Industrial Spy data extortion market gets into the ransomware game](https://www.bleepingcomputer.com/news/security/industrial-spy-data-extortion-market-gets-into-the-ransomware-game/)\n\n## IOCs\n\n\n-----\n\n### Hash:\n```\n73171ffa6dfee5f9264e3d20a1b6926ec1b60897\n\n File names:\nworker\nworker32\nbdf36127817413f625d2625d3133760af724d6ad2410bea7297ddc116abc268f_wQkb8SOVnc.bin\nsvch0st.5817.exe\nsvch0st.11077.exe\n\n Associated email addresses:\nCottleAkela@protonmail.com\nQyavauZehyco1994@o2.pl\n\n Ransom Note Text:\nGreetings!\nThere was a significant flaw in the security system of your company.\nYou should be thankful that the flaw was exploited by serious people and not some\nrookies.\nThey would have damaged all of your data by mistake or for fun.\nYour files are encrypted with the strongest military algorithms RSA4096 and AES-256.\nWithout our special decoder it is impossible to restore the data.\nAttempts to restore your data with third party software as Photorec, RannohDecryptor\netc.\nwill lead to irreversible destruction of your data.\nTo confirm our honest intentions.\nSend us 2-3 different random files and you will get them decrypted.\nIt can be from different computers on your network to be sure that our decoder\ndecrypts everything.\nSample files we unlock for free (files should not be related to any kind of\nbackups).\nWe exclusively have decryption software for your situation\nDO NOT RESET OR SHUTDOWN - files may be damaged.\nDO NOT RENAME the encrypted files.\nDO NOT MOVE the encrypted files.\nThis may lead to the impossibility of recovery of the certain files.\nTo get information on the price of the decoder contact us at:\nCottleAkela@protonmail.com;QyavauZehyco1994@o2.pl\nThe payment has to be made in Bitcoins.\nThe final price depends on how fast you contact us.\nAs soon as we receive the payment you will get the decryption tool and\ninstructions on how to improve your systems security\n\n```\n\n-----\n\n[Altran](https://www.bleepingcomputer.com/tag/altran/)\n[Cyber Attack](https://www.bleepingcomputer.com/tag/cyber-attack/)\n[LockerGoga](https://www.bleepingcomputer.com/tag/lockergoga/)\n[Ransomware](https://www.bleepingcomputer.com/tag/ransomware/)\n\n[Ionut Ilascu](https://www.bleepingcomputer.com/author/ionut-ilascu/)\n\nIonut Ilascu is a technology writer with a focus on all things cybersecurity. The topics he\nwrites about include malware, vulnerabilities, exploits and security defenses, as well as\nresearch and innovation in information security. His work has been published by\nBitdefender, Netgear, The Security Ledger and Softpedia.\n\n[Previous Article](https://www.bleepingcomputer.com/news/security/theoretical-ransomware-attack-could-lead-to-global-damages-says-report/)\n[Next Article](https://www.bleepingcomputer.com/news/security/police-forces-team-up-to-hunt-down-users-of-ddos-services/)\n\n### Comments\n\n[Amigo-A - 3 years ago](https://www.bleepingcomputer.com/forums/u/998576/amigo-a/)\n\nCottleAkela@protonmail.com and QyavauZehyco1994@o2.pl - in this variant\n\nAbbsChevis@protonmail.com and IjuqodiSunovib98@o2.pl - in another variant\n\n[Amigo-A - 2 years ago](https://www.bleepingcomputer.com/forums/u/998576/amigo-a/)\n\nDescription in the Digest \"Crypto-Ransomware\" about LockerGoga Ransomware:\n\n[https://id-ransomware blogspot com/2019/01/lockergoga-worker32-ransomware html](https://id-ransomware.blogspot.com/2019/01/lockergoga-worker32-ransomware.html)\n\n\n-----\n\nPost a Comment [Community Rules](https://www.bleepingcomputer.com/posting-guidelines/)\n\nYou need to login in order to post a comment\n\n[Not a member yet? Register Now](https://www.bleepingcomputer.com/forums/index.php?app=core&module=global&section=register)\n\n### You may also like:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-01-30 - New LockerGoga Ransomware Allegedly Used in Altran Attack.pdf"
    ],
    "report_names": [
        "2019-01-30 - New LockerGoga Ransomware Allegedly Used in Altran Attack.pdf"
    ],
    "threat_actors": [
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535860,
    "ts_updated_at": 1743041726,
    "ts_creation_date": 1653707347,
    "ts_modification_date": 1653707347,
    "files": {
        "pdf": "https://archive.orkl.eu/06ed7d16cc99956259497598eb6565cbedb71805.pdf",
        "text": "https://archive.orkl.eu/06ed7d16cc99956259497598eb6565cbedb71805.txt",
        "img": "https://archive.orkl.eu/06ed7d16cc99956259497598eb6565cbedb71805.jpg"
    }
}