{
    "id": "aea7c552-4d6a-4656-a92b-5a17f279714e",
    "created_at": "2024-10-26T02:06:20.798766Z",
    "updated_at": "2025-03-27T02:05:41.299272Z",
    "deleted_at": null,
    "sha1_hash": "32379a3be744cdf333effb0c395175d6cae4e58a",
    "title": "Study of a targeted attack on a Russian rail freight operator",
    "authors": "",
    "file_creation_date": "2024-09-03T12:40:46Z",
    "file_modification_date": "2024-09-03T12:40:46Z",
    "file_size": 2095062,
    "plain_text": "# Study of a targeted attack on a Russian rail freight operator\n\n\n-----\n\n**© Doctor Web, Ltd., 2024. All rights reserved.**\n\nThis document is the property of Doctor Web, Ltd. (hereinafter - Doctor Web). No part of this\ndocument may be reproduced, published or transmitted in any form or by any means for any\npurpose other than the purchaser's personal use without proper attribution.\n\nDoctor Web develops and distributes Dr.Web information security solutions which provide\nefficient protection from malicious software and spam.\n\nDoctor Web customers can be found among home users from all over the world and in\ngovernment enterprises, small companies and nationwide corporations.\n\nDr.Web antivirus solutions are well known since 1992 for continuing excellence in malware\ndetection and compliance with international information security standards. State certificates\nand awards received by the Dr.Web solutions, as well as the globally widespread use of our\nproducts are the best evidence of exceptional trust to the company products.\n\n**Study of a targeted attack on a Russian rail freight operator**\n**9/3/2024**\n\nDoctor Web Head Office\n2-12A, 3rd str. Yamskogo polya, Moscow, Russia, 125124\n\nWebsite: www.drweb.com\nPhone: +7 (495) 789-45-87\n\nRefer to the official website for regional and international office information.\n\n\n-----\n\n## Introduction\n\nSpear phishing is a popular method of delivering malware to computers in large organizations.\nIt differs from regular phishing in that the attackers gather information in advance and\npersonalize the message they send to encourage the victim to perform an action that will\nresult in a security breach. The primary targets are either high-level employees with access to\nvaluable information, or employees in departments that interact with multiple recipients. This\nis especially true for HR staff who receive many emails from strangers that have attachments\nin a variety of formats. This vector was chosen by the threat actors to attack a major freight\noperator in March 2024.\n\n\n-----\n\n## General Information About the Attack and the Tools Involved\n\nIn March 2024, a large Russian company in the rail freight industry contacted Doctor Web. A\nsuspicious email with an attachment caught the attention of their information security\ndepartment. After trying to determine the threat posed by the attached file, they contacted\nour specialists. After reviewing the request, our analysts concluded that the company had\nalmost been the victim of spear phishing. The goal of the perpetrators was to gather system\ninformation and launch modular malware on a compromised PC.\n\nTo carry out the attack, the criminals sent a phishing email disguised as a jobseeker's résumé\nto the company's email address. Attached to the email was an archive purporting to contain a\nPDF file with a job application. That file had the so-called “double” extension of .pdf.lnk.\nHiding malicious objects by using double extensions is a common tactic employed by\nattackers to fool their victims. By default, Windows hides file extensions as a convenience to\nthe user. And when a file has a “double” extension, the system only hides the last extension. In\nthis case, the victim could see the first extension—.pdf, while the .lnk extension was\nhidden. Moreover, even if the display of full filenames is enabled, the .lnk extension is always\nhidden by the operating system.\n\nMetadata stored in an lnk file\n\nThe real .lnk extension is an extension for shortcuts in Windows. In the Target field, you can\nspecify the path to any operating system object, such as an executable file, and run it with the\nrequired parameters. This attack covertly launched the PowerShell command prompt, which\ndownloaded from the attackers' website two malicious scripts, each of which launched its own\npayload.\n\n\n-----\n\nAttack chain\n\nThe first was a decoy .pdf file and executable file called YandexUpdater.exe, which posed\nas a component for updating Yandex Browser (the name of the real component is\n```\nservice_update.exe). This executable is a malware dropper called Trojan.Packed2.46324,\n\n```\nwhich, after conducting a series of checks to determine whether it is running in an emulated\nenvironment and whether debugging software is present, unpacks Trojan.Siggen28.53599\non the compromised system. The latter has remote control capabilities, collects system\ninformation and downloads various malicious modules. In addition to these functions, the\ntrojan also has anti-debugging capabilities. If antivirus, virtual machine and debugger\nprocesses are detected, the trojan overwrites its file with zeros and deletes it and the folder in\nwhich it was stored.\n\n\n-----\n\nDecoy PDF file\n\nThe second payload consisted of a decoy PDF file and Trojan.Siggen27.11306. This trojan is a\ndynamic library (DLL) with an encrypted payload. A unique feature of this trojan is that it\nexploits the vulnerability of Yandex Browser to DLL Search Order Hijacking. In Windows, DLL\nfiles are libraries that applications use to store functions, variables and interface elements.\nWhen launched, the applications search for libraries in several data stores in a specific order,\nso attackers can try to “jump the queue” and place a malicious library in the folder where DLL\nsearches are prioritized.\n\nSimplified DLL search prioritization scheme\n\n\n-----\n\nThis trojan is stored in the hidden %LOCALAPPDATA%\n```\n\\Yandex\\YandexBrowser\\Application folder under the name Wldp.dll. This is the\n\n```\ndirectory where Yandex Browser is installed and where the browser looks for the libraries it\nneeds at startup. In turn, the legitimate Wldp.dll library, whose function is to ensure the\nsecurity of application startup, is an OS system library and is located in the %WINDIR%\n```\n\\System32 folder. Since the malicious library is located in the Yandex Browser installation\n\n```\nfolder, it is loaded first. At the same time, it gets all the permissions of the main application: it\ncan execute commands and create processes from the context of the browser, as well as\ninherit firewall rules for Internet access.\n\nAfter the browser is launched, the malicious Wldp.dll library decrypts the payload\nembedded in it. Note that the decryption is done twice. The first time it is done using a key\ngenerated from the hash of the path where the malicious DLL is located, and then using a\nglobal key embedded in the body of the trojan. The decryption results in shell code, the\nexecution of which allows attackers to run an application, written in the .NET language, on the\ncompromised system. This executable, in turn, downloads malware from the network.\nUnfortunately, at the time of our investigation, the server that the downloader was\ncommunicating with was down, and we were unable to determine what specific trojan was\nbeing downloaded in this case.\n\nHaving discovered this vulnerability in Yandex Browser, we submitted our findings to Yandex.\nThe developers promptly released an updated version of Yandex Browser (24.7.1.380) where\n[this vulnerability (CVE-2024-6473) is fixed.](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-6473)\n\n\n-----\n\n## Operating Routine of Discovered Malware Samples\n\n\n#### Trojan.Packed2.46324\n\nA malicious Windows malware dropper program written in C++. The executable file is\nobfuscated with XOR encryption and packed with a custom packer. It is used to deliver\n**Trojan.Siggen28.53599 to compromised PCs.**\n\n### Trojan unpacking\n\nThe trojan is packed using a custom packer that is characterized by the zero physical size of\nsections bearing “traditional” names such as “.text”, “.rdata” and others.\n\nIn this case, one of the following sections —“.(>@”—contains some code. It also contains the\nentry point.\n\n\n-----\n\nOnce initialized, the source code containing the original entry point is extracted into empty\nsections.\n\n### Operating routine\n\n##### Initialization\n\nThe trojan reads the KUSER_SHARED_DATA struct, which contains various system information.\nThe trojan checks the value of this struct’s NtMajorVersion field, which must equal 10.\n\nIt then initializes the struct containing the pointers to the ntdll.dll, kernel32.dll,\n```\nuser32.dll, ole32.dll libraries, which are used to call functions from this struct. Then the\n\n```\nthree threads responsible for anti-debugging are initialized. After that, the struct for working\nwith the wevtapi.dll library is initialized and pointers to the libraries and various functions\nare obtained.\n\n##### Use of WinAPI\n\nThe trojan uses WinAPI system functions via a wrapper struct that contains a table of\nfunctions, library pointers, library load addresses, and an anti-debugging flag.\n\nThe table contains the following functions:\n\n  - Functions for working with WinAPI, i.e., finding a function pointer and calling it\n\n  - Helper functions—ad hoc implementation of the LoadLibrary and GetProcAddress\ncalls\n\n\n-----\n\n  - The configuration of input parameters for a range of functions\n\nWhen launched, the trojan initializes its main struct. It does this by using a modified CRC32\nalgorithm to find library load addresses in the PEB_LDR_DATA system struct. The trojan uses\ntwo methods to access functions stored in the libraries:\n\n  - Ad hoc implementation of the LoadLibrary and GetProcAddress calls\n\nThe trojan has two functions that mimic the implementation of LoadLibrary and\n```\nGetProcAddress. This method is used when the trojan needs access to an API contained in a\n\n```\nlibrary that has not yet been loaded into the process memory.\n\n  - Searching for libraries by their hashes in the PEB_LDR_DATA system struct\n\nThe trojan searches for a required library in the PEB_LDR_DATA struct using the\n```\nInMemoryOrderModuleList list, which contains pointers to all the libraries loaded into the\n\n```\nprocess memory and their names. The library name is matched by comparing the hash value\ngenerated using the modified CRC32 algorithm with the requisite library name. Next, the\nrequired library function is found in the table of exported library functions, in which case the\nfunction names are hashed in the same way. The library name and function are read using the\nmodified CRC32 algorithm.\n\n##### Debugger evasion\n\n**Checking the debug registers**\n\nThe trojan obtains the context of the parent thread and checks that the values of the Dr0–Dr7\nregisters are set to 0.\n\n**Checking for a debugged environment**\n\nIn the KUSER_SHARED_DATA struct, the trojan checks the first two bits in the\n```\nKdDebuggerEnabled field; the value of these bits must be set to 0.\n\n```\nUsing the NtQueryInformationProcess function, the trojan checks for the presence of a\ndebugger by reading various parameters of the PROCESSINFOCLASS struct:\n```\nProcessDebugFlags, ProcessDebugPort, ProcessDebugObjectHandle,\nProcessTlsInformation.\n\n```\n**Checking for debugger drivers**\n\nThe trojan scans the %WINDIR%\\System32\\drivers directory for files that indicate the\npresence of debugging software. It then calculates the filename hash using the modified\nCRC32 algorithm and compares the result to the blacklist hashes.\n\nEach check is timed, and if the check fails, a flag is set in a global variable that is checked at\nvarious stages of execution. If the flag check fails, the trojan terminates its process.\n\n\n-----\n\n##### Environment check\n\nTo protect itself from running in a virtualized environment, the trojan scans a number of OS\nlogs, using the wevtapi.dll library. It searches for the below strings:\n\nIn the logs Microsoft-Windows-Shell-Core/Operational, System, Application:\n\n - \\npcap.sys\n\n - Wireshark\n\n - API_Monitor\n\n - apimonitor\n\n - API Monitor\n\n - rohitab.com\n\n - hex-rays.com\n\n - processhacker.sys\n\n - ProcessHacker\n\n - PROCMON2\n```\n ida64.exe\n\n```\nIn the logs Microsoft-Windows-Storage-Storport/Operational, System,\n```\nMicrosoft-Windows-Storsvc/Diagnostic, Microsoft-Windows-StorageSpacesDriver/Operational, Microsoft-Windows-Partition/Diagnostic, MicrosoftWindows-Kernel-PnP/Configuration, Application:\n\n```\n - VMTools\n\n - VMUpgradeHelper\n\n - VirtualBox Guest\n\n - VBoxService.exe\n\n - VBOX HARDDISK\n\n - _FLOPPY_\n\n - \\VMWVM\n\n - _VBOX&\n\n - NECVMWar\n\n - prl_\n\n - VMware\n\nAdditionally, in the Application log:\n\n - VMware Player\n\n - VMware NAT Service\n\n - \\Device\\VBoxNet\n\n - Oracle VM VirtualBox\n\n\n-----\n\nAfter performing these checks, the dropper unpacks Trojan.Siggen28.53599, the payload\ncontained in the resources. This is done using a modified RC4 algorithm; the key for the cipher\nis 8 bytes long. The dropper then decrypts the payload configuration, which is encrypted using\nthe XOR cipher. The resulting configuration is stored in a string labeled with the characters\n\"DANTEMARKER\", which are overwritten.\n\nAfter all the prep work is done, the dropper projects the payload into the memory and\ntransfers control to it.\n\n\n-----\n\n#### Trojan.Siggen28.53599\n\nA malicious program for Windows written in C++. The main functionality of the trojan is to\ndownload and manage modules received from its C2 server.\n\n### Operating routine\n\nThe trojan has a number of basic and helper structs that are initialized at startup and stored as\npointers in global variables.\n\n##### Basic structs:\n\n**WinAPI wrapper**\n\nThe trojan uses WinAPI system functions via a wrapper struct that contains a table of\nfunctions, library pointers, library load addresses, and an anti-debugging flag.\n\nThe table contains the following functions:\n\n  - Functions for working with WinAPI, i.e., for finding a function pointer and calling it\n\n  - Helper functions—the ad hoc implementation of the LoadLibrary and\n```\n   GetProcAddress calls\n\n```\n  - The configuration of the input parameters for a range of functions\n\nWhen launched, the trojan initializes its main struct. It does this by using a modified CRC32\nalgorithm to find library load addresses in the PEB_LDR_DATA system struct. The trojan uses\ntwo methods to access functions stored in the libraries:\n\n  - Ad hoc implementation of the LoadLibrary and GetProcAddress calls\n\nThe trojan has two functions that mimic the implementation of LoadLibrary and\n```\nGetProcAddress. This method is used when the trojan needs access to an API contained in a\n\n```\nlibrary that has not yet been loaded into the process memory.\n\n  - Searching for libraries by their hashes in the PEB_LDR_DATA system struct\n\nThe trojan searches for a required library in the PEB_LDR_DATA struct, using the\n```\nInMemoryOrderModuleList list, which contains pointers to all the libraries loaded into the\n\n```\nprocess memory and their names. The library name is matched by comparing the hash value\ngenerated using the modified CRC32 algorithm with the requisite library name. Next, the\nrequired library function is found in the table of exported library functions, in which case the\nfunction names are hashed in the same way. The library name and function are read using the\nmodified CRC32 algorithm.\n\n\n-----\n\n**Logger struct**\n\nThis is a struct whose main purpose is to generate the application log. The log contains\ninformation about errors and the step currently being executed.\n\n**System information collector struct**\n\nThe main purpose of this struct is to collect system information and send it to the C2 server.\n\n**C2 server communication struct**\n\nThis struct ensures the interaction with the C2 server. It contains a struct for working with the\n```\nwinhttp.dll library and information about the control server: the port, IP address and\n\n```\nrouting table.\n\n**Module and configuration struct**\n\nThe main function of this struct is to manage the operation of modules and their\nconfigurations. It contains vectors that describe the modules, their configuration, and auxiliary\nsystem information.\n\n**Manager struct**\n\nThe main purpose of this struct is to control program operation and ensure interaction\nbetween other structs. It holds pointers to all the other primary structs: WinAPI wrapper,\nlogger, communication, and configuration.\n\n##### Helper structs:\n\n**Structs for working with cryptography: SHA-1, SHA-256**\n\n**Structs for working with auxiliary libraries: bcrypt.dll, winhttp.dll**\n\n**Structs for storing various flags**\n\n##### Debugger evasion\n\nWhen launched, the trojan also initializes 3 threads to evade debuggers:\n\n**Checking the debug registers**\n\nThe trojan obtains the context of the parent thread and checks that the values of the Dr0–Dr7\nregisters are set to 0.\n\n\n-----\n\n**Checking for debugged environment**\n\nIn the KUSER_SHARED_DATA struct, the trojan checks the first two bits in the\n```\nKdDebuggerEnabled field; the value of these bits must be set to 0.\n\n```\nUsing the NtQueryInformationProcess function, the trojan checks for the presence of a\ndebugger by reading various parameters of the PROCESSINFOCLASS struct:\n```\nProcessDebugFlags, ProcessDebugPort, ProcessDebugObjectHandle,\nProcessTlsInformation.\n\n```\n**Checking for debugger drivers**\n\nThe trojan scans the %WINDIR%\\System32\\drivers directory for files that indicate the\npresence of debugging software. It then calculates the filename hash, using the modified\nCRC32 algorithm, and compares the result to the blacklist hashes.\n\n##### Checking for a copy of the trojan in the system\n\nAfter initialization, the trojan attempts to create a mutex which is a Base64 SHA-1 encoded\nhash of the MachineGuid string value. If the attempt to capture the mutex fails, the line\n\"Found another agent running. Exiting...\" is written to the application log and\nthe trojan is terminated.\n\n##### Verifying keys and creating a handshake\n\nThe trojan checks for an existing handshake. This is done by accessing the key in the\n\"Microsoft Software Key Storage Provider\" CNG key storage, using the\n```\nNCryptOpenKey function. The key name is a SHA-256 hash of the MachineGuid value. If\n\n```\nsuch a key does not exist, the availability of the network connection is checked: if the\nconnection is established, the trojan initiates the creation of the handshake:\n\n  - A copy of the RSA internal key from the “Microsoft Software Key Storage\n```\n  Provider” CNG key storage is created\n\n```\n  - A key is received from the server\n\n  - This key is stored in the storage with a name corresponding to the SHA-256 hash of the\n```\n  MachineGuid value.\n\n```\nThe trojan parses the incoming packet for a new C2 server address and port number. Once the\nhandshake is established, the following system information is sent to the C2 server: CPU\narchitecture, OS name, user interface type, installed application identifiers, disk information,\nuser names, and locale.\n\n\n-----\n\n##### Basic functions\n\nThe trojan performs the following actions:\n\n  - Loads and unloads modules\n\n  - Sends messages to the C2 server about its operation or errors\n\n  - Changes the configuration of modules\n\n  - Updates the trojan body, if necessary\n\n##### Module structure and configuration\n\nA module is a dynamic library that is projected into the memory and has the following\nexportable functions:\n\n - Start\n\n - Stop\n\n - Configure\n\n - GetID\n\n - GetStatus\n\n - SetStatus\n\n - GetStarted\n\n - GetHandler\n\n - Destroy\n\n - PushErrorCMR\n\nThe module identifier indicates its function, i.e., knowing the identifier, you can determine\nwhich tasks are sent by the C2 server.\n\n|Identifier|Purpose|\n|---|---|\n|238|Inject|\n|27|Purpose unknown|\n|44|Purpose unknown|\n\n\n-----\n\n**JSON with module configuration**\n```\n{\n \"triggers\": [\n  {\n    \"schedule\": \"<str_value>\",\n    \"process\": \"<str_value>\",\n    \"repetitions\": \"<int_value>\",\n    \"sendCmr\": {\n     \"name\": \"<str_value>\",\n     \"interval\": \"<int_value>\"\n   }\n  }\n ]\n}\n\n```\n**Result of the module’s execution**\n\nAfter the module completes its task, it generates a response\n```\n{\n \"CommandModuleResponse\": \"<str_value>\",\n \"requestId\": \"<int_value>\",\n \"moduleId\": \"<int_value>\",\n \"exitCode\": \"<int_value>\",\n \"info\": \"Error\" //this field is only shown if there was an error in the\nmodule’s operation; otherwise this field is missing\n}\n\n##### Trojan update\n\n```\nWhile in operation, the trojan checks the availability of its update flag. If this flag is set, the\ntrojan performs a series of system checks, and, based on the results, selects one of the two\nupdate strategies. If antivirus software is detected on the compromised PC, the trojan is\nupdated through the loading of shellcode; otherwise, it is updated using the Inject module.\n\n**Checking for antivirus software**\n\nThe trojan body contains a list of hashes of antivirus program names. When scanning for\nantivirus software, the trojan obtains a list of processes and calculates the hashes of running\napplications, which are compared to the following hardcoded list:\n\n  - msmpeng\n\n  - mssense\n\n  - avastsvc\n\n  - dwservice\n\n  - avp\n\n  - nortonsecurity\n\n  - coreserviceshell\n\n  - avguard\n\n  - fshoster32\n\n\n-----\n\n - vsserv\n\n - mbam\n\n - adawareservice\n\n - avgsvc\n\n - wrsa\n\n**Shellcode for directory removal**\n\nInput arguments:\n\n  - directory name\n\nActions performed:\n\n  - Looks up the kernel32.dll library address in the PEB_LDR_DATA struct\n\n  - Gets the functions for the shellcode’s operation from the library export results, where the\nlibrary name and function names are determined by their hashes\n\n  - Determines the path to the %LOCALAPPDATA%\\EROCS\\ directory\n\n  - Overwrites with zeros and deletes all the files in the specified directory\n\n  - Deletes the directory itself\n\n**Shellcode for restarting the trojan**\n\nActions performed:\n\n  - Gets the list of processes, using the NtQuerySystemInformation function (the\n```\n  SystemProcessInformation parameter); checks that the UniqueProcessId field is\n\n```\nequal to 0x434F5245\n\n - Deletes the HKEY_CURRENT_USER\\Software\\Uninstall key\n\n**Self-deletion**\n\nThe trojan also has a self-deletion function that is triggered when the “deadline” registry key,\nwhich is responsible for the trojan lifetime and is updated when a new command from the C2\nserver is received, is set to a specific value. The trojan also initiates the self-deletion procedure,\nusing WinAPI if errors are detected during the above checks. In this case, it performs the\nfollowing actions:\n\n  - Deletes its directory\n\n  - Deletes the handshake\n\n  - Deletes registry keys created while the trojan is in operation\n\n##### Sending messages to the C2 server\n\nThe following User-Agent values are used by the trojan to send messages:\n\n\n-----\n\n```\nMozilla/5.0 (Windows NT 10.0; Win64; x64; rv:88.0) Gecko/20100101\nFirefox/88.0\nMozilla/5.0 (Windows NT 10.0; Win64; x64; rv:79.0) Gecko/20100101\nFirefox/79.0\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,\nlike Gecko) Chrome/90.0.4430.93 Safari/537.3\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,\nlike Gecko) Chrome/80.0.3987.149 Safari/53\nMozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,\nlike Gecko) Chrome/79.0.3945.88 Safari/537.3\n\n```\nAll outgoing and incoming messages are encrypted using RSA.\n\n\n-----\n\n#### Trojan.Siggen27.11306\n\nA Windows trojan written in C. It is a DLL with an encrypted payload.\n\n### Operating routine\n\nDuring initialization, the trojan sequentially creates two threads: one to decrypt the data and\nthe other to execute the payload. Initially, the payload is encrypted with a key that is the path\nto the executable. During the first run, the trojan rebuilds the executable and covers it with\nanother layer of encryption. This encryption binds the payload to the infected PC. The\npreparation phase consists of the following steps:\n\n  - A random salt is generated and stored in a new trojan body at a specific offset\n\n  - BIOS information is obtained\n\n  - This information is hashed using the salt generated in step 1, and the resulting hash is\nthe key to encrypt the payload\n\n  - The payload is encrypted using a “custom” key\n\nAfter this transformation, the trojan has two decryption stages:\n\n**Stage 1: Decryption using constants from the compromised PC**\n\n  - The salt stored in the trojan body is taken at a specific offset\n\n  - The salt is used to create a hash of the BIOS information\n\n  - The payload is decrypted\n\n**Stage 2: Decryption of the payload encrypted with the default key**\n\n  - The ImagePathName value is extracted from the RTL_USER_PROCESS_PARAMETERS\nstruct—this field is a Unicode string whose length must be greater than 0x76 bytes (in\nour case the filename was %LOCALAPPDATA%\n```\n   \\Yandex\\YandexBrowser\\Application\\Wldp.dll)\n\n```\n  - The last 0x76 bytes are read from the above value\n\n  - The hash of this value, which is the key for the symmetric algorithm, is generated\n\n  - The payload is decrypted\n\n##### Encryption algorithm\n\nA modified ChaCha20 algorithm is used as the symmetric encryption algorithm. The\nmodification consists of an additional layer for key initialization: the input key undergoes one\nround of the algorithm, after which it becomes the key for the regular algorithm.\n\n\n-----\n\n##### Hashing algorithm\n\nA modified BLAKE2 algorithm is used as the hash function. The modification is that multiple\nrepetitive hashes of the input data are used.\n\n##### Payload\n\nThe payload is a shellcode generated using [https://github.com/TheWover/donut/tree/master.](https://github.com/TheWover/donut/tree/master)\nThis shellcode decrypts and downloads an MZPE file written in .NET, the main purpose of\nwhich is to launch a trojan downloaded from the Internet. The main body of the shellcode can\nbe found at [https://github.com/TheWover/donut/blob/master/loader_exe_x64.h.](https://github.com/TheWover/donut/blob/master/loader_exe_x64.h)\n\nThe shellcode performs the following actions:\n\n  - Checks the flag responsible for executing the load in a separate or main thread\n\n  - Decrypts the MZPE file into a new allocated memory area\n\n  - Loads the ole32.dll, oleaut32.dll, wininet.dll, mscoree.dll, and\n```\n  shell32.dll libraries, using the LoadLibraryA function\n\n```\n - Loads the WldpQueryDynamicCodeTrust, WldpIsClassInApprovedList,\n```\n  EtwEventWrite and EtwEventUnregister functions, using the GetProcAddress\n\n```\nfunction\n\n  - Initializes the AMSI interface\n```\n  o Loads amsi.dll\n  o Loads the AmsiInitialize, AmsiScanBuffer and AmsiScanString functions\n\n```\n  - Reads the value of the AMSI bypass flag; this flag is not set in this sample\n\n  - Downloads the .NET application\n\nThe .NET stager downloads other malware, saves it under the name “YandexUpdater.exe”\nand then launches it. At the time of our investigation, the file was no longer available on the\nserver from which the malware was supposed to be downloaded, so we were unable to\npositively identify the downloaded software; however, we can assume that the file in question\ncould be the same Trojan.Packed2.46324.\n\n\n-----\n\n## Conclusion\n\nThus, we see a multi-vector, multi-stage infection scheme with two different trojans that are\ndelivered to a compromised system when a file from a phishing email is opened. Despite the\ncomplexity of the implementation, preventing and protecting against such attacks is quite\nsimple:\n\n  - Raise employee awareness of information security issues (carefully check links and\nfilenames, and do not open suspicious objects).\n\n  - Use software products that perform email filtering, such as [Dr.Web Mail Security Suite, to](https://products.drweb.com/mailserver/)\nprevent the delivery of malicious emails and attachments.\n\n  - Install antivirus software, such as [Dr.Web Desktop Security Suite and](https://products.drweb.ru/workstations/) [Dr.Web Server](https://products.drweb.ru/fileserver/)\n\n[Security Suite, on all network nodes, which will prevent a dangerous file from getting](https://products.drweb.ru/fileserver/)\nthrough when users are working on the Internet or block suspicious activities on user\ncomputers if a file was delivered on a USB drive.\n\n  - Regularly apply software updates that fix program bugs.\n\n\n-----\n\n## Appendix 1. Indicators of Compromise\n\n\n##### SHA1 hashes\n\n**Trojan.Packed2.46324**\n\n34a4c5f28c7df23662962c3eaa0a15b7ae48b488: YandexUpdater.exe\n\n**Trojan.Siggen27.11306**\n\n60eaa4fd53b78227760864e6cf27b08bc4bdde72: Wldp.dll\n\n**Trojan.Siggen28.53599**\n\n853d6a17f0a1a4035b52699a447eeb4ad1ca6cf7\n\n##### File artifacts\n\nJob Application_202402523.rar )\n\nJob Application.pdf.lnk\n\n102fa066-cc9d-4a80-b3aa-12d5df196b42.pdf\n\n##### Domains\n\ninfosecteam[.]info\n\n##### IP addresses\n\n109.248.147[.]132\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://st.drweb.com/static/new-www/news/2024/september/Study_of_a_targeted_attack_on_a_Russian_rail_freight_operator_en.pdf"
    ],
    "report_names": [
        "Study_of_a_targeted_attack_on_a_Russian_rail_freight_operator_en.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1729908380,
    "ts_updated_at": 1743041141,
    "ts_creation_date": 1725367246,
    "ts_modification_date": 1725367246,
    "files": {
        "pdf": "https://archive.orkl.eu/32379a3be744cdf333effb0c395175d6cae4e58a.pdf",
        "text": "https://archive.orkl.eu/32379a3be744cdf333effb0c395175d6cae4e58a.txt",
        "img": "https://archive.orkl.eu/32379a3be744cdf333effb0c395175d6cae4e58a.jpg"
    }
}