{
    "id": "aec33e19-31f8-4e2e-b532-3e4f8089536c",
    "created_at": "2023-01-12T15:04:34.631066Z",
    "updated_at": "2025-03-27T02:05:37.352172Z",
    "deleted_at": null,
    "sha1_hash": "832c6f76845a392d7643d882dee0501c4f3165a5",
    "title": "2022-06-02 - ModPipe POS Malware- New Hooking Targets Extract Card Data",
    "authors": "",
    "file_creation_date": "2022-09-01T10:32:03Z",
    "file_modification_date": "2022-09-01T10:32:03Z",
    "file_size": 690477,
    "plain_text": "# ModPipe POS Malware: New Hooking Targets Extract Card Data\n\n**[kroll.com/en/insights/publications/cyber/modpipe-pos-malware-new-hooking-targets-extract-card-data](https://www.kroll.com/en/insights/publications/cyber/modpipe-pos-malware-new-hooking-targets-extract-card-data)**\n\nSend Message\nSend Message\nThank you\n\nOne of our experts will contact you shortly.\n\nSorry, something went wrong :( Please try again later!\n\nPlease try again later!\n\n**Contact details**\n\nI would like to receive periodic news, reports, and invitations from Kroll, a Duff & Phelps.\nchevron Path 2\n\n### Cyber Risk\n\nThu, Jun 2, 2022\n\n\n-----\n\nSean Straw\n\nKroll’s incident responders have seen threat actor groups becoming increasingly\nsophisticated and elusive in the tactics, techniques and procedures they employ to steal\npayment card data. One common method is to “scrape” the Track 1 or Track 2 data stored on\nthe card’s magnetic stripe, which provides the cardholder account and personal information\ncriminals need to make fraudulent “card-not-present” (CNP) transactions. This no longer\nrequires physical access to a card or using a rogue device near an ATM to skim and store\ncard data. The ongoing migration of point of sale (POS) management systems to the cloud\nprovides actors with a rapidly expanding attack surface that is rife with opportunities for\nexploitation.\n\n[The Kroll Malware Analysis and Reverse Engineering team has observed recent ModPipe](https://www.kroll.com/en/services/cyber-risk/incident-response-litigation-support/malware-analysis)\nmalware activity targeting payment card information. ModPipe continues to use the JHook\nhooking module to steal card information when it is encrypted or decrypted on card\nprocessing servers. Kroll analyzed a recent sample that hooked the memcpy function within\n**rsaenh.dll, a Microsoft cryptographic library. Previous reporting had identified memcpy as a**\n\n\n-----\n\n[possible hooking target for ModPipe. Included in the analysis is a Ghidra script created by](https://github.com/krollcyber/ghidra_map_vadinfo)\nKroll analysts to quickly map process memory into the correct virtual address space using\nVolatility 3.\n\nModPipe Analysis\n\n**ModPipe Background**\n\nAs [first reported in November 2020, ModPipe is a modular backdoor that runs within system](https://www.welivesecurity.com/2020/11/12/hungry-data-modpipe-backdoor-hits-pos-software-hospitality-sector/)\nprocesses and uses named pipes to communicate between modules. ModPipe has\nhistorically targeted devices running ORACLE MICROS Restaurant Enterprise Series (RES)\n3700 POS, but the capabilities it employs could be used to target other systems. The\npersistent loader is an executable that unpacks an inner payload before injecting the core\nModPipe module into a system process. In Kroll’s analysis, this process was typically\n**[lsass.exe, though wininit.exe and services.exe have also been identified as additional](https://www.welivesecurity.com/2020/11/12/hungry-data-modpipe-backdoor-hits-pos-software-hospitality-sector/)**\ntargets.\n\nOnce injected, it has been noted that the unpacked core module will attempt to connect to\nlegitimate URLs to confirm network connectivity before establishing command-and-control\n(C2) connections and then downloading and executing additional modules from a remote,\nactor-controlled server. Along with the C2 and injection modules, the following modules have\nbeen previously identified:\n\nGetMicInfo – A module to steal database passwords and sensitive information related\nto MicrosPOS software\nModScan – A module designed to scan IP addresses\nProcList – Gets a list of running processes and loaded modules\n\nAt the time of initial analysis, analysts believed that additional modules most likely exist, but\nthe modules had not yet been seen in the wild.\n\n**JHook Module Background**\n\nIn April 2021, [researchers reported that they had identified two additional modules used by](https://www.foregenix.com/blog/modpipe-malware-detail)\nModPipe malware, including the JHook module. The JHook module is designed to replace\nlegitimate function calls within a process with malicious JHook functions that are designed to\ntarget two legitimate functions for scraping:\n\n**CryptDecrypt – a decryption function within the advapi32.dll library**\n**memcpy – a common C function to copy data from one memory location to another**\n\nWhen the JHook module is run, these functions can be replaced by scraping functions which\ncall the original legitimate function after reviewing the data and looking for Track 1 and Track\n2 card data. Once the target data is located, the JHook scraping function copies the\nidentified track data to a buffer before sending the data to the core module for exfiltration.\n\n\n-----\n\nThe researchers reported that the configuration they had identified targeted the\n**CryptDecrypt function within dbsecurity2.dll using the format provided in Figure 1.**\n\n```\n<HOOK_TYPE>{\n\n```\n```\n<TARGET_MODULE>|<HOOK_TARGET_DLL>:<HOOK_TARGET_FUNC>:<HOOK_FUNC>\n\n```\n\nFigure 1 – JHook format used to target “CryptDecrypt” function within dbsecurity2.dll\n\nOur Findings\n\nWe have analyzed an instance of ModPipe that was configured to hook the memcpy\nfunction within rsaenh.dll, a Microsoft cryptographic library, in the CCS.exe process of a\nMicros RES POS system. The configured hook is provided in Figure 2.\n\n```\nHookImport{\n\n```\n```\n\\rsaenh.dll|ntdll.dll:memcpy:JHook_memcpy\n\n```\n```\nHookImport{\n\n```\n```\n\\rsaenh.dll|ntdll.dll:memcpy:\n\n```\n```\nJHook_memcpy\n\n```\n\nFigure 2 – JHook Format Identified by Kroll to Hook “memcpy” Function within “rsaenh.dll”\n\nThe module is configured to hook the memcpy function of ntdll.dll within rsaenh.dll.\nInterestingly, Kroll has not yet identified why or where the rsaenh.dll library is used within the\nMicroPOS CCS.exe process. Dependency analysis of the CCS.exe executable did not\nidentify any locations where the executable or its libraries listed a function from rsaenh.dll.\nFurther analysis is underway to identify the specific use of rsaenh.dll within the MicroPOS\n**CCS.exe process. However, as the library provides cryptographic functionality, it is**\nreasonable to assume that some portion of the library is used for encrypting or decrypting\ntrack data. Kroll identified stolen track data within memory to confirm that despite the unclear\norigin of rsaenh.dll, the module had found some success in stealing track data previously.\n\nTo hook the memcpy function, the malware replaces the entry for the function within the\nImport Address Table (IAT) of rsaenh.dll with the address of a trampoline function created by\nthe module in a new section of readable/writeable/executable memory (Figure 3).\n\n\n-----\n\nFigure 3 – The Trampoline Function\n\nWhen called, the scraping function checks to ensure that the count argument of memcpy is\nat least 10 and that a src argument has been provided before inserting an exception handler\ninto the exception handler’s chain (Figure 4).\n\nFigure 4 – The Beginning of the “JHook memcpy” Function\n\n\n-----\n\nThe exception handler increments a counter before setting the instruction counter to be near\nthe end of the function. This effectively catches and ignores any errors from the scraping\nroutine (Figure 5).\n\nFigure 5 – The Registered Exception Handler\n\nAs the earlier researchers noted, after copying the identified data to an internal buffer, the\nscraping function increments a counter common to both the JHook_memcpy and\n**JHook_CryptDecrypt functions. At the time of this writing, the internal buffer within memory**\nhad tracked approximately double the number of cards identified in the initial Common Point\nof Purchase notification.\n\n**Mapping Memory within Ghidra**\n\nAs part of Kroll’s analysis, analysts reviewed a memory dump of a system with ModPipe and\nthe JHook module active. To facilitate the reverse engineering of the module, Kroll developed\na short [Ghidra script to take the output of the](https://github.com/krollcyber/ghidra_map_vadinfo) [Volatility 3 vadinfo module and quickly map the](https://github.com/volatilityfoundation/volatility3)\nmemory to the correct locations within the Ghidra CodeBrowser.\n\nWhen a process of interest has been identified, all the process memory can be dumped\nusing the Volatility 3 vadinfo module to a directory, with the standard output of the module\nwritten to a text file. The module includes the VPN start and end for each memory section,\nsource file when available and the memory protection (Figure 6).\n```\npy E:\\tools\\volatility3\\vol.py -f .\\memory_dump -o 644_vadinfo\nwindows.vadinfo --pid 644 --dump > vadinfo.out\n\n```\nFigure 6 – Command to dump memory using the vadinfo module\n\nAfter opening a section of memory and setting the language for the CodeBrowser, the Ghidra\nscript can be run, prompting for the output directory (644_vadinfo) and output file\n(vadinfo.out). The script will then create the appropriate memory map for all available dump\nfiles (Figure 7).\n\n\n-----\n\nFigure 7 – Memory Map After Running the Script\n\nThis enables analysts to easily cross-reference code from different sections of memory, such\nas the JHook trampoline, the JHook memcpy function and the modified IAT within\n**rsaenh.dll (Figure 8).**\n\nFigure 8 – Trampoline function showing references to different sections of memory mapped\nby the script\n\n**Detection and Mitigation**\n\nAs of this publication, ModPipe is considered advanced, but not commonly used. There has\nbeen limited research on the malware, with no proof of a parent group or what threat actors\nare doing with the stolen data after exfiltration. ModPipe relies on elevated privileges and\n[would generally fall within the actions-on-objectives within the Kroll Intrusion Lifecycle.](https://www.kroll.com/en/insights/publications/cyber/kroll-intrusion-lifecycle)\n\nHardening steps like network segmentation, enabling multifactor authentication and utilizing\nendpoint detection and monitoring that can identify malware such as ModPipe can help\nprevent threat actors from achieving the necessary level of access to deploy ModPipe.\n\n\n-----\n\nEndpoint detection can also be configured to look for unusual network communications from\nsystem processes.\n\nEnsuring your organization has good overall cybersecurity hygiene can prevent a threat actor\nfrom gaining access to your network, thus preventing malware from being placed on your\nserver. These [10 essential cybersecurity controls can help improve your security posture and](https://www.kroll.com/en/insights/publications/cyber/10-essential-cyber-security-controls)\nincrease your cyber resilience. For more information, contact us via our 24x7 cyber incident\n[response hotlines or connect with us through our Contact Us page.](https://www.kroll.com/en/contactus)\n\n**Indicators of Compromise**\n\nType Value\n\nFilename Mljpmi.exe\n\nMD5 34d03f1900e759e2a670c42d7af14a3d\n\nSHA1 10ea1722991a787fef9a3a2545f7bcc7d0b4f42c\n\nSHA256 74fd2d70b085d70bd883854ae9ebd1684f3de824995acd4df1993d3d469c62ec\n\nURL ouidji12345.ddns[.]net/gettime.html\n\n\nIP\nAddress\n\nIP\nAddress\n\n\n185.206.147.15\n\n89.163.246.135\n\n\n-----\n\n## Stay Ahead with Kroll\n\n### Cyber Risk\n\nIncident response, digital forensics, breach notification, managed detection services,\npenetration testing, cyber assessments and advisory.\n\n### Malware Analysis and Reverse Engineering\n\nKroll’s Malware Analysis and Reverse Engineering team draws from decades of private and\npublic-sector experience, across all industries, to deliver actionable findings through in-depth\ntechnical analysis of benign and malicious code.\n\n### Payment Card Industry Services\n\nKroll offers a wide range of services for both merchants and payment processors, from audits\nto incident management services, to pragmatic approaches for strengthening your cyber\ndefenses.\n\n### Computer Forensics\n\nKroll's computer forensics experts ensure that no digital evidence is overlooked and assist at\nany stage of an investigation or litigation, regardless of the number or location of data\nsources.\n\n### 24x7 Incident Response\n\nEnlist experienced responders to handle the entire security incident lifecycle.\n\n### Data Recovery and Forensic Analysis\n\n\n-----\n\nKroll's expertise establishes whether data was compromised and to what extent. We uncover\nactionable information, leaving you better prepared to manage a future incident.\n\n### Data Collection and Preservation\n\nImprove investigations and reduce your potential for litigation and fines with the strict chainof-custody protocol our experts follow at every stage of the data collection process.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-02 - ModPipe POS Malware- New Hooking Targets Extract Card Data.pdf"
    ],
    "report_names": [
        "2022-06-02 - ModPipe POS Malware- New Hooking Targets Extract Card Data.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535874,
    "ts_updated_at": 1743041137,
    "ts_creation_date": 1662028323,
    "ts_modification_date": 1662028323,
    "files": {
        "pdf": "https://archive.orkl.eu/832c6f76845a392d7643d882dee0501c4f3165a5.pdf",
        "text": "https://archive.orkl.eu/832c6f76845a392d7643d882dee0501c4f3165a5.txt",
        "img": "https://archive.orkl.eu/832c6f76845a392d7643d882dee0501c4f3165a5.jpg"
    }
}