{
    "id": "aee6183b-2c63-4e26-a428-82097b17b90f",
    "created_at": "2023-01-12T15:00:13.675944Z",
    "updated_at": "2025-03-27T02:08:41.331042Z",
    "deleted_at": null,
    "sha1_hash": "9bc143a583dff40687c7ddd910336e24db45e053",
    "title": "2021-06-02 - Google PPC Ads Deliver Redline, Taurus, and mini-Redline Infostealers",
    "authors": "",
    "file_creation_date": "2022-05-28T01:57:58Z",
    "file_modification_date": "2022-05-28T01:57:58Z",
    "file_size": 5174169,
    "plain_text": "# Google PPC Ads Deliver Redline, Taurus, and mini- Redline Infostealers\n\n**[blog.morphisec.com/google-ppc-ads-deliver-redline-taurus-and-mini-redline-infostealers](https://blog.morphisec.com/google-ppc-ads-deliver-redline-taurus-and-mini-redline-infostealers)**\n\n[Tweet](https://twitter.com/share)\n\n\n-----\n\nIn the past month, Morphisec has investigated the origin of several increasingly prevalent\ninfostealers. These include Redline, Taurus, Tesla, and Amadey.\n\nAs part of our research, we identified pay-per-click (PPC) ads in Google’s search results that\nlead to downloads of malicious AnyDesk, Dropbox and Telegram packages wrapped as\nISO images.\n\nThe PPC ads targeted specific IP ranges in the US and probably some other countries. Nontargeted IPs are redirected to legitimate pages that download the correct applications.\n\nThe advertisements being on the first page indicates the need for constant vigilance on all\nlevels. Adversaries will clearly take all opportunities possible to target their chosen victims,\neven going so far as to use legitimate services such as Google Adwords.\n\nIn this threat post we will go through three attack chains that lead to Redline, Taurus and a\nnew mini-Redline infostealer compromise. We will focus on two adversaries because of\nsimilarities in patterns, certificates, and C2s. The first adversary leverages Redline and the\nsecond uses Taurus and mini-Redline.\n\nWe will cover Amadey in a separate blog post.\n\n## Technical Introduction\n\n\n-----\n\nAll of these attack chains start with one of a dozen paid Google ads that lead to a website\nwith an ISO image download. The ISO image size is larger than 100MB, which allows the\nimage to evade some scanning solutions that are optimized on throughput and size.\n\nMounting the ISO image leads to executables that are usually, but not always, digitally\nsigned and legitimately verified.\n\nAdversary One delivers the Redline infostealer.\n\n.Net executables are obfuscated with known obfuscators such as DeepSea, which\nleads to a custom obfuscated .Net DLL loader that eventually leads to a custom\nobfuscated Redline stealer .Net executable.\n\nAdversary Two delivers Taurus and a mini-Redline infostealer.\n\n**Taurus AutoIt - 7fx executables that recreate and execute a legitimate AutoIt compiler**\nwith a malicious AutoIt script and a malicious encrypted Taurus executable that will be\nhollowed into the AutoIt process.\n**Mini-Redline - A minimized .Net version of the Redline stealer with some common**\nfunctionality for stealing data from browsers. It features different configuration and\ncommunication patterns wrapped in four layers of obfuscation.\n\n## Redline Infostealer\n\nAs can be seen from the image below, a simple search for “anydesk download” leads to\nthree pay-per-click Google ads. All three lead to malicious infostealers. . The first 2\nadvertisements lead to a Redline stealer while the third one leads to the Taurus infostealer.\n\n\n-----\n\nTheRedline infostealer websites are signed by a Sectigo certificate, as seen in the image\nbelow.\n\n\n-----\n\nDouble Clicking the download button on any of the websites will lead to a script execution\nthat verifies the IP and delivers the artifacts from one remote website “hxxps://desklop.pc_whatisapp[.]com/”._\n\nThe artifacts are\n\nupdated and re-uploaded to the website every couple of days.\n\nAs mentioned before, every ISO file includes a very small .Net executable. In some cases,\nthis executable is also digitally signed.\n\n\n-----\n\nThe first layer of the executable is obfuscated with DeepSea.\n\n\n-----\n\nThe second layer is actually a custom obfuscated .Net DLL that executes in memory.\n\nFinally, the third layer is the well known Redline infostealer. It communicates back with\njasafodidei[.]xyz:80.\n\nAs the infostealer is well covered by other researchers, we decided to end with a snapshot\nshowing the variety of databases this infostealer targets. Surprisingly, this infostealer targets\nbrowsers that are also used in Russian-speaking countries\n\n\n-----\n\n## Taurus Infostealer\n\nThe Taurus infostealer is delivered in a similar way and appears as the third paid ad in a\nsearch for the popular applications mentioned in the introduction.\n\nThis time the website is signed with a legitimate Cloudflare certificate. Like the Sectigo\ncertificate used with Redline, the Taurus certificate is not older than two weeks\n\nIn the Taurus case, we did not see any redirects to additional websites. As can be seen in\nthe image below, the download results from a submitted form that is handled by “get.php”\nand in turn delivers the ISO image directly from the website.\n\n\n-----\n\nIf the target is not within the range of interesting IP addresses, users will see a normal\nredirect to the legitimate application website like in the Redline infostealer.\n\nThe downloaded ISO image consists of a 7z SFX executable.\n\n\n-----\n\nThe executable includes either 4 “flv” or 4 “bmp” files in the examples we cover below. Sfx is\nconfigured to start the execution from the first batch file (masquerading as either flv, bmp or\nany other unique extension). The batch script is then redirected as input into cmd.exe.\n\n\n-----\n\nThis batch script is well documented. It is responsible for the re-creation of the legitimate\nAutoIt compiler (Ali.exe.com or the Dio.exe.com in the examples above) and the execution of\nthe malicious AutoIt script (Pramide.flv or the Debbano.bmp). Through the re-created\ncompiler, it will fail to execute upon detection of a known sandbox provider. A VirusTotal\nsearch for additional 7z SFX archives with a similar evasion will lead to more than 400\ndifferent files uploaded in the past month.\n\n\n-----\n\nThe AutoIt script supports both 32 and 64 bit processes (slightly deobfuscated).\n\nIt also implements persistence through a URL link directly in the startup folder. The link\nexecutes Javascript from a hidden folder under roaming (use attrib -H to unhide).\n\n\n-----\n\nAs in the previous batch file execution, the Javascript file executes the AutoIt compiler with\nthe copied Taurus AutoIt script.\n\n\n-----\n\n## Mini-Redline Infostealer\n\nAs with the Taurus campaign, the advertisement websites that lead to the mini-Redline\ninfostealer are also signed with Cloudflare certificates.\n\nThe file inside the ISO is also padded with zeros to increase the size of the file for evasion\npurposes.\n\nThe executable is a .Net assembly with an unknown obfuscation pattern; dynamic unpacking\nof the assembly reveals four (4) layers of obfuscation and hollowing.\n\n### First Layer\n\n\n-----\n\n### Second Layer\n\n Third Layer\n\n\n-----\n\n### Fourth Layer - Hollowed Mini-Redline\n\nFinally, the last layer leads to some known stealing functionalities. An initial static look at the\nfile is reminiscent of Redline; not surprisingly a VT scan for the unpacked file shows that it\nwill confuse even the biggest security vendors. The method and strings implemented as part\nof the Chrome credential theft are almost identical. In both cases, the databases are copied\nto a temporary location before being decrypted, using similar methods and class names to\ndo so even though the number of targeted browsers is minimal.\n\n\n-----\n\nNevertheless, the communication pattern is different. Mini-Redline uses a direct TCP socket\nconnection.\n\nSome of the anti-debugging functionalities include “DebuggerHidden” attributes and\nvirtualization detection.\n\n\n-----\n\nVirtual Environment evasion checks using WMI.\n\n## Conclusion:\n\nAdversaries will use any method possible to gather targets, even paying Google top dollar for\ntheir paid search results to surface a malicious website as a top search result. This\ninventiveness on the part of threat actors means that organizations need to be constantly\nvigilant in all aspects of their operations. There’s no telling when an adversary will set up a\nwebsite with a signed, legitimate certificate designed to mislead website visitors.\n\n\n-----\n\nThreat actors are even clearly willing to pay substantial sums of money to target possible\nvictims. Google Adwords data between May 2020 and April 2021 shows a bid price of\nbetween $0.42 and $3.97 for the two keywords “anydesk” and “anydesk download.”\nAssuming a click-through rate of 1,000 people, this could result in fees anywhere from $420\nto $3,970 for even a small campaign that targets the United States, for example.\n\nThankfully, Morphisec customers are protected against these infostealers through our zero\ntrust at execution technology powered by moving target defense.\n\n### URLs Redline Infostealer\n\nhxxps://me.anydesk-pro[.]com/\n\nhxxps://desklop.telegram-home[.]com/\n\nhxxps://pc.anydesk-go[.]com/\n\nhxxps://desklop.anydesk-new[.]com/\n\nhxxps://desklop.pc-whatisapp[.]com/\n\n### URLs Taurus and Mini-redline Infostealer\n\nhxxps://anydesk-en-downloads[.]com/\n\nhxxps://anydesk-one[.]com/\n\nhxxps://anydesk-top[.]com/\n\nhxxps://anydesk-connect[.]com/\n\n\n-----\n\nhxxps://anydesk-vip[.]com/\n\n### C2 - Redline infostealer\n\njasafodidei[.]xyz:80\n\n### ISO - Redline infostealer zip files\n\nC249E79B05D3385A50BD0D54881B59BD\n\n76118B65F29856DB2ABECD1193D08CF1\n\n### ISO - Taurus\n\n476A504DB16C7E6972775B1160B4631C\n\nF0EF3E84F172C8E869088F1FCF933B07\n\n7DAB7515FC7C795A2AD2BD8D22F36A14\n\n### ISO - Mini-Redline\n\n7B91DF7AF3BC0CFACFF46DB883BA784D\n\n### Taurus and Mini-Redline C2\n\n109.234.37[.]201:15647\n\n[Contact SalesInquire via Azure](http://10.10.0.46/mailto:sales@morphisec.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-06-02 - Google PPC Ads Deliver Redline, Taurus, and mini-Redline Infostealers.pdf"
    ],
    "report_names": [
        "2021-06-02 - Google PPC Ads Deliver Redline, Taurus, and mini-Redline Infostealers.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535613,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653703078,
    "ts_modification_date": 1653703078,
    "files": {
        "pdf": "https://archive.orkl.eu/9bc143a583dff40687c7ddd910336e24db45e053.pdf",
        "text": "https://archive.orkl.eu/9bc143a583dff40687c7ddd910336e24db45e053.txt",
        "img": "https://archive.orkl.eu/9bc143a583dff40687c7ddd910336e24db45e053.jpg"
    }
}