{
    "id": "af269e20-eb32-42ef-8e62-664be8b63617",
    "created_at": "2023-01-12T15:00:38.184479Z",
    "updated_at": "2025-03-27T02:05:35.258101Z",
    "deleted_at": null,
    "sha1_hash": "5e3089e4b9ef7fdacf90c8ee118a161346e082dd",
    "title": "2021-01-27 - International Action Targets Emotet Crimeware",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:55Z",
    "file_modification_date": "2022-05-28T04:10:55Z",
    "file_size": 1181514,
    "plain_text": "# International Action Targets Emotet Crimeware\n\n**[krebsonsecurity.com/2021/01/international-action-targets-emotet-crimeware](https://krebsonsecurity.com/2021/01/international-action-targets-emotet-crimeware)**\n\nAuthorities across Europe on Tuesday said they’d seized control over Emotet, a prolific\nmalware strain and cybercrime-as-service operation. Investigators say the action could help\nquarantine more than a million Microsoft Windows systems currently compromised with\nmalware tied to Emotet infections.\n\nFirst surfacing in 2014, Emotet began as a banking trojan, but over the years it has evolved\ninto one of the more aggressive platforms for spreading malware that lays the groundwork\nfor ransomware attacks.\n\nIn [a statement published Wednesday morning on an action dubbed “Operation Ladybird,”](https://www.europol.europa.eu/newsroom/news/world%E2%80%99s-most-dangerous-malware-emotet-disrupted-through-global-action)\nthe European police agency Europol said the investigation involved authorities in the\nNetherlands, Germany, United States, the United Kingdom, France, Lithuania, Canada and\nUkraine.\n\n“The EMOTET infrastructure essentially acted as a primary door opener for computer\nsystems on a global scale,” Europol said. “Once this unauthorised access was established,\nthese were sold to other top-level criminal groups to deploy further illicit activities such data\ntheft and extortion through ransomware.”\n\n\n-----\n\nExperts say Emotet is a pay-per-install botnet that is used by several distinct cybercrime\n[groups to deploy secondary malware — most notably the ransomware strain Ryuk and](https://krebsonsecurity.com/?s=ryuk&x=0&y=0)\n[Trickbot, a powerful banking trojan. It propagates mainly via malicious links and attachments](https://krebsonsecurity.com/?s=trickbot&x=0&y=0)\nsent through compromised email accounts, blasting out tens of thousands of malware-laced\nmissives daily.\n\nEmotet relies on several hierarchical tiers of control servers that communicate with infected\nsystems. Those controllers coordinate the dissemination of second-stage malware and the\ntheft of passwords and other data, and their distributed nature is designed to make the\ncrimeware infrastructure more difficult to dismantle or commandeer.\n\nIn [a separate statement on the malware takeover, the Dutch National police said two of the](https://www.politie.nl/nieuws/2021/januari/27/11-internationale-politieoperatie-ladybird-botnet-emotet-wereldwijd-ontmanteld.html)\nthree primary servers were located in the Netherlands.\n\n“A software update is placed on the Dutch central servers for all infected computer systems,”\nthe Dutch authorities wrote. “All infected computer systems will automatically retrieve the\nupdate there, after which the Emotet infection will be quarantined. Simultaneous action in all\nthe countries concerned was necessary to be able to effectively dismantle the network and\nthwart any reconstruction.”\n\nA [statement from the German Federal Criminal Police Office about their participation in](https://www.bka.de/DE/Presse/Listenseite_Pressemitteilungen/2021/Presse2021/210127_pmEmotet.html)\nOperation Ladybird said prosecutors seized 17 servers in Germany that acted as Emotet\ncontrollers.\n\n“As part of this investigation, various servers were initially identified in Germany with which\nthe malicious software is distributed and the victim systems are monitored and controlled\nusing encrypted communication,” the German police said.\n\nSources close to the investigation told KrebsOnSecurity the law enforcement action included\nthe arrest of several suspects in Europe thought to be connected to the crimeware gang. The\ncore group of criminals behind Emotet are widely considered to be operating out of Russia.\n\n[A statement by the National Police of Ukraine says two citizens of Ukraine were identified](https://www.npu.gov.ua/news/kiberzlochini/kiberpolicziya-vikrila-transnaczionalne-ugrupovannya-xakeriv-u-rozpovsyudzhenni-najnebezpechnishogo-v-sviti-komp-yuternogo-virusu-EMOTET/)\n“who ensured the proper functioning of the infrastructure for the spread of the virus and\nmaintained its smooth operation.”\n\nA [video released to YouTube by the NPU this morning shows authorities there raiding a](https://www.youtube.com/watch?v=_BLOmClsSpc&feature=youtu.be)\nresidence, seizing cash and computer equipment, and what appear to be numerous large\nbars made of gold or perhaps silver. The Ukrainian policeman speaking in that video said the\ncrooks behind Emotet have caused more than $2 billion in losses globally. That is almost\ncertainly a very conservative number.\n\n\n-----\n\nPolice in the Netherlands seized huge volumes of data stolen by Emotet infections, including\n[email addresses, usernames and passwords. A tool on the Dutch police website lets users](https://www.politie.nl/themas/controleer-of-mijn-inloggegevens-zijn-gestolen.html)\nlearn if their email address has been compromised by Emotet.\n\nBut because Emotet is typically used to install additional malware that gets its hooks deeply\ninto infected systems, cleaning up after it is going to be far more complicated and may\nrequire a complete rebuild of compromised computers.\n\nThe U.S. Cybersecurity & Infrastructure Security Agency has [labeled Emotet “one of the](https://us-cert.cisa.gov/ncas/alerts/aa20-280a)\nmost prevalent ongoing threats” that is difficult to combat because of its ‘worm-like’ features\nthat enable network-wide infections.” Hence, a single Emotet infection can often lead to\nmultiple systems on the same network getting compromised.\n\nIt is too soon to say how effective this operation has been in fully wresting control over\nEmotet, but a takedown of this size is a significant action.\n\nIn October, Microsoft [used trademark law to disrupt the Trickbot botnet. Around the same](https://krebsonsecurity.com/2020/10/microsoft-uses-copyright-law-to-disrupt-trickbot-botnet/)\ntime, the U.S. Cyber Command [also took aim at Trickbot. However, neither of those actions](https://krebsonsecurity.com/2020/10/report-u-s-cyber-command-behind-trickbot-tricks/)\ncompletely dismantled the crimeware network, which remains in operation today.\n\n**[Roman Hüssy, a Swiss information technology expert who maintains Feodotracker — a site](https://feodotracker.abuse.ch/browse/)**\nthat lists the location of major botnet controllers — told KrebsOnSecurity that prior to January\n25, some 98 Emotet control servers were active. The site now lists 20 Emotet controllers\nonline, although it is unclear if any of those remaining servers have been commandeered as\npart of the quarantine effort.\n\n\n-----\n\nA current list of Emotet control servers online. Source: Feodotracker.abuse.ch\n\n[Further reading: Team Cymru on taking down Emotet](https://team-cymru.com/blog/2021/01/27/taking-down-emotet/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-01-27 - International Action Targets Emotet Crimeware.pdf"
    ],
    "report_names": [
        "2021-01-27 - International Action Targets Emotet Crimeware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d9b39228-0d9d-4c1e-8e39-2de986120060",
            "created_at": "2023-01-06T13:46:39.293127Z",
            "updated_at": "2025-03-27T02:00:03.042341Z",
            "deleted_at": null,
            "main_name": "BelialDemon",
            "aliases": [
                "Matanbuchus"
            ],
            "source_name": "MISPGALAXY:BelialDemon",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535638,
    "ts_updated_at": 1743041135,
    "ts_creation_date": 1653711055,
    "ts_modification_date": 1653711055,
    "files": {
        "pdf": "https://archive.orkl.eu/5e3089e4b9ef7fdacf90c8ee118a161346e082dd.pdf",
        "text": "https://archive.orkl.eu/5e3089e4b9ef7fdacf90c8ee118a161346e082dd.txt",
        "img": "https://archive.orkl.eu/5e3089e4b9ef7fdacf90c8ee118a161346e082dd.jpg"
    }
}