{
    "id": "af40b599-fbfd-41dd-903a-15ff579c3b53",
    "created_at": "2023-01-12T15:08:39.392657Z",
    "updated_at": "2025-03-27T02:05:24.241897Z",
    "deleted_at": null,
    "sha1_hash": "ce7eec9bdc4b4a2022341d2096b8e4796ced3c82",
    "title": "2022-03-03 - Luci Spools The Fun With Phobos Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T16:58:53Z",
    "file_modification_date": "2022-05-28T16:58:53Z",
    "file_size": 1518895,
    "plain_text": "# Luci Spools the Fun with Phobos Ransomware\n\n**[paraflare.com/luci-spools-the-fun-with-phobos-ransomware/](https://paraflare.com/luci-spools-the-fun-with-phobos-ransomware/)**\n\nBex Nitert\n\n[Published by Bex Nitert | 3 March 2022](https://paraflare.com/authors/bex-nitert/)\n\n**Bex Nitert**\n\n_Director, Digital Forensics & Incident Response_\n\nMarch 3, 2022\n\n5 min read.\n\n_The Digital Forensics and Incident Response (DFIR) team at ParaFlare recently helped an_\n_Australian manufacturer impacted by Phobos ransomware. Unexpectedly, our investigation_\n_found the ransomware affiliate had exploited the PrintNightmare vulnerability to escalate_\n_privileges within two minutes of gaining initial access._\n\n\n-----\n\nTo our knowledge, there are no documented examples of the PrintNightmare vulnerability\nbeing exploited by Phobos ransomware affiliates. So we decided to share our observations\nand indicators from the investigation. . We are using the name “Luci” for this Phobos\nransomware affiliate due to the frequency of the terms “Luci” and “Lucifer” appearing in\nfilenames, code, registry values, and the name of the Local Administrator account created by\nLuci.\n\nIn this article, we provide a brief introduction to the Phobos ransomware variant followed by\ntechnical details related to the use of a PrintNightmare exploit by Luci in the initial stages of\nthe attack. Additional tools and techniques identified during the investigation will be\ndiscussed in a separate article.\n\n## Phobos Ransomware Background\n\nPhobos ransomware is a form of malicious software used by threat actors to encrypt files on\nsystems. The purpose is to extort a ransom fee from victims in exchange for restoring access\nto their data. Phobos affiliates are financially motivated and opportunistic. Most victims are\nsmall to medium sized businesses, though individuals have been impacted too.\n\nThe Phobos ransomware variant, closely related to Dharma and Crysis ransomware, first\nemerged in 2018 and is used by criminals with varying technical abilities. Actors that use\nPhobos ransomware are commonly known as “Phobos affiliates”. Distributors of Phobos\nprovide a Ransomware as a Service (RaaS) style model to customers, enabling affiliates to\nundertake attacks without the need to develop their own file encrypting malware.\n\nUnlike many of the ransomware variants in the news (REvil, LockBit, Conti, etc.) Phobos\nransomware operators are not currently known to conduct data exfiltration for use in double\nextortion style attacks (where a ransom fee is also demanded from victims to prevent the\npublication of stolen data).\n\nPhobos affiliates operate with greater autonomy, generally demand lower ransom amounts,\nand demonstrate less professionalism, compared to more well-known ransomware variants.\nWhile not as high profile, Phobos was one of the most reported variants of ransomware in\n[the first half of 2021, according to a report released by the Financial Crimes Enforcement](https://www.fincen.gov/sites/default/files/2021-10/Financial%20Trend%20Analysis_Ransomware%20508%20FINAL.pdf)\nNetwork (FinCEN) of the United States Treasure Department1. FinCEN's observations were\nconsistent with [2021 ransomware statistics published by Emisoft which found Phobos was](https://blog.emsisoft.com/en/40833/ransomware-statistics-for-2021-year-in-summary/)\nthe third most commonly reported ransomware strain of 2021.\n\nThe diversity of actors involved in deploying Phobos ransomware and their lack of\norganisation means that variations in attack behaviour are more likely to be observed. In our\nrecent Phobos ransomware investigation, the affiliate we called Luci demonstrated more\nindividuality than most.\n\n## Initial Access Leveraging External Remote Services and Valid Accounts\n\n\n-----\n\nParaFlare s observations of the attack patterns used by ransomware operators who obtain\ninitial entry into an environment via remote access solutions have remained relatively\nconsistent over the years. In almost all circumstances, our investigations found initial access\nwas obtained using a local or domain administrator account. Consequently, most actors\ncommenced their attack with privileged access and not much additional effort was required\nfor them to achieve their objectives.\n\nTypically, remote access credentials are compromised either through phishing, credential\n[stuffing, brute forcing, or the exploitation of vulnerabilities in VPN appliances. The credentials](https://paraflare.com/a-defenders-perspective-of-ssl-vpn-exploitation/)\nmay be obtained or guessed directly by the ransomware operator or purchased from an\ninitial access broker. Insecure remote desktop protocol (RDP) connections are one of the\nmost common initial access vectors used in Phobos ransomware attacks.\n\nIn our recent investigation, we found Luci gained remote access to a terminal server using a\ndomain user account, $Printer_Maestro$, associated with a software package called\nBarTender that was used in the client environment. While the account had limited privileges,\nit had remote access rights, which was sufficient for Luci to gain initial access. It is unknown\nhow Luci obtained valid credentials.\n\n## Exploitation of Windows Print Spooler Vulnerability for Privilege Escalation\n\nIn circumstances where threat actors obtain remote access with a non-administrator account,\nthey need to find a way to escalate privileges to move laterally within the environment and\ndeploy ransomware. Known vulnerabilities are often exploited for this purpose, however, this\nwas the first time we had witnessed a PrintNightmare exploit used for privilege escalation in\na ransomware attack. At the time of publication, ParaFlare had not identified any\ndocumented cases of PrintNightmare being exploited by Phobos ransomware affiliates.\n\nPrintNightmare is a vulnerability in the Windows Print Spooler service (spoolsv.exe) assigned\nthe identifier CVE-2021-34527. It is similar to other vulnerabilities including CVE-2021-1675.\n\nForty-five seconds after the first identified remote desktop session logon succeeded, Luci\ncopied a password protected, self-extracting archive (SFX) file called Lucimare.exe to the\ndesktop on the terminal server.\n\nAlthough we were unable to successfully recover this SFX file, we can infer that it contained\nmalicious files designed to exploit the PrintNightmare vulnerability based on existing logs, the\nSYSTEM registry, and artefacts recovered through file carving.\n\nOur analysis found the Lucimare.exe SFX file contained a few files with modified times\nbetween 4 July 2021 and 7 July 2021. Available file hashes can be found in the indicators of\ncompromise list at the end of the article.\n\n**Filename** **Compile Time** **Modified Time** **Size**\n\n\n-----\n\nLucimare.ps1 N/A 2021-07-04 03:46:48 165KB\n\nLucimare.dll N/A 2021-07-07 05:04:04 91.5KB\n\nLucimarePoc2008.exe 2021-07-07 05:02:10 2021-07-07 05:04:05 98.5KB\n\nLucimarePoc.exe 2021-07-07 05:30:55 2021-07-07 05:35:03 98.5KB\n\nLucimare.exe was executed within 18 seconds from its first appearance on disk, resulting in\nthe extraction of files to the desktop folder.\n\nBased on data contained in the AmCache.hve (which was recovered through file carving), it\nappears LucimarePoc.exe was executed seven seconds later. Around the same time, three\nfiles were written to the Print Spooler’s driver directory. Unfortunately, we were not able to\nrecover these files.\n\nC:\\Windows\\System32\\spool\\drivers\\x64\\3\\kernelbase.dll\nC:\\Windows\\System32\\spool\\drivers\\x64\\3\\AddUserX64.dll\nC:\\Windows\\System32\\spool\\drivers\\x64\\3\\mxdwdrv.dll\n\nRemnant data suggests these files also existed in the directory\nC:\\Windows\\System32\\spool\\drivers\\x64\\3\\new\n\nA suspicious spoolsv registry value was also set at this time with the name “LuciMarePoc”\n\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Environments\\Windows\nx64\\Drivers\\Version-3\\LuciMarePoc\n\nThis contained references to the new drivers kernelbase.dll (Data File), AddUserX64.dll\n(Configuration File), and mxdwdrv.dll (Driver).\n\n\n-----\n\nAn error with the Event ID 808 was recorded in the Microsoft-Windows-PrintService/Admin\nlog specifying that “The print spooler failed to load a plug-in module\nC:\\Windows\\system32\\spool\\DRIVERS\\x64\\3\\AddUserX64.dll”. Additional logs (e.g.\nMicrosoft-Windows-PrintServer/Operational) that would record the successful printer plugin\nloading were not enabled on the server.\n\n\n-----\n\nSeconds later LucimarePoc2008.exe executed, followed closely by the creation of a\nWindows Event log for Kaspersky Security, which had detected the file Lucimare.ps1 as\n“HEUR:Exploit.PowerShell.NightMare.gen”.\n\n\n-----\n\nDuring this time, a local administrator account called “Luciferium” was created on the server.\nA RDP connection was established using this account less than three minutes after the initial\nintrusion.\n\nThe remaining phases of the attack including credential access, lateral movement, and the\nencryption of data will be covered in an upcoming post.\n\n## Recommendations\n\nEnsure operating systems and applications are patched.\nSecure remote access and enable multi-factor authentication for remote and\nadministrator accounts at a minimum.\nImplement principle of least privilege and principle of least functionality across\naccounts and servers.\nEnsure there is sufficient, centralised logging.\n\n\n-----\n\n## Timeline: Initial Access to Privilege Escalation\n\n**Indicators of Compromise**\n\n**Files**\n\nPhobos Ransomware (.eight extension)\n\nFilename: Fast.exe\n\nMD5: 6eff55b9f24c8b276848167c5d64cc9c\n\nSHA-1: 66cfc67c4a95129a0e979c1ce025747372d69552\n\nSHA-256: 31dba1a23db70ffb952f0e597acf95d16ab60423018a83d0ccb4f57ce0471793\n\nExploit Toolkit\n\nFilename: Lucimare.exe\n\nSHA-1: 9595bff740d66f8037f7f0346677a70dfef941c4\n\nFilename: Lucimare.ps\n\nFilename: Lucimare.dll\n\nFilename: LucimarePoc2008.exe\n\nSHA-1: c69051c612214ad8f9b57ce99ce60f1d15db453\n\nFilename: LucimarePoc.exe\n\nMD5: e4a6b0afc0895a844644ebcc00db7d73\n\nSHA-1: 3482fbb6ab9c43cf7a660528d62c1283e4a058ca\n\nSHA-256: f0d6846da6d45180a695201888edc4f9c512fb0d11ed56394aae9daa874ba88c\n\n\n-----\n\nPrinter Drivers Associated with Exploit\nFilename: kernelbase.dll\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\new\n\nFilename: AddUserX64.dll\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\new\n\nFilename: mxdwdrv.dll\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\\nFile Path: C:\\Windows\\System32\\spool\\drivers\\x64\\3\\new\n\n**Registry**\n\nRegistry Keys Created During Exploit\n\nHKLM\\SYSTEM\\CurrentControlSet\\Control\\Print\\Environments\\Windows\nx64\\Drivers\\Version-3\\LuciMarePoc\n\n**Network**\n\nMalicious RDP Connections\n\nIPv4: 185.112.82[.]235\n\nIPv4: 185.112.82[.]236\n\nIPv4: 185.112.82[.]237\n\n[Have a comment? Join the conversation on LinkedIn](https://www.linkedin.com/company/paraflare)\n\n[Blog](https://paraflare.com/blog/blog/)\n[Technical research](https://paraflare.com/blog/technical-research/)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-03-03 - Luci Spools The Fun With Phobos Ransomware.pdf"
    ],
    "report_names": [
        "2022-03-03 - Luci Spools The Fun With Phobos Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536119,
    "ts_updated_at": 1743041124,
    "ts_creation_date": 1653757133,
    "ts_modification_date": 1653757133,
    "files": {
        "pdf": "https://archive.orkl.eu/ce7eec9bdc4b4a2022341d2096b8e4796ced3c82.pdf",
        "text": "https://archive.orkl.eu/ce7eec9bdc4b4a2022341d2096b8e4796ced3c82.txt",
        "img": "https://archive.orkl.eu/ce7eec9bdc4b4a2022341d2096b8e4796ced3c82.jpg"
    }
}