{
    "id": "af9e4727-aaa1-4a7a-babc-d3adf022d658",
    "created_at": "2023-01-12T15:04:54.550389Z",
    "updated_at": "2025-03-27T02:08:41.377703Z",
    "deleted_at": null,
    "sha1_hash": "2a58d982db44e3c4067eca12eb7258c24c9b7a11",
    "title": "2020-11-09 - Phishing Campaign Threatens Job Security, Drops Bazar and Buer Malware",
    "authors": "",
    "file_creation_date": "2022-05-28T22:08:04Z",
    "file_modification_date": "2022-05-28T22:08:04Z",
    "file_size": 2339940,
    "plain_text": "# Phishing Campaign Threatens Job Security, Drops Bazar and Buer Malware\n\n**[area1security.com/blog/trickbot-spear-phishing-drops-bazar-buer-malware/](https://www.area1security.com/blog/trickbot-spear-phishing-drops-bazar-buer-malware/)**\n\nNovember 10, 2020\n\n[byArea 1 Security/November 9, 2020](https://www.area1security.com/blog/author/area-1-security/)\n\n“You’re fired…..NOT!” An ongoing and rapidly evolving spear phishing campaign is threatening targets with\nfalse claims of employment termination due to economic impacts from the global pandemic, among\nnumerous other coercive tactics. The goal of the attacker is to intimidate employees into clicking on a link\nthat will ultimately lead to Bazar or Buer malware infections by way of Trickbot.\n\n**Disruption Efforts**\n\n[Researchers at Zscaler ThreatLabZ reported on similar activity, where they noted this was the first time](https://www.zscaler.com/blogs/research/spear-phishing-campaign-delivers-buer-and-bazar-malware)\nthey have seen both Bazar and Buer malware strains used together. Additionally, they have associated the\nactivity with the Trickbot gang, known to use a combination of different malware groups and bots to conduct\nattacks.\n\nWhile Trickbot started out as a banking trojan, known for hijacking victims’ browser sessions once logged\ninto their banking website, it has since been repeatedly repurposed for other objectives, including the ability\nto spread ransomware. This particularly maniacal and disruptive aspect of Trickbot functionality made it a\ntop contender for possible cybersecurity threats to the 2020 U.S. presidential election.\n\nWith ransomware as an option, Trickbot posed a significant threat to U.S. election infrastructure. The\nmalware’s operators had the ability to compromise a massive number of voting machines during critical\ntimes in vote counting, undermining trust in the result. That, or they may have even been able to disrupt the\nvoting process altogether by affecting entire voting locations, preventing large portions of the voter\npopulation from casting their ballots.\n\nThis could explain the recent wave of Trickbot takedown efforts. A report from [KrebsonSecurity provided](https://krebsonsecurity.com/2020/10/attacks-aimed-at-disrupting-the-trickbot-botnet/)\ndetails of an operation that likely began on September 22nd and is conjectured to be a government\n[counter-strike against the actors behind Trickbot. This activity, first identified by Intel471 and possibly](https://public.intel471.com/blog/trickbot-disruption-microsoft-short-term-impact/)\n[conducted by the U.S. Cyber Command, attempted to disrupt Trickbot infrastructure by forcing the botnet’s](https://www.washingtonpost.com/national-security/cyber-command-trickbot-disrupt/2020/10/09/19587aae-0a32-11eb-a166-dc429b380d10_story.html)\ncontrollers to issue bogus configurations\n\n\n-----\n\nThese configurations swapped real controller IP addresses for the localhost address (127.0.0.1), preventing\nbots from calling home to receive commands. Not long after the phony configurations were sent, all known\ncontrollers appeared to have stopped properly responding to bot requests, suggesting the overall activity\nwas a concerted, intentional effort to disrupt this pervasive botnet’s operations.\n\nAnother attempt was made on October 1st, presumably by U.S. Cyber Command, that similarly altered the\ncontroller IP addresses needed to receive commands. Compounding the effects of this effort, [Microsoft also](https://blogs.microsoft.com/on-the-issues/2020/10/12/trickbot-ransomware-cyberthreat-us-elections/)\nattempted disruptions of Trickbot infrastructure by obtaining a court order to disable the botnet’s IP\naddresses, among other actions. Most recently, [Microsoft issued an update that they successfully took](https://blogs.microsoft.com/on-the-issues/2020/10/20/trickbot-ransomware-disruption-update/)\ndown 62 of the 69 Trickbot servers around the world with the remaining being unorthodox IOT devices.\n\nHowever, these attempts reportedly would only have a short-term effect on Trickbot controllers since its\noperators use decentralized infrastructure that communicates over Tor, with blockchain-based EmerDNS as\na fallback that is resistant to takedowns. Additionally, [Ars Technica reports that Trickbot controllers are](https://arstechnica.com/information-technology/2020/10/trickbot-the-for-hire-botnet-microsoft-attacked-is-scrambling-to-stay-alive/)\nbeginning to host their malware on other e-criminals’ servers.\n\n**Area 1 Security’s Findings on Trickbot Payloads**\n\nUnsurprisingly, not long after the previously mentioned Trickbot takedown operations occurred, Area 1\nSecurity identified a prolific phishing campaign that intended to spread Bazar and Buer payloads via\nTrickbot. Worse yet, this newer stealthy malware in Trickbot gang’s arsenal of tools can be used to deploy\nadditional malware, including ransomware.\n\nArea 1 Security researchers found evidence that the BazarLoader dropped in this campaign will not\n**continue with the infection if the locale of the victim’s device is in Russia, a common tactic seen**\n**with Trickbot.**\n\nIn fact, [cyber security researchers believe Trickbot is the handiwork of cybercriminals operating out of](https://statescoop.com/recent-ransomware-surge-russian-criminal-group/)\nRussia. Since at least 2019, this group has been responsible for a surge in ransomware attacks targeting\nschools systems, local governments and even law enforcement agencies in the United States.\n\n**Potential for Election Interference**\n\nWhile these e-criminal groups have always been operating at some level in recent years, their activity has\nsurged in the lead-up to the 2020 U.S. Presidential election. This suggests that entities involved in the U.S.\nelection are prime targets for foreign adversaries, both nation-state and cybercriminal groups alike.\n\n[Lining up with the recent FBI/DNI press conference, Russian and Iranian state-sponsored groups are](https://www.dni.gov/index.php/newsroom/press-releases/item/2162-dni-john-ratcliffe-s-remarks-at-press-conference-on-election-security)\nconfirmed to have exfiltrated voter registration information. Additionally, these nations are behind separate\nemail spoofing campaigns designed to undermine faith in the U.S. election.\n\nAt the moment, it is unclear if the phishing campaign that Area 1 Security identified is being carried out by\nany of these groups or if it is purposefully targeting election administrators. Regardless, state and local\nelection administrators should be extra vigilant as they tend to be highly vulnerable to phishing attacks, as\n[highlighted in Area 1 Security’s recent “Phishing Election Administrators” report.](https://www.area1security.com/resources/2020-elections-phishing-report/)\n\n**Threatening Phishing Lures**\n\nThe recent phishing campaign that Area 1 Security discovered uses a number of lures that threaten job\ntermination in order to intimidate employees into clicking on a provided URL. The phishing messages are\nvery simple in their demand, and appear to originate from persons of authority within the targeted company,\nas seen in the phishing email below (Figure 1).\n\n\n-----\n\n[Figure 1. Phishing Messages that Threaten Job Security]\n\nThe messages identified in this campaign are based on eliciting fear from the target audience, focusing on\neither employment termination or customer complaints.\n\nThe massive remote workforce transition, and the resultant decrease in face-to-face contact, gives\nattackers the advantage by making email delivery of these types of “employment notifications” all the more\nbelievable.\n\nTargets of this campaign could potentially believe that the post-COVID shake up in their organizations is the\nreason they’re being let go. With many businesses closing down unusable office space, combined with an\neconomic recession, there is enough plausibility for this wide-ranging phishing attack to fool\n**employees into believing that their position may be part of the now all-too-common budget cuts.**\n\nIt’s possible this Bazar and Buer campaign is part of the Trickbot operations that Microsoft and other\npartners are trying to defeat. If so, the activity Area 1 Security observed only further proves just how difficult\nit can be to counteract these complex malware operations.\n\nWith these Trickbot operations, threat actors have a litany of unique and ever-changing email accounts and\nIP addresses to execute their attacks. Despite the previously mentioned efforts to neutralize Trickbot\ncontrollers, the infrastructure used to support this particular campaign (if associated in any way) was hardly\naffected, and the attacker seems to have promptly resumed operations.\n\nWhile disruption operations may have worked a decade ago, the Trickbot gang and other groups that rely\non their Malware-as-a-Service (MaaS) offering are equipped with the necessary skills to continue their\nattacks without a hitch. Current botnets have all the professionalism of any IT company. They’re able to\nmanage disruptions and bring back services with continuity planning, backups, automated deployment, and\na dedicated workforce.\n\nThe campaign noted above centered on termination-related documents available at a provided URL. When\n[clicked, the link directs the victim’s browser to either Google Docs or Constant Contact. By not attaching the](https://www.constantcontact.com/)\nmalware as a file to the email, the attacker is able to bypass file scanning detections.\n\nMoreover, attackers commonly use cloud-based hosting services to circumvent URL scanning techniques,\nand to easily create new malicious links in the event that their URLs are identified as phishing pages\n\n\n-----\n\nThe Google Docs or Constant Contact link in the phishing email leads to a decoy preview page, as shown\nin Figure 2, that prompts the victim to open a list of terminated employees. The decoy also cleverly displays\nthe often seen “If download does not start, click here”. This link is where the malware is actually being\nhosted.\n\nAt the moment, it is unclear if the phishing campaign that Area 1 Security identified is being carried out by\nany of these groups or if it is purposefully targeting election administrators. Regardless, state and local\nelection administrators should be extra vigilant as they tend to be highly vulnerable to phishing attacks, as\n[highlighted in Area 1 Security’s recent “Phishing Election Administrators” report.](https://www.area1security.com/resources/2020-elections-phishing-report/)\n\n**Threatening Phishing Lures**\n\nThe recent phishing campaign that Area 1 Security discovered uses a number of lures that threaten job\ntermination in order to intimidate employees into clicking on a provided URL. The phishing messages are\nvery simple in their demand, and appear to originate from persons of authority within the targeted company,\nas seen in the phishing email below (Figure 1).\n\n[Figure 2. Google Doc Decoy Preview Page with Redirect Link]\n\n**Analysis of Bazar and Buer Malware**\n\n\n-----\n\nAs seen in the figure below, after clicking on the link found in the online document, the victim is presented\nwith a dialog box to run the file. The file is actually a malicious PE32+ executable that is designed to run on\nall Windows systems.\n\n[Figure 3. Gaining Run Permission]\n\nAfter clicking “Run,” a series of events will take place on the victim’s device that will ultimately lead to\ninstallation of the Bazar backdoor or Buer loader.\n\nFirst, the PE32+ executable noted above will decrypt the payload using an RC4 cipher, a portion of which is\nprovided in Figure 4 below. The payload happens to be none other than Trickbot, and typically the RC4 key\nis changed for each iteration of the malware.\n\n[Figure 4. RC4 decryption of Trickbot Payload]\n\nAs detailed in Figure 5, Area 1 Security researchers identified the string “dave” at the end of the Trickbot\n[payload in memory, which is consistent with prior reporting on techniques employed by Emotet and Trickbot](https://www.netscout.com/blog/asert/emotet-whats-changed)\nmalware developers. This string reveals the attacker’s use of a custom packer to compress and encrypt the\nfile, making it difficult for malware researchers to analyze the payload.\n\n\n-----\n\n[Figure 5. “Dave” signature]\n\nDespite this anti-reversing technique, Area 1 Security discovered the Trickbot payload attempts to further\ninfect the victim device by decrypting and running the BazarLoader.\n\nWhat are malware loaders? Loaders are an essential function that allow attackers to gain a foothold in a\nnetwork and enable subsequent, more persistent infection via their command and control servers. This\ntactic opts for stealth by initially loading as little functionality as necessary.\n\nIn this case, the BazarLoader in turn attempts to download the Bazar backdoor via a blockchain DNS\nlookup table. This is a great tactic for attackers as it circumvents the need for registrars, giving full\nownership of the blockchain domain to the attackers. This way, domain custodians like GoDaddy or Google\nDomains can’t seize the domain if malicious activity is observed, nor will they have the ability to share\ninformation about the domain if served a court order.\n\nSimilar to bitcoin, Top Level Domains (TLDs) like .bit, .bazar, and .coin are not owned by a single authority\nbut instead shared over peer-to-peer networks. This offers users the ability to bypass censorship and other\ngovernment restrictions, but also provides a platform for attackers to conduct illicit activities that are safe\nfrom typical countermeasures.\n\nAs shown in Figure 6, to download the backdoor, the loader loops through eight unique IP addresses and\nfive domains under the EmerDNS .bazar TLD.\n\n\n-----\n\n[Figure 6. Attempted Outbound Connections to Download the Bazar Backdoor]\n\nThe second level domains are comprised of 12 alphabetical characters that are generated using a specific\n[domain generation algorithm. The malware runs through the list of generated .bazar domains to find one](https://johannesbader.ch/blog/the-dga-of-bazarbackdoor/)\nthat is still actively hosting the backdoor.\n\n**Once the backdoor is downloaded and successfully run, that attacker can carry out any number of**\n**devious acts, including remotely executing commands, exfiltrating sensitive data, and deploying**\n**other payloads. These additional payloads range anywhere from post-exploitation frameworks like**\nCobaltStrike to ransomware like Ryuk.\n\nIn fact, Trickbot is known to deliver Ryuk ransomware to devices via BazarLoader. In [one instance, after the](https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/)\ninitial Bazar infection, attackers exploited a recently disclosed vulnerability to escalate privileges and gain\ndomain-wide ransomware infection just five hours after sending their phishing message.\n\nThis is unfortunately just one of many possible outcomes that can result from successful infection via this\nTrickbot phishing campaign we intercepted.\n\n**How to Stop Evolving Trickbot Campaigns**\n\n\n-----\n\nThe threat actors behind this campaign leveraged a number of sophisticated techniques to easily evade\nlegacy vendors and cloud email providers. Linking to legitimate, cloud-based sites within the phishing\n[messages, combined with the use of takedown- and sinkhole-resistant EmerDNS TLDs, makes this a](https://johannesbader.ch/blog/the-dga-of-bazarbackdoor/)\nparticularly difficult campaign for standard defenses to detect.\n\nArea 1 Security‘s advanced Machine Learning and Artificial Intelligence technology allow our algorithms to\nuncover the clever tactics seen in this campaign, enabling us to block the messages in real time instead of\nwaiting days or weeks for signature updates. Our time-zero detections lead the industry with reliable\nverdicts that stop phishing attempts at delivery time.\n\nThis means that malware like Trickbot, the Bazar backdoor, and follow-on infection with ransomware, never\nhave the opportunity to make their way onto our customers’ devices. The key to stopping sophisticated\nmalware campaigns such as these is a preemptive approach, which has many advantages over postdelivery retraction, and prevents the user from ever being exposed to the attack.\n\n**Indicators of Compromise**\n\nPhishing Email Subject Lines:\n\nRe: Termination List\nRE: termination,\nRe: my visit and call\nRe: meeting of\nRE: office\nRE: office,\n\nMalicious PE32+ Executable Linked to in Decoy Document:\n\nSha1: 895d84fc6015a9ad8d1507a99fb44350fb462c79\n\nSha256: a3b2528b5e31ab1b82e68247a90ddce9a1237b2994ec739beb096f71d58e3d5b\n\nMd5: dbdb5ddd07075b5b607460ea441cea19\n\nSites Hosting Malicious PE32+ Executable:\n\nhxxps://tees321[.]com/Document3-90[.]exe\n\nhxxps://centraldispatchinc[.]com/Report10-13[.]exe\n\nhxxps://www[.]4rentorlando[.]com/Text_Report[.]exe\n\nMalicious Links in Phishing Messages:\n\nhxxps://files.constantcontact.com/0d2efd83801/50f95d03-8af1-4396-ac84-d6a7f1212026.pdf\n\nhxxps://docs[.]google[.]com/document/d/e/2PACX1vQzFpGbLRNSIpbklM51_9P78DJbhxmMLeMzQUJxX9roupKMn3xYX1ZBEjP2Jo5_CHbzoqIdVnwPeazU/pub\n\nhxxps://docs[.]google[.]com/document/d/e/2PACX-1vRhLU8Ar86crHTwsP7rSyStmTABnsPtQ4q3Mic9UIZNhz06cO8fuzsiiEus9seLQHDU4T51YGcejNU/pub\n\n\n-----\n\nhxxps://docs[.]google[.]com/document/d/e/2PACX1vTVCHKzmdSD2wX03GTnyBToo4xvldfGqtFWZiz5bT5cTRozW4Xk5H6GER0GmscSPqnpyFtokphDl_U/pub\n\nhxxps://files[.]constantcontact[.]com/5e536f60101/8c5d270a-897a-4ac8-845a-86c920bf229c[.]pdf\n\nhxxps://files[.]constantcontact[.]com/defde16c001/0aa90d3a-932f-4343-8661-22e4f6488705[.]pdf\n\nhxxps://docs[.]google[.]com/document/d/e/2PACX-1vSlUktRROV3hU60c_n8LWFpOQBdyJjN10g4tn14hBfmdaiRGKL9rc4vnTRYdLErwU0AHt7WwbzwU9q/pub\n\nhxxps://docs[.]google[.]com/document/d/e/2PACX-1vRFLfuWRihaQHjGEPs8Dm7Y3VxEFRpiUJuJmD9Vm6y3xVSSG9Vc3XxRnbyHQzIoWQ_5REbdDbkOq0s/pub\n\nOutbound BazarLoader DNS Requests for Analyzed PE32+ Executable (Port 53):\n\n95[.]174[.]65[.]241:53\n\n195[.]16[.]195[.]195:53\n\n192[.]71[.]245[.]208:53\n\n176[.]126[.]70[.]119:53\n\n151[.]80[.]222[.]79:53\n\n94[.]16[.]114[.]254:53\n\n193[.]183[.]98[.]66:53\n\n51[.]254[.]25[.]115:53\n\nBlockchain Domains for Analyzed PE32+ Executable:\n\nbdfgimbfhgio[.]bazar\n\ndcehjldeghjn[.]bazar\n\nbdfgjlbfhgjn[.]bazar\n\nadehklafghkn[.]bazar\n\nceggilcgigin[.]bazar\n\n**Want to keep up to date with the latest phishing trends?**\n\nSubscribe to our newsletter here!\n\n[SUBSCRIBE](https://www.area1security.com/newsletter-phish-of-the-week/)\n\n\n-----\n\n## Understanding the Four Business Email Compromise Attack Types\n\nApril 18, 2022\n\nBusiness Email Compromise (BEC), also sometimes referred to as email account compromise (EAC) or\nvendor email compromise (VEC), is a type of phishing attack that takes advantage of an existing\nrelationship between a victim and organization.\n\nhttps://www.area1security.com/wpcontent/uploads/2022/04/BlogEmailBanner_BECAttackType_2022APR14.png 1307 2500 Elaine Dzuba\nhttps://www.area1security.com/wp-content/uploads/2022/04/Cloudflare-A1S-Logo-1-1.png Elaine\nDzuba2022-04-18 10:07:242022-04-28 08:48:24Understanding the Four Business Email Compromise\nAttack Types\n\n## Area 1 Security Announces the Most Spoofed Brand of 2021\n\nMarch 31, 2022\n\nDear America’s sports-loving, company-securing fans: Before you find yourself glued this weekend to (what\nsome call) THE biggest game in college basketball history, we are here to crown the 2022 March Hackness\nwinner!\n\n\n-----\n\nhttps://www.area1security.com/wp-content/uploads/2022/03/Champion-Banner_2.png 1000 2500 Elaine\nDzuba https://www.area1security.com/wp-content/uploads/2022/04/Cloudflare-A1S-Logo-1-1.png Elaine\nDzuba2022-03-31 06:00:292022-04-28 08:49:23Area 1 Security Announces the Most Spoofed Brand of\n2021\n\n## 2022 March Hackness: The Return of the Phishing Bracket\n\nMarch 26, 2022\n\nArea 1 Security’s Sixth Annual March Hackness: The Perfect Phishing Bracket is here! Learn who made\nthe list of the top brands that attackers use in phishing lures.\n\nhttps://www.area1security.com/wpcontent/uploads/2022/03/SocialBanner_Blog_MarchHackness2021_2500x1000-Copy-2.jpg 1000 2500\nElaine Dzuba https://www.area1security.com/wp-content/uploads/2022/04/Cloudflare-A1S-Logo-1-1.png\nElaine Dzuba2022-03-26 20:45:192022-04-28 08:51:272022 March Hackness: The Return of the Phishing\nBracket\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-09 - Phishing Campaign Threatens Job Security, Drops Bazar and Buer Malware.pdf"
    ],
    "report_names": [
        "2020-11-09 - Phishing Campaign Threatens Job Security, Drops Bazar and Buer Malware.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535894,
    "ts_updated_at": 1743041321,
    "ts_creation_date": 1653775684,
    "ts_modification_date": 1653775684,
    "files": {
        "pdf": "https://archive.orkl.eu/2a58d982db44e3c4067eca12eb7258c24c9b7a11.pdf",
        "text": "https://archive.orkl.eu/2a58d982db44e3c4067eca12eb7258c24c9b7a11.txt",
        "img": "https://archive.orkl.eu/2a58d982db44e3c4067eca12eb7258c24c9b7a11.jpg"
    }
}