{
    "id": "afe826cc-85be-497e-908e-9517e7f7addd",
    "created_at": "2023-01-12T15:00:30.913038Z",
    "updated_at": "2025-03-27T02:05:47.55724Z",
    "deleted_at": null,
    "sha1_hash": "e5819d824b266c6c2c999615c0441859a0395568",
    "title": "2015-12-16 - Nemucod malware spreads ransomware Teslacrypt around the world",
    "authors": "",
    "file_creation_date": "2022-05-27T18:57:46Z",
    "file_modification_date": "2022-05-27T18:57:46Z",
    "file_size": 798264,
    "plain_text": "# Nemucod malware spreads ransomware Teslacrypt around the world\n\n**[welivesecurity.com/2015/12/16/nemucod-malware-spreads-ransomware-teslacrypt-around-world/](https://www.welivesecurity.com/2015/12/16/nemucod-malware-spreads-ransomware-teslacrypt-around-world/)**\n\nDecember 16, 2015\n\nESET has recently observed a huge increase in detections of the Nemucod trojan, a threat\nthat usually tries to download another malware from the internet. Those detections ratios\nwere very high in some countries.\n\n[Josep Albors](https://www.welivesecurity.com/author/jalbors/)\n16 Dec 2015 - 02:49PM\n\n\n-----\n\nESET has recently observed a huge increase in detections of the Nemucod trojan, a threat\nthat usually tries to download another malware from the internet. Those detections ratios\nwere very high in some countries.\n\nFrom time to time, some malware propagation campaigns reach high propagation levels in\none or several countries during a few days. In those cases, the users are specially\nvulnerable if they don’t protect their systems properly.\n\nWe have seen one of these scenarios during last week, when we observed a huge increase\nin detections of the Nemucod trojan, a threat that usually tries to download another malware\nfrom the internet. Those detections ratios were very high in some countries but also\nglobally, and could indicate a campaign that is not focused on one country in particular but\ntrying to affect as many users as possible throughout the world.\n\n**You’ve got an (infected) email**\n\nAs with many other malware campaigns that we’ve analyzed recently, the attackers used\nthe email as the attack vector. Posing as a fake invoice, they try to convince the users into\nopening an attached ZIP file. The sender of the email is usually another user that has been\naffected previously so the malware continues to propagate as long as it has possible\nvictims.\n\nIf we open the attached ZIP file we find a difference compared to recently analyzed\nsamples. Instead of finding an EXE file, the ZIP container has a Javascript file inside. This\ntechnique might have been used by the attackers to avoid detection in some mail scanners\nand reach as many victims as possible.\n\n\n-----\n\n**Using Javascript to download the payload**\n\nAnyway, a Javascript file is something that a user can execute and can be as dangerous as\nan EXE file. If we take a look at the code of the file we find several interesting things. One is\nthat most of the variables used seems to be using random names. Also, we found two\narrays in the code that could be a way of obfuscating the IPs or web addresses used by\nthese criminals to spread the malware.\n\nIn fact we found two domains that were used to spread a new variant of Teslacrypt\nransomware (detected by ESET as Win32/Filecoder.EM) among other threats. One of these\ndomains belongs to a compromised German website but the other was created recently as\nwe can see in this whois info.\n\n\n-----\n\nIn fact, this web contained nothing but a warning saying that the web was empty because\nthe site was just being created. We cannot say for sure that the web was generated just for\nspreading the threat but the registration date of the domain is suspicious at least.\n\n**Infection of the user by Teslacrypt**\n\nAs we have already said, one of the malwares that was being downloaded from the\nmalicious or compromised web sites was a variant of the Teslacrypt ransomware. The\nmalicious file was an executable with just numbers as a name.\n\n\n-----\n\nIf the victim executes this file, the ransomware begins to encrypt some types of files usually\nused to store images, videos, office files and more, launching the following screen in the\nweb browser when it finishes. This template has been used by other ransomware families\nand explains to the victims that they need to pay a ransom if they want to recover their\npersonal files.\n\n\n-----\n\nThere is also another TXT file generated in each folder that contains encrypted files. In this\nTXT we can read similar instructions to the ones found in the HTML file but also some\ncontradictions. For example, in the HTML file says that the ransomware is using RSA-2048\nencryption, while in the TXT file it says that the encryption used is RSA-4096.\n\n\n-----\n\nThis can be explained by the use of the template of other families of ransomware like\nCryptowall. Anyway, despite of the encryption algorithm used, most of the times the files\ncan’t be reversed to its original state so the customer loses access to this information.\n\n**Nemucod impact around the world**\n\nThis malware propagation campaign has been quite interesting because the detection rates\nhave been unusually high. We have seen peaks as high as more than 10% globally, but the\nimpact has been much higher in some specific countries. In Europe we saw detection ratios\nof this threat above 20% in several countries (23% in Spain or 30% in Italy, for example).\n\nIn other regions such as the Americas we saw a lower detection ratio but also higher than\nusual (around 14% in Argentina or 15% in the US and Canada).\n\n\n-----\n\nBut the highest infection ratio detected was, by far, in Japan. During more than two days\nNemucod detections reached above 75% percent of detections in that country. We still have\nto investigate why the detection was so high in Japan but it has been something that we\nhave not seen in a very long time.\n\n**Conclusion**\n\nThis new malware campaign didn’t affected as many users as previous ones but the\ndetection rates shows us that, for some days, the amount of emails used to spread the\nthreats had to be significantly high to achieve those percentages.\n\n\n-----\n\nThe fact that the numbers of affected users has not been as high as previous ransomware\ncampaigns despite the elevated number of detections is good news. It means that the users\nare using protection measures capable of detecting new threats and it can also mean that\nthey are not executing suspicious files attached to emails as the one we’ve analyzed.\n\nAnyway, we still can improve our security measures and, to avoid problems created by a\nransomware infection, one of those measures has to be an updated backup of all our\nimportant files in order to recover them as soon as possible.\n\n16 Dec 2015 - 02:49PM\n\n## Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-12-16 - Nemucod malware spreads ransomware Teslacrypt around the world.pdf"
    ],
    "report_names": [
        "2015-12-16 - Nemucod malware spreads ransomware Teslacrypt around the world.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535630,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653677866,
    "ts_modification_date": 1653677866,
    "files": {
        "pdf": "https://archive.orkl.eu/e5819d824b266c6c2c999615c0441859a0395568.pdf",
        "text": "https://archive.orkl.eu/e5819d824b266c6c2c999615c0441859a0395568.txt",
        "img": "https://archive.orkl.eu/e5819d824b266c6c2c999615c0441859a0395568.jpg"
    }
}