{
    "id": "afe8f24f-41bd-4eb0-a3ce-6270139d5c4a",
    "created_at": "2023-01-12T15:06:28.639925Z",
    "updated_at": "2025-03-27T02:05:59.016637Z",
    "deleted_at": null,
    "sha1_hash": "aab5122c2534830d2a039ed994f489e57d757f8b",
    "title": "2021-05-19 - Aanhouding in onderzoek naar cybercrime",
    "authors": "",
    "file_creation_date": "2022-05-28T16:59:23Z",
    "file_modification_date": "2022-05-28T16:59:23Z",
    "file_size": 122186,
    "plain_text": "# Aanhouding in onderzoek naar cybercrime\n\n**[politie.nl/nieuws/2021/mei/19/04-aanhouding-in-onderzoek-naar-cybercrime.html](https://www.politie.nl/nieuws/2021/mei/19/04-aanhouding-in-onderzoek-naar-cybercrime.html)**\n\nGepubliceerd op: 19-05-2021 | 10:01\n\nNoord-Holland - De politie in Noord-Holland heeft in een onderzoek naar cybercrime een 28jarige man in Lelystad aangehouden. De man wordt verdacht van het gebruiken van Remote\nAccess Trojans (RAT’s), kwaadaardige software waarmee cybercriminelen computers van\nslachtoffers kunnen binnendringen en overnemen. Ook heeft de politie twee woningen en\neen bedrijfspand doorzocht, waarbij administratie, gegevensdragers en twee auto’s in beslag\nzijn genomen.\n\n**RAT**\n\nEen Remote Access Trojan (RAT) is kwaadaardige software. Het is een krachtige tool die\nveel schade aan kan richten. Een aanvaller zal proberen er computersystemen mee te\nbesmetten. Na besmetting krijgt die aanvaller dan heimelijk toegang tot het besmette\nsysteem. De informatie die in dat systeem is opgeslagen of door dat systeem wordt verwerkt\nis zichtbaar voor de aanvaller. Op die manier kunnen zij bijvoorbeeld persoonlijke gegevens\nstelen, documenten wegmaken, geld overmaken en hebben ze toegang tot privéfoto’s die ze\nkunnen kopiëren, veranderen of verspreiden. Daarnaast is de aanvaller na besmetting in\nstaat om de besturing van het systeem ongezien volledig over te nemen. Hierdoor kan de\nbesmette computer bijvoorbeeld geïnstalleerd worden in een botnet (robotnetwerk), kan\nongezien de camera worden geactiveerd, of kan de RAT de computer laten fungeren als\nproxyserver (een tussenstation tussen gebruiker en internet).\n\n\n-----\n\nEen RAT is dus een tool bij het plegen van verschillende cybercrimedelicten.\n\n**Onderzoek**\n[In 2019 vond er een internationale politieactie plaats tegen de hacktool Imminent Monitor](https://www.politie.nl/nieuws/2019/november/29/00-internationale-politieactie-tegen-im-rat-cybercrime.html)\nRemote Access Trojan (IM-RAT) die werd gebruikt in maar liefst 124 landen. De tool werd\noffline gehaald en in meerdere landen werden gebruikers en verkopers aangehouden. Ook\nin Nederland zijn meerdere aanhoudingen verricht.\nHet onderzoek naar IM-RAT werd opgestart door de Australische Federale Politie (AFP). Dit\nresulteerde in een operatie waarbij rechercheurs, officieren van justitie en\nonderzoeksrechters uit meerdere landen binnen en buiten Europa betrokken zijn. De\ninternationale activiteiten zijn gecoördineerd door Europol en Eurojust. Voor Nederland wordt\nhet onderzoek gedaan door het cybercrimeteam van de politie-eenheid Noord-Holland. Dit\nteam is samen met Parket Noord-Holland themahouder van het onderwerp Remote Acces\nTrojans (RATs).\n\nDe 28-jarige man wordt gezien als grootgebruiker van RAT’s. Hij is overgebracht naar het\npolitiebureau en zal worden verhoord. Er wordt nader onderzoek gedaan naar de in beslag\ngenomen goederen.\n\n**Hoe raakt een computer besmet?**\nRAT’s kunnen op verschillende manieren worden geïnstalleerd. Ze zitten verborgen in links,\nmaar ook is bekend dat in illegale software malware kan zitten verstopt waardoor RAT’s\nworden geactiveerd. RAT’s worden aangeboden op onder andere hackersfora en social\nmedia-platforms. Dit gebeurt anoniem en betaling gebeurt meestal door anonieme bitcoins.\n\n**Preventietips**\nBescherm uzelf en koop alleen legale software via bonafide web- en appstores. Doe alle\nupdates, installeer een firewall, open nooit onbekende bijlagen of URL’s en gebruik\nverschillende sterke wachtwoorden. Sla gevoelige privédocumenten en kopieën van\npaspoorten en rijbewijzen alleen op op losstaande harddisks die niet gekoppeld zijn aan uw\ncomputer. Plak een sticker over uw webcam.\n\n\n-----",
    "language": "NL",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-05-19 - Aanhouding in onderzoek naar cybercrime.pdf"
    ],
    "report_names": [
        "2021-05-19 - Aanhouding in onderzoek naar cybercrime.pdf"
    ],
    "threat_actors": [
        {
            "id": "ece64b74-f887-4d58-9004-2d1406d37337",
            "created_at": "2022-10-25T16:07:23.794442Z",
            "updated_at": "2025-03-27T02:02:09.981874Z",
            "deleted_at": null,
            "main_name": "LightBasin",
            "aliases": [
                "DecisiveArchitect",
                "Luminal Panda",
                "TH-239",
                "UNC1945"
            ],
            "source_name": "ETDA:LightBasin",
            "tools": [
                "CordScan",
                "EVILSUN",
                "FRP",
                "Fast Reverse Proxy",
                "Impacket",
                "LEMONSTICK",
                "LOGBLEACH",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "OKSOLO",
                "OPENSHACKLE",
                "ProxyChains",
                "Pupy",
                "PupyRAT",
                "SIGTRANslator",
                "SLAPSTICK",
                "SMBExec",
                "STEELCORGI",
                "Tiny SHell",
                "pupy",
                "tsh"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535988,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653757163,
    "ts_modification_date": 1653757163,
    "files": {
        "pdf": "https://archive.orkl.eu/aab5122c2534830d2a039ed994f489e57d757f8b.pdf",
        "text": "https://archive.orkl.eu/aab5122c2534830d2a039ed994f489e57d757f8b.txt",
        "img": "https://archive.orkl.eu/aab5122c2534830d2a039ed994f489e57d757f8b.jpg"
    }
}