{
    "id": "afedf40b-6804-4eb1-9eef-4e2e6401b434",
    "created_at": "2023-01-12T15:00:50.376023Z",
    "updated_at": "2025-03-27T02:16:26.473306Z",
    "deleted_at": null,
    "sha1_hash": "9f2c610ed206b022357e0a5997db37f4ea6770c7",
    "title": "2018-10-24 - Waiting for goDoH",
    "authors": "",
    "file_creation_date": "2022-05-28T15:10:16Z",
    "file_modification_date": "2022-05-28T15:10:16Z",
    "file_size": 806485,
    "plain_text": "# Waiting for goDoH\n\n**sensepost.com/blog/2018/waiting-for-godoh/**\n\nReading time ~12 min\n\n_Posted by Leon Jacobs on 24 October 2018_\n[Categories: Bypass,](https://sensepost.com/blog/bypass/) [Command execution,](http://10.10.0.46/blog/command%20execution/) [Dns,](https://sensepost.com/blog/dns/) [Experiment,](https://sensepost.com/blog/experiment/) [Ioc,](https://sensepost.com/blog/ioc/) [Malware,](https://sensepost.com/blog/malware/) [Research,](https://sensepost.com/blog/research/) [Tools,](https://sensepost.com/blog/tools/)\n[Tunnelling](https://sensepost.com/blog/tunnelling/)\n\n## or DNS exfiltration over DNS over HTTPS (DoH) with godoh\n\n[“Exfiltration Over Alternate Protocol” techniques such as using the Domain Name System as](https://attack.mitre.org/wiki/Technique/T1048)\n[a covert communication channel for data exfiltration is not a new concept. We’ve used the](https://seclists.org/bugtraq/1998/Apr/79)\n[technique for many years at SensePost, including Haroon & Marco’s 2007 BH/DC talk on](https://sensepost.com/blog/2007/finallyull-release-of-blackhat-defcon-timing-stuff../)\n[Squeeza. In the present age this is a well understood topic, at least amongst Infosec folks,](https://github.com/sensepost/squeeza/blob/master/sqlreturnchannelviadns.rb)\n[with a large number of resources,](https://blogs.akamai.com/2017/09/introduction-to-dns-data-exfiltration.html) [available,](https://www.icann.org/news/blog/what-is-a-dns-covert-channel) [online that aim to enlighten those that may not](https://resources.infosecinstitute.com/dns-tunnelling/)\n[be familiar with the concept. There are also practical techniques for detecting DNS](https://www.sans.org/reading-room/whitepapers/dns/detecting-dns-tunneling-34152)\nTunnelling on your network.\n\nUsing DNS as a covert communication channel has many benefits when considering the\nmonitoring capabilities of a target. By utilising a protocol that underpins technologies such as\nemail and web browsing, one may not immediately expect DNS to be used for anything other\nthan, well, DNS. Alas, it is possible to use a completely legitimate protocol for two-way\ncommunication in and out of a network, abusing a possibly overlooked monitoring\nopportunity (if not a necessity). This technique does not come without cost to the attacker\nthough. DNS covert communication is one of the slowest methods of the several options an\nattacker may have. Especially when compared to malware that make use of HTTP/S to\ncommunicate.\n\nMany organisations have also managed to adjust their architectures and monitoring to\ndefend against this two decade old idea, since malware and attackers alike have taken\n[advantage of it. Using split horizon DNS, monitoring the size and rate of requests as well as](https://en.wikipedia.org/wiki/Split-horizon_DNS)\nanalysing the labels in a lookup all provide opportunities to detect and prevent successful\ntunnelling. From an attackers perspective, this increases complexity when trying to stay\nunder the radar while still having a reliable channel back into the network. By tweaking the\nbehaviour of the DNS-channel such as the length of a hostname’s labels and the rate of\nrequests detection can be bypassed but this will almost always come with a speed trade off.\nSimply not allowing recursive name lookups to the outside world would obviously also\nprevent the attack, but at the cost of some usability. Thankfully for defenders, monitoring\n\n\n-----\n\nDNS is relatively simple in that you only need to focus on DNS at a protocol level, and\nprobably only from the few caching forwarders you allow to make recursive, outbound\nlookups to the world.\n\nUntil now. Fast forward a few years from the original DNS tunnelling discussions, and we are\n[presented with a new RFC that describes a protocol called DNS-over-HTTPS, or DoH. Meet](https://en.wikipedia.org/wiki/DNS_over_HTTPS)\n[RFC8484. Basically, it is possible to have a full RFC1035 compliant DNS conversation, over](https://tools.ietf.org/html/rfc8484)\nHTTPS. Think of it as a JSON API to make DNS lookups. A simple HTTP GET request and a\n[predictable JSON response format, all via a provider such as Google. Right there is where](https://dns.google.com/)\nattacker [spidey senses should have tingled. Using legitimate and more often than not,](https://giphy.com/embed/3o6fIZjYglR6qpOXKM)\ntrusted domains such as google.com to “front” your traffic to a C2 has been a thing for a\nwhile. [Domain Fronting has seen a decent enough uptake where it has been used for](https://en.wikipedia.org/wiki/Domain_fronting)\n[censorship circumvention as well as in some malware campaigns. The](https://signal.org/blog/looking-back-on-the-front/) [present struggles of](https://arstechnica.com/information-technology/2018/04/google-disables-domain-fronting-capability-used-to-evade-censors/)\ndomain fronting aside, by abusing DNS over HTTPS we can once again achieve the same\nlevel of evasion, albeit at a much slower rate but using a trusted domain.\n\n[I built a quick proof of concept called “godoh” with the purpose of demonstrating DoH as an](https://github.com/sensepost/goDoH)\nexfiltration channel, but also to give defenders some tooling to test with so that monitoring\nand detections for this technique can be built. I figured this DoH exfiltration technique was a\n[neat idea, but literally while writing this post I have since discovered other existing mentions](https://twitter.com/aboutsecurity/status/1054816725135491072?s=12)\nof this [technique. And yesterday at the recent](https://github.com/magisterquis/dnsbotnet/commit/00ef10d9819b4199470e590f77de1c1bcab8e1df) [ATT&CK conference, @dtmsecurity also](https://www.mitre.org/attackcon)\nreleased some tooling for red teamers to make use of this exact same idea in the popular\nadversary simulation toolkit, Cobalt Strike. Nonetheless, allow me to take you through my\nthought process and finally give you some tooling to play with this on your own networks.\n\nImagine you are on a network that has relatively good DNS monitoring. They are capable of\ndetecting its use as an exfiltration channel (or don’t allow external zones to resolve via DNS\nin the first place). They also have a fancy Layer7 proxy/firewall that does URL content\nclassification and strictly blocks based on that. The google.com domain is whitelisted for\n[whatever reason, and therefore https://dns.google.com/ probably isn’t blocked.](https://dns.google.com/)\n\nA simple piece of malware making use of DNS tunnelling may typically have code running on\na computer that periodically polls for commands to run, and responds with the output of\nthose commands encoded as a series of A record lookups to an attacker controlled domain\nthat are reconstructed server-side.\n\n\n-----\n\nExample traffic flow for traditional C2 using DNS.\nI ported the exact same protocol idea to simply use a DNS over HTTPS provider for exactly\nthe same lookups. The lookups themselves did not change (and don’t need to, we are still\ntalking valid DNS remember), but merely the transport used to ask DNS questions and parse\nan answer.\n\nModified traffic flow, fronting DNS lookups using a provider such as Google.\n_Consider this architecture and the monitoring implications for a moment. Now, one can no_\nlonger rely on the fact that DNS is a very specific protocol that could be sinkholed and\ncontrolled on a network, but instead, we know have the added complexity of an HTTPS\n\n\n-----\n\nconnection, to an often trusted domain such as google.com, proxying these DNS\nrequests in and out of a network. Once a request is made to a DoH provider such as\n[https://dns.google.com/, they in turn use traditional DNS to resolve a name and respond with](https://dns.google.com/)\nan answer to the DoH client. But it’s not just Google, there are many DoH providers available\ntoday, and one can quickly see this is a harder problem to solve all of a sudden.\n\nSince `godoh is written in Golang, a single executable for most platforms can be built that`\ncontains both the server-side and client-side code needed. Just like traditional DNS\ntunnelling, you would need to configure a domain (or subdomain) to have its name server\npoint to your c2 server and run the `godoh c2 command from there. The` `c2 command`\nstarts a DNS server specifically geared towards understanding how to have conversations\nwith agents using DNS. On the client side, the `godoh agent command is run to connect to`\na c2 using any of the DoH providers supported by godoh. It is here where the agent and a\nDoH provider have conversations that are finally translated into questions for the c2 DNS\nserver to answer. Simple, yet effective.\n\nIn practice, the server-side component for `godoh looks like this:`\n\ngodoh server-side C2 interactions example.\nIn the screenshot above, a new agent connected to the C2 and the command `ls -lah`\n```\n/tmp/pwnd was issued to be executed by the agent. Once completed, the agent sent the\n\n```\noutput back to the C2 (in the form of a series of DNS A record lookups) where the server\nfinally decrypted the payload and presented the output to the screen. On the agent side, the\ninvocation and execution of the command looked as follows:\n\n\n-----\n\ngodoh agent interaction\nAs you can see, the agent started to poll for new commands (every three seconds as\nindicated by the `-t flag) via DNS TXT record lookups. Once a command was received, it`\nwas decrypted and executed on the host. Once done, the output was sent back to the C2\nserver via DNS A record lookups for a total of 5 requests for the complete conversation.\nWhat is interesting to note here is that the client knows if the server successfully received a\npacket (and could decrypt and validate a crc32 checksum) based on the IP address in the\nresponse data. A response of `1.1.1.1 indicates a successful receipt and decryption of`\ndata.\n\nIt is also possible to download files with `godoh . Keep in mind that this is still DNS, which is`\nlimited in packet size, so downloading large files take lots of requests, which directly\ntranslate into lots of time.\n\ngodoh file download example.\nBy simply issuing the `download /tmp/pwnd command, the agent read the contents of the`\ntarget file and sent it back to the C2.\n\ngodoh agent file download\nFrom the agents perspective, downloading a file simply means reading its contents and\nsending it back to the C2 with DNS A record lookups all using DoH.\n\n\n-----\n\ngodoh Windows client executing the whoami /groups command and returning the output to\nthe C2.\nWhat you should have noticed in the screenshots for the agent output by now is the contents\nof the labels fields. These are the full hostnames for the specially crafted protocol that would\nhave been appended to the target domain to form DNS lookups. If you are interested in the\n[details, this code comment attempts to shed some light on the meanings of the labels](https://github.com/sensepost/goDoH/blob/b7e8e6a6a661bb6392744a534e5dfb572acde752/protocol/utils.go#L14-L38)\n[themselves. The server-side component interpreting data can be found here. In short, the](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L289-L366)\nprotocol works as follows:\n\nOnce started, make a DNS TXT record [lookup to the target domain in the form of](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/cmd/agent.go#L49-L50)\n```\n   agentidentifier.targetdomain .\n\n```\nOnce the server receives the lookup, if it is the first time seeing this agent identifier the\n[C2 would record the existence of this new identifier as a potential target to interact with.](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L221-L229)\nIf there are [no commands to be executed, just respond with the default “no commands”](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L236-L240)\nresponse. This loop repeats itself infinitely.\n[If there are commands to be executed, encode, compress and encrypt the command](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/utils/utils.go#L18-L38)\n[and send it along within the TXT lookup response.](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L278-L282)\nThe agent then [parses the TXT record response and decrypts, decompresses and](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/cmd/agent.go#L64-L66)\ndecodes the command to [execute it.](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/cmd/agent.go#L121-L126)\nWhen complete, the output goes through a process of encoding and encryption, and\nfinally [translation, where the encrypted data is translated into chunks to be sent as](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/protocol/utils.go#L12-L92)\n[DNS A record lookups.](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/cmd/agent.go#L134)\n[Server side, a control flag is read to understand if an incoming request starts a new](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L310)\nstream, is part of a pending stream or is the end of a stream and decides based on that\nwhat the next step should be.\n[Once a DNS lookup stream is complete, the protocol type is checked (as in, is this](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L123)\n[simply command output to be echoed to screen or a file download where the contents](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L175-L189)\n[should be saved to file) and the appropriate action is taken.](https://github.com/sensepost/goDoH/blob/944ce30fc754155b0f30214598491590220282ee/dnsserver/server.go#L124-L173)\n\nWhen looking at this traffic using an HTTP proxy, this conversation looks something like this:\n\n\n-----\n\ngodoh C2 communications example viewed in a HTTP proxy.\nIf you are keen to play with this in your own environment then you can get `godoh`\nhere: [https://github.com/sensepost/goDoH. Prebuilt binaries are available, but keep in mind](https://github.com/sensepost/goDoH)\n[that they are built using a publicly known encryption key available in the source code. Ideally,](https://github.com/sensepost/goDoH/blob/master/utils/key.go#L5)\nyou should build your own versions with a unique key, easily generated with `make`\n```\nkey before make .\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2018/2018-10-24 - Waiting for goDoH.pdf"
    ],
    "report_names": [
        "2018-10-24 - Waiting for goDoH.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535650,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653750616,
    "ts_modification_date": 1653750616,
    "files": {
        "pdf": "https://archive.orkl.eu/9f2c610ed206b022357e0a5997db37f4ea6770c7.pdf",
        "text": "https://archive.orkl.eu/9f2c610ed206b022357e0a5997db37f4ea6770c7.txt",
        "img": "https://archive.orkl.eu/9f2c610ed206b022357e0a5997db37f4ea6770c7.jpg"
    }
}