{
    "id": "aff54b4b-f2d8-46e1-9b1c-2ccb55475f3e",
    "created_at": "2023-01-12T15:00:22.415958Z",
    "updated_at": "2025-03-27T02:05:18.553085Z",
    "deleted_at": null,
    "sha1_hash": "05e8967a7d79e51c56323dd996883ee6736bf37d",
    "title": "2019-04-22 - Who’s Behind the RevCode WebMonitor RAT-",
    "authors": "",
    "file_creation_date": "2022-05-28T04:10:00Z",
    "file_modification_date": "2022-05-28T04:10:00Z",
    "file_size": 259972,
    "plain_text": "# Who’s Behind the RevCode WebMonitor RAT?\n\n**[krebsonsecurity.com/2019/04/whos-behind-the-revcode-webmonitor-rat/](https://krebsonsecurity.com/2019/04/whos-behind-the-revcode-webmonitor-rat/)**\n\nThe owner of a Swedish company behind a popular remote administration tool (RAT)\nimplicated in thousands of malware attacks shares the same name as a Swedish man who\npleaded guilty in 2015 to co-creating the Blackshades RAT, a similar product that was used\nto infect more than half a million computers with malware, KrebsOnSecurity has learned.\n\nAn advertisement for RevCode WebMonitor.\n\nAt issue is a program called “WebMonitor,” which was designed to allow users to remotely\ncontrol a computer (or multiple machines) via a Web browser. The makers of WebMonitor, a\ncompany in Sweden called “RevCode,” say their product is legal and legitimate software\n“that helps firms and personal users handle the security of owned devices.”\n\nBut critics say WebMonitor is far more likely to be deployed on “pwned” devices, or those\nthat are surreptitiously hacked. The software is broadly classified as malware by most\nantivirus companies, likely thanks to an advertised feature list that includes dumping the\nremote computer’s temporary memory; retrieving passwords from dozens of email programs;\nsnarfing the target’s Wi-Fi credentials; and viewing the target’s Webcam.\n\n\n-----\n\nIn [a writeup on WebMonitor published in April 2018, researchers from security firm Palo Alto](https://unit42.paloaltonetworks.com/unit42-say-cheese-webmonitor-rat-comes-c2-service-c2aas/)\n**Networks noted that the product has been primarily advertised on underground hacking**\nforums, and that its developers promoted several qualities of the software likely to appeal to\ncybercriminals looking to secretly compromise PCs.\n\n[For example, RevCode’s website touted the software’s compatibility with all “crypters,”](https://www.trendmicro.com/vinfo/us/security/definition/crypter)\nsoftware that can encrypt, obfuscate and manipulate malware to make it harder to detect by\nantivirus programs. Palo Alto also noted WebMonitor includes the option to suppress any\nnotification boxes that may pop up when the RAT is being installed on a computer.\n\nA screenshot of the WebMonitor builder panel.\n\nRevCode maintains it is a legitimate company officially registered in Sweden that obeys all\n[applicable Swedish laws. A few hours of searching online turned up an interesting record at](https://translate.googleusercontent.com/translate_c?depth=1&hl=en&prev=search&rurl=translate.google.com&sl=sv&sp=nmt4&u=https://www.ratsit.se/900511ALKO00001-REVCODE&xid=17259,15700002,15700022,15700186,15700190,15700253,15700256,15700259&usg=ALkJrhho5bMKFXsDXE9sFGF1xQhyLBx1SQ)\n[Ratsit AB, a credit information service based in Sweden. That record indicates RevCode is](https://sv.wikipedia.org/wiki/Ratsit)\nowned by 28-year-old Swedish resident Alex Yücel.\n\n[In February 2015, a then 24-year-old Alex Yücel pleaded guilty in a U.S. court to computer](https://www.fbi.gov/contact-us/field-offices/newyork/news/press-releases/swedish-co-creator-of-blackshades-malware-that-enabled-users-around-the-world-to-secretly-and-remotely-control-victims-computers-sentenced-to-57-months-in-prison)\n[hacking and to creating, marketing and selling Blackshades, a RAT that was used to](https://krebsonsecurity.com/2014/05/blackshades-trojan-users-had-it-coming/)\ncompromise and spy on hundreds of thousands of computers. Arrested in Moldova in 2013\nas part of a large-scale, international takedown against Blackshades and hundreds of\ncustomers, Yücel became the first person ever to be extradited from Moldova to the United\nStates.\n\nYücel was sentenced to 57 months in prison, but according to a record for Yücel at the U.S.\nFederal Bureau of Prisons, he was released on Nov. 1, 2016. The first advertisements in\nhacker forums for the sale of WebMonitor began in mid-2017. RevCode was registered as an\nofficial Swedish company in 2018, according to Ratsit.\n\n[Until recently, RevCode published on its Web site a value added tax (VAT) number, an](https://en.wikipedia.org/wiki/Value-added_tax)\nidentifier used in many European countries for value added tax purposes. That VAT number\n[— first noted by the blog Krabsonsecurity.com (which borrows heavily from this site’s design](https://krabsonsecurity.com/2019/03/10/some-interesting-notes-on-revcode/)\nand banner but otherwise bears no relation to KrebsOnSecurity.com) — has since been\n\n\n-----\n\nremoved from the RevCode Web site and from [historic records at The Internet Archive. The](https://web.archive.org/web/2/https://revcode.se/)\n[VAT number cited in that report is registered to Alex Yücel, and matches the number listed](http://www.vatnumber.net/?vat=SE900511095301&submit=Check)\nfor RevCode by Ratsit AB.\n\nYücel could not be immediately reached for comment. But an unnamed person responded to\nan email sent to the customer support address listed at RevCode’s site. Presented with the\ninformation and links referenced above, the person responding wrote, “nobody working\nfor/with RevCode is in any way related to BlackShades. Anything else suggesting otherwise\nis nothing but rumors and attempts to degrade our company by means of defamation.”\n\nThe person responding from the RevCode support email address contended that the Alex\nYücel listed as owner of the company was not the same Alex Yücel convicted of co-authoring\nBlackshades. However, unless the Ratsit record is completely wrong, this seems unlikely to\nbe true.\n\nAccording to the Ratsit listing, the Alex Yücel who heads RevCode currently lives in a suburb\nof Stockholm, Sweden with his parents Can and Rita Yücel. Both Can and Rita Yücel co[signed a letter (PDF) in June 2015 testifying to a New York federal court regarding their son’s](https://krebsonsecurity.com/wp-content/uploads/2019/04/49-1.pdf)\nupstanding moral character prior to Yücel the younger’s sentencing for the Blackshades\nconviction, according to court records.\n\n\n-----\n\nA letter from Alex Yücel’s parents to the court in June 2016.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-04-22 - Who’s Behind the RevCode WebMonitor RAT-.pdf"
    ],
    "report_names": [
        "2019-04-22 - Who’s Behind the RevCode WebMonitor RAT-.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535622,
    "ts_updated_at": 1743041118,
    "ts_creation_date": 1653711000,
    "ts_modification_date": 1653711000,
    "files": {
        "pdf": "https://archive.orkl.eu/05e8967a7d79e51c56323dd996883ee6736bf37d.pdf",
        "text": "https://archive.orkl.eu/05e8967a7d79e51c56323dd996883ee6736bf37d.txt",
        "img": "https://archive.orkl.eu/05e8967a7d79e51c56323dd996883ee6736bf37d.jpg"
    }
}