{
    "id": "b0663222-0e74-426e-96c4-77bf84e40768",
    "created_at": "2023-01-12T15:08:09.689316Z",
    "updated_at": "2025-03-27T02:05:51.525768Z",
    "deleted_at": null,
    "sha1_hash": "60161b776e90732acabf213e74e0a2b7ff2fc42c",
    "title": "2022-02-08 - Cybereason vs. Lorenz Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T18:25:52Z",
    "file_modification_date": "2022-05-28T18:25:52Z",
    "file_size": 2053540,
    "plain_text": "# Cybereason vs. Lorenz Ransomware\n\n**cybereason.com/blog/cybereason-vs.-lorenz-ransomware**\n\nWritten By\nCybereason Nocturnus\n\nFebruary 8, 2022 | 7 minute read\n\nLorenz is a ransomware strain observed first in February of 2021, and is believed to be a rebranding of the\n“.sZ40” ransomware that was discovered in October 2020. Lorenz targets organizations worldwide with\n[customized attacks demanding hundreds of thousands of dollars, and even millions in ransom fee.](https://en.secnews.gr/377356/langs-xtipithike-me-ransomware-alla-den-plirwse-ta-litra/)\n\n\n-----\n\nThe group is targeting victims mostly in English speaking countries, and according to their website, the group has\npublished stolen data from more than 20 victims, although the estimated number of successful attacks is\nbelieved to be higher.\n\n_Cybereason detects and prevents Lorenz Ransomware_\n\n[According reports, Lorenz appears to be the same as ThunderCrypt ransomware observed all the way back in](https://www.bleepingcomputer.com/news/security/meet-lorenz-a-new-ransomware-gang-targeting-the-enterprise/)\nMay 2017. However, it’s not clear if Lorenz was created by the same group or if the group purchased the source\ncode of ThunderCrypt and created its own variant.\n\nShortly after Lorenz was discovered, the group faced a temporary problem after researchers published a free\n[decryptor (download here). The decryptor was released by the project No More Ransom, a joint project by law](https://www.zdnet.com/article/lorenz-ransomware-attack-victims-can-now-retrieve-their-files-for-free-with-this-decryption-tool/)\nenforcement agencies including Europol's European Cybercrime Center.\n\nIt’s worth noting that that decrypter is very limited and only supports .docx, .pptx, .xlsx and .zip. In addition, in the\ntest that we ran for both old and newer samples - the decrypter did not work and kept alerting that it doesn’t\nsupport the files (we tried encrypted docx files: <name>.docx.Lorenz.sz40 type):\n\n_Lorenz Leaks website_\n\n## Key Details\n\n**Ever Evolving Ransomware: The Lorenz group keeps changing the ransomware capabilities and**\nbehavior frequently, making it customized to their victims.\n**High Severity: The** [Cybereason Nocturnus Team assesses the threat level as HIGH given the destructive](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\npotential of the attacks.\n**Human Operated Attack: Prior to the deployment of the ransomware, the attackers attempt to infiltrate**\n[and move laterally throughout the organization, carrying out a fully-developed RansomOps attack.](https://www.cybereason.com/_hcms/analytics/search/conversion?redirect=aHR0cHM6Ly93d3cuY3liZXJlYXNvbi5jb20vYmxvZy9hbi1vcGVyYXRpb24tY2VudHJpYy1hcHByb2FjaC10by1yYW5zb21vcHMtcHJldmVudGlvbg%3D%3D&ct=SEARCH&pid=3354902&cid=58384320625&t=cmFuc29tb3Bz&d=www.cybereason.com&c=2&c=6&rp=1&ab=false&opcid=&rs=UNKNOWN&hs-expires=1675276449&hs-version=1&hs-signature=APUk-v6hRcsS8hLIu2WnSKH6cJTTTko9iQ)\n**Interesting Way of Leaking Data: The Lorenz group has a few steps in their leaking data process. From**\nselling it to other threat actors, releasing password-protected RAR archives containing the victim's data,\nand also selling DBs and access to internal networks.\n**Detected and Prevented:** [The Cybereason XDR Platform fully detects and prevents the Lorenz](https://www.cybereason.com/platform)\nransomware\n\n\n-----\n\n## Breaking Down the Attack\n\n### Not A Typical Spear-Phishing Attack\n\nThe Lorenz operators put a lot of effort into their attacks. They study their target’s employees, suppliers and\npartners. This way, the Lorenz group can even go from one, already compromised victim, to another. The\nknowledge they have collected is used to customize the attack specifically for the target.\n\nIn a [reported incident, the attackers used one compromised victim to “jump” to another. The group gained access](https://www.zdnet.com/article/this-company-was-hit-with-ransomware-but-didnt-have-to-pay-up-heres-how-they-did-it/)\nto the network via a phishing email, but not just any phishing email. The group, after doing their research on the\ntarget, sent the email from a legitimate email account of a real employee at a supplier that they'd already been\ncompromised. This way the email appears to be legitimate and increases the chances of falling to the scam.\n\nThen the attackers trick employees into installing an application that provides the attackers with full access to the\n[network, including the employees’ email, even after they reset their passwords. In some cases, the attackers](https://news.sophos.com/en-us/2021/10/28/the-top-10-ways-ransomware-operators-ramp-up-the-pressure-to-pay/)\neven used the compromised email accounts to email the IT, legal, and cyber insurance teams working with the\ntargeted organization to threaten further attacks if they didn’t pay.\n\n### Downloading the Ransomware\n\nAfter gaining an initial foothold in the network, the attackers start to perform reconnaissance commands, move\nlaterally within the network, and collect sensitive data including credentials, file, databases and emails.\n\nThe main goal for the attackers when moving laterally is to compromise a domain controller and obtain domain\nadministrator credentials. This allows them to perform additional activities, and later on selling access to the\ncompromised network.\n\nSince the Lorenz group customize the attack for the target, we have observed different binaries of Lorenz that\nhave different behavior. This can also point to the fact that the Lorenz group continues to update the\nransomware, even if that means to create changes frequently.\n\n### Ransomware Capabilities\n\nSince the ransomware binary files are customized for nearly every attack,, there are different behaviors and\ncapabilities observed in different samples, some of them were seen used combined. Some of the capabilities\nwere observed only in older versions, and some made a comeback in the newer and then disappeared again.\n\nTo put things into order, following are the main behavior and capabilities observed among the ransomware\nbinaries:\n\n**Deleting the Shadow Copies**\n\nSome of the Lorenz binaries observed used the well known vssadmin command to delete the virtual shadow\ncopies of the system. [Vssadmin.exe is a command-line tool that manages Volume Shadow Copy Service (VSS),](https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/vssadmin)\nwhich captures and copies stable images for backup on running systems.\n\nRansomware commonly uses vssadmin.exe to delete shadow copies and other backups of files before\nencrypting the files themselves. This is another way to ensure that the victim will be forced to pay to decrypt the\nvaluable files when they can neither be decrypted or retrieved from VSS.\n\nLorenz creates a scheduled task whose name starts with “sz40” and then sets it to run Vssadmin with the\nfollowing command line. After running, the scheduled task is deleted.\n\n_cmd.exe /c schtasks /Create /F /RU System /SC ONLOGON /TN sz403 /TR \"vssadmin Delete Shadows /For=C:\"_\n_&SCHTASKS /run /TN sz403&SCHTASKS /Delete /TN sz403 /F_\n\n\n-----\n\n_schtasks_\n\n_command as seen in the Cybereason XDR Platform_\n\n**Creating a New Boot Entry**\n\nOne unique behavior observed in some of the Lorenz binary is the creation of another boot entry for possibly\nmisleading purposes. A boot entry is a set of options that defines a load configuration for an operating system or\nbootable program. It is possible to have multiple boot entries for an operating system, each with a different set of\nboot parameters.\n\nLorenz uses the command utility bcdedit to copy the existing boot entry and modify it, which is the most common\nway to create a new boot entry. But it does one strange thing. The /timeout operator is set to 100,000 seconds,\nwhich is about 27 (!) hours.\n\nBy doing so, the system waits 27 hours before the boot manager selects the default entry if the user doesn’t\nchoose manually. Since Lorenz changes the description of the boot entries to “Lorenz Encrypt System”, the user\ncan be misled that the operating system is compromised entirely. In addition, if it is a system that operates\nwithout user interaction or that the system is not in the network and it’s impossible to connect, the system will not\nload the OS for 27 hours.\n\n_cmd.exe /c_ _[bcdedit /copy {current} /d \"Lorenz Encrypt System\" & bcdedit /set {current} description \"Lorenz](https://docs.microsoft.com/en-us/windows-hardware/manufacture/desktop/bcdedit-command-line-options?view=windows-11)_\n_Encrypt System\" & bcdedit /timeout 100000 && ipconfig_\n\n_bcdedit command_\n\n_as seen in the Cybereason XDR Platform_\n\n\n-----\n\n_Windows boot manager after Lorenz infection_\n\n**Creating Remote Scheduled Tasks**\n\nSome of the samples observed created a remote scheduled task that launches another ransomware binary\nlocated on a remote server within the infected network. This indicates that the attackers performed lateral\nmovement in the environment, collected information and harvest credentials before launching the ransomware\npayload.\n\nThe scheduled tasks names observed in the binaries are consistent with the names found when creating other\nscheduled tasks in other binaries, and starts with “sz40”. After execution, the malware deletes the scheduled task\nto remove tracks.\n\n_wmic /node:'<IP>’' /USER:'<domain>\\<username>' /PASSWORD:'<password>' process call create \"cmd.exe /c_\n_schtasks /Create /F /RU System /SC ONLOGON /TN sz401 /TR 'copy \\\\<domain>\\NETLOGON\\weams.exe_\n_%windir%lsamp.exe & start %windir%lsamp.exe' & SCHTASKS /run /TN sz401&SCHTASKS /Delete /TN sz401_\n_/F\"_\n\n**Changing the Wallpaper**\n\nSome of Lorenz binaries are also configured to change the desktop image of the machine in an additional way to\nalert the user about what happened. The wallpaper image is either called “Lorenz.bmp” or a random name.\nLorenz drops the .bmp file into %ProgramFiles% or %Windows% folder and then sets the relevant registry keys\nto configure it as a desktop wallpaper. The wallpaper is changed after reboot of the machine:\n\n\n-----\n\n_Image used as desktop_\n\n\n_background by Lorenz_\n\n\n-----\n\n_Lorenz execution as shown in the Cybereason XDR Platform_\n\n**Clearing Windows Event Logs**\n\nSome older versions of Lorenz found on domain controllers were observed deleting the Windows Event Logs to\nremove tracks of the malicious activities. Among the logs deleted are Windows PowerShell logs that contain\ninformation about PowerShell activities, which suggests the attacker has used them at some point in the attack:\n\n_Clearing Event Logs_\n\n_command as seen in the Cybereason XDR Platform_\n\n### File Encryption\n\nLorenz uses AES encryption to encrypt the files. For each encrypted file, it appends the extension\n“.Lorenz.sz40”. The original files are then deleted. In addition, Lorenz writes to each folder a ransom note named\n“HELP_SECURITY_EVENT.html” (recently changed to “HELP.txt”) that contains information about what\nhappened to the files, including a link to Lorenz data leak website and a unique TOR payment website where the\nvictim can see the demanded ransom fee and contact the group:\n\n\n-----\n\n_Encrypted files and ransom note_\n\n\n-----\n\n-----\n\n### An Interesting Way of Leaking Stolen Data\n\nLorenz has created a relatively unique extortion technique. After stealing files, emails, credentials and databases\nfrom victims, the group threatens to publish them in their data leaks website. When Lorenz publishes data, they\ndo things a bit differently compared to other ransomware gangs.\n\nFirst, Lorenz makes the data available for sale to other threat actors, hackers or possible competitors. After a\nwhile, they start releasing password-protected RAR archives containing the victim's data. If no ransom is paid,\nand the data is not purchased, Lorenz releases the password for the RAR archives containing the data leak so\nthat they are publicly available to anyone who downloads the files.\n\nBeside giving access to the stolen data, Lorenz, in order to maximize profit, sell access to the internal network\n[they have compromised. This trend is starting to gain popularity among other ransomware gangs as well, due to](https://www.zdnet.com/article/ransomware-operators-buy-network-access-from-the-underground-to-speed-up-infection/)\nthe understanding that for some threat actors, access to the networks could be more valuable than the data itself:\n\n_Lorenz Leaks website_\n\n\n-----\n\n_Lorenz Leaks website_\n\n## Cybereason Detection and Prevention\n\nThe [Cybereason XDR Platform is able to prevent the execution of the Lorenz Ransomware using multi-layer](https://www.cybereason.com/platform)\nprotection that detects and blocks malware with threat intelligence, machine learning, and next-gen antivirus\n[(NGAV) capabilities. Additionally, when the Anti-Ransomware feature is enabled, behavioral detection techniques](https://www.cybereason.com/platform/ransomware-protection)\n[in the platform are able to detect and prevent any attempt to encrypt files and generates a MalOpTM for it:](https://www.cybereason.com/_hcms/analytics/search/conversion?redirect=aHR0cHM6Ly93d3cuY3liZXJlYXNvbi5jb20vYmxvZy90aGUtY3liZXJlYXNvbi1tYWxvcC1hY2hpZXZpbmctb3BlcmF0aW9uLWNlbnRyaWMtc2VjdXJpdHk%3D&ct=SEARCH&pid=3354902&cid=41408928360&t=bWFsb3A%3D&d=www.cybereason.com&c=2&c=6&rp=5&ab=false&opcid=&rs=UNKNOWN&hs-expires=1675275601&hs-version=1&hs-signature=APUk-v5qzY2FGfq_R7GFV1Y1m688EqOhvw)\n\n_MalOp for Lorenz ransomware as_\n\n_shown in the Cybereason XDR Platform_\n\n_MalOp for Lorenz ransomware as shown in the Cybereason XDR Platform_\n\nUsing the Anti-Malware feature with the right configurations (listed in the recommendations below), the\n[Cybereason XDR Platform will also detect and prevent the execution of the ransomware and ensure that it](https://www.cybereason.com/fundamentals/what-is-ransomware)\ncannot encrypt targeted files. The prevention is based on machine learning, which blocks both known and\nunknown malware variants:\n\n\n-----\n\n_Cybereason_\n\n_user notification for preventing the execution of Lorenz - unknown hash_\n\n## Security Recommendations\n\n**Enable the Anti-Ransomware Feature on Cybereason NGAV: Set Cybereason Anti-Ransomware**\nprotection mode to Prevent - [more information for Cybereason customers can be found here](https://nest.cybereason.com/documentation/product-documentation/190/anti-ransomware-settings#set-protection-mode)\n**Enable Anti-Malware Feature on Cybereason NGAV: Set Cybereason Anti-Malware mode to Prevent**\nand set the detection mode to Moderate and above - more information for Cybereason customers can be\nfound here\n**Keep Systems Fully Patched: Make sure your systems are patched in order to mitigate vulnerabilities**\n**Regularly Backup Files to a Remote Server: Restoring your files from a backup is the fastest way to**\nregain access to your data\n**Use Security Solutions: Protect your environment using organizational firewalls, proxies, web filtering,**\nand mail filtering\n\n## Indicators of Compromise\n\n**IOC** **Type** **Description**\n\n\n8ea6a6d4578029c7b2dbbfb525ec88b2cb309901ec5a987847471b6101f0de41\n\n971f0a32094b8ac10712503305ac6789048d190a209c436839e2e6b0acb016f3\n\ncef17b9289ba18c979b704648c0f2b736f65f9f9158b471bc2486b6c14e14a4d\n\nedc2070fd8116f1df5c8d419189331ec606d10062818c5f3de865cd0f7d6db84\n\na0ccb9019b90716c8ee1bc0829e0e04cf7166be2f25987abbc8987e65cef2e6f\n\n1264b40feaa824d5ba31cef3c8a4ede230c61ef71c8a7994875deefe32bd8b3d\n\n40ff1ab8ac09057421079dae83fb675d7a2a3da6c7d0cd6400a0d720c5b0f58c\n\na9fdbc6d20b780ca42660ad4803f391308fa0243fbc515fd3c1acf935dd43c1e\n\n7275034886da11ca6d828547f15cab259e22ba624c5f5762afd237aa686455dd\n\n5b03b861884cb3e14a8b888c7dee2ee0d494933df863d504882345fa278d1ea5\n\n71cdbbc62e10983db183ca60ab964c1a3dab0d279c5326b2e920522480780956\n\n4b1170f7774acfdc5517fbe1c911f2bd9f1af498f3c3d25078f05c95701cc999\n\nc0c99b141b014c8e2a5c586586ae9dc01fd634ea977e2714fbef62d7626eb3fb\n\n\nSHA256 Lorenz binaries\n\n\n-----\n\n162.33.179[.]45\n\n172.86.75[.]63\n\n65.21.187[.]237\n\n167.99.186[.]156\n\n157.90.147[.]28\n\n143.198.117[.]43\n\n45.61.139[.]150\n\n## MITRE ATT&CK TECHNIQUES\n\n\n**Initial**\n**Access**\n\n\n**Lateral**\n**Movement**\n\n\n**Execution** **Defense**\n**Evasion**\n\n\n**Credential**\n**Access**\n\n\nIP C2\n\n**Discovery** **Collection** **Impact**\n\n\n[Phishing](https://attack.mitre.org/techniques/T1566/) Taint\n[Shared](https://attack.mitre.org/techniques/T1080/)\nContent\n\n\n[Masquerading](https://attack.mitre.org/techniques/T1036) Credentials\nfrom\nPassword\nStores\n\n\nAccount\nDiscovery\n\nSystem\n[Information](https://attack.mitre.org/techniques/T1082/)\nDiscovery\n\nFile and\n[Directory](https://attack.mitre.org/techniques/T1083/)\nDiscovery\n\n\nData from\n[Local](https://attack.mitre.org/techniques/T1005/)\nSystem\n\n\nData\n[Encrypted](https://attack.mitre.org/techniques/T1486/)\nfor Impact\n\nInhibit\n[System](https://attack.mitre.org/techniques/T1490/)\nRecovery\n\n\nValid\nAccounts\n\nTrusted\nRelationship\n\n\nRemote\nFile Copy\n\n\nCommand and\nScripting\nInterpreter:\nPowerShell\n\nScheduled\nTask/Job\n\nWindows\n[Management](https://attack.mitre.org/techniques/T1047/)\nInstrumentation\n\n\n## About the Researcher:\n\n**HUNTER, CYBEREASON**\n\n\n**LIOR ROCHBERGER, SENIOR THREAT RESEARCHER AND THREAT**\n\n\nAs part of the Nocturnus team at Cybereason, Lior has created procedures to lead threat hunting, reverse\nengineering and malware analysis teams. Lior has also been a contributing researcher to multiple threat and\nmalware blogs including Bitbucket Valak Ramnit and Racoon stealer Prior to Cybereason Lior led SOC\n\n\n-----\n\noperations within the Israeli Air Force.\n\nAbout the Author\n\n**Cybereason Nocturnus**\n\nThe Cybereason Nocturnus Team has brought the world’s brightest minds from the military, government\nintelligence, and enterprise security to uncover emerging threats across the globe. They specialize in analyzing\nnew attack methodologies, reverse-engineering malware, and exposing unknown system vulnerabilities. The\nCybereason Nocturnus Team was the first to release a vaccination for the 2017 NotPetya and Bad Rabbit\ncyberattacks.\n\n[All Posts by Cybereason Nocturnus](https://www.cybereason.com/blog/authors/cybereason-nocturnus)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-02-08 - Cybereason vs. Lorenz Ransomware.pdf"
    ],
    "report_names": [
        "2022-02-08 - Cybereason vs. Lorenz Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "6ad410c7-e291-4327-a54b-281c23f0d4fa",
            "created_at": "2022-10-25T16:07:24.501468Z",
            "updated_at": "2025-03-27T02:02:10.26052Z",
            "deleted_at": null,
            "main_name": "Karakurt",
            "aliases": [],
            "source_name": "ETDA:Karakurt",
            "tools": [
                "7-Zip",
                "Agentemis",
                "AnyDesk",
                "Cobalt Strike",
                "CobaltStrike",
                "FileZilla",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Mimikatz",
                "WinZip",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "2af9bea3-b43e-4a6d-8dc6-46dad6e3ff24",
            "created_at": "2022-10-25T16:47:55.853415Z",
            "updated_at": "2025-03-27T02:05:17.401138Z",
            "deleted_at": null,
            "main_name": "GOLD TOMAHAWK",
            "aliases": [
                "Karakurt Lair",
                "Karakurt Team",
                "Karakurt"
            ],
            "source_name": "Secureworks:GOLD TOMAHAWK",
            "tools": [
                " AnyDesk",
                " MEGA",
                " QuickPacket",
                " Rclone",
                " SendGB",
                "7-ZIP"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1673536089,
    "ts_updated_at": 1743041151,
    "ts_creation_date": 1653762352,
    "ts_modification_date": 1653762352,
    "files": {
        "pdf": "https://archive.orkl.eu/60161b776e90732acabf213e74e0a2b7ff2fc42c.pdf",
        "text": "https://archive.orkl.eu/60161b776e90732acabf213e74e0a2b7ff2fc42c.txt",
        "img": "https://archive.orkl.eu/60161b776e90732acabf213e74e0a2b7ff2fc42c.jpg"
    }
}