{
    "id": "b0697764-1f3a-4b9a-b5c7-ac8c76130e06",
    "created_at": "2023-01-12T15:05:56.960107Z",
    "updated_at": "2025-03-27T02:16:41.163277Z",
    "deleted_at": null,
    "sha1_hash": "c6bb76df6bd0c03e0d3ad857b2d871c6d6b71953",
    "title": "2021-10-14 - Alert (AA21-287A) Ongoing Cyber Threats to U.S. Water and Wastewater Systems",
    "authors": "",
    "file_creation_date": "2022-05-29T01:07:19Z",
    "file_modification_date": "2022-05-29T01:07:19Z",
    "file_size": 137979,
    "plain_text": "# Ongoing Cyber Threats to U.S. Water and Wastewater Systems\n\n**us-cert.cisa.gov/ncas/alerts/aa21-287a**\n\n## Summary\n\n**_Immediate Actions WWS Facilities Can Take Now to Protect Against Malicious Cyber_**\n**_Activity_**\n\n_• Do not click on_ _[suspicious links.](https://us-cert.cisa.gov/ncas/tips/ST04-014)_\n\n_[• If you use RDP, secure and monitor it.](https://www.ic3.gov/Media/Y2018/PSA180927)_\n\n_• Use_ _[strong passwords.](https://us-cert.cisa.gov/ncas/tips/ST04-002)_\n\n- Use _[multi-factor authentication.](https://us-cert.cisa.gov/ncas/tips/ST05-012)_\n\n**_Note: This advisory uses the MITRE Adversarial Tactics, Techniques, and Common_**\n_[Knowledge (ATT&CK®) framework, version 9. See the ATT&CK for Enterprise for all](https://attack.mitre.org/versions/v9/techniques/enterprise/)_\n_referenced threat actor tactics and techniques._\n\nThis joint advisory is the result of analytic efforts between the Federal Bureau of Investigation\n(FBI), the Cybersecurity and Infrastructure Agency (CISA), the Environmental Protection\nAgency (EPA), and the National Security Agency (NSA) to highlight ongoing malicious cyber\nactivity—by both known and unknown actors—targeting the information technology (IT) and\noperational technology (OT) networks, systems, and devices of U.S. Water and Wastewater\nSystems (WWS) Sector facilities. This activity—which includes attempts to compromise\nsystem integrity via unauthorized access—threatens the ability of WWS facilities to provide\nclean, potable water to, and effectively manage the wastewater of, their communities.\n**[Note: although cyber threats across critical infrastructure sectors are increasing, this](https://www.cisa.gov/critical-infrastructure-sectors)**\nadvisory does not intend to indicate greater targeting of the WWS Sector versus others.\n\nTo secure WWS facilities—including Department of Defense (DoD) water treatment facilities\nin the United States and abroad—against the TTPs listed below, CISA, FBI, EPA, and NSA\nstrongly urge organizations to implement the measures described in the Recommended\nMitigations section of this advisory.\n\n[Click here for a PDF version of this report.](https://us-cert.cisa.gov/sites/default/files/publications/AA21-287A-Ongoing_Cyber_Threats_to_U.S._Water_and_Wastewater_Systems.pdf)\n\n## Technical Details\n\n Threat Overview\n\n**Tactics, Techniques, and Procedures**\n\n\n-----\n\nWWS facilities may be vulnerable to the following common tactics, techniques, and\nprocedures (TTPs) used by threat actors to compromise IT and OT networks, systems, and\ndevices.\n\n[Spearphishing personnel to deliver malicious payloads, including ransomware [T1566].](https://attack.mitre.org/versions/v9/techniques/T1566/)\n\nSpearphishing is one of the most prevalent techniques used for initial access to\nIT networks. Personnel and their potential lack of cyber awareness are a\nvulnerability within an organization. Personnel may open malicious attachments\nor links to execute malicious payloads contained in emails from threat actors that\nhave successfully bypassed email filtering controls.\nWhen organizations integrate IT with OT systems, attackers can gain access—\neither purposefully or inadvertently—to OT assets after the IT network has been\ncompromised through spearphishing and other techniques.\nExploitation of internet-connected services and applications that enable remote\n[access to WWS networks [T1210].](https://attack.mitre.org/versions/v9/techniques/T1210/)\n\nFor example, threat actors can exploit a Remote Desktop Protocol (RDP)\nthat is insecurely connected to the internet to infect a network with\nransomware. If the RDP is used for process control equipment, the attacker\ncould also compromise WWS operations. Note: the increased use of remote\noperations due to the COVID-19 pandemic has likely increased the\nprevalence of weaknesses associated with remote access.\nExploitation of unsupported or outdated operating systems and software.\n\nThreat actors likely seek to take advantage of perceived weaknesses among\norganizations that either do not have—or choose not to prioritize—resources for\nIT/OT infrastructure modernization. WWS facilities tend to allocate resources to\nphysical infrastructure in need of replacement or repair (e.g., pipes) rather than\nIT/OT infrastructure.\nThe fact that WWS facilities are inconsistently resourced municipal systems—not\nall of which have the resources to employ consistently high cybersecurity\nstandards—may contribute to the use of unsupported or outdated operating\nsystems and software.\nExploitation of control system devices with vulnerable firmware versions.\n\nWWS systems commonly use outdated control system devices or firmware\nversions, which expose WWS networks to publicly accessible and remotely\nexecutable vulnerabilities. Successful compromise of these devices may lead to\n[loss of system control, denial of service, or loss of sensitive data [T0827].](https://collaborate.mitre.org/attackics/index.php/Technique/T0827)\n\n**WWS Sector Cyber Intrusions**\n\nCyber intrusions targeting U.S. WWS facilities highlight vulnerabilities associated with the\nfollowing threats:\n\nInsider threats, from current or former employees who maintain improperly active\ncredentials\n\n\n-----\n\nRansomware attacks\n\nWWS Sector cyber intrusions from 2019 to early 2021 include:\n\nIn August 2021, malicious cyber actors used Ghost variant ransomware against a\nCalifornia-based WWS facility. The ransomware variant had been in the system for\nabout a month and was discovered when three supervisory control and data acquisition\n(SCADA) servers displayed a ransomware message.\nIn July 2021, cyber actors used remote access to introduce ZuCaNo ransomware onto\na Maine-based WWS facility’s wastewater SCADA computer. The treatment system\nwas run manually until the SCADA computer was restored using local control and more\nfrequent operator rounds.\nIn March 2021, cyber actors used an unknown ransomware variant against a Nevadabased WWS facility. The ransomware affected the victim’s SCADA system and backup\nsystems. The SCADA system provides visibility and monitoring but is not a full\nindustrial control system (ICS).\nIn September 2020, personnel at a New Jersey-based WWS facility discovered\npotential Makop ransomware had compromised files within their system.\nIn March 2019, a former employee at Kansas-based WWS facility unsuccessfully\nattempted to threaten drinking water safety by using his user credentials, which had not\nbeen revoked at the time of his resignation, to remotely access a facility computer.\n\n## Mitigations\n\nThe FBI, CISA, EPA, and NSA recommend WWS facilities—including DoD water treatment\nfacilities in the United States and abroad—use a risk-informed analysis to determine the\napplicability of a range of technical and non-technical mitigations to prevent, detect, and\nrespond to cyber threats.\n\n**WWS Monitoring**\n\nPersonnel responsible for monitoring WWS should check for the following suspicious\nactivities and indicators, which may be indicative of threat actor activity:\n\nInability of WWS facility personnel to access SCADA system controls at any time,\neither entirely or in part;\nUnfamiliar data windows or system alerts appearing on SCADA system controls and\nfacility data screens that could indicate a ransomware attack;\nDetection by SCADA system controls, or by water treatment personnel, of abnormal\noperating parameters—such as unusually high chemical addition rates—used in the\nsafe and proper treatment of drinking water;\nAccess of SCADA systems by unauthorized individuals or groups, e.g., former\nemployees and current employees not authorized/assigned to operate SCADA systems\nand controls.\n\n\n-----\n\nAccess of SCADA systems at unusual times, which may indicate that a legitimate\nuser’s credentials have been compromised\nUnexplained SCADA system restarts.\nUnchanging parameter values that normally fluctuate.\n\n**Remote Access Mitigations**\n\nNote: The increased use of remote operations due to the COVID-19 pandemic increases the\nnecessity for asset owner-operators to assess the risk associated with enhanced remote\naccess to ensure it falls within acceptable levels.\n\nRequire multi-factor authentication for all remote access to the OT network, including\nfrom the IT network and external networks.\nUtilize [blocklisting and allowlisting to limit remote access to users with a verified](https://csrc.nist.gov/News/2015/NIST-Release-of-SP-800-167,-Guide-to-Application-W)\nbusiness and/or operational need.\nEnsure that all remote access technologies have logging enabled and regularly audit\nthese logs to identify instances of unauthorized access.\nUtilize manual start and stop features in place of always activated unattended access\nto reduce the time remote access services are running.\nAudit networks for systems using remote access services.\n\nClose unneeded network ports associated with remote access services (e.g.,\nRDP – Transmission Control Protocol [TCP] Port 3389).\n[When configuring access control for a host, utilize custom settings to limit the access a](https://csrc.nist.gov/publications/detail/sp/800-82/rev-2/final)\nremote party can attempt to acquire.\n\n**Network Mitigations**\n\nImplement and ensure robust network segmentation between IT and OT networks to\nlimit the ability of malicious cyber actors to pivot to the OT network after compromising\nthe IT network.\n\nImplement demilitarized zones (DMZs), firewalls, jump servers, and one-way\ncommunication diodes to prevent unregulated communication between the IT and\nOT networks.\nDevelop/update network maps to ensure a full accounting of all equipment that is\nconnected to the network.\n\nRemove any equipment from networks that is not required to conduct operations\nto reduce the attack surface malicious actors can exploit.\n\n**Planning and Operational Mitigations**\n\n\n-----\n\nEnsure the organization s emergency response plan considers the full range of\npotential impacts that cyberattacks pose to operations, including loss or manipulation of\nview, loss or manipulation of control, and threats to safety.\n\nThe plan should also consider third parties with legitimate need for OT network\naccess, including engineers and vendors.\nReview, test, and update the emergency response plan on an annual basis to\nensure accuracy.\nExercise the ability to fail over to alternate control systems, including manual operation\nwhile assuming degraded electronic communications.\n[Allow employees to gain decision-making experience via tabletop exercises that](https://www.cisa.gov/publication/cybersecurity-scenarios)\nincorporate loss of visibility and control scenarios. Utilize resources such as the\nEnvironment Protection Agency’s (EPA) [Cybersecurity Incident Action Checklist as well](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector)\nas the Ransomware Response Checklist on p. 11 of the CISA-Multi-State Information\nSharing and Analysis Center (MS-ISAC) Joint Ransomware Guide.\n\n**Safety System Mitigations**\n\nInstall independent cyber-physical safety systems. These are systems that physically\nprevent dangerous conditions from occurring if the control system is compromised by a\nthreat actor.\n\nExamples of cyber-physical safety system controls include:\n\nSize of the chemical feed pump\nGearing on valves\nPressure switches, etc.\nThese types of controls benefit WWS Sector facilities—especially smaller\nfacilities with limited cybersecurity capability—because they enable facility staff to\nassess systems from a worst-case scenario and determine protective solutions.\nEnabling cyber-physical safety systems allows operators to take physical steps to\nlimit the damage, for example, by preventing cyber actors, who have gained\ncontrol of a sodium hydroxide pump, from raising the pH to dangerous levels.\n\n## Additional Mitigations\n\n[Foster an organizational culture of cyber readiness. See the CISA Cyber Essentials](https://www.cisa.gov/publication/cyber-essentials-toolkits)\nalong with the items listed in the Resources section below for guidance.\nUpdate software, including operating systems, applications, and firmware on IT\nnetwork assets. Use a risk-based assessment strategy to determine which OT network\nassets and zones should participate in the patch management program. Consider\nusing a centralized patch management system.\nSet antivirus/antimalware programs to conduct regular scans of IT network assets\nusing up-to-date signatures. Use a risk-based asset inventory strategy to determine\nhow OT network assets are identified and evaluated for the presence of malware.\n\n\n-----\n\nImplement regular data backup procedures on both the IT and OT networks.\n\nRegularly test backups.\nEnsure backups are not connected to the network to prevent the potential spread\nof ransomware to the backups.\nWhen possible, enable OT device authentication, utilize the encrypted version of OT\nprotocols, and encrypt all wireless communications to ensure the confidentiality and\nauthenticity of process control data in transit.\nEmploy user account management to:\n\nRemove, disable, or rename any default system accounts wherever possible.\nImplement account lockout policies to reduce risk from brute-force attacks.\nMonitor the creation of administrator-level accounts by third-party vendors with\nrobust and privileged account management policies and procedures.\nImplement a user account policy that includes set durations for deactivation and\nremoval of accounts after employees leave the organization or after accounts\nreach a defined period of inactivity.\nImplement data execution prevention controls, such as application allowlisting and\nsoftware restriction policies that prevent programs from executing from common\nransomware locations, such as temporary folders supporting popular internet browsers.\nTrain users through awareness and simulations to recognize and report phishing and\nsocial engineering attempts. Identify and suspend access of users exhibiting unusual\nactivity.\n\nFBI, CISA, EPA, and NSA would like to thank Dragos as well as the WaterISAC for their\ncontributions to this advisory.\n\n## Resources\n\n**Cyber Hygiene Services**\n\n[CISA offers a range of no-cost cyber hygiene services—including vulnerability scanning and](https://www.cisa.gov/cyber-hygiene-services)\nransomware readiness assessments—to help critical infrastructure organizations assess,\nidentify, and reduce their exposure to cyber threats. By taking advantage of these services,\norganizations of any size will receive recommendations on ways to reduce their risk and\nmitigate attack vectors.\n\n**Rewards for Justice Reporting**\n\nThe U.S. Department of State’s Rewards for Justice (RFJ) program offers a reward of up to\n$10 million for reports of foreign government malicious activity against U.S. critical\n[infrastructure. See the RFJ website for more information and how to report information](https://rewardsforjustice.net/english/malicious_cyber_activity.html)\nsecurely.\n\n**StopRansomware.gov**\n\n\n-----\n\nThe [StopRansomware.gov webpage is an interagency resource that provides guidance on](https://www.cisa.gov/stopransomware)\nransomware protection, detection, and response. This includes ransomware alerts, reports,\nand resources from CISA and other federal partners, including:\n\nCISA and MS-ISAC: [Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware%20Guide_S508C.pdf)\nCISA Insights: [Ransomware Outbreak](https://www.cisa.gov/blog/2019/08/21/cisa-insights-ransomware-outbreak-0)\n[CISA Webinar: Combating Ransomware](https://www.youtube.com/watch?v=D8kC07tu27A)\n\n## Additional Resources\n\nFor additional resources that can assist in preventing and mitigating this activity, see:\n\nFBI-CISA-EPA-MS-ISAC Joint CSA: [Compromise of U.S. Water Treatment Facility](https://us-cert.cisa.gov/ncas/alerts/aa21-042a)\nWaterISAC: [15 Cybersecurity Fundamentals for Water and Wastewater Utilities](https://www.waterisac.org/fundamentals)\nAmerican Water Works Association: [Cybersecurity Guidance and Assessment Tool](https://www.awwa.org/Resources-Tools/Resource-Topics/Risk-Resilience/Cybersecurity-Guidance)\nEPA: [Cybersecurity Incident Action Checklist](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector)\nEPA: [Cybersecurity Best Practices for the Water Sector](https://www.epa.gov/waterriskassessment/epa-cybersecurity-best-practices-water-sector)\n[EPA: Supporting Cybersecurity Measures with the Clean Water and](https://www.epa.gov/cwsrf) [Drinking Water](https://www.epa.gov/dwsrf)\nState Revolving Funds\nCISA: [Cyber Risks & Resources for the Water and Wastewater Systems Sector](https://www.cisa.gov/ncf-water)\ninfographic\nCISA: [Critical ICS Cybersecurity Performance Goals and Objectives](https://www.cisa.gov/control-systems-goals-and-objectives)\nCISA Fact Sheet: [Rising Ransomware Threat to Operational Technology Assets](https://www.cisa.gov/publication/ransomware-threat-to-ot)\nCISA-MS-ISAC: [Joint Ransomware Guide](https://www.cisa.gov/sites/default/files/publications/CISA_MS-ISAC_Ransomware%20Guide_S508C_.pdf)\nNSA CSA: [Stop Malicious Cyber Activity Against Connected OT](https://media.defense.gov/2021/Apr/29/2002630479/-1/-1/1/CSA_STOP-MCA-AGAINST-OT_UOO13672321.PDF)\nCISA: [Insider Threat Mitigation Resources](https://www.cisa.gov/publication/insider-threat-mitigation-resources)\nNIST: [Special Publication (SP) 800-167, Guide to Application Whitelisting](https://csrc.nist.gov/News/2015/NIST-Release-of-SP-800-167,-Guide-to-Application-W)\nNIST: SP 800-82 Rev. 2, Guide to Industrial Control Systems (ICS) Security (Section\n6.2.1)\n\n## Disclaimer of Endorsement\n\nThe information and opinions contained in this document are provided \"as is\" and without\nany warranties or guarantees. Reference herein to any specific commercial products,\nprocess, or service by trade name, trademark, manufacturer, or otherwise, does not\nconstitute or imply its endorsement, recommendation, or favoring by the United States\nGovernment, and this guidance shall not be used for advertising or product endorsement\npurposes.\n\n## Contact Information\n\n\n-----\n\nTo report suspicious or criminal activity related to information found in this Joint\nCybersecurity Advisory, contact your local FBI field office at www.fbi.gov/contact-us/fieldoffices, or the FBI’s 24/7 Cyber Watch (CyWatch) at (855) 292-3937 or by e-mail at\n[CyWatch@fbi.gov. When available, please include the following information regarding the](http://10.10.0.46/mailto:CyWatch@fbi.gov)\nincident: date, time, and location of the incident; type of activity; number of people affected;\ntype of equipment used for the activity; the name of the submitting company or organization;\nand a designated point of contact. If you have any further questions related to this Joint\nCybersecurity Advisory, or to request incident response resources or technical assistance\nrelated to these threats, contact CISA at [CISAServiceDesk@cisa.dhs.gov.](http://10.10.0.46/mailto:CISAServiceDesk@cisa.dhs.gov)\n\n## Revisions\n\nInitial Version: October 14, 2021\n\nOctober 25, 2021: Corrected typo in Additional Resources\n\n[This product is provided subject to this Notification and this](https://us-cert.cisa.gov/privacy/notification) [Privacy & Use policy.](https://www.dhs.gov/privacy-policy)\n\n**Please share your thoughts.**\n\n[We recently updated our anonymous product survey; we'd welcome your feedback.](https://www.surveymonkey.com/r/CISA-cyber-survey?product=https://us-cert.cisa.gov/ncas/alerts/aa21-287a)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-14 - Alert (AA21-287A) Ongoing Cyber Threats to U.S. Water and Wastewater Systems.pdf"
    ],
    "report_names": [
        "2021-10-14 - Alert (AA21-287A) Ongoing Cyber Threats to U.S. Water and Wastewater Systems.pdf"
    ],
    "threat_actors": [
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "aa73cd6a-868c-4ae4-a5b2-7cb2c5ad1e9d",
            "created_at": "2022-10-25T16:07:24.139848Z",
            "updated_at": "2025-03-27T02:02:10.120505Z",
            "deleted_at": null,
            "main_name": "Safe",
            "aliases": [],
            "source_name": "ETDA:Safe",
            "tools": [
                "DebugView",
                "LZ77",
                "OpenDoc",
                "SafeDisk",
                "TypeConfig",
                "UPXShell",
                "UsbDoc",
                "UsbExe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4ac28d1-66eb-4f2d-9f9b-a72394349fd0",
            "created_at": "2023-01-06T13:46:38.667954Z",
            "updated_at": "2025-03-27T02:00:02.887442Z",
            "deleted_at": null,
            "main_name": "APT4",
            "aliases": [
                "PLA Navy",
                "MAVERICK PANDA",
                "BRONZE EDISON",
                "SODIUM",
                "Salmon Typhoon"
            ],
            "source_name": "MISPGALAXY:APT4",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "6fbff48b-7a3e-4e54-ac22-b10f11e32337",
            "created_at": "2022-10-25T16:07:23.318008Z",
            "updated_at": "2025-03-27T02:02:09.734465Z",
            "deleted_at": null,
            "main_name": "APT 4",
            "aliases": [
                "APT 4",
                "Bronze Edison",
                "Maverick Panda",
                "Salmon Typhoo",
                "Sodium",
                "Sykipot",
                "TG-0623",
                "Wisp Team"
            ],
            "source_name": "ETDA:APT 4",
            "tools": [
                "Getkys",
                "Sykipot",
                "Wkysol",
                "XMRig"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535956,
    "ts_updated_at": 1743041801,
    "ts_creation_date": 1653786439,
    "ts_modification_date": 1653786439,
    "files": {
        "pdf": "https://archive.orkl.eu/c6bb76df6bd0c03e0d3ad857b2d871c6d6b71953.pdf",
        "text": "https://archive.orkl.eu/c6bb76df6bd0c03e0d3ad857b2d871c6d6b71953.txt",
        "img": "https://archive.orkl.eu/c6bb76df6bd0c03e0d3ad857b2d871c6d6b71953.jpg"
    }
}