{
    "id": "b09904da-b80e-44b3-9379-17a4daf62fc0",
    "created_at": "2023-01-12T15:08:37.762505Z",
    "updated_at": "2025-03-27T02:16:20.800338Z",
    "deleted_at": null,
    "sha1_hash": "28095117d1856d17cde35cfbe554437bdbaac785",
    "title": "2020-06-17 - AcidBox- Rare Malware Repurposing Turla Group Exploit Targeted Russian Organizations",
    "authors": "",
    "file_creation_date": "2022-05-28T18:01:23Z",
    "file_modification_date": "2022-05-28T18:01:23Z",
    "file_size": 689456,
    "plain_text": "# AcidBox: Rare Malware Repurposing Turla Group Exploit Targeted Russian Organizations\n\n**unit42.paloaltonetworks.com/acidbox-rare-malware/**\n\nDominik Reichel, Esmid Idrizovic June 17, 2020\n\nBy [Dominik Reichel and](https://unit42.paloaltonetworks.com/author/dominik-reichel/) [Esmid Idrizovic](https://unit42.paloaltonetworks.com/author/esmid-idrizovic/)\n\nJune 17, 2020 at 6:00 AM\n\n[Category: Malware,](https://unit42.paloaltonetworks.com/category/malware-2/) [Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [AcidBox,](https://unit42.paloaltonetworks.com/tag/acidbox/) [CVE-2008-3431,](https://unit42.paloaltonetworks.com/tag/cve-2008-3431/) [Turla,](https://unit42.paloaltonetworks.com/tag/turla/) [vulnerabilities](https://unit42.paloaltonetworks.com/tag/vulnerability/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/acidbox-rare-malware/)\n\n## Executive Summary\n\n[When the news broke in 2014 about a new sophisticated threat actor dubbed the Turla](https://www.gdatasoftware.com/blog/2014/02/23968-uroburos-highly-complex-espionage-software-with-russian-roots)\nGroup, which the [Estonian foreign intelligence service believes has Russian origins and](https://www.valisluureamet.ee/pdf/raport-2018-ENG-web.pdf)\noperates on behalf of the FSB, its kernelmode malware also became the first publiclydescribed case that abused a third-party device driver to disable Driver Signature\nEnforcement (DSE). This security mechanism was introduced in Windows Vista to prevent\nunsigned drivers from loading into kernel space. Turla exploited the signed VirtualBox driver,\nVBoxDrv.sys v1.6.2, to deactivate DSE and load its unsigned payload drivers afterward.\n\n\n-----\n\nThere is some confusion about this exploit, however, as it s often generally referred to as\n[CVE-2008-3431. The exploit used by Turla actually abuses two vulnerabilities -- of which,](https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2008-3431)\nonly one was ever fixed in the aforementioned CVE. The other vulnerability was found by\nTurla and is used in the first version of their exploit, along with CVE-2008-3431. The second\n[version of their exploit, presumably introduced in 2014 of their kernelmode malware, only](https://www.kernelmode.info/forum/viewtopic4989.html?f=16&t=3193&start=50#p26173)\nuses the unpatched vulnerability, which we discuss in greater detail later.\n\nIn February 2019, Unit 42 found that a yet-to-be-known threat actor -- unbeknownst to the\ninfosec community -- discovered that the second unpatched vulnerability can not only exploit\nVirtualBox VBoxDrv.sys driver v1.6.2, but also all other versions up to v3.0.0. Furthermore,\nour research shows that this unknown actor exploited VirtualBox driver version 2.2.0 to target\nat least two different Russian organizations in 2017, which we are revealing for the first time.\nWe anticipate this was done because the driver version 2.2.0 wasn't known to be vulnerable\nand thus most likely is not on the radar of security companies being exploited. Since no other\nvictims have been found, we believe this is a very rare malware used in targeted attacks\nonly.\n\nThe actors used a previously unknown malware family that we have dubbed AcidBox due to\nthe first part being an anagram of the malware’s driver device name and the second part\ntaken from VirtualBox. Because of the malware’s complexity, rarity, and the fact that it’s part\nof a bigger toolset, we believe it was used by an advanced threat actor for targeted attacks\nand it's likely that this malware is still being used today if the attacker is still active. However,\nwe anticipate that it was rewritten to a certain extent. Based on the information we have, we\ndon’t believe this unknown threat actor is tied to Turla, except for the used exploit.\n\nPalo Alto Networks customers are protected from this threat. Our threat prevention platform\nwith WildFire identifies this malware as malicious. AutoFocus customers can track malware\nactivity by using the AcidBox tag. We also created an Adversary Playbook for this attack,\n[which can be found here.](https://pan-unit42.github.io/playbook_viewer/?pb=temp-acidbox)\n\n**The Unknown Threat Actor**\n\nIn February 2019, we discovered a sample of AcidBox (SHA256:\neb30a1822bd6f503f8151cb04bfd315a62fa67dbfe1f573e6fcfd74636ecedd5) uploaded to\nVirusTotal, which contained a string known to be used in Turla’s VirtualBox exploit. A deeper\nanalysis of the sample revealed it’s the main worker module as part of a sophisticated\nmalware that we couldn’t tie to any known threat actor.\n\nIn collaborating with our colleagues at Dr.Web, we learned that this sample was used in a\ntargeted attack on an unspecified entity in Russia back in 2017. Thankfully, they shared three\nadditional samples of the same malware family. Two of those usermode samples are\nmodules that load the main worker from the Windows registry and one is the kernelmode\npayload driver embedded in the main worker sample. Moreover, we contacted Kaspersky\nsince the company is headquartered in Russia, which found only one additional sample in\n\n\n-----\n\ntheir databases that was also the usermode loader version. We also contacted ESET, which\ndidn’t find any victims infected with this malware, just like in our own case. For this reason,\nwe conclude it’s a very rare malware used in targeted attacks only.\n\nWhat all the samples have in common are the compilation timestamps of May 9, 2017. This\ndate seems legitimate, as the sample found by Kaspersky appeared in June 2017 in their\ndatabases. Therefore, we conclude that the campaign which involved this malware took\nplace in 2017. We couldn’t find any newer samples and thus it’s unknown if AcidBox is still in\nuse or has been further developed.\n\nWe compared the specific characteristics of the samples to all publicly-known malware, but\n[couldn’t find any clear overlaps. There are some very loose similarities to Remsec malware](https://securelist.com/faq-the-projectsauron-apt/75533/)\nattributed to ProjectSauron, like:\n\nDWORD size data marker values\nExport function names made of 2/3 words\nMS Visual C/C++ compiler used\nVarious import API functions overlaps\nUse of vulnerable 3rd party driver to load own unsigned driver\nZlib compression used\nSensitive data encrypted in the resource section\n\nHowever, based on these facts alone, it’s not possible to attribute the samples to the\nProjectSauron threat actor. We think it’s more likely this is a yet unknown threat actor.\n\n**The VirtualBox Exploit and Turla’s Versions**\n\n[The original vulnerability described in CVE-2008-3431 was found by Core Security in 2008](https://www.coresecurity.com/content/virtualbox-privilege-escalation-vulnerability)\nand affected VBoxDrv.sys less or equal version 1.6.2. It was fixed in version 1.6.4 and thus\ncouldn’t be exploited anymore.\n\n\n-----\n\nFigure\n\n1. Vulnerable and patched VirtualBox device dispatch handler routines on the left and right,\nrespectively\nThe vulnerability is located in the dispatch device control routine called\nVBoxDrvNtDeviceControl. On versions prior to 1.6.4, you can call the usermode\nDeviceIoControl API function and send one of the following control codes together with a\nkernel address you want to overwrite as the input/output buffer:\n\nSUP_IOCTL_FAST_DO_RAW_RUN\nSUP_IOCTL_FAST_DO_HM_RUN\nSUP_IOCTL_FAST_DO_NOP\n\nThe kernel address is passed down to the control handler (see Figure 1 left, line 28) without\nany check or validation and is filled with the return value of supdrvIOCtlFast (see Figure 1\nleft, line 24). This is where the vulnerability digging from CoreSecurity stops and where Turla\ncontinues. In the original exploit, the return value from supdrvIOCtlFast isn’t controlled and\nthus it will be a random value written to your kernel address. Turla’s exploit controls the\nreturn value by overwriting the function pointer of supdrvIOCtlFast to redirect execution to a\nsmall shellcode, which returns the needed value. This was described in great detail in a\n[couple of](https://www.kernelmode.info/forum/viewtopic7377.html?f=16&t=3193&start=10#p22357) [articles and the complete reverse-engineered exploit code is also available.](https://www.virusbulletin.com/virusbulletin/2014/05/anatomy-turla-exploits/)\n\nThe patched version 1.6.4 (see Figure 1 right) doesn’t use the UserBuffer pointer anymore,\nwhich could be abused by passing a kernel address. Additionally, it checks if the rc variable\nis equal or bigger than zero -- which isn’t needed for the patch, but more like a sanity check.\n\nWith this patch, the original vulnerability to overwrite a kernel address was fixed. The other\nvulnerability that lets you control the function pointer of supdrvIOCtlFast remained\nunpatched. Of course, that’s because it wasn’t discovered by Core Security at the time, but\nonly a few years later by the Turla threat actor.\n\n\n-----\n\nWhile Turla still uses the vulnerable VirtualBox driver v.1.6.2 to date, it only makes use of the\n[unpatched vulnerability. The reason why and how it uses it was described by Lastline, and](https://www.lastline.com/labsblog/turla-apt-group-gives-their-kernel-exploit-a-makeover/)\n[also the reverse-engineered exploit code is available in a project named Turla Driver Loader.](https://github.com/hfiref0x/TDL)\n\nThe secret is the exact same exploit, with only a small modification -- which we won’t\ndisclose here -- can be used on all VBoxDrv.sys versions up to 3.0.0. This was also figured\nout by an unknown threat actor. While VirtualBox versions smaller than 4.0 aren’t available\non the official website anymore, they can still be found on some software download sites.\n\nStarting from version 3.0.0, some structures and routines have changed so the exploit does\nnot work anymore. However, it can’t be ruled out that in later versions it’s still possible to\nexploit the same vulnerability with some more adjustments.\n\nWhat’s also interesting is that not even the Turla authors themself seem to have realized\nthat. They still use the old VBoxDrv.sys v.1.6.2 in their otherwise stealthy exploit. This driver\nis widely known to be used for malicious or various otherwise dubious purposes, for\nexample, in-game cheats.\n\n**Technical Analysis of AcidBox**\n\nThe malware is a complex modular toolkit of which we have only a part of it. In total, we have\nfound four 64-bit usermode DLLs and an unsigned kernelmode driver (SHA256:\n3ef071e0327e7014dd374d96bed023e6c434df6f98cce88a1e7335a667f6749d). Three out of\nthe four usermode samples have identical functionality and are loaders for the main worker\nmodule. They only differ in their file descriptions and the embedded and encrypted registry\n[path. These loaders are created as security support providers (further SSP). A SSP is a DLL](https://docs.microsoft.com/en-us/windows/win32/secauthn/custom-security-packages)\nthat exports at least the function SpLsaModeInitialize and usually provides security\nmechanisms such as authentication between client/server applications. There are a couple\n[of standard SSPs provided in Windows such as Kerberos (kerberos.dll) or NTLM](https://docs.microsoft.com/en-us/windows/win32/secauthn/kerberos-ssp-ap)\n(msv1_0.dll). You can abuse the SSP interface for malware persistency and also for injection\npurposes. In order to maintain persistency, you have to put your SSP DLL into the Windows\n[system directory and add the name of your DLL to a certain registry value. Upon a system](https://docs.microsoft.com/en-us/windows/win32/secauthn/registering-ssp-ap-dlls)\nrestart, your DLL gets loaded into the Windows lsass.exe process and is executed. If you just\nwant your SSP DLL to be injected into lsass.exe, you can call the API function\n[AddSecurityPackage which triggers immediate loading. Of course, you need at least admin](https://docs.microsoft.com/en-us/windows/win32/api/sspi/nf-sspi-addsecuritypackagea)\nprivileges for both of these methods. The first case of a malware abusing the SSP interface\n[was mentioned by Matt Graeber in 2014. Since then, this persistence and injection trick has](http://docplayer.net/20839173-Analysis-of-malicious-security-support-provider-dlls.html)\nbecome [wider known, but it’s still rarely used in malware.](https://attack.mitre.org/techniques/T1101/)\n\nIn case of the three AcidBox SSP DLLs, they don’t make use of any security related\noperations, but purely abuse this interface for injection purposes and most likely also for\npersistence. The three SSPs have different file names that are similar to the standard\npackages provided in Windows (msv1_0.dll, pku2u.dll, wdigest.dll):\n\n\n-----\n\nmsv1_1.dll (SHA256:\nb3166c417d49e94f3d9eab9b1e8ab853b58ba59f734f774b5de75ee631a9b66d)\npku.dll (SHA256:\n3ad20ca49a979e5ea4a5e154962e7caff17e4ca4f00bec7f3ab89275fcc8f58c)\nwindigest.dll (SHA256:\n003669761229d3e1db0f5a5b333ef62b3dffcc8e27c821ce9018362e0a2df7e9)\n\nFigure\n\n2. Standard SSP DLLs provided in Windows 7 present in the “Security Packages” value\nFor this reason, we conclude the AcidBox SSPs also abuse the interface for persistence.\nHowever, as we don’t have the component which installs the SSP DLLs, we don’t know for\nsure. What we know is that the SSP interface is used for injection into lsass.exe, as they\ncheck at the beginning whether the process path they're loaded into matches the one which\nis embedded into every sample in the resource section\n(C:\\WINDOWS\\SYSTEM32\\lsass.exe). This process path is contained in the resource 4097\nwhich we describe later how it is hidden via steganography.\n\nThe purpose of the AcidBox SSP DLLs is to load the main worker module from a registry\nvalue contained in resource 256 of each sample. We don’t know how the main worker DLL\nwas stored in the registry, but we believe it was done by the same missing component which\ninstalled the SSP DLLs. We also assume that the three SSP DLLs are from three different\nsystems as one of those samples has a different registry key embedded. Also, as these\nmodules are the only visible part on a system -- with the main worker module being loaded\nremains encrypted in the registry -- they likely differ in some way like their chosen file name.\nThe main worker is stored in the registry encrypted within a data blob that contains various\nother metadata such as the CRC32 hash of the data blob or magic byte sequences which\nindicate different types of contained data.\n\n\n-----\n\nAfter the main worker DLL gets decrypted by a SSP DLL from the registry via simply XORing\nthe data with key 0xCA, it gets prepared to be loaded from memory. It does so by creating a\nthread for the module and uses the exported function UpdateContext of the main worker as\nits start address. The main worker module then loads the unsigned malware driver via the\nVirtualBox exploit and waits for commands from one or more components that we don’t have.\nThese commands include the loading of additional payloads from the registry from kernel\nspace via the driver or the installation of new SSP DLLs.\n\nThe main worker has 2 export functions named InitMainStartup and UpdateContext. The\nfollowing strings are present in cleartext:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n\n\n%s\\%s\n\n%s\\%s{%s}\n\n%s\\[[%s]]\n\n%s.dll\n\n%s%s%s.dll\n\n\\\\.\\PCIXA_CFGDEV\nInitEntry\nInitExit\nThe Magic Word!\nntoskrnl.exe\nntkrn\nntkrp\nhal.dll\nntoskrnl\nntkrnlpa.exe\n%s%s%s\n\nGroup\nCount\nNextInstance\nRoot\\LEGACY_NULL\\0000\n\n\nThe following additional strings are stack obfuscated:\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n\n\nSeLoadDriverPrivilege\n%s\\%c*.dll\n\nSystem\\CurrentControlSet\\Control\\\nNtQueryInformationThread\nBFE_Notify_Event_\nMicrosoft\\Cryptography\nntdll.dll\n\\Registry\\Machine\\\nSOFTWARE\nGlobal\n%s\\%s\n\nSecurity Packages\nkernel32.dll\nSOFTWARE\n\\Registry\\Machine\\\nMachineGuid\nntdll.dll\n\n\nThere are also XOR-encoded DLL and function names, which later get dynamically resolved\nand used:\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n\n\nntdll.RtlGetVersion\nntdll.ZwLoadDriver\nntdll.ZwUnloadDriver\nntdll.ZwQuerySystemInformation\nkernel32.DeviceIoControl\nkernel32.GetSystemDirectoryA\nntdll.RtlAnsiStringToUnicodeString\nntdll.ZwClose\nntdll.ZwCreateFile\nntdll.ZwQueryInformationFile\nntdll.ZwReadFile\nntdll.ZwWriteFile\nkernel32.GetSystemDirectoryA\nkernel32.GetSystemDirectoryW\nkernel32.BaseThreadInitThunk\nkernel32.LZDone\nadvapi32.CryptAcquireContextA\nadvapi32.CryptGenRandom\nadvapi32.CryptReleaseContext\nntdll.RtlRbInsertNodeEx\nntdll.RtlRbRemoveNode\nntdll.RtlAcquireSRWLockExclusive\nntdll.RtlReleaseSRWLockExclusive\nntdll.RtlEnterCriticalSection\nntdll.RtlPcToFileHeader\nntdll.RtlGetVersion\nntdll.RtlUpcaseUnicodeChar\nntdll.RtlAnsiStringToUnicodeString\nntdll.LdrLockLoaderLock\nntdll.LdrUnlockLoaderLock\nntdll.ZwClose\nntdll.ZwCreateSection\nntdll.ZwMapViewOfSection\nntdll.ZwUnmapViewOfSection\n\n\nAll the functionality is contained in the two export functions, while DllMain does not contain\nany relevant code. What stands out is the extensive use of custom DWORD-size status\ncodes throughout the code. Decompiled code example with status codes in result variable:\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n\n\n…\nif ( !a1 || !a2 || !(_DWORD)v3 )\n{\nresult = 0xA0032B02;\ngoto LABEL_45;\n}\nif ( strlen(a1) <= 1 )\ngoto LABEL_65;\nresult = get_kernel32_path(a1, &v43, &v37, &v41);\nif ( result )\ngoto LABEL_45;\nif ( (unsigned int)v3 < 0x1C )\n{\nLABEL_65:\nresult = 0xA0032B02;\ngoto LABEL_45;\n}\npBuffer = allocate_buffer(v13, (unsigned int)v3, 0i64, v11, 0, 1);\nbuffer = pBuffer;\nif ( !pBuffer )\n{\nLABEL_9:\nresult = 0xA0032B04;\ngoto LABEL_45;\n}\nif ( memcpy_s(pBuffer, v3, a2, v3) )\n{\nLABEL_11:\nresult = 0xA0032B06;\ngoto LABEL_45;\n}\n…\n\n\nThe main worker sample contains five icon resources with valid icons named 16, 256, 4097,\n8193 and 12289. The names indicate different icon resolutions, but the icons only differ in the\nencrypted data appended to them which can be considered as a form of steganography. This\ndata is encrypted with a custom algorithm and additionally zlib compressed. The same\nmethod is used within the SSP DLLs. A Python script for decryption and decompression can\nbe found in the Appendix. After decryption, the data blob has the following structure:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n\n\nstruct data_blob {\nDWORD marker;  // Marker bytes (0x9A65659A)\nDWORD crc32;  // CRC32 value of decrypted or zlib uncompressed\nbytes\nDWORD size;   // Size of decrypted or zlib uncompressed bytes\nDWORD option;  // Information if data is encrypted or zlib\ncompressed; 0x1 = encrypted, 0x2 = zlib compressed\nchar data[];  // Encrypted or zlib compressed data\n};\n\n\n-----\n\nThe decrypted data is as follows.\n\nResource 16:\n\n\n1\n2\n\n\nSystem\\CurrentControlSet\\Control\\Class\\{4D36E97D-E325-11CE-BFC1-08002B\nE10318}\\0003\\DriverData\n\n\nResource 256:\n\n\n1\n2\n\n\nSystem\\CurrentControlSet\\Control\\Class\\{4D36E96A-E325-11CE-BFC1-08002B\nE10318}\\0000\\DriverData\n\n\nResources 16 and 256 are the Windows registry keys that contain the decryption key for the\nembedded driver in resource 8193 and additional payloads that are likely going to be injected\nby the AcidBox driver.\n\nResource 4097:\n\n1 C:\\WINDOWS\\SYSTEM32\\lsass.exe\n\nThis resource contains the path of the process each sample uses to verify it is being loaded\ninto the correct process. Resource 8193 contains the unsigned kernelmode payload driver,\nwhich is also encrypted with RSA. The driver is realized as a kernelmode DLL with two\nexport functions InitEntry and InitExit. It contains the following cleartext strings:\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n\n\nntoskrnl.exe\nntkrn\nntkrp\nhal.dll\nntoskrnl\nntkrnlpa.exe\ncsrss.exe\nPsCreateSystemThread\n\\Device\\VBoxDrv\n\\DosDevices\\PCIXA_CFGDEV\n\\Windows\\ApiPort\n\\Sessions\\%u\\Windows\\ApiPort\n\\Sessions\\xxxxxxxx\\Windows\\ApiPort\n\\Device\\PCIXA_CFG\n\\DosDevices\\PCIXA_CFGDEV\n\n\nResource 12289 contains the VirtualBox VBoxDrv.sys driver v2.2.0.0 signed by Sun\nMicrosystems, which we previously described is also vulnerable.\n\n\n-----\n\nFigure\n\n3. Signed vulnerable VBoxDrv.sys driver version 2.2.0.0\n\n**A Little Forensic Tidbit in the PE header**\n\nWhile studying the samples, PE header characteristics -- an often overseen forensic\nindicator -- caught our attention. This little known fact can be found in the export directory\nand can be helpful for attributing malware samples. All of the AcidBox samples contain gaps\nbetween the single exported function entries:\n\nFigure\n\n4. Export directories of AcidBox samples with gaps between the export function entries\n\n\n-----\n\nEvery AcidBox sample has a NumberOfFunctions value in the export directory that is bigger\nthan the NumberOfNames value. This isn’t something unusual, as not every exported\n[function has to have a name too. Unnamed functions can be also called by their ordinal](https://docs.microsoft.com/en-us/cpp/build/exporting-functions-from-a-dll-by-ordinal-rather-than-by-name?view=vs-2019)\nvalues. What is uncommon, however, is that the function entries which are unnamed are also\nzeroed out, thus not used.\n\n[This is the result when you use your own DEF file instead of](https://docs.microsoft.com/en-us/cpp/build/exporting-from-a-dll-using-def-files?view=vs-2019) [__declspec(dllexport) to](https://docs.microsoft.com/en-us/cpp/build/exporting-from-a-dll-using-declspec-dllexport?view=vs-2019)\ndescribe the attributes of your DLL file. When you use a DEF file, you can choose which\nordinal your export function will have. This is not possible with __declspec(dllexport) as the\nVisual Studio compiler always counts your functions starting from one.\n\nUsing a DEF file instead of __declspec(dllexport) has some advantages. You are able to\n[export functions by ordinals and you can also redirect functions among other things. The](https://docs.microsoft.com/en-us/cpp/build/reference/exports?view=vs-2019)\ndisadvantage is that you have to maintain an additional file within your project.\n\nIn the case of the AcidBox samples, we can conclude a couple of things. First, the author\nuses a DEF file, although he doesn’t make use of its advantages. This could indicate it’s a\nhabit of the author to use DEF files. Second, the function ordinals seem to be chosen in\nsteps of two integers. A possible explanation could be that the unused ordinals were once\nused for functions too. And last, if we assume the author really has chosen to make two\ninteger steps, then in the usermode DLLs, one export function was removed. We can see\nthat ordinal 3 is unused, leaving a bigger gap than one integer. All this information can be\nuseful for malware attribution.\n\n## Conclusion\n\nA new advanced malware, dubbed AcidBox, was used by an unknown threat actor in 2017\nthat went undetected until now. It uses a known VirtualBox exploit to disable Driver Signature\nEnforcement in Windows, but with a new twist: While it’s publicly known that VirtualBox driver\nVBoxDrv.sys v1.6.2 is vulnerable and used by Turla, this new malware uses the same exploit\nbut with a slightly newer VirtualBox version.\n\nSometimes, you are still able to find a technically interesting Windows malware that uses a\nnew technique. This has become quite a rarity in today’s threat landscape where everything\nis either a copy of a copy of a copy or technically underwhelming. While AcidBox doesn’t use\nany fundamentally new methods, it breaks the myth that only VirtualBox VBoxDrv.sys 1.6.2\ncan be used for Turla’s exploit. Appending sensitive data as an overlay in icon resources,\nabusing the SSP interface for persistence and injection and payload storage in the Windows\nregistry puts it into the category of interesting malware.\n\nThe samples we dubbed AcidBox are only part of a bigger toolkit which we, unfortunately,\ncould not identify. However, we provide two Yara rules for detection and threat hunting.\nAdditionally, if you happen to find an additional sample, or are even infected, you can use the\n\n\n-----\n\nprovided Python script to extract the sensitive data appended to the icon resources. All of\n[these can be found here at Unit 42’s GitHub repository.](https://github.com/pan-unit42/iocs/tree/master/AcidBox)\n\nIf you have any further information about this threat, don’t hesitate to contact us.\n\nPalo Alto Networks customers are protected from this malware. Our threat prevention\nplatform with WildFire identifies this malware as malicious. AutoFocus customers can\n[investigate this activity with the tag AcidBox.](https://autofocus.paloaltonetworks.com/#/tag/Unit42.AcidBox)\n\nWe would like to thank Dr.Web, Kaspersky, ESET and [hFireF0X for their collaboration.](https://twitter.com/hfiref0x)\n\n**IOCs**\n\n**Files in Windows system32 directory**\n\nmsv1_1.dll\n\npku.dll\n\nwindigest.dll\n\n**Mutexes**\n\nGlobal\\BFE_Event_{xxxxxxxxxxxx--xxxx-xxxxxxxx-xxxxxxxx}\n\nGlobal\\{xxxxxxxxxxxx--xxxx-xxxxxxxx-xxxxxxxx}\n\nThe malware takes the MachineGuid stored in the registry and reshuffles the single\ncharacters alternating from the end to the beginning and vice versa in steps of two. For\nexample, the MachineGuid string a9982d3e-c859-4702-c761-df7eea468ade gets transferred\ninto e9a86daeecf5--67c2-07419d87-e34289da and appended to the above templates.\n\n**Windows Registry**\n\nHKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Class\\{4D36E97D-E32511CE-BFC1-08002BE10318}\\0003\\DriverData (REG_BINARY type)\n\nHKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Class\\{4D36E96A-E325-11CEBFC1-08002BE10318}\\0000\\DriverData (REG_BINARY type)\n\nHKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Class\\{4D36E969-E325-11CEBFC1-08002BE10318}\\0000\\DriverData (REG_BINARY type)\n\n**Sample Hashes**\n\nMain worker DLL:\n\neb30a1822bd6f503f8151cb04bfd315a62fa67dbfe1f573e6fcfd74636ecedd5\n\nKernelmode driver:\n\n\n-----\n\n3ef071e0327e7014dd374d96bed023e6c434df6f98cce88a1e7335a667f6749d\n\nSSP DLL modules:\n\n003669761229d3e1db0f5a5b333ef62b3dffcc8e27c821ce9018362e0a2df7e9\n\nb3166c417d49e94f3d9eab9b1e8ab853b58ba59f734f774b5de75ee631a9b66d\n\n3ad20ca49a979e5ea4a5e154962e7caff17e4ca4f00bec7f3ab89275fcc8f58c\n\nBenign VirtualBox VBoxDrv.sys driver v2.2.0 (signed by “Sun Microsystems, Inc.”):\n\n78827fa00ea48d96ac9af8d1c1e317d02ce11793e7f7f6e4c7aac7b5d7dd490f\n\n**Get updates from**\n**Palo Alto**\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-17 - AcidBox- Rare Malware Repurposing Turla Group Exploit Targeted Russian Organizations.pdf"
    ],
    "report_names": [
        "2020-06-17 - AcidBox- Rare Malware Repurposing Turla Group Exploit Targeted Russian Organizations.pdf"
    ],
    "threat_actors": [
        {
            "id": "a0d369c1-f0b7-4c70-a3a5-77aabbd17979",
            "created_at": "2022-10-25T15:50:23.311311Z",
            "updated_at": "2025-03-27T02:00:55.438117Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "MITRE:Strider",
            "tools": [
                "Remsec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "99845f58-2c39-46f7-8369-bb621ebb7002",
            "created_at": "2022-10-25T16:07:24.238844Z",
            "updated_at": "2025-03-27T02:02:10.14785Z",
            "deleted_at": null,
            "main_name": "Strider",
            "aliases": [
                "ProjectSauron"
            ],
            "source_name": "ETDA:Strider",
            "tools": [
                "Backdoor.Remsec",
                "ProjectSauron",
                "Remsec"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c1ac2a5e-0225-47a4-8ac5-5fa898c96bde",
            "created_at": "2023-01-06T13:46:38.472883Z",
            "updated_at": "2025-03-27T02:00:02.84253Z",
            "deleted_at": null,
            "main_name": "ProjectSauron",
            "aliases": [
                "Sauron",
                "Project Sauron",
                "G0041"
            ],
            "source_name": "MISPGALAXY:ProjectSauron",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536117,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653760883,
    "ts_modification_date": 1653760883,
    "files": {
        "pdf": "https://archive.orkl.eu/28095117d1856d17cde35cfbe554437bdbaac785.pdf",
        "text": "https://archive.orkl.eu/28095117d1856d17cde35cfbe554437bdbaac785.txt",
        "img": "https://archive.orkl.eu/28095117d1856d17cde35cfbe554437bdbaac785.jpg"
    }
}