{
    "id": "b0fb1f61-cb06-4bd0-bb63-3f913b419a46",
    "created_at": "2023-01-12T15:10:03.203206Z",
    "updated_at": "2025-03-27T02:05:46.601595Z",
    "deleted_at": null,
    "sha1_hash": "a0cd59507e51e8832991ff2039e1e89fad39622d",
    "title": "2020-12-21 - How SunBurst malware does defense evasion",
    "authors": "",
    "file_creation_date": "2022-05-28T18:10:09Z",
    "file_modification_date": "2022-05-28T18:10:09Z",
    "file_size": 1290256,
    "plain_text": "# How SunBurst malware does defense evasion\n\n**[news.sophos.com/en-us/2020/12/21/how-sunburst-malware-does-defense-evasion/](https://news.sophos.com/en-us/2020/12/21/how-sunburst-malware-does-defense-evasion/)**\n\nSophosLabs Threat Research December 21, 2020\n\nIn an effort that has been attributed by many to actors working for or on behalf of a national\ngovernment, an unknown adversary compromised the software supply chain of the\nenterprise IT management firm SolarWinds in order to distribute malicious code.\n\nThe success of that attack, dubbed Sunburst, gave the actors wide-ranging access to\ncorporate and governmental information systems, and already has resulted in as-yet\nuncalculated volumes of data theft and concerns the attackers have used the foothold to\ninsert other backdoors into enterprise networks yet to be discovered.\n\nBecause of the magnitude of the impact of Sunburst, there have already been many reports\ncovering the attack details. We chose to focus on a specific part of the attack of particular\ninterest to us: the techniques used by the attacker related to sensing and evading defenses.\nThis report provides a walkthrough of the code used by the Sunburst attack that is intended\nhelp other researchers, defenders and IT specialists to better understand that portion of the\nattack chain.\n\nBased on our analysis, Sunburst used a compromised software component to use\nSolarWinds’ Orion to detect and in some cases attempt to disable defensive software\nrunning on targeted systems. If any of an extensive list of processes was found to be\nrunning, the component shut down completely until called again. If none of those processes\nwere found, it checked against a list of services—terminating if some were found, and\nattempting to disable others. And a similar automated check was made for drivers associated\nwith security products, also resulting in the program shutting down.\n\n\n-----\n\nSunburst also uses a custom DGA algorithm for its initial command and control (C2). The\nattackers use the DNS response for the DGA lookup to control backdoor activity, including\nterminating it (essentially a killswitch).\n\n## “Upgraded” code\n\nSophosLabs analyzed a specific component of the malicious modification of SolarWinds’\nsoftware: a dynamic link library named SolarWinds.Orion.Core.BusinessLayer.dll. This DLL\nwas created by modifying the code of a legitimate component of SolarWinds Orion, and is\nactivated by code patched into another Orion component, InventoryManager:\n\nCode injected into InventoryManager.cs which initiates the Sunburst backdoor.\nThis code creates a new thread which runs the Sunburst backdoor code, the entry point\nbeing the Initialize() function.\n\n\n-----\n\nThe entry point of the Sunburst backdoor, the Initialize() function.\nExecution only proceeds if the DLL is running within a process of name\nsolarwinds.businesslayerhost.exe.\n\nCuriously, further digging by the security community has identified other versions of the DLL,\nthat have been injected with just short skeleton code, not the complete backdoor. This is\nprobably indicative of the attackers performing some kind of testing prior to delivering the full\nattack.\n\nLooking through the Sunburst code, two subtle tricks are immediately obvious:\n\n1. String obfuscation. Interesting strings (Registry keys, filenames etc) are mildly\n\nobfuscated using a combination of compression and Base64. This is presumably to\nmake it less likely the modified source code would be spotted.\n2. Certain process filenames are not directly referenced in the code. Instead, hashes of\n\nprocess names are used. This is to make analysis more cumbersome.\n\nIn order to evade targets’ defenses, the Sunburst DLL checks for a hard-coded list of\nprocesses, services and drivers. As noted above, the names of the processes and services\nSunburst looks for are checked against pre-calculated hashes of their names, making it\nmuch more difficult to analyze the code’s intent.\n\n\n-----\n\nThe start of the long list of hashes used in Sunburst process checks.\n\n## Flipping the switch\n\nSunburst checks against the environment it is running in via the\n**ProcessTracker.TrackProcesses() function. This function is called from three places, two of**\nthem in the main flow of the backdoor’s execution:\n\n**UpdateNotification(), called prior to entering main execution loop**\n**Update(), within the main execution loop**\n\n\n-----\n\nThe code for the UpdateNotification() function in Sunburst.\nThe UpdateNotification() function also resolves the api.solarwinds.com hostname. If an\ninternal IP address is returned, execution is termination. This illustrates the care taken by the\nattackers to avoid the backdoor running within networks belonging to SolarWinds.\n\nThere is an additional call to TrackProcesses() within the main loop of Update(), which\nbreaks out of the main loop if a hit is found.\n\nIn either case, if a process is detected by the malware, Sunburst execution stops until next\ntime the malicious DLL is loaded (when the application is next run).\n\n## Three steps of evasion\n\nThe TrackProcesses() function consists of three steps: checking processes\n(SearchAssemblies()), checking services (SearchServices()), and checking drivers\n(SearchConfigurations()):\n\n\n-----\n\nTrackProcesses() function, used to check processes, servers and installed drivers.\n\nThe function first calls SearchAssemblies(), passing a simple, flat list containing hardcoded\nhashes of 137 process names. The extraction of the reversed names is still in progress.\nThese processes include executables tied to security products (including Tanium and AVG\nantivirus software), as well as packet capture, forensic and malware analysis tools, including\n:\n\nWireshark\nVirtualBox\nRetDec decompiler\nProcess Hacker\nRegistry Monitor\nPE Explorer\n\nA longer partial list of matched hashes is posted in the IOC file for this report on\n[SophosLabs’ GitHub page.](https://github.com/sophoslabs/IoCs/blob/master/Sunburst_blocklists.csv)\n\n\n-----\n\nThe hashes are checked against the hashes of the lower-cased names of processes.If\n**SearchAssemblies() does not find a process name match, the TrackProcesses() function**\ncalls SearchServices().\n\n**SearchServices() compares running services against a short list of hardcoded services,**\nagain using pre-calcuated hashes for the corresponding process filenames and Registry\nservice subkeys.\n\nThe code for the UpdateNotification() function in Sunburst\n\n\n-----\n\nTrackProcesses() function, used to check processes, servers and installed drivers.\nSearchServices() compares running services against a short list of hardcoded services,\nagain using pre-calcuated hashes for the corresponding process filenames and Registry\nservice subkeys.\n\nThe first two entries in the service list, corresponding to Windows Defender and Windows\n\n\n-----\n\nDefender ATP services.\nThe Sunburst code attempts to disable certain services in the list, modifying the “Start” value\nin the service Registry configuration.\n\nProduct Service names\n\n\nWindows\nDefender\n\nWindows\nDefender\nAdvanced\nThreat\nProtection\n\n\nmsmpeng\n\nmssense\n\n\nAvast avastsvc\n\n\nCarbon\nBlack\n\n\ncavp,cb\n\n\nCrowdstrike csfalconservice,csfalconcontainer\n\nFireEye xagt\n\nEset ekrn,egui,ekrnepfw\n\nF-Secure fsgk32,fsma32,fssm32,fnrb32,fsaua,fsorsp,fsav32,fsdevcon,fsgk32st,fswebuid\n\nIf any service is disabled in this process, ConfigManager.WriteServiceStatus() is called,\nwhich writes packed data into an application settings file (\nSolarWinds.Orion.Core.BusinessLayer.dll.config), storing the matched service entry. For\nexample:…<add key=”ReportWatcherPostpone” value=”255″/>…If no services are detected\nor disabled, and SearchAssemblies() found no processes from the blacklist,\nSearchConfigurations() is called—which checks installed drivers against 17 pre-calculated\nhashes.\n\nThe function retrieves driver filenames using WMI “Select * From Win32_SystemDriver,”\ngrabbing lowercased filename for each driver and generates hash for checking against the\nlist. If any of the targeted drivers are selected, the backdoor terminates. The list includes\ndrivers for Cyberark Endpoint Privilege Manager, the Symantec Management Agent, and\nSentinel Agent; a full list of the driver filenames and hashes is available in the IOCs file on\n[SophosLabs’ Github.](https://github.com/sophoslabs/IoCs/blob/master/Sunburst_blocklists.csv)\n\nWe did not find hashes matching any Sophos product.\n\n## Remote kill\n\n\n-----\n\nAssuming all the process, service and driver checks pass, Sunburst will proceed to the main\nexecution loop. It uses a DGA to generate a hostname (sub-domain of avsvmcloud[.]com, in\nwhich the victim hostname is encoded).The IP returned in the DNS response for the\ngenerated hostname is then checked against a list – this is used to control backdoor\n[execution flow. (Other researchers have delved into the DGA in detail.)](http://blog.eckelberry.com/)\n\nFor example, addresses within the private subnet ranges will terminate backdoor execution.\nIn this case, the status is set to “Truncate” (3), and this is written to the application settings\nfile mentioned above, specifically the ReportWatcherRetry field:\n```\n<add key=\"ReportWatcherRetry\" value=\"3\"/>\n\n```\nSaving the status here ensures the backdoor will not execute in the future. This value is\nchecked within the Initialize() function.\n\n## Conclusions\n\nThe selectivity of the execution of Sunburst, and the method it takes to disable defenses in\nthe least aggressive manner possible, are indicative of a cautious actor seeking to trip as few\nalarms as possible in their intrusion.\n\nDefenders need to be on guard for future efforts to evade targeted defenses in this manner,\nthrough close monitoring of accounts, unusual activity, and human threat hunting, as well as\nworking with vendors to find more robust ways to ensure the security of the supply chain of\ntheir critical software. But they should not do this at the expense of watching for more\n‘normal’ attacks, including the ongoing ransomware campaigns that show no sign of slowing\ndown.\n\n**SophosLabs would like to acknowledge the contributions of Fraser Howard, Szabolcs**\n**Lévai, Andrew O’Donnell, Gabor Szappanos, Jagadeesh Chandraiah, Amol Soley,**\n**Richard Cohen and Michael Wood to this report.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-12-21 - How SunBurst malware does defense evasion.pdf"
    ],
    "report_names": [
        "2020-12-21 - How SunBurst malware does defense evasion.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536203,
    "ts_updated_at": 1743041146,
    "ts_creation_date": 1653761409,
    "ts_modification_date": 1653761409,
    "files": {
        "pdf": "https://archive.orkl.eu/a0cd59507e51e8832991ff2039e1e89fad39622d.pdf",
        "text": "https://archive.orkl.eu/a0cd59507e51e8832991ff2039e1e89fad39622d.txt",
        "img": "https://archive.orkl.eu/a0cd59507e51e8832991ff2039e1e89fad39622d.jpg"
    }
}