{
    "id": "b11742d5-d9d0-4a4e-b673-4d195aec3ed7",
    "created_at": "2022-10-25T16:48:24.283831Z",
    "updated_at": "2025-03-27T02:14:32.852417Z",
    "deleted_at": null,
    "sha1_hash": "523ae1be152df2a4d1de51ee2b3e7f23cad62628",
    "title": "Rocket Kitten: A Campaign With 9 Lives",
    "authors": "Checkpoint",
    "file_creation_date": "2015-11-09T11:25:21Z",
    "file_modification_date": "2015-11-09T11:25:38Z",
    "file_size": 11088279,
    "plain_text": "# ROCKET KITTEN:\n A CAMPAIGN WITH 9 LIVES\n\n#### THRE AT INTELLIGENCE AND RESE ARCH\n\n**CHECK POINT SOFTWARE TECHNOLOGIES**\n\n\n-----\n\n### TABLE OF CONTENTS\n\nEXECUTIVE SUMMARY........................................................................................03\n\nINVESTIGATION TIMELINE REVIEW....................................................................04\n\nROCKET KITTEN TOOLS & INFRASTRUCTURE..................................................09\n\nGEFILTE PHISH—BEST SERVED COLD...............................................................11\n\nWOOLGERED—HOISTED BY THEIR OWN PETARD.............................................18\n\nREELED IN—PHISHING LOGS ANALYSIS...........................................................25\n\nEPILOGUE............................................................................................................27\n\nAPPENDIX A—INDICATORS OF COMPROMISE...................................................28\n\nAPPENDIX B—MPK TECHNICAL DESCRIPTION................................................33\n\n\n-----\n\n## EXECUTIVE SUMMARY\n\n###### Since early 2014, an attacker group of Iranian origin has been actively targeting persons of interest by means of malware infection, supported by persistent spear phishing\n campaigns. This cyber-espionage group was dubbed ‘Rocket Kitten,’ and remains active as of this writing, with reported attacks as recent as October 2015.\n\n The Rocket Kitten group and its attacks have been analyzed on numerous occasions by several vendors and security professionals, resulting in various reports describing the group’s method of operation, tools and techniques.\n\n Characterized by relatively unsophisticated technical merit and extensive use of spear phishing, the group targeted individuals and organizations in the Middle East (including targets inside Iran itself), as well as across Europe and in the United States. Many of these targets were successfully compromised by various pieces of custom-written malware; and despite identification and flagging of their infrastructure, the attackers have struck again-and-again by making minor changes to their tools or phishing domains.\n\n Check Point has obtained a complete target listing from the attackers’ servers; among confirmed victims are high ranking defense officials, embassies of various target countries, notable Iran researchers, human rights activists, media and journalists,\n academic institutions and various scholars, including scientists in the fields of physics and nuclear sciences.\n\n This report provides a summary of the findings including:\n\n • New evidence obtained during Check Point’s independent investigation into attacker infrastructure, including previously unpublished malware indicators.\n\n • Information that appears to reveal the full extent of operations over the past year, and provides unique insight into target profiles and attacker operation internals.\n\n • Analysis of attack data to reveal details on victims and specific industries that may have special significance to Iranian political and military interests.\n\n • Analysis of attacker mistakes that appear to reveal the true identity of the main devel­ oper behind the group’s activities (a.k.a. “Wool3n.H4T”), detailed for the first time.\n\n It is our hope this report and measures taken over the past few weeks lead to an effective shutdown of attacker operations (current generation of tools and infrastructure). While Check Point customers are protected against all known variants of this threat, we urge fellow security vendors and malware research professionals to extend malicious IoC (Indicators-of-Compromise) coverage in current protection infrastructure.\n\n\n-----\n\n##### INVESTIGATION TIMELINE REVIEW\n\n[If you are familiar with previous publications and interested in Check Point’s new insights, you may skip this section.]\n\nThe Rocket Kitten campaign/actor group has been studied and analyzed on multiple occasions by different vendors, threat intelligence\ngroups and individual researchers. In a repeating challenge in the malware research domain, we have seen different reports introduce\na myriad of code names and operation names for what may very well be the same campaign/actors.\n\nIn contrast to malware naming schemes, all reports are in unanimous agreement with strong indications of the campaign’s Iranian\norigin. This thesis is supported by the individuals and verticals targeted, as part of a plethora of circumstantial and direct evidence.\nWhile we should keep in mind digital evidence can be forged and tailored to falsely masquerade as any attacker to deceive a forensic\nanalyst, the overwhelming amount of independent evidence collected over years of attack activity render the notion of a false campaign\nextremely improbable.\n\nDespite all the reporting and sharing of malicious indicators, Check Point has detected continued active attacks using the same\nmethods and infrastructure. These findings were confirmed by other security vendors, as well as Check Point’s research partners.\n\nIt seems as if the attackers, unsophisticated as they are, are completely undeterred by the western security industry’s revelations\nand publications. Often with the simple replacement of a domain name and minor updates to their malware tools, they continue to\ncarry out their operation undisturbed.\n\nLet us try to review and briefly summarize points of interest from the publications so far.\n\n**May** **Dec.** **June** **Sept.**\n**2014** **2014** **2015** **2015**\n\nGadi Evron & Trend Micro, Inc.\n\niSIGHT Partners ClearSky\n\nTillmann Werner &\n\nClearSky\n\nNewscaster – An Rocket Kitten: Advanced Thamar Reservoir: An The Spy Kittens Are\nIranian Threat Off-the-Shelf Targeted Iranian Cyber-Attack Back: Rocket Kitten 2[8]\nInside Social Attacks Against Nation Campaign Against\nMedia[2] States[4] Targets in the Middle\n\nEast[6]\n\nOperation Saffron Gholee – a “Protective Operation Woolen- London Calling:\nRose[1] Edge”-Themed Spear Goldfish[5] Two-Factor Authentication\n\nPhishing Campaign[3] Phishing From Iran[7]\n\n**May** **Sept.** **March** **Aug.**\n**2014** **2014** **2015** **2015**\n\nFireEye ClearSky Trend Micro, Inc. The Citizen Lab\n\n1 https://www.fireeye.com/content/dam/fireeye-www/global/en/current-threats/pdfs/rpt-operation-saffron-rose.pdf\n2 http://www.isightpartners.com/2014/05/newscaster-iranian-threat-inside-social-media/\n3 http://www.clearskysec.com/gholee-a-protective-edge-themed-spear-phishing-campaign/\n4 https://www.youtube.com/watch?v=WIhKovlHDJ0\n5 https://www.trendmicro.com/cloud-content/us/pdfs/security-intelligence/white-papers/wp-operation-woolen-goldfish.pdf\n6 http://www.clearskysec.com/wp-content/uploads/2015/06/Thamar-Reservoir-public1.pdf\n7 https://citizenlab.org/2015/08/iran_two_factor_phishing/\n8 http://documents.trendmicro.com/assets/wp/wp-the-spy-kittens-are-back.pdf\n\n\n**May**\n**2014**\n\niSIGHT Partners\n\n\n**June**\n**2015**\n\nClearSky\n\n\n**March**\n**2015**\n\nTrend Micro, Inc.\n\n\n**May**\n**2014**\n\nFireEye\n\n\n-----\n\nThe May 2014 ‘Operation Saffron Rose’ publication identifies an Iranian hacking group formerly named ‘Ajax Security’ (code-named\n‘Flying Kitten’ by CrowdStrike) engaged in active spear phishing attacks on Iranian dissidents (those attempting to circumvent\ngovernment traffic monitoring). This group is potentially linked to more recent Rocket Kitten attacks (different tools, yet very similar\nmode of operation and phishing domain naming scheme). No concrete evidence of such link has been presented yet.\n\nNewscaster by iSight Partners was released the same month, to detail similar efforts of persistent spear phishing backed by false\nsocial media identities pertaining to be journalists of the fake news web site ‘newsonair.org.’ iSight, who reportedly cooperated\nwith the FBI, provides a clear Iranian attribution to these efforts. The report specifies the attackers targeted policymakers, senior\nmilitary personnel and defense industry organizations in the US, UK and Israel. We did not find direct evidence linking this activity\nto Rocket Kitten.\n\nClearSky’s September 2014 blog post first described active attacks using a piece of malware they dubbed ‘Gholee’ (as appears in a\nmalicious payload export function, potentially named after a popular Iranian singer[9]). The researcher points to initial leads into\nother attacks and notes the threat is currently undetected by the overwhelming majority of AV products.\n\n_Image 1—the ‘gholee’ export name as noted by ClearSky._\n\nGadi & Tillman’s presentation at 31c3 (the 31st Chaos Communication Congress in Germany) was the first clear identification of the\nRocket Kitten attacker group, continuing the CrowdStrike naming scheme for Iranian attacker groups. The publication introduced\nthe involvement of hacker persona ‘Wool3n.H4t’ and other identities in forensic evidence obtained from the malicious documents.\n\n_Image 2—Forensic artifact in malicious document hinting to file creator as noted by Tillman Werner & Gadi Evron._\n\n\n-----\n\nThe researchers followed to describe two pieces of malware used by the attackers:\n\n- A deeper look into ClearSky’s ‘Gholee’ determined it is the ‘wrapper’ component of an off-the-shelf penetration testing tool\noriginally authored by Argentina-based Core Security. This legitimate PT tool, named ‘Core Impact,’ was illegally repurposed\nand used for malicious attacks by the Rocket Kitten group.\n\n- A .NET-based credential stealer that pilfers known certain credential storage locations in the infected computer and e-mails\nthem to ‘wool3n.h4t@gmail.com’. This tool appears to be named ‘FireMalv’ by the attackers.\n\nTrend Micro’s March 2015 publication reintroduces the ‘Gholee’ malware (as GHOLE) campaign, and describes ‘Operation Woolen\nGoldfish,’ as well as an additional ‘CWoolger’—an unsophisticated key-logger apparently named ‘woolger’ (likely a Portmanteau for\n_‘wool3n keylogger’) written in C++, and present evidence showing its existence starting 2011._\n\n```\nC:\\Users\\Wool3n.H4t\\Documents\\Visual Studio 2010\\Projects\\C-CPP\\CWoolger\\Release\\CWoolger.pdb\n\n```\n\nThe researchers continue to point at the very likely attribution to the Wool3n.H4T identity as the malware author, whose only online\nreference was found in an Iranian blogging platform.\n\n_Image 4—wool3nh4t.blog.ir as pointed to by Trend Micro researchers_\n\nIn this publication, Trend Micro researchers document Rocket Kitten’s minor update to the Gholee malware (the ‘gholee’ function\nwas renamed to ‘function’), supposedly to avoid the Yara signature published by ClearSky and document the existence of Gholee\nmalware samples dating March 2011, as further evidence for historic attacker activity.\n\nClearSky continued their investigations into the group’s activities and in June 2015 published a paper dubbing the attack campaign\n‘Thamar Reservoir’ named after Dr. Thamar E. Gindin, herself a Rocket Kitten target. ClearSky researchers notably mention\nthe breach of an Israeli academic institution to serve as a hosting service for the phishing web site, and follow to present an OPSEC\n(operational security) failure by the attackers that allowed ClearSky to learn of a detailed (partial) target list.\n\n\n-----\n\nMorocco\n\n1%\n\n\nSyria\n1%\n\n\nJordan\n1%\n\n\nAfghanistan\n3%\n\nUnited Kingdom\n3%\n\nIraq\n3%\n\nSaudi Arabia\n\nVenezuela 44%\n8%\n\nYemen\n11%\n\nIsrael\n14%\n\n_Image 5—Partial target country distribution as visible on the phishing server logs exposed by ClearSky_\n\nThis list was analyzed to confirm a strong alignment with nation-state political interests, with specific victims known as adversarial\nor of intelligence value to Iran. ClearSky also reference an inadvertent public confirmation for the Iranian attribution by the US\nDepartment of Treasury in a memo which briefly appeared online, before being deleted.\n\nClearSky provided many examples of personalized phishing e-mails and communication, including phone calls to victims luring\nthem to open these attachments, demonstrating the group’s persistency and breadth of operations.\n\n_Image 6 – Custom- tailored phishing page as presented by ClearSky_\n\n\n-----\n\nThe same phishing phone calling scheme was detailed in an August 2015 report by Citizen Lab, describing attempts to lure victims\nto provide their two-factor authentication tokens. In these attempts, victims receive tailored calls from a person who has clearly\nresearched them, prompting them to take action on received e-mails. Among targeted victims Citizen Lab mention EFF’s Director for\nInternational Freedom of Speech Jillian York. The Citizen Lab report describes overlapping phishing domains with ones previously\nreported, confirming a link with Rocket Kitten.\n\n_Image 7—Google password reset phishing page as presented by Citizen Lab_\n\nInterestingly, a special update to the Citizen Lab publication was added to include a response from a news outlet reported to be in\nclose connection with Iranian intelligence, following allegations by exiled Iranian journalist Omid Memarian attributing these attacks\nto Iranian Revolutionary Guards[10] with ‘no doubt.’ The response mocks the ‘Western Media fishing in muddy waters’ and describe the\nallegations as ‘weird.’\n\nThe latest paper from Trend Micro and ClearSky (dated September 2015) goes a great length to detail the group’s profile and mode of\noperations so far, and introduces a few more attack incidents, as well as a new ‘downloader’ piece of malware.\n\n10 A branch of the Iranian armed forces sworn to protect the country’s Islamic system and prevent ‘foreign interference’\n\n\n-----\n\n##### ROCKET KITTEN TOOLS & INFRASTRUCTURE\n\nThe Rocket Kitten attacker group’s main attack vector is spear-phishing. An effective phishing campaign requires nothing more than\na tailored phishing page, hosted on a cheaply-available web server. As described in previous publications, the Rocket Kitten attackers\nmake extensive use of various phishing schemes, often including back-and-forth e-mail correspondence with the victims, or even\nphone calls to establish legitimacy and reason to open the malicious attachment.\n\nActual malicious attachments detected in this campaign varied between a set of custom-written malware pieces, or ‘downloader’\ncomponents that, in turn, fetch the malware from a remote server and execute in on the victim machine.\n\nAdditionally, we have witnessed many attacks using various ‘web hacking’ tools and suites, in attempt to break into victim web sites.\n\nPreviously reported custom-malware included:\n\n**•** **CWoolger—a C++ based ‘woolen key-logger.’ The malware records all keystrokes and sends out key-log data to a hard-coded**\nFTP server.\n\n**•** **Wrapper/Gholee—repurposed Core Impact penetration testing tool. The malware allows a platform for remote access,**\npivoting for lateral movement and further malware installation.\n\n**•** **FireMalv—a .NET based Firefox credential stealer. This tool copies passwords stored in the Firefox browser storage.**\n\nCheck Point investigations additionally discovered the attackers using the following:\n\n**•** **.NETWoolger—a .NET based ‘woolen key-logger.’ This malware is functionally similar to CWoolger. The attackers seem to use**\nthem interchangeably, as alternate infection mechanisms (in case one is detected at the victim computer).\n\n**•** **MPK—a custom RAT of wider functionality. The malware allows key-logging, as well as remote command execution, screenshot**\ngrabbing and traffic monitoring. For a detailed technical description of the MPK malware see Appendix B.\n\nIn addition to custom-written malware, we have seen the attackers use various hacking and scanning tools to attack victim\nweb-sites.\n\n**•** **Metasploit—An open-source, extensible penetration testing platform. Metasploit’s ‘meterpreter’ payload was wrapped in**\nan executable file and distributed as a RAT attached to phishing emails by the attackers.\n\n**•** **Havij & SQLMap—SQL injection tools; Havij originates in Iranian development, while SQLMap is an open source project.**\n\n**•** **Acunetix & Netsparker—off-the-shelf web vulnerability scanners, attempting to automatically discover and exploit**\nvulnerabilities in common web platforms.\n\n**•** **WSO Web Shell—a well-known web shell - PHP script that allows backdoor access on a hacked server. Typically deployed**\nafter successful compromise to allow further actions.\n\n**•** **NIM-Shell—a web shell of Iranian hacker group origin with similar functionality. Additionally uses Perl scripts on the hacked**\nserver.\n\nWeb hacking attempts were detected to originate from various IP ranges, occasionally immediately adjacent to known Rocket Kitten\nC&C servers. We can estimate the attack operators either used these servers directly, or configured them as Proxy/VPN endpoints\nto channel their attacks.\n\nCombining the research work done so far with observed attacks by Check Point, we can map out a diagram overviewing the\nattacker’s infrastructure.\n\n\n-----\n\n[107.6.181.96-127]\n\n[107.6.172.50-62]\n\n[107.6.154.224-231]\n\n\n107.6.181.100\n107.6.172.52\n107.6.154.230\n\n\n\n[107.6.181.96-127] 107.6.181.100\n\n[107.6.172.50-62] 107.6.172.52\n\n107.6.154.230\n\n[107.6.154.224-231]\n\nMail\n\n###### Woolger FTP 107.6.172.53\n\n107.6.181.116 107.6.172.54\n\nMPK C&C\n107.6.172.55\n\nPhishing\n\n107.6.181.114\n\n107.6.172.51\n\n31.192.105.10\n\n5.39.223.227\n\n:8900/8899/\n\n:21 :21 8987/9090/\n:21 1993\n\n###### VICTIMS\n\n\n###### GERMAN SATELLITE\n_BusinessCom_ _IABG_\n\n[5.145.151.1-7] [84.11.146.52-63]\n\nOperators/\nWoolger FTP\nVPN\n5.145.151.6 84.11.146.61\n\nWrapper/\nGholee C&C\n\n84.11.146.55 84.11.146.62\n\n###### UK\n\n\n###### SAUDI ARABIA\n\n_Cyberia_\n\nOperators/VPN\n212.118.118.100\n\n\n\n- We have no reason to believe any of the mentioned providers are related to the malicious activity. The campaign operators likely\nmasqueraded as a legitimate customer or hacked into the servers without the knowledge of the service provider.\n\n- Specified ranges are likely to be assigned in whole for the attackers use. Due to the dynamic nature of IP assignment, these\nmay expire after the release of this report.\n\n- Because of the way satellite communications work, the infrastructure geo-located to Germany may not be physically located\nin that country It would be an educated speculation to assume the servers are physically located in Iran This assumption is\n\n\n:21 8987/9090/\n:21 1993\n\n###### VICTIMS\n\nMPK :80/\n\n443\n\nC/.NET\nWoolger\n\nWSO\n\nWrapper/\nGholee\n\nNIM-Shell\n\n###### SAUDI ARABIA\n\n_Cyberia_\n\n\n###### USA\n\n_ColoUp_ _Global Layer BV_\n\nOperators/VPN\n162.223.90.148\n\n162.223.91.226\n162.222.194.51\n\n\n-----\n\n##### GEFILTE PHISH—BEST SERVED COLD\n\nAfter learning of an active attack incident from the Rocket Kitten group on a customer network, Check Point researchers decided to\nactively join the investigation. While the recent paper from Trend Micro and ClearSky (‘The Spy Kittens Are Back: Rocket Kitten 2’)\ndoes extensively cover the campaign’s narrative, we aimed to seek confirmation that our analyzed attack was positively connected to\nthe same campaign and set out to provide additional value and insight.\n\nUpon learning of the attack, we attempted to communicate with the phishing web server and gather primary reconnaissance.\nWe learned the same IP address was used for multiple malicious domains. Noting the server on this IP address was alive and well,\nwe decided to probe and question that particular server’s purpose.\n\nWhat we found took us all by surprise.\n\nWe started our web probe by making scripted GET requests attempting to browse to well-known paths. A minute later, we were\nexcited to find a 200 OK response for a few requests, including /xampp and none other than /phpmyadmin(!).\n\nSuspecting false positive results by our scripts, we typed in /xampp into our browser and watched with awe:\n\n_Image 8—A default configuration of XAMPP—on a live attacker server!_\n\nWe curiously entered the direct path into our web browser and loaded the phpmyadmin interface.\n\nIt wasn’t until we actually submitted a query on the server, when we understood that phpmyadmin had been configured to allow\n**password-less root access to any browsing visitor.**\n\n“Such a gaping hole must be a decoy” we immediately thought. There is no way nation-state attackers would err in such amateur\nfashion, leaving their phishing server database exposed… would they?\n\n\n-----\n\nIf only they had paid attention to the ‘XAMPP Security’ page:\n\n_Image 9 –“The MySQL admin user root has NO password—UNSECURE”_\n\nHappily browsing through the free-for-all exposed database, we quickly noted numerous schemas; most of them were completely\nempty (for testing purposes?), with one specific schema standing out: ‘phakeddb’.\n\n_Image 10—phakeddb schema – note utf8_persian_ci collation for several tables_\n\n’phakeddb’ contained a set of very interesting tables and data sets; the kind of data sets that fuel the fantasies of malware campaign\nresearchers. Browsing these tables, we found the phishing web application, likely to be a custom development by the Rocket Kitten\nattackers. The web application would, upon operator instruction, generate the target-specific personalized phishing page for the\ntargeted service (Gmail, YouTube, Hotmail, etc…).\n\nAs we later learn, this platform was named ‘Oyun Management System’ by the attackers.\n\n\n-----\n\nLet us first look at the ‘users’ table:\n\n_Image 11—the ‘users’ table_\n\nThe attackers log in to the application, just like any other web platform, in order to set up their phishing campaigns. This server\nseems to have been deployed August 2014, when all users were created.\n\nAnd the hash type of passwd fields used? You may not be surprised to learn they used unsalted MD5 hashes.\n\nThat’s actually not the most oblivious malpractice in this system, however; the hash for the user named “super admin” (assigned with\nall possible permissions) is e10adc3949ba59abbe56e057f20f883e. Hobbyist cryptographers may recognize this string as the\nMD5 hash for “123456”.\n\nLooking at user names, we can spot some potentially Persian names or aliases such as merah, kaveh, ahzab or amirhosein. These\nwere potentially the campaign ‘operators’—tasked with social engineering and tailoring a phishing page per target. (hint: “123456”\nwas not the only trivially crackable password in this list)\n\nMoving on to the intriguing “conversation” table, this appears to be an experimental messaging feature between attackers.\nUnfortunately, it was rarely used.\n\n_Image 12—the ‘conversation’ table_\n\n\n-----\n\nMost messages include links to various phishing domain pages, perfectly correlating to reported attack pages, proving this database\nis indeed in direct correlation to the attacks.\n\nInterestingly enough, we can see user id 55 (correlating with the ‘attache’ username in the users table) making a request:\n\n```\nplease 20 subject for me.\ntank you\nattache\n\n```\n\nLater on, user id 60 (‘john’) pleas:\n\n```\nseyeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeedddddddddddddd\nddddddddd\nplease\nplease\nplease\nsupport me\nplease\nI need make a new project\nplease add 50 subject\ntank you so match\nfadaaaaaaaaaaaaaaaaaaaaat\nbos bos\n;0\n\n```\n\n_As 'boos' is Farsi for 'kiss', 'bos bos' might be considered the Persian version of 'xoxo'._\n\nWhat does that mean? What projects and subjects are this system’s users referring to?\n\nA glimpse into ‘requiretypes’ lays out a much clearer description for this system’s purpose:\n\n\n-----\n\nWe can see template codes for phishing pages, including the descriptive “Victim Full Name,” “Victim User Name” field values.\nIt seems that this application generates the custom phishing templates using these custom fields. Even more telling, we have\nexamples for each field, reintroducing us to our Wool3n.H4T friend (author of key-logger malware by the same group), repeatedly\nmentioned in this column. This introduces the reasonable possibility that Wool3n.H4T himself wrote this “phishing application”\nas a supporting tool for the campaign.\n\nThere is an intriguing ‘supervisor@ybsoft.com’ reference, too, but ybsoft.com is currently registered to a Chinese electronics shop,\nso no luck in that direction.\n\nThe real jackpot, however, is still ahead.\n\nWhen we opened the ‘projects’ table, we momentarily lost our breath. A ‘project’ is apparently a single victim (target e-mail address),\nassigned with a ‘proj_id’, a tasked operator, and the specific link that was generated to be sent to this victim. We just hit 1842 records\nincluding all victims attacked starting August 2014 and all the way to August 2015 (when this database was accessed).\n\n_Image 14—the ‘projects’ table_\n\nNot only do we have the e-mail addresses of all victims, we also have the template values for their respective phishing pages\n(in the ‘projectmailrequirevalues’ table)!. For example a ‘Google Sign-In’ page normally displays the full name of the victim,\nas well as a public avatar defined by the user. The attackers had to replicate this look and feel, and filled the database with full\nnames, addresses and photos for every targeted victim.\n\nWe verified and retrieved names and images of previously reported victims as expected.\n\n\n-----\n\n_Image 15 – the ‘projectmailrequirevalues’ table_\n\nBut what does ‘projectlogs’ contain?\n\nIs that what we think it is?\n\n_Image 16 —log of every access to any phishing page on that server_\n\nThis table contained a log entry for every access to any phishing page, including the credentials provided by the victims, if successfully\nfooled. We can now use this data to gather insightful analytics on spear phishing activity over one year spanning August 2014 to August\n2015. Please see the attack log analysis section in this report.\n\nContinuing our server probe, we discovered a similarly exposed ‘Webalizer’ interface, providing useful analytics including counters\nand frequently accessed links.\n\n\n-----\n\n_Image 17—Webalizer statistics for August 2015_\n\nThe Webalizer interface neatly presented us with a lot of useful metadata, including “Top 40 visitor IPs”—clearly identifying attacker\naccess to the site, and providing us with many leads for the remainder of the investigation. Interestingly enough, we also found some\nreferrer headers, leading to a path on the same server:\n\n_Image 18—login screen_\n\n\n-----\n\nIn what can be described as a ‘hacker secret access’ portal—we seem to have reached the web interface of the phishing platform.\nTesting the ‘admin’ credentials we previously “cracked”—we get:\n\n_Image 19—the “Oyun Mangement System (OMS)” [sic]_\n\nWe now learn the attackers name this system “Oyun” and actually used Larry Page’s public profile picture as admin’s avatar.\nThe remainder of the interface simply allows access to the phakeddb database, including insertion, editing of “projects” (/targets)\nand even the internal chat platform as evident in “conversations.”\n\n##### WOOLGERED—HOISTED BY THEIR OWN PETARD\n\nUsing credentials hard-coded into the woolen key-logger, we were able to retrieve numerous woolger DAT files (key-logs),\nas uploaded from victims around the world.\n\nAs apparent, the same hard-coded FTP credentials were, in fact, Administrator credentials on the C&C Windows server itself,\nwhich had the C$ and D$ NetBIOS/SMB administrative shares openly accessible from the WAN.\n\n_Image 20—if you didn’t want to allow researchers to have administrator access to your C&C server_\n\n_<captain_hindsight.png>_\n_you shouldn’t have hard-coded administrator credentials into your malware._\n\n\n-----\n\nAmong many logged keystroke files containing stolen data, we stumbled on an astonishing discovery: the Rocket Kitten attackers\nhad, in fact, infected their own workstations, apparently as ‘test-runs’ for woolger. The attackers failed to remove these files from\nthe C&C server, demonstrating, yet again, utter lack of OPSEC.\n\nOf peculiar interest to us were logs made by none other than ‘Wool3n.H4t’ himself:\n\n_Image 21—The test worked._\n\nWould you be surprised what followed in the same log file?\n\n_Image 22—The attacker testing his own tool._\n\nYes, we actually just witnessed Wool3n.H4T switching through his open windows, including a Microsoft Visual Studio live debugging\nsession of a project called… ‘CWoolger’\n\nIn another log, we observe the specific programming of loading of the ‘wsc.vbs’ script, as observed in the Trend Micro publication and\nothers. At this point, there should be no question—we are looking at the malware author’s development workstation.\n\n_Image 23—Mutexes and thread-safety should be the least of your worries._\n\n\n-----\n\nThe next log shows us the attacker wanted to test whether his tool would accurately capture credentials entered into a Firefox HTTP\nauthentication prompt, and thus he entered his own C&C server…\n\n_Image 24_\n\nAll of Wool3n.H4T’s retrieved logs were dated October 2014.\n\nThen, we spotted this log segment:\n\n_Image 25 –‘AOL Mail’ already narrowed it_\n\n\n-----\n\nRecorded under the Wool3n.H4T name, a user logs into AOL mail with username ‘yaserbalaghi.’\n\nCould it be the same ‘Yaser’ as noted in the recent Trend Micro and ClearSky paper? (‘D:\\Yaser Logers\\CWoolger’…) Could it explain\nthe Phakeddb reference to “ybsoft”? We don’t know at this point; we have to go deeper.\n\n‘yaserbalaghi@aol.com’ appears to give a technical answer in a long C++ thread in an Iranian programmers forum (“Barname Nevis”)\nin Iranian ‘Solar Hijri’ calendar year 1389 (2010-2011):\n\nThe same yaserbalaghi user made several posts, also linking to various programming instructional videos in the subjects of ASP.NET\nand AJAX, jQuery and SQL injections as instructed by him using screen capture software.\n\nCareful watching of the videos allowed us to learn a few interesting details. For starters, Yaser Balaghi is a Microsoft Visual Studio\n2010 user, with familiarity of several tools observed to be used during the ‘Rocket Kitten’ campaign.\n\n_Image 26—Screenshot taken from instructional video by Yaser Balaghi (Engineer Balaghi)_\n\n\n-----\n\n_Image 27—EngineerBalaghi host name_\n\nFurther inspecting the user names and host names evident in the screen captures, we noticed we were actually in possession\nof logged keystrokes from an \"infected computer” where the user name was “Engineer Balaghi,” strengthening our suspicions.\nHowever, we can’t be sure yet; Yaser Balaghi may be a common name or perhaps this is someone related to Wool3n.H4T or the\nattackers.\n\nA few minutes later, and we spotted this gem of an OPSEC mistake in the SQLi instructional video, which precisely provided the\nsmoking gun we were after:\n\n_Image 28—Watching an hour of Farsi SQL injection tutorial has its rewards_\n\n\n-----\n\nWool3n.H4t is caught red-handed. One of his many mistakes, he was now caught giving a public tutorial while logged in under his\nsecret alias, otherwise unlinked with his real identity. These videos were recorded February 2014, prior to the first clear Rocket Kitten\nattack wave mid-year.\n\nA quick glance on W00l3n.Hat’s desktop reveals a striking match with web hacking attack tools previously described in Rocket\nKitten’s arsenal.\n\n_Image 29—Havij, Acunetix, Netsparker, SQLMap, wamp, and oh—is that IDA properly licensed?_\n\nA few online queries later, we are getting numerous results, cross-referenced to verify as the same Yaser Balaghi, now the main\nsuspect to hold the Wool3n.H4T identity.\n\nEngineer Yaser Balaghi is not only an active member of various programming forums—he had a web site (www.eng-balaghi.com,\ngone offline since August 2014, still available in the Wayback Machine). In the available archived version of the site he described\nhimself as a “programmer, analyst, consultant and lecturer,” and made himself available for hire.\n\n_Image 30—Yaser Balaghi’s stackoverflow account_\n\n\n-----\n\nIf all that wasn’t enough, we also managed to retrieve an updated resume for Tehran-based Engineer Balaghi:\n\n_Image 31 – Yaser Balaghi’s Resume (2013)_\n\nIslamic Azad University Computer Software Graduate Balaghi lists his job experience, including “Technical Director and Team\nLeader of Software Development Team (Private)” (highlighted in original), as well as “Head of Security and Hacking (legal and ethical)\n(Private)”. Later, he goes as far as listing sample accomplishments and completed projects, including the development and system\ndesign for a “Phishing Attacks System” ordered by “a cyber-organization”.\n\n_Image 32 (original and translation)—we kid you not._\n\nWe could go on, but the main lesson of this section can be: if you don’t want people to know you created malware for the government,\ndon’t list it in your CV.\n\n\n-----\n\n##### REELED IN—PHISHING LOGS ANALYSIS\n\nAs reported so far, the attackers persistently e-mailed, called and responded with fake identities, tailored for each victim. The\nattackers clearly read the public reports about them, respond and adapt their tactics, occasionally showing a creative mindset.\n\nIn one reported case, the attacked posed under the true identity of a ClearSky researcher, referencing the recent Rocket Kitten\nreport, attaching “detection software” that does exactly the opposite. This an interesting tactic, worthy of mentioning in social\nengineering classes. It would be wise at this point to mention that the release of report does not include any accompanying\ndetection or protection tools other than the existing Check Point software blades. If you received this report with an attached\nexecutable, it is likely a malicious lure.\n\nIn another case, the attackers sent a malicious attachment using the identity of a previously known targeted victim. The Israeli\nrecipient of that attachment was wary enough to suspect the origin of the e-mail and responded with a query: “Is that you or are\nthe Iranians in your computer again?” To which the attackers responded (in perfect non-Google-Translate Hebrew): “The Iranians\nwill never return to my computer!”\n\nThat very well may have been the talk of the day at the Tehran operations center, possibly featured in an email printout in the main\ndining room.\n\nAs the Rocket Kitten group’s behavior was well characterized in previous publications (see the recent report from Trend Micro\nand ClearSky). We will focus on new insights based on our analysis of the ‘Oyun’ system victim database. We understand that this\ndatabase contains a partial view, starting August 2014 to August 2015. While the data can be successfully correlated with logs\ncollected from other servers, we have no visibility of e-mails with malicious attachments (as opposed to phishing links to steal\ncredentials), or any complete web hacking log for attacker activity.\n\nThe sheer volume of the target database suggests an extensive operation, the work of a group of people over months. The logs\nincluded the visiting IP address geo-located country. Our analysis shows the following distribution:\n\nOther Saudi Arabia\n18% 18%\n\nIreland\nUnited Arab Emirates 1%\n1%\n\nSatellite Provider\n2%\n\nAfghanistan\n2%\n\nGermany\n2% United States\n\n17%\n\nUnited Kingdom\n3%\n\nTurkey\n3% Georgia\n\n4%\n\nIsrael\n5% Iran Islamic Republic of\n\nNetherlands 16%\n8%\n\n_Chart 1—Phishing visitors’ country distribution_\n\nWe have studied the visitor data to determine this includes many attacker accesses to test the site functionality. We know the\nattackers used addresses from Iran, as well as VPN access from the US, Germany, Saudi Arabia and the Netherlands. The data\nmust be interpreted taking these facts into consideration.\n\n\n-----\n\nOur primary filtering dismissed around 25% of logs and 15% of projects as ‘test runs’ for the system. The following is based on the\nremaining seemingly valid entries.\n\nCharting the phishing logs over time, we can observe the following timeline:\n\n\nVisited Phishing Site\n\nEntered Credentials\n\n\n1592\n\n\n112\n\n\n124\n\n\n83\n\n\n69\n36\n\n\n51 75\n\n41\n27 33 28 31\n\n39 23 18 2 5 3 12 4 50 0 5\n\n|Col1|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Col12|Col13|\n|---|---|---|---|---|---|---|---|---|---|---|---|---|\n\n\n_Chart 2—Phishing logs and successes over time_\n\nWe can study this data to make a few interesting observations:\n\n\n\n- On average, all phishing pages on this server had 26% success in fooling victims to enter their credentials. These are\nsurprisingly high results, potentially attributed to persistency and well-targeted e-mails.\n\n- On May 26, 2015, there is a unique peak of access to the site, with minimal successes. When analyzed, these accesses appear\nmostly in 3 batches over periods of minutes, with incremental ‘project_ids’ and no data provided, from Israeli IP addresses.\nWe can safely discard these as researcher probes, attempting to ‘brute-force’ phishing pages, immediately preceding the\nClearSky June publication.\n\n- The attackers seem to have shut down their platform on June and July (likely due to the publication) and resumed operations\nduring August. We found evidence to suggest the database had been migrated from a previous server.\n\nSlicing the projects table by user_id allows a unique internal look on operator assignment; while our target analysis is far from\nconclusive, we can share a reserved primary assessment of what each user was tasked with:\n\n\n_admin_ _83 projects_ strictly system testing\n\n\nthis is one of the prominent users in the system, tasked with all around mixed targets—focused on Saudi Arabia, many human rights\n_anonymous_ _522 projects_\nactivists, CEOs and ministry officials.\n\nassigned with all Israeli targets, notably including known physics and nuclear scientists, former military officials, national security\n_merah_ _147 projects_\nand foreign policy researchers. This operator is probably a fluent Hebrew speaker.\n\n\n_kaveh_ _57 projects_ very little activity—mostly testing and some Venezuelan targets.\n\none of the two busiest operators, in 2014 he targeted a vast amount of Saudi scholars and persons of influence, and later listed\n_ahzab_ _691 projects_\neducation and media outlets in Saudi Arabia.\n\n\n_124 & attache_ _233 projects_\n\n\nthese users both showed clear targeting of defense sector victims, as well as embassies of Iran’s neighboring countries and\nothers. Quite fitting with one of their usernames, they listed several military attachés in their victim list. Notable targets include\nrepresentatives from the United Arab Emirates, NATO and other regional posts in Afghanistan as well as Thailand and Turkey.\n\n\nDuring late 2014 he was directly tasked with Venezuela trade and finance targets, later in 2015 he moved to former Iranians living\n_john_ _108 projects_\nabroad—listing professors, scientists, journalists and investors\n\nDespite our limited visibility, we can confirm many of these attacks were successful—the attackers gained confidential information\nfrom various targets all around the world\n\n\n-----\n\n##### EPILOGUE\n\nWe believe the Rocket Kitten case is an interesting case study for the malware research industry, exemplifying a continuing trend in\nthe nation-state attacker profile we have witnessed over the past two years; cyber-espionage is no-longer reserved to organizations\nwith monstrous budgets to hire thousands of cyber-warriors, operate password-cracking super-computer clusters or advanced\nresearch to infect your hard-drive firmware. Adversaries will often find simpler ways for effective compromise, such as creative\nphishing and simple custom malware.\n\nIn this case, as in other previously reported cases, it can be assumed that an official body recruited local hackers and diverted them\nfrom defacing web sites to targeted espionage at the service of their country. As is often the case with such inexperienced personnel,\ntheir limited training reflects in lack of operational security awareness, leaving a myriad of traces to the origin of the attack and their\ntrue identities (e.g. Yaser Balaghi, Mehdi Mahdavi and others).\n\nDespite publications, code names and articles in security outlets - the same known attacker group continues to attack with\nminimal interruption.\n\nHighlighting a repeating industry problem, minimal changes to existing malware often evade most current protection solutions.\nEffectively stopping attackers must involve action on top of analysis efforts.\n\nWe approached and will continue to approach hosting providers through the assistance of CERT coordination and other bodies in\nvarious countries. We hope these efforts are fruitful, and can help disable or reduce the attacking infrastructure.\n\n\nIf you would like to share important information regarding this campaign, please use icanhazrocket@checkpoint.com\n\n\n-----\n\n##### APPENDIX A—INDICATORS OF COMPROMISE\n\n**_Samples_**\n\nAll hashes are MD5 or SHA1\n\n\n**Lure Documents / Droppers**\n```\n01c9cebbc39e273ac1f5af8b629a7327\n08273c8a873c5925ae1563543af3715c\n1685ba9dbdb0e136d68e0b1a80a969b5\n177ef7faab3688572403730171ffb9c4\n1ceca1757cb652ba7e5b0d45f2038955\n266cfe755a0a66776df9fd8cd2fee1f1\n271a5f526a638a9ae712e6a5a64f3106\n2cb23916ca60a63a67d974f4ddeb2a11\n393bd2fd420eecf2d4ca9d61df75ff0c\n395461588e273fab5734db56fa18051b\n48573a150562c57742230583456b4c02\n4bf2218eb068385ca1bfff8d609c0104\n50d3f1708293f40a2c0c1f151c2c426f\n54ee31eb1eed79d4ddffd1423d5f5e28\n55ff220e38556ff902528ac984fc72dc\n5a009a0d0c5ecaac1407fb32ee1c8172\n5af0cbc18c6f8ed4fd1a3f68961f5452\n60f5bc820cf38e78b51e1e20fed290b5\n61a808ce0b645c4824d79865be8888ed\n85b79953bf2b33fb6118dc04e4c30910\n8ed01ac79680d84c0ee7a5f027d8b86a\n9fc345c25e6ab94bca2db6ee95d2c861\nac94ee83c91ca784a88ff26cf85e273a\naeb9d12ecbe73bfa91616ebacf24831b\nc9ea312c35e9ac0809f1c76044929f2f\nd0c3f4c9896d41a7c42737134ffb4c2e\nd14b3e0b82e3b5d6b9cc69b098f8126d\ne1a5b4ffc612270425d5d31f4c336aa9\nf68a0a3784a7edfc60ad9333ec209cbf\nf8547010eb4238f8fb76f4e8a756e36d\n0482fc2e332918456b9c97d8a9590781095b2b53\n0f4bf1d89d080ed318597754e6d3930f8eec49b0\n1a999a131144afe8cb7316ebb842da4f38101ac5\n2627cdc3324375e6f41f93597a352573e45c0f1e\n2c3edde41e9386bafef248b71974659543a3d774\n46a995df8d9918ca0793404110904479b6adcb9f\n4711f063a0c67fb11c05efdb40424377799efafd\n476489f75fed479f19bac02c79ce1befc62a6633\n64ba130e627dd85c85d6534e769d239080e068dd\n6571f2b9a0aea89f45899b256458da78ac51e6bb\n788d881f3bb2c82e685a98d8f405f375c0ac2162\n9579e65e3ae6f03ff7d362be05f9beca07a8b1b3\na9245de692c16f90747388c09e9d02c3ee34577e\nad6c9b003285e01fc6a02148917e95c780c7d751\nae18bb317909e16f765ba2e88c3d72d648db2798\nb67572a18282e79974dc61fffb8ca3d0f4fca1b0\nc485b0d59b28d37a1ac80380b0d7774bdb9d8248\nc727b8c43943986a888a0428ae7161ff001bf603\n\n```\n\n-----\n\n```\ne2728cabb35c210599e248d0da9791991e38eb41\ne6964d467bd99e20bfef556d4ad663934407fd7b\nec692cf82aef16cf61574b5d15e5c5f8135df288\ned5615ffb5578f1adee66f571ec65a992c033a50\nf51de6c25ff8e1d9783ed5ac13a53d1c0ea3ef33\nf7f69c5ed94a03f6d57e9afd33c2627ff69205f2\n\n```\n\n**Wrapper / Gholee**\n```\n05523761ca296ec09afdf79477e5f18d\n08e424ac42e6efa361eccefdf3c13b21\n0b67ebed08f09c0584b92f4e94ced778\n13039118daadbe87e337310403e64454\n14f2e86f11114c083856c92095d79256\n1b02ac8c0e1102faaee70f4026cad291\n223feb91efbe265696f318fb7c89c3fd\n3dd221b0ea6f863e086868b246a6a104\n4215d029dd26c29ce3e0cab530979b19\n48573a150562c57742230583456b4c02\n4b0edcd1d2953c26b6fc4298e8bf9150\n4cdc28ab6e426dc630638488743accfb\n58bcfe673d21634616d898c3127bd1bc\n60f5bc820cf38e78b51e1e20fed290b5\n63558e2980d1c6aaf34beefb657866fe\n8a45dfec98dd96c86d933d9c1d6ef296\n8bd58db9c29c53197dd5d5f09704296e\n916be1b609ed3dc80e5039a1d8102e82\na42cea20439789bd1d9a51d9063ae3e4\nb7de8927998f3604762096125e114042\nb884f67c247d3dd6c559372a8a31a898\nb8fb83d76eb67cbeed0b54c02a68256b\nc222199c9a7eb0d162d5e96955739447\nd5517542b5f8dc2010933ee17a846569\nda976a502a3afc4ba63611d47c625738\nee41e7c97f417b07177ea420afe510a1\nf3c3ed556072209b60c3342ddefba0f9\nf89a4d4ae5cca6d69a5256c96111e707\n02b04563ef430797051aa13e48971d3490c80636\n07a77f8b9f0fcc93504dfba2d7d9d26246e5878f \n0b0cdf47363fd27bccbfba6d47b842e44a365723\n0b880fb3414374dbbf582217ee0288a76c904e9b\n22f6a61aa2d490b6a3bc36e93240d05b1e9b956a\n25d3688763e33eac1428622411d6dda1ec13dd43\n37ad0e426f4c423385f1609561422a947a956398\n476489f75fed479f19bac02c79ce1befc62a6633\n47b1c9caabe3ae681934a33cd6f3a1b311fd7f9f\n53340f9a49bc21a9e7267173566f4640376147d9\n58045d7a565f174df8efc0de98d6882675fbb07f\n62172eee1a4591bde2658175dd5b8652d5aead2a\n6e30d3ef2cd0856ff28adce4cc012853840f6440\n729f9ce76f20822f48dac827c37024fe4ab8ff70\n7ad0eb113bc575363a058f4bf21dbab8c8f7073a\n\n```\n\n-----\n\n```\n8074ed48b99968f5d36a494cdeb9f80685beb0f5\n86222ef166474e53f1eb6d7e6701713834e6fee7\nc1edf6e3a271cf06030cc46cbd90074488c05564\nc6db3e7e723f20ed3bcf4c53fc4748e9591f4c40\ncabdfe7e9920aeaa5eaca7f5415d97f564cdec11\nce03790d1df81165d092e89a077c495b75a14013\ne6964d467bd99e20bfef556d4ad663934407fd7b\ne8dbcde49c7f760165ebb0cb3452e4f1c24981f5\nefd1c6a926095d36108177045db9ad21df926a6e\nfa5b587ceb5d17f26fe580aca6c02ff2e20ad3c4\nfd8793ce4ca23988562794b098b9ed20754f8a90 \nfe3436294f302a93fbac389291dd20b41b038cba\nffead364ae7a692afec91740d24649396e0fa981\n\n```\n\n**FireMalv Credential Stealer**\n```\n0b0e2c4789b895e8ac44b6ada284aec1\n29d93b156bcfbcecf79c5ba389094796a1ba76ee\n\n```\n\n**Woolen-Keylogger**\n```\n0a22232c1d5add9d7aabdf630b6ed5af\n0e2dc1cb6bda45d68ee9c751e37df73b\n1a2b18cb40d82dc279eb2ef923c3abd0\n1f7688653c272d5205f9070c2541a68c\n3c6c1722acfb70bfa4453b69e99c98bb\n662d094799e9c7108f35c00eb894205f\nb4790618672197cab31681994bbc10a4\nc72dce99e892bbf2537f5285a01985c0\nf7e093d721d2616ecb9067934a615f70\nf898eef9dfa04820bb2f798e063645a7\nf9b235067b1c607b5b26896d465b6665\n29968b0c4157f226761073333ff2e82b588ddf8e\n5d334e0cb4ff58859e91f9e7f1c451ffdc7544c3\n8e1bd64acd8bbe819ac60650eb1fa4f501d330ec\na42f1ad2360833baedd2d5f59354c4fc3820c475\na65b39d3919f15649106a039469013479a31ba4b\nb9842058c88170cc45183aaaae4206c74e6c7351\nc8096078f0f6c3fbb6d82c5b00211802168f9cba\nd5b2b30fe2d4759c199e3659d561a50f88a7fb2e\ndb2b8f49b4e76c2f538a3a6b222c35547c802cef\neeb67e663b2fa980c6b228fc2e04304c8992401d\nfaf0fe422259d36494a0b2c9ccefe40dee978f31\n\n```\n\n-----\n\n**MPK**\n```\n014bf8a588f614883d3d8b96024cd278\n5c66b560f70c0b756bfc840b871864ce\nd1b526770abb441d771f4681872d2fcb\neb6a21585899e702fc23b290d449af846123845f\nf2ed8cd0154ae4d6ecf52a0bcf5fa80c7095dcd2\nf710bd9ea40fd94c06d704c00e16a5941544378f\n\n```\n\n-----\n\nprofiles.googel.com.inc.gs\nprofiles.googlemembers.com.home.kg\nprofiles-google.uk.to\n```\nqooqle.co\nsecure.www.cfr.us.to\nservice-logins.com\nsignin-users.com\nsignin-verify.com\nsigns-service.com\n\n```\nverification.google-it.info\n```\nvideo.qooqle.co\nwebmail.tau.ac.il.us.to\nwebmail.technion.ac.il.us.to\n\n```\nyahoo-profiles.uk.to\n```\nyoutube.com.now.im\n\n```\n**IP addresses**\n```\n[107.6.181.96-127]\n[107.6.172.50-62]\n[107.6.154.224-231]\n107.6.181.116\n107.6.172.54\n107.6.172.55\n107.6.181.114\n107.6.172.51\n107.6.172.53\n107.6.181.100\n107.6.172.52\n107.6.154.230\n5.39.223.227\n31.192.105.10\n[5.145.151.1-7]\n5.145.151.6\n[84.11.146.52-63]\n84.11.146.55\n84.11.146.62\n84.11.146.61\n[109.169.22.69-72]\n[109.169.61.4-8]\n109.169.61.8\n109.169.22.69\n109.169.22.71\n109.169.22.72\n162.223.90.148\n162.223.91.226\n162.222.194.51\n212.118.118.100\n\n```\n\n-----\n\n##### APPENDIX B—MPK TECHNICAL DESCRIPTION\n\nThe malware appears to be named ‘MPK’ by the attackers. This may be related to “Masoud_PK” as witnessed in the Iranian blogging\nweb-site under the wool3n.h4t blog name.\n\n**Installation**\nFor persistence, the malware will add itself to autorun under an “explorer” entry:\n\n```\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n\n```\n\nThe malware includes a Visual Basic script (‘tmp.vbs’) script, which will try to initially copy the malware executable to its destination:\n\n```\nSub CopyFile(SourceFile, DestinationFile)\n  Set fso = CreateObject(\"Scripting.FileSystemObject\")\n  Dim wasReadOnly\n  wasReadOnly = False\n  If fso.FileExists(DestinationFile) Then\n   If fso.GetFile(DestinationFile).Attributes And 1 Then\n    fso.GetFile(DestinationFile).Attributes = fso.GetFile(DestinationFile).Attributes - 1\n    wasReadOnly = True\n   End If\n   fso.DeleteFile DestinationFile, True\n  End If\n  fso.CopyFile SourceFile, DestinationFile, True\n  If wasReadOnly Then\n  fso.GetFile(DestinationFile).Attributes = fso.GetFile(DestinationFile).Attributes + 1\n  End If\n  Set fso = Nothing\nEnd Sub\ncopyme = WScript.Arguments.Item(0)\ncopyto = WScript.Arguments.Item(1)\nCopyFile copyme,copyto,0\n\n```\n\nAlso, it will execute the following WScript, which will start the malware itself after exactly 9 seconds.\n\n```\nWScript.Sleep 9000\nCreateObject(\"WScript.Shell\").Run \"iexplorer.exe [1]\"\n\n```\n\n**Main operation**\nThis malware is basically a RAT (Remote Access Trojan). It implements such functionality as a key-logger, sniffing TCP and UDP\ntraffic, taking screenshots, as well as a remote command shell.\n\nAlso, it may gather a lot of information about the target system such as enumeration of files, drives, services, process information\nand the ability to send any file to the C&C server.\n\n\n-----\n\nLess important, but still sensible information may be exfiltrated:\n\n- Primary display resolution\n\n- Has administrator rights or not\n\n- Processor information\n\n- Hostname information\n\n- Windows version\n\n- Service Pack version\n\n- Amount of memory installed on the target system\n\n- Network adapters and network configuration information\n\n- TCP connections table\n\nThe following mutex will be created:\n\n```\n[2]opened\n\n```\n\nThen, the malware will check if the following mutex exists:\n\n```\nMyApp1.0\n\n```\n\nIf it does, the malware will exit, so only one instance of the malware is allowed at a time. If not, it will continue to the main operation.\n\n**Keylogger**\nKeylogger stores keystrokes to the following file:\n\n```\n%TEMP%\\log%d.txt\n\n```\n\nHere is a sample of malware key-log output:\n\n```\n(((((((Hello new File)))))))))\n+++++++++++++\nWindow= VMware Accelerated AMD PCNet Adapter (Microsoft's Packet Scheduler) : Capturing Wireshark\n+++++++++++++\n[UP][DOWN][DOWN][UP][UP][DOWN][UP][DOWN][DOWN][UP][UP][DOWN][DOWN][DOWN][UP][UP][UP][UP]\n[DOWN][DOWN][DOWN][DOWN]r\n+++++++++++++\nWindow= Run\n+++++++++++++\ncmd[ENTER]\n+++++++++++++\nWindow= C:\\WINDOWS\\system32\\cmd.exe\n+++++++++++++\nnotepad[ENTER]\n+++++++++++++\nWindow= VMware Accelerated AMD PCNet Adapter (Microsoft's Packet Scheduler) : Capturing Wireshark\n+++++++++++++\n[DOWN][UP]\n+++++++++++++\nWindow= Untitled - Notepad\n+++++++++++++\ntest test test\n\n```\n\n-----\n\nThis file will be sent to remote C&C server later on.\n\nIf the malware detects an open “Gmail”, “Yahoo” or “Outlook” window, it will add special processing so the attacker can easily\nrecognize the data that is the most valuable to him. The following string will be appended to the output file:\n\n```\n\\r/////////////\\r\\nMail Find\n\n```\n\n**Webcam capture**\nThe malware may capture photos from an attached webcam. Files are first saved with the name test.bmp, later converted to JPEG\nand saved under the new file name Cam.jpg, eventually exfiltrated to the C&C server.\n\n**TCP Connection Table**\nThe malware will gather available metadata regarding current TCP connections using the GetTcpTable API, and send a formatted\nversion of the obtained data to the C&C server.\n\n**Screenshots**\nThe malware may take screenshots. The filename used for screenshots is Screeny.jpeg.\n\n**Remote Shell (Live Command Execution)**\nThe malware creates the following process as a live command prompt:\n\n```\ncmd.exe /c cmd.exe\n\n```\n\nThis process’ output and input are attached and redirected via pipes to the remote C&C server, allowing the operator to type in\ncommands to control the victim computer. The following line is first sent to the server:\n\n```\nWelcome To mpkshell Command Line (This Message Send From Server)\n\n```\n\n**Traffic Monitoring**\nThe malware may sniff all TCP and UDP traffic on the machine. This is achieved through the use of RAW sockets. The following status\nstrings can be sent to the C&C server:\n\n```\nInitializing Winsock 2.2...\nCreating RAW socket...\n\n```\nConfiguring socket for packet interception\nStarting the sniffing process...\n```\nUDP Packet Information:\nSource IP: %s DESTINATION IP: %s\nSOURCE PORT: %d DESTINATION PORT: %d\nPACKET DATA:\n#############################################################\n\n```\nTCP Packet Information:\n\nSource IP: %s DESTINATION IP: %s\n\nSOURCE PORT: %d DESTINATION PORT: %d\n\n#############################################################\n\n\n-----\n\nIf the current user privileges are insufficient for such action, the following error is presented:\n\n```\nthe processs is not admin try after restart to while mpkProcess To Admin...\n\n```\n\n**File Exfiltration**\nThe malware may exfiltrate any file to the remote C&C server. The malware also contains the ability to enumerate all files on the\nsystem or find a specific file with the required filename specified by the operator.\n\nUpon file exfiltration, the file is checked for size. This is performed in order to send the file in 4Kb ‘chunks’, where each chunk frame\nis sized 0x1014h bytes.\n\nBefore uploading any file to the C&C server, the malware will report its size:\n\n```\nlength: %d\n\n```\n\nAfter sending each chunk, the malware will report the current transfer status:\n\n```\n%d Bytes / %d Bytes\n\n```\n\nWhen the transfer will be finished, it will report completion using the following string:\n\n```\nCompleted: %d Bytes Downloaded.\n\n```\n\nIf there was any problem, this string will be reported:\n\n```\nFailed to open %s, %s not found.\n\n```\n\n**Communication protocol**\nThe malware uses raw sockets over IP protocol (IPPROTO_IP flag), effectively implementing its own protocol for data transfer.\n\nThe executable’s own “File Version Info” is parsed to retrieve the server IP, trivially encoded into the “Company” value:\n\n\n-----\n\nThis data contains hardcoded IP address and port of C&C server. In this sample it is:\n\n```\n83.170.33.67:9090\n\n```\n\nA connection will be established to that IP, while sending periodic ‘keep-alive’ messages, containing these 6 bytes:\n\n```\n123456\n\n```\n\nFile-exfiltration packets are 0x1014h bytes long. The first 2 bytes indicate the type of file to be exfiltrated:\n\n```\n• 0811h—logs (initial packet)\n• 0810h—logs (subsequent packets)\n\n```\n`•` 080Fh—logs (final packet)\n```\n• 0BCDh—webcam images (initial packet)\n• 0BCFh—webcam images (subsequent packets)\n\n```\n`•` 0BCEh—webcam images (final packet)\n```\n• 0803h—screenshots (initial packet)\n• 0805h—screenshots (subsequent packets)\n\n```\n`•` 0804h—screenshots (final packet)\n\n`•` 13C2h—error with file\n\n\nThe filename is located at offset 0x08h of the first packet. Subsequent packets include file contents only.\n\n\n-----\n\n###### The Check Point Incident Response Team is available\n\n to investigate and resolve complex security events\n that span from malware events, intrusions or denial of service attacks.\n\n The team is available 24x7x365 by contacting\n\n emergency-response@checkpoint.com\n\n or calling 866-923-0907\n\n©2015 Check Point Software Technologies Ltd. All rights reserved.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        },
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        },
        {
            "id": "5d2b9e7f-cf43-4b54-ba18-065aa3003611",
            "created_at": "2022-10-25T16:06:24.199525Z",
            "updated_at": "2022-10-25T16:06:24.199525Z",
            "deleted_at": null,
            "name": "CyberMonitor",
            "url": "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections",
            "description": "APT & Cybercriminals Campaign Collection",
            "reports": null
        },
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        },
        {
            "id": "5910e58f-4bc9-4e4e-9dbb-887804094a01",
            "created_at": "2022-10-25T16:32:58.457399Z",
            "updated_at": "2022-10-25T16:32:58.457399Z",
            "deleted_at": null,
            "name": "OTX",
            "url": "https://otx.alienvault.com",
            "description": "Alienvault Open Threat Exchange (OTX)",
            "reports": null
        },
        {
            "id": "99593a68-7f6e-400e-9a9f-a707f66d2e72",
            "created_at": "2022-11-23T11:07:14.353321Z",
            "updated_at": "2022-11-23T11:07:14.353321Z",
            "deleted_at": null,
            "name": "AGRO",
            "url": "https://apt.threattracking.com",
            "description": "APT Groups and Operations Spreadsheet",
            "reports": null
        },
        {
            "id": "6825b8cb-7d82-43d2-b0b0-d51c7e255b42",
            "created_at": "2023-01-06T13:46:37.642134Z",
            "updated_at": "2023-01-06T13:46:37.642134Z",
            "deleted_at": null,
            "name": "MISPGALAXY",
            "url": "https://www.misp-project.org/galaxy.html",
            "description": "MISP Galaxy Clusters",
            "reports": null
        }
    ],
    "references": [
        "https://blog.checkpoint.com/wp-content/uploads/2015/11/rocket-kitten-report.pdf",
        "https://app.box.com/s/vhe51fr5m6kqqzbkkcuukta6nucn9p6a",
        "https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.11.09.Rocket_Kitten_A_Campaign_With_9_Lives/rocket-kitten-report.pdf",
        "http://blog.checkpoint.com/wp-content/uploads/2015/11/rocket-kitten-report.pdf"
    ],
    "report_names": [
        "rocket-kitten-report.pdf",
        "Checkpoint_rocket-kitten-report(Nov-9-2015)",
        "rocket-kitten-report"
    ],
    "threat_actors": [
        {
            "id": "7c053836-8f50-4d40-bc5c-7088967e1b57",
            "created_at": "2022-10-25T16:07:24.549525Z",
            "updated_at": "2025-03-27T02:02:10.278474Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Aged Libra",
                "Iron Group",
                "Rocke"
            ],
            "source_name": "ETDA:Rocke",
            "tools": [
                "Godlua",
                "Kerberods",
                "LSD",
                "Pro-Ocean",
                "Xbash"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8e1bae2f-2a21-4ba8-a6f1-42155f96aec8",
            "created_at": "2022-10-25T16:07:23.645758Z",
            "updated_at": "2025-03-27T02:02:09.905135Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Ajax Security Team",
                "Flying Kitten",
                "Group 26",
                "Operation Saffron Rose"
            ],
            "source_name": "ETDA:Flying Kitten",
            "tools": [
                "Stealer"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "e034b94b-9655-42c4-a72e-a58807dce299",
            "created_at": "2022-10-25T16:07:24.133537Z",
            "updated_at": "2025-03-27T02:02:10.118581Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Group 83",
                "NewsBeef",
                "Newscaster",
                "Operation Newscaster",
                "Operation Woolen-GoldFish",
                "Parastoo",
                "Rocket Kitten"
            ],
            "source_name": "ETDA:Rocket Kitten",
            "tools": [
                "CoreImpact (Modified)",
                "FireMalv",
                "Ghole",
                "Gholee"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8faa11f5-2a14-479c-9ea8-3779e6de9749",
            "created_at": "2022-10-25T15:50:23.814205Z",
            "updated_at": "2025-03-27T02:00:55.551798Z",
            "deleted_at": null,
            "main_name": "Ajax Security Team",
            "aliases": [
                "Ajax Security Team",
                "Operation Woolen-Goldfish",
                "AjaxTM",
                "Rocket Kitten",
                "Flying Kitten",
                "Operation Saffron Rose"
            ],
            "source_name": "MITRE:Ajax Security Team",
            "tools": [
                "sqlmap",
                "Havij"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4d7cba1-dbdd-42a9-88c5-4d0c81659ee0",
            "created_at": "2023-01-06T13:46:38.357581Z",
            "updated_at": "2025-03-27T02:00:02.813318Z",
            "deleted_at": null,
            "main_name": "Flying Kitten",
            "aliases": [
                "Saffron Rose",
                "AjaxSecurityTeam",
                "Ajax Security Team",
                "Group 26",
                "Sayad",
                "SaffronRose"
            ],
            "source_name": "MISPGALAXY:Flying Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "905eabd9-2b7f-483d-86bd-0c72f96b4162",
            "created_at": "2023-01-06T13:46:39.02749Z",
            "updated_at": "2025-03-27T02:00:02.980813Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Aged Libra"
            ],
            "source_name": "MISPGALAXY:Rocke",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "0b02af5f-2027-42b7-a6f2-51e2fd49ba7f",
            "created_at": "2022-10-25T15:50:23.360509Z",
            "updated_at": "2025-03-27T02:00:55.45329Z",
            "deleted_at": null,
            "main_name": "Rocke",
            "aliases": [
                "Rocke"
            ],
            "source_name": "MITRE:Rocke",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "b0261705-df2e-4156-9839-16314250f88a",
            "created_at": "2023-01-06T13:46:38.373617Z",
            "updated_at": "2025-03-27T02:00:02.817313Z",
            "deleted_at": null,
            "main_name": "Rocket Kitten",
            "aliases": [
                "Operation Woolen-Goldfish",
                "Thamar Reservoir",
                "Timberworm",
                "TEMP.Beanie",
                "Operation Woolen Goldfish"
            ],
            "source_name": "MISPGALAXY:Rocket Kitten",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08a3b64c-8e18-455d-af57-28dca63808c4",
            "created_at": "2024-05-01T02:03:08.027871Z",
            "updated_at": "2025-03-27T02:05:17.313679Z",
            "deleted_at": null,
            "main_name": "COBALT ILLUSION",
            "aliases": [
                "APT42 ",
                "Charming Kitten ",
                "CharmingCypress ",
                "ITG18 ",
                "Magic Hound ",
                "Mint Sandstorm sub-group ",
                "NewsBeef ",
                "Newscaster ",
                "PHOSPHORUS sub-group ",
                "TA453 ",
                "UNC788 ",
                "Yellow Garuda ",
                "APT35 "
            ],
            "source_name": "Secureworks:COBALT ILLUSION",
            "tools": [
                " MagicHound Toolset",
                " PupyRAT",
                "Browser Exploitation Framework (BeEF)"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "e3676dfe-3d40-4b3a-bfbd-4fc1f8c896f4",
            "created_at": "2022-10-25T15:50:23.808974Z",
            "updated_at": "2025-03-27T02:00:55.550912Z",
            "deleted_at": null,
            "main_name": "Magic Hound",
            "aliases": [
                "Magic Hound",
                "TA453",
                "COBALT ILLUSION",
                "Charming Kitten",
                "ITG18",
                "Phosphorus",
                "APT35",
                "Mint Sandstorm"
            ],
            "source_name": "MITRE:Magic Hound",
            "tools": [
                "Impacket",
                "CharmPower",
                "FRP",
                "Mimikatz",
                "Systeminfo",
                "ipconfig",
                "netsh",
                "PowerLess",
                "Pupy",
                "DownPaper",
                "PsExec",
                "Havij",
                "sqlmap"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716504,
    "ts_updated_at": 1743041672,
    "ts_creation_date": 1447068321,
    "ts_modification_date": 1447068338,
    "files": {
        "pdf": "https://archive.orkl.eu/523ae1be152df2a4d1de51ee2b3e7f23cad62628.pdf",
        "text": "https://archive.orkl.eu/523ae1be152df2a4d1de51ee2b3e7f23cad62628.txt",
        "img": "https://archive.orkl.eu/523ae1be152df2a4d1de51ee2b3e7f23cad62628.jpg"
    }
}