{
    "id": "b1208824-7e93-42c6-9a1d-d437b0448c36",
    "created_at": "2023-01-12T15:02:02.576707Z",
    "updated_at": "2025-03-27T02:05:39.580732Z",
    "deleted_at": null,
    "sha1_hash": "72b1e9253893d1701412460913ccac48f9736917",
    "title": "2021-03-05 - ZeroLogon to Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T19:52:16Z",
    "file_modification_date": "2022-05-28T19:52:16Z",
    "file_size": 1102937,
    "plain_text": "# ZeroLogon to Ransomware\n\n**[blogs.blackberry.com/en/2021/03/zerologon-to-ransomware](https://blogs.blackberry.com/en/2021/03/zerologon-to-ransomware)**\n\nCodi Starks, Kevin Finnigin\n\nFollowing patches released by Microsoft on August 11th, 2020, adversaries are continuing\nto exploit CVE-2020-1472, known as the ZeroLogon vulnerability. The vulnerability affects\nMicrosoft’s Netlogon Remote Protocol (MS-NRPC), a critical authentication mechanism\nused by Microsoft® Active Directory®. Successful exploitation can allow for escalation of\nprivileges and ultimately full domain takeover[i].\n\nThe BlackBerry Incident Response (IR) team is closely monitoring exploitation of the\nvulnerability and has seen instances of the exploit used by threat groups to deploy\nransomware. With the growing exploitation of the ZeroLogon vulnerability, it’s important to\nunderstand how to mitigate the vulnerability and detect if you’ve been impacted by it.\n\nTo explain how threat actors are leveraging the vulnerability, we’ll walk through a recent\nNetwalker ransomware incident handled by the BlackBerry IR team.\n\n## Pre-Exploit Activities\n\n\n-----\n\nBefore diving into the incident, let’s cover some pre-exploit activities that are shared among\nmany ransomware cases. Before a threat actor can begin to escalate privileges via\nZeroLogon, they first need to establish a foothold on the network. BlackBerry has observed\nthat misconfigured or unpatched network perimeter devices, such as firewalls and VPN\nappliances, continue to be the primary methods used to gain entry into the network. After\nestablishing the initial foothold, there will typically be enumeration and scanning activity that\noccurs to create a map of the network.\n\nThe threat actor may then begin testing access to various systems via RDP or SMB in order\nto identify a system to pivot further into the network to target critical systems. These initial\nactions are seen frequently in ransomware incidents that the BlackBerry IR team responds\nto, and are not unique to the case discussed below.\n\n## The ZeroLogon Netwalker Case\n\nNow that we’ve covered some common methods used to establish an initial foothold, we’ll\ncover a true ransomware case where the ZeroLogon exploit was used to escalate\nprivileges, prior to deploying Netwalker ransomware. Some critical Windows Event IDs used\nto detect ZeroLogon exploitation, including 4624 and 4742, were not available on the\nendpoint for the incident timeframe. Evidence of exploitation was still available on the\nsource and destination devices, as discussed below.\n\nBlackBerry initially discovered the first evidence of ZeroLogon exploitation through a\nsuspicious authentication event to a Domain Controller. On the source device, Windows\nEvent ID 4648 was logged displaying the process name used to connect to the remote\nsystem.\n\nUpon discovering the suspicious connection, the BlackBerry Research and Intelligence\nTeam reverse engineered the file ‘zero.exe’ and determined it to be a custom developed\nZeroLogon exploit binary. Once executed, the file is designed to run the exploit against a\ntargeted Domain Controller, reset the Domain Controller’s device password, extract the\n\n\n-----\n\nNTLM hash of a user specified via a command line argument, and if desired, run arbitrary\ncommands on the destination host. BlackBerry’s testing confirmed these capabilities, as\nseen below.\n\nUpon exploitation of the ZeroLogon vulnerability, the binary was configured to create a\nservice with an arbitrary name of exactly 20 characters, which was used to reset the\nDomain Controller’s machine password to its original state to avoid breaking authentication\nto/from the server. As the computer account is typically only reset every 30 days, seeing\ntwo resets in a short period of time would be a possible indicator of compromise (IOC) for\nthe ZeroLogon exploit. BlackBerry discovered Windows Event ID 7045 logged on the\nDomain Controller, indicating a new service was installed, showing further evidence of the\nexploitation event:\n\nAt the same time the Domain Controller began logging Event ID 5805 with a “Computer”\nparameter containing the Domain Controller’s own device name. These events are used to\nindicate failed netlogon authentication events, and begin occurring once the Domain\nController’s password has been changed via the ZeroLogon exploit. The events indicate the\nmachine can no longer successfully authenticate using the expected credentials.\n\n\n-----\n\nAt this point, the threat actor successfully restored the Domain Controller’s credentials to\navoid detection. Additionally, the exploit allowed the attacker to obtain the NTLM hash for a\nDomain Administrator account. Next, the threat actor remotely created a user account on\nthe Domain Controller using the NTLM hash of the Domain Administrator account harvested\nby the ‘zero.exe’ exploit. The popular ‘Invoke-TheHash’ powershell script was used to passthe-hash and execute the account creation commands on the Domain Controller, similar to\nthe command below:\n\nOnce the local account was created, the threat actor connected to the Domain Controller\nvia RDP and used the mimikatz tool to harvest additional credentials on the Domain\nController. This was seen via the presence of the ‘C:\\Users\\\n<username>\\Downloads\\mimikatz.log’ file. At this point it was trivial for the threat actor to\nmove laterally and deploy ransomware across additional network systems.\n\n## Hunting and Remediation\n\nPatch management is the best method to prevent the exploitation of the ZeroLogon\nvulnerability, although there are cases where patching in a timely manner is simply not\npossible. In these cases, organizations should be aware of the impact of a successful\nexploitation event and its detection with what may be minimal log data. Learn more about\nthe importance of patching along with recommendations for creating a robust vulnerability\n[management program in our article examining critical behaviors that either stop incidents](https://blogs.blackberry.com/en/2020/09/lessons-from-the-front-line-decreasing-time-to-patch)\nfrom happening or greatly reduce their impact.\n\nAlthough in this case the end goal was a highly visible ransomware incident, it is possible\nthat APT threat groups may have used or be using similar techniques for more covert and\ninsidious campaigns. Understanding if you were already compromised prior to patching may\nbe advisable. For assistance with determining this, reach out to your trusted security\nprovider.\n\nBlackBerry identified several IOCs that can be used to identify signs of ZeroLogon\nexploitation:\n\nWindows Event ID 4648 with a suspicious file name/path.\n\n\n-----\n\nWindows Event ID 7045 (Service Creation) with an Image Path of Powershell -c\nReset-ComputerMachinePassword”\nMultiple password resets for computer accounts, in particular, for the domain\ncontroller within a short space of time\nA large number of Windows Event ID 5805 events containing the Domain Controllers\ncomputer name, especially if seen in close relation with Event ID 7045.\n\n[1] [https://msrc.microsoft.com/update-guide/vulnerability/CVE-2020-1472](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2020-1472)\n\n**Copyright © 2021 BlackBerry Limited**\n\n## About Codi Starks\n\n**Senior Professional Services Incident Response Consultant at BlackBerry.**\n\n**[Codi Starks has more than twelve years of IT, cybersecurity, and incident response](https://www.linkedin.com/in/codi-starks-b3a0ab61/)**\nexperience. During his time in the field he has supported and led difficult incident response\nengagements for Fortune 500 companies spanning multiple continents.\n\nHe currently holds several certifications and achievements, including an M.S. in Information\nSecurity and Assurance, as well as the OSCP and SANS GCFE certifications. He has won\nmultiple cybersecurity competitions, including OpenSOC, SANS DFIR Netwars, and SOCX.\n\n## About Kevin Finnigin\n\nSenior Manager of Threat Research at Cylance\n\n\n-----\n\nKevin Finnigin has 15 years experience in information security, including over 8 years as an\nactive duty Air Force officer. He's reversed engineered malware for both the U.S.\ngovernment and private sector and performed incident response roles at various levels. He\nholds a number of credentials, including an M.S. in Information Assurance and SANS\nGCFA. While on the job, Kevin is most at home with IDA Pro opened and a PowerShell\nsession ready to do his bidding.\n\nBack\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-05 - ZeroLogon to Ransomware.pdf"
    ],
    "report_names": [
        "2021-03-05 - ZeroLogon to Ransomware.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535722,
    "ts_updated_at": 1743041139,
    "ts_creation_date": 1653767536,
    "ts_modification_date": 1653767536,
    "files": {
        "pdf": "https://archive.orkl.eu/72b1e9253893d1701412460913ccac48f9736917.pdf",
        "text": "https://archive.orkl.eu/72b1e9253893d1701412460913ccac48f9736917.txt",
        "img": "https://archive.orkl.eu/72b1e9253893d1701412460913ccac48f9736917.jpg"
    }
}