{
    "id": "b130ed50-1140-49af-a25e-226c89c44184",
    "created_at": "2023-01-12T15:05:16.646275Z",
    "updated_at": "2025-03-27T02:06:02.254274Z",
    "deleted_at": null,
    "sha1_hash": "1bb9fe2704e8c7fa525b638a71b01360917a8e32",
    "title": "2019-10-02 - Servers botnet offline",
    "authors": "",
    "file_creation_date": "2022-05-28T16:59:19Z",
    "file_modification_date": "2022-05-28T16:59:19Z",
    "file_size": 138551,
    "plain_text": "# Servers botnet offline\n\n**[politie.nl/nieuws/2019/oktober/2/11-servers-botnet-offline.html](https://www.politie.nl/nieuws/2019/oktober/2/11-servers-botnet-offline.html)**\n\n[1. Home](https://www.politie.nl/)\n[2. Nieuws](https://www.politie.nl/nieuws)\n3. Servers botnet offline\n\nLaatst gewijzigd op: 02-10-2019 | 11:10\n\nMiddelburg, Veendam, Amsterdam, Driebergen - De politie heeft vijf servers offline gehaald\ndie gebruikt werden voor de aansturing van een versie van een zogenoemd botnet. De\nhardware is in beslag genomen en de bedrijfsvoering stilgelegd. Een 24-jarige man uit\nVeendam en een 28-jarige man uit Middelburg zijn dinsdagavond aangehouden. Zij worden\nonder andere verdacht van computervredebreuk en het verspreiden van malware.\n\nRechercheurs van de Dienst Landelijke Recherche kwamen de servers op het spoor via\ninformatie afkomstig van het Nationaal Cyber Security Centrum. Na onderzoek kwam de\npolitie uit bij een Nederlands hostingbedrijf dat gebruikmaakte van servers in een\ndatacentrum in Amsterdam. De servers zijn offline gehaald en worden onderzocht door de\npolitie.\n\n## Mirai-botnet\n\n\n-----\n\nDe aansturingsservers van een versie van het Mirai-botnet werden bij een zogenoemde\nbulletproof hoster gehost. Dat is een hostingprovider die online criminele diensten levert. De\nservers die offline zijn gehaald stuurden een botnet aan dat voor een groot deel bestond uit\nInternet-of-Things (IoT) apparaten. Denk bijvoorbeeld aan slimme thermostaten, koelkasten,\neigenlijk alles wat gekoppeld kan worden aan het internet. Een botnet maakt van al deze\napparaten een netwerk. Met behulp van het Mirai-botnet werden steeds meer IoT-apparaten\ngeïnfecteerd. De apparaten werden vervolgens ingezet om Distributed Denial of Service\n(DDoS) aanvallen uit te voeren op onder andere websites of betaaldiensten.\n\n## Hosting\n\nDe servers die in Nederland geplaatst waren, zorgden voor de aansturing van dit botnet,\nde ‘Command-and-Control’ servers. Met behulp van deze servers werden besmette IoTapparaten (bots) aangestuurd. Deze bots scannen voortdurend IP-adressen op zoek naar\nandere kwetsbare IoT-apparatuur. Indien er werd vastgesteld dat er zich achter een IP-adres\nkwetsbare apparatuur bevond, werd er een aanval uitgevoerd en malware geïnstalleerd. De\nC&C-servers stuurden het botnet van geïnfecteerde apparaten vervolgens aan, zodat ze\ngebruikt konden worden voor een DDoS-aanval.\n\n## Servers uit de lucht\n\nMet het offline halen van deze servers bij de bulletproof hoster is een slag toegebracht aan\neen infrastructuur die wereldwijd aanvallen uitvoerde. Hiermee is de aansturing van het\nbestaande Mirai-botnet onmogelijk gemaakt en infecties van nieuwe apparaten door dit\nbotnet voorkomen. Over de betreffende bulletproof hoster werden ruim drieduizend\nmeldingen gedaan van malwareverspreiding in een periode van een jaar. Ook kwam in het\nonderzoek naar voren dat dit botnet zeer agressief andere apparaten probeerde te\ninfecteren, tot ruim een miljoen pogingen per maand op een apparaat. Welke DDoSaanvallen kunnen worden toegeschreven aan dit botnet maakt deel uit van het verdere\nonderzoek.\n\n## Hoe kun je misbruik van IoT-devices voorkomen?\n\nDe meeste IoT-devices zijn ‘slim’ gemaakt door ze te koppelen aan het internet. Omdat ze in\nveel gevallen met standaardwachtwoorden beveiligd zijn en er ook geen algemene\nstandaarden voor de beveiliging worden gehanteerd of zijn afgesproken door producenten,\nblijven deze systemen kwetsbaar. Door het resetten of opnieuw opstarten van het apparaat\nwordt de malware gewist. Het resetten van apparaten maakt ze echter niet minder kwetsbaar\nvoor een aanval, want bij een volgende scan kunnen ze opnieuw worden geïnfecteerd.\nGebruikers van IoT-apparaten kunnen misbruik van hun apparatuur voorkomen door de\napparatuur te resetten en standaardwachtwoorden aan te passen, mits dit mogelijk is.\n\n## Wat is een DDoS-aanval?\n\n\n-----\n\nEen DDoS-aanval houdt bijvoorbeeld in dat via een slimme thermostaat, koelkast of IPcamera een aanval op een website kan worden gelanceerd. Door een aanval met zoveel\nmogelijk geïnfecteerde apparaten tegelijkertijd uit te voeren worden er zoveel\ninformatieverzoeken gedaan dat een website dit niet aankan en uit de lucht gaat.\n\n\n-----",
    "language": "NL",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-10-02 - Servers botnet offline.pdf"
    ],
    "report_names": [
        "2019-10-02 - Servers botnet offline.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535916,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653757159,
    "ts_modification_date": 1653757159,
    "files": {
        "pdf": "https://archive.orkl.eu/1bb9fe2704e8c7fa525b638a71b01360917a8e32.pdf",
        "text": "https://archive.orkl.eu/1bb9fe2704e8c7fa525b638a71b01360917a8e32.txt",
        "img": "https://archive.orkl.eu/1bb9fe2704e8c7fa525b638a71b01360917a8e32.jpg"
    }
}