{
    "id": "b13f34d9-fd01-4f0b-b546-8491e3b5c86f",
    "created_at": "2023-01-12T15:10:14.155698Z",
    "updated_at": "2025-03-27T02:15:46.892648Z",
    "deleted_at": null,
    "sha1_hash": "ff58191980a160360ca8be03e1f3b2fe4ce44b4d",
    "title": "2021-12-27 - A Deep Dive into DoubleFeature, Equation Group’s Post-Exploitation Dashboard",
    "authors": "",
    "file_creation_date": "2022-05-28T18:14:33Z",
    "file_modification_date": "2022-05-28T18:14:33Z",
    "file_size": 1481649,
    "plain_text": "# A Deep Dive into DoubleFeature, Equation Group’s Post- Exploitation Dashboard\n\n**[research.checkpoint.com/2021/a-deep-dive-into-doublefeature-equation-groups-post-exploitation-dashboard/](https://research.checkpoint.com/2021/a-deep-dive-into-doublefeature-equation-groups-post-exploitation-dashboard/)**\n\nDecember 27, 2021\n\nDecember 27, 2021\n[Earlier this year, Check Point Research published the story of “Jian” — an exploit used by](https://research.checkpoint.com/2021/the-story-of-jian/)\nChinese threat actor APT31 which was “heavily inspired by” an almost-identical exploit used\nby the Equation Group, made publicly known by the Shadow Brokers leak. The spicy part of\nthe story was that Jian had been roaming in the wild and abusing Equation Group ingenuity\nto compromise systems before it was cool — as early as 2014, a full two years before the\nShadow Brokers leaks made the original exploit public. Evidently, the authors of Jian had\nacquired early access to it some other way.\n\nWhile this discovery had undoubtedly added an extra tinge of paranoia to an already\ncomplicated affair, we were still left with some questions of our own. Chief among those\nquestions was, “how come that little nugget was still just lying there for us to find, a full 4\nyears after the fact?”. In information security terms, 4 years is an eternity. What else would\nwe find, if we dug deep enough? Have the Russians actually had access to these tools back\nin 2013? The Iranians in 2006? The Babylonians in 700 BC?\n\n\n-----\n\nFirst of all, we are glad to say the answer is (probably) no. Best that we can tell, APT31 s\napparent early access to the leaked exploit was the exception, not the rule. This makes for a\nless exciting headline, but should help all of us sleep better at night. During our research, we\ncombed over the DanderSpritz framework — a major part of the “Lost in Translation” leak —\nin excruciating technical detail; and we present our findings here, with a pedagogical focus\non its `DoubleFeature logging tool which provides a unique view into the rest of the`\nframework.\n\n## What is DanderSpritz?\n\nDanderSpritz is a full-featured post-exploitation framework used by the Equation Group. This\nframework was usually leveraged after exploiting a machine and deploying the PeddleCheap\n“implant”. DanderSpritz is very modular and contains a wide variety of tools for persistence,\nreconnaissance, lateral movement, bypassing Antivirus engines, and other such shady\nactivities. It was leaked by [The Shadow Brokers on April 14th, 2017 as part of the “Lost in](https://en.wikipedia.org/wiki/The_Shadow_Brokers)\nTranslation” leak.\n\n## DanderSpritz Structure and Execution Flow\n\nDanderSpritz logic can be found effectively split in two inside the directory tree of the “Lost in\nTranslation” leak:\n```\nleak root\n----(...)\n----windows\n--------bin \n--------exploits\n--------fuzzbunch\n--------implants\n--------payloads\n--------resources \n--------specials\n--------touches\n----(...)\n\n```\nThe core functionality of DanderSpritz is contained in the file `DszLpCore.exe, which can`\nbe found at `windows/bin . The framework’s plugins and complex components, including`\nDoubleFeature which we will later discuss in detail, can be found under\n```\nwindows/resources . fuzzbunch, implants, and the other directories under windows\n\n```\ncontain modules separate from DanderSpritz which are used for exploitation itself, taking\ncontrol of victim systems, initial data gathering and so on; these are all beyond the scope of\nthis publication.\n\nThe basic logical unit inside DanderSpritz is what we dub a “plugin”. These reside in\n```\nwindows/resources ; there are about a dozen of them and they have a very specific\n\n```\ndirectory structure, seen in the diagram below (though some of these subdirectories are\n\n\n-----\n\noptional).\n\nThere are also some other directories under `windows\\\\resources that are not plugins`\n(and therefore do not have this structure), and instead contain miscellaneous auxiliary scripts\n(such as validation scripts to verify the affiliation of victim machines).\n```\nplugin root\n----aliases\n----commands\n----modules\n--------descriptions\n--------files-dsz\n------------x86\n----------------<module_name>\n----------------<module_name>\n----------------(...)\n------------x64\n----------------<module_name>\n----------------<module_name>\n----------------(...)\n------------(...)\n----payloads\n--------descriptions\n----pylp\n----pyscripts\n----scripts\n----tools\n----uploads\n----version\n   Aliases and Commands – These both contain XML files that declare support for\n\n```\n“aliases” and “commands”, respectively, which serve a similar function. When a user of\nthe DanderSpritz framework issues a shell command (in the general sense of the word\n– in the same way that a Bash user would run `ls,` `top and so on), DanderSpritz will`\niterate over every plugin, check these XMLs and verify whether they declare support for\nthe shell command the user typed. If the command appears under `Aliases it will be`\nsimply mapped to an existing script; a `Command will typically, under the hood, invoke`\nthe inner logic of the plugin in some way. This effectively means that a user of\nDanderSpritz can run many different shell commands to achieve various results without\nbeing aware that behind the scenes, the same plugin handled the execution of all these\nrequests. Under `Commands (but not` `Aliases ), additionally to the XML, there is an`\nXSL file which specifies a format for the command’s output as returned to the\nDanderSpritz user (XSL is a markup language for specifying presentation style for XML\ndata — it is to XML as CSS is to HTML).\n\n\n-----\n\n```\n   Modules – Most of the plugin logic is contained in this directory. As can be inferred\n\n```\nfrom the name, the logic is further divided into smaller “modules” of functionality. The\n```\n   descriptions subdirectory contains an XML file which is a sort of “manifest”. It\n\n```\ndetails what scripts and binaries should be run on the victim machine and on the “LP”\n(“Listening Post” — an attacker-controlled machine remotely monitoring the victim). It\nalso lists the plugin’s dependencies on other modules, its interface data, what\ncomputing architectures it supports, and whether it should run on the victim machine or\non the LP. A few plugins also contain a `payloads directory with a similar function.`\n```\n   PyLp – Contains XML files for formatting incoming information exfiltrated from the\n\n```\nvictim machine. For every “message type” (kind of exfiltrated information), an XML\nspecifies a Python script that formats the data for convenient display. This formatting\nscript resides in the `PyScripts directory.`\n```\n   PyScripts – All the miscellaneous Python scripts used by the framework are in this\n\n```\ndirectory.\n```\n   Scripts – This directory also contains miscellaneous scripts, written in some sigil\n```\nheavy scripting language that might have seemed reasonable to use before Python’s\nrise to prominence.\n```\n   Tools – A grab-bag of self-contained material (PEs, DLLs, scripts, JARs, text files,\n\n```\n…) which the authors figured they’d rather just include and invoke as-is.\n```\n   Uploads – stand-alone binaries which are pushed to the victim system by the plugin.\n   Version – contains an XML file containing the plugin version.\n\n```\nBelow we detail the typical control flow when a plugin alias or command is invoked.\n\n1. The DanderSpritz user types a shell command in the DanderSpritz user interface which\n\nis, behind the scenes, implemented using that specific plugin.\n\n\n-----\n\n**Figure 1: The User Interface of DanderSpritz and its shell commands.**\n\n1. DanderSpritz’s main logic iterates over the `resources directory, looking at one plugin`\n\ndirectory after the other. For each plugin directory, DanderSpritz looks at the `aliases`\nsubdirectory and the `commands subdirectory, and scrutinizes the XML file within,`\nlooking for a declared exported functionality matching the shell command. The match is\nfound, and the matched XML element specifies a path inside the plugin’s `pyscripts`\ndirectory.\n2. DanderSpritz computes the fully qualified path of the invoked script (by appending the\n\npath specified in the matched XML element to the path of the plugin’s `pyscripts`\ndirectory) and executes the file. This is where the user interface of the invoked shell\ncommand is displayed, and the plugin can be said to be properly running. (Ideally, this\nPython script is just UI and glue, while the core functionality that interacts with the\nvictim machine resides in a separate remote component; but this appealing abstraction\nis broken somewhat in the `DoubleFeature plugin which we will dig into later.)`\n\n\n-----\n\n3. Now the attacker gets to stare at the UI of the tool they invoked for as long as they like.\n\nEventually, they will probably want to invoke some functionality through this UI.\nDepending on the functionality chosen, the Python UI constructs a Remote Procedure\nCall (taken from raw hardcoded data inside the Python — no XMLs here). It sends this\nRPC to the DanderSpritz component on the victim machine. This component on the\nvictim side then executes the call and returns a result. In this way, RPCs are used as\nthe API which the component on the LP accesses to perform actions on the victim\nmachine (such as collecting screenshots or recording voice). This API is decoupled\nfrom the way these actions are actually implemented on the victim component side.\n4. The RPC returns with the precious information required by the attacker (or maybe just\n\na terse “action accomplished”). The Python UI consults the XML in the Plugin’s `PyLP`\ndirectory that matches the result’s message type. This XML specifies how to display the\nreturned information on the LP end, and the UI does so.\n\n\n-----\n\n**Figure 2: Example of XML files (both LP and Target) of a specific command.**\n\n## Focus on DoubleFeature\n\n\n-----\n\nTo better understand the above structure and flow, we focused our research on a component\nof DanderSpritz named Doublefeature (or `Df for short). According to its own internal`\ndocumentation, this plugin “Generates a log & report about the types of tools that could be\ndeployed on the target”; a lot of the framework tools, in their own internal documentation,\nmake the chilling claim that DoubleFeature is the only way to confirm their existence on a\ncompromised system. After some pause, we figured that at least this means DoubleFeature\ncould be used as a sort of Rosetta Stone for better understanding DanderSpritz modules,\nand systems compromised by them. DoubleFeature effectively, well, doubles as a diagnostic\ntool for victim machines carrying DanderSpritz — It’s an incident response team’s pipe\ndream.\n\n**Figure 3: Code of** [strangeland.py referring to the fact that the only way to confirm is with DF.](https://strangeland.py/)\n\nIn a perfect world, we wouldn’t need to explain anything about the inner workings of\nDoubleFeature under the hood. After all, we just went through a whole section on how\nDanderSpritz plugins in general work under the hood; and DoubleFeature is one such plugin;\ntherefore, everything above about RPC calls whose return values are formatted per an XSL\nspecification should still hold — right?\n\nUnfortunately, because of DoubleFeature’s unique function as a logging module, it collects a\nlarge amount of data of various types. RPC return values and XSL markup are just not suited\nto transfer and display information on this scale. An unexpected corner use case emerged,\nan ad-hoc solution was created specifically for it, and the “pretty and elegant framework for\neverything” vision was quietly taken to the backyard and shot. It’s a tale as old as time.\n\n\n-----\n\n**Figure 4: DoubleFeature main menu**\n\nDoubleFeature’s `PyScripts directory contains its Python UI interface (doublefeature.py) —`\nbut when the attacker chooses an option from the UI menu, behind the scenes instead of\nsimply issuing an RPC, the script transmogrifies a “template” DLL,\n```\nDoubleFeatureDll.dll.unfinalized, that resides in the plugin’s uploads directory.\n\n```\nThe Python invokes the external tool `AddResource.exe, found in the plugin’s` `tools`\ndirectory, to implant a resource into the already-compiled DLL and make it ready to detonate,\nunder a new name: `DoubleFeatureDll.dll.configured . The exact command run is:`\n```\n*local run -redirect command \"\n<g_dfconfiguretool> cmpf 6 1104 <configureddllpath> <g_dfrscfile>\"*\"\n\n```\nThe flags used by the command are explained below.\n```\n   c (compressed) – Zlib compress the data\n   m (munge) = Obfuscate the resource by XORing with pseudo-random bytes. The\n\n```\n[bytes are generated by running a PRNG (a 32-bit LCG, if you insist) and using the](https://en.wikipedia.org/wiki/Linear_congruential_generator)\nexecution timestamp as the seed; to allow recovery, the seed is prepended to the\nobfuscated resource.\n```\n   p (place) = Place the resource into a homebrew resource directory (more detail about\n\n```\nthis later).\n```\n   f (finalize) = Finalize the proprietary resource directory.\n   6 = Type of resource (in this case, the enum value 6 translates to RT_STRING, a\n\n```\nstring-table entry)\n```\n   1104 = Name of the resource.\n\n```\nAfter the main plugin DLL **is endowed with this new resource, the Python UI uses the\nDanderSpritz `dllload shell command to load it on the victim machine:`\n\n\n-----\n\n```\ndllload ordinal 1 library <configuredDllPath> \n\n```\nOnce the DLL on the victim side finishes running and writing the report to the log file on the\nvictim machine, the Python UI exfiltrates the log file back to the attacker machine using the\nfollowing DanderSpritz shell command:\n```\nforeground get <log_file_name> -name DFReport\n\n```\nWhile (as mentioned above) most output of DanderSpritz commands is viewed according to\nXSL specifications, the output of DoubleFeature is too large and varied for this approach to\nbe feasible. Instead, the attacker typically views the log file using a specialized program\nwritten for this purpose — `DoubleFeatureReader.exe, which can be available in the`\nplugin’s `tools directory.`\n\nDoubleFeature writes all its log data to a debug log file named `~yh56816.tmp ; this artifact`\n[was covered in Kaspersky’s 2015 report on the remote access tool dubbed “EquationDrug”](https://securelist.com/inside-the-equationdrug-espionage-platform/69203/)\n(more on that below). This log file is encrypted using the AES algorithm. Unless the user\nchanges the key manually, the default one used is `badc0deb33ff00d (possibly to spite`\nvegan developers).\n\n## Main DLL of DoubleFeature\n\nWhen the patched DLL ( `DoubleFeatureDll.dll.configured ) is first loaded on the`\nvictim machine, it looks for a resource named “106” in a homebrew resource directory. This\ndirectory resides in the “.text” section right after the actual code, and the DLL is able to find it\nby searching for a distinct magic value. The homebrew resource directory has the following\nstructure:\n```\n**Resource_Directory_struct**:\n     word word_0\n     word num_of_resources\n     Resource_data[] resource_array\n dword resource_directory_size\n dword magic_hash\n**Resource_data**:\n     word resource_type\n     word resource_num\n     dword offset_from_directory_start\n     dword resource_size\n\n```\nThis resource (which is distinct from the resource earlier grafted onto the DLL by invoking\n```\nAddResource.exe ) is encrypted at rest, and in order to be used, it must be decrypted and\n\n```\ndecompressed. The (equivalent Python of the) logic is below.\n\n\n-----\n\n```\ndef decrypt_decompress_resource(buf, seed):\n     output = bytearray(b'')\n     for i in range(len(buf)):\n          seed = (0xDD483B8F - (0x6033A96D * seed) % (2**32)) % (2**32)\n          cur_xor_key = seed >> 8\n          output.append((cur_xor_key & 0xff) ^ (buf[i] & 0xff))\n uncompressed_resource = zlib.decompress(output[4:])\n     return uncompressed_resource \n\n```\nResource 106, once decompressed, is a driver called hidsvc.sys. It is loaded into the kernel\nby invoking the EpMe exploit of CVE-2017-0005 (this is the very same exploit that had its\nlogic find its way into the Jian exploit somehow). After the driver is loaded, the DLL begins\ncommunicating with it using `DeviceIoControl s. The most interesting IOControlCode`\nsupported by the driver is 0x85892408, which allows user-mode code to directly invoke\nkernel functions by simply specifying the function name and the arguments. The driver\nexpects incoming messages with this code to be bundled with the following struct:\n```\n**ControlCode_input_buffer**:\n     dword export_func_hash\n     dword num_of_arguments_bufs\n     dword [0x20*num] arguments_buf\n\n```\nMost arguments are self-explanatory, given the purpose of this control code. The one detail\nthat bears explanation is the `export_func_hash – the function name is not passed`\nexplicitly, but instead a checksum of it. Upon receiving the struct, the driver iterates over\nevery exported function of `ntoskernl.exe computes the resulting checksum and`\ncompares the result with the provided `export_func_hash . Once a match is found, the`\ndriver concludes it has found the correct function. This is a standard method to obfuscate\nAPI calls, seen in many other pieces of malware.\n\nThe checksum computation logic can be seen below.\n```\ndef checksum(name, len):\n     val = 0\n     for i in range(1, len+1):\n          temp = (0x1A6B8613 * i) % (2**32)\n          val = val ^ (temp * ord(name[i-1]) % (2**32))\n     return val\n\n```\nSome sample checksum values:\n\n\n-----\n\n```\nZwQueryInformationProcess  0x62A0A841\nZwQueryObject        0xB7241E54\nZwOpenEvent         0xDE2837FA\nZwSetEvent          0x662E22E1\nZwOpenKey          0xA20F6388\nZwFsControlFile       0x407CC9F5\nZwQueryVolumeInformationFile 0x161C4B69\nZwQueryInformationFile    0xC0E4A30A\nZwSetInformationFile     0x535ACCEA\nZwReadFile          0xB8075119\nZwWriteFile         0xBAE70F4B\nZwClose           0x69023181\nZwCreateFile         0x01862336\nZwQueryDirectoryFile     0x41483801\nZwQuerySystemInformation   0x178B07C8\nZwCreateKey         0x01862336\nZwDeleteKey         0x2C9F7CA8\nZwQueryKey          0xBDD598E2\nZwEnumerateKey        0x8D3E3E7A\nZwSetValueKey        0x90A71127\nZwEnumerateValueKey     0x040F9817\nZwQueryValueKey       0xF655B34B\nZwDeleteValueKey       0x2A1BF746\nZwWaitForSingleObject    0x86324d14\n\n```\nThis isn’t the only aspect of DoubleFeature (and other Equation Group tools) to make life\ndifficult for forensic analysts. The strings used in DoubleFeature are decrypted — that alone\nis very standard — but they are decrypted on-demand per function, which is somewhat more\nfrustrating than usual, and they are re-encrypted once function execution completes, which is\n_much more frustrating than usual. DoubleFeature also supports additional obfuscation_\nmethods, such as a simple substitution cipher:\n```\ndef deobfuscate_strings(enc_strings):\n     for enc_string in enc_strings:\n          replace_buffer = [ 0x37, 0x3B, 0x5D, 0x4B, 0x45, 0x44, 0x3C, 0x5C,\n0x7B, 0x4F,\n           0x74, 0x41, 0x7D, 0x7E, 0x35, 0x46, 0x23, 0x2B, 0x72, 0x71,\n           0x40, 0x78, 0x4C, 0x55, 0x39, 0x56, 0x30, 0x5F, 0x50, 0x2C,\n           0x29, 0x2D, 0x79, 0x59, 0x3A, 0x57, 0x53, 0x69, 0x77, 0x63,\n           0x26, 0x70, 0x2A, 0x76, 0x60, 0x3D, 0x33, 0x31, 0x22, 0x47,\n           0x49, 0x4E, 0x75, 0x58, 0x34, 0x68, 0x6B, 0x20, 0x67, 0x32,\n           0x27, 0x65, 0x51, 0x28, 0x5B, 0x2E, 0x7C, 0x6F, 0x24, 0x4A,\n           0x3E, 0x64, 0x73, 0x6D, 0x7A, 0x3F, 0x6A, 0x54, 0x62, 0x42,\n           0x6C, 0x48, 0x2F, 0x25, 0x43, 0x52, 0x21, 0x66, 0x38, 0x5A,\n           0x61, 0x5E, 0x36, 0x4D, 0x6E, 0x00]\n          dec_string = ''\n          for i in range(len(enc_string)):\n              cur_place = ord(enc_string[i]) - 0x20\n              dec_string += chr (replace_b\nuffer[cur_place])\n          print(dec_string)\n\n```\n\n-----\n\nAnd a stream cipher based on a simple homebrew linear PRNG:\n```\ndef decrypt(seed, buffer, mask, first_hex_seed, second_hex_seed):\n     outut = ''\n     for i in range(len(buffer)):\n          seed = (((first_hex_seed * seed) % (2 ** 32)) + second_hex_seed) % (2\n** 32)\n          cur_xor_key = ((seed >> 16)) | mask\n          output += chr ((cur_xor_key & 0xff) ^ buffer[i])\n     return output\n\n```\nAs mentioned above, by virtue of its function, DoubleFeature is a unique source of\nknowledge pertaining to Equation Group tools — after all, the entire logging module depends\non an ability to query these tools on a victim system and verify which are present. Below we\nlist some of the tools probed by the logging module, some of which were unknown.\n\nApart from resources 106 and 1104, which are actively used in the DLL’s execution flow, the\nmain DLL’s homebrew resource directory also contains the following resources:\n\nResource 1004 – UnitedRake Restart DLL.\nResource 1005 – UnitedRake Shutdown DLL.\nResource 1006 – StraitBiZarre Restart DLL.\nResource 200 – Hashes of known boot managers that are being compared to BCD\npartition data.\nResource 1007 – Upgrade KillSuit module DLL — references to it can be found in the\ncode, but it can no longer be physically found in the directory. Possibly it existed in\nearlier versions of the DLL and was removed later.\n\n## Plugins Monitored by DoubleFeature\n\n### UnitedRake\n\n**UnitedRake (UR) is a remote access tool that can be used to target Windows machines. It is**\nan extensible and modular framework that is provided with a large number of plugins that\n[perform different information collection functions. This is the tool that Kaspersky dubbed](https://securelist.com/inside-the-equationdrug-espionage-platform/69203/)\n“EquationDrug” in their original report, published before the Shadow Brokers leak. The leak\nalso included the UnitedRake manual, which contained the configuration, commands, and\nmodules of this tool. DoubleFeature supports many management functions related to\nUnitedRake such as Shutdown, TipOff, KickStart and Enabling/Disabling logging.\n\nWe came across the following indicators of UnitedRake:\n\nMSNDSRV.sys – Kernel mode stage 0 and rootkit. Implements an NDIS driver for\nfiltering the network traffic. Until UR version 4.0.\nATMDKDRV.sys – Network-sniffer/patcher. Since UR version 4.1.\n\n\n-----\n\n_Software\\Classes\\CLSID\\{091FD378-422D-A36E-8487-83B57ADD2109}\\TypeLib or_\n“\\Registry\\Machine\\SOFTWARE\\Classes\\CLSID\\{091FD378-422D-A36E-8487_83B57ADD2209}\\TypeLib” – contains the GUID of UR, the special key registry key._\n“\\Registry\\Machine\\System\\CurrentControlSet\\Control\\Session Manager\\MemSubSys\\\n_{95FFB832-8B00-6E10-444B-DC67CAE0118A-F6D58114}” – KillSuit Logging data_\nrelated registry key.\n“Global\\64322D88-0CEA-4ce0-8562-67345B70C655” – File Mapping created in TipOff\ncommand.\n“*Global\\*6F27089A-3482-4109-8F5B-CB3143A1AB9A” and “*Global\\*667FBF02F406-4C0A-BA65-893747A0D372” – Events created in UR Shutdown.\n{A0CCDC61-7623-A425-7002-DB81F353945F-5A8ECFAD} – UnitedRake 3/4 Config\nData and Transport Info CLSID\n{30F3976F-90F0-B438-D324-07E031C7507E-981BE0DD} – UnitedRake Plugins Info\nCLSID\n{95FFB832-8B00-6E10-444B-DC67CAE0118A-F6D58114} – UnitedRake Logging data\nCLSID\n{01C482BA-BD31-4874-A08B-A93EA5BCE511} – UnitedRake’s mutex name.\n\n### StraitBizarre\n\n**StraitBizarre (SBZ) is an implant used for stealthy data exfiltration which is performed over**\n**FriezeRamp – a custom network protocol that is similar to IPSEC. It’s a cross-platform**\nproject, and different versions exist supporting Windows, Linux and mobile platforms (e.g.\n**DROPOUTJEEP for iPhone, and there’s even TOTEGHOSTLY for Windows Mobile).**\n\n\n-----\n\n**Figure 5: StraitBizzare information. Source: Der Spiegel**\n\nWe came across the following indicators of StraitBizarre inside DoubleFeature:\n\n{1B8C5912-8BE4-11D1-B8D3-F5B42019CAED} – SBZ CLSID for GUID, version and\nSpecial Status Keys.\n\n### KillSuit\n\n**KillSuit (KiSu) (“GrayFish” in the original Kaspersky report) is an unusual plugin in that once**\ndeployed on the victim machine, its entire mission is running other plugins, providing a\nframework for persistence and evasion. Some (not all) DanderSpritz plugins can be either\nrun individually, or be invoked through KillSuit. Its design is such that every instance of\nKillSuit running on the victim side can host a single tool (such as MistyVeal, below); and so, it\ncan easily happen that a victim machine will have several instances of KillSuit installed on it,\neach hosting a different post-exploitation tool. The data for each KillSuit instance, including\nall its modules, is kept encrypted in registry entries. This is something unique to KillSuit and\nis not a feature of DanderSpritz plugins in general.\n\n\n-----\n\nDoubleFeature logs a great amount of data pertaining to KillSuit. In fact, there is also some\ndead code inside DoubleFeature that allows deleting, upgrading and pushing module\nupdates into running KillSuit instances (we agree with the decision to deprecate this code;\nafter all, DoubleFeature is supposed to be used for logging, and we’ll soon see this\nfunctionality in the KillSuit Python UI, where it belongs). While “KillSuit” is the name used\ninside DoubleFeature and in the outer-layer DanderSpritz CLI that the attacker will actually\ninvoke, actually the Plugin folder name used internally is DecibalMinute (DeMi for short). The\nPython UI logic can mainly be found inside 3 scripts that, unsurprisingly, reside in the plugin’s\n```\npyscripts directory.\n\n```\n“Mcl_Cmd_DiBa_Tasking.py” – handles KiSu installation, uninstallation and\nupgrades. As a parameter, this script accepts the type of persistence mechanism to\nuse; there are 4 types of persistence, helpfully named “Default”, “Launcher”, “SoTi” and\n“JuVi”. We elaborate on their internal workings a bit further below. Under the hood, the\nPython UI implements this via an RPC call (RPC_INFO_INSTALL).\n“Mcl_Cmd_KisuComms_Tasking.py” – used to establish a connection with a running\ninstance of KillSuit on the victim end, and provides functionality for dynamically loading\nand unloading modules/drivers.\n“_KiSu_BH_enable.py” – One of KillSuit’s internal drivers is called “BroughtHotShot”,\nor BH for short. This script does not enable it, but checks whether it is enabled (via\nDanderSpritz commands `available -command kisu_install -isloaded and`\n```\n   available -command kisu_install -load ). If you want to enable the driver, you\n\n```\nneed to do `KiSu_BH_enable.py on, and disabling it is` `KiSu_BH_enable.py off .`\n“Mcl_Cmd_KiSuFullList_Tasking.py” – Produces a list of current KiSu installations on\nthe target machine. Behind the scenes, this is done by invoking the `kisu_list`\nDanderSpritz command, and then for every returned installation, retrieving its\nconfiguration via the DanderSpritz command `kisu_config -instance id -`\n```\n   checksum . This configuration contains various technical details such as the KillSuit\n\n```\nversion, the installation’s registry key and value, the loaders for the kernel and user\nmodules, the directory of the encrypted virtual filesystem used to keep the hosted\nplugin’s modules, the legitimate driver that’d been victimized by injecting the hosted\nplugin into it, and the flags used internally when launching KillSuit on the victim.\n\nEvery KillSuit instance has an internal record of an “ID” of the tool hosted inside the instance,\nwhich is universally the same per tool. We found referenced inside DoubleFeature to the\nfollowing possible instances:\n\nPC (PeddleCheap) – 0x7A43E1FA – provides an interactive shell and some feature for\nlong-term persistence. Also serves as a post-exploitation tool in itself, and can install\nother KillSuit instances on a compromised host.\nUR (UnitedRake) – 0x91FD378 – see above\nSTLA (StrangeLand) / GROK – 0x1A0F5582 – these are both keyloggers. Their\nencrypted logs are stored inside files with names of the form `tm154*.da .`\n\n\n-----\n\nSNUN (SnuffleUnicorn) – 0x23A4732A\nWRWA (WraithWrath) – 0x502BB710\nSLSH (SleepySheriff) – 0x32A7032D\nWORA (WoozyRamble) – 0x68A40E49\nTTSU (TiltTsunami) – 0x8F1D6511\nSOKN (SoberKnave) – 0x8F1D6510 – This tool has functionality for data exfiltration\nthrough unused/disabled WiFi cards. It is used in Air-Gapped targets.\nMAGR (MagicGrain) – 0x437E52E8\nDODA (DoubleDare) – 0x1C9D4A8A\nSAAN (SavageAngel) – 0x9D801C63\nMOAN (MorbidAngel) – 0x9D801C62\n[DEWH (DementiaWheel) – 0xAE37690B – Hacking tool also known as “Fanny”.](https://securelist.com/a-fanny-equation-i-am-your-father-stuxnet/68787/)\nCHMU (ChinMusic) – 0x39B2DA17\nMAMO (MagicMonkey) – 0x2D473AB3\nMABE (MagicBean) – 0x8675309 – used for WiFi Man In The Middle\n\n### DiveBar\n\n**DiveBar (DiBa) is DoubleFeature’s name for the part of KillSuit responsible for persistence**\nmethods (such as “KSLA” (KillSuit loader), “SolarTime”, “JustVisiting” and “DoctorOcopus”.\n\nThe different persistence methods, which we mentioned above by name, are:\n\nKSLA (Launcher) – Simply installs a new driver on the victim system and uses it for\npersistence. This worked up until Microsoft introduced Driver Signing Enforcement\n(DSE), which does not allow unsigned drivers to run. This method is not supported in\nWindows Vista and later.\nJustVisiting (JuVi) – In order to bypass DSE, this persistence mechanism abuses a\nknown vulnerability in the signed driver ElbyCDIO.sys, which is a part of the software\n“CloneCD” by RedFox. The vulnerable driver is made to be loaded, and exploited, on\nsystem startup. The elevated privileges obtained in this way are then used to add\nDiveBar’s persistence driver to LSAExtensionConfig/interfaces. This method is only\ncompatible with Windows 8.\nSolarTime (SoTi) – An advanced persistence mechanism that works by modifying one\n[of the victim system’s VBRs. More details about this method can be found in this report](https://blog.f-secure.com/is-killsuit-lying-in-wait/)\nby F-Secure. Only compatible with NTFS filesystems with FVEBOOT and a certain\nboot sector format. SoTi compares the hash of the boot sector to a list of “known good”\nhashes, which are listed below.\n\n\n-----\n\n```\nC454045E1299C5AD5E2932A7B0016D7A\nC1544A2220F5DD61A62C697D9A2C5B77\n05422319E7821018401F477B3621F8E2\n4C85F9D2D0B02E0B3BDFC34D0F63B414\n0023DE8F74BF9F932AFC9E288082E660\n58B9130DEEFF83F1185C372595CD4607\nB4A78F824A7F0FA688DF729F2AEF7F7F\nDCE6AAAD1574BC72A25DC4551D52A2C1\n\n```\nAs mentioned above, KillSuit keeps inside the victim registry something called a “module\nstore”. Traditionally the registry has been used in malware to store simple configuration data,\nas per the registry’s legitimate purpose; but as years have passed, more and more malware\nhas gotten bold in using the registry to store arbitrary data. Here the registry is made to\nswallow a whole Virtual File System containing the module store, which is generated by\nconcatenating two words chosen pseudo-randomly from two hard-coded dictionaries (the\ncreation time of the victim’s root directory is used as the seed). The list of possible values for\nthe first word is reproduced below:\n\n\n-----\n\n```\nAccount\nAcct\nAdapter\nApp\nAudit\nBoot\nClass\nCorrection\nDebug\nDir\nDirectory\nDomain\nDriver\nEvent\nFont\nHardware\nHiber\nHost\nLanguage\nLegacy\nLocale\nLogon\nManufacturer\nMedia\nNet\nNetwork\nOEM\nPower\nPrefetch\nPrivilege\nProcess\nRemote\nScheduler\nSecurity\nServer\nShared\nShutdown\nStartup\nTask\nTrust\nUninstall\nUser\nWin16\nWin32\n\n```\nAnd the possible values for the second word:\n\n\n-----\n\n```\nCache\nCfg\nConfig\nData\nDatabase\nDb\nExts\nFlags\nHierarchy\nHistory\nInfo\nLibs\nList\nLogs\nMappings\nMaps\nMgmt\nMon\nMonitor\nPerformance\nPlugins\nPolicy\nProfile\nRecords\nRegistry\nSettings\nSetup\nSupport\nUsage\n\n```\nLooking at the architecture of “GrayFish” as reported by Kaspersky, we are left with the\nimpression that it is one and the same as KillSuit:\n\n\n-----\n\n**Figure 6: Architecture of GrayFish. Source: Kaspersky**\n\nThe resources in the diagram are in a one-to-one correspondence with the DiveBar\nresources:\n\n102 – fvexpy.sys – F7F382A0C610177431B27B93C4C87AC1\n\n103 – mpdkg32.dll – 0182DBF3E594581A87992F80C762C099\n\n104 – BroughtHotShot driver – drmkflt.sys – 9C6D1ED1F5E22BF609BCF5CA6E587DEC /\nD3DF8781249F2C404C4935CA9FFB1155\n\n107 – New VBR (for SolarTime)\n\n110 – mpdkg64.dll – F01525C9EF763C49E28CEC6C2F6F6C60\n\n114 – Elby loader – fhsvcapi.dll – 6156E50571571B233019C4EBB472899D\n\n115 – Elby driver – AAA8999A169E39FB8B48AE49CD6AC30A\n\nDiveBar does not limit itself to abusing ElbyCDIO.sys; it also searches for vulnerable benign\ndrivers already present on the victim’s machine to be used as a “launcher” for the hosted\nplugin’s code. Internally, such a benign driver that is chosen by DiveBar to launch KillSuit\n\n\n-----\n\ninstance is called a thunk (this might be the place to mention that according to the MerriamWebster dictionary, the only meaning of the word “thunk” is as a present-tense verb meaning\n“to produce a flat hollow sound”; the author of the original PE file format caused enough\nsuffering by using this mysterious word as a description for an opaque digital object, and we\nare sad to see this practice repeated here). For every KillSuit instance, DoubleFeature\nreports the thunk exploited dll used to load its kernel-mode module, which is called the KML\n(Kernel Module Launcher) for short. A similar report is made for the User Mode Launcher\n(UML).\n\n### FlewAvenue\n\n**FlewAvenue(FlAv) is an IPv4 driver that provides covert network access for other tools. It**\nprovides different networking faculties such as DNS queries and ICMP echo (“ping”).\n\nWe came across the following indicators of FlewAvenue:\n\n“ntevt.sys ” – The name of this tool’s driver.\n\n### DuneMessiah\n\nDoubleFeature diagnostics only provide very minimal information regarding this tool. For this\ntool, DoubleFeature reports a pseudorandomly-generated “Event Name” that the instance on\nthe victim machine uses internally, as well a number of “registered KillSuit instances”.\n\n### CritterFrenzy\n\nDoubleFeature reports only the bare minimum of information about this plugin as well. From\nthe information we can see DoubleFeature collects regarding this tool, it seems to be another\ninstance of KillSuit that probably has been used in the past and its ID was 333.\n\nWe came across the following indicators of CritterFrenzy:\n\n“MPDKH32” – The name of this tool.\n\n### MistyVeal\n\nMistyVeal (MV) is a “validator” implant, meaning that it is used to verify that the targeted\nsystem is indeed an authentic victim and not a research environment. It is implemented as\nan Internet Explorer Browser Helper Object (these are typically used for extending IE\nfunctionality; for example, Adobe’s Acrobat plugin for IE is a Browser Helper Object).\nMistyVeal was also part of the Equation Group’s original “Double Fantasy” implant, a\nprecursor of UnitedRake. You can read more about it and the connection to Regin in a report\nby [EpicTurla.](https://www.epicturla.com/previous-works/hitb2020-voltron-sta)\n\n“nethdlr.sys” – The name of this tool’s driver.\n\n\n-----\n\nWe came across the following indicators of MistyVeal:\n\n{B812789D-6FDF-97AB-834B-9F4376B2C8E1} – MV CLSID for GUID and version.\n\n### DiceDealer\n\nDiceDealer (DD), mentioned in the leaked UnitedRake manual, is a parsing tool for the\nlogging data produced by all installations and uninstallations performed by DiveBar (this is\nrelevant to UnitedRake because DiveBar is typically used to install it). If you are looking to\nmanually parse DiceDealer log files, the easiest method is to copy the log file into the same\ndirectory where the DiceDealerReader tool is located. The reader is dependent on several of\nthe files within that directory and will fail to parse the log if they are not present.\n\n### PeddleCheap\n\nPeddleCheap ****(PC) is among the first tools to be run on a victim machine, and can be\nused to bootstrap a complete DanderSpritz installation. PeddleCheap has minimal\nfunctionality allowing attackers to connect to the victim machine and remotely install and\nconfigure implants that allow further post-exploitation functionality, including a full install of\nthe DanderSpritz framework. PeddleCheap is usually injected into lsass.exe by several\nmethods, including the DOUBLEPULSAR backdoor.\n\n**Figure 7: PeddleCheap User Interface.**\n\nWe came across the following indicators of PeddleCheap:\n\n{A682FEC0-333F-B16A-4EE6-24CC2BAF1185} – PC CLSID for GUID and version.\n\n## Control flow of DoubleFeature’s Rootkit\n\nThe rootkit used by DoubleFeature ( hidsvc.sys ) performs the following actions when it is\nloaded:\n\nIt creates an unnamed device object but registers IRP dispatch functions.\nIt dispatches IOCTL requests.\nIt specializes in run-time patching of Windows kernel code.\nIt runs kernel APIs for the user-mode module.\n\n\n-----\n\nThe rootkit is patched by the user-mode DLL before being loaded into memory — this is\ndone to insert the PID of the user-mode process so that the rootkit knows which process to\nhide. The rootkit then attaches to this accomplice user-mode process via\n```\nKeAttachProcess .\n\n```\nThe rootkit finds the dynamic addresses of API functions using HalAllocateCommonBuffer or\nMmIsAddressValid (the addresses for these functions are earlier obtained by invoking\nMmGetSystemRoutineAddress). It uses encrypted stack strings which are decrypted on a\nneed-to-use basis and encrypted again immediately after they are used, similarly to the\nmethod used in the user-mode component of DoubleFeature that we described earlier.\n\nIn order to avoid detection, the rootkit also takes care to create its own driver objects as\nstealthily as possible. First, instead of creating the object directly, the rootkit creates a handle\nto `Device\\\\NULL, then hijacks its FileHandle by inserting its own device object with the`\nname `driver\\\\msvss . Then, it uses this FileObject to send a` `IRP_MJ_Create request in`\norder to obtain a handle to the newly created driver object. Second, the rootkit calls\n```\nObMakeTemporaryObject and removes the name of the object from its parent object\n\n```\nmanager directory, effectively unlinking it from the structs that the OS uses internally to keep\ntrack of loaded drivers. Because of the way Windows OS handles drivers, this has the effect\nof keeping the driver running in the background while diagnostic tools and researchers will\nfail to find the driver.\n\nThe IRP_MJ_DEVICE_CONTROL handler function of the new device contains the different\nIoControl codes that can be sent from the user-mode DLL (such as 0x8589240c for\ntruncating a file, and 0x85892408 for executing an API call in kernel mode and sending the\noutput back to the user-mode process).\n\n## Conclusion\n\nSometimes, the world of high-tier APT tools and the world of ordinary malware can seem like\ntwo parallel universes. Cybercriminals periodically produce the umpteenth Cryptolocker\nclone or, at most, another modular jack-of-all-trades Emotet wannabe; in the meanwhile,\nnation-state actors tend to clandestine, gigantic codebases, sporting a huge gamut of\nfeatures that have been cultivated over decades due to practical need. For those of us with\nour heads deep enough up the cybercrime industry’s nether regions, many of the features\ndescribed above — rootkits, dedicated components to thoroughly vet victims, whole systems\ndedicated to logging the stages of post-exploitation — are, largely, abstract theory. The\ncybercrime industry’s DoubleFeature is typically an HTTP `GET request containing`\n```\n&OS=win10, encrypted by some homebrew variant of RC4. The gap can really not be\n\n```\noverstated.\n\nIt’s not often that we get such a candid glimpse into tools of this degree of sophistication, as\nthe Shadow Brokers leak allowed us. The DanderSpritz-tier projects of the world are\nnaturally covered by a shroud of secrecy — even, as we’ve seen, from fellow APT actors,\n\n\n-----\n\nwho can maybe at best get their hands on a rival tool once in a blue moon, as happened with\nEpRom which led to the creation of Jian. As an industry, it turns out we too are still slowly\nchewing on the 4-year-old leak that revealed DanderSpritz to us, and gaining new insights.\nOn the defenders’ side, we have the duty to study these marvels of infosec engineering\ncarefully and apply the lessons learned — before lower-tier, run-of-the-mill attackers do the\nsame.\n\n## Appendix 1: Table of Command-Line Argument Supported by DoubleFeature Main DLL\n\n\nOption Arguments Relevant\ncommand\nin the\nmenu\n\n\nDescription\n\n\n-n/-m Registry key name Check if a registry\nkey exists or not.\n\n-o – Returns\nDuneMessiah\ninformation\n\n-p filename Changes the log file\nname.\n\n-q Hash, ID/Name Deletes KillSuit\nmodule.\n\n-s ‘u’/’s’ Shutdowns\nUnitedRake or\nStraitBizarre\n\n-t IP, port TipOffs UnitedRake\n\n-u Hash, ID/Name Upgrades KillSuit\nmodule\n\n-v Hash, ID/Name Downloads KillSuit\nmodule\n\n-x filename Truncates file on\nvictim’s computer\n\n-g IP:port Checks FlewAvenue\nfeature compatibility\n\n-h ‘u’/’s’ Stops FA in UR or\nSBZ\n\n\n-----\n\n-i k = KillSuit m = Manual Instances p =\nProcesses info q = Modules Data s =\nStraitBiZarre u = UnitedRake c= CritterFrenzy\nd = DiveBar e = Loaded Drivers f =\nFlewAvenue g = Special Implant i = Implant\nIndependet\n\n\nGives information\nabout the tool given\nas an argument\n\n\n-j 0/1 Get DiceDealer logs\n– DiveBar\ninformation on the\nvictim’s computer.\n\n-k ‘u’/’s’ KickStarts UR or\nSBZ\n\n-l – DFQuery Query information\nas in ‘i’ command\nbut on several tools\non one command.\n\n-f – Toggles FlewAvenue\nmode – as a\nnetwork sniffer or as\na memory patcher. It\ndoes this by\nchanging the\n“config2” SubKey.\n\n-a new AES key Replaces the AES\nkey for encrypting\nthe logs.\n\n-b/-e registry key Deletes DiveBar\nregistry key\n\n-c – –\n\n-d on/off Enable/Disable UR\nlogging\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-27 - A Deep Dive into DoubleFeature, Equation Group’s Post-Exploitation Dashboard.pdf"
    ],
    "report_names": [
        "2021-12-27 - A Deep Dive into DoubleFeature, Equation Group’s Post-Exploitation Dashboard.pdf"
    ],
    "threat_actors": [
        {
            "id": "b740943a-da51-4133-855b-df29822531ea",
            "created_at": "2022-10-25T15:50:23.604126Z",
            "updated_at": "2025-03-27T02:00:55.505366Z",
            "deleted_at": null,
            "main_name": "Equation",
            "aliases": [
                "Equation"
            ],
            "source_name": "MITRE:Equation",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "52d5d8b3-ab13-4fc4-8d5f-068f788e4f2b",
            "created_at": "2022-10-25T16:07:24.503878Z",
            "updated_at": "2025-03-27T02:02:10.261742Z",
            "deleted_at": null,
            "main_name": "Lapsus$",
            "aliases": [
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "ETDA:Lapsus$",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d4f7cf97-9c98-409c-8b95-b80d14c576a5",
            "created_at": "2022-10-25T16:07:24.561104Z",
            "updated_at": "2025-03-27T02:02:10.281202Z",
            "deleted_at": null,
            "main_name": "Shadow Brokers",
            "aliases": [],
            "source_name": "ETDA:Shadow Brokers",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "be5097b2-a70f-490f-8c06-250773692fae",
            "created_at": "2022-10-27T08:27:13.22631Z",
            "updated_at": "2025-03-27T02:00:55.534879Z",
            "deleted_at": null,
            "main_name": "LAPSUS$",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "Strawberry Tempest"
            ],
            "source_name": "MITRE:LAPSUS$",
            "tools": [
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "d4b9608d-af69-43bc-a08a-38167ac6306a",
            "created_at": "2023-01-06T13:46:39.335061Z",
            "updated_at": "2025-03-27T02:00:03.053961Z",
            "deleted_at": null,
            "main_name": "LAPSUS",
            "aliases": [
                "LAPSUS$",
                "DEV-0537",
                "SLIPPY SPIDER",
                "Strawberry Tempest"
            ],
            "source_name": "MISPGALAXY:LAPSUS",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "08623296-52be-4977-8622-50efda44e9cc",
            "created_at": "2023-01-06T13:46:38.549387Z",
            "updated_at": "2025-03-27T02:00:02.859535Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "Tilded Team",
                "EQGRP",
                "G0020"
            ],
            "source_name": "MISPGALAXY:Equation Group",
            "tools": [
                "EquationLaser",
                "EquationDrug",
                "DoubleFantasy",
                "TripleFantasy",
                "GrayFish"
            ],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "171b85f2-8f6f-46c0-92e0-c591f61ea167",
            "created_at": "2023-01-06T13:46:38.830188Z",
            "updated_at": "2025-03-27T02:00:02.929729Z",
            "deleted_at": null,
            "main_name": "The Shadow Brokers",
            "aliases": [
                "Shadow Brokers",
                "ShadowBrokers",
                "The ShadowBrokers",
                "TSB"
            ],
            "source_name": "MISPGALAXY:The Shadow Brokers",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "aacd5cbc-604b-4b6e-9e58-ef96c5d1a784",
            "created_at": "2023-01-06T13:46:38.953463Z",
            "updated_at": "2025-03-27T02:00:02.961301Z",
            "deleted_at": null,
            "main_name": "APT31",
            "aliases": [
                "JUDGMENT PANDA",
                "BRONZE VINEWOOD",
                "Red keres",
                "Violet Typhoon",
                "TA412"
            ],
            "source_name": "MISPGALAXY:APT31",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2d9fbbd7-e4c3-40e5-b751-27af27c8610b",
            "created_at": "2024-05-01T02:03:08.144214Z",
            "updated_at": "2025-03-27T02:05:17.419705Z",
            "deleted_at": null,
            "main_name": "PLATINUM COLONY",
            "aliases": [
                "Equation Group "
            ],
            "source_name": "Secureworks:PLATINUM COLONY",
            "tools": [
                " EquationDrug",
                " EquationLaser",
                " Fanny",
                " GrayFish",
                " TripleFantasy",
                "DoubleFantasy"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "9e6186dd-9334-4aac-9957-98f022cd3871",
            "created_at": "2022-10-25T15:50:23.357398Z",
            "updated_at": "2025-03-27T02:00:55.452383Z",
            "deleted_at": null,
            "main_name": "ZIRCONIUM",
            "aliases": [
                "APT31",
                "Violet Typhoon"
            ],
            "source_name": "MITRE:ZIRCONIUM",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "e0fed6e6-a593-4041-80ef-694261825937",
            "created_at": "2022-10-25T16:07:23.593572Z",
            "updated_at": "2025-03-27T02:02:09.879892Z",
            "deleted_at": null,
            "main_name": "Equation Group",
            "aliases": [
                "APT-C-40",
                "Platinum Colony",
                "Tilded Team"
            ],
            "source_name": "ETDA:Equation Group",
            "tools": [
                "Bvp47",
                "DEMENTIAWHEEL",
                "DOUBLEFANTASY",
                "DanderSpritz",
                "DarkPulsar",
                "DoubleFantasy",
                "DoubleFeature",
                "DoublePulsar",
                "Duqu",
                "EQUATIONDRUG",
                "EQUATIONLASER",
                "EQUESTRE",
                "Flamer",
                "GRAYFISH",
                "GROK",
                "OddJob",
                "Plexor",
                "Prax",
                "Regin",
                "Skywiper",
                "TRIPLEFANTASY",
                "Tilded",
                "UNITEDRAKE",
                "WarriorPride",
                "sKyWIper"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "774f15f7-832e-4cd4-a1fa-ec6a838f2a40",
            "created_at": "2022-10-25T16:47:55.641406Z",
            "updated_at": "2025-03-27T02:05:17.29791Z",
            "deleted_at": null,
            "main_name": "BRONZE VINEWOOD",
            "aliases": [
                "Judgment Panda ",
                "ZIRCONIUM ",
                "APT31 "
            ],
            "source_name": "Secureworks:BRONZE VINEWOOD",
            "tools": [
                " HanaLoader",
                " Metasploit",
                " Mimikatz",
                " Reverse ICMP shell",
                " Trochilus",
                "DropboxAES RAT"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536214,
    "ts_updated_at": 1743041746,
    "ts_creation_date": 1653761673,
    "ts_modification_date": 1653761673,
    "files": {
        "pdf": "https://archive.orkl.eu/ff58191980a160360ca8be03e1f3b2fe4ce44b4d.pdf",
        "text": "https://archive.orkl.eu/ff58191980a160360ca8be03e1f3b2fe4ce44b4d.txt",
        "img": "https://archive.orkl.eu/ff58191980a160360ca8be03e1f3b2fe4ce44b4d.jpg"
    }
}