{
    "id": "b168f3ef-e25a-47c2-a6b3-82c8b2a1a7d6",
    "created_at": "2023-09-02T02:07:12.705912Z",
    "updated_at": "2025-03-27T02:16:05.786782Z",
    "deleted_at": null,
    "sha1_hash": "7f63835b11b573cf675368597c6b4eb67bebd931",
    "title": "",
    "authors": "",
    "file_creation_date": "0001-01-01T00:00:00Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 949640,
    "plain_text": "# United States District Court\n\n**CENTRAL** **DISTRICT OF** **CALIFORNIA**\n\n\n**In the Matter of the Seizure of**\n**(Address or Brief description of property or premises to be seized)**\n\n\nAll virtual assets contained within 20 virtual currency\n**APPLICATION AND AFFIDAVIT FOR A**\nwallets further described in Attachment A\n**SEIZURE WARRANT BY TELEPHONE OR**\n**OTHER RELIABLE ELECTRONIC MEANS**\n\n**CASE NUMBER: 2:23-MJ-4251**\n\n**I,** **, being duly sworn depose and say:**\n\n**I am a Special Agent with the Federal Bureau Investigation, and have reason to believe that**\n\n**in the             CENTRAL               District of** **CALIFORNIA**\n**there is now concealed a certain person or property, namely (describe the person or property to be seized)**\n\nAll virtual assets contained within 20 virtual currency wallets further described in Attachment A\n\n**which is (state one or more bases for seizure under United States Code)**\n\nsubject to seizure and forfeiture under 18 U.S.C. §§ 981(a)(1)(A), (C), and (b), 982(b), and 21 U.S.C. § 853.\n\n**concerning a violation of Title 18 United States Code, Section(s)** 1030, 1343, and 1956.\n\n**The facts to support a finding of Probable Cause for issuance of a Seizure Warrant are as follows:**\n\n**Continued on the attached sheet and made a part hereof.** X Yes **No**\n\n**Sworn before me in accordance with requirements of**\n**Fed. R. Crim. P. 4.1 by telephone**\n\nAugust 23, 2023 **Los Angeles, California**\n\n**Date** **City and State**\n\n\n-----\n\n-----\n\n**AFFIDAVIT**\n\nI,, being duly sworn, declare and state as\n\nfollows:\n\n**I.** **PURPOSE OF AFFIDAVIT**\n\n1. This affidavit is made in support of an application\n\nfor a warrant to seize virtual currency contained in 20 virtual\n\ncurrency wallets (the “Qakbot Wallets”). Should this warrant be\n\nauthorized, the contents of the Qakbot Wallets will be sent to\n\nU.S. government-controlled virtual currency wallets. The Qakbot\n\nWallets are defined further below and in Attachment A.\n\n2. The FBI is investigating the Qakbot malicious software\n\n(“malware”) and its associated botnet.[1] The Qakbot malware is\n\ncontrolled by a cybercriminal organization, and its operators\n\nand administrators use Qakbot to target critical industries\n\nworldwide. The Qakbot administrators facilitate further attacks\n\non victims by ransomware actors and are paid portions of the\n\nransom proceeds using virtual currency. Evidence collected thus\n\nfar in the investigation establishes that there is probable\n\ncause to believe that the Qakbot Wallets contain the proceeds of\n\nthe Qakbot organization’s criminal activity.\n\n3. As part of this investigation, FBI agents, analysts,\n\nand computer scientists identified and gained access to much of\n\nthe Qakbot computer infrastructure, including computers used by\n\n1 A botnet is a network of computers (each a “bot”) that\nhave been infected with malicious software (here, Qakbot) and\nare being controlled as a group without the owners’ knowledge,\nfor example, to send spam messages to other potential victims.\nQakbot is known by various other names, including Qbot and\nPinkslipbot.\n\n\n-----\n\nadministrators of the botnet (the “Qakbot Admin Computers”).\n\nBased on information from the Qakbot Admin Computers, I and\n\nother agents were able to identify the Qakbot Wallets.\n\n4. As set forth in more detail below, there is probable\n\ncause to believe that the Qakbot administrators and their co\nconspirators have committed violations of 18 U.S.C. § 371\n\n(Conspiracy), 18 U.S.C. § 1030(a)(5)(A) (Computer Fraud), 18\n\nU.S.C. 1343 (Wire Fraud), 18 U.S.C. § 1956 (Money Laundering),\n\nand 18 U.S.C. § 2511 (Wire Tapping) (collectively, the “Subject\n\nOffenses”). As described below, there is also probable cause to\n\nseize the Qakbot Wallets as property subject to forfeiture\n\npursuant to 18 U.S.C. § 982(a), 981(a)(1)(A), (C), and 981(b).\n\n5. This application seeks a seizure warrant under both\n\ncivil and criminal authority, as opposed to relying on a\n\nprotective order under 21 U.S.C. § 853(e), because the property\n\nto be seized could easily be placed beyond process if not seized\n\nby warrant, as virtual currency is fungible and easily\n\ndissipated.\n\n6. The facts set forth in this affidavit are based upon\n\nmy personal observations, my training and experience, and\n\ninformation obtained from various law enforcement personnel and\n\nwitnesses. This affidavit is intended to show merely that there\n\nis sufficient probable cause for the requested warrant and does\n\nnot purport to set forth all of my knowledge of our\n\ninvestigation into this matter. Unless specifically indicated\n\notherwise, all conversations and statements described in this\n\n\n-----\n\naffidavit are related in substance and in part only, all amounts\n\nor sums are approximate, and all dates and times are on or about\n\nthose indicated.\n\n**II.** **BACKGROUND OF AFFIANT**\n\n7.\n\n**III.** **STATEMENT OF PROBABLE CAUSE**\n\n**A.** **Background on Qakbot Malware and Botnet**\n\n8. The Qakbot malware is primarily spread to victims\n\nthrough spam email messages that contain malicious attachments\n\nor hyperlinks. After the initial infection, the victim computer\n\nis effectively controlled by the Qakbot administrators, and the\n\n\n-----\n\nQakbot malware can deliver both commands and further malware to\n\nthe computer. As of June 2023, there were approximately 200,000\n\nactive Qakbot victim computers located in the United States and\n\napproximately 700,000 victim computers worldwide.[2]\n\n9. Qakbot’s operators and administrators offer other\n\ncybercriminal groups access to the botnet for a fee, an\n\narrangement that I know from my experience is common among cyber\n\ncriminals. From this and other FBI investigations, I know that\n\nQakbot has been used as an initial means of infection by many\n\nprolific ransomware groups in recent years, including Conti,\n\nProLock, Egregor, REvil, MegaCortex, and Black Basta. These\n\nransomware groups typically gain access to a victim computer or\n\ncomputer network, steal victim data, and then encrypt the victim\n\ncomputers making them unusable. The ransomware groups then\n\nextort the victims, seeking payment to (1) return access to the\n\nvictim computers; and/or (2) stop the release of the victim’s\n\nstolen data on the internet. These payments are typically\n\ndemanded in virtual currency, commonly in Bitcoin (or BTC).\n\n10. The FBI has identified hundreds of victims worldwide,\n\nincluding in the Central District of California, who have\n\nsuffered harm due to Qakbot-delivered malware and assesses that\n\n2 The FBI has identified the IP addresses of many putative\nvictim computers. An IP address is a numerical address used to\nroute traffic on the internet. A single IP address can manage\ninternet traffic for more than one computer or device, such as\nwhen a router in one’s home routes traffic to one’s desktop\ncomputer, as well as one’s tablet or smartphone, while all using\nthe same IP address to access the internet. Based on publicly\navailable records and IP address geolocation, the FBI can\ndetermine the geographic region where devices using a specific\nIP address are likely to be located.\n\n\n-----\n\nthose losses measure in the tens of millions of dollars. For\n\nexample, between October 2021 and April 2023, records found on a\n\nQakbot Admin Computer show the payment of fees to Qakbot\n\nadministrators corresponding to ransoms paid by victims totaling\n\napproximately $58 million. Qakbot victims included companies in\n\nthe Central District of California, like a victim,\n\nwhose computer network was infected with Qakbot and was\n\nthereafter the victim of a ransomware attack by the Black Basta\n\ngroup and paid a ransom of approximately $3 million in BTC to\n\nregain access to encrypted computers.\n\n11. For their role in providing initial access to victim\n\ncomputers, the Qakbot administrators are paid a portion of any\n\nransom payments received by the ransomware group. As explained\n\nbelow, the FBI has determined that payments to Qakbot from\n\nransom proceeds have been deposited into the Qakbot Wallets.\n\n**B.** **Training and Experience Regarding Cryptocurrency**\n\n12. From my training and experience investigating\n\ncryptocurrency transactions and crimes involving the use of\n\ncryptocurrency, I know the following:\n\na. “Cryptocurrency” or “virtual currency” is a\n\ndigital asset designed to work as a medium of exchange that uses\n\ncryptography to secure financial transactions, control the\n\ncreation of additional units of the currency, and verify and\n\ntransfer assets. BTC is one popular type of virtual currency\n\nbut there are multiple other types of virtual currency.\n\nb. Transactions involving most types of virtual\n\ncurrency are recorded and visible on a public ledger called a\n\n\n-----\n\nblockchain, where each transaction is referred to by a lengthy\n\nseries of letters or numbers that identify the “address” from\n\nwhich the virtual currency was transferred, and the destination\n\nto which the virtual currency was sent. These addresses are\n\nanalogous to a bank account number.\n\nc. Virtual currency stored at a particular address\n\nis accessed using private encryption “keys.” Those private keys\n\nare necessary to access the virtual currency stored at a\n\nparticular address. Only the holder of the private key can\n\naccess or transfer virtual currency out of an address. A\n\nprivate key is analogous to the pin code necessary to access a\n\nbank account.\n\nd. Most types of virtual currency record all\n\ntransactions in that currency on a blockchain. The blockchain\n\nserves as an immutable and historical record of transactions in\n\nthe associated virtual currency – essentially a distributed\n\npublic ledger. Blockchains are constantly updated and maintain\n\na record of every transaction and the known balance for each\n\nvirtual currency address associated with that blockchain. Some\n\nvirtual currencies focus on transaction privacy and portions of\n\ntheir blockchains are not visible online to everyone. Those\n\ntypes of privacy-focused virtual currencies are often referred\n\nto as “anonymity enhanced cryptocurrency” or “AEC.” There are\n\ndifferent blockchains for different types of virtual currencies,\n\nand some virtual currencies have been implemented on multiple\n\nblockchains.\n\n\n-----\n\ne. There are many types of virtual currency wallets.\n\nAs is relevant to this affidavit, one type of virtual currency\n\nwallet is a software application that generates and stores the\n\nuser’s virtual currency addresses and the corresponding private\n\nkeys. Virtual currency wallet software interfaces with the\n\nblockchain for each type of virtual currency that it supports.\n\nThus, a virtual currency wallet can hold addresses and the\n\ncorresponding private keys for a multitude of virtual\n\ncurrencies. Typically, virtual currency wallet software allows\n\nthe user to create a recovery or “seed” phrase to recover the\n\ncontents of the wallet (including virtual currency addresses and\n\nprivate keys). Anyone who possesses the seed phrase can\n\nreconstitute the wallet and see and manipulate its contents,\n\nincluding moving them to new addresses. Another type of wallet\n\nrelevant here is a physical wallet, commonly referred to as a\n\n“hardware wallet” or a “cold storage wallet.” Hardware wallets\n\nare encrypted electronic devices, often resembling a USB flash\n\ndrive, on which one can store the contents of a virtual currency\n\nwallet, including private keys.\n\nf. Virtual currency exchanges (“VCEs”) are online\n\ntrading and/or storage platforms for virtual currencies. VCEs\n\ntypically store virtual currency belonging to customers. A VCE\n\ncan store multiple virtual currency addresses associated with a\n\nsingle VCE user.\n\ng. As previously stated, Bitcoin (or BTC) is a\n\npopular virtual currency. Several aspects of the way that BTC\n\noperates allow investigators to assess relationships between BTC\n\n\n-----\n\naddresses and their owners. Pertinent to the discussion here\n\nare the concepts of “change addresses,” “co-spending,” and\n\n“clustering.”\n\ni. Change addresses. BTC uses a transaction\n\nmodel like cash, which means that once any part of the balance\n\nof a BTC address is spent, the remainder of the balance must be\n\ndeposited in a new BTC address (the change address). For\n\nexample, if BTC address A held 10 BTC, and the owner of that\n\naddress wished to send 1 BTC to BTC address B, they could do so,\n\nhowever, the other 9 BTC could not remain in BTC address A.\n\nRather, the 9 BTC would be placed in BTC address C, commonly\n\nreferred to as a change address, because it represents the\n\nbalance (or change) still belonging to the owner of BTC address\n\nA. Like a $10 bill from which $1 was spent, a total of $9 in\n\ndifferent bills would remain under the control of the original\n\nowner. Similarly, change addresses can typically be assumed to\n\nremain under the control of the same person who controlled the\n\noriginal payment address.\n\nii. Co-spending. Co-spending transactions are\n\nthose where the contents of multiple BTC addresses are used to\n\nfund a single transaction, indicating that all BTC addresses\n\nwere under the control of the same person. For example, if\n\nthree $5 bills were used to fund a single $15 purchase, it is\n\nlikely that those three $5 bills were controlled by the same\n\nperson before the transaction took place.\n\niii. Clustering. Law enforcement and private\n\nvirtual currency analysis firms can often identify the owner of\n\n\n-----\n\na particular virtual currency address through analyzing change\n\naddresses and co-spending, and combining the knowledge gained\n\nfrom those techniques with information received from other\n\nsources about the provenance of the virtual currency being\n\ntraced (for example, for law enforcement, through legal\n\nprocess). Through this kind of analysis, virtual currency\n\naddresses held by the same owner or group of actors can often be\n\nidentified as part of a “cluster” of associated addresses. This\n\naddress cluster information is collected and stored by private\n\nvirtual currency analysis firms and incorporated into blockchain\n\nanalysis software.\n\n13. During this investigation, I have used virtual\n\ncurrency transaction and anti-money laundering software used by\n\nfinancial institutions and law enforcement organizations\n\nworldwide. This software has supported many investigations and\n\nhas been the basis for numerous search and seizure warrants, and\n\nas such, has been found to be reliable. Law enforcement has\n\nbeen able to verify the reliability of this software by ex-post\n\nanalysis on numerous occasions. In sum, this software has\n\ncorrectly analyzed data on multiple blockchains in hundreds of\n\ninvestigations.\n\n14. Based on my training and experience investigating\n\ncybercrime, I know that individuals involved in crimes where\n\npayments are made using virtual currency often store information\n\nnecessary to access those funds in private or hidden locations.\n\nThey may store the information in hardware wallets or store them\n\nin encrypted or otherwise hidden files.\n\n\n-----\n\n**C.** **The Qakbot Wallets**\n\n15. The FBI has gained access to portions of the Qakbot\n\ncomputer infrastructure, including the Qakbot Admin Computers.\n\nOn one such computer used by a Qakbot administrator, the FBI\n\nlocated many files related to the operation of the Qakbot\n\nbotnet. Those files included communications (e.g., chats\n\ndiscussed in detail below) between the Qakbot administrators and\n\nco-conspirators and a directory containing several files holding\n\ninformation about virtual currency wallets. One of those files,\n\n“license.txt,”\n\n.[3]\n\n. A different file, found\n\nelsewhere on the same computer, named “payments.txt”\n\n, contained a list of ransomware victims, details about\n\nthe ransomware group, computer system details, dates, and an\n\nindication of the amount of BTC paid to the Qakbot\n\nadministrators in connection with the ransomware attack.\n\n3 The license.txt file, along with a collection of other\nfiles related to virtual currency assets, was saved in a file\nlocation normally used to store Windows system update files.\nBased on my training and experience, I believe that the choice\nof this location was intended to conceal the files from anyone\nlooking for documents on the computer. The name of the file is\nalso banal and inconsistent with its contents. The same\ndirectory included subdirectories named “clean” and “dirty” that\nalso contained files related to virtual currency. Based on my\nexperience, I know that cybercriminals who transact in virtual\ncurrency often seek to launder and obfuscate the source of\nillicit (or “dirty” funds) and “clean” them so that they can\nfreely spend the currency.\n\n4\n\n\n-----\n\n-----\n\nCluster”), and to other clusters associated with known\n\nransomware groups and actors. Below are some examples of the\n\nflow of ransomware proceeds into and out of the\n\nvirtual currency addresses identified in the license.txt file:\n\n1. Subject Address 1 (“SA1”)[6]\n\n18. SA1 received a deposit of 44.066491 BTC[7] on October 5,\n\n2022, from an address beginning with bc1 _8 and that balance_\n\nremains at SA1 as of August 21, 2023.\n\n19. Based on blockchain analysis, my training and\n\nexperience, and the facts of this investigation, I believe that\n\nSA1 is a change wallet, and the bc1 address appears to be\n\nan address associated with indicating that\n\nit and SA1 are controlled by the same person.\n\n20. On September 29, 2022, the bc1 address received\n\n63.14 BTC from an address identified by commercial blockchain\n\nanalysis companies as connected to the Black Basta group. That\n\nsending address, in turn, had received 143.50 BTC. In the same\n\ntransaction that sent the 63.14 BTC to the bc1 address,\n\n40.459948 BTC was sent to a cluster of accounts associated with\n\na cybercriminal actor who uses the moniker\n\n.\n\n6 As discussed above, virtual currency addresses consist of\na lengthy sequence of numbers and letters. For readability, the\nsubject addresses are identified using the shorthand “Subject\nAddress” and “SA” nomenclature.\n\n7 At the time of execution of this affidavit, 1 BTC was\nworth approximately $26,000.\n\n8 For readability, virtual currency addresses other than the\nsubject addresses are referred to by a unique sequence of the\ninitial characters of the address.\n\n\n-----\n\n21. On September 29, 2022, a Qakbot administrator provided\n\nthe bc1 address in a chat (via communications obtained by\n\nthe FBI over the course of the investigation) with co\nconspirator who I believe, based on the context of\n\nnumerous chats, to be In response, sent the following\n\ncalculation “143.5 – 12% = 128.26 / 2 = 63,14.” Based on my\n\nexperience and participation in this investigation, I understand\n\nthis discussion relates to the payment to the Qakbot\n\nadministrator of a portion of the proceeds of a ransom. The\n\nquantities reflected in the chat (143.50 and 63.14) exactly\n\nmatch BTC transactions that eventually flow into SA1.\n\n2. Subject Address #2 (“SA2”)\n\n22. SA2 received a deposit of 1.561359 BTC on October 13,\n\n2022. On June 22, 2023, the contents of SA2 were withdrawn in a\n\nseries of transactions, with most of the funds being sent to a\n\nVCE located outside the United States.\n\n23. On October 13, 2022, a Qakbot administrator provided\n\nSA2 in a chat with co-conspirator In response, sent the\n\nfollowing calculation “Btc: 15,61359 – 10% = 1,561359.” Based\n\non my experience and participation in this investigation, I\n\nunderstand this discussion relates to the payment to the Qakbot\n\nadministrator of a portion of the proceeds of a ransom.\n\n24. Virtual currency tracing shows that the funds\n\nultimately paid into SA2 originated with a payment from a\n\nvirtual currency address beginning with 1Mg . Those\n\n\n-----\n\nfunds were moved through a series of transactions that included\n\nthe, and eventually into SA2.[9]\n\n25. The payments.txt file identifies an October 13, 2022\n\npayment of 1.561359 BTC (the amount sent to SA2 on that date),\n\nand identifies the ransomware victim as a law firm located in\n\nNew York.\n\n3. Subject Address 3 (“SA3”)\n\n26. SA3 received a deposit of 15.006 BTC on November 28,\n\n2022, from an address in the On June 30, 2023,\n\n1.1506 BTC was withdrawn from SA3 to a VCE located outside the\n\nUnited States. The balance was deposited in a change address.\n\nOn August 13, 2023, 0.6825 BTC was withdrawn from the change\n\naddress to a VCE located outside the United States. As of\n\nAugust 21, 2023, the balance of the BTC from SA3 remains at the\n\nchange address from the latter transaction.\n\n27. The payments.txt file identifies a November 28, 2022\n\npayment of 15.006 BTC (the amount sent to SA3 on that date) and\n\nidentifies the ransomware victim as a technology company located\n\nin Indiana.\n\n4. Subject Address 4 (“SA4”)\n\n28. SA4 received a deposit of 19.1543 BTC on December 20,\n\n2022. On June 30, 2023, 0.9815098 BTC was withdrawn from SA4 to\n\na VCE located outside the United States. The balance was\n\n9 The source of the funds paid into SA2 appears to be a\nseparate ransom payment from a marketing company in Wisconsin.\nThe payments.txt file reflects a 3.9999865 BTC fee paid to the\nQakbot administrators on May 12, 2022, and in a May 12, 2022\nchat between a Qakbot administrator and the fee was\ncalculated by, “+btc 39.999865 – 10% = 3.9999865.”\n\n\n-----\n\ndeposited in a change address. On August 13, 2023, 0.71 BTC was\n\nwithdrawn from the change address to the same VCE. As of August\n\n21, 2023, the balance of the BTC from SA4 remains at the change\n\naddress from the latter transaction.\n\n29. Blockchain analysis shows that the funds ultimately\n\npaid into SA4 originated from a VCE located in the United\n\nStates.\n\n30. The payments.txt file identifies a December 20, 2022\n\npayment of 19.1543 BTC (the amount sent to SA4 on that date) and\n\nidentifies the ransomware victim as a music company located in\n\nTennessee. The victim reported to the FBI that it was the\n\nvictim of a ransomware attack by the Black Basta group in\n\nNovember 2022.\n\n31. Transaction records received from the VCE show that a\n\nDecember 16, 2022 payment of a 58.4521985 BTC ransom was made\n\nfrom the VCE to the Black Basta group for a ransomware attack on\n\na media company in Missouri. An incident response firm\n\nconfirmed to the FBI that this payment was made on behalf of a\n\nransomware victim.\n\n32. Blockchain analysis showed that the 19.1543 BTC paid\n\nto SA4 in connection with the ransoming of the Tennessee victim\n\noriginated from the 58.4521985 BTC paid by the Missouri victim.\n\nThe payment of 19.1543 BTC for the ransoming of the Tennessee\n\nvictim from the proceeds of a different ransomware attack\n\nindicates that both attacks were perpetrated by the same actors.\n\n\n-----\n\n5. Subject Address 5 (“SA5”)\n\n33. SA5 received a deposit of 17.976 BTC on March 20,\n\n2023. On June 30, 2023, 1.22 BTC was withdrawn from SA5 to a\n\nVCE located outside the United States. The balance was\n\ndeposited in a change address. On August 13, 2023, 0.7634 BTC\n\nwas sent from the change address to another address. As of\n\nAugust 21, 2023, the balance of the BTC from SA5 remains at the\n\nchange address from the latter transaction.\n\n34. The payments.txt file identifies a March 20, 2023\n\npayment of 17.976 BTC (the amount sent to SA5 on that date) and\n\nidentifies the ransomware victim as a technology company located\n\nin Colorado. FBI records show that the technology company\n\nreported a Black Basta ransomware incident in February 2023, and\n\nthe payment of a $5 million ransom (approximately 199 BTC at\n\nthat time) in mid-March 2023.\n\n6. Subject Address 6 (“SA6”)\n\n35. SA6 received a deposit of 0.8935 BTC on October 19,\n\n2022. On June 22, 2023, the contents of SA6 were withdrawn in a\n\nseries of transactions, with most of the funds being sent to a\n\nVCE located outside the United States.\n\n36. On October 19, 2022, a Qakbot administrator provided\n\nSA6 in a chat with co-conspirator In response, sent the\n\nfollowing calculation “8.935* – 10% = 0,8935*.” Based on my\n\nexperience and participation in this investigation, I understand\n\nthis discussion relates to the payment to the Qakbot\n\nadministrator of a portion of the proceeds of a ransom.\n\n\n-----\n\n37. In addition to details of the payment, the chat\n\nreveals that the victim who made the ransomware payment was a\n\nbank located in Maryland. From FBI investigative files, I\n\nconfirmed that the bank was, in fact, a victim of a ransomware\n\nattack by the Black Basta group in October 2022.\n\n7. Subject Address 7 (“SA7”)\n\n38. SA7 received two deposits of 8.631 BTC and 5.5335 BTC\n\non November 14, 2022, both of which originated in the\n\nOn June 30, 2023, 1.08358249 BTC was withdrawn from\n\nSA7 to a VCE located outside the United States. The balance was\n\ndeposited in a change address. On August 12-13, 2023, there was\n\na series of small BTC transactions involving the change address.\n\nAs of August 21, 2023, the balance of 15.992519 BTC from SA7\n\nremains at the final change address from those transactions.\n\n39. The payments.txt file identifies a November 14, 2022\n\npayment of 8.631 BTC (the amount sent to SA7 on that date) and\n\nidentifies the ransomware victim as a hospitality company\n\nlocated in Austria.\n\n40. The payments.txt file identifies a second November 14,\n\n2022 payment of 5.5335 BTC (also a payment sent to SA7 on that\n\ndate) and identifies the ransomware victim as an engineering\n\nfirm located in Illinois.\n\n8. Subject Address 8 (“SA8”)\n\n41. SA8 received a deposit of 1.0315 BTC on September 26,\n\n2022 from an address in the On June 22, 2023,\n\nthe contents of SA8 were withdrawn in a series of transactions,\n\n\n-----\n\nwith most of the funds ultimately being sent to VCEs located\n\noutside the United States.\n\n42. Blockchain analysis shows that the funds ultimately\n\npaid into SA8 originated from a VCE located in the United\n\nStates.\n\n43. On September 26, 2022, a Qakbot administrator provided\n\nSA8 in a chat with co-conspirator In response, sent the\n\nfollowing calculation “10% - 1,0315.” Based on my experience\n\nand participation in this investigation, I understand this\n\ndiscussion relates to the payment to the Qakbot administrator of\n\na portion of the proceeds of a ransom.\n\n44. In addition to details of the payment, the chat\n\nreveals that the victim, who made a ransom payment of 10.315\n\nBTC, was a home furnishing company located in Canada.\n\n45. Transaction records received from the VCE show that a\n\nSeptember 8, 2022 payment of a 5.14250156 BTC ransom was made\n\nfrom the VCE to the Black Basta group for a ransomware attack on\n\na law firm in Kentucky. An incident response firm confirmed to\n\nthe FBI that this payment was made on behalf of a ransomware\n\nvictim.\n\n46. Blockchain analysis showed that the 1.0315 BTC paid to\n\nSA8 in connection with the ransoming of the Canadian victim\n\ncould be traced to the 5.14250156 BTC paid by the Kentucky\n\nvictim. The payment of 1.0315 BTC for the ransoming of the\n\nCanadian victim from the proceeds of a different ransomware\n\nattack indicates that both attacks were perpetrated by the same\n\nactors.\n\n\n-----\n\n9. Subject Address 9 (“SA9”)\n\n47. SA9 received two deposits of 4.9209 BTC and 4.0204 BTC\n\non March 13, 2023. On June 30, 2023, 1.05048348 BTC was\n\nwithdrawn from SA9 to a VCE located in the United States. The\n\nbalance of the BTC from SA9 went through a series of additional\n\ntransactions with some funds going to two VCEs located outside\n\nthe United States, and the balance remaining at change addresses\n\nas of August 21, 2023.\n\n48. The payments.txt file identifies a March 13, 2023\n\npayment of 4.9209 BTC (the amount sent to SA9 on that date), and\n\nidentifies the ransomware victim as a maritime engineering\n\ncompany located in Virginia. FBI records show that the victim\n\nreported to the FBI that it was a victim of a ransomware attack\n\nby the Black Basta group in February 2023.\n\na. Blockchain analysis shows that the 4.9209 BTC\n\npaid to SA9 originated from an address starting with\n\n_bc1_ . I know from FBI investigative records that on\n\nMarch 10, 2023, the bc1 address received a ransom\n\npayment of 243.9422269 BTC for a Black Basta group ransomware\n\nattack on a legal outsourcing company in North Dakota. The\n\npayment of 4.9209 BTC for the ransoming of the Virginia victim\n\nfrom the proceeds of a different ransomware attack indicates\n\nthat both attacks were perpetrated by the same actors.\n\n49. The payments.txt file identifies a second March 13,\n\n2023 payment of 4.0204 BTC (also a payment sent to SA9 on that\n\ndate) and identifies the ransomware victim as a law firm located\n\nin New York.\n\n\n-----\n\n50. Blockchain analysis shows that the 4.0204 BTC paid to\n\nSA9 originated from the address starting with bc1 . I\n\nknow from FBI investigative records that on March 7, 2023, the\n\n_bc1_ address received a ransom payment of 40.204054 BTC\n\nfor a Black Basta group attack on the same New York victim.\n\n10. Subject Address 10 (“SA10”)\n\n51. SA10 received a deposit of 1.1599433 BTC on December\n\n29, 2022. On June 22, 2023, the contents of SA10 were withdrawn\n\nin a series of transactions, with most of the funds being sent\n\nto two VCEs located outside the United States, and one VCE\n\nlocated in the United States.\n\n52. The payments.txt file identifies a December 1, 2022\n\npayment of 1.1599433 BTC (the amount sent to SA10 on December\n\n29, 2022), and identifies the ransomware victim as a bank\n\nlocated in Alabama. Virtual currency tracing shows that the\n\nransom was paid on November 30, 2023, but not transferred to\n\nSA10 until December 29, 2022.\n\n53. From FBI investigative records, I know that the bank\n\nin Alabama was the victim of a ransomware attack by the Black\n\nBasta group. On November 30, 2022, the bank paid a ransom of\n\n11.595551815 BTC to an address starting with 1K7 .\n\nBlockchain analysis showed that funds from this address were\n\nultimately paid into SA10.\n\n11. Subject Address 11 (“SA11”)\n\n54. On April 13, 2023, SA11 received a deposit of 1.6683\n\nBTC. On June 22, 2023, the contents of SA11 were withdrawn in a\n\n\n-----\n\nseries of transactions, with most of the funds being sent to two\n\nVCEs located outside the United States.\n\n55. The payments.txt file identifies an April 13, 2023\n\npayment of 1.6683 BTC (the amount sent to SA11 on that date),\n\nand identifies the ransomware victim as a freight company\n\nlocated in North Carolina. FBI records show that the victim\n\nreported to the FBI that it had been the victim of a ransomware\n\nattack by the Black Basta group and paid a ransom on April 12,\n\n2023.\n\na. Blockchain analysis shows that the 1.6683 BTC\n\npaid to SA11 originated from the address starting with\n\n_bc1_ . I know from FBI investigative records that on March\n\n13, 2023, the bc1 address received a ransom payment of\n\n4.08106996 BTC for a Black Basta group ransomware attack on a\n\nmanufacturing company in Michigan. The payment of 1.6683 BTC\n\nfee for the ransoming of the North Carolina victim from the\n\nproceeds of a different ransomware attack indicates that both\n\nattacks were perpetrated by the same actors.\n\nb. The ransom payment from the Michigan\n\nmanufacturing company was also used to pay 1.9895 BTC to another\n\nsubject address, Subject Address 12. The payments.txt file\n\nidentifies a March 16, 2023 payment of 1.9895 BTC in connection\n\nwith a ransom payment by a food company in New York.\n\n56. The ransom payments and fee payments to the Qakbot\n\nadministrators discussed above are a representative sample of\n\nthe flow of illicit funds into virtual\n\ncurrency addresses from one of the Qakbot Wallets. The other\n\n\n-----\n\n-----\n\ninformation for individuals in the United States. As a result\n\nof this introduction, CHS2 began corresponding with admin, who\n\ntasked him with identifying contact information for the victim\n\nChicago law firm.\n\n59. The FBI’s investigation determined that the law firm\n\nnetwork had been infected with Qakbot, and then was attacked by\n\nthe Alphv/BlackCat ransomware group. On May 12, 2022, one of\n\nthe owners of the Chicago law firm gave FBI employees permission\n\nto use his identity and to pose as employees of the law firm.\n\nThereafter, CHS2 provided admin with a phone number, claiming\n\nthat it was the phone number for the owner of the Chicago law\n\nfirm. That phone number, however, connected to an undercover\n\nFBI agent (“UC1”) who was posing as the law firm owner.\n\n60. Admin agreed to pay $150 to CHS2 for his assistance\n\nwith locating contact information for the victim. CHS2 provided\n\nadmin with a virtual currency address for payment of the fee.\n\nOn May 13, 2022, a payment of 0.00495108 BTC (approximately $150\n\nat that time) was made to the address provided by CHS2.\n\nBlockchain analysis shows that this payment was made from an\n\naddress in the Qakbot Cluster.\n\n61. On May 20, 2022, unknown subjects called the phone\n\nnumber provided by CHS2 to admin. UC1 answered, pretended to be\n\nthe law firm owner, and recorded the conversations. The callers\n\nattempted to extort UC1 for a ransom to unlock law firm files\n\nthat had been encrypted by ransomware. The callers made four\n\ncalls to UC1 seeking a ransom payment.\n\n\n-----\n\n62. On May 22, 2022, CHS2 informed FBI agents that he had\n\nagain been contacted by admin to find contact information for a\n\nransomware victim. The FBI determined that the victim\n\nidentified by admin was a clothing company in Virginia.\n\n63. The victim clothing company provided information to\n\nthe FBI about a ransomware attack on May 22, 2022. The victim\n\ncomputers were encrypted with the MountLocker ransomware, and a\n\n$2 million ransom was demanded.\n\n64. On May 31, 2022, CHS2 provided admin with a phone\n\nnumber, claiming that it was the phone number for an officer of\n\nthe Virginia clothing company. That phone number connected to\n\nan undercover FBI agent (“UC2”) who was posing as the officer.\n\nCHS2 provided admin with a virtual currency address for payment\n\nof his fee for locating the phone number.\n\n65. On May 31, 2022, an unknown male subject called the\n\nphone number provided by CHS2 to admin. UC2 answered and\n\npretended to be the officer. The caller attempted to extort UC2\n\nfor a ransom to unlock company files that had been encrypted by\n\nransomware.\n\n66. Admin agreed to pay the CHS2 for his assistance with\n\nlocating contact information for the victim. On May 31, 2022, a\n\npayment of 0.00726848 BTC (approximately $230 at that time) was\n\nmade to the address provided by CHS2 to admin. Blockchain\n\nanalysis shows that this payment was made from an address in the\n\nQakbot Cluster.\n\n\n-----\n\n**E.** **Additional Qakbot Ransom Payments**\n\n67. In addition to the virtual currency payments traced\n\nabove, during this investigation, the FBI has identified more\n\nransomware payments for which the Qakbot administrators received\n\na fee. As with the above transactions, these ransoms and the\n\ncorresponding fee payments to the Qakbot administrators were\n\npaid in virtual currency, and I assess that there is more than a\n\nfair probability that these fee payments were also deposited\n\ninto virtual currency addresses contained in the Qakbot Wallets.\n\n1. Medical Organization (Illinois)\n\n68. In April 2022, a medical organization in Illinois was\n\nthe victim of ransomware attack by the Black Basta group.\n\n69. The payments.txt file identifies a May 12, 2022\n\npayment of 1.075852121 BTC to the Qakbot administrators in\n\nconnection with the ransom payment by the medical organization\n\nin Illinois.\n\n70. On May 12, 2022, a Qakbot administrator discussed the\n\nIllinois victim in a chat with co-conspirator In response,\n\nsent the following calculation “+10,75852121 – 10% =\n\n1,075852121.” Based on my experience and participation in this\n\ninvestigation, I understand this discussion relates to the\n\npayment to the Qakbot administrator of a portion of the proceeds\n\nof a ransom.\n\n2. Medical Manufacturer (California)\n\n71. In April 2022, a medical manufacturer in California\n\nwas the victim of ransomware attack by the Black Basta group.\n\n\n-----\n\n72. The payments.txt file identifies a May 5, 2022 payment\n\nof 1.04466372 BTC to the Qakbot administrators in connection\n\nwith the ransom payment by the medical manufacturer in\n\nCalifornia.\n\n73. On May 5, 2022, in a chat with a Qakbot administrator,\n\nreferenced the California victim and confirmed payment of\n\n1.04466372 BTC.\n\n3. Defense Manufacturer (Maryland)\n\n74. In April 2022, a defense manufacturer in Maryland was\n\nthe victim of ransomware attack by the Black Basta group.\n\n75. The payments.txt file identifies a May 23, 2022\n\npayment of 0.823348511 BTC to the Qakbot administrators in\n\nconnection with the ransom payment by the defense manufacturer\n\nin Maryland.\n\n76. On May 23, 2022, in a chat with a Qakbot\n\nadministrator, referenced both the Maryland victim and an\n\nAustralian victim, calculating a percentage paid for those two\n\nransoms: “3,22883312 + 8,23348511 = 11,46231823 – 10% =\n\n1.146231823 btc.”\n\n4. Business Services Company (New York)\n\n77. In April 2022, a business services company in New York\n\nwas the victim of ransomware attack by the Black Basta group.\n\n78. The payments.txt file identifies an April 20, 2022\n\npayment of 0.60449055 BTC to the Qakbot administrators in\n\nconnection with the ransom payment by the business services\n\ncompany in New York.\n\n\n-----\n\n79. On April 20, 2022, in a chat with a Qakbot\n\nadministrator, referenced the New York victim, and confirmed\n\npayment of $25,000 (approximately 0.60 BTC at that time).\n\n5. Food Company (Massachusetts)\n\n80. In December 2021, a food company in Massachusetts was\n\nthe victim of ransomware attack by the Conti group.\n\n81. The payments.txt file identifies a December 20, 2021\n\npayment of 3.24864876 BTC to the Qakbot administrators in\n\nconnection with the ransom payment by the food company in\n\nMassachusetts.\n\n82. On December 20, 2021, in a chat with a Qakbot\n\nadministrator, the Qakbot administrator provided a virtual\n\ncurrency address and indicated a payment of “3.2486” and\n\nprovided a transaction hash.\n\n**IV.** **TIME OF EXECUTION**\n\n83. The requested warrant will be executed by FBI\n\npersonnel online, and without the need for any third-party\n\nparticipation. As such, good cause exists to permit the\n\nexecution of the warrant at any time in the day or night that\n\nthe FBI concludes is best for operational purposes.\n\n//\n\n//\n\n//\n\n\n-----\n\n**V.** **CONCLUSION**\n\n84. For all the reasons described above, there is probable\n\ncause to believe that the Qakbot administrators and their co\nconspirators have committed violations of the Subject Offenses,\n\nand that there is also probable cause to seize the Qakbot\n\nWallets, further described in Attachment A, as property subject\n\nto forfeiture.\n\nAttested to by the applicant in\naccordance with the requirements\nof Fed. R. Crim. P. 4.1 by\ntelephone on this 23rd day of\nAugust, 2023.\n\nUNITED STATES MAGISTRATE JUDGE\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "bf5be533-fa31-4590-ae37-5761c97ffa34",
            "created_at": "2022-10-25T16:13:58.389257Z",
            "updated_at": "2022-10-25T16:13:58.389257Z",
            "deleted_at": null,
            "name": "Malpedia",
            "url": "https://malpedia.caad.fkie.fraunhofer.de",
            "description": "Malpedia is a free service offered by Fraunhofer FKIE",
            "reports": null
        }
    ],
    "references": [
        "https://www.justice.gov/d9/2023-08/23mj4251_application_redacted.pdf"
    ],
    "report_names": [
        "23mj4251_application_redacted.pdf"
    ],
    "threat_actors": [
        {
            "id": "cea5ceec-0f14-4e34-bd0e-4074bc1a707d",
            "created_at": "2022-10-25T15:50:23.629983Z",
            "updated_at": "2025-03-27T02:00:55.509459Z",
            "deleted_at": null,
            "main_name": "Axiom",
            "aliases": [
                "Group 72"
            ],
            "source_name": "MITRE:Axiom",
            "tools": [
                "ZxShell",
                "gh0st RAT",
                "Zox",
                "PlugX",
                "Hikit",
                "PoisonIvy",
                "Derusbi",
                "Hydraq"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "5c74936a-79d1-41b8-81eb-01d03c90a26b",
            "created_at": "2022-10-25T16:07:23.371052Z",
            "updated_at": "2025-03-27T02:02:09.766782Z",
            "deleted_at": null,
            "main_name": "Axiom",
            "aliases": [
                "Group 72",
                "Operation SMN"
            ],
            "source_name": "ETDA:Axiom",
            "tools": [
                "9002 RAT",
                "Agent.dhwf",
                "AngryRebel",
                "BlackCoffee",
                "BleDoor",
                "Chymine",
                "Darkmoon",
                "DeputyDog",
                "Derusbi",
                "Destroy RAT",
                "DestroyRAT",
                "Farfli",
                "Fexel",
                "Gen:Trojan.Heur.PT",
                "Gh0st RAT",
                "Ghost RAT",
                "Gresim",
                "HOMEUNIX",
                "HiKit",
                "HidraQ",
                "Homux",
                "Hydraq",
                "Kaba",
                "Korplug",
                "McRAT",
                "MdmBot",
                "Moudour",
                "Mydoor",
                "PCRat",
                "PNGRAT",
                "PlugX",
                "Poison Ivy",
                "RbDoor",
                "RedDelta",
                "RibDoor",
                "Roarur",
                "SPIVY",
                "Sensocode",
                "Sogu",
                "TIGERPLUG",
                "TVT",
                "Thoper",
                "Winnti",
                "Xamtrav",
                "ZXShell",
                "Zox",
                "ZoxPNG",
                "ZoxRPC",
                "gresim",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a7aefdda-98f1-4790-a32d-14cc99de2d60",
            "created_at": "2023-01-06T13:46:38.281844Z",
            "updated_at": "2025-03-27T02:00:02.792526Z",
            "deleted_at": null,
            "main_name": "APT17",
            "aliases": [
                "G0025",
                "AURORA PANDA",
                "Group 72",
                "G0001",
                "HELIUM",
                "Group 8",
                "Hidden Lynx",
                "Tailgater Team",
                "BRONZE KEYSTONE"
            ],
            "source_name": "MISPGALAXY:APT17",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "4c68ccd0-caba-4189-9ead-86ac4c2d9b70",
            "created_at": "2024-05-01T02:03:07.930196Z",
            "updated_at": "2025-03-27T02:05:17.251237Z",
            "deleted_at": null,
            "main_name": "BRONZE ATLAS",
            "aliases": [
                "Axiom",
                "BARIUM ",
                "Blackfly ",
                "CTG-2633",
                "GREF",
                "Group 72 ",
                "Red Kelpie ",
                "TG-2633 ",
                "Wicked Panda ",
                "Winnti",
                "APT41 "
            ],
            "source_name": "Secureworks:BRONZE ATLAS",
            "tools": [
                " CCleaner v5.33 backdoor",
                " ChinaChopper",
                " Cobalt Strike",
                " Dicey MSDN",
                " ForkPlayground",
                " HUC Proxy Malware (Htran)",
                " Mimikatz",
                " PipeMon",
                " PlugX",
                " PortReuse",
                " Powershell Empire",
                " RCMD",
                " RbDoor",
                " SPEEDBOAT",
                " ShadowPad",
                " Sidewalk",
                " Speculoos",
                " TeamViewer",
                " Winnkit",
                " Winnti",
                " reg save",
                " vssadmin",
                "Acehash"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "6e23ce43-e1ab-46e3-9f80-76fccf77682b",
            "created_at": "2022-10-25T16:07:23.303713Z",
            "updated_at": "2025-03-27T02:02:09.727245Z",
            "deleted_at": null,
            "main_name": "ALPHV",
            "aliases": [
                "ALPHV",
                "ALPHVM",
                "BlackCat Gang",
                "UNC4466"
            ],
            "source_name": "ETDA:ALPHV",
            "tools": [
                "ALPHV",
                "ALPHVM",
                "BlackCat",
                "GO Simple Tunnel",
                "GOST",
                "Impacket",
                "LaZagne",
                "MEGAsync",
                "Mimikatz",
                "Munchkin",
                "Noberus",
                "PsExec",
                "Remcom",
                "RemoteCommandExecution",
                "WebBrowserPassView"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1edcac0b-efd9-47b1-9aca-33827d5bd085",
            "created_at": "2024-05-01T02:03:07.964773Z",
            "updated_at": "2025-03-27T02:05:17.273595Z",
            "deleted_at": null,
            "main_name": "BRONZE KEYSTONE",
            "aliases": [
                "Aurora Panda ",
                "DeputyDog ",
                "Group 72 ",
                "Hidden Lynx ",
                "Shell Crew",
                "TG-8153 ",
                "Tailgater Team",
                "APT17 "
            ],
            "source_name": "Secureworks:BRONZE KEYSTONE",
            "tools": [
                " BlackCoffee",
                " DeputyDog",
                " Derusbi",
                " Gh0stHTTPSDropper",
                " HiKit",
                " InternalCMD",
                " PlugX",
                " PoisonIvy",
                " ZxShell",
                "9002"
            ],
            "source_id": "Secureworks",
            "reports": null
        }
    ],
    "ts_created_at": 1693620432,
    "ts_updated_at": 1743041765,
    "ts_creation_date": 0,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/7f63835b11b573cf675368597c6b4eb67bebd931.pdf",
        "text": "https://archive.orkl.eu/7f63835b11b573cf675368597c6b4eb67bebd931.txt",
        "img": "https://archive.orkl.eu/7f63835b11b573cf675368597c6b4eb67bebd931.jpg"
    }
}