{
    "id": "b1b3ccb3-5c98-4a4e-877f-0776ec96caed",
    "created_at": "2023-01-12T15:07:51.049326Z",
    "updated_at": "2025-03-27T02:16:58.186011Z",
    "deleted_at": null,
    "sha1_hash": "6bb03bec5028bfed56fd30d98d866fb166150e9f",
    "title": "2021-10-21 - FIN7 Recruits Talent For Push Into Ransomware",
    "authors": "",
    "file_creation_date": "2022-05-28T01:27:15Z",
    "file_modification_date": "2022-05-28T01:27:15Z",
    "file_size": 8566244,
    "plain_text": "# FIN7 Recruits Talent For Push Into Ransomware\n\n**geminiadvisory.io/fin7-ransomware-bastion-secure**\n\nOctober 21, 2021\n\n_The intelligence in this report was gathered by a source who was recruited by “Bastion_\n_Secure”. Gemini Advisory’s investigation and analysis of the source’s information has been_\n_ongoing for the past several months. Although sensitive information has been redacted from_\n_this report to protect the source, Gemini Advisory has provided law enforcement with the_\n_complete set of unredacted information. In addition, our findings were reported to our clients_\n_earlier this month and have been corroborated by Microsoft’s presentation at Mandiant Cyber_\n_Defense Summit 2021._\n\n## Key Findings\n\nThe cybercriminal group FIN7 has been responsible for large-scale card theft\ncampaigns, resulting in the exposure of over 20 million payment card records, as well\nas ransomware attacks. Gemini has discovered that FIN7 is now running a new fake\ncompany called “Bastion Secure”, replacing the previously reported “Combi Security”.\n\n\n-----\n\nBastion Secure offered a job offer to a Gemini source and, in the process, provided the\nsource with files that analysts later determined were for the post-exploitation tools\nCarbanak and Lizar/Tirion. These two tools have been previously attributed to FIN7\nand establish the link between Bastion Secure and FIN7.\nThe tasks that were assigned to the Gemini source by FIN7—operating under the guise\nof Bastion Secure—matched the steps taken to prepare a ransomware attack,\nproviding further evidence that FIN7 has continued to expand into the ransomware\nsphere.\nFIN7 can pay unwitting “employees” far less than it would have to pay informed\ncriminal accomplices for its ransomware schemes. However, FIN7’s greed also\nafforded Gemini a view into the proprietary data of this prolific threat team, leading to\nthe exposure of another fake FIN7 company.\n\n## Background\n\nThe cybercriminal group FIN7 gained notoriety in the mid-2010s for large-scale malware\ncampaigns targeting the point-of-sale (POS) systems. In 2018, Gemini Advisory reported\n[FIN7’s compromise of Saks Fifth Avenue and Lord & Taylor stores and the subsequent sale](https://geminiadvisory.io/fin7-syndicate-hacks-saks-fifth-avenue-and-lord-taylor/?swcfpc=1)\n[of over 5 million payment cards on the dark web. According to the US Department of Justice,](https://www.justice.gov/opa/pr/high-level-member-hacking-group-sentenced-prison-scheme-compromised-tens-millions-debit-and)\nthe broader FIN7 carding campaigns have resulted in the theft of over 20 million payment\ncard records and cost victims over $1 billion, making FIN7 one of the most infamous and\nprolific cybercriminal groups of the last decade. Now with ransomware proving to be\ncybercriminals’ preferred high-profit, jackpot venture, FIN7 has redeployed their expertise\nand capacity towards ransomware, with reports indicating that the group was involved in\nattempted [ransomware attacks on US companies as early as 2020. Furthermore, despite](https://threatpost.com/fin7s-liquor-lure-law-firm-backdoor/168086/)\n[focus from law enforcement and the arrest of four FIN7 members from 2018 to 2020, FIN7’s](https://therecord.media/fin7-hacker-sentenced-to-10-years-in-prison/)\ncontinued activity shows that the group remains a powerful, active threat.\n\n[In 2018, the US Department of Justice revealed that FIN7 was posing as “Combi Security”, a](https://www.justice.gov/opa/pr/three-members-notorious-international-cybercrime-group-fin7-custody-role-attacking-over-100)\nfake cybersecurity company, to involve unaware IT specialists in their carding campaigns.\nWhile the public focus on Combi Security shut down that operation, Gemini has now\ndiscovered that FIN7 is using a new fake cybersecurity company named “Bastion Secure” to\nlure unaware IT specialists into supporting its continued expansion into ransomware.\n\nOver the course of FIN7’s existence, cybersecurity firms have referred to FIN7 by several\nnames—including Carbanak, Carbon Spider, Anunak, Cobalt Gang, and Navigator Group—\n[with some practitioners choosing to subdivide the FIN7 designation according to the target](https://attackevals.mitre-engenuity.org/enterprise/carbanak_fin7/)\ntype. While overlapping but different groups of individuals have likely conducted malicious\nactivity attributed to these threat groups, the unifying thread connecting the attack signatures\n[to FIN7 has been the use of the malware Carbanak.](https://attack.mitre.org/software/S0030/)\n\n## Analysis\n\n\n-----\n\nA Gemini source was offered a position as an IT specialist at Bastion Secure Ltd, a\ncybersecurity “company” seeking C++, Python, and PHP programmers, system\nadministrators, and reverse engineers. A basic search for this company returns a legitimateappearing website (www[.]bastionsecure[.]com), but analysis revealed that it is a fictitious\ncybersecurity company run by a cybercriminal group. During the interview process, the\nsource was given several tools for test assignments that the source would use if employed.\n\n[Gemini Advisory worked jointly with the Recorded Future Insikt Group to analyze the tools](https://www.recordedfuture.com/platform/finished-intelligence/)\nprovided by Bastion Secure and determined that they are actually components of the postexploitation toolkits Carbanak and Lizar/Tirion, both of which have been previously attributed\nto the FIN7 group and can be used for both POS system infections and ransomware attacks.\n\nPrior to 2020, FIN7’s primary modus operandi was to compromise companies’ networks and\ninfect POS systems with credit card-stealing malware. Since 2020, cybersecurity researchers\nhave identified instances in which FIN7 gained access to company networks that were later\n[infected with either REvil or](https://threatpost.com/fin7s-liquor-lure-law-firm-backdoor/168086/) [Ryuk ransomware. FIN7’s exact involvement in the deployment](https://blog.truesec.com/2020/12/22/collaboration-between-fin7-and-the-ryuk-group-a-truesec-investigation/)\nof ransomware—i.e., whether they sold the access to ransomware groups or have formed a\npartnership with these groups—remains unclear. However, the tasks that were assigned to\nthe Gemini source by FIN7 (operating under the guise of Bastion Secure) matched the steps\ntaken to prepare a ransomware attack, providing further evidence that FIN7 has expanded\ninto the ransomware sphere.\n\nFurthermore, due to Bastion Secure’s use of Carbanak and Lizar/Tirion and FIN7’s\nestablished practice of using fake cybersecurity companies to recruit talent, Gemini assesses\nwith high confidence that FIN7 is using the fictitious company Bastion Secure to recruit\nunwitting IT specialists into participating in ransomware attacks.\n\n\n-----\n\nImage 1: Bastion Secure posts a job offer for a Windows Network Administrator on the\n[Russian job site superjob.ru.](https://www.superjob.ru/)\n\nMore broadly, FIN7’s decision to use a fake cybersecurity company to recruit IT specialists\nfor its criminal activity is driven by FIN7’s desire for comparatively cheap, skilled labor.\nBastion Secure’s job offers for IT specialist positions ranged between $800 and $1,200 USD\na month, which is a viable starting salary for this type of position in post-Soviet states.\nHowever, this “salary” would be a small fraction of a cybercriminal’s portion of the criminal\nprofits from a successful ransomware extortion or large-scale payment card-stealing\noperation. In effect, FIN7’s fake company scheme enables the operators of FIN7 to obtain\nthe talent that the group needs to carry out its criminal activities, while simultaneously\nretaining a larger share of the profits.\n\nFIN7’s use of Bastion Secure—even after the discovery of Combi Security, the group’s\nprevious fake cybersecurity company—indicates that FIN7 continues to believe that hiring\nunwitting IT specialists is the group’s best method for balancing the need for a technically\nskilled team against the operators’ desire for maximum profits.\n\n## Bastion Secure\n\nWith FIN7’s latest fake company, Bastion Secure, the criminal group leveraged true, publicly\navailable information from various legitimate cybersecurity companies to create a thin veil of\nlegitimacy around Bastion Secure. In effect, FIN7 is adopting disinformation tactics so that if\n\n\n-----\n\na potential hire or interested party were to fact check Bastion Secure, then a cursory search\non Google would return “true” information for companies with a similar name or industry to\nFIN7’s Bastion Secure.\n\nFIN7’s first step in obtaining a veil of legitimacy was to give their fake company the generic\nname “Bastion Secure”, which appears similar to several unrelated security-adjacent\ncompanies with highly listed Google search results:\n\n[Bastion Security Products Ltd: a US physical security company that was recently](https://www.bastionsecurity.com/)\n[acquired by ECAMSECURE](https://ecamsecure.garda.com/)\n[Bastion Security Group: a US physical security consulting company](https://www.bastionsecuritygroup.com/)\n\nSecond, Bastion Secure listed the company’s office addresses as:\n\n_16e Follingsby Ave, Gateshead, United Kingdom (former address of the since-closed_\n[Bastion Security (North) Limited)](https://find-and-update.company-information.service.gov.uk/company/01661392)\n_94 Yigal Alon St. Tower 1, Tel Aviv, Israel (office building containing multiple_\n[businesses, including the vehicle security company Cymotive)](https://www.cymotive.com/)\n_Imperia Tower, 12 Presnenskaya Embankment, Moscow, 123100 Russia (office_\nbuilding containing multiple businesses). Gemini contacted the Imperia Tower building\nadministrators, who confirmed that there is no company named Bastion Secure with\noffice space at the building.\n_Fortis Tower, 77-79 Gloucester Rd, Wan Chai, Hong Kong (office building containing_\nmultiple businesses). Fortis Tower building administrators did not respond to Gemini’s\ninquiries; however, public records in the Hong Kong government’s “Companies\nRegistry’s Cyber Search Centre” revealed that there is no registered company named\n“Bastion Secure” operating in Hong Kong.\n\nFurthermore, the Bastion Secure website itself also appears legitimate at first glance;\nhowever, a deeper analysis revealed that the website is largely a copy of the website of\n[Convergent Network Solutions Ltd., a legitimate cybersecurity company. Additionally, the](https://www.cnsgroup.co.uk/)\nBastion Secure website is hosted on the Russian domain registrar Beget, which\ncybercriminals commonly use.\n\n\n-----\n\nImages 2-3: The website of Bastion Secure (left) is a copy of the website of Convergent\nNetwork Solutions Ltd. (right), a legitimate cybersecurity company.\n\nImages 4-5:The Bastion Secure website (left) lists @CNS_Security as its Twitter account,\nmatching the Twitter account listed on CNS’ website (right). Additionally, the page description\nsentence includes text directly from the CNS website.\n\nAn initial analysis of the Bastion Secure website revealed that most of the submenus of the\nsite return a Russian-language HTTP 404 error, indicating that the site creators were\nRussian speakers. Since the initial analysis by Gemini, most of the website’s submenus have\nbeen fixed with appropriate pages; however, a deeper analysis revealed that some of the\nHTTP 404 errors remain unfixed.\n\nImage 6: Some Bastion Secure pages display a 404 error in Russian, indicating that the site\ndesigners are Russian speakers.\n\n\n-----\n\nAs shown in the image below, an analysis of the page s source code reveals the remnants of\nthe CNS site: the code on Bastion Secure still lists the same phone number that is listed\n[prominently on the CNS homepage.](https://www.cnsgroup.co.uk/)\n\nImage 7: The source code under certain pages has been lifted directly from Convergent\nNetwork Solutions Ltd’s website.\n\nTo recruit IT specialists, Bastion Secure posts legitimate-appearing job offers on both their\nwebsite and prominent job search sites in post-Soviet states, as well as providing reputablelooking contacts to potential hires for additional credibility. In the past several months,\nBastion Secure has posted job offerings for system administrators on job search sites and\nadded new vacancies for PHP, Python, and C++ programmers and reverse engineers on\ntheir website. On these job sites, Bastion Secure provides sufficiently professional\ninformation to appear legitimate and includes purported office information and a phone\nnumber (+7 499-642-3420). The list of legitimate Russian and Ukrainian job sites where\nBastion Secure has a presence and has advertised job postings includes:\n\n[https://www.superjob.ru/vakansii/administrator-windows-setej-36641469.html](https://www.superjob.ru/vakansii/administrator-windows-setej-36641469.html)\n[https://ua.joblum.com/company/bastion-secure-ltd](https://ua.joblum.com/company/bastion-secure-ltd)\n[https://ua.jubee.org/ru/company/bastion-secure-ltd](https://ua.jubee.org/ru/company/bastion-secure-ltd)\n[https://rabota.ua/company10418701](https://rabota.ua/company10418701)\n[https://jobs.ua/company-bastion-secure-ltd-1603731](https://jobs.ua/company-bastion-secure-ltd-1603731)\n[https://moscow.cataloxy.ru/firms/bastionsecure.com.htm – 74996423420](https://moscow.cataloxy.ru/firms/bastionsecure.com.htm)\n[https://remoteworkukraine.com/ua/company/ua-bastion-secure/](https://remoteworkukraine.com/ua/company/ua-bastion-secure/)\n\n\n-----\n\n[Image 8: Bastion Secure’s company page on zoon.ru, a business development site serving](https://zoon.ru/)\nRussian companies, job seekers, and consumers.\n\nFIN7—operating under the guise of Bastion Secure—is looking for programmers (PHP, C++,\nPython), system administrators, and reverse engineers in order to build a “staff” capable of\nconducting the tasks necessary for undertaking a range of cybercriminal activity. Given\nFIN7’s increased interest in ransomware, Bastion Secure is likely specifically looking for\nsystem administrators because an individual with this skill set would be able to:\n\nMap out compromised companies’ systems\nIdentify users and devices within the systems\nLocate backup servers and files\n\nIn order for the system administrator to map out a victim’s system, FIN7 would need to first\nprovide the individual with access to the system. FIN7 operators could obtain the initial\n[access through their well-documented phishing and social engineering methods or by](https://www.bankinfosecurity.com/art-steal-fin7s-highly-effective-phishing-a-11286)\npurchasing access on dark web forums from a large pool of vendors. Once the system\nadministrator mapped out the system and identified backups, FIN7 could then escalate to the\nnext step in the malware and ransomware infection process. Gemini Advisory has previously\n[written reports on how ransomware teams operate and some of their TTP’s.](https://geminiadvisory.io/ransomware-the-new-cost-of-business/)\n\n\n-----\n\nImages 9-11: Bastion Secure posts job vacancies for IT specialists on its website.\n\n## FIN7’s Bastion Secure Reveals Criminality During Hiring Process\n\n\n-----\n\nA Gemini source made contact with a Bastion Secure HR representative on a job search\nsite, leading to a hiring process in which Bastion Secure shared their business practices and\naccess to several of their tools. Gemini analyzed these tools to discover that they were in\nfact the post-exploitation tools Carbanak and Lizar/Tirion. As various security practitioners\nhave already attributed these tools and ransomware attacks to the FIN7 group, the fact that\nBastion Secure representatives provided the source with disguised versions of these\nattributable post-exploitation tools establishes a strong link between Bastion Secure and\nFIN7.\n\n## First Stage: Interview Process\n\nThe first stage of the hiring process proceeded similarly to a legitimate job hiring process and\ngave no indication that Bastion Secure was a fake company for a cybercriminal group. First,\nthe HR representative from Bastion Secure communicated with the Gemini source and\ninformed them that they had reviewed the source’s resume and were interested in hiring\nthem as an IT specialist.\n\nAfter the source indicated that they were interested in the position, the source conducted a\ntypical first-stage interview with the HR representative via messages on Telegram. Although\nmany non-criminal individuals in post-Soviet states use Telegram as their preferred\nmessaging app, it is not typical for initial professional correspondences to be conducted on\nTelegram.\n\nAfter completing the interviews, the source was informed that they would need to:\n\nComplete several test assignments before beginning on a probationary basis\nSign a contract and non-disclosure agreement\nConfigure their computer by installing several virtual machines and opening ports\n\n## Second Stage: Practice Assignments\n\nAt face value, the second stage of the hiring process did not give a clear indication that\nBastion Secure is a cybercriminal operation. However, the actions taken later in the third\nstage clearly made the steps taken in the second stage highly suspicious. The source was\ninstructed to install certain platforms and conduct a series of practice assignments that would\nbe typical for the position.\n\nBastion Secure also informed the source that they were willing to train new hires in\ncybersecurity. When the source indicated that they were interested in learning, the company\nsent them additional files that included tools that could either be used for legitimate\npenetration testing or malicious activity. Although the tools provided to the source were\npotentially unusual for the position, Bastion Secure prefaced it by proposing that they would\ntrain the source to not only manage client’s systems but also secure them, lending credence\nto the use of these tools.\n\n\n-----\n\n## Third Stage: Real Assignment Signals Criminal Intent\n\nIn the third stage, Bastion Secure gave the source their first “real” assignment, and it became\nimmediately clear that the company was involved in criminal activity. The fact that the Bastion\nSecure representatives were particularly interested in file systems and backups signals that\nFIN7 was more interested in conducting ransomware attacks than POS infections.\n\nFor the first assignment, Bastion Secure provided the Gemini source with a “client company”\nto work on. The task would have been to use a script to collect information on domain\nadministrators, domain trust relationships, file shares, backups, and hypervisors (the\nsoftware responsible for creating and running virtual machines). At this point, the source\nbecame highly suspicious of Bastion Secure’s activities, noting the following red flags from\nearlier in the hiring process:\n\nBastion Secure provided access to the company’s network without any legal\ndocumentation or explanation, suggesting that the access may have been acquired\nthrough social engineering or purchased on the dark web\nBastion Secure was only interested in file systems and backup\nThe company warned of a heavy fine if the source installed antivirus software on the\nvirtual machine that they were using\nThe employee was required to use specific tools to avoid detection\nBastion Secure software was purportedly licensed to “Checkpoint Software Inc”, which\nmay have been an attempt to masquerade the software as a product of the legitimate\ncompany [Check Point Software Technologies Ltd. Security researchers have](https://www.checkpoint.com/)\n[previously reported that FIN7 has attempted to do this in the past as well.](https://threatpost.com/fin7-backdoor-ethical-hacking-tool/166194/)\n\n## Attribution\n\nGemini analyzed the files that were sent to the source by Bastion Secure and found that the\nfiles contained components for the post-exploitation tools Carbanak and Lizar/Tirion. Postexploitation tools—which are part of any ransomware group’s toolkit—allow malicious actors\nto control infected computers after they have gained initial access to the victim company’s\n[network. Various security practitioners have previously attributed the use of Carbanak and](https://threatpost.com/fin7-backdoor-ethical-hacking-tool/166194/)\nLizar/Tirion to FIN7. These two factors indicate that FIN7 operators are sharing a partially\ndisguised version of its toolkit with unwitting accomplices through the fake company Bastion\nSecure.\n\nThe files provided to the source by Bastion Secure included files for a software component\ntitled “Command Manager” that was, in fact, a disguised version of the client component of\nCarbanak (see image 12). Gemini determined this by analyzing the software’s functionality\n[and concluded that it is an updated version of previously identified versions of Carbanak.](https://attack.mitre.org/software/S0030/)\nThe main functions of the Carbanak command manager are collecting information about an\ninfected computer and obtaining remote access to the infected computer.\n\n\n-----\n\nImage 12: Command Manager control panel, which is actually a disguised client component\nof Carbanak.\n\nThe files contained an obfuscated PowerShell script that ultimately launches the Lizar/Tirion\ninjector and payload. The primary function of the loader is to receive periodic commands\nfrom the C&C server and execute the commands on the infected computer. The commands\nexecuted by the loader on the infected computer are “modules” and the results are sent back\nto the C&C server. These modules can be .dll, .exe, and .ps1 file types.\n\nImage 13: The malware operator uses the client to issue commands to the loader, which is\nlocated on the infected machine.\n\n## Conclusion\n\nAlthough cybercriminals looking for unwitting accomplices on legitimate job sites is nothing\nnew, the sheer scale and blatancy with which FIN7 operates continue to surpass the\nbehavior shown by other cybercriminal groups. Not only is FIN7 looking for unwitting victims\non legitimate job sites, but also attempting to obfuscate its true identity as a prolific\ncybercriminal and ransomware group by creating a fabricated web presence through a\nlargely legitimate-appearing website, professional job postings, and company info pages on\nRussian-language business development sites.\n\n\n-----\n\nFIN7 s decision to hire unwitting accomplices, as opposed to finding willing accomplices on\nthe dark web, is likely due to greed. With willing accomplices, FIN7 would be forced to share\na percentage of ransom payments totaling millions of dollars, whereas unwitting “employees”\nwould work for monthly salaries in the low thousands, which are commensurate with the\nlabor markets in post-Soviet states. However, FIN7’s greed also afforded Gemini a view into\nthe proprietary tools of this prolific threat team, as well as the exposure of another fake FIN7\ncompany.\n\n_Correction (11/05/2021): The report incorrectly stated that a FIN7 system administrator was_\n_arrested in 2021. The individual was arrested in 2018 and sentenced in 2021. Four FIN7_\n_members were arrested between 2018 and 2020._\n\n**Gemini Advisory Mission Statement**\n\n_Gemini Advisory provides actionable fraud intelligence to the largest financial organizations_\n_in an effort to mitigate ever-growing cyber risks. Our proprietary software utilizes_\n_asymmetrical solutions in order to help identify and isolate assets targeted by fraudsters and_\n_online criminals in real-time._\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-10-21 - FIN7 Recruits Talent For Push Into Ransomware.pdf"
    ],
    "report_names": [
        "2021-10-21 - FIN7 Recruits Talent For Push Into Ransomware.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "220e1e99-97ab-440a-8027-b672c5c5df44",
            "created_at": "2022-10-25T16:47:55.773407Z",
            "updated_at": "2025-03-27T02:05:17.379427Z",
            "deleted_at": null,
            "main_name": "GOLD KINGSWOOD",
            "aliases": [
                "Cobalt Spider ",
                "Cobalt Gang "
            ],
            "source_name": "Secureworks:GOLD KINGSWOOD",
            "tools": [
                " Buhtrap",
                " Carbanak",
                " Cobalt Strike",
                " CobtInt",
                " Cyst",
                " Metasploit",
                " Meterpreter",
                " Mimikatz",
                " SpicyOmelette",
                "ATMSpitter"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "2dfaa730-7079-494c-b2f0-3ff8f3598a51",
            "created_at": "2022-10-25T16:07:23.474746Z",
            "updated_at": "2025-03-27T02:02:09.822683Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "ATK 67",
                "Cobalt Gang",
                "Cobalt Spider",
                "Gold Kingswood",
                "Mule Libra",
                "TAG-CR3"
            ],
            "source_name": "ETDA:Cobalt Group",
            "tools": [
                "ATMRipper",
                "ATMSpitter",
                "Agentemis",
                "AmmyyRAT",
                "AtNow",
                "COOLPANTS",
                "CobInt",
                "Cobalt Strike",
                "CobaltStrike",
                "Cyst Downloader",
                "Fareit",
                "FlawedAmmyy",
                "Formbook",
                "Little Pig",
                "Metasploit Stager",
                "Mimikatz",
                "More_eggs",
                "NSIS",
                "Nullsoft Scriptable Install System",
                "Pony Loader",
                "Ripper ATM",
                "SDelete",
                "Siplog",
                "SoftPerfect Network Scanner",
                "SpicyOmelette",
                "Taurus Builder",
                "Taurus Builder Kit",
                "Taurus Loader",
                "Terra Loader",
                "ThreatKit",
                "VenomKit",
                "cobeacon",
                "win.xloader"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "c11abba0-f5e8-4017-a4ee-acb1a7c8c242",
            "created_at": "2022-10-25T15:50:23.744036Z",
            "updated_at": "2025-03-27T02:00:55.537114Z",
            "deleted_at": null,
            "main_name": "Cobalt Group",
            "aliases": [
                "Cobalt Group",
                "GOLD KINGSWOOD",
                "Cobalt Gang",
                "Cobalt Spider"
            ],
            "source_name": "MITRE:Cobalt Group",
            "tools": [
                "Mimikatz",
                "More_eggs",
                "SpicyOmelette",
                "SDelete",
                "Cobalt Strike",
                "PsExec"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673536071,
    "ts_updated_at": 1743041818,
    "ts_creation_date": 1653701235,
    "ts_modification_date": 1653701235,
    "files": {
        "pdf": "https://archive.orkl.eu/6bb03bec5028bfed56fd30d98d866fb166150e9f.pdf",
        "text": "https://archive.orkl.eu/6bb03bec5028bfed56fd30d98d866fb166150e9f.txt",
        "img": "https://archive.orkl.eu/6bb03bec5028bfed56fd30d98d866fb166150e9f.jpg"
    }
}