{
    "id": "b1b54c65-2a52-4a43-ac04-a116fc5811af",
    "created_at": "2023-06-05T02:06:51.708683Z",
    "updated_at": "2025-03-27T02:09:17.802926Z",
    "deleted_at": null,
    "sha1_hash": "aa1de31acc2decd5bb2ef3b05f4b61d3ebab7c64",
    "title": "2023-05-24 - Technical Analysis of Pikabot",
    "authors": "",
    "file_creation_date": "2023-06-04T13:03:25Z",
    "file_modification_date": "2023-06-04T13:03:25Z",
    "file_size": 796775,
    "plain_text": "# Technical Analysis of Pikabot\n\n**zscaler.com/blogs/security-research/technical-analysis-pikabot**\n\n## Key Points\n\n_Pikabot is a new malware trojan that emerged in early 2023 that consists of two components: a_\nloader and a core module.\nThe core module implements the malicious functionality that includes the ability to execute arbitrary\ncommands and inject payloads that are provided by a command-and-control server.\nPikabot utilizes a code injector to decrypt and inject the core module.\nThe core module and its injector use a series of anti-analysis techniques. In addition, they use the\npublic tool ADVobfuscator for string obfuscation.\nPikabot shares similarities with the Qakbot trojan including the distribution methods, campaigns,\nand malware behaviors.\n\nPikabot is a malicious backdoor that has been active since early 2023. The malware is modular with a\nloader and a core component that implements the majority of the functionality. Pikabot is capable of\nreceiving commands from a command-and-control server such as the injection of arbitrary shellcode,\nDLLs or executable files. Zscaler Threatlabz has observed Pikabot being used to distribute Cobalt Strike.\n\nThe Pikabot malware author has added a number of anti-analysis techniques to thwart automated\nanalysis in sandbox and research environments. The code checks for the presence of debuggers,\nbreakpoints, and system information including memory and the number of processors. Pikabot also uses\nthe [ADVobfuscator library to encrypt important strings used by the malware.](https://github.com/andrivet/ADVobfuscator)\n\n\n-----\n\nThreatlabz has noticed some resemblances between Pikabot and Qakbot including the method of\ndistribution, behavior, and internal campaign identifiers. However, there is not sufficient evidence at this\ntime to definitively link these malware families to the same threat actor.\n\n## Technical Analysis\n\nIn the following sections, we focus on Pikabot’s core module and its injector since the downloader does\nnot contain any functionality/features worth mentioning.\n\n## Core Module Injector\n\nPikabot uses an injector to run a series of anti-analysis tests and then decrypt and inject the core module\npayload. If any of these tests fail, Pikabot will terminate execution. ThreatLabz has identified the following\nanti-analysis methods implemented by the injector:\n\nException Handlers by using int 2d and int 3 instructions to raise them.\nReading the BeingDebugged flag of the process environment block (PEB).\nUse of the Windows API function Beep to delay the execution.\nAttempt to load junk and incorrect libraries in order to detect sandboxes. This code appears to be\ncopied from [https://github.com/CheckPointSW/Evasions/blob/master/_techniques/processes.md.](https://github.com/CheckPointSW/Evasions/blob/master/_techniques/processes.md)\nUse of the Windows API functions CheckRemoteDebuggerPresent and IsDebuggerPresent for\ndebugger detection.\nThe value of the NtGlobalFlag in the PEB that indicates a debugger is present.\nUse of the Windows API function NtQueryInformationProcess with the classes ProcessDebugPort\nand ProcessDebugFlags.\nUse of the GetWriteWatch API. The implementation seems to have been copied from here:\n[https://github.com/BaumFX/cpp-anti-debug/blob/master/anti_debug.cpp#L260](https://github.com/BaumFX/cpp-anti-debug/blob/master/anti_debug.cpp#L260)\nUse of the OutputDebugString function in order to detect a debugger. The implementation has been\n[copied from here: https://github.com/BaumFX/cpp-anti-debug/blob/master/anti_debug.cpp#L456](https://github.com/BaumFX/cpp-anti-debug/blob/master/anti_debug.cpp#L456)\nCheck the number of processors, which should be greater than or equal to 2.\nUse of the rdtsc instruction to check for single stepping during debugging.\nThe system random access memory (RAM) must be greater than 2GB.\nDetection of hardware breakpoints.\nDetection by checking the trap flag via __readeflags.\n\n_ANALYST NOTE: It should be noted that the use of exceptions is used in many parts of the code, for_\n_example, during the decryption of the core payload._\n\nThe injector decrypts the core module as follows:\n\n1. Loads a set of PNG images, which are stored in the resources section (RCDATA), and decrypts\n\nthem using a bitwise XOR operation with a hardcoded 32-byte key. Note that each PNG image\nholds an encrypted chunk of the core module.\n2. Decrypt the XOR decrypted data using AES (CBC mode) with the same 32-byte key and use the\n\nfirst 16 bytes of the encrypted data as an initialization vector (IV).\n\nOnce the core payload has been decrypted, the Pikabot injector creates a process with a specified file\npath (e.g. WerFault) and injects the core module into it. Finally, the Pikabot injector sets the\n_PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON flag_\n\n\n-----\n\nin order to protect the injected process from non-signed Microsoft binaries.\n\n## Core Module\n\nIn the following sections, the core module is analyzed with samples compiled in May 2023.\n\n### Anti-Analysis\n\nSimilar to the injector, the Pikabot core module performs additional anti-analysis checks. One notable\ntechnique is a “sleep” function, which Pikabot uses to delay execution. Instead of using common\nWindows API functions, Pikabot uses the NtContinue API function in order to set a timer. The technique is\n[not new and it is similar to other proof-of-concepts implementations.](https://github.com/thefLink/DeepSleep)\n\nIn addition to the tests above, Pikabot stops execution if the system's language is any of the following:\n\nGeorgian (Georgia)\nKazakh (Kazakhstan)\nUzbek (Cyrillic)\nTajik (Tajikistan)\nRussian (Russia)\nUkrainian (Ukraine)\nBelarusian (Belarus)\nSlovenian (Slovenia)\n\nThis check is common for many threat actors that originate from countries in the Commonwealth of\nIndependent States (CIS) to reduce the chances of criminal prosecution.\n\n### Persistence\n\nPikabot uses two methods to add persistence on a host:\n\n1. Upon execution, Pikabot retrieves its current execution folder and checks if it is located in the\n\n_AppData folder under a hardcoded folder name (might differ from sample to sample)._\n\nIf Pikabot is not run from this specific file path, then it will add persistence on the compromised host\nby creating a new value with its file path in the Run registry key (the key name is hardcoded in the\nbinary). On top of that, Pikabot corrupts the current executable file by replacing it with its PE header\n(512 bytes length) followed by null bytes (3,584 bytes in length).\n\n2. Pikabot downloads a PowerShell script from the command-and-control server and stores it in\n\n_HKEY_CURRENT_USER\\Software\\predefined_name, where predefined_name is a hardcoded_\nstring in the binary file. Additionally, it stores the encrypted command-and-control servers in the\nsame registry path.\n\nLastly, Pikabot sets a value in the Run registry key to execute a command line that invokes this\nPowerShell script (e.g., cmd /q /c start /min \" powershell \"$cimeter = Get-ItemProperty -Path\n_HKCU:\\Software\\cimeter; powershell -encodedcommand $cimeter.unbevelledHamuli\")_\n\n_ANALYST NOTE: Pikabot also has the option to directly execute a downloaded file instead of using_\n_this persistence mechanism (Even though this is not currently being used)._\n\n\n-----\n\n### Command-and-Control Configuration\n\nPikabot does not store the command-and-control information in a single block (e.g. as Qakbot does).\nInstead, each component (e.g. URIs) is encrypted using ADVobfuscator and the command-and-control\nserver IP addresses and ports are further decrypted during runtime using the following algorithm. Firstly,\nPikabot decrypts a string that includes a set of Base64 encoded strings. Then it parses the string using\nthe delimiter '&' and decrypts the contents by following the below steps:\n\n1. Read the first 32 bytes of the string and use them as an AES key.\n2. Decode the rest of the string using Base64.\n3. Read the first 16 bytes of the decoded string and use them as an IV.\n4. Read the rest of the decoded data and decrypt it using AES (CBC mode).\n5. The decrypted output is a Base64 string, which results in the command-and-control server IP\n\naddress and corresponding port. Note that many of the Pikabot command-and-control servers listen\non ports that are identical to the ports used by Qakbot’s proxy module such as 1194, 2078, and\n2222.\n\nThere have been some minor changes over the last few months in the way that Pikabot command-andcontrol servers have been stored. For example, in previous versions, the command-and-control servers\nwere only encoded using Base64 and no further encryption or parsing was required.\n\nPikabot also appears to contain a campaign ID and binary version in each sample. These can be\nobserved during the network communication, where the JSON data has the keys \"version\" and \"stream\".\nThe latter appears to be a campaign ID. An example request (before encryption) containing these values\nis shown below:\n\n_{\"uuid\": \"F37670100000074E33652510483\", \"stream\": \"_\n\n_[[email protected]@2e88e610b66b4205853b211f21873208\", \"os_version\": \"Win 10.0 19050\",](https://www.zscaler.com/cdn-cgi/l/email-protection)_\n_\"product_number\": 161, \"username\": \"test\", \"pc_name\": \"DESKTOP-TEST\", \"cpu_name\": \"11th Gen_\n_Intel(R) Core(TM)\", \"pc_uptime\": 29884462, \"gpu_name\": \"GPU_NAME\", \"ram_amount\": 8096,_\n_\"screen_resolution\": \"1560x1440\", \"version\": \"0.5.3\", \"domain_name\": \"\", \"domain_controller_name\":_\n_\"unknown\", \"domain_controller_address\": \"unknown\", \"knock_timeout\": 254, \"is_elevated\": 0}_\n\nThe campaign ID values observed by Threatlabz are particularly interesting because of the prefixes BB1\nand eu_bb_0. These resemble some of the campaign IDs that have been observed in Qakbot binaries,\nwhich frequently contain the prefix BB followed by an integer.\n\n### Network communication\n\nPikabot starts by registering the compromised host with the command-and-control servers. The\nregistration process involves collecting system information and reporting it to the command-and-control\nserver with an HTTPS POST request. A variety of data is collected such as the following:\n\n1. Network information by executing the command ipconfig.exe /all\n2. User/groups information by executing whoami.exe /all\n3. Windows build information.\n4. Generic host information (e.g. available RAM, screen resolution)\n5. Domain controllers information.\n\n\n-----\n\nSimilar to other botnets, Pikabot generates a unique bot identifier for the compromised host. The\nalgorithm, which Pikabot uses to generate the bot identifier can be replicated in Python using the code\n[here.](https://github.com/threatlabz/tools/tree/main/pikabot)\n\nOnce the registration procedure has been completed and persistence to the compromised host has been\nestablished, Pikabot starts requesting tasks from the server. Pikabot supports the following command\ntypes:\n\ntask - a command to execute\nknock - a keep-alive message\n\nThe tasks that Pikabot currently supports are described in Table 1.\n\n**Task Name** **Description**\n\ncmd Executes a shell command via cmd.exe.\n\ndestroy Exits the current process.\n\nshellcode Injects and executes downloaded shellcode.\n\ndll Injects a downloaded DLL file.\n\nexe Injects a downloaded EXE file.\n\nadditional Collects additional host information by executing one of the commands in Table 2.\n\nknock_timeout Updates the timer value, which indicates how often Pikabot should send a knock\nrequest.\n\n_Table 1 - Pikabot tasks description_\n\nPikabot also supports the “additional” commands shown in Table 2, which are focused on collecting\nfurther system information.\n\n**Command** **Description**\n\nscreenshoot Not implemented.\n\nwhoami Executes the shell command whoami /all.\n\nipconfig Executes the shell command ipconfig /all.\n\nprocesses Collects process information.\n\n\n-----\n\n_Table 2 - Additional Pikabot commands description_\n\nIt is worth noting that depending on the network request, Pikabot uses a different URI (which may differ\namong samples). For example, for reporting a command output, the URI may be\n_Duenna/ZuGAYDS3Y2BeS2vW7vm?AnacrusisCrotalinae=zH4Tfz._\n\nThe network data encryption procedure is similar to the configuration's decryption process. Pikabot\nencrypts a network request by following the steps below:\n\n1. The request data is encoded using Base64.\n2. Pikabot generates a random 32-byte key and encodes the data again using Base64.\n3. Pikabot reads the first 16-bytes of a function prologue and uses these bytes as an IV.\n4. The data is encrypted using AES (CBC mode) and encoded with Base64.\n5. The 32-byte key is prepended to the encoded data.\n6. The hardcoded URI key (e.g. mMG50=) is prepended to the final output.\n\n## Conclusion\n\nOverall, Pikabot is a new malware family that implements an extensive set of anti-analysis techniques\nand offers common backdoor capabilities to load shellcode and execute arbitrary second-stage binaries.\nPikabot may have potential ties to Qakbot with some commonalities in the distribution, design, and\ncampaign identifiers. However, ThreatLabz has not established a definitive link yet between the two\nmalware families.\n\n## Cloud Sandbox\n\nIn addition to sandbox detections, Zscaler’s multilayered cloud security platform detects indicators related\nto Pikabot at various levels with the following threat names:\n\n[Win32.Trojan.PikaBot](https://threatlibrary.zscaler.com/threats/204a445f-a80e-41ff-a263-fb263bcca35d)\n\n## Indicators of Compromise\n\n Host Indicators\n\n**SHA256 Hash** **Description**\n\n92153e88db63016334625514802d0d1019363989d7b3f6863947ce0e490c1006 Pikabot Injector/Core\nmodule\n\na48c39cc45efea110a7c8edadcb6719f5d1ebbeebb570b345f47172d393c0821 Pikabot Injector/Core\nmodule\n\n8ee9141074b48784c89aa5d3cd4010fcf4e6d467b618c8719970f78fcc24a365 Pikabot Injector/Core\nmodule\n\n\n-----\n\na9db5aca01499f6ce404db22fb4ba3e4e0dc4b94a41c805c520bd39262df1ddc Pikabot Injector/Core\nmodule\n\n347e2f0d8332dd2d9294d06544c051a302a2436da453b2ccfa2d7829e3a79944 Pikabot Injector/Core\nmodule\n\n## Network Indicators\n\n**IOC** **Description**\n\nhxxps://129.153[.]135.83:2078 Command-and-Control server\n\nhxxps://132.148.79[.]222:2222 Command-and-Control server\n\nhxxps://45.154.24[.]57:2078 Command-and-Control server\n\nhxxps://45.85.235[.]39:2078 Command-and-Control server\n\nhxxps://94.199.173[.]6:2222 Command-and-Control server\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2023/2023-05-24 - Technical Analysis of Pikabot.pdf"
    ],
    "report_names": [
        "2023-05-24 - Technical Analysis of Pikabot.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1685930811,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1685883805,
    "ts_modification_date": 1685883805,
    "files": {
        "pdf": "https://archive.orkl.eu/aa1de31acc2decd5bb2ef3b05f4b61d3ebab7c64.pdf",
        "text": "https://archive.orkl.eu/aa1de31acc2decd5bb2ef3b05f4b61d3ebab7c64.txt",
        "img": "https://archive.orkl.eu/aa1de31acc2decd5bb2ef3b05f4b61d3ebab7c64.jpg"
    }
}