{
    "id": "b1d7cce9-1869-4b9d-a01e-82fe0a814226",
    "created_at": "2023-01-12T15:04:58.686782Z",
    "updated_at": "2025-03-27T02:05:45.7912Z",
    "deleted_at": null,
    "sha1_hash": "6926d6fcec1cfc86c7e3ac46e964299a61b1a134",
    "title": "2020-11-17 - RegretLocker",
    "authors": "",
    "file_creation_date": "2022-05-27T23:23:36Z",
    "file_modification_date": "2022-05-27T23:23:36Z",
    "file_size": 141080,
    "plain_text": "# RegretLocker\n\n**[chuongdong.com/reverse engineering/2020/11/17/RegretLocker/](http://chuongdong.com/reverse%20engineering/2020/11/17/RegretLocker/)**\n\nChuong Dong November 17, 2020\n\n[Reverse Engineering · 17 Nov 2020](http://chuongdong.com/categories/#reverse%20engineering)\n\n## Summary\n\n**_RegretLocker is a new ransomware that has been found in the wild in the last month that does_**\nnot only encrypt normal files on disk like other ransomwares. When running, it will particularly\nsearch for VHD files, mount them using Windows Virtual Storage API, and then encrypt all the\nfiles it finds inside of those VHD files.\n\nTypically, VHD files are huge in size with a max size of nearly 2TB because it’s mainly ussed to\nstore the contents of a hard disk of a VM which includes disk particitions and file systems. This\nmakes it unrealistic for ransomware to waste time encrypting simply because it’s too big.\n\nHowever, through mounting these virtual disks as physical disks, RegretLocker can go through\nand encrypt the individual files inside, which significantly increases encryption speed overall.\n\nFor encryption, RegretLocker reaches out to the C&C server for a RSA key in order to encrypt\nand produce a unique AES key. This AES key will be used to encrypt all of the files on the disks.\nHowever, if the machine is offline or it can’t reach C&C, it will just uses the hard-coded RSA key in\nmemory, which makes it simple to write a decryption tool for!\n\nAll of the encrypted files have the extension .mouse.\n\n[Huge shout-outs to Vitali Kremez and](https://twitter.com/VK_Intel) [MalwareHunterTeam for bringing this ransomware to my](https://twitter.com/malwrhunterteam)\nattention!\n\nalt text\n\n## IOCS\n\n**_RegretLocker comes in the form of a 32-bit PE file._**\n\n**_MD5: 3265b2b0afc6d2ad0bdd55af8edb9b37_**\n\n**_SHA256: a188e147ba147455ce5e3a6eb8ac1a46bdd58588de7af53d4ad542c6986491f4_**\n\nalt text\n\n## Dependencies\n\n**_Advapi32.dll and Crypt32.dll: Main crypto functionalities such as RSA and AES encryption_**\n\n\n-----\n\n**_VirtDisk.dll: Mounting virtual disk functionalities_**\n\n**_tor-lib.dll: DLL dropped by RegretLocker that is used to contact C&C through Tor_**\n\n## Networking\n\n**_RegretLocker contacts the C&C server at http://regretzjibibtcgb.onion/input through Tor 3_**\ntimes:\n```\n- Retrieve RSA key from server\n- Sending information such as the computer's IP, name, volume of the disks,..\n- Signalling when it finishes encrypting\n\n```\nBefore contacting C&C, it sends a GET request to http://api.ipify.org/ to retrieve the PC’s public\nIP address. If this fails, the malware can assume that it’s running offline and will use the hardcoded RSA key.\n\n## Ransom Note\n\n**_RegretLocker drops a ransom note in every folder that it encrypts. This is the content if you run_**\nthe malware with Internet connection. The hash is used to identify which RSA key is used to\ngenerate the AES key on your machine.\n\nalt text\n\n[You can find malware log here on my Github](http://chuongdong.com/uploads/locker.log)\n\n## Code Analysis\n\n### Only One Process Running\n\n**_RegretLocker first check if there is only one version of itself running by looping through all of the_**\nrunning processes using CreateToolhelp32Snapshot, Process32First, and Process32Next.\n\nFor each of the running processes, it compares the name against its own name to make sure that\nthere is no process with the same name.\n\nIf there is one with the same name, the ransomware exits immediately.\n\nalt text\n\n### Dropping tor-lib.dll\n\nThe malware extracts the path to the current directory it is located in through\n**_GetModuleFileNameA and concats ”\\tor-lib.dll” to it, which means that it drops this dll in the_**\nsame directory of the malware.\n\nalt text\n\n\n-----\n\nIt then calls a function to extract the dll from its resource section through FindResourceA,\n**_LoadResource, and LockResource. As we can see in Resource Hacker, the dll is stored_**\nunencrypted in the resource section. After extracting the dll, it calls LoadLibrary to get a handle to\nthe dll. This handle will be used for the malware to contact C&C.\n\nalt text\n\n### Development Check\n\nThe malware writter has 2 weird checks to check for a particular user name and PC name(WIN**_295748OMAKG). If the user name or the PC name matches, the malware will exit immediately._**\n\nThis is potentially just a check against the development PC to make sure that the ransomware\ndoes not try to encrypt the machine during development.\n\nAs a developer myself, I’m disappointed by this unprofessionalism . Clean up your damn code\nplease!\n\nalt text\n\n### Persistence\n\nFor persistence, the malware set the registry\n**_SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run to the path of the malware. This ensures_**\nthat the malware is automatically run every time the user logs into the machine.\n\nalt text\n\nNext, it also schedules the malware as a task every minite using this Schtasks.exe command,\nwhich is run from cmd.exe using ShellExecuteA.\n```\n schtasks /Create /SC MINUTE /TN \"Mouse Application\" /TR \"RegretLocker_path\" /f\n\n```\nalt text\n\n### Encryption Setup\n\nThe malware builds and executes this command from cmd.exe.\n```\n cmd.exe /C wmic SHADOWCOPY DELETE & wbadmin DELETE SYSTEMSTATEBACKUP & bcdedit.exe /\nset{ default } bootstatuspolicy ignoreallfailures & bcdedit.exe / set{ default }\nrecoveryenabled No\n\n```\n**_wmic SHADOWCOPY DELETE: This will delete all of the shadow copies of the files on the_**\nsystem, preventing the encrypted files to be reverted to their previous state.\n**_wbadmin DELETE SYSTEMSTATEBACKUP: Delete system backup. Preventing the_**\nsystem to go back to a previous snapshot\n**_bcdedit.exe / set{ default } bootstatuspolicy ignoreallfailures: Set the boot status policy_**\nto ignore errors during a failed boot. Make sure the PC does not fail over to Windows\nrecovery or reboot.\n\n\n-----\n\n**_bcdedit.exe / set{ default } recoveryenabled No: Make sure the system can t be_**\nrecovered.\n\nNext, it loops through all the drives and add the name of those with the drive type DRIVE_FIXED,\n**_DRIVE_REMOVABLE, or DRIVE_REMOTE._**\n\nalt text\n\nThese names are mounted to the C drive using GetVolumePathNamesForVolumeNameA,\n**_SetVolumeMountPointA, FindFirstVolumeA, and FindNextVolumeA. Since this function name_**\nis labeled as show_hided_drives(), this function just probably mounts all the valid drives so it won’t\nmiss any hidden drive.\n\nalt text\n\n### Retrieving RSA key\n\nAs discussed above, the malware will first reach out to C&C at\n**_http://regretzjibibtcgb.onion/input with get_key in the query to request the RSA key._**\n\nalt text\n\nThe global variable RSA_KEY will be written accordingly with the RSA key depending on if it can\nreach the C&C or not. If it can’t, it will use this hard-coded RSA key.\n```\n-----BEGIN PUBLIC KEY----MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC1ZQInrnhxXCtAN/LsOX2GmgbvBxMsO49lc1/qodshkUvRQLazWv6\n-----END PUBLIC KEY----\n### Generating AES key\n\n```\nUsing the RSA key, it will call CryptAcquireContextA, CryptDecodeObjectEx,\n**_CryptImportPublicKeyInfo, and CryptEncrypt to encrypt the “AES” buffer in memory, generating_**\na new AES key\n\nalt text\n\nWith this method, the malware can generate a different AES key as long as it’s receiving a\ndifferent RSA key from C&C. However, this AES key is constant after this encryption if the malware\nis run offline, so it should be straightforward to produce a decrypting tool if either C&C is down or\nthe PC is not connected to the Internet.\n\n### Encryption - USB Drives\n\nThe first encryption happens to USB drives, if there are any. This function is called to retrieve the\nname of all the USB drives by checking for any drive with DRIVE_REMOVABLE type. This\nfunction was pretty similar of the one previously used in show_hided_drives().\n\nalt text\n\n\n-----\n\nNext, it loops through all of these USB drives and call a function to encrypt its content. I label this\nas small_encrypt() because it is used to encrypt USB drives and small files only.\n\nalt text\n\nI will dive into these encryption functions later because there are a few different version to cover.\n\n### Encryption - SMB Scanner\n\nThe malware is written in C++, and there is a class called smb_scanner. The SMB function tries\nSMB scanning to find\n\nAdapter names and address ranges on the adapter\nNetServers’s IP addresses and machine names on the server using NetServerEnum.\n\nalt text\n\nThe result value is a buffer of all the SMB folders in string form.\n\nThen, it goes through a while loop calling a function to encrypt these SMB folders, so I label this\nencryption function as smb_encrypt(). I actually have not set up SMB on my virtual machine, so\nwhen I ran this, I did not know if it could actually encrypt SMB folders or not…\n\nalt text\n\n### Encryption - Large Files\n\nThe malware has a specific method of looking for large files and then begins to encrypt them right\nafter the SMB encryption.\n\nalt text\n\nThe malware author called this encryting function encrypt_large_file(), so I just went along with it.\nSeems like it’s the same as most of the other encrypting functions except that it has extra stuff to\naccount for the file size. The core of this function still boils down to an AES encryption.\n\nalt text\n\nAfter the encryption, it will rename the encrypted file to the same name but with the extension\n**_.mouse and overwrite the file buffer with this newly encrypted buffer._**\n\n### Encryption - Everything Else\n\nAfter the large file encryption, RegretLocker goes into a while loop to encrypt everything else with\n_small_encrypt()._\n\nalt text\n\n_small_encrypt() calls a wrapper function to navigate around directories and files before encrypting_\nthem. It specifically looks out for these to avoid encrypting them.\n\n\n-----\n\n**_RegretLocker file_**\n**_.log_**\n**_HOW TO RESTORE FILES.TXT_**\n**_Windows folder_**\n**_ProgramData_**\n**_Microsoft_**\n**_System_**\n\nNext, it checks the file type. If the file type is FILE_ATTRIBUTE_DIRECTORY, it will calls a\nrecursive encrypting function to recursively go through every layer inside the folder. If the file type\nis not a folder, it will simply call the main encrypting function to encrypt it.\n\nalt text\n\nInside of the recursive encrypting function, RegretLocker specifically looks for these file names to\navoid encrypting them.\n\n**_Cheat_**\n**_Notepad_**\n**_x96dbg_**\n**_Hex Editor_**\n**_tor-lib.dll_**\n**_.mouse_**\n\nSince the drives are mounted, RegretLocker checks the file extension for “.vhd” in order to\ndetect any virtual drive. If found, it will call a function to open the virtual drive to start encrypting\neverything inside by recursively calling back to the recursive function. The ransomware uses a\nseries of calls to OpenVirtualDisk, AttachVirtualDisk, GetVirtualDiskPhysicalPath,\n**_FindFirstVolumeW, CreateFileW, DeviceIoControl, GetVolumePathNamesForVolumeNameW,_**\n**_and FindNextVolumeW to retrieve a list of file and folder names inside._**\n\nalt text\n\nIf the file is not a folder, it will just call the main encrypting function to encrypt it.\n\nThis function is divided into 2 condition blocks. If the file size is greater than 104857600 bytes or\naround 105MB, the file is counted as a large file and will be encrypted with the encrypt_large_file()\nfunction. If it’s not, then RegretLocker proceeds to encrypt it using AES.\n\nalt text\n\nThere is a catch here. If the encryption fails, it means the file is running or used by some process.\nFor that case, RegretLocker will find the process that is currently using this file and attempt to\nterminate it. It’s accomplishing this through the use of Restart Manager with these API calls.\n\n**_RmStartSession: Start a new session for Restart Manager_**\n**_RmRegisterResources: Registering the file to be encrypted as a resource_**\n**_RmGetList: Get the list of application of services/processes that are using this resource_**\n\n\n-----\n\n**_CreateToolhelp32Snapshot, Process32FirstW, and Process32NextW: Check all running_**\nprocesses for their ID, comparing with the processes above\n\nalt text\n\nAfter getting the processes that are using the file, it checks for the name. If they match any of\nthese, they will not be added to the list and closed later.\n\n**_vnc_**\n**_ssh_**\n**_mstsc_**\n**_System_**\n**_svchost.exe_**\n\nalt text\n\n**_RegretLocker then builds the command string_** `taskkill /F /IM \\process_name and runs it`\nwith cmd.exe. This command basically just filters out the process with the given process name\nand terminates it.\n\nThe ransomware will continuously loop until it successfully closes the process. Then it will attempt\nthe encryption again.\n\n### Encryption - AES\n\nThe core of the encrypting functions above are this one AES encrypting function. It basically just\nuses the generated AES key to encrypt the file with a series of calls to CryptAcquireContextA,\n**_CryptImportKey, CryptSetKeyParam, and CryptEncrypt, which is fairly standard._**\n\nAfter the encryption, it will write this encrypted buffer back into the file with the new file extension\n**_.mouse. It will also check the folder path to see if it has created the file HOW TO RESTORE_**\n**_FILES.TXT already and created one if it has not._**\n\nalt text\n\n## YARA rule\n\n\n-----\n\n```\nrule regretlocker {\n     meta:\n          description = \"YARA rule for RegretLocker\"\n          reference =\n\"http://chuongdong.com/reverse%20engineering/2020/11/17/RegretLocker/\"\n          author = \"@cPeterr\"\n          tlp = \"white\"\n     strings:\n          $str1 = \"tor-lib.dll\"\n          $str2 = \"http://regretzjibibtcgb.onion/input\"\n          $str3 = \".mouse\"\n          $cmd1 = \"taskkill /F /IM \\\\\"\n          $cmd2 = \"wmic SHADOWCOPY DELETE\"\n          $cmd3 = \"wbadmin DELETE SYSTEMSTATEBACKUP\"\n          $cmd4 = \"bcdedit.exe / set{ default } bootstatuspolicy ignoreallfailures\"\n          $cmd5 = \"bcdedit.exe / set{ default } recoveryenabled No\"\n          $func1 = \"open_virtual_drive()\"\n          $func2 = \"smb_scanner()\"\n          $checklarge = { 81 fe 00 00 40 06 }\n     condition:\n          all of ($str*) and any of ($cmd*) and any of ($func*) and $checklarge\n}\n\n## Samples\n\n```\nI got my samples from [Any.Run and](https://app.any.run/tasks/e19eff7c-6d0f-4b09-95da-23f6ab465bb1/) [tutorialjinni.com!](https://www.tutorialjinni.com/regretlocker-ransomware-sample-download.html)\n\n## References\n\nhttps://twitter.com/VK_Intel/status/1323693700371914753\nhttps://twitter.com/malwrhunterteam/status/1321375502179905536\nhttps://github.com/vxunderground/VXUGPapers/blob/main/Weaponizing%20Windows%20Virtualization/WeaponizingWindowsVirtualization.pdf\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-17 - RegretLocker.pdf"
    ],
    "report_names": [
        "2020-11-17 - RegretLocker.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535898,
    "ts_updated_at": 1743041145,
    "ts_creation_date": 1653693816,
    "ts_modification_date": 1653693816,
    "files": {
        "pdf": "https://archive.orkl.eu/6926d6fcec1cfc86c7e3ac46e964299a61b1a134.pdf",
        "text": "https://archive.orkl.eu/6926d6fcec1cfc86c7e3ac46e964299a61b1a134.txt",
        "img": "https://archive.orkl.eu/6926d6fcec1cfc86c7e3ac46e964299a61b1a134.jpg"
    }
}