{
    "id": "b1ea3ac3-1d09-4284-9e48-6b78824bad1d",
    "created_at": "2023-01-12T14:58:53.071573Z",
    "updated_at": "2025-03-27T02:05:44.228939Z",
    "deleted_at": null,
    "sha1_hash": "1d48b70a2383844ce7ae5448074a6abece648bf3",
    "title": "2022-04-05 - New Analysis- The CaddyWiper Malware Attacking Ukraine",
    "authors": "",
    "file_creation_date": "2022-05-27T23:17:43Z",
    "file_modification_date": "2022-05-27T23:17:43Z",
    "file_size": 1928107,
    "plain_text": "# CaddyWiper Analysis\n\n**[blog.morphisec.com/caddywiper-analysis-new-malware-attacking-ukraine](https://blog.morphisec.com/caddywiper-analysis-new-malware-attacking-ukraine)**\n\n## New Analysis: The CaddyWiper Malware Attacking Ukraine\n\nPosted by [Michael Dereviashkin on April 5, 2022](https://blog.morphisec.com/author/michael-dereviashkin)\n\n[Tweet](https://twitter.com/share)\n\n\n-----\n\nAs Russia s invasion of Ukraine continues, new wiper malware has surfaced attacking\n[Ukrainian infrastructure. Caddywiper was first detected on March 14, 2022. It destroys user](https://www.welivesecurity.com/2022/03/15/caddywiper-new-wiper-malware-discovered-ukraine/)\ndata, partitions information from attached drives, and has been spotted on several dozen\nsystems in a limited number of organizations. CaddyWiper has been deployed via GPO,\nsuggesting the attackers had initially compromised the target's Active Directory server.\nMorphisec Labs’ CaddyWiper analysis follows.\n\nCaddyWiper is the fourth wiper observed attacking Ukrainian targets. WhisperGate was the\nfirst wiper. It was used in attacks on Ukrainian government agencies ahead of the invasion.\nWhisperGate was soon followed by HermeticWiper and IsaacWiper, with CaddyWiper the\nthird wiper deployed in as many weeks.\n\n## CaddyWiper Chart\n\nThis chart details the CaddyWiper execution flow:\n\n## Technical Analysis\n\n### Main Functionality\n\n\n-----\n\nIf the computer that CaddyWiper was executed on is not a domain controller (DC), the\nmachine won’t be harmed. If it is a PDC, Caddy starts wiping at “C:\\\\Users” in order not to\nbreak the operating system before the wiping process completes. It then deletes every drive\nletter from “D:\\\\” drive to “Z:\\\\”. If Caddy was run with administrator privileges, it also deletes\nthe partition of the physical hard drives to absolutely wreck the operating system.\n\nThe below text describes this flow:\n\n### Dynamic API Loading\n\nCaddy uses the process environment block (PEB) to resolve the required Windows\napplication programming interface (API). This is to evade static and dynamic scanners. As\npart of reputation scoring, scanners validate for an executable import directory, and dynamic\nmonitoring is based on imported API hooking. Caddy officially declares only on the\nDsRoleGetPrimaryDomainInformation API as part of its import address table (IAT) while the\nrest is resolved dynamically via the PEB.\n\n\n-----\n\nThe image below displays the API resolution process through the PEB:\n\n[Pseudocode is available here (Password: morphisec)](https://pastebin.com/VPWGkZW9)\n\n### File Wiping\n\nThe function wipepath is responsible for the actual wiping process of a file. This function can\nhandle hidden and system files while additionally acquiring discretionary access control to\nthe file in path. This is to ensure as many files as possible are wiped. It wipes a maximum of\na 10MB chunk from the beginning of the file as part of performance optimization.\n\nSee below the wipepath function:\n\n\n-----\n\n### Discretionary Access Control\n\nThe wiper changes the DACL of a file object by taking ownership of that object. This only\nsucceeds if whoever starts the Caddy process has WRITE_DAC access to the object or is\nthe owner of the object. If the initial attempt to change the DACL fails, the code enables the\nprivilege of ‘SeTakeOwnershipPrivilege.’ It then makes the local system's administrators\n[group the owner of the object. The code used in Caddy is similar to the example that MSDN](https://docs.microsoft.com/en-us/windows/win32/secauthz/taking-object-ownership-in-c--)\nprovides.\n\n\n-----\n\n### Partition Wiping\n\nThe IOCTL (‘IOCTL_DISK_SET_DRIVE_LAYOUT_EX ‘) passed in DeviceIoControl is\ngenerally used for disk repartition according to the specified drive layout and partition\ninformation data. However, in our case, it just wipes 0x780 bytes from the physical drive\nwhile it iterates from “\\\\\\\\.\\\\PHYSICALDRIVE9” and goes until “\\\\\\\\.\\\\PHYSICALDRIVE0”.\nHowever, it can only be done if Caddy is executed with administrator privileges.\n\n### The Impact\n\n\n-----\n\nCaddyWiper can be executed with or without administrator privilege. In both cases it causes\nlethal damage to the target machine. CaddyWiper execution without administrator privileges\nmakes files worthless, as seen below:\n\nAnd when CaddyWiper starts with administrator privileges, it makes the operating system\nuseless as well:\n\n\n-----\n\nCaddy is a sophisticated wiper that can transform any machine it’s deployed against into a\nvery expensive door stopper. Unfortunately, traditional endpoint security solutions have a\nhard time preventing sophisticated attacks such as CaddyWiper. Due to its evasive,\npolymorphic nature, CaddyWiper hides its functionality from runtime monitoring and pattern\nmatching. Though the impact is visible, response time is irrelevant when it gets to wipers or\nransomware.\n\nReactive and static antivirus (AV) and endpoint detection and response (EDR) solutions\nneed augmentation to prevent APTs and lower the risk of breaches, lawsuits, fines, and\nbrand damage. Morphisec provides this additional defense layer and virtual patching with\nMoving Target Defense (MTD) technology. MTD creates a dynamic attack surface threat\nactors can’t penetrate, causing them to abort attacks. To learn more about Moving Target\nDefense, read the white paper: Zero Trust + Moving Target Defense: Stopping Ransomware,\n_Zero-Day, and Other Advanced Threats Where NGAV and EDR Are Failing._\n\n## Indicators of Compromise (IOCs)\n\n\n-----\n\na294620543334a721a2ae8eaaf9680a0786f4b9a216d75b55cfd28f39e9430ea\n\n1e87e9b5ee7597bdce796490f3ee09211df48ba1d11f6e2f5b255f05cc0ba176\n\nea6a416b320f32261da8dafcf2faf088924f99a3a84f7b43b964637ea87aef72\n\nF1e8844dbfc812d39f369e7670545a29efef6764d673038b1c3edd11561d6902\n\nB66b179eac03afafdc69f62c207819eceecfbf994c9efa464fda0d2ba44fe2d7\n\n9d83817f7cae01554f77680ed7e6698966bcf020915c0dc411e5d57f6eea6ed4\n\n5cc51f29c6074d9741d6e68bcf9ce8363d623437ea11506a36791b4763cefdc7\n\n[Contact SalesInquire via Azure](http://10.10.0.46/mailto:sales@morphisec.com)\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-04-05 - New Analysis- The CaddyWiper Malware Attacking Ukraine.pdf"
    ],
    "report_names": [
        "2022-04-05 - New Analysis- The CaddyWiper Malware Attacking Ukraine.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535533,
    "ts_updated_at": 1743041144,
    "ts_creation_date": 1653693463,
    "ts_modification_date": 1653693463,
    "files": {
        "pdf": "https://archive.orkl.eu/1d48b70a2383844ce7ae5448074a6abece648bf3.pdf",
        "text": "https://archive.orkl.eu/1d48b70a2383844ce7ae5448074a6abece648bf3.txt",
        "img": "https://archive.orkl.eu/1d48b70a2383844ce7ae5448074a6abece648bf3.jpg"
    }
}