{
    "id": "b1ec0214-86fc-49fe-847c-6874a6d3a6d6",
    "created_at": "2023-01-12T15:10:06.132143Z",
    "updated_at": "2025-03-27T02:12:03.912863Z",
    "deleted_at": null,
    "sha1_hash": "f47907cb014c571d29190bd315f73ff4a15152a0",
    "title": "2021-03-08 - Analyzing Attacks Against Microsoft Exchange Server With China Chopper Webshells",
    "authors": "",
    "file_creation_date": "2022-05-29T01:28:52Z",
    "file_modification_date": "2022-05-29T01:28:52Z",
    "file_size": 255333,
    "plain_text": "# Analyzing Attacks Against Microsoft Exchange Server With China Chopper Webshells\n\n**unit42.paloaltonetworks.com/china-chopper-webshell/**\n\nJeff White March 8, 2021\n\nBy [Jeff White](https://unit42.paloaltonetworks.com/author/jeff-white/)\n\nMarch 8, 2021 at 2:24 PM\n\n[Category: Unit 42](https://unit42.paloaltonetworks.com/category/unit-42/)\n\nTags: [China Chopper,](https://unit42.paloaltonetworks.com/tag/china-chopper/) [CVE-2021-27065,](https://unit42.paloaltonetworks.com/tag/cve-2021-27065/) [Hafnium,](https://unit42.paloaltonetworks.com/tag/hafnium/) [Microsoft Exchange Server,](https://unit42.paloaltonetworks.com/tag/microsoft-exchange-server/)\n[vulnerabilities](https://unit42.paloaltonetworks.com/tag/vulnerability/)\n\nThis post is also available in: 日本語 [(Japanese)](https://unit42.paloaltonetworks.jp/china-chopper-webshell/)\n\n## Executive Summary\n\nMicrosoft recently released patches for a number of zero-day Microsoft Exchange Server\n[vulnerabilities that are actively being exploited in the wild by HAFNIUM, a suspected state-](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\nsponsored group operating out of China. We provide an overview of the China Chopper\nwebshell, a backdoor which has been observed being dropped in these attacks. We also\nanalyze incidental artifacts, such as metadata, created by the attacks themselves, which\nallow us to collect information and better understand the nature and methodology of the\nattackers.\n\n\n-----\n\nFor information on how Palo Alto Networks protects its customers from these threats, please\nrefer to our Threat Assessment: Active Exploitation of Four Zero-Day Vulnerabilities in\nMicrosoft Exchange Server.\n\n## The Role of the China Chopper Webshell\n\n[By leveraging CVE-2021-27065, a post-authentication arbitrary file write vulnerability, an](https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-27065)\nattacker is able to effectively inject code into an ASPX page for Exchange Offline Address\nBook (OAB). When this page is compiled with the injected webshell, the attacker can send\nother code and gain further access. The China Chopper webshell is a lightweight, one-line\nscript that is observed being dropped in these attacks by the use of the PowerShell SetOabVirtualDirectory cmdlet. This one-line webshell is relatively simple from the server\nperspective and has been observed in attacks since at least 2013, when FireEye reported on\nit.\n\nThe key detail here is that the China Chopper webshell is injected into a pre-existing OAB\nASPX page that contains configuration information unrelated to the webshell. It’s been\n[reported that there are thousands of compromises, and any on-premises Exchange Server](https://krebsonsecurity.com/2021/03/at-least-30000-u-s-organizations-newly-hacked-via-holes-in-microsofts-email-software/)\nthat is exposed to the internet should assume it’s been scanned numerous times. Knowing\nthis, and knowing that thousands of companies this week have begun the laborious chore of\nresponding to these attacks within their infrastructure, it didn’t take long before these OAB\nfiles started popping up on VirusTotal (VT).\n\nTo identify the specific OAB configuration files we’re interested in, I created a small YARA\nrule to identify some of the observed templates for the China Chopper webshell as they exist\nwithin OAB configurations.\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n\n\nrule webshell_chinachopper_oab\n\n{\n\nmeta:\n\nauthor = \"Jeff White (Palo Alto Networks) @noottrak\"\n\ndate = \"02MAR2021\"\n\nhash01 =\n\"e8ea17cd1de6d3389c792cce8c0ff1927a6386f0ef32ab0b097763de1f86ffc8\"\n\nhash02 =\n\"34f9944a85ffba58f3fa60c5dc32da1ce6743dae261e1820ef6c419808757112\"\n\nhash03 = \"55fbfab29f9d2c26f81f1ff901af838110d7f76acc81f14b791a8903aa8b8425\"\n\nhash04 =\n\"6e75bbcdd22ec9df1c7796e381a83f88e3ae82f5698c6b31b64d8f11e9cfd867\"\n\n\n-----\n\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n\n\nstrings:\n\n// Detect OAB file\n\n$OAB01 = \"ExternalUrl\" ascii // Contains webshell\n\n$OAB02 = \"InternalUrl\" ascii\n\n$OAB03 = \"ExchangeVersion\" ascii\n\n$OAB04 = \"WhenChangedUTC\" ascii\n\n// Detect injected Url variants\n\n$HTTP01 = \"http://f/\" ascii nocase\n\n$HTTP02 = \"http://g/\" ascii nocase\n\n$HTTP03 = \"http://p/\" ascii nocase\n\n// Detect ChinaChopper variants\n\n$websh01 = \"<script language=\\\"JScript\\\"\" ascii nocase\n\n$websh02 = \"<script language=\\\"c#\\\"\" ascii nocase\n\n$websh03 = \"<script runat=\\\"server\\\"\" ascii nocase\n\n// Detect webshell anchors\n\n$cc01 = \"Request\" ascii nocase\n\n$cc02 = \"Page_Load\" ascii nocase\n\n// Detect injected pattern, no webshell\n\n$non = /http:\\/\\/[a-z]\\/[a-z0-9]+/\n\ncondition:\n\n(all of ($OAB*) and 1 of ($HTTP*) and 1 of ($websh*) and all of ($cc*))\n\nor\n\n(all of ($OAB*) and $non)\n\n}\n\n\n-----\n\nFor reference, this is how the China Chopper webshell typically manifests itself within the\nOAB configurations – specifically in the ExternalUrl field.\n\nAdditional variants will be discussed throughout the document, but this is the most prevalent.\n\nAs of March 4, 2021, there are 81 unique matching samples uploaded to VT.\n\n[As FireEye documented in their 2013 analysis of this webshell, China Chopper is technically](https://www.fireeye.com/blog/threat-research/2013/08/breaking-down-the-china-chopper-web-shell-part-i.html)\nsplit into two parts: a client and a server. When the client engages with the server, in most\nvariants, it provides a “key” to act as authentication before executing whatever code the\nattacker supplies.\n\nIn the above China Chopper example, the key is \" NO9BxmCXw0JE \". This provides us with\na relatively unique identifier to compare to the other files. But why stop there?\n\n## OAB Artifacts\n\nThe OAB configuration contains a wealth of information such as when the file was created,\nwhen it was last modified, the Exchange version and numerous other server-specific related\ndata points. These allow us to take a deeper look at the attacks from a new perspective and\ngain a better understanding of the attack campaigns involved.\n\nOn March 2, 2021, Volexity published their blog, “Operation Exchange Marauder: Active\nExploitation of Multiple Zero-Day Microsoft Exchange Vulnerabilities,” which provided the first\nin-depth look at the attacks on Exchange Servers. However, we know that on Jan. 5, 2021,\nTwitter user [@orange_8361 (Orange Tsai)](https://twitter.com/orange_8361) [tweeted that they had reported a pre-](https://twitter.com/orange_8361/status/1346401788811825153?s=20)\nauthenticated remote code execution (RCE) chain to a vendor. Microsoft credited this user in\nthe slew of CVEs released to address the vulnerabilities. These two dates give us a frame of\nreference for analysis, as they mark the time from when Microsoft was notified to the first\npublic disclosure of the attacks observed in the wild.\n\nLooking at the keys used overall in the China Chopper webshells, the list below provides a\ncount of each unique value. Of note is a C# variant of this webshell that does not have a\nsimilar key, two variants that do not include a webshell at all but include a possible key and\none that is a Base64 encoded string of non-ASCII bytes.\n\n\n-----\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n\n\n29 NO9BxmCXw0JE\n\n11 Ananas\n\n8 klk123456\n\n7 orange\n\n6 No Key - f34fji34r209ur29ur92ru\n\n4 p\n\n4 gttkomomo\n\n2 No Key - dsfg\n\n1 rxDg52fHL9GW\n\n1 q3v98mBat1zj\n\n1 passnew\n\n1 o\n\n1 fpm_admin\n\n1 Q4IDLjknOZJr\n\n1 FhsrvqjnYASe\n\n1 EiH4yV2WGYgc\n\n1 No Key - C#\n\n1 3d55db3b2f88ae47b24ae7796f0cd916\n\n\nAs noted, two “keys” did not contain a webshell at all, “ f34fji34r209ur29ur92ru ” and “ dsfg ”.\nInstead, we observed an injection of a value, which appears similar in nature to a key, but is\nmissing the actual webshell code required to carry out further code execution. An example\ncan be seen below and compared to the webshell above.\n\nWhen looking at some of the temporal data points, specifically the DateModified time of the\nOAB files, you will see that the usage of these “keys” predates all the other key usage by\nalmost a full day. Since there is no webshell, these may have been test runs. In fact, they\nshow overlap with other keys that later compromise the same server with full webshells.\n\n\n-----\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n2/27/2021 13:45:30 f34fji34r209ur29ur92ru NS1[...]net\n\n2/27/2021 16:20:49 f34fji34r209ur29ur92ru DC1[...]LOC\n\n2/27/2021 19:11:07 f34fji34r209ur29ur92ru FIT[...]cal\n\n2/28/2021 0:04:23 f34fji34r209ur29ur92ru V-T[...]com\n\n2/28/2021 1:41:07 f34fji34r209ur29ur92ru DC-[...]net\n\n2/28/2021 3:51:56 f34fji34r209ur29ur92ru MBD[...]org\n\n2/28/2021 10:15:00 NO9BxmCXw0JE DC[...]net\n\n2/28/2021 10:33:14 NO9BxmCXw0JE FIT[...]cal\n\n2/28/2021 10:36:44 orange JTA[...]cal\n\nThe NO9* key from above is the most prevalent thus far, judging by what’s currently available\non VT. It has also been displayed in most of the research that has come out on this topic.\nThis key shares a pattern with five other keys in the list. These are considered related due to\ntheir timing and unique usage of an exactly 12-character randomized alphanumeric string\nwith mixed capitalization.\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n\n\nNO9BxmCXw0JE\n\nrxDg52fHL9GW\n\nq3v98mBat1zj\n\nQ4IDLjknOZJr\n\nFhsrvqjnYASe\n\nEiH4yV2WGYgc\n\n\nWithin this grouping, only the NO9* and EiH* keys were observed in the OAB files with dates\nprior to the March 2 Volexity blog. It is also interesting to observe the clustering of dates and\ntimes when these unique OAB files documented their modification times, as highlighted in\nthe table below.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n2/28/2021 10:15:00 NO9BxmCXw0JE DC-[...]net\n\n2/28/2021 10:33:14 NO9BxmCXw0JE FIT[...]cal\n\n\n-----\n\n2/28/2021 10:44:24 NO9BxmCXw0JE NS1[...]net\n\n2/28/2021 11:01:52 NO9BxmCXw0JE DC2[...]LOC\n\n2/28/2021 11:03:12 EiH4yV2WGYgc DFC[...]com\n\n2/28/2021 12:44:40 NO9BxmCXw0JE WP-[...]cal\n\n2/28/2021 16:46:21 NO9BxmCXw0JE tcs[...]cal\n\n3/1/2021 6:29:17 NO9BxmCXw0JE mar[...]cal\n\n3/1/2021 7:40:44 NO9BxmCXw0JE cow[...]cal\n\n3/1/2021 12:01:14 NO9BxmCXw0JE MM1[...]pvt\n\n3/1/2021 12:16:38 NO9BxmCXw0JE NCR[...]cal\n\n3/1/2021 13:46:04 NO9BxmCXw0JE a-p[...]com\n\n3/1/2021 3:39:49 PM NO9BxmCXw0JE grr[...]cal\n\n3/1/2021 16:25:57 NO9BxmCXw0JE DC2[...]LOC\n\n3/1/2021 16:42:10 NO9BxmCXw0JE VCC[...]org\n\n3/1/2021 19:28:28 NO9BxmCXw0JE NS1[...]net\n\n3/1/2021 21:32:42 NO9BxmCXw0JE DC0[...]cal\n\n3/1/2021 21:53:34 NO9BxmCXw0JE thi[...]cal\n\nOn Feb. 28, 2021, and March 1, 2021, there are two distinct clusters of events – before\npublic news about the vulnerabilities is released. Looking at the UTC timing of the events\nshows some compromises happening just minutes apart using both the NO9* and EiH* keys,\nfurther corroborating their relation to each other. The timing is also noteworthy because it\nshows very rapid deployment of these webshells throughout the day and night, indicating an\nautomated approach to targeting. As more samples appear, a better picture of the timeline\nwill emerge.\n\nContinuing to dig down into the data points for the six keys, we can extrapolate the targets\nbased on their OriginatingServer values and deduce a wide range of businesses from\ninvestment banking, small car dealerships, water conservatories, industrial automation, law\nfirms, hospitality and so on. The apparent randomness of targeted industries supports the\nidea that this is automated scanning that took advantage of opportunistic targets versus a\ncoordinated effort to target specific industries or businesses.\n\n\n-----\n\nOne last piece of evidence in support of the idea of automated scanning: There are multiple\nOAB files with the same configurations but different modification times, thus creating unique\nhashes. Looking at two servers from the OriginatingServer data points, it can be noted below\nhow they are compromised again at a later date with the exact same webshell and key,\nimplying that systems the attackers have compromised already are not checked during their\nscanning and exploitation process.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n3/1/2021 21:32:42 NO9BxmCXw0JE DC0[...]cal\n\n3/2/2021 16:57:12 NO9BxmCXw0JE DC0[...]cal\n\n2/28/2021 11:01:52 NO9BxmCXw0JE DC2[...]LOC\n\n3/1/2021 16:25:57 NO9BxmCXw0JE DC2[...]LOC\n\nPivoting to the keys, which did not match the previously discussed pattern, we can see they\nstart compromising the same servers as the other group of keys – but only after all of the\nresearch, CVEs, and proofs-of-concept (PoCs) started to pop up, leading us to believe these\nare different clusters of actors behind the attacks.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n3/1/2021 6:29:17 NO9BxmCXw0JE mar[...]cal\n\n3/2/2021 7:03:15 NO9BxmCXw0JE mar[...]cal\n\n3/3/2021 15:19:46 Ananas mar[...]cal\n\n2/28/2021 10:44:24 NO9BxmCXw0JE NS1[...]net\n\n3/1/2021 19:28:28 NO9BxmCXw0JE NS1[...]net\n\n3/3/2021 6:46:16 Q4IDLjknOZJr NS1[...]net\n\n3/3/2021 6:52:08 klk123456 NS1[...]net\n\nBefore moving on to the next section, let’s turn our attention to three curious keys that were\nobserved prior to the Volexity publication that do not match the pattern observed for the\nNO9* key but have very similar timing. This, along with other data points, seems to indicate\nthese were used as testing or non-automated manual attacks.\n\nThe first is the key “orange”. The first compromise observed with it in these publicly available\nOAB files is minutes before and after two surrounding compromises by the NO9* key on Feb.\n28. This key also falls into the cluster of events on March 1, two hours before the previously\ndiscussed attacks.\n\n\n-----\n\n28FEB2021\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n2/28/2021 10:33:14 NO9BxmCXw0JE FIT[...]cal\n\n2/28/2021 10:36:44 orange JTA[...]cal\n\n2/28/2021 10:44:24 NO9BxmCXw0JE NS1[...]net\n\n01MAR2021\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n3/1/2021 4:25:25 orange Exc[...]CAL\n\n3/1/2021 6:29:17 NO9BxmCXw0JE mar[...]cal\n\n3/1/2021 7:40:44 NO9BxmCXw0JE cow[...]cal\n\nThe second and third keys are simply “o” and “p”. Besides standing out due to their\nshortness, they also use a different structure in their webshell and appear to have targeted a\nmedical facility and something related to the Vietnamese government, both prior to any\npublication about the vulnerabilities.\n\nThe [Microsoft blog on HAFNIUM displays a webshell dropped by HAFNIUM that also uses a](https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/)\nparameter value of “p”, although it is a different structure. A screenshot of the webshell\ndisplayed there is transcribed below, along with an example of the one observed in an OAB\nfile.\n\nNotable similarities exist in the Request.Form parameter value, “p”, and the usage of a\nsingle-letter character for the other values; however, this in and of itself does not necessarily\nconfirm a HAFNIUM connection.\n\nLooking at the “o” and “p” keys found in the OAB files, they can be seen targeting the same\nsystems days apart.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n2/28/2021 11:57:01 o ad2[...].vn\n\n3/3/2021 7:58:20 p ad2[...].vn\n\n\n-----\n\nFurthermore, we can observe compromises by the cluster of six patterned keys and o key\nhappening fairly close in time to one another, alluding to a possible connection between\nthem.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n2/28/2021 11:03:12 AM EiH4yV2WGYgc DFC[...]com\n\n2/28/2021 11:57:01 AM o ad2[...].vn\n\n2/28/2021 12:44:40 PM NO9BxmCXw0JE WP-[...]cal\n\nTwo more keys stand out in terms of volume. Like the other keys that have been discussed,\nboth “klk123456” and “Ananas” were observed in overlapping compromises, indicating\nautomated scanning or using some type of list that has already been correlated from a\nscanning service.\n\n**DateModified** **WebShellKey** **OriginatingServer**\n\n3/3/2021 4:34:20 klk123456 Bed[...]com\n\n3/3/2021 6:52:08 klk123456 NS1[...]net\n\n3/3/2021 6:55:34 klk123456 Fil[...]cal\n\n3/3/2021 7:26:29 klk123456 mna[...]com\n\n3/3/2021 7:35:48 Ananas ric[...]org\n\n3/3/2021 7:45:40 Ananas ADA[...]cal\n\n3/3/2021 7:47:15 klk123456 PSL[...]cal\n\n3/3/2021 10:43:51 klk123456 CHG[...]SYS\n\n3/3/2021 11:02:09 klk123456 TRD[...]com\n\n3/3/2021 14:35:40 Ananas jus[...].nl\n\n3/3/2021 14:50:18 Ananas asi[...]com\n\n3/3/2021 14:51:13 Ananas Bed[...]com\n\n3/3/2021 15:19:46 Ananas mar[...]cal\n\n3/3/2021 16:16:21 Ananas V-T[...]com\n\n3/3/2021 16:40:03 Ananas FHM[...]org\n\n\n-----\n\nThese clusters of events are likely related to threat actors who were able to weaponize the\npublic information extremely quickly and get a head start on attacking Exchange Servers\nbefore other actors could.\n\nAll the compromises with the other keys appear unrelated and occur after the patches,\nresearch and PoC code had become easily accessible.\n\n## Variations in the China Chopper Webshell\n\nRecall the most prevalent China Chopper shell as observed in the OAB file.\n\nA Twitter user, [@mickeyftnt, notified me that they found a variant using a different pattern](https://twitter.com/mickeyftnt)\nfrom the “http://f/” that I had been watching stream into VT. This variant used “http://g/” and\n[contained a space after the eval method call. Microsoft states the ExternalUrl parameter](https://docs.microsoft.com/en-us/powershell/module/exchange/set-oabvirtualdirectory?view=exchange-ps)\n“specifies the URL that’s used to connect to the virtual directory from outside the firewall,” so\nwe can assume that, in a legitimate file, this is a resolvable domain but may require the “http”\nprecursor to be accepted as a value for the injection to work. While this piece of the URL is\nmoot and does not affect the operation, the use of “http://f/” is observed across the board in\nalmost every one of the attacks. As such, the “http://g/” variable piqued my interest as\nanother likely artifact worth taking note of, even though no additional patterns have been\nnoticed outside what’s been discussed here already.\n\nAnother Twitter user, [@krausedw, brought some samples to my attention that included](https://twitter.com/krausedw)\nbreaking up the “unsafe” word in an attempt to bypass certain security measures and a C#\nsample that calls out the script language explicitly.\n\n**JScript unsafe**\n\n**C#**\n\nFinally, there are variants that use Base64 strings as the key.\n\n**Base64**\n\n\n-----\n\n## Conclusion\n\nBy leveraging the artifacts found within the OAB configurations, we are able to piece together\na narrative around the activity based on analysis from just a small set of samples. It seems\nclear that there are numerous clusters of groups leveraging these vulnerabilities, the groups\nare using mass scanning or services that allow them to independently target the same\nsystems, and finally there are multiple variations of the code being dropped, which may be\nindicative of iterations to the attack. As more information and files become available, this\nanalysis may have to be revisited, but for now, there are a sufficient number of connections\nthat allow us to understand the how, the when and the frequency of attacks, along with\nclustering of events.\n\n## Additional Resources\n\n**Get updates from**\n\n**Palo Alto**\n\n**Networks!**\n\nSign up to receive the latest news, cyber threat intelligence and research from us\n\n[By submitting this form, you agree to our Terms of Use and acknowledge our Privacy](https://www.paloaltonetworks.com/legal-notices/terms-of-use)\nStatement.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-03-08 - Analyzing Attacks Against Microsoft Exchange Server With China Chopper Webshells.pdf"
    ],
    "report_names": [
        "2021-03-08 - Analyzing Attacks Against Microsoft Exchange Server With China Chopper Webshells.pdf"
    ],
    "threat_actors": [
        {
            "id": "529c1ae9-4579-4245-86a6-20f4563a695d",
            "created_at": "2022-10-25T16:07:23.702006Z",
            "updated_at": "2025-03-27T02:02:09.93109Z",
            "deleted_at": null,
            "main_name": "Hafnium",
            "aliases": [
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "ETDA:Hafnium",
            "tools": [],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "7c969685-459b-4c93-a788-74108eab6f47",
            "created_at": "2023-01-06T13:46:39.189751Z",
            "updated_at": "2025-03-27T02:00:03.017103Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "ATK233",
                "G0125",
                "Operation Exchange Marauder",
                "Red Dev 13",
                "Silk Typhoon"
            ],
            "source_name": "MISPGALAXY:HAFNIUM",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2704d770-43b4-4bc4-8a5a-05df87416848",
            "created_at": "2022-10-25T15:50:23.306305Z",
            "updated_at": "2025-03-27T02:00:55.43633Z",
            "deleted_at": null,
            "main_name": "HAFNIUM",
            "aliases": [
                "HAFNIUM",
                "Operation Exchange Marauder",
                "Silk Typhoon"
            ],
            "source_name": "MITRE:HAFNIUM",
            "tools": [
                "Tarrask",
                "ASPXSpy",
                "Impacket",
                "PsExec",
                "China Chopper"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536206,
    "ts_updated_at": 1743041523,
    "ts_creation_date": 1653787732,
    "ts_modification_date": 1653787732,
    "files": {
        "pdf": "https://archive.orkl.eu/f47907cb014c571d29190bd315f73ff4a15152a0.pdf",
        "text": "https://archive.orkl.eu/f47907cb014c571d29190bd315f73ff4a15152a0.txt",
        "img": "https://archive.orkl.eu/f47907cb014c571d29190bd315f73ff4a15152a0.jpg"
    }
}