{
    "id": "b213e5b9-ffdb-4d7c-8bdb-c0fda392ade9",
    "created_at": "2023-01-12T15:02:08.492928Z",
    "updated_at": "2025-03-27T02:16:26.000909Z",
    "deleted_at": null,
    "sha1_hash": "2213bf1cf4747bdeb4f5326a28a8e1fd613e9f7b",
    "title": "2019-03-11 - Study of the Belonard Trojan, exploiting zero-day vulnerabilities in Counter-Strike 1.6",
    "authors": "",
    "file_creation_date": "2022-05-29T01:25:22Z",
    "file_modification_date": "2022-05-29T01:25:22Z",
    "file_size": 416089,
    "plain_text": "# Study of the Belonard Trojan, exploiting zero-day vulnerabilities in Counter-Strike 1.6\n\n**news.drweb.com/show/**\n\nDoctor Web\n\n[Back to news](https://news.drweb.com/list/?p=0&lng=en&c=23)\n\n[Download PDF](https://st.drweb.com/static/new-www/news/2019/march/belonard_trojan_en.pdf)\n\n**March 11, 2019**\n\n### Introduction\n\nThe game Counter-Strike 1.6 was released by Valve Corporation back in 2000. Despite its rather\nconsiderable age, it still has a large fan base. The number of players using official CS 1.6 clients\nreaches an average of 20,000 people online, while the overall number of game servers registered\non Steam exceeds 5,000. Selling, renting, and promoting game servers is now deemed an actual\nbusiness, and these services can be purchased on various websites. For example, raising a\nserver’s rank for a week costs about 200 rubles, which is not much, but a large number of buyers\nmake this strategy a rather successful business model.\n\n\n-----\n\nMany owners of popular game servers also raise money from players by selling various privileges\nsuch as protection against bans, access to weapons, etc. Some server owners advertise\nthemselves independently, while others purchase server promotion services from contractors.\nHaving paid for a service, customers often remain oblivious as to how exactly their servers are\nadvertised. As it turned out, the developer nicknamed, “Belonard”, resorted to illegal means of\npromotion. His server infected the devices of players with a Trojan and used their accounts to\npromote other game servers.\n\nThe owner of the malicious server uses the vulnerabilities of the game client and a newly written\nTrojan as a technical foundation for their business. The Trojan is to infect players’ devices and\ndownload malware to secure the Trojan in the system and distribute it to devices of other players.\nFor that, they exploit Remote Code Execution (RCE) vulnerabilities, two of which have been\nfound in the official game client and four in the pirated one.\n\nOnce set up in the system, Trojan.Belonard replaces the list of available game servers in the\ngame client and creates proxies on the infected computer to spread the Trojan. As a rule, proxy\nservers show a lower ping, so other players will see them at the top of the list. By selecting one of\nthem, a player gets redirected to a malicious server where their computer become infected with\nTrojan.Belonard.\n\nUsing this pattern, the developer of the Trojan managed to create a botnet that makes up a\nconsiderable part of the CS 1.6 game servers. According to our analysts, out of some 5,000\nservers available from the official Steam client, 1,951 were created by the Belonard Trojan. This\nis 39% of all game servers. A network of this scale allowed the Trojan’s developer to promote\nother servers for money, adding them to lists of available servers in infected game clients.\n\n[We previously reported a similar incident with CS 1.6, where a Trojan could infect a player’s](https://news.drweb.ru/show/?i=1816&c=5&lng=ru&p=0)\ndevice via a malicious server. However, a user then had to approve the download of malicious\nfiles, while this time, a Trojan attacks devices unnoticed by the users. Doctor Web have informed\nValve about these and other vulnerabilities of the game, but as of now, there is no data on when\nthe vulnerabilities will be fixed.\n\n### Infection of a client\n\nTrojan.Belonard consists of 11 components and operates under different scenarios, depending on\nthe game client. If the official client is used, the Trojan infects the device using an RCE\nvulnerability, exploited by the malicious server, and then establishes in the system. A clean\npirated client is infected the same way. If a user downloads an infected client from the website of\nthe owner of the malicious server, the Trojan’s persistence in the system is ensured after the first\nlaunch of the game.\n\n\n-----\n\nLet us touch upon the process of infecting a client in more detail. A player launches the official\nSteam client and selects a game server. Upon connecting to a malicious server, it exploits an\nRCE vulnerability, uploading one of the malicious libraries to a victim’s device. Depending on the\ntype of vulnerability, one of two libraries will be downloaded and executed: client.dll\n(Trojan.Belonard.1) or Mssv24.asi (Trojan.Belonard.5).\n\nOnce on the victim’s device, Trojan.Belonard.1 deletes any .dat files that are in the same\ndirectory with the library process file. After that, the malicious library connects to the command\nand control server, fuztxhus.valve-ms[.]ru:28445, and sends it an encrypted request to download\nthe file Mp3enc.asi (Trojan.Belonard.2). The server then sends the encrypted file in response.\n\nThis is a screenshot of a decrypted data packet from the server:\n\n\n-----\n\n### Installation into the client\n\nInfection of the official or pirated client is performed using the specific feature of the CounterStrike client. When launched, the game automatically downloads any ASI files from the game\nroot.\n\nThe client downloaded from the website of the Trojan’s developer is already infected with\nTrojan.Belonard.10 (the file name is Mssv36.asi), but the trojan installs in the system differently\nthan in clean versions of game clients. After installation of an infected client, Trojan.Belonard.10\nchecks for one of its components in the user's OS. If there is none, it drops the component from\nits body and downloads Trojan.Belonard.5 (the file name is Mssv24.asi) into its process memory.\nLike many other modules, Trojan.Belonard.10 changes the date and time of creation,\nmodification, or access to the file, so that the Trojan’s files cannot be found by sorting the\ncontents of the folder by creation date.\n\nAfter installing a new component, Trojan.Belonard.10 remains in the system and acts as a\nprotector of the client. It filters requests, files, and commands received from other game servers\nand transfers data about attempted changes to the client to the Trojan developer’s server.\n\nTrojan.Belonard.5 receives information about the running process and the paths to the module in\nDllMain. If the process name is not rundll32.exe, it starts a separate threads for subsequent\nactions. In the running thread, Trojan.Belonard.5 creates the key\n\n[HKCU\\\\SOFTWARE\\\\Microsoft\\\\Windows NT\\\\CurrentVersion\\\\AppCompatFlags\\\\Layers] '<path\nto the executable file process>', assigns it the value “RUNASADMIN”, and checks the module\nname. If it is not “Mssv24.asi”, it copies itself in the “Mssv24.asi” module, deletes the version with\na different name, and launches Trojan.Belonard.3 (the file name is Mssv16.asi). If the name\nmatches, it immediately downloads and launches the Trojan.\n\nEmbedment in a clean client is performed by Trojan.Belonard.2. After download, it checks in\nDllMain the name of the process in which client.dll(Trojan.Belonard.1) is loaded. If it is not\nrundll32.exe, it creates a thread with the key [HKCU\\\\SOFTWARE\\\\Microsoft\\\\Windows\nNT\\\\CurrentVersion\\\\AppCompatFlags\\\\Layers] '<path to the executable file process>’, and\nassigns it the value “RUNASADMIN”. After that, it collects data about the user’s device and\nextracts information from the DialogGamePage.res file. Then it sends the collected data to the\nserver of the Trojan developer in an encrypted format.\n\n\n-----\n\nCollected system data structure:\n\nIn response, the server sends the Mssv16.asi file,(Trojan.Belonard.3). Meta-information about the\nnew module is saved in the file DialogGamePage.res, while Trojan.Belonard.5 is removed from\nthe user’s device.\n\n### Installation in the system\n\nThe process of ensuring persistence in the system starts with Trojan.Belonard.3. Once on the\ndevice, it removes Trojan.Belonard.5 and checks the process, in the context of which it runs. If it\nis not rundll32.exe, it saves two other Trojans to %WINDIR%\\System32\\: Trojan.Belonard.7 (the\nfile name is WinDHCP.dll) and Trojan.Belonard.6 (davapi.dll). At the same time, unlike\nTrojan.Belonard.5, the seventh and sixth ones are stored within the Trojan in a disassembled\nform. The bodies of these two Trojans are divided into blocks of 0xFFFC bytes (the last block may\nbe smaller). When saved to disk, the Trojan assembles the blocks together to obtain working files.\n\n\n-----\n\nHaving assembled the Trojans, Trojan.Belonard.3 creates a WinDHCP service to run\nWinDHCP.dll (Trojan.Belonard.7) in the context of svchost.exe. Depending on language settings,\nthe OS uses texts in Russian or English to set service parameters.\n\nWinDHCP service parameters:\n\nService name: “Windows DHCP Service” or “Служба Windows DHCP”;\nDescription: “Windows Dynamic Host Configuration Protocol Service” or “Служба\nпротокола динамической настройки узла Windows”;\nThe ImagePath parameter is specified as “%SystemRoot%\\System32\\svchost.exe -k\nnetsvcs”, while ServiceDll specifies the path to the Trojan library.\n\nAfter that, Trojan.Belonard.3 regularly checks if the WinDHCP service is running. If it is not\nrunning, it reinstalls the service.\n\nTrojan.Belonard.7 is WinDHCP.dll with a ServiceMain exported function, installed on the infected\ndevice by an autorun service. Its purpose is to check the “Tag” parameter in the registry of the key\n“HKLM\\\\SYSTEM\\\\CurrentControlSet\\\\Services\\\\WinDHCP”. If it is set to 0, Trojan.Belonard.7\nloads the davapi.dll library (Trojan.Belonard.6) and calls its exported function, passing a pointer to\na SERVICE_STATUS as an argument, which reflects the status of the WinDHCP service. Then it\nwaits for 1 second and checks the “Tag” parameter once more. If the value does not match 0,\nTrojan.Belonard.7 loads the spwinres.dll library (Trojan.Belonard.4), which is an older version of\nTrojan.Belonard.6. After that, it calls spwinres.dll’s exported function, passing a pointer to a\nSERVICE_STATUS as an argument, which reflects the status of the WinDHCP service.\n\nThe Trojan repeats these actions every second.\n\nWinDHCP service parameters from our customer’s report:\n```\n<RegistryKey Name=\"WinDHCP\" Subkeys=\"1\" Values=\"11\">\n<RegistryKey Name=\"Parameters\" Subkeys=\"0\" Values=\"1\">\n<RegistryValue Name=\"ServiceDll\" Type=\"REG_EXPAND_SZ\" SizeInBytes=\"68\"\nValue=\"%SystemRoot%\\system32\\WinDHCP.dll\" />\n</RegistryKey>\n<RegistryValue Name=\"Type\" Type=\"REG_DWORD\" Value=\"32\" />\n<RegistryValue Name=\"Start\" Type=\"REG_DWORD\" Value=\"2\" />\n<RegistryValue Name=\"ErrorControl\" Type=\"REG_DWORD\" Value=\"0\" />\n<RegistryValue Name=\"ImagePath\" Type=\"REG_EXPAND_SZ\" SizeInBytes=\"90\"\nValue=\"%SystemRoot%\\System32\\svchost.exe -k netsvcs\" />\n<RegistryValue Name=\"DisplayName\" Type=\"REG_SZ\" Value=\"Служба Windows DHCP\" />\n<RegistryValue Name=\"ObjectName\" Type=\"REG_SZ\" Value=\"LocalSystem\" />\n<RegistryValue Name=\"Description\" Type=\"REG_SZ\" Value=\"Служба протокола\nдинамической настройки узла Windows\" />\n<RegistryValue Name=\"Tag\" Type=\"REG_DWORD\" Value=\"0\" />\n<RegistryValue Name=\"Data\" Type=\"REG_BINARY\" SizeInBytes=\"32\"\nValue=\"f0dd5c3aeda155767042fa9f58ade24681af5fbd45d5df9f55a759bd65bc0b7e\" />\n<RegistryValue Name=\"Scheme\" Type=\"REG_BINARY\" SizeInBytes=\"16\"\nValue=\"dcef62f71f8564291226d1628278239e\" />\n\n```\n\n-----\n\n```\n<RegistryValue Name= Info Type= REG_BINARY SizeInBytes= 32\nValue=\"55926164986c6020c60ad81b887c616db85f191fda743d470f392bb45975dfeb\" />\n</RegistryKey>\n\n```\nBefore the startup of all functions, Trojan.Belonard.6 checks the “Tag” and “Data” parameters in\nthe WinDHCP service registry. The “Data” parameter must contain an array of bytes used to\ngenerate the AES key. If there is none, the Trojan uses the openssl library to generate 32 random\nbytes, which will later be used to generate the encryption key. After that, the Trojan reads the\n“Info” and “Scheme” parameters of the WinDHCP service. In “Scheme”, the Trojan stores 4\nparameters, encrypted with AES. “Info” stores the SHA256 hash of the list of installed programs.\n\nHaving collected this data, Trojan.Belonard.6 decrypts the address of the C&C server —\noihcyenw.valve-ms[.]ru — and tries to establish a connection. If it fails, the Trojan uses DGA to\ngenerate domains in the .ru zone. However, an error in the domain generation code prevents the\nalgorithm from creating the domains intended for the Trojan developer.\n\nAfter sending the encrypted information, the Trojan receives a response from the server, decrypts\nit and saves the transferred files to %WINDIR%\\System32\\. This data contains the Trojans\nwmcodecs.dll (Trojan.Belonard.8) and ssdp32.dll (Trojan.Belonard.9).\n\nApart from the above functions, Trojan.Belonard.6 also triggers the following actions at random\nintervals:\n\nSearch for running Counter-Strike clients;\nLaunch of Trojan.Belonard.9;\nConnecting to the developer’s server.\n\nPeriods can be changed at the command from the C&C server.\n\n### Payload and distribution\n\nBelonard also installs in new game clients found on the device. This is performed by\nTrojan.Belonard.8 and Trojan.Belonard.6.\n\nTrojan.Belonard.8 initializes a container with data about Counter-Strike 1.6 client file names and\ntheir SHA256 hashes. Trojan.Belonard.6 starts to search for installed game clients. If the Trojan\nfinds a running client, it checks the list of files and their SHA256 hashes against the data received\nfrom Trojan.Belonard.8. If it does not match, Trojan.Belonard.8 ends the clean client process, and\nthen drops the file hl.exe to the game directory. This file is only needed to display the following\nerror message upon loading the game “Could not load game. Please try again at a later time.”\nThis allows the Trojan to gain time for replacing the files of the client. When it is done, the Trojan\nreplaces hl.exe with a working file and the game starts without an error.\n\nThe Trojan deletes the following client files:\n```\n<path>\\\\valve\\\\dlls\\\\*\n<path>\\\\cstrike\\\\dlls\\\\*\n<path>\\\\valve\\\\cl_dlls\\\\*\n\n```\n\n-----\n\n```\n<path>\\\\cstrike\\\\cl_dlls\\\\\n<path>\\\\cstrike\\\\resource\\\\*.res\n<path>\\\\valve\\\\resource\\\\*.res\n<path>\\\\valve\\\\motd.txt\n<path>\\\\cstrike\\\\resource\\\\gameui_english.txt\n<path>\\\\cstrike\\\\resource\\\\icon_steam.tga\n<path>\\\\valve\\\\resource\\\\icon_steam.tga\n<path>\\\\cstrike\\\\resource\\\\icon_steam_disabled.tga\n<path>\\\\valve\\\\resource\\\\icon_steam_disabled.tga\n<path>\\\\cstrike\\\\sound\\\\weapons\\\\fiveseven_reload_clipin_sliderelease.dll\n<path>\\\\cstrike_russian\\\\sound\\\\weapons\\\\fiveseven_reload_clipin_sliderelease.dll\n<path>\\\\cstrike_romanian\\\\sound\\\\weapons\\\\fiveseven_reload_clipin_sliderelease.dll\n\n```\nDepending on the OS language settings, the Trojan downloads English or Russian game menu\nfiles.\n\nModifications to the game client contain files of Trojan.Belonard.10, as well as an advertisement\nof the Trojan developer’s websites. When a player starts the game, their nickname will change to\nthe address of the website where an infected game client can be downloaded, while the game\nmenu will show a link to the VKontakte CS 1.6 community with more than 11,500 subscribers.\n\nThe Trojan’s payload is to emulate a number of fake game servers on the user’s device. To do\nthis, the Trojan transfers information about the game client to the developer’s server and receives\nencrypted parameters for creating fake servers in response.\n\n\n-----\n\nTrojan.Belonard.9 creates proxy game servers and registers them with the Steam API. Game\nserver ports are defined sequentially from the lowest value of game_srv_low_port specified by the\nserver. The server also sets the value for fakesrvbatch, which determines the number of protocol\nemulator threads. The emulator supports basic requests to a Goldsource engine game server:\nA2S_INFO, A2S_PLAYER, A2A_PING, receiving the “challenge steam/non-steam client” request,\nas well as the “connect” command of the Counter-Strike client. After responding to the “connect”\ncommand, the Trojan tracks the first and the second packet from the client.\n\nAfter exchanging packets, the Trojan sends the last packet, svc_director, with a\nDRC_CMD_STUFFTEXT type of message, which enables the execution of arbitrary commands\n[of the Counter-Strike client. This issue has been known to Valve since 2014 and has not been](https://github.com/ValveSoftware/halflife/issues/1497)\nfixed yet. Thus, attempting to connect to the game proxy server, the player will be redirected to\nthe malicious server. After that, the Trojan developer will be able to exploit the vulnerabilities of\nthe user's game client to install Trojan.Belonard.\n\nIt is worth mentioning that Trojan.Belonard.9 contains a bug, which allows us to detect fake game\nservers, created by the Trojan. Moreover, some of those servers can be identified by the name: in\nthe “Game” column, the fake server will have a string “Counter-Strike n”, where n can be a\n\n\n-----\n\nnumber from 1 to 3.\n\n### Encryption\n\nBelonard uses encryption to store data in the Trojan and communicate with the server. It stores\nthe encrypted name of the C&C server, as well as some lines of code and library names. There is\none encryption algorithm with different constants for individual modules of the Trojan. The older\nversions of the Trojan used another algorithm to encrypt lines of code.\n\nDecryption algorithm in Trojan.Belonard.2:\n```\ndef decrypt(d):\n s = ''\n c = ord(d[0])\n for i in range(len(d)-1):\n  c = (ord(d[i+1]) + 0xe2*c - 0x2f*ord(d[i]) - 0x58) & 0xff\n s += chr(c)\n return s\n\n```\nDecryption algorithm from the older versions:\n```\ndef decrypt(data):\n s = 'f'\n for i in range(0,len(data)-1):\n  s += chr((ord(s[i]) + ord(data[i]))&0xff)\n print s\n\n```\nBelonard uses a more sophisticated encryption to exchange data with the command and control\nserver. Before sending the information to the server, the Trojan turns it into a different structure for\neach module. Collected data is encrypted by RSA using the public key stored within the malware.\nHowever, it must be mentioned that RSA is used for encryption of first 342 bytes of data only. If a\nmodule sends a packet of data larger than 342 bytes, only this much will be encrypted by RSA;\nthe rest of the data will be encrypted by AES. The data for AES key is stored in a part, encrypted\nby RSA key. The data for AES key is stored in a part, encrypted by RSA key, along with the data\nneeded for generating AES key, which is used by C&C server for encrypting its answers.\n\n\n-----\n\nThen, after a zero byte added at the beginning of the packet, the data is sent to the C&C server.\nTo which the server replies with an encrypted packet that contains information about the size of\nthe payload and its SHA256 hash in its header, which is needed to be verified against the AES\nkey.\n\nThe server may reply with\n\nDecryption is performed with AES in a CFB mode with a block size of 128 bits and the key sent\nearlier to the server. The first 36 bytes of data are decrypted first, including the last DWORD\nvalue that shows the actual payload with the header. The DWORD value adds to the AES key\nand is hashed using SHA256. The resulting hash must match the first 32 decrypted bytes. The\nrest of the received data is decrypted only after this.\n\n### Botnet shutdown\n\nDoctor Web’s analysts took all necessary measures in order to neutralize the Belonard trojan and\nstop botnet from growing. The delegation of the domain names used by the malware developer\nwas suspended with the help of REG.ru domain name registrar. Since redirection from a fake\ngame server to the malicious one happened via domain name, CS 1.6 players will no longer be in\ndanger of connecting to the malicious server and getting infected by the Belonard trojan. This\ninterrupted work of almost all the components of the malware.\n\nBeyond that, Dr.Web’s virus database was updated with entries to detect all the Belonard\ncomponents. The modules that switched to DGA are currently monitored. After all the necessary\nactions were taken, the sinkhole server registered 127 infected game clients. In addition to that,\nour telemetry showed that Dr.Web anti-virus detected modules of the Trojan.Belonard on 1004\ndevices of our clients.\n\nAt the present moment, Belonard botnet can be considered neutralized; but in order to ensure the\nsafety of Counter-Strike game clients, it is necessary to close current vulnerabilities.\n\n### Indicators of compromise\n\nSHA-1 hashes\n```\n8bbc0ebc85648bafdba19369dff39dfbd88bc297 - Backdoored Counter-Strike 1.6 client\n200f80df85b7c9b47809b83a4a2f2459cae0dd01 - Backdoored Counter-Strike 1.6 client\n8579e4efe29cb999aaedad9122e2c10a50154afb - Backdoored Counter-Strike 1.6 client\nce9f0450dafda6c48580970b7f4e8aea23a7512a - client.dll - Trojan.Belonard.1\n75ec1a47404193c1a6a0b1fb61a414b7a2269d08 - Mp3enc.asi - Trojan.Belonard.2\n4bdb31d4d410fbbc56bd8dd3308e20a05a5fce45 - Mp3enc.asi - Trojan.Belonard.2\na0ea9b06f4cb548b7b2ea88713bd4316c5e89f32 - Mssv36.asi - Trojan.Belonard.10\ne6f2f408c8d90cd9ed9446b65f4b74f945ead41b - FileSystem.asi - Trojan.Belonard.11\n15879cfa3e5e4463ef15df477ba1717015652497 - Mssv24.asi - Trojan.Belonard.5\n4b4da2c0a992d5f7884df6ea9cc0094976c1b4b3 - Mssv24.asi - Trojan.Belonard.5\n6813cca586ea1c26cd7e7310985b4b570b920803 - Mssv24.asi - Trojan.Belonard.5\n6b03e0dd379965ba76b1c3d2c0a97465329364f2 - Mssv16.asi - Trojan.Belonard.3\n2bf76c89467cb7c1b8c0a655609c038ae99368e9 - Mssv16.asi - Trojan.Belonard.3\n\n```\n\n-----\n\n```\nd37b21fe222237e57bc589542de420fbdaa45804 Mssv16.asi Trojan.Belonard.3\n72a311bcca1611cf8f5d4d9b4650bc8fead263f1 - Mssv16.asi - Trojan.Belonard.3\n73ba54f9272468fbec8b1d0920b3284a197b3915 - davapi.dll - Trojan.Belonard.6\nd6f2a7f09d406b4f239efb2d9334551f16b4de16 - davapi.dll - Trojan.Belonard.6\na77d43993ba690fda5c35ebe4ea2770e749de373 - spwinres.dll - Trojan.Belonard.4\n8165872f1dbbb04a2eedf7818e16d8e40c17ce5e - WinDHCP.dll - Trojan.Belonard.7\n027340983694446b0312abcac72585470bf362da - WinDHCP.dll - Trojan.Belonard.7\n93fe587a5a60a380d9a2d5f335d3e17a86c2c0d8 - wmcodecs.dll - Trojan.Belonard.8\n89dfc713cdfd4a8cd958f5f744ca7c6af219e4a4 - wmcodecs.dll - Trojan.Belonard.8\n2420d5ad17b21bedd55309b6d7ff9e30be1a2de1 - ssdp32.dll - Trojan.Belonard.9\n\n```\nFile names\n```\nclient.dll - Trojan.Belonard.1\nMp3enc.asi - Trojan.Belonard.2\nMssv16.asi - Trojan.Belonard.3\nspwinres.dll - Trojan.Belonard.4\nMssv24.asi - Trojan.Belonard.5\ndavapi.dll - Trojan.Belonard.6\nWinDHCP.dll - Trojan.Belonard.7\nwmcodecs.dll - Trojan.Belonard.8\nssdp32.dll - Trojan.Belonard.9\nMssv36.asi - Trojan.Belonard.10\nFileSystem.asi - Trojan.Belonard.11\n\n```\nDomain names\n```\ncsgoogle.ru\netmpyuuo.csgoogle.ru\njgutdnqn.csgoogle.ru\nhl.csgoogle.ru\nhalf-life.su\nplay.half-life.su\nvalve-ms.ru\nbmeadaut.valve-ms.ru\nfuztxhus.valve-ms.ru\nixtzhunk.valve-ms.ru\noihcyenw.valve-ms.ru\nsuysfvtm.valve-ms.ru\nwcnclfbi.valve-ms.ru\nreborn.valve-ms.ru\n\n```\nIP addresses\n```\n37.143.12.3\n46.254.17.165\n\n```\n[What is the benefit of having an account?](https://www.drweb.com/user/advantages/?lng=en)\n\n## Tell us what you think\n\n\n-----\n\nTo ask Doctor Web’s site administration about a news item, enter @admin at the beginning of\nyour comment. If your question is for the author of one of the comments, put @ before their\nnames.\n\n### Other comments\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-03-11 - Study of the Belonard Trojan, exploiting zero-day vulnerabilities in Counter-Strike 1.6.pdf"
    ],
    "report_names": [
        "2019-03-11 - Study of the Belonard Trojan, exploiting zero-day vulnerabilities in Counter-Strike 1.6.pdf"
    ],
    "threat_actors": [
        {
            "id": "741d58a1-0fc0-41a8-9681-106a06c07e61",
            "created_at": "2022-10-25T16:07:23.983046Z",
            "updated_at": "2025-03-27T02:02:10.062384Z",
            "deleted_at": null,
            "main_name": "Operation Poisoned News",
            "aliases": [
                "Operation Poisoned News",
                "TwoSail Junk"
            ],
            "source_name": "ETDA:Operation Poisoned News",
            "tools": [
                "dmsSpy",
                "lightSpy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535728,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653787522,
    "ts_modification_date": 1653787522,
    "files": {
        "pdf": "https://archive.orkl.eu/2213bf1cf4747bdeb4f5326a28a8e1fd613e9f7b.pdf",
        "text": "https://archive.orkl.eu/2213bf1cf4747bdeb4f5326a28a8e1fd613e9f7b.txt",
        "img": "https://archive.orkl.eu/2213bf1cf4747bdeb4f5326a28a8e1fd613e9f7b.jpg"
    }
}