{
    "id": "b259ad16-72b4-4d80-bcdf-77df0f4c51fc",
    "created_at": "2023-01-12T15:04:03.427083Z",
    "updated_at": "2025-03-27T02:09:17.977414Z",
    "deleted_at": null,
    "sha1_hash": "a1efacde915e7ef5adf3e5f0b691467f150eb91e",
    "title": "2021-02-15 - Ransomware Profile- Egregor",
    "authors": "",
    "file_creation_date": "2022-05-28T04:53:07Z",
    "file_modification_date": "2022-05-28T04:53:07Z",
    "file_size": 197236,
    "plain_text": "# Ransomware Profile: Egregor\n\n**[blog.emsisoft.com/en/37810/ransomware-profile-egregor/](https://blog.emsisoft.com/en/37810/ransomware-profile-egregor/)**\n\nEmsisoft Malware Lab February 15, 2021\n\nEgregor is an aggressive strain of ransomware that targets large organizations. It has been\nextremely active since its discovery in September 2020, claiming hundreds of victims across\nmultiple industries.\n\n[Egregor submissions courtesy of ID Ransomware.](http://id-ransomware.malwarehunterteam.com/)\n\n\n-----\n\nThe above chart shows the number of Egregor samples submitted to ID Ransomware, an\nonline tool that allows users to identify which ransomware strain has encrypted their files and\nprovides a free decryptor should one be available.\n\nThe submission data shows that Egregor claimed a large number of victims in a very short\nspace of time and possibly amassed victims quicker than any other group. This surge of\nattacks was likely the result of former Maze affiliates bringing lists of already-compromised\nnetworks to the Egregor affiliate program.\n\nWithin a month, however, a significant drop in the rate of the attacks occurred. This decrease\nwas likely due to the affiliates who crossed over from Maze quickly exhausting their lists of\nalready-comprised networks and effectively running out of easy prospective targets.\n\n## What is Egregor?\n\nEgregor is a sophisticated strain of ransomware that encrypts files using ChaCha and RSA\nencryption and uses advanced obfuscation techniques to thwart analysis efforts. “Egregor” is\nderived from the ancient Greek term for “wakeful,” an occult concept referring to the\ncollective energy of a group of people working toward a common goal – an appropriate name\nfor a ransomware group.\n\nLike many other modern ransomware groups, Egregor’s operators exfiltrate data from victims\nand store it on their servers before the data is encrypted on the target’s machine. Egregor\ndemands a swift response, giving victims just 72 hours to make contact with attackers.\n\nIn the event of non-payment, the stolen data is published on the attacker’s website, Egregor\nNews, which can be accessed on both the clear web and dark web. One of the last known\nbanner messages on the Egregor News website was the Christmas greeting: “Egregor Team\nwishes all clients happy holidays. Christmas gifts are waiting for you. Details in your personal\nchat!”\n\nEgregor operates under the ransomware-as-a-service model, whereby affiliates receive a\nportion of ransom payments in exchange for dropping the malware onto victims’ networks.\nEgregor affiliates earn 70 percent of the ransom payments they generate, with the remaining\n30 percent going to the Egregor group. It is believed that the Egregor affiliate program\nattracted many ex-Maze affiliates following the sudden retirement of the Maze ransomware\ngang in November 2020.\n\n## The Egregor-Sekhmet-Maze connection\n\nEgregor, Sekhmet and Maze share almost exactly the same base code. Sekhmet, a now\ninactive strain of ransomware that was first detected in March 2020, is identical to Maze\napart from one small tweak to the way it uses file markers. Egregor, in turn, is identical to\nSekhmet, except for having a different file marker value and ransom note text.\n\n\n-----\n\nWhile it s not clear if the creators of Sekhmet and/or Maze are responsible for Egregor, the\nthree variants clearly share significant similarities. The Sekhmet leak platform – which\nexposed just six victims in total – went offline at around the same as the launch of the\nEgregor News site.\n\n## The History of Egregor\n\nEgregor was first observed in September 2020. It was an extremely active threat from the\noutset, claiming more than 130 victims in the first 10 weeks, including high-value targets in\nthe industrial goods, retail and transportation sectors.\n\n### Suspected Egregor operators arrested\n\nIn February 2021, alleged Egregor operators were arrested in Ukraine following a joint\ninvestigation by French and Ukrainian police, which was coordinated by Europol.\nInvestigators were able to track down the unnamed suspects by following the flow of\nbitcoins being handled by the alleged operators. According to France Inter, the arrested\nsuspects provided hacking, logistical and financial support for the Egregor group. On\nFebruary 17, 2021, the Ukrainian Security Service confirmed an undisclosed number of\narrests in connection with the Egregor operation.\n\nThe group’s extortion site went offline around the time of the arrests, making it impossible for\nvictims to pay a ransom or contact the ransomware group. It’s worth noting that the Egregor\nextortion site had been going offline intermittently for some time prior to the arrests, so it’s\npossible that the disruption is unrelated.\n\n## Egregor ransom note\n\nAfter encrypting the target system, Egregor drops a ransom note titled “RECOVERFILES.txt” in all infected directories. The ransom note is fairly vague and contains no specific\npayment instructions. Instead, it instructs victims to install the TOR browser, navigate to the\noperators’ website and open a live chat with the threat actors, who will then provide further\ninstructions. The note states that stolen data will be published if no contact is made within\nthree days.\n\nThe note claims that after receiving payment attackers will provide full decryption of all\naffected machines, a file listing of downloaded data, confirmation of the deletion of exfiltrated\ndata and complete confidentiality. Audaciously, the note also states that operators will\nprovide paying victims with recommendations for securing their networks to prevent future\nbreaches.\n\nEgregor is the only ransomware family known to print ransom notes via available printers on\ncompromised networks.\n\n\n-----\n\n## Who does Egregor target?\n\nEgregor targets large organizations. While the industrial goods and services sector was\ninitially most heavily hit, enterprises across a wide range of verticals have since been\nimpacted by Egregor.\n\nEgregor primarily targets U.S.-based organizations, although a number of companies in\nSouth America, Africa, Asia, Europe and Oceania have also been infected.\n\nBefore encrypting data on a compromised machine, Egregor checks the Default Language\nID of the system and user account. The ransomware does not execute if any of the following\nlanguages are detected: Uzbek, Romanian, Azerbaijani, Turkmen, Georgian, Kyrgyz,\nUkrainian, Kazakh, Tatar, Russian, Tajik, Armenian, Belarusian, Romanian.\n\n## How does Egregor spread?\n\nThe information currently available suggests that the infection chain typically starts with a\nphishing email, which contains a malicious macro embedded in an attached document.\n\nUpon execution, the macro downloads commodity malware such as Qakbot, IcedID and/or\nUrsnif, which are used to gain an initial toehold in the target environment. The operators of\nQakBot, a banking Trojan that is commonly used to drop malware onto infected networks,\nrecently switched from dropping ProLock, another prominent ransomware strain, to dropping\nEgregor.\n\nLater in the attack chain, operators use Cobalt Strike to gather information, escalate\nprivileges, move laterally across the network and prepare the system for encryption. To\nexfiltrate data, operators typically use Rclone, an open-source command line program used\nto manage cloud storage. There have also been instances of operators using Cobalt Strike to\ncreate an RDP connection with other endpoints on the network and copying Egregor to them.\n\nIt is important to note that because Egregor is a ransomware-as-a-service operated by\nmultiple affiliates, infection methods can vary. We have heard rumors of Egregor utilizing\nflaws in Microsoft Exchange, VBScript Engine and Adobe Flash Player, but these reports are\nstill unsubstantiated.\n\n## Major Egregor attacks\n\n### Ubisoft\n\nIn October 2020, Egregor captured the attention of the cybersecurity industry with a highprofile attack on video game developer Ubisoft. Threat actors initially released a few hundred\nmegabytes of data relating to in-game assets, before later releasing 560GB of source code\nfrom Ubisoft’s latest action-adventure game Watch Dogs: Legion.\n\n\n-----\n\n### Barnes & Noble\n\nIn October 2020, Barnes & Noble was hit with Egregor. The incident forced the U.S.\nbookstore giant to shut down their network to stop the attack from spreading, resulting in\nNook users being unable to access their eBook libraries. Threat actors claimed to have\nstolen financial and audit data during the attack, while email addresses, billing addresses,\nshipping addresses and purchase history were also exposed on the compromised systems.\n\n### TransLink\n\nIn December 2020, Metro Vancouver transport agency TransLink faced significant disruption\nafter falling victim to Egregor. The attack impacted phones, online services and payment\nsystems, leaving commuters unable to pay for fares with credit cards or debit cards. During\nthe incident, ransom notes were printed from TransLink printers as well as dropped digitally\nin infected directories.\n\n### Randstad\n\nIn December 2020, Randstad, one of the largest recruitment agencies in the world,\nannounced that their network had been breached by Egregor. Operators published a 32.7\nMB archive of exfiltrated data, which they claimed was just 1 percent of the total data stolen\nduring the attack. The leaked data contained a range of business documents, including\nfinancial reports, legal documents and accounting spreadsheets.\n\n## How to protect the network from Egregor and other ransomware\n\nThe following practices may help organizations reduce the risk of an Egregor incident.\n\n**Cybersecurity awareness training: Because the majority of ransomware spreads**\nthrough user-initiated actions, organizations should implement training initiatives that\nfocus on teaching end users the fundamentals of cybersecurity. Ransomware and\npropagation methods are constantly evolving, so training must be an ongoing process\nto ensure end users are across current threats.\n**Credential hygiene: Practicing** [good credential hygiene can help prevent brute force](https://blog.emsisoft.com/en/29524/how-to-create-manage-store-passwords/)\nattacks, mitigate the effects of credential theft and reduce the risk of unauthorized\nnetwork access.\n**Multi-factor authentication: MFA provides an extra layer of security that can help**\nprevent unauthorized access to accounts, tools, systems and data repositories.\nOrganizations should consider enabling MFA wherever possible.\n**Security patches: Organizations of all sizes should have a robust patch management**\nstrategy that ensures security updates on all endpoints, servers, and appliances are\napplied as soon as possible to minimize the window of opportunity for an attack.\n\n\n-----\n\n**Backups: Backups are one of the most effective ways of mitigating the effects of a**\nransomware incident. Many strains of ransomware can spread laterally across the\nnetwork and encrypt locally stored backups, so organizations should use a mixture of\nmedia storage, and store backup copies both on- and off-site. See this guide for more\n[information on creating ransomware-proof backups.](https://blog.emsisoft.com/en/34083/how-to-protect-your-companys-backups-from-ransomware/)\n**System hardening: Hardening networks, servers, operating systems and applications**\nis crucial for reducing the attack surface and managing potential security vulnerabilities.\nDisabling unneeded and potentially exploitable services such as PowerShell, RDP,\nWindows Script Host, Microsoft Office macros, etc. reduces the risk of initial infection,\nwhile implementing the principle of least privilege can help prevent lateral movement.\n**Block macros: Many ransomware families are delivered via macro-embedded**\nMicrosoft Office or PDF documents. Organizations should review their use of macros,\nconsider blocking all macros from the Internet, and only allow vetted and approved\nmacros to execute from trusted locations.\n**Email authentication: Organizations can use a variety of email authentication**\ntechniques such as Sender Policy Framework, DomainKeys Identified Mail, and\nDomain-Based Message Authentication, Reporting and Conformance to detect email\nspoofing and identify suspicious messages.\n**Network segregation: Effective network segregation helps contain incidents, prevents**\nthe spread of malware and reduces disruption to the wider business.\n**Network monitoring: Organizations of all sizes must have systems in place to monitor**\npossible data exfiltration channels and respond immediately to suspicious activity.\n**Penetration testing: Penetration testing can be useful for revealing vulnerabilities in IT**\ninfrastructure and employees’ susceptibility to ransomware. Results of the test can be\nused to allocate IT resources and inform future cybersecurity decisions.\n**Incident response plan: Organizations should have a comprehensive incident**\nresponse plan in place that details exactly what to do in the event of infection. A swift\nresponse can help prevent malware from spreading, minimize disruption and ensure\nthe incident is remediated as efficiently as possible.\n\n## How to remove Egregor and other ransomware\n\nEgregor uses sophisticated encryption methods that currently make it impossible to decrypt\ndata without paying for an attacker-supplied decryption tool.\n\nVictims of Egregor should be prepared to restore their systems from backups, using\nprocesses that should be defined in the organization’s incident response plan. The following\nactions are recommended:\n\nTake action to contain the threat.\nDetermine the extent of the infection.\nIdentify the source of the infection.\nCollect evidence.\n\n\n-----\n\nRestore the system from backups.\nEnsure all devices on the network are clean.\nPerform a comprehensive forensic analysis to determine the attack vector, the scope of\nthe incident and the extent of data exfiltration.\nIdentify and strengthen vulnerabilities to reduce the risk of a repeat incident.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-02-15 - Ransomware Profile- Egregor.pdf"
    ],
    "report_names": [
        "2021-02-15 - Ransomware Profile- Egregor.pdf"
    ],
    "threat_actors": [
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535843,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1653713587,
    "ts_modification_date": 1653713587,
    "files": {
        "pdf": "https://archive.orkl.eu/a1efacde915e7ef5adf3e5f0b691467f150eb91e.pdf",
        "text": "https://archive.orkl.eu/a1efacde915e7ef5adf3e5f0b691467f150eb91e.txt",
        "img": "https://archive.orkl.eu/a1efacde915e7ef5adf3e5f0b691467f150eb91e.jpg"
    }
}