{
    "id": "b2b1cf6d-3976-4d67-8e23-ef4d245ad818",
    "created_at": "2023-01-12T15:10:05.944211Z",
    "updated_at": "2025-03-27T02:16:25.636464Z",
    "deleted_at": null,
    "sha1_hash": "feca9772b9be98e2d2bc8d7c30a7880afc1f853e",
    "title": "2020-05-21 - Backdoor, Devil Shadow Botnet Hidden in Fake Zoom Installers",
    "authors": "",
    "file_creation_date": "2022-05-27T22:19:08Z",
    "file_modification_date": "2022-05-27T22:19:08Z",
    "file_size": 113983,
    "plain_text": "# Backdoor, Devil Shadow Botnet Hidden in Fake Zoom Installers\n\n**[blog.trendmicro.com/trendlabs-security-intelligence/backdoor-devil-shadow-botnet-hidden-in-fake-zoom-installers/](https://blog.trendmicro.com/trendlabs-security-intelligence/backdoor-devil-shadow-botnet-hidden-in-fake-zoom-installers/)**\n\nMay 21, 2020\n\nCybercriminals are taking advantage of “the new normal” — involving employees’ remote working conditions and the popularity of user-friendly\nonline tools — by abusing and spoofing popular legitimate applications to infect systems with malicious routines. We found two malware files\nthat pose as Zoom installers but when decoded, contains the malware code. These malicious fake installers do not come from Zoom’s official\ninstallation distribution channels. One of the samples installs a backdoor that allows malicious actors to run malicious routines remotely, while\nthe other sample involves the installation of the Devil Shadow botnet in devices.\n\nFigure 1. The malicious installers are significantly larger in file size compared to the legitimate Zoom installer.\n\nIt is possible that cybercriminals will also take advantage of other video conferencing apps to bundle malware. Because of this, we are closely\nmonitoring other platforms, routines, and samples for signs of tampering and bundling as well. To avoid infection from these malicious fake\ninstallers, only download Zoom or any application from trusted sources, including the Google Play store, the Apple App store and\n[https://zoom.us/download.](https://zoom.us/download)\n\n## Fake installer bundles backdoor with remote access capabilities\n\nWe found a sample of a fake Zoom installer bundled with backdoor capabilities. Comparing the malicious installer and the dropped legitimate\ncopy with the legitimate installer from the official Zoom site, the dropped file’s properties are closer to the official version. The malicious\ninstaller is an executable that contains a number of encrypted files, and will decrypt the malicious version to write into a file (%User\n_Temp%\\Zoom Meetings\\5.0.1\\setup.exe) for execution._\n\nAnalysis of the malicious sample showed that it kills all running remote utilities upon installation and opens port 5650 and the transmission\ncontrol protocol (TCP) to gain remote access to the infected system. Simultaneously, it also adds four registries that appear to be configuration\nsettings for the malicious routine.\n\nFigure 2. Opening port 5650\n\nFigure 3. Adding four configurations on installation\n\nLooking into the disassembled functions of added notification registry, it showed that the strings contained configurations and values used to\nnotify the command and control (C&C) server that the email has been set up, credentials of the user have been stolen, and flag the infected\nmachine as ready for access.\n\nFigure 4. Disassembling the notification registry\n\nAfter investigating the suspicious behaviors, it will run the legitimate version of Zoom installer to avoid suspicion. Once installed, malicious\nactors can use the opening to remotely execute commands at any given point.\n\nDevil Shadow botnet\n\n\n-----\n\ns a c ous sta e co s sted o a e a ed pyc e t c d, c co ta s a c ous co a ds e c d_s e e e e s a se e t act g\narchive (SFX) containing new_script.txt, which contains the C&C server, madleets.ddns.net and shell.bat to gain persistence, and a copy of the\n_zoom.exe installer in the v5.0.1 version. The botnet_start.vbs file runs pyclient.cmd, while the dropped component boot-startup.vbs runs to_\ngain persistence.\n\nThe repurposed installer will drop the tampered app installer, the malicious archive and codes, and the commands for persistence and\ncommunication.\n\nFigure 5. Malicious files dropped\n\nFigure 6. Malware ensuring persistence\n\nAnalysis found that the cybercriminals used the legitimate application node.exe to run the file new_script.txt, which contains the C&C server.\n\nFigure 7. Communicating with the C&C\n\nA look into the commands in pyclient.cmd shows that it connects to the host URL https[:]//hosting303[.]000wenhostapp[.]com, and downloads\nthe binaries related to the app’s malicious features and functions.\n\nFigure 8. Downloading the app’s binaries\n\nFigure 9. The downloaded binaries perform the commands listed.\n\nThe executable named screenshot.exe takes screenshots of the user’s desktop and active windows. Webcam.exe scans the system for any\nconnected webcams.\n\nFigure 10. Screenshot.exe\n\nFigure 11. Webcam.exe\n\nThe legitimate Zoom executable will be installed so users do not suspect any malicious activity, but the malware will continue to run on the\nsystem even after it is done installing. A look at the task scheduler shows that the malware sends all the gathered information to its C&C every\n30 seconds every time the computer is turned on.\n\nFigure 12. Send stolen information every 30 seconds\n\nConclusion\n\nThese installers are hosted on suspicious websites and not from official marketplaces such as the Play Store, App Store, or Zoom’s own\ndownload center, which could be taken as a telltale sign of their maliciousness. Another observable sign is that the malicious installers drop\nand run the “legitimate Zoom installer” slower than the one official Zoom installation. The malicious versions take more time to run since they\nextract the malicious components before running Zoom.\n\nThe cybercriminals behind this malware may also be in the process of research and development; they’re using multiple components with a\n[legitimate application to evade security programs. Considering that cybercriminals have started tampering with the app, cybercriminals may](https://blog.trendmicro.com/trendlabs-security-intelligence/zoomed-in-a-look-into-a-coinminer-bundled-with-zoom-installer/)\nalso be exploring the monetization possibilities of bundling malware into video conferencing apps.\n\n[Zoom became more popular during the coronavirus pandemic for its ease of use, and Zoom continues to update the platform in response to](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/coronavirus-used-in-spam-malware-file-names-and-malicious-domains)\n[issues being disclosed. As with most malicious routines, cybercriminals are riding on](https://blog.trendmicro.com/trendlabs-security-intelligence/webmonitor-rat-bundled-with-zoom-installer/) [its popularity to infect as many systems as possible with](https://blog.trendmicro.com/trendlabs-security-intelligence/zoomed-in-a-look-into-a-coinminer-bundled-with-zoom-installer/)\nforecasts for business continuity citing the increasing necessity of online tools. As such, both pieces of malware can be used to infiltrate\nsystems of high-value targets in enterprises or non-business industries to steal proprietary and confidential information. Unknown to the user,\ncybercriminals can use these to infiltrate meetings, log keystrokes, use cameras, install other malware, or record audio and video. And given\nthe availability of these apps on a variety of platforms and operating systems, an expansion to other devices may be in the works as well.\n\n\n-----\n\nUse s t e ote a d o o [o](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/cybercrime-and-digital-threats/working-from-home-here-s-what-you-need-for-a-secure-setup) e set ups ca app y t ese best p act ces o bus ess co t u ty a d p oduct ty\n\nOnly download apps and software from official marketplaces and platforms.\n[Secure your video conferencing apps and operating systems. This can be done by updating device software to the latest version, using](https://www.trendmicro.com/vinfo/tmr/?/us/security/news/security-technology/how-to-secure-video-conferencing-apps)\npasswords for meetings, and configuring host controls.\n\n## Trend Micro solutions\n\n[Users can supplement these safety measures with a multilayered protection system installed to block and detect known and unknown threats.](https://www.trendmicro.com/en/business/products/user-protection.html)\n[Trend Micro Apex One™ offers advanced automated threat detection and response against an ever-growing variety of threats. Trend Micro](https://www.trendmicro.com/en/business/products/user-protection/sps/endpoint.html)\nXDR applies artificial intelligence and analytics to the deep data sets collected from Trend Micro solutions across the enterprise, leading to\nearly and better detection.\n\n## Indicators of Compromise (IOCs)\n\n**Backdoor**\n\n**SHA256** **Description** **Detection**\n\n4070e977823d74478aec248862302063918fda16b57f2c3b561018605bfbf4fe svchîst.exe1 Backdoor.Win32.RADMIN.CMU\n\n57bf83837c18a75d2e7327cdf5bfdcc906ccf78d82237ec961a4f1bee85473cf install.exe1 [Trojan.Win32.ZAPIZ.A](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Trojan.Win32.ZAPIZ.A)\n\n9b6b1807f886bb9eccdc170988d6e419e4301c96817f362aca3d01df17c352fd reg.exe1\n\n\n90728a5b2f22460e1b28e3dc350a95b993a185a6170b4aa5e45b57834b90bcee Zoom 5.0.1 RUS,\nENG.exe\n\n**Devil Shadow botnet**\n\n\nTrojan.Win32.ZAPIZ.THA\n\n\n**SHA256** **Description** **Detection**\n\n\na26f3981ed3784bb86f5223bf14fb0047ff3fd86b8fc94753ce5a3f1702ebb56 Zoom\ninstaller.exe\n\n93bf084daddb10b3760f4e4424b1bc4d5d5590c30064045d01c8658a6fe50d3a pyclient.cmd1\n\nf01da52509792a52c6def452b3ee9b0b78acaca399341926fbe4f3212c42a55e bootstartup.vbs1\n\n\n[Backdoor.Win32.DEVILSHADOW.THEAABO](https://www.trendmicro.com/vinfo/tmr/?/us/threat-encyclopedia/malware/Backdoor.Win32.DEVILSHADOW.THEAABO)\n\nTrojan.BAT.DEVILSHADOW.THEAABO\n\n\n5b7804919d437688c8811e85c54cb36efba72652bac8093833ca04b811ea87b7 cmd_shell.exe1 Trojan.Win32.DEVILSHADOW.THEAABO\n\n628928fe61e86d3b246a7822b1d1505d3694becc4a73e373f73653851d22f1a5 new_script.txt1 Trojan.JS.DEVILSHADOW.THEAABO\n\n65f725f380c9b90d409539b74bfbd8a57f0fa48843ee79838fa57ad28240feb5 shell.bat1 Trojan.BAT.DEVILSHADOW.THEAABO\n\n**URLs**\n\nhosting303[.]000webhostapp[.]com/devil_shadow     Malware accomplice\n\nmadleets[.]ddns[.]net                                 C&C server\n\nMalware\n\nWe found two malware files that pose as Zoom app installers. One of the samples installs a backdoor that allows malicious actors to run\nroutines remotely, while the other sample involves the installation of the Devil Shadow botnet in devices.\n\nBy: Raphael Centeno, Bren Matthew Ebriega, Llalum Victoria May 21, 2020 Read time: ( words)\n\nContent added to Folio\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-05-21 - Backdoor, Devil Shadow Botnet Hidden in Fake Zoom Installers.pdf"
    ],
    "report_names": [
        "2020-05-21 - Backdoor, Devil Shadow Botnet Hidden in Fake Zoom Installers.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536205,
    "ts_updated_at": 1743041785,
    "ts_creation_date": 1653689948,
    "ts_modification_date": 1653689948,
    "files": {
        "pdf": "https://archive.orkl.eu/feca9772b9be98e2d2bc8d7c30a7880afc1f853e.pdf",
        "text": "https://archive.orkl.eu/feca9772b9be98e2d2bc8d7c30a7880afc1f853e.txt",
        "img": "https://archive.orkl.eu/feca9772b9be98e2d2bc8d7c30a7880afc1f853e.jpg"
    }
}