{
    "id": "b2c57216-145a-48ff-8e4d-4883887dcf5d",
    "created_at": "2022-10-25T16:48:20.361385Z",
    "updated_at": "2025-03-27T02:11:39.749972Z",
    "deleted_at": null,
    "sha1_hash": "99b6b984988581cae681f65b92198ed77609bd11",
    "title": "2016-06-17 - In The Wild- Mobile Malware Implements New Features",
    "authors": "",
    "file_creation_date": "2014-07-31T19:43:08Z",
    "file_modification_date": "2014-07-31T19:49:45Z",
    "file_size": 2606351,
    "plain_text": "# Energetic Bear — Crouching Yeti\n\n## Kaspersky Lab Global Research and Analysis Team\n\n\n-----\n\n# 1. Executive Summary\n\nEnergetic Bear/Crouching Yeti is an actor involved in several Advanced Persistent Threat (APT)\ncampaigns that have been active since at least the end of 2010. Targeted sectors include:\n\n- Industrial/machinery\n\n- Manufacturing\n\n- Pharmaceutical\n\n- Construction\n\n- Education\n\n- Information Technology\n\nMost of the victims we identified fall into the industrial / machinery building sector, indicating this\nis of special interest.\n\nTo infect the victims, the attackers rely on three methods:\n\n- Spear-phishing e-mails using PDF documents embedded with an Adobe Flash exploit (CVE-20110611)\n\n- Trojanized software installers\n\n- Waterhole attacks using a variety of re-used exploits\n\nDuring the attacks, the Crouching Yeti use several malware/Trojans, which exclusively infect\nWindows systems:\n\n- Havex Trojan\n\n- Sysmain Trojan\n\n- The ClientX backdoor\n\n- Karagany backdoor and related stealers\n\n- Lateral movement and second stage tools\n\nFor command and control, these connect to a large network of hacked websites. These sites host\nmalware modules, victim information and serve commands to infected systems.\n\nThe dozens of known Yeti exploit sites and their referrer sites were legitimate, compromised sites.\nThey ran vulnerable content management systems or vulnerable web applications. None of the\nexploits used to compromise the servers were known to be zero-day. None of the client side exploits\nre-used from the open source Metasploit framework were zero-day.\n\n\n-----\n\nOverall, we observed about 2,800 victims worldwide, the most prevalent attack tool being the Havex\nTrojan.\n\nWe believe this group is highly determined and focused on a very specific industrial sector of vital\ninterest. It uses a variety of ways to infect its victims and exfiltrate strategic information. The\nanalyzed data seems to suggest the following points:\n\n- It is not currently possible to determine the Country of origin\n\n- The attackers’ global focus is much broader than power producers\n\n- Their toolset has remained stable over time\n\n- Managed, minimal, methodical approach to sustained operation\n\n- Appropriate use of encryption (symmetric key protected with attackers public key for encrypted\nlog file exfiltration)\n\nThis report provides technical details on how the attackers perform their operations.\n\n\n-----\n\n# Contents\n\n1. Executive Summary 2\n2. Analysis 5\n2.1. Delivery 5\n2.1.1. Legitimate software installers 5\n2.1.2. Malicious XDP file – spear-phishing 8\n2.1.3. Malicious JAR/Html files – waterholing 9\n2.2. Malware 12\n2.2.1 The Havex Loader 12\n2.2.2 The Ddex L\u0007oader 15\n2.2.3 The Sysmain backdoor 15\n2.2.4 The ClientX backdoor 17\n2.2.5 The Karagany Backdoor 17\n2.3. C&C servers and victims 20\n2.3.1. Victims 23\n2.3.2. Victims-C&C relationship 33\n3. Attribution 34\n3.1.  Non-specific Data 34\n3.2. Exploit server activity 38\n3.3. Victim characteristics and categories 39\n4. Conclusions 40\n\n\n-----\n\n# 2. Analysis\n\nThis section analyzes all the aspects we could find about how this threat actor manages its\ncampaigns.\n\nThe Crouching Yeti actor performed a massive surveillance operation targeting strategic victims,\nmany of them in the industrial/manufacturing sector.\n\nThere were different ways of delivering of its malware including waterholing, spearphishing and\nadding malware to legitimate installers. Once the victims were infected, Crouching Yeti selected\ndifferent RATs for its operations. These RATs communicated with Command and Control servers on\ncompromised servers around the world, using a simple PHP backend.\n\nWe were able to identify several victims, including high-profile ones and dozens of domains used in\nthe campaign.\n\n## 2.1. Delivery\n\nAs far as we know the group behind Crouching Yeti delivers its malware using at least three\ndifferent methods.\n\n### 2.1.1. Legitimate software installers\n\nThe first method uses a legitimate software installer repackaged as to contain the malicious DLL.\nSuch modified self-extracting archives could have been uploaded directly to a compromised server,\nreplacing the original file, or sent to the victim by email.\n\nOne example of using this method was a hijacked SwissRanger camera driver (libMesaSR version\n1.0.14.706) that was used to drop the Sysmain backdoor to:\n```\n%APPDATA%\\sydmain.dll\n\n```\nand set the Run registry value to load malicious DLL upon next system startup.\n\n\n-----\n\nFigure 1. MESA Camera description\n\nIn a similar manner, as early as January 2014, Havex version 038 appears to have been dropped by\na legitimate ~40MB software installer from the eWon web site:\n\nhxxp://www.ewon.biz/software/eCatcher/eCatcherSetup.exe\n\n“eWon” is a Belgian producer of SCADA and industrial network equipment, which helps define this\nattack method as a watering hole attack:\n\n\n“Breaking the barrier between industrial applications and IT standards, the mission of eWON\nis to connect industrial machines securely to the Internet, enabling easy remote access and\ngathering all types of technical data originating from industrial machines… Connecting\nmachines across the Internet is our mission.”\n\n\nSometimes, the Havex loader was dropped from “eCatcherSetup_v4.exe”, so it seems that the site\noperators may have removed a previous file and the attackers replaced it with their Trojanized\ninstaller. It is also likely that the attackers gained access to eWon’s FTP site and replaced the\nlegitimate file with one that is bound with the Havex dropper several times.\n\n\n-----\n\nFigure 2. MESA Camera description\n\nAnother example that involves a hijacked application from a PLC-related vendor is a Trojanized mbCHECK\ninstaller which replaced the original legitimate version freely downloadable from the vendor’s website.\nThe vendor - MB Connect Line - is a company which specializes in software for remote maintenance of\nPLC systems: MB Connect Line GmbH (hxxp://www.mbconnectline.com/index.php/en/).\n\n\n-----\n\nFigure 3. MB Connect Line website\n\nIn this case, the dropped DLL was Havex version 043.\n\n### 2.1.2. Malicious XDP file – spear-phishing\n\nThe second method relies on a malicious XDP file containing the PDF/SWF exploit (CVE-2011-0611)\nand was most likely used in spear-phishing attacks. This exploit drops the Havex loader DLL, which\nis stored in an encrypted form in the XDP file.\n\nThe exploit is delivered as an XDP (XML Data Package) file which is actually a PDF file\npackaged within an XML container. This is a known the PDF obfuscation method and serves as an\nadditional anti-detection layer.\n\nThe XDP file contains a SWF exploit and two files (encrypted with XOR) stored in the invalid section\nof the PDF file. One of the files is Havex DLL (version 038), the other is a small JAR file, which is\nused to copy and run the DLL by executing the following command:\n```\ncmd /c copy <fname_passed_as_param> %TEMP%\\\\explore.dll /y & rundll32.exe\n%TEMP%\\\\explore.dll,RunDllEntry\n\n```\n\n-----\n\nThe SWF executes the action script, which contains another SWF file which in turn uses the CVE2011-0611 vulnerability to run the shellcode.\n\nThe shellcode then looks for a specific signature in the memory (which signs the start of the\nencrypted DLL), decrypts and loads it.\n\n### 2.1.3. Malicious JAR/Html files – waterholing\n\nFinally, this actor actively compromises legitimate websites for watering hole attacks. These hacked\nwebsites in turn redirect victims to malicious JAR or HTML files hosted on other sites maintained\nby the group (exploiting CVE-2013-2465, CVE-2013-1347, and CVE-2012-1723 in Java 6, Java 7,\nIE 7 and IE 8). These then drop the Havex loader, the Karagany backdoor and helper tools.\nThese sites run an exploit kit known as “LightsOut”. It appears that the “LightsOut” exploit kit is\nexclusively used by the Energetic Bear/Crouching Yeti actor.\n\nFrom the dozens of Yeti exploit sites we reviewed, the malicious code was nothing more than\nslightly modified metasploit java exploits delivering the Havex loader. Some sort of internal\nreview must have pushed them towards the LightsOut EK. KSN data records help provide a list\nof Crouching Yeti related exploit delivery from dozens of these sites.\n\nIn earlier cases (July 2013), successful Java exploitation served from nahoonservices.com would\ncascade into more Yeti components planted on victim systems. The Java exploit downloaded\nKaragany backdoors, which in turn downloaded stealers from 91.203.6.71:\n\n\n-----\n\nFigure 4. Infection diagram\n\nKSN data recorded at least 20 victim sites that were compromised and injected with Yeti iFrames,\nredirecting hundreds of visitors to compromised Yeti exploit sites. Most of these redirector sites\nwere owned by Western and Eastern European industrial power players, investors, legal advisors\nand advocates, and European and US industrial IT equipment makers. The compromised sites\nhosting the Lights Out exploit kit were fairly well trafficked, legitimate sites. Their content widely\nvaries from California winemakers to Cuban travel agencies and Iranian general interest/religious\ninspiration sites.\n\n\n-----\n\nFinally, other second stage tools were simply retrieved by the downloaders over http from various\nservers. Some of these Yeti sites, like kinoporno.org, served both Havex and these tools. KSN events\nrecorded the sites serving Windows Credential Editor and custom credential and document stealing\n\n\n-----\n\n## 2.2. Malware\n\nThe Crouching Yeti group has different tools of choice for their operations. This section describes\nthem from a technical perspective.\n\n### 2.2.1 The Havex Loader\n\n**1. Description**\n\nThe main functionality of this component is to download and load additional DLL modules into the\nmemory. These are stored on compromised websites that act as C&C servers. In order to do that, the\nmalware injects itself into the EXPLORER.EXE process, sends a GET/POST request to the PHP script\non the compromised website, then reads the HTML document returned by the script, looking for a\nbase64 encrypted data between the two “havex” strings in the comment tag <!--havexhavex-->\nand writes this data to a %TEMP%\\<tmp>.xmd file (the filename is generated by GetTempFilename\nfunction).\n\nIn the meantime, another routine is constantly checking the %TEMP% folder for all *.xmd files. For each\nfile it finds, it decompresses the content, decrypts (if encrypted) and loads into the memory as the DLL.\n\nIn order to run on each system boot, malware copies itself to: <path>\\TMPprovider0XX.dll\nand creates the autorun registry key.\n\nAll samples of this component contain statically linked bzip2 library. Versions >= 01B contain also\na RSAeuro library, used for encryption of log files and decryption of downloadable modules. Public\nkeys for encryption are hardcoded in the binary and/or stored in the configuration section. In some\ncases, these keys are written to the registry values.\n\nIn total, we identified 124 different samples of Havex loader, belonging to 27 different versions. As\nof June 2014, the latest version number we know of is 044.\n\n**2. C&C communication**\n\nThe URL addresses of the C&C servers (which are indeed compromised websites) are either\nhardcoded in the binary, or - in versions => 038 - specified in the configuration section inside the\nICT resource. This resource is compressed with bzip2 and encrypted with XOR.\n\nThere are usually 2-4 URLs per binary, different for each malware version and sometimes also\ndifferent between samples of the same version.\n\n\n-----\n\nMalware sends a GET request (versions < 017) or POST request to the first available URL. The request\ncontents depends on the malware version and it may include such information as unique bot id, malware\nversion number, OS version number, and some other data from configuration, as well as the harvested\ninformation logged into the *.yls file (if any). Then the malware searches the HTML code of each\nreturned page for havex markers and saves the data between the markers into a temporary file.\n\n**3. Downloadable modules - common characteristics**\n\nThese modules are hosted between the havex markers in the HTML code of compromised websites.\nThe module code are usually XORed with ”1312312” then compressed with BZIP2 and finally\nbase64 encoded. Once downloaded into the %TEMP%\\*.xmd file by the main Havex DLL, the code\ngets decoded, decompressed, saved into the temporary DLL file and loaded into the memory.\n\nThe modules perform variety of different actions, including collecting information about the victim’s\nsystem and other machines in the local network, harvesting passwords, listing documents, etc. In order\nto do that, some of the modules make use of additional 3rd stage, third-party executables.\n\nEach module contains the configuration information stored in an encrypted and compressed form\ninside a resource. Configuration data includes 29-byte UID (unique ID), a 1024 bit RSA Public key\n(base64 encoded) and other necessary info (like file paths, etc.). All harvested data is compressed,\nencrypted and written into the %TEMP%\\*.yls files, which are then sent to the C&C by the main\nHavex/Sysmain module.\n\nThe “yls” files are encrypted with the 3DES crypto algorithm using a random 192-bit key (168 bit\neffective). The 3DES key is encrypted using the public RSA 1024 key and therefore never transferred\nin plain text to attackers.\n\nIn-depth analysis of the cryptography used by log files is presented in the Appendix 2\n\n**4. List of known modules**\n\nOPC scanner\n\nThis module is designed to collect the detailed data about the OPC servers running in the local\nnetwork and save them to to %TEMP%\\{rand}.yls file. To query the OPC servers, it uses the\nfollowing interfaces:\n\n- `IID_IOPCEnumGUID`\n\n- `IID_IOPCServerList`\n\n- `IID IOPCServerList2`\n\n\n-----\n\n- `IID_IOPCServer`\n\n- `IID_IOPCBrowsr`\n\n- `IID_IOPCBrowseServerAddressSpace`\n\n- `IID_IOPCItemProperties`\n\n- `CATID_OPCDAServer10`\n\n- `CATID_OPCDAServer20`\n\n- `CATID_OPCDAServer30`\n\nSysinfo module\n\nThis module collects basic information about the system it’s running on, and saves it to the\n```\n%TEMP%\\{rand}.yls file. Harvested data includes:\n\n```\n- Unique system ID\n\n- OS version\n\n- Username\n\n- Computer name\n\n- Country\n\n- Language\n\n- Current IP\n\n- List of drives\n\n- Default Browser\n\n- Running Processes\n\n- Proxy Setting\n\n- User Agent\n\n- Email Name\n\n- BIOS version and date\n\n- Lists of files and folders (non-recursive) from Desktop, My Documents and Program Files folders\nand root directories on all drives.\n\nContacts stealer module\n\nThis module collects contact details stored in all outlook.nk2 files and writes them to the %TEMP%\\\n```\n{rand}.yls file.\n\n```\nOutlook.nk2 file is the file where Outlook (version greater or equal to 2007) keeps contacts details\nin order to use them for AutoComplete feature.\n\nPassword stealer module\n\nThis module uses the embedded BrowserPasswordDecryptor 2 0 tool (hxxp://securityxploded\n\n\n-----\n\ncom/browser-password-decryptor.php) to dump login credentials stored by the password managers\nof various browsers. Decrypted passwords are saved into the %TEMP%\\~tmp1237.txt file, which is\nthen copied by the parent module into an encrypted *.tmp.yls file.\n\nList of browsers supported by the tool (from the product’s website):\n\n- Firefox\n\n- Internet Explorer\n\n- Google Chrome\n\n- Google Chrome Canary/SXS\n\n- CoolNovo Browser\n\n- Opera Browser\n\n- Apple Safari\n\n- Comodo Dragon Browser\n\n- SeaMonkey Browser\n\n- SRWare Iron Browser\n\n- Flock Browser\n\nNetwork scanner module\n\nThis module is designed to scan the local network and look for all hosts listening on ports related to\nOPC/SCADA software. Information about these hosts is then saved to the %TEMP%\\~tracedscn.\n```\nyls file.\n\n```\n\n**Port number** **Software that uses this port**\n\n\nport 44818 Rslinx\n\nport 502 Modbus\n\nport 102 Siemens PLC\n\nport 11234 Measuresoft ScadaPro\n\nport 12401 7-Technologies IGSS SCADA\n\n\nIn-depth analysis of Havex loader and the related modules is presented in the Appendix 2.\n\n\n-----\n\n### 2.2.2 The Ddex L\u0007oader\n\n**1. Description**\n\nThis component is a simple downloader with the functionality similar to the Havex component.\n\nIt sends the request to PHP script at the C&C (compromised website) and looks for specific data in\nthe returned HTML code.\n\nIt writes the data (some ASCII string) from between <I6></I6> tags to the file in %TEMP%\\\n```\nLow\\~task.tmp and the data (binary data XORed with 0x0A) from between <B6></B6> tags into\n\n```\nthe %TEMP%\\Low\\~ldXXXX.TMP file.\n\nThen it decrypts the ldXXXX.TMP file and loads it into memory.\n\nBased on the compilation times, we may assume that this loader was used to download and run\nmodules before it got replaced by Havex.\n\nThe Ddex loader is analyzed in more details in Appendix 4.\n\n### 2.2.3 The Sysmain backdoor\n\n**1. Description**\n\nThis malware can be described as a classical RAT (Remote Access Trojan), since it gives the attacker\na wide range of opportunities to control and to interact with the victims’ machine.\n\nThe autonomous part of Sysmain installs and registers itself to be persistent in the system.\n\nThen it gathers general information about the victims system, like\n\n- User- and computer names\n\n- Locale information\n\n- Network- and drive status\n\n- Default browsers\n\n- Running processes\n\n- File listing of the users profile directory.\n\nWhen ready, this data is submitted to one of the C&C-servers. After that, it checks periodically for\nnew commands from C&C (pulling via HTTP).\n\n\n-----\n\nWith a set of 11 commands, the malware is able to:\n\n- Execute shell-commands\n\n- Launch additional executables or libraries (sent by the attacker)\n\n- Collect arbitrary files for later exfiltration\n\n- Examine the victim’s filesystem.\n\nThere are also commands used for maintenance purposes. Among others, there are commands to\nchange the pubkey for C&C-communication or delete its traces in the registry.\n\n**2. C&C communication**\n\nIt receives its commands from one of four static command-and-control servers. Every variant of this\nmalware has its own set of servers.\n\nAs usual, the attackers are using most likely compromised webservers as part of their C&Cinfrastructure. To communicate with the C&C-server, the Trojan makes use of asymmetric\nencryption with a hardcoded pair of private and public keys.\n\nAnother public key is used to encrypt files, which are collected in a local dropzone on the victim’s\nfile system. The files in that dropzone will be submitted to the attacker later, all in one go.\n\nAppendix 3 provides in-depth analysis of the Sysmain backdoor.\n\n### 2.2.4 The ClientX backdoor\n\n**1. Description**\n\nThis component is written in .NET and is very similar to The Sysmain backdoor.\nThe settings of the RAT are stored in the registry as BASE64 encoded values.\n\nThe RAT gets its commands by sending a request to a PHP script on the C&C (compromised server)\nas usual, and looks for specific data in the returned HTML code. The data in this case is stored\nbetween the havexhavex tags, it is then decrypted and decoded (base64).\n\nThe RAT supports 13 commands including:\n\n- Screen capture\n\n- Trojan Update\n\n- Loading DLLs\n\n\n-----\n\n- Starting executables\n\n- Running shell commands\n\n- Listing directories\n\nEach time a command (task) is executed, the result of that command is stored in the registry under\na subkey named “done” or “doneEXT”. The result (which are called “answers” by the authors) is\nthen posted to the C&C server.\n\nThe ClientX backdoor is analyzed in depth in the Appendix 5.\n\n### 2.2.5 The Karagany Backdoor\n\n**1. Description**\n\nKaragany is a simple backdoor that connects to the C&C and waits for commands. It can download\nand run additional executables, load/delete modules, read file content, reboot the computer, update\nitself and remove all components.\n\nBesides backdoor functionality, it also extract credentials from Internet Explorer’s password manager to\nthe prx.jpg file and injects a small DLL into the processes of web browsers. This DLL keeps listening on\nthe outgoing network traffic and looking for the basic access authentication details sent over unencrypted\nHTTP. Affected browsers include: Internet Explorer, Firefox, Mozilla and Opera.\n\nWhen executed, it copies itself to the folder under %APPDATA% and create a .lnk file in the %STARTUP%\ndirectory. Folder name and filename are chosen from the list of strings hardcoded in the binary:\n\n\n**Folder name** **File name**\n\n\nMicrosoft WCF services SearchIndexer\n\nBroker services ImeBroker\n\nFlash Utilities fsutil\n\nMedia Center Programs; PnPutil\n\nPolicy Definitions BdeUISrv\n\nMicrosoft Web Tools WinSAT\n\nReference Assemblies pwNative\n\n\nAnalysis Services SnippingTool\n\n\n-----\n\n**Folder name** **File name**\n\n\nInstallShield Information DFDWizard\n\nIIS SQL Server PrintBrmEngine\n\nDiagnostics; WbemMonitor\n\nNTAPI Perfomance dxpserver\n\nWPF Platform PowerMng\n\n\nIt also creates C:\\ProgramData\\Mail\\MailAg\\ folder, where the information harvested by\ndownloaded modules will be stored.\n\nAfter checking if the connection to the Internet is up, it sends the initial POST request to the C&C\nserver. Known parameters used in C&C communication are:\n\n- &identifiant=<victim_uid>, which is calculated based on system version, system install\ndate, username and system metrics\n\n- &version=<bot_version_nr>\n\n- &fichier=<file_content>\n\n**2. List of known modules:**\n\nScreenshot module\n\nThis module is used to drop and run the DuckLink CmdCapture tool - a 3rd party freeware AutoIt\n[application for capturing the screenshots (hxxp://www.ducklink.com/).](http://)\n\nA screenshot of the desktop is saved into the C:\\ProgramData\\Mail\\MailAg\\scs.jpg file.\nAdditionally, other system system information - such as day and time of capture, computer name,\nusername, cpu architecture, os version, IP address, logon domain and logon server, desktop details\n(height, width, depth, refresh rate) and environmental variables - are logged in C:\\ProgramData\\\n```\nMail\\MailAg\\scs.txt file.\n\n```\nModule listing documents and other files\n\nThis module is used to list all files and documents with specified extensions, or which names contain\nspecified strings, in the C:\\ProgramData\\Mail\\MailAg\\fls.txt file.\nSaved information include path, size and modification time. File matching patterns:\n\n\n-----\n\n*pass*.* *.rtf *.xls *.pdf\n\n*secret*.* *.pst *.doc *.vmdk\n\n*.pgp *.p12 *.mdb *.tc\n\n\n## 2.3. C&C servers and victims\n\nThe Command and Control servers are compromised legitimate websites, like blogs, from different\ncountries.\n\nIn total we have identified 219 unique domain names for these C&C servers hosted in 21 different\ncountries.\nWe found most hosted C&Cs in the United States (81 servers), Germany (33 servers), the Russian\nFederation (19 servers) and the United Kingdom (7 servers).\n\nUnited States\n\n79 81 Germany\n\nRussian Federation\n\nUnited Kingdom\n\nOther\n\n7\n19 33\n\nFigure 5. C&C country distribution\n\n\n-----\n\nThe table below shows the distribution of victims affected by the samples identified according to\nour KSN data. Victims infected with samples from any of the Crouching Yeti group’s malware were\nfound in:\n\n\n-----\n\n**65 of these C&C servers, in the following countries, were monitored during our investigation.**\n\n13\n\nUnited States\n\nGermany\n\n4\n\n33 Russian Federation\n\n6 United Kingdom\n\nOther\n\n9\n\nFigure 6. Monitored C&C servers country distribution\n\nThis monitoring enabled us to get a list of the victims connected to them.\n\n**1. C&C backend**\n\nThe C&C Backend is written in PHP, consisting of 3 files:\n\n**• “log.php” is a Web-Shell, used for file level operations.**\n\n**• “testlog.php” is not a PHP-script but it contains the C&C Server logfile of backdoor-connections.**\nPlease see “source.php” below for further information.\n\n**• “source.php”**\n\nThe Backdoors interact with “source.php”, which is the control script. These are its functions on execution:\n1. Collects the following information:\n\n**Information** **Syntax/content** **Used (written to log)**\nTimestamp day-month-year hour:minute-second Yes\nIP-address checks and return valid IP-address from Yes\nHTTP-Request (“HTTP_CLIENT_IP”,\n```\n            “HTTP_X_FORWARDED”, “HTTP_X_\n            iFORWARDED_FOR”, “REMOTE_ADDR”)\n\n```\n\nHost reverse lookup of IP-address No\n(gethostbyaddr)\n\n\n-----\n\n**Information** **Syntax/content** **Used (written to log)**\nProxy Proxy-IP-address if Bot connected through No\nProxy\n\n\nUserAgent UserAgent from HTTP-Request Yes\nRequest-URI string of URI requested by Bot Yes\nBotID BotID transferred with HTTP-request Yes\n\n\n2. Writes above information to “testlog.php”, separated by “Tabulator” and base64-encoded, with\nfollowing syntax:\n\n_<timestamp>\\t<victim ip-address>\\t<proxy>\\t<botID>\\t<request-uri>\\t<useragent>_\n\n3. Writes all transferred HTTP-GET Variables to “<botID>.log”, separated by “Tabulator” and\nbase64-encoded.\n\n4. If the bot executes an HTTP-POST-request, the transferred data is written to the file “<botID>.\n_ans”, enclosed in “xdata”-Tag with timestamp. (“ans” is the acronym for “Answer”)._\n\n5. Checks for any file “<botID>_*.txt”\n\na. If found the first step is to append the timestamp, filename and a “sent” Status indicated to\n“<botID>.log”. Then the file content is transferred to the bot, embedded into HTML with\nHTML-Body “No data!” and HTML-Comment “havex” containing the data to be transferred.\nFinally the file on the server is removed. If this removal fails it is logged to “<botID>.log”.\n\nb. If no matching file is found, a HTML-Response is sent with an empty “havex” HTMLComment and HTML-Body text “Sorry, no data corresponding your request.”\n\n### 2.3.1. Victims\n\nThe term “victim” in this section refers to a botID (unique String of the Backdoor), connecting to\none or more C&C Servers. Based on the 45 C&C Servers we monitored, a total of 2,811 unique\nVictims were discovered.\n\n\n-----\n\nThe average number of victims per C&C is 70:\n\nFigure 7. Number of victims (Y) per C&C server instance (X)\n\nThe following chart depicts the first (red line) and last (blue line) appearance of each victim on the C&C.\n\nThe “FirstHit” shows how the rate of accumulating new victims has accelerated over the course of\n2014. “LastHit” shows how the last connection of victims to C&C servers also increases over time.\nThis could mean victims are disinfecting their computers, or it may be that they simply report to a\ndifferent C&C server that we do not monitor.\n\nLastHit\n\nFirstHit\n\nFigure 8 Evolution of “FirstSeen“ and “LastSeen“ victims\n\n\n-----\n\nMapping unique hits of victims per day also indicates a decrease of “active” infections. The following\nchart clearly shows a difference between weekdays (groups of five higher bars) and weekends (two\nlower bars). The daily unique hit-rate fell by about half from around 800 connections at the beginning of\n2014 to around 400 connections per week-day by the middle of the year:\n\nFigure 9. Unique victims per day reporting to C&Cs\n\nMore than half of the victims always connect from the same IP address. Less than half of the victims\nconnect from two or more different IP addresses as the following graph shows.\n\n1 IP address\n\n26%\n\n2 IP addresses\n\n3 IP addresses\n\n3% 57%\n4% 4 IP addresses\n\n10% >4 IP addresses\n\nFigure 10. Number of different IPs per victim\n\nThis might indicate that some of the victims are behind proxies, which makes sense for corporate\nenvironments. Victims using many different IP addresses may indicate the use of laptops computers.\n\n\n-----\n\nThe following chart visualizes all the unique victims connecting to C&C servers. The main C&C Servers\ncan be clearly seen in Russia and the USA. The victims are distributed across 99 different countries.\n\nFigure 11. Connection between victims and C&C\n\nFrom the total of 2,811 victims, it was possible to accurately identify 106 of them. Appendix 8 contains a\nbrief description about the sector/company on which these victims operate.\n\n\n-----\n\nThe table below shows a summarizes the distribution of the identified victims per sector.\n\n\n**Sector** **Number of victim organizations**\n\n\nEducational 32\n\n\nResearch 14\n\n\nMechanical Engineering 10\n\n\nInformation Technology 10\n\n\nConstruction 9\n\n\nGovernment 8\n\nHealth 5\n\nNetwork Infrastructure 3\n\nPharmaceutical 2\n\nElectrical Engineering 2\n\nPackaging 2\n\nFinancial 2\n\nEnergy 2\n\nCleaning 1\n\nAutomotive 1\n\nStructural Engineering 1\n\nTransportation 1\n\nChemical 1\n\n\n-----\n\n**1. Havex Victims**\n\nBased on our monitoring, the most widespread Backdoor is Havex with a total of 2,470 infected\nsystems, mostly based in USA and Spain.\n\nFigure 12. Havex victims per country\n\n\n-----\n\nThere are 32 different versions of Havex being used among all victims, with 51 victims left without\nidentifiable Havex-Version. Havex Version 024, compiled in the end of 2012, is the most widespread.\n\n\n-----\n\nBesides the Havex version, also the OS-Version of the victim computer is also communicated to the\nC&C server. The most common Operating System among victims is Windows XP, but Windows 8.1 is\nalso in the list.\n\n57%\n\nWindows XP (5.1.2600)\n\nWindows 7 / Windows Server 2008 R2, SP1 (6.1.7601)\n\nWindows 7, RTM (6.1.7600)\n\nWindows Server 2008 (6.0.6001)\n\nWindows Server 2008 R2, SP1 (6.1.7601)\n\nWindows Vista Service Pack 2 (6.0.6002)\n\nUnknown\n\nWindows Vista (6.0.6000)\n\n13% Windows Server 2003 (5.2.3790)\n\nWindows 8.1 (6.3.9600)\n\nWindows 8 / Windows Server 2012 (6.2.9200)\n\n9%\n\nWindows 7 RC (6.1.7100)\n\n6%\n\n4%\n\n4%\n\n2%\n1%\n2%\n2%\n\n0% 0%\n\nFigure 14. OS distribution among victims\n\n\n-----\n\n**2. Sysmain Victims**\n\nThe Sysmain victims connect to six of the monitored C&C servers, where 261 unique victims were\ncounted, located in 38 different countries.\n\nFigure 15. Sysmain victims per country\n\n\n-----\n\n**3. ClientX Victims**\n\nVictims of the Clientx backdoor connect to 2 of the monitored C&C Servers, where 10 unique\nVictims were counted in 5 different countries.\n\nFigure 16. ClientX victims per country\n\n\n-----\n\n### 2.3.2. Victims-C&C relationship\n\nBased on the analysis of the monitored C&C servers we identify some clusters depending on\nmalware versions and the victims.\n\nThis graph visualizes these relations. Every dot represents a victim, different backdoors and versions\nare colored differently. The C&C servers are also represented as dot where several clients connect.\nGrey lines are connections from a victim to its C&C Server.\n\nFigure 17. Clusters of victim-C&C relationships\n\nSome C&C servers are dedicated to a given version of a backdoor (big Cluster). Others share\nconnections with different backdoor versions and different backdoors.\n\nBreaking this down to the sectors of the identified victims, we cannot see any correlation between\nC&Cs and victims. The same sectors are targeted with different backdoor versions.\n\n\n-----\n\n# 3. Attribution\n\n## 3.1.  Non-specific Data\n\nCompared to our other APT research the available data is more non-specific than usual. There\nsimply is no one piece or set of data that would lead to the conclusion that the threat actor is Bear,\nKitten, Panda, Salmon, or otherwise. Significant data points below.\n\n**File timestamp analysis and unique strings**\n\nIt is rare to see file timestamps used as a precise, primary source of information when it comes to\nthreat actor attribution. In previous reports, these timestamps are used as supporting, or secondary\npieces of data. They may help to suggest or support a time range of attacker activity, but they are\nvery easily modified. So it is not very helpful to focus on this data set.\n\nThe strings present in the backdoors, web components, and exploits are English. Almost 200 malicious\nbinaries and the related operational content all present a complete lack of Cyrillic content, the opposite\nof our documented findings from researching Red October, Miniduke, Cosmicduke, Snake, and\nTeamSpy.\n\nThe OPC module strings include typos and bad grammar. Some are so bad they are almost silly, and\nthere doesn’t seem to be a consistent pattern here:\n```\nProgramm was started at %02i:%02i:%02i\n\n```\nStart finging of LAN hosts...\n```\nFinding was fault. Unexpective error\nWas found %i hosts in LAN:\nHosts was’t found.\n\n```\nThere are also three interesting strings inside the Karagany backdoor:\n\nidentifiant (which is French for identifier), fichier (French for file) and liteliteliteskot\n(lite scot is Swedish for little sheet)\n\n\n-----\n\n**Timestamp details**\n\nTimestamp analysis is based on the total number of 154 collected binaries:\n\n- 124 samples of Havex loader (versions 01 - 044) + 7 downloaded modules\n\n- 7 samples of Sysmain backdoor\n\n- 4 samples of Ddex loader\n\n- 1 sample of ClientX backdoor\n\n- 4 samples of Karagany Trojan + 2 downloaded modules\n\n- 3 samples of Trojanized installers\n\nHighlights:\n\n- The earliest samples related to this campaign are the Ddex loader binaries with compilation\ntimestamps between October and November 2010.\n\n- The first Havex loader samples are the version 01 and version 02 samples with compilation\ntimestamps from 28th September 2011.\n\n- The latest known samples are Havex loader version 044, compiled on 7th May 2014 and all OPC\nmodules compiled in April and May 2014.\n\n- Most of samples were compiled during the weekdays, although there is a couple of samples with\nthe compilation timestamp indicating Saturday\n\n- Most of samples were compiled between 6:00 and 16:00 UTC with the peak between 6:00 and\n**8:00 UTC.**\n\n   - Earliest compilation hour:  02:15:23 UTC (Wed, 28 Sep 2011)\n\n   - Latest hour: 23:39:34 UTC (Thu, 02 Jun 2011)\n\n\n-----\n\nActivity / Year (all samples):\n\nmodule clientX sysmain havex ddex\n\nFigure 18. Activity per year on different components\n\nActivity / Weekdays based on compilation time:\n\nFigure 19. Activity per weekday distribution\n\n\n-----\n\nActivity / Hours (UTC) based on compilation time:\n\nFigure 20. Activity per hour distribution\n\n\n-----\n\n## 3.2. Exploit server activity\n\nAll the exploit servers delivered slightly modified ripped content from open source repositories. All\nthe servers appear to be hacked servers. According to the available data, no zero-day exploits were\nused in any of these attacks, either to compromise the servers in the first place, or delivered as client\nside attack exploits by the Lights Out Exploit Kit.\n\nWhile this purely malicious re-use of metasploit PoC highlights the danger that these attack tools\npose, it is also unusual to see an exclusively metasploit attack toolset effectively used in this way,\ndelivered from what appear to be a chain of higher value compromised sites.\n\nAll of these compromised web applications were vulnerable to freely available offensive security\ntools. We acknowledge that many of the compromised referrer servers were related to industrial\npower producers in some way. However, these targets almost seem an afterthought, as the exploit\nservers themselves were compromised web servers from Cuban travel agency sites, a Californian\nwinery site, a US based women’s fashion site, an Iranian general interest/religious inspiration site,\na number of dating and adult content websites, and a variety of others. Although, we note that\nthe known Trojanized software packages were ICS/SCADA related as well, possibly because those\nvictim sets or environments required special attention. So, while there was a strong set of offensive\nactivities on power producers during the campaigns, it was by no means the full focus of them.\n\n\n-----\n\n## 3.3. Victim characteristics and categories\n\nWhile it may be “shocking” to observe industrial power producers around the world targeted by\nany one threat actor, this actor’s attack activity does not appear to be constrained to this sector.\nThe related industries of interest show a much broader global scope than previously discussed, and\nthe geographic regions of interest have gone completely undiscussed. For example, Spain had the\nhighest number of victims. However, it appears that there was no significant correlation between the\nvictim location and the C&C geolocation. According to our data, the list rounds out with the victim\norganizations fitting the following additional categories:\n\n- Pharmaceuticals\n\n- Health\n\n- Cleaning\n\n- Education\n\n- Automotive\n\n- Transportation\n\n- Packaging\n\n- Network Infrastructure\n\n- Information Technology\n\n- Structural Engineering\n\n- Mechanical Engineering\n\n\n-----\n\n# 4. Conclusions\n\nThe Crouching Yeti actor has been performing massive surveillance campaigns over the last few\nyears, at least since 2010. Their targets included thousands of victims of which we were able to\nidentify a few, confirming Crouching Yeti’s interest in several strategic sectors.\n\nThe distribution strategy of the group focuses on methods following this targeted philosophy,\nincluding spear-phishing and waterholing. Noticeably, they also compromised legitimate software\npackages from strategic actors in the SCADA sector in order to infect their final victims. The victim\nlist confirms that the tactic proved successful.\n\nThere is nothing especially sophisticated in the exploits used, or in the malware used to infect\nvictims. The RATs are flexible enough to perform surveillance and data exfiltration efficiently. The\nattackers used dozens of compromised servers as C&C domains with a simple, but effective, PHP\nbackend.\n\nHowever, there is an interesting connection with this group and the LightsOut exploit kit for the\ndistribution of its malware in some waterholing attacks. We believe they are likely its only operators\nas of June 2014.\n\nThanks to the monitoring of several of the C&C domains used by the group, we were able to\nidentify several victims. This victim list reinforces the interests shown by the Crouching Yeti actor in\n\nstrategic targets, but also shows the interest of the group in many other not-so-obvious institutions.\nWe believe they might be collateral victims, but it might also be fair to redefine the Crouching Yeti\nactor not only as a highly targeted one in a very specific area of interest, but a broad surveillance\ncampaign with interests in different sectors.\n\nWe will continue to monitor this threat actor.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "6fc23d14-23a6-4870-8fad-b291b182596f",
            "created_at": "2022-10-25T16:07:18.480113Z",
            "updated_at": "2022-10-25T16:07:18.480113Z",
            "deleted_at": null,
            "name": "ETDA",
            "url": "https://apt.etda.or.th",
            "description": "Threat Group Cards: A Threat Actor Encyclopedia",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08080817/EB-YetiJuly2014-Public.pdf",
        "https://papers.vx-underground.org/papers/ICS SCADA/Havex/Energetic Bear - Crouching Yeti.pdf"
    ],
    "report_names": [
        "EB-YetiJuly2014-Public.pdf",
        "Energetic Bear - Crouching Yeti.pdf"
    ],
    "threat_actors": [
        {
            "id": "89542ecf-606b-4913-87c5-21512f9b82b9",
            "created_at": "2022-10-25T15:50:23.681673Z",
            "updated_at": "2025-03-27T02:00:55.522794Z",
            "deleted_at": null,
            "main_name": "RTM",
            "aliases": [
                "RTM"
            ],
            "source_name": "MITRE:RTM",
            "tools": [
                "RTM"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "6a99bf81-8ed4-4233-82e2-575e4f9bf282",
            "created_at": "2022-10-25T16:07:24.137248Z",
            "updated_at": "2025-03-27T02:02:10.119569Z",
            "deleted_at": null,
            "main_name": "RTM",
            "aliases": [],
            "source_name": "ETDA:RTM",
            "tools": [
                "AtNow",
                "RTM",
                "RTM Banker",
                "Redaman"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "5cbf6c32-482d-4cd2-9d11-0d9311acdc28",
            "created_at": "2023-01-06T13:46:38.39927Z",
            "updated_at": "2025-03-27T02:00:02.823829Z",
            "deleted_at": null,
            "main_name": "ENERGETIC BEAR",
            "aliases": [
                "DYMALLOY",
                "TG-4192",
                "Crouching Yeti",
                "Group 24",
                "Havex",
                "IRON LIBERTY",
                "Blue Kraken",
                "ALLANITE",
                "Koala Team",
                "G0035",
                "ATK6",
                "ITG15",
                "Ghost Blizzard",
                "BERSERK BEAR"
            ],
            "source_name": "MISPGALAXY:ENERGETIC BEAR",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "649b5b3e-b16e-44db-91bc-ae80b825050e",
            "created_at": "2022-10-25T15:50:23.290412Z",
            "updated_at": "2025-03-27T02:00:55.431037Z",
            "deleted_at": null,
            "main_name": "Dragonfly",
            "aliases": [
                "TEMP.Isotope",
                "DYMALLOY",
                "Berserk Bear",
                "TG-4192",
                "Crouching Yeti",
                "IRON LIBERTY",
                "Energetic Bear",
                "Ghost Blizzard"
            ],
            "source_name": "MITRE:Dragonfly",
            "tools": [
                "MCMD",
                "Impacket",
                "CrackMapExec",
                "Backdoor.Oldrea",
                "Mimikatz",
                "PsExec",
                "Trojan.Karagany",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "1a76ed30-4daf-4817-98ae-87c667364464",
            "created_at": "2022-10-25T16:47:55.891029Z",
            "updated_at": "2025-03-27T02:05:17.408867Z",
            "deleted_at": null,
            "main_name": "IRON LIBERTY",
            "aliases": [
                "ATK6 ",
                "BROMINE ",
                "CASTLE ",
                "Crouching Yeti ",
                "DYMALLOY ",
                "Dragonfly ",
                "Energetic Bear / Berserk Bear ",
                "Ghost Blizzard ",
                "TEMP.Isotope ",
                "TG-4192 ",
                "ALLANITE "
            ],
            "source_name": "Secureworks:IRON LIBERTY",
            "tools": [
                " Ddex Loader",
                " Havex",
                " Karagany",
                " Loek",
                " MCMD",
                " Sysmain",
                " xfrost",
                "ClientX"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "1d8dd2ca-5592-482e-b89d-6a7e1a49f4f6",
            "created_at": "2023-01-06T13:46:38.408359Z",
            "updated_at": "2025-03-27T02:00:02.826069Z",
            "deleted_at": null,
            "main_name": "TeamSpy Crew",
            "aliases": [
                "TeamSpy",
                "Team Bear",
                "Anger Bear",
                "IRON LYRIC"
            ],
            "source_name": "MISPGALAXY:TeamSpy Crew",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "2f07a03f-eb1f-47c8-a8e9-a1a00f2ec253",
            "created_at": "2022-10-25T16:07:24.277669Z",
            "updated_at": "2025-03-27T02:02:10.157972Z",
            "deleted_at": null,
            "main_name": "TA428",
            "aliases": [
                "Operation LagTime IT",
                "Operation StealthyTrident",
                "ThunderCats"
            ],
            "source_name": "ETDA:TA428",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "Agent.dhwf",
                "Albaniiutas",
                "BlueTraveller",
                "Chymine",
                "Cotx RAT",
                "CoughingDown",
                "Darkmoon",
                "Destroy RAT",
                "DestroyRAT",
                "Gen:Trojan.Heur.PT",
                "Kaba",
                "Korplug",
                "LuckyBack",
                "PhantomNet",
                "PlugX",
                "Poison Ivy",
                "RedDelta",
                "RoyalRoad",
                "SManager",
                "SPIVY",
                "Sogu",
                "TIGERPLUG",
                "TManger",
                "TVT",
                "Thoper",
                "Xamtrav",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "3a0be4ff-9074-4efd-98e4-47c6a62b14ad",
            "created_at": "2022-10-25T16:07:23.590051Z",
            "updated_at": "2025-03-27T02:02:09.878211Z",
            "deleted_at": null,
            "main_name": "Energetic Bear",
            "aliases": [
                "ATK 6",
                "Blue Kraken",
                "Crouching Yeti",
                "Dragonfly",
                "Electrum",
                "Energetic Bear",
                "Ghost Blizzard",
                "Group 24",
                "ITG15",
                "Iron Liberty",
                "Koala Team",
                "TG-4192"
            ],
            "source_name": "ETDA:Energetic Bear",
            "tools": [
                "Backdoor.Oldrea",
                "CRASHOVERRIDE",
                "Commix",
                "CrackMapExec",
                "CrashOverride",
                "Dirsearch",
                "Dorshel",
                "Fertger",
                "Fuerboos",
                "Goodor",
                "Havex",
                "Havex RAT",
                "Hello EK",
                "Heriplor",
                "Impacket",
                "Industroyer",
                "Karagany",
                "Karagny",
                "LightsOut 2.0",
                "LightsOut EK",
                "Listrix",
                "Oldrea",
                "PEACEPIPE",
                "PHPMailer",
                "PsExec",
                "SMBTrap",
                "Subbrute",
                "Sublist3r",
                "Sysmain",
                "Trojan.Karagany",
                "WSO",
                "Webshell by Orb",
                "Win32/Industroyer",
                "Wpscan",
                "nmap",
                "sqlmap",
                "xFrost"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "578f8e62-2bb4-4ce4-a8b7-6c868fa29724",
            "created_at": "2022-10-25T16:07:24.344358Z",
            "updated_at": "2025-03-27T02:02:10.182282Z",
            "deleted_at": null,
            "main_name": "Tropic Trooper",
            "aliases": [
                "APT 23",
                "Bronze Hobart",
                "Earth Centaur",
                "KeyBoy",
                "Operation Tropic Trooper",
                "Pirate Panda",
                "Tropic Trooper"
            ],
            "source_name": "ETDA:Tropic Trooper",
            "tools": [
                "8.t Dropper",
                "8.t RTF exploit builder",
                "8t_dropper",
                "ByPassGodzilla",
                "CHINACHOPPER",
                "CREDRIVER",
                "China Chopper",
                "Chymine",
                "Darkmoon",
                "Gen:Trojan.Heur.PT",
                "KeyBoy",
                "Neo-reGeorg",
                "PCShare",
                "POISONPLUG.SHADOW",
                "Poison Ivy",
                "RoyalRoad",
                "SPIVY",
                "ShadowPad Winnti",
                "SinoChopper",
                "Swor",
                "TSSL",
                "USBferry",
                "W32/Seeav",
                "Winsloader",
                "XShellGhost",
                "Yahoyah",
                "fscan",
                "pivy",
                "poisonivy"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716500,
    "ts_updated_at": 1743041499,
    "ts_creation_date": 1406835788,
    "ts_modification_date": 1406836185,
    "files": {
        "pdf": "https://archive.orkl.eu/99b6b984988581cae681f65b92198ed77609bd11.pdf",
        "text": "https://archive.orkl.eu/99b6b984988581cae681f65b92198ed77609bd11.txt",
        "img": "https://archive.orkl.eu/99b6b984988581cae681f65b92198ed77609bd11.jpg"
    }
}