{
    "id": "b2d5af78-3468-40f8-8222-d48290cf3a59",
    "created_at": "2023-01-12T15:08:29.959146Z",
    "updated_at": "2025-03-27T02:06:03.372502Z",
    "deleted_at": null,
    "sha1_hash": "323f7af1f05d6140f76c8a5481f16ef637415ab5",
    "title": "2022-09-28 - Threat Spotlight- Continuing attacks on Atlassian Confluence zero day",
    "authors": "",
    "file_creation_date": "2022-10-02T12:26:45Z",
    "file_modification_date": "2022-10-02T12:26:45Z",
    "file_size": 1308793,
    "plain_text": "# Threat Spotlight: Continuing attacks on Atlassian Confluence zero day\n\n**[blog.barracuda.com/2022/09/28/threat-spotlight-continuing-attacks-on-atlassian-confluence-zero-day/](https://blog.barracuda.com/2022/09/28/threat-spotlight-continuing-attacks-on-atlassian-confluence-zero-day/)**\n\nSeptember 28, 2022\n\nOn June 2, 2022, Volexity performed a coordinated disclosure of an under-exploit zero day in\n[Atlassian Confluence, CVE-2022-26134. Since the original disclosure and subsequent](https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/)\npublication of various proofs of concept, Barracuda researchers have discovered a large\nnumber of attempts to exploit this vulnerability. The exploit attempts range from benign\nreconnaissance to some relatively complex attempts to infect systems with DDoS botnet\nmalware and cryptominers.\n\n[When we initially reported on this threat in June, Barracuda researchers were seeing a](https://blog.barracuda.com/2022/06/22/threat-spotlight-attempts-to-exploit-atlassian-confluence-zero-day/)\nsteady flow of attacks attempting to exploit this vulnerability, with several significant spikes.\nOur researchers have continued to monitor these attacks, and this pattern has continued,\nwith the overall volume dropping only slightly in August. Attackers clearly have not given up\non trying to exploit this vulnerability.\n\n\n-----\n\n[In that initial Threat Spotlight, we looked at some of the payloads being delivered and the](https://blog.barracuda.com/2022/06/22/threat-spotlight-attempts-to-exploit-atlassian-confluence-zero-day/)\nsources of the attacks. In this follow-up Threat Spotlight, we look in more detail at a few of\nthe payloads being delivered by malicious actors attempting to exploit CVE-2022-26134.\n\n## Payload examples\n\n[First, let’s look at one attempt to deliver the Gafgyt DDoS](https://www.barracuda.com/glossary/ddos) [botnet](https://www.barracuda.com/glossary/botnet) [malware.](https://www.barracuda.com/glossary/malware)\n\n### Example 1: DDoS botnet malware\n\n\n-----\n\nThis is the host showing all the Gafgyt DDoS botnet\n\nmalware for different types of operating systems and architectures.\nHere is the payload as it was delivered:\n\nIt decodes to:\n\n\n-----\n\nThe IP address in this payload delivers a shell script that is executed and then deleted.\nNavigating to the IP address, one can find an open directory with a number of executables,\neach seemingly for a different type of operating system/architecture.\n\nThis screenshot shows the shell script delivered in the payload.\nOpening up the shell script, we can see that it downloads these executables and then\nexecutes them on the system where it has been run.\n\nThe attacker is essentially attempting to create a botnet member on any system that can be\ninfected. Depending on the OS/architecture of the infected system, one of these executables\nwill run, and the system will end up becoming part of the botnet. Gafgyt has been seen to do\nthis in the past with other vulnerabilities, and this continues now with this vulnerability as\nwell.\n\nThe IP in question has been serving these malware downloads for some time now — and\nhas been documented on abuse.ch’s URLhaus database. From the looks of it, the earliest\nsubmissions were from late May this year, and the host had not been taken down at the time\nof writing.\n\n\n-----\n\nThis is\n\nthe URLhaus listing for the Gafgyt botnet malware.\n\n### Example 2: Monero cryptominer\n\nMoving on to cryptominer payloads, let’s start by looking at a Monero cryptominer that is\nattempting to infect a Windows-based installation:\n\nThe payload uses PowerShell to execute a Base64 encoded script that decodes to:\n\n\n-----\n\nWe downloaded the file (kill.bat) and a screenshot is shown below:\n\nThis is a PowerShell-based script that starts by disabling Windows Defender Realtime\nMonitoring and then goes on to kill a number of services. Once these services are removed,\nit checks if there is already a Monero miner instance running. If there is, the script kills the\nexisting instance to maximize resources on the infected host. Once that is done, it goes on to\ndownload a file named “mad.bat.” A truncated screenshot is shown below:\n\n\n-----\n\nMad.bat installs the actual miner and the additional software required for this – including the\n7zip to unzip the mining software.\n\n### Example 3: Double-encoded cryptominer\n\nAnother interesting cryptominer payload is the following example, where the payload has\nbeen double encoded:\n\nIt decodes to:\n\n\n-----\n\nThen decodes further to:\n\nWhile the actual payload has been taken down and is no longer available for analysis,\nlooking at URLhaus and VirusTotal, it seems to be a cryptominer that specifically targets\nLinux systems. From other discussions online, it looks like the “?load” argument varies from\nattack to attack — some other variants are “?c4k” and “?c5k”. The arguments seem to be\n[used internally by the actual binary and used to connect with specific mining services.](https://www.lacework.com/blog/8220-gangs-recent-use-of-custom-miner-and-botnet/)\n\nThe same IP also served a Windows variant as shown in the following payload:\n\nIt decodes to:\n\nAgain, the payload is no longer available, so the following is a bit of speculation based on\nwhat we’ve seen from the IP address and the filename. It is possibly similar to the Linux\nvariant and may download the actual cryptominer. The “lol” in the filename may refer to the\n“living off the land” attack technique, where the malware uses existing tools available on the\noperating system to perform its actions, reducing the chances of being detected as malware\nby any antivirus that is running on the operating system.\n\nIn our next and last part of this Threat Spotlight, we’ll go deeper into another cryptominer that\nwas found in exploit attempts for this vulnerability. It is a bit more interesting, and we were\nable to grab the full payload for a detailed analysis.\n\n### Protect your apps with one simple platform\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-09-28 - Threat Spotlight- Continuing attacks on Atlassian Confluence zero day.pdf"
    ],
    "report_names": [
        "2022-09-28 - Threat Spotlight- Continuing attacks on Atlassian Confluence zero day.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536109,
    "ts_updated_at": 1743041163,
    "ts_creation_date": 1664713605,
    "ts_modification_date": 1664713605,
    "files": {
        "pdf": "https://archive.orkl.eu/323f7af1f05d6140f76c8a5481f16ef637415ab5.pdf",
        "text": "https://archive.orkl.eu/323f7af1f05d6140f76c8a5481f16ef637415ab5.txt",
        "img": "https://archive.orkl.eu/323f7af1f05d6140f76c8a5481f16ef637415ab5.jpg"
    }
}