{
    "id": "b2e626b1-9009-4ef3-bd4c-82c44b2e3420",
    "created_at": "2023-01-12T15:05:46.442577Z",
    "updated_at": "2025-03-27T02:05:34.34502Z",
    "deleted_at": null,
    "sha1_hash": "09d8f6aa48884cfddc52f183a25e5f382819b071",
    "title": "2021-12-14 - Cuba Ransomware Analysis",
    "authors": "",
    "file_creation_date": "2022-05-28T23:35:32Z",
    "file_modification_date": "2022-05-28T23:35:32Z",
    "file_size": 1024778,
    "plain_text": "# Cuba Ransomware Analysis\n\n**lab52.io/blog/cuba-ransomware-analysis/**\n\n[Due to the recent warning published by the FBI about Cuba ransomware (original FBI](https://threatpost.com/cuba-ransomware-gang-44m-payouts/176790/)\nwarning no longer available online for unknown reasons), from Lab52 we decided to publish\nsome information about this ransomware family. Despite the fact that the ransomware has\nbeen named Cuba, there is no clear evidence linking the country to the implementation or\nperpetration of this type of attacks.\n\nNonetheless, the geopolitical analysis has revealed a few details of strategic interest. Firstly,\n[the fact that most of the countries attacked, according to a McAfee report, correspond to](https://www.mcafee.com/enterprise/en-us/assets/reports/rp-cuba-ransomware.pdf)\nthose located in Latin America, North America and Europe. Of these, the most targeted\nwere: Spain, Colombia and Germany. However, when looking at the possible link between\nthe countries attacked and the sectors compromised, it has not been possible to identify a\nclear interest in the attack, since although Colombia is a US ally in Latin America and a\nNATO observer state, and Spain is a member of the European Union and NATO with a good\ngeostrategic position, none of them stand out among the critical sectors that have been\nattacked.\n\nSecondly, it has also been observed that the profile of the countries attacked is common to\napt groups that share certain ideological lines, which may be contrary to those of the\ncountries that have been targeted. However, this has not yet allowed us to identify the link\nbetween this ransomware and any specific country or APT group.\n\nFor this post, we have analyzed a recent public sample, which has a compiler timestamp\ndated from August 23rd, 2021:\n\n936119bc1811aeef01299a0150141787865a0dbe2667288f018ad24db5a7bc27\n\nIn this sample, we have observed some changes from the version described by McAfee in\nApril 2021, which is the only and most recent published analysis about this ransomware\nfamily.\n\nFirstly, the process retrieves the Input Locale identifiers (formerly called Keyboard Layout\nHandles) corresponding to the current set of input languages in the infected system. In case\nof finding the Russian language identifier (0x19) among the obtained list, the process\nterminates. Otherwise, it starts with its main activity.\n\n\n-----\n\nMain function of the Cuba Ransomware sample\nSince the program accepts one argument, the main activity will start by parsing the given\nargument, looking for either “network”, some IP address, “local” or a specific path to encrypt.\nThus, the usage of this sample by an operator would be as follows:\n\ncuba.exe [ network | [IP_addr] | local | [specific_path] ]\n\n\n-----\n\nPrincipal function of Cuba Ransomware\n\n\n-----\n\nFlow diagram of the Cuba Ransomware sample\nAccording to this, we could distinguish between two network modes and two local modes.\nThe network mode triggered by the “network” argument will call the windows API\nGetIPNetTable in order to obtain the ARP table and call NetShareEnum using each IP as the\nserverName parameter for this second API call. In the case of specifying an IP address, it\nwill just enumerate the shares of that specific address.\n\n\n-----\n\nPseudocode of the “network” argument function calls\nThe default (no argument given) or “local” argument mode will enumerate the volumes by\ntheir Device IDs in the system. If a path is specified as the argument, the ransomware will\nonly encrypt that specified path.\n\n\n-----\n\nPseudocode of the default “local” mode\nDepending on the case there will be between 2 and 4 threads encrypting the information,\nwhich will be created by the same function, for which a different target will be given also\ndepending on the initial argument.\n\nBefore starting the encryption there are two different cases where the binary will first\nterminate some harcoded processes or services. As shown in the elaborated flow diagram,\nthis will happen only if no argument or “local” is given, or if the specified IP address is\n127.0.0.1.\n\n\n-----\n\nElevation of privileges prior to termination of processes\n\nHardcoded services and processes names to terminate, along with the function calls to do so\nJust like the previous versions, this sample will use SeDebugPrivilege in order to obtain the\nnecessary rights to terminate processes and services, in this sample they only added one\nnew process to terminate: the Store Worker Process (Microsoft.Exchange.Store.Worker.exe),\nresponsible for executing RPC operations for mailboxes on a database.\n\nUnlike the majority of ransomware families, two different instances of the same process\ncould be executed at the same time, which could cause interferences between each other.\nHowever, to avoid double cyphering, the RANSOMWARE still adds to the encrypted file a\n\n\n-----\n\n240 bytes header, with nothing but the string FIDEL.CA and four extra values in the\nconsecutive words. Before encypting a file, the presence of this “file signature” will be\nchecked.\n\nEncrypted file header\n\nEncryption header check\nIn the version analyzed by McAfee, they found that their sample could take a different list of\narguments such as /min, /max, /dm, /net, or /scan. However, the sample we analyzed only\naccepts one of the arguments described above. This means that for this version THERE IS\nNO POSSIBILITY THAT the ransomware operator CAN specify a maximum or minimunm file\nsize to encrypt. Though, large files will only get encrypted their first MB for EVERY 9MB.\n\n\n-----\n\nEnd of first Megabyte from encryption file\n\nBeginning of 9th Megabyte of encrypted file\nMost likely in order to avoid system failures, the ransomware will not encrypt files with\nextensions .exe, .dll, .sys, .ini, .lnk, .cuba, and it will ignore paths containing “\\windows\\”.\n\n\n-----\n\nCypher function checking files and routes to skip, with snippets of the called functions\nOnce the threads have finished the cyphering task, the function to delete itself from disk will\nbe called, INDEPENDENTLY FROM the argument provided, unlike the McAfee sample,\nwhere they affirmed that this function would be called when giving the “/dm” argument. For\nthis, the sample will call the Windows API CreateProcessW with “\\\\system32\\\\cmd.exe” as\nthe ApplicationName and ” /c \\del [exe_path] >> NULL ” as command line arguments.\n\nThe complete list of stopped processes and services is shown in the following tables:\n\nMySQL MSExchangePOP3BE\n\nMySQL80 MSExchangePop3\n\nSQLSERVERAGENT MSExchangeNotificationsBroker\n\nMSSQLSERVER MSExchangeMailboxReplication\n\nSQLWriter MSExchangeMailboxAssistants\n\nSQLTELEMETRY MSExchangeIS\n\nMSDTC MSExchangeIMAP4BE\n\nSQLBrowser MSExchangeImap4\n\nvmcompute MSExchangeHMRecovery\n\nvmms MSExchangeHM\n\nMSExchangeUMCR MSExchangeFrontEndTransport\n\nMSExchangeUM MSExchangeFastSearch\n\nMSExchangeTransportLogSearch MSExchangeEdgeSync\n\n\n-----\n\nMSExchangeTransport MSExchangeDiagnostics\n\nMSExchangeThrottling MSExchangeDelivery\n\nMSExchangeSubmission MSExchangeDagMgmt\n\nMSExchangeServiceHost MSExchangeCompliance\n\nMSExchangeRPC MSExchangeAntispamUpdate\n\nMSExchangeRepl\n\nStopped services\n\nsqlagent.exe sqlbrowser.exe\n\nsqlservr.exe vmwp.exe\n\nsqlwriter.exe outlook.exe\n\nsqlceip.exe vmsp.exe\n\nmsdtc.exe Microsoft.Exchange.Store.Worker.exe\n\nTertminated processes\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-12-14 - Cuba Ransomware Analysis.pdf"
    ],
    "report_names": [
        "2021-12-14 - Cuba Ransomware Analysis.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535946,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1653780932,
    "ts_modification_date": 1653780932,
    "files": {
        "pdf": "https://archive.orkl.eu/09d8f6aa48884cfddc52f183a25e5f382819b071.pdf",
        "text": "https://archive.orkl.eu/09d8f6aa48884cfddc52f183a25e5f382819b071.txt",
        "img": "https://archive.orkl.eu/09d8f6aa48884cfddc52f183a25e5f382819b071.jpg"
    }
}