{
    "id": "b318ce71-4bad-47ec-8225-dfc505e1ebae",
    "created_at": "2022-10-25T16:48:17.085379Z",
    "updated_at": "2025-03-27T02:09:17.9873Z",
    "deleted_at": null,
    "sha1_hash": "af7e17bb23e07f818c23dc3f73076462f310bd51",
    "title": "",
    "authors": "",
    "file_creation_date": "2017-12-08T18:49:36Z",
    "file_modification_date": "0001-01-01T00:00:00Z",
    "file_size": 192979,
    "plain_text": "# Tactics, Techniques, and Procedures\n\n_Dec 8, 2017_\n\nThis report maps Cobalt Strike's actions to MITRE's Adversarial Tactics, Techniques,\nand Common Knowledge (ATT&CK) matrix.\n\n\n-----\n\n## Command-Line Interface\n\nCommand-line interfaces provide a way of interacting with computer systems and is\na common feature across many types of operating system platforms. One example\ncommand-line interface on Windows systems is cmd, which can be used to perform a\nnumber of tasks including execution of other software. Command-line interfaces can\nbe interacted with locally or remotely via a remote desktop application, reverse shell\nsession, etc. Commands that are executed run with the current permission level of the\ncommand-line interface process unless the command includes process invocation that\nchanges permissions context for that execution (e.g. Scheduled Task).\n\nAdversaries may use command-line interfaces to interact with systems and execute\nother software during the course of an operation.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:13 JOSHDEV 356 run: netstat -na | findstr \"EST\"\n12/08 18:17 ubuntu run: ls -alh\n12/08 18:17 ubuntu run: ls -alh\n12/08 18:17 ubuntu run: ls -alh /tmp\n12/08 18:17 ubuntu run: tar zcvf /tmp/e.tgz /repository\n12/08 18:17 ubuntu run: rm /tmp/e.tgz\n12/08 18:17 ubuntu run: ls -alh /tmp\n\n### Mitigation\n\nAudit and/or block command-line interpreters by using whitelisting tools, like AppLocker,\nor Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nCommand-line interface activities can be captured through proper logging of process\nexecution with command-line arguments. This information can be useful in gaining\nadditional insight to adversaries' actions through how they use native processes or\ncustom tools.\n\n### Reference\n\n[• Tactic: T1059](https://attack.mitre.org/wiki/Technique/T1059)\n\nP 2\n\n\n-----\n\n## Credential Dumping\n\nCredential dumping is the process of obtaining account login and password information\nfrom the operating system and software. Credentials can be used to perform Lateral\nMovement and access restricted information.\n\nTools may dump credentials in many different ways: extracting credential hashes for\noffline cracking, extracting plaintext passwords, and extracting Kerberos tickets, among\nothers. Examples of credential dumpers include pwdump7, Windows Credential Editor,\nMimikatz, and gsecdump. These tools are in use by both professional security testers\nand adversaries.\n\nPlaintext passwords can be obtained using tools such as Mimikatz to extract passwords\nstored by the Local Security Authority (LSA). If smart cards are used to authenticate to a\ndomain using a personal identification number (PIN), then that PIN is also cached as a\nresult and may be dumped.\n\nDCSync is a variation on credential dumping which can be used to acquire sensitive\ninformation from a domain controller. The action works by simulating a domain\ncontroller replication process from a remote domain controller, which may contain\nvarious pieces of information included in Active Directory such as passwords, historical\nhashes, and current hashes of potentially useful accounts, such as the KRBTGT\naccount NTLM hash. Any members of the Administrators, Domain Admins, Enterprise\nAdmin groups or computer accounts on the domain controller are able to run DCSync\nto pull password data. The hashes can then in turn be used to create a Golden Ticket\nfor use in Pass the Ticket. DCSync functionality has been included in the \"lsadump\"\nmodule in Mimikatz.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:57 WS2 1872 dump hashes\n12/08 17:57 WS2 1872 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:05 FILESERVER 1664 dump hashes\n12/08 18:05 FILESERVER 1664 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:07 DC 1204 dump hashes\n12/08 18:07 DC 1204 run mimikatz's sekurlsa::logonpasswords\ncommand\n\n### Mitigation\n\nMonitor/harden access to LSASS and SAM table with tools that allow process\nwhitelisting. Limit credential overlap across systems to prevent lateral movement\n\nP 3\n\n\n-----\n\nopportunities using Valid Accounts if passwords and hashes are obtained. Ensure that\nlocal administrator accounts have complex, unique passwords across all systems on the\nnetwork. Do not put user or admin domain accounts in the local administrator groups\nacross systems unless they are tightly controlled, as this is often equivalent to having\na local administrator account with the same password on all systems. On Windows 8.1\nand Windows Server 2012 R2, enable Protected Process Light for LSA.\n\nIdentify and block potentially malicious software that may be used to dump credentials\nby using whitelisting tools, like AppLocker, or Software Restriction Policies where\nappropriate.\n\nWith Windows 10, Microsoft implemented new protections called Credential Guard\nto protect the LSA secrets that can be used to obtain credentials through forms of\ncredential dumping. It is not configured by default and has hardware and firmware\nsystem requirements. It also does not protect against all forms of credential dumping.\n\n### Detection Methods\n\nCommon credential dumpers such as Mimikatz access the LSA Subsystem Service\n(LSASS) process by opening the process, locating the LSA secrets key, and decrypting\nthe sections in memory where credential details are stored. Credential dumpers may\nalso use methods for reflective DLL Injection to reduce potential indicators of malicious\nactivity.\n\nNTLM hash dumpers open the Security Accounts Manager (SAM) on the local file\nsystem (%SystemRoot%/system32/config/SAM) or create a dump of the Registry SAM\nkey to access stored account password hashes. Some hash dumpers will open the\nlocal file system as a device and parse to the SAM table to avoid file access defenses.\nOthers will make an in-memory copy of the SAM table before reading hashes. Detection\nof compromised Valid Accounts in-use by adversaries may help as well.\n\nOn Windows 8.1 and Windows Server 2012 R2, monitor Windows Logs for LSASS.exe\ncreation to verify thatLSASS started as a protected process.\n\nMonitor processes and command-line arguments for program execution that may be\nindicative of credential dumping. Remote access tools may contain built-in features\nor incorporate existing tools like Mimikatz. PowerShell scripts also exist that contain\ncredential dumping functionality, such as PowerSploit's Invoke-Mimikatz module, which\nmay require additional logging features to be configured in the operating system to\ncollect necessary information for analysis.\n\n### Reference\n\n[• Tactic: T1003](https://attack.mitre.org/wiki/Technique/T1003)\n\nP 4\n\n\n-----\n\n## DLL Injection\n\nDLL injection is used to run code in the context of another process by causing the other\nprocess to load and execute code. Running code in the context of another process\nprovides adversaries many benefits, such as access to the process's memory and\npermissions. It also allows adversaries to mask their actions under a legitimate process.\nA more sophisticated kind of DLL injection, reflective DLL injection, loads code without\ncalling the normal Windows API calls, potentially bypassing DLL load monitoring.\nNumerous methods of DLL injection exist on Windows, including modifying the Registry,\ncreating remote threads, Windows hooking APIs, and DLL pre-loading.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:54 WS2 3400 log keystrokes in 2444 (x86)\n12/08 17:57 WS2 1872 dump hashes\n12/08 17:57 WS2 1872 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:05 FILESERVER 1664 dump hashes\n12/08 18:05 FILESERVER 1664 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:07 DC 1204 dump hashes\n12/08 18:07 DC 1204 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:10 JOSHDEV 356 log keystrokes in 1220 (x86)\n12/08 18:10 JOSHDEV 356 take a screenshot in 1220/x86\n12/08 18:14 JOSHDEV 356 inject windows/beacon_smb/bind_pipe\n(127.0.0.1:9756) into 1220 (x86)\n\n### Mitigation\n\nMitigating specific API calls will likely have unintended side effects, such as preventing\nlegitimate software from operating properly. Efforts should be focused on preventing\nadversary tools from running earlier in the chain of activity and on identification of\nsubsequent malicious behavior.\n\nIdentify or block potentially malicious software that may contain DLL injection\nfunctionality by using whitelisting tools, like AppLocker, or Software Restriction Policies\nwhere appropriate.\n\n### Detection Methods\n\nMonitoring API calls indicative of the various types of code injection may generate a\nsignificant amount of data and may not be directly useful for defense unless collected\nunder specific circumstances for known bad sequences of calls, since benign use of API\n\nP 5\n\n\n-----\n\nfunctions may be common and difficult to distinguish from malicious behavior. API calls\nsuch as CreateRemoteThread and those that can be used to modify memory within\nanother process, such as WriteProcessMemory, may be used for this technique.\n\nMonitor processes and command-line arguments for actions that could be done before\nor after code injection has occurred and correlate the information with related event\ninformation. Code injection may also be performed using PowerShell with tools such\nas PowerSploit, so additional PowerShell monitoring may be required to cover known\nimplementations of this behavior.\n\n### Reference\n\n[• Tactic: T1055](https://attack.mitre.org/wiki/Technique/T1055)\n\nP 6\n\n\n-----\n\n## Data from Local System\n\nSensitive data can be collected from local system sources, such as the file system or\ndatabases of information residing on the system prior to Exfiltration.\n\nAdversaries will often search the file system on computers they have compromised\nto find files of interest. They may do this using a Command-Line Interface, such as\ncmd, which has functionality to interact with the file system to gather information. Some\nadversaries may also use Automated Collection on the local system.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:17 ubuntu download /tmp/e.tgz\n\n### Mitigation\n\nIdentify unnecessary system utilities or potentially malicious software that may be used\nto collect data from the local system, and audit and/or block them by using whitelisting\ntools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nMonitor processes and command-line arguments for actions that could be taken to\ncollect files from a system. Remote access tools with built-in features may interact\ndirectly with the Windows API to gather data. Data may also be acquired through\nWindows system management tools such as Windows Management Instrumentation\nand PowerShell.\n\n### Reference\n\n[• Tactic: T1005](https://attack.mitre.org/wiki/Technique/T1005)\n\nP 7\n\n\n-----\n\n## Exploitation of Vulnerability\n\nExploitation of a software vulnerability occurs when an adversary takes advantage of\na programming error in a program, service, or within the operating system software or\nkernel itself to execute adversary-controlled code. Exploiting software vulnerabilities\nmay allow adversaries to run a command or binary on a remote system for lateral\nmovement, escalate a current process to a higher privilege level, or bypass security\nmechanisms. Exploits may also allow an adversary access to privileged accounts and\ncredentials. One example of this is MS14-068, which can be used to forge Kerberos\ntickets using domain user permissions.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:57 WS2 3400 run windows/beacon_smb/bind_pipe\n(127.0.0.1:9756) via ms14-058\n\n### Mitigation\n\nUpdate software regularly by employing patch management for internal enterprise\nendpoints and servers. Develop a robust cyber threat intelligence capability to\ndetermine what types and levels of threat may use software exploits and 0-days against\na particular organization. Make it difficult for adversaries to advance their operation\nthrough exploitation of undiscovered or unpatched vulnerabilities by using sandboxing,\nvirtualization, and exploit prevention tools such as the Microsoft Enhanced Mitigation\nExperience Toolkit.\n\n### Detection Methods\n\nSoftware exploits may not always succeed or may cause the exploited process to\nbecome unstable or crash. Software and operating system crash reports may contain\nuseful contextual information about attempted exploits that correlate with other\nmalicious activity. Exploited processes may exhibit behavior that is unusual for the\nspecific process, such as spawning additional processes or reading and writing to files.\n\n### Reference\n\n[• Tactic: T1068](https://attack.mitre.org/wiki/Technique/T1068)\n\nP 8\n\n\n-----\n\n## Input Capture\n\nAdversaries can use methods of capturing user input for obtaining credentials for\nValid Accounts and information Collection that include keylogging and user input field\ninterception.\n\nKeylogging is the most prevalent type of input capture, with many different ways of\nintercepting keystrokes, but other methods exist to target information for specific\npurposes, such as performing a UAC prompt or wrapping the Windows default\ncredential provider.\n\nKeylogging is likely to be used to acquire credentials for new access opportunities when\nCredential Dumping efforts are not effective, and may require an adversary to remain\npassive on a system for a period of time before an opportunity arises.\n\nAdversaries may also install code on externally facing portals, such as a VPN login\npage, to capture and transmit credentials of users who attempt to log into the service.\nThis variation on input capture may be conducted post-compromise using legitimate\nadministrative access as a backup measure to maintain network access through\nExternal Remote Services and Valid Accounts or as part of the initial compromise by\nexploitation of the externally facing web service.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:54 WS2 3400 log keystrokes in 2444 (x86)\n12/08 18:10 JOSHDEV 356 log keystrokes in 1220 (x86)\n\n### Mitigation\n\nIdentify and block potentially malicious software that may be used to acquire credentials\nor information from the user by using whitelisting tools, like AppLocker, or Software\nRestriction Policies where appropriate.\n\nIn cases where this behavior is difficult to detect or mitigate, efforts can be made to\nlessen some of the impact that might result from an adversary acquiring credential\ninformation. It is also good practice to follow mitigation recommendations for adversary\nuse of Valid Accounts.\n\n### Detection Methods\n\nKeyloggers may take many forms, possibly involving modification to the Registry and\ninstallation of a driver, setting a hook, or polling to intercept keystrokes. Commonly used\nAPI calls include SetWindowsHook, GetKeyState, and GetAsynceyState. Monitor the\nRegistry and file system for such changes and detect driver installs, as well as looking\nfor common keylogging API calls. API calls alone are not an indicator of keylogging, but\n\nP 9\n\n\n-----\n\nmay provide behavioral data that is useful when combined with other information such\nas new files written to disk and unusual processes.\n\nMonitor the Registry for the addition of a Custom Credential Provider. Detection of\ncompromised Valid Accounts in use by adversaries may help to catch the result of user\ninput interception if new techniques are used.\n\n### Reference\n\n[• Tactic: T1056](https://attack.mitre.org/wiki/Technique/T1056)\n\nP 10\n\n\n-----\n\n## Network Service Scanning\n\nAdversaries may attempt to get a listing of services running on remote hosts, including\nthose that may be vulnerable to remote software exploitation. Methods to acquire this\ninformation include port scans and vulnerability scans using tools that are brought onto\na system.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:00 WS2 3400 scan ports 1-1024,3389,5000-6000 on\n10.10.10.0-10.10.10.255\n\n### Mitigation\n\nUse network intrusion detection/prevention systems to detect and prevent remote\nservice scans. Ensure that unnecessary ports and services are closed and proper\nnetwork segmentation is followed to protect critical servers and devices.\n\nIdentify unnecessary system utilities or potentially malicious software that may be used\nto acquire information about services running on remote systems, and audit and/or\nblock them by using whitelisting tools, like AppLocker, or Software Restriction Policies\nwhere appropriate.\n\n### Detection Methods\n\nSystem and network discovery techniques normally occur throughout an operation\nas an adversary learns the environment. Data and events should not be viewed in\nisolation, but as part of a chain of behavior that could lead to other activities, such as\nLateral Movement, based on the information obtained.\n\nNormal, benign system and network events from legitimate remote service scanning\nmay be uncommon, depending on the environment and how they are used. Legitimate\nopen port and vulnerability scanning may be conducted within the environment and will\nneed to be deconflicted with any detection capabilities developed. Network intrusion\ndetection systems can also be used to identify scanning activity. Monitor for process\nuse of the networks and inspect intra-network flows to detect port scans.\n\n### Reference\n\n[• Tactic: T1046](https://attack.mitre.org/wiki/Technique/T1046)\n\nP 11\n\n\n-----\n\n## Network Share Discovery\n\nNetworks often contain shared network drives and folders that enable users to access\nfile directories on various systems across a network.\n\n**Windows**\nFile sharing over a Windows network occurs over the SMB protocol.\n\nNet can be used to query a remote system for available shared drives using the net\nview \\\\remotesystem command. It can also be used to query shared drives on the local\nsystem using net share.\n\nAdversaries may look for folders and drives shared on remote systems as a means of\nidentifying sources of information to gather as a precursor for Collection and to identify\npotential systems of interest for Lateral Movement.\n\n**Mac**\nOn Mac, locally mounted shares can be viewed with the df -aH command.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:04 WS2 3400 run net share on fileserver.corp.acme.com\n\n### Mitigation\n\nIdentify unnecessary system utilities or potentially malicious software that may be used\nto acquire network share information, and audit and/or block them by using whitelisting\ntools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nSystem and network discovery techniques normally occur throughout an operation\nas an adversary learns the environment. Data and events should not be viewed in\nisolation, but as part of a chain of behavior that could lead to other activities, such as\nLateral Movement, based on the information obtained.\n\nNormal, benign system and network events related to legitimate remote system\ndiscovery may be uncommon, depending on the environment and how they are used.\nMonitor processes and command-line arguments for actions that could be taken to\ngather system and network information. Remote access tools with built-in features may\ninteract directly with the Windows API to gather information. Information may also be\nacquired through Windows system management tools such as Windows Management\nInstrumentation and PowerShell.\n\n### Reference\n\nP 12\n\n\n-----\n\n[• Tactic: T1135](https://attack.mitre.org/wiki/Technique/T1135)\n\n\nP 13\n\n\n-----\n\n## New Service\n\nWhen operating systems boot up, they can start programs or applications called\nservices that perform background system functions. A service's configuration\ninformation, including the file path to the service's executable, is stored in the Windows\nRegistry.\n\nAdversaries may install a new service that can be configured to execute at startup by\nusing utilities to interact with services or by directly modifying the Registry. The service\nname may be disguised by using a name from a related operating system or benign\nsoftware with Masquerading. Services may be created with administrator privileges but\nare executed under SYSTEM privileges, so an adversary may also use a service to\nescalate privileges from administrator to SYSTEM. Adversaries may also directly start\nservices through Service Execution.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:02 WS2 3400 run windows/beacon_smb/bind_pipe\n(\\\\fileserver.corp.acme.com\\pipe\n\\status_9756) on fileserver.corp.acme.com\nvia Service Control Manager (PSH)\n12/08 18:06 WS2 1872 run windows/beacon_smb/bind_pipe (\\\n\\DC\\pipe\\status_9756) on DC via Service\nControl Manager (PSH)\n12/08 18:08 WS2 1872 run windows/beacon_smb/bind_pipe (\\\n\\MAIL\\pipe\\status_9756) on MAIL via\nService Control Manager (\\\\MAIL\\ADMIN$\n\\c0b6e50.exe)\n\n### Mitigation\n\nLimit privileges of user accounts and remediate Privilege Escalation vectors so only\nauthorized administrators can create new services.\n\nIdentify and block unnecessary system utilities or potentially malicious software that\nmay be used to create services by using whitelisting tools, like AppLocker, or Software\nRestriction Policies where appropriate.\n\n### Detection Methods\n\nMonitor service creation through changes in the Registry and common utilities using\ncommand-line invocation. New, benign services may be created during installation of\nnew software. Data and events should not be viewed in isolation, but as part of a chain\nof behavior that could lead to other activities, such as network connections made for\n\nP 14\n\n\n-----\n\nCommand and Control, learning details about the environment through Discovery, and\nLateral Movement.\n\nTools such as Sysinternals Autoruns may also be used to detect system changes that\ncould be attempts at persistence. Look for changes to services that do not correlate with\nknown software, patch cycles, etc. Suspicious program execution through services may\nshow up as outlier processes that have not been seen before when compared against\nhistorical data.\n\nMonitor processes and command-line arguments for actions that could create services.\nRemote access tools with built-in features may interact directly with the Windows API\nto perform these functions outside of typical system utilities. Services may also be\ncreated through Windows system management tools such as Windows Management\nInstrumentation and PowerShell, so additional logging may need to be configured to\ngather the appropriate data.\n\n### Reference\n\n[• Tactic: T1050](https://attack.mitre.org/wiki/Technique/T1050)\n\nP 15\n\n\n-----\n\n## Pass the Hash\n\nPass the hash (PtH) is a method of authenticating as a user without having access to\nthe user's cleartext password. This method bypasses standard authentication steps that\nrequire a cleartext password, moving directly into the portion of the authentication that\nuses the password hash. In this technique, valid password hashes for the account being\nused are captured using a Credential Access technique. Captured hashes are used\nwith PtH to authenticate as that user. Once authenticated, PtH may be used to perform\nactions on local or remote systems.\n\nWindows 7 and higher with KB2871997 require valid domain user credentials or RID\n500 administrator hashes.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:06 WS2 1872 run mimikatz's sekurlsa::pth /\nuser:Administrator /domain:CORP /\nntlm:83414a69a47afeec7e3a37d05a81dc3b /\nrun:\"cmd.exe /c echo 70f32449cc8 > \\\\.\n\\pipe\\d8e195\" command\n\n### Mitigation\n\nMonitor systems and domain logs for unusual credential logon activity. Prevent access\nto Valid Accounts. Apply patch KB2871997 to Windows 7 and higher systems to limit\nthe default access of accounts in the local administrator group. Limit credential overlap\nacross systems to prevent the damage of credential compromise and reduce the\nadversary's ability to perform Lateral Movement between systems. Ensure that builtin and created local administrator accounts have complex, unique passwords. Do not\nallow a domain user to be in the local administrator group on multiple systems.\n\n### Detection Methods\n\nAudit all logon and credential use events and review for discrepancies. Unusual remote\nlogins that correlate with other suspicious activity (such as writing and executing\nbinaries) may indicate malicious activity. NTLM LogonType 3 authentications that are\nnot associated to a domain login and are not anonymous logins are suspicious.\n\n### Reference\n\n[• Tactic: T1075](https://attack.mitre.org/wiki/Technique/T1075)\n\nP 16\n\n\n-----\n\n## PowerShell\n\nPowerShell is a powerful interactive command-line interface and scripting environment\nincluded in the Windows operating system. Adversaries can use PowerShell to\nperform a number of actions, including discovery of information and execution of code.\nExamples include the Start-Process cmdlet which can be used to run an executable and\nthe Invoke-Command cmdlet which runs a command locally or on a remote computer.\n\nPowerShell may also be used to download and run executables from the Internet, which\ncan be executed from disk or in memory without touching disk.\n\nAdministrator permissions are required to use PowerShell to connect to remote\nsystems.\n\nA number of PowerShell-based offensive testing tools are available, including Empire,\nPowerSploit, and PSAttack.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:55 WS2 3400 import: C:\\Users\\user\\Desktop\\PowerSploitmaster\\Privesc\\PowerUp.ps1\n12/08 17:56 WS2 3400 run: Invoke-AllChecks\n12/08 18:00 WS2 3400 import: C:\\Users\\user\\Desktop\\PowerSploitmaster\\Recon\\PowerView.ps1\n12/08 18:00 WS2 3400 run: Find-LocalAdminAccess\n12/08 18:09 WS2 1872 run windows/beacon_smb/bind_pipe\n(\\\\JOSHDEV\\pipe\\status_9756) on\nJOSHDEV via WMI\n\n### Mitigation\n\nIt may be possible to remove PowerShell from systems when not needed, but a review\nshould be performed to assess the impact to an environment, since it could be in\nuse for many legitimate purposes and administrative functions. When PowerShell is\nnecessary, restrict PowerShell execution policy to administrators and to only execute\nsigned scripts. Be aware that there are methods of bypassing the PowerShell execution\npolicy, depending on environment configuration. Disable/restrict the WinRM Service to\nhelp prevent uses of PowerShell for remote execution.\n\n### Detection Methods\n\nIf proper execution policy is set, adversaries will likely be able to define their own\nexecution policy if they obtain administrator or system access, either through the\nRegistry or at the command line. This change in policy on a system may be a way to\n\nP 17\n\n\n-----\n\ndetect malicious use of PowerShell. If PowerShell is not used in an environment, then\nsimply looking for PowerShell execution may detect malicious activity.\n\nIt is also beneficial to turn on PowerShell logging to gain increased fidelity in what\noccurs during execution. PowerShell 5.0 introduced enhanced logging capabilities, and\nsome of those features have since been added to PowerShell 4.0. Earlier versions of\nPowerShell do not have many logging features. An organization can gather PowerShell\nexecution details in a data analytic platform to supplement it with other data.\n\n### Reference\n\n[• Tactic: T1086](https://attack.mitre.org/wiki/Technique/T1086)\n\nP 18\n\n\n-----\n\n## Process Discovery\n\nAdversaries may attempt to get information about running processes on a system.\nInformation obtained could be used to gain an understanding of common software\nrunning on systems within the network.\n\n**Windows**\nAn example command that would obtain details on processes is \"tasklist\" using the\nTasklist utility.\n\n**Mac and Linux**\nIn Mac and Linux, this is accomplished with the ps command.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:53 WS2 3400 list processes\n12/08 18:05 FILESERVER 1664 list processes\n12/08 18:09 JOSHDEV 356 list processes\n12/08 18:13 JOSHDEV 356 list processes\n\n### Mitigation\n\nIdentify unnecessary system utilities or potentially malicious software that may be\nused to acquire information about processes, and audit and/or block them by using\nwhitelisting tools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nSystem and network discovery techniques normally occur throughout an operation\nas an adversary learns the environment. Data and events should not be viewed in\nisolation, but as part of a chain of behavior that could lead to other activities, such as\nLateral Movement, based on the information obtained.\n\nNormal, benign system and network events that look like process discovery may be\nuncommon, depending on the environment and how they are used. Monitor processes\nand command-line arguments for actions that could be taken to gather system and\nnetwork information. Remote access tools with built-in features may interact directly\nwith the Windows API to gather information. Information may also be acquired through\nWindows system management tools such as Windows Management Instrumentation\nand PowerShell.\n\n### Reference\n\n[• Tactic: T1057](https://attack.mitre.org/wiki/Technique/T1057)\n\nP 19\n\n\n-----\n\n## Process Hollowing\n\nProcess hollowing occurs when a process is created in a suspended state and the\nprocess's memory is replaced with the code of a second program so that the second\nprogram runs instead of the original program. Windows and process monitoring tools\nbelieve the original process is running, whereas the actual program running is different.\n\nProcess hollowing may be used similarly to DLL Injection to evade defenses and\ndetection analysis of malicious process execution by launching adversary-controlled\ncode under the context of a legitimate process.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:53 WS2 3400 take screenshot\n12/08 17:57 WS2 3400 run windows/beacon_smb/bind_pipe\n(127.0.0.1:9756) via ms14-058\n12/08 17:57 WS2 1872 dump hashes\n12/08 17:57 WS2 1872 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:00 WS2 3400 run net computers\n12/08 18:00 WS2 3400 scan ports 1-1024,3389,5000-6000 on\n10.10.10.0-10.10.10.255\n12/08 18:04 WS2 3400 run net share on fileserver.corp.acme.com\n12/08 18:05 FILESERVER 1664 dump hashes\n12/08 18:05 FILESERVER 1664 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:05 WS2 3400 run net dclist\n12/08 18:06 WS2 1872 run mimikatz's sekurlsa::pth /\nuser:Administrator /domain:CORP /\nntlm:83414a69a47afeec7e3a37d05a81dc3b /\nrun:\"cmd.exe /c echo 70f32449cc8 > \\\\.\n\\pipe\\d8e195\" command\n12/08 18:07 DC 1204 dump hashes\n12/08 18:07 DC 1204 run mimikatz's sekurlsa::logonpasswords\ncommand\n12/08 18:16 JOSHDEV 1220 spawn x86 features to: c:\\program files\n\\putty\\putty.exe\n12/08 18:16 JOSHDEV 1220 SSH to 192.168.57.18:22 as devops\n\n### Mitigation\n\nP 20\n\n\n-----\n\nMitigating specific API calls will likely have unintended side effects, such as preventing\nlegitimate software from operating properly. Efforts should be focused on preventing\nadversary tools from running earlier in the chain of activity and on identifying\nsubsequent malicious behavior.\n\nAlthough process hollowing may be used to evade certain types of defenses, it is still\ngood practice to identify potentially malicious software that may be used to perform\nadversarial actions, including process hollowing, and audit and/or block it by using\nwhitelisting tools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nMonitoring API calls may generate a significant amount of data and may not be directly\nuseful for defense unless collected under specific circumstances for known bad\nsequences of calls, since benign use of API functions may be common and difficult to\ndistinguish from malicious behavior.\n\nAnalyze process behavior to determine if a process is performing actions it usually does\nnot, such as opening network connections, reading files, or other suspicious actions that\ncould relate to post-compromise behavior.\n\n### Reference\n\n[• Tactic: T1093](https://attack.mitre.org/wiki/Technique/T1093)\n\nP 21\n\n\n-----\n\n## Remote Services\n\nAn adversary may use valid credentials to log into a service specifically designed to\naccept remote connections, such as telnet, SSH, and VNC. The adversary may then\nperform actions as the logged-on user.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:16 JOSHDEV 1220 SSH to 192.168.57.18:22 as devops\n\n### Mitigation\n\nLimit the number of accounts that may use remote services. Use multifactor\nauthentication where possible. Limit the permissions for accounts that are at higher risk\nof compromise; for example, configure SSH so users can only run specific programs.\nPrevent Valid Accounts that can be used by existing services.\n\n### Detection Methods\n\nCorrelate use of login activity related to remote services with unusual behavior or\nother malicious or suspicious activity. Adversaries will likely need to learn about an\nenvironment and the relationships between systems through Discovery techniques prior\nto attempting Lateral Movement.\n\n### Reference\n\n[• Tactic: T1021](https://attack.mitre.org/wiki/Technique/T1021)\n\nP 22\n\n\n-----\n\n## Remote System Discovery\n\nAdversaries will likely attempt to get a listing of other systems by IP address, hostname,\nor other logical identifier on a network that may be used for Lateral Movement from the\ncurrent system. Functionality could exist within remote access tools to enable this, but\nutilities available on the operating system could also be used.\n\n**Windows**\nExamples of tools and commands that acquire this information include \"ping\" or \"net\nview\" using Net.\n\n**Mac**\nSpecific to Mac, the bonjour protocol to discover additional Mac-based systems within\nthe same broadcast domain. Utilities such as \"ping\" and others can be used to gather\ninformation about remote systems.\n\n**Linux**\nUtilities such as \"ping\" and others can be used to gather information about remote\nsystems.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:00 WS2 3400 run net computers\n12/08 18:05 WS2 3400 run net dclist\n\n### Mitigation\n\nIdentify unnecessary system utilities or potentially malicious software that may be\nused to acquire information on remotely available systems, and audit and/or block\nthem by using whitelisting tools, like AppLocker, or Software Restriction Policies where\nappropriate.\n\n### Detection Methods\n\nSystem and network discovery techniques normally occur throughout an operation\nas an adversary learns the environment. Data and events should not be viewed in\nisolation, but as part of a chain of behavior that could lead to other activities, such as\nLateral Movement, based on the information obtained.\n\nNormal, benign system and network events related to legitimate remote system\ndiscovery may be uncommon, depending on the environment and how they are used.\nMonitor processes and command-line arguments for actions that could be taken to\ngather system and network information. Remote access tools with built-in features may\ninteract directly with the Windows API to gather information. Information may also be\n\nP 23\n\n\n-----\n\nacquired through Windows system management tools such as Windows Management\nInstrumentation and PowerShell.\n\n### Reference\n\n[• Tactic: T1018](https://attack.mitre.org/wiki/Technique/T1018)\n\nP 24\n\n\n-----\n\n## Scheduled Transfer\n\nData exfiltration may be performed only at certain times of day or at certain intervals.\nThis could be done to blend traffic patterns with normal activity or availability.\n\nWhen scheduled exfiltration is used, other exfiltration techniques likely apply as well\nto transfer the information out of the network, such as Exfiltration Over Command and\nControl Channel and Exfiltration Over Alternative Protocol.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:00 WS2 3400 sleep for 1s\n\n### Mitigation\n\nNetwork intrusion detection and prevention systems that use network signatures to\nidentify traffic for specific adversary command and control infrastructure and malware\ncan be used to mitigate activity at the network level. Signatures are often for unique\nindicators within protocols and may be based on the specific obfuscation technique\nused by a particular adversary or tool, and will likely be different across various\nmalware families and versions. Adversaries will likely change tool command and control\nsignatures over time or construct protocols in such a way to avoid detection by common\ndefensive tools.\n\n### Detection Methods\n\nMonitor process file access patterns and network behavior. Unrecognized processes\nor scripts that appear to be traversing file systems and sending network traffic may be\nsuspicious. Network connections to the same destination that occur at the same time of\nday for multiple days are suspicious.\n\n### Reference\n\n[• Tactic: T1029](https://attack.mitre.org/wiki/Technique/T1029)\n\nP 25\n\n\n-----\n\n## Screen Capture\n\nAdversaries may attempt to take screen captures of the desktop to gather information\nover the course of an operation. Screen capturing functionality may be included as a\nfeature of a remote access tool used in post-compromise operations.\n\n**Mac**\nOn OSX, the native command screencapture is used to capture screenshots.\n\n**Linux**\nOn Linux, there is the native command xwd.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:53 WS2 3400 take screenshot\n12/08 18:10 JOSHDEV 356 take a screenshot in 1220/x86\n\n### Mitigation\n\nBlocking software based on screen capture functionality may be difficult, and there may\nbe legitimate software that performs those actions. Instead, identify potentially malicious\nsoftware that may have functionality to acquire screen captures, and audit and/or block\nit by using whitelisting tools, like AppLocker, or Software Restriction Policies where\nappropriate.\n\n### Detection Methods\n\nMonitoring for screen capture behavior will depend on the method used to obtain data\nfrom the operating system and write output files. Detection methods could include\ncollecting information from unusual processes using API calls used to obtain image\ndata, and monitoring for image files written to disk. The sensor data may need to be\ncorrelated with other events to identify malicious activity, depending on the legitimacy of\nthis behavior within a given network environment.\n\n### Reference\n\n[• Tactic: T1113](https://attack.mitre.org/wiki/Technique/T1113)\n\nP 26\n\n\n-----\n\n## Scripting\n\nAdversaries may use scripts to aid in operations and perform multiple actions that would\notherwise be manual. Scripting is useful for speeding up operational tasks and reducing\nthe time required to gain access to critical resources. Some scripting languages may\nbe used to bypass process monitoring mechanisms by directly interacting with the\noperating system at an API level instead of calling other programs. Common scripting\nlanguages for Windows include VBScript and PowerShell but could also be in the form\nof command-line batch scripts.\n\nMany popular offensive frameworks exist which use forms of scripting for security\ntesters and adversaries alike. Metasploit, Veil, and PowerSploit are three examples\nthat are popular among penetration testers for exploit and post-compromise operations\nand include many features for evading defenses. Some adversaries are known to use\nPowerShell.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 17:55 WS2 3400 import: C:\\Users\\user\\Desktop\\PowerSploitmaster\\Privesc\\PowerUp.ps1\n12/08 18:00 WS2 3400 import: C:\\Users\\user\\Desktop\\PowerSploitmaster\\Recon\\PowerView.ps1\n\n### Mitigation\n\nTurn off unused features or restrict access to scripting engines such as VBScript or\nscriptable administration frameworks such as PowerShell.\n\n### Detection Methods\n\nScripting may be common on admin, developer, or power user systems, depending\non job function. If scripting is restricted for normal users, then any attempts to enable\nscripts running on a system would be considered suspicious. If scripts are not\ncommonly used on a system, but enabled, scripts running out of cycle from patching\nor other administrator functions are suspicious. Scripts should be captured from the file\nsystem when possible to determine their actions and intent.\n\nScripts are likely to perform actions with various effects on a system that may generate\nevents, depending on the types of monitoring used. Monitor processes and commandline arguments for script execution and subsequent behavior. Actions may be related\nto network and system information Discovery, Collection, or other scriptable postcompromise behaviors and could be used as indicators of detection leading back to the\nsource script.\n\n### Reference\n\nP 27\n\n\n-----\n\n[• Tactic: T1064](https://attack.mitre.org/wiki/Technique/T1064)\n\n\nP 28\n\n\n-----\n\n## Service Execution\n\nAdversaries may execute a binary, command, or script via a method that interacts\nwith Windows services, such as the Service Control Manager. This can be done by\neither creating a new service or modifying an existing service. This technique is the\nexecution used in conjunction with New Service and Modify Existing Service during\nservice persistence or privilege escalation.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:02 WS2 3400 run windows/beacon_smb/bind_pipe\n(\\\\fileserver.corp.acme.com\\pipe\n\\status_9756) on fileserver.corp.acme.com\nvia Service Control Manager (PSH)\n12/08 18:06 WS2 1872 run windows/beacon_smb/bind_pipe (\\\n\\DC\\pipe\\status_9756) on DC via Service\nControl Manager (PSH)\n12/08 18:08 WS2 1872 run windows/beacon_smb/bind_pipe (\\\n\\MAIL\\pipe\\status_9756) on MAIL via\nService Control Manager (\\\\MAIL\\ADMIN$\n\\c0b6e50.exe)\n\n### Mitigation\n\nEnsure that permissions disallow services that run at a higher permissions level from\nbeing created or interacted with by a user with a lower permission level. Also ensure\nthat high permission level service binaries cannot be replaced or modified by users with\na lower permission level.\n\nIdentify unnecessary system utilities or potentially malicious software that may be used\nto interact with Windows services, and audit and/or block them by using whitelisting\ntools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nChanges to service Registry entries and command-line invocation of tools capable of\nmodifying services that do not correlate with known software, patch cycles, etc., may be\nsuspicious. If a service is used only to execute a binary or script and not to persist, then\nit will likely be changed back to its original form shortly after the service is restarted so\nthe service is not left broken, as is the case with the common administrator tool PsExec.\n\n### Reference\n\n[• Tactic: T1035](https://attack.mitre.org/wiki/Technique/T1035)\n\nP 29\n\n\n-----\n\n## Windows Admin Shares\n\nWindows systems have hidden network shares that are accessible only to\nadministrators and provide the ability for remote file copy and other administrative\nfunctions. Example network shares include C$, ADMIN$, and IPC$.\n\nAdversaries may use this technique in conjunction with administrator-level Valid\nAccounts to remotely access a networked system over server message block (SMB)\nto interact with systems using remote procedure calls (RPCs), transfer files, and run\ntransferred binaries through remote Scheduled Task, Service Execution, and Windows\nManagement Instrumentation. Adversaries can also use NTLM hashes to access\nadministrator shares on systems with Pass the Hash and certain configuration and\npatch levels.\n\nThe Net utility can be used to connect to Windows admin shares on remote systems\nusing net use commands with valid credentials.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:02 WS2 3400 list files in \\\\fileserver.corp.acme.com\n\\ADMIN$\n12/08 18:06 WS2 1872 list files in \\\\DC\\C$\n12/08 18:08 WS2 1872 run windows/beacon_smb/bind_pipe (\\\n\\MAIL\\pipe\\status_9756) on MAIL via\nService Control Manager (\\\\MAIL\\ADMIN$\n\\c0b6e50.exe)\n\n### Mitigation\n\nDo not reuse local administrator account passwords across systems. Ensure password\ncomplexity and uniqueness such that the passwords cannot be cracked or guessed.\nDeny remote use of local admin credentials to log into systems. Do not allow domain\nuser accounts to be in the local Administrators group multiple systems.\n\nIdentify unnecessary system utilities or potentially malicious software that may be used\nto leverage SMB and the Windows admin shares, and audit and/or block them by using\nwhitelisting tools, like AppLocker, or Software Restriction Policies where appropriate.\n\n### Detection Methods\n\nEnsure that proper logging of accounts used to log into systems is turned on and\ncentrally collected. Windows logging is able to collect success/failure for accounts that\nmay be used to move laterally and can be collected using tools such as Windows Event\nForwarding. Monitor remote login events and associated SMB activity for file transfers\nand remote process execution. Monitor the actions of remote users who connect to\n\nP 30\n\n\n-----\n\nadministrative shares. Monitor for use of tools and commands to connect to remote\nshares, such as Net, on the command-line interface and Discovery techniques that\ncould be used to find remotely accessible systems.\n\n### Reference\n\n[• Tactic: T1077](https://attack.mitre.org/wiki/Technique/T1077)\n\nP 31\n\n\n-----\n\n## Windows Management Instrumentation\n\nWindows Management Instrumentation (WMI) is a Windows administration feature\nthat provides a uniform environment for local and remote access to Windows system\ncomponents. It relies on the WMI service for local and remote access and the server\nmessage block (SMB) and Remote Procedure Call Service (RPCS) for remote access.\nRPCS operates over port 135.\n\nAn adversary can use WMI to interact with local and remote systems and use it as a\nmeans to perform many tactic functions, such as gathering information for Discovery\nand remote Execution of files as part of Lateral Movement.\n\n### Related Events\n\n**date** **host** **pid** **activity**\n\n12/08 18:09 WS2 1872 run windows/beacon_smb/bind_pipe\n(\\\\JOSHDEV\\pipe\\status_9756) on\nJOSHDEV via WMI\n\n### Mitigation\n\nDisabling WMI or RPCS may cause system instability and should be evaluated to\nassess the impact to a network. By default, only administrators are allowed to connect\nremotely using WMI. Restrict other users who are allowed to connect, or disallow\nall users to connect remotely to WMI. Prevent credential overlap across systems of\nadministrator and privileged accounts.\n\n### Detection Methods\n\nMonitor network traffic for WMI connections; the use of WMI in environments that do not\ntypically use WMI may be suspect. Perform process monitoring to capture commandline arguments of \"wmic\" and detect commands that are used to perform remote\nbehavior.\n\n### Reference\n\n[• Tactic: T1047](https://attack.mitre.org/wiki/Technique/T1047)\n\nP 32\n\n\n-----\n\n# LICENSE\n\nThe MITRE Corporation (MITRE) hereby grants you a non-exclusive, royalty-free\nlicense to use Adversarial Tactics, Techniques and Common Knowledge (ATT&CK™)\nfor research, development, and commercial purposes. Any copy you make for such\npurposes is authorized provided that you reproduce MITRE's copyright designation and\nthis license in any such copy.\n\n\"(c) 2017 The MITRE Corporation. This work is reproduced and distributed with the\npermission of The MITRE Corporation.\"\n\n## DISCLAIMERS\n\nMITRE does not claim ATT&CK enumerates all possibilities for the types of actions and\nbehaviors documented as part of its adversary model and framework of techniques.\nUsing the information contained within ATT&CK to address or cover full categories of\ntechniques will not guarantee full defensive coverage as there may be undisclosed\ntechniques or variations on existing techniques not documented by ATT&CK.\n\nALL DOCUMENTS AND THE INFORMATION CONTAINED THEREIN ARE\nPROVIDED ON AN \"AS IS\" BASIS AND THE CONTRIBUTOR, THE ORGANIZATION\nHE/SHE REPRESENTS OR IS SPONSORED BY (IF ANY), THE MITRE\nCORPORATION, ITS BOARD OF TRUSTEES, OFFICERS, AGENTS, AND\nEMPLOYEES, DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING\nBUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION\nTHEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nP 33\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "99fdc3ef-333d-48f5-a4a1-becd788c7b80",
            "created_at": "2022-10-25T15:28:29.802983Z",
            "updated_at": "2022-10-25T15:28:29.802983Z",
            "deleted_at": null,
            "name": "MITRE",
            "url": "https://github.com/mitre-attack/attack-stix-data",
            "description": "MITRE ATT&CK STIX Data",
            "reports": null
        }
    ],
    "references": [
        "https://www.cobaltstrike.com/downloads/reports/tacticstechniquesandprocedures.pdf"
    ],
    "report_names": [
        "tacticstechniquesandprocedures.pdf"
    ],
    "threat_actors": [
        {
            "id": "67bf0462-41a3-4da5-b876-187e9ef7c375",
            "created_at": "2022-10-25T16:07:23.44832Z",
            "updated_at": "2025-03-27T02:02:09.806007Z",
            "deleted_at": null,
            "main_name": "Careto",
            "aliases": [
                "Careto",
                "The Mask",
                "Ugly Face"
            ],
            "source_name": "ETDA:Careto",
            "tools": [
                "Careto"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "d90307b6-14a9-4d0b-9156-89e453d6eb13",
            "created_at": "2022-10-25T16:07:23.773944Z",
            "updated_at": "2025-03-27T02:02:09.974695Z",
            "deleted_at": null,
            "main_name": "Lead",
            "aliases": [
                "Casper",
                "TG-3279"
            ],
            "source_name": "ETDA:Lead",
            "tools": [
                "Agentemis",
                "BleDoor",
                "Cobalt Strike",
                "CobaltStrike",
                "RbDoor",
                "RibDoor",
                "Winnti",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041357,
    "ts_creation_date": 1512758976,
    "ts_modification_date": 0,
    "files": {
        "pdf": "https://archive.orkl.eu/af7e17bb23e07f818c23dc3f73076462f310bd51.pdf",
        "text": "https://archive.orkl.eu/af7e17bb23e07f818c23dc3f73076462f310bd51.txt",
        "img": "https://archive.orkl.eu/af7e17bb23e07f818c23dc3f73076462f310bd51.jpg"
    }
}