{
    "id": "b321575c-cda8-4c7d-bad0-59ee3f31f350",
    "created_at": "2023-01-12T15:08:17.404877Z",
    "updated_at": "2025-03-27T02:05:34.14701Z",
    "deleted_at": null,
    "sha1_hash": "7933295cc481a495fab39093df60dee1d82524bc",
    "title": "2022-06-28 - The Link Between AWM Proxy & the Glupteba Botnet",
    "authors": "",
    "file_creation_date": "2022-08-18T04:02:20Z",
    "file_modification_date": "2022-08-18T04:02:20Z",
    "file_size": 1080601,
    "plain_text": "# The Link Between AWM Proxy & the Glupteba Botnet\n\n**[krebsonsecurity.com/2022/06/the-link-between-awm-proxy-the-glupteba-botnet/](https://krebsonsecurity.com/2022/06/the-link-between-awm-proxy-the-glupteba-botnet/?utm_source=dlvr.it&utm_medium=twitter)**\n\nOn December 7, 2021, Google announced it was suing two Russian men allegedly\nresponsible for operating the Glupteba botnet, a global malware menace that has infected\nmillions of computers over the past decade. That same day, AWM Proxy — a 14-year-old\nanonymity service that rents hacked PCs to cybercriminals — suddenly went offline. Security\nexperts had long seen a link between Glupteba and AWM Proxy, but new research shows\nAWM Proxy’s founder is one of the men being sued by Google.\n\nAWMproxy, the storefront for renting access to infected PCs, circa 2011.\n\nLaunched in March 2008, AWM Proxy quickly became the largest service for crooks seeking\nto route their malicious Web traffic through compromised devices. In 2011, researchers at\n**Kaspersky Lab** [showed that virtually all of the hacked systems for rent at AWM Proxy had](https://krebsonsecurity.com/2011/09/rent-a-bot-networks-tied-to-tdss-botnet/)\nbeen compromised by TDSS (a.k.a [TDL-4 and Alureon), a stealthy “rootkit” that installs deep](https://en.wikipedia.org/wiki/Alureon)\nwithin infected PCs and loads even before the underlying Windows operating system boots\nup.\n\nIn March 2011, security researchers at ESET [found TDSS was being used to deploy](https://www.welivesecurity.com/2011/03/02/tdl4-and-glubteba-piggyback-piggybugs/)\nGlupteba, another rootkit that steals passwords and other access credentials, disables\nsecurity software, and tries to compromise other devices on the victim’s network — such as\nInternet routers and media storage servers — for use in relaying spam or other malicious\ntraffic.\n\n\n-----\n\nA report from the Polish computer emergency response team (CERT Orange Polksa) found Glupteba\n\nwas by far the biggest malware threat in 2021.\n\nLike its predecessor TDSS, Glupteba is primarily distributed through “pay-per-install” or PPI\nnetworks, and via traffic purchased from traffic distribution systems (TDS). Pay-per-install\nnetworks try to match cybercriminals who already have access to large numbers of hacked\nPCs with other crooks seeking broader distribution of their malware.\n\nIn a typical PPI network, clients will submit their malware—a spambot or password-stealing\nTrojan, for example —to the service, which in turn charges per thousand successful\ninstallations, with the price depending on the requested geographic location of the desired\nvictims. One of the most common ways PPI affiliates generate revenue is by secretly\nbundling the PPI network’s installer with pirated software titles that are widely available for\ndownload via the web or from file-sharing networks.\n\n\n-----\n\nAn example of a cracked software download site distributing Glupteba. Image: Google.com.\n\nOver the past decade, both Glupteba and AWM Proxy have grown substantially. When\nKrebsOnSecurity [first covered AWM Proxy in 2011, the service was selling access to roughly](https://krebsonsecurity.com/2011/09/rent-a-bot-networks-tied-to-tdss-botnet/)\n24,000 infected PCs scattered across dozens of countries. Ten years later, AWM Proxy was\noffering 10 times that number of hacked systems on any given day, and Glupteba had grown\nto more than one million infected devices worldwide.\n\nThere is also [ample](https://decoded.avast.io/martinhron/meris-and-trickbot-standing-on-the-shoulders-of-giants/) [evidence to suggest that Glupteba may have spawned Meris,](https://therecord.media/russian-security-firm-sinkholes-part-of-the-dangerous-meris-ddos-botnet/) a massive\nbotnet of hacked Internet of Things (IoT) devices that surfaced in September 2021 and was\nresponsible for some of the largest and most disruptive distributed denial-of-service (DDoS)\nattacks the Internet has ever seen.\n\n[But on Dec. 7, 2021, Google announced it had taken technical measures to dismantle the](https://blog.google/threat-analysis-group/disrupting-glupteba-operation/)\n[Glupteba botnet, and filed a civil lawsuit (PDF) against two Russian men thought to be](https://storage.googleapis.com/gweb-uniblog-publish-prod/documents/1_Complaint.pdf)\nresponsible for operating the vast crime machine. AWM Proxy’s online storefront\ndisappeared that same day\n\n\n-----\n\nAWM Proxy quickly alerted its customers that the service had moved to a new domain, with\nall customer balances, passwords and purchase histories seamlessly ported over to the new\nhome. However, subsequent takedowns targeting AWM Proxy’s domains and other\ninfrastructure have conspired to keep the service on the ropes and frequently switching\ndomains ever since.\n\nEarlier this month, the United States, Germany, the Netherlands and the U.K. dismantled the\n“RSOCKS” botnet, a competing proxy service that had been in operation since 2014.\n[KrebsOnSecurity has identified the owner of RSOCKS as a 35-year-old from Omsk, Russia](https://krebsonsecurity.com/2022/06/meet-the-administrators-of-the-rsocks-proxy-botnet/)\nwho runs the world’s largest forum catering to spammers.\n\nThe employees who kept things running for RSOCKS, circa 2016.\n\nShortly after last week’s story on the RSOCKS founder, I heard from Riley Kilmer, co[founder of Spur.us, a startup that tracks criminal proxy services. Kilmer said RSOCKS was](https://www.spur.us/)\nsimilarly disabled after Google’s combined legal sneak attack and technical takedown\ntargeting Glupteba.\n\n“The RSOCKS website gave you the estimated number of proxies in each of their\nsubscription packages, and that number went down to zero on Dec. 7,” Kilmer said. “It’s not\nclear if that means the services were operated by the same people, or if they were just using\nthe same sources (i.e., PPI programs) to generate new installations of their malware.”\n\nKilmer said each time his company tried to determine how many systems RSOCKS had for\nsale, they found each Internet address being sold by RSOCKS was also present in AWM\nProxy’s network. In addition, Kilmer said, the application programming interfaces (APIs) used\nby both services to keep track of infected systems were virtually identical, once again\nsuggesting strong collaboration\n\n\n-----\n\nOne hundred percent of the IPs we got back from RSOCKS we d already identified in\nAWM,” Kilmer said. “And the IP port combinations they give you when you access an\nindividual IP were the same as from AWM.”\n\nIn 2011, KrebsOnSecurity published an investigation that identified one of the founders of\nAWM Proxy, but Kilmer’s revelation prompted me to take a fresh look at the origins of this\nsprawling cybercriminal enterprise to determine if there were additional clues showing more\nconcrete links between RSOCKS, AWM Proxy and Glupteba.\n\n## IF YOUR PLAN IS TO RIP OFF GOOGLE…\n\nSupporting Kilmer’s theory that AWM Proxy and RSOCKS may simply be using the same\nPPI networks to spread, further research shows the RSOCKS owner also had an ownership\nstake in **[AD1[.]ru, an extremely popular Russian-language pay-per-install network that has](https://web.archive.org/web/20110123155232/http://ad1.ru/contacts/)**\nbeen in operation for at least a decade.\n\nGoogle took aim at Glupteba in part because its owners were using the botnet to divert and\nsteal vast sums in online advertising revenue. So it’s more than a little ironic that the critical\npiece of evidence linking all of these operations begins with a Google Analytics code\nincluded in the HTML code for the original AWM Proxy back in 2008 (UA-3816536).\n\nThat analytics code also was present on a handful of other sites over the years, including the\nnow-defunct Russian domain name registrar Domenadom[.]ru, and the website web**site[.]ru, which curiously was a Russian company operating a global real estate appraisal**\n[business called American Appraisal.](https://web.archive.org/web/20030203124357/http://www.web-site.ru/)\n\nTwo other domains connected to that Google Analytics code — Russian plastics\nmanufacturers techplast[.]ru and tekhplast.ru — also shared a different Google Analytics\ncode (UA-1838317) with web-site[.]ru and with the domain “starovikov[.]ru.”\n\nThe name on the WHOIS registration records for the plastics domains is an “Alexander I.\n**Ukraincki,” whose personal information also is included in the domains tpos[.]ru and**\nalphadisplay[.]ru, both apparently manufacturers of point-of-sale payment terminals in\nRussia.\n\n[Constella Intelligence, a security firm that indexes passwords and other personal information](https://www.constellaintelligence.com/)\nexposed in past data breaches, revealed dozens of variations on email addresses used by\nAlexander I. Ukraincki over the years. Most of those email addresses start with some\nvariation of “uai@” followed by a domain from one of the many Russian email providers (e.g.,\nyandex.ru, mail.ru). [Full disclosure: Constella is currently an advertiser on this website].\n\nBut Constella also shows those different email addresses all relied on a handful of\npasswords — most commonly “2222den” and “2222DEN.” Both of those passwords have\nbeen used almost exclusively in the past decade by the person who registered more than a\n\n\n-----\n\ndozen email addresses with the username **dennstr.**\n\nThe dennstr identity leads to several variations on the same name — Denis Strelinikov, or\nDenis Stranatka, from Ukraine, but those clues ultimately led nowhere promising. And maybe\nthat was the point.\n\n[Things began looking brighter after I ran a search in DomainTools for web-site[.]ru’s original](https://www.domaintools.com/)\nWHOIS records, which shows it was assigned in 2005 to a “private person” who used the\nemail address lycefer@gmail.com. A search in Constella on that email address says it was\nused to register nearly two dozen domains, including starovikov.ru and starovikov[.]com.\n\nA [cached copy of the contact page for Starovikov[.]com shows that in 2008 it displayed the](https://web.archive.org/web/20080208120444/http://www.starovikov.com/)\npersonal information for a Dmitry Starovikov, who listed his Skype username as “lycefer.”\n\n[Finally, Russian incorporation documents show the company LLC Website (web-site[.]ru)was](https://www.list-org.com/company/3994287)\nregistered in 2005 to two men, one of whom was named Dmitry Sergeevich Starovikov.\n\nBringing this full circle, Google says Starovikov is one of the two operators of the Glupteba\nbotnet:\n\nThe cover page for Google’s lawsuit against the alleged Glupteba botnet operators.\n\n\n-----\n\nMr. Starovikov did not respond to requests for comment. But attorneys for Starovikov and his\nco-defendant last month filed a response to Google’s complaint in the Southern District of\nNew York, [denying (PDF) their clients had any knowledge of the scheme.](https://krebsonsecurity.com/wp-content/uploads/2022/06/starovikov-answer.pdf)\n\nDespite all of the disruption caused by Google’s legal and technical meddling, AWM is still\naround and nearly as healthy as ever, although the service has been branded with a new\nname and there are dubious claims of new owners. Advertising customer plans ranging from\n$50 a day to nearly $700 for “VIP access,” AWM Proxy says its malware has been running\non approximately 175,000 systems worldwide over the last 24 hours, and that roughly 65,000\nof these systems are currently online.\n\nAWM Proxy, as it exists today.\n\nMeanwhile, the administrators of RSOCKS recently alerted customers that the service and\nany unspent balances will soon be migrated over to a new location.\n\nMany people seem to equate spending time, money and effort to investigate and prosecute\ncybercriminals with the largely failed war on drugs, meaning there is an endless supply of upand-coming crooks who will always fill in any gaps in the workforce whenever cybercriminals\nface justice.\n\nWhile that may be true for many low-level cyber thieves today, investigations like these show\nonce again how small the cybercriminal underground really is. It also shows how it makes a\ngreat deal of sense to focus efforts on targeting and disrupting the relatively small number of\nestablished hackers who remain the real force multipliers of cybercrime.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-06-28 - The Link Between AWM Proxy & the Glupteba Botnet.pdf"
    ],
    "report_names": [
        "2022-06-28 - The Link Between AWM Proxy & the Glupteba Botnet.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536097,
    "ts_updated_at": 1743041134,
    "ts_creation_date": 1660795340,
    "ts_modification_date": 1660795340,
    "files": {
        "pdf": "https://archive.orkl.eu/7933295cc481a495fab39093df60dee1d82524bc.pdf",
        "text": "https://archive.orkl.eu/7933295cc481a495fab39093df60dee1d82524bc.txt",
        "img": "https://archive.orkl.eu/7933295cc481a495fab39093df60dee1d82524bc.jpg"
    }
}