{
    "id": "b3274ea4-b2a5-441a-9ad1-c94576330f47",
    "created_at": "2023-01-12T15:10:21.490945Z",
    "updated_at": "2025-03-27T02:16:26.506871Z",
    "deleted_at": null,
    "sha1_hash": "b71262146b1e9825eac587b058763892f6e83829",
    "title": "2021-07-13 - Joker Is Still No Laughing Matter",
    "authors": "",
    "file_creation_date": "2022-05-28T15:53:34Z",
    "file_modification_date": "2022-05-28T15:53:34Z",
    "file_size": 1322684,
    "plain_text": "# Joker Is Still No Laughing Matter\n\n**[web.archive.org/web/20210714010827/https://blog.zimperium.com/joker-is-still-no-laughing-matter/](https://web.archive.org/web/20210714010827/https://blog.zimperium.com/joker-is-still-no-laughing-matter/)**\n\n[Richard Melick](https://web.archive.org/web/20210714010827/https://blog.zimperium.com/author/richard-melick/)\n[Android](https://web.archive.org/web/20210714010827/https://blog.zimperium.com/category/android/)\nJul 13 2021\n\n\nJuly 13, 2021\n\n\n[As one of the key members of Google’s App Defense Alliance, Zimperium helps ensure the](https://web.archive.org/web/20210714010827/https://blog.zimperium.com/zimperium-and-google-partner-to-fight-bad-apps-through-app-defense-alliance/)\nAndroid ecosystem is safer by processing all apps before they reach Google Play. Despite\nthis direct involvement, malicious applications can find their way to Android devices through\nvarious app stores, sideloaded applications, and compromises malicious websites that trick\nusers into downloading and installing apps.\n\nSince 2017, over 1,800 Android applications infected with Joker have been removed from\nthe Google Play store, highlighting a long history of this malware and its evolution throughout\nthe years. Despite Google’s advanced technologies and its partnerships with malware\nsecurity companies like Zimperium, the malicious actors have routinely found new and\nunique ways to get this malware into both official and unofficial app stores. While they are\nnever long for life in these repositories, the persistence highlights how mobile malware, just\nlike traditional endpoint malware, does not disappear but continues to be modified and\nadvanced in a constant cat and mouse game.\n\n\n-----\n\nRecently, the Zimperium zLabs mobile threat research team has noticed a large uptick in\nJoker variants on Android marketplaces, with over 1000 new samples since our last\ncoverage in September of 2020. These variants were found using the same malware\n[machine learning engine powering zIPS on-device detection and Google’s App Alliance,](https://web.archive.org/web/20210714010827/https://www.zimperium.com/zips-mobile-ips)\nproving that on-device detection capabilities are a must to ensure full protection of an\nenterprises’ mobile endpoints.\n\nLet’s first recap why Joker is so effective and popular for Android malware.\n\n**What Is Joker?**\n\nJoker trojans are malicious Android applications that have been known since 2017 for\nnotoriously performing bill fraud and subscribing users to premium services. The outcome of\na successful mobile infection is financial gain for the cybercriminal, oftentimes under the\nnose of the victim until long after the money is gone, with little to no recourse for recovery.\n\nThe trojan’s main functionality is to load a dex file and perform malicious activities like\ninspecting the notifications or sending SMS messages to premium subscriptions. While\nGoogle Play have worked hard to bring alerts to the mobile user, Joker counts on the\ndistracted nature of mobile alerts and social engineering for them to be accepted or even\nignored.\n\nThe malicious activities can be divided into the following categories:\n\n1. Decode or decrypt the strings to get the first stage URL.\n2. Download the payload dex file from the above URL.\n3. Load the payload dex file using reflection techniques to invoke the DexClassLoader\n\nconstructor.\n4. The dex file performs malicious activities and communicates with the C&C server.\n\nIn the following flowchart, the full attack chain is shown.\n\n\n-----\n\nThese are the four pivot points each Joker sample uses, and it employs several evasion\ntechniques to remain undetected. Most often, Joker is disguised as commonly downloaded\napplications like games, wallpapers, messengers, translators, and photo editors.\n\n**What Has Changed Since September 2020**\n\nThe malicious developers behind the current, most advanced forms of Joker are taking\nadvantage of legitimate developer techniques to try and hide the actual intent of the payload\nfrom traditional, legacy-based mobile security toolsets. They are starting by using the\ncommon framework Flutter to code the application in a way that is commonly seen by\ntraditional scanners. Due to the commonality of Flutter, even malicious application code will\nlook legitimate and clean, whereas many scanners are looking for disjointed code with errors\nor improper assemblies.\n\n\n-----\n\nThe malicious developers are embedding Joker as a payload that can be encrypted in\ndifferent ways, either a .dex file xored or encrypted with a number, or through the same .dex\nfile as before, but hidden inside an image using steganography. Both manners are\nobfuscating the intent of the payload from the legacy scan and mobile security tools.\n\nAfter successful installation, the application infected with Joker will run a scan using Google\nPlay APIs to check the latest version of the app in Google Play Store. If there is no answer,\nthe malware remains silent since it can be running on a dynamic analysis emulator. But if the\nversion found in the store is older than the current version, the local malware payload is\nexecuted, infecting the mobile device. If the version in the store is newer than the current\none, then the command and control servers are contacted to download an updated version\nof the payload.\n\nJoker Trojan’s never seen before behavior includes URL shorteners, checking the current\ntime against a hardcoded launch-time, image infected using steganography on legit cloud file\nhosting services, and a combination of native libraries to decrypt the offline payload from the\nAPK’s assets or connect to C&C for the payload.\n\n**Joker vs. Zimperium**\n\nZimperium zIPS customers are protected against 100% of these Joker variants analyzed\n[with our zero-day, on-device z9 Mobile Threat Defense machine learning engine model and](https://web.archive.org/web/20210714010827/https://www.zimperium.com/machine-learning-z9-technology)\nstatic analysis.\n\nAs a standard protocol, the Zimperium zLabs team checks new malware samples against not\nonly the current machine learning model but past ones as well. In the case of Joker,\nZimperium zIPS customers have been constantly protected against these latest variants of\nthis aggressive Android trojan.\n\nTo ensure your Android users are protected from the Joker malware, we recommend a quick\nrisk assessment. Inside zConsole, admins can review which apps are side-loaded onto the\ndevice that could be increasing the attack surface and leaving data and users at risk.\n\n**About Zimperium**\n\nZimperium, the global leader in mobile security, offers the only real-time, on-device, machine\nlearning-based protection against Android, iOS, and Chromebook threats. Powered by z9,\nZimperium provides protection against device, network, phishing, and malicious app attacks.\nFor more information or to schedule a demo, contact us today.\n\nFollow Us\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-07-13 - Joker Is Still No Laughing Matter.pdf"
    ],
    "report_names": [
        "2021-07-13 - Joker Is Still No Laughing Matter.pdf"
    ],
    "threat_actors": [
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673536221,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1653753214,
    "ts_modification_date": 1653753214,
    "files": {
        "pdf": "https://archive.orkl.eu/b71262146b1e9825eac587b058763892f6e83829.pdf",
        "text": "https://archive.orkl.eu/b71262146b1e9825eac587b058763892f6e83829.txt",
        "img": "https://archive.orkl.eu/b71262146b1e9825eac587b058763892f6e83829.jpg"
    }
}