{
    "id": "b37561b5-edd9-42d8-9c8a-727504fda425",
    "created_at": "2023-01-12T15:05:09.051333Z",
    "updated_at": "2025-03-27T02:16:57.980511Z",
    "deleted_at": null,
    "sha1_hash": "b27768f53e5a614b9aedefa624921deb14c399b5",
    "title": "2020-07-31 - OpBlueRaven- Unveiling Fin7-Carbanak - Part 1 - Tirion",
    "authors": "",
    "file_creation_date": "2022-05-28T17:45:15Z",
    "file_modification_date": "2022-05-28T17:45:15Z",
    "file_size": 1790795,
    "plain_text": "# OpBlueRaven: Unveiling Fin7/Carbanak - Part I : Tirion\n\n**threatintel.blog/OPBlueRaven-Part1/**\n\nPTI Team July 31, 2020\n\nThis article aims to provide its readers with the details about PRODAFT & INVICTUS Threat\nIntelligence (PTI) team’s latest operation on different threat actors; who have been detected\nto be working in cooperation with the notorious Fin7 APT group.\n\nThroughout this article, which is planned to be released in 6/7 successive parts (similar to\nother articles on our pentest blog (pentest.blog); we will approach different aspects of our\noperation, which had been continued for the last 3 months until the end of July.\n\n\n-----\n\nThroughout these articles; all of which originates from a single OPSEC failure on the threat\nactor’s side, we will try to expand the topic on a step-by-step basis, similar to how we\nexpanded our scope as we’ve continued to discover further.\n\n## Neverbeforeseen Facts about Fin7 and Carbanak: Part 1\n\nBetween the months of May and July 2020; four members of PRODAFT Threat Intelligence\nteam have conducted operation BlueRaven. A case study which originated from discovering\na minor OpSec failure of a seemingly unimportant group of threat actors. Of course these\nthreat actors have later been found to have ties with the notorious Fin7 / Carbanak threat\nactors.\n\nPTI’s OP has originated from an OPSEC failure on the attacker’s side. Unlike previously\ndiscovered and published data what makes this OP special is we have managed to discover\nan important deal of unpublished information about attackers’ toolset which reveals the TTP\nof attackers.\n\nCarbanak Group / Fin7, which was first detected in 2014, is one of the most effective APT\ngroups in the world, and is among the first known APT groups. The group is thought to cause\ndamage over 900 million dollars worldwide. Our OP has resulted to discover following critical\nfindings about these threat actors:\n\nThe real identity of some of the attackers in Fin7 has been obtained.\n\nDetailed evidence has emerged about Fin7’s tools and attack methods.\n\nThe relationship between Fin7 and REvil ransomware group (which will be provided in\ndetail in latter stages) has emerged.\n\nThis report was written to raise awareness and assist cyber security experts’ analysis. Of\ncourse, PRODAFT some of our findings have been redacted. So, authorized bodies may get\nin touch with PRODAFT or INVICTUS for further disclosure.\n\nEach article will deal with a specific aspect of the operation; including but not limited to attack\nmethods, organizations, and identities of the attackers. Also; our team has managed to\neavesdrop different jabber conversations between attackers. Most of these conversations will\nalso be published throughout these series.\n\n## Carbanak Backdoor\n\nCarbanak Backdoor was among the first findings that our group has acquired.\nThe current version of CARBANAK backdoor (the most known tool of the team that gave the\nname to the Carbanak group) is the first tool that caught the attention of our team. The\n\n\n-----\n\n3.7.5 version, which was compiled in November 2019 according to PE file header, is the\nlast detected version of the backdoor command and control server. The screenshot of the\nmanagement panel of “3.7.5” version of Carbanak backdoor is given in the screenshot below.\n\nWe compared the last version we obtained with the versions of the “Command Manager” in\nVirustotal in 2017 and conducted a review on this tool. In the image below, the differences\nbetween the source codes obtained as a result of the decompilation of the two versions\nmentioned can be seen. In the following image, which lists only the source codes that differ\nbetween the two versions, the left column belongs to the file uploaded to Virustotal in 2017,\nand the right column belongs to the “3.7.5” version that our team obtained. The blue lines\nrefer to files that differ, while the green lines represent new files. As a result of the\nexamination made on both command and control server software, it was seen that the basic\nchanges were made to manage plugins through the GUI interface, to create a more detailed\nerror log, and to add new language encodings.\n\n\n-----\n\n6 versions of the malware “Command Manager” tool compiled in 2019 have been identified.\nThe timestamps of the detected versions are given in the image below.\n\n**Version** **Compile Time**\n\n3.7.5 Thu Nov 7 16:50:51 2019\n\n3.7.3 Mon Sep 16 18:06:32 2019\n\n3.7.2 Wed Jul 24 20:52:26 2019\n\n3.7.1 Fri Jul 5 21:16:24 2019\n\n3.6.3 Thu May 16 11:13:05 2019\n\n3.6 Fri Apr 19 10:17:22 2019\n\nIn the old version of Bot.dll, which is the component of the malware working on victim\ndevices, 981 functions were detected with disassembly while 706 functions were detected in\nthe new version of the same software. With Diaphora binary diffing tool, 607 functions get the\nbest match score, while 43 functions get partial match. Also, the new bot file has less than\n50kb of file size compared to the old version in Virustotal. When the new bot file is examined,\nit is seen that the functions other than the basic functions in the old version are implemented\n\n\n-----\n\nas plugins. These new plugins, which perform operations such as keylogging, process\nmonitoring, are executed fileless with the reflective loading method. As a result, the file size\nof the malware shrinks, leaving less trace for forensic and signature-based security software\nsolutions. Plugins in the last data obtained in the list below are listed.\n\nhd.plug\nhd64.plug\nhvnc.plug\nhvnc64.plug\nkeylog.dll\nkeylog64.dll\nprocmon.dll\nprocmon64.dll\nrdpwrap.dll\nswitcher.dll\nswitcher64.dll\nvnc.plug\nvnc64.plug\n\nIn this section, some of the plugins that are “not” among the previously discovered files will\nbe examined. As these are among the neverbeforeseen features of the notorious toolkit, we\nbelieve following sections to be very important in terms of further analyzing the group’s TTP.\n\n### Keylogging Plugin\n\nThe “keylog.dll” plugin capturing user keystrokes using the RegisterRawInputDevices API. To\ndetermine in which context the keystrokes are used, “Executable File Path”, “Windows Text”\nand Timestamp information of the foreground process is logged together with the keystrokes.\n\n\n-----\n\nThe keylogging plug-in converts the collected data to Bitmap using Windows GDI + APIs and\nwrites it to the folder named “SA45E91.tmp” in the user’s %TEMP% directory. The image\nbelow shows the function that malicious software uses to store data.\n\n\n-----\n\nThe screenshot of the sample of the logs obtained is given in the image below.\n\n### Process Monitor Plugin\n\nThis plugin can track processes running in the target system and is used to obtain\ninformation about the start and termination times of the desired process. In the image below,\na screenshot of the function that collects information about the running processes is given.\n\n\n-----\n\n## Tirion Loader a.k.a Future of Carbanak Backdoor\n\nThe malware named Tirion, which is thought to be developed to replace the Carbanak\nbackdoor is the new loader tool of the Fin7 group. It contains many functions for information\ngathering, code execution, recon, and lateral movement purposes. As in the latest version of\nthe Carbanak backdoor, which was examined in the previous section, many functions\nperformed by the malware have been developed as separate plugins. They are loaded and\nexecuted fileless in the target system with the reflective loading method. Exposed data\nshows that the development of the Carbanak backdoor is currently stopped and development\nand tests are being performed on the Tirion Loader by the same team. Communication logs\nbetween attackers show that this new tool is intended to replace the Carbanak backdoor. Our\nteam has detected 8 different Tirion Loader command and control servers currently used.\n\n\n-----\n\nThe functions of Tirion malware are as follows:\n\nInformation Gathering\nTaking Screenshot\nList Running Processes\nCommand / Code execution\nProcess Migration\nMimikatz Execution\nPassword Grabbing\nActive Directory and Network Recon\n\nThe latest detected version of Tirion Loader belongs to the version “1.6.4” compiled on “Sun\nJun 28 23:24:03 2020”. The image below shows the actions an attacker can take on a bot\ndevice. The “1.0” version, which is the oldest version detected and thought to be the first\nversion used, was compiled on “Thu Mar 05 20:29:53 2020”.\n\n\n-----\n\nThe following text from the “readme.txt” file written by the attackers clearly states the basic\ncomponents of the malware.\n\nОписание системы удаленного доступа Tirion\n\nСистема состоит из 3-х компонентов:\n\n1. Сервер\n2. Клиент\n3. Лоадер\n\nЭти компоненты связаны следующим образом:\n\nЛоадер переодически коннектится к серверу, клиент подключается к серверу\nс постоянным коннектом. Лоадер выполняет команды от\n\nсервера и передает ему ответы. Через клиента пользователь отдает\nкоманды лоадеру через сервер. Полученны ответы от лоадера,\n\nсервер передает клиенту.\n\nEnglish translation of the related text is given below.\n\n\n-----\n\nThe system consists of 3 components:\n\n1. Server\n\n2. Client\n\n3. Loader\n\nThese components are related as follows:\nThe loader periodically connects to the server, the client connects to the server\nwith a permanent connection. The loader executes commands from server and\nsends it responses. Through the client, the user issues commands to the loader\nthrough the server. Received responses from the loader,the server transmits to\nthe client.\n\nThe file organization of the malware is as follows:\n\n### File Structure\n```\n |-- client\n |  |-- client.exe\n |  |-- client.ini.xml\n |  |-- jumper\n |  |  |-- 32\n |  |  `-- 64\n |  |    `-- l64_r11.ps1\n |  |-- keys\n |  |  `-- client.key\n |  |-- libwebp_x64.dll\n |  |-- libwebp_x86.dll\n |  `-- plugins\n |    `-- extra\n |      |-- ADRecon.ps1\n |      |-- GetHash32.dll\n |      |-- GetHash64.dll\n |      |-- GetPass32.dll\n |      |-- GetPass64.dll\n |      |- PswInfoGrabber32.dll\n |      |- PswInfoGrabber64.dll\n |      |-- PswRdInfo64.dll\n |      |- powerkatz_full32.dll\n |      |- powerkatz_full64.dll\n |      |- powerkatz_short32.dll\n |      `- powerkatz_short64.dll\n |-- loader\n |  |-- builder.exe\n |  |-- loader32.dll\n |  |-- loader32.exe\n\n```\n\n-----\n\n```\n |  | loader32_NotReflect.dll\n |  |-- loader64.dll\n |  |-- loader64.exe\n |  `-- loader64_NotReflect.dll\n |-- readme.txt\n `-- server\n   |-- AV.lst\n   |-- System.Data.SQLite.dll\n   |-- ThirdScripts\n   |-- client\n   |  `-- client.key\n   |-- data.db\n   |-- loader\n   |  `-- keys\n   |    |-- btest.key\n   |    `-- test.key\n   |-- logs\n   |  |-- error\n   |  `-- info\n   |-- plugins\n   |  |-- CommandLine32.dll\n   |  |-- CommandLine64.dll\n   |  |-- Executer32.dll\n   |  |-- Executer64.dll\n   |  |-- Grabber32.dll\n   |  |-- Grabber64.dll\n   |  |-- Info32.dll\n   |  |-- Info64.dll\n   |  |-- Jumper32.dll\n   |  |-- Jumper64.dll\n   |  |-- ListProcess32.dll\n   |  |-- ListProcess64.dll\n   |  |-- NetSession32.dll\n   |  |-- NetSession64.dll\n   |  |-- Screenshot32.dll\n   |  |-- Screenshot64.dll\n   |  |-- extra\n   |  |-- mimikatz32.dll\n   |  `-- mimikatz64.dll\n   |-- server.exe\n   |-- server.ini.xml\n   |-- x64\n   |  `-- SQLite.Interop.dll\n   |-- x86\n     `-- SQLite.Interop.dll\n\n### Readme.txt\n\n```\nThe English translation of some important items of the “readme.txt” file, which indicates the\nchanges from the first version of the malware to the “1.6.3” version and contains the build\ninstructions, is as follows. (Original text in Russian is omitted.)\n\n\n-----\n\nclient 1.6.3\n\n[+] The result of ADRecon work is saved in the database in the loader from which it\nwas launched, when the tab is called again, the data loaded automatically\n\n[+] Added a form for launching the script ps2x.py (PsExec).\nserver 1.5\n\n[+] Added support for executing scripts from the ThirdScripts folder\n\nclient 1.5\n\n[+] Added plugin NetSession. The plugin collects information about the computers\nconnected to the computer where the loader is running.\n\nclient 1.4\n\n[+] added plugin info. In the context menu, select Info and after a while in the Info field\nthere will be the user name, domain and version of Windows\n\nclient 1.3.3\n\n[+] The “Get passwords” button has been added to the mimikatz plugin\n\nclient 1.3.2\n\n[+] Added support for RDP grabber.\nclient 1.3\n\n[+] added plugin mimikatz.\n\n[+] added grabber plugin.\n\nserver 1.2:\n\n[*] updated data transfer protocol\n\n[+] added AV definition, for this there must be an AV.lst file in the server folder\n\nloader:\n\n[*] updated data transfer protocol\n\n[+] sending local\n\nserver 1.1:\n\n[+] - added support for the jumper plugin\n\nclient 1.1\n\n[+] - added support for the jumper plugin\n\n### Loader Component\n\nThis component of the malware that will run on victim systems is about 9kb in size and runs\ncommands from the server. When the attacker wants to run a function on the device in the\nvictim, the related plugin file containing this function is loaded reflectively on the victim device\nand filelessly executed it .\n\n\n-----\n\nNetwork traffic between server and loader is encrypted with the key determined during the\nbuild phase. The following image contains the relevant encryption algorithm.\n\n### PswInfoGrabber\n\nIt is a DLL file responsible for stealing and reporting sensitive information from the target\nsystem, especially browser and mail passwords. It was determined that the attackers also\nused this tool independently from Tirion Loader. In the image below, a screenshot of the logs\ncollected by the malware is included.\n\n## opBlueRaven | Outro & End of Part I\n\nIn the first edition of these series; we wanted to provide an intro towards our operation by\ncomparing the latest Carbanak toolkit, as discovered by PTI, to older versions that have\nbeen publicly accessible.\n\nIn the next article, we will be diving deeper into the TTPs of the attackers by also providing\nreferences from actual conversations between them.\n\nAside, we will also be providing screenshots that have been directly acquired from threat\nactors’ machines. (An exemplary one is given below as a teaser.)\n\n\n-----\n\nPlease feel free to get in touch with us if you have further questions.\n\nCredits: PRODAFT Threat Intelligence Team (PTI), INVICTUS Threat Intelligence Team (ITI)\n\n[namely womd, y.a.p., e.b., a.b.c. and slv]\n\nEdited by [k.u.]\n\nPRODAFT & INVICTUS Out!\n\n## Appendix: YARA Signatures\n```\n import \"pe\"\n rule apt_Fin7_Tirion_plugins\n {\n   meta:\n     author = \"Yusuf A. POLAT\"\n     description = \"Tirion Loader's plugins. It is used by Fin7 group. Need\n manual verification\"\n     version = \"1.0\"\n     date = \"2020-07-22\"  \n     reference = \"https://threatintelligence.blog/\"\n     copyright = \"PRODAFT\"\n     SHA256 = \"fdc0ec0cc895f5b0440d942c0ab60eedeb6e6dca64a93cecb6f1685c0a7b99ae\"\n   strings:\n     $a1 = \"ReflectiveLoader\" ascii\n     $a2 = \"plg.dll\" fullword ascii\n   condition:\n     uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 15000 and\n (pe.exports(\"[email protected]@[email protected]\") or\n       pe.exports(\"[email protected]@[email protected]\"))\n }\n rule apt_Fin7_Tirion_PswInfoGrabber\n {\n   meta:\n\n```\n\n-----\n\n```\n    author Yusuf A. POLAT\n    description = \"Tirion Loader's PswInfoGrabber plugin. It is used by Fin7\ngroup.\"\n    version = \"1.0\"\n    date = \"2020-07-22\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"e7d89d1f23c2c31e2cd188042436ce6d83dac571a5f30e76cbbcdfaf51e30ad9\"\n  strings:\n    $a1 = \"IE/Edge Grabber Begin\" fullword ascii\n    $a2 = \"Mail Grabber Begin\" fullword ascii\n    $a3 = \"PswInfoGrabber\" ascii\n    $a4 = \"Chrome Login Profile: '\"\n    $a5 = \"[LOGIN]:[HOST]:\"\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 150KB\n}\nrule apt_Fin7_Tirion_loader\n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Tirion Loader's loader component. It is used by Fin7 group.\"\n    version = \"1.0\"\n    date = \"2020-07-22\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"e7d89d1f23c2c31e2cd188042436ce6d83dac571a5f30e76cbbcdfaf51e30ad9\"\n  strings:\n    $a1 = \"HOST_PORTS\" fullword ascii\n    $a2 = \"KEY_PASSWORD\" fullword ascii\n    $a3 = \"HOSTS_CONNECT\" ascii\n    $a4 = \"SystemFunction036\"\n    $a5 = \"ReflectiveLoader\"\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 15KB\n}\nrule apt_Fin7_Carbanak_keylogplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's keylogger plugin. It is used by Fin7\ngroup\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"db486e0cb94cf2bbe38173b7ce0eb02731ad9a435a04899a03d57b06cecddc4d\"\n  strings:\n    $a1 = \"SA45E91.tmp\" fullword ascii\n    $a2 = \"%02d.%02d.%04d %02d:%02d\" fullword ascii\n    $a3 = \"Event time:\" fullword ascii\n    $a4 = \"MY_CLASS\" fullword ascii\n    $a5 = \"RegisterRawInputDevices\" fullword ascii\n  condition:\n\n```\n\n-----\n\n```\n    uint16(0)  0x5A4D and (all of ($a )) and filesize 15000\n}\nrule apt_Fin7_Carbanak_procmonplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's process monitoring plugin. It is used by\nFin7 group\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"3bf8610241a808e85e6ebaac2bb92ba4ae92c3ec1a6e56e21937efec71ea5425\"\n  strings:\n    $a1 = \"[%02d.%02d.%04d %02d:%02d:%02d]\" fullword ascii\n    $a2 = \"%s open %s\" fullword ascii\n    $a3 = \"added monitoring %s\" fullword ascii\n    $a4 = \"pm.dll\" fullword ascii\n    $a5 = \"CreateToolhelp32Snapshot\" fullword ascii \n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 10000\n}\nrule apt_Fin7_Carbanak_hdplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's hidden desktop plugin. It is used by\nFin7 group\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"39b545c7cd26258a9e45923053a5a64c9461470c3d7bfce3be1c776b287e8a95\"\n  strings:\n    $a1 = \"hd%s%s\" fullword ascii\n    $a2 = \"Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Explorer\\\\Advanced\"\nfullword ascii\n    $a3 = \"StartHDServer\" fullword ascii\n    $a4 = \"SetThreadDesktop\" fullword ascii\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 15000\n}\nrule apt_Fin7_Carbanak_hvncplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's hvnc plugin. It is used by Fin7 group\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"40ce820df679b59476f5d277350dca43e3b3f8cac7ec47ad638371aaa646c315\"\n  strings:\n\n```\n\n-----\n\n```\n    $a1 VncStartServer fullword ascii\n    $a2 = \"VncStopServer\" fullword ascii\n    $a3 = \"RFB 003.008\" fullword ascii\n    $a4 = \"-nomerge -noframemerging\" fullword ascii\n    $a5 = \"--no-sandbox --allow-no-sandbox-job --disable-3d-apis --disable-gpu\n--disable-d3d11\" fullword wide\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 300000\n}\nrule apt_Fin7_Carbanak_vncplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's vnc plugin. It is used by Fin7 group\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"ecf3679f659c5a1393b4a8b7d7cca615c33c21ab525952f8417c2a828697116a\"\n  strings:\n    $a1 = \"VncStartServer\" fullword ascii\n    $a2 = \"VncStopServer\" fullword ascii\n    $a3 = \"ReflectiveLoader\" fullword ascii\n    $a4 = \"IDR_VNC_DLL\" fullword ascii\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 400000\n}\nrule apt_Fin7_Carbanak_rdpplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's rdp plugin. It is used by Fin7 group\"\n    version = \"1.0\"\n    date = \"2020-07-21\"  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"0d3f1696aae8472145400d6858b1c44ba7532362be5850dae2edbd4a40f36aa5\"\n  strings:\n    $a1 = \"sdbinst.exe\" fullword ascii\n    $a2 = \"-q -n \\\"UAC\\\"\" fullword ascii\n    $a3 = \"-q -u \\\"%s\\\"\" fullword ascii\n    $a4 = \"test.txt\" fullword ascii\n    $a5 = \"install\" fullword ascii\n    $a6 = \"uninstall\" fullword ascii\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 400000\n}\nrule apt_Fin7_Carbanak_switcherplugin \n{\n  meta:\n    author = \"Yusuf A. POLAT\"\n    description = \"Carbanak backdoor's switcher plugin. It is used by Fin7\ngroup\"\n    version = \"1.0\"\n\n```\n\n-----\n\n```\n    date 2020 07 21  \n    reference = \"https://threatintelligence.blog/\"\n    copyright = \"PRODAFT\"\n    SHA256 = \"d470da028679ca8038b062f9f629d89a994c79d1afc4862104611bb36326d0c8\"\n  strings:\n    $a1 = \"iiGI1E05.tmp\" fullword ascii\n    $a2 = \"oCh4246.tmp\" fullword ascii\n    $a3 = \"inf_start\" fullword ascii\n    $a4 = \"Shell_TrayWnd\" fullword ascii\n    $a5 = \"ReadDirectoryChangesW\" fullword ascii\n    $a6 = \"CreateToolhelp32Snapshot\" fullword ascii\n  condition:\n    uint16(0) == 0x5A4D and (all of ($a*)) and filesize < 15000\n}\n\n```\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-07-31 - OpBlueRaven- Unveiling Fin7-Carbanak - Part 1 - Tirion.pdf"
    ],
    "report_names": [
        "2020-07-31 - OpBlueRaven- Unveiling Fin7-Carbanak - Part 1 - Tirion.pdf"
    ],
    "threat_actors": [
        {
            "id": "c9617bb6-45c8-495e-9759-2177e61a8e91",
            "created_at": "2022-10-25T15:50:23.405039Z",
            "updated_at": "2025-03-27T02:00:55.462193Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Carbanak",
                "Anunak"
            ],
            "source_name": "MITRE:Carbanak",
            "tools": [
                "Carbanak",
                "Mimikatz",
                "PsExec",
                "netsh"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "bfded1cf-be73-44f9-a391-0751c9996f9a",
            "created_at": "2022-10-25T15:50:23.337107Z",
            "updated_at": "2025-03-27T02:00:55.445946Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "FIN7",
                "GOLD NIAGARA",
                "ITG14",
                "Carbon Spider",
                "ELBRUS",
                "Sangria Tempest"
            ],
            "source_name": "MITRE:FIN7",
            "tools": [
                "Mimikatz",
                "AdFind",
                "JSS Loader",
                "HALFBAKED",
                "REvil",
                "PowerSploit",
                "CrackMapExec",
                "Carbanak",
                "Pillowmint",
                "Cobalt Strike",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRat",
                "Lizar",
                "TEXTMATE",
                "BOOSTWRITE"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "f4f16213-7a22-4527-aecb-b964c64c2c46",
            "created_at": "2024-06-19T02:03:08.090932Z",
            "updated_at": "2025-03-27T02:05:17.387119Z",
            "deleted_at": null,
            "main_name": "GOLD NIAGARA",
            "aliases": [
                "Carbanak",
                "Carbon Spider ",
                "FIN7 ",
                "Navigator ",
                "Sangria Tempest ",
                "TelePort Crew ",
                "Calcium "
            ],
            "source_name": "Secureworks:GOLD NIAGARA",
            "tools": [
                " Carbanak",
                " Cobalt Strike",
                " DICELOADER",
                " DRIFTPIN",
                " GGLDR",
                " GRIFFON",
                " JSSLoader",
                " Meterpreter",
                " OFFTRACK",
                " PILLOWMINT",
                " POWERTRASH",
                " SUPERSOFT",
                " TAKEOUT",
                " TinyMet",
                "Bateleur"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "bb8702c5-52ac-4359-8409-998a7cc3eeaf",
            "created_at": "2023-01-06T13:46:38.405479Z",
            "updated_at": "2025-03-27T02:00:02.82533Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "JokerStash",
                "ATK32",
                "G0046",
                "Coreid",
                "Carbanak",
                "Sangria Tempest",
                "CARBON SPIDER",
                "GOLD NIAGARA",
                "G0008",
                "ELBRUS",
                "Carbon Spider"
            ],
            "source_name": "MISPGALAXY:FIN7",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d85adfe3-e1c3-40b0-b8bb-d1bacadc4d82",
            "created_at": "2022-10-25T16:07:23.619566Z",
            "updated_at": "2025-03-27T02:02:09.890982Z",
            "deleted_at": null,
            "main_name": "FIN7",
            "aliases": [
                "APT-C-11",
                "ATK 32",
                "Gold Niagara",
                "ITG14",
                "TAG-CR1"
            ],
            "source_name": "ETDA:FIN7",
            "tools": [
                "7Logger",
                "Agentemis",
                "Anunak",
                "Astra",
                "BIOLOAD",
                "BIRDWATCH",
                "Bateleur",
                "Boostwrite",
                "CROWVIEW",
                "Carbanak",
                "Cobalt Strike",
                "CobaltStrike",
                "DICELOADER",
                "DNSMessenger",
                "FOWLGAZE",
                "HALFBAKED",
                "JSSLoader",
                "KillACK",
                "LOADOUT",
                "Lizar",
                "Meterpreter",
                "Mimikatz",
                "POWERPLANT",
                "POWERSOURCE",
                "RDFSNIFFER",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "TEXTMATE",
                "Tirion",
                "VB Flash",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "ed3810b7-141a-4ed0-8a01-6a972b80458d",
            "created_at": "2022-10-25T16:07:23.443259Z",
            "updated_at": "2025-03-27T02:02:09.801771Z",
            "deleted_at": null,
            "main_name": "Carbanak",
            "aliases": [
                "Anunak",
                "Carbanak",
                "Carbon Spider",
                "ELBRUS",
                "Gold Waterfall",
                "Sangria Tempest"
            ],
            "source_name": "ETDA:Carbanak",
            "tools": [
                "AVE_MARIA",
                "Agentemis",
                "AmmyyRAT",
                "Antak",
                "Anunak",
                "Ave Maria",
                "AveMariaRAT",
                "BABYMETAL",
                "BIRDDOG",
                "Backdoor Batel",
                "Batel",
                "Bateleur",
                "BlackMatter",
                "Boostwrite",
                "Cain & Abel",
                "Carbanak",
                "Cl0p",
                "Cobalt Strike",
                "CobaltStrike",
                "DNSMessenger",
                "DNSRat",
                "DNSbot",
                "DRIFTPIN",
                "DarkSide",
                "FOXGRABBER",
                "FlawedAmmyy",
                "HALFBAKED",
                "JS Flash",
                "KLRD",
                "MBR Eraser",
                "Mimikatz",
                "Nadrac",
                "Odinaff",
                "POWERPIPE",
                "POWERSOURCE",
                "PsExec",
                "SQLRAT",
                "Sekur",
                "Sekur RAT",
                "SocksBot",
                "SoftPerfect Network Scanner",
                "Spy.Agent.ORM",
                "TEXTMATE",
                "TeamViewer",
                "TiniMet",
                "TinyMet",
                "Toshliph",
                "VB Flash",
                "WARPRISM",
                "avemaria",
                "cobeacon"
            ],
            "source_id": "ETDA",
            "reports": null
        }
    ],
    "ts_created_at": 1673535909,
    "ts_updated_at": 1743041817,
    "ts_creation_date": 1653759915,
    "ts_modification_date": 1653759915,
    "files": {
        "pdf": "https://archive.orkl.eu/b27768f53e5a614b9aedefa624921deb14c399b5.pdf",
        "text": "https://archive.orkl.eu/b27768f53e5a614b9aedefa624921deb14c399b5.txt",
        "img": "https://archive.orkl.eu/b27768f53e5a614b9aedefa624921deb14c399b5.jpg"
    }
}