{
    "id": "b39d1378-d0bb-4f14-851e-015a332b79e8",
    "created_at": "2023-01-12T15:04:33.759391Z",
    "updated_at": "2025-03-27T02:13:08.205381Z",
    "deleted_at": null,
    "sha1_hash": "2225cf3f622bab77625f162aedc6ea3edbf891ca",
    "title": "2022-01-24 - TrickBot Bolsters Layered Defenses to Prevent Injection Research",
    "authors": "",
    "file_creation_date": "2022-05-28T01:21:58Z",
    "file_modification_date": "2022-05-28T01:21:58Z",
    "file_size": 2287076,
    "plain_text": "# TrickBot Bolsters Layered Defenses to Prevent Injection Research\n\n**[securityintelligence.com/posts/trickbot-bolsters-layered-defenses-prevent-injection/](https://securityintelligence.com/posts/trickbot-bolsters-layered-defenses-prevent-injection/)**\n\n[Home&nbsp/](https://securityintelligence.com/) [Banking & Finance](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\nTrickBot Bolsters Layered Defenses to Prevent Injection Research\n\n[Banking & Finance January 24, 2022](https://securityintelligence.com/category/topics/banking-financial-services-industry/)\n\n\n-----\n\nBy [Michael Gal co-authored by Segev Fogel,](https://securityintelligence.com/author/michael-gal/) [Itzik Chimino 7 min read](https://securityintelligence.com/author/itzik-chimino/)\n_This post was written with contributions from IBM X-Force’s_ _[Limor Kessem and](https://securityintelligence.com/author/limor-kessem/)_ _Charlotte_\n_Hammond._\n\nThe cyber crime gang that operates the TrickBot Trojan, as well as other malware and\n[ransomware attacks, has been escalating activity. As part of that escalation, malware](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\ninjections have been fitted with added protection to keep researchers out and get through\nsecurity controls. In most cases, these extra protections have been applied to injections used\nin the process of online banking fraud — TrickBot’s main activity since its inception after the\n[Dyre Trojan’s demise.](https://securityintelligence.com/dyre-straights-group-behind-the-dyre-trojan-busted-in-moscow/)\n\nIBM Trusteer researchers analyzed TrickBot’s most recent injections and the anti-analysis\ntechniques used to conceal their activity. The information is provided in detail in this post.\n\n## MiTB — The Basics\n\nMan-in-the-browser (MiTB) attacks are a way for adversaries to intercept the communication\nbetween users or users and remote services. The most common use of this interception is by\nbanking Trojans during web sessions. MiTB scripts are designed to modify information going\nout of the browser on the fly so that what reaches the bank’s server fits the criminal’s\ndirections.\n\nTrickBot is one of the most modular and sophisticated modern Trojans. It uses a variety of\n[injections, some of which are very advanced, to trick both users and their service providers in](https://securityintelligence.com/an-aggressive-launch-trickbot-trojan-rises-with-redirection-attacks-in-the-uk/)\norder to commit bank fraud. In TrickBot’s case, injections can either be fetched locally from\nconfiguration files or in real-time from the attacker’s inject server.\n\nWhile one might be able to extract a list of TrickBot targets from its configuration files, things\nget a lot harder for those seeking to understand what activity will be launched against each\ntarget. As with other banking Trojans, the attack tactics change for each bank to match the\nchallenges fraudsters will encounter before a transaction is authorized.\n\n## First Line of Defense: Server-Side Injection Delivery\n\nKeeping injections on infected machines means they are more likely to land in the hands of\nsecurity researchers. Injections kept locally are also less agile and harder to manipulate in\nreal-time. To move beyond these risks, TrickBot’s operators inject from their server, known as\nserver-side injections. To facilitate fetching the right injection at the right moment, the\nresident TrickBot malware uses a downloader or a JavaScript (JS) loader to communicate\nwith its inject server.\n\n\n-----\n\n_Figure 1: TrickBot’s server-side injection flow_\n\n## Second Line of Defense: Secure Communications With the C2\n\nFor operational security, the JS downloader fetches injections via a secure request using the\nHTTPS protocol to the attacker’s command and control (C2) server. It provides that request\nusing a referrer policy parameter with the flag ‘unsafe-URL.’ The flag specifies that a\ncomplete URL, stripped for use as a referrer, is to be sent along with both cross-origin\nrequests and same-origin requests made from a particular client. In TrickBot’s case, using\nthis flag likely provides information about the specific page the user is browsing to the C2\nserver, allowing the C2 server to send custom injections per page. The attacker can also use\nthe information to ignore requests from unwelcome/unknown sources or pages, thus sending\nnothing back to the client side.\n\n_Figure 2: HTTPS requests to the C2 server with referrer policy_\n\nFor secure communication with a remote inject server, TrickBot hooks the certificate\nverification function on the infected device. It thereby blocks any certificate errors that the\nvictim might otherwise be alerted to during the malicious communication with the attack\nserver.\n\nThe request to the C2 server yields a web injection that was designated by the attacker for\neach targeted bank URL. Each injection is used to interact with the victims and trick them\ninto divulging details that will help the attack finalize the transaction.\n\n\n-----\n\n_Figure 3: Web injections collecting user credentials on an infected device_\n\nA glance at the data collected also shows the injection scrapes the device’s fingerprint and\nsends it to the C2 server.\n\n\n-----\n\n_Figure 4: Web injections collecting fingerprint on an infected device_\n\nThe fingerprint data is quite elaborate, including browser parameters, language settings,\noperating system basics, user agent, plugins and more. Stolen fingerprint data helps\nattackers get more information about each session and impersonate victims in fraudulent\nactivity.\n\n## Third Line of Defense: Anti-Debugging\n\nTo further protect its injections, TrickBot added an anti-debugging script to the JS code. The\ngoal is to anticipate the typical actions researchers will take and ensure their analysis fails. In\nthis case, TrickBot can trigger a memory overload that would crash the page and hinder the\nanalysis.\n\nOne of the ways TrickBot’s developer achieved this is by looking for ‘code beautifying’\nperformed by the researcher. When someone encounters a large block of code that is very\n‘messy’ to a human eye, they will apply ‘beautifying’ to it. For instance, when looking at\nobfuscated injection code, a researcher may start by decoding it from the Base64 format,\nthen make all literals and functions human readable. Literal values are changed to real ones,\ncode is divided into chunks, etc. All these efforts are part of code beautifying, and TrickBot\nexpects that from researchers, making it a good place to hold them back.\n\nSearching for code beautifying, TrickBot uses a RegEx to check a function named\n‘this[‘Ccmdra’].’ If this function is run through the eval(atob function in its original state, it will\nappear as this[‘Ccmdra’] = function(){return’newState’;} without any new lines or spaces,\nwhich are typically added when someone beautifies code.\n\nHowever, if the code was beautified by someone, they would likely remove the base64\nencoding and replace the function with its decoded contents. It might look more orderly.\n\nthis[‘Ccmdra’] = function(){\n\nreturn’newState’;\n\n}\n\n\n-----\n\n_Figure 5: Is the code beautified?_\n\n_Figure 6: Now the code is beautified_\n\nTrickBot uses a RegEx to detect the beautified setup and throw itself into a loop that\nincreases the dynamic array size on every iteration. After a few rounds, memory is eventually\noverloaded, and the browser crashes.\n\n_Figure 7: Browser crashes after memory overload_\n\n## Fourth Line of Defense: Obfuscation and Encoding\n\n\n-----\n\n[The code TrickBot injects is meant to be obfuscated. It is first encoded with Base64 so that](https://en.wikipedia.org/wiki/Base64)\nscripts are not in plain text. The following techniques are used by TrickBot’s developers to\nachieve some added obfuscation:\n\n**Minify/Uglify — Through a series of transformations, such as variables, function, arguments**\nrenaming and string removal, TrickBot’s code is made to appear unreadable to human eyes,\nall while working the same.\n\n**String extraction and replacement — window.console.log(1) can be written as**\nwindow[‘console’][‘log’](1). The obfuscator moves all strings to an array and encrypts them,\nwhich hides functions, literals, arguments and information about the program’s execution.\n\n**Number base and representing — TrickBot uses hex representation to represent numbers**\nand initialize variables into some value in a complex way. For example, instead of writing:\n\nvar num = 0;\n\nThis could be replaced with:\n\nwrite var num = (0x130 * 0x11 + -0x17f5 + 0x2e * 0x15, -0x24a5 + 0x68e * -0x4 + 0x3edd,\n-0x17f1 + -0x99b * 0x3 + 0x34c2)\n\nThis tactic is common to many obfuscators.\n\n**Dead code injection — To make things more confusing, TrickBot’s developers added**\nredundant code. This makes code less readable and renders its actions harder to decipher.\nThis resembles malware that imports redundant modules to hide their true purpose.\n\n**Monkey patching — Patching native functions to change their behavior in a way that makes**\nit impossible to understand what is being activated using static analysis.\n\n## Dominating the Cyber Crime Arena\n\nThe TrickBot Trojan and the gang that operates it have been a cyber crime staple since they\ntook over when a predecessor, [Dyre, went bust in 2016. TrickBot has not rested a day.](https://securityintelligence.com/dyre-straights-group-behind-the-dyre-trojan-busted-in-moscow/)\nBetween takedown attempts and a global pandemic, it has been diversifying its monetization\n[models and growing stronger.](https://securityintelligence.com/posts/trickbot-gang-doubles-down-enterprise-infection/)\n\nWhether through ransomware attacks or by partnering with other cyber crime gangs and\nservice providers from Eastern Europe, TrickBot remains a concern to businesses on a few\nfronts. TrickBot goes after corporate money, facilitates ransomware and extortion attacks,\nand deploys other unwelcome malware on the network.\n\nTrickBot distributes multi-stage malware through phishing emails, malspam, botnets,\nhijacked email conversations and even a malicious call center known as BazarCall. While\nthemes vary often a booby-trapped attachment is a way to infect users The method used in\n\n\n-----\n\neach campaign is shuffled often, which can make it harder to anticipate. TrickBot\nincorporates vulnerabilities, lateral movement tools like Cobalt Strike and living-off-the-land\ntactics like PowerShell scripts.\n\nTo mitigate the risk from TrickBot infections, employees should be kept up to date on recent\nattack tactics, and relevant threat intelligence should be incorporated into the choice of\nsecurity controls that protect your organization. In addition, you should:\n\nUse an email security solution to scan, filter and strip attachments as needed. This is\nespecially important for macro-enabled attachments.\nConsider the use of email spoofing prevention protocols to help lower the risk of\nreceiving email from suspicious sources.\nFollow least privilege principles and minimize the number of privileged accounts on\nnetworks and cloud assets.\nActivate multi-factor authentication on privileged accounts, and preferably on all\naccounts.\nDesign architectural controls for network segregation. This can help limit lateral\nmovement and minimize broader infection and data theft.\nMonitor for lateral movement.\nHave offline backups and a backup schedule. TrickBot infections are very likely to\nbecome ransomware attacks.\nMake sure data classified as confidential or data that could expose customers and the\norganization to extortion is encrypted (on-prem and in the cloud). Ransomware attacks\noften include data extortion.\nContinue role-based employee training to ensure the organization’s employees protect\nthe organization from malware.\n[Learn about zero trust and begin your zero trust journey, if you haven’t done so](https://www.ibm.com/security/zero-trust)\nalready.\n\nFor more about IBM Trusteer, visit: [www.ibm.com/security/fraud-protection/trusteer](https://www.ibm.com/security/fraud-protection/trusteer)\n\n## IOCs From IBM’s Analysis\n\nDomains/ resources\n\nhxxps:\\/\\/myca.adprimblox.fun\n\nhxxps:\\/\\/ksx.global-management-holdings.com\n\nhxxps:\\/\\/on.imagestorage.xyz\n\nhxxps:\\/\\/997.99722.com\n\nhxxps:\\/\\/akama.pocanomics.com\n\n\n-----\n\nhxxps:\\/\\/web7.albertleo.com\n\nIP addresses\n\n94.242.58.165\n185.14.30.111\n208.115.238.183\n51.83.210.212\n103.119.112.188\n185.198.59.85\n\nSHA1 hashes\n\njquery-1.10.1.js: 5acd3cddcc921bca18c36a1cb4e16624d0355de8\ndownloader js: ae1b927361e8061026c3eb8ad461b207522633f2\n\n[Michael Gal](https://securityintelligence.com/author/michael-gal/)\nSecurity Web Researcher, IBM\n\nMichael Gal is a contributor for SecurityIntelligence.\n\n\n-----\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2022/2022-01-24 - TrickBot Bolsters Layered Defenses to Prevent Injection Research.pdf"
    ],
    "report_names": [
        "2022-01-24 - TrickBot Bolsters Layered Defenses to Prevent Injection Research.pdf"
    ],
    "threat_actors": [
        {
            "id": "77b28afd-8187-4917-a453-1d5a279cb5e4",
            "created_at": "2022-10-25T15:50:23.768278Z",
            "updated_at": "2025-03-27T02:00:55.5423Z",
            "deleted_at": null,
            "main_name": "Inception",
            "aliases": [
                "Inception Framework",
                "Cloud Atlas"
            ],
            "source_name": "MITRE:Inception",
            "tools": [
                "PowerShower",
                "VBShower",
                "LaZagne"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "610a7295-3139-4f34-8cec-b3da40add480",
            "created_at": "2023-01-06T13:46:38.608142Z",
            "updated_at": "2025-03-27T02:00:02.87217Z",
            "deleted_at": null,
            "main_name": "Cobalt",
            "aliases": [
                "Cobalt Gang",
                "GOLD KINGSWOOD",
                "COBALT SPIDER",
                "G0080",
                "Mule Libra",
                "Cobalt Group"
            ],
            "source_name": "MISPGALAXY:Cobalt",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d1f8bd4e-bcd4-4101-9158-6158f1806b38",
            "created_at": "2023-01-06T13:46:39.487358Z",
            "updated_at": "2025-03-27T02:00:03.107568Z",
            "deleted_at": null,
            "main_name": "BazarCall",
            "aliases": [
                "BazaCall",
                "BazzarCall"
            ],
            "source_name": "MISPGALAXY:BazarCall",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673535873,
    "ts_updated_at": 1743041588,
    "ts_creation_date": 1653700918,
    "ts_modification_date": 1653700918,
    "files": {
        "pdf": "https://archive.orkl.eu/2225cf3f622bab77625f162aedc6ea3edbf891ca.pdf",
        "text": "https://archive.orkl.eu/2225cf3f622bab77625f162aedc6ea3edbf891ca.txt",
        "img": "https://archive.orkl.eu/2225cf3f622bab77625f162aedc6ea3edbf891ca.jpg"
    }
}