{
    "id": "b39e4f15-518e-4ecd-a14f-828ade924c7c",
    "created_at": "2023-01-12T15:06:05.429147Z",
    "updated_at": "2025-03-27T02:05:47.065167Z",
    "deleted_at": null,
    "sha1_hash": "1a9ab3a18493479a74cc722ebc7129252b4234d8",
    "title": "2020-11-25 - Microsoft Teams- New Attack Form Almost Takes Down Global Financial Institution",
    "authors": "",
    "file_creation_date": "2022-05-28T05:08:02Z",
    "file_modification_date": "2022-05-28T05:08:02Z",
    "file_size": 433207,
    "plain_text": "# Global Financial Institution's Microsoft Teams Account Compromised by Malware\n\n**[avanan.com/blog/proof-of-concept-teams-malware-attack-found-in-wild](https://www.avanan.com/blog/proof-of-concept-teams-malware-attack-found-in-wild)**\n\n[1. Blog Home](https://www.avanan.com/resources/topic/blog)\n[2. Attack Briefs](https://www.avanan.com/resources/topic/attack-briefs)\n3. Microsoft Teams Accounts Compromised Through Malware Attack\n\n\n-----\n\nPosted by [Michael Landewe on November 25, 2020](https://www.avanan.com/blog/author/michael-landewe)\n\n[Tweet](https://twitter.com/share)\n\n\n-----\n\n## Summary\n\nA compromised Microsoft Teams account at a partner organization fooled users at a\nglobal financial institution into sharing insider information.\nAfter exfiltrating data via the compromised account, the attacker escalated the attack\nby sharing a Remote Access Trojan (RAT) to members of the group that was\n_specifically designed to bypass Teams protections._\n**This attack bypasses both the default and Advanced Threat Protection (ATP)**\n**Teams protections but was caught by Avanan.**\nThis is a new methodology that shows how hackers are starting to use different tactics\nto target Teams over email.\n[As Microsoft Teams usage rapidly expands, Avanan analysts expect this type of](https://www.avanan.com/)\nmalware attack to gain widespread prominence.\n\n## New Attack Proves Teams Attacks Are Targeted\n\nWhen a [Microsoft 365 account is compromised, one of the first things hackers check for is if](https://www.avanan.com/blog/what-to-do-when-compromised)\n[the person has a Teams account. Hackers consider this a high-value account, given the free-](https://www.avanan.com/teams-security)\nflowing of information and data.\n\n[Currently, Avanan secures Microsoft Teams for about 150 of its enterprise customers. Last](https://www.avanan.com/teams-security)\nweek, Avanan's security analysts observed a compromised Teams account and noticed that\n**hackers are exploiting Teams differently than they do email. Instead of typical spray and**\npray tactics, hackers infiltrating Teams accounts are thoughtful and patient, waiting for the\nright moment to strike.\n\nAvanan analysts have identified this approach as a harbinger of Teams attacks to come—\nand in the case of one large, global financial institution, it was enough to almost bring it to its\nknees.\n\n[This specific malware attack used Microsoft Teams as a vector to install a remote control](https://www.avanan.com/anti-malware-software)\ntrojan from a compromised Teams account.\n\nA malicious payload was sent via a Teams chat from a compromised partner organization\nand was specifically designed to both bypass built-in protections and fool the user into\nopening the malicious file.\n\n**Though this attack bypassed both EOP and ATP, it was caught and stopped by**\n**Avanan.**\n\n### The Attack Leveraged Teams to Include a Silent Installer of Remote Monitoring Software\n\nThis attack involves two companies. The Avanan customer is a global financial firm—and\nthen there's a partner organization that they work with.\n\n\n-----\n\nBased on our analysis, an account in the partner organization was compromised for almost\none year, and the hacker listened in on an inter-organizational Teams chat. Over the course\nof the year, the malicious actor did not contribute in that group channel. This is the antithesis\nof typical spray-and-pray modus operandi when an email account gets compromised.\n\nAnd then the opportunity for the hacker came. The attacker responded to a team-wide\nrequest for some files with the message:\n\n“some of these were large, so I zipped them. Lmk if you have trouble and I can\nresend.”\n\nThe file included an easily-obtainable hacked version of desktop-monitoring software,\nconfigured to install silently upon clicking the file. This Remote Access Trojan would have\ngiven the attacker full access to both monitor and control the victim’s desktop.\n\nHad the file reached the user, she would have opened the file and installed the malware with\nno local alert or message that anything was wrong.\n\nBecause the message included multiple files, including legitimate, pertinent documents, the\nrecipient would have been none the wiser.\n\n### The Trojan Software Was Designed to Bypass Built-in Teams Protections\n\nThe RAT was designed to bypass Microsoft malware filters.\n\nMost organizations rely on the default, signature-based protection for Microsoft Teams, but\nthis firm had also upgraded to the additional Advanced Threat Protection subscriptions. With\nthe ATP upgrade, files that are shared via Teams may be scanned by sandboxing filters\nwhen they are uploaded to the associated ShareFile/OneDrive directory.\n\n\n-----\n\nIt is clear, though, that the attacker had assumed such defenses, as the Trojan included a\nvariety of methods to detect both sandboxing tools and Windows desktop protections. (The\nsandboxing tools used by Avanan use these methods as indicators of attack.)\n\nWhen tested against Advanced Threat Protection (both the email and file-share scanning\ntools), this Trojan went undetected. Unbeknownst to the attacker, the Avanan system\n**identified and blocked the malicious file, protecting the user and outing the**\n**compromised account.**\n\n### This is The New Teams Attack\n\nWhile attacks that use Microsoft Teams as a vector are currently less common than email[borne attacks, there are some lessons to be learned from Slack-based attacks, which](https://www.avanan.com/blog/slack-teams-vulnerabilities)\nbecame ubiquitous in 2019.\n\n**Compromising a Teams account is ‘easy’. Attackers are already very adept at**\n[compromising Microsoft 365 accounts using traditional email phishing methods. The](https://www.avanan.com/blog/6-things-atp-office-365-security)\nsame credentials work for Teams.\n\n\n-----\n\n**Attacks that use Teams or Slack as a vector are silent and stealthy, designed to**\n**avoid detection. Because of the inherent trust that users grant to Teams or Slack**\nmessages, attackers are very careful about potential discovery. Slack and Teams are\nthe preferred internal East-West vector for attackers to spread inside the organization.\n**Malware or phishing URLs are specifically targeted to bypass built-in**\n**protections. Once inside an organization, an attacker (normally) knows what**\ntechnology is being used to protect it. An attack that uses Teams as a vector will have\nalready been tested against Microsoft filters.\n\n## This Single Incident is Highly Scalable into a Widespread Campaign\n\nWhen [Slack first became the most commonly used collaboration tool, small attacks found in](https://www.avanan.com/blog/is-slack-secure)\nisolated organizations soon became widespread.\n\nMicrosoft Teams is now, by far, the most-used internal collaboration tool, as usage of the\nservice grew exponentially during the COVID-19 pandemic. Teams now has 115 million daily\nactive users, nearly one hundred million more than the latest Slack usage numbers. As\nTeams usage continues to increase, Avanan expects a significant increase in these sorts of\nattacks.\n\nBecause Teams is used in a variety of organizations that host scores of sensitive information,\n[there is vast opportunity for data exfiltration. Microsoft announced that 91 of the Fortune’s](https://www.microsoft.com/en-us/microsoft-365/blog/2019/03/19/microsoft-teams-experiences-intelligent-workplace/)\n100 companies use Teams, including major pharmaceutical companies like Pfizer and a\nnumber of financial institutions. This type of attack would cause significant damage.\n\nThis attack demonstrates that hackers are beginning to understand and better utilize Teams\nas a potential attack vector. If Teams campaigns follow the trajectory of Slack-based attacks,\nwe foresee large-scale Teams-based campaigns in 2021.\n\n[Tweet](https://twitter.com/share)\n\nTopics:\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-11-25 - Microsoft Teams- New Attack Form Almost Takes Down Global Financial Institution.pdf"
    ],
    "report_names": [
        "2020-11-25 - Microsoft Teams- New Attack Form Almost Takes Down Global Financial Institution.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535965,
    "ts_updated_at": 1743041147,
    "ts_creation_date": 1653714482,
    "ts_modification_date": 1653714482,
    "files": {
        "pdf": "https://archive.orkl.eu/1a9ab3a18493479a74cc722ebc7129252b4234d8.pdf",
        "text": "https://archive.orkl.eu/1a9ab3a18493479a74cc722ebc7129252b4234d8.txt",
        "img": "https://archive.orkl.eu/1a9ab3a18493479a74cc722ebc7129252b4234d8.jpg"
    }
}