{
    "id": "b3bd5fce-4681-4b8e-8284-05617b2b9f9c",
    "created_at": "2023-01-12T15:09:26.493712Z",
    "updated_at": "2025-03-27T02:14:39.16473Z",
    "deleted_at": null,
    "sha1_hash": "04aae4bc11412d5574e58e1a0c46f6ecb3871a64",
    "title": "2017-07-03 - Who is behind Petna-",
    "authors": "",
    "file_creation_date": "2022-05-27T23:13:31Z",
    "file_modification_date": "2022-05-27T23:13:31Z",
    "file_size": 112621,
    "plain_text": "# Who is behind Petna?\n\n**[gdatasoftware.com/blog/2017/07/29859-who-is-behind-petna](https://www.gdatasoftware.com/blog/2017/07/29859-who-is-behind-petna)**\n\nThe news talk about a cyber attack when reporting about Petna and WannaCry. This implies\npurposeful activities aiming at causing damage. On the other hand, cyber-criminals who are\nin the blackmailing business with ransomware are mainly interested in making easy money.\nThey failed both with WannaCry and even more with Petna. This leaves some open\nquestions.\n\n## From Petya via GoldenEye to Petna\n\nWhen Petya [spread for the first time in March 2016, the ransomware stood out by in terms of](https://www.gdatasoftware.com/blog/2016/03/28213-ransomware-petya-encrypts-hard-drives)\nefficiency, the new technical approach and the well-designed phishing campaign. Emails with\ntypical job applications written in flawless German point to a file in Dropbox. If you download\nand open it, the first sectors of the harddrive will be overwritten. After a reboot the Master\nFile Tabel (MFT) is encrypted: the files are still on the harddrive, but the system cannot\naccess them. The technical sophistication consists in the few hundred bytes of code written\nto the first sectors of the harddrive, which manage the whole logic of decryption and system\nrecovery. It even contained the infamous \"skull\" screen.\n\nPetya had a few drawbacks. First and foremost, it needs admin privileges. That's why Petya\nafter a short while got a companion: Mischa. Mischa only needed user rights and was a\n[classic file encrypting ransomware. The combination of both circulated in May 2016 and](https://blog.malwarebytes.com/threat-analysis/2016/05/petya-and-mischa-ransomware-duet-p1/)\n[were merged with slight changes under the new name of GoldenEye in December 2016.](https://www.gdata.de/blog/2016/12/29370-neue-ransomware-variante-golden-eye)\nAgain, it used a phishing scam based on job applications in perfect language, some of which\nwere actually referring to real, existing job offers. The payment of the ransom was automated\nwith a TOR hidden service. Both Petya and GoldenEye were very effective ransomware\ncampaigns, and as such were quite profitable. Then it became silent around the actors\n[behind of GoldenEye, who were acting under the name of Janus.](https://twitter.com/JanusSecretary)\n\nA now, half a year later, a ransomware has been spreading that also triggers a reboot, and\nencrypts the Master File Table. The evident similarity to Petya caused many researchers to\nname the new threat \"Petya\", too. But first doubts emerged soon, which are reflected in\nnames like NotPetya, Nyetya, or Petna.\n\n## How much Petya is in Petna?\n\nIt soon turned out that Petya's code for encrypting the MFT is almost a complete copy of the\noriginal Petya-code from the GoldenEye version. It utilizes Salsa20 for encryption and the\nimplementation is done in a way, that decryption is not possible. There were only small\n\n\n-----\n\nchanges: The original key of Petya was replaced by anonther one, which is constructed from\nrandom numbers. Not even the authors of Petna know this key. I.e. decryption of the data is\nnot possible by any stretch of the imagination.\n\nAnd that's already the end of similarities. The two other components of GoldenEye - the\ndropper for the encryption component, and the user-mode ransomware Mischa - are\ncompletely rewritten. This might have been a usual maintenance of the software. GoldenEye\nalso had major modifications in relation to the original Petya especially in these two\ncomponents. But it may also be the case that someone reused the code of GoldenEye's\nPetya. All it needs is an infected machine, and a hex editor. The malicious code is available\nin the first sectors of the harddrive. The changes mentioned above do not need a\nrecompilation and hence not the original source code.\n\nMore interesting than the similarities are the differences. It starts with the infection method.\nPetya and GoldenEye were using phishing mails addressed to German human resource\nmanagers. And now Petna is infecting systems with drive-by-infections on websites in a\n[waterhole attack? Or even more outlying it abuses the update mechanism of a financilal](https://twitter.com/craiu/status/880011103161524224)\nsoftware called MEDoc which is popular in Ukrainian enterprises. It is not very likely that\n[Janus is suddenly changing an established strategy. After months of silence they announced](https://twitter.com/JanusSecretary/status/880156466115743744)\nto participate in the search for the decryption key. Obviously there is another group behind\nthis. There are some clues that the [Telebots group has relations to Petna.](https://www.welivesecurity.com/2017/06/30/telebots-back-supply-chain-attacks-against-ukraine/)\n\n## Few similarities to WannaCry\n\nThe last big wave of ransomware WannaCry is slowly fading out, and there are some\nparallels with Petna. Petna uses the same vulnerability from the NSA leaks: EternalBlue. But\nPetna does not propagate over the internet. It only spreads in local networks. Petna also has\nsome additional characteristics. EternalBlue is combined with another vulnerability from the\nNSA leaks: [EternalRomance. In addition Petna identifies domain controllers and runs special](https://technet.microsoft.com/en-us/library/security/ms17-010.aspx)\nsearches in order to locate other machines on the network. It also spreads by using the WMI\nadministration console, and by probing admin$ shares with passwords and starting the\ninfection with the tool psexec. WannaCry lacks all of these additional propagation vectors.\n\nIt is also exceptional that Petna is deleting USN journals and certain Event-Logs of infected\ncomputers. This is where Windows is logging the system's activities. By deleting these\nentries Petna impedes the analysis of affected systems, and - even more important - evades\ndetection by logfile analysis as it is used in Security Information and Event Management\n(SIEM) systems, which are often used in huge enterprises. Thus the malware specialists in\nthe Security Operation Centers (SOC) might notice the malicious activities too late.\n\n## What the intention of Petna's creators?\n\n\n-----\n\nBy addressing human resource managers, Petya was sort of targeting enterprises. Petna is\nobviously aiming at major companies in a certain region. A tax and accounting software that\nis frequently used in Ukraine is part of the initial infection vector, it only spreads in local\nnetworks, and it hides from detection methods, which are only used in large enterprises.\nLooking at the list of victims this worked out well: oil production, banks, cash desks,\nproduction lines, logistics, etc. were shut down. PCs of private users are not affected.\n\nThere are several ransomware families, which are specialised on enterprises or at least\nidentify that they are running in a company network. This usually implies higher ransom. 4figure sums are quite common, but it could also be a 5-figure or a 6-figure digit. Petna is\nasking a ransom of 300 USD in BitCoins. This is the lower end for private users. This small\nprice strongly indicates that this ransomware was not about making money. This conclusion\nis is supported by the sloppy implementation of the payment process. It is based on a single\nemail address from a German provider. The email address was blocked promptly. So victims\nwho paid could no longer send the notification. As Petna is not able to decrypt the files\n[anyway, there is no point in paying. The associated BitCoin account is currently holding](https://blockchain.info/address/1Mz7153HMuxXTuR2R1t78mGSdzaAtNbBWX)\nabout 4 BTC which is a little bit more than 10,000 USD. Given the current exchange rate this\nmeans that there were 29 victims who paid the ransom (with 46 transactions). From a\nfinancial point of view Petna is a flop.\n\n## Cyber attacks\n\nMaybe money was not the primary motivation for Petna. Come to think of it, why is someone\nputting so much effort into intruding the networks of large Ukranian and worldwide\nenterprises, and the lets it all down with a poorly implemented payment system? On a\nsecond thought, it appears that it might be an act of targeted sabotage. But then, the fact that\nPetna spread so widely is not typical for a targeted attack. It could have been contained\nbetter to remain under the radar. It might have been a test run 'gone wild'. This is further\nbacked by the fact that no updated versions were used after the first wave.\n\nAn [international law enforcement team is trying to find out where the attacks were](https://www.theregister.co.uk/2017/06/30/europol_fbi_uks_nca_ride_out_to_ukraines_cavalry_call/)\noriginating. It is too early to say whether there are nation states involved. But NATO is\nmaking clear that it is considering \"cyber\" as a military domain, and that attacks in this\ndomain may trigger Article 5, assuming that reliable attribution is possible with. It is currently\nnot known who is behind the current attacks.\n\n## Lessons learned\n\nSome companies were hit very hard. The trouble that logistics giant Maersk was affected,\ntoo, shows how much an entire business area is reliant on a working computer infrastructure.\nPetna and WannaCry also showed, that in many enterprises or at least areas of enterprises\nthe protection measures are suitable to prevent and block the attack or at least deal with it\nswiftly. Petna also demonstrated that there are other areas where protection is not yet\n\n\n-----\n\nsufficient. It is necessary for companies to improve the protection of these areas and that\nthere is homework to be done. The protection methods are as individual as companies are.\nWhen in doubt, companies should ask advice from security experts (e.g. G DATA Advanced\nAnalytics). If Petna was indeed a test run, then its evaluation is now in progress and the\nlessons learned will be considered in the next round. There is not much time left to safeguard\nyour IT.\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2017/2017-07-03 - Who is behind Petna-.pdf"
    ],
    "report_names": [
        "2017-07-03 - Who is behind Petna-.pdf"
    ],
    "threat_actors": [
        {
            "id": "42a6a29d-6b98-4fd6-a742-a45a0306c7b0",
            "created_at": "2022-10-25T15:50:23.710403Z",
            "updated_at": "2025-03-27T02:00:55.531313Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "Whisper Spider"
            ],
            "source_name": "MITRE:Silence",
            "tools": [
                "Winexe",
                "SDelete"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "88e53203-891a-46f8-9ced-81d874a271c4",
            "created_at": "2022-10-25T16:07:24.191982Z",
            "updated_at": "2025-03-27T02:02:10.13692Z",
            "deleted_at": null,
            "main_name": "Silence",
            "aliases": [
                "ATK 86",
                "Contract Crew",
                "TAG-CR8",
                "TEMP.TruthTeller",
                "Whisper Spider"
            ],
            "source_name": "ETDA:Silence",
            "tools": [
                "EDA",
                "EmpireDNSAgent",
                "Farse",
                "Ivoke",
                "Kikothac",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "Meterpreter",
                "ProxyBot",
                "ReconModule",
                "Silence.Downloader",
                "TiniMet",
                "TinyMet",
                "TrueBot",
                "xfs-disp.exe"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "a66438a8-ebf6-4397-9ad5-ed07f93330aa",
            "created_at": "2022-10-25T16:47:55.919702Z",
            "updated_at": "2025-03-27T02:05:17.412024Z",
            "deleted_at": null,
            "main_name": "IRON VIKING",
            "aliases": [
                "ATK14 ",
                "BlackEnergy Group",
                "Blue Echidna ",
                "CTG-7263 ",
                "ELECTRUM ",
                "FROZENBARENTS ",
                "Hades/OlympicDestroyer ",
                "IRIDIUM ",
                "Qudedagh ",
                "Sandworm Team ",
                "Seashell Blizzard ",
                "TEMP.Noble ",
                "Telebots ",
                "Voodoo Bear ",
                "APT44 "
            ],
            "source_name": "Secureworks:IRON VIKING",
            "tools": [
                " BlackEnergy",
                " GCat",
                " GreyEnergy",
                " Industroyer",
                " KillDisk",
                " NotPetya",
                " PSCrypt",
                " TeleBot",
                " TeleDoor",
                " xData",
                "BadRabbit"
            ],
            "source_id": "Secureworks",
            "reports": null
        },
        {
            "id": "b3e954e8-8bbb-46f3-84de-d6f12dc7e1a6",
            "created_at": "2022-10-25T15:50:23.339976Z",
            "updated_at": "2025-03-27T02:00:55.446795Z",
            "deleted_at": null,
            "main_name": "Sandworm Team",
            "aliases": [
                "Sandworm Team",
                "ELECTRUM",
                "Telebots",
                "IRON VIKING",
                "BlackEnergy (Group)",
                "Quedagh",
                "Voodoo Bear",
                "IRIDIUM",
                "Seashell Blizzard",
                "FROZENBARENTS",
                "APT44"
            ],
            "source_name": "MITRE:Sandworm Team",
            "tools": [
                "Bad Rabbit",
                "Mimikatz",
                "Exaramel for Linux",
                "Exaramel for Windows",
                "GreyEnergy",
                "PsExec",
                "Prestige",
                "P.A.S. Webshell",
                "VPNFilter",
                "Cyclops Blink",
                "SDelete",
                "AcidRain",
                "Industroyer",
                "Industroyer2",
                "BlackEnergy",
                "Cobalt Strike",
                "NotPetya",
                "KillDisk",
                "PoshC2",
                "Impacket",
                "Invoke-PSImage",
                "Olympic Destroyer"
            ],
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "39842197-944a-49fd-9bec-eafa1807e0ea",
            "created_at": "2022-10-25T16:07:24.310589Z",
            "updated_at": "2025-03-27T02:02:10.167471Z",
            "deleted_at": null,
            "main_name": "TeleBots",
            "aliases": [],
            "source_name": "ETDA:TeleBots",
            "tools": [
                "BadRabbit",
                "Black Energy",
                "BlackEnergy",
                "CredRaptor",
                "Diskcoder.C",
                "EternalPetya",
                "ExPetr",
                "Exaramel",
                "FakeTC",
                "Felixroot",
                "GreyEnergy",
                "GreyEnergy mini",
                "KillDisk",
                "LOLBAS",
                "LOLBins",
                "Living off the Land",
                "NonPetya",
                "NotPetya",
                "Nyetya",
                "Petna",
                "Petrwrap",
                "Pnyetya",
                "TeleBot",
                "TeleDoor",
                "Win32/KillDisk.NBB",
                "Win32/KillDisk.NBC",
                "Win32/KillDisk.NBD",
                "Win32/KillDisk.NBH",
                "Win32/KillDisk.NBI",
                "nPetya"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "8941e146-3e7f-4b4e-9b66-c2da052ee6df",
            "created_at": "2023-01-06T13:46:38.402513Z",
            "updated_at": "2025-03-27T02:00:02.824555Z",
            "deleted_at": null,
            "main_name": "Sandworm",
            "aliases": [
                "G0034",
                "IRIDIUM",
                "Blue Echidna",
                "FROZENBARENTS",
                "Seashell Blizzard",
                "IRON VIKING",
                "ELECTRUM",
                "TeleBots",
                "UAC-0113",
                "UAC-0082",
                "APT44",
                "Quedagh",
                "VOODOO BEAR",
                "TEMP.Noble"
            ],
            "source_name": "MISPGALAXY:Sandworm",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        }
    ],
    "ts_created_at": 1673536166,
    "ts_updated_at": 1743041679,
    "ts_creation_date": 1653693211,
    "ts_modification_date": 1653693211,
    "files": {
        "pdf": "https://archive.orkl.eu/04aae4bc11412d5574e58e1a0c46f6ecb3871a64.pdf",
        "text": "https://archive.orkl.eu/04aae4bc11412d5574e58e1a0c46f6ecb3871a64.txt",
        "img": "https://archive.orkl.eu/04aae4bc11412d5574e58e1a0c46f6ecb3871a64.jpg"
    }
}