{
    "id": "b3cbc52a-31a0-4183-ac15-87b905386375",
    "created_at": "2023-01-12T15:08:16.628383Z",
    "updated_at": "2025-03-27T02:06:02.730064Z",
    "deleted_at": null,
    "sha1_hash": "42c71604787666b749e0fbe74ec336cbe9d5825d",
    "title": "2021-04-26 - Linux Servers Hijacked to Implant SSH Backdoor",
    "authors": "",
    "file_creation_date": "2022-05-28T05:08:20Z",
    "file_modification_date": "2022-05-28T05:08:20Z",
    "file_size": 1499506,
    "plain_text": "# Linux Servers Hijacked to Implant SSH Backdoor\n\n**[blogs.juniper.net/en-us/threat-research/linux-servers-hijacked-to-implant-ssh-backdoor](https://blogs.juniper.net/en-us/threat-research/linux-servers-hijacked-to-implant-ssh-backdoor)**\n\nApril 26, 2021\n\nOn February 1st, Juniper Threat Labs observed an attack that attempted to inject malicious\ncode into [Secure Shell (SSH) servers on Linux. The attack begins with an exploit against the](https://en.wikipedia.org/wiki/Secure_Shell_Protocol)\n[Control Web Panel (CWP, formerly known as Centos Web Panel) server administration web](https://control-webpanel.com/)\n[application, injects code via LD_PRELOAD, and uses a custom, encrypted binary command-](https://jvns.ca/blog/2014/11/27/ld-preload-is-super-fun-and-easy/)\nand-control protocol to exfiltrate credentials and machine capabilities. As of this writing, the\nmalware command-and-control server is still active.\n\nFigure 1. Attack chain\n\n## Exploit\n\n\n-----\n\nThe attack starts with a command injection against Control Web Panel:\n\nFigure 2. HTTP request from initial attack\nCWP has been plagued by security issues, including 37 0-day vulnerabilities disclosed by\nthe Zero Day Initiative in 2020. Among these is a failure to sanitize the service_restart\n[parameter, which follows a similar set of vulnerabilities in 2018.](https://www.exploit-db.com/exploits/45610)\n\nBecause of the number of vulnerabilities in CWP, the intentional encryption and obfuscation\nof their source code [ostensibly for security reasons, and CWP’s failure to respond to ZDI’s](http://forum.centos-webpanel.com/index.php?topic=4130.0)\nrecent disclosures, it is difficult to ascertain which versions of CWP are or remain vulnerable\n[to this attack. In 2020, there were over 215k CWP installations accessible from the open](https://zero.bs/sb-2022-multiple-rce-and-sqli-in-centos-web-panel-cwp.html)\ninternet, so the number of computers compromised in this campaign may be substantial.\n\n## Installation\n\nOn successful exploitation of the web panel, the following commands are executed.\n\nFigure 3. Commands executed via CWP exploit\nFirst, the “sshins” installer binary is retrieved, executed, and deleted. Then the CWP logs are\nwiped of any mention of sshins and the shell history is cleared.\n\n[The sshins binary is a 64-bit Linux ELF executable. It is packed with UPX and the packed file](https://upx.github.io/)\nhas garbage bytes appended to it in an attempt to hinder automated unpacking. It does 3\nthings:\n\n1. Drops a Linux shared library to an architecture-specific location (in this case,\n\n/lib64/libs.so).\n\n\n-----\n\n1. Writes the name of the dropped file to a text file at /etc/ld.so.preload\n\n1. Restarts the OpenSSH service.\n\nFigure 4. Console output from the installer\n\n## Hijacking the OpenSSH server process\n\n### Injecting the malicious code\n\nThe file /etc/ld.so.preload contains a directive to the [dynamic linker telling it to load the](https://man7.org/linux/man-pages/man8/ld.so.8.html)\nspecified shared library first, and to give precedence to the exported functions from the ld[preloaded library. Because the malicious libs.so library exports its own version of the bind()](https://man7.org/linux/man-pages/man2/bind.2.html)\nfunction, applications will use the backdoored version of this function instead of the standard\nimplementation from Linux system libraries.\n\nWhen the Open-SSH server daemon (sshd) restarts, libs.so will first execute an initialization\nfunction as the library is loaded, and then has the ability to inject its own code whenever\nsshd calls bind(). The sshd server processes use this hook in order to periodically beacon to\nthe command-and-control (C2) server and to exfiltrate data, including a listing of system\ninformation such as CPU and OS details, amount of RAM, available disk space, and\nOpenSSH configuration:\n\n\n-----\n\nFigure 5. Strings from the disassembled library indicating data to be exfiltrated.\nIn addition to the continuously-running server processes, sshd [forks() a pair of new](https://man7.org/linux/man-pages/man2/fork.2.html)\nprocesses to handle each login connection. From these session-specific processes, the\nmalicious bind() function launches an additional temporary sshd process that exfiltrates the\nincoming user’s [login credentials.](http://bash.org/?244321)\n\nFigure 6. User credentials and computer identifier exfiltrated by the malware.\n\n### C2 communication\n\nThe C2 communication involves the server 176[.]111.174.26 on port 443. Port 443 is typically\nused for HTTPS but here the traffic is raw TCP, hiding in plain sight on a common port. The\nserver has a Russian IP address that is associated with a Bulgarian webhosting provider.\n\n\n-----\n\nThe client initiates communication with a simple directive, padded out to 8 bytes. (As we ll\ndiscuss below, the malware uses an encryption algorithm with an 8-byte block size, but even\nunencrypted messages are always a multiple of 8 in length.) Following is the first packet sent\nto the server after the TCP handshake, with the 8-byte message highlighted.\n\nFigure 7. Initial TCP packet to C2 server, with payload highlighted.\nThe C2 server replies with the following message (TCP packet omitted for clarity):\n\nFigure 8. Server response.\nThe response consists of a header with the payload length (24 bytes), a command (0x0201),\n[and the CRC32 checksum of the payload. The 24-byte payload is used to encrypt the](https://en.wikipedia.org/wiki/Cyclic_redundancy_check)\nexfiltrated data that is then sent back to the C2 server, as we’ll see in the next section.\n\n### Cryptography\n\nData sent back to the C2 server is encrypted using a variant of the Blowfish encryption\nalgorithm that was used to [secure game assets on the Nintendo and, more recently,](https://www.akkit.org/info/gbatek.htm#dsencryptionbygamecodeidcodekey1)\n[incorporated into a reverse-engineering challenge from Kaspersky Lab. Below is publicly](https://sudonull.com/post/7577-We-solve-crackme-from-Kaspersky-Lab)\navailable encryption code that was reverse-engineered from the DS:\n\n\n-----\n\nFigure 9. Reverse-engineered Nintendo DS encryption routine, from\nhttps://github.com/RocketRobz/NTR_Launcher_3D/blob/master/twlnandside/BootLoader/source/encryption.c.\nThen we have the decompiled encryption routine from the preloaded library:\n\n\n-----\n\nFigure 10. Corresponding encryption routine from the malware.\nNote, in particular, the use of the constants 0x12, 0x112, 0x212, and 0x312, which differs\nfrom the standard Blowfish implementation. (The decompiled code is functionally identical to\n[the Gameboy routine, differing only due to loop-unrolling and other compiler optimizations.)](https://en.wikipedia.org/wiki/Loop_unrolling)\n\n[While the underlying encryption routine is taken directly from publicly available code, the](https://github.com/RocketRobz/NTR_Launcher_3D/blob/master/twlnand-side/BootLoader/source/encryption.c)\nmalware authors incorporate some additional tricks to thwart analysis and decryption. Both\nBlowfish and the Nintendo variant require an [S-box lookup table that remains constant](https://en.wikipedia.org/wiki/S-box)\nthroughout the encryption and decryption processes. But unlike the Nintendo\nimplementation, the malware mutates its S-box prior to use. First, as the table is loaded from\nprogram memory, it is subject to several static transformations that make it harder to\ncorrelate the stored table with the one used for encryption. Then the encryption algorithm is\nrun against portions of its own S-box, transforming it at each step. This process is initialized\nusing part of the 24-byte payload received from the C2 server.\n\nOnce the table has been fixed, the actual encryption begins. The malware improves upon the\nNintendo implementation by adding [cipher-block chaining (CBC). With CBC, each 8-byte](https://en.wikipedia.org/wiki/Block_cipher_mode_of_operation#Cipher_block_chaining_(CBC))\nplaintext block is first XORed against the encrypted output from the previous block, and then\nthat value is encrypted. The result is a chain where the encrypted value of each block\ndepends on the value of the previous block. To start this process, the first block is XORed\n[against an initialization vector (IV). Here, the IV is itself the XOR of the first and last 8 bytes](https://en.wikipedia.org/wiki/Initialization_vector)\nof the payload from the C2 server.\n\n\n-----\n\n[Without CBC, a symmetric encryption algorithm is vulnerable to frequency analysis when the](https://en.wikipedia.org/wiki/Frequency_analysis)\nblock size is small as well as [other attacks in the general case. It appears that the authors of](https://en.wikipedia.org/wiki/Block_cipher_mode_of_operation#ECB)\nthis malware went to a surprising amount of trouble to strengthen the Nintendo DS\nencryption, in stark contrast to the noisy behavior of their sshins installer.\n\n## Conclusion\n\nWithout allowing our compromised test machine to remain connected to the internet and be\nused for malicious purposes, it’s difficult to ascertain the exact motivations of the authors. But\nbecause the malware catalogs detailed system information and credentials but does not\nimmediately begin mining cryptocurrency or amplifying the attack by attempting to spread\nfurther, we suspect that access to the compromised machines will be sold or rented as part\nof a botnet.\n\n## Detection\n\nThe malware and C2 server used in this campaign are detected and blocked by Juniper ATP\nand Juniper ATP Cloud, and the malicious traffic is detected by the IDP rule\nSSL:VULN:CWP-LINUX-C2-BACKDOR.\n\nFigure 11. Detection on Juniper ATP Cloud\n\n## IOCs\n\n176[.]111.174.26  C2 server\n\nab9cc4ee82aa6f57ba2a113aab905c33e278c969399db4188d0ea5942ad3bb7d sshins (as\ndelivered)\n\n936ca431d17d738beab9735a3d6e658ff29f8337f52353fd60e286c94dd2c06b sshins\n(unpacked by UPX, after deleting appended data)\n\nc8df513e9e4848e35af5246a2ba797540b68a9379a1df17e34550cb0258960e8 sshins\n(manually unpacked)\n\nf51e83a53dd3a364709b1d0b93489f7a114b529268c3bab726ed288eba036bca\n/lib64/libs.so\n\n948b6c5fc1ba74ed57388241d1e8656e0ca082d10ff834c628d01c592764926d /lib64/libs.so\n\n56ce53b6c32beacd8864258c81bf276304a8da20bc0011f5e09d37b95a3e5def /lib64/libs.so\n\n\n-----\n\nb5e29bdb105ae0e76d75c3d3959954c4f6610cd39aaa8f3aa852dd624e662480\n/etc/ld.so.preload\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2021/2021-04-26 - Linux Servers Hijacked to Implant SSH Backdoor.pdf"
    ],
    "report_names": [
        "2021-04-26 - Linux Servers Hijacked to Implant SSH Backdoor.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673536096,
    "ts_updated_at": 1743041162,
    "ts_creation_date": 1653714500,
    "ts_modification_date": 1653714500,
    "files": {
        "pdf": "https://archive.orkl.eu/42c71604787666b749e0fbe74ec336cbe9d5825d.pdf",
        "text": "https://archive.orkl.eu/42c71604787666b749e0fbe74ec336cbe9d5825d.txt",
        "img": "https://archive.orkl.eu/42c71604787666b749e0fbe74ec336cbe9d5825d.jpg"
    }
}