{
    "id": "b3d53fd8-216f-406a-a0b1-f9185327e17d",
    "created_at": "2022-10-25T16:48:17.431116Z",
    "updated_at": "2025-03-27T02:16:26.014474Z",
    "deleted_at": null,
    "sha1_hash": "3a2dc9b54f9c5047df5162590c51e51b3392e86c",
    "title": "Poseidon Group",
    "authors": "Kaspersky",
    "file_creation_date": "2016-02-18T20:41:58Z",
    "file_modification_date": "2016-02-18T20:41:58Z",
    "file_size": 183396,
    "plain_text": "# Poseidon Group: a Targeted Attack Boutique specializing in global cyber­espionage\n\n[By GReAT on February 9, 2016. 10:27 am](https://securelist.com/author/great/)\n\nDuring the latter part of 2015, Kaspersky researchers from GReAT (Global Research and Analysis\n\nTeam) got hold of the missing pieces of an intricate puzzle that points to the dawn of the first\n\nPortuguese­speaking targeted attack group, named “Poseidon.” The group’s campaigns appear to\n\nhave been active since at least 2005, while the very first sample found points to 2001. This signals\n\njust how long ago the Poseidon threat actor was already working on its offensive framework.\n\nWhy has the Poseidon threat remained undetected for so many years? In reality, it has not. Most\n\nsamples were detected promptly. However, Poseidon’s practice of being a ‘custom­tailored malware\n\nimplants boutique’ kept security researchers from connecting different campaigns under the umbrella\n\nof a single threat actor. This approach entails crafting campaigns components on­demand and\n\nsometimes fabricating entirely unique malicious artifacts.\n\n1st Portuguese­speaking group #ThePoseidonAPT attacks companies globally #TheSAS2016\n\nOur research team was able to put together the disparate pieces of this puzzle by diligently tracing\n\nthe evolution of Poseidon’s toolkit in pursuit of an overarching understanding of how the actor thinks\n\nand the specific practices involved in infecting and extorting its victims. With a set of tools developed\n\nfor the sole purpose of information gathering and privilege escalation, the sophistication level of\n\ncampaign highlights that, today, regional actors are not far behind better­known players in the global\n\ngame of targeted attacks.\n\nBecoming familiar with the operations of the Poseidon Group meant patiently dismantling their modus\n\noperandi to unearth the custom­designed infection tools deployed to each of their selected targets.\n\nThis process revealed a series of campaigns with highly­regionalized malware practices and\n\ngeographically­skewed victim tasking, unsurprising in a region with a gradually­maturing cybercrime\n\nindustry. The proper detection of each iteration of their evolving toolkit may have been enough to\n\nthwart specific efforts, but to truly understand the magnitude of Poseidon’s combined operations\n\nrequired an archeological effort to match.\n\n## Frequently asked questions\n\n### What exactly is the Poseidon Group?\n\nThe Poseidon Group is a long­running team operating on all domains: land, air, and sea. They are\n\ndedicated to running targeted attacks campaigns to aggressively collect information from company\n\nnetworks through the use of spear­phishing packaged with embedded executable elements inside\n\n\n-----\n\nby a company front to blackmail victim companies into contracting the Poseidon Group as a security\n\nfirm. Even when contracted, the Poseidon Group may continue its infection or initiate another\n\ninfection at a later time, persisting on the network to continue data collection beyond its contractual\n\nobligation. The Poseidon Group has been active, using custom code and evolving their toolkit since\n\nat least 2005. Their tools are consistently designed to function on English and Portuguese systems\n\nspanning the gamut of Windows OS, and their exfiltration methods include the use of hijacked\n\nsatellite connections. Poseidon continues to be active at this time.\n\n### Why do you call it Poseidon’s Targeted Attack Boutique?\n\nThe presence of several text fragments found in the strings section of executable files belonging to\n\nthe campaign reveal the actor’s fondness for Greek mythology, especially regarding Poseidon, the\n\nGod of the Seas (which also coincides with their later abuse of satellite communications meant to\n\nservice ships at sea). The boutique element is reflected in their artisanally adaptive toolkit for lateral\n\nmovement and data collection which appears to change from infection to infection to fit custom­\n\ntailored requirements for each of their prospective clients. The business cycle includes what is\n\neuphemistically referred to as ‘financial forecasting’ using stolen information, so we like to say that\n\nPoseidon’s boutique not only deals in targeted attacks but also stolen treasures.\n\n### How did you become aware of this threat? Who reported it?\n\nWe noticed that several security companies and enthusiasts had unwittingly reported on fragments of\n\nPoseidon’s campaigns over the years. However, nobody noticed that these fragments actually\n\nbelonged to the same threat actor. Perhaps because many of these campaigns were designed to run\n\non specific machines, using English and Portuguese languages, with diverse command and control\n\nservers located in different countries and soon discarded, signing malware with different certificates\n\nissued in the name of rogue companies, and so on. By carefully collecting all the evidence and then\n\nreconstructing the attacker’s timeline, we found that it was actually a single group operating since at\n\nleast 2005, and possible earlier, and still active on the market.\n\nWith this understanding, GReAT researchers were able to recognize similarities in obfuscation and\n\ndevelopment traits leading back to widely­reported but little understood variants on a sample in 2015,\n\nwhich searched for prominent leaders and secret documents involving them.\n\n### When did you discover this targeted attack?\n\nThe very first samples from this campaign were detected by Kaspersky Lab back in the early 2000s.\n\nHowever, as noted previously, it is a very complex task to correlate indicators and evidence in order\n\nto put together all the pieces of this intricate puzzle. By the middle of 2015 it was possible to identify\n\nthat throughout this period of time it’s been the same threat actor, which we call Poseidon Group.\n\n### Who are the victims? / What can you say about the targets of the attacks?\n\n\n-----\n\ngeographical spread of victims is heavily­skewed towards Brazil, the United States, France,\n\nKazakhstan, United Arab Emirates, India and Russia. Many of the victims have joint ventures or\n\npartner operations in Brazil. The importance of the victims is not measured in numbers since each of\n\nthese victims is a large­scale (often multinational) enterprise.\n\n### What exactly is being stolen from the target machines?\n\nOne of the characteristics of the group behind Poseidon is an active exploration of domain­based\n\nnetworks. Such network topology is typical for companies and enterprises.\n\nThe highest value asset for these companies is proprietary information, technologies, and business­\n\nsensitive information that represents significant value in relation to investments and stock valuations.\n\nThe Poseidon Group actively targets this sort of corporate environment for the theft of intellectual\n\nproperty and commercial information, occasionally focusing on personal information on executives.\n\n### How does Poseidon’s APT Boutique infect computers?\n\nThe main infection vector for Poseidon is the use of spear­phishing emails including RTF/DOC files,\n\nusually with a human resources lure. The executables are also often digitally signed and occasionally\n\nhidden in alternate data streams to fool security solutions. Poseidon’s toolkit displays an awareness\n\nof many antivirus providers over the years, attempting to attack or spoof these processes as a means\n\nof self­defense for their infections. Once the infection happens, it reports to the command and control\n\nservers before beginning a complex lateral movement phase. This phase will often leverage a\n\nspecialized tool that automatically collects a wide array of information including credentials, group\n\nmanagement policies, and even system logs to better hone further attacks and assure execution of\n\ntheir malware. This way the attackers actually know what applications and commands they can use\n\nwithout raising an alert to the network administrator during lateral movement and exfiltration.\n\n### What does the Poseidon Group do? What happens after a target machine is infected?\n\nOnce the target’s machine is compromised, the attacker first enumerates all processes running in the\n\nsystem and all services. Then the attacker looks for all administrator accounts on both the local\n\nmachine and the network. This technique allows them to map network resources and make lateral\n\nmovements inside the network, landing in the perfect machine to match the attacker’s interest. This\n\nreflects the Poseidon Group’s familiarity with Windows network administration. In many cases, their\n\nultimate interest is the Domain Controller.\n\nAdditionally malware reports itself to its hardcoded command and control servers and established a\n\nbackdoor connection, so the attacker may have a permanent remote connection.\n\n### What are the malicious tools used by the Poseidon Group? What are their functions?\n\n\n-----\n\nwith code remnants remaining the same to this day, while others have been altered to fit the\n\nrequirements of new operating systems and specific campaigns. A noteworthy addition to the\n\nPoseidon toolkit is the IGT supertool (Information Gathering toolkit), a bulking 15 megabyte\n\nexecutable that orchestrates a series of different information collections steps, exfiltration, and the\n\ncleanup of components. This tool appears to be designed to operate on high­value corporate\n\nsystems like Domain Controllers or IIS servers that act as repositories of valuable information,\n\nparticularly for lateral movement. The Information Gathering Tool (IGT) tool is coded in Delphi and\n\nincludes powershell and SQL components across a dozen different drops. This tool contains several\n\nother executable files made in different programming languages ranging from Visual Basic 6 to C#,\n\neach one performing a very clear task devised by the group when trying to obtain more information\n\nfrom an objective. The main purpose of the IGT tool is to make an inventory of the system, saving\n\ninformation from the network interfaces and addresses, credentials belonging to the Domain and\n\ndatabase server, services being run from the OS and everything that could help the Poseidon Group\n\nmake its attack more customized to its victim.\n\n### Are the attackers using any zero­day vulnerabilities?\n\nNo zero­day vulnerabilities have been found in the analysis of the samples obtained regarding this\n\ncampaign. Poseidon’s conventional means of deceiving users with executable files posing inside\n\nWord and RTF document files, and actual poisoned documents with malicious macro­scripts has\n\nbeen the sole method used for compromising their desired targets. As we have seen in other\n\ntargeted campaigns, social engineering and carefully crafted spear­phishing attacks play a crucial\n\nrole in the effectiveness of getting a foothold in the desired system.\n\n### Is this a Windows­only threat? Which versions of Windows are targeted?\n\nPoseidon is particularly focused on the Microsoft Windows operating system family, specifically\n\ncustomizing the infection method for each one so as to gather different information and hide its\n\npresence after the initial infection. Other products usually found in corporate environments, such as\n\nan SQL server, are being used for lateral movement and credential harvesting using a customized\n\ntoolset designed by the crafty Poseidon Group. Because of Poseidon’s longevity, there are samples\n\ntargeting Windows systems as early as Windows NT 4.0 Server and Windows 95 Workstation up to\n\ncurrent versions like Windows 8.1, as well as server variants (very important to them, given the\n\nemphasis on reaching Domain Controllers in corporate environments.)\n\n### How is this different from any other targeted attack?\n\nThe extortion elements of this campaign are what set it apart from others. The exfiltration of sensitive\n\ndata is done in order to coerce the victim into a business relationship under the threat of exchanging\n\nthis information with competitors or leveraging it as part of the company’s offering of ‘investment\n\nforecasting’. Additionally this is the first ever publicly known Portuguese­speaking targeted attacks\n\ncampaign.\n\n\n-----\n\n### differences in the variants?\n\nPoseidon has maintained a consistently evolving toolkit since the mid­2000s. The malware has not\n\navoided detection but instead been so inconspicuous as to not arouse much suspicion due to the fact\n\nthat this malware only represents the initial phase of the attack. An altogether different component is\n\nleveraged once Poseidon reaches an important machine like an enterprise’s Domain Controller. This\n\nis where the main collection takes place by use of the IGT (Information Gathering Tool) toolkit.\n\n### Is the command and control server used by the Poseidon Group still active? Have you been able to sinkhole any of the command and controls?\n\nPoseidon Group has interesting practices when it comes to its use of command and control servers,\n\nincluding redundancies and quickly discarding command and control (C&Cs) servers after specific\n\ncampaigns. This has actually allowed us to sinkhole several domains. A few of these still had active\n\ninfections attempting to report to the C&Cs. This adds an interesting dimension to the story. As part of\n\nKaspersky Lab’s commitment to securing cyberspace for everyone, we reached out and notified\n\nidentifiable victims, regardless of their security solution and provided them with indicators of\n\ncompromise (IOCs) to help root out the active infection. In the process, we were able to confirm the\n\npreviously described operating procedures for the Poseidon Group.\n\n### Is this a state­sponsored attack? Who is responsible?\n\nWe do not believe this to be a state­sponsored attack but rather a commercial threat player.\n\nCollaboration with information­sharing partners and victim institutions allowed us to become aware of\n\nthe more complicated business cycle involved in this story, greatly adding to our research interest in\n\ntracking these campaigns. The malware is designed to function specifically on English and\n\nPortuguese­language systems. This is the first ever Portuguese­speaking targeted attack campaign.\n\n### How long have the attackers been active?\n\nThe attackers have been active for more than ten years. The main distribution of samples goes back\n\nto 2005 with possible earlier outliers.\n\nOperating systems such as Windows 95 for desktop computers and Windows NT for server editions\n\nwere not uncommon at the time and Poseidon’s team has evolved gradually into targeting the latest\n\nflagship editions of Microsoft’s operating systems. Recent samples show interest in Windows 2012\n\nServer and Windows 8.1.\n\n### Did the attackers use any interesting/advanced technologies?\n\nDuring a particular campaign, conventional Poseidon samples were directed to IPs resolving to\n\nsatellite uplinks. The networks abused were designed for internet communications with ships at sea\n\nwhich span a greater geographical area at nearly global scale, while providing nearly no security for\n\ntheir downlinks\n\n\n-----\n\nleverage to manipulate their victim systems. They combine reconnaissance of GPO (Group Policy\n\nObject management for execution) with digitally­signed malware to avoid detection or blocking during\n\ntheir infection phases. These digital certificates are often issued in the name of rogue and legitimate\n\ncompanies to avoid arousing suspicion from researchers and incident responders.\n\n### Does Kaspersky Lab detect all variants of this malware?\n\nYes, all samples are detected by signatures and also heuristics. With a fully updated Kaspersky Lab\n\nanti­malware solution, all customers are protected now. Kaspersky Lab products detect the malware\n\nused by Poseidon Group with the following detection names:\n\nBackdoor.Win32.Nhopro\n\nHEUR:Backdoor.Win32.Nhopro.gen\n\nHEUR:Hacktool.Win32.Nhopro.gen\n\n### How many victims have you found?\n\nAt least 35 victim companies have been identified with primary targets including financial and\n\ngovernment institutions, telecommunications, manufacturing, energy and other service utility\n\ncompanies, as well as media and public relations firms.\n\nThe archaeological effort of understanding such a long­standing group can severely complicate\n\nvictim identification. We see traces of upwards of a few tens of companies targeted. The exact\n\nnumber of the victims may actually vary. Since it is a very long term group, some victims may be\n\nimpossible to identify now.\n\nAt this time, we are reaching out to victims of active infections to offer remediation assistance, IOCs,\n\nand our full intelligence report to help them counteract this threat. Any victims or potential targets\n\n[concerned about this threat should please contact us at intelreports@kaspersky.com.](mailto:///intelreports@kaspersky.com)\n\n### Who is behind these attacks?\n\nWe do not speculate on attribution. Language code used to compile implants, as well as the\n\nlanguage used to describe certain commands used by the group, actually corresponds to Portuguese\n\nfrom Brazil. The inclusion of Portuguese language strings and preference for Portuguese systems is\n\nprominent throughout the samples.\n\nThe tasking of Poseidon’s campaigns appears to be heavily focused on espionage for commercial\n\ninterests. Speculating further would be unsubstantiated.\n\n### Reference samples hashes:\n\n2ce818518ca5fd03cbacb26173aa60ce\n\nf3499a9d9ce3de5dc10de3d7831d0938\n\n\n-----\n\n4cc1b23daaaac6bf94f99f309854ea10\n\n2c4aeacd3f7b587c599c2c4b5c1475da\n\nf821eb4be9840feaf77983eb7d55e5f6\n\n2ce818518ca5fd03cbacb26173aa60ce\n\n### Command and control servers:\n\nakamaihub[.]com – SINKHOLED by Kaspersky Lab\n\nigdata[.]net – SINKHOLED by Kaspersky Lab\n\nmozillacdn[.]com – SINKHOLED by Kaspersky Lab\n\nmsupdatecdn[.]com – SINKHOLED by Kaspersky Lab\n\nsslverification[.]net – SINKHOLED by Kaspersky Lab\n\n**[For more about counter Poseidon and similar attacks, read this article in the Kaspersky](https://business.kaspersky.com/poseidon-apt/5165/)**\n\n**Business Blog.**\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "d63ae2b7-445f-460d-965d-2676dacdb6de",
            "created_at": "2022-10-25T15:59:19.552139Z",
            "updated_at": "2022-10-25T15:59:19.552139Z",
            "deleted_at": null,
            "name": "APTnotes",
            "url": "https://github.com/aptnotes/data",
            "description": "APTnotes data",
            "reports": null
        }
    ],
    "references": [
        "https://app.box.com/s/94ct7ny9breqnyhdwmcyv982w9qj2rxi"
    ],
    "report_names": [
        "Kaspersky_Poseidon-Group(Feb-09-16)"
    ],
    "threat_actors": [
        {
            "id": "144584b0-60b7-437d-9f90-4d46291b0572",
            "created_at": "2022-10-25T15:50:23.513946Z",
            "updated_at": "2025-03-27T02:00:55.488874Z",
            "deleted_at": null,
            "main_name": "Poseidon Group",
            "aliases": [
                "Poseidon Group"
            ],
            "source_name": "MITRE:Poseidon Group",
            "tools": null,
            "source_id": "MITRE",
            "reports": null
        },
        {
            "id": "4100052f-ccdc-4ee8-b950-434af1c9cef1",
            "created_at": "2022-10-25T16:07:24.07095Z",
            "updated_at": "2025-03-27T02:02:10.098721Z",
            "deleted_at": null,
            "main_name": "Poseidon Group",
            "aliases": [],
            "source_name": "ETDA:Poseidon Group",
            "tools": [
                "IGT supertool",
                "Information Gathering Tool"
            ],
            "source_id": "ETDA",
            "reports": null
        },
        {
            "id": "1c95dd3a-26ea-4ec3-b8a1-831baafe7e8b",
            "created_at": "2023-01-06T13:46:38.466445Z",
            "updated_at": "2025-03-27T02:00:02.840942Z",
            "deleted_at": null,
            "main_name": "Poseidon Group",
            "aliases": [
                "G0033"
            ],
            "source_name": "MISPGALAXY:Poseidon Group",
            "tools": [],
            "source_id": "MISPGALAXY",
            "reports": null
        },
        {
            "id": "75108fc1-7f6a-450e-b024-10284f3f62bb",
            "created_at": "2024-11-01T02:00:52.756877Z",
            "updated_at": "2025-03-27T02:00:55.544216Z",
            "deleted_at": null,
            "main_name": "Play",
            "aliases": null,
            "source_name": "MITRE:Play",
            "tools": [
                "Nltest",
                "AdFind",
                "PsExec",
                "Wevtutil",
                "Cobalt Strike",
                "Playcrypt",
                "Mimikatz"
            ],
            "source_id": "MITRE",
            "reports": null
        }
    ],
    "ts_created_at": 1666716497,
    "ts_updated_at": 1743041786,
    "ts_creation_date": 1455828118,
    "ts_modification_date": 1455828118,
    "files": {
        "pdf": "https://archive.orkl.eu/3a2dc9b54f9c5047df5162590c51e51b3392e86c.pdf",
        "text": "https://archive.orkl.eu/3a2dc9b54f9c5047df5162590c51e51b3392e86c.txt",
        "img": "https://archive.orkl.eu/3a2dc9b54f9c5047df5162590c51e51b3392e86c.jpg"
    }
}