{
    "id": "b3ecf0e8-e02e-41ab-9c63-698982a01e78",
    "created_at": "2023-01-12T15:01:39.452769Z",
    "updated_at": "2025-03-27T02:05:59.90283Z",
    "deleted_at": null,
    "sha1_hash": "eb13975f6c46e8ce4f99ab6c5647047675d079b2",
    "title": "2020-06-23 - Oh, what a boot-iful mornin’ Rovnix bootkit back in business",
    "authors": "",
    "file_creation_date": "2022-05-28T00:27:47Z",
    "file_modification_date": "2022-05-28T00:27:47Z",
    "file_size": 1150941,
    "plain_text": "# Oh, what a boot-iful mornin’\n\n**securelist.com/oh-what-a-boot-iful-mornin/97365**\n\nAuthors\n\n[Alexander Eremin](https://securelist.com/author/alexandereremin/)\n\n## Rovnix bootkit back in business\n\nIn mid-April, our threat monitoring systems detected malicious files being distributed under\nthe name “on the new initiative of the World Bank in connection with the coronavirus\npandemic” (in Russian) with the extension EXE or RAR. Inside the files was the well-known\nRovnix bootkit. There is nothing new about cybercriminals exploiting the coronavirus topic;\nthe novelty is that Rovnix has been updated with a UAC bypass tool and is being used to\ndeliver a loader that is unusual for it. Without further ado, let’s proceed to an analysis of the\nmalware according to the rules of dramatic structure.\n\n## Exposition: enter SFX archive\n\nThe file “on the new initiative of the World Bank in connection with the coronavirus\npandemic.exe” is a self-extracting archive that dishes up easymule.exe and 1211.doc.\n\n\n-----\n\n**_SFX script_**\n\nThe document does indeed contain information about a new initiative of the World Bank, and\nreal individuals related to the organization are cited as the authors in the metadata.\n\n**_Contents of 1211.doc_**\n\nAs for easymule.exe, its resources contain a bitmap image that is actually an executable file,\nwhich it unpacks and loads into memory.\n\n**_Loading the “image”_**\n\n## Hook: enter UAC bypass\n\n\n-----\n\nThe code of the PE loaded into memory contains many sections remarkably similar to the\nknown Rovnix bootkit and its modules, the source code of which leaked back in 2013.\n\n**_Left: source of the malware; right: leaked Rovnix source code (bksetup.c)_**\n\nHowever, the file under analysis reveals innovations clearly added by authors, based on the\noriginal Rovnix source code. One of them is a UAC bypass mechanism that uses the\n“mocking trusted directory” technique.\n\nWith the aid of the Windows API, the malware creates the directory C:\\Windows \\System32\n(with the space after Windows). It then copies there a legitimate signed executable file from\n**C:\\Windows\\System32 that has the right to automatically elevate privileges without**\ndisplaying a UAC request (in this case, wusa.exe).\n\n[DLL hijacking is additionally used: a malicious library is placed in the fake directory under the](https://encyclopedia.kaspersky.com/glossary/dll-hijacking?utm_source=securelist&utm_medium=blog&utm_campaign=termin-explanation)\nname of one of the libraries imported by the legitimate file (in this case, wtsapi32.dll). As a\nresult, when run from the fake directory, the legitimate file wusa.exe (or rather, the path to it)\npasses the authorization check due to the GetLongPathNameW API, which removes the\nspace character from the path. At the same time, the legitimate file is run from the fake\ndirectory without a UAC request and loads a malicious library called wtsapi.dll.\n\nBesides copying the legitimate system file to the fake directory and creating a malicious\nlibrary there, the dropper creates another file named uninstall.pdg. After that, the malware\ncreates and runs a series of BAT files that start wusa.exe from the fake directory and then\nclean up the traces by deleting the created directory and the easymule.exe dropper itself.\n\n## Development: enter Rovnix\n\nThe file uninstall.pdg clearly contains a packed executable file. It is designed to unpack the\nsame malicious library that was previously downloaded using wusa.exe and DLL hijacking.\n\n\n-----\n\n**_Uninstall.pdg_**\n\nThe code of the malicious library is kept minimal: the exported function\nWTSQueryUserToken obviously has no features required by the original wusa.exe, which\nimports it. Instead, the function reads uninstall.pdg, and unpacks and runs the executable\nfrom it.\n\n**_Code of exported malicious library function_**\n\nThe unpacked uninstall.pdg turns out to be a DLL with the exported function BkInstall —\nanother indicator that the malware is based on the leaked Rovnix code. Further analysis of\nthe file confirms this.\n\n\n-----\n\nGlued inside uninstall.pdg are executable files packed with aPLib. The gluing was done\nusing the FJ utility (also from the Rovnix bootkit), as evidenced by the file-unpacking\nalgorithm and the FJ signatures indicating the location of the joint in the file.\n\n**_FJ utility signature_**\n\nThe glued files are the KLoader driver from the leaked Rovnix bootkit and a bootloader.\n**Uninstall.pdg unpacks them, overwrites the VBR with the bootloader, and places the**\npacked original VBR next to it. In addition, KLoader is written to the disk; its purpose is to\ninject the payload into running processes.\n\n**_Left: source code of the malware; right: leaked Rovnix source code (kloader.c)_**\n\nAs seen in the screenshot, the source code of the malware is not much different from the\noriginal. The original code was seemingly compiled for use without a VFS and a protocol\nstack for the driver to operate with the network.\n\nIn this instance, the driver injects a DLL into the processes, which is that same un-Rovnixlike loader that we spoke about at the very beginning.\n\nThus, the general execution scheme looks as follows.\n\n\n-----\n\n**_Execution scheme_**\n\n## Climax: enter loader\n\nLet’s consider the new loader in more detail. The first thing to catch the eye is the PDB path\nin the file.\n\n**_PDB path_**\n\nWhen run, the malware first fills the structure with pointers to functions. The allocated\nmemory is filled with pointers to functions, to be called subsequently by their offset in the\nallocated memory area.\n\n**_Structure with functions_**\n\nNext, the process obtains access to the Winsta0 and Default desktop objects for itself and all\nprocesses created by this process, and creates a thread with the C&C communication cycle.\n\n\n-----\n\n**_Creating a C&C communication thread_**\n\n**_Communication with C&C_**\n\nHaving created the thread, the malware checks its presence in the system using\nOpenMutexA. It then starts a C&C communication cycle, within which a data packet about\nthe infected device is generated. This packet is XOR-encrypted with the single-byte key\n0xF7, and sent to C&C.\n\n\n-----\n\n**_Structure of sent data_**\n\nIn response, the malware receives an executable file that is loaded into memory. Control is\ntransferred to the entry point of this PE file.\n\n**_Displaying the PE file loaded into memory_**\n\n## Denouement: enter testing\n\nThe loader turns out not to be unique: several more instances were discovered during the\nanalysis. They all have similar features, but with slight differences. For example, one of them\nchecks that it is running properly by trying to register a NetService handler. If it fails (that is,\nthe service is not running in the system), the malware stops working.\n\n\n-----\n\n**_Example of a different version of the loader_**\n\nOther instances of the loader do not use the bootkit, but do apply the same UAC bypass\nmethod. All indications are that the loader is currently being actively tested and equipped\nwith various tools to bypass protection.\n\nWe also discovered instances that could serve as a payload for a loader. They contain\nsimilar PDB paths and the same C&Cs as the loaders. Interestingly, the addresses of the\nrequired APIs are got from the function name, which is obtained from the index in the\nconfiguration line.\n\n**_Getting the API addresses_**\n\nAt the command of C&C, this malware can run an EXE file with the specified parameters,\nrecord sound from the microphone and send the audio file to the cybercriminals, turn off or\nrestart the computer, and so on.\n\n\n-----\n\n**_Processing a received command_**\n\nThe module name\n(E:\\LtdProducts\\Project\\newproject\\64bits\\64AllSolutions\\Release\\PcConnect.pdb) suggests\nthat the developers are positioning it as a backdoor, which could additionally have TrojanSpy elements, judging by some configuration lines.\n\n\n-----\n\n**_Configuration snippet; the lines in Chinese mean Current user:, user password:,_**\n**_“***Below are the system account and password [%04d-%02d-%02d_**\n**_%02d:%02d:%02d]***”_**\n\n## Epilogue\n\nOur analysis of malware masquerading as a “new initiative of the World Bank” shows that\neven well-known threats like Rovnix can throw up a couple of surprises when their source\ncode goes public. Freed from the need to develop their own protection-bypassing tools from\nscratch, cybercriminals can pay more attention to the capabilities of their own malware and\nadd extra “goodies” to the source code, such as UAC bypass. Kaspersky products detect this\nthreat and its related modules as Trojan.Win32.Cidox, Trojan.Win32.Generic,\nTrojan.Win32.Hesv, and Trojan.Win32.Inject.\n\n## IOC\n\n[7CFC801458D64EF92E210A41B97993B0](https://opentip.kaspersky.com/7CFC801458D64EF92E210A41B97993B0/)\n[E2A88836459088A1D5293EF9CB4B31B7](https://opentip.kaspersky.com/E2A88836459088A1D5293EF9CB4B31B7/)\n[bamo.ocry[.]com:8433](https://opentip.kaspersky.com/bamo.ocry.com/)\n[45.77.244[.]191:8090](https://opentip.kaspersky.com/45.77.244.191/)\n[45.77.244[.]191:9090](https://opentip.kaspersky.com/45.77.244.191/)\n[45.77.244[.]191:5050](https://opentip.kaspersky.com/45.77.244.191/)\n[45.76.145[.]22:8080](https://opentip.kaspersky.com/45.76.145.22/)\n[149.28.30[.]158:443](https://opentip.kaspersky.com/149.28.30.158/)\n\n[Bootkit](https://securelist.com/tag/bootkit/)\n[DLL hijacking](https://securelist.com/tag/dll-hijacking/)\n[Malware Technologies](https://securelist.com/tag/malware-technologies/)\n[Trojan](https://securelist.com/tag/trojan/)\n\nAuthors\n\n[Alexander Eremin](https://securelist.com/author/alexandereremin/)\n\nOh, what a boot-iful mornin’\n\nYour email address will not be published. Required fields are marked *\n\n\n-----",
    "language": "EN",
    "sources": [
        {
            "id": "4e039bf8-7239-4999-8ec0-eb202d1465af",
            "created_at": "2022-12-04T11:19:36.52593Z",
            "updated_at": "2022-12-04T11:19:36.52593Z",
            "deleted_at": null,
            "name": "ORKL",
            "url": "https://github.com/ORKL/library",
            "description": "ORKL Community Contributed Content",
            "reports": null
        },
        {
            "id": "05d7b179-7656-44d8-a74c-9ab34d3df3a2",
            "created_at": "2023-01-12T14:38:44.599904Z",
            "updated_at": "2023-01-12T14:38:44.599904Z",
            "deleted_at": null,
            "name": "VXUG",
            "url": "https://www.vx-underground.org",
            "description": "vx-underground Papers",
            "reports": null
        }
    ],
    "references": [
        "https://papers.vx-underground.org/papers/Malware Defense/Malware Analysis 2020/2020-06-23 - Oh, what a boot-iful mornin’ Rovnix bootkit back in business.pdf"
    ],
    "report_names": [
        "2020-06-23 - Oh, what a boot-iful mornin’ Rovnix bootkit back in business.pdf"
    ],
    "threat_actors": [],
    "ts_created_at": 1673535699,
    "ts_updated_at": 1743041159,
    "ts_creation_date": 1653697667,
    "ts_modification_date": 1653697667,
    "files": {
        "pdf": "https://archive.orkl.eu/eb13975f6c46e8ce4f99ab6c5647047675d079b2.pdf",
        "text": "https://archive.orkl.eu/eb13975f6c46e8ce4f99ab6c5647047675d079b2.txt",
        "img": "https://archive.orkl.eu/eb13975f6c46e8ce4f99ab6c5647047675d079b2.jpg"
    }
}